{"position": "Acting Assistant Professor", "company": "Stanford University", "profiles": ["Experience Associate Professor, Mechanical Engineering and Chemical Engineering Bucknell University August 2012  – Present (3 years 1 month) Lewisburg, PA Assistant Professor, Mechanical Engineering and Chemical Engineering Bucknell University September 2010  –  August 2012  (2 years) Assistant Professor Santa Clara University 2006  –  August 2010  (4 years) Acting Assistant Professor Stanford University 2005  –  2006  (1 year) Post-Doctoral Research Staff Lawrence Livermore National Laboratory 2003  –  2005  (2 years) Associate Professor, Mechanical Engineering and Chemical Engineering Bucknell University August 2012  – Present (3 years 1 month) Lewisburg, PA Associate Professor, Mechanical Engineering and Chemical Engineering Bucknell University August 2012  – Present (3 years 1 month) Lewisburg, PA Assistant Professor, Mechanical Engineering and Chemical Engineering Bucknell University September 2010  –  August 2012  (2 years) Assistant Professor, Mechanical Engineering and Chemical Engineering Bucknell University September 2010  –  August 2012  (2 years) Assistant Professor Santa Clara University 2006  –  August 2010  (4 years) Assistant Professor Santa Clara University 2006  –  August 2010  (4 years) Acting Assistant Professor Stanford University 2005  –  2006  (1 year) Acting Assistant Professor Stanford University 2005  –  2006  (1 year) Post-Doctoral Research Staff Lawrence Livermore National Laboratory 2003  –  2005  (2 years) Post-Doctoral Research Staff Lawrence Livermore National Laboratory 2003  –  2005  (2 years) Skills Materials Science Mechanical Engineering Chemical Engineering Matlab Labview Finite Element Analysis Solidworks Simulations ANSYS Fluid Mechanics Thermodynamics Heat Transfer Minitab Physics LaTeX Sensors See 1+     See less Skills  Materials Science Mechanical Engineering Chemical Engineering Matlab Labview Finite Element Analysis Solidworks Simulations ANSYS Fluid Mechanics Thermodynamics Heat Transfer Minitab Physics LaTeX Sensors See 1+     See less Materials Science Mechanical Engineering Chemical Engineering Matlab Labview Finite Element Analysis Solidworks Simulations ANSYS Fluid Mechanics Thermodynamics Heat Transfer Minitab Physics LaTeX Sensors See 1+     See less Materials Science Mechanical Engineering Chemical Engineering Matlab Labview Finite Element Analysis Solidworks Simulations ANSYS Fluid Mechanics Thermodynamics Heat Transfer Minitab Physics LaTeX Sensors See 1+     See less Education Stanford University BS, MS, PHD,  Materials Science and Engineering 1994  – 2003 Stanford University BS, MS, PHD,  Materials Science and Engineering 1994  – 2003 Stanford University BS, MS, PHD,  Materials Science and Engineering 1994  – 2003 Stanford University BS, MS, PHD,  Materials Science and Engineering 1994  – 2003 ", "Experience Ørsted Postdoctoral Fellow Technical University of Denmark February 2015  – Present (7 months) Copenhagen Area, Denmark Acting Assistant Professor Stanford University November 2012  –  January 2015  (2 years 3 months) Postdoctoral Scholar Stanford University March 2012  –  November 2012  (9 months) Ørsted Postdoctoral Fellow Technical University of Denmark February 2015  – Present (7 months) Copenhagen Area, Denmark Ørsted Postdoctoral Fellow Technical University of Denmark February 2015  – Present (7 months) Copenhagen Area, Denmark Acting Assistant Professor Stanford University November 2012  –  January 2015  (2 years 3 months) Acting Assistant Professor Stanford University November 2012  –  January 2015  (2 years 3 months) Postdoctoral Scholar Stanford University March 2012  –  November 2012  (9 months) Postdoctoral Scholar Stanford University March 2012  –  November 2012  (9 months) Skills Nanotechnology Materials Science Characterization Nanomaterials Spectroscopy Powder X-ray Diffraction Thin Films Nanofabrication XPS Chemistry Physics AFM Microscopy Confocal Microscopy TEM NMR Nanoparticles Scanning Electron... Biomaterials Experimentation Electron Microscopy See 6+     See less Skills  Nanotechnology Materials Science Characterization Nanomaterials Spectroscopy Powder X-ray Diffraction Thin Films Nanofabrication XPS Chemistry Physics AFM Microscopy Confocal Microscopy TEM NMR Nanoparticles Scanning Electron... Biomaterials Experimentation Electron Microscopy See 6+     See less Nanotechnology Materials Science Characterization Nanomaterials Spectroscopy Powder X-ray Diffraction Thin Films Nanofabrication XPS Chemistry Physics AFM Microscopy Confocal Microscopy TEM NMR Nanoparticles Scanning Electron... Biomaterials Experimentation Electron Microscopy See 6+     See less Nanotechnology Materials Science Characterization Nanomaterials Spectroscopy Powder X-ray Diffraction Thin Films Nanofabrication XPS Chemistry Physics AFM Microscopy Confocal Microscopy TEM NMR Nanoparticles Scanning Electron... Biomaterials Experimentation Electron Microscopy See 6+     See less Education Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2006  – 2012 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2006  – 2008 Purdue University Bachelor's Degree,  Materials Science and Engineering 2001  – 2006 Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2006  – 2012 Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2006  – 2012 Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2006  – 2012 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2006  – 2008 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2006  – 2008 Stanford University Master of Science (M.S.),  Materials Science and Engineering 2006  – 2008 Purdue University Bachelor's Degree,  Materials Science and Engineering 2001  – 2006 Purdue University Bachelor's Degree,  Materials Science and Engineering 2001  – 2006 Purdue University Bachelor's Degree,  Materials Science and Engineering 2001  – 2006 ", "Summary CO2 injection for Enhanced Oil Recovery in mature oil fields, CO2 and rich gas injection in unconventional liquid reservoirs, characterization and Enhanced Oil Recovery in Naturally Fractured reservoirs. \n \nSpecialties: Naturally Fractured Reservoirs \nRock fluid interaction in unconventional liquid reservoirs \nCO2 Injection \nLog analysis \nFormation evaluation \nSimulation \nWater injection Summary CO2 injection for Enhanced Oil Recovery in mature oil fields, CO2 and rich gas injection in unconventional liquid reservoirs, characterization and Enhanced Oil Recovery in Naturally Fractured reservoirs. \n \nSpecialties: Naturally Fractured Reservoirs \nRock fluid interaction in unconventional liquid reservoirs \nCO2 Injection \nLog analysis \nFormation evaluation \nSimulation \nWater injection CO2 injection for Enhanced Oil Recovery in mature oil fields, CO2 and rich gas injection in unconventional liquid reservoirs, characterization and Enhanced Oil Recovery in Naturally Fractured reservoirs. \n \nSpecialties: Naturally Fractured Reservoirs \nRock fluid interaction in unconventional liquid reservoirs \nCO2 Injection \nLog analysis \nFormation evaluation \nSimulation \nWater injection CO2 injection for Enhanced Oil Recovery in mature oil fields, CO2 and rich gas injection in unconventional liquid reservoirs, characterization and Enhanced Oil Recovery in Naturally Fractured reservoirs. \n \nSpecialties: Naturally Fractured Reservoirs \nRock fluid interaction in unconventional liquid reservoirs \nCO2 Injection \nLog analysis \nFormation evaluation \nSimulation \nWater injection Experience Short Course Instructor Network of Excellence in Training (NExT) October 2000  – Present (14 years 11 months) Taught over 100 short courses in: \n \nReservoir Engineering \nFormation Evaluation \nNaturally Fractured Reservoirs \nWaterflooding \nProduction Engineering \nCO2 Enhanced Oil Recovery Associate Professor Texas A&M University May 2000  – Present (15 years 4 months) Technical Specialist Pioneer Natural Resources July 1993  –  March 2012  (18 years 9 months) Reservoir engineer for three summers with PXD in 2005 and 2006 and 2011 although involved in the Spraberry Trend Area since 1993. Analyzed all waterfloods in unitized areas, past and present. Author and Principal Investigator for a Class III DOE pilot in the Spraberry Trend Area. Senior Research Scientist New Mexico Tech August 1993  –  May 2000  (6 years 10 months) Senior Scientist and Head of the Naturally Fractured Reservoir Group. Extensive experience in CO2 injection. Consultant PEMEX March 1996  –  August 1999  (3 years 6 months) Evaluated approximately 25 fields in the South Region of Mexico for PEMEX. These are all naturally fractured carbonates, mainly Cretaceous. These fields were evalauted for water injection or EOR with CO2 injection. Post Doctoral Research Associate & Acting Assistant Professor Stanford University February 1989  –  August 1993  (4 years 7 months) Short Course Instructor Network of Excellence in Training (NExT) October 2000  – Present (14 years 11 months) Taught over 100 short courses in: \n \nReservoir Engineering \nFormation Evaluation \nNaturally Fractured Reservoirs \nWaterflooding \nProduction Engineering \nCO2 Enhanced Oil Recovery Short Course Instructor Network of Excellence in Training (NExT) October 2000  – Present (14 years 11 months) Taught over 100 short courses in: \n \nReservoir Engineering \nFormation Evaluation \nNaturally Fractured Reservoirs \nWaterflooding \nProduction Engineering \nCO2 Enhanced Oil Recovery Associate Professor Texas A&M University May 2000  – Present (15 years 4 months) Associate Professor Texas A&M University May 2000  – Present (15 years 4 months) Technical Specialist Pioneer Natural Resources July 1993  –  March 2012  (18 years 9 months) Reservoir engineer for three summers with PXD in 2005 and 2006 and 2011 although involved in the Spraberry Trend Area since 1993. Analyzed all waterfloods in unitized areas, past and present. Author and Principal Investigator for a Class III DOE pilot in the Spraberry Trend Area. Technical Specialist Pioneer Natural Resources July 1993  –  March 2012  (18 years 9 months) Reservoir engineer for three summers with PXD in 2005 and 2006 and 2011 although involved in the Spraberry Trend Area since 1993. Analyzed all waterfloods in unitized areas, past and present. Author and Principal Investigator for a Class III DOE pilot in the Spraberry Trend Area. Senior Research Scientist New Mexico Tech August 1993  –  May 2000  (6 years 10 months) Senior Scientist and Head of the Naturally Fractured Reservoir Group. Extensive experience in CO2 injection. Senior Research Scientist New Mexico Tech August 1993  –  May 2000  (6 years 10 months) Senior Scientist and Head of the Naturally Fractured Reservoir Group. Extensive experience in CO2 injection. Consultant PEMEX March 1996  –  August 1999  (3 years 6 months) Evaluated approximately 25 fields in the South Region of Mexico for PEMEX. These are all naturally fractured carbonates, mainly Cretaceous. These fields were evalauted for water injection or EOR with CO2 injection. Consultant PEMEX March 1996  –  August 1999  (3 years 6 months) Evaluated approximately 25 fields in the South Region of Mexico for PEMEX. These are all naturally fractured carbonates, mainly Cretaceous. These fields were evalauted for water injection or EOR with CO2 injection. Post Doctoral Research Associate & Acting Assistant Professor Stanford University February 1989  –  August 1993  (4 years 7 months) Post Doctoral Research Associate & Acting Assistant Professor Stanford University February 1989  –  August 1993  (4 years 7 months) Skills Formation Evaluation Simulations Reservoir Engineering Reservoir Simulation Log Analysis Water Injection Characterization Reservoir Management Petroleum Engineering Petroleum Well Testing Petrophysics Modeling Earth Science Geology Stratigraphy Production Engineering Chemical Engineering Fracture EOR Oil/Gas Natural Gas Guest Lecturing Drilling Engineering Drilling Fluids See 11+     See less Skills  Formation Evaluation Simulations Reservoir Engineering Reservoir Simulation Log Analysis Water Injection Characterization Reservoir Management Petroleum Engineering Petroleum Well Testing Petrophysics Modeling Earth Science Geology Stratigraphy Production Engineering Chemical Engineering Fracture EOR Oil/Gas Natural Gas Guest Lecturing Drilling Engineering Drilling Fluids See 11+     See less Formation Evaluation Simulations Reservoir Engineering Reservoir Simulation Log Analysis Water Injection Characterization Reservoir Management Petroleum Engineering Petroleum Well Testing Petrophysics Modeling Earth Science Geology Stratigraphy Production Engineering Chemical Engineering Fracture EOR Oil/Gas Natural Gas Guest Lecturing Drilling Engineering Drilling Fluids See 11+     See less Formation Evaluation Simulations Reservoir Engineering Reservoir Simulation Log Analysis Water Injection Characterization Reservoir Management Petroleum Engineering Petroleum Well Testing Petrophysics Modeling Earth Science Geology Stratigraphy Production Engineering Chemical Engineering Fracture EOR Oil/Gas Natural Gas Guest Lecturing Drilling Engineering Drilling Fluids See 11+     See less Education University of Bristol Ph.D,  Physical Chemistry 1984  – 1988 The University of Texas at Austin BSc,  Chemical Engineering 1980  – 1984 University of Bristol Ph.D,  Physical Chemistry 1984  – 1988 University of Bristol Ph.D,  Physical Chemistry 1984  – 1988 University of Bristol Ph.D,  Physical Chemistry 1984  – 1988 The University of Texas at Austin BSc,  Chemical Engineering 1980  – 1984 The University of Texas at Austin BSc,  Chemical Engineering 1980  – 1984 The University of Texas at Austin BSc,  Chemical Engineering 1980  – 1984 ", "Skills Leadership Software Development Scrum Agile Methodologies Web Services C# Integration Perl Software Design SaaS Software Engineering E-commerce SQL Software Project... Linux Skills  Leadership Software Development Scrum Agile Methodologies Web Services C# Integration Perl Software Design SaaS Software Engineering E-commerce SQL Software Project... Linux Leadership Software Development Scrum Agile Methodologies Web Services C# Integration Perl Software Design SaaS Software Engineering E-commerce SQL Software Project... Linux Leadership Software Development Scrum Agile Methodologies Web Services C# Integration Perl Software Design SaaS Software Engineering E-commerce SQL Software Project... Linux ", "Experience Professor Florida State University August 1983  – Present (32 years 1 month) CEO Sustainable Energy Technologies LLC April 2008  –  January 2013  (4 years 10 months) Acting Assistant Professor Stanford University January 1981  –  August 1983  (2 years 8 months) Teaching and research in Aeroacoustics. Professor Florida State University August 1983  – Present (32 years 1 month) Professor Florida State University August 1983  – Present (32 years 1 month) CEO Sustainable Energy Technologies LLC April 2008  –  January 2013  (4 years 10 months) CEO Sustainable Energy Technologies LLC April 2008  –  January 2013  (4 years 10 months) Acting Assistant Professor Stanford University January 1981  –  August 1983  (2 years 8 months) Teaching and research in Aeroacoustics. Acting Assistant Professor Stanford University January 1981  –  August 1983  (2 years 8 months) Teaching and research in Aeroacoustics. Skills Fluid Mechanics Aerodynamics Research University Teaching Distance Learning Engineering Lecturing Instructional Design Skills  Fluid Mechanics Aerodynamics Research University Teaching Distance Learning Engineering Lecturing Instructional Design Fluid Mechanics Aerodynamics Research University Teaching Distance Learning Engineering Lecturing Instructional Design Fluid Mechanics Aerodynamics Research University Teaching Distance Learning Engineering Lecturing Instructional Design Education Stanford University M.S & Ph.D.,  Aeronautics 1975  – 1979 University of Tennessee-Knoxville Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 1973  – 1975 Madras Instutute of Technology DMIT,  Aeronautics 1970  – 1973 Stanford University M.S & Ph.D.,  Aeronautics 1975  – 1979 Stanford University M.S & Ph.D.,  Aeronautics 1975  – 1979 Stanford University M.S & Ph.D.,  Aeronautics 1975  – 1979 University of Tennessee-Knoxville Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 1973  – 1975 University of Tennessee-Knoxville Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 1973  – 1975 University of Tennessee-Knoxville Master's degree,  Aerospace , Aeronautical and Astronautical Engineering 1973  – 1975 Madras Instutute of Technology DMIT,  Aeronautics 1970  – 1973 Madras Instutute of Technology DMIT,  Aeronautics 1970  – 1973 Madras Instutute of Technology DMIT,  Aeronautics 1970  – 1973 Honors & Awards Additional Honors & Awards NASA Certificate of Recognition for Particle Image Velocimetry development; Career Transition Assistance Program Award from US Office of Naval Research and Eminent Scholar Chair from FSU Foundation. Additional Honors & Awards NASA Certificate of Recognition for Particle Image Velocimetry development; Career Transition Assistance Program Award from US Office of Naval Research and Eminent Scholar Chair from FSU Foundation. Additional Honors & Awards NASA Certificate of Recognition for Particle Image Velocimetry development; Career Transition Assistance Program Award from US Office of Naval Research and Eminent Scholar Chair from FSU Foundation. Additional Honors & Awards NASA Certificate of Recognition for Particle Image Velocimetry development; Career Transition Assistance Program Award from US Office of Naval Research and Eminent Scholar Chair from FSU Foundation. ", "Skills Scientific Computing Numerical Analysis Fortran Applied Mathematics Mathematical Modeling Algorithms High Performance... Linux LaTeX Matlab Numerical Simulation Parallel Computing C++ Data Analysis R Python Simulations Mathematica Statistics See 4+     See less Skills  Scientific Computing Numerical Analysis Fortran Applied Mathematics Mathematical Modeling Algorithms High Performance... Linux LaTeX Matlab Numerical Simulation Parallel Computing C++ Data Analysis R Python Simulations Mathematica Statistics See 4+     See less Scientific Computing Numerical Analysis Fortran Applied Mathematics Mathematical Modeling Algorithms High Performance... Linux LaTeX Matlab Numerical Simulation Parallel Computing C++ Data Analysis R Python Simulations Mathematica Statistics See 4+     See less Scientific Computing Numerical Analysis Fortran Applied Mathematics Mathematical Modeling Algorithms High Performance... Linux LaTeX Matlab Numerical Simulation Parallel Computing C++ Data Analysis R Python Simulations Mathematica Statistics See 4+     See less ", "Summary Professor and Associate Chair: Joint Department of Biomedical Engineering at University of North Carolina at Chapel Hill and North Carolina State University \n \nProfessor: Materials Science and Engineering Department at North Carolina State University \n \nAdjunct Professor: Orthopaedics (UNC-Chapel Hill), Physiology (NC State), Biotechnology (NC State), and Fiber & Polymer Science (NC State). . \n \nFounding Director: Cell Mechanics Laboratory http://cmlnew.bme.unc.edu/ \n \nTissue Engineering and Regenerative Medicine: Expertise in biomimetic material (3D cell culture, novel biomaterials and nanomaterials) and extracellular physical stimuli (physiologic tensile strain, fluid shear, compression, hydrostatic pressure, electric field, etc) to control stem cell fate. Focus on regeneration of musculoskeletal tissues using human adipose derived stem cells. \n \nWound Healing: Development of \"smart\" bandages with controlled release antimicrobial and anti-inflammatory properties to promote wound healing and tissue regeneration while killing and inhibiting growth of bacteria, with emphasis on multi-drug resistant bacteria. Summary Professor and Associate Chair: Joint Department of Biomedical Engineering at University of North Carolina at Chapel Hill and North Carolina State University \n \nProfessor: Materials Science and Engineering Department at North Carolina State University \n \nAdjunct Professor: Orthopaedics (UNC-Chapel Hill), Physiology (NC State), Biotechnology (NC State), and Fiber & Polymer Science (NC State). . \n \nFounding Director: Cell Mechanics Laboratory http://cmlnew.bme.unc.edu/ \n \nTissue Engineering and Regenerative Medicine: Expertise in biomimetic material (3D cell culture, novel biomaterials and nanomaterials) and extracellular physical stimuli (physiologic tensile strain, fluid shear, compression, hydrostatic pressure, electric field, etc) to control stem cell fate. Focus on regeneration of musculoskeletal tissues using human adipose derived stem cells. \n \nWound Healing: Development of \"smart\" bandages with controlled release antimicrobial and anti-inflammatory properties to promote wound healing and tissue regeneration while killing and inhibiting growth of bacteria, with emphasis on multi-drug resistant bacteria. Professor and Associate Chair: Joint Department of Biomedical Engineering at University of North Carolina at Chapel Hill and North Carolina State University \n \nProfessor: Materials Science and Engineering Department at North Carolina State University \n \nAdjunct Professor: Orthopaedics (UNC-Chapel Hill), Physiology (NC State), Biotechnology (NC State), and Fiber & Polymer Science (NC State). . \n \nFounding Director: Cell Mechanics Laboratory http://cmlnew.bme.unc.edu/ \n \nTissue Engineering and Regenerative Medicine: Expertise in biomimetic material (3D cell culture, novel biomaterials and nanomaterials) and extracellular physical stimuli (physiologic tensile strain, fluid shear, compression, hydrostatic pressure, electric field, etc) to control stem cell fate. Focus on regeneration of musculoskeletal tissues using human adipose derived stem cells. \n \nWound Healing: Development of \"smart\" bandages with controlled release antimicrobial and anti-inflammatory properties to promote wound healing and tissue regeneration while killing and inhibiting growth of bacteria, with emphasis on multi-drug resistant bacteria. Professor and Associate Chair: Joint Department of Biomedical Engineering at University of North Carolina at Chapel Hill and North Carolina State University \n \nProfessor: Materials Science and Engineering Department at North Carolina State University \n \nAdjunct Professor: Orthopaedics (UNC-Chapel Hill), Physiology (NC State), Biotechnology (NC State), and Fiber & Polymer Science (NC State). . \n \nFounding Director: Cell Mechanics Laboratory http://cmlnew.bme.unc.edu/ \n \nTissue Engineering and Regenerative Medicine: Expertise in biomimetic material (3D cell culture, novel biomaterials and nanomaterials) and extracellular physical stimuli (physiologic tensile strain, fluid shear, compression, hydrostatic pressure, electric field, etc) to control stem cell fate. Focus on regeneration of musculoskeletal tissues using human adipose derived stem cells. \n \nWound Healing: Development of \"smart\" bandages with controlled release antimicrobial and anti-inflammatory properties to promote wound healing and tissue regeneration while killing and inhibiting growth of bacteria, with emphasis on multi-drug resistant bacteria. Experience Professor and Associate Chair Joint Department of Biomedical Engineering at UNC-Chapel Hill & NC State University May 2014  – Present (1 year 4 months) Professor Materials Science and Engineering Department at NC State University May 2014  – Present (1 year 4 months) Associate Chair Joint Department of Biomedical Engineering at UNC - Chapel Hill and NC State University January 2013  – Present (2 years 8 months) Associate Professor Materials Science and Engineering Department, North Carolina State University June 2010  –  May 2014  (4 years) Associate Professor Joint Department of Biomedical Engineering at UNC-Chapel Hill and NC State University 2009  –  May 2014  (5 years) Assistant Professor Joint Department of Biomedical Engineering at UNC-Chapel Hill and NC State University 2003  –  2009  (6 years) Acting Assistant Professor Stanford University 2002  –  2003  (1 year) Professor and Associate Chair Joint Department of Biomedical Engineering at UNC-Chapel Hill & NC State University May 2014  – Present (1 year 4 months) Professor and Associate Chair Joint Department of Biomedical Engineering at UNC-Chapel Hill & NC State University May 2014  – Present (1 year 4 months) Professor Materials Science and Engineering Department at NC State University May 2014  – Present (1 year 4 months) Professor Materials Science and Engineering Department at NC State University May 2014  – Present (1 year 4 months) Associate Chair Joint Department of Biomedical Engineering at UNC - Chapel Hill and NC State University January 2013  – Present (2 years 8 months) Associate Chair Joint Department of Biomedical Engineering at UNC - Chapel Hill and NC State University January 2013  – Present (2 years 8 months) Associate Professor Materials Science and Engineering Department, North Carolina State University June 2010  –  May 2014  (4 years) Associate Professor Materials Science and Engineering Department, North Carolina State University June 2010  –  May 2014  (4 years) Associate Professor Joint Department of Biomedical Engineering at UNC-Chapel Hill and NC State University 2009  –  May 2014  (5 years) Associate Professor Joint Department of Biomedical Engineering at UNC-Chapel Hill and NC State University 2009  –  May 2014  (5 years) Assistant Professor Joint Department of Biomedical Engineering at UNC-Chapel Hill and NC State University 2003  –  2009  (6 years) Assistant Professor Joint Department of Biomedical Engineering at UNC-Chapel Hill and NC State University 2003  –  2009  (6 years) Acting Assistant Professor Stanford University 2002  –  2003  (1 year) Acting Assistant Professor Stanford University 2002  –  2003  (1 year) Skills Biomaterials Regenerative Medicine Tissue Engineering Stem Cells Biomedical Engineering Medical Devices Wound Healing Biomechanics Biotechnology Tissue Culture Wound Care Mechanical Testing Nanoparticles Orthopedic Nanotechnology Scanning Electron... Experimental Design Materials Science Nanomaterials Bioengineering R&D Characterization Microscopy Laboratory Cell Culture Statistics Science Experimentation Confocal Microscopy Microfluidics Molecular Biology Fluorescence Microscopy Lifesciences Cell Commercialization Drug Delivery Strategic Leadership Educational Leadership Cross-functional Team... Spectroscopy Microfabrication Histology Cell Biology Biochemistry Immunohistochemistry AFM Physiology Polymer Science Fluorescence Mathematical Modeling See 35+     See less Skills  Biomaterials Regenerative Medicine Tissue Engineering Stem Cells Biomedical Engineering Medical Devices Wound Healing Biomechanics Biotechnology Tissue Culture Wound Care Mechanical Testing Nanoparticles Orthopedic Nanotechnology Scanning Electron... Experimental Design Materials Science Nanomaterials Bioengineering R&D Characterization Microscopy Laboratory Cell Culture Statistics Science Experimentation Confocal Microscopy Microfluidics Molecular Biology Fluorescence Microscopy Lifesciences Cell Commercialization Drug Delivery Strategic Leadership Educational Leadership Cross-functional Team... Spectroscopy Microfabrication Histology Cell Biology Biochemistry Immunohistochemistry AFM Physiology Polymer Science Fluorescence Mathematical Modeling See 35+     See less Biomaterials Regenerative Medicine Tissue Engineering Stem Cells Biomedical Engineering Medical Devices Wound Healing Biomechanics Biotechnology Tissue Culture Wound Care Mechanical Testing Nanoparticles Orthopedic Nanotechnology Scanning Electron... Experimental Design Materials Science Nanomaterials Bioengineering R&D Characterization Microscopy Laboratory Cell Culture Statistics Science Experimentation Confocal Microscopy Microfluidics Molecular Biology Fluorescence Microscopy Lifesciences Cell Commercialization Drug Delivery Strategic Leadership Educational Leadership Cross-functional Team... Spectroscopy Microfabrication Histology Cell Biology Biochemistry Immunohistochemistry AFM Physiology Polymer Science Fluorescence Mathematical Modeling See 35+     See less Biomaterials Regenerative Medicine Tissue Engineering Stem Cells Biomedical Engineering Medical Devices Wound Healing Biomechanics Biotechnology Tissue Culture Wound Care Mechanical Testing Nanoparticles Orthopedic Nanotechnology Scanning Electron... Experimental Design Materials Science Nanomaterials Bioengineering R&D Characterization Microscopy Laboratory Cell Culture Statistics Science Experimentation Confocal Microscopy Microfluidics Molecular Biology Fluorescence Microscopy Lifesciences Cell Commercialization Drug Delivery Strategic Leadership Educational Leadership Cross-functional Team... Spectroscopy Microfabrication Histology Cell Biology Biochemistry Immunohistochemistry AFM Physiology Polymer Science Fluorescence Mathematical Modeling See 35+     See less Education Stanford University PhD,  Mechanical Engineering 1997  – 2002 Activities and Societies:  Stanford Association for Women in Science mentor; Palo Alto VA Rehabilitation R&D Student Representative; Associated Students of Stanford University Constitutional Council member; Stanford Graduate Women’s Network Coordinator; Stanford Graduate Student Council representative; TransAccess mentor; California Forum for Diversity in Graduate Education presenter; Expanding Your Horizons Workshop presenter; Partners in Science College Initiative presenter; Stanford Graduate Service Recognition Award Stanford University MS,  Biomechanical Engineering 1995  – 1997 University of California, Davis BS,  Mechanical Engineering 1993  – 1995 Activities and Societies:  President ,  American Society of Mechanical Engineers;\nVice President ,  Society of Women Engineers;\nRecipient ,  President's Undergraduate Fellowship;\nGolden Key National Honor Society; Phi Kappa Phi National Honor Society; Tau Beta Pi National Engineering Honor Society;\nUC Davis Outstanding Senior of the Year Stanford University PhD,  Mechanical Engineering 1997  – 2002 Activities and Societies:  Stanford Association for Women in Science mentor; Palo Alto VA Rehabilitation R&D Student Representative; Associated Students of Stanford University Constitutional Council member; Stanford Graduate Women’s Network Coordinator; Stanford Graduate Student Council representative; TransAccess mentor; California Forum for Diversity in Graduate Education presenter; Expanding Your Horizons Workshop presenter; Partners in Science College Initiative presenter; Stanford Graduate Service Recognition Award Stanford University PhD,  Mechanical Engineering 1997  – 2002 Activities and Societies:  Stanford Association for Women in Science mentor; Palo Alto VA Rehabilitation R&D Student Representative; Associated Students of Stanford University Constitutional Council member; Stanford Graduate Women’s Network Coordinator; Stanford Graduate Student Council representative; TransAccess mentor; California Forum for Diversity in Graduate Education presenter; Expanding Your Horizons Workshop presenter; Partners in Science College Initiative presenter; Stanford Graduate Service Recognition Award Stanford University PhD,  Mechanical Engineering 1997  – 2002 Activities and Societies:  Stanford Association for Women in Science mentor; Palo Alto VA Rehabilitation R&D Student Representative; Associated Students of Stanford University Constitutional Council member; Stanford Graduate Women’s Network Coordinator; Stanford Graduate Student Council representative; TransAccess mentor; California Forum for Diversity in Graduate Education presenter; Expanding Your Horizons Workshop presenter; Partners in Science College Initiative presenter; Stanford Graduate Service Recognition Award Stanford University MS,  Biomechanical Engineering 1995  – 1997 Stanford University MS,  Biomechanical Engineering 1995  – 1997 Stanford University MS,  Biomechanical Engineering 1995  – 1997 University of California, Davis BS,  Mechanical Engineering 1993  – 1995 Activities and Societies:  President ,  American Society of Mechanical Engineers;\nVice President ,  Society of Women Engineers;\nRecipient ,  President's Undergraduate Fellowship;\nGolden Key National Honor Society; Phi Kappa Phi National Honor Society; Tau Beta Pi National Engineering Honor Society;\nUC Davis Outstanding Senior of the Year University of California, Davis BS,  Mechanical Engineering 1993  – 1995 Activities and Societies:  President ,  American Society of Mechanical Engineers;\nVice President ,  Society of Women Engineers;\nRecipient ,  President's Undergraduate Fellowship;\nGolden Key National Honor Society; Phi Kappa Phi National Honor Society; Tau Beta Pi National Engineering Honor Society;\nUC Davis Outstanding Senior of the Year University of California, Davis BS,  Mechanical Engineering 1993  – 1995 Activities and Societies:  President ,  American Society of Mechanical Engineers;\nVice President ,  Society of Women Engineers;\nRecipient ,  President's Undergraduate Fellowship;\nGolden Key National Honor Society; Phi Kappa Phi National Honor Society; Tau Beta Pi National Engineering Honor Society;\nUC Davis Outstanding Senior of the Year Honors & Awards Additional Honors & Awards -NC State University Faculty Scholar Award, 2012 \n-NC State Chancellor Innovation Award, 2011 \n-Stanford University Distinguished Alumni Scholar Award, 2010 \n-UK-US Stem Cell Collaboration Development Award, 2009 \n-Sigma Xi Faculty Research Award, 2009 \n-Ralph E. Powe Junior Faculty Award, 2005 \n-Participant, Science and Engineering Education Scholars Program (19 participants accepted nationwide), 2002 \n-Selected Delegate, Rotary International Group Study Exchange Trip to India (declined), 2001 \n-Jeffrey K. Lyons Award for Outstanding Service to the Stanford Community, 2000 \n-Stanford Graduate Service Recognition Award, 2000 \n-Tau Beta Pi National Engineering Honor Society, 1994 – present \n-UC Davis Outstanding Senior of the Year, 1994 – 1995 \n-President’s Undergraduate Fellowship, 1994 – 1995 \n-Golden Key National Honor Society, 1993 – present  \n-Phi Kappa Phi National Honor Society, 1993 – present Additional Honors & Awards -NC State University Faculty Scholar Award, 2012 \n-NC State Chancellor Innovation Award, 2011 \n-Stanford University Distinguished Alumni Scholar Award, 2010 \n-UK-US Stem Cell Collaboration Development Award, 2009 \n-Sigma Xi Faculty Research Award, 2009 \n-Ralph E. Powe Junior Faculty Award, 2005 \n-Participant, Science and Engineering Education Scholars Program (19 participants accepted nationwide), 2002 \n-Selected Delegate, Rotary International Group Study Exchange Trip to India (declined), 2001 \n-Jeffrey K. Lyons Award for Outstanding Service to the Stanford Community, 2000 \n-Stanford Graduate Service Recognition Award, 2000 \n-Tau Beta Pi National Engineering Honor Society, 1994 – present \n-UC Davis Outstanding Senior of the Year, 1994 – 1995 \n-President’s Undergraduate Fellowship, 1994 – 1995 \n-Golden Key National Honor Society, 1993 – present  \n-Phi Kappa Phi National Honor Society, 1993 – present Additional Honors & Awards -NC State University Faculty Scholar Award, 2012 \n-NC State Chancellor Innovation Award, 2011 \n-Stanford University Distinguished Alumni Scholar Award, 2010 \n-UK-US Stem Cell Collaboration Development Award, 2009 \n-Sigma Xi Faculty Research Award, 2009 \n-Ralph E. Powe Junior Faculty Award, 2005 \n-Participant, Science and Engineering Education Scholars Program (19 participants accepted nationwide), 2002 \n-Selected Delegate, Rotary International Group Study Exchange Trip to India (declined), 2001 \n-Jeffrey K. Lyons Award for Outstanding Service to the Stanford Community, 2000 \n-Stanford Graduate Service Recognition Award, 2000 \n-Tau Beta Pi National Engineering Honor Society, 1994 – present \n-UC Davis Outstanding Senior of the Year, 1994 – 1995 \n-President’s Undergraduate Fellowship, 1994 – 1995 \n-Golden Key National Honor Society, 1993 – present  \n-Phi Kappa Phi National Honor Society, 1993 – present Additional Honors & Awards -NC State University Faculty Scholar Award, 2012 \n-NC State Chancellor Innovation Award, 2011 \n-Stanford University Distinguished Alumni Scholar Award, 2010 \n-UK-US Stem Cell Collaboration Development Award, 2009 \n-Sigma Xi Faculty Research Award, 2009 \n-Ralph E. Powe Junior Faculty Award, 2005 \n-Participant, Science and Engineering Education Scholars Program (19 participants accepted nationwide), 2002 \n-Selected Delegate, Rotary International Group Study Exchange Trip to India (declined), 2001 \n-Jeffrey K. Lyons Award for Outstanding Service to the Stanford Community, 2000 \n-Stanford Graduate Service Recognition Award, 2000 \n-Tau Beta Pi National Engineering Honor Society, 1994 – present \n-UC Davis Outstanding Senior of the Year, 1994 – 1995 \n-President’s Undergraduate Fellowship, 1994 – 1995 \n-Golden Key National Honor Society, 1993 – present  \n-Phi Kappa Phi National Honor Society, 1993 – present ", "Summary Current administrator and part-time faculty member at School of Education, Mills College. Former faculty member at Stanford University with broad experience in academic administration, teaching, student affairs management, and strategic planning.  \n \nAvailable for short-term writing, editing, copy editing projects. \n \nAreas of Interest: Higher education curriculum, international education, gender issues, study abroad. Summary Current administrator and part-time faculty member at School of Education, Mills College. Former faculty member at Stanford University with broad experience in academic administration, teaching, student affairs management, and strategic planning.  \n \nAvailable for short-term writing, editing, copy editing projects. \n \nAreas of Interest: Higher education curriculum, international education, gender issues, study abroad. Current administrator and part-time faculty member at School of Education, Mills College. Former faculty member at Stanford University with broad experience in academic administration, teaching, student affairs management, and strategic planning.  \n \nAvailable for short-term writing, editing, copy editing projects. \n \nAreas of Interest: Higher education curriculum, international education, gender issues, study abroad. Current administrator and part-time faculty member at School of Education, Mills College. Former faculty member at Stanford University with broad experience in academic administration, teaching, student affairs management, and strategic planning.  \n \nAvailable for short-term writing, editing, copy editing projects. \n \nAreas of Interest: Higher education curriculum, international education, gender issues, study abroad. Experience Assistant Dean and Director of Enrollment Mills College June 2007  – Present (8 years 3 months) School of Education, Mills College Oversee all admissions and financial aid policies and processes for the School of Education. Coordinate work of program administrators within the School and with other College departments. Advise strategic planning process with regard to new and developing academic programs in School of Education. Visiting Professor Mills College 2005  – Present (10 years) School of Education Teach part-time in the doctoral program in educational leadership; developed Introduction to Research Design course as foundation course for EdD students. Taught or co-taught courses in research methods, educational policy, ethics, and proposal writing. Consultant Career Ladders Project 2004  –  2006  (2 years) Oakland, CA Drafted and edited research report on community colleges and workforce development strategies Assistant Director, Overseas Studies Stanford University September 2001  –  April 2004  (2 years 8 months) Senior administrator for study abroad program with management responsibility for curriculum planning and implementation; strategic planning; student outreach, retention, and application process, and all student services; consulting to overseas staff in the implementation of all academic issues; design and oversight of internal research function, including survey of students' interests and preferences, enrollment patterns, program evaluations, and other data that inform policies and practices. (Acting) Assistant Professor Stanford University School of Education August 1997  –  June 2001  (3 years 11 months) Responsible for all aspects of the Social Sciences In Education master's program, including admissions, academic advising, and degree progress; taught weekly seminar on research design and methodology; served as resource and advocate for master's students on wide variety of concerns; supervised program assistants; managed budget Consultant East Side Project September 1996  –  June 1997  (10 months) Conducted evaluation study of community service-learning program; interviewed faculty about their experiences in linking students' community service placements with curricular goals; analyzed statistical data from student evaluations Residence Director Barnard College August 1987  –  July 1988  (1 year) Residence Director Wellesley College August 1985  –  July 1987  (2 years) Assistant Director of Admission Occidental College 1980  –  1983  (3 years) Assistant Dean and Director of Enrollment Mills College June 2007  – Present (8 years 3 months) School of Education, Mills College Oversee all admissions and financial aid policies and processes for the School of Education. Coordinate work of program administrators within the School and with other College departments. Advise strategic planning process with regard to new and developing academic programs in School of Education. Assistant Dean and Director of Enrollment Mills College June 2007  – Present (8 years 3 months) School of Education, Mills College Oversee all admissions and financial aid policies and processes for the School of Education. Coordinate work of program administrators within the School and with other College departments. Advise strategic planning process with regard to new and developing academic programs in School of Education. Visiting Professor Mills College 2005  – Present (10 years) School of Education Teach part-time in the doctoral program in educational leadership; developed Introduction to Research Design course as foundation course for EdD students. Taught or co-taught courses in research methods, educational policy, ethics, and proposal writing. Visiting Professor Mills College 2005  – Present (10 years) School of Education Teach part-time in the doctoral program in educational leadership; developed Introduction to Research Design course as foundation course for EdD students. Taught or co-taught courses in research methods, educational policy, ethics, and proposal writing. Consultant Career Ladders Project 2004  –  2006  (2 years) Oakland, CA Drafted and edited research report on community colleges and workforce development strategies Consultant Career Ladders Project 2004  –  2006  (2 years) Oakland, CA Drafted and edited research report on community colleges and workforce development strategies Assistant Director, Overseas Studies Stanford University September 2001  –  April 2004  (2 years 8 months) Senior administrator for study abroad program with management responsibility for curriculum planning and implementation; strategic planning; student outreach, retention, and application process, and all student services; consulting to overseas staff in the implementation of all academic issues; design and oversight of internal research function, including survey of students' interests and preferences, enrollment patterns, program evaluations, and other data that inform policies and practices. Assistant Director, Overseas Studies Stanford University September 2001  –  April 2004  (2 years 8 months) Senior administrator for study abroad program with management responsibility for curriculum planning and implementation; strategic planning; student outreach, retention, and application process, and all student services; consulting to overseas staff in the implementation of all academic issues; design and oversight of internal research function, including survey of students' interests and preferences, enrollment patterns, program evaluations, and other data that inform policies and practices. (Acting) Assistant Professor Stanford University School of Education August 1997  –  June 2001  (3 years 11 months) Responsible for all aspects of the Social Sciences In Education master's program, including admissions, academic advising, and degree progress; taught weekly seminar on research design and methodology; served as resource and advocate for master's students on wide variety of concerns; supervised program assistants; managed budget (Acting) Assistant Professor Stanford University School of Education August 1997  –  June 2001  (3 years 11 months) Responsible for all aspects of the Social Sciences In Education master's program, including admissions, academic advising, and degree progress; taught weekly seminar on research design and methodology; served as resource and advocate for master's students on wide variety of concerns; supervised program assistants; managed budget Consultant East Side Project September 1996  –  June 1997  (10 months) Conducted evaluation study of community service-learning program; interviewed faculty about their experiences in linking students' community service placements with curricular goals; analyzed statistical data from student evaluations Consultant East Side Project September 1996  –  June 1997  (10 months) Conducted evaluation study of community service-learning program; interviewed faculty about their experiences in linking students' community service placements with curricular goals; analyzed statistical data from student evaluations Residence Director Barnard College August 1987  –  July 1988  (1 year) Residence Director Barnard College August 1987  –  July 1988  (1 year) Residence Director Wellesley College August 1985  –  July 1987  (2 years) Residence Director Wellesley College August 1985  –  July 1987  (2 years) Assistant Director of Admission Occidental College 1980  –  1983  (3 years) Assistant Director of Admission Occidental College 1980  –  1983  (3 years) Skills International Education Gender Higher Education Teaching Research Program Administration Graduate Recruitment... Program Development Student Affairs Public Speaking Program Evaluation Academic Advising Curriculum Design Educational Leadership Staff Development Nonprofits Curriculum Development Editing Community Outreach See 4+     See less Skills  International Education Gender Higher Education Teaching Research Program Administration Graduate Recruitment... Program Development Student Affairs Public Speaking Program Evaluation Academic Advising Curriculum Design Educational Leadership Staff Development Nonprofits Curriculum Development Editing Community Outreach See 4+     See less International Education Gender Higher Education Teaching Research Program Administration Graduate Recruitment... Program Development Student Affairs Public Speaking Program Evaluation Academic Advising Curriculum Design Educational Leadership Staff Development Nonprofits Curriculum Development Editing Community Outreach See 4+     See less International Education Gender Higher Education Teaching Research Program Administration Graduate Recruitment... Program Development Student Affairs Public Speaking Program Evaluation Academic Advising Curriculum Design Educational Leadership Staff Development Nonprofits Curriculum Development Editing Community Outreach See 4+     See less Education Stanford University PhD,  Sociology of Higher Education 1989  – 1995 Dissertation: \"Required Knowledge: Incorporating Gender into a Core Curriculum\" Activities and Societies:  Sexual Harassment Advisor\nResource Faculty Committee ,  Program in Feminist Studies\nGraduate Representative ,  Admissions Office Advisory Committee\nStudent Member ,  Women’s Needs Assessment Committee\nInterim Coordinator ,  Graduate Women's Network\nElected Representative ,  Committee of Area Representatives ,  School of Education\nGraduate Representative ,  Feminist Studies Program Committee Harvard University Graduate School of Education Ed.M.,  Higher Education Administration , Planning and Social Policy 1984  – 1985 Activities and Societies:  Co-Chair ,  Ed School Women Occidental College A.B.,  Sociology September 1976  – June 1980 Junior year at Cornell University Stanford University PhD,  Sociology of Higher Education 1989  – 1995 Dissertation: \"Required Knowledge: Incorporating Gender into a Core Curriculum\" Activities and Societies:  Sexual Harassment Advisor\nResource Faculty Committee ,  Program in Feminist Studies\nGraduate Representative ,  Admissions Office Advisory Committee\nStudent Member ,  Women’s Needs Assessment Committee\nInterim Coordinator ,  Graduate Women's Network\nElected Representative ,  Committee of Area Representatives ,  School of Education\nGraduate Representative ,  Feminist Studies Program Committee Stanford University PhD,  Sociology of Higher Education 1989  – 1995 Dissertation: \"Required Knowledge: Incorporating Gender into a Core Curriculum\" Activities and Societies:  Sexual Harassment Advisor\nResource Faculty Committee ,  Program in Feminist Studies\nGraduate Representative ,  Admissions Office Advisory Committee\nStudent Member ,  Women’s Needs Assessment Committee\nInterim Coordinator ,  Graduate Women's Network\nElected Representative ,  Committee of Area Representatives ,  School of Education\nGraduate Representative ,  Feminist Studies Program Committee Stanford University PhD,  Sociology of Higher Education 1989  – 1995 Dissertation: \"Required Knowledge: Incorporating Gender into a Core Curriculum\" Activities and Societies:  Sexual Harassment Advisor\nResource Faculty Committee ,  Program in Feminist Studies\nGraduate Representative ,  Admissions Office Advisory Committee\nStudent Member ,  Women’s Needs Assessment Committee\nInterim Coordinator ,  Graduate Women's Network\nElected Representative ,  Committee of Area Representatives ,  School of Education\nGraduate Representative ,  Feminist Studies Program Committee Harvard University Graduate School of Education Ed.M.,  Higher Education Administration , Planning and Social Policy 1984  – 1985 Activities and Societies:  Co-Chair ,  Ed School Women Harvard University Graduate School of Education Ed.M.,  Higher Education Administration , Planning and Social Policy 1984  – 1985 Activities and Societies:  Co-Chair ,  Ed School Women Harvard University Graduate School of Education Ed.M.,  Higher Education Administration , Planning and Social Policy 1984  – 1985 Activities and Societies:  Co-Chair ,  Ed School Women Occidental College A.B.,  Sociology September 1976  – June 1980 Junior year at Cornell University Occidental College A.B.,  Sociology September 1976  – June 1980 Junior year at Cornell University Occidental College A.B.,  Sociology September 1976  – June 1980 Junior year at Cornell University ", "Experience Senior Lecturer Stanford University May 2015  – Present (4 months) Consultant with the Center for Teaching and Learning Stanford University September 2013  – Present (2 years) Lecturer Stanford University September 2009  –  April 2015  (5 years 8 months) Acting Assistant Professor Stanford University September 2006  –  August 2009  (3 years) Chemical Engineer Merck Research Laboratories August 1999  –  July 2000  (1 year) Senior Lecturer Stanford University May 2015  – Present (4 months) Senior Lecturer Stanford University May 2015  – Present (4 months) Consultant with the Center for Teaching and Learning Stanford University September 2013  – Present (2 years) Consultant with the Center for Teaching and Learning Stanford University September 2013  – Present (2 years) Lecturer Stanford University September 2009  –  April 2015  (5 years 8 months) Lecturer Stanford University September 2009  –  April 2015  (5 years 8 months) Acting Assistant Professor Stanford University September 2006  –  August 2009  (3 years) Acting Assistant Professor Stanford University September 2006  –  August 2009  (3 years) Chemical Engineer Merck Research Laboratories August 1999  –  July 2000  (1 year) Chemical Engineer Merck Research Laboratories August 1999  –  July 2000  (1 year) Skills Materials Science Mentoring Nanotechnology Science AFM Spectroscopy Thin Films Microscopy Matlab Mathematical Modeling Skills  Materials Science Mentoring Nanotechnology Science AFM Spectroscopy Thin Films Microscopy Matlab Mathematical Modeling Materials Science Mentoring Nanotechnology Science AFM Spectroscopy Thin Films Microscopy Matlab Mathematical Modeling Materials Science Mentoring Nanotechnology Science AFM Spectroscopy Thin Films Microscopy Matlab Mathematical Modeling Education Stanford University MS, PhD,  Chemical Engineering 2000  – 2006 Massachusetts Institute of Technology BS,  Chemical Engineering 1995  – 1999 Activities and Societies:  Tau Beta Pi (Engineering Honors Society) Stanford University MS, PhD,  Chemical Engineering 2000  – 2006 Stanford University MS, PhD,  Chemical Engineering 2000  – 2006 Stanford University MS, PhD,  Chemical Engineering 2000  – 2006 Massachusetts Institute of Technology BS,  Chemical Engineering 1995  – 1999 Activities and Societies:  Tau Beta Pi (Engineering Honors Society) Massachusetts Institute of Technology BS,  Chemical Engineering 1995  – 1999 Activities and Societies:  Tau Beta Pi (Engineering Honors Society) Massachusetts Institute of Technology BS,  Chemical Engineering 1995  – 1999 Activities and Societies:  Tau Beta Pi (Engineering Honors Society) ", "Experience Professor Colorado School of Mines August 2006  – Present (9 years 1 month) Acting Assistant Professor Stanford University June 2004  –  July 2006  (2 years 2 months) Professor Colorado School of Mines August 2006  – Present (9 years 1 month) Professor Colorado School of Mines August 2006  – Present (9 years 1 month) Acting Assistant Professor Stanford University June 2004  –  July 2006  (2 years 2 months) Acting Assistant Professor Stanford University June 2004  –  July 2006  (2 years 2 months) Skills Solid State Physics Materials Science Electrochemistry Renewable Energy... Fuel Cells Characterization Nanomaterials Labview Optical Microscopy Catalysis XPS Scanning Electron... Surface Chemistry Physics Thermodynamics Nanotechnology Spectroscopy Powder X-ray Diffraction AFM Mathematica Experimentation Thin Films TEM Nanofabrication See 9+     See less Skills  Solid State Physics Materials Science Electrochemistry Renewable Energy... Fuel Cells Characterization Nanomaterials Labview Optical Microscopy Catalysis XPS Scanning Electron... Surface Chemistry Physics Thermodynamics Nanotechnology Spectroscopy Powder X-ray Diffraction AFM Mathematica Experimentation Thin Films TEM Nanofabrication See 9+     See less Solid State Physics Materials Science Electrochemistry Renewable Energy... Fuel Cells Characterization Nanomaterials Labview Optical Microscopy Catalysis XPS Scanning Electron... Surface Chemistry Physics Thermodynamics Nanotechnology Spectroscopy Powder X-ray Diffraction AFM Mathematica Experimentation Thin Films TEM Nanofabrication See 9+     See less Solid State Physics Materials Science Electrochemistry Renewable Energy... Fuel Cells Characterization Nanomaterials Labview Optical Microscopy Catalysis XPS Scanning Electron... Surface Chemistry Physics Thermodynamics Nanotechnology Spectroscopy Powder X-ray Diffraction AFM Mathematica Experimentation Thin Films TEM Nanofabrication See 9+     See less Education Stanford University PhD,  Materials Science 1999  – 2006 Colorado School of Mines B.S.,  Metallurgical and Materials Engineering 1996  – 1999 Stanford University PhD,  Materials Science 1999  – 2006 Stanford University PhD,  Materials Science 1999  – 2006 Stanford University PhD,  Materials Science 1999  – 2006 Colorado School of Mines B.S.,  Metallurgical and Materials Engineering 1996  – 1999 Colorado School of Mines B.S.,  Metallurgical and Materials Engineering 1996  – 1999 Colorado School of Mines B.S.,  Metallurgical and Materials Engineering 1996  – 1999 ", "Languages Indonesian, Spanish, German, Japanese Indonesian, Spanish, German, Japanese Indonesian, Spanish, German, Japanese Skills Public Speaking Community Outreach Nonprofits Grant Writing Research Teaching Program Development Higher Education Curriculum Design Curriculum Development Qualitative Research University Teaching Program Evaluation Skills  Public Speaking Community Outreach Nonprofits Grant Writing Research Teaching Program Development Higher Education Curriculum Design Curriculum Development Qualitative Research University Teaching Program Evaluation Public Speaking Community Outreach Nonprofits Grant Writing Research Teaching Program Development Higher Education Curriculum Design Curriculum Development Qualitative Research University Teaching Program Evaluation Public Speaking Community Outreach Nonprofits Grant Writing Research Teaching Program Development Higher Education Curriculum Design Curriculum Development Qualitative Research University Teaching Program Evaluation ", "Experience Associate Professor University of Minnesota January 2009  – Present (6 years 8 months) Acting Assistant Professor Stanford University 2006  –  2008  (2 years) Associate Professor University of Minnesota January 2009  – Present (6 years 8 months) Associate Professor University of Minnesota January 2009  – Present (6 years 8 months) Acting Assistant Professor Stanford University 2006  –  2008  (2 years) Acting Assistant Professor Stanford University 2006  –  2008  (2 years) Skills Writing Teaching Research Art History Skills  Writing Teaching Research Art History Writing Teaching Research Art History Writing Teaching Research Art History Education UCLA Ph.D., M.A.,  Art History 1997  – 2005 University of Arizona B.A.,  Art History 1994  – 1997 UCLA Ph.D., M.A.,  Art History 1997  – 2005 UCLA Ph.D., M.A.,  Art History 1997  – 2005 UCLA Ph.D., M.A.,  Art History 1997  – 2005 University of Arizona B.A.,  Art History 1994  – 1997 University of Arizona B.A.,  Art History 1994  – 1997 University of Arizona B.A.,  Art History 1994  – 1997 ", "Experience Director & Associate Professor, Master of Arts in Organizational Leadership Program (MAOL) St. Catherine University August 2006  – Present (9 years 1 month) Greater Minneapolis-St. Paul Area Direct interdisciplinary masters-level program in organizational leadership enrolling 200 students with 30 faculty. Direct the Paul D. Coverdell Peace Corps Fellows program at St. Catherine University. Solicit and administer foundation grants in support of intercultural leadership development. Conduct research on women's corporate leadership. Co-author of the annual Minnesota Census of Women in Corporate Leadership. Teach capstone graduate research courses. Serve on breadth of university committees. www.stkate.edu/academic/maol Assistant Professor St. Catherine University June 1995  –  June 2011  (16 years 1 month) Greater Minneapolis-St. Paul Area Assistant Professor of Education and Organizational Leadership. www.stkate.edu Adjunct Lecturer, Education College of St. Catherine September 1990  –  June 1995  (4 years 10 months) Greater Minneapolis-St. Paul Area Acting Assistant Professor Stanford University August 1987  –  June 1989  (1 year 11 months) San Francisco Bay Area Acting Assistant Professor in the Stanford School of Education. ed.stanford.edu Director & Associate Professor, Master of Arts in Organizational Leadership Program (MAOL) St. Catherine University August 2006  – Present (9 years 1 month) Greater Minneapolis-St. Paul Area Direct interdisciplinary masters-level program in organizational leadership enrolling 200 students with 30 faculty. Direct the Paul D. Coverdell Peace Corps Fellows program at St. Catherine University. Solicit and administer foundation grants in support of intercultural leadership development. Conduct research on women's corporate leadership. Co-author of the annual Minnesota Census of Women in Corporate Leadership. Teach capstone graduate research courses. Serve on breadth of university committees. www.stkate.edu/academic/maol Director & Associate Professor, Master of Arts in Organizational Leadership Program (MAOL) St. Catherine University August 2006  – Present (9 years 1 month) Greater Minneapolis-St. Paul Area Direct interdisciplinary masters-level program in organizational leadership enrolling 200 students with 30 faculty. Direct the Paul D. Coverdell Peace Corps Fellows program at St. Catherine University. Solicit and administer foundation grants in support of intercultural leadership development. Conduct research on women's corporate leadership. Co-author of the annual Minnesota Census of Women in Corporate Leadership. Teach capstone graduate research courses. Serve on breadth of university committees. www.stkate.edu/academic/maol Assistant Professor St. Catherine University June 1995  –  June 2011  (16 years 1 month) Greater Minneapolis-St. Paul Area Assistant Professor of Education and Organizational Leadership. www.stkate.edu Assistant Professor St. Catherine University June 1995  –  June 2011  (16 years 1 month) Greater Minneapolis-St. Paul Area Assistant Professor of Education and Organizational Leadership. www.stkate.edu Adjunct Lecturer, Education College of St. Catherine September 1990  –  June 1995  (4 years 10 months) Greater Minneapolis-St. Paul Area Adjunct Lecturer, Education College of St. Catherine September 1990  –  June 1995  (4 years 10 months) Greater Minneapolis-St. Paul Area Acting Assistant Professor Stanford University August 1987  –  June 1989  (1 year 11 months) San Francisco Bay Area Acting Assistant Professor in the Stanford School of Education. ed.stanford.edu Acting Assistant Professor Stanford University August 1987  –  June 1989  (1 year 11 months) San Francisco Bay Area Acting Assistant Professor in the Stanford School of Education. ed.stanford.edu Languages   Skills Leadership Development Teaching Non-profits Higher Education Public Speaking Leadership Research Program Development Intercultural Skills Academic Administration Foundations Non-profit Board... Grants Advocacy Student Development Nonprofits Instructional Design Student Affairs Management Training E-Learning Curriculum Design Adult Education Staff Development Curriculum Development See 10+     See less Skills  Leadership Development Teaching Non-profits Higher Education Public Speaking Leadership Research Program Development Intercultural Skills Academic Administration Foundations Non-profit Board... Grants Advocacy Student Development Nonprofits Instructional Design Student Affairs Management Training E-Learning Curriculum Design Adult Education Staff Development Curriculum Development See 10+     See less Leadership Development Teaching Non-profits Higher Education Public Speaking Leadership Research Program Development Intercultural Skills Academic Administration Foundations Non-profit Board... Grants Advocacy Student Development Nonprofits Instructional Design Student Affairs Management Training E-Learning Curriculum Design Adult Education Staff Development Curriculum Development See 10+     See less Leadership Development Teaching Non-profits Higher Education Public Speaking Leadership Research Program Development Intercultural Skills Academic Administration Foundations Non-profit Board... Grants Advocacy Student Development Nonprofits Instructional Design Student Affairs Management Training E-Learning Curriculum Design Adult Education Staff Development Curriculum Development See 10+     See less Education Stanford University Ph.D.,  Education 1983  – 1988 Concentration in Design and Evaluation of Educational Programs. Anthropology minor. Advisor - Dr. Elliott Eisner. Brown University Master of Arts in Teaching (MAT),  English and Education 1979  – 1980 Wellesley College B.A.,  English 1975  – 1979 Junior year - Trevelyan College, Durham University, Durham, England. Activities and Societies:  Tau Zeta Epsilon. President ,  Canterbury Club. Stanford University Ph.D.,  Education 1983  – 1988 Concentration in Design and Evaluation of Educational Programs. Anthropology minor. Advisor - Dr. Elliott Eisner. Stanford University Ph.D.,  Education 1983  – 1988 Concentration in Design and Evaluation of Educational Programs. Anthropology minor. Advisor - Dr. Elliott Eisner. Stanford University Ph.D.,  Education 1983  – 1988 Concentration in Design and Evaluation of Educational Programs. Anthropology minor. Advisor - Dr. Elliott Eisner. Brown University Master of Arts in Teaching (MAT),  English and Education 1979  – 1980 Brown University Master of Arts in Teaching (MAT),  English and Education 1979  – 1980 Brown University Master of Arts in Teaching (MAT),  English and Education 1979  – 1980 Wellesley College B.A.,  English 1975  – 1979 Junior year - Trevelyan College, Durham University, Durham, England. Activities and Societies:  Tau Zeta Epsilon. President ,  Canterbury Club. Wellesley College B.A.,  English 1975  – 1979 Junior year - Trevelyan College, Durham University, Durham, England. Activities and Societies:  Tau Zeta Epsilon. President ,  Canterbury Club. Wellesley College B.A.,  English 1975  – 1979 Junior year - Trevelyan College, Durham University, Durham, England. Activities and Societies:  Tau Zeta Epsilon. President ,  Canterbury Club. Honors & Awards ", "Summary Expertise: \nTranslational medicine \nComputational biomarker discovery \nSignaling pathway analysis \nBioinformatics \nComputational biology \nHigh throughput data analysis Summary Expertise: \nTranslational medicine \nComputational biomarker discovery \nSignaling pathway analysis \nBioinformatics \nComputational biology \nHigh throughput data analysis Expertise: \nTranslational medicine \nComputational biomarker discovery \nSignaling pathway analysis \nBioinformatics \nComputational biology \nHigh throughput data analysis Expertise: \nTranslational medicine \nComputational biomarker discovery \nSignaling pathway analysis \nBioinformatics \nComputational biology \nHigh throughput data analysis Experience Acting Assistant Professor Stanford University April 2013  – Present (2 years 5 months) Stanford Research Associate Stanford University December 2010  – Present (4 years 9 months) As a postdoc and a research associate at Stanford University, I have developed novel methods for high throughput data analysis. I have created a computational framework for integration of omics data sets. I have applied this framework for (1) biomarker discovery in transplant and cancer, (2) novel gene involved in carcinogenesis in lung, and (3) re-purposing FDA-approved drugs. Postdoctoral fellow Stanford University - Biomedical Informatics Research 2008  –  May 2012  (4 years) Postdoctoral Fellow Wayne State University 2006  –  2008  (2 years) Graduate Research Assistant Wayne State University 2000  –  2006  (6 years) Acting Assistant Professor Stanford University April 2013  – Present (2 years 5 months) Stanford Acting Assistant Professor Stanford University April 2013  – Present (2 years 5 months) Stanford Research Associate Stanford University December 2010  – Present (4 years 9 months) As a postdoc and a research associate at Stanford University, I have developed novel methods for high throughput data analysis. I have created a computational framework for integration of omics data sets. I have applied this framework for (1) biomarker discovery in transplant and cancer, (2) novel gene involved in carcinogenesis in lung, and (3) re-purposing FDA-approved drugs. Research Associate Stanford University December 2010  – Present (4 years 9 months) As a postdoc and a research associate at Stanford University, I have developed novel methods for high throughput data analysis. I have created a computational framework for integration of omics data sets. I have applied this framework for (1) biomarker discovery in transplant and cancer, (2) novel gene involved in carcinogenesis in lung, and (3) re-purposing FDA-approved drugs. Postdoctoral fellow Stanford University - Biomedical Informatics Research 2008  –  May 2012  (4 years) Postdoctoral fellow Stanford University - Biomedical Informatics Research 2008  –  May 2012  (4 years) Postdoctoral Fellow Wayne State University 2006  –  2008  (2 years) Postdoctoral Fellow Wayne State University 2006  –  2008  (2 years) Graduate Research Assistant Wayne State University 2000  –  2006  (6 years) Graduate Research Assistant Wayne State University 2000  –  2006  (6 years) Skills Computational Biology Systems Biology Bioinformatics Genomics Proteomics Machine Learning Genetics R Microarray Analysis Sequence Analysis Data Mining Statistics Drug Discovery Translational Medicine Project Management Biomarker Discovery Biostatistics Data Analysis Gene Expression Algorithms Scientific Computing Pattern Recognition Molecular Biology Science Lifesciences See 10+     See less Skills  Computational Biology Systems Biology Bioinformatics Genomics Proteomics Machine Learning Genetics R Microarray Analysis Sequence Analysis Data Mining Statistics Drug Discovery Translational Medicine Project Management Biomarker Discovery Biostatistics Data Analysis Gene Expression Algorithms Scientific Computing Pattern Recognition Molecular Biology Science Lifesciences See 10+     See less Computational Biology Systems Biology Bioinformatics Genomics Proteomics Machine Learning Genetics R Microarray Analysis Sequence Analysis Data Mining Statistics Drug Discovery Translational Medicine Project Management Biomarker Discovery Biostatistics Data Analysis Gene Expression Algorithms Scientific Computing Pattern Recognition Molecular Biology Science Lifesciences See 10+     See less Computational Biology Systems Biology Bioinformatics Genomics Proteomics Machine Learning Genetics R Microarray Analysis Sequence Analysis Data Mining Statistics Drug Discovery Translational Medicine Project Management Biomarker Discovery Biostatistics Data Analysis Gene Expression Algorithms Scientific Computing Pattern Recognition Molecular Biology Science Lifesciences See 10+     See less Education Wayne State University Ph.D.,  Computer Science (Bioinformatics) 2002  – 2006 Wayne State University M.S.,  Computer Science (Bioinformatics) 1999  – 2002 Sardar Patel University B.Eng.,  Electronics 1994  – 1998 Wayne State University Ph.D.,  Computer Science (Bioinformatics) 2002  – 2006 Wayne State University Ph.D.,  Computer Science (Bioinformatics) 2002  – 2006 Wayne State University Ph.D.,  Computer Science (Bioinformatics) 2002  – 2006 Wayne State University M.S.,  Computer Science (Bioinformatics) 1999  – 2002 Wayne State University M.S.,  Computer Science (Bioinformatics) 1999  – 2002 Wayne State University M.S.,  Computer Science (Bioinformatics) 1999  – 2002 Sardar Patel University B.Eng.,  Electronics 1994  – 1998 Sardar Patel University B.Eng.,  Electronics 1994  – 1998 Sardar Patel University B.Eng.,  Electronics 1994  – 1998 ", "Experience Dickason Professor in the Humanities and Professor of Classics and History Stanford University January 2003  – Present (12 years 8 months) Stanford, CA Global Professor NYU AD January 2011  –  June 2011  (6 months) Abu Dhabi Visiting Professor Columbia University July 2010  –  December 2010  (6 months) Visiting Assistant Professor University of Chicago July 2000  –  December 2002  (2 years 6 months) Greater Chicago Area Acting Assistant Professor Stanford University September 1999  –  August 2000  (1 year) Moses and Mary Finley Research Fellow in Ancient HIstory University of Cambridge January 1996  –  September 1999  (3 years 9 months) Cambridge, United Kingdom Dickason Professor in the Humanities and Professor of Classics and History Stanford University January 2003  – Present (12 years 8 months) Stanford, CA Dickason Professor in the Humanities and Professor of Classics and History Stanford University January 2003  – Present (12 years 8 months) Stanford, CA Global Professor NYU AD January 2011  –  June 2011  (6 months) Abu Dhabi Global Professor NYU AD January 2011  –  June 2011  (6 months) Abu Dhabi Visiting Professor Columbia University July 2010  –  December 2010  (6 months) Visiting Professor Columbia University July 2010  –  December 2010  (6 months) Visiting Assistant Professor University of Chicago July 2000  –  December 2002  (2 years 6 months) Greater Chicago Area Visiting Assistant Professor University of Chicago July 2000  –  December 2002  (2 years 6 months) Greater Chicago Area Acting Assistant Professor Stanford University September 1999  –  August 2000  (1 year) Acting Assistant Professor Stanford University September 1999  –  August 2000  (1 year) Moses and Mary Finley Research Fellow in Ancient HIstory University of Cambridge January 1996  –  September 1999  (3 years 9 months) Cambridge, United Kingdom Moses and Mary Finley Research Fellow in Ancient HIstory University of Cambridge January 1996  –  September 1999  (3 years 9 months) Cambridge, United Kingdom Education University of Vienna Doctor of Philosophy (PhD),  Ancient History 1984  – 1993 University of Graz Habilitation,  Ancient History 1998 University of Vienna Doctor of Philosophy (PhD),  Ancient History 1984  – 1993 University of Vienna Doctor of Philosophy (PhD),  Ancient History 1984  – 1993 University of Vienna Doctor of Philosophy (PhD),  Ancient History 1984  – 1993 University of Graz Habilitation,  Ancient History 1998 University of Graz Habilitation,  Ancient History 1998 University of Graz Habilitation,  Ancient History 1998 Honors & Awards Additional Honors & Awards Who's Who in America 2010 Additional Honors & Awards Who's Who in America 2010 Additional Honors & Awards Who's Who in America 2010 Additional Honors & Awards Who's Who in America 2010 ", "Experience Director of Integration ENOVIX Corp. January 2014  – Present (1 year 8 months) Principal Member of Technical Staff Reel Solar November 2011  –  January 2014  (2 years 3 months) San Jose, CA Director of Device Integration Solyndra September 2007  –  October 2011  (4 years 2 months) Technical Manager Texas Instruments July 2006  –  August 2007  (1 year 2 months) Manager of Device Design Reflectivity March 2002  –  July 2006  (4 years 5 months) Acting Assistant Professor Stanford University January 1999  –  March 2002  (3 years 3 months) Director of Integration ENOVIX Corp. January 2014  – Present (1 year 8 months) Director of Integration ENOVIX Corp. January 2014  – Present (1 year 8 months) Principal Member of Technical Staff Reel Solar November 2011  –  January 2014  (2 years 3 months) San Jose, CA Principal Member of Technical Staff Reel Solar November 2011  –  January 2014  (2 years 3 months) San Jose, CA Director of Device Integration Solyndra September 2007  –  October 2011  (4 years 2 months) Director of Device Integration Solyndra September 2007  –  October 2011  (4 years 2 months) Technical Manager Texas Instruments July 2006  –  August 2007  (1 year 2 months) Technical Manager Texas Instruments July 2006  –  August 2007  (1 year 2 months) Manager of Device Design Reflectivity March 2002  –  July 2006  (4 years 5 months) Manager of Device Design Reflectivity March 2002  –  July 2006  (4 years 5 months) Acting Assistant Professor Stanford University January 1999  –  March 2002  (3 years 3 months) Acting Assistant Professor Stanford University January 1999  –  March 2002  (3 years 3 months) Skills Semiconductors Thin Films Design of Experiments Characterization Failure Analysis Metrology MEMS R&D Solar Energy Photovoltaics JMP Materials Science SPC Product Development CVD Product Management Python Data Analysis SQL FEM analysis Mechanical Properties See 6+     See less Skills  Semiconductors Thin Films Design of Experiments Characterization Failure Analysis Metrology MEMS R&D Solar Energy Photovoltaics JMP Materials Science SPC Product Development CVD Product Management Python Data Analysis SQL FEM analysis Mechanical Properties See 6+     See less Semiconductors Thin Films Design of Experiments Characterization Failure Analysis Metrology MEMS R&D Solar Energy Photovoltaics JMP Materials Science SPC Product Development CVD Product Management Python Data Analysis SQL FEM analysis Mechanical Properties See 6+     See less Semiconductors Thin Films Design of Experiments Characterization Failure Analysis Metrology MEMS R&D Solar Energy Photovoltaics JMP Materials Science SPC Product Development CVD Product Management Python Data Analysis SQL FEM analysis Mechanical Properties See 6+     See less Education Stanford University Ph.D.,  Materials Science and Engineering 1993  – 1998 Massachusetts Institute of Technology S.B.,  Physics 1989  – 1993 Stanford University Ph.D.,  Materials Science and Engineering 1993  – 1998 Stanford University Ph.D.,  Materials Science and Engineering 1993  – 1998 Stanford University Ph.D.,  Materials Science and Engineering 1993  – 1998 Massachusetts Institute of Technology S.B.,  Physics 1989  – 1993 Massachusetts Institute of Technology S.B.,  Physics 1989  – 1993 Massachusetts Institute of Technology S.B.,  Physics 1989  – 1993 ", "Summary Proven track record analyzing complex policy issues and writing for diverse audiences. Significant experience and success as a public speaker to both large and small groups. Summary Proven track record analyzing complex policy issues and writing for diverse audiences. Significant experience and success as a public speaker to both large and small groups. Proven track record analyzing complex policy issues and writing for diverse audiences. Significant experience and success as a public speaker to both large and small groups. Proven track record analyzing complex policy issues and writing for diverse audiences. Significant experience and success as a public speaker to both large and small groups. Experience Acting Assistant Professor Stanford University September 2013  – Present (2 years) Stanford, CA Teaching undergraduate and graduate courses in American and Atlantic History \nConducting research on early North America and the Atlantic world Acting Assistant Professor Stanford University September 2013  – Present (2 years) Stanford, CA Teaching undergraduate and graduate courses in American and Atlantic History \nConducting research on early North America and the Atlantic world Acting Assistant Professor Stanford University September 2013  – Present (2 years) Stanford, CA Teaching undergraduate and graduate courses in American and Atlantic History \nConducting research on early North America and the Atlantic world Languages English Full professional proficiency French Full professional proficiency Spanish Elementary proficiency English Full professional proficiency French Full professional proficiency Spanish Elementary proficiency English Full professional proficiency French Full professional proficiency Spanish Elementary proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Research Politics Public Speaking Teaching Editing Qualitative Research Social Media Writing Data Analysis Microsoft Office Skills  Research Politics Public Speaking Teaching Editing Qualitative Research Social Media Writing Data Analysis Microsoft Office Research Politics Public Speaking Teaching Editing Qualitative Research Social Media Writing Data Analysis Microsoft Office Research Politics Public Speaking Teaching Editing Qualitative Research Social Media Writing Data Analysis Microsoft Office Education Yale University Doctor of Philosophy (Ph.D.),  History 2008  – 2013 My Dissertation Taxing Empire: Political Economy and the Ideological Origins of the American Revolution, 1747-1776 uses the British Empire's fierce debate over political economy to tell a new story about the coming of American independence. The project argues that the severing of imperial ties was the outcome of a struggle over whether Britain's American colonies ought to be made economically and politically subordinate to the mother country through new forms of taxation and uses those debates to argue that America's revolutionaries were not libertarians. University of Cambridge Master's Degree,  Intellectual History and Political Thought 2005  – 2006 Pomona College BA,  History 2001  – 2005 Activities and Societies:  Student Newspaper Managing Editor ,  Tech Support Team Yale University Doctor of Philosophy (Ph.D.),  History 2008  – 2013 My Dissertation Taxing Empire: Political Economy and the Ideological Origins of the American Revolution, 1747-1776 uses the British Empire's fierce debate over political economy to tell a new story about the coming of American independence. The project argues that the severing of imperial ties was the outcome of a struggle over whether Britain's American colonies ought to be made economically and politically subordinate to the mother country through new forms of taxation and uses those debates to argue that America's revolutionaries were not libertarians. Yale University Doctor of Philosophy (Ph.D.),  History 2008  – 2013 My Dissertation Taxing Empire: Political Economy and the Ideological Origins of the American Revolution, 1747-1776 uses the British Empire's fierce debate over political economy to tell a new story about the coming of American independence. The project argues that the severing of imperial ties was the outcome of a struggle over whether Britain's American colonies ought to be made economically and politically subordinate to the mother country through new forms of taxation and uses those debates to argue that America's revolutionaries were not libertarians. Yale University Doctor of Philosophy (Ph.D.),  History 2008  – 2013 My Dissertation Taxing Empire: Political Economy and the Ideological Origins of the American Revolution, 1747-1776 uses the British Empire's fierce debate over political economy to tell a new story about the coming of American independence. The project argues that the severing of imperial ties was the outcome of a struggle over whether Britain's American colonies ought to be made economically and politically subordinate to the mother country through new forms of taxation and uses those debates to argue that America's revolutionaries were not libertarians. University of Cambridge Master's Degree,  Intellectual History and Political Thought 2005  – 2006 University of Cambridge Master's Degree,  Intellectual History and Political Thought 2005  – 2006 University of Cambridge Master's Degree,  Intellectual History and Political Thought 2005  – 2006 Pomona College BA,  History 2001  – 2005 Activities and Societies:  Student Newspaper Managing Editor ,  Tech Support Team Pomona College BA,  History 2001  – 2005 Activities and Societies:  Student Newspaper Managing Editor ,  Tech Support Team Pomona College BA,  History 2001  – 2005 Activities and Societies:  Student Newspaper Managing Editor ,  Tech Support Team ", "Experience Royal Academy of Engineering Visiting Professor in Sustainable Buildings University of Cambridge January 2015  – Present (8 months) Cambridge Delivering modules on natural ventilation and other sustainable building technologies, and combining engineering theory with the context of the industry in which they are applied. Chief Executive Officer Breathing Buildings May 2006  – Present (9 years 4 months) Cambridge Responsible for changing the whole approach of the industry in natural ventilation and the growth of Breathing Buildings, the leading technology company pioneering natural ventilation systems. Tutor and Teaching Fellow Girton College May 2006  – Present (9 years 4 months) Cambridge, United Kingdom Responsible for supervising engineering undergraduate students and pastoral welfare of ~60 students per year. Royal Academy of Engineering Visiting Professor in Sustainable Buildings University of Cambridge January 2015  – Present (8 months) Cambridge Delivering modules on natural ventilation and other sustainable building technologies, and combining engineering theory with the context of the industry in which they are applied. Royal Academy of Engineering Visiting Professor in Sustainable Buildings University of Cambridge January 2015  – Present (8 months) Cambridge Delivering modules on natural ventilation and other sustainable building technologies, and combining engineering theory with the context of the industry in which they are applied. Chief Executive Officer Breathing Buildings May 2006  – Present (9 years 4 months) Cambridge Responsible for changing the whole approach of the industry in natural ventilation and the growth of Breathing Buildings, the leading technology company pioneering natural ventilation systems. Chief Executive Officer Breathing Buildings May 2006  – Present (9 years 4 months) Cambridge Responsible for changing the whole approach of the industry in natural ventilation and the growth of Breathing Buildings, the leading technology company pioneering natural ventilation systems. Tutor and Teaching Fellow Girton College May 2006  – Present (9 years 4 months) Cambridge, United Kingdom Responsible for supervising engineering undergraduate students and pastoral welfare of ~60 students per year. Tutor and Teaching Fellow Girton College May 2006  – Present (9 years 4 months) Cambridge, United Kingdom Responsible for supervising engineering undergraduate students and pastoral welfare of ~60 students per year. Skills Renewable Energy Sustainability Entrepreneurship Start-ups Business Strategy Project Management Energy Product Development Venture Capital R&D Strategy Energy Efficiency Manufacturing Research Business Planning Carbon Program Management Management Consulting Engineering Business Development New Business Development Cleantech See 7+     See less Skills  Renewable Energy Sustainability Entrepreneurship Start-ups Business Strategy Project Management Energy Product Development Venture Capital R&D Strategy Energy Efficiency Manufacturing Research Business Planning Carbon Program Management Management Consulting Engineering Business Development New Business Development Cleantech See 7+     See less Renewable Energy Sustainability Entrepreneurship Start-ups Business Strategy Project Management Energy Product Development Venture Capital R&D Strategy Energy Efficiency Manufacturing Research Business Planning Carbon Program Management Management Consulting Engineering Business Development New Business Development Cleantech See 7+     See less Renewable Energy Sustainability Entrepreneurship Start-ups Business Strategy Project Management Energy Product Development Venture Capital R&D Strategy Energy Efficiency Manufacturing Research Business Planning Carbon Program Management Management Consulting Engineering Business Development New Business Development Cleantech See 7+     See less Honors & Awards Fellow Royal Academy of Engineering September 2014 Fellow Royal Academy of Engineering September 2014 Fellow Royal Academy of Engineering September 2014 Fellow Royal Academy of Engineering September 2014 ", "Experience Professor, Linguistics University of Washington September 2014  – Present (1 year) Adjunct Professor, Computer Science & Engineering University of Washington September 2006  – Present (9 years) Director, Professional Master's Program in Computational Linguistics University of Washington September 2005  – Present (10 years) Professor, Linguistics University of Washington September 2014  – Present (1 year) Professor, Linguistics University of Washington September 2014  – Present (1 year) Adjunct Professor, Computer Science & Engineering University of Washington September 2006  – Present (9 years) Adjunct Professor, Computer Science & Engineering University of Washington September 2006  – Present (9 years) Director, Professional Master's Program in Computational Linguistics University of Washington September 2005  – Present (10 years) Director, Professional Master's Program in Computational Linguistics University of Washington September 2005  – Present (10 years) Skills Computational... Natural Language... Syntax Sociolinguistics Linguistics Semantics Artificial Intelligence Corpus Linguistics Language Technology LaTeX Grammar Morphology Python Data Mining Multilingual Ontologies Computer Science University Teaching Human Computer... Software Engineering Academic Writing See 6+     See less Skills  Computational... Natural Language... Syntax Sociolinguistics Linguistics Semantics Artificial Intelligence Corpus Linguistics Language Technology LaTeX Grammar Morphology Python Data Mining Multilingual Ontologies Computer Science University Teaching Human Computer... Software Engineering Academic Writing See 6+     See less Computational... Natural Language... Syntax Sociolinguistics Linguistics Semantics Artificial Intelligence Corpus Linguistics Language Technology LaTeX Grammar Morphology Python Data Mining Multilingual Ontologies Computer Science University Teaching Human Computer... Software Engineering Academic Writing See 6+     See less Computational... Natural Language... Syntax Sociolinguistics Linguistics Semantics Artificial Intelligence Corpus Linguistics Language Technology LaTeX Grammar Morphology Python Data Mining Multilingual Ontologies Computer Science University Teaching Human Computer... Software Engineering Academic Writing See 6+     See less Education Stanford University PhD,  Linguistics 1995  – 2000 University of California, Berkeley AB,  Linguistics 1991  – 1995 Tohoku University Linguistics 1993  – 1994 Stanford University PhD,  Linguistics 1995  – 2000 Stanford University PhD,  Linguistics 1995  – 2000 Stanford University PhD,  Linguistics 1995  – 2000 University of California, Berkeley AB,  Linguistics 1991  – 1995 University of California, Berkeley AB,  Linguistics 1991  – 1995 University of California, Berkeley AB,  Linguistics 1991  – 1995 Tohoku University Linguistics 1993  – 1994 Tohoku University Linguistics 1993  – 1994 Tohoku University Linguistics 1993  – 1994 ", "Summary Bring state-of-the-art geostatiscal technologies to operational status for natural resources. www.ar2tech.com Specialties:Geostastistics (variogram and multiple point), Energy, mining and environmental applications,Machine learning. Summary Bring state-of-the-art geostatiscal technologies to operational status for natural resources. www.ar2tech.com Specialties:Geostastistics (variogram and multiple point), Energy, mining and environmental applications,Machine learning. Bring state-of-the-art geostatiscal technologies to operational status for natural resources. www.ar2tech.com Specialties:Geostastistics (variogram and multiple point), Energy, mining and environmental applications,Machine learning. Bring state-of-the-art geostatiscal technologies to operational status for natural resources. www.ar2tech.com Specialties:Geostastistics (variogram and multiple point), Energy, mining and environmental applications,Machine learning. Experience Founder Advanced Resources and Risk Technology LLC September 2010  – Present (5 years) AR2Tech provides customized geostatistical algorithms and solutions for energy, mining and environmental applications. www.ar2tech.com Acting Assistant Professor Stanford University September 2007  –  September 2010  (3 years 1 month) Alexandre Boucher teaches geostatistics at Stanford University. He applied his expertise to the environment, energy and natural resources applications. Founder Advanced Resources and Risk Technology LLC September 2010  – Present (5 years) AR2Tech provides customized geostatistical algorithms and solutions for energy, mining and environmental applications. www.ar2tech.com Founder Advanced Resources and Risk Technology LLC September 2010  – Present (5 years) AR2Tech provides customized geostatistical algorithms and solutions for energy, mining and environmental applications. www.ar2tech.com Acting Assistant Professor Stanford University September 2007  –  September 2010  (3 years 1 month) Alexandre Boucher teaches geostatistics at Stanford University. He applied his expertise to the environment, energy and natural resources applications. Acting Assistant Professor Stanford University September 2007  –  September 2010  (3 years 1 month) Alexandre Boucher teaches geostatistics at Stanford University. He applied his expertise to the environment, energy and natural resources applications. Education Stanford University PhD 2007 Department of Geological and Environmental Sciences University of Queensland MPhil,  Geostatistics February 2001  – December 2002 Master thesis: Conditional Joint Simulation of Random Field on Block Support Université de Montréal - Ecole polytechnique de Montréal B.Eng,  Geological engineering 1996  – 2000 Stanford University PhD 2007 Department of Geological and Environmental Sciences Stanford University PhD 2007 Department of Geological and Environmental Sciences Stanford University PhD 2007 Department of Geological and Environmental Sciences University of Queensland MPhil,  Geostatistics February 2001  – December 2002 Master thesis: Conditional Joint Simulation of Random Field on Block Support University of Queensland MPhil,  Geostatistics February 2001  – December 2002 Master thesis: Conditional Joint Simulation of Random Field on Block Support University of Queensland MPhil,  Geostatistics February 2001  – December 2002 Master thesis: Conditional Joint Simulation of Random Field on Block Support Université de Montréal - Ecole polytechnique de Montréal B.Eng,  Geological engineering 1996  – 2000 Université de Montréal - Ecole polytechnique de Montréal B.Eng,  Geological engineering 1996  – 2000 Université de Montréal - Ecole polytechnique de Montréal B.Eng,  Geological engineering 1996  – 2000 Honors & Awards Additional Honors & Awards Recipient of a PhD scolarship from the Department of Geological and Environmental \nSciences, Stanford University. January 2003 - December 2007 \nRecipient of a PhD scolarship from the Fond Quebecois de la Recherche sur la nature \net les technologies. May 2003 - December 2005. \nRecipient of a Master scolarship from the Natural Sciences and Engineering Research \nCouncil of Canada. May 2001 - December 2002. \nRecipient of an undergraduated scholarship from the Scotia Bank Group \nRecipient of an undergraduated scholarship from the Canadian Mineral Industry Edu- \ncation Foundation Additional Honors & Awards Recipient of a PhD scolarship from the Department of Geological and Environmental \nSciences, Stanford University. January 2003 - December 2007 \nRecipient of a PhD scolarship from the Fond Quebecois de la Recherche sur la nature \net les technologies. May 2003 - December 2005. \nRecipient of a Master scolarship from the Natural Sciences and Engineering Research \nCouncil of Canada. May 2001 - December 2002. \nRecipient of an undergraduated scholarship from the Scotia Bank Group \nRecipient of an undergraduated scholarship from the Canadian Mineral Industry Edu- \ncation Foundation Additional Honors & Awards Recipient of a PhD scolarship from the Department of Geological and Environmental \nSciences, Stanford University. January 2003 - December 2007 \nRecipient of a PhD scolarship from the Fond Quebecois de la Recherche sur la nature \net les technologies. May 2003 - December 2005. \nRecipient of a Master scolarship from the Natural Sciences and Engineering Research \nCouncil of Canada. May 2001 - December 2002. \nRecipient of an undergraduated scholarship from the Scotia Bank Group \nRecipient of an undergraduated scholarship from the Canadian Mineral Industry Edu- \ncation Foundation Additional Honors & Awards Recipient of a PhD scolarship from the Department of Geological and Environmental \nSciences, Stanford University. January 2003 - December 2007 \nRecipient of a PhD scolarship from the Fond Quebecois de la Recherche sur la nature \net les technologies. May 2003 - December 2005. \nRecipient of a Master scolarship from the Natural Sciences and Engineering Research \nCouncil of Canada. May 2001 - December 2002. \nRecipient of an undergraduated scholarship from the Scotia Bank Group \nRecipient of an undergraduated scholarship from the Canadian Mineral Industry Edu- \ncation Foundation ", "Summary Professor and the Director of the Nano- and Micro-Mechanical Behavior Laboratory at Lehigh University, with research specialities in the processing and mechanical properties of thin films and small-scale structures. Specific interests include fabrication and application of MEMS devices for mechanical measurements, strengthening mechanisms in platinum, gold, and aluminum thin films, viscoelasticity and stress relaxation mechanisms in metal films, wear-resistant metal films, cryogenic behavior of thin films, and nanopatterning of metal films for solid state conversion to form single crystal oxides. The mechanical behavior of small volumes of natural materials, including human skin, are also active areas of interest. Teaching expertise includes thermodynamics, mechanical behavior, and making golf putters and golf balls from scratch. Specialties:Thin film mechanical behavior, thin film deposition, mechanical testing at small scales (nanometer to micrometer), MEMS materials and devices. Summary Professor and the Director of the Nano- and Micro-Mechanical Behavior Laboratory at Lehigh University, with research specialities in the processing and mechanical properties of thin films and small-scale structures. Specific interests include fabrication and application of MEMS devices for mechanical measurements, strengthening mechanisms in platinum, gold, and aluminum thin films, viscoelasticity and stress relaxation mechanisms in metal films, wear-resistant metal films, cryogenic behavior of thin films, and nanopatterning of metal films for solid state conversion to form single crystal oxides. The mechanical behavior of small volumes of natural materials, including human skin, are also active areas of interest. Teaching expertise includes thermodynamics, mechanical behavior, and making golf putters and golf balls from scratch. Specialties:Thin film mechanical behavior, thin film deposition, mechanical testing at small scales (nanometer to micrometer), MEMS materials and devices. Professor and the Director of the Nano- and Micro-Mechanical Behavior Laboratory at Lehigh University, with research specialities in the processing and mechanical properties of thin films and small-scale structures. Specific interests include fabrication and application of MEMS devices for mechanical measurements, strengthening mechanisms in platinum, gold, and aluminum thin films, viscoelasticity and stress relaxation mechanisms in metal films, wear-resistant metal films, cryogenic behavior of thin films, and nanopatterning of metal films for solid state conversion to form single crystal oxides. The mechanical behavior of small volumes of natural materials, including human skin, are also active areas of interest. Teaching expertise includes thermodynamics, mechanical behavior, and making golf putters and golf balls from scratch. Specialties:Thin film mechanical behavior, thin film deposition, mechanical testing at small scales (nanometer to micrometer), MEMS materials and devices. Professor and the Director of the Nano- and Micro-Mechanical Behavior Laboratory at Lehigh University, with research specialities in the processing and mechanical properties of thin films and small-scale structures. Specific interests include fabrication and application of MEMS devices for mechanical measurements, strengthening mechanisms in platinum, gold, and aluminum thin films, viscoelasticity and stress relaxation mechanisms in metal films, wear-resistant metal films, cryogenic behavior of thin films, and nanopatterning of metal films for solid state conversion to form single crystal oxides. The mechanical behavior of small volumes of natural materials, including human skin, are also active areas of interest. Teaching expertise includes thermodynamics, mechanical behavior, and making golf putters and golf balls from scratch. Specialties:Thin film mechanical behavior, thin film deposition, mechanical testing at small scales (nanometer to micrometer), MEMS materials and devices. Experience Director Center for Advanced Materials and Nanotechnology, Lehigh University 2014  – Present (1 year) Bethlehem, Pennsylvania Professor Department of Materials Science and Engineering, Lehigh University 1998  – Present (17 years) Bethlehem, Pennsylvania Visiting Scientist NIST 2005  –  2005  (less than a year) Acting Assistant Professor Stanford University 1996  –  1998  (2 years) Postdoctoral Researcher Stanford University 1994  –  1996  (2 years) Stanford, California Director Center for Advanced Materials and Nanotechnology, Lehigh University 2014  – Present (1 year) Bethlehem, Pennsylvania Director Center for Advanced Materials and Nanotechnology, Lehigh University 2014  – Present (1 year) Bethlehem, Pennsylvania Professor Department of Materials Science and Engineering, Lehigh University 1998  – Present (17 years) Bethlehem, Pennsylvania Professor Department of Materials Science and Engineering, Lehigh University 1998  – Present (17 years) Bethlehem, Pennsylvania Visiting Scientist NIST 2005  –  2005  (less than a year) Visiting Scientist NIST 2005  –  2005  (less than a year) Acting Assistant Professor Stanford University 1996  –  1998  (2 years) Acting Assistant Professor Stanford University 1996  –  1998  (2 years) Postdoctoral Researcher Stanford University 1994  –  1996  (2 years) Stanford, California Postdoctoral Researcher Stanford University 1994  –  1996  (2 years) Stanford, California Skills Scanning Electron... Thin Films Materials Materials Science Electron Microscopy MEMS Mechanical Testing Nanotechnology Metal Fabrication Powder X-ray Diffraction TEM Characterization AFM Data Analysis Thermodynamics Research Statistics Teaching Engineering Optical Microscopy See 5+     See less Skills  Scanning Electron... Thin Films Materials Materials Science Electron Microscopy MEMS Mechanical Testing Nanotechnology Metal Fabrication Powder X-ray Diffraction TEM Characterization AFM Data Analysis Thermodynamics Research Statistics Teaching Engineering Optical Microscopy See 5+     See less Scanning Electron... Thin Films Materials Materials Science Electron Microscopy MEMS Mechanical Testing Nanotechnology Metal Fabrication Powder X-ray Diffraction TEM Characterization AFM Data Analysis Thermodynamics Research Statistics Teaching Engineering Optical Microscopy See 5+     See less Scanning Electron... Thin Films Materials Materials Science Electron Microscopy MEMS Mechanical Testing Nanotechnology Metal Fabrication Powder X-ray Diffraction TEM Characterization AFM Data Analysis Thermodynamics Research Statistics Teaching Engineering Optical Microscopy See 5+     See less Education Stanford University PhD,  Materials 1988  – 1994 Massachusetts Institute of Technology BS,  Materials Science and Engineering 1984  – 1988 Stanford University PhD,  Materials 1988  – 1994 Stanford University PhD,  Materials 1988  – 1994 Stanford University PhD,  Materials 1988  – 1994 Massachusetts Institute of Technology BS,  Materials Science and Engineering 1984  – 1988 Massachusetts Institute of Technology BS,  Materials Science and Engineering 1984  – 1988 Massachusetts Institute of Technology BS,  Materials Science and Engineering 1984  – 1988 Honors & Awards Additional Honors & Awards NSF New Century Scholar 1999 \nNSF CAREER Award 1999 \nTau Beta Pi Eminent Engineer, PA Alpha Chapter 1999 \nASM Lehigh Valley Chapter Outstanding Young Member Award 2001 \nLehigh University Junior Award for Distinguished Teaching 2001 \nBradley Stoughton Award for Young Teachers, ASM 2001 \nP.C. Rossin College of Engineering Teaching Excellence Award 2002, ‘05, ‘08, '09 \nGilbert E. Doan Award, awarded by graduating seniors 2001, ‘03, ‘04, ‘06, '09 \nLehigh P.C. Rossin Professorship 2001-2003 \nLehigh Class of 1961 Professorship 2004-2006 Additional Honors & Awards NSF New Century Scholar 1999 \nNSF CAREER Award 1999 \nTau Beta Pi Eminent Engineer, PA Alpha Chapter 1999 \nASM Lehigh Valley Chapter Outstanding Young Member Award 2001 \nLehigh University Junior Award for Distinguished Teaching 2001 \nBradley Stoughton Award for Young Teachers, ASM 2001 \nP.C. Rossin College of Engineering Teaching Excellence Award 2002, ‘05, ‘08, '09 \nGilbert E. Doan Award, awarded by graduating seniors 2001, ‘03, ‘04, ‘06, '09 \nLehigh P.C. Rossin Professorship 2001-2003 \nLehigh Class of 1961 Professorship 2004-2006 Additional Honors & Awards NSF New Century Scholar 1999 \nNSF CAREER Award 1999 \nTau Beta Pi Eminent Engineer, PA Alpha Chapter 1999 \nASM Lehigh Valley Chapter Outstanding Young Member Award 2001 \nLehigh University Junior Award for Distinguished Teaching 2001 \nBradley Stoughton Award for Young Teachers, ASM 2001 \nP.C. Rossin College of Engineering Teaching Excellence Award 2002, ‘05, ‘08, '09 \nGilbert E. Doan Award, awarded by graduating seniors 2001, ‘03, ‘04, ‘06, '09 \nLehigh P.C. Rossin Professorship 2001-2003 \nLehigh Class of 1961 Professorship 2004-2006 Additional Honors & Awards NSF New Century Scholar 1999 \nNSF CAREER Award 1999 \nTau Beta Pi Eminent Engineer, PA Alpha Chapter 1999 \nASM Lehigh Valley Chapter Outstanding Young Member Award 2001 \nLehigh University Junior Award for Distinguished Teaching 2001 \nBradley Stoughton Award for Young Teachers, ASM 2001 \nP.C. Rossin College of Engineering Teaching Excellence Award 2002, ‘05, ‘08, '09 \nGilbert E. Doan Award, awarded by graduating seniors 2001, ‘03, ‘04, ‘06, '09 \nLehigh P.C. Rossin Professorship 2001-2003 \nLehigh Class of 1961 Professorship 2004-2006 ", "Summary Education research specialist with over fifteen years of international and domestic experience in education research and program evaluation. Strong analytical and communication skills oriented to program improvement, relating findings to diverse audiences, and improving education access for underserved groups. \n \nSpecialties: •\tResearch design including the identification of stakeholders and performance indicators, instrument development, and data collection. \n•\tQuantitative and qualitative data analysis and interpretation, including interviews and focus groups, survey design and implementation, and statistical analysis. \n•\tProgram and research team management and the coordination of research activities to meet program operation and improvement goals and the needs of multiple stakeholders. Summary Education research specialist with over fifteen years of international and domestic experience in education research and program evaluation. Strong analytical and communication skills oriented to program improvement, relating findings to diverse audiences, and improving education access for underserved groups. \n \nSpecialties: •\tResearch design including the identification of stakeholders and performance indicators, instrument development, and data collection. \n•\tQuantitative and qualitative data analysis and interpretation, including interviews and focus groups, survey design and implementation, and statistical analysis. \n•\tProgram and research team management and the coordination of research activities to meet program operation and improvement goals and the needs of multiple stakeholders. Education research specialist with over fifteen years of international and domestic experience in education research and program evaluation. Strong analytical and communication skills oriented to program improvement, relating findings to diverse audiences, and improving education access for underserved groups. \n \nSpecialties: •\tResearch design including the identification of stakeholders and performance indicators, instrument development, and data collection. \n•\tQuantitative and qualitative data analysis and interpretation, including interviews and focus groups, survey design and implementation, and statistical analysis. \n•\tProgram and research team management and the coordination of research activities to meet program operation and improvement goals and the needs of multiple stakeholders. Education research specialist with over fifteen years of international and domestic experience in education research and program evaluation. Strong analytical and communication skills oriented to program improvement, relating findings to diverse audiences, and improving education access for underserved groups. \n \nSpecialties: •\tResearch design including the identification of stakeholders and performance indicators, instrument development, and data collection. \n•\tQuantitative and qualitative data analysis and interpretation, including interviews and focus groups, survey design and implementation, and statistical analysis. \n•\tProgram and research team management and the coordination of research activities to meet program operation and improvement goals and the needs of multiple stakeholders. Experience Senior Research Associate RTI International January 2009  – Present (6 years 8 months) Director of Research Escuela Nueva International July 2007  –  January 2009  (1 year 7 months) •\tDeveloped a quasi-experimental evaluation program (using a matched comparison group) for a rural, multigrade schooling reform program in Guyana. \n•\tDesigned and tested research instruments, trained and led a team of 8 researchers for field work, and analyzed quantitative and qualitative data to inform program activities. \n•\tDesigned a self-evaluation for teachers to monitor program development and target areas for improvement. \n•\tWrote final reports and prepared presentations for the Escuela Nueva Foundation, the Guyanese Ministry of Education, and the World Bank. Consultant The Institute for College Access and Success July 2007  –  January 2009  (1 year 7 months) •\tReviewed and evaluated program activities for 27 university and college grantees of the Ford Foundation’s Difficult Dialogues Initiative promoting programs to address issues of religion, pluralism, and academic freedom at U.S. colleges and universities. \n•\tProvided technical assistance by conducting site visits, interviews, workshops and focus groups on developing outcome-based evaluation plans to inform program improvement. Director, Master's Program in Comparative and International Education and Acting Assistant Professor Stanford University School of Education September 2005  –  September 2007  (2 years 1 month) •\tDeveloped and taught six upper-division and graduate courses on research methods and education policy and analysis and advised students;  \n•\tAdvised program participants on research design, and data collection, analysis, and interpretation for year-long individual master’s thesis projects.  \n•\tManaged an enrollment increase of 50 percent.  \n•\tOrganized guest speakers, social activities, and other program events.  \n•\tCoordinated and maintained the alumni outreach program.  \n•\tHired and supervised program staff Research Assistant Carnegie Foundation for the Advancement of Teaching 2000  –  2003  (3 years) Senior Research Associate RTI International January 2009  – Present (6 years 8 months) Senior Research Associate RTI International January 2009  – Present (6 years 8 months) Director of Research Escuela Nueva International July 2007  –  January 2009  (1 year 7 months) •\tDeveloped a quasi-experimental evaluation program (using a matched comparison group) for a rural, multigrade schooling reform program in Guyana. \n•\tDesigned and tested research instruments, trained and led a team of 8 researchers for field work, and analyzed quantitative and qualitative data to inform program activities. \n•\tDesigned a self-evaluation for teachers to monitor program development and target areas for improvement. \n•\tWrote final reports and prepared presentations for the Escuela Nueva Foundation, the Guyanese Ministry of Education, and the World Bank. Director of Research Escuela Nueva International July 2007  –  January 2009  (1 year 7 months) •\tDeveloped a quasi-experimental evaluation program (using a matched comparison group) for a rural, multigrade schooling reform program in Guyana. \n•\tDesigned and tested research instruments, trained and led a team of 8 researchers for field work, and analyzed quantitative and qualitative data to inform program activities. \n•\tDesigned a self-evaluation for teachers to monitor program development and target areas for improvement. \n•\tWrote final reports and prepared presentations for the Escuela Nueva Foundation, the Guyanese Ministry of Education, and the World Bank. Consultant The Institute for College Access and Success July 2007  –  January 2009  (1 year 7 months) •\tReviewed and evaluated program activities for 27 university and college grantees of the Ford Foundation’s Difficult Dialogues Initiative promoting programs to address issues of religion, pluralism, and academic freedom at U.S. colleges and universities. \n•\tProvided technical assistance by conducting site visits, interviews, workshops and focus groups on developing outcome-based evaluation plans to inform program improvement. Consultant The Institute for College Access and Success July 2007  –  January 2009  (1 year 7 months) •\tReviewed and evaluated program activities for 27 university and college grantees of the Ford Foundation’s Difficult Dialogues Initiative promoting programs to address issues of religion, pluralism, and academic freedom at U.S. colleges and universities. \n•\tProvided technical assistance by conducting site visits, interviews, workshops and focus groups on developing outcome-based evaluation plans to inform program improvement. Director, Master's Program in Comparative and International Education and Acting Assistant Professor Stanford University School of Education September 2005  –  September 2007  (2 years 1 month) •\tDeveloped and taught six upper-division and graduate courses on research methods and education policy and analysis and advised students;  \n•\tAdvised program participants on research design, and data collection, analysis, and interpretation for year-long individual master’s thesis projects.  \n•\tManaged an enrollment increase of 50 percent.  \n•\tOrganized guest speakers, social activities, and other program events.  \n•\tCoordinated and maintained the alumni outreach program.  \n•\tHired and supervised program staff Director, Master's Program in Comparative and International Education and Acting Assistant Professor Stanford University School of Education September 2005  –  September 2007  (2 years 1 month) •\tDeveloped and taught six upper-division and graduate courses on research methods and education policy and analysis and advised students;  \n•\tAdvised program participants on research design, and data collection, analysis, and interpretation for year-long individual master’s thesis projects.  \n•\tManaged an enrollment increase of 50 percent.  \n•\tOrganized guest speakers, social activities, and other program events.  \n•\tCoordinated and maintained the alumni outreach program.  \n•\tHired and supervised program staff Research Assistant Carnegie Foundation for the Advancement of Teaching 2000  –  2003  (3 years) Research Assistant Carnegie Foundation for the Advancement of Teaching 2000  –  2003  (3 years) Languages Latvian Latvian Latvian Skills Statistics Data Collection Research Research Design Educational Research Program Development Stata Program Evaluation Survey Design Higher Education Policy Analysis Qualitative Research Education Policy Analysis Community Outreach Data Analysis See 1+     See less Skills  Statistics Data Collection Research Research Design Educational Research Program Development Stata Program Evaluation Survey Design Higher Education Policy Analysis Qualitative Research Education Policy Analysis Community Outreach Data Analysis See 1+     See less Statistics Data Collection Research Research Design Educational Research Program Development Stata Program Evaluation Survey Design Higher Education Policy Analysis Qualitative Research Education Policy Analysis Community Outreach Data Analysis See 1+     See less Statistics Data Collection Research Research Design Educational Research Program Development Stata Program Evaluation Survey Design Higher Education Policy Analysis Qualitative Research Education Policy Analysis Community Outreach Data Analysis See 1+     See less Education Stanford University PhD,  International and Comparative Education 2000  – 2006 University of Michigan MPP,  Public Policy Analysis and Quantitative Methods 1997  – 1999 Stanford University PhD,  International and Comparative Education 2000  – 2006 Stanford University PhD,  International and Comparative Education 2000  – 2006 Stanford University PhD,  International and Comparative Education 2000  – 2006 University of Michigan MPP,  Public Policy Analysis and Quantitative Methods 1997  – 1999 University of Michigan MPP,  Public Policy Analysis and Quantitative Methods 1997  – 1999 University of Michigan MPP,  Public Policy Analysis and Quantitative Methods 1997  – 1999 ", "Experience Assistant Professor Stanford University November 2011  – Present (3 years 10 months) Department of Psychiatry and Behavioral Sciences Director, Stanford Cancer Institute Survivorship Research Stanford Cancer Center 2010  – Present (5 years) Stanford, CA Acting Assistant Professor Stanford University September 2010  –  November 2011  (1 year 3 months) Assistant Professor University of Rochester Medical Center August 2006  –  August 2010  (4 years 1 month) Postdoctoral Fellow Stanford University 2002  –  2006  (4 years) Department of Psychiatry and Behavioral Sciences Assistant Professor Stanford University November 2011  – Present (3 years 10 months) Department of Psychiatry and Behavioral Sciences Assistant Professor Stanford University November 2011  – Present (3 years 10 months) Department of Psychiatry and Behavioral Sciences Director, Stanford Cancer Institute Survivorship Research Stanford Cancer Center 2010  – Present (5 years) Stanford, CA Director, Stanford Cancer Institute Survivorship Research Stanford Cancer Center 2010  – Present (5 years) Stanford, CA Acting Assistant Professor Stanford University September 2010  –  November 2011  (1 year 3 months) Acting Assistant Professor Stanford University September 2010  –  November 2011  (1 year 3 months) Assistant Professor University of Rochester Medical Center August 2006  –  August 2010  (4 years 1 month) Assistant Professor University of Rochester Medical Center August 2006  –  August 2010  (4 years 1 month) Postdoctoral Fellow Stanford University 2002  –  2006  (4 years) Department of Psychiatry and Behavioral Sciences Postdoctoral Fellow Stanford University 2002  –  2006  (4 years) Department of Psychiatry and Behavioral Sciences Skills Psychology Clinical Research Science Statistics Research Teaching Neuroscience Grant Writing Public Health Cancer Data Analysis Mental Health Treatment Psychiatry Psychotherapy Clinical Trials Higher Education Research Design Experimental Design Translational Research Cancer Research Literature Reviews Epidemiology Clinical Psychology Academic Writing Physiology Behavioral Health Interventions Scientific Writing Cognition Qualitative Research University Teaching SPSS Public Speaking Psychological Assessment Program Evaluation Program Development See 22+     See less Skills  Psychology Clinical Research Science Statistics Research Teaching Neuroscience Grant Writing Public Health Cancer Data Analysis Mental Health Treatment Psychiatry Psychotherapy Clinical Trials Higher Education Research Design Experimental Design Translational Research Cancer Research Literature Reviews Epidemiology Clinical Psychology Academic Writing Physiology Behavioral Health Interventions Scientific Writing Cognition Qualitative Research University Teaching SPSS Public Speaking Psychological Assessment Program Evaluation Program Development See 22+     See less Psychology Clinical Research Science Statistics Research Teaching Neuroscience Grant Writing Public Health Cancer Data Analysis Mental Health Treatment Psychiatry Psychotherapy Clinical Trials Higher Education Research Design Experimental Design Translational Research Cancer Research Literature Reviews Epidemiology Clinical Psychology Academic Writing Physiology Behavioral Health Interventions Scientific Writing Cognition Qualitative Research University Teaching SPSS Public Speaking Psychological Assessment Program Evaluation Program Development See 22+     See less Psychology Clinical Research Science Statistics Research Teaching Neuroscience Grant Writing Public Health Cancer Data Analysis Mental Health Treatment Psychiatry Psychotherapy Clinical Trials Higher Education Research Design Experimental Design Translational Research Cancer Research Literature Reviews Epidemiology Clinical Psychology Academic Writing Physiology Behavioral Health Interventions Scientific Writing Cognition Qualitative Research University Teaching SPSS Public Speaking Psychological Assessment Program Evaluation Program Development See 22+     See less Education University of Rochester School of Medicine and Dentistry MPH,  Clinical Investigation 2006  – 2009 Stanford University Postdoctoral,  Behavioral Medicine 2002  – 2006 California School of Professional Psychology-San Diego PhD,  Clinical Psychology 1997  – 2002 Brigham Young University BS,  Psychology 1993  – 1996 University of Rochester School of Medicine and Dentistry MPH,  Clinical Investigation 2006  – 2009 University of Rochester School of Medicine and Dentistry MPH,  Clinical Investigation 2006  – 2009 University of Rochester School of Medicine and Dentistry MPH,  Clinical Investigation 2006  – 2009 Stanford University Postdoctoral,  Behavioral Medicine 2002  – 2006 Stanford University Postdoctoral,  Behavioral Medicine 2002  – 2006 Stanford University Postdoctoral,  Behavioral Medicine 2002  – 2006 California School of Professional Psychology-San Diego PhD,  Clinical Psychology 1997  – 2002 California School of Professional Psychology-San Diego PhD,  Clinical Psychology 1997  – 2002 California School of Professional Psychology-San Diego PhD,  Clinical Psychology 1997  – 2002 Brigham Young University BS,  Psychology 1993  – 1996 Brigham Young University BS,  Psychology 1993  – 1996 Brigham Young University BS,  Psychology 1993  – 1996 "]}