{"position": "Administrative Assistant", "company": "Stanford University", "profiles": ["Summary I am a recent college graduate looking to pursue a career in either education, psychology, or both. I am passionate about working with children and am interested in their behaviors, thought processes, and how both their biological makeup and environment plays a role in these outcomes. Summary I am a recent college graduate looking to pursue a career in either education, psychology, or both. I am passionate about working with children and am interested in their behaviors, thought processes, and how both their biological makeup and environment plays a role in these outcomes. I am a recent college graduate looking to pursue a career in either education, psychology, or both. I am passionate about working with children and am interested in their behaviors, thought processes, and how both their biological makeup and environment plays a role in these outcomes. I am a recent college graduate looking to pursue a career in either education, psychology, or both. I am passionate about working with children and am interested in their behaviors, thought processes, and how both their biological makeup and environment plays a role in these outcomes. Experience FRL/Bedside Volunteer Stanford Children's Health | Lucile Packard Children's Hospital Stanford August 2014  – Present (1 year 1 month) Palo Alto Administrative Assistant Stanford University School of Medicine October 2013  – Present (1 year 11 months) stanford university •Provide administrative support to Dr. Sudhof in organizing conferences and meetings, coordinating visitor schedules and helping with miscellaneous tasks as requested. \n•Responsible for ordering lab materials and equipment for graduate and postdoctoral lab members through Oracle Financial systems and HHMI; keep track of purchase orders and all purchasing expenses in detailed excel sheet. \n•Organize travel arrangements, maintain travel files, manage travel card and process travel reimbursements. Summer Intern Boys and Girls Club of the Peninsula June 2014  –  July 2014  (2 months) east palo alto • Worked as a summer intern at the BGCP East Palo Alto club house with 15-20 teenagers ages 14-17 years old \n• Taught the different skill sets necessary for volleyball and soccer and created lesson plans with games and team building activities to keep the kids engaged \n• Encouraged the kids to work together in order to achieve a common goal and practice good sportsmanship on and off the playing field Peer Life Coach Intern Creating Options and Conquering Hurdles (COACH) Program September 2012  –  June 2013  (10 months) UC Irvine Counseling Center •Trained as a life coach to help undergraduate students needing assistance with their academic, social and personal goals. \n•Assisted 7 students by helping them formulate individual plans with specific steps, tasks and timelines.  \n•Contacted clients biweekly and provided them with wisdom and encouraged them to accomplish their goals. Discussion Leader Coordinator UC Irvine University Studies Discussion Leader Program March 2010  –  January 2013  (2 years 11 months) UC Irvine Department of Undergraduate Education • Worked with a team of 4 other coordinators and supervisor to create and help lead weekly, two hour long training courses covering topics such as public speaking, campus resources, time management, leadership, etc., for a group of 50 Discussion Leaders. \n• Held weekly coordinator meetings to brainstorm unique ways to present information that is both educationally stimulating and engaging. \n• Served as a positive role model, motivator and mentor for Discussion Leaders and Undergraduate students. Activity Coordinator/Volunteer Orangewood Children's Home October 2010  –  December 2012  (2 years 3 months) santa ana, ca •\tPlanned and supervised an activity night for boys and girls ages 6-10 and 11-14. \n•\tDeveloped two-hour lesson plans around a pre-assigned theme. \n•\tProvided a sense of support to children to help along their transition at Orangewood. Administrative Assistant Stanford University School of Medicine July 2012  –  October 2012  (4 months) Stanford University •Assisted Director of the Institute of Stem Cell Biology and Regenerative Medicine by filtering his email and keeping his calendar up to date. \n•Helped Graduate and Post Doctoral lab fellows submit their research papers to reviewers. \n•Answered phone calls and was responsible for organizing conferences and helping individuals obtain documents or papers they needed. Front Desk Associate Fitness 19 July 2009  –  June 2012  (3 years) San Mateo, CA •\tEntered membership data into computer system and updated billing information. \n•\tOrganized and maintained gym membership filing system and responsible for membership reconciliation. \n•\tHelped trainers market and plan health challenges and events for their clients. FRL/Bedside Volunteer Stanford Children's Health | Lucile Packard Children's Hospital Stanford August 2014  – Present (1 year 1 month) Palo Alto FRL/Bedside Volunteer Stanford Children's Health | Lucile Packard Children's Hospital Stanford August 2014  – Present (1 year 1 month) Palo Alto Administrative Assistant Stanford University School of Medicine October 2013  – Present (1 year 11 months) stanford university •Provide administrative support to Dr. Sudhof in organizing conferences and meetings, coordinating visitor schedules and helping with miscellaneous tasks as requested. \n•Responsible for ordering lab materials and equipment for graduate and postdoctoral lab members through Oracle Financial systems and HHMI; keep track of purchase orders and all purchasing expenses in detailed excel sheet. \n•Organize travel arrangements, maintain travel files, manage travel card and process travel reimbursements. Administrative Assistant Stanford University School of Medicine October 2013  – Present (1 year 11 months) stanford university •Provide administrative support to Dr. Sudhof in organizing conferences and meetings, coordinating visitor schedules and helping with miscellaneous tasks as requested. \n•Responsible for ordering lab materials and equipment for graduate and postdoctoral lab members through Oracle Financial systems and HHMI; keep track of purchase orders and all purchasing expenses in detailed excel sheet. \n•Organize travel arrangements, maintain travel files, manage travel card and process travel reimbursements. Summer Intern Boys and Girls Club of the Peninsula June 2014  –  July 2014  (2 months) east palo alto • Worked as a summer intern at the BGCP East Palo Alto club house with 15-20 teenagers ages 14-17 years old \n• Taught the different skill sets necessary for volleyball and soccer and created lesson plans with games and team building activities to keep the kids engaged \n• Encouraged the kids to work together in order to achieve a common goal and practice good sportsmanship on and off the playing field Summer Intern Boys and Girls Club of the Peninsula June 2014  –  July 2014  (2 months) east palo alto • Worked as a summer intern at the BGCP East Palo Alto club house with 15-20 teenagers ages 14-17 years old \n• Taught the different skill sets necessary for volleyball and soccer and created lesson plans with games and team building activities to keep the kids engaged \n• Encouraged the kids to work together in order to achieve a common goal and practice good sportsmanship on and off the playing field Peer Life Coach Intern Creating Options and Conquering Hurdles (COACH) Program September 2012  –  June 2013  (10 months) UC Irvine Counseling Center •Trained as a life coach to help undergraduate students needing assistance with their academic, social and personal goals. \n•Assisted 7 students by helping them formulate individual plans with specific steps, tasks and timelines.  \n•Contacted clients biweekly and provided them with wisdom and encouraged them to accomplish their goals. Peer Life Coach Intern Creating Options and Conquering Hurdles (COACH) Program September 2012  –  June 2013  (10 months) UC Irvine Counseling Center •Trained as a life coach to help undergraduate students needing assistance with their academic, social and personal goals. \n•Assisted 7 students by helping them formulate individual plans with specific steps, tasks and timelines.  \n•Contacted clients biweekly and provided them with wisdom and encouraged them to accomplish their goals. Discussion Leader Coordinator UC Irvine University Studies Discussion Leader Program March 2010  –  January 2013  (2 years 11 months) UC Irvine Department of Undergraduate Education • Worked with a team of 4 other coordinators and supervisor to create and help lead weekly, two hour long training courses covering topics such as public speaking, campus resources, time management, leadership, etc., for a group of 50 Discussion Leaders. \n• Held weekly coordinator meetings to brainstorm unique ways to present information that is both educationally stimulating and engaging. \n• Served as a positive role model, motivator and mentor for Discussion Leaders and Undergraduate students. Discussion Leader Coordinator UC Irvine University Studies Discussion Leader Program March 2010  –  January 2013  (2 years 11 months) UC Irvine Department of Undergraduate Education • Worked with a team of 4 other coordinators and supervisor to create and help lead weekly, two hour long training courses covering topics such as public speaking, campus resources, time management, leadership, etc., for a group of 50 Discussion Leaders. \n• Held weekly coordinator meetings to brainstorm unique ways to present information that is both educationally stimulating and engaging. \n• Served as a positive role model, motivator and mentor for Discussion Leaders and Undergraduate students. Activity Coordinator/Volunteer Orangewood Children's Home October 2010  –  December 2012  (2 years 3 months) santa ana, ca •\tPlanned and supervised an activity night for boys and girls ages 6-10 and 11-14. \n•\tDeveloped two-hour lesson plans around a pre-assigned theme. \n•\tProvided a sense of support to children to help along their transition at Orangewood. Activity Coordinator/Volunteer Orangewood Children's Home October 2010  –  December 2012  (2 years 3 months) santa ana, ca •\tPlanned and supervised an activity night for boys and girls ages 6-10 and 11-14. \n•\tDeveloped two-hour lesson plans around a pre-assigned theme. \n•\tProvided a sense of support to children to help along their transition at Orangewood. Administrative Assistant Stanford University School of Medicine July 2012  –  October 2012  (4 months) Stanford University •Assisted Director of the Institute of Stem Cell Biology and Regenerative Medicine by filtering his email and keeping his calendar up to date. \n•Helped Graduate and Post Doctoral lab fellows submit their research papers to reviewers. \n•Answered phone calls and was responsible for organizing conferences and helping individuals obtain documents or papers they needed. Administrative Assistant Stanford University School of Medicine July 2012  –  October 2012  (4 months) Stanford University •Assisted Director of the Institute of Stem Cell Biology and Regenerative Medicine by filtering his email and keeping his calendar up to date. \n•Helped Graduate and Post Doctoral lab fellows submit their research papers to reviewers. \n•Answered phone calls and was responsible for organizing conferences and helping individuals obtain documents or papers they needed. Front Desk Associate Fitness 19 July 2009  –  June 2012  (3 years) San Mateo, CA •\tEntered membership data into computer system and updated billing information. \n•\tOrganized and maintained gym membership filing system and responsible for membership reconciliation. \n•\tHelped trainers market and plan health challenges and events for their clients. Front Desk Associate Fitness 19 July 2009  –  June 2012  (3 years) San Mateo, CA •\tEntered membership data into computer system and updated billing information. \n•\tOrganized and maintained gym membership filing system and responsible for membership reconciliation. \n•\tHelped trainers market and plan health challenges and events for their clients. Skills Microsoft Office Analysis Leadership Management Public Speaking Training Microsoft Excel Time Management Administrative... PowerPoint Microsoft Word Social Media Customer Service Fundraising Social Networking Skills  Microsoft Office Analysis Leadership Management Public Speaking Training Microsoft Excel Time Management Administrative... PowerPoint Microsoft Word Social Media Customer Service Fundraising Social Networking Microsoft Office Analysis Leadership Management Public Speaking Training Microsoft Excel Time Management Administrative... PowerPoint Microsoft Word Social Media Customer Service Fundraising Social Networking Microsoft Office Analysis Leadership Management Public Speaking Training Microsoft Excel Time Management Administrative... PowerPoint Microsoft Word Social Media Customer Service Fundraising Social Networking Education UC Irvine Bachelor of Arts (BA),  Psychology and Social Behavior ,  Educational Studies Minor 2009  – 2013 Activities and Societies:  Undecided/Undeclared mentorship program ,  DUE University Studies Discussion Leader ,  DUE University Studies Discussion Leader Coordinator ,  LGBTQ Ally ,  C.O.A.C.H ,  Alpha Phi International Fraternity ,  Alpha Phi International Fraternity Sports Chair ,  Phi Beta Kappa Honors Society UC Irvine Bachelor of Arts (BA),  Psychology and Social Behavior ,  Educational Studies Minor 2009  – 2013 Activities and Societies:  Undecided/Undeclared mentorship program ,  DUE University Studies Discussion Leader ,  DUE University Studies Discussion Leader Coordinator ,  LGBTQ Ally ,  C.O.A.C.H ,  Alpha Phi International Fraternity ,  Alpha Phi International Fraternity Sports Chair ,  Phi Beta Kappa Honors Society UC Irvine Bachelor of Arts (BA),  Psychology and Social Behavior ,  Educational Studies Minor 2009  – 2013 Activities and Societies:  Undecided/Undeclared mentorship program ,  DUE University Studies Discussion Leader ,  DUE University Studies Discussion Leader Coordinator ,  LGBTQ Ally ,  C.O.A.C.H ,  Alpha Phi International Fraternity ,  Alpha Phi International Fraternity Sports Chair ,  Phi Beta Kappa Honors Society UC Irvine Bachelor of Arts (BA),  Psychology and Social Behavior ,  Educational Studies Minor 2009  – 2013 Activities and Societies:  Undecided/Undeclared mentorship program ,  DUE University Studies Discussion Leader ,  DUE University Studies Discussion Leader Coordinator ,  LGBTQ Ally ,  C.O.A.C.H ,  Alpha Phi International Fraternity ,  Alpha Phi International Fraternity Sports Chair ,  Phi Beta Kappa Honors Society Honors & Awards Phi Beta Kappa Honor Society UC Irvine June 2013 At UC Irvine, only 5% of graduating seniors are invited to join Phi Beta Kappa, the nation's oldest and most prestigious national honors society. The society celebrates and advocates intellectual integrity, tolerance for other views, and a broad range of academic interests in the liberal arts and sciences. Cum Laude UC Irvine June 2013 Graduating with Cum Laude is awarded to students who receive above a 3.653 GPA Phi Beta Kappa Honor Society UC Irvine June 2013 At UC Irvine, only 5% of graduating seniors are invited to join Phi Beta Kappa, the nation's oldest and most prestigious national honors society. The society celebrates and advocates intellectual integrity, tolerance for other views, and a broad range of academic interests in the liberal arts and sciences. Phi Beta Kappa Honor Society UC Irvine June 2013 At UC Irvine, only 5% of graduating seniors are invited to join Phi Beta Kappa, the nation's oldest and most prestigious national honors society. The society celebrates and advocates intellectual integrity, tolerance for other views, and a broad range of academic interests in the liberal arts and sciences. Phi Beta Kappa Honor Society UC Irvine June 2013 At UC Irvine, only 5% of graduating seniors are invited to join Phi Beta Kappa, the nation's oldest and most prestigious national honors society. The society celebrates and advocates intellectual integrity, tolerance for other views, and a broad range of academic interests in the liberal arts and sciences. Cum Laude UC Irvine June 2013 Graduating with Cum Laude is awarded to students who receive above a 3.653 GPA Cum Laude UC Irvine June 2013 Graduating with Cum Laude is awarded to students who receive above a 3.653 GPA Cum Laude UC Irvine June 2013 Graduating with Cum Laude is awarded to students who receive above a 3.653 GPA ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University Education AA Degree AA Degree AA Degree AA Degree ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University Medical Center Administrative Assistant Stanford University Medical Center Administrative Assistant Stanford University Medical Center ", "Experience Administrative Assistant Stanford University Medical Center Administrative Assistant Stanford University Medical Center Administrative Assistant Stanford University Medical Center Skills Neuroscience Microsoft Office Grant Writing Microsoft Word Nonprofits Volunteer Management Event Planning Outlook Microsoft Excel Leadership Program Management Leadership Development Analysis Skills  Neuroscience Microsoft Office Grant Writing Microsoft Word Nonprofits Volunteer Management Event Planning Outlook Microsoft Excel Leadership Program Management Leadership Development Analysis Neuroscience Microsoft Office Grant Writing Microsoft Word Nonprofits Volunteer Management Event Planning Outlook Microsoft Excel Leadership Program Management Leadership Development Analysis Neuroscience Microsoft Office Grant Writing Microsoft Word Nonprofits Volunteer Management Event Planning Outlook Microsoft Excel Leadership Program Management Leadership Development Analysis ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University 2008  –  2008  (less than a year) Temporary position through StanfordTemps. Administrative Assistant Stanford University 2008  –  2008  (less than a year) Temporary position through StanfordTemps. Administrative Assistant Stanford University 2008  –  2008  (less than a year) Temporary position through StanfordTemps. Skills Social Media Strategic Planning Nonprofits Microsoft Office Social Networking Skills  Social Media Strategic Planning Nonprofits Microsoft Office Social Networking Social Media Strategic Planning Nonprofits Microsoft Office Social Networking Social Media Strategic Planning Nonprofits Microsoft Office Social Networking ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University Skills Research Microsoft Office PowerPoint Editing Microsoft Excel Skills  Research Microsoft Office PowerPoint Editing Microsoft Excel Research Microsoft Office PowerPoint Editing Microsoft Excel Research Microsoft Office PowerPoint Editing Microsoft Excel Education University of California, Berkeley 2001  – 2006 University of California, Berkeley 2001  – 2006 University of California, Berkeley 2001  – 2006 University of California, Berkeley 2001  – 2006 ", "Experience Administrative Assistant Stanford University May 1992  –  March 2014  (21 years 11 months) Administrative Assistant Stanford University May 1992  –  March 2014  (21 years 11 months) Administrative Assistant Stanford University May 1992  –  March 2014  (21 years 11 months) Education University of California, Berkeley B.A.,  Linguistics 1969  – 1973 University of California, Berkeley B.A.,  Linguistics 1969  – 1973 University of California, Berkeley B.A.,  Linguistics 1969  – 1973 University of California, Berkeley B.A.,  Linguistics 1969  – 1973 ", "Experience Administrative Assistant Stanford University School of Medicine Administrative Assistant Stanford University School of Medicine Administrative Assistant Stanford University School of Medicine ", "Experience Administrative Assistant Stanford University Medical Center Administrative Assistant Stanford University Medical Center Administrative Assistant Stanford University Medical Center ", "Summary I was an account manager for five years for the Stanford Blood Center at Stanford University. My responsibilities were to recruitment new donors, accounts and management of existing accounts within the SF Bay Area. \nI am also experienced in “cold calling” techniques, networking, and other promotional activities to increase community adoption. I work independently to identify and contract blood donor groups for both mobile and center donations ensuring Blood Center objectives were met. I am a participant in community events such as health fairs to increase public education and awareness. In addition, I tailored recruitment programs to fit community needs. I developed many efforts to increase donor base such as donor retention programs, interacting with the media, minority recruitment, special events, and holiday promotions. \nI coordinated different events and activities with blood drive planners, field recruiters, media relations, collections and laboratory staff to assure smooth integration of all aspects relating to recruitment and drawing of donors. Summary I was an account manager for five years for the Stanford Blood Center at Stanford University. My responsibilities were to recruitment new donors, accounts and management of existing accounts within the SF Bay Area. \nI am also experienced in “cold calling” techniques, networking, and other promotional activities to increase community adoption. I work independently to identify and contract blood donor groups for both mobile and center donations ensuring Blood Center objectives were met. I am a participant in community events such as health fairs to increase public education and awareness. In addition, I tailored recruitment programs to fit community needs. I developed many efforts to increase donor base such as donor retention programs, interacting with the media, minority recruitment, special events, and holiday promotions. \nI coordinated different events and activities with blood drive planners, field recruiters, media relations, collections and laboratory staff to assure smooth integration of all aspects relating to recruitment and drawing of donors. I was an account manager for five years for the Stanford Blood Center at Stanford University. My responsibilities were to recruitment new donors, accounts and management of existing accounts within the SF Bay Area. \nI am also experienced in “cold calling” techniques, networking, and other promotional activities to increase community adoption. I work independently to identify and contract blood donor groups for both mobile and center donations ensuring Blood Center objectives were met. I am a participant in community events such as health fairs to increase public education and awareness. In addition, I tailored recruitment programs to fit community needs. I developed many efforts to increase donor base such as donor retention programs, interacting with the media, minority recruitment, special events, and holiday promotions. \nI coordinated different events and activities with blood drive planners, field recruiters, media relations, collections and laboratory staff to assure smooth integration of all aspects relating to recruitment and drawing of donors. I was an account manager for five years for the Stanford Blood Center at Stanford University. My responsibilities were to recruitment new donors, accounts and management of existing accounts within the SF Bay Area. \nI am also experienced in “cold calling” techniques, networking, and other promotional activities to increase community adoption. I work independently to identify and contract blood donor groups for both mobile and center donations ensuring Blood Center objectives were met. I am a participant in community events such as health fairs to increase public education and awareness. In addition, I tailored recruitment programs to fit community needs. I developed many efforts to increase donor base such as donor retention programs, interacting with the media, minority recruitment, special events, and holiday promotions. \nI coordinated different events and activities with blood drive planners, field recruiters, media relations, collections and laboratory staff to assure smooth integration of all aspects relating to recruitment and drawing of donors. Experience Administrative Assistant Stanford University November 2013  – Present (1 year 10 months) Stanford School of Medicine (Pathology Department) Admin/ Account Manager Stanford Blood Center October 1996  –  November 2013  (17 years 2 months) Stanford University Administrative Assistant Stanford University November 2013  – Present (1 year 10 months) Stanford School of Medicine (Pathology Department) Administrative Assistant Stanford University November 2013  – Present (1 year 10 months) Stanford School of Medicine (Pathology Department) Admin/ Account Manager Stanford Blood Center October 1996  –  November 2013  (17 years 2 months) Stanford University Admin/ Account Manager Stanford Blood Center October 1996  –  November 2013  (17 years 2 months) Stanford University Languages English Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Spanish Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Cross-functional Team... Strategic Planning Event Planning Salesforce.com Team Building Social Media Marketing Project Management Marketing Project Planning Leadership Marketing Strategy Time Management Skills  Cross-functional Team... Strategic Planning Event Planning Salesforce.com Team Building Social Media Marketing Project Management Marketing Project Planning Leadership Marketing Strategy Time Management Cross-functional Team... Strategic Planning Event Planning Salesforce.com Team Building Social Media Marketing Project Management Marketing Project Planning Leadership Marketing Strategy Time Management Cross-functional Team... Strategic Planning Event Planning Salesforce.com Team Building Social Media Marketing Project Management Marketing Project Planning Leadership Marketing Strategy Time Management Education Palo Alto University Bachelor's in Business,  Business Psychology 2013  – 2015 Canada College Redwood City CA Associates in Accouting and Business Administration,  Accounting 2010  – 2013 Palo Alto University Bachelor's degree Palo Alto University Bachelor's in Business,  Business Psychology 2013  – 2015 Palo Alto University Bachelor's in Business,  Business Psychology 2013  – 2015 Palo Alto University Bachelor's in Business,  Business Psychology 2013  – 2015 Canada College Redwood City CA Associates in Accouting and Business Administration,  Accounting 2010  – 2013 Canada College Redwood City CA Associates in Accouting and Business Administration,  Accounting 2010  – 2013 Canada College Redwood City CA Associates in Accouting and Business Administration,  Accounting 2010  – 2013 Palo Alto University Bachelor's degree Palo Alto University Bachelor's degree Palo Alto University Bachelor's degree ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University Skills Higher Education Research Teaching Editing Academic Advising Public Speaking Grant Writing University Teaching Program Development Event Planning Volunteer Management Data Analysis Fundraising Music Skills  Higher Education Research Teaching Editing Academic Advising Public Speaking Grant Writing University Teaching Program Development Event Planning Volunteer Management Data Analysis Fundraising Music Higher Education Research Teaching Editing Academic Advising Public Speaking Grant Writing University Teaching Program Development Event Planning Volunteer Management Data Analysis Fundraising Music Higher Education Research Teaching Editing Academic Advising Public Speaking Grant Writing University Teaching Program Development Event Planning Volunteer Management Data Analysis Fundraising Music Education Bennington College BA,  molecular biology/music 1974  – 1978 Bennington College BA,  molecular biology/music 1974  – 1978 Bennington College BA,  molecular biology/music 1974  – 1978 Bennington College BA,  molecular biology/music 1974  – 1978 ", "Summary • PROJECT COORDINATOR \no Establish and maintain target goals and deadlines \no Create and maintain schedules \no Organize large amounts of data into readable formats for distribution to team \no Central communicator tasked with making sure that all departments are in agreement with  \nproject goals and deadlines; also to review documentation and exchange information \no Adapt quickly to changing priorities and parameters \no Use spreadsheets to organize, analyze, and track data \no Industries: high tech, medical, and academic \n \n• WRITING AND EDITING \no Expertise in writing and editing a broad range of technical documents, standard operating  \nprocedures, letters, and reports \no Write procedures with accuracy and clarity, allowing end users to install and configure products \nreducing calls to technical support \no Edit and proofread documents to ensure accuracy of data \no Test installation procedures of networking products, GUIs, and documentation \no Reduce calls to customer support as a result \no Worked in Agile environment \n \n• ACCOUNTING SKILLS \no Reconcile expenditures for projects \no Track monthly expenses on multiple accounts \no Generate reimbursements \no Create purchase orders; manage accounts payable; execute funds transfers \n \n• COMPUTER SKILLS \no Proficient with Microsoft Word, Excel, PowerPoint, Outlook, Visio, Office Communicator, \nSharePoint, RoboHelp, Adobe Acrobat, SnagIt, and FrameMaker \no Proficient with enterprise software including Oracle Financials and EPIC Summary • PROJECT COORDINATOR \no Establish and maintain target goals and deadlines \no Create and maintain schedules \no Organize large amounts of data into readable formats for distribution to team \no Central communicator tasked with making sure that all departments are in agreement with  \nproject goals and deadlines; also to review documentation and exchange information \no Adapt quickly to changing priorities and parameters \no Use spreadsheets to organize, analyze, and track data \no Industries: high tech, medical, and academic \n \n• WRITING AND EDITING \no Expertise in writing and editing a broad range of technical documents, standard operating  \nprocedures, letters, and reports \no Write procedures with accuracy and clarity, allowing end users to install and configure products \nreducing calls to technical support \no Edit and proofread documents to ensure accuracy of data \no Test installation procedures of networking products, GUIs, and documentation \no Reduce calls to customer support as a result \no Worked in Agile environment \n \n• ACCOUNTING SKILLS \no Reconcile expenditures for projects \no Track monthly expenses on multiple accounts \no Generate reimbursements \no Create purchase orders; manage accounts payable; execute funds transfers \n \n• COMPUTER SKILLS \no Proficient with Microsoft Word, Excel, PowerPoint, Outlook, Visio, Office Communicator, \nSharePoint, RoboHelp, Adobe Acrobat, SnagIt, and FrameMaker \no Proficient with enterprise software including Oracle Financials and EPIC • PROJECT COORDINATOR \no Establish and maintain target goals and deadlines \no Create and maintain schedules \no Organize large amounts of data into readable formats for distribution to team \no Central communicator tasked with making sure that all departments are in agreement with  \nproject goals and deadlines; also to review documentation and exchange information \no Adapt quickly to changing priorities and parameters \no Use spreadsheets to organize, analyze, and track data \no Industries: high tech, medical, and academic \n \n• WRITING AND EDITING \no Expertise in writing and editing a broad range of technical documents, standard operating  \nprocedures, letters, and reports \no Write procedures with accuracy and clarity, allowing end users to install and configure products \nreducing calls to technical support \no Edit and proofread documents to ensure accuracy of data \no Test installation procedures of networking products, GUIs, and documentation \no Reduce calls to customer support as a result \no Worked in Agile environment \n \n• ACCOUNTING SKILLS \no Reconcile expenditures for projects \no Track monthly expenses on multiple accounts \no Generate reimbursements \no Create purchase orders; manage accounts payable; execute funds transfers \n \n• COMPUTER SKILLS \no Proficient with Microsoft Word, Excel, PowerPoint, Outlook, Visio, Office Communicator, \nSharePoint, RoboHelp, Adobe Acrobat, SnagIt, and FrameMaker \no Proficient with enterprise software including Oracle Financials and EPIC • PROJECT COORDINATOR \no Establish and maintain target goals and deadlines \no Create and maintain schedules \no Organize large amounts of data into readable formats for distribution to team \no Central communicator tasked with making sure that all departments are in agreement with  \nproject goals and deadlines; also to review documentation and exchange information \no Adapt quickly to changing priorities and parameters \no Use spreadsheets to organize, analyze, and track data \no Industries: high tech, medical, and academic \n \n• WRITING AND EDITING \no Expertise in writing and editing a broad range of technical documents, standard operating  \nprocedures, letters, and reports \no Write procedures with accuracy and clarity, allowing end users to install and configure products \nreducing calls to technical support \no Edit and proofread documents to ensure accuracy of data \no Test installation procedures of networking products, GUIs, and documentation \no Reduce calls to customer support as a result \no Worked in Agile environment \n \n• ACCOUNTING SKILLS \no Reconcile expenditures for projects \no Track monthly expenses on multiple accounts \no Generate reimbursements \no Create purchase orders; manage accounts payable; execute funds transfers \n \n• COMPUTER SKILLS \no Proficient with Microsoft Word, Excel, PowerPoint, Outlook, Visio, Office Communicator, \nSharePoint, RoboHelp, Adobe Acrobat, SnagIt, and FrameMaker \no Proficient with enterprise software including Oracle Financials and EPIC Experience Project Coordinator (Contract) Palo Alto Medical Foundation February 2014  –  September 2014  (8 months) Sunnyvale, CA Coordinate the training of PAMF physicians and mid-level employees to prepare for the switch from ICD-9 to ICD-10 diagnostic coding throughout the United States.  \n•\tTracked completion of training (through online modules, videos, and in-person training) in spreadsheets. \n•\tTracked over 1500 participants. \n•\tCommunicated with five local hospitals to track their training of PAMF staff. \n•\tCommunicated daily with IT, facilities, catering, and support staff for in-person training sessions. \n•\tAnalyzed data to determine project’s progress and sent updates to directors. \n•\tCoordinated training sessions on nine sites. \n•\tIncorporated changing parameters into the schedule. \n•\tWrote and edited documentation for RAF auditing department (policy and procedures, etc.) \n•\tWrote User Guide for internal RAF audit program. \n•\tWorked in EPIC to gather chart records for patients for coding department. \n•\tCommunicated EPIC software problems to SutterHealth IT. Contract Administrative Assistant Stanford University June 2013  –  October 2013  (5 months) Stanford, CA Assigned to oversee all Oracle Financial tasks: completed iJournal transfers, paid POs, reimbursed doctors and staff, validated travel card transactions, and verified transactions for department purchasing cards. Contract Project Coordinator/Lead Writer, Retail Business Unit NETGEAR November 2012  –  February 2013  (4 months) San Jose, CA Set up Excel spreadsheets to track up to 80 products in the retail business unit for technical publications.  \n• Tracked documentation schedules; updated weekly. \n• Assigned projects to writers.  \n• Tracked multi-country SKUs.  \n• Posted completed documents to Agile. \n• Wrote task-oriented documentation for new products and revised documentation for current products. Contract Administrative Assistant Stanford University March 2012  –  September 2012  (7 months) Stanford, CA • Processed invoices and created and extended blanket purchase orders using the Oracle financial program. \n• Transferred funds using iJournal. \n• Ordered supplies for use in hazardous environments.  \n• Edited documents and created spreadsheets to track departmental expenditures. Contract Technical Writer Dell Force10 2011  –  2011  (less than a year) San Jose, CA Contract Technical Writer EventRadar, LLC 2010  –  2011  (1 year) • Enhanced internal communication by providing writing services. A startup company working on an application for the Apple iPhone and iPad (http://m.eventradar.com). Tasks included editing the API, the business plan, contributing to the database, and assisting with UI design. Sr. Information Developer Symantec 2008  –  2009  (1 year) • Created and edited the Symantec FileStore file storage documentation for Versions 5.0.1, 5.0.2, and 5.5 releases.  \n• Created new template for the CLI administrator’s guide to improve usability. \n• Edited CLI man pages for clarity and consistency. \n• Maintained communication with engineers in Mountain View, England, and India to ensure consistency. Administrative Assistant Stanford University 2005  –  2008  (3 years) Responsibilities included writing and maintaining general workplace procedures, “How To” documents, transcribing articles, writing letters, writing and editing protocols, job descriptions, conference brochures, and CVs. Contract Technical Writer Various Companies 2003  –  2005  (2 years) Short-term writing and editing projects included online help, style guides, updating datasheets, installation guides, quick start installation guides, administrator’s guide, and policies and procedures guide. Project Coordinator (Contract) Palo Alto Medical Foundation February 2014  –  September 2014  (8 months) Sunnyvale, CA Coordinate the training of PAMF physicians and mid-level employees to prepare for the switch from ICD-9 to ICD-10 diagnostic coding throughout the United States.  \n•\tTracked completion of training (through online modules, videos, and in-person training) in spreadsheets. \n•\tTracked over 1500 participants. \n•\tCommunicated with five local hospitals to track their training of PAMF staff. \n•\tCommunicated daily with IT, facilities, catering, and support staff for in-person training sessions. \n•\tAnalyzed data to determine project’s progress and sent updates to directors. \n•\tCoordinated training sessions on nine sites. \n•\tIncorporated changing parameters into the schedule. \n•\tWrote and edited documentation for RAF auditing department (policy and procedures, etc.) \n•\tWrote User Guide for internal RAF audit program. \n•\tWorked in EPIC to gather chart records for patients for coding department. \n•\tCommunicated EPIC software problems to SutterHealth IT. Project Coordinator (Contract) Palo Alto Medical Foundation February 2014  –  September 2014  (8 months) Sunnyvale, CA Coordinate the training of PAMF physicians and mid-level employees to prepare for the switch from ICD-9 to ICD-10 diagnostic coding throughout the United States.  \n•\tTracked completion of training (through online modules, videos, and in-person training) in spreadsheets. \n•\tTracked over 1500 participants. \n•\tCommunicated with five local hospitals to track their training of PAMF staff. \n•\tCommunicated daily with IT, facilities, catering, and support staff for in-person training sessions. \n•\tAnalyzed data to determine project’s progress and sent updates to directors. \n•\tCoordinated training sessions on nine sites. \n•\tIncorporated changing parameters into the schedule. \n•\tWrote and edited documentation for RAF auditing department (policy and procedures, etc.) \n•\tWrote User Guide for internal RAF audit program. \n•\tWorked in EPIC to gather chart records for patients for coding department. \n•\tCommunicated EPIC software problems to SutterHealth IT. Contract Administrative Assistant Stanford University June 2013  –  October 2013  (5 months) Stanford, CA Assigned to oversee all Oracle Financial tasks: completed iJournal transfers, paid POs, reimbursed doctors and staff, validated travel card transactions, and verified transactions for department purchasing cards. Contract Administrative Assistant Stanford University June 2013  –  October 2013  (5 months) Stanford, CA Assigned to oversee all Oracle Financial tasks: completed iJournal transfers, paid POs, reimbursed doctors and staff, validated travel card transactions, and verified transactions for department purchasing cards. Contract Project Coordinator/Lead Writer, Retail Business Unit NETGEAR November 2012  –  February 2013  (4 months) San Jose, CA Set up Excel spreadsheets to track up to 80 products in the retail business unit for technical publications.  \n• Tracked documentation schedules; updated weekly. \n• Assigned projects to writers.  \n• Tracked multi-country SKUs.  \n• Posted completed documents to Agile. \n• Wrote task-oriented documentation for new products and revised documentation for current products. Contract Project Coordinator/Lead Writer, Retail Business Unit NETGEAR November 2012  –  February 2013  (4 months) San Jose, CA Set up Excel spreadsheets to track up to 80 products in the retail business unit for technical publications.  \n• Tracked documentation schedules; updated weekly. \n• Assigned projects to writers.  \n• Tracked multi-country SKUs.  \n• Posted completed documents to Agile. \n• Wrote task-oriented documentation for new products and revised documentation for current products. Contract Administrative Assistant Stanford University March 2012  –  September 2012  (7 months) Stanford, CA • Processed invoices and created and extended blanket purchase orders using the Oracle financial program. \n• Transferred funds using iJournal. \n• Ordered supplies for use in hazardous environments.  \n• Edited documents and created spreadsheets to track departmental expenditures. Contract Administrative Assistant Stanford University March 2012  –  September 2012  (7 months) Stanford, CA • Processed invoices and created and extended blanket purchase orders using the Oracle financial program. \n• Transferred funds using iJournal. \n• Ordered supplies for use in hazardous environments.  \n• Edited documents and created spreadsheets to track departmental expenditures. Contract Technical Writer Dell Force10 2011  –  2011  (less than a year) San Jose, CA Contract Technical Writer Dell Force10 2011  –  2011  (less than a year) San Jose, CA Contract Technical Writer EventRadar, LLC 2010  –  2011  (1 year) • Enhanced internal communication by providing writing services. A startup company working on an application for the Apple iPhone and iPad (http://m.eventradar.com). Tasks included editing the API, the business plan, contributing to the database, and assisting with UI design. Contract Technical Writer EventRadar, LLC 2010  –  2011  (1 year) • Enhanced internal communication by providing writing services. A startup company working on an application for the Apple iPhone and iPad (http://m.eventradar.com). Tasks included editing the API, the business plan, contributing to the database, and assisting with UI design. Sr. Information Developer Symantec 2008  –  2009  (1 year) • Created and edited the Symantec FileStore file storage documentation for Versions 5.0.1, 5.0.2, and 5.5 releases.  \n• Created new template for the CLI administrator’s guide to improve usability. \n• Edited CLI man pages for clarity and consistency. \n• Maintained communication with engineers in Mountain View, England, and India to ensure consistency. Sr. Information Developer Symantec 2008  –  2009  (1 year) • Created and edited the Symantec FileStore file storage documentation for Versions 5.0.1, 5.0.2, and 5.5 releases.  \n• Created new template for the CLI administrator’s guide to improve usability. \n• Edited CLI man pages for clarity and consistency. \n• Maintained communication with engineers in Mountain View, England, and India to ensure consistency. Administrative Assistant Stanford University 2005  –  2008  (3 years) Responsibilities included writing and maintaining general workplace procedures, “How To” documents, transcribing articles, writing letters, writing and editing protocols, job descriptions, conference brochures, and CVs. Administrative Assistant Stanford University 2005  –  2008  (3 years) Responsibilities included writing and maintaining general workplace procedures, “How To” documents, transcribing articles, writing letters, writing and editing protocols, job descriptions, conference brochures, and CVs. Contract Technical Writer Various Companies 2003  –  2005  (2 years) Short-term writing and editing projects included online help, style guides, updating datasheets, installation guides, quick start installation guides, administrator’s guide, and policies and procedures guide. Contract Technical Writer Various Companies 2003  –  2005  (2 years) Short-term writing and editing projects included online help, style guides, updating datasheets, installation guides, quick start installation guides, administrator’s guide, and policies and procedures guide. Languages Italian Italian Italian Skills Technical Writing Microsoft Office Oracle Financials Organizational... Highly detail oriented Editing/Proofreading Quality Assurance Editing SharePoint Documentation Visio Agile Methodologies Training Integration Skills  Technical Writing Microsoft Office Oracle Financials Organizational... Highly detail oriented Editing/Proofreading Quality Assurance Editing SharePoint Documentation Visio Agile Methodologies Training Integration Technical Writing Microsoft Office Oracle Financials Organizational... Highly detail oriented Editing/Proofreading Quality Assurance Editing SharePoint Documentation Visio Agile Methodologies Training Integration Technical Writing Microsoft Office Oracle Financials Organizational... Highly detail oriented Editing/Proofreading Quality Assurance Editing SharePoint Documentation Visio Agile Methodologies Training Integration Education University of California, Davis B.A.,  Economics University of California, Davis B.A.,  Economics University of California, Davis B.A.,  Economics University of California, Davis B.A.,  Economics ", "Experience Administrative Assistant Stanford University Medical Center May 2009  – Present (6 years 4 months) Accounting Specialist Achronix Semiconductor June 2009  –  May 2010  (1 year) Administrative Assistant Stanford University Medical Center 2009  –  2010  (1 year) Administrative Assistant Stanford University Medical Center May 2009  – Present (6 years 4 months) Administrative Assistant Stanford University Medical Center May 2009  – Present (6 years 4 months) Accounting Specialist Achronix Semiconductor June 2009  –  May 2010  (1 year) Accounting Specialist Achronix Semiconductor June 2009  –  May 2010  (1 year) Administrative Assistant Stanford University Medical Center 2009  –  2010  (1 year) Administrative Assistant Stanford University Medical Center 2009  –  2010  (1 year) ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University January 2007  – Present (8 years 8 months) Exec. Asst. Peninsula Control Panels, Inc. 1996  –  2007  (11 years) Administrative Assistant Stanford University January 2007  – Present (8 years 8 months) Administrative Assistant Stanford University January 2007  – Present (8 years 8 months) Exec. Asst. Peninsula Control Panels, Inc. 1996  –  2007  (11 years) Exec. Asst. Peninsula Control Panels, Inc. 1996  –  2007  (11 years) Skills Administrative Support Outlook Word PowerPoint Microsoft Office Excel Event Planning Administration Data Entry Office Management Calendars Spreadsheets Customer Service Scheduling Typing Calendaring Telephone Skills Quickbooks Filemaker Pro Accounts Payable Billing Database Administration Grant Writing Adobe Acrobat WordPerfect Teamwork Problem Solving Budgeting Mac Proofreading Administrative... Microsoft Excel Microsoft Word System Administration Invoicing Office Administration Travel Arrangements See 22+     See less Skills  Administrative Support Outlook Word PowerPoint Microsoft Office Excel Event Planning Administration Data Entry Office Management Calendars Spreadsheets Customer Service Scheduling Typing Calendaring Telephone Skills Quickbooks Filemaker Pro Accounts Payable Billing Database Administration Grant Writing Adobe Acrobat WordPerfect Teamwork Problem Solving Budgeting Mac Proofreading Administrative... Microsoft Excel Microsoft Word System Administration Invoicing Office Administration Travel Arrangements See 22+     See less Administrative Support Outlook Word PowerPoint Microsoft Office Excel Event Planning Administration Data Entry Office Management Calendars Spreadsheets Customer Service Scheduling Typing Calendaring Telephone Skills Quickbooks Filemaker Pro Accounts Payable Billing Database Administration Grant Writing Adobe Acrobat WordPerfect Teamwork Problem Solving Budgeting Mac Proofreading Administrative... Microsoft Excel Microsoft Word System Administration Invoicing Office Administration Travel Arrangements See 22+     See less Administrative Support Outlook Word PowerPoint Microsoft Office Excel Event Planning Administration Data Entry Office Management Calendars Spreadsheets Customer Service Scheduling Typing Calendaring Telephone Skills Quickbooks Filemaker Pro Accounts Payable Billing Database Administration Grant Writing Adobe Acrobat WordPerfect Teamwork Problem Solving Budgeting Mac Proofreading Administrative... Microsoft Excel Microsoft Word System Administration Invoicing Office Administration Travel Arrangements See 22+     See less ", "Experience HR Administrative Assistant Stanford University HR Administrative Assistant Stanford University HR Administrative Assistant Stanford University ", "Experience Administrative Assistant Stanford University Administrative Assistant Stanford University Administrative Assistant Stanford University Education University of Minnesota-Twin Cities University of Minnesota-Twin Cities University of Minnesota-Twin Cities University of Minnesota-Twin Cities "]}