{"position": "Administrative Assistant IV", "company": "Stanford University", "profiles": ["Experience Office Coordinator Palo Alto Medical Foundation Marketing Assistant Palo Alto Medical Foundation 2003  –  2009  (6 years) Patient Resource Representative & Health Education Assistant Camio Medical Group 2004  –  2008  (4 years) Patient Resource Representative/Customer Service Representative Camno Medical Group 1996  –  2005  (9 years) Administrative Assistant IV Stanford University School of Medicine 1990  –  1996  (6 years) Personnel Office Administrative Assistant U.S. Geological Survey (USGS) 1978  –  1990  (12 years) Medical Secretary/Office Manager B.J. Smith Medical Office 1977  –  1978  (1 year) Office Coordinator Palo Alto Medical Foundation Office Coordinator Palo Alto Medical Foundation Marketing Assistant Palo Alto Medical Foundation 2003  –  2009  (6 years) Marketing Assistant Palo Alto Medical Foundation 2003  –  2009  (6 years) Patient Resource Representative & Health Education Assistant Camio Medical Group 2004  –  2008  (4 years) Patient Resource Representative & Health Education Assistant Camio Medical Group 2004  –  2008  (4 years) Patient Resource Representative/Customer Service Representative Camno Medical Group 1996  –  2005  (9 years) Patient Resource Representative/Customer Service Representative Camno Medical Group 1996  –  2005  (9 years) Administrative Assistant IV Stanford University School of Medicine 1990  –  1996  (6 years) Administrative Assistant IV Stanford University School of Medicine 1990  –  1996  (6 years) Personnel Office Administrative Assistant U.S. Geological Survey (USGS) 1978  –  1990  (12 years) Personnel Office Administrative Assistant U.S. Geological Survey (USGS) 1978  –  1990  (12 years) Medical Secretary/Office Manager B.J. Smith Medical Office 1977  –  1978  (1 year) Medical Secretary/Office Manager B.J. Smith Medical Office 1977  –  1978  (1 year) Skills Healthcare Management EMR Medical Terminology Healthcare EHR HIPAA Hospitals Healthcare Information... Clinical Research Outlook Microsoft Office Epic Systems Home Care Health Education Medicine Managed Care Public Health See 2+     See less Skills  Healthcare Management EMR Medical Terminology Healthcare EHR HIPAA Hospitals Healthcare Information... Clinical Research Outlook Microsoft Office Epic Systems Home Care Health Education Medicine Managed Care Public Health See 2+     See less Healthcare Management EMR Medical Terminology Healthcare EHR HIPAA Hospitals Healthcare Information... Clinical Research Outlook Microsoft Office Epic Systems Home Care Health Education Medicine Managed Care Public Health See 2+     See less Healthcare Management EMR Medical Terminology Healthcare EHR HIPAA Hospitals Healthcare Information... Clinical Research Outlook Microsoft Office Epic Systems Home Care Health Education Medicine Managed Care Public Health See 2+     See less Education Academy of Arts Univ./Brooks College Associate of Arts (AA),  Fashion Design/Business and Fashion Merchandising , 3.96 gpa 2006  – 2009 Foothill/DeAnza College Business Admin /Microsoft Apps Academy of Arts Univ./Brooks College Associate of Arts (AA),  Fashion Design/Business and Fashion Merchandising , 3.96 gpa 2006  – 2009 Academy of Arts Univ./Brooks College Associate of Arts (AA),  Fashion Design/Business and Fashion Merchandising , 3.96 gpa 2006  – 2009 Academy of Arts Univ./Brooks College Associate of Arts (AA),  Fashion Design/Business and Fashion Merchandising , 3.96 gpa 2006  – 2009 Foothill/DeAnza College Business Admin /Microsoft Apps Foothill/DeAnza College Business Admin /Microsoft Apps Foothill/DeAnza College Business Admin /Microsoft Apps ", "Languages Spanish Spanish Spanish Skills Higher Education Instructional Design E-Learning Editing Data Analysis Curriculum Development Curriculum Design IT Service Management Public Speaking Program Management Technical Writing Leadership Marketing Teaching Research Training Human Resources Time Management Customer Service Project Management Analysis PeopleSoft Event Planning Strategic Planning See 9+     See less Skills  Higher Education Instructional Design E-Learning Editing Data Analysis Curriculum Development Curriculum Design IT Service Management Public Speaking Program Management Technical Writing Leadership Marketing Teaching Research Training Human Resources Time Management Customer Service Project Management Analysis PeopleSoft Event Planning Strategic Planning See 9+     See less Higher Education Instructional Design E-Learning Editing Data Analysis Curriculum Development Curriculum Design IT Service Management Public Speaking Program Management Technical Writing Leadership Marketing Teaching Research Training Human Resources Time Management Customer Service Project Management Analysis PeopleSoft Event Planning Strategic Planning See 9+     See less Higher Education Instructional Design E-Learning Editing Data Analysis Curriculum Development Curriculum Design IT Service Management Public Speaking Program Management Technical Writing Leadership Marketing Teaching Research Training Human Resources Time Management Customer Service Project Management Analysis PeopleSoft Event Planning Strategic Planning See 9+     See less ", "Summary • Multiple Subject Teaching Credential Candidate \n• Full time undergraduate student - Liberal Arts & Sciences, Childhood Studies \n• Extensive experience as an Administrator/Executive Assistant  \n• Experience in Banking, Construction, Technology and Education \n• Demonstrated ability to provide effective customer service, office management, and automated information systems \n• Proficient in Microsoft Office, Outlook, SAP, HRIS and Internet savvy \n \nAdministrative Specialties: Knowledgeable in word, power point, excel and various SAP systems. Able to quickly learn new software packages. Mass mailing; calendaring of events. Process expense reports, purchase orders, travel and life cycle events. \n \nUndergraduate Studies Specialties: Childhood Development; Human Development; Ethnic Studies. Summary • Multiple Subject Teaching Credential Candidate \n• Full time undergraduate student - Liberal Arts & Sciences, Childhood Studies \n• Extensive experience as an Administrator/Executive Assistant  \n• Experience in Banking, Construction, Technology and Education \n• Demonstrated ability to provide effective customer service, office management, and automated information systems \n• Proficient in Microsoft Office, Outlook, SAP, HRIS and Internet savvy \n \nAdministrative Specialties: Knowledgeable in word, power point, excel and various SAP systems. Able to quickly learn new software packages. Mass mailing; calendaring of events. Process expense reports, purchase orders, travel and life cycle events. \n \nUndergraduate Studies Specialties: Childhood Development; Human Development; Ethnic Studies. • Multiple Subject Teaching Credential Candidate \n• Full time undergraduate student - Liberal Arts & Sciences, Childhood Studies \n• Extensive experience as an Administrator/Executive Assistant  \n• Experience in Banking, Construction, Technology and Education \n• Demonstrated ability to provide effective customer service, office management, and automated information systems \n• Proficient in Microsoft Office, Outlook, SAP, HRIS and Internet savvy \n \nAdministrative Specialties: Knowledgeable in word, power point, excel and various SAP systems. Able to quickly learn new software packages. Mass mailing; calendaring of events. Process expense reports, purchase orders, travel and life cycle events. \n \nUndergraduate Studies Specialties: Childhood Development; Human Development; Ethnic Studies. • Multiple Subject Teaching Credential Candidate \n• Full time undergraduate student - Liberal Arts & Sciences, Childhood Studies \n• Extensive experience as an Administrator/Executive Assistant  \n• Experience in Banking, Construction, Technology and Education \n• Demonstrated ability to provide effective customer service, office management, and automated information systems \n• Proficient in Microsoft Office, Outlook, SAP, HRIS and Internet savvy \n \nAdministrative Specialties: Knowledgeable in word, power point, excel and various SAP systems. Able to quickly learn new software packages. Mass mailing; calendaring of events. Process expense reports, purchase orders, travel and life cycle events. \n \nUndergraduate Studies Specialties: Childhood Development; Human Development; Ethnic Studies. Experience Multiple Subject Teaching Credential Candidate CalStateTEACH August 2014  – Present (1 year 1 month) Monterey Bay Elementary student teacher in Alameda County School District -Title 1, 4th grade setting - 30 students. Prior term - 1st grade, non Title 1 environment. 445 hours for student teaching. Used G.L.A.D. techniques to teach a balanced literacy approach for visual, tactile, and auditory learners. Administered and analyzed weekly student assessments. Helped struggling English Learners and Native English speakers through various intervention strategies. Some strategies used: echo; choral and guided reading for students struggling with reading comprehension; one on one, small, and whole group tutoring; peer scaffolding; modeling differences between word by word reading and fluent phrasing; and providing students support, encouragement and extra time on tests when needed. Maintained a classroom environment that fostered all inclusive learning. Developed positive relationships with parents, students and staff.  \n \nIlluminate software; Engrade; Smartboard; PowerPoint; Microsoft Word; Microsoft Excel; scanning; copier; lesson creation and implementation; small group tutoring; One on One tutoring; Reading/Math assessments; Common Core; Multisubject Instruction; Behavioral Management; Guided Reading; G.L.A.D. Techniques; P21 skills; Common Core & State Standards; Running Records and Miscue analysis; Rubric scale; Comprehensive Literacy Study CaseReports; Effectively maintain student interest and provided interactive atmosphere which enabled students to help become the best they can be. Instilled the love of learning for all multisubjects, especially math and reading.  \n \nAssessments used to support my students learning: Oral Language Survey; Reading Interests and attitudes; Graded word tests; Handwriting and spelling analysis; Reading comprehension; narrative and expository text; San Diego Quick Test; Elementary Spelling Inventory; Attitude and Interest Survey; Fluency; and Math.  \n \nPassed TPA 1 with a 3 and TPA 2 with a 4. \nReference for both assignments per request. Student Volunteer J. Haley Durham Elementary School April 2015  –  June 2015  (3 months) Fremont, CA Student Volunteer, after student teaching assignment. Help master teacher with grading papers and administrative work. Mentor students on reading, writing, arithmetic. Student Volunteer Ardenwood Elementary School April 2015  –  June 2015  (3 months) Fremont, California Student Volunteer after teaching assignment. Help master teacher with superivising Friday math games. Help First Grade class with math using technology and hands on learning. After games, help students journal what they have learned during activity. Classroom Volunteer Warwick Elementary School August 2010  –  June 2014  (3 years 11 months) Fremont, California Classroom Volunteer. One of many volunteers in and out of the classroom. Helping students with their classroom projects and end of the year activities. Helping teacher correct homework assignments given daily to students. Fulltime Undergraduate Student California State University, East Bay September 2011  –  March 2013  (1 year 7 months) Hayward, California Undergraduate Studies. Liberal Arts& Sciences, Option in Childhood Studies. Degree awarded March 2013 Online Student Los Angeles Pierce Community College August 2008  –  June 2011  (2 years 11 months) Fremont, CA Completed two Associates Degrees in Behavioral and Social Sciences and Liberal Arts & Sciences in General Studies. Sr. Administrative Specialist/Notary Public, Private Client Services City National Bank March 2008  –  August 2010  (2 years 6 months) Sr. Administrative Assistant to Private Client Services, Treasury, Core and Commercial Banking executives. \nExercise considerable discretion and independent judgment and capable of analyzing complex information requests and determining complex trends. Work independently on projects that require detailed investigation, analysis and problem solving skills. Train colleagues on new office products and procedures. Coordinate company events and charitable giving. Update existing Excel spreadsheets and assisting management with the creation of PowerPoint presentations, team player. Input and maintain complex internal database and related reports. Provide guidance and direction to other support colleagues. Delegate work assignments and monitors completion. Assist with and/or assume responsibility for a variety of small projects. Represent the manager and team to both external and internal clients consistent with the CNB culture of relationship management. Schedule video/audio conference calls. Notarize various client records as needed. Answer delicate client questions and direct them to the appropriate department. Sr. Administrative Assistant/Office Manager, Northwest Sales & Engineering Department, (Temporary) Wind River October 2007  –  March 2008  (6 months) Travel coordinator, company event coordinator for both on and off campus, track sales, weekly status reports update, office manager, calendar management skills, including the coordination of complex executive meetings, supplies. Set up office and equipment for new hires, badge new employees and collect badges and disable them from terminated employees. Update org charts and office space. Assist with and/or assume responsibility for a variety of small projects. Fed ex, ups, phones, filing, set up and breakdown of rooms for meetings and classes. Assist with marketing events setting up booths, assembling brochures, ordering Materials. Facilitate new administrative “how to” guide and other duties as assigned. Administrative Assistant IV Stanford University January 2007  –  July 2007  (7 months) Prepare correspondence, filing, timesheets, expense reports for management and scientific teams, iprocurement, dept., Calendar meetings, outgoing and incoming mail distribution, and prioritizing tasks as appropriate. Write informational guidelines on relevant procedures and policies for division managers and administrators. Supervise, train, hire and release student workers. Back up Petty Cash window as needed. Oversee the Stanford University Departmental Accounts: Responsible for up-to-date status on faculty accounts. Perform comprehensive account reconciliations of all expenditures, which will total several hundred thousand dollars, develop and track the budget monthly and answer questions as required. Perform comprehensive reconciliations on other University accounts such as conferences, royalties, special support, awards to individuals, team player. Administrative Assistant IV - Budgets Stanford Linear Accelerator Center June 2006  –  January 2007  (8 months) Prepare correspondence, filing, timesheets, expense reports for management and scientific teams, iprocurement, dept., Calendar meetings, outgoing and incoming mail distribution, and prioritizing tasks as appropriate. Write informational guidelines on relevant procedures and policies for division managers and administrators. Supervise, train, hire and release student workers. Back up Petty Cash window as needed. Oversee the Stanford University Departmental Accounts: Responsible for up-to-date status on faculty accounts. Perform comprehensive account reconciliations of all expenditures, which will total several hundred thousand dollars, develop and track the budget monthly and answer questions as required. Perform comprehensive reconciliations on other University accounts such as conferences, royalties, special support, awards to individuals, team player. Executive Admin Audit Department-(Temporary Position) Safeway Corporation April 2006  –  June 2006  (3 months) Executive Admin Audit Department-(Temporary Position) \nPoint contact and training of new administrative assistants, maintain vacation and sick leave logs. Maintained documents and files and information systems Reviewed and distributed department correspondence. Created and maintained project filing systems. Worked closely with the various VP’s and COO by assisting with and/or assuming responsibility for a variety of small projects. Processed and maintained expenses and business travel itinerary. Answer and screen all incoming calls and then forwarded them to appropriate person(s). Maintained daily calendars for top management. Compose/draft correspondence and edit/ proof correspondence prepared by others, participate in staff meetings and other meetings as needed. Operations Coordinator RGA Environmental, Inc. March 2002  –  November 2005  (3 years 9 months) Support Owners, CFO, Head Accountants, Project Managers and Technical Staff. Responsible for travel arrangements of all managers and staff. Expense reports, time keeper, schedules, front desk administrator. Coordinator for all employee training and State of California OSHA certifications for contractors and subcontractors. Key person for insurance coordination and contracts administration and company financials. Process timesheets, certified payroll, California Employment Development Audits, input accounts payable and receivable, bank reconciliation, pre-liens and expense reports. Support HR with employee verifications, Internet searches, download resumes and input into HRIS database. Trained new administrative assistants. New hire orientation and exiting employee papers. Maintained vacation and sick leave logs. Benefits point of contact. Maintained Office by order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. Executive Administrative Assistant/Office Manager/HR/Operations Coordinator Construction & Engineering January 2000  –  March 2002  (2 years 3 months) Support Owners, CFO, Head Accountants, Project Managers and Technical Staff. Responsible for travel arrangements of all managers and staff. Expense reports, time keeper, schedules, front desk administrator. Coordinator for all employee training and State of California OSHA certifications for contractors and subcontractors. Key person for insurance coordination and contracts administration and company financials. Process timesheets, certified payroll, California Employment Development Audits, input accounts payable and receivable, bank reconciliation, pre-liens and expense reports. Support HR with employee verifications, Internet searches, download resumes and input into HRIS database. Trained new administrative assistants. New hire orientation and exiting employee papers. Maintained vacation and sick leave logs. Benefits point of contact. Maintained Office by order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. . Data Analyst Bisys Research October 1992  –  October 1997  (5 years 1 month) Technical writer for employee and administrative manuals. Data preparation for various programs such as Foxpro, Lotus and Excel systems Report preparation of complex projects given by management and then sent to banking clientele. Maintain Office - order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. Multiple Subject Teaching Credential Candidate CalStateTEACH August 2014  – Present (1 year 1 month) Monterey Bay Elementary student teacher in Alameda County School District -Title 1, 4th grade setting - 30 students. Prior term - 1st grade, non Title 1 environment. 445 hours for student teaching. Used G.L.A.D. techniques to teach a balanced literacy approach for visual, tactile, and auditory learners. Administered and analyzed weekly student assessments. Helped struggling English Learners and Native English speakers through various intervention strategies. Some strategies used: echo; choral and guided reading for students struggling with reading comprehension; one on one, small, and whole group tutoring; peer scaffolding; modeling differences between word by word reading and fluent phrasing; and providing students support, encouragement and extra time on tests when needed. Maintained a classroom environment that fostered all inclusive learning. Developed positive relationships with parents, students and staff.  \n \nIlluminate software; Engrade; Smartboard; PowerPoint; Microsoft Word; Microsoft Excel; scanning; copier; lesson creation and implementation; small group tutoring; One on One tutoring; Reading/Math assessments; Common Core; Multisubject Instruction; Behavioral Management; Guided Reading; G.L.A.D. Techniques; P21 skills; Common Core & State Standards; Running Records and Miscue analysis; Rubric scale; Comprehensive Literacy Study CaseReports; Effectively maintain student interest and provided interactive atmosphere which enabled students to help become the best they can be. Instilled the love of learning for all multisubjects, especially math and reading.  \n \nAssessments used to support my students learning: Oral Language Survey; Reading Interests and attitudes; Graded word tests; Handwriting and spelling analysis; Reading comprehension; narrative and expository text; San Diego Quick Test; Elementary Spelling Inventory; Attitude and Interest Survey; Fluency; and Math.  \n \nPassed TPA 1 with a 3 and TPA 2 with a 4. \nReference for both assignments per request. Multiple Subject Teaching Credential Candidate CalStateTEACH August 2014  – Present (1 year 1 month) Monterey Bay Elementary student teacher in Alameda County School District -Title 1, 4th grade setting - 30 students. Prior term - 1st grade, non Title 1 environment. 445 hours for student teaching. Used G.L.A.D. techniques to teach a balanced literacy approach for visual, tactile, and auditory learners. Administered and analyzed weekly student assessments. Helped struggling English Learners and Native English speakers through various intervention strategies. Some strategies used: echo; choral and guided reading for students struggling with reading comprehension; one on one, small, and whole group tutoring; peer scaffolding; modeling differences between word by word reading and fluent phrasing; and providing students support, encouragement and extra time on tests when needed. Maintained a classroom environment that fostered all inclusive learning. Developed positive relationships with parents, students and staff.  \n \nIlluminate software; Engrade; Smartboard; PowerPoint; Microsoft Word; Microsoft Excel; scanning; copier; lesson creation and implementation; small group tutoring; One on One tutoring; Reading/Math assessments; Common Core; Multisubject Instruction; Behavioral Management; Guided Reading; G.L.A.D. Techniques; P21 skills; Common Core & State Standards; Running Records and Miscue analysis; Rubric scale; Comprehensive Literacy Study CaseReports; Effectively maintain student interest and provided interactive atmosphere which enabled students to help become the best they can be. Instilled the love of learning for all multisubjects, especially math and reading.  \n \nAssessments used to support my students learning: Oral Language Survey; Reading Interests and attitudes; Graded word tests; Handwriting and spelling analysis; Reading comprehension; narrative and expository text; San Diego Quick Test; Elementary Spelling Inventory; Attitude and Interest Survey; Fluency; and Math.  \n \nPassed TPA 1 with a 3 and TPA 2 with a 4. \nReference for both assignments per request. Student Volunteer J. Haley Durham Elementary School April 2015  –  June 2015  (3 months) Fremont, CA Student Volunteer, after student teaching assignment. Help master teacher with grading papers and administrative work. Mentor students on reading, writing, arithmetic. Student Volunteer J. Haley Durham Elementary School April 2015  –  June 2015  (3 months) Fremont, CA Student Volunteer, after student teaching assignment. Help master teacher with grading papers and administrative work. Mentor students on reading, writing, arithmetic. Student Volunteer Ardenwood Elementary School April 2015  –  June 2015  (3 months) Fremont, California Student Volunteer after teaching assignment. Help master teacher with superivising Friday math games. Help First Grade class with math using technology and hands on learning. After games, help students journal what they have learned during activity. Student Volunteer Ardenwood Elementary School April 2015  –  June 2015  (3 months) Fremont, California Student Volunteer after teaching assignment. Help master teacher with superivising Friday math games. Help First Grade class with math using technology and hands on learning. After games, help students journal what they have learned during activity. Classroom Volunteer Warwick Elementary School August 2010  –  June 2014  (3 years 11 months) Fremont, California Classroom Volunteer. One of many volunteers in and out of the classroom. Helping students with their classroom projects and end of the year activities. Helping teacher correct homework assignments given daily to students. Classroom Volunteer Warwick Elementary School August 2010  –  June 2014  (3 years 11 months) Fremont, California Classroom Volunteer. One of many volunteers in and out of the classroom. Helping students with their classroom projects and end of the year activities. Helping teacher correct homework assignments given daily to students. Fulltime Undergraduate Student California State University, East Bay September 2011  –  March 2013  (1 year 7 months) Hayward, California Undergraduate Studies. Liberal Arts& Sciences, Option in Childhood Studies. Degree awarded March 2013 Fulltime Undergraduate Student California State University, East Bay September 2011  –  March 2013  (1 year 7 months) Hayward, California Undergraduate Studies. Liberal Arts& Sciences, Option in Childhood Studies. Degree awarded March 2013 Online Student Los Angeles Pierce Community College August 2008  –  June 2011  (2 years 11 months) Fremont, CA Completed two Associates Degrees in Behavioral and Social Sciences and Liberal Arts & Sciences in General Studies. Online Student Los Angeles Pierce Community College August 2008  –  June 2011  (2 years 11 months) Fremont, CA Completed two Associates Degrees in Behavioral and Social Sciences and Liberal Arts & Sciences in General Studies. Sr. Administrative Specialist/Notary Public, Private Client Services City National Bank March 2008  –  August 2010  (2 years 6 months) Sr. Administrative Assistant to Private Client Services, Treasury, Core and Commercial Banking executives. \nExercise considerable discretion and independent judgment and capable of analyzing complex information requests and determining complex trends. Work independently on projects that require detailed investigation, analysis and problem solving skills. Train colleagues on new office products and procedures. Coordinate company events and charitable giving. Update existing Excel spreadsheets and assisting management with the creation of PowerPoint presentations, team player. Input and maintain complex internal database and related reports. Provide guidance and direction to other support colleagues. Delegate work assignments and monitors completion. Assist with and/or assume responsibility for a variety of small projects. Represent the manager and team to both external and internal clients consistent with the CNB culture of relationship management. Schedule video/audio conference calls. Notarize various client records as needed. Answer delicate client questions and direct them to the appropriate department. Sr. Administrative Specialist/Notary Public, Private Client Services City National Bank March 2008  –  August 2010  (2 years 6 months) Sr. Administrative Assistant to Private Client Services, Treasury, Core and Commercial Banking executives. \nExercise considerable discretion and independent judgment and capable of analyzing complex information requests and determining complex trends. Work independently on projects that require detailed investigation, analysis and problem solving skills. Train colleagues on new office products and procedures. Coordinate company events and charitable giving. Update existing Excel spreadsheets and assisting management with the creation of PowerPoint presentations, team player. Input and maintain complex internal database and related reports. Provide guidance and direction to other support colleagues. Delegate work assignments and monitors completion. Assist with and/or assume responsibility for a variety of small projects. Represent the manager and team to both external and internal clients consistent with the CNB culture of relationship management. Schedule video/audio conference calls. Notarize various client records as needed. Answer delicate client questions and direct them to the appropriate department. Sr. Administrative Assistant/Office Manager, Northwest Sales & Engineering Department, (Temporary) Wind River October 2007  –  March 2008  (6 months) Travel coordinator, company event coordinator for both on and off campus, track sales, weekly status reports update, office manager, calendar management skills, including the coordination of complex executive meetings, supplies. Set up office and equipment for new hires, badge new employees and collect badges and disable them from terminated employees. Update org charts and office space. Assist with and/or assume responsibility for a variety of small projects. Fed ex, ups, phones, filing, set up and breakdown of rooms for meetings and classes. Assist with marketing events setting up booths, assembling brochures, ordering Materials. Facilitate new administrative “how to” guide and other duties as assigned. Sr. Administrative Assistant/Office Manager, Northwest Sales & Engineering Department, (Temporary) Wind River October 2007  –  March 2008  (6 months) Travel coordinator, company event coordinator for both on and off campus, track sales, weekly status reports update, office manager, calendar management skills, including the coordination of complex executive meetings, supplies. Set up office and equipment for new hires, badge new employees and collect badges and disable them from terminated employees. Update org charts and office space. Assist with and/or assume responsibility for a variety of small projects. Fed ex, ups, phones, filing, set up and breakdown of rooms for meetings and classes. Assist with marketing events setting up booths, assembling brochures, ordering Materials. Facilitate new administrative “how to” guide and other duties as assigned. Administrative Assistant IV Stanford University January 2007  –  July 2007  (7 months) Prepare correspondence, filing, timesheets, expense reports for management and scientific teams, iprocurement, dept., Calendar meetings, outgoing and incoming mail distribution, and prioritizing tasks as appropriate. Write informational guidelines on relevant procedures and policies for division managers and administrators. Supervise, train, hire and release student workers. Back up Petty Cash window as needed. Oversee the Stanford University Departmental Accounts: Responsible for up-to-date status on faculty accounts. Perform comprehensive account reconciliations of all expenditures, which will total several hundred thousand dollars, develop and track the budget monthly and answer questions as required. Perform comprehensive reconciliations on other University accounts such as conferences, royalties, special support, awards to individuals, team player. Administrative Assistant IV Stanford University January 2007  –  July 2007  (7 months) Prepare correspondence, filing, timesheets, expense reports for management and scientific teams, iprocurement, dept., Calendar meetings, outgoing and incoming mail distribution, and prioritizing tasks as appropriate. Write informational guidelines on relevant procedures and policies for division managers and administrators. Supervise, train, hire and release student workers. Back up Petty Cash window as needed. Oversee the Stanford University Departmental Accounts: Responsible for up-to-date status on faculty accounts. Perform comprehensive account reconciliations of all expenditures, which will total several hundred thousand dollars, develop and track the budget monthly and answer questions as required. Perform comprehensive reconciliations on other University accounts such as conferences, royalties, special support, awards to individuals, team player. Administrative Assistant IV - Budgets Stanford Linear Accelerator Center June 2006  –  January 2007  (8 months) Prepare correspondence, filing, timesheets, expense reports for management and scientific teams, iprocurement, dept., Calendar meetings, outgoing and incoming mail distribution, and prioritizing tasks as appropriate. Write informational guidelines on relevant procedures and policies for division managers and administrators. Supervise, train, hire and release student workers. Back up Petty Cash window as needed. Oversee the Stanford University Departmental Accounts: Responsible for up-to-date status on faculty accounts. Perform comprehensive account reconciliations of all expenditures, which will total several hundred thousand dollars, develop and track the budget monthly and answer questions as required. Perform comprehensive reconciliations on other University accounts such as conferences, royalties, special support, awards to individuals, team player. Administrative Assistant IV - Budgets Stanford Linear Accelerator Center June 2006  –  January 2007  (8 months) Prepare correspondence, filing, timesheets, expense reports for management and scientific teams, iprocurement, dept., Calendar meetings, outgoing and incoming mail distribution, and prioritizing tasks as appropriate. Write informational guidelines on relevant procedures and policies for division managers and administrators. Supervise, train, hire and release student workers. Back up Petty Cash window as needed. Oversee the Stanford University Departmental Accounts: Responsible for up-to-date status on faculty accounts. Perform comprehensive account reconciliations of all expenditures, which will total several hundred thousand dollars, develop and track the budget monthly and answer questions as required. Perform comprehensive reconciliations on other University accounts such as conferences, royalties, special support, awards to individuals, team player. Executive Admin Audit Department-(Temporary Position) Safeway Corporation April 2006  –  June 2006  (3 months) Executive Admin Audit Department-(Temporary Position) \nPoint contact and training of new administrative assistants, maintain vacation and sick leave logs. Maintained documents and files and information systems Reviewed and distributed department correspondence. Created and maintained project filing systems. Worked closely with the various VP’s and COO by assisting with and/or assuming responsibility for a variety of small projects. Processed and maintained expenses and business travel itinerary. Answer and screen all incoming calls and then forwarded them to appropriate person(s). Maintained daily calendars for top management. Compose/draft correspondence and edit/ proof correspondence prepared by others, participate in staff meetings and other meetings as needed. Executive Admin Audit Department-(Temporary Position) Safeway Corporation April 2006  –  June 2006  (3 months) Executive Admin Audit Department-(Temporary Position) \nPoint contact and training of new administrative assistants, maintain vacation and sick leave logs. Maintained documents and files and information systems Reviewed and distributed department correspondence. Created and maintained project filing systems. Worked closely with the various VP’s and COO by assisting with and/or assuming responsibility for a variety of small projects. Processed and maintained expenses and business travel itinerary. Answer and screen all incoming calls and then forwarded them to appropriate person(s). Maintained daily calendars for top management. Compose/draft correspondence and edit/ proof correspondence prepared by others, participate in staff meetings and other meetings as needed. Operations Coordinator RGA Environmental, Inc. March 2002  –  November 2005  (3 years 9 months) Support Owners, CFO, Head Accountants, Project Managers and Technical Staff. Responsible for travel arrangements of all managers and staff. Expense reports, time keeper, schedules, front desk administrator. Coordinator for all employee training and State of California OSHA certifications for contractors and subcontractors. Key person for insurance coordination and contracts administration and company financials. Process timesheets, certified payroll, California Employment Development Audits, input accounts payable and receivable, bank reconciliation, pre-liens and expense reports. Support HR with employee verifications, Internet searches, download resumes and input into HRIS database. Trained new administrative assistants. New hire orientation and exiting employee papers. Maintained vacation and sick leave logs. Benefits point of contact. Maintained Office by order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. Operations Coordinator RGA Environmental, Inc. March 2002  –  November 2005  (3 years 9 months) Support Owners, CFO, Head Accountants, Project Managers and Technical Staff. Responsible for travel arrangements of all managers and staff. Expense reports, time keeper, schedules, front desk administrator. Coordinator for all employee training and State of California OSHA certifications for contractors and subcontractors. Key person for insurance coordination and contracts administration and company financials. Process timesheets, certified payroll, California Employment Development Audits, input accounts payable and receivable, bank reconciliation, pre-liens and expense reports. Support HR with employee verifications, Internet searches, download resumes and input into HRIS database. Trained new administrative assistants. New hire orientation and exiting employee papers. Maintained vacation and sick leave logs. Benefits point of contact. Maintained Office by order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. Executive Administrative Assistant/Office Manager/HR/Operations Coordinator Construction & Engineering January 2000  –  March 2002  (2 years 3 months) Support Owners, CFO, Head Accountants, Project Managers and Technical Staff. Responsible for travel arrangements of all managers and staff. Expense reports, time keeper, schedules, front desk administrator. Coordinator for all employee training and State of California OSHA certifications for contractors and subcontractors. Key person for insurance coordination and contracts administration and company financials. Process timesheets, certified payroll, California Employment Development Audits, input accounts payable and receivable, bank reconciliation, pre-liens and expense reports. Support HR with employee verifications, Internet searches, download resumes and input into HRIS database. Trained new administrative assistants. New hire orientation and exiting employee papers. Maintained vacation and sick leave logs. Benefits point of contact. Maintained Office by order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. . Executive Administrative Assistant/Office Manager/HR/Operations Coordinator Construction & Engineering January 2000  –  March 2002  (2 years 3 months) Support Owners, CFO, Head Accountants, Project Managers and Technical Staff. Responsible for travel arrangements of all managers and staff. Expense reports, time keeper, schedules, front desk administrator. Coordinator for all employee training and State of California OSHA certifications for contractors and subcontractors. Key person for insurance coordination and contracts administration and company financials. Process timesheets, certified payroll, California Employment Development Audits, input accounts payable and receivable, bank reconciliation, pre-liens and expense reports. Support HR with employee verifications, Internet searches, download resumes and input into HRIS database. Trained new administrative assistants. New hire orientation and exiting employee papers. Maintained vacation and sick leave logs. Benefits point of contact. Maintained Office by order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. . Data Analyst Bisys Research October 1992  –  October 1997  (5 years 1 month) Technical writer for employee and administrative manuals. Data preparation for various programs such as Foxpro, Lotus and Excel systems Report preparation of complex projects given by management and then sent to banking clientele. Maintain Office - order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. Data Analyst Bisys Research October 1992  –  October 1997  (5 years 1 month) Technical writer for employee and administrative manuals. Data preparation for various programs such as Foxpro, Lotus and Excel systems Report preparation of complex projects given by management and then sent to banking clientele. Maintain Office - order supplies, answer phones, mail distribution, file, back up reception and other duties as assigned. Languages   Skills Microsoft Word Notary Public Microsoft Excel Accounts Payable Outlook Office Management Community Outreach Customer Service CBEST Marketing Microsoft Office Administrative... Training Human Resources Fundraising Management Program Management Accounting PowerPoint Analysis Editing Sales Time Management Budgets Event Planning Nonprofits Leadership Public Speaking Research Employee Benefits Volunteer Management Data Analysis Teaching Resume Writing Team Building Grant Writing Administrative... Problem Solving Mentoring Strategic Planning Social Media See 26+     See less Skills  Microsoft Word Notary Public Microsoft Excel Accounts Payable Outlook Office Management Community Outreach Customer Service CBEST Marketing Microsoft Office Administrative... Training Human Resources Fundraising Management Program Management Accounting PowerPoint Analysis Editing Sales Time Management Budgets Event Planning Nonprofits Leadership Public Speaking Research Employee Benefits Volunteer Management Data Analysis Teaching Resume Writing Team Building Grant Writing Administrative... Problem Solving Mentoring Strategic Planning Social Media See 26+     See less Microsoft Word Notary Public Microsoft Excel Accounts Payable Outlook Office Management Community Outreach Customer Service CBEST Marketing Microsoft Office Administrative... Training Human Resources Fundraising Management Program Management Accounting PowerPoint Analysis Editing Sales Time Management Budgets Event Planning Nonprofits Leadership Public Speaking Research Employee Benefits Volunteer Management Data Analysis Teaching Resume Writing Team Building Grant Writing Administrative... Problem Solving Mentoring Strategic Planning Social Media See 26+     See less Microsoft Word Notary Public Microsoft Excel Accounts Payable Outlook Office Management Community Outreach Customer Service CBEST Marketing Microsoft Office Administrative... Training Human Resources Fundraising Management Program Management Accounting PowerPoint Analysis Editing Sales Time Management Budgets Event Planning Nonprofits Leadership Public Speaking Research Employee Benefits Volunteer Management Data Analysis Teaching Resume Writing Team Building Grant Writing Administrative... Problem Solving Mentoring Strategic Planning Social Media See 26+     See less Education California State University, Monterey Bay Elementary Education and Teaching , Currently Enrolled 2014  – 2015 CalstateTEACH Candidate Activities and Societies:  N/A California State University-East Bay Bachelor of Arts (B.A.),  Child Development , 3.143 2011  – 2013 Degree granted March 2013 Los Angeles Pierce College Liberal Arts,  Emphasis Social & Behavioral Sciences 2008  – 2010 Los Angeles Pierce College Liberal Arts Sciences,  Business/Human Development 2005  – 2008 California State University, Monterey Bay Elementary Education and Teaching , Currently Enrolled 2014  – 2015 CalstateTEACH Candidate Activities and Societies:  N/A California State University, Monterey Bay Elementary Education and Teaching , Currently Enrolled 2014  – 2015 CalstateTEACH Candidate Activities and Societies:  N/A California State University, Monterey Bay Elementary Education and Teaching , Currently Enrolled 2014  – 2015 CalstateTEACH Candidate Activities and Societies:  N/A California State University-East Bay Bachelor of Arts (B.A.),  Child Development , 3.143 2011  – 2013 Degree granted March 2013 California State University-East Bay Bachelor of Arts (B.A.),  Child Development , 3.143 2011  – 2013 Degree granted March 2013 California State University-East Bay Bachelor of Arts (B.A.),  Child Development , 3.143 2011  – 2013 Degree granted March 2013 Los Angeles Pierce College Liberal Arts,  Emphasis Social & Behavioral Sciences 2008  – 2010 Los Angeles Pierce College Liberal Arts,  Emphasis Social & Behavioral Sciences 2008  – 2010 Los Angeles Pierce College Liberal Arts,  Emphasis Social & Behavioral Sciences 2008  – 2010 Los Angeles Pierce College Liberal Arts Sciences,  Business/Human Development 2005  – 2008 Los Angeles Pierce College Liberal Arts Sciences,  Business/Human Development 2005  – 2008 Los Angeles Pierce College Liberal Arts Sciences,  Business/Human Development 2005  – 2008 Honors & Awards Multiple Subjects - CSET State of California May 2014 Passed Multiple Subject Subsets I, II & III  CBEST State of California April 2013 Passed CBEST Dean's List Summer 2012 (3.9 g.p.a.); Winter 2013 (4.0 g.p.a.) Honor's List Winter 2012 (3.675 g.p.a.), Spring 2012 (3.666 g.p.a.) Multiple Subjects - CSET State of California May 2014 Passed Multiple Subject Subsets I, II & III  Multiple Subjects - CSET State of California May 2014 Passed Multiple Subject Subsets I, II & III  Multiple Subjects - CSET State of California May 2014 Passed Multiple Subject Subsets I, II & III  CBEST State of California April 2013 Passed CBEST CBEST State of California April 2013 Passed CBEST CBEST State of California April 2013 Passed CBEST Dean's List Summer 2012 (3.9 g.p.a.); Winter 2013 (4.0 g.p.a.) Dean's List Summer 2012 (3.9 g.p.a.); Winter 2013 (4.0 g.p.a.) Dean's List Summer 2012 (3.9 g.p.a.); Winter 2013 (4.0 g.p.a.) Honor's List Winter 2012 (3.675 g.p.a.), Spring 2012 (3.666 g.p.a.) Honor's List Winter 2012 (3.675 g.p.a.), Spring 2012 (3.666 g.p.a.) Honor's List Winter 2012 (3.675 g.p.a.), Spring 2012 (3.666 g.p.a.) ", "Experience Administrative Assistant IV Stanford University Clinical 1 Foothill Community Health Center August 2013  –  June 2014  (11 months) San Jose, CA Administrative Assistant IV Stanford University Administrative Assistant IV Stanford University Clinical 1 Foothill Community Health Center August 2013  –  June 2014  (11 months) San Jose, CA Clinical 1 Foothill Community Health Center August 2013  –  June 2014  (11 months) San Jose, CA Skills Community Outreach Event Planning Nonprofits Outlook Microsoft Office PowerPoint Customer Service Psychology Administrative... Office Administration Microsoft Word Project Management Administrative... Adolescents Crisis Intervention Family Therapy Group Therapy See 2+     See less Skills  Community Outreach Event Planning Nonprofits Outlook Microsoft Office PowerPoint Customer Service Psychology Administrative... Office Administration Microsoft Word Project Management Administrative... Adolescents Crisis Intervention Family Therapy Group Therapy See 2+     See less Community Outreach Event Planning Nonprofits Outlook Microsoft Office PowerPoint Customer Service Psychology Administrative... Office Administration Microsoft Word Project Management Administrative... Adolescents Crisis Intervention Family Therapy Group Therapy See 2+     See less Community Outreach Event Planning Nonprofits Outlook Microsoft Office PowerPoint Customer Service Psychology Administrative... Office Administration Microsoft Word Project Management Administrative... Adolescents Crisis Intervention Family Therapy Group Therapy See 2+     See less Education John F. Kennedy University John F. Kennedy University John F. Kennedy University John F. Kennedy University ", "Summary I have worked as a cake decorator for over 20 years. I have completed my education as a pastry chef and now look forward to an exciting career in the baking industry. Specialties:Purchasing, Cake decorator, artisan breads, donut/fritter making, cold plates, candy/chocolate maker Summary I have worked as a cake decorator for over 20 years. I have completed my education as a pastry chef and now look forward to an exciting career in the baking industry. Specialties:Purchasing, Cake decorator, artisan breads, donut/fritter making, cold plates, candy/chocolate maker I have worked as a cake decorator for over 20 years. I have completed my education as a pastry chef and now look forward to an exciting career in the baking industry. Specialties:Purchasing, Cake decorator, artisan breads, donut/fritter making, cold plates, candy/chocolate maker I have worked as a cake decorator for over 20 years. I have completed my education as a pastry chef and now look forward to an exciting career in the baking industry. Specialties:Purchasing, Cake decorator, artisan breads, donut/fritter making, cold plates, candy/chocolate maker Experience Bakery Assistant Costco Wholesale November 2014  – Present (10 months) Sacramento, California Area Baking breads, production work, customer service - Seasonal Baker/Cake Decorator Golden Corral Restaurant March 2011  – Present (4 years 6 months) North Highlands, CA Baker and cake decorator, baking artisan breads and desserts for a buffet restaurant. Maintain chocolate fountain, customer service for cotton candy and ice cream center. Administrative Assistant Heschong Mahone Group March 2005  –  June 2008  (3 years 4 months) Administrative Assistant IV Stanford University School of Medicine February 1995  –  June 1998  (3 years 5 months) Assisted 2 Ophthalmology doctors in all clerical duties Purchasing Secretary at Scotts Valley Plant Watkins-Johnson January 1989  –  June 1992  (3 years 6 months) Assisted Dennis McCullough, Light buying Bakery Assistant Costco Wholesale November 2014  – Present (10 months) Sacramento, California Area Baking breads, production work, customer service - Seasonal Bakery Assistant Costco Wholesale November 2014  – Present (10 months) Sacramento, California Area Baking breads, production work, customer service - Seasonal Baker/Cake Decorator Golden Corral Restaurant March 2011  – Present (4 years 6 months) North Highlands, CA Baker and cake decorator, baking artisan breads and desserts for a buffet restaurant. Maintain chocolate fountain, customer service for cotton candy and ice cream center. Baker/Cake Decorator Golden Corral Restaurant March 2011  – Present (4 years 6 months) North Highlands, CA Baker and cake decorator, baking artisan breads and desserts for a buffet restaurant. Maintain chocolate fountain, customer service for cotton candy and ice cream center. Administrative Assistant Heschong Mahone Group March 2005  –  June 2008  (3 years 4 months) Administrative Assistant Heschong Mahone Group March 2005  –  June 2008  (3 years 4 months) Administrative Assistant IV Stanford University School of Medicine February 1995  –  June 1998  (3 years 5 months) Assisted 2 Ophthalmology doctors in all clerical duties Administrative Assistant IV Stanford University School of Medicine February 1995  –  June 1998  (3 years 5 months) Assisted 2 Ophthalmology doctors in all clerical duties Purchasing Secretary at Scotts Valley Plant Watkins-Johnson January 1989  –  June 1992  (3 years 6 months) Assisted Dennis McCullough, Light buying Purchasing Secretary at Scotts Valley Plant Watkins-Johnson January 1989  –  June 1992  (3 years 6 months) Assisted Dennis McCullough, Light buying Skills Food Catering Cooking Cake Decorator Baking Bread Skills  Food Catering Cooking Cake Decorator Baking Bread Food Catering Cooking Cake Decorator Baking Bread Food Catering Cooking Cake Decorator Baking Bread Education Institute of Technology - Roseville Pastry Chef,  Baking and Pastry 2010  – 2010 Team participation for Guiness Book of World Record for World's Largest Ravioli Activities and Societies:  Cold Plating and cake specialties Bunker Hill Community College AA,  Business 1980  – 1982 Cambridge High and Latin HS 1974  – 1978 Institute of Technology - Roseville Pastry Chef,  Baking and Pastry 2010  – 2010 Team participation for Guiness Book of World Record for World's Largest Ravioli Activities and Societies:  Cold Plating and cake specialties Institute of Technology - Roseville Pastry Chef,  Baking and Pastry 2010  – 2010 Team participation for Guiness Book of World Record for World's Largest Ravioli Activities and Societies:  Cold Plating and cake specialties Institute of Technology - Roseville Pastry Chef,  Baking and Pastry 2010  – 2010 Team participation for Guiness Book of World Record for World's Largest Ravioli Activities and Societies:  Cold Plating and cake specialties Bunker Hill Community College AA,  Business 1980  – 1982 Bunker Hill Community College AA,  Business 1980  – 1982 Bunker Hill Community College AA,  Business 1980  – 1982 Cambridge High and Latin HS 1974  – 1978 Cambridge High and Latin HS 1974  – 1978 Cambridge High and Latin HS 1974  – 1978 ", "Experience Administrative Associate IV Stanford University December 2014  – Present (9 months) Bioengineering Editorial Production Assistant Annual Reviews September 2014  –  October 2014  (2 months) Palo Alto, CA •\tProofread and copy edit complex scientific literature reviews \n•\tPerform data gathering and analysis \n•\tMaintain congenial and efficient communications with Editors and Authors \n•\tAssist with preparation of meeting workbooks \n•\tTransfer author corrections \n•\tMail-merge operations from a central database \n•\tAssist with meeting logistics and routine administrative tasks Administrative Assistant IV Stanford University School of Medicine March 2006  –  September 2014  (8 years 7 months) Stanford, CA --Edit scientific manuscripts for clarity, syntax, style, punctuation, and grammar. \n--Ensure manuscripts adhere to peer-reviewed journal guidelines for authors. \n--Edit letters of reference written by faculty members. \n--Edit and format research grant proposals. \n--Wrote section of PhD Program Proposal for submission to the Dean of the School of Medicine \n--Perform administrative duties for three faculty members with regard to their changing needs and workload \n--Schedule meetings, make room reservations, order catering \n--Obtain visas for international travel, make both domestic and international travel arrangements \n--Process travel and other expenses for reimbursement to faculty members \n--Format research grant applicationsand upload to funding agency websites in deadline driven environment. \n--Renew grant protocols (Human Subjects) by providing study specifics to Stanford's Internal Review Board. Copy Editor (Content) Shmoop November 2012  –  November 2013  (1 year 1 month) Mountain View •\tEdit SAT and AP preparatory tests in high school and college level physics, chemistry, and biology for punctuation, grammar, and format \n•\tAdhere to company style guidelines when editing and reformatting exams \n•\tPrioritize incoming projects received on a spur of the moment basis Associate Technical Writer/Editor Genentech, Inc., South San Francisco March 2003  –  January 2004  (11 months) San Francisco Bay Area •\tWrote summaries for and justifications of process changes made to manufacturing documents in accordance with FDA requirements\t \n•\tEdited Subject Matter Experts’ changes to manufacturing documents \n•\tReformatted manufacturing tickets from an old line format to a new table format designed by an outside company \n•\tPrioritized projects to meet changing deadlines \n•\tCollaborated with subject matter experts in live-editing document revision meetings  \n•\tTracked electronically the editorial changes made to biologic medicine manufacturing documents to ensure readiness for use on the production floor Group Fitness Instructor Gold's Gym December 1997  –  August 2001  (3 years 9 months) Mountain View CA Group Fitness Instructor UC Berkeley Recreational Sports Facility March 1993  –  June 1997  (4 years 4 months) Berkeley, CA Onboard Fitness Program Supervisor/Instructor Cunard Cruise Lines January 1991  –  March 1992  (1 year 3 months) Caribbean Nations, Bahamas, Mexico, Europe \"G.O.\" Hostess Club Med October 1985  –  January 1988  (2 years 4 months) Bahamas, Caribbean, and Mexico Administrative Associate IV Stanford University December 2014  – Present (9 months) Bioengineering Administrative Associate IV Stanford University December 2014  – Present (9 months) Bioengineering Editorial Production Assistant Annual Reviews September 2014  –  October 2014  (2 months) Palo Alto, CA •\tProofread and copy edit complex scientific literature reviews \n•\tPerform data gathering and analysis \n•\tMaintain congenial and efficient communications with Editors and Authors \n•\tAssist with preparation of meeting workbooks \n•\tTransfer author corrections \n•\tMail-merge operations from a central database \n•\tAssist with meeting logistics and routine administrative tasks Editorial Production Assistant Annual Reviews September 2014  –  October 2014  (2 months) Palo Alto, CA •\tProofread and copy edit complex scientific literature reviews \n•\tPerform data gathering and analysis \n•\tMaintain congenial and efficient communications with Editors and Authors \n•\tAssist with preparation of meeting workbooks \n•\tTransfer author corrections \n•\tMail-merge operations from a central database \n•\tAssist with meeting logistics and routine administrative tasks Administrative Assistant IV Stanford University School of Medicine March 2006  –  September 2014  (8 years 7 months) Stanford, CA --Edit scientific manuscripts for clarity, syntax, style, punctuation, and grammar. \n--Ensure manuscripts adhere to peer-reviewed journal guidelines for authors. \n--Edit letters of reference written by faculty members. \n--Edit and format research grant proposals. \n--Wrote section of PhD Program Proposal for submission to the Dean of the School of Medicine \n--Perform administrative duties for three faculty members with regard to their changing needs and workload \n--Schedule meetings, make room reservations, order catering \n--Obtain visas for international travel, make both domestic and international travel arrangements \n--Process travel and other expenses for reimbursement to faculty members \n--Format research grant applicationsand upload to funding agency websites in deadline driven environment. \n--Renew grant protocols (Human Subjects) by providing study specifics to Stanford's Internal Review Board. Administrative Assistant IV Stanford University School of Medicine March 2006  –  September 2014  (8 years 7 months) Stanford, CA --Edit scientific manuscripts for clarity, syntax, style, punctuation, and grammar. \n--Ensure manuscripts adhere to peer-reviewed journal guidelines for authors. \n--Edit letters of reference written by faculty members. \n--Edit and format research grant proposals. \n--Wrote section of PhD Program Proposal for submission to the Dean of the School of Medicine \n--Perform administrative duties for three faculty members with regard to their changing needs and workload \n--Schedule meetings, make room reservations, order catering \n--Obtain visas for international travel, make both domestic and international travel arrangements \n--Process travel and other expenses for reimbursement to faculty members \n--Format research grant applicationsand upload to funding agency websites in deadline driven environment. \n--Renew grant protocols (Human Subjects) by providing study specifics to Stanford's Internal Review Board. Copy Editor (Content) Shmoop November 2012  –  November 2013  (1 year 1 month) Mountain View •\tEdit SAT and AP preparatory tests in high school and college level physics, chemistry, and biology for punctuation, grammar, and format \n•\tAdhere to company style guidelines when editing and reformatting exams \n•\tPrioritize incoming projects received on a spur of the moment basis Copy Editor (Content) Shmoop November 2012  –  November 2013  (1 year 1 month) Mountain View •\tEdit SAT and AP preparatory tests in high school and college level physics, chemistry, and biology for punctuation, grammar, and format \n•\tAdhere to company style guidelines when editing and reformatting exams \n•\tPrioritize incoming projects received on a spur of the moment basis Associate Technical Writer/Editor Genentech, Inc., South San Francisco March 2003  –  January 2004  (11 months) San Francisco Bay Area •\tWrote summaries for and justifications of process changes made to manufacturing documents in accordance with FDA requirements\t \n•\tEdited Subject Matter Experts’ changes to manufacturing documents \n•\tReformatted manufacturing tickets from an old line format to a new table format designed by an outside company \n•\tPrioritized projects to meet changing deadlines \n•\tCollaborated with subject matter experts in live-editing document revision meetings  \n•\tTracked electronically the editorial changes made to biologic medicine manufacturing documents to ensure readiness for use on the production floor Associate Technical Writer/Editor Genentech, Inc., South San Francisco March 2003  –  January 2004  (11 months) San Francisco Bay Area •\tWrote summaries for and justifications of process changes made to manufacturing documents in accordance with FDA requirements\t \n•\tEdited Subject Matter Experts’ changes to manufacturing documents \n•\tReformatted manufacturing tickets from an old line format to a new table format designed by an outside company \n•\tPrioritized projects to meet changing deadlines \n•\tCollaborated with subject matter experts in live-editing document revision meetings  \n•\tTracked electronically the editorial changes made to biologic medicine manufacturing documents to ensure readiness for use on the production floor Group Fitness Instructor Gold's Gym December 1997  –  August 2001  (3 years 9 months) Mountain View CA Group Fitness Instructor Gold's Gym December 1997  –  August 2001  (3 years 9 months) Mountain View CA Group Fitness Instructor UC Berkeley Recreational Sports Facility March 1993  –  June 1997  (4 years 4 months) Berkeley, CA Group Fitness Instructor UC Berkeley Recreational Sports Facility March 1993  –  June 1997  (4 years 4 months) Berkeley, CA Onboard Fitness Program Supervisor/Instructor Cunard Cruise Lines January 1991  –  March 1992  (1 year 3 months) Caribbean Nations, Bahamas, Mexico, Europe Onboard Fitness Program Supervisor/Instructor Cunard Cruise Lines January 1991  –  March 1992  (1 year 3 months) Caribbean Nations, Bahamas, Mexico, Europe \"G.O.\" Hostess Club Med October 1985  –  January 1988  (2 years 4 months) Bahamas, Caribbean, and Mexico \"G.O.\" Hostess Club Med October 1985  –  January 1988  (2 years 4 months) Bahamas, Caribbean, and Mexico Languages French Limited working proficiency Spanish Elementary proficiency French Limited working proficiency Spanish Elementary proficiency French Limited working proficiency Spanish Elementary proficiency Limited working proficiency Elementary proficiency Skills Technical Writing Editing Cruise Ship Fitness... Aerobics/Fitness... Biopharmaceuticals Research Writing Proofreading Copy Editing Creative Writing Hospitality Industry Tourism Skills  Technical Writing Editing Cruise Ship Fitness... Aerobics/Fitness... Biopharmaceuticals Research Writing Proofreading Copy Editing Creative Writing Hospitality Industry Tourism Technical Writing Editing Cruise Ship Fitness... Aerobics/Fitness... Biopharmaceuticals Research Writing Proofreading Copy Editing Creative Writing Hospitality Industry Tourism Technical Writing Editing Cruise Ship Fitness... Aerobics/Fitness... Biopharmaceuticals Research Writing Proofreading Copy Editing Creative Writing Hospitality Industry Tourism Education San Jose State University Bachelor's Degree,  English/Technical Writing , magna cum laude 2000  – 2002 San Jose State University Bachelor's Degree,  English ,  Writing and Editing , magna cum laude 2000  – 2002 University of San Francisco Bachelor's Degree,  Business Administration/Marketing 1981  – 1983 Activities and Societies:  Phi Chi Theta University of California, Berkeley Business Administration 1979  – 1981 San Jose State University Bachelor's Degree,  English/Technical Writing , magna cum laude 2000  – 2002 San Jose State University Bachelor's Degree,  English/Technical Writing , magna cum laude 2000  – 2002 San Jose State University Bachelor's Degree,  English/Technical Writing , magna cum laude 2000  – 2002 San Jose State University Bachelor's Degree,  English ,  Writing and Editing , magna cum laude 2000  – 2002 San Jose State University Bachelor's Degree,  English ,  Writing and Editing , magna cum laude 2000  – 2002 San Jose State University Bachelor's Degree,  English ,  Writing and Editing , magna cum laude 2000  – 2002 University of San Francisco Bachelor's Degree,  Business Administration/Marketing 1981  – 1983 Activities and Societies:  Phi Chi Theta University of San Francisco Bachelor's Degree,  Business Administration/Marketing 1981  – 1983 Activities and Societies:  Phi Chi Theta University of San Francisco Bachelor's Degree,  Business Administration/Marketing 1981  – 1983 Activities and Societies:  Phi Chi Theta University of California, Berkeley Business Administration 1979  – 1981 University of California, Berkeley Business Administration 1979  – 1981 University of California, Berkeley Business Administration 1979  – 1981 Honors & Awards Graduated magna cum laude San Jose State University December 2002 GPA (magna cum laude) included biochemistry classes towards a degree in Nutritional Sciences in addition to the English Degree/Writing curriculum courses. Graduated magna cum laude San Jose State University December 2002 GPA (magna cum laude) included biochemistry classes towards a degree in Nutritional Sciences in addition to the English Degree/Writing curriculum courses. Graduated magna cum laude San Jose State University December 2002 GPA (magna cum laude) included biochemistry classes towards a degree in Nutritional Sciences in addition to the English Degree/Writing curriculum courses. Graduated magna cum laude San Jose State University December 2002 GPA (magna cum laude) included biochemistry classes towards a degree in Nutritional Sciences in addition to the English Degree/Writing curriculum courses. "]}