{"position": "Applications Specialist", "company": "Stanford University", "profiles": ["Experience Artist Self Employed January 2009  – Present (6 years 8 months) I'm letting my inner artist out using a variety of media. I have some items for sale at www.zazzle.com/rabbithilldesigns while I work on my overall portfolio. \n \nI have some gallery sized paintings in the works, but not enough yet to request a gallery showing. As part of an unrelated class, I have over a dozen mandalas which I will make available for download on the Rabbit Hill Designs Facebook page. Clinical Research Applications Specialist Stanford University March 2007  –  January 2010  (2 years 11 months) Assisted faculty with implementing cancer clinical trials Clinical Research Associate Stanford University October 2005  –  March 2007  (1 year 6 months) Managed clinical trials for primarily non-Hodgkins lymphoma Administrative Associate Stanford University May 2003  –  October 2005  (2 years 6 months) Administrative Associate in the Radiology Department supporting 3 faculty members Clincal Data Coordinator (contractor) Quintiles January 2003  –  May 2003  (5 months) Data verification of clinical trial data Consultant Self July 2001  –  January 2003  (1 year 7 months) Primarily computer technical support Network Security Engineer Exodus Communications October 1998  –  July 2001  (2 years 10 months) Configured, troubleshot and managed Pix and Checkpoint firewalls. Clinical Data Analyst in Quality Management Childrens Hospital Los Angeles November 1995  –  July 1998  (2 years 9 months) •\tReviewed utilization and outcomes as part of a multidisciplinary team to determine best practices for a variety of medical and surgical issues \n•\tCreated and managed databases, and generated reports for use in clinical outcomes research, quality tracking, process improvement and benchmarking Clinical Trials Associate Genentech March 1992  –  May 1994  (2 years 3 months) Worked as a contractor, mostly in Medical Affairs, but also did stints in several other groups. Worked on the NDA for pulmozyme in addition to supporting trials for renal cell carcinoma (interferon), breast cancer (herceptin) and the gp120 AIDS vaccine. Artist Self Employed January 2009  – Present (6 years 8 months) I'm letting my inner artist out using a variety of media. I have some items for sale at www.zazzle.com/rabbithilldesigns while I work on my overall portfolio. \n \nI have some gallery sized paintings in the works, but not enough yet to request a gallery showing. As part of an unrelated class, I have over a dozen mandalas which I will make available for download on the Rabbit Hill Designs Facebook page. Artist Self Employed January 2009  – Present (6 years 8 months) I'm letting my inner artist out using a variety of media. I have some items for sale at www.zazzle.com/rabbithilldesigns while I work on my overall portfolio. \n \nI have some gallery sized paintings in the works, but not enough yet to request a gallery showing. As part of an unrelated class, I have over a dozen mandalas which I will make available for download on the Rabbit Hill Designs Facebook page. Clinical Research Applications Specialist Stanford University March 2007  –  January 2010  (2 years 11 months) Assisted faculty with implementing cancer clinical trials Clinical Research Applications Specialist Stanford University March 2007  –  January 2010  (2 years 11 months) Assisted faculty with implementing cancer clinical trials Clinical Research Associate Stanford University October 2005  –  March 2007  (1 year 6 months) Managed clinical trials for primarily non-Hodgkins lymphoma Clinical Research Associate Stanford University October 2005  –  March 2007  (1 year 6 months) Managed clinical trials for primarily non-Hodgkins lymphoma Administrative Associate Stanford University May 2003  –  October 2005  (2 years 6 months) Administrative Associate in the Radiology Department supporting 3 faculty members Administrative Associate Stanford University May 2003  –  October 2005  (2 years 6 months) Administrative Associate in the Radiology Department supporting 3 faculty members Clincal Data Coordinator (contractor) Quintiles January 2003  –  May 2003  (5 months) Data verification of clinical trial data Clincal Data Coordinator (contractor) Quintiles January 2003  –  May 2003  (5 months) Data verification of clinical trial data Consultant Self July 2001  –  January 2003  (1 year 7 months) Primarily computer technical support Consultant Self July 2001  –  January 2003  (1 year 7 months) Primarily computer technical support Network Security Engineer Exodus Communications October 1998  –  July 2001  (2 years 10 months) Configured, troubleshot and managed Pix and Checkpoint firewalls. Network Security Engineer Exodus Communications October 1998  –  July 2001  (2 years 10 months) Configured, troubleshot and managed Pix and Checkpoint firewalls. Clinical Data Analyst in Quality Management Childrens Hospital Los Angeles November 1995  –  July 1998  (2 years 9 months) •\tReviewed utilization and outcomes as part of a multidisciplinary team to determine best practices for a variety of medical and surgical issues \n•\tCreated and managed databases, and generated reports for use in clinical outcomes research, quality tracking, process improvement and benchmarking Clinical Data Analyst in Quality Management Childrens Hospital Los Angeles November 1995  –  July 1998  (2 years 9 months) •\tReviewed utilization and outcomes as part of a multidisciplinary team to determine best practices for a variety of medical and surgical issues \n•\tCreated and managed databases, and generated reports for use in clinical outcomes research, quality tracking, process improvement and benchmarking Clinical Trials Associate Genentech March 1992  –  May 1994  (2 years 3 months) Worked as a contractor, mostly in Medical Affairs, but also did stints in several other groups. Worked on the NDA for pulmozyme in addition to supporting trials for renal cell carcinoma (interferon), breast cancer (herceptin) and the gp120 AIDS vaccine. Clinical Trials Associate Genentech March 1992  –  May 1994  (2 years 3 months) Worked as a contractor, mostly in Medical Affairs, but also did stints in several other groups. Worked on the NDA for pulmozyme in addition to supporting trials for renal cell carcinoma (interferon), breast cancer (herceptin) and the gp120 AIDS vaccine. Skills chain maille wire wrapping acrylic paints Art Research Photography Teaching Acrylic Skills  chain maille wire wrapping acrylic paints Art Research Photography Teaching Acrylic chain maille wire wrapping acrylic paints Art Research Photography Teaching Acrylic chain maille wire wrapping acrylic paints Art Research Photography Teaching Acrylic Honors & Awards ", "Skills Program Management Vendor Management Process Improvement IT Strategy Project Management Business Process Team Building Business Intelligence Team Leadership Enterprise Software Unix Data Center Management Skills  Program Management Vendor Management Process Improvement IT Strategy Project Management Business Process Team Building Business Intelligence Team Leadership Enterprise Software Unix Data Center Management Program Management Vendor Management Process Improvement IT Strategy Project Management Business Process Team Building Business Intelligence Team Leadership Enterprise Software Unix Data Center Management Program Management Vendor Management Process Improvement IT Strategy Project Management Business Process Team Building Business Intelligence Team Leadership Enterprise Software Unix Data Center Management "]}