{"position": "Assistant Professor, Economics", "company": "Stanford University", "profiles": ["Summary Matthew Harding is an Economist who conducts research on Applied Econometrics with a focus on the use of Big Data to answer crucial policy questions in Energy/Environment and Health/Nutrition. \n \nI aim to understand how individuals make consumption choices in a data rich environment, and \nquantify the individual and social welfare impact of their choices in areas such as Food Purchases/Nutrition/Health and Energy/Environment. Building on a rigorous foundation in econometric methods, I explore the potential of Big Data to estimate better models and predict the \nchoices made by individuals, while taking into account both traditional economic models and recent \ndevelopments in behavioral economics. I use large scale field experiments to understand the unintended social consequences of individual choices and the extent to which behavioral nudges and price based mechanisms can be used as cost-effective means of improving individual and social welfare. I rely on terabyte sized data sets on household energy consumption, food purchases and prescription records to build a comprehensive framework for understanding economic choices. I also develop cutting edge econometric methods for the practical analysis of Big Data econometric models using Bayesian and Quantile techniques, by focusing in particular on the role of unobserved heterogeneity in complex massive data. Summary Matthew Harding is an Economist who conducts research on Applied Econometrics with a focus on the use of Big Data to answer crucial policy questions in Energy/Environment and Health/Nutrition. \n \nI aim to understand how individuals make consumption choices in a data rich environment, and \nquantify the individual and social welfare impact of their choices in areas such as Food Purchases/Nutrition/Health and Energy/Environment. Building on a rigorous foundation in econometric methods, I explore the potential of Big Data to estimate better models and predict the \nchoices made by individuals, while taking into account both traditional economic models and recent \ndevelopments in behavioral economics. I use large scale field experiments to understand the unintended social consequences of individual choices and the extent to which behavioral nudges and price based mechanisms can be used as cost-effective means of improving individual and social welfare. I rely on terabyte sized data sets on household energy consumption, food purchases and prescription records to build a comprehensive framework for understanding economic choices. I also develop cutting edge econometric methods for the practical analysis of Big Data econometric models using Bayesian and Quantile techniques, by focusing in particular on the role of unobserved heterogeneity in complex massive data. Matthew Harding is an Economist who conducts research on Applied Econometrics with a focus on the use of Big Data to answer crucial policy questions in Energy/Environment and Health/Nutrition. \n \nI aim to understand how individuals make consumption choices in a data rich environment, and \nquantify the individual and social welfare impact of their choices in areas such as Food Purchases/Nutrition/Health and Energy/Environment. Building on a rigorous foundation in econometric methods, I explore the potential of Big Data to estimate better models and predict the \nchoices made by individuals, while taking into account both traditional economic models and recent \ndevelopments in behavioral economics. I use large scale field experiments to understand the unintended social consequences of individual choices and the extent to which behavioral nudges and price based mechanisms can be used as cost-effective means of improving individual and social welfare. I rely on terabyte sized data sets on household energy consumption, food purchases and prescription records to build a comprehensive framework for understanding economic choices. I also develop cutting edge econometric methods for the practical analysis of Big Data econometric models using Bayesian and Quantile techniques, by focusing in particular on the role of unobserved heterogeneity in complex massive data. Matthew Harding is an Economist who conducts research on Applied Econometrics with a focus on the use of Big Data to answer crucial policy questions in Energy/Environment and Health/Nutrition. \n \nI aim to understand how individuals make consumption choices in a data rich environment, and \nquantify the individual and social welfare impact of their choices in areas such as Food Purchases/Nutrition/Health and Energy/Environment. Building on a rigorous foundation in econometric methods, I explore the potential of Big Data to estimate better models and predict the \nchoices made by individuals, while taking into account both traditional economic models and recent \ndevelopments in behavioral economics. I use large scale field experiments to understand the unintended social consequences of individual choices and the extent to which behavioral nudges and price based mechanisms can be used as cost-effective means of improving individual and social welfare. I rely on terabyte sized data sets on household energy consumption, food purchases and prescription records to build a comprehensive framework for understanding economic choices. I also develop cutting edge econometric methods for the practical analysis of Big Data econometric models using Bayesian and Quantile techniques, by focusing in particular on the role of unobserved heterogeneity in complex massive data. Experience Assistant Professor of Public Policy and Economics Duke University June 2014  – Present (1 year 3 months) Durham, North Carolina Assistant Professor of Economics Stanford University July 2007  –  June 2014  (7 years) Visiting Assistant Professor Georgetown University 2012  –  2014  (2 years) Washington D.C. Metro Area Assistant Professor of Public Policy and Economics Duke University June 2014  – Present (1 year 3 months) Durham, North Carolina Assistant Professor of Public Policy and Economics Duke University June 2014  – Present (1 year 3 months) Durham, North Carolina Assistant Professor of Economics Stanford University July 2007  –  June 2014  (7 years) Assistant Professor of Economics Stanford University July 2007  –  June 2014  (7 years) Visiting Assistant Professor Georgetown University 2012  –  2014  (2 years) Washington D.C. Metro Area Visiting Assistant Professor Georgetown University 2012  –  2014  (2 years) Washington D.C. Metro Area Languages German German German Skills Statistics Stata Econometrics Higher Education Economics Data Analysis R Research University Teaching LaTeX Teaching Matlab Statistical Modeling Policy Analysis Quantitative Analytics Econometric Modeling Analysis See 2+     See less Skills  Statistics Stata Econometrics Higher Education Economics Data Analysis R Research University Teaching LaTeX Teaching Matlab Statistical Modeling Policy Analysis Quantitative Analytics Econometric Modeling Analysis See 2+     See less Statistics Stata Econometrics Higher Education Economics Data Analysis R Research University Teaching LaTeX Teaching Matlab Statistical Modeling Policy Analysis Quantitative Analytics Econometric Modeling Analysis See 2+     See less Statistics Stata Econometrics Higher Education Economics Data Analysis R Research University Teaching LaTeX Teaching Matlab Statistical Modeling Policy Analysis Quantitative Analytics Econometric Modeling Analysis See 2+     See less Education Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Economics 2002  – 2007 University of Oxford Master of Philosophy (MPhil),  Economics 2000  – 2002 Merton College UCL Bachelor's degree,  Philosophy and Economics 1997  – 2000 Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Economics 2002  – 2007 Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Economics 2002  – 2007 Massachusetts Institute of Technology Doctor of Philosophy (PhD),  Economics 2002  – 2007 University of Oxford Master of Philosophy (MPhil),  Economics 2000  – 2002 Merton College University of Oxford Master of Philosophy (MPhil),  Economics 2000  – 2002 Merton College University of Oxford Master of Philosophy (MPhil),  Economics 2000  – 2002 Merton College UCL Bachelor's degree,  Philosophy and Economics 1997  – 2000 UCL Bachelor's degree,  Philosophy and Economics 1997  – 2000 UCL Bachelor's degree,  Philosophy and Economics 1997  – 2000 ", "Experience Chairman & President Strava, Inc. 2014  – Present (1 year) Chairman & President Strava, Inc. 2014  – Present (1 year) Chairman & President Strava, Inc. 2014  – Present (1 year) Languages Swedish Swedish Swedish Skills Start-ups Entrepreneurship Venture Capital Strategic Partnerships Strategy Corporate Development Social Media Product Management Angel Investing E-commerce User Experience SaaS Business Development Private Equity Mobile Applications Skills  Start-ups Entrepreneurship Venture Capital Strategic Partnerships Strategy Corporate Development Social Media Product Management Angel Investing E-commerce User Experience SaaS Business Development Private Equity Mobile Applications Start-ups Entrepreneurship Venture Capital Strategic Partnerships Strategy Corporate Development Social Media Product Management Angel Investing E-commerce User Experience SaaS Business Development Private Equity Mobile Applications Start-ups Entrepreneurship Venture Capital Strategic Partnerships Strategy Corporate Development Social Media Product Management Angel Investing E-commerce User Experience SaaS Business Development Private Equity Mobile Applications ", "Experience Senior Economist Moody's Analytics August 2015  – Present (1 month) Greater Philadelphia Area Senior Economist Moody's Analytics August 2015  – Present (1 month) Greater Philadelphia Area Senior Economist Moody's Analytics August 2015  – Present (1 month) Greater Philadelphia Area Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Macroeconomics International Economics Econometrics Time Series Analysis Petroleum Economics Energy Policy Financial Markets Economic Research Stata Quantitative Analytics Microeconomics Development Economics Statistics Economic Modeling Statistical Modeling Skills  Macroeconomics International Economics Econometrics Time Series Analysis Petroleum Economics Energy Policy Financial Markets Economic Research Stata Quantitative Analytics Microeconomics Development Economics Statistics Economic Modeling Statistical Modeling Macroeconomics International Economics Econometrics Time Series Analysis Petroleum Economics Energy Policy Financial Markets Economic Research Stata Quantitative Analytics Microeconomics Development Economics Statistics Economic Modeling Statistical Modeling Macroeconomics International Economics Econometrics Time Series Analysis Petroleum Economics Energy Policy Financial Markets Economic Research Stata Quantitative Analytics Microeconomics Development Economics Statistics Economic Modeling Statistical Modeling ", "Education Stanford University Graduate School of Business PhD,  Economics 2003  – 2007 Harvard University SM,  Computer Science 2002  – 2003 Harvard University AB,  Applied Math 1999  – 2003 Stanford University Graduate School of Business PhD,  Economics 2003  – 2007 Stanford University Graduate School of Business PhD,  Economics 2003  – 2007 Stanford University Graduate School of Business PhD,  Economics 2003  – 2007 Harvard University SM,  Computer Science 2002  – 2003 Harvard University SM,  Computer Science 2002  – 2003 Harvard University SM,  Computer Science 2002  – 2003 Harvard University AB,  Applied Math 1999  – 2003 Harvard University AB,  Applied Math 1999  – 2003 Harvard University AB,  Applied Math 1999  – 2003 ", "Summary Specialties:Industrial Organization, Econometrics, Organizational Economics Summary Specialties:Industrial Organization, Econometrics, Organizational Economics Specialties:Industrial Organization, Econometrics, Organizational Economics Specialties:Industrial Organization, Econometrics, Organizational Economics Experience Assistant Professor of Economics Stanford University July 2012  – Present (3 years 2 months) Stanford University, Department of Economics Assistant Professor of Economics Stanford University July 2012  – Present (3 years 2 months) Stanford University, Department of Economics Assistant Professor of Economics Stanford University July 2012  – Present (3 years 2 months) Stanford University, Department of Economics Education Harvard University Ph.D. 2006  – 2011 Harvard University M.A. 2008 Cornell University B.S. 2001  – 2005 University of Oxford 2003  – 2004 Harvard University Ph.D. 2006  – 2011 Harvard University Ph.D. 2006  – 2011 Harvard University Ph.D. 2006  – 2011 Harvard University M.A. 2008 Harvard University M.A. 2008 Harvard University M.A. 2008 Cornell University B.S. 2001  – 2005 Cornell University B.S. 2001  – 2005 Cornell University B.S. 2001  – 2005 University of Oxford 2003  – 2004 University of Oxford 2003  – 2004 University of Oxford 2003  – 2004 ", "Summary Econometrics: Forecasting; Volatility; Financial Econometrics; Time Series Analysis Specialties:Evaluation and comparison of forecasting models; Estimation of volatility using high-frequency data Summary Econometrics: Forecasting; Volatility; Financial Econometrics; Time Series Analysis Specialties:Evaluation and comparison of forecasting models; Estimation of volatility using high-frequency data Econometrics: Forecasting; Volatility; Financial Econometrics; Time Series Analysis Specialties:Evaluation and comparison of forecasting models; Estimation of volatility using high-frequency data Econometrics: Forecasting; Volatility; Financial Econometrics; Time Series Analysis Specialties:Evaluation and comparison of forecasting models; Estimation of volatility using high-frequency data Experience Professor of Econometrics European University Institute July 2011  – Present (4 years 2 months) Florence Area, Italy Assistant Professor of Economics Stanford University September 2004  –  July 2012  (7 years 11 months) Department of Economics, Stanford University Assistant Professor of Economics Brown University July 2000  –  June 2004  (4 years) Visiting Scholar European Central Bank May 2003  –  May 2003  (1 month) Professor of Econometrics European University Institute July 2011  – Present (4 years 2 months) Florence Area, Italy Professor of Econometrics European University Institute July 2011  – Present (4 years 2 months) Florence Area, Italy Assistant Professor of Economics Stanford University September 2004  –  July 2012  (7 years 11 months) Department of Economics, Stanford University Assistant Professor of Economics Stanford University September 2004  –  July 2012  (7 years 11 months) Department of Economics, Stanford University Assistant Professor of Economics Brown University July 2000  –  June 2004  (4 years) Assistant Professor of Economics Brown University July 2000  –  June 2004  (4 years) Visiting Scholar European Central Bank May 2003  –  May 2003  (1 month) Visiting Scholar European Central Bank May 2003  –  May 2003  (1 month) Skills Econometrics Economics Time Series Analysis Stata Microeconomics Macroeconomics Statistics Quantitative Analytics R Economic Research Statistical Modeling Econometric Modeling Financial Economics Eviews Development Economics Economic Modeling SAS Quantitative Finance Monte Carlo Simulation Mathematical Modeling Data Analysis Stochastic Calculus Financial Econometrics Quantitative Research See 9+     See less Skills  Econometrics Economics Time Series Analysis Stata Microeconomics Macroeconomics Statistics Quantitative Analytics R Economic Research Statistical Modeling Econometric Modeling Financial Economics Eviews Development Economics Economic Modeling SAS Quantitative Finance Monte Carlo Simulation Mathematical Modeling Data Analysis Stochastic Calculus Financial Econometrics Quantitative Research See 9+     See less Econometrics Economics Time Series Analysis Stata Microeconomics Macroeconomics Statistics Quantitative Analytics R Economic Research Statistical Modeling Econometric Modeling Financial Economics Eviews Development Economics Economic Modeling SAS Quantitative Finance Monte Carlo Simulation Mathematical Modeling Data Analysis Stochastic Calculus Financial Econometrics Quantitative Research See 9+     See less Econometrics Economics Time Series Analysis Stata Microeconomics Macroeconomics Statistics Quantitative Analytics R Economic Research Statistical Modeling Econometric Modeling Financial Economics Eviews Development Economics Economic Modeling SAS Quantitative Finance Monte Carlo Simulation Mathematical Modeling Data Analysis Stochastic Calculus Financial Econometrics Quantitative Research See 9+     See less Education University of California, San Diego Phd,  Economics 1996  – 2000 Københavns Universitet M.Sc.,  Mathematics ,  Economics ,  Statistics 1989  – 1995 Sorø Akademi Skole Matematik-Samfund 1984  – 1987 University of California, San Diego Phd,  Economics 1996  – 2000 University of California, San Diego Phd,  Economics 1996  – 2000 University of California, San Diego Phd,  Economics 1996  – 2000 Københavns Universitet M.Sc.,  Mathematics ,  Economics ,  Statistics 1989  – 1995 Københavns Universitet M.Sc.,  Mathematics ,  Economics ,  Statistics 1989  – 1995 Københavns Universitet M.Sc.,  Mathematics ,  Economics ,  Statistics 1989  – 1995 Sorø Akademi Skole Matematik-Samfund 1984  – 1987 Sorø Akademi Skole Matematik-Samfund 1984  – 1987 Sorø Akademi Skole Matematik-Samfund 1984  – 1987 ", "Experience Assistant Professor of Economics Stanford University September 2010  – Present (5 years) Assistant Professor of Economics Stanford University September 2010  – Present (5 years) Assistant Professor of Economics Stanford University September 2010  – Present (5 years) Skills Molecular Biology Event Planning Finance Competitive Analysis Economic Policy Intellectual Property Healthcare Financial Economics Academic Writing Social Sciences Student Development Mergers & Acquisitions Skills  Molecular Biology Event Planning Finance Competitive Analysis Economic Policy Intellectual Property Healthcare Financial Economics Academic Writing Social Sciences Student Development Mergers & Acquisitions Molecular Biology Event Planning Finance Competitive Analysis Economic Policy Intellectual Property Healthcare Financial Economics Academic Writing Social Sciences Student Development Mergers & Acquisitions Molecular Biology Event Planning Finance Competitive Analysis Economic Policy Intellectual Property Healthcare Financial Economics Academic Writing Social Sciences Student Development Mergers & Acquisitions Education Massachusetts Institute of Technology PhD,  Economics 2005  – 2010 University of Konstanz Diplom (MSc),  Economics 2000  – 2005 London School of Economics and Political Science Economics 2002  – 2003 Massachusetts Institute of Technology PhD,  Economics 2005  – 2010 Massachusetts Institute of Technology PhD,  Economics 2005  – 2010 Massachusetts Institute of Technology PhD,  Economics 2005  – 2010 University of Konstanz Diplom (MSc),  Economics 2000  – 2005 University of Konstanz Diplom (MSc),  Economics 2000  – 2005 University of Konstanz Diplom (MSc),  Economics 2000  – 2005 London School of Economics and Political Science Economics 2002  – 2003 London School of Economics and Political Science Economics 2002  – 2003 London School of Economics and Political Science Economics 2002  – 2003 ", "Experience Executive Director Economic History Association September 2004  – Present (11 years) Michel and Mary Orradre Professor of Economics Santa Clara University September 1992  – Present (23 years) Acting Dean, Leavey School of Business Santa Clara University July 1996  –  June 1997  (1 year) Chair, Department of Economics Santa Clara University July 1988  –  June 1993  (5 years) Member, Board of Trustees Santa Clara University July 1988  –  June 1991  (3 years) Acting Academic Vice President Santa Clara University July 1986  –  June 1987  (1 year) Chief Academic Office, Santa Clara University Assistant Professor of Economics Stanford University September 1974  –  June 1982  (7 years 10 months) Executive Director Economic History Association September 2004  – Present (11 years) Executive Director Economic History Association September 2004  – Present (11 years) Michel and Mary Orradre Professor of Economics Santa Clara University September 1992  – Present (23 years) Michel and Mary Orradre Professor of Economics Santa Clara University September 1992  – Present (23 years) Acting Dean, Leavey School of Business Santa Clara University July 1996  –  June 1997  (1 year) Acting Dean, Leavey School of Business Santa Clara University July 1996  –  June 1997  (1 year) Chair, Department of Economics Santa Clara University July 1988  –  June 1993  (5 years) Chair, Department of Economics Santa Clara University July 1988  –  June 1993  (5 years) Member, Board of Trustees Santa Clara University July 1988  –  June 1991  (3 years) Member, Board of Trustees Santa Clara University July 1988  –  June 1991  (3 years) Acting Academic Vice President Santa Clara University July 1986  –  June 1987  (1 year) Chief Academic Office, Santa Clara University Acting Academic Vice President Santa Clara University July 1986  –  June 1987  (1 year) Chief Academic Office, Santa Clara University Assistant Professor of Economics Stanford University September 1974  –  June 1982  (7 years 10 months) Assistant Professor of Economics Stanford University September 1974  –  June 1982  (7 years 10 months) Education University of California, Berkeley Ph.D.,  Economics 1971  – 1974 London School of Economics and Political Science M.Sc.,  Economics 1970  – 1971 Harvard University A.B.,  Economics 1966  – 1970 Activities and Societies:  Phi Beta Kappa University of California, Berkeley Ph.D.,  Economics 1971  – 1974 University of California, Berkeley Ph.D.,  Economics 1971  – 1974 University of California, Berkeley Ph.D.,  Economics 1971  – 1974 London School of Economics and Political Science M.Sc.,  Economics 1970  – 1971 London School of Economics and Political Science M.Sc.,  Economics 1970  – 1971 London School of Economics and Political Science M.Sc.,  Economics 1970  – 1971 Harvard University A.B.,  Economics 1966  – 1970 Activities and Societies:  Phi Beta Kappa Harvard University A.B.,  Economics 1966  – 1970 Activities and Societies:  Phi Beta Kappa Harvard University A.B.,  Economics 1966  – 1970 Activities and Societies:  Phi Beta Kappa ", "Experience Assistant Professor Stanford University 2014  – Present (1 year) Junior Scholar Federal Reserve Bank of Minneapolis 2013  –  2014  (1 year) Assistant Professor Stanford University 2014  – Present (1 year) Assistant Professor Stanford University 2014  – Present (1 year) Junior Scholar Federal Reserve Bank of Minneapolis 2013  –  2014  (1 year) Junior Scholar Federal Reserve Bank of Minneapolis 2013  –  2014  (1 year) Education Yale University PhD,  Economics 2007  – 2013 Budapest Corvinus University 2002  – 2003 Activities and Societies:  Erasmus exchange University of Auckland Bachelor's Degree,  Economics Yale University PhD,  Economics 2007  – 2013 Yale University PhD,  Economics 2007  – 2013 Yale University PhD,  Economics 2007  – 2013 Budapest Corvinus University 2002  – 2003 Activities and Societies:  Erasmus exchange Budapest Corvinus University 2002  – 2003 Activities and Societies:  Erasmus exchange Budapest Corvinus University 2002  – 2003 Activities and Societies:  Erasmus exchange University of Auckland Bachelor's Degree,  Economics University of Auckland Bachelor's Degree,  Economics University of Auckland Bachelor's Degree,  Economics ", "Experience Assistant Professor of Economics Stanford University July 2014  – Present (1 year 2 months) Stanford, California Assistant Professor of Economics Stanford University July 2014  – Present (1 year 2 months) Stanford, California Assistant Professor of Economics Stanford University July 2014  – Present (1 year 2 months) Stanford, California Languages   Skills Economics Research Statistics Stata LaTeX Data Analysis Econometrics Matlab Statistical Modeling Entrepreneurship Skills  Economics Research Statistics Stata LaTeX Data Analysis Econometrics Matlab Statistical Modeling Entrepreneurship Economics Research Statistics Stata LaTeX Data Analysis Econometrics Matlab Statistical Modeling Entrepreneurship Economics Research Statistics Stata LaTeX Data Analysis Econometrics Matlab Statistical Modeling Entrepreneurship Education Massachusetts Institute of Technology PhD,  Economics 2008  – 2013 National Science Foundation Graduate Research Fellowship Brigham Young University BA / BS,  Economics / Mathematics 2002  – 2008 Summa Cum Laude, Economics Department Valedictorian Massachusetts Institute of Technology PhD,  Economics 2008  – 2013 National Science Foundation Graduate Research Fellowship Massachusetts Institute of Technology PhD,  Economics 2008  – 2013 National Science Foundation Graduate Research Fellowship Massachusetts Institute of Technology PhD,  Economics 2008  – 2013 National Science Foundation Graduate Research Fellowship Brigham Young University BA / BS,  Economics / Mathematics 2002  – 2008 Summa Cum Laude, Economics Department Valedictorian Brigham Young University BA / BS,  Economics / Mathematics 2002  – 2008 Summa Cum Laude, Economics Department Valedictorian Brigham Young University BA / BS,  Economics / Mathematics 2002  – 2008 Summa Cum Laude, Economics Department Valedictorian ", "Summary I am an applied econometrician currently working as Chief Economist and Vice President for Amazon in Seattle, WA. Our team of PhD economists use applied econometrics to help Amazon better serve our customers and operate more efficiently. We have collaborated with other Amazonians to develop technically advanced but practical solutions in operations, pricing, forecasting, applied marketing and merchant services that currently power our platform. \n \nIf you are searching for a position where you can apply econometrics and economic reasoning in a fast paced, but collaborative environment contact me! There are almost always positions available for world class data scientists with a knack for delivering results. \n \nPrior to working at Amazon, I was a full time academic working in applied econometrics and empirical industrial organization. I am a Research Fellow at the National Bureau of Economic Research and have served as a journal editor and thesis advisor. While in academia, I consulted to the Boston Consulting Group, the Federal Reserve System, the Law and Economics Consulting Group, the US Federal Trade Commission and served as an expert witness in antitrust and litigation. Summary I am an applied econometrician currently working as Chief Economist and Vice President for Amazon in Seattle, WA. Our team of PhD economists use applied econometrics to help Amazon better serve our customers and operate more efficiently. We have collaborated with other Amazonians to develop technically advanced but practical solutions in operations, pricing, forecasting, applied marketing and merchant services that currently power our platform. \n \nIf you are searching for a position where you can apply econometrics and economic reasoning in a fast paced, but collaborative environment contact me! There are almost always positions available for world class data scientists with a knack for delivering results. \n \nPrior to working at Amazon, I was a full time academic working in applied econometrics and empirical industrial organization. I am a Research Fellow at the National Bureau of Economic Research and have served as a journal editor and thesis advisor. While in academia, I consulted to the Boston Consulting Group, the Federal Reserve System, the Law and Economics Consulting Group, the US Federal Trade Commission and served as an expert witness in antitrust and litigation. I am an applied econometrician currently working as Chief Economist and Vice President for Amazon in Seattle, WA. Our team of PhD economists use applied econometrics to help Amazon better serve our customers and operate more efficiently. We have collaborated with other Amazonians to develop technically advanced but practical solutions in operations, pricing, forecasting, applied marketing and merchant services that currently power our platform. \n \nIf you are searching for a position where you can apply econometrics and economic reasoning in a fast paced, but collaborative environment contact me! There are almost always positions available for world class data scientists with a knack for delivering results. \n \nPrior to working at Amazon, I was a full time academic working in applied econometrics and empirical industrial organization. I am a Research Fellow at the National Bureau of Economic Research and have served as a journal editor and thesis advisor. While in academia, I consulted to the Boston Consulting Group, the Federal Reserve System, the Law and Economics Consulting Group, the US Federal Trade Commission and served as an expert witness in antitrust and litigation. I am an applied econometrician currently working as Chief Economist and Vice President for Amazon in Seattle, WA. Our team of PhD economists use applied econometrics to help Amazon better serve our customers and operate more efficiently. We have collaborated with other Amazonians to develop technically advanced but practical solutions in operations, pricing, forecasting, applied marketing and merchant services that currently power our platform. \n \nIf you are searching for a position where you can apply econometrics and economic reasoning in a fast paced, but collaborative environment contact me! There are almost always positions available for world class data scientists with a knack for delivering results. \n \nPrior to working at Amazon, I was a full time academic working in applied econometrics and empirical industrial organization. I am a Research Fellow at the National Bureau of Economic Research and have served as a journal editor and thesis advisor. While in academia, I consulted to the Boston Consulting Group, the Federal Reserve System, the Law and Economics Consulting Group, the US Federal Trade Commission and served as an expert witness in antitrust and litigation. Experience Professor of Economics University of Washington June 2012  – Present (3 years 3 months) Greater Seattle Area Chief Economist and Vice President Amazon August 2010  – Present (5 years 1 month) Greater Seattle Area Experienced applied econometrician specializing in empirical industrial organization. My team applies economics and econometrics to data driven decisions. We are hiring. If you have strong skills in applied econometric methods, econometric programming and an interest in applying economic thinking to e-commerce, apply to our openings. Information and Decision Sciences Department Board (Founding Member) Carlson School of Management July 2015  – Present (2 months) Greater Minneapolis-St. Paul Area Affiliate Professor of Economics University of Minnesota June 2012  –  May 2014  (2 years) Greater Minneapolis-St. Paul Area Professor of Economics University of Minnesota June 2006  –  May 2012  (6 years) Professor of Economics University of Michigan June 2005  –  June 2006  (1 year 1 month) Ann Arbor, MI Associate Professor of Economics Duke University June 2003  –  June 2005  (2 years 1 month) Durham, NC Assistant Professor of Economics Stanford University June 1998  –  June 2003  (5 years 1 month) Palo Alto, CA Assistant Professor of Economics Harvard University June 1997  –  June 1998  (1 year 1 month) Cambridge, MA Professor of Economics University of Washington June 2012  – Present (3 years 3 months) Greater Seattle Area Professor of Economics University of Washington June 2012  – Present (3 years 3 months) Greater Seattle Area Chief Economist and Vice President Amazon August 2010  – Present (5 years 1 month) Greater Seattle Area Experienced applied econometrician specializing in empirical industrial organization. My team applies economics and econometrics to data driven decisions. We are hiring. If you have strong skills in applied econometric methods, econometric programming and an interest in applying economic thinking to e-commerce, apply to our openings. Chief Economist and Vice President Amazon August 2010  – Present (5 years 1 month) Greater Seattle Area Experienced applied econometrician specializing in empirical industrial organization. My team applies economics and econometrics to data driven decisions. We are hiring. If you have strong skills in applied econometric methods, econometric programming and an interest in applying economic thinking to e-commerce, apply to our openings. Information and Decision Sciences Department Board (Founding Member) Carlson School of Management July 2015  – Present (2 months) Greater Minneapolis-St. Paul Area Information and Decision Sciences Department Board (Founding Member) Carlson School of Management July 2015  – Present (2 months) Greater Minneapolis-St. Paul Area Affiliate Professor of Economics University of Minnesota June 2012  –  May 2014  (2 years) Greater Minneapolis-St. Paul Area Affiliate Professor of Economics University of Minnesota June 2012  –  May 2014  (2 years) Greater Minneapolis-St. Paul Area Professor of Economics University of Minnesota June 2006  –  May 2012  (6 years) Professor of Economics University of Minnesota June 2006  –  May 2012  (6 years) Professor of Economics University of Michigan June 2005  –  June 2006  (1 year 1 month) Ann Arbor, MI Professor of Economics University of Michigan June 2005  –  June 2006  (1 year 1 month) Ann Arbor, MI Associate Professor of Economics Duke University June 2003  –  June 2005  (2 years 1 month) Durham, NC Associate Professor of Economics Duke University June 2003  –  June 2005  (2 years 1 month) Durham, NC Assistant Professor of Economics Stanford University June 1998  –  June 2003  (5 years 1 month) Palo Alto, CA Assistant Professor of Economics Stanford University June 1998  –  June 2003  (5 years 1 month) Palo Alto, CA Assistant Professor of Economics Harvard University June 1997  –  June 1998  (1 year 1 month) Cambridge, MA Assistant Professor of Economics Harvard University June 1997  –  June 1998  (1 year 1 month) Cambridge, MA Skills Econometrics Industrial Organization Forecasting Game Theory Microeconomics Skills  Econometrics Industrial Organization Forecasting Game Theory Microeconomics Econometrics Industrial Organization Forecasting Game Theory Microeconomics Econometrics Industrial Organization Forecasting Game Theory Microeconomics Education University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Economics 1992  – 1997 University of Minnesota Bachelor of Science (BS),  Economics 1989  – 1992 University of Minnesota-Twin Cities Bachelor of Arts (BA),  Mathematics 1989  – 1992 St. John's University Economics 1987  – 1989 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Economics 1992  – 1997 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Economics 1992  – 1997 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Economics 1992  – 1997 University of Minnesota Bachelor of Science (BS),  Economics 1989  – 1992 University of Minnesota Bachelor of Science (BS),  Economics 1989  – 1992 University of Minnesota Bachelor of Science (BS),  Economics 1989  – 1992 University of Minnesota-Twin Cities Bachelor of Arts (BA),  Mathematics 1989  – 1992 University of Minnesota-Twin Cities Bachelor of Arts (BA),  Mathematics 1989  – 1992 University of Minnesota-Twin Cities Bachelor of Arts (BA),  Mathematics 1989  – 1992 St. John's University Economics 1987  – 1989 St. John's University Economics 1987  – 1989 St. John's University Economics 1987  – 1989 "]}