{"position": "Clinical Laboratory Scientist", "company": "Stanford University", "profiles": ["Experience Clinical Laboratory Scientist Stanford University Medical Center Clinical Laboratory Scientist Stanford University Medical Center Clinical Laboratory Scientist Stanford University Medical Center ", "Experience Senior Clinical Laboratory Scientist Stanford University School of Medicine February 2011  – Present (4 years 7 months) Histocompatibility, Immunogenetics and Disease Profiling Laboratory, Stanford Blood Center Histocompatibility Technologist Michigan State University December 2001  –  January 2011  (9 years 2 months) Histocompatibility and Immunogenetics Lab Senior Clinical Laboratory Scientist Stanford University School of Medicine February 2011  – Present (4 years 7 months) Histocompatibility, Immunogenetics and Disease Profiling Laboratory, Stanford Blood Center Senior Clinical Laboratory Scientist Stanford University School of Medicine February 2011  – Present (4 years 7 months) Histocompatibility, Immunogenetics and Disease Profiling Laboratory, Stanford Blood Center Histocompatibility Technologist Michigan State University December 2001  –  January 2011  (9 years 2 months) Histocompatibility and Immunogenetics Lab Histocompatibility Technologist Michigan State University December 2001  –  January 2011  (9 years 2 months) Histocompatibility and Immunogenetics Lab Skills High Complexity... HLA Flow Cytometry HLA Antibody Testing PCR Post-Transplant... Scheduling Supervisory Experience Histocompatibility CDC Crossmatching Immunology qPCR Event Planning Research Laboratory Molecular Biology Life Sciences Healthcare Data Analysis Cell Biology Performance Reviews On-call Support See 7+     See less Skills  High Complexity... HLA Flow Cytometry HLA Antibody Testing PCR Post-Transplant... Scheduling Supervisory Experience Histocompatibility CDC Crossmatching Immunology qPCR Event Planning Research Laboratory Molecular Biology Life Sciences Healthcare Data Analysis Cell Biology Performance Reviews On-call Support See 7+     See less High Complexity... HLA Flow Cytometry HLA Antibody Testing PCR Post-Transplant... Scheduling Supervisory Experience Histocompatibility CDC Crossmatching Immunology qPCR Event Planning Research Laboratory Molecular Biology Life Sciences Healthcare Data Analysis Cell Biology Performance Reviews On-call Support See 7+     See less High Complexity... HLA Flow Cytometry HLA Antibody Testing PCR Post-Transplant... Scheduling Supervisory Experience Histocompatibility CDC Crossmatching Immunology qPCR Event Planning Research Laboratory Molecular Biology Life Sciences Healthcare Data Analysis Cell Biology Performance Reviews On-call Support See 7+     See less Education Michigan State University Bachelor's degree,  Medical Technology 1997  – 2001 Michigan State University Bachelor's degree,  Medical Technology 1997  – 2001 Michigan State University Bachelor's degree,  Medical Technology 1997  – 2001 Michigan State University Bachelor's degree,  Medical Technology 1997  – 2001 ", "Experience Sr. Clinical Laboratory Scientist Stanford University Medical Center Sr. Clinical Laboratory Scientist Stanford University Medical Center Sr. Clinical Laboratory Scientist Stanford University Medical Center ", "Experience Sr. Clinical Laboratory Scientist Stanford University Medical Center September 2004  – Present (11 years) Palo Alto, CA sr. clinical lab scientist in the Molecular Pathology lab at Stanford Sr. Clinical Laboratory Scientist Sequoia Hospital November 1986  –  January 2013  (26 years 3 months) Redwood City, CA per diem position in hematology and chemistry Customer Trainer Omnicell 2000  –  2002  (2 years) Technical Support Rep/Trainer Syva 1981  –  2000  (19 years) Sr. Clinical Laboratory Scientist Stanford University Medical Center September 2004  – Present (11 years) Palo Alto, CA sr. clinical lab scientist in the Molecular Pathology lab at Stanford Sr. Clinical Laboratory Scientist Stanford University Medical Center September 2004  – Present (11 years) Palo Alto, CA sr. clinical lab scientist in the Molecular Pathology lab at Stanford Sr. Clinical Laboratory Scientist Sequoia Hospital November 1986  –  January 2013  (26 years 3 months) Redwood City, CA per diem position in hematology and chemistry Sr. Clinical Laboratory Scientist Sequoia Hospital November 1986  –  January 2013  (26 years 3 months) Redwood City, CA per diem position in hematology and chemistry Customer Trainer Omnicell 2000  –  2002  (2 years) Customer Trainer Omnicell 2000  –  2002  (2 years) Technical Support Rep/Trainer Syva 1981  –  2000  (19 years) Technical Support Rep/Trainer Syva 1981  –  2000  (19 years) Education University of California, Davis BS,  Biological Science 1969  – 1973 University of California, Davis BS,  Biological Science 1969  – 1973 University of California, Davis BS,  Biological Science 1969  – 1973 University of California, Davis BS,  Biological Science 1969  – 1973 ", "Experience Clinical Laboratory Scientist Stanford University Medical Center December 2000  – Present (14 years 9 months) Clinical Laboratory Scientist Stanford University Medical Center December 2000  – Present (14 years 9 months) Clinical Laboratory Scientist Stanford University Medical Center December 2000  – Present (14 years 9 months) Education Lnhs Lnhs Lnhs Lnhs ", "Skills DNA Sequencing Molecular Diagnostics Genomics Immunogenetics Molecular Biology Skills  DNA Sequencing Molecular Diagnostics Genomics Immunogenetics Molecular Biology DNA Sequencing Molecular Diagnostics Genomics Immunogenetics Molecular Biology DNA Sequencing Molecular Diagnostics Genomics Immunogenetics Molecular Biology ", "Experience Senior clinical laboratory scientist Stanford University Medical Center Senior clinical laboratory scientist Stanford University Medical Center Senior clinical laboratory scientist Stanford University Medical Center ", "Experience CLINICAL LABORATORY SCIENTIST Stanford University CLINICAL LABORATORY SCIENTIST Stanford University CLINICAL LABORATORY SCIENTIST Stanford University ", "Experience Clinical Laboratory Scientist Stanford University School of Medicine November 1993  – Present (21 years 10 months) Clinical Laboratory Scientist Stanford University School of Medicine November 1993  – Present (21 years 10 months) Clinical Laboratory Scientist Stanford University School of Medicine November 1993  – Present (21 years 10 months) ", "Experience Sr. Clinical Laboratory Scientist Stanford University Sr. Clinical Laboratory Scientist Stanford University Sr. Clinical Laboratory Scientist Stanford University ", "Experience Senior Clinical Laboratory Scientist Kaiser Permanente Hospital April 2011  – Present (4 years 5 months) Walnut Creek, California Senior Clinical Laboratory Scientist Director of Membership, TAN The African Network January 2003  –  September 2012  (9 years 9 months) In addition to being the Director of Membership for The African Network, I am a Senior Clinical Laboratory Scientist at Stanford University Hospital. At the moment I work in the Transfusion Service Department. Senior Clinical Laboratory Scientist Stanford University Hospita 2004  –  2008  (4 years) Senior Clinical Laboratory Scientist Kaiser Permanente Hospital April 2011  – Present (4 years 5 months) Walnut Creek, California Senior Clinical Laboratory Scientist Kaiser Permanente Hospital April 2011  – Present (4 years 5 months) Walnut Creek, California Senior Clinical Laboratory Scientist Director of Membership, TAN The African Network January 2003  –  September 2012  (9 years 9 months) In addition to being the Director of Membership for The African Network, I am a Senior Clinical Laboratory Scientist at Stanford University Hospital. At the moment I work in the Transfusion Service Department. Senior Clinical Laboratory Scientist Director of Membership, TAN The African Network January 2003  –  September 2012  (9 years 9 months) In addition to being the Director of Membership for The African Network, I am a Senior Clinical Laboratory Scientist at Stanford University Hospital. At the moment I work in the Transfusion Service Department. Senior Clinical Laboratory Scientist Stanford University Hospita 2004  –  2008  (4 years) Senior Clinical Laboratory Scientist Stanford University Hospita 2004  –  2008  (4 years) Languages French French French Skills Research Customer Service Microsoft Office Problem Solving Customer Relations Teaching Health Skills  Research Customer Service Microsoft Office Problem Solving Customer Relations Teaching Health Research Customer Service Microsoft Office Problem Solving Customer Relations Teaching Health Research Customer Service Microsoft Office Problem Solving Customer Relations Teaching Health Education Monterey Institute of International Studies Master of Arts,  TESOL 1988  – 1990 San Francisco State University Bachelor of Science,  Clinical Science 1979  – 1981 Monterey Institute of International Studies Master of Arts,  TESOL 1988  – 1990 Monterey Institute of International Studies Master of Arts,  TESOL 1988  – 1990 Monterey Institute of International Studies Master of Arts,  TESOL 1988  – 1990 San Francisco State University Bachelor of Science,  Clinical Science 1979  – 1981 San Francisco State University Bachelor of Science,  Clinical Science 1979  – 1981 San Francisco State University Bachelor of Science,  Clinical Science 1979  – 1981 ", "Summary In the workplace, I learn quickly and care about success. I am the type of person who enjoys taking on the big challenges and keeps the stress level low. I want my workplace to be something I look forward to going and feel like I have an impact there. My objectives include continuing to learn on the job or in training, teaching in the workplace and at school, and to grow as an employee.  Summary In the workplace, I learn quickly and care about success. I am the type of person who enjoys taking on the big challenges and keeps the stress level low. I want my workplace to be something I look forward to going and feel like I have an impact there. My objectives include continuing to learn on the job or in training, teaching in the workplace and at school, and to grow as an employee.  In the workplace, I learn quickly and care about success. I am the type of person who enjoys taking on the big challenges and keeps the stress level low. I want my workplace to be something I look forward to going and feel like I have an impact there. My objectives include continuing to learn on the job or in training, teaching in the workplace and at school, and to grow as an employee.  In the workplace, I learn quickly and care about success. I am the type of person who enjoys taking on the big challenges and keeps the stress level low. I want my workplace to be something I look forward to going and feel like I have an impact there. My objectives include continuing to learn on the job or in training, teaching in the workplace and at school, and to grow as an employee.  Experience Teacher Foothill-De Anza Community College District March 2014  – Present (1 year 6 months) Cupertino I teach Immuno/hematology lab once a year at De Anza Clinical laboratory scientist Stanford University October 2011  – Present (3 years 11 months) I work in a HLA Laboratory. This means matching patients and donors for transplantation as well as monitoring patients before and after transplant. Often there are severe time limitations, high stress, and a focus on accuracy. Main responsibilities include: low and high resolution sequencing (SSP, SSOP, Sequencing), antibody identification and strength, flow crossmatching between cells and serum, QC, troubleshooting, inventory, and education. I work with several robots and many different software platforms.  CLS Intern Stanford Hospital & Clinics September 2010  –  September 2011  (1 year 1 month) Administrative Assistant CPC Scientific November 2009  –  September 2010  (11 months) Teacher Foothill-De Anza Community College District March 2014  – Present (1 year 6 months) Cupertino I teach Immuno/hematology lab once a year at De Anza Teacher Foothill-De Anza Community College District March 2014  – Present (1 year 6 months) Cupertino I teach Immuno/hematology lab once a year at De Anza Clinical laboratory scientist Stanford University October 2011  – Present (3 years 11 months) I work in a HLA Laboratory. This means matching patients and donors for transplantation as well as monitoring patients before and after transplant. Often there are severe time limitations, high stress, and a focus on accuracy. Main responsibilities include: low and high resolution sequencing (SSP, SSOP, Sequencing), antibody identification and strength, flow crossmatching between cells and serum, QC, troubleshooting, inventory, and education. I work with several robots and many different software platforms.  Clinical laboratory scientist Stanford University October 2011  – Present (3 years 11 months) I work in a HLA Laboratory. This means matching patients and donors for transplantation as well as monitoring patients before and after transplant. Often there are severe time limitations, high stress, and a focus on accuracy. Main responsibilities include: low and high resolution sequencing (SSP, SSOP, Sequencing), antibody identification and strength, flow crossmatching between cells and serum, QC, troubleshooting, inventory, and education. I work with several robots and many different software platforms.  CLS Intern Stanford Hospital & Clinics September 2010  –  September 2011  (1 year 1 month) CLS Intern Stanford Hospital & Clinics September 2010  –  September 2011  (1 year 1 month) Administrative Assistant CPC Scientific November 2009  –  September 2010  (11 months) Administrative Assistant CPC Scientific November 2009  –  September 2010  (11 months) Languages English English English Education San Jose State University Clinical Laboratory Science/Medical Technology/Technologist 2010  – 2011 University of California, Davis Bachelor of Science (BS),  Biochemistry and Molecular Biology 2002  – 2006 San Jose State University Clinical Laboratory Science/Medical Technology/Technologist 2010  – 2011 San Jose State University Clinical Laboratory Science/Medical Technology/Technologist 2010  – 2011 San Jose State University Clinical Laboratory Science/Medical Technology/Technologist 2010  – 2011 University of California, Davis Bachelor of Science (BS),  Biochemistry and Molecular Biology 2002  – 2006 University of California, Davis Bachelor of Science (BS),  Biochemistry and Molecular Biology 2002  – 2006 University of California, Davis Bachelor of Science (BS),  Biochemistry and Molecular Biology 2002  – 2006 ", "Experience Clinical Laboratory Scientist Stanford University January 2006  – Present (9 years 8 months) Clinical Laboratory Scientist Stanford University January 2006  – Present (9 years 8 months) Clinical Laboratory Scientist Stanford University January 2006  – Present (9 years 8 months) Skills Immunology PCR Molecular Biology Genetics Cell Biology Flow Cytometry Biochemistry Clinical Research Life Sciences Research Skills  Immunology PCR Molecular Biology Genetics Cell Biology Flow Cytometry Biochemistry Clinical Research Life Sciences Research Immunology PCR Molecular Biology Genetics Cell Biology Flow Cytometry Biochemistry Clinical Research Life Sciences Research Immunology PCR Molecular Biology Genetics Cell Biology Flow Cytometry Biochemistry Clinical Research Life Sciences Research Education University of Wisconsin-Madison 1989  – 1993 University of Wisconsin-Madison 1989  – 1993 University of Wisconsin-Madison 1989  – 1993 University of Wisconsin-Madison 1989  – 1993 "]}