{"position": "Clinical Research Assistant", "company": "Stanford University", "profiles": ["Experience Clinical Research Assistant Stanford University School of Medicine Capacity Building and Technical Assistance Intern HealthHIV May 2014  –  August 2014  (4 months) Washington D.C. Metro Area • Developed a toolkit on the process of forming public-private partnerships for nonprofit organizations. \n• Analyzed and summarized evaluation data collected from various surveys, using SPSS. \n• Researched and reported on a wide variety of health and healthcare-related topics.  \n• Created PowerPoints for regional presentations to community members and health department staff. Richard Ellenbogen Undergraduate Neurological Surgery Fellow University of Washington June 2013  –  August 2013  (3 months) Seattle •\tStudied the effect of TWIST1 on the migration of neural progenitor cells. \n•\tAttended Neurosurgery Grand Rounds at Harborview Medical Center on a weekly basis. \n•\tObserved the complete resection of a bilateral meningioma.  \n•\tObserved the replacement of an Intrathecal Baclofen Pump in a patient with Cerebral Palsy. Lifeguard Mercer Island Beach Club 2011  –  2011  (less than a year) Clinical Research Assistant Stanford University School of Medicine Clinical Research Assistant Stanford University School of Medicine Capacity Building and Technical Assistance Intern HealthHIV May 2014  –  August 2014  (4 months) Washington D.C. Metro Area • Developed a toolkit on the process of forming public-private partnerships for nonprofit organizations. \n• Analyzed and summarized evaluation data collected from various surveys, using SPSS. \n• Researched and reported on a wide variety of health and healthcare-related topics.  \n• Created PowerPoints for regional presentations to community members and health department staff. Capacity Building and Technical Assistance Intern HealthHIV May 2014  –  August 2014  (4 months) Washington D.C. Metro Area • Developed a toolkit on the process of forming public-private partnerships for nonprofit organizations. \n• Analyzed and summarized evaluation data collected from various surveys, using SPSS. \n• Researched and reported on a wide variety of health and healthcare-related topics.  \n• Created PowerPoints for regional presentations to community members and health department staff. Richard Ellenbogen Undergraduate Neurological Surgery Fellow University of Washington June 2013  –  August 2013  (3 months) Seattle •\tStudied the effect of TWIST1 on the migration of neural progenitor cells. \n•\tAttended Neurosurgery Grand Rounds at Harborview Medical Center on a weekly basis. \n•\tObserved the complete resection of a bilateral meningioma.  \n•\tObserved the replacement of an Intrathecal Baclofen Pump in a patient with Cerebral Palsy. Richard Ellenbogen Undergraduate Neurological Surgery Fellow University of Washington June 2013  –  August 2013  (3 months) Seattle •\tStudied the effect of TWIST1 on the migration of neural progenitor cells. \n•\tAttended Neurosurgery Grand Rounds at Harborview Medical Center on a weekly basis. \n•\tObserved the complete resection of a bilateral meningioma.  \n•\tObserved the replacement of an Intrathecal Baclofen Pump in a patient with Cerebral Palsy. Lifeguard Mercer Island Beach Club 2011  –  2011  (less than a year) Lifeguard Mercer Island Beach Club 2011  –  2011  (less than a year) Languages   Skills Research Public Speaking Editing Neuroscience PowerPoint Microsoft Office Microsoft Excel Microsoft Word SPSS Cryostat Fluorescence Microscopy Grant Writing Social Media Nonprofits Community Outreach Data Analysis Teaching Spanish See 3+     See less Skills  Research Public Speaking Editing Neuroscience PowerPoint Microsoft Office Microsoft Excel Microsoft Word SPSS Cryostat Fluorescence Microscopy Grant Writing Social Media Nonprofits Community Outreach Data Analysis Teaching Spanish See 3+     See less Research Public Speaking Editing Neuroscience PowerPoint Microsoft Office Microsoft Excel Microsoft Word SPSS Cryostat Fluorescence Microscopy Grant Writing Social Media Nonprofits Community Outreach Data Analysis Teaching Spanish See 3+     See less Research Public Speaking Editing Neuroscience PowerPoint Microsoft Office Microsoft Excel Microsoft Word SPSS Cryostat Fluorescence Microscopy Grant Writing Social Media Nonprofits Community Outreach Data Analysis Teaching Spanish See 3+     See less Education Wesleyan University Bachelor's Degree,  Neuroscience and Behavior 2011  – 2015 Activities and Societies:  Varsity Women's Squash ,  Quasimodal A Cappella ,  Center for Prison Education Garfield High School 2007  – 2011 Wesleyan University Bachelor's Degree,  Neuroscience and Behavior 2011  – 2015 Activities and Societies:  Varsity Women's Squash ,  Quasimodal A Cappella ,  Center for Prison Education Wesleyan University Bachelor's Degree,  Neuroscience and Behavior 2011  – 2015 Activities and Societies:  Varsity Women's Squash ,  Quasimodal A Cappella ,  Center for Prison Education Wesleyan University Bachelor's Degree,  Neuroscience and Behavior 2011  – 2015 Activities and Societies:  Varsity Women's Squash ,  Quasimodal A Cappella ,  Center for Prison Education Garfield High School 2007  – 2011 Garfield High School 2007  – 2011 Garfield High School 2007  – 2011 Honors & Awards ", "Languages   Skills Skills     Honors & Awards ", "Summary In a world where categories define who we are, I like to specialize in not specializing. My passions and interests span across different fields and I am constantly seeking ways to connect the diversity of my skills. By using design thinking and creativity, I am able to navigate these seemingly separate seas. \n \nProfessionally, I am working toward becoming a health care provider, an innovator, a holistic health coach, and discovering the next great superfood. Personally, I am an artist, photographer, designer, traveler, vegetarian chef, yogi, blogger, listener, and a do-er. \n \nI want to be someone who can empower others to achieve their optimal health; to restore vitality and enable positive lifestyle changes. Whether that is by creating healthy recipes, inspiring wanderlust for the outdoors, designing spaces and lifestyles promoting health and activity, or by providing integrative, patient-centered care--there is no one-way avenue.  \n \nI believe it is important to take a step back and focus on who I am trying to help, while empathizing with their specific abilities or needs. My efforts will always be for the person or community for whom I am serving. Summary In a world where categories define who we are, I like to specialize in not specializing. My passions and interests span across different fields and I am constantly seeking ways to connect the diversity of my skills. By using design thinking and creativity, I am able to navigate these seemingly separate seas. \n \nProfessionally, I am working toward becoming a health care provider, an innovator, a holistic health coach, and discovering the next great superfood. Personally, I am an artist, photographer, designer, traveler, vegetarian chef, yogi, blogger, listener, and a do-er. \n \nI want to be someone who can empower others to achieve their optimal health; to restore vitality and enable positive lifestyle changes. Whether that is by creating healthy recipes, inspiring wanderlust for the outdoors, designing spaces and lifestyles promoting health and activity, or by providing integrative, patient-centered care--there is no one-way avenue.  \n \nI believe it is important to take a step back and focus on who I am trying to help, while empathizing with their specific abilities or needs. My efforts will always be for the person or community for whom I am serving. In a world where categories define who we are, I like to specialize in not specializing. My passions and interests span across different fields and I am constantly seeking ways to connect the diversity of my skills. By using design thinking and creativity, I am able to navigate these seemingly separate seas. \n \nProfessionally, I am working toward becoming a health care provider, an innovator, a holistic health coach, and discovering the next great superfood. Personally, I am an artist, photographer, designer, traveler, vegetarian chef, yogi, blogger, listener, and a do-er. \n \nI want to be someone who can empower others to achieve their optimal health; to restore vitality and enable positive lifestyle changes. Whether that is by creating healthy recipes, inspiring wanderlust for the outdoors, designing spaces and lifestyles promoting health and activity, or by providing integrative, patient-centered care--there is no one-way avenue.  \n \nI believe it is important to take a step back and focus on who I am trying to help, while empathizing with their specific abilities or needs. My efforts will always be for the person or community for whom I am serving. In a world where categories define who we are, I like to specialize in not specializing. My passions and interests span across different fields and I am constantly seeking ways to connect the diversity of my skills. By using design thinking and creativity, I am able to navigate these seemingly separate seas. \n \nProfessionally, I am working toward becoming a health care provider, an innovator, a holistic health coach, and discovering the next great superfood. Personally, I am an artist, photographer, designer, traveler, vegetarian chef, yogi, blogger, listener, and a do-er. \n \nI want to be someone who can empower others to achieve their optimal health; to restore vitality and enable positive lifestyle changes. Whether that is by creating healthy recipes, inspiring wanderlust for the outdoors, designing spaces and lifestyles promoting health and activity, or by providing integrative, patient-centered care--there is no one-way avenue.  \n \nI believe it is important to take a step back and focus on who I am trying to help, while empathizing with their specific abilities or needs. My efforts will always be for the person or community for whom I am serving. Experience Clinical Research Assistant Stanford University School of Medicine 2015  – Present (less than a year) Stanford, CA Division of Neurology--Stanford Stroke Center Clinical Research Assistant Stanford University School of Medicine 2015  – Present (less than a year) Stanford, CA Division of Neurology--Stanford Stroke Center Clinical Research Assistant Stanford University School of Medicine 2015  – Present (less than a year) Stanford, CA Division of Neurology--Stanford Stroke Center Languages   Skills Skills     Education Pepperdine University Bachelor of Science (B.S.) 2010  – 2014 Harvard University 2014 Pepperdine University, Argentina International Program 2013 Pepperdine University, Switzerland International Program 2012 Pepperdine University Bachelor of Science (B.S.) 2010  – 2014 Pepperdine University Bachelor of Science (B.S.) 2010  – 2014 Pepperdine University Bachelor of Science (B.S.) 2010  – 2014 Harvard University 2014 Harvard University 2014 Harvard University 2014 Pepperdine University, Argentina International Program 2013 Pepperdine University, Argentina International Program 2013 Pepperdine University, Argentina International Program 2013 Pepperdine University, Switzerland International Program 2012 Pepperdine University, Switzerland International Program 2012 Pepperdine University, Switzerland International Program 2012 Honors & Awards Fulbright National Finalist U.S. Department of State 2014  Fulbright Study/Research grant finalist- Sweden CSCAA Scholar All-American Team NCAA CSCAA 2014 Pepperdine NCAA Scholar Athlete Pepperdine University 2014 Phi Eta Sigma National Honors Society Pepperdine University 2011 Fulbright National Finalist U.S. Department of State 2014  Fulbright Study/Research grant finalist- Sweden Fulbright National Finalist U.S. Department of State 2014  Fulbright Study/Research grant finalist- Sweden Fulbright National Finalist U.S. Department of State 2014  Fulbright Study/Research grant finalist- Sweden CSCAA Scholar All-American Team NCAA CSCAA 2014 CSCAA Scholar All-American Team NCAA CSCAA 2014 CSCAA Scholar All-American Team NCAA CSCAA 2014 Pepperdine NCAA Scholar Athlete Pepperdine University 2014 Pepperdine NCAA Scholar Athlete Pepperdine University 2014 Pepperdine NCAA Scholar Athlete Pepperdine University 2014 Phi Eta Sigma National Honors Society Pepperdine University 2011 Phi Eta Sigma National Honors Society Pepperdine University 2011 Phi Eta Sigma National Honors Society Pepperdine University 2011 ", "Experience Clinical Research Assistant Stanford University School of Medicine August 2013  – Present (2 years 1 month) Stanford, CA Helped research epidemiology and treatment outcomes of patients with hepatitis B & C with a focus on real-world cohort studies & understudied populations. Mathematics Teacher East Palo Alto Stanford Academy (EPASA) September 2013  –  June 2014  (10 months) Haas Center for Community Service at Stanford University Taught 8th grade middle school students from East Palo Alto Mathematics every Saturday. Coordinator VIA (Volunteers in Asia) July 2013  –  August 2013  (2 months) As a coordinator for the American Language & Culture program, I planned company tours, presentations, and workshops to foster a cross-cultural experience for college students from the top universities in Asia, acting as a leader, guide, and ambassador. Academic Coach All Minds Matter March 2012  –  December 2012  (10 months) 476 E. Campbell Ave, Suite 200 Campbell, CA 95008 Daily academic intervention for teens on core skills and subjects—English, writing, history, math, science, world languages, technology, and research. Intern Acclaim Dental Care June 2011  –  December 2012  (1 year 7 months) 750 S. Winchester Blvd, San Jose, CA 95117 Scheduling patients, handling insurance claims, billing, and checking patient eligibility and benefits. Clinical Research Assistant Stanford University School of Medicine August 2013  – Present (2 years 1 month) Stanford, CA Helped research epidemiology and treatment outcomes of patients with hepatitis B & C with a focus on real-world cohort studies & understudied populations. Clinical Research Assistant Stanford University School of Medicine August 2013  – Present (2 years 1 month) Stanford, CA Helped research epidemiology and treatment outcomes of patients with hepatitis B & C with a focus on real-world cohort studies & understudied populations. Mathematics Teacher East Palo Alto Stanford Academy (EPASA) September 2013  –  June 2014  (10 months) Haas Center for Community Service at Stanford University Taught 8th grade middle school students from East Palo Alto Mathematics every Saturday. Mathematics Teacher East Palo Alto Stanford Academy (EPASA) September 2013  –  June 2014  (10 months) Haas Center for Community Service at Stanford University Taught 8th grade middle school students from East Palo Alto Mathematics every Saturday. Coordinator VIA (Volunteers in Asia) July 2013  –  August 2013  (2 months) As a coordinator for the American Language & Culture program, I planned company tours, presentations, and workshops to foster a cross-cultural experience for college students from the top universities in Asia, acting as a leader, guide, and ambassador. Coordinator VIA (Volunteers in Asia) July 2013  –  August 2013  (2 months) As a coordinator for the American Language & Culture program, I planned company tours, presentations, and workshops to foster a cross-cultural experience for college students from the top universities in Asia, acting as a leader, guide, and ambassador. Academic Coach All Minds Matter March 2012  –  December 2012  (10 months) 476 E. Campbell Ave, Suite 200 Campbell, CA 95008 Daily academic intervention for teens on core skills and subjects—English, writing, history, math, science, world languages, technology, and research. Academic Coach All Minds Matter March 2012  –  December 2012  (10 months) 476 E. Campbell Ave, Suite 200 Campbell, CA 95008 Daily academic intervention for teens on core skills and subjects—English, writing, history, math, science, world languages, technology, and research. Intern Acclaim Dental Care June 2011  –  December 2012  (1 year 7 months) 750 S. Winchester Blvd, San Jose, CA 95117 Scheduling patients, handling insurance claims, billing, and checking patient eligibility and benefits. Intern Acclaim Dental Care June 2011  –  December 2012  (1 year 7 months) 750 S. Winchester Blvd, San Jose, CA 95117 Scheduling patients, handling insurance claims, billing, and checking patient eligibility and benefits. Languages Vietnamese Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Public Speaking PowerPoint Adolescents Microsoft Office Microsoft Word Microsoft Excel Non-profits Leadership Editing Community Outreach Spanish Data Analysis Research Skills  Public Speaking PowerPoint Adolescents Microsoft Office Microsoft Word Microsoft Excel Non-profits Leadership Editing Community Outreach Spanish Data Analysis Research Public Speaking PowerPoint Adolescents Microsoft Office Microsoft Word Microsoft Excel Non-profits Leadership Editing Community Outreach Spanish Data Analysis Research Public Speaking PowerPoint Adolescents Microsoft Office Microsoft Word Microsoft Excel Non-profits Leadership Editing Community Outreach Spanish Data Analysis Research Education Stanford University Bachelor's Degree,  Biology ,  Minor in Philosophy , Junior 2012  – 2016 Pre-medicine career. Activities and Societies:  Alternative Spring Break (ASB) ,  East Palo Alto Stanford Academy (EPASA) ,  SVSA (Stanford Vietnamese Student Association) Archbishop Mitty High School 2008  – 2012 Activities and Societies:  Mock Trial ,  Mitty Advocacy Project ,  Monarch Newspaper ,  LIFE-Emmaus Team ,  Teacher's Assistant ,  ECJ Native American Experience Immersion Trip ,  Peer Tutoring Stanford University Bachelor's Degree,  Biology ,  Minor in Philosophy , Junior 2012  – 2016 Pre-medicine career. Activities and Societies:  Alternative Spring Break (ASB) ,  East Palo Alto Stanford Academy (EPASA) ,  SVSA (Stanford Vietnamese Student Association) Stanford University Bachelor's Degree,  Biology ,  Minor in Philosophy , Junior 2012  – 2016 Pre-medicine career. Activities and Societies:  Alternative Spring Break (ASB) ,  East Palo Alto Stanford Academy (EPASA) ,  SVSA (Stanford Vietnamese Student Association) Stanford University Bachelor's Degree,  Biology ,  Minor in Philosophy , Junior 2012  – 2016 Pre-medicine career. Activities and Societies:  Alternative Spring Break (ASB) ,  East Palo Alto Stanford Academy (EPASA) ,  SVSA (Stanford Vietnamese Student Association) Archbishop Mitty High School 2008  – 2012 Activities and Societies:  Mock Trial ,  Mitty Advocacy Project ,  Monarch Newspaper ,  LIFE-Emmaus Team ,  Teacher's Assistant ,  ECJ Native American Experience Immersion Trip ,  Peer Tutoring Archbishop Mitty High School 2008  – 2012 Activities and Societies:  Mock Trial ,  Mitty Advocacy Project ,  Monarch Newspaper ,  LIFE-Emmaus Team ,  Teacher's Assistant ,  ECJ Native American Experience Immersion Trip ,  Peer Tutoring Archbishop Mitty High School 2008  – 2012 Activities and Societies:  Mock Trial ,  Mitty Advocacy Project ,  Monarch Newspaper ,  LIFE-Emmaus Team ,  Teacher's Assistant ,  ECJ Native American Experience Immersion Trip ,  Peer Tutoring Honors & Awards Community-Based Research Fellows Program Grant The Haas Center for Public Service and the Office of the Vice Provost for Undergraduate Education (VPUE) April 2014 Received a grant for 10 weeks of full-time research that addresses community-identified needs during the summer quarter of 2014. Additional Honors & Awards English Departmental Award (2009) \nGeneral Excellence Undergraduate Award for English, Math, and Christian Service (2010) \nGeneral Excellence Undergraduate Award for Math, Community Service, and Newspaper (2011) \nBest Tester (3rd degree Black Belt) - Ernie Reye's West Coast Martial Arts (2011)  \nSan Jose City Council Recognition for the Jade Ribbon Youth Council at Stanford University (2011) \nAP Scholar with Distinction (2012) \nNational Merit Commended (2012) \nSanta Clara Optimists' Club Volunteer Award (2012) \n1st Place: Team Challenge at 12th Annual Youth Leadership Conference at Stanford University (2014) Community-Based Research Fellows Program Grant The Haas Center for Public Service and the Office of the Vice Provost for Undergraduate Education (VPUE) April 2014 Received a grant for 10 weeks of full-time research that addresses community-identified needs during the summer quarter of 2014. Community-Based Research Fellows Program Grant The Haas Center for Public Service and the Office of the Vice Provost for Undergraduate Education (VPUE) April 2014 Received a grant for 10 weeks of full-time research that addresses community-identified needs during the summer quarter of 2014. Community-Based Research Fellows Program Grant The Haas Center for Public Service and the Office of the Vice Provost for Undergraduate Education (VPUE) April 2014 Received a grant for 10 weeks of full-time research that addresses community-identified needs during the summer quarter of 2014. Additional Honors & Awards English Departmental Award (2009) \nGeneral Excellence Undergraduate Award for English, Math, and Christian Service (2010) \nGeneral Excellence Undergraduate Award for Math, Community Service, and Newspaper (2011) \nBest Tester (3rd degree Black Belt) - Ernie Reye's West Coast Martial Arts (2011)  \nSan Jose City Council Recognition for the Jade Ribbon Youth Council at Stanford University (2011) \nAP Scholar with Distinction (2012) \nNational Merit Commended (2012) \nSanta Clara Optimists' Club Volunteer Award (2012) \n1st Place: Team Challenge at 12th Annual Youth Leadership Conference at Stanford University (2014) Additional Honors & Awards English Departmental Award (2009) \nGeneral Excellence Undergraduate Award for English, Math, and Christian Service (2010) \nGeneral Excellence Undergraduate Award for Math, Community Service, and Newspaper (2011) \nBest Tester (3rd degree Black Belt) - Ernie Reye's West Coast Martial Arts (2011)  \nSan Jose City Council Recognition for the Jade Ribbon Youth Council at Stanford University (2011) \nAP Scholar with Distinction (2012) \nNational Merit Commended (2012) \nSanta Clara Optimists' Club Volunteer Award (2012) \n1st Place: Team Challenge at 12th Annual Youth Leadership Conference at Stanford University (2014) Additional Honors & Awards English Departmental Award (2009) \nGeneral Excellence Undergraduate Award for English, Math, and Christian Service (2010) \nGeneral Excellence Undergraduate Award for Math, Community Service, and Newspaper (2011) \nBest Tester (3rd degree Black Belt) - Ernie Reye's West Coast Martial Arts (2011)  \nSan Jose City Council Recognition for the Jade Ribbon Youth Council at Stanford University (2011) \nAP Scholar with Distinction (2012) \nNational Merit Commended (2012) \nSanta Clara Optimists' Club Volunteer Award (2012) \n1st Place: Team Challenge at 12th Annual Youth Leadership Conference at Stanford University (2014) ", "Summary Twenty years of experience as a research professional working in non-profit, university, and industry settings. Excels at personnel, project, and budget management; analytical thinking; creative problem solving; and complex organizational leadership. Known for fostering and maintaining positive and productive relationships through diplomacy and respect. Summary Twenty years of experience as a research professional working in non-profit, university, and industry settings. Excels at personnel, project, and budget management; analytical thinking; creative problem solving; and complex organizational leadership. Known for fostering and maintaining positive and productive relationships through diplomacy and respect. Twenty years of experience as a research professional working in non-profit, university, and industry settings. Excels at personnel, project, and budget management; analytical thinking; creative problem solving; and complex organizational leadership. Known for fostering and maintaining positive and productive relationships through diplomacy and respect. Twenty years of experience as a research professional working in non-profit, university, and industry settings. Excels at personnel, project, and budget management; analytical thinking; creative problem solving; and complex organizational leadership. Known for fostering and maintaining positive and productive relationships through diplomacy and respect. Experience Director, Epidemiology & Drug Safety IMS Health April 2015  – Present (5 months) Greater Seattle Area Senior Research Consultant Epidemiology Consulting April 2010  –  April 2015  (5 years 1 month) Greater Seattle Area Provide scientific and operational support for a varied portfolio of epidemiologic research projects. Develop study protocols and co-author scientific manuscripts, posters and abstracts. Oversee research study operations and data collection activities. Provide critical review of scientific synopses and reports. Develop training curriculum in research methods. Senior Manager, Research Operations Group Health Research Institute 2002  –  2007  (5 years) Greater Seattle Area Managed and led the Research Operations Department, which consisted of more than 120 research staff. Participated in Institute-wide strategic planning and leadership as member of the Administrative Leadership Team. Provided oversight for three major programs: Medical Records, Clinical Research, and Survey Research. Developed and implemented department-specific and Institute-wide policies and procedures related to grants management and study expenditures, human subjects and privacy protections, facilities and space management, and human resources management. Hired, supervised, and mentored research project managers. Oversaw department budget as well as annual budgeting process. Assured compliance with federal regulations. Provided consultation to internal and external colleagues in budgeting, project management, and study design and implementation. Senior Research Project Manager Group Health Research Institute 1998  –  2002  (4 years) Managed operations of two large, multi-site NIH-funded breast cancer research studies. Oversaw development and implementation of study protocols and procedures. Provided leadership as liaison to lead researchers and study coordinators at eight sites nationwide. Developed and led training sessions on study design and data collection at all sites. Performed statistical analyses and wrote scientific reports and manuscripts. Developed and monitored budgets. Participated in grant writing. Oversaw compliance with federal regulations and human subjects protections. Hired, trained, and supervised research staff. Graduate Research Assistant Fred Hutchinson Cancer Research Center 1996  –  1998  (2 years) Greater Seattle Area Provided epidemiologic research support for a large nationwide study of post-menopausal women’s health. Designed and implemented data collection instruments. Developed algorithms and quality-control measures for large data sets. Analyzed quantitative data, synthesized study results, wrote and published scientific manuscripts. Program Coordinator UCSF 1995  –  1996  (1 year) San Francisco Bay Area As member of clinic administrative team, participated in strategic planning to prepare for hospital shift to capitated care. Developed and conducted training sessions for clinic staff. Served as liaison between clinic staff and hospital management. Developed processes to assess clinic productivity and quality of care. Coordinated the implementation of an HIV/AIDS services grant. Developed and maintained tracking databases of HIV comorbidity and patient satisfaction. Monitored grant goals and objectives. Served as liaison to the City of San Francisco AIDS Office. Clinical Research Assistant Stanford University School of Medicine 1991  –  1995  (4 years) Palo Alto, CA Coordinated longitudinal research study of Alzheimer’s disease. Collected and maintained data for clinical trials and longitudinal studies. Trained staff on clinic protocols. Recruited and screened patients. Administered neuropsychological tests and assessed results in collaboration with clinic diagnostic team. Assisted in grant writing. Provided support for patients, caregivers, and families. Director, Epidemiology & Drug Safety IMS Health April 2015  – Present (5 months) Greater Seattle Area Director, Epidemiology & Drug Safety IMS Health April 2015  – Present (5 months) Greater Seattle Area Senior Research Consultant Epidemiology Consulting April 2010  –  April 2015  (5 years 1 month) Greater Seattle Area Provide scientific and operational support for a varied portfolio of epidemiologic research projects. Develop study protocols and co-author scientific manuscripts, posters and abstracts. Oversee research study operations and data collection activities. Provide critical review of scientific synopses and reports. Develop training curriculum in research methods. Senior Research Consultant Epidemiology Consulting April 2010  –  April 2015  (5 years 1 month) Greater Seattle Area Provide scientific and operational support for a varied portfolio of epidemiologic research projects. Develop study protocols and co-author scientific manuscripts, posters and abstracts. Oversee research study operations and data collection activities. Provide critical review of scientific synopses and reports. Develop training curriculum in research methods. Senior Manager, Research Operations Group Health Research Institute 2002  –  2007  (5 years) Greater Seattle Area Managed and led the Research Operations Department, which consisted of more than 120 research staff. Participated in Institute-wide strategic planning and leadership as member of the Administrative Leadership Team. Provided oversight for three major programs: Medical Records, Clinical Research, and Survey Research. Developed and implemented department-specific and Institute-wide policies and procedures related to grants management and study expenditures, human subjects and privacy protections, facilities and space management, and human resources management. Hired, supervised, and mentored research project managers. Oversaw department budget as well as annual budgeting process. Assured compliance with federal regulations. Provided consultation to internal and external colleagues in budgeting, project management, and study design and implementation. Senior Manager, Research Operations Group Health Research Institute 2002  –  2007  (5 years) Greater Seattle Area Managed and led the Research Operations Department, which consisted of more than 120 research staff. Participated in Institute-wide strategic planning and leadership as member of the Administrative Leadership Team. Provided oversight for three major programs: Medical Records, Clinical Research, and Survey Research. Developed and implemented department-specific and Institute-wide policies and procedures related to grants management and study expenditures, human subjects and privacy protections, facilities and space management, and human resources management. Hired, supervised, and mentored research project managers. Oversaw department budget as well as annual budgeting process. Assured compliance with federal regulations. Provided consultation to internal and external colleagues in budgeting, project management, and study design and implementation. Senior Research Project Manager Group Health Research Institute 1998  –  2002  (4 years) Managed operations of two large, multi-site NIH-funded breast cancer research studies. Oversaw development and implementation of study protocols and procedures. Provided leadership as liaison to lead researchers and study coordinators at eight sites nationwide. Developed and led training sessions on study design and data collection at all sites. Performed statistical analyses and wrote scientific reports and manuscripts. Developed and monitored budgets. Participated in grant writing. Oversaw compliance with federal regulations and human subjects protections. Hired, trained, and supervised research staff. Senior Research Project Manager Group Health Research Institute 1998  –  2002  (4 years) Managed operations of two large, multi-site NIH-funded breast cancer research studies. Oversaw development and implementation of study protocols and procedures. Provided leadership as liaison to lead researchers and study coordinators at eight sites nationwide. Developed and led training sessions on study design and data collection at all sites. Performed statistical analyses and wrote scientific reports and manuscripts. Developed and monitored budgets. Participated in grant writing. Oversaw compliance with federal regulations and human subjects protections. Hired, trained, and supervised research staff. Graduate Research Assistant Fred Hutchinson Cancer Research Center 1996  –  1998  (2 years) Greater Seattle Area Provided epidemiologic research support for a large nationwide study of post-menopausal women’s health. Designed and implemented data collection instruments. Developed algorithms and quality-control measures for large data sets. Analyzed quantitative data, synthesized study results, wrote and published scientific manuscripts. Graduate Research Assistant Fred Hutchinson Cancer Research Center 1996  –  1998  (2 years) Greater Seattle Area Provided epidemiologic research support for a large nationwide study of post-menopausal women’s health. Designed and implemented data collection instruments. Developed algorithms and quality-control measures for large data sets. Analyzed quantitative data, synthesized study results, wrote and published scientific manuscripts. Program Coordinator UCSF 1995  –  1996  (1 year) San Francisco Bay Area As member of clinic administrative team, participated in strategic planning to prepare for hospital shift to capitated care. Developed and conducted training sessions for clinic staff. Served as liaison between clinic staff and hospital management. Developed processes to assess clinic productivity and quality of care. Coordinated the implementation of an HIV/AIDS services grant. Developed and maintained tracking databases of HIV comorbidity and patient satisfaction. Monitored grant goals and objectives. Served as liaison to the City of San Francisco AIDS Office. Program Coordinator UCSF 1995  –  1996  (1 year) San Francisco Bay Area As member of clinic administrative team, participated in strategic planning to prepare for hospital shift to capitated care. Developed and conducted training sessions for clinic staff. Served as liaison between clinic staff and hospital management. Developed processes to assess clinic productivity and quality of care. Coordinated the implementation of an HIV/AIDS services grant. Developed and maintained tracking databases of HIV comorbidity and patient satisfaction. Monitored grant goals and objectives. Served as liaison to the City of San Francisco AIDS Office. Clinical Research Assistant Stanford University School of Medicine 1991  –  1995  (4 years) Palo Alto, CA Coordinated longitudinal research study of Alzheimer’s disease. Collected and maintained data for clinical trials and longitudinal studies. Trained staff on clinic protocols. Recruited and screened patients. Administered neuropsychological tests and assessed results in collaboration with clinic diagnostic team. Assisted in grant writing. Provided support for patients, caregivers, and families. Clinical Research Assistant Stanford University School of Medicine 1991  –  1995  (4 years) Palo Alto, CA Coordinated longitudinal research study of Alzheimer’s disease. Collected and maintained data for clinical trials and longitudinal studies. Trained staff on clinic protocols. Recruited and screened patients. Administered neuropsychological tests and assessed results in collaboration with clinic diagnostic team. Assisted in grant writing. Provided support for patients, caregivers, and families. Skills Public Health Epidemiology Program Management Management Cross-functional Team... Strategic Planning Mentoring Of Staff Grant Writing Proposal Writing Research Statistics Project Management Leadership Policy Grants Skills  Public Health Epidemiology Program Management Management Cross-functional Team... Strategic Planning Mentoring Of Staff Grant Writing Proposal Writing Research Statistics Project Management Leadership Policy Grants Public Health Epidemiology Program Management Management Cross-functional Team... Strategic Planning Mentoring Of Staff Grant Writing Proposal Writing Research Statistics Project Management Leadership Policy Grants Public Health Epidemiology Program Management Management Cross-functional Team... Strategic Planning Mentoring Of Staff Grant Writing Proposal Writing Research Statistics Project Management Leadership Policy Grants Education University of Washington, School of Public Health MPH,  Epidemiology 1996  – 1998 Emory University Bachelor of Arts,  Psychology 1986  – 1990 Activities and Societies:  Summa Cum Laude University of Washington, School of Public Health MPH,  Epidemiology 1996  – 1998 University of Washington, School of Public Health MPH,  Epidemiology 1996  – 1998 University of Washington, School of Public Health MPH,  Epidemiology 1996  – 1998 Emory University Bachelor of Arts,  Psychology 1986  – 1990 Activities and Societies:  Summa Cum Laude Emory University Bachelor of Arts,  Psychology 1986  – 1990 Activities and Societies:  Summa Cum Laude Emory University Bachelor of Arts,  Psychology 1986  – 1990 Activities and Societies:  Summa Cum Laude ", "Languages English Greek English Greek English Greek Skills Clinical Trials Clinical Development GCP Clinical Trial... Clinical Research Oncology Cancer Skills  Clinical Trials Clinical Development GCP Clinical Trial... Clinical Research Oncology Cancer Clinical Trials Clinical Development GCP Clinical Trial... Clinical Research Oncology Cancer Clinical Trials Clinical Development GCP Clinical Trial... Clinical Research Oncology Cancer Honors & Awards ", "Summary Seeking a clinical data management position that utilizes my technical expertise and laboratory experience Summary Seeking a clinical data management position that utilizes my technical expertise and laboratory experience Seeking a clinical data management position that utilizes my technical expertise and laboratory experience Seeking a clinical data management position that utilizes my technical expertise and laboratory experience Experience Clinical Research Assistant Stanford University October 2013  – Present (1 year 11 months) •\tCreate , design and manage projects in REDCap to aid various clinical studies \n•\tResponsible for successful data import of large files from Excel \n•\tIdentified data discrepancies by executing data quality rules \n•\tResolved errors by following the data resolution workflow \n•\tDeveloped queries for customized reports \n•\tDeveloped innovative methods to enhance the efficiency of the analysis Laboratory Assistant Foothill College April 2010  –  June 2010  (3 months)  Assisted in the experimental set-up for the Protein Electrophoretic systems course \n Prepared reagents and made aliquots \n Organized biohazard disposal Development Assistant PACT July 2005  –  March 2006  (9 months) San Jose,CA •\tMaintained fund raising donor database, Exceed! and other tracking documents \n•\tPrepared donor acknowledgement letters to be mailed within 2 business days of receipt of pledge or contribution \n•\tAssisted in the creation and maintenance of database procedures in conjunction with the Director of Development and the Office Manager \n•\tUpdated documents in Word, Excel, and PowerPoint \n•\tGenerated timely customized reports for the Director \n•\tAssisted with the preparation of solicitation packets and other promotional material \n•\tPrepared large mailings  \n•\tResearched possible funding sources of the organization as indicated by the Director of Development and the Executive Director \n•\tContent-managed the PACT website \n•\tAssisted with various logistics pertaining to PACT Leadership Luncheon and other fundraising and public relations activities Quality Control intern Hoechst Marion Roussel April 1998  –  May 1998  (2 months) Mumbai Area, India Obtained training in Chemical, Microbiological and Packaging material testing laboratories Quality Assurance intern Rhone-Poulenc April 1997  –  May 1997  (2 months) Mumbai Area, India Underwent extensive training in finished products and raw materials analysis using chemical methods Clinical Research Assistant Stanford University October 2013  – Present (1 year 11 months) •\tCreate , design and manage projects in REDCap to aid various clinical studies \n•\tResponsible for successful data import of large files from Excel \n•\tIdentified data discrepancies by executing data quality rules \n•\tResolved errors by following the data resolution workflow \n•\tDeveloped queries for customized reports \n•\tDeveloped innovative methods to enhance the efficiency of the analysis Clinical Research Assistant Stanford University October 2013  – Present (1 year 11 months) •\tCreate , design and manage projects in REDCap to aid various clinical studies \n•\tResponsible for successful data import of large files from Excel \n•\tIdentified data discrepancies by executing data quality rules \n•\tResolved errors by following the data resolution workflow \n•\tDeveloped queries for customized reports \n•\tDeveloped innovative methods to enhance the efficiency of the analysis Laboratory Assistant Foothill College April 2010  –  June 2010  (3 months)  Assisted in the experimental set-up for the Protein Electrophoretic systems course \n Prepared reagents and made aliquots \n Organized biohazard disposal Laboratory Assistant Foothill College April 2010  –  June 2010  (3 months)  Assisted in the experimental set-up for the Protein Electrophoretic systems course \n Prepared reagents and made aliquots \n Organized biohazard disposal Development Assistant PACT July 2005  –  March 2006  (9 months) San Jose,CA •\tMaintained fund raising donor database, Exceed! and other tracking documents \n•\tPrepared donor acknowledgement letters to be mailed within 2 business days of receipt of pledge or contribution \n•\tAssisted in the creation and maintenance of database procedures in conjunction with the Director of Development and the Office Manager \n•\tUpdated documents in Word, Excel, and PowerPoint \n•\tGenerated timely customized reports for the Director \n•\tAssisted with the preparation of solicitation packets and other promotional material \n•\tPrepared large mailings  \n•\tResearched possible funding sources of the organization as indicated by the Director of Development and the Executive Director \n•\tContent-managed the PACT website \n•\tAssisted with various logistics pertaining to PACT Leadership Luncheon and other fundraising and public relations activities Development Assistant PACT July 2005  –  March 2006  (9 months) San Jose,CA •\tMaintained fund raising donor database, Exceed! and other tracking documents \n•\tPrepared donor acknowledgement letters to be mailed within 2 business days of receipt of pledge or contribution \n•\tAssisted in the creation and maintenance of database procedures in conjunction with the Director of Development and the Office Manager \n•\tUpdated documents in Word, Excel, and PowerPoint \n•\tGenerated timely customized reports for the Director \n•\tAssisted with the preparation of solicitation packets and other promotional material \n•\tPrepared large mailings  \n•\tResearched possible funding sources of the organization as indicated by the Director of Development and the Executive Director \n•\tContent-managed the PACT website \n•\tAssisted with various logistics pertaining to PACT Leadership Luncheon and other fundraising and public relations activities Quality Control intern Hoechst Marion Roussel April 1998  –  May 1998  (2 months) Mumbai Area, India Obtained training in Chemical, Microbiological and Packaging material testing laboratories Quality Control intern Hoechst Marion Roussel April 1998  –  May 1998  (2 months) Mumbai Area, India Obtained training in Chemical, Microbiological and Packaging material testing laboratories Quality Assurance intern Rhone-Poulenc April 1997  –  May 1997  (2 months) Mumbai Area, India Underwent extensive training in finished products and raw materials analysis using chemical methods Quality Assurance intern Rhone-Poulenc April 1997  –  May 1997  (2 months) Mumbai Area, India Underwent extensive training in finished products and raw materials analysis using chemical methods Languages   Skills REDCap Agarose Gel... SDS-PAGE Western Blot DNA modification using... Plasmid miniprep Immunological assays... PCR Microsoft Office Bioinformatics tools... Skills  REDCap Agarose Gel... SDS-PAGE Western Blot DNA modification using... Plasmid miniprep Immunological assays... PCR Microsoft Office Bioinformatics tools... REDCap Agarose Gel... SDS-PAGE Western Blot DNA modification using... Plasmid miniprep Immunological assays... PCR Microsoft Office Bioinformatics tools... REDCap Agarose Gel... SDS-PAGE Western Blot DNA modification using... Plasmid miniprep Immunological assays... PCR Microsoft Office Bioinformatics tools... Education Foothill College Certificate Program,  Biotechnology , 3.78 2008  – 2010 SNDT University Master's degree,  Computer Applications , 3.86 1999  – 2002 Mumbai University Bachelor's degree,  Industrial Chemistry , 3.82 1996  – 1999 Foothill College Certificate Program,  Biotechnology , 3.78 2008  – 2010 Foothill College Certificate Program,  Biotechnology , 3.78 2008  – 2010 Foothill College Certificate Program,  Biotechnology , 3.78 2008  – 2010 SNDT University Master's degree,  Computer Applications , 3.86 1999  – 2002 SNDT University Master's degree,  Computer Applications , 3.86 1999  – 2002 SNDT University Master's degree,  Computer Applications , 3.86 1999  – 2002 Mumbai University Bachelor's degree,  Industrial Chemistry , 3.82 1996  – 1999 Mumbai University Bachelor's degree,  Industrial Chemistry , 3.82 1996  – 1999 Mumbai University Bachelor's degree,  Industrial Chemistry , 3.82 1996  – 1999 ", "Skills Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol Skills  Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol ", "Summary Clinical Research Scientist with four years experience in working with neuroactive therapeutics and quality management. Expertise in development and validation of SOPs for the clinical practice according to the FDA guidelines. Profound knowledge of maintaining adherence to protocol guidelines, professional interactions with study participants and research data entry for monitoring study progress. Sound knowledge in the planning and implementation of complex clinical research projects. Excellent interpersonal and organizational skills in the organization as a team leader of interdisciplinary networks. Enthusiasm for learning new knowledge and the ability to adapt and perform in a fast-paced environment and to juggle priorities to meet changes in protocols, procedures and timelines as required with accuracy and attention to detail. Summary Clinical Research Scientist with four years experience in working with neuroactive therapeutics and quality management. Expertise in development and validation of SOPs for the clinical practice according to the FDA guidelines. Profound knowledge of maintaining adherence to protocol guidelines, professional interactions with study participants and research data entry for monitoring study progress. Sound knowledge in the planning and implementation of complex clinical research projects. Excellent interpersonal and organizational skills in the organization as a team leader of interdisciplinary networks. Enthusiasm for learning new knowledge and the ability to adapt and perform in a fast-paced environment and to juggle priorities to meet changes in protocols, procedures and timelines as required with accuracy and attention to detail. Clinical Research Scientist with four years experience in working with neuroactive therapeutics and quality management. Expertise in development and validation of SOPs for the clinical practice according to the FDA guidelines. Profound knowledge of maintaining adherence to protocol guidelines, professional interactions with study participants and research data entry for monitoring study progress. Sound knowledge in the planning and implementation of complex clinical research projects. Excellent interpersonal and organizational skills in the organization as a team leader of interdisciplinary networks. Enthusiasm for learning new knowledge and the ability to adapt and perform in a fast-paced environment and to juggle priorities to meet changes in protocols, procedures and timelines as required with accuracy and attention to detail. Clinical Research Scientist with four years experience in working with neuroactive therapeutics and quality management. Expertise in development and validation of SOPs for the clinical practice according to the FDA guidelines. Profound knowledge of maintaining adherence to protocol guidelines, professional interactions with study participants and research data entry for monitoring study progress. Sound knowledge in the planning and implementation of complex clinical research projects. Excellent interpersonal and organizational skills in the organization as a team leader of interdisciplinary networks. Enthusiasm for learning new knowledge and the ability to adapt and perform in a fast-paced environment and to juggle priorities to meet changes in protocols, procedures and timelines as required with accuracy and attention to detail. Experience Clinical Research Assistant Stanford University May 2015  – Present (4 months) 800 Welch Road, FC3C26; Palo Alto, CA 94304 Assisting with the overall management and implementation of an assigned set of multiple research protocols in Pediatric Hematology/Oncology. Reporting to the Clinical Trials Supervisor, in conjunction with the CCTO Director and the PI and working under the direction of the Clinical Trials Supervisor managing clinical trials related to Industry/Children’s Oncology Group (COG)/St. Jude Children’s Research Hospital (SJCRH) sponsored clinical research activities. Responsible for coordinating with the Cancer Center, the GCRC, RMG and the IRB to ensure that all clinical and regulatory procedures are followed and documented. Clinical Research Assistant Stanford University School of Medicine 2014  –  April 2015  (1 year) Stanford Responsible for maintaining adherence to protocol guidelines, professional interactions with study participants including study recruitment, perform clinical quality control (QC) of data collection forms, data entry of recruitment and research data into EDC databases and compiling data summaries for monitoring study progress. Managing of research study budgeting and billing. Postdoctoral Fellow Stanford University School of Medicine January 2014  –  October 2014  (10 months) Department of Anesthesiology, Perioperative, and Pain Medicine Project: Regulation of ethanol-induced analgesia via ALDH2 PhD student Charité 2008  –  October 2013  (5 years) Berlin Area, Germany PhD studies at the Department of Anesthesiology and Operative Intensive Care Medicine. Responsible for the organisation of the Berlin Network on \"Inflammation in Context of Pain and Disease\" and person in charge for Anesthesiology lab seminar/ journal club. \n \nPhD project: Enhancement of the Intestinal Epithelial Permeability of Peripherally Acting Opioid Analgesics by Chitosan Clinical Research Assistant Stanford University May 2015  – Present (4 months) 800 Welch Road, FC3C26; Palo Alto, CA 94304 Assisting with the overall management and implementation of an assigned set of multiple research protocols in Pediatric Hematology/Oncology. Reporting to the Clinical Trials Supervisor, in conjunction with the CCTO Director and the PI and working under the direction of the Clinical Trials Supervisor managing clinical trials related to Industry/Children’s Oncology Group (COG)/St. Jude Children’s Research Hospital (SJCRH) sponsored clinical research activities. Responsible for coordinating with the Cancer Center, the GCRC, RMG and the IRB to ensure that all clinical and regulatory procedures are followed and documented. Clinical Research Assistant Stanford University May 2015  – Present (4 months) 800 Welch Road, FC3C26; Palo Alto, CA 94304 Assisting with the overall management and implementation of an assigned set of multiple research protocols in Pediatric Hematology/Oncology. Reporting to the Clinical Trials Supervisor, in conjunction with the CCTO Director and the PI and working under the direction of the Clinical Trials Supervisor managing clinical trials related to Industry/Children’s Oncology Group (COG)/St. Jude Children’s Research Hospital (SJCRH) sponsored clinical research activities. Responsible for coordinating with the Cancer Center, the GCRC, RMG and the IRB to ensure that all clinical and regulatory procedures are followed and documented. Clinical Research Assistant Stanford University School of Medicine 2014  –  April 2015  (1 year) Stanford Responsible for maintaining adherence to protocol guidelines, professional interactions with study participants including study recruitment, perform clinical quality control (QC) of data collection forms, data entry of recruitment and research data into EDC databases and compiling data summaries for monitoring study progress. Managing of research study budgeting and billing. Clinical Research Assistant Stanford University School of Medicine 2014  –  April 2015  (1 year) Stanford Responsible for maintaining adherence to protocol guidelines, professional interactions with study participants including study recruitment, perform clinical quality control (QC) of data collection forms, data entry of recruitment and research data into EDC databases and compiling data summaries for monitoring study progress. Managing of research study budgeting and billing. Postdoctoral Fellow Stanford University School of Medicine January 2014  –  October 2014  (10 months) Department of Anesthesiology, Perioperative, and Pain Medicine Project: Regulation of ethanol-induced analgesia via ALDH2 Postdoctoral Fellow Stanford University School of Medicine January 2014  –  October 2014  (10 months) Department of Anesthesiology, Perioperative, and Pain Medicine Project: Regulation of ethanol-induced analgesia via ALDH2 PhD student Charité 2008  –  October 2013  (5 years) Berlin Area, Germany PhD studies at the Department of Anesthesiology and Operative Intensive Care Medicine. Responsible for the organisation of the Berlin Network on \"Inflammation in Context of Pain and Disease\" and person in charge for Anesthesiology lab seminar/ journal club. \n \nPhD project: Enhancement of the Intestinal Epithelial Permeability of Peripherally Acting Opioid Analgesics by Chitosan PhD student Charité 2008  –  October 2013  (5 years) Berlin Area, Germany PhD studies at the Department of Anesthesiology and Operative Intensive Care Medicine. Responsible for the organisation of the Berlin Network on \"Inflammation in Context of Pain and Disease\" and person in charge for Anesthesiology lab seminar/ journal club. \n \nPhD project: Enhancement of the Intestinal Epithelial Permeability of Peripherally Acting Opioid Analgesics by Chitosan Languages Englisch Full professional proficiency Deutsch Native or bilingual proficiency Französisch Elementary proficiency Englisch Full professional proficiency Deutsch Native or bilingual proficiency Französisch Elementary proficiency Englisch Full professional proficiency Deutsch Native or bilingual proficiency Französisch Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills ICH-GCP HIPAA Anaesthetics Drug Development Pain Management Inflammation Animal Behavior LC-MS/MS Statistical Data... Bioavailability Network Coordination Biophysical Chemistry Targeted Drug Delivery Skills  ICH-GCP HIPAA Anaesthetics Drug Development Pain Management Inflammation Animal Behavior LC-MS/MS Statistical Data... Bioavailability Network Coordination Biophysical Chemistry Targeted Drug Delivery ICH-GCP HIPAA Anaesthetics Drug Development Pain Management Inflammation Animal Behavior LC-MS/MS Statistical Data... Bioavailability Network Coordination Biophysical Chemistry Targeted Drug Delivery ICH-GCP HIPAA Anaesthetics Drug Development Pain Management Inflammation Animal Behavior LC-MS/MS Statistical Data... Bioavailability Network Coordination Biophysical Chemistry Targeted Drug Delivery Education Charité Berlin and Humboldt-Universität zu Berlin PhD,  Biology , Magna cum laude 2008  – 2013 Humboldt-Universität zu Berlin Diplom,  Biologie/biologische Wissenschaften, allgemein 2002  – 2008 Charité Berlin and Humboldt-Universität zu Berlin PhD,  Biology , Magna cum laude 2008  – 2013 Charité Berlin and Humboldt-Universität zu Berlin PhD,  Biology , Magna cum laude 2008  – 2013 Charité Berlin and Humboldt-Universität zu Berlin PhD,  Biology , Magna cum laude 2008  – 2013 Humboldt-Universität zu Berlin Diplom,  Biologie/biologische Wissenschaften, allgemein 2002  – 2008 Humboldt-Universität zu Berlin Diplom,  Biologie/biologische Wissenschaften, allgemein 2002  – 2008 Humboldt-Universität zu Berlin Diplom,  Biologie/biologische Wissenschaften, allgemein 2002  – 2008 ", "Summary Experienced engineer/researcher with exceptional analytical skills and a strong interest in clinical medicine and research Summary Experienced engineer/researcher with exceptional analytical skills and a strong interest in clinical medicine and research Experienced engineer/researcher with exceptional analytical skills and a strong interest in clinical medicine and research Experienced engineer/researcher with exceptional analytical skills and a strong interest in clinical medicine and research Experience Clinical Research Intern Massachusetts Eye and Ear Infirmary June 2011  –  August 2011  (3 months) Clinical Research Assistant Stanford University School of Medicine June 2009  –  May 2011  (2 years) Applications Development Engineer KLA-Tencor July 2007  –  January 2009  (1 year 7 months) R&D Engineer Intern Hewlett-Packard May 2006  –  August 2006  (4 months) Research Assistant Cornell University August 2005  –  May 2006  (10 months) Field Engineer Intern Schlumberger June 2005  –  August 2005  (3 months) Clinical Research Intern Massachusetts Eye and Ear Infirmary June 2011  –  August 2011  (3 months) Clinical Research Intern Massachusetts Eye and Ear Infirmary June 2011  –  August 2011  (3 months) Clinical Research Assistant Stanford University School of Medicine June 2009  –  May 2011  (2 years) Clinical Research Assistant Stanford University School of Medicine June 2009  –  May 2011  (2 years) Applications Development Engineer KLA-Tencor July 2007  –  January 2009  (1 year 7 months) Applications Development Engineer KLA-Tencor July 2007  –  January 2009  (1 year 7 months) R&D Engineer Intern Hewlett-Packard May 2006  –  August 2006  (4 months) R&D Engineer Intern Hewlett-Packard May 2006  –  August 2006  (4 months) Research Assistant Cornell University August 2005  –  May 2006  (10 months) Research Assistant Cornell University August 2005  –  May 2006  (10 months) Field Engineer Intern Schlumberger June 2005  –  August 2005  (3 months) Field Engineer Intern Schlumberger June 2005  –  August 2005  (3 months) Skills Data Analysis Clinical Research Biochemistry Product Development Project Management Teaching Matlab Microsoft Excel Cross-functional Team... Characterization R&D Problem Solving Skills  Data Analysis Clinical Research Biochemistry Product Development Project Management Teaching Matlab Microsoft Excel Cross-functional Team... Characterization R&D Problem Solving Data Analysis Clinical Research Biochemistry Product Development Project Management Teaching Matlab Microsoft Excel Cross-functional Team... Characterization R&D Problem Solving Data Analysis Clinical Research Biochemistry Product Development Project Management Teaching Matlab Microsoft Excel Cross-functional Team... Characterization R&D Problem Solving Education Cornell University Bachelor of Science,  Chemical Engineering 2003  – 2007 Dorothy M. Olds Academic Scholarship University of Arkansas for Medical Sciences, College of Medicine MD,  Medicine Activities and Societies:  American Medical Association ,  Arkansas Medical Society ,  Harmony Health Free Clinic ,  Sight Savers Clinic Cornell University Bachelor of Science,  Chemical Engineering 2003  – 2007 Dorothy M. Olds Academic Scholarship Cornell University Bachelor of Science,  Chemical Engineering 2003  – 2007 Dorothy M. Olds Academic Scholarship Cornell University Bachelor of Science,  Chemical Engineering 2003  – 2007 Dorothy M. Olds Academic Scholarship University of Arkansas for Medical Sciences, College of Medicine MD,  Medicine Activities and Societies:  American Medical Association ,  Arkansas Medical Society ,  Harmony Health Free Clinic ,  Sight Savers Clinic University of Arkansas for Medical Sciences, College of Medicine MD,  Medicine Activities and Societies:  American Medical Association ,  Arkansas Medical Society ,  Harmony Health Free Clinic ,  Sight Savers Clinic University of Arkansas for Medical Sciences, College of Medicine MD,  Medicine Activities and Societies:  American Medical Association ,  Arkansas Medical Society ,  Harmony Health Free Clinic ,  Sight Savers Clinic Honors & Awards Additional Honors & Awards Dorothy M. Olds Academic Scholarship Additional Honors & Awards Dorothy M. Olds Academic Scholarship Additional Honors & Awards Dorothy M. Olds Academic Scholarship Additional Honors & Awards Dorothy M. Olds Academic Scholarship ", "Summary Interior Designer specializing in all aspects of home remodeling and updating including: paint color selection, furniture purchase and placement, bathroom design, flooring and marrying interiors to exteriors of homes to create a unified flow. \n \nSpecialties: Merging of different styles; working with couples; working with families; paint/color consulting; furniture selection and placement; analysis of client style \n \nCurrently living and working in Austin, Tx. I also work in the Bay Area, California, flying there on a quarterly basis to work with clients. Summary Interior Designer specializing in all aspects of home remodeling and updating including: paint color selection, furniture purchase and placement, bathroom design, flooring and marrying interiors to exteriors of homes to create a unified flow. \n \nSpecialties: Merging of different styles; working with couples; working with families; paint/color consulting; furniture selection and placement; analysis of client style \n \nCurrently living and working in Austin, Tx. I also work in the Bay Area, California, flying there on a quarterly basis to work with clients. Interior Designer specializing in all aspects of home remodeling and updating including: paint color selection, furniture purchase and placement, bathroom design, flooring and marrying interiors to exteriors of homes to create a unified flow. \n \nSpecialties: Merging of different styles; working with couples; working with families; paint/color consulting; furniture selection and placement; analysis of client style \n \nCurrently living and working in Austin, Tx. I also work in the Bay Area, California, flying there on a quarterly basis to work with clients. Interior Designer specializing in all aspects of home remodeling and updating including: paint color selection, furniture purchase and placement, bathroom design, flooring and marrying interiors to exteriors of homes to create a unified flow. \n \nSpecialties: Merging of different styles; working with couples; working with families; paint/color consulting; furniture selection and placement; analysis of client style \n \nCurrently living and working in Austin, Tx. I also work in the Bay Area, California, flying there on a quarterly basis to work with clients. Experience Clinical Research Assistant Stanford University Medical Center August 2005  – Present (10 years 1 month) Pediatric Endocrinology •\tRecruiting, scheduling and preparation of patients for all clinical study visits for diabetes related medical devices for 1 + year Medtronic sponsored study \n•\tFacilitating Principal Investigator and Clinical Research Coordinator with study visits including: organization of materials prior to visit, training patients on medical devices, analyzing data and providing input, documentation, liaison between patients, doctors and clinical researchers. \n•\tExtensive work on Medtronic MiniMed 722 Insulin Pump system Interior Designer and Owner Envision Interiors May 1998  – Present (17 years 4 months) Mountain View, California Interior Design for all aspects and phases of projects. From inception of home building to final accoutrements. Specializing in paint color selection, flooring, furniture procurement and placement and accessories. \n \n• Working with all aspects of residential interior design including space planning, material selection and wall color consultations as well as furniture locating, purchasing, selection and placement \n• Ability to work within client budgets and time lines  \n• Direct working relationship with builders, painters, wholesalers and trades people, enabling cost savings for clients \n• Review of architectural specifications prior to approval in order to create space efficiency and correct flow  \n \nPersonalized Fine Art. Sales Medtronic MiniMed July 2001  –  August 2005  (4 years 2 months) •\tMet and exceeded insulin delivery pump quotas in 2001 by 116%. Top producer in United States for insulin pump sales -- Dec 2001 (156% to quota). Exceeded Continuous Glucose Monitoring System (CGMS) and CGMS blood sensor sales in 2002-2003 by 134% \n•\tMaintained and built on previous relationships with Endocrinologists to earn their trust in MiniMed products and to increase prescription recommendations for the insulin pump. Worked with physicians on developing diabetes resources to address patient needs and encourage diabetes self-management and better health outcomes. Created insulin pump programs in offices with no internal diabetes management infrastructure under specific budgetary constraints \n•\tMentored MiniMed nurses and local sales reps in increasing insulin pump and CGMS sales by focusing on patient education and continuum of care (follow-through) \n•\tLiaison between physicians and diabetes care teams to improve patient care and monitor continuum of care with pump therapy. Acting liaison between MiniMed Nurses and patients starting insulin pump therapy. \n•\tCoordinated, conducted and analyzed data from CGMS Clinics to explain to doctors and further promote sales of CGMS in Endocrinologists’ offices. Sales LifeScan 1999  –  2001  (2 years) Sales LifeScan 1999  –  2001  (2 years) •\tBuilt LifeScan strip market share to 60% in the Bay Area territory including increasing of new product market share by 3.2% in one year. Awarded second highest overall market share and third highest FastTake market share in the Unites States for 2000 \n•\tDeveloped close trusting relationships with Endocrinologists and Internal Medicine doctors through education and caring about their patients’ well being, thus enabling the growth of strip shares in my territory.  \n•\tEducated Endocrinologist, Diabetes Specialist, and patients on promotion of blood sugar level testing and compliance.  \n•\tAssisted marketing on reviewing of patient materials and sales representatives tools \n•\tPromoted and participated in LifeScan’s Pharmacist continuing education program to increase diabetes knowledge in community and LifeScan market share in pharmacies \n•\tInternal Sales Trainer -- Trained Northern and Southern California sales representatives on LifeScan’s Customer Relations Management software Software QA Consensys 1995  –  1996  (1 year) Software QA Cohesive Networks 1988  –  1990  (2 years) Clinical Research Assistant Stanford University Medical Center August 2005  – Present (10 years 1 month) Pediatric Endocrinology •\tRecruiting, scheduling and preparation of patients for all clinical study visits for diabetes related medical devices for 1 + year Medtronic sponsored study \n•\tFacilitating Principal Investigator and Clinical Research Coordinator with study visits including: organization of materials prior to visit, training patients on medical devices, analyzing data and providing input, documentation, liaison between patients, doctors and clinical researchers. \n•\tExtensive work on Medtronic MiniMed 722 Insulin Pump system Clinical Research Assistant Stanford University Medical Center August 2005  – Present (10 years 1 month) Pediatric Endocrinology •\tRecruiting, scheduling and preparation of patients for all clinical study visits for diabetes related medical devices for 1 + year Medtronic sponsored study \n•\tFacilitating Principal Investigator and Clinical Research Coordinator with study visits including: organization of materials prior to visit, training patients on medical devices, analyzing data and providing input, documentation, liaison between patients, doctors and clinical researchers. \n•\tExtensive work on Medtronic MiniMed 722 Insulin Pump system Interior Designer and Owner Envision Interiors May 1998  – Present (17 years 4 months) Mountain View, California Interior Design for all aspects and phases of projects. From inception of home building to final accoutrements. Specializing in paint color selection, flooring, furniture procurement and placement and accessories. \n \n• Working with all aspects of residential interior design including space planning, material selection and wall color consultations as well as furniture locating, purchasing, selection and placement \n• Ability to work within client budgets and time lines  \n• Direct working relationship with builders, painters, wholesalers and trades people, enabling cost savings for clients \n• Review of architectural specifications prior to approval in order to create space efficiency and correct flow  \n \nPersonalized Fine Art. Interior Designer and Owner Envision Interiors May 1998  – Present (17 years 4 months) Mountain View, California Interior Design for all aspects and phases of projects. From inception of home building to final accoutrements. Specializing in paint color selection, flooring, furniture procurement and placement and accessories. \n \n• Working with all aspects of residential interior design including space planning, material selection and wall color consultations as well as furniture locating, purchasing, selection and placement \n• Ability to work within client budgets and time lines  \n• Direct working relationship with builders, painters, wholesalers and trades people, enabling cost savings for clients \n• Review of architectural specifications prior to approval in order to create space efficiency and correct flow  \n \nPersonalized Fine Art. Sales Medtronic MiniMed July 2001  –  August 2005  (4 years 2 months) •\tMet and exceeded insulin delivery pump quotas in 2001 by 116%. Top producer in United States for insulin pump sales -- Dec 2001 (156% to quota). Exceeded Continuous Glucose Monitoring System (CGMS) and CGMS blood sensor sales in 2002-2003 by 134% \n•\tMaintained and built on previous relationships with Endocrinologists to earn their trust in MiniMed products and to increase prescription recommendations for the insulin pump. Worked with physicians on developing diabetes resources to address patient needs and encourage diabetes self-management and better health outcomes. Created insulin pump programs in offices with no internal diabetes management infrastructure under specific budgetary constraints \n•\tMentored MiniMed nurses and local sales reps in increasing insulin pump and CGMS sales by focusing on patient education and continuum of care (follow-through) \n•\tLiaison between physicians and diabetes care teams to improve patient care and monitor continuum of care with pump therapy. Acting liaison between MiniMed Nurses and patients starting insulin pump therapy. \n•\tCoordinated, conducted and analyzed data from CGMS Clinics to explain to doctors and further promote sales of CGMS in Endocrinologists’ offices. Sales Medtronic MiniMed July 2001  –  August 2005  (4 years 2 months) •\tMet and exceeded insulin delivery pump quotas in 2001 by 116%. Top producer in United States for insulin pump sales -- Dec 2001 (156% to quota). Exceeded Continuous Glucose Monitoring System (CGMS) and CGMS blood sensor sales in 2002-2003 by 134% \n•\tMaintained and built on previous relationships with Endocrinologists to earn their trust in MiniMed products and to increase prescription recommendations for the insulin pump. Worked with physicians on developing diabetes resources to address patient needs and encourage diabetes self-management and better health outcomes. Created insulin pump programs in offices with no internal diabetes management infrastructure under specific budgetary constraints \n•\tMentored MiniMed nurses and local sales reps in increasing insulin pump and CGMS sales by focusing on patient education and continuum of care (follow-through) \n•\tLiaison between physicians and diabetes care teams to improve patient care and monitor continuum of care with pump therapy. Acting liaison between MiniMed Nurses and patients starting insulin pump therapy. \n•\tCoordinated, conducted and analyzed data from CGMS Clinics to explain to doctors and further promote sales of CGMS in Endocrinologists’ offices. Sales LifeScan 1999  –  2001  (2 years) Sales LifeScan 1999  –  2001  (2 years) Sales LifeScan 1999  –  2001  (2 years) •\tBuilt LifeScan strip market share to 60% in the Bay Area territory including increasing of new product market share by 3.2% in one year. Awarded second highest overall market share and third highest FastTake market share in the Unites States for 2000 \n•\tDeveloped close trusting relationships with Endocrinologists and Internal Medicine doctors through education and caring about their patients’ well being, thus enabling the growth of strip shares in my territory.  \n•\tEducated Endocrinologist, Diabetes Specialist, and patients on promotion of blood sugar level testing and compliance.  \n•\tAssisted marketing on reviewing of patient materials and sales representatives tools \n•\tPromoted and participated in LifeScan’s Pharmacist continuing education program to increase diabetes knowledge in community and LifeScan market share in pharmacies \n•\tInternal Sales Trainer -- Trained Northern and Southern California sales representatives on LifeScan’s Customer Relations Management software Sales LifeScan 1999  –  2001  (2 years) •\tBuilt LifeScan strip market share to 60% in the Bay Area territory including increasing of new product market share by 3.2% in one year. Awarded second highest overall market share and third highest FastTake market share in the Unites States for 2000 \n•\tDeveloped close trusting relationships with Endocrinologists and Internal Medicine doctors through education and caring about their patients’ well being, thus enabling the growth of strip shares in my territory.  \n•\tEducated Endocrinologist, Diabetes Specialist, and patients on promotion of blood sugar level testing and compliance.  \n•\tAssisted marketing on reviewing of patient materials and sales representatives tools \n•\tPromoted and participated in LifeScan’s Pharmacist continuing education program to increase diabetes knowledge in community and LifeScan market share in pharmacies \n•\tInternal Sales Trainer -- Trained Northern and Southern California sales representatives on LifeScan’s Customer Relations Management software Software QA Consensys 1995  –  1996  (1 year) Software QA Consensys 1995  –  1996  (1 year) Software QA Cohesive Networks 1988  –  1990  (2 years) Software QA Cohesive Networks 1988  –  1990  (2 years) Languages   Skills Color Consultant Interior Design Furniture Placement Furniture Rendering InDesign Small Business Space-planning Concept Development Renovation Interior Architecture Art Diabetes Budgets Concept Design CRM Floor Plans Medical Devices Design Thinking Sustainable Design Painting Marketing Design Research Program Management Web Design Sales Advertising Sketching User-centered Design Submittals Window Treatments Home Staging 3D rendering Experience Design FF&E Color Theory Custom Furniture Kitchen & Bath Design Green Building Textiles Furnishings Paint Bathrooms Residential Design Upholstery Contextual Inquiry Finish Draperies Drawing Fine Art See 35+     See less Skills  Color Consultant Interior Design Furniture Placement Furniture Rendering InDesign Small Business Space-planning Concept Development Renovation Interior Architecture Art Diabetes Budgets Concept Design CRM Floor Plans Medical Devices Design Thinking Sustainable Design Painting Marketing Design Research Program Management Web Design Sales Advertising Sketching User-centered Design Submittals Window Treatments Home Staging 3D rendering Experience Design FF&E Color Theory Custom Furniture Kitchen & Bath Design Green Building Textiles Furnishings Paint Bathrooms Residential Design Upholstery Contextual Inquiry Finish Draperies Drawing Fine Art See 35+     See less Color Consultant Interior Design Furniture Placement Furniture Rendering InDesign Small Business Space-planning Concept Development Renovation Interior Architecture Art Diabetes Budgets Concept Design CRM Floor Plans Medical Devices Design Thinking Sustainable Design Painting Marketing Design Research Program Management Web Design Sales Advertising Sketching User-centered Design Submittals Window Treatments Home Staging 3D rendering Experience Design FF&E Color Theory Custom Furniture Kitchen & Bath Design Green Building Textiles Furnishings Paint Bathrooms Residential Design Upholstery Contextual Inquiry Finish Draperies Drawing Fine Art See 35+     See less Color Consultant Interior Design Furniture Placement Furniture Rendering InDesign Small Business Space-planning Concept Development Renovation Interior Architecture Art Diabetes Budgets Concept Design CRM Floor Plans Medical Devices Design Thinking Sustainable Design Painting Marketing Design Research Program Management Web Design Sales Advertising Sketching User-centered Design Submittals Window Treatments Home Staging 3D rendering Experience Design FF&E Color Theory Custom Furniture Kitchen & Bath Design Green Building Textiles Furnishings Paint Bathrooms Residential Design Upholstery Contextual Inquiry Finish Draperies Drawing Fine Art See 35+     See less Honors & Awards ", "Summary “Why?” That is a question we all begin asking in the phase of development after we learn to speak and our curiosity, imagination, and creativity skyrocket. This is a question I never stopped asking.  \n \nInnately curious, I've chosen a career finding answers in clinical research. I have a unique appreciation for the subjective nature of research in CNS indications, the importance of bias-minimizing trial design, and the priorities of all stakeholders in clinical research. I specialize in sponsor-company leadership, Phase II-IV trial design and execution, and psychometrics.  \n \nMy Proudest Moments: \n- Stepping into a senior leadership role to bring an underpowered, under-resourced device study back on schedule, which produced statistically and clinically significant results. \n- Obtaining a positive vote from an FDA advisory committee, and ultimately drug-device approval, following months of rigorous project management, meeting preparation, and an NDA re-submission. \n- Receiving FDA approval of an orphan drug following nearly three years of a first-of-its-kind clinical trial. \n \nMy Style: \n- Collaboration is key: I am considerate, participative, and consultative. I don’t know everything, I don’t have all the answers, and I find that collaborating often leads to collective genius and connection within a team. \n- Teach a person to fish: I do not only lead by doing; I also lead by teaching. There is no greater reward than developing the strengths and autonomy of others. \n- Always a student: If there’s one thing I’ve learned, it’s that I must never stop learning. I value others' expertise, information sharing, and new ways of approaching problems and processes.  \n- No jargon: I use meaningful sentences free of convoluted syntax to communicate. I will never leverage your core competency to make hay by opening the kimono, shifting a paradigm, and scaling the tallest pole in the tent. Why? Because no one knows what that means. \n- Laugh: Everything is more fun with a good sense of humor! Summary “Why?” That is a question we all begin asking in the phase of development after we learn to speak and our curiosity, imagination, and creativity skyrocket. This is a question I never stopped asking.  \n \nInnately curious, I've chosen a career finding answers in clinical research. I have a unique appreciation for the subjective nature of research in CNS indications, the importance of bias-minimizing trial design, and the priorities of all stakeholders in clinical research. I specialize in sponsor-company leadership, Phase II-IV trial design and execution, and psychometrics.  \n \nMy Proudest Moments: \n- Stepping into a senior leadership role to bring an underpowered, under-resourced device study back on schedule, which produced statistically and clinically significant results. \n- Obtaining a positive vote from an FDA advisory committee, and ultimately drug-device approval, following months of rigorous project management, meeting preparation, and an NDA re-submission. \n- Receiving FDA approval of an orphan drug following nearly three years of a first-of-its-kind clinical trial. \n \nMy Style: \n- Collaboration is key: I am considerate, participative, and consultative. I don’t know everything, I don’t have all the answers, and I find that collaborating often leads to collective genius and connection within a team. \n- Teach a person to fish: I do not only lead by doing; I also lead by teaching. There is no greater reward than developing the strengths and autonomy of others. \n- Always a student: If there’s one thing I’ve learned, it’s that I must never stop learning. I value others' expertise, information sharing, and new ways of approaching problems and processes.  \n- No jargon: I use meaningful sentences free of convoluted syntax to communicate. I will never leverage your core competency to make hay by opening the kimono, shifting a paradigm, and scaling the tallest pole in the tent. Why? Because no one knows what that means. \n- Laugh: Everything is more fun with a good sense of humor! “Why?” That is a question we all begin asking in the phase of development after we learn to speak and our curiosity, imagination, and creativity skyrocket. This is a question I never stopped asking.  \n \nInnately curious, I've chosen a career finding answers in clinical research. I have a unique appreciation for the subjective nature of research in CNS indications, the importance of bias-minimizing trial design, and the priorities of all stakeholders in clinical research. I specialize in sponsor-company leadership, Phase II-IV trial design and execution, and psychometrics.  \n \nMy Proudest Moments: \n- Stepping into a senior leadership role to bring an underpowered, under-resourced device study back on schedule, which produced statistically and clinically significant results. \n- Obtaining a positive vote from an FDA advisory committee, and ultimately drug-device approval, following months of rigorous project management, meeting preparation, and an NDA re-submission. \n- Receiving FDA approval of an orphan drug following nearly three years of a first-of-its-kind clinical trial. \n \nMy Style: \n- Collaboration is key: I am considerate, participative, and consultative. I don’t know everything, I don’t have all the answers, and I find that collaborating often leads to collective genius and connection within a team. \n- Teach a person to fish: I do not only lead by doing; I also lead by teaching. There is no greater reward than developing the strengths and autonomy of others. \n- Always a student: If there’s one thing I’ve learned, it’s that I must never stop learning. I value others' expertise, information sharing, and new ways of approaching problems and processes.  \n- No jargon: I use meaningful sentences free of convoluted syntax to communicate. I will never leverage your core competency to make hay by opening the kimono, shifting a paradigm, and scaling the tallest pole in the tent. Why? Because no one knows what that means. \n- Laugh: Everything is more fun with a good sense of humor! “Why?” That is a question we all begin asking in the phase of development after we learn to speak and our curiosity, imagination, and creativity skyrocket. This is a question I never stopped asking.  \n \nInnately curious, I've chosen a career finding answers in clinical research. I have a unique appreciation for the subjective nature of research in CNS indications, the importance of bias-minimizing trial design, and the priorities of all stakeholders in clinical research. I specialize in sponsor-company leadership, Phase II-IV trial design and execution, and psychometrics.  \n \nMy Proudest Moments: \n- Stepping into a senior leadership role to bring an underpowered, under-resourced device study back on schedule, which produced statistically and clinically significant results. \n- Obtaining a positive vote from an FDA advisory committee, and ultimately drug-device approval, following months of rigorous project management, meeting preparation, and an NDA re-submission. \n- Receiving FDA approval of an orphan drug following nearly three years of a first-of-its-kind clinical trial. \n \nMy Style: \n- Collaboration is key: I am considerate, participative, and consultative. I don’t know everything, I don’t have all the answers, and I find that collaborating often leads to collective genius and connection within a team. \n- Teach a person to fish: I do not only lead by doing; I also lead by teaching. There is no greater reward than developing the strengths and autonomy of others. \n- Always a student: If there’s one thing I’ve learned, it’s that I must never stop learning. I value others' expertise, information sharing, and new ways of approaching problems and processes.  \n- No jargon: I use meaningful sentences free of convoluted syntax to communicate. I will never leverage your core competency to make hay by opening the kimono, shifting a paradigm, and scaling the tallest pole in the tent. Why? Because no one knows what that means. \n- Laugh: Everything is more fun with a good sense of humor! Experience Director, Clinical Operations Semnur Pharmaceuticals, Inc. May 2015  – Present (4 months) San Francisco Bay Area Director, Clinical Operations BrainStorm Cell Therapeutics April 2015  – Present (5 months) Greater New York City Area - Developed a Phase 2, ex-US, multi-dose clinical trial protocol and managed initial study start-up activities, in which three NurOwn® doses from a single bone marrow aspiration are provided to patients with ALS Director, Clinical Programs Cervel Neurotech March 2012  – Present (3 years 6 months) San Francisco Bay Area - Provided clinical trial leadership for pilot, feasibility, and pivotal device trials for the treatment of major depression (this included a pre-IDE meeting, protocol design, site selection, vendor selection, recruitment, monitoring, data management, statistics, and reporting)  \n- Developed study manuals, source documents, eCRFs, training materials, and recruitment materials  \n- Oversaw standardized TMF structure development and the company’s migration to new TMF filing system \n- Contributed to SOP development and revisions \n- Managed study vendors and a Clinical team of eight employees and contractors  \n- Educated potential investors on clinical trial data and served as a subject matter expert during Series D funding round Manager, Clinical Development InterMune October 2012  –  September 2014  (2 years) San Francisco Bay Area - Served as a project manager and executive administrator for four physicians in the Clinical Science Department  \n- Lead site recruitment efforts for a Clinical Operations team during rapid study start-up \n- Provided medical writing support to a Medical Writer Medical Writer Auspex Pharmaceuticals, Inc. January 2013  –  January 2014  (1 year 1 month) Greater San Diego Area - Provided protocol development support to the company’s CMO for Huntington Disease and Tourette Syndrome drug trials Manager, Clinical Operations Alexza Pharmaceuticals September 2010  –  February 2012  (1 year 6 months) San Francisco Bay Area - Contributed to clinical sections and completed extensive eQC of a New Drug Application resubmission and a Marketing Authorization Application submission for a drug-device combination product for the treatment of agitation in patients with schizophrenia and bipolar disorder; NDA approved by FDA in December 2012 \n- Served as the project manager for FDA Advisory Committee meeting readiness activities and participated as a sponsor representative at the official meeting resulting in a favorable vote \n- Conducted extensive reviews of clinical trial datasets, tables and listings, performed ad-hoc data analyses, and completed quality control activities related to Alexza’s reply to an FDA Complete Response Letter (CRL) \n- Supported the organization and timely submission of the company’s CRL response to the FDA \n- Coordinated the submission of Alexza’s Small-Medium Enterprise and Name Review Group applications to the European Medicines Agency \n- Managed BIMO inspection readiness activities, which included developing and implementing a standardized clinical document filing system and auditing a complete library of trial master files (22 studies total) \n- Maintained trial master files in accordance with FDA and ICH guidelines  \n- Supported the completion of clinical study reports by e-processing and QCing required documents  \n- Assisted Director of Clinical Operations with clinical trial planning including project timelines, budget, resource management and vendor selection \n- Contributed to SOP development and revisions \n- Successfully managed virtual relationship with supervisor, the Director of Clinical Operations (an out-of-state employee of Alexza), and worked well independently Clinical Trials Associate & Rater Trainer Corcept Therapeutics April 2004  –  August 2010  (6 years 5 months) San Francisco Bay Area - Contributed to writing protocols and managing multiple clinical trials of an investigational drug for psychotic depression and Cushing’s disease; orphan drug NDA for Cushing’s disease approved by FDA in February 2012 \n- Identified and assisted with the selection of over 60 investigative sites for Phase III trials \n- Performed site qualification visits and assisted with initiation and interim visits  \n- Prepared informed consent form templates, and other clinical trial related documents \n- Developed clinical document filing system and maintained trial master files in hard-copy and soft-copy \n- Tracked investigative site regulatory documents and contact information \n- Compiled and reviewed regulatory document packages, and initiated shipments of investigational drug and other clinical trial related supplies \n- Corresponded weekly with field CRAs to request site updates, monitoring reports, and required documents \n- Maintained clinical project timelines and projections, status reports, and clinical program updates \n- Designed and managed advertising campaigns to boost study enrollment and meet project timelines \n- Authored and designed study newsletters \n- Assisted Director of Operations & Medical Director with the management of central laboratories, CROs, and EDC providers \n- Assisted with vendor audits  \n- Assisted with site and vendor contract negotiations and payments \n- Contributed to and coordinated the development of Corcept’s Clinical Operations Guidelines \n- Reviewed study data, administered data query process, and resolved data discrepancies \n- Assisted in ongoing data review (tables and listings), ad-hoc analyses, TLG production, and annual updates \n- Created source document templates, CRFs, and CRF completion guidelines \n- Developed rater education and certification curriculum and trained raters to administer psychiatric rating scales for two early Phase III clinical trials.  \n- Selected and managed rater training and rating scale administration vendor for a Phase III trial Clinical Research Coordinator Stanford University February 2001  –  April 2004  (3 years 3 months) Depression Research Clinic & Schizophrenia Research Clinic - Coordinated over 20 observational, drug and device studies in the following CNS indications: major depression, schizophrenia, psychotic depression, and bipolar disorder \n- Performed activities including regulatory document collection, IRB and General Clinical Research Center submissions, creation and tracking of study budgets, contract negotiations, source document development and completion, CRF/eCRF completion, informed consent creation, patient advertising and recruitment, scheduling and assessments, drug accountability and dispensing of medication \n- Certified in over 15 psychiatric rating scales and conducted structured clinical interviews, diagnostic and neurocognitive testing, and psychoeducation for patients and families \n- Reported study information to principal investigator, study sponsors and CROs via reports and routine teleconferences \n- Wrote grant proposals and managed awarded monies \n- Supervised recruitment coordinator and volunteer research intern Volunteer Clinical Research Assistant Stanford University August 2000  –  February 2001  (7 months) Department of Psychology - Contributed to Unnur Gylfadottir, Ph.D.’s doctorate thesis, Dyadic eating-feeding relationships between first-time mothers and their infants: A longitudinal mixed methods study (2005 May), by rating mother-infant dyad interactions using the Chatoor’s Mother-Infant/Toddler Feeding Scale. \n- Transcribed and interpreted voice data for the Zenzie M. Griffin, Ph.D. Linguistics Laboratory resulting in the following publication: Gaze durations during speech reflect word selection and phonological encoding. Cognition. 2001 Nov; 82(1):B1-14. PMID: 11672707 Student Administrative Assistant University of Arizona Cancer Center August 1999  –  September 2000  (1 year 2 months) Department of Gynecological Oncology - Provided administrative support to the office of Dr. Kenneth D. Hatch Director, Clinical Operations Semnur Pharmaceuticals, Inc. May 2015  – Present (4 months) San Francisco Bay Area Director, Clinical Operations Semnur Pharmaceuticals, Inc. May 2015  – Present (4 months) San Francisco Bay Area Director, Clinical Operations BrainStorm Cell Therapeutics April 2015  – Present (5 months) Greater New York City Area - Developed a Phase 2, ex-US, multi-dose clinical trial protocol and managed initial study start-up activities, in which three NurOwn® doses from a single bone marrow aspiration are provided to patients with ALS Director, Clinical Operations BrainStorm Cell Therapeutics April 2015  – Present (5 months) Greater New York City Area - Developed a Phase 2, ex-US, multi-dose clinical trial protocol and managed initial study start-up activities, in which three NurOwn® doses from a single bone marrow aspiration are provided to patients with ALS Director, Clinical Programs Cervel Neurotech March 2012  – Present (3 years 6 months) San Francisco Bay Area - Provided clinical trial leadership for pilot, feasibility, and pivotal device trials for the treatment of major depression (this included a pre-IDE meeting, protocol design, site selection, vendor selection, recruitment, monitoring, data management, statistics, and reporting)  \n- Developed study manuals, source documents, eCRFs, training materials, and recruitment materials  \n- Oversaw standardized TMF structure development and the company’s migration to new TMF filing system \n- Contributed to SOP development and revisions \n- Managed study vendors and a Clinical team of eight employees and contractors  \n- Educated potential investors on clinical trial data and served as a subject matter expert during Series D funding round Director, Clinical Programs Cervel Neurotech March 2012  – Present (3 years 6 months) San Francisco Bay Area - Provided clinical trial leadership for pilot, feasibility, and pivotal device trials for the treatment of major depression (this included a pre-IDE meeting, protocol design, site selection, vendor selection, recruitment, monitoring, data management, statistics, and reporting)  \n- Developed study manuals, source documents, eCRFs, training materials, and recruitment materials  \n- Oversaw standardized TMF structure development and the company’s migration to new TMF filing system \n- Contributed to SOP development and revisions \n- Managed study vendors and a Clinical team of eight employees and contractors  \n- Educated potential investors on clinical trial data and served as a subject matter expert during Series D funding round Manager, Clinical Development InterMune October 2012  –  September 2014  (2 years) San Francisco Bay Area - Served as a project manager and executive administrator for four physicians in the Clinical Science Department  \n- Lead site recruitment efforts for a Clinical Operations team during rapid study start-up \n- Provided medical writing support to a Medical Writer Manager, Clinical Development InterMune October 2012  –  September 2014  (2 years) San Francisco Bay Area - Served as a project manager and executive administrator for four physicians in the Clinical Science Department  \n- Lead site recruitment efforts for a Clinical Operations team during rapid study start-up \n- Provided medical writing support to a Medical Writer Medical Writer Auspex Pharmaceuticals, Inc. January 2013  –  January 2014  (1 year 1 month) Greater San Diego Area - Provided protocol development support to the company’s CMO for Huntington Disease and Tourette Syndrome drug trials Medical Writer Auspex Pharmaceuticals, Inc. January 2013  –  January 2014  (1 year 1 month) Greater San Diego Area - Provided protocol development support to the company’s CMO for Huntington Disease and Tourette Syndrome drug trials Manager, Clinical Operations Alexza Pharmaceuticals September 2010  –  February 2012  (1 year 6 months) San Francisco Bay Area - Contributed to clinical sections and completed extensive eQC of a New Drug Application resubmission and a Marketing Authorization Application submission for a drug-device combination product for the treatment of agitation in patients with schizophrenia and bipolar disorder; NDA approved by FDA in December 2012 \n- Served as the project manager for FDA Advisory Committee meeting readiness activities and participated as a sponsor representative at the official meeting resulting in a favorable vote \n- Conducted extensive reviews of clinical trial datasets, tables and listings, performed ad-hoc data analyses, and completed quality control activities related to Alexza’s reply to an FDA Complete Response Letter (CRL) \n- Supported the organization and timely submission of the company’s CRL response to the FDA \n- Coordinated the submission of Alexza’s Small-Medium Enterprise and Name Review Group applications to the European Medicines Agency \n- Managed BIMO inspection readiness activities, which included developing and implementing a standardized clinical document filing system and auditing a complete library of trial master files (22 studies total) \n- Maintained trial master files in accordance with FDA and ICH guidelines  \n- Supported the completion of clinical study reports by e-processing and QCing required documents  \n- Assisted Director of Clinical Operations with clinical trial planning including project timelines, budget, resource management and vendor selection \n- Contributed to SOP development and revisions \n- Successfully managed virtual relationship with supervisor, the Director of Clinical Operations (an out-of-state employee of Alexza), and worked well independently Manager, Clinical Operations Alexza Pharmaceuticals September 2010  –  February 2012  (1 year 6 months) San Francisco Bay Area - Contributed to clinical sections and completed extensive eQC of a New Drug Application resubmission and a Marketing Authorization Application submission for a drug-device combination product for the treatment of agitation in patients with schizophrenia and bipolar disorder; NDA approved by FDA in December 2012 \n- Served as the project manager for FDA Advisory Committee meeting readiness activities and participated as a sponsor representative at the official meeting resulting in a favorable vote \n- Conducted extensive reviews of clinical trial datasets, tables and listings, performed ad-hoc data analyses, and completed quality control activities related to Alexza’s reply to an FDA Complete Response Letter (CRL) \n- Supported the organization and timely submission of the company’s CRL response to the FDA \n- Coordinated the submission of Alexza’s Small-Medium Enterprise and Name Review Group applications to the European Medicines Agency \n- Managed BIMO inspection readiness activities, which included developing and implementing a standardized clinical document filing system and auditing a complete library of trial master files (22 studies total) \n- Maintained trial master files in accordance with FDA and ICH guidelines  \n- Supported the completion of clinical study reports by e-processing and QCing required documents  \n- Assisted Director of Clinical Operations with clinical trial planning including project timelines, budget, resource management and vendor selection \n- Contributed to SOP development and revisions \n- Successfully managed virtual relationship with supervisor, the Director of Clinical Operations (an out-of-state employee of Alexza), and worked well independently Clinical Trials Associate & Rater Trainer Corcept Therapeutics April 2004  –  August 2010  (6 years 5 months) San Francisco Bay Area - Contributed to writing protocols and managing multiple clinical trials of an investigational drug for psychotic depression and Cushing’s disease; orphan drug NDA for Cushing’s disease approved by FDA in February 2012 \n- Identified and assisted with the selection of over 60 investigative sites for Phase III trials \n- Performed site qualification visits and assisted with initiation and interim visits  \n- Prepared informed consent form templates, and other clinical trial related documents \n- Developed clinical document filing system and maintained trial master files in hard-copy and soft-copy \n- Tracked investigative site regulatory documents and contact information \n- Compiled and reviewed regulatory document packages, and initiated shipments of investigational drug and other clinical trial related supplies \n- Corresponded weekly with field CRAs to request site updates, monitoring reports, and required documents \n- Maintained clinical project timelines and projections, status reports, and clinical program updates \n- Designed and managed advertising campaigns to boost study enrollment and meet project timelines \n- Authored and designed study newsletters \n- Assisted Director of Operations & Medical Director with the management of central laboratories, CROs, and EDC providers \n- Assisted with vendor audits  \n- Assisted with site and vendor contract negotiations and payments \n- Contributed to and coordinated the development of Corcept’s Clinical Operations Guidelines \n- Reviewed study data, administered data query process, and resolved data discrepancies \n- Assisted in ongoing data review (tables and listings), ad-hoc analyses, TLG production, and annual updates \n- Created source document templates, CRFs, and CRF completion guidelines \n- Developed rater education and certification curriculum and trained raters to administer psychiatric rating scales for two early Phase III clinical trials.  \n- Selected and managed rater training and rating scale administration vendor for a Phase III trial Clinical Trials Associate & Rater Trainer Corcept Therapeutics April 2004  –  August 2010  (6 years 5 months) San Francisco Bay Area - Contributed to writing protocols and managing multiple clinical trials of an investigational drug for psychotic depression and Cushing’s disease; orphan drug NDA for Cushing’s disease approved by FDA in February 2012 \n- Identified and assisted with the selection of over 60 investigative sites for Phase III trials \n- Performed site qualification visits and assisted with initiation and interim visits  \n- Prepared informed consent form templates, and other clinical trial related documents \n- Developed clinical document filing system and maintained trial master files in hard-copy and soft-copy \n- Tracked investigative site regulatory documents and contact information \n- Compiled and reviewed regulatory document packages, and initiated shipments of investigational drug and other clinical trial related supplies \n- Corresponded weekly with field CRAs to request site updates, monitoring reports, and required documents \n- Maintained clinical project timelines and projections, status reports, and clinical program updates \n- Designed and managed advertising campaigns to boost study enrollment and meet project timelines \n- Authored and designed study newsletters \n- Assisted Director of Operations & Medical Director with the management of central laboratories, CROs, and EDC providers \n- Assisted with vendor audits  \n- Assisted with site and vendor contract negotiations and payments \n- Contributed to and coordinated the development of Corcept’s Clinical Operations Guidelines \n- Reviewed study data, administered data query process, and resolved data discrepancies \n- Assisted in ongoing data review (tables and listings), ad-hoc analyses, TLG production, and annual updates \n- Created source document templates, CRFs, and CRF completion guidelines \n- Developed rater education and certification curriculum and trained raters to administer psychiatric rating scales for two early Phase III clinical trials.  \n- Selected and managed rater training and rating scale administration vendor for a Phase III trial Clinical Research Coordinator Stanford University February 2001  –  April 2004  (3 years 3 months) Depression Research Clinic & Schizophrenia Research Clinic - Coordinated over 20 observational, drug and device studies in the following CNS indications: major depression, schizophrenia, psychotic depression, and bipolar disorder \n- Performed activities including regulatory document collection, IRB and General Clinical Research Center submissions, creation and tracking of study budgets, contract negotiations, source document development and completion, CRF/eCRF completion, informed consent creation, patient advertising and recruitment, scheduling and assessments, drug accountability and dispensing of medication \n- Certified in over 15 psychiatric rating scales and conducted structured clinical interviews, diagnostic and neurocognitive testing, and psychoeducation for patients and families \n- Reported study information to principal investigator, study sponsors and CROs via reports and routine teleconferences \n- Wrote grant proposals and managed awarded monies \n- Supervised recruitment coordinator and volunteer research intern Clinical Research Coordinator Stanford University February 2001  –  April 2004  (3 years 3 months) Depression Research Clinic & Schizophrenia Research Clinic - Coordinated over 20 observational, drug and device studies in the following CNS indications: major depression, schizophrenia, psychotic depression, and bipolar disorder \n- Performed activities including regulatory document collection, IRB and General Clinical Research Center submissions, creation and tracking of study budgets, contract negotiations, source document development and completion, CRF/eCRF completion, informed consent creation, patient advertising and recruitment, scheduling and assessments, drug accountability and dispensing of medication \n- Certified in over 15 psychiatric rating scales and conducted structured clinical interviews, diagnostic and neurocognitive testing, and psychoeducation for patients and families \n- Reported study information to principal investigator, study sponsors and CROs via reports and routine teleconferences \n- Wrote grant proposals and managed awarded monies \n- Supervised recruitment coordinator and volunteer research intern Volunteer Clinical Research Assistant Stanford University August 2000  –  February 2001  (7 months) Department of Psychology - Contributed to Unnur Gylfadottir, Ph.D.’s doctorate thesis, Dyadic eating-feeding relationships between first-time mothers and their infants: A longitudinal mixed methods study (2005 May), by rating mother-infant dyad interactions using the Chatoor’s Mother-Infant/Toddler Feeding Scale. \n- Transcribed and interpreted voice data for the Zenzie M. Griffin, Ph.D. Linguistics Laboratory resulting in the following publication: Gaze durations during speech reflect word selection and phonological encoding. Cognition. 2001 Nov; 82(1):B1-14. PMID: 11672707 Volunteer Clinical Research Assistant Stanford University August 2000  –  February 2001  (7 months) Department of Psychology - Contributed to Unnur Gylfadottir, Ph.D.’s doctorate thesis, Dyadic eating-feeding relationships between first-time mothers and their infants: A longitudinal mixed methods study (2005 May), by rating mother-infant dyad interactions using the Chatoor’s Mother-Infant/Toddler Feeding Scale. \n- Transcribed and interpreted voice data for the Zenzie M. Griffin, Ph.D. Linguistics Laboratory resulting in the following publication: Gaze durations during speech reflect word selection and phonological encoding. Cognition. 2001 Nov; 82(1):B1-14. PMID: 11672707 Student Administrative Assistant University of Arizona Cancer Center August 1999  –  September 2000  (1 year 2 months) Department of Gynecological Oncology - Provided administrative support to the office of Dr. Kenneth D. Hatch Student Administrative Assistant University of Arizona Cancer Center August 1999  –  September 2000  (1 year 2 months) Department of Gynecological Oncology - Provided administrative support to the office of Dr. Kenneth D. Hatch Skills Clinical Trials Clinical Development Clinical Research FDA Drug Development Clinical Operations Protocol Medical Devices Clinical Study Design GCP Pharmaceutical Industry CNS disorders Psychiatry Microsoft Office Clinical Monitoring Protocol Development EDC Medical Writing Patient Recruitment ICH guidelines Vendor Management Adobe Acrobat Regulatory Affairs Clinical Data Management Psychopharmacology 21 CFR Part 11 Trial Master Files Psychometrics FDA Advisory Committee... Site Management Mental Health Treatment Transcranial Magnetic... Operational Efficiency CRO Data Analysis Biostatistics CSRs Team Leadership Strategic Planning Operational Planning Project Management Quality Assurance Executive Level... Executive Leadership C-Level Relationships Professional Mentoring Orphan Drugs Biotechnology ALS See 34+     See less Skills  Clinical Trials Clinical Development Clinical Research FDA Drug Development Clinical Operations Protocol Medical Devices Clinical Study Design GCP Pharmaceutical Industry CNS disorders Psychiatry Microsoft Office Clinical Monitoring Protocol Development EDC Medical Writing Patient Recruitment ICH guidelines Vendor Management Adobe Acrobat Regulatory Affairs Clinical Data Management Psychopharmacology 21 CFR Part 11 Trial Master Files Psychometrics FDA Advisory Committee... Site Management Mental Health Treatment Transcranial Magnetic... Operational Efficiency CRO Data Analysis Biostatistics CSRs Team Leadership Strategic Planning Operational Planning Project Management Quality Assurance Executive Level... Executive Leadership C-Level Relationships Professional Mentoring Orphan Drugs Biotechnology ALS See 34+     See less Clinical Trials Clinical Development Clinical Research FDA Drug Development Clinical Operations Protocol Medical Devices Clinical Study Design GCP Pharmaceutical Industry CNS disorders Psychiatry Microsoft Office Clinical Monitoring Protocol Development EDC Medical Writing Patient Recruitment ICH guidelines Vendor Management Adobe Acrobat Regulatory Affairs Clinical Data Management Psychopharmacology 21 CFR Part 11 Trial Master Files Psychometrics FDA Advisory Committee... Site Management Mental Health Treatment Transcranial Magnetic... Operational Efficiency CRO Data Analysis Biostatistics CSRs Team Leadership Strategic Planning Operational Planning Project Management Quality Assurance Executive Level... Executive Leadership C-Level Relationships Professional Mentoring Orphan Drugs Biotechnology ALS See 34+     See less Clinical Trials Clinical Development Clinical Research FDA Drug Development Clinical Operations Protocol Medical Devices Clinical Study Design GCP Pharmaceutical Industry CNS disorders Psychiatry Microsoft Office Clinical Monitoring Protocol Development EDC Medical Writing Patient Recruitment ICH guidelines Vendor Management Adobe Acrobat Regulatory Affairs Clinical Data Management Psychopharmacology 21 CFR Part 11 Trial Master Files Psychometrics FDA Advisory Committee... Site Management Mental Health Treatment Transcranial Magnetic... Operational Efficiency CRO Data Analysis Biostatistics CSRs Team Leadership Strategic Planning Operational Planning Project Management Quality Assurance Executive Level... Executive Leadership C-Level Relationships Professional Mentoring Orphan Drugs Biotechnology ALS See 34+     See less Education Drexel University College of Medicine Master's Degree,  Clinical Research Organization and Management 2013  – 2016 Courses Completed: \n- Introduction to Clinical Trials \n- Designing the Clinical Trial \n- Pharmaceutical Law \n- Current Trends in Medical Device Regulation \n- Application of Clinical Research Biostatistics \n- Special Topics in Clinical Research \n- Leadership Skills \n- Biotechnology University of California, Santa Cruz Post-graduate Certificate,  Clinical Trials Design & Management 2004  – 2008 Courses Completed: \n- Clinical Statistics for Non-Statisticians  \n- Clinical Trials Site Monitoring I  \n- Drug Development Process  \n- Good Clinical Practices  \n- Medical Devices: Regulatory Strategies and Marketing Pathways  \n- Science of Clinical Trials Design Clinical Data Management \n- Contracting with Contract Research Organizations \n- Preparing for FDA Inspections and Conducting Sponsor Audits \n- Personalized Medicine: Scientific, Regulatory and Business Dimensions University of Arizona Bachelor of Science (BS),  Biology with minors in Chemistry ,  Physics ,  Math and Psychology 1997  – 2000 Activities and Societies:  Key Honors Society ,  Phi Eta Sigma Honors Society ,  Alpha Epsilon Delta Pre-Medical Honors Society Drexel University College of Medicine Master's Degree,  Clinical Research Organization and Management 2013  – 2016 Courses Completed: \n- Introduction to Clinical Trials \n- Designing the Clinical Trial \n- Pharmaceutical Law \n- Current Trends in Medical Device Regulation \n- Application of Clinical Research Biostatistics \n- Special Topics in Clinical Research \n- Leadership Skills \n- Biotechnology Drexel University College of Medicine Master's Degree,  Clinical Research Organization and Management 2013  – 2016 Courses Completed: \n- Introduction to Clinical Trials \n- Designing the Clinical Trial \n- Pharmaceutical Law \n- Current Trends in Medical Device Regulation \n- Application of Clinical Research Biostatistics \n- Special Topics in Clinical Research \n- Leadership Skills \n- Biotechnology Drexel University College of Medicine Master's Degree,  Clinical Research Organization and Management 2013  – 2016 Courses Completed: \n- Introduction to Clinical Trials \n- Designing the Clinical Trial \n- Pharmaceutical Law \n- Current Trends in Medical Device Regulation \n- Application of Clinical Research Biostatistics \n- Special Topics in Clinical Research \n- Leadership Skills \n- Biotechnology University of California, Santa Cruz Post-graduate Certificate,  Clinical Trials Design & Management 2004  – 2008 Courses Completed: \n- Clinical Statistics for Non-Statisticians  \n- Clinical Trials Site Monitoring I  \n- Drug Development Process  \n- Good Clinical Practices  \n- Medical Devices: Regulatory Strategies and Marketing Pathways  \n- Science of Clinical Trials Design Clinical Data Management \n- Contracting with Contract Research Organizations \n- Preparing for FDA Inspections and Conducting Sponsor Audits \n- Personalized Medicine: Scientific, Regulatory and Business Dimensions University of California, Santa Cruz Post-graduate Certificate,  Clinical Trials Design & Management 2004  – 2008 Courses Completed: \n- Clinical Statistics for Non-Statisticians  \n- Clinical Trials Site Monitoring I  \n- Drug Development Process  \n- Good Clinical Practices  \n- Medical Devices: Regulatory Strategies and Marketing Pathways  \n- Science of Clinical Trials Design Clinical Data Management \n- Contracting with Contract Research Organizations \n- Preparing for FDA Inspections and Conducting Sponsor Audits \n- Personalized Medicine: Scientific, Regulatory and Business Dimensions University of California, Santa Cruz Post-graduate Certificate,  Clinical Trials Design & Management 2004  – 2008 Courses Completed: \n- Clinical Statistics for Non-Statisticians  \n- Clinical Trials Site Monitoring I  \n- Drug Development Process  \n- Good Clinical Practices  \n- Medical Devices: Regulatory Strategies and Marketing Pathways  \n- Science of Clinical Trials Design Clinical Data Management \n- Contracting with Contract Research Organizations \n- Preparing for FDA Inspections and Conducting Sponsor Audits \n- Personalized Medicine: Scientific, Regulatory and Business Dimensions University of Arizona Bachelor of Science (BS),  Biology with minors in Chemistry ,  Physics ,  Math and Psychology 1997  – 2000 Activities and Societies:  Key Honors Society ,  Phi Eta Sigma Honors Society ,  Alpha Epsilon Delta Pre-Medical Honors Society University of Arizona Bachelor of Science (BS),  Biology with minors in Chemistry ,  Physics ,  Math and Psychology 1997  – 2000 Activities and Societies:  Key Honors Society ,  Phi Eta Sigma Honors Society ,  Alpha Epsilon Delta Pre-Medical Honors Society University of Arizona Bachelor of Science (BS),  Biology with minors in Chemistry ,  Physics ,  Math and Psychology 1997  – 2000 Activities and Societies:  Key Honors Society ,  Phi Eta Sigma Honors Society ,  Alpha Epsilon Delta Pre-Medical Honors Society Honors & Awards Excellence in Upper-Division Writing Proficiency University of Arizona 2000 Granted to <5% of graduating students. Excellence in Upper-Division Writing Proficiency University of Arizona 2000 Granted to <5% of graduating students. Excellence in Upper-Division Writing Proficiency University of Arizona 2000 Granted to <5% of graduating students. Excellence in Upper-Division Writing Proficiency University of Arizona 2000 Granted to <5% of graduating students. ", "Experience Clinical Research Assistant Stanford University School of Medicine July 2014  – Present (1 year 2 months) Research Assistant Social Neuroscience Lab September 2011  –  June 2013  (1 year 10 months) Dartmouth College Research Assistant Social Cognitive Neuroscience Lab July 2012  –  September 2012  (3 months) Columbia University Research Assistant Consciousness and Computation Lab July 2012  –  September 2012  (3 months) Columbia University Forensic Psychology Intern The New York Center for Neuropsychology & Forensic Behavioral Science January 2012  –  March 2012  (3 months) Brooklyn Heights, NY Clinical Research Assistant Stanford University School of Medicine July 2014  – Present (1 year 2 months) Clinical Research Assistant Stanford University School of Medicine July 2014  – Present (1 year 2 months) Research Assistant Social Neuroscience Lab September 2011  –  June 2013  (1 year 10 months) Dartmouth College Research Assistant Social Neuroscience Lab September 2011  –  June 2013  (1 year 10 months) Dartmouth College Research Assistant Social Cognitive Neuroscience Lab July 2012  –  September 2012  (3 months) Columbia University Research Assistant Social Cognitive Neuroscience Lab July 2012  –  September 2012  (3 months) Columbia University Research Assistant Consciousness and Computation Lab July 2012  –  September 2012  (3 months) Columbia University Research Assistant Consciousness and Computation Lab July 2012  –  September 2012  (3 months) Columbia University Forensic Psychology Intern The New York Center for Neuropsychology & Forensic Behavioral Science January 2012  –  March 2012  (3 months) Brooklyn Heights, NY Forensic Psychology Intern The New York Center for Neuropsychology & Forensic Behavioral Science January 2012  –  March 2012  (3 months) Brooklyn Heights, NY Skills Skills     Education Dartmouth College Bachelor of Arts,  Psychology 2009  – 2013 William A. Shine Great Neck South High School 2005  – 2009 Dartmouth College Bachelor of Arts,  Psychology 2009  – 2013 Dartmouth College Bachelor of Arts,  Psychology 2009  – 2013 Dartmouth College Bachelor of Arts,  Psychology 2009  – 2013 William A. Shine Great Neck South High School 2005  – 2009 William A. Shine Great Neck South High School 2005  – 2009 William A. Shine Great Neck South High School 2005  – 2009 ", "Languages Dutch Dutch Dutch Skills Clinical Research Ophthalmology GCP Oncology IND Clinical Trials Cardiovascular Disease Phase 1 FDA Infectious Diseases Regulatory Affairs Protocol Regulatory Submissions Sop Clinical Development SOP Pharmaceutical Industry Biotechnology See 3+     See less Skills  Clinical Research Ophthalmology GCP Oncology IND Clinical Trials Cardiovascular Disease Phase 1 FDA Infectious Diseases Regulatory Affairs Protocol Regulatory Submissions Sop Clinical Development SOP Pharmaceutical Industry Biotechnology See 3+     See less Clinical Research Ophthalmology GCP Oncology IND Clinical Trials Cardiovascular Disease Phase 1 FDA Infectious Diseases Regulatory Affairs Protocol Regulatory Submissions Sop Clinical Development SOP Pharmaceutical Industry Biotechnology See 3+     See less Clinical Research Ophthalmology GCP Oncology IND Clinical Trials Cardiovascular Disease Phase 1 FDA Infectious Diseases Regulatory Affairs Protocol Regulatory Submissions Sop Clinical Development SOP Pharmaceutical Industry Biotechnology See 3+     See less ", "Summary I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n Summary I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n Experience Clinical Research Coordinator Stanford University School of Medicine January 2015  –  June 2015  (6 months) Stanford University School of Medicine Division of Blood and Marrow Transplantation  \n Clinical Research Coordinator Stanford University School of Medicine 2010  –  January 2015  (5 years) Division of Immunology and Rheumatology Clinical Research Assistant Stanford University School of Medicine 2007  –  2010  (3 years) Division of Health Research and Policy Clinical Research Associate Deapartment of Veterans Affair June 2007  –  August 2007  (3 months) Realtor Prudential Ca Realty October 1998  –  June 2007  (8 years 9 months) Instructor San Mateo Community College District 1996  –  1996  (less than a year) Instructor (Adjunct Faculty) Los Angeles Harbor College 1994  –  1994  (less than a year) Clinical Research Coordinator Stanford University School of Medicine January 2015  –  June 2015  (6 months) Stanford University School of Medicine Division of Blood and Marrow Transplantation  \n Clinical Research Coordinator Stanford University School of Medicine January 2015  –  June 2015  (6 months) Stanford University School of Medicine Division of Blood and Marrow Transplantation  \n Clinical Research Coordinator Stanford University School of Medicine 2010  –  January 2015  (5 years) Division of Immunology and Rheumatology Clinical Research Coordinator Stanford University School of Medicine 2010  –  January 2015  (5 years) Division of Immunology and Rheumatology Clinical Research Assistant Stanford University School of Medicine 2007  –  2010  (3 years) Division of Health Research and Policy Clinical Research Assistant Stanford University School of Medicine 2007  –  2010  (3 years) Division of Health Research and Policy Clinical Research Associate Deapartment of Veterans Affair June 2007  –  August 2007  (3 months) Clinical Research Associate Deapartment of Veterans Affair June 2007  –  August 2007  (3 months) Realtor Prudential Ca Realty October 1998  –  June 2007  (8 years 9 months) Realtor Prudential Ca Realty October 1998  –  June 2007  (8 years 9 months) Instructor San Mateo Community College District 1996  –  1996  (less than a year) Instructor San Mateo Community College District 1996  –  1996  (less than a year) Instructor (Adjunct Faculty) Los Angeles Harbor College 1994  –  1994  (less than a year) Instructor (Adjunct Faculty) Los Angeles Harbor College 1994  –  1994  (less than a year) Languages Punjabi, Hindi Punjabi, Hindi Punjabi, Hindi Skills Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Skills  Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Education Middlesex University MS,  Applied computer technology 1989  – 1990 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 Middlesex University MS,  Applied computer technology 1989  – 1990 Middlesex University MS,  Applied computer technology 1989  – 1990 Middlesex University MS,  Applied computer technology 1989  – 1990 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 ", "Summary I am a pharmacist by training, with a Master of Business Administration from NIPER, Mohali (set up by the Government of India and declared a ‘Centre of Excellence’). \n \nDuring the previous year I have been working as as a Clinical Research Assistant at the Stanford University School of Medicine. My primary responsibilities include the management of clinical research protocols; developing, building and maintaining clinical databases; and providing multifaceted administrative and research support to the PI. Summary I am a pharmacist by training, with a Master of Business Administration from NIPER, Mohali (set up by the Government of India and declared a ‘Centre of Excellence’). \n \nDuring the previous year I have been working as as a Clinical Research Assistant at the Stanford University School of Medicine. My primary responsibilities include the management of clinical research protocols; developing, building and maintaining clinical databases; and providing multifaceted administrative and research support to the PI. I am a pharmacist by training, with a Master of Business Administration from NIPER, Mohali (set up by the Government of India and declared a ‘Centre of Excellence’). \n \nDuring the previous year I have been working as as a Clinical Research Assistant at the Stanford University School of Medicine. My primary responsibilities include the management of clinical research protocols; developing, building and maintaining clinical databases; and providing multifaceted administrative and research support to the PI. I am a pharmacist by training, with a Master of Business Administration from NIPER, Mohali (set up by the Government of India and declared a ‘Centre of Excellence’). \n \nDuring the previous year I have been working as as a Clinical Research Assistant at the Stanford University School of Medicine. My primary responsibilities include the management of clinical research protocols; developing, building and maintaining clinical databases; and providing multifaceted administrative and research support to the PI. Experience Data Manager - Cancer Clinical Trials Office Stanford University March 2014  – Present (1 year 6 months) Stanford, CA Clinical Research Assistant Stanford University School of Medicine November 2012  –  February 2014  (1 year 4 months) United States • Responsible for managing assigned clinical research protocols. Tasks include \naiding PI in drafting proposal; acquiring IRB and SRC approval; recruitment, screening, \nand consent of patients; managing regulatory requirements; managing study database. \n• Coordination of retrospective trails. Tasks include assisting in project \ndevelopment, database development and data collection. \n• Develop, build and maintain clinical databases using software applications such as \nRedcap and EPIC. Management Trainee PharmARC Analytic Solutions June 2009  –  August 2009  (3 months) India • Performed market assessment for drugs targeting opioid addiction in South America \n• Assisted the development team in analyzing PharmARC's entry potential in China. Data Manager - Cancer Clinical Trials Office Stanford University March 2014  – Present (1 year 6 months) Stanford, CA Data Manager - Cancer Clinical Trials Office Stanford University March 2014  – Present (1 year 6 months) Stanford, CA Clinical Research Assistant Stanford University School of Medicine November 2012  –  February 2014  (1 year 4 months) United States • Responsible for managing assigned clinical research protocols. Tasks include \naiding PI in drafting proposal; acquiring IRB and SRC approval; recruitment, screening, \nand consent of patients; managing regulatory requirements; managing study database. \n• Coordination of retrospective trails. Tasks include assisting in project \ndevelopment, database development and data collection. \n• Develop, build and maintain clinical databases using software applications such as \nRedcap and EPIC. Clinical Research Assistant Stanford University School of Medicine November 2012  –  February 2014  (1 year 4 months) United States • Responsible for managing assigned clinical research protocols. Tasks include \naiding PI in drafting proposal; acquiring IRB and SRC approval; recruitment, screening, \nand consent of patients; managing regulatory requirements; managing study database. \n• Coordination of retrospective trails. Tasks include assisting in project \ndevelopment, database development and data collection. \n• Develop, build and maintain clinical databases using software applications such as \nRedcap and EPIC. Management Trainee PharmARC Analytic Solutions June 2009  –  August 2009  (3 months) India • Performed market assessment for drugs targeting opioid addiction in South America \n• Assisted the development team in analyzing PharmARC's entry potential in China. Management Trainee PharmARC Analytic Solutions June 2009  –  August 2009  (3 months) India • Performed market assessment for drugs targeting opioid addiction in South America \n• Assisted the development team in analyzing PharmARC's entry potential in China. Languages English Full professional proficiency Hindi Native or bilingual proficiency Urdu Elementary proficiency English Full professional proficiency Hindi Native or bilingual proficiency Urdu Elementary proficiency English Full professional proficiency Hindi Native or bilingual proficiency Urdu Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Clinical Research Healthcare Management Database Administration Data Mining Marketing Communications Regulatory Affairs HIPAA IRB Skills  Clinical Research Healthcare Management Database Administration Data Mining Marketing Communications Regulatory Affairs HIPAA IRB Clinical Research Healthcare Management Database Administration Data Mining Marketing Communications Regulatory Affairs HIPAA IRB Clinical Research Healthcare Management Database Administration Data Mining Marketing Communications Regulatory Affairs HIPAA IRB Education National Institute of Pharmaceutical Education and Research Business Administration and Management , General 2008  – 2010 Devi Ahilya Vishwavidyalaya Bachelor's degree,  Pharmaceutical Sciences 2004  – 2008 National Institute of Pharmaceutical Education and Research Business Administration and Management , General 2008  – 2010 National Institute of Pharmaceutical Education and Research Business Administration and Management , General 2008  – 2010 National Institute of Pharmaceutical Education and Research Business Administration and Management , General 2008  – 2010 Devi Ahilya Vishwavidyalaya Bachelor's degree,  Pharmaceutical Sciences 2004  – 2008 Devi Ahilya Vishwavidyalaya Bachelor's degree,  Pharmaceutical Sciences 2004  – 2008 Devi Ahilya Vishwavidyalaya Bachelor's degree,  Pharmaceutical Sciences 2004  – 2008 ", "Experience Clinical Research Assistant Stanford University School of Medicine April 2015  – Present (5 months) Dept. of Psychiatry Undergraduate research assistant on multiple research studies and clinical trials studying different treatments and therapies for Autism Spectrum Disorder and other neurodevelopmental and psychiatric indications.  \n \nThe Stanford University Autism and Developmental Research Program (ADDRP) focuses on improving the quality of life of individuals with autism spectrum disorder and/or intellectual disabilities. Through research methods that range from clinical trials, neuroimaging investigations, behavioral analysis to basic science methods, the researchers at ADDRP are committed to developing effective treatment strategies and identifying the causes of these conditions.  \n \nClinical Research Website: autism.stanford.edu Counselor Stanford Medical Youth Science Program June 2014  – Present (1 year 3 months) The Summer Residential Program is an annual five-week science- and medicine-based enrichment program that takes place annually in the summer, and is held on the Stanford University campus.The vision of the program is to promote the representation of ethnic minority and low-income groups in the health professions. In addition to this, it offers guidance about the college admissions process to low-income and/or underrepresented minority students. A full-time staff of ten Stanford undergraduate students directs the program and lives with participants during the five-weeks. \n \nMentor to 24 low-income and ethnically diverse high school sophomores and juniors who live in northern and central California. Involved in the selection process of participants in the spring. In the summer, in charge of planning and presenting workshops, organize anatomy lecture series, creating and grading problem sets, and setting up review sessions for final exam. Clinical Research Assistant Stanford University School of Medicine April 2015  – Present (5 months) Dept. of Psychiatry Undergraduate research assistant on multiple research studies and clinical trials studying different treatments and therapies for Autism Spectrum Disorder and other neurodevelopmental and psychiatric indications.  \n \nThe Stanford University Autism and Developmental Research Program (ADDRP) focuses on improving the quality of life of individuals with autism spectrum disorder and/or intellectual disabilities. Through research methods that range from clinical trials, neuroimaging investigations, behavioral analysis to basic science methods, the researchers at ADDRP are committed to developing effective treatment strategies and identifying the causes of these conditions.  \n \nClinical Research Website: autism.stanford.edu Clinical Research Assistant Stanford University School of Medicine April 2015  – Present (5 months) Dept. of Psychiatry Undergraduate research assistant on multiple research studies and clinical trials studying different treatments and therapies for Autism Spectrum Disorder and other neurodevelopmental and psychiatric indications.  \n \nThe Stanford University Autism and Developmental Research Program (ADDRP) focuses on improving the quality of life of individuals with autism spectrum disorder and/or intellectual disabilities. Through research methods that range from clinical trials, neuroimaging investigations, behavioral analysis to basic science methods, the researchers at ADDRP are committed to developing effective treatment strategies and identifying the causes of these conditions.  \n \nClinical Research Website: autism.stanford.edu Counselor Stanford Medical Youth Science Program June 2014  – Present (1 year 3 months) The Summer Residential Program is an annual five-week science- and medicine-based enrichment program that takes place annually in the summer, and is held on the Stanford University campus.The vision of the program is to promote the representation of ethnic minority and low-income groups in the health professions. In addition to this, it offers guidance about the college admissions process to low-income and/or underrepresented minority students. A full-time staff of ten Stanford undergraduate students directs the program and lives with participants during the five-weeks. \n \nMentor to 24 low-income and ethnically diverse high school sophomores and juniors who live in northern and central California. Involved in the selection process of participants in the spring. In the summer, in charge of planning and presenting workshops, organize anatomy lecture series, creating and grading problem sets, and setting up review sessions for final exam. Counselor Stanford Medical Youth Science Program June 2014  – Present (1 year 3 months) The Summer Residential Program is an annual five-week science- and medicine-based enrichment program that takes place annually in the summer, and is held on the Stanford University campus.The vision of the program is to promote the representation of ethnic minority and low-income groups in the health professions. In addition to this, it offers guidance about the college admissions process to low-income and/or underrepresented minority students. A full-time staff of ten Stanford undergraduate students directs the program and lives with participants during the five-weeks. \n \nMentor to 24 low-income and ethnically diverse high school sophomores and juniors who live in northern and central California. Involved in the selection process of participants in the spring. In the summer, in charge of planning and presenting workshops, organize anatomy lecture series, creating and grading problem sets, and setting up review sessions for final exam. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Microsoft Office Microsoft Excel PowerPoint Research Student Counseling Statistical Data... Photoshop Skills  Microsoft Office Microsoft Excel PowerPoint Research Student Counseling Statistical Data... Photoshop Microsoft Office Microsoft Excel PowerPoint Research Student Counseling Statistical Data... Photoshop Microsoft Office Microsoft Excel PowerPoint Research Student Counseling Statistical Data... Photoshop Education Stanford University Bachelor of Science (B.S.),  Biology ,  Neurobiology 2013  – 2017 Activities and Societies:  Autism Speaks U Stanford (Event Coordinator) ,  Stanford Women in Medicine ,  Stanford Medical Youth Science Program ,  Kids with Dreams ,  Research ,  Chi Omega Fraternity The Lawrenceville School High School Diploma 2009  – 2013 Activities and Societies:  Action for Autism (Co-Founder and Co-President) ,  Co-Curricular Study (Zebrafish Genetics) ,  Independent Study (Neurological Disorders) ,  National Hispanic Scholar ,  Dean's List ,  Questbridge College Prep Scholar ,  Lawrenceville Leadership Conference Stanford University Bachelor of Science (B.S.),  Biology ,  Neurobiology 2013  – 2017 Activities and Societies:  Autism Speaks U Stanford (Event Coordinator) ,  Stanford Women in Medicine ,  Stanford Medical Youth Science Program ,  Kids with Dreams ,  Research ,  Chi Omega Fraternity Stanford University Bachelor of Science (B.S.),  Biology ,  Neurobiology 2013  – 2017 Activities and Societies:  Autism Speaks U Stanford (Event Coordinator) ,  Stanford Women in Medicine ,  Stanford Medical Youth Science Program ,  Kids with Dreams ,  Research ,  Chi Omega Fraternity Stanford University Bachelor of Science (B.S.),  Biology ,  Neurobiology 2013  – 2017 Activities and Societies:  Autism Speaks U Stanford (Event Coordinator) ,  Stanford Women in Medicine ,  Stanford Medical Youth Science Program ,  Kids with Dreams ,  Research ,  Chi Omega Fraternity The Lawrenceville School High School Diploma 2009  – 2013 Activities and Societies:  Action for Autism (Co-Founder and Co-President) ,  Co-Curricular Study (Zebrafish Genetics) ,  Independent Study (Neurological Disorders) ,  National Hispanic Scholar ,  Dean's List ,  Questbridge College Prep Scholar ,  Lawrenceville Leadership Conference The Lawrenceville School High School Diploma 2009  – 2013 Activities and Societies:  Action for Autism (Co-Founder and Co-President) ,  Co-Curricular Study (Zebrafish Genetics) ,  Independent Study (Neurological Disorders) ,  National Hispanic Scholar ,  Dean's List ,  Questbridge College Prep Scholar ,  Lawrenceville Leadership Conference The Lawrenceville School High School Diploma 2009  – 2013 Activities and Societies:  Action for Autism (Co-Founder and Co-President) ,  Co-Curricular Study (Zebrafish Genetics) ,  Independent Study (Neurological Disorders) ,  National Hispanic Scholar ,  Dean's List ,  Questbridge College Prep Scholar ,  Lawrenceville Leadership Conference Honors & Awards ", "Experience Managing Director L.E.K. Consulting August 1998  – Present (17 years 1 month) Board Member, SF Bay Area Advisory Board Best Buddies California October 2013  – Present (1 year 11 months) San Francisco, CA State Director Best Buddies International September 1996  –  August 1998  (2 years) Clinical Research Assistant Stanford University School of Medicine 1994  –  1996  (2 years) Managing Director L.E.K. Consulting August 1998  – Present (17 years 1 month) Managing Director L.E.K. Consulting August 1998  – Present (17 years 1 month) Board Member, SF Bay Area Advisory Board Best Buddies California October 2013  – Present (1 year 11 months) San Francisco, CA Board Member, SF Bay Area Advisory Board Best Buddies California October 2013  – Present (1 year 11 months) San Francisco, CA State Director Best Buddies International September 1996  –  August 1998  (2 years) State Director Best Buddies International September 1996  –  August 1998  (2 years) Clinical Research Assistant Stanford University School of Medicine 1994  –  1996  (2 years) Clinical Research Assistant Stanford University School of Medicine 1994  –  1996  (2 years) Skills Strategic Consulting Corporate Development Management Consulting Strategy Private Equity Mergers & Acquisitions Due Diligence Financial Modeling Business Strategy Emerging Markets Acquisition Integration Strategic Planning Healthcare Industry Managed Care Program Management Management Competitive Analysis Market Entry Medicaid Managed Care Medicare/Medicaid... Valuation Medicare Advantage Care Models See 8+     See less Skills  Strategic Consulting Corporate Development Management Consulting Strategy Private Equity Mergers & Acquisitions Due Diligence Financial Modeling Business Strategy Emerging Markets Acquisition Integration Strategic Planning Healthcare Industry Managed Care Program Management Management Competitive Analysis Market Entry Medicaid Managed Care Medicare/Medicaid... Valuation Medicare Advantage Care Models See 8+     See less Strategic Consulting Corporate Development Management Consulting Strategy Private Equity Mergers & Acquisitions Due Diligence Financial Modeling Business Strategy Emerging Markets Acquisition Integration Strategic Planning Healthcare Industry Managed Care Program Management Management Competitive Analysis Market Entry Medicaid Managed Care Medicare/Medicaid... Valuation Medicare Advantage Care Models See 8+     See less Strategic Consulting Corporate Development Management Consulting Strategy Private Equity Mergers & Acquisitions Due Diligence Financial Modeling Business Strategy Emerging Markets Acquisition Integration Strategic Planning Healthcare Industry Managed Care Program Management Management Competitive Analysis Market Entry Medicaid Managed Care Medicare/Medicaid... Valuation Medicare Advantage Care Models See 8+     See less Education Stanford University M.S.,  Biological Sciences September 1993  – June 1994 Stanford University B.S.,  Biological Sciences September 1989  – June 1993 Cleveland Humanities Magnet HS Stanford University M.S.,  Biological Sciences September 1993  – June 1994 Stanford University M.S.,  Biological Sciences September 1993  – June 1994 Stanford University M.S.,  Biological Sciences September 1993  – June 1994 Stanford University B.S.,  Biological Sciences September 1989  – June 1993 Stanford University B.S.,  Biological Sciences September 1989  – June 1993 Stanford University B.S.,  Biological Sciences September 1989  – June 1993 Cleveland Humanities Magnet HS Cleveland Humanities Magnet HS Cleveland Humanities Magnet HS ", "Summary Observing patients’ progress has deeply inspired me to pursue a career in medicine and my lifelong goal of reducing pain. Summary Observing patients’ progress has deeply inspired me to pursue a career in medicine and my lifelong goal of reducing pain. Observing patients’ progress has deeply inspired me to pursue a career in medicine and my lifelong goal of reducing pain. Observing patients’ progress has deeply inspired me to pursue a career in medicine and my lifelong goal of reducing pain. Experience Clinical Research Assistant Stanford University School of Medicine August 2011  – Present (4 years 1 month) • Aid the Principle Investigator in the development of study design, protocols, case report forms, and patient assessment techniques \n• Screen veterans for study participation eligibility and recruit, enroll, and retain eligible study veterans in pain control studies \n• Obtain informed consent from study patients and assess study patients’ motor and sensory responses during intraoperative period \n• Conduct follow-up interviews with study patients and record study patients’ pain scores and opiate usage post-surgery \n• Present collected data to research team, aid in the data analysis, and participate in research team meetings \n• Assist the Principle Investigator in preparing data and documents for IRB reviews and for grant submissions \n• Navigate VA computer database and retrieve relevant study patients’ data from the CPRS database \n• Ensure that human subject research methods and team are in compliance with federal regulations Clinical Research Assistant Intern UCSF November 2010  – Present (4 years 10 months) • Aid UCSF Principle Investigator in collecting patients’ data from SFGH Emergency Department \n• Recruit patients for Acute Organ Failure, Soft Tissue Infection, Chest X-ray, Computer Tomography, and Non-image studies \n• Obtain informed consent from patients, conduct patient surveys, and collect biological specimen from patients \n• Communicate with physicians and other health care providers about type of treatment provided to study patients \n• Record, review, and maintain patients’ diagnoses and medical care in SFGH electronic database Volunteer San Francisco General Hospital and Trauma Center January 2010  – Present (5 years 8 months) Psychiatric Emergency Service Volunteer \n• Interview suicidal and/or homicidal patients individually with psychiatrists \n• Support psychiatrists in their interventions, diagnoses, prognoses, and care of patients \n• Review patients’ progress notes and discuss treatment methods with psychiatrists Methadone Maintenance Counselor Bay-Area Addiction Research Treatment Services, Inc. March 2008  –  June 2011  (3 years 4 months) • Maintained a caseload of 30-40 disabled, multiply diagnosed, opiate-dependent patients \n• Held individual weekly counseling sessions with patients about their drug use and health issues \n• Assessed patients’ withdrawal symptoms and adjusted their methadone dosages as needed \n• Addressed patients’ positive toxicology screenings and recorded patients’ response and treatment progress \n• Coordinated patient care with our physicians, therapists, and other medical care providers \n• Conducted case presentations and clinical assessments/screenings \n• Participated in weekly medical and clinical meetings to improve treatment \n• Provided patients with needed referrals throughout the Bay-Area Counselor Bayview Hunter's Point Foundation Youth Services November 2007  –  March 2008  (5 months) • Maintained a caseload of 17 at-risk teenage girls living in Bayview-Hunter’s Point \n• Held weekly individual and group counseling sessions to educate girls about physical and mental health disorders \n• Advocated for physical and mental healthiness through promoting exercise and other healthy fun events and activities \n• Planned interventions and prevention of drug abuse, unprotected sex, and other risky behaviors \n• Created and maintained girls’ charts and treatment plans and provided girls with needed referrals Clinical Research Assistant Stanford University School of Medicine August 2011  – Present (4 years 1 month) • Aid the Principle Investigator in the development of study design, protocols, case report forms, and patient assessment techniques \n• Screen veterans for study participation eligibility and recruit, enroll, and retain eligible study veterans in pain control studies \n• Obtain informed consent from study patients and assess study patients’ motor and sensory responses during intraoperative period \n• Conduct follow-up interviews with study patients and record study patients’ pain scores and opiate usage post-surgery \n• Present collected data to research team, aid in the data analysis, and participate in research team meetings \n• Assist the Principle Investigator in preparing data and documents for IRB reviews and for grant submissions \n• Navigate VA computer database and retrieve relevant study patients’ data from the CPRS database \n• Ensure that human subject research methods and team are in compliance with federal regulations Clinical Research Assistant Stanford University School of Medicine August 2011  – Present (4 years 1 month) • Aid the Principle Investigator in the development of study design, protocols, case report forms, and patient assessment techniques \n• Screen veterans for study participation eligibility and recruit, enroll, and retain eligible study veterans in pain control studies \n• Obtain informed consent from study patients and assess study patients’ motor and sensory responses during intraoperative period \n• Conduct follow-up interviews with study patients and record study patients’ pain scores and opiate usage post-surgery \n• Present collected data to research team, aid in the data analysis, and participate in research team meetings \n• Assist the Principle Investigator in preparing data and documents for IRB reviews and for grant submissions \n• Navigate VA computer database and retrieve relevant study patients’ data from the CPRS database \n• Ensure that human subject research methods and team are in compliance with federal regulations Clinical Research Assistant Intern UCSF November 2010  – Present (4 years 10 months) • Aid UCSF Principle Investigator in collecting patients’ data from SFGH Emergency Department \n• Recruit patients for Acute Organ Failure, Soft Tissue Infection, Chest X-ray, Computer Tomography, and Non-image studies \n• Obtain informed consent from patients, conduct patient surveys, and collect biological specimen from patients \n• Communicate with physicians and other health care providers about type of treatment provided to study patients \n• Record, review, and maintain patients’ diagnoses and medical care in SFGH electronic database Clinical Research Assistant Intern UCSF November 2010  – Present (4 years 10 months) • Aid UCSF Principle Investigator in collecting patients’ data from SFGH Emergency Department \n• Recruit patients for Acute Organ Failure, Soft Tissue Infection, Chest X-ray, Computer Tomography, and Non-image studies \n• Obtain informed consent from patients, conduct patient surveys, and collect biological specimen from patients \n• Communicate with physicians and other health care providers about type of treatment provided to study patients \n• Record, review, and maintain patients’ diagnoses and medical care in SFGH electronic database Volunteer San Francisco General Hospital and Trauma Center January 2010  – Present (5 years 8 months) Psychiatric Emergency Service Volunteer \n• Interview suicidal and/or homicidal patients individually with psychiatrists \n• Support psychiatrists in their interventions, diagnoses, prognoses, and care of patients \n• Review patients’ progress notes and discuss treatment methods with psychiatrists Volunteer San Francisco General Hospital and Trauma Center January 2010  – Present (5 years 8 months) Psychiatric Emergency Service Volunteer \n• Interview suicidal and/or homicidal patients individually with psychiatrists \n• Support psychiatrists in their interventions, diagnoses, prognoses, and care of patients \n• Review patients’ progress notes and discuss treatment methods with psychiatrists Methadone Maintenance Counselor Bay-Area Addiction Research Treatment Services, Inc. March 2008  –  June 2011  (3 years 4 months) • Maintained a caseload of 30-40 disabled, multiply diagnosed, opiate-dependent patients \n• Held individual weekly counseling sessions with patients about their drug use and health issues \n• Assessed patients’ withdrawal symptoms and adjusted their methadone dosages as needed \n• Addressed patients’ positive toxicology screenings and recorded patients’ response and treatment progress \n• Coordinated patient care with our physicians, therapists, and other medical care providers \n• Conducted case presentations and clinical assessments/screenings \n• Participated in weekly medical and clinical meetings to improve treatment \n• Provided patients with needed referrals throughout the Bay-Area Methadone Maintenance Counselor Bay-Area Addiction Research Treatment Services, Inc. March 2008  –  June 2011  (3 years 4 months) • Maintained a caseload of 30-40 disabled, multiply diagnosed, opiate-dependent patients \n• Held individual weekly counseling sessions with patients about their drug use and health issues \n• Assessed patients’ withdrawal symptoms and adjusted their methadone dosages as needed \n• Addressed patients’ positive toxicology screenings and recorded patients’ response and treatment progress \n• Coordinated patient care with our physicians, therapists, and other medical care providers \n• Conducted case presentations and clinical assessments/screenings \n• Participated in weekly medical and clinical meetings to improve treatment \n• Provided patients with needed referrals throughout the Bay-Area Counselor Bayview Hunter's Point Foundation Youth Services November 2007  –  March 2008  (5 months) • Maintained a caseload of 17 at-risk teenage girls living in Bayview-Hunter’s Point \n• Held weekly individual and group counseling sessions to educate girls about physical and mental health disorders \n• Advocated for physical and mental healthiness through promoting exercise and other healthy fun events and activities \n• Planned interventions and prevention of drug abuse, unprotected sex, and other risky behaviors \n• Created and maintained girls’ charts and treatment plans and provided girls with needed referrals Counselor Bayview Hunter's Point Foundation Youth Services November 2007  –  March 2008  (5 months) • Maintained a caseload of 17 at-risk teenage girls living in Bayview-Hunter’s Point \n• Held weekly individual and group counseling sessions to educate girls about physical and mental health disorders \n• Advocated for physical and mental healthiness through promoting exercise and other healthy fun events and activities \n• Planned interventions and prevention of drug abuse, unprotected sex, and other risky behaviors \n• Created and maintained girls’ charts and treatment plans and provided girls with needed referrals Languages Some Spanish Some Spanish Some Spanish Skills Medical Terminology Clinical Research Research Design Data Entry Database Design Data Management Data Analysis Counseling Mental Health Substance Abuse... HIV/AIDS Crisis Intervention Early Intervention Trauma Child Abuse Elder Abuse Program Development Program Design Program Implementation Program Management See 5+     See less Skills  Medical Terminology Clinical Research Research Design Data Entry Database Design Data Management Data Analysis Counseling Mental Health Substance Abuse... HIV/AIDS Crisis Intervention Early Intervention Trauma Child Abuse Elder Abuse Program Development Program Design Program Implementation Program Management See 5+     See less Medical Terminology Clinical Research Research Design Data Entry Database Design Data Management Data Analysis Counseling Mental Health Substance Abuse... HIV/AIDS Crisis Intervention Early Intervention Trauma Child Abuse Elder Abuse Program Development Program Design Program Implementation Program Management See 5+     See less Medical Terminology Clinical Research Research Design Data Entry Database Design Data Management Data Analysis Counseling Mental Health Substance Abuse... HIV/AIDS Crisis Intervention Early Intervention Trauma Child Abuse Elder Abuse Program Development Program Design Program Implementation Program Management See 5+     See less Education City College of San Francisco AA,  Chemistry 2008  – 2013 University of San Francisco BA,  Psychology 2003  – 2007 City College of San Francisco AA,  Chemistry 2008  – 2013 City College of San Francisco AA,  Chemistry 2008  – 2013 City College of San Francisco AA,  Chemistry 2008  – 2013 University of San Francisco BA,  Psychology 2003  – 2007 University of San Francisco BA,  Psychology 2003  – 2007 University of San Francisco BA,  Psychology 2003  – 2007 ", "Experience Clinical Research Assistant Stanford University School of Medicine 2013  – Present (2 years) Athlete USA Volleyball National Team 2002  –  November 2010  (8 years) Colorado Springs, CO and Anaheim, CA Professional Athlete VK Prostejov 2009  –  2010  (1 year) District Prostejov, Czech Republic Professional Athlete Galatasaray 2008  –  2009  (1 year) Istanbul, Turkey Professional Athlete Asystel Volley 2007  –  2008  (1 year) Novara Area, Italy Professional Athlete Pinkin de Corozal 2006  –  2007  (1 year) Corozal, Puerto Rico Professional Athlete Volero Zurich 2006  –  2007  (1 year) Zurich, Switzerland Clinical Research Assistant Stanford University School of Medicine 2013  – Present (2 years) Clinical Research Assistant Stanford University School of Medicine 2013  – Present (2 years) Athlete USA Volleyball National Team 2002  –  November 2010  (8 years) Colorado Springs, CO and Anaheim, CA Athlete USA Volleyball National Team 2002  –  November 2010  (8 years) Colorado Springs, CO and Anaheim, CA Professional Athlete VK Prostejov 2009  –  2010  (1 year) District Prostejov, Czech Republic Professional Athlete VK Prostejov 2009  –  2010  (1 year) District Prostejov, Czech Republic Professional Athlete Galatasaray 2008  –  2009  (1 year) Istanbul, Turkey Professional Athlete Galatasaray 2008  –  2009  (1 year) Istanbul, Turkey Professional Athlete Asystel Volley 2007  –  2008  (1 year) Novara Area, Italy Professional Athlete Asystel Volley 2007  –  2008  (1 year) Novara Area, Italy Professional Athlete Pinkin de Corozal 2006  –  2007  (1 year) Corozal, Puerto Rico Professional Athlete Pinkin de Corozal 2006  –  2007  (1 year) Corozal, Puerto Rico Professional Athlete Volero Zurich 2006  –  2007  (1 year) Zurich, Switzerland Professional Athlete Volero Zurich 2006  –  2007  (1 year) Zurich, Switzerland Education San Francisco State University Postbaccalaureate Premedical Certificate Program 2012  – 2013 Columbia University in the City of New York Postbaccalaureate Premedical Program 2010  – 2011 Stanford University 2001  – 2005 Metcalf Laboratory School San Francisco State University Postbaccalaureate Premedical Certificate Program 2012  – 2013 San Francisco State University Postbaccalaureate Premedical Certificate Program 2012  – 2013 San Francisco State University Postbaccalaureate Premedical Certificate Program 2012  – 2013 Columbia University in the City of New York Postbaccalaureate Premedical Program 2010  – 2011 Columbia University in the City of New York Postbaccalaureate Premedical Program 2010  – 2011 Columbia University in the City of New York Postbaccalaureate Premedical Program 2010  – 2011 Stanford University 2001  – 2005 Stanford University 2001  – 2005 Stanford University 2001  – 2005 Metcalf Laboratory School Metcalf Laboratory School Metcalf Laboratory School ", "Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Clinical Research Molecular Biology PCR Cell Culture Western Blotting Research Medicine Public Health Neuroscience Genetics Mandarin French Data Analysis Biochemistry Lifesciences Science Biotechnology Infectious Diseases Epidemiology Medical Education Cell Biology Immunohistochemistry Cancer Cell ELISA Gel Electrophoresis Healthcare Clinical Trials Microbiology Scientific Writing Animal Models Immunology Medical Research DNA Diabetes Global Health Nutrition Transfection Chemistry DNA extraction Pharmacology Physiology Molecular Bacterial Transformation GCP Oncology Pharmaceutical Industry Microsoft Office GLP FDA GMP See 35+     See less Skills  Clinical Research Molecular Biology PCR Cell Culture Western Blotting Research Medicine Public Health Neuroscience Genetics Mandarin French Data Analysis Biochemistry Lifesciences Science Biotechnology Infectious Diseases Epidemiology Medical Education Cell Biology Immunohistochemistry Cancer Cell ELISA Gel Electrophoresis Healthcare Clinical Trials Microbiology Scientific Writing Animal Models Immunology Medical Research DNA Diabetes Global Health Nutrition Transfection Chemistry DNA extraction Pharmacology Physiology Molecular Bacterial Transformation GCP Oncology Pharmaceutical Industry Microsoft Office GLP FDA GMP See 35+     See less Clinical Research Molecular Biology PCR Cell Culture Western Blotting Research Medicine Public Health Neuroscience Genetics Mandarin French Data Analysis Biochemistry Lifesciences Science Biotechnology Infectious Diseases Epidemiology Medical Education Cell Biology Immunohistochemistry Cancer Cell ELISA Gel Electrophoresis Healthcare Clinical Trials Microbiology Scientific Writing Animal Models Immunology Medical Research DNA Diabetes Global Health Nutrition Transfection Chemistry DNA extraction Pharmacology Physiology Molecular Bacterial Transformation GCP Oncology Pharmaceutical Industry Microsoft Office GLP FDA GMP See 35+     See less Clinical Research Molecular Biology PCR Cell Culture Western Blotting Research Medicine Public Health Neuroscience Genetics Mandarin French Data Analysis Biochemistry Lifesciences Science Biotechnology Infectious Diseases Epidemiology Medical Education Cell Biology Immunohistochemistry Cancer Cell ELISA Gel Electrophoresis Healthcare Clinical Trials Microbiology Scientific Writing Animal Models Immunology Medical Research DNA Diabetes Global Health Nutrition Transfection Chemistry DNA extraction Pharmacology Physiology Molecular Bacterial Transformation GCP Oncology Pharmaceutical Industry Microsoft Office GLP FDA GMP See 35+     See less Honors & Awards Finkelstein Memorial Student Research Award Penn State University College of Medicine 2011 The Finkelstein Memorial Student Research award was established to encourage research in immunologic or rheumatologic diseases and especially the study of autoimmunity and autoimmune diseases. This award was given based on the project on round window membrane permeability in guinea pigs, which was eventually published in Laryngoscope, a peer-reviewed medical journal. Finkelstein Memorial Student Research Award Penn State University College of Medicine 2011 The Finkelstein Memorial Student Research award was established to encourage research in immunologic or rheumatologic diseases and especially the study of autoimmunity and autoimmune diseases. This award was given based on the project on round window membrane permeability in guinea pigs, which was eventually published in Laryngoscope, a peer-reviewed medical journal. Finkelstein Memorial Student Research Award Penn State University College of Medicine 2011 The Finkelstein Memorial Student Research award was established to encourage research in immunologic or rheumatologic diseases and especially the study of autoimmunity and autoimmune diseases. This award was given based on the project on round window membrane permeability in guinea pigs, which was eventually published in Laryngoscope, a peer-reviewed medical journal. Finkelstein Memorial Student Research Award Penn State University College of Medicine 2011 The Finkelstein Memorial Student Research award was established to encourage research in immunologic or rheumatologic diseases and especially the study of autoimmunity and autoimmune diseases. This award was given based on the project on round window membrane permeability in guinea pigs, which was eventually published in Laryngoscope, a peer-reviewed medical journal. ", "Experience Clinical Research Assistant Stanford University School of Medicine Clinical Research Assistant Stanford University School of Medicine Clinical Research Assistant Stanford University School of Medicine Education Stanford University M.S.,  Biology 2008  – 2009 Stanford University B.S.,  Biological Sciences 2004  – 2008 Activities and Societies:  Stanford Band ,  Tour Guide Stanford University M.S.,  Biology 2008  – 2009 Stanford University M.S.,  Biology 2008  – 2009 Stanford University M.S.,  Biology 2008  – 2009 Stanford University B.S.,  Biological Sciences 2004  – 2008 Activities and Societies:  Stanford Band ,  Tour Guide Stanford University B.S.,  Biological Sciences 2004  – 2008 Activities and Societies:  Stanford Band ,  Tour Guide Stanford University B.S.,  Biological Sciences 2004  – 2008 Activities and Societies:  Stanford Band ,  Tour Guide ", "Experience Clinical Research Assistant Stanford University June 2014  – Present (1 year 3 months) Stanford University Cancer Center Media Services Assistant Columbia University September 2011  –  June 2014  (2 years 10 months) 116th Street and Broadway, New York, NY 10027 Assist with communications materials, photos, special projects.  \nPioneered cloud based media sharing and access of new and old materials on behalf of multiple departments. Emergency Medical Technician Columbia University Emergency Medical Service January 2011  –  June 2014  (3 years 6 months) 116th Street and Broadway, New York, NY 10027 Chief of Operations Columbia University Emergency Medical Service January 2013  –  January 2014  (1 year 1 month) Greater New York City Area Manager Jamba Juice August 2007  –  August 2011  (4 years 1 month) San Francisco Bay Area Clinical Research Assistant Stanford University June 2014  – Present (1 year 3 months) Stanford University Cancer Center Clinical Research Assistant Stanford University June 2014  – Present (1 year 3 months) Stanford University Cancer Center Media Services Assistant Columbia University September 2011  –  June 2014  (2 years 10 months) 116th Street and Broadway, New York, NY 10027 Assist with communications materials, photos, special projects.  \nPioneered cloud based media sharing and access of new and old materials on behalf of multiple departments. Media Services Assistant Columbia University September 2011  –  June 2014  (2 years 10 months) 116th Street and Broadway, New York, NY 10027 Assist with communications materials, photos, special projects.  \nPioneered cloud based media sharing and access of new and old materials on behalf of multiple departments. Emergency Medical Technician Columbia University Emergency Medical Service January 2011  –  June 2014  (3 years 6 months) 116th Street and Broadway, New York, NY 10027 Emergency Medical Technician Columbia University Emergency Medical Service January 2011  –  June 2014  (3 years 6 months) 116th Street and Broadway, New York, NY 10027 Chief of Operations Columbia University Emergency Medical Service January 2013  –  January 2014  (1 year 1 month) Greater New York City Area Chief of Operations Columbia University Emergency Medical Service January 2013  –  January 2014  (1 year 1 month) Greater New York City Area Manager Jamba Juice August 2007  –  August 2011  (4 years 1 month) San Francisco Bay Area Manager Jamba Juice August 2007  –  August 2011  (4 years 1 month) San Francisco Bay Area Skills Leadership Editing Social Media Microsoft Office Public Speaking Event Planning PowerPoint Microsoft Word Social Networking Microsoft Excel Facebook Research Event Management Customer Service Fundraising Skills  Leadership Editing Social Media Microsoft Office Public Speaking Event Planning PowerPoint Microsoft Word Social Networking Microsoft Excel Facebook Research Event Management Customer Service Fundraising Leadership Editing Social Media Microsoft Office Public Speaking Event Planning PowerPoint Microsoft Word Social Networking Microsoft Excel Facebook Research Event Management Customer Service Fundraising Leadership Editing Social Media Microsoft Office Public Speaking Event Planning PowerPoint Microsoft Word Social Networking Microsoft Excel Facebook Research Event Management Customer Service Fundraising Education Columbia University in the City of New York Bachelor of Arts (B.A.),  Political Science 2011  – 2014 West Valley College Associate of Arts (AA),  Communications 2008  – 2011 West Valley College Associate of Arts (AA),  Liberal Arts with Honors 2008  – 2011 Columbia University in the City of New York Bachelor of Arts (B.A.),  Political Science 2011  – 2014 Columbia University in the City of New York Bachelor of Arts (B.A.),  Political Science 2011  – 2014 Columbia University in the City of New York Bachelor of Arts (B.A.),  Political Science 2011  – 2014 West Valley College Associate of Arts (AA),  Communications 2008  – 2011 West Valley College Associate of Arts (AA),  Communications 2008  – 2011 West Valley College Associate of Arts (AA),  Communications 2008  – 2011 West Valley College Associate of Arts (AA),  Liberal Arts with Honors 2008  – 2011 West Valley College Associate of Arts (AA),  Liberal Arts with Honors 2008  – 2011 West Valley College Associate of Arts (AA),  Liberal Arts with Honors 2008  – 2011 Honors & Awards Head Senior Marshal School of General Studies, Columbia University May 2014 Head Senior Marshal is an honor bestowed upon two members of the graduating class who have demonstrated achievement in their academics and extracurricular activities as a student at Columbia University. Senior Marshals are worthy of recognition for their personal achievements and for embodying all that is best about the School of General Studies and Columbia University. The head marshals have the honor of leading the graduate procession on Class Day.  2014 Spirit Award School of General Studies, Columbia University May 2014 Making the Difference - Awarded for dedicated years of outstanding service and commitment. Service Award Columbia University Emergency Medical Service May 2014 Presented in recognition of outstanding service and dedication to Columbia University EMS and the Columbia University Community. Communications Competence Award Randy Fujishin; Chair, Language Arts Department May 2010 West Valley College Honors Program Graduate West Valley College May 2011 Awarded for completion of optional, rigorous honors program coursework. Certificate of Appreciation Peak Promotion July 2014 Certificate of Appreciation in recognition of EMT/Continuing Medical Education Instruction to Nepal Ambulance Service. Signed: Wongchu Sherpa, Chairman - Everest Summiteer’s Association; Kedar Bahadur Adhikari, Joint Secretary - Ministry of Health & Population; Ranjan Krishna Aryal, Joint Secretary - Ministry of Tourism & Civil Aviation.  Head Senior Marshal School of General Studies, Columbia University May 2014 Head Senior Marshal is an honor bestowed upon two members of the graduating class who have demonstrated achievement in their academics and extracurricular activities as a student at Columbia University. Senior Marshals are worthy of recognition for their personal achievements and for embodying all that is best about the School of General Studies and Columbia University. The head marshals have the honor of leading the graduate procession on Class Day.  Head Senior Marshal School of General Studies, Columbia University May 2014 Head Senior Marshal is an honor bestowed upon two members of the graduating class who have demonstrated achievement in their academics and extracurricular activities as a student at Columbia University. Senior Marshals are worthy of recognition for their personal achievements and for embodying all that is best about the School of General Studies and Columbia University. The head marshals have the honor of leading the graduate procession on Class Day.  Head Senior Marshal School of General Studies, Columbia University May 2014 Head Senior Marshal is an honor bestowed upon two members of the graduating class who have demonstrated achievement in their academics and extracurricular activities as a student at Columbia University. Senior Marshals are worthy of recognition for their personal achievements and for embodying all that is best about the School of General Studies and Columbia University. The head marshals have the honor of leading the graduate procession on Class Day.  2014 Spirit Award School of General Studies, Columbia University May 2014 Making the Difference - Awarded for dedicated years of outstanding service and commitment. 2014 Spirit Award School of General Studies, Columbia University May 2014 Making the Difference - Awarded for dedicated years of outstanding service and commitment. 2014 Spirit Award School of General Studies, Columbia University May 2014 Making the Difference - Awarded for dedicated years of outstanding service and commitment. Service Award Columbia University Emergency Medical Service May 2014 Presented in recognition of outstanding service and dedication to Columbia University EMS and the Columbia University Community. Service Award Columbia University Emergency Medical Service May 2014 Presented in recognition of outstanding service and dedication to Columbia University EMS and the Columbia University Community. Service Award Columbia University Emergency Medical Service May 2014 Presented in recognition of outstanding service and dedication to Columbia University EMS and the Columbia University Community. Communications Competence Award Randy Fujishin; Chair, Language Arts Department May 2010 Communications Competence Award Randy Fujishin; Chair, Language Arts Department May 2010 Communications Competence Award Randy Fujishin; Chair, Language Arts Department May 2010 West Valley College Honors Program Graduate West Valley College May 2011 Awarded for completion of optional, rigorous honors program coursework. West Valley College Honors Program Graduate West Valley College May 2011 Awarded for completion of optional, rigorous honors program coursework. West Valley College Honors Program Graduate West Valley College May 2011 Awarded for completion of optional, rigorous honors program coursework. Certificate of Appreciation Peak Promotion July 2014 Certificate of Appreciation in recognition of EMT/Continuing Medical Education Instruction to Nepal Ambulance Service. Signed: Wongchu Sherpa, Chairman - Everest Summiteer’s Association; Kedar Bahadur Adhikari, Joint Secretary - Ministry of Health & Population; Ranjan Krishna Aryal, Joint Secretary - Ministry of Tourism & Civil Aviation.  Certificate of Appreciation Peak Promotion July 2014 Certificate of Appreciation in recognition of EMT/Continuing Medical Education Instruction to Nepal Ambulance Service. Signed: Wongchu Sherpa, Chairman - Everest Summiteer’s Association; Kedar Bahadur Adhikari, Joint Secretary - Ministry of Health & Population; Ranjan Krishna Aryal, Joint Secretary - Ministry of Tourism & Civil Aviation.  Certificate of Appreciation Peak Promotion July 2014 Certificate of Appreciation in recognition of EMT/Continuing Medical Education Instruction to Nepal Ambulance Service. Signed: Wongchu Sherpa, Chairman - Everest Summiteer’s Association; Kedar Bahadur Adhikari, Joint Secretary - Ministry of Health & Population; Ranjan Krishna Aryal, Joint Secretary - Ministry of Tourism & Civil Aviation.  "]}