{"position": "Communications Associate", "company": "Stanford University", "profiles": ["Summary A skilled writer and editor with nearly 15 years of experience in technical and research communications, particularly in the engineering, medical, academic and public policy disciplines. Successfully written, edited and managed hundreds of business and PR materials—both for print and web—including electronic and print newsletters, press releases, development and research reports, grant proposals, specifications, flyers, letters, brochures and invitations, along with other research and donor materials. Proven ability to manage projects successfully from start to finish, including conceiving story ideas, conducting interviews for articles, writing and editing work, and teaming with graphic and web designers to produce quality printed and electronic newsletters and reports. Summary A skilled writer and editor with nearly 15 years of experience in technical and research communications, particularly in the engineering, medical, academic and public policy disciplines. Successfully written, edited and managed hundreds of business and PR materials—both for print and web—including electronic and print newsletters, press releases, development and research reports, grant proposals, specifications, flyers, letters, brochures and invitations, along with other research and donor materials. Proven ability to manage projects successfully from start to finish, including conceiving story ideas, conducting interviews for articles, writing and editing work, and teaming with graphic and web designers to produce quality printed and electronic newsletters and reports. A skilled writer and editor with nearly 15 years of experience in technical and research communications, particularly in the engineering, medical, academic and public policy disciplines. Successfully written, edited and managed hundreds of business and PR materials—both for print and web—including electronic and print newsletters, press releases, development and research reports, grant proposals, specifications, flyers, letters, brochures and invitations, along with other research and donor materials. Proven ability to manage projects successfully from start to finish, including conceiving story ideas, conducting interviews for articles, writing and editing work, and teaming with graphic and web designers to produce quality printed and electronic newsletters and reports. A skilled writer and editor with nearly 15 years of experience in technical and research communications, particularly in the engineering, medical, academic and public policy disciplines. Successfully written, edited and managed hundreds of business and PR materials—both for print and web—including electronic and print newsletters, press releases, development and research reports, grant proposals, specifications, flyers, letters, brochures and invitations, along with other research and donor materials. Proven ability to manage projects successfully from start to finish, including conceiving story ideas, conducting interviews for articles, writing and editing work, and teaming with graphic and web designers to produce quality printed and electronic newsletters and reports. Experience Research Communications Specialist The University of Utah December 2007  –  May 2012  (4 years 6 months) Hired to originate this position. Served as sole writer and editor for the College’s public relations efforts. Started from the ground up to create PR materials for outreach to internal and external media, potential donors, students and faculty from other schools of engineering.  \nManaged workflow for graphic and web designers. Wrote, edited and redesigned the College’s semi-annual newsletter, annual research report, monthly e-newsletter, media releases, web content and printed materials.  \nInterviewed faculty about complex engineering research topics and reframed material into articles that could be understood by non-expert audiences. \nGenerated hundreds of news items and articles for print and electronic media designed to increase awareness and enhance the reputation of the College’s research, activities and achievements. \nCreated and managed a contact database of thousands of engineering professionals and faculty for public relations purposes. Helped to increase the College’s visibility, rankings and status among other engineering schools across the United States and internationally. Program Associate Stanford University, The Hoover Institution September 2003  –  November 2007  (4 years 3 months) Served as project manager for the director’s fundraising initiative. Wrote proposals and reports to individuals, foundations and organizations as part of a university campaign, resulting in more than $5 million in gifts annually. \n• Maintained foundation relations. Solicited donors through proposals and other written material. Wrote donor acknowledgment letters. \n• Served as contributing writer and editor to annual report. \n• Managed grants timetable to ensure that annual solicitations and reporting requirements met deadlines. \n• Responsible for overhauling the introductory process for potential donors to Hoover. Rewrote marketing materials to clarify Hoover’s mission message to potential donors. \n• Helped write and launch a new web feature that provides factual information to Hoover audiences. Assisted in design process. Communications Associate Stanford University, Office of Medical Development September 2001  –  August 2003  (2 years) Wrote and edited four quarterly medical research newsletters; interviewed faculty; contributed story, design and layout ideas. Served as contributing writer and editor to annual report. \n• Managed Stanford medical center’s heart development newsletter for financial donors. Researched story ideas; wrote and edited stories; worked with freelancers, graphic designer, printer, and mailhouse to produce and send materials to donors on schedule. \n• Managed all phases of development, production, and printing invitations and brochures for medical alumni reunions event materials. Edited materials to aid in readability, which resulted in fewer reunion registration errors. \n• Wrote solicitation proposals to potential donors; wrote and edited invitations for various medical events; composed acknowledgment letters to donors. \n• Participated on internal taskforce to determine the office’s compliance with new government regulations related to privacy standards for patient information. Disseminated information discussed in taskforce group to communications group. Managing Editor HCPro, Inc November 1999  –  February 2001  (1 year 4 months) Specializing in health care regulatory information \nMarblehead, MA\t \nManaging Editor (promoted from Editorial Assistant) \n• Wrote and edited articles and developed layout for print and email newsletters. \n• Managed, wrote, and edited content for Web site. Coordinated marketing, sales and editorial departments to improve sales. \n• Found and solved problem of not being able to answer Web site users’ questions in timely manner by creating new e-mail newsletter with no overhead costs that generated revenue. \n• Researched grant opportunities for potential newsletters. \n• Covered conferences and seminars; developed contacts and interviewed sources for articles. Research Communications Specialist The University of Utah December 2007  –  May 2012  (4 years 6 months) Hired to originate this position. Served as sole writer and editor for the College’s public relations efforts. Started from the ground up to create PR materials for outreach to internal and external media, potential donors, students and faculty from other schools of engineering.  \nManaged workflow for graphic and web designers. Wrote, edited and redesigned the College’s semi-annual newsletter, annual research report, monthly e-newsletter, media releases, web content and printed materials.  \nInterviewed faculty about complex engineering research topics and reframed material into articles that could be understood by non-expert audiences. \nGenerated hundreds of news items and articles for print and electronic media designed to increase awareness and enhance the reputation of the College’s research, activities and achievements. \nCreated and managed a contact database of thousands of engineering professionals and faculty for public relations purposes. Helped to increase the College’s visibility, rankings and status among other engineering schools across the United States and internationally. Research Communications Specialist The University of Utah December 2007  –  May 2012  (4 years 6 months) Hired to originate this position. Served as sole writer and editor for the College’s public relations efforts. Started from the ground up to create PR materials for outreach to internal and external media, potential donors, students and faculty from other schools of engineering.  \nManaged workflow for graphic and web designers. Wrote, edited and redesigned the College’s semi-annual newsletter, annual research report, monthly e-newsletter, media releases, web content and printed materials.  \nInterviewed faculty about complex engineering research topics and reframed material into articles that could be understood by non-expert audiences. \nGenerated hundreds of news items and articles for print and electronic media designed to increase awareness and enhance the reputation of the College’s research, activities and achievements. \nCreated and managed a contact database of thousands of engineering professionals and faculty for public relations purposes. Helped to increase the College’s visibility, rankings and status among other engineering schools across the United States and internationally. Program Associate Stanford University, The Hoover Institution September 2003  –  November 2007  (4 years 3 months) Served as project manager for the director’s fundraising initiative. Wrote proposals and reports to individuals, foundations and organizations as part of a university campaign, resulting in more than $5 million in gifts annually. \n• Maintained foundation relations. Solicited donors through proposals and other written material. Wrote donor acknowledgment letters. \n• Served as contributing writer and editor to annual report. \n• Managed grants timetable to ensure that annual solicitations and reporting requirements met deadlines. \n• Responsible for overhauling the introductory process for potential donors to Hoover. Rewrote marketing materials to clarify Hoover’s mission message to potential donors. \n• Helped write and launch a new web feature that provides factual information to Hoover audiences. Assisted in design process. Program Associate Stanford University, The Hoover Institution September 2003  –  November 2007  (4 years 3 months) Served as project manager for the director’s fundraising initiative. Wrote proposals and reports to individuals, foundations and organizations as part of a university campaign, resulting in more than $5 million in gifts annually. \n• Maintained foundation relations. Solicited donors through proposals and other written material. Wrote donor acknowledgment letters. \n• Served as contributing writer and editor to annual report. \n• Managed grants timetable to ensure that annual solicitations and reporting requirements met deadlines. \n• Responsible for overhauling the introductory process for potential donors to Hoover. Rewrote marketing materials to clarify Hoover’s mission message to potential donors. \n• Helped write and launch a new web feature that provides factual information to Hoover audiences. Assisted in design process. Communications Associate Stanford University, Office of Medical Development September 2001  –  August 2003  (2 years) Wrote and edited four quarterly medical research newsletters; interviewed faculty; contributed story, design and layout ideas. Served as contributing writer and editor to annual report. \n• Managed Stanford medical center’s heart development newsletter for financial donors. Researched story ideas; wrote and edited stories; worked with freelancers, graphic designer, printer, and mailhouse to produce and send materials to donors on schedule. \n• Managed all phases of development, production, and printing invitations and brochures for medical alumni reunions event materials. Edited materials to aid in readability, which resulted in fewer reunion registration errors. \n• Wrote solicitation proposals to potential donors; wrote and edited invitations for various medical events; composed acknowledgment letters to donors. \n• Participated on internal taskforce to determine the office’s compliance with new government regulations related to privacy standards for patient information. Disseminated information discussed in taskforce group to communications group. Communications Associate Stanford University, Office of Medical Development September 2001  –  August 2003  (2 years) Wrote and edited four quarterly medical research newsletters; interviewed faculty; contributed story, design and layout ideas. Served as contributing writer and editor to annual report. \n• Managed Stanford medical center’s heart development newsletter for financial donors. Researched story ideas; wrote and edited stories; worked with freelancers, graphic designer, printer, and mailhouse to produce and send materials to donors on schedule. \n• Managed all phases of development, production, and printing invitations and brochures for medical alumni reunions event materials. Edited materials to aid in readability, which resulted in fewer reunion registration errors. \n• Wrote solicitation proposals to potential donors; wrote and edited invitations for various medical events; composed acknowledgment letters to donors. \n• Participated on internal taskforce to determine the office’s compliance with new government regulations related to privacy standards for patient information. Disseminated information discussed in taskforce group to communications group. Managing Editor HCPro, Inc November 1999  –  February 2001  (1 year 4 months) Specializing in health care regulatory information \nMarblehead, MA\t \nManaging Editor (promoted from Editorial Assistant) \n• Wrote and edited articles and developed layout for print and email newsletters. \n• Managed, wrote, and edited content for Web site. Coordinated marketing, sales and editorial departments to improve sales. \n• Found and solved problem of not being able to answer Web site users’ questions in timely manner by creating new e-mail newsletter with no overhead costs that generated revenue. \n• Researched grant opportunities for potential newsletters. \n• Covered conferences and seminars; developed contacts and interviewed sources for articles. Managing Editor HCPro, Inc November 1999  –  February 2001  (1 year 4 months) Specializing in health care regulatory information \nMarblehead, MA\t \nManaging Editor (promoted from Editorial Assistant) \n• Wrote and edited articles and developed layout for print and email newsletters. \n• Managed, wrote, and edited content for Web site. Coordinated marketing, sales and editorial departments to improve sales. \n• Found and solved problem of not being able to answer Web site users’ questions in timely manner by creating new e-mail newsletter with no overhead costs that generated revenue. \n• Researched grant opportunities for potential newsletters. \n• Covered conferences and seminars; developed contacts and interviewed sources for articles. Skills Project management,... Fundraising Grant Writing Web Content Email Marketing Editing Public Relations Proposal Writing Newsletters InDesign Press Releases Research Editorial Storytelling Community Outreach Marketing See 1+     See less Skills  Project management,... Fundraising Grant Writing Web Content Email Marketing Editing Public Relations Proposal Writing Newsletters InDesign Press Releases Research Editorial Storytelling Community Outreach Marketing See 1+     See less Project management,... Fundraising Grant Writing Web Content Email Marketing Editing Public Relations Proposal Writing Newsletters InDesign Press Releases Research Editorial Storytelling Community Outreach Marketing See 1+     See less Project management,... Fundraising Grant Writing Web Content Email Marketing Editing Public Relations Proposal Writing Newsletters InDesign Press Releases Research Editorial Storytelling Community Outreach Marketing See 1+     See less Education University of Utah B.S,  Communication with Public Relations Emphasis Minor in English. Honor Roll. University of Utah B.S,  Communication with Public Relations Emphasis Minor in English. Honor Roll. University of Utah B.S,  Communication with Public Relations Emphasis Minor in English. Honor Roll. University of Utah B.S,  Communication with Public Relations Emphasis Minor in English. Honor Roll. ", "Experience Social Impact Project Manager GitHub May 2015  – Present (4 months) San Francisco Bay Area GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. Director of Strategy and Innovation Vaya Consulting 2014  –  2015  (1 year) Berkeley, CA Vaya Consulting’s mission is to help launch or improve the diversity efforts of companies and organizations, primarily in the US. Thoughtful, effective efforts to increase diversity among employees, boards, and investors is an imperative for Vaya’s clients who realize that these efforts can no long be walled off from central business strategy. Special Projects Associate Kapor Center for Social Impact 2013  –  2014  (1 year) Oakland, CA Founded by Mitch Kapor and Freada Kapor Klein, The Kapor Center sits at the intersection of technology and social justice. We relentlessly pursue creative strategies that will leverage information technology for positive social impact. We primarily work with underrepresented communities, focusing on closing academic, political, health, and economic gaps. Executive Producer Stanford Repertory Theater 2007  –  September 2010  (3 years) Stanford, CA Produced 11 productions (3 seasons) of professional repertory theatre. Directed media relations, patron management, publicity, and ticket sales. Supervised Assistant Producers, volunteers, and interns. Communications Associate Stanford University Haas Center for Public Service 2009  –  June 2010  (1 year) Stanford, CA Created written, oral, and visual projects for publication to highlight the work of Stanford University’s Haas Center for Public Service, which inspires and prepares students to create a more just and sustainable world through service, scholarship, and community partnerships. The Haas Center engages more than 1,000 students annually in global service across diverse pathways – direct service, engaged scholarship, activism, philanthropy, public policy, and social entrepreneurship. Director of Recruitment and Advocacy Specialist New Global Citizens 2007  –  2008  (1 year) San Francisco Bay Area New Global Citizens mobilizes young people in the United States to support grassroots efforts for human rights social change in the developing world through philanthropy, activism, and education.  \n \n-Designed and executed national recruitment efforts \n-Created New Global Citizens’ advocacy program, directing the Advocacy Leadership Committee.  \n-Chaperoned trip of 10 US high school students to Bangladesh to research grassroots environmental NGOs.  \n-Coordinated conferences and large scale events for hundreds of young people Senior Program Associate New Global Citizens 2004  –  2007  (3 years) San Francisco Bay Area -Co-wrote a 130 page action manual on creating global change, distributed nationally \n-Assisted club leaders to collectively raise over $50,000 for grassroots organizations abroad \n-Trained hundreds of club leaders in fundraising, advocacy, community education, and global activism skills.  Death Penalty Policy Project Intern and Outreach Intern ACLU of Northern California 2004  –  2006  (2 years) San Francisco Bay Area Death Penalty Policy Project, Intern: \n-Conducted in-depth research on California’s death penalty and criminal justice system.  \n-Created nationally-distributed “Student Activist Guide to Abolishing the Death Penalty”  \n \nField Department, Outreach Team Intern: \n-Traveled to events throughout the region, educating people on pressing civil liberties issues Social Impact Project Manager GitHub May 2015  – Present (4 months) San Francisco Bay Area GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. Social Impact Project Manager GitHub May 2015  – Present (4 months) San Francisco Bay Area GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. Director of Strategy and Innovation Vaya Consulting 2014  –  2015  (1 year) Berkeley, CA Vaya Consulting’s mission is to help launch or improve the diversity efforts of companies and organizations, primarily in the US. Thoughtful, effective efforts to increase diversity among employees, boards, and investors is an imperative for Vaya’s clients who realize that these efforts can no long be walled off from central business strategy. Director of Strategy and Innovation Vaya Consulting 2014  –  2015  (1 year) Berkeley, CA Vaya Consulting’s mission is to help launch or improve the diversity efforts of companies and organizations, primarily in the US. Thoughtful, effective efforts to increase diversity among employees, boards, and investors is an imperative for Vaya’s clients who realize that these efforts can no long be walled off from central business strategy. Special Projects Associate Kapor Center for Social Impact 2013  –  2014  (1 year) Oakland, CA Founded by Mitch Kapor and Freada Kapor Klein, The Kapor Center sits at the intersection of technology and social justice. We relentlessly pursue creative strategies that will leverage information technology for positive social impact. We primarily work with underrepresented communities, focusing on closing academic, political, health, and economic gaps. Special Projects Associate Kapor Center for Social Impact 2013  –  2014  (1 year) Oakland, CA Founded by Mitch Kapor and Freada Kapor Klein, The Kapor Center sits at the intersection of technology and social justice. We relentlessly pursue creative strategies that will leverage information technology for positive social impact. We primarily work with underrepresented communities, focusing on closing academic, political, health, and economic gaps. Executive Producer Stanford Repertory Theater 2007  –  September 2010  (3 years) Stanford, CA Produced 11 productions (3 seasons) of professional repertory theatre. Directed media relations, patron management, publicity, and ticket sales. Supervised Assistant Producers, volunteers, and interns. Executive Producer Stanford Repertory Theater 2007  –  September 2010  (3 years) Stanford, CA Produced 11 productions (3 seasons) of professional repertory theatre. Directed media relations, patron management, publicity, and ticket sales. Supervised Assistant Producers, volunteers, and interns. Communications Associate Stanford University Haas Center for Public Service 2009  –  June 2010  (1 year) Stanford, CA Created written, oral, and visual projects for publication to highlight the work of Stanford University’s Haas Center for Public Service, which inspires and prepares students to create a more just and sustainable world through service, scholarship, and community partnerships. The Haas Center engages more than 1,000 students annually in global service across diverse pathways – direct service, engaged scholarship, activism, philanthropy, public policy, and social entrepreneurship. Communications Associate Stanford University Haas Center for Public Service 2009  –  June 2010  (1 year) Stanford, CA Created written, oral, and visual projects for publication to highlight the work of Stanford University’s Haas Center for Public Service, which inspires and prepares students to create a more just and sustainable world through service, scholarship, and community partnerships. The Haas Center engages more than 1,000 students annually in global service across diverse pathways – direct service, engaged scholarship, activism, philanthropy, public policy, and social entrepreneurship. Director of Recruitment and Advocacy Specialist New Global Citizens 2007  –  2008  (1 year) San Francisco Bay Area New Global Citizens mobilizes young people in the United States to support grassroots efforts for human rights social change in the developing world through philanthropy, activism, and education.  \n \n-Designed and executed national recruitment efforts \n-Created New Global Citizens’ advocacy program, directing the Advocacy Leadership Committee.  \n-Chaperoned trip of 10 US high school students to Bangladesh to research grassroots environmental NGOs.  \n-Coordinated conferences and large scale events for hundreds of young people Director of Recruitment and Advocacy Specialist New Global Citizens 2007  –  2008  (1 year) San Francisco Bay Area New Global Citizens mobilizes young people in the United States to support grassroots efforts for human rights social change in the developing world through philanthropy, activism, and education.  \n \n-Designed and executed national recruitment efforts \n-Created New Global Citizens’ advocacy program, directing the Advocacy Leadership Committee.  \n-Chaperoned trip of 10 US high school students to Bangladesh to research grassroots environmental NGOs.  \n-Coordinated conferences and large scale events for hundreds of young people Senior Program Associate New Global Citizens 2004  –  2007  (3 years) San Francisco Bay Area -Co-wrote a 130 page action manual on creating global change, distributed nationally \n-Assisted club leaders to collectively raise over $50,000 for grassroots organizations abroad \n-Trained hundreds of club leaders in fundraising, advocacy, community education, and global activism skills.  Senior Program Associate New Global Citizens 2004  –  2007  (3 years) San Francisco Bay Area -Co-wrote a 130 page action manual on creating global change, distributed nationally \n-Assisted club leaders to collectively raise over $50,000 for grassroots organizations abroad \n-Trained hundreds of club leaders in fundraising, advocacy, community education, and global activism skills.  Death Penalty Policy Project Intern and Outreach Intern ACLU of Northern California 2004  –  2006  (2 years) San Francisco Bay Area Death Penalty Policy Project, Intern: \n-Conducted in-depth research on California’s death penalty and criminal justice system.  \n-Created nationally-distributed “Student Activist Guide to Abolishing the Death Penalty”  \n \nField Department, Outreach Team Intern: \n-Traveled to events throughout the region, educating people on pressing civil liberties issues Death Penalty Policy Project Intern and Outreach Intern ACLU of Northern California 2004  –  2006  (2 years) San Francisco Bay Area Death Penalty Policy Project, Intern: \n-Conducted in-depth research on California’s death penalty and criminal justice system.  \n-Created nationally-distributed “Student Activist Guide to Abolishing the Death Penalty”  \n \nField Department, Outreach Team Intern: \n-Traveled to events throughout the region, educating people on pressing civil liberties issues Skills Community Outreach Nonprofits Research Fundraising Volunteer Management Public Speaking Politics Writing Activism Leadership Grassroots Organization Program Management Event Planning Editing Grassroots Youth Development Philanthropy Strategic Planning Organizational... Public Policy Critical Thinking LGBT rights Collaboration Acting International Relations Theatrical Production Social Justice Community Engagement Project Management Event Management Social Impact Workshop Facilitation Performing Arts Workshop Development Blogging Strategy Project Planning Social Media Grassroots Fundraising Diversity & Inclusion Diversity Training Leadership Development Political Science Grants Grant Writing Human Rights International Human... Strategic Communications Equality & Diversity See 34+     See less Skills  Community Outreach Nonprofits Research Fundraising Volunteer Management Public Speaking Politics Writing Activism Leadership Grassroots Organization Program Management Event Planning Editing Grassroots Youth Development Philanthropy Strategic Planning Organizational... Public Policy Critical Thinking LGBT rights Collaboration Acting International Relations Theatrical Production Social Justice Community Engagement Project Management Event Management Social Impact Workshop Facilitation Performing Arts Workshop Development Blogging Strategy Project Planning Social Media Grassroots Fundraising Diversity & Inclusion Diversity Training Leadership Development Political Science Grants Grant Writing Human Rights International Human... Strategic Communications Equality & Diversity See 34+     See less Community Outreach Nonprofits Research Fundraising Volunteer Management Public Speaking Politics Writing Activism Leadership Grassroots Organization Program Management Event Planning Editing Grassroots Youth Development Philanthropy Strategic Planning Organizational... Public Policy Critical Thinking LGBT rights Collaboration Acting International Relations Theatrical Production Social Justice Community Engagement Project Management Event Management Social Impact Workshop Facilitation Performing Arts Workshop Development Blogging Strategy Project Planning Social Media Grassroots Fundraising Diversity & Inclusion Diversity Training Leadership Development Political Science Grants Grant Writing Human Rights International Human... Strategic Communications Equality & Diversity See 34+     See less Community Outreach Nonprofits Research Fundraising Volunteer Management Public Speaking Politics Writing Activism Leadership Grassroots Organization Program Management Event Planning Editing Grassroots Youth Development Philanthropy Strategic Planning Organizational... Public Policy Critical Thinking LGBT rights Collaboration Acting International Relations Theatrical Production Social Justice Community Engagement Project Management Event Management Social Impact Workshop Facilitation Performing Arts Workshop Development Blogging Strategy Project Planning Social Media Grassroots Fundraising Diversity & Inclusion Diversity Training Leadership Development Political Science Grants Grant Writing Human Rights International Human... Strategic Communications Equality & Diversity See 34+     See less Education Stanford University Bachelor's degree with Honors,  Political Science (concentration in Political Theory) and Drama (Acting) 2005  – 2010 Activities and Societies:  Stanford Theatre Activist Mobilization Project (STAMP) ,  Haas Center for Public Service ,  Stanford Students for Queer Liberation ,  Jewish Committee on Human Rights ,  Stanford Labor Action Coalition ,  Stanford Students for Choice ,  Students Confronting Apartheid by Israel ,  Ram's Head Theatrical Society Stanford University Bachelor's degree with Honors,  Political Science (concentration in Political Theory) and Drama (Acting) 2005  – 2010 Activities and Societies:  Stanford Theatre Activist Mobilization Project (STAMP) ,  Haas Center for Public Service ,  Stanford Students for Queer Liberation ,  Jewish Committee on Human Rights ,  Stanford Labor Action Coalition ,  Stanford Students for Choice ,  Students Confronting Apartheid by Israel ,  Ram's Head Theatrical Society Stanford University Bachelor's degree with Honors,  Political Science (concentration in Political Theory) and Drama (Acting) 2005  – 2010 Activities and Societies:  Stanford Theatre Activist Mobilization Project (STAMP) ,  Haas Center for Public Service ,  Stanford Students for Queer Liberation ,  Jewish Committee on Human Rights ,  Stanford Labor Action Coalition ,  Stanford Students for Choice ,  Students Confronting Apartheid by Israel ,  Ram's Head Theatrical Society Stanford University Bachelor's degree with Honors,  Political Science (concentration in Political Theory) and Drama (Acting) 2005  – 2010 Activities and Societies:  Stanford Theatre Activist Mobilization Project (STAMP) ,  Haas Center for Public Service ,  Stanford Students for Queer Liberation ,  Jewish Committee on Human Rights ,  Stanford Labor Action Coalition ,  Stanford Students for Choice ,  Students Confronting Apartheid by Israel ,  Ram's Head Theatrical Society Honors & Awards Robert M. Golden Medal for Excellence in Humanties and the Creative Arts Stanford University June 2010 Stanford Award of Excellence Stanford University Alumni Assoiciation June 2010 Louis Sudler Prize for Excellence in the Arts Stanford University Department of Drama June 2010 Dean's Award for Outstanding Student Organization Stanford University June 2007 For the Stanford Theatre Activist Mobilization Project Walk the Talk Award For Service Leadership Stanford University Haas Center for Public Service June 2010 President's Award for Academic Excellence June 2006 Robert M. Golden Medal for Excellence in Humanties and the Creative Arts Stanford University June 2010 Robert M. Golden Medal for Excellence in Humanties and the Creative Arts Stanford University June 2010 Robert M. Golden Medal for Excellence in Humanties and the Creative Arts Stanford University June 2010 Stanford Award of Excellence Stanford University Alumni Assoiciation June 2010 Stanford Award of Excellence Stanford University Alumni Assoiciation June 2010 Stanford Award of Excellence Stanford University Alumni Assoiciation June 2010 Louis Sudler Prize for Excellence in the Arts Stanford University Department of Drama June 2010 Louis Sudler Prize for Excellence in the Arts Stanford University Department of Drama June 2010 Louis Sudler Prize for Excellence in the Arts Stanford University Department of Drama June 2010 Dean's Award for Outstanding Student Organization Stanford University June 2007 For the Stanford Theatre Activist Mobilization Project Dean's Award for Outstanding Student Organization Stanford University June 2007 For the Stanford Theatre Activist Mobilization Project Dean's Award for Outstanding Student Organization Stanford University June 2007 For the Stanford Theatre Activist Mobilization Project Walk the Talk Award For Service Leadership Stanford University Haas Center for Public Service June 2010 Walk the Talk Award For Service Leadership Stanford University Haas Center for Public Service June 2010 Walk the Talk Award For Service Leadership Stanford University Haas Center for Public Service June 2010 President's Award for Academic Excellence June 2006 President's Award for Academic Excellence June 2006 President's Award for Academic Excellence June 2006 ", "Summary My goals include learning about new media and its affect on human interaction. I want to use my knowledge and experience to work with the law, intellectual property, and high tech public policy. I also have a passion for design, digital media, and writing. Summary My goals include learning about new media and its affect on human interaction. I want to use my knowledge and experience to work with the law, intellectual property, and high tech public policy. I also have a passion for design, digital media, and writing. My goals include learning about new media and its affect on human interaction. I want to use my knowledge and experience to work with the law, intellectual property, and high tech public policy. I also have a passion for design, digital media, and writing. My goals include learning about new media and its affect on human interaction. I want to use my knowledge and experience to work with the law, intellectual property, and high tech public policy. I also have a passion for design, digital media, and writing. Experience Summer Associate Fenwick & West May 2015  – Present (4 months) Mountain View, CA Student Harvard Law School August 2014  – Present (1 year 1 month) Digital Communications Associate Stanford University July 2013  –  June 2014  (1 year) Stanford, CA • Strategize long-term techniques to incorporate digital media into Stanford Introductory Studies’ communications plans in order to increase interaction between the academic administration and the student body \n• Manage the production and collection of multimedia from student, staff, and faculty through online platforms Program Assistant Stanford Graduate Program in Journalism January 2013  –  June 2013  (6 months) Stanford - Coordinate and craft social media posts, update Youtube site, digitally design and post flyers advertising programming and classes, and video record class on Digital Media Entrepreneurship \n- Assisted in planning and carrying out administrative duties at Journalism hosted Big Data Hackathon President Stanford News Readership Program September 2012  –  June 2013  (10 months) Stanford, CA - Work with the New York Times and Wall Street Journal to provide free newspapers at key locations on the Stanford campus.  \n- Provide access passes to digital copies of the New York Times to the student body. Editor-In-Chief The Stanford Quad Yearbook June 2012  –  June 2013  (1 year 1 month) - Determine and lead the artistic vision for the 2012-2013 yearbook \n- Review and edit written content and photography to published in the 2013 yearbook.\t \n- Managed the planning, and distribution of the 2012 and 2013 yearbook.  \n- Negotiated fair contracts with publisher. SkyDrive Ambassador Microsoft January 2013  –  April 2013  (4 months) Stanford, CA - Create multimedia presentations in order to present promote Microsoft’s cloud storage solution \n- Monitor analytics and use focus groups to understand student reception of the product Thurmond Woodard Fellow, Eben Tisdale Fellowship Dell June 2012  –  August 2012  (3 months) Washington D.C. Metro Area - Conduct research and write briefings on Congressional hearings on topics of concern to the IT community including sequestration and issues with the International Trade Commission. \n- Organize and coordinate meetings with Dell executives and members of the technology government affairs community. Social Media Intern Stanford Alumni Association November 2011  –  June 2012  (8 months) - Produced content for the SAA’s social media accounts and engaged the local community \n- Assisted in the increase in SAA followers by more than 4000 people on Facebook and 1000 followers on Twitter Resident Assistant Stanford Residential Education September 2011  –  June 2012  (10 months) Kimball Hall - Create, plan and coordinate a wide range of cultural activities for residents. \n- Liaison between residence dorm government and a student staff with 14 members. \n- Guide residents in dealing with social and academic challenges, in and out of the dorm. Marketing Director The Stanford Quad Yearbook September 2011  –  June 2012  (10 months) - Announce events and specials for the yearbook through social media.  \n- Design marketing campaigns and fliers. Consumer and Mass Business Markets Intern Verizon June 2011  –  August 2011  (3 months) - Analyze metrics by using Microsoft Excel in order to increase efficiency in technicians maintaining Verizon wired services \n- Assist regional managers in evaluating Verizon’s performance in the Potomac area \n- Future LEADers Program Research Assistant Virtual Human Interaction Lab September 2010  –  June 2011  (10 months) • Implement 3DS Max Studio and Adobe Photoshop to assist in creating virtual worlds \n• Test virtual reality experiments \n• Graphics editing with Fraps and Movavi Video Editing Software Circulation Assistant BCPL November 2007  –  December 2010  (3 years 2 months) •\tShelve books and assist with item location \n•\tManage patron accounts and address customer concerns \n•\tAssist with research and community programs Education Outreach Intern Maryland Science Center June 2010  –  July 2010  (2 months) •\tLead science presentations and activities for preschoolers at summer Head Start Camps around Baltimore City \n•\tConduct research for age appropriate material and creative projects \n•\tAssist in basic office duties (run errands, make copies, gather materials, etc.) Summer Associate Fenwick & West May 2015  – Present (4 months) Mountain View, CA Summer Associate Fenwick & West May 2015  – Present (4 months) Mountain View, CA Student Harvard Law School August 2014  – Present (1 year 1 month) Student Harvard Law School August 2014  – Present (1 year 1 month) Digital Communications Associate Stanford University July 2013  –  June 2014  (1 year) Stanford, CA • Strategize long-term techniques to incorporate digital media into Stanford Introductory Studies’ communications plans in order to increase interaction between the academic administration and the student body \n• Manage the production and collection of multimedia from student, staff, and faculty through online platforms Digital Communications Associate Stanford University July 2013  –  June 2014  (1 year) Stanford, CA • Strategize long-term techniques to incorporate digital media into Stanford Introductory Studies’ communications plans in order to increase interaction between the academic administration and the student body \n• Manage the production and collection of multimedia from student, staff, and faculty through online platforms Program Assistant Stanford Graduate Program in Journalism January 2013  –  June 2013  (6 months) Stanford - Coordinate and craft social media posts, update Youtube site, digitally design and post flyers advertising programming and classes, and video record class on Digital Media Entrepreneurship \n- Assisted in planning and carrying out administrative duties at Journalism hosted Big Data Hackathon Program Assistant Stanford Graduate Program in Journalism January 2013  –  June 2013  (6 months) Stanford - Coordinate and craft social media posts, update Youtube site, digitally design and post flyers advertising programming and classes, and video record class on Digital Media Entrepreneurship \n- Assisted in planning and carrying out administrative duties at Journalism hosted Big Data Hackathon President Stanford News Readership Program September 2012  –  June 2013  (10 months) Stanford, CA - Work with the New York Times and Wall Street Journal to provide free newspapers at key locations on the Stanford campus.  \n- Provide access passes to digital copies of the New York Times to the student body. President Stanford News Readership Program September 2012  –  June 2013  (10 months) Stanford, CA - Work with the New York Times and Wall Street Journal to provide free newspapers at key locations on the Stanford campus.  \n- Provide access passes to digital copies of the New York Times to the student body. Editor-In-Chief The Stanford Quad Yearbook June 2012  –  June 2013  (1 year 1 month) - Determine and lead the artistic vision for the 2012-2013 yearbook \n- Review and edit written content and photography to published in the 2013 yearbook.\t \n- Managed the planning, and distribution of the 2012 and 2013 yearbook.  \n- Negotiated fair contracts with publisher. Editor-In-Chief The Stanford Quad Yearbook June 2012  –  June 2013  (1 year 1 month) - Determine and lead the artistic vision for the 2012-2013 yearbook \n- Review and edit written content and photography to published in the 2013 yearbook.\t \n- Managed the planning, and distribution of the 2012 and 2013 yearbook.  \n- Negotiated fair contracts with publisher. SkyDrive Ambassador Microsoft January 2013  –  April 2013  (4 months) Stanford, CA - Create multimedia presentations in order to present promote Microsoft’s cloud storage solution \n- Monitor analytics and use focus groups to understand student reception of the product SkyDrive Ambassador Microsoft January 2013  –  April 2013  (4 months) Stanford, CA - Create multimedia presentations in order to present promote Microsoft’s cloud storage solution \n- Monitor analytics and use focus groups to understand student reception of the product Thurmond Woodard Fellow, Eben Tisdale Fellowship Dell June 2012  –  August 2012  (3 months) Washington D.C. Metro Area - Conduct research and write briefings on Congressional hearings on topics of concern to the IT community including sequestration and issues with the International Trade Commission. \n- Organize and coordinate meetings with Dell executives and members of the technology government affairs community. Thurmond Woodard Fellow, Eben Tisdale Fellowship Dell June 2012  –  August 2012  (3 months) Washington D.C. Metro Area - Conduct research and write briefings on Congressional hearings on topics of concern to the IT community including sequestration and issues with the International Trade Commission. \n- Organize and coordinate meetings with Dell executives and members of the technology government affairs community. Social Media Intern Stanford Alumni Association November 2011  –  June 2012  (8 months) - Produced content for the SAA’s social media accounts and engaged the local community \n- Assisted in the increase in SAA followers by more than 4000 people on Facebook and 1000 followers on Twitter Social Media Intern Stanford Alumni Association November 2011  –  June 2012  (8 months) - Produced content for the SAA’s social media accounts and engaged the local community \n- Assisted in the increase in SAA followers by more than 4000 people on Facebook and 1000 followers on Twitter Resident Assistant Stanford Residential Education September 2011  –  June 2012  (10 months) Kimball Hall - Create, plan and coordinate a wide range of cultural activities for residents. \n- Liaison between residence dorm government and a student staff with 14 members. \n- Guide residents in dealing with social and academic challenges, in and out of the dorm. Resident Assistant Stanford Residential Education September 2011  –  June 2012  (10 months) Kimball Hall - Create, plan and coordinate a wide range of cultural activities for residents. \n- Liaison between residence dorm government and a student staff with 14 members. \n- Guide residents in dealing with social and academic challenges, in and out of the dorm. Marketing Director The Stanford Quad Yearbook September 2011  –  June 2012  (10 months) - Announce events and specials for the yearbook through social media.  \n- Design marketing campaigns and fliers. Marketing Director The Stanford Quad Yearbook September 2011  –  June 2012  (10 months) - Announce events and specials for the yearbook through social media.  \n- Design marketing campaigns and fliers. Consumer and Mass Business Markets Intern Verizon June 2011  –  August 2011  (3 months) - Analyze metrics by using Microsoft Excel in order to increase efficiency in technicians maintaining Verizon wired services \n- Assist regional managers in evaluating Verizon’s performance in the Potomac area \n- Future LEADers Program Consumer and Mass Business Markets Intern Verizon June 2011  –  August 2011  (3 months) - Analyze metrics by using Microsoft Excel in order to increase efficiency in technicians maintaining Verizon wired services \n- Assist regional managers in evaluating Verizon’s performance in the Potomac area \n- Future LEADers Program Research Assistant Virtual Human Interaction Lab September 2010  –  June 2011  (10 months) • Implement 3DS Max Studio and Adobe Photoshop to assist in creating virtual worlds \n• Test virtual reality experiments \n• Graphics editing with Fraps and Movavi Video Editing Software Research Assistant Virtual Human Interaction Lab September 2010  –  June 2011  (10 months) • Implement 3DS Max Studio and Adobe Photoshop to assist in creating virtual worlds \n• Test virtual reality experiments \n• Graphics editing with Fraps and Movavi Video Editing Software Circulation Assistant BCPL November 2007  –  December 2010  (3 years 2 months) •\tShelve books and assist with item location \n•\tManage patron accounts and address customer concerns \n•\tAssist with research and community programs Circulation Assistant BCPL November 2007  –  December 2010  (3 years 2 months) •\tShelve books and assist with item location \n•\tManage patron accounts and address customer concerns \n•\tAssist with research and community programs Education Outreach Intern Maryland Science Center June 2010  –  July 2010  (2 months) •\tLead science presentations and activities for preschoolers at summer Head Start Camps around Baltimore City \n•\tConduct research for age appropriate material and creative projects \n•\tAssist in basic office duties (run errands, make copies, gather materials, etc.) Education Outreach Intern Maryland Science Center June 2010  –  July 2010  (2 months) •\tLead science presentations and activities for preschoolers at summer Head Start Camps around Baltimore City \n•\tConduct research for age appropriate material and creative projects \n•\tAssist in basic office duties (run errands, make copies, gather materials, etc.) Languages French French French Skills Social Media Photoshop Writing Research Event Planning Database Management Wordpress Copy Editing Policy Research WordPress Digital Media Journalism Marketing Creative Writing Entrepreneurship Skills  Social Media Photoshop Writing Research Event Planning Database Management Wordpress Copy Editing Policy Research WordPress Digital Media Journalism Marketing Creative Writing Entrepreneurship Social Media Photoshop Writing Research Event Planning Database Management Wordpress Copy Editing Policy Research WordPress Digital Media Journalism Marketing Creative Writing Entrepreneurship Social Media Photoshop Writing Research Event Planning Database Management Wordpress Copy Editing Policy Research WordPress Digital Media Journalism Marketing Creative Writing Entrepreneurship Education Harvard Law School Juris Doctor (J.D.) 2014  – 2017 Stanford University B.A.,  Communication 2009  – 2013 Coursework includes: \n• Technology Policy \n• Science, Innovation and Law \n•\tMedia, Culture and Society\t \n•\tProgramming Methodology \n•\tVirtual Communities and Social Media \n• Research Methods and Designs Activities and Societies:  Phi Beta Kappa ,  Cap and Gown Women's Honor Society ,  Minor in Science ,  Technology and Society Oxford University Oxford Internet Institute 2012  – 2012 Activities and Societies:  Tutorial on the Social and Political Implications of the Internet Dulaney High School 2005  – 2009 AP Scholar Activities and Societies:  Copy Editor of School Newspaper ,  Co-Editor-in-Chief of Literary Arts Magazine ,  National Honor Society ,  National Arts Honor Society Harvard Law School Juris Doctor (J.D.) 2014  – 2017 Harvard Law School Juris Doctor (J.D.) 2014  – 2017 Harvard Law School Juris Doctor (J.D.) 2014  – 2017 Stanford University B.A.,  Communication 2009  – 2013 Coursework includes: \n• Technology Policy \n• Science, Innovation and Law \n•\tMedia, Culture and Society\t \n•\tProgramming Methodology \n•\tVirtual Communities and Social Media \n• Research Methods and Designs Activities and Societies:  Phi Beta Kappa ,  Cap and Gown Women's Honor Society ,  Minor in Science ,  Technology and Society Stanford University B.A.,  Communication 2009  – 2013 Coursework includes: \n• Technology Policy \n• Science, Innovation and Law \n•\tMedia, Culture and Society\t \n•\tProgramming Methodology \n•\tVirtual Communities and Social Media \n• Research Methods and Designs Activities and Societies:  Phi Beta Kappa ,  Cap and Gown Women's Honor Society ,  Minor in Science ,  Technology and Society Stanford University B.A.,  Communication 2009  – 2013 Coursework includes: \n• Technology Policy \n• Science, Innovation and Law \n•\tMedia, Culture and Society\t \n•\tProgramming Methodology \n•\tVirtual Communities and Social Media \n• Research Methods and Designs Activities and Societies:  Phi Beta Kappa ,  Cap and Gown Women's Honor Society ,  Minor in Science ,  Technology and Society Oxford University Oxford Internet Institute 2012  – 2012 Activities and Societies:  Tutorial on the Social and Political Implications of the Internet Oxford University Oxford Internet Institute 2012  – 2012 Activities and Societies:  Tutorial on the Social and Political Implications of the Internet Oxford University Oxford Internet Institute 2012  – 2012 Activities and Societies:  Tutorial on the Social and Political Implications of the Internet Dulaney High School 2005  – 2009 AP Scholar Activities and Societies:  Copy Editor of School Newspaper ,  Co-Editor-in-Chief of Literary Arts Magazine ,  National Honor Society ,  National Arts Honor Society Dulaney High School 2005  – 2009 AP Scholar Activities and Societies:  Copy Editor of School Newspaper ,  Co-Editor-in-Chief of Literary Arts Magazine ,  National Honor Society ,  National Arts Honor Society Dulaney High School 2005  – 2009 AP Scholar Activities and Societies:  Copy Editor of School Newspaper ,  Co-Editor-in-Chief of Literary Arts Magazine ,  National Honor Society ,  National Arts Honor Society Honors & Awards Phi Beta Kappa Honor Society May 2013 Mary and Jacquelyn Edmonds Prize for Outstanding Academic Promise in Communication May 2013 Stanford Award of Excellence May 2013 Stanford Cap and Gown Women's Honor Society May 2013 Additional Honors & Awards Dean's Award for Academic Excellence: Exceptional Academic Achievement - BCSC \nNational Achievement Scholar  \nAP Scholar Phi Beta Kappa Honor Society May 2013 Phi Beta Kappa Honor Society May 2013 Phi Beta Kappa Honor Society May 2013 Mary and Jacquelyn Edmonds Prize for Outstanding Academic Promise in Communication May 2013 Mary and Jacquelyn Edmonds Prize for Outstanding Academic Promise in Communication May 2013 Mary and Jacquelyn Edmonds Prize for Outstanding Academic Promise in Communication May 2013 Stanford Award of Excellence May 2013 Stanford Award of Excellence May 2013 Stanford Award of Excellence May 2013 Stanford Cap and Gown Women's Honor Society May 2013 Stanford Cap and Gown Women's Honor Society May 2013 Stanford Cap and Gown Women's Honor Society May 2013 Additional Honors & Awards Dean's Award for Academic Excellence: Exceptional Academic Achievement - BCSC \nNational Achievement Scholar  \nAP Scholar Additional Honors & Awards Dean's Award for Academic Excellence: Exceptional Academic Achievement - BCSC \nNational Achievement Scholar  \nAP Scholar Additional Honors & Awards Dean's Award for Academic Excellence: Exceptional Academic Achievement - BCSC \nNational Achievement Scholar  \nAP Scholar ", "Summary Relocating to New York City and looking for new opportunities as a customer-focused Product Manager who will be deeply involved in user research to uncover unmet customer needs and new product opportunities. \n \nI am product manager who strongly empathizes with the user while realizing the business goals and objectives. I love working closely and collaborating with engineering and design/UX teams to deliver products that fulfill user needs and are not only usable, but useful. \n \nSpecialties: Product management, consumer subscription services, consumer websites, eCommerce, web metrics, agile product development, usability testing, user interviews, UX research, user research, data acquisition. Summary Relocating to New York City and looking for new opportunities as a customer-focused Product Manager who will be deeply involved in user research to uncover unmet customer needs and new product opportunities. \n \nI am product manager who strongly empathizes with the user while realizing the business goals and objectives. I love working closely and collaborating with engineering and design/UX teams to deliver products that fulfill user needs and are not only usable, but useful. \n \nSpecialties: Product management, consumer subscription services, consumer websites, eCommerce, web metrics, agile product development, usability testing, user interviews, UX research, user research, data acquisition. Relocating to New York City and looking for new opportunities as a customer-focused Product Manager who will be deeply involved in user research to uncover unmet customer needs and new product opportunities. \n \nI am product manager who strongly empathizes with the user while realizing the business goals and objectives. I love working closely and collaborating with engineering and design/UX teams to deliver products that fulfill user needs and are not only usable, but useful. \n \nSpecialties: Product management, consumer subscription services, consumer websites, eCommerce, web metrics, agile product development, usability testing, user interviews, UX research, user research, data acquisition. Relocating to New York City and looking for new opportunities as a customer-focused Product Manager who will be deeply involved in user research to uncover unmet customer needs and new product opportunities. \n \nI am product manager who strongly empathizes with the user while realizing the business goals and objectives. I love working closely and collaborating with engineering and design/UX teams to deliver products that fulfill user needs and are not only usable, but useful. \n \nSpecialties: Product management, consumer subscription services, consumer websites, eCommerce, web metrics, agile product development, usability testing, user interviews, UX research, user research, data acquisition. Experience User Experience Researcher Reonomy May 2015  – Present (4 months) Greater New York City Area Product Manager Ancestry.com January 2014  –  May 2015  (1 year 5 months) San Francisco Bay Area Responsible for leading the member area launch of Archives.com in international markets, as well as the replatform and redesign of our US site. Pioneering user research initiatives and monitoring metrics to uncover unmet customer needs, acting as user advocate. Additionally, partnering with UX and engineering to develop new product opportunities using design thinking principles and methodologies. \nEvangelized and implemented project-tracking practices, enabling the team to launch on schedule. Associate Product Manager Ancestry.com August 2012  –  January 2014  (1 year 6 months) San Francisco Bay Area Worked with the product team to build the roadmap for search as well as write and prioritize user stories based on customer feedback and user testing. A/B tested product features to drive engagement and retention on the site and assisted in the analyzation of tests. Wrote detailed specifications and requirements for the engineering and design/UX teams. Participated in user tests and distilled results down into user stories. Content Acquisition Specialist Inflection November 2010  –  August 2012  (1 year 10 months) San Francisco Bay Area • Initiated and developed relationships and partnerships with libraries, archives, and vital records offices \n• Acquired genealogical records and images to make available on Archives.com through said relationships and partnerships \n• Managed content pipeline end-to-end, ensuring rapid content publication \n• Developed specifications for and collaborated with the engineering team to make records and images available on the site and usable to customers \n• Collaborated with the product team to make new content types available on the site \n• Established requirements for digitization and indexing of content and managed such projects with vendors Marketing and Communications Associate Stanford University - CLOCKSS September 2010  –  November 2010  (3 months) • Recruited and managed new publisher and library participants and partners \n• Supported Executive Committee with interview and hiring process of new Executive Director Community Manager Crave September 2010  –  November 2010  (3 months) •\tCreated and maintained Facebook page for Crave Transformers; write weekly newsletters and blog posts. \n•\tLed and managed identification and recruitment of individuals to sell collections on crave.com. \n•\tManaged acquisitions campaigns such as contests and community outreach; make data corrections to catalog. User Experience and Program Development Intern The Internet Archive June 2010  –  August 2010  (3 months) • Led and managed remote user experience tests and research for the 3.5 release of Archive-It web application \n• Designed and conducted surveys, heuristic evaluations, interviews, user focus groups, and usability tests \n• Analyzed qualitative and quantitative data resulting from above methods \n• Managed marketing projects for Archive-It and the K-12 Web Archiving Program \n• Created and maintained Facebook profile for Archive-It \n• Managed development of the K-12 Web Archiving Program Research Assistant University of Michigan School of Information September 2009  –  June 2010  (10 months) • Assisted in management of $675,000 grant proposal project to explore ways to conduct quality assurance on the millions of digitized books preserved in HathiTrust \n• Researched expectations users place on the quality and usefulness of e-books, focusing on user complaints \n• Created and maintained a wiki that held the documents that supported the research team’s work \n• Coordinated and oversaw all administrative tasks \n• Provided logistical support for travel, planning meetings, video- and tele-conferences, etc. Digital Preservation Intern University of Michigan Law Library January 2010  –  April 2010  (4 months) • Created a detailed timeline for my project and remained on schedule throughout its duration. \n• Researched issues of scanning equipment, scanning standards, software for image manipulation, metadata, online storage and access, and preservation of digital images. \n• Prepared a recommendation detailing specifications, equipment, staffing, training, and cost to establish an in-house scanning unit capable of digitizing the Law Library’s materials.  \n• Created guidelines for establishing a Digital Projects Unit within the Library. \n• Presented my recommendations orally and in writing to the Library’s Technical Services Committee. Reference and Cataloging Assistant University of Michigan Hatcher Graduate Library - Map Library January 2009  –  January 2010  (1 year 1 month) • Assisted patrons with reference questions related to class projects, lesson plans, and general interests. \n• Utilized the online library catalog program Mirlyn to find maps, atlases, and books for patrons. \n• Implemented changes to catalog records and create new records using Aleph cataloging software. \n• Prepared newly acquired books and atlases to be sent to the labeling division. \n• Assisted librarians with acquisitions and disposition decisions. Web Development Intern University of Michigan Public Services June 2009  –  August 2009  (3 months) • Created Drupal content types for the online exhibits, their exhibit displays, and the items they contain. \n• Designed new exhibits pages in collaboration with UM Library’s web team and communications specialist. \n• Used new content types to migrate the content of online exhibits to the beta version of UM Library’s website. \n• Increased access to and usability of online Special Collections exhibits for users. User Experience Researcher Reonomy May 2015  – Present (4 months) Greater New York City Area User Experience Researcher Reonomy May 2015  – Present (4 months) Greater New York City Area Product Manager Ancestry.com January 2014  –  May 2015  (1 year 5 months) San Francisco Bay Area Responsible for leading the member area launch of Archives.com in international markets, as well as the replatform and redesign of our US site. Pioneering user research initiatives and monitoring metrics to uncover unmet customer needs, acting as user advocate. Additionally, partnering with UX and engineering to develop new product opportunities using design thinking principles and methodologies. \nEvangelized and implemented project-tracking practices, enabling the team to launch on schedule. Product Manager Ancestry.com January 2014  –  May 2015  (1 year 5 months) San Francisco Bay Area Responsible for leading the member area launch of Archives.com in international markets, as well as the replatform and redesign of our US site. Pioneering user research initiatives and monitoring metrics to uncover unmet customer needs, acting as user advocate. Additionally, partnering with UX and engineering to develop new product opportunities using design thinking principles and methodologies. \nEvangelized and implemented project-tracking practices, enabling the team to launch on schedule. Associate Product Manager Ancestry.com August 2012  –  January 2014  (1 year 6 months) San Francisco Bay Area Worked with the product team to build the roadmap for search as well as write and prioritize user stories based on customer feedback and user testing. A/B tested product features to drive engagement and retention on the site and assisted in the analyzation of tests. Wrote detailed specifications and requirements for the engineering and design/UX teams. Participated in user tests and distilled results down into user stories. Associate Product Manager Ancestry.com August 2012  –  January 2014  (1 year 6 months) San Francisco Bay Area Worked with the product team to build the roadmap for search as well as write and prioritize user stories based on customer feedback and user testing. A/B tested product features to drive engagement and retention on the site and assisted in the analyzation of tests. Wrote detailed specifications and requirements for the engineering and design/UX teams. Participated in user tests and distilled results down into user stories. Content Acquisition Specialist Inflection November 2010  –  August 2012  (1 year 10 months) San Francisco Bay Area • Initiated and developed relationships and partnerships with libraries, archives, and vital records offices \n• Acquired genealogical records and images to make available on Archives.com through said relationships and partnerships \n• Managed content pipeline end-to-end, ensuring rapid content publication \n• Developed specifications for and collaborated with the engineering team to make records and images available on the site and usable to customers \n• Collaborated with the product team to make new content types available on the site \n• Established requirements for digitization and indexing of content and managed such projects with vendors Content Acquisition Specialist Inflection November 2010  –  August 2012  (1 year 10 months) San Francisco Bay Area • Initiated and developed relationships and partnerships with libraries, archives, and vital records offices \n• Acquired genealogical records and images to make available on Archives.com through said relationships and partnerships \n• Managed content pipeline end-to-end, ensuring rapid content publication \n• Developed specifications for and collaborated with the engineering team to make records and images available on the site and usable to customers \n• Collaborated with the product team to make new content types available on the site \n• Established requirements for digitization and indexing of content and managed such projects with vendors Marketing and Communications Associate Stanford University - CLOCKSS September 2010  –  November 2010  (3 months) • Recruited and managed new publisher and library participants and partners \n• Supported Executive Committee with interview and hiring process of new Executive Director Marketing and Communications Associate Stanford University - CLOCKSS September 2010  –  November 2010  (3 months) • Recruited and managed new publisher and library participants and partners \n• Supported Executive Committee with interview and hiring process of new Executive Director Community Manager Crave September 2010  –  November 2010  (3 months) •\tCreated and maintained Facebook page for Crave Transformers; write weekly newsletters and blog posts. \n•\tLed and managed identification and recruitment of individuals to sell collections on crave.com. \n•\tManaged acquisitions campaigns such as contests and community outreach; make data corrections to catalog. Community Manager Crave September 2010  –  November 2010  (3 months) •\tCreated and maintained Facebook page for Crave Transformers; write weekly newsletters and blog posts. \n•\tLed and managed identification and recruitment of individuals to sell collections on crave.com. \n•\tManaged acquisitions campaigns such as contests and community outreach; make data corrections to catalog. User Experience and Program Development Intern The Internet Archive June 2010  –  August 2010  (3 months) • Led and managed remote user experience tests and research for the 3.5 release of Archive-It web application \n• Designed and conducted surveys, heuristic evaluations, interviews, user focus groups, and usability tests \n• Analyzed qualitative and quantitative data resulting from above methods \n• Managed marketing projects for Archive-It and the K-12 Web Archiving Program \n• Created and maintained Facebook profile for Archive-It \n• Managed development of the K-12 Web Archiving Program User Experience and Program Development Intern The Internet Archive June 2010  –  August 2010  (3 months) • Led and managed remote user experience tests and research for the 3.5 release of Archive-It web application \n• Designed and conducted surveys, heuristic evaluations, interviews, user focus groups, and usability tests \n• Analyzed qualitative and quantitative data resulting from above methods \n• Managed marketing projects for Archive-It and the K-12 Web Archiving Program \n• Created and maintained Facebook profile for Archive-It \n• Managed development of the K-12 Web Archiving Program Research Assistant University of Michigan School of Information September 2009  –  June 2010  (10 months) • Assisted in management of $675,000 grant proposal project to explore ways to conduct quality assurance on the millions of digitized books preserved in HathiTrust \n• Researched expectations users place on the quality and usefulness of e-books, focusing on user complaints \n• Created and maintained a wiki that held the documents that supported the research team’s work \n• Coordinated and oversaw all administrative tasks \n• Provided logistical support for travel, planning meetings, video- and tele-conferences, etc. Research Assistant University of Michigan School of Information September 2009  –  June 2010  (10 months) • Assisted in management of $675,000 grant proposal project to explore ways to conduct quality assurance on the millions of digitized books preserved in HathiTrust \n• Researched expectations users place on the quality and usefulness of e-books, focusing on user complaints \n• Created and maintained a wiki that held the documents that supported the research team’s work \n• Coordinated and oversaw all administrative tasks \n• Provided logistical support for travel, planning meetings, video- and tele-conferences, etc. Digital Preservation Intern University of Michigan Law Library January 2010  –  April 2010  (4 months) • Created a detailed timeline for my project and remained on schedule throughout its duration. \n• Researched issues of scanning equipment, scanning standards, software for image manipulation, metadata, online storage and access, and preservation of digital images. \n• Prepared a recommendation detailing specifications, equipment, staffing, training, and cost to establish an in-house scanning unit capable of digitizing the Law Library’s materials.  \n• Created guidelines for establishing a Digital Projects Unit within the Library. \n• Presented my recommendations orally and in writing to the Library’s Technical Services Committee. Digital Preservation Intern University of Michigan Law Library January 2010  –  April 2010  (4 months) • Created a detailed timeline for my project and remained on schedule throughout its duration. \n• Researched issues of scanning equipment, scanning standards, software for image manipulation, metadata, online storage and access, and preservation of digital images. \n• Prepared a recommendation detailing specifications, equipment, staffing, training, and cost to establish an in-house scanning unit capable of digitizing the Law Library’s materials.  \n• Created guidelines for establishing a Digital Projects Unit within the Library. \n• Presented my recommendations orally and in writing to the Library’s Technical Services Committee. Reference and Cataloging Assistant University of Michigan Hatcher Graduate Library - Map Library January 2009  –  January 2010  (1 year 1 month) • Assisted patrons with reference questions related to class projects, lesson plans, and general interests. \n• Utilized the online library catalog program Mirlyn to find maps, atlases, and books for patrons. \n• Implemented changes to catalog records and create new records using Aleph cataloging software. \n• Prepared newly acquired books and atlases to be sent to the labeling division. \n• Assisted librarians with acquisitions and disposition decisions. Reference and Cataloging Assistant University of Michigan Hatcher Graduate Library - Map Library January 2009  –  January 2010  (1 year 1 month) • Assisted patrons with reference questions related to class projects, lesson plans, and general interests. \n• Utilized the online library catalog program Mirlyn to find maps, atlases, and books for patrons. \n• Implemented changes to catalog records and create new records using Aleph cataloging software. \n• Prepared newly acquired books and atlases to be sent to the labeling division. \n• Assisted librarians with acquisitions and disposition decisions. Web Development Intern University of Michigan Public Services June 2009  –  August 2009  (3 months) • Created Drupal content types for the online exhibits, their exhibit displays, and the items they contain. \n• Designed new exhibits pages in collaboration with UM Library’s web team and communications specialist. \n• Used new content types to migrate the content of online exhibits to the beta version of UM Library’s website. \n• Increased access to and usability of online Special Collections exhibits for users. Web Development Intern University of Michigan Public Services June 2009  –  August 2009  (3 months) • Created Drupal content types for the online exhibits, their exhibit displays, and the items they contain. \n• Designed new exhibits pages in collaboration with UM Library’s web team and communications specialist. \n• Used new content types to migrate the content of online exhibits to the beta version of UM Library’s website. \n• Increased access to and usability of online Special Collections exhibits for users. Skills Metadata Research Digital Preservation Usability Testing User Experience Qualitative Research Usability Blogging Library Archives User Research Sprint Planning Project Management Product Management Agile Methodologies E-commerce See 1+     See less Skills  Metadata Research Digital Preservation Usability Testing User Experience Qualitative Research Usability Blogging Library Archives User Research Sprint Planning Project Management Product Management Agile Methodologies E-commerce See 1+     See less Metadata Research Digital Preservation Usability Testing User Experience Qualitative Research Usability Blogging Library Archives User Research Sprint Planning Project Management Product Management Agile Methodologies E-commerce See 1+     See less Metadata Research Digital Preservation Usability Testing User Experience Qualitative Research Usability Blogging Library Archives User Research Sprint Planning Project Management Product Management Agile Methodologies E-commerce See 1+     See less Education University of Michigan - School of Information MS,  Information Science 2008  – 2010 Webmaster, Society of American Archivists, 2009-2010 Activities and Societies:  Society of American Archivists ,  University of Michigan Student Chapter The College of Wooster BA,  History 2004  – 2008 Captain of Cross Country and Track Teams, 2007-2008 Activities and Societies:  Phi Alpha Theta ,  Varsity Track and Cross Country University of Michigan - School of Information MS,  Information Science 2008  – 2010 Webmaster, Society of American Archivists, 2009-2010 Activities and Societies:  Society of American Archivists ,  University of Michigan Student Chapter University of Michigan - School of Information MS,  Information Science 2008  – 2010 Webmaster, Society of American Archivists, 2009-2010 Activities and Societies:  Society of American Archivists ,  University of Michigan Student Chapter University of Michigan - School of Information MS,  Information Science 2008  – 2010 Webmaster, Society of American Archivists, 2009-2010 Activities and Societies:  Society of American Archivists ,  University of Michigan Student Chapter The College of Wooster BA,  History 2004  – 2008 Captain of Cross Country and Track Teams, 2007-2008 Activities and Societies:  Phi Alpha Theta ,  Varsity Track and Cross Country The College of Wooster BA,  History 2004  – 2008 Captain of Cross Country and Track Teams, 2007-2008 Activities and Societies:  Phi Alpha Theta ,  Varsity Track and Cross Country The College of Wooster BA,  History 2004  – 2008 Captain of Cross Country and Track Teams, 2007-2008 Activities and Societies:  Phi Alpha Theta ,  Varsity Track and Cross Country ", "Experience Insight Development Associate, Writer Sustainable Brands February 2015  – Present (7 months) San Francisco Bay Area I help develop the program content for upcoming Sustainable Brands conferences by staying abreast of cutting-edge corporate sustainability topics, vetting potential speakers, and writing creative copy to engage our audiences. I also pitch story ideas for the SB news site, contribute original articles and interviews with leaders in sustainable business, and assist the Managing Editor in writing daily news. Research Analyst The Nature Conservancy January 2014  –  January 2015  (1 year 1 month) San Francisco, CA • Co-authored publication to standardize measures of corporate environmental dependence using ecosystem services with TNC's Chief Scientist  \n \n• Conducted literature reviews on the growth of private sector sustainable investing, the use of ecosystem services in due diligence practices, and the state of consumer demand for 'green' products \n \n• Analyzed the content of corporate environmental data disclosures and executives' statements on sustainable business Strategy Consultant Gordon and Betty Moore Foundation 2013  –  2014  (1 year) Palo Alto, CA • Secured $1million in startup funding over 7 months for the “Earth Genome Project”, an effort to integrate global ecosystem data and modeling tools into open-source, curated platforms. \n \n• Administered internal and external project communications, including project FAQs, meeting summaries, and presentations to partners from government agencies, business, and academia.  \n \n• Contributed to project strategic vision with research and analysis of initial clients' data needs and high-risk decision contexts. Science Communications Associate Stanford University 2012  –  2014  (2 years) Stanford, California • Assisted in developing content for print, digital, and social media promoting the scientific research of The Natural Capital Project, a partnership among Stanford University, World Wildlife Fund, The Nature Conservancy, and University of Minnesota. \n \n• Edited technical documentation for two users' guides and drafted online project descriptions to market \"InVEST\", an ecology modeling software. Worked closely with scientists, software engineers, and GIS analysts to draft academic reports and journal articles, and to design scientific posters. \n \n• Managed the public release of a new software tool and coordinated event launch in Washington, DC. I led the design of digital marketing materials, research posters, and event signage. \n \n• Maintained organization website using Adobe CS6 and HTML/CSS. Analyzed and drove site traffic with SEO best practices, and designed new pages to more effectively market 17 individual \"InVEST\" models. Broadcast Production Assistant, Climate One The Commonwealth Club of California July 2011  –  2012  (1 year) San Francisco, CA • Designed and implemented strategic online marketing plan for public affairs forum covering energy, the environment, and the economy. Assisted with topical research, program planning and copywriting.  \n \n• Engaged audience through original articles and discussion of environmental topics on social media platforms.  \n \n• Maintained website content and press coverage with Drupal. Program Associate Intern Impact Carbon February 2011  –  June 2011  (5 months) San Francisco, CA • Provided programmatic and communications support for Impact Carbon's international carbon offset projects. Supervised the organization's application to the Gold Standard Foundation, an international certifier of carbon credits. \n \n• Performed statistical analysis of fuel-use data collected from household surveys for Ugandan clean cookstoves project.  \n \n• Conducted user survey of organizations' subsidiary website, forged relationships with interested partners, and synthesized feedback into recommendations. Presented SEO best practices and developed strategic recommendations for site revisions. Communications Assistant, Swearer Center for Public Service Brown University June 2010  –  November 2010  (6 months) Providence, Rhode Island Area • Developed creative e-newsletters and edited copy for online news items. Coordinated publication of print communications and advertising materials for student events and workshops. \n \n• Managed the revision of orientation booklet describing Providence communities and history, distributed annually to Brown students Insight Development Associate, Writer Sustainable Brands February 2015  – Present (7 months) San Francisco Bay Area I help develop the program content for upcoming Sustainable Brands conferences by staying abreast of cutting-edge corporate sustainability topics, vetting potential speakers, and writing creative copy to engage our audiences. I also pitch story ideas for the SB news site, contribute original articles and interviews with leaders in sustainable business, and assist the Managing Editor in writing daily news. Insight Development Associate, Writer Sustainable Brands February 2015  – Present (7 months) San Francisco Bay Area I help develop the program content for upcoming Sustainable Brands conferences by staying abreast of cutting-edge corporate sustainability topics, vetting potential speakers, and writing creative copy to engage our audiences. I also pitch story ideas for the SB news site, contribute original articles and interviews with leaders in sustainable business, and assist the Managing Editor in writing daily news. Research Analyst The Nature Conservancy January 2014  –  January 2015  (1 year 1 month) San Francisco, CA • Co-authored publication to standardize measures of corporate environmental dependence using ecosystem services with TNC's Chief Scientist  \n \n• Conducted literature reviews on the growth of private sector sustainable investing, the use of ecosystem services in due diligence practices, and the state of consumer demand for 'green' products \n \n• Analyzed the content of corporate environmental data disclosures and executives' statements on sustainable business Research Analyst The Nature Conservancy January 2014  –  January 2015  (1 year 1 month) San Francisco, CA • Co-authored publication to standardize measures of corporate environmental dependence using ecosystem services with TNC's Chief Scientist  \n \n• Conducted literature reviews on the growth of private sector sustainable investing, the use of ecosystem services in due diligence practices, and the state of consumer demand for 'green' products \n \n• Analyzed the content of corporate environmental data disclosures and executives' statements on sustainable business Strategy Consultant Gordon and Betty Moore Foundation 2013  –  2014  (1 year) Palo Alto, CA • Secured $1million in startup funding over 7 months for the “Earth Genome Project”, an effort to integrate global ecosystem data and modeling tools into open-source, curated platforms. \n \n• Administered internal and external project communications, including project FAQs, meeting summaries, and presentations to partners from government agencies, business, and academia.  \n \n• Contributed to project strategic vision with research and analysis of initial clients' data needs and high-risk decision contexts. Strategy Consultant Gordon and Betty Moore Foundation 2013  –  2014  (1 year) Palo Alto, CA • Secured $1million in startup funding over 7 months for the “Earth Genome Project”, an effort to integrate global ecosystem data and modeling tools into open-source, curated platforms. \n \n• Administered internal and external project communications, including project FAQs, meeting summaries, and presentations to partners from government agencies, business, and academia.  \n \n• Contributed to project strategic vision with research and analysis of initial clients' data needs and high-risk decision contexts. Science Communications Associate Stanford University 2012  –  2014  (2 years) Stanford, California • Assisted in developing content for print, digital, and social media promoting the scientific research of The Natural Capital Project, a partnership among Stanford University, World Wildlife Fund, The Nature Conservancy, and University of Minnesota. \n \n• Edited technical documentation for two users' guides and drafted online project descriptions to market \"InVEST\", an ecology modeling software. Worked closely with scientists, software engineers, and GIS analysts to draft academic reports and journal articles, and to design scientific posters. \n \n• Managed the public release of a new software tool and coordinated event launch in Washington, DC. I led the design of digital marketing materials, research posters, and event signage. \n \n• Maintained organization website using Adobe CS6 and HTML/CSS. Analyzed and drove site traffic with SEO best practices, and designed new pages to more effectively market 17 individual \"InVEST\" models. Science Communications Associate Stanford University 2012  –  2014  (2 years) Stanford, California • Assisted in developing content for print, digital, and social media promoting the scientific research of The Natural Capital Project, a partnership among Stanford University, World Wildlife Fund, The Nature Conservancy, and University of Minnesota. \n \n• Edited technical documentation for two users' guides and drafted online project descriptions to market \"InVEST\", an ecology modeling software. Worked closely with scientists, software engineers, and GIS analysts to draft academic reports and journal articles, and to design scientific posters. \n \n• Managed the public release of a new software tool and coordinated event launch in Washington, DC. I led the design of digital marketing materials, research posters, and event signage. \n \n• Maintained organization website using Adobe CS6 and HTML/CSS. Analyzed and drove site traffic with SEO best practices, and designed new pages to more effectively market 17 individual \"InVEST\" models. Broadcast Production Assistant, Climate One The Commonwealth Club of California July 2011  –  2012  (1 year) San Francisco, CA • Designed and implemented strategic online marketing plan for public affairs forum covering energy, the environment, and the economy. Assisted with topical research, program planning and copywriting.  \n \n• Engaged audience through original articles and discussion of environmental topics on social media platforms.  \n \n• Maintained website content and press coverage with Drupal. Broadcast Production Assistant, Climate One The Commonwealth Club of California July 2011  –  2012  (1 year) San Francisco, CA • Designed and implemented strategic online marketing plan for public affairs forum covering energy, the environment, and the economy. Assisted with topical research, program planning and copywriting.  \n \n• Engaged audience through original articles and discussion of environmental topics on social media platforms.  \n \n• Maintained website content and press coverage with Drupal. Program Associate Intern Impact Carbon February 2011  –  June 2011  (5 months) San Francisco, CA • Provided programmatic and communications support for Impact Carbon's international carbon offset projects. Supervised the organization's application to the Gold Standard Foundation, an international certifier of carbon credits. \n \n• Performed statistical analysis of fuel-use data collected from household surveys for Ugandan clean cookstoves project.  \n \n• Conducted user survey of organizations' subsidiary website, forged relationships with interested partners, and synthesized feedback into recommendations. Presented SEO best practices and developed strategic recommendations for site revisions. Program Associate Intern Impact Carbon February 2011  –  June 2011  (5 months) San Francisco, CA • Provided programmatic and communications support for Impact Carbon's international carbon offset projects. Supervised the organization's application to the Gold Standard Foundation, an international certifier of carbon credits. \n \n• Performed statistical analysis of fuel-use data collected from household surveys for Ugandan clean cookstoves project.  \n \n• Conducted user survey of organizations' subsidiary website, forged relationships with interested partners, and synthesized feedback into recommendations. Presented SEO best practices and developed strategic recommendations for site revisions. Communications Assistant, Swearer Center for Public Service Brown University June 2010  –  November 2010  (6 months) Providence, Rhode Island Area • Developed creative e-newsletters and edited copy for online news items. Coordinated publication of print communications and advertising materials for student events and workshops. \n \n• Managed the revision of orientation booklet describing Providence communities and history, distributed annually to Brown students Communications Assistant, Swearer Center for Public Service Brown University June 2010  –  November 2010  (6 months) Providence, Rhode Island Area • Developed creative e-newsletters and edited copy for online news items. Coordinated publication of print communications and advertising materials for student events and workshops. \n \n• Managed the revision of orientation booklet describing Providence communities and history, distributed annually to Brown students Languages English Arabic French English Arabic French English Arabic French Skills Strategic Communications Qualitative Research Editing Science Communication Adobe Creative Suite Writing Technical Writing Project Management CMS Statistical Data... Management Consulting Sustainable Business Sociology Conservation Issues Ecosystem Management Brand Development AP Style Social Media Marketing Communications Digital Media Visual Communication Social Impact See 7+     See less Skills  Strategic Communications Qualitative Research Editing Science Communication Adobe Creative Suite Writing Technical Writing Project Management CMS Statistical Data... Management Consulting Sustainable Business Sociology Conservation Issues Ecosystem Management Brand Development AP Style Social Media Marketing Communications Digital Media Visual Communication Social Impact See 7+     See less Strategic Communications Qualitative Research Editing Science Communication Adobe Creative Suite Writing Technical Writing Project Management CMS Statistical Data... Management Consulting Sustainable Business Sociology Conservation Issues Ecosystem Management Brand Development AP Style Social Media Marketing Communications Digital Media Visual Communication Social Impact See 7+     See less Strategic Communications Qualitative Research Editing Science Communication Adobe Creative Suite Writing Technical Writing Project Management CMS Statistical Data... Management Consulting Sustainable Business Sociology Conservation Issues Ecosystem Management Brand Development AP Style Social Media Marketing Communications Digital Media Visual Communication Social Impact See 7+     See less Education Brown University Bachelor of Arts (B.A.),  International Development • Student Study Abroad Advisor, Office of International Programs  \n• Project Leader, \"Winter Breaks Projects\"​, Swearer Center for Public Service  \n• Residential Peer Counselor, Office of Residential Life  \n \n• Backpacking Leader, Brown Outdoor Leadership Training Program (BOLT) \n• Member/Music Arrangement for \"Chattertocks\"​ \n• Music Director of \"Shades of Brown\"​ \n• Writer for \"Street Sights\" newspaper with HOPE, Providence homeless advocacy group University of Jordan Arabic Language and Literature Internship with the Regional Human Security Centre of Prince Hassan Bin Talal. Conducted literature review on state and international policies impacting recently displaced Iraqis in Jordan, provided writing support to Research Director. Yemen College of Middle Eastern Studies Arabic Language Brown University Bachelor of Arts (B.A.),  International Development • Student Study Abroad Advisor, Office of International Programs  \n• Project Leader, \"Winter Breaks Projects\"​, Swearer Center for Public Service  \n• Residential Peer Counselor, Office of Residential Life  \n \n• Backpacking Leader, Brown Outdoor Leadership Training Program (BOLT) \n• Member/Music Arrangement for \"Chattertocks\"​ \n• Music Director of \"Shades of Brown\"​ \n• Writer for \"Street Sights\" newspaper with HOPE, Providence homeless advocacy group Brown University Bachelor of Arts (B.A.),  International Development • Student Study Abroad Advisor, Office of International Programs  \n• Project Leader, \"Winter Breaks Projects\"​, Swearer Center for Public Service  \n• Residential Peer Counselor, Office of Residential Life  \n \n• Backpacking Leader, Brown Outdoor Leadership Training Program (BOLT) \n• Member/Music Arrangement for \"Chattertocks\"​ \n• Music Director of \"Shades of Brown\"​ \n• Writer for \"Street Sights\" newspaper with HOPE, Providence homeless advocacy group Brown University Bachelor of Arts (B.A.),  International Development • Student Study Abroad Advisor, Office of International Programs  \n• Project Leader, \"Winter Breaks Projects\"​, Swearer Center for Public Service  \n• Residential Peer Counselor, Office of Residential Life  \n \n• Backpacking Leader, Brown Outdoor Leadership Training Program (BOLT) \n• Member/Music Arrangement for \"Chattertocks\"​ \n• Music Director of \"Shades of Brown\"​ \n• Writer for \"Street Sights\" newspaper with HOPE, Providence homeless advocacy group University of Jordan Arabic Language and Literature Internship with the Regional Human Security Centre of Prince Hassan Bin Talal. Conducted literature review on state and international policies impacting recently displaced Iraqis in Jordan, provided writing support to Research Director. University of Jordan Arabic Language and Literature Internship with the Regional Human Security Centre of Prince Hassan Bin Talal. Conducted literature review on state and international policies impacting recently displaced Iraqis in Jordan, provided writing support to Research Director. University of Jordan Arabic Language and Literature Internship with the Regional Human Security Centre of Prince Hassan Bin Talal. Conducted literature review on state and international policies impacting recently displaced Iraqis in Jordan, provided writing support to Research Director. Yemen College of Middle Eastern Studies Arabic Language Yemen College of Middle Eastern Studies Arabic Language Yemen College of Middle Eastern Studies Arabic Language ", "Summary I am a seasoned professional with over 15 years of experience in organizations dedicated to education, community development, and community engagement. I am a writer and former community advocate who took these skills into communications to tell compelling social change stories and help young people share their own stories. The most gratifying aspect of my work is coaching students on communicating their research projects and personal stories so they can powerfully engage with the broader public. I write and edit across multiple platforms, and advise students and faculty on communications strategy and media relations. I am proficient in Drupal and HTML, and have experience in website content management, database management, digital photo editing, and social justice grantmaking. \n \nSome topics I have covered include: girls' schooling in Turkey, culturally sensitive HIV education in India, the Preschool for All initiative, youth arts activism in the Bay Area, and Northern Cheyenne resistance to methane development in Montana. Writing areas of interest: K-12 and higher education, arts-based youth development, community health, and environmental justice. Summary I am a seasoned professional with over 15 years of experience in organizations dedicated to education, community development, and community engagement. I am a writer and former community advocate who took these skills into communications to tell compelling social change stories and help young people share their own stories. The most gratifying aspect of my work is coaching students on communicating their research projects and personal stories so they can powerfully engage with the broader public. I write and edit across multiple platforms, and advise students and faculty on communications strategy and media relations. I am proficient in Drupal and HTML, and have experience in website content management, database management, digital photo editing, and social justice grantmaking. \n \nSome topics I have covered include: girls' schooling in Turkey, culturally sensitive HIV education in India, the Preschool for All initiative, youth arts activism in the Bay Area, and Northern Cheyenne resistance to methane development in Montana. Writing areas of interest: K-12 and higher education, arts-based youth development, community health, and environmental justice. I am a seasoned professional with over 15 years of experience in organizations dedicated to education, community development, and community engagement. I am a writer and former community advocate who took these skills into communications to tell compelling social change stories and help young people share their own stories. The most gratifying aspect of my work is coaching students on communicating their research projects and personal stories so they can powerfully engage with the broader public. I write and edit across multiple platforms, and advise students and faculty on communications strategy and media relations. I am proficient in Drupal and HTML, and have experience in website content management, database management, digital photo editing, and social justice grantmaking. \n \nSome topics I have covered include: girls' schooling in Turkey, culturally sensitive HIV education in India, the Preschool for All initiative, youth arts activism in the Bay Area, and Northern Cheyenne resistance to methane development in Montana. Writing areas of interest: K-12 and higher education, arts-based youth development, community health, and environmental justice. I am a seasoned professional with over 15 years of experience in organizations dedicated to education, community development, and community engagement. I am a writer and former community advocate who took these skills into communications to tell compelling social change stories and help young people share their own stories. The most gratifying aspect of my work is coaching students on communicating their research projects and personal stories so they can powerfully engage with the broader public. I write and edit across multiple platforms, and advise students and faculty on communications strategy and media relations. I am proficient in Drupal and HTML, and have experience in website content management, database management, digital photo editing, and social justice grantmaking. \n \nSome topics I have covered include: girls' schooling in Turkey, culturally sensitive HIV education in India, the Preschool for All initiative, youth arts activism in the Bay Area, and Northern Cheyenne resistance to methane development in Montana. Writing areas of interest: K-12 and higher education, arts-based youth development, community health, and environmental justice. Experience Writer, Content Strategist (Freelance) George Washington University July 2015  – Present (2 months) Washington D.C. Metro Area Contributing Writer and Editor Stanford University Graduate School of Education 2013  – Present (2 years) Greater Philadelphia Area (working remotely) Media Specialist Community College of Philadelphia 2015  –  2015  (less than a year) Greater Philadelphia Area Communications Manager Stanford University Graduate School of Education 2006  –  2012  (6 years) Stanford, CA Communications Associate Stanford University Graduate School of Education 2004  –  2006  (2 years) Stanford, CA Office Administrator Project Artaud Corporation 2003  –  2004  (1 year) San Francisco Bay Area Consultant Tides Foundation 2001  –  2002  (1 year) San Francisco Bay Area Program Assistant Tides Foundation 1999  –  2001  (2 years) San Francisco Bay Area Organizational Coordinator East Bay Institute for Urban Arts 1998  –  1999  (1 year) Oakland, CA Office Manager Kearny Street Workshop 1996  –  1998  (2 years) San Francisco Bay Area Grants Administrator Common Counsel Foundation 1996  –  1997  (1 year) Oakland, CA Community Organizer Chinese Progressive Association 1995  –  1995  (less than a year) San Francisco Bay Area Writer, Content Strategist (Freelance) George Washington University July 2015  – Present (2 months) Washington D.C. Metro Area Writer, Content Strategist (Freelance) George Washington University July 2015  – Present (2 months) Washington D.C. Metro Area Contributing Writer and Editor Stanford University Graduate School of Education 2013  – Present (2 years) Greater Philadelphia Area (working remotely) Contributing Writer and Editor Stanford University Graduate School of Education 2013  – Present (2 years) Greater Philadelphia Area (working remotely) Media Specialist Community College of Philadelphia 2015  –  2015  (less than a year) Greater Philadelphia Area Media Specialist Community College of Philadelphia 2015  –  2015  (less than a year) Greater Philadelphia Area Communications Manager Stanford University Graduate School of Education 2006  –  2012  (6 years) Stanford, CA Communications Manager Stanford University Graduate School of Education 2006  –  2012  (6 years) Stanford, CA Communications Associate Stanford University Graduate School of Education 2004  –  2006  (2 years) Stanford, CA Communications Associate Stanford University Graduate School of Education 2004  –  2006  (2 years) Stanford, CA Office Administrator Project Artaud Corporation 2003  –  2004  (1 year) San Francisco Bay Area Office Administrator Project Artaud Corporation 2003  –  2004  (1 year) San Francisco Bay Area Consultant Tides Foundation 2001  –  2002  (1 year) San Francisco Bay Area Consultant Tides Foundation 2001  –  2002  (1 year) San Francisco Bay Area Program Assistant Tides Foundation 1999  –  2001  (2 years) San Francisco Bay Area Program Assistant Tides Foundation 1999  –  2001  (2 years) San Francisco Bay Area Organizational Coordinator East Bay Institute for Urban Arts 1998  –  1999  (1 year) Oakland, CA Organizational Coordinator East Bay Institute for Urban Arts 1998  –  1999  (1 year) Oakland, CA Office Manager Kearny Street Workshop 1996  –  1998  (2 years) San Francisco Bay Area Office Manager Kearny Street Workshop 1996  –  1998  (2 years) San Francisco Bay Area Grants Administrator Common Counsel Foundation 1996  –  1997  (1 year) Oakland, CA Grants Administrator Common Counsel Foundation 1996  –  1997  (1 year) Oakland, CA Community Organizer Chinese Progressive Association 1995  –  1995  (less than a year) San Francisco Bay Area Community Organizer Chinese Progressive Association 1995  –  1995  (less than a year) San Francisco Bay Area Languages Cantonese Cantonese Cantonese Skills Editing Press Releases Media Relations Fundraising Publications Creative Writing Community Outreach Strategic Communications Social Media Event Planning Higher Education Skills  Editing Press Releases Media Relations Fundraising Publications Creative Writing Community Outreach Strategic Communications Social Media Event Planning Higher Education Editing Press Releases Media Relations Fundraising Publications Creative Writing Community Outreach Strategic Communications Social Media Event Planning Higher Education Editing Press Releases Media Relations Fundraising Publications Creative Writing Community Outreach Strategic Communications Social Media Event Planning Higher Education Education California College of the Arts Master of Fine Arts (MFA) University of California, Davis Bachelor of Arts (BA) California College of the Arts Master of Fine Arts (MFA) California College of the Arts Master of Fine Arts (MFA) California College of the Arts Master of Fine Arts (MFA) University of California, Davis Bachelor of Arts (BA) University of California, Davis Bachelor of Arts (BA) University of California, Davis Bachelor of Arts (BA) Honors & Awards Nominated - Staff Award, Stanford Asian American Awards, 2012 Stanford University Asian Staff Forum May 2012 Writing Residency Voices of Our Nations Arts Foundation (VONA) Workshop June 2010 Fellow Voices of Our Nations Arts Foundation (VONA) Workshop June 2004 MFA Writing Scholarship (2001-2003) California College of the Arts Nominated - Staff Award, Stanford Asian American Awards, 2012 Stanford University Asian Staff Forum May 2012 Nominated - Staff Award, Stanford Asian American Awards, 2012 Stanford University Asian Staff Forum May 2012 Nominated - Staff Award, Stanford Asian American Awards, 2012 Stanford University Asian Staff Forum May 2012 Writing Residency Voices of Our Nations Arts Foundation (VONA) Workshop June 2010 Writing Residency Voices of Our Nations Arts Foundation (VONA) Workshop June 2010 Writing Residency Voices of Our Nations Arts Foundation (VONA) Workshop June 2010 Fellow Voices of Our Nations Arts Foundation (VONA) Workshop June 2004 Fellow Voices of Our Nations Arts Foundation (VONA) Workshop June 2004 Fellow Voices of Our Nations Arts Foundation (VONA) Workshop June 2004 MFA Writing Scholarship (2001-2003) California College of the Arts MFA Writing Scholarship (2001-2003) California College of the Arts MFA Writing Scholarship (2001-2003) California College of the Arts "]}