{"position": "Communications Specialist", "company": "Stanford University", "profiles": ["Summary Marketing communications strategist with more than 15 years experience developing and leading integrated communications campaigns and delivering consistent results. I enjoy working with a client to identify communications opportunities and applying creative strategies to build brand awareness, improve customer service, generate leads and revenue and increase engagement. As a leader, I encourage cross-team collaboration, proactive communication, initiative, creativity and integrity. \n \nSpecialties include: strategic planning, internal and external communications, project management, brand management, supervising and building highly productive teams, reporting and analysis, budget management and fiscal accountability, digital marketing, customer/fan/employee relations. Summary Marketing communications strategist with more than 15 years experience developing and leading integrated communications campaigns and delivering consistent results. I enjoy working with a client to identify communications opportunities and applying creative strategies to build brand awareness, improve customer service, generate leads and revenue and increase engagement. As a leader, I encourage cross-team collaboration, proactive communication, initiative, creativity and integrity. \n \nSpecialties include: strategic planning, internal and external communications, project management, brand management, supervising and building highly productive teams, reporting and analysis, budget management and fiscal accountability, digital marketing, customer/fan/employee relations. Marketing communications strategist with more than 15 years experience developing and leading integrated communications campaigns and delivering consistent results. I enjoy working with a client to identify communications opportunities and applying creative strategies to build brand awareness, improve customer service, generate leads and revenue and increase engagement. As a leader, I encourage cross-team collaboration, proactive communication, initiative, creativity and integrity. \n \nSpecialties include: strategic planning, internal and external communications, project management, brand management, supervising and building highly productive teams, reporting and analysis, budget management and fiscal accountability, digital marketing, customer/fan/employee relations. Marketing communications strategist with more than 15 years experience developing and leading integrated communications campaigns and delivering consistent results. I enjoy working with a client to identify communications opportunities and applying creative strategies to build brand awareness, improve customer service, generate leads and revenue and increase engagement. As a leader, I encourage cross-team collaboration, proactive communication, initiative, creativity and integrity. \n \nSpecialties include: strategic planning, internal and external communications, project management, brand management, supervising and building highly productive teams, reporting and analysis, budget management and fiscal accountability, digital marketing, customer/fan/employee relations. Experience Senior Communications Specialist Stanford University Human Resources January 2014  – Present (1 year 8 months) Stanford, CA Director of Marketing Communications & Event Presentation Stanford University Department of Athletics January 2009  –  January 2014  (5 years 1 month) Director of External Relations & Special Projects Stanford University Department of Athletics February 2007  –  January 2009  (2 years) PR & Community Relations Specialist Stanford University Department of Athletics November 2005  –  February 2007  (1 year 4 months) Sr. Marketing Communications Manager/Interim Director of Marketing San Jose Convention & Visitors Bureau September 2004  –  November 2005  (1 year 3 months) San Jose, CA Publicist Silicon Valley Football Classic November 2004  –  January 2005  (3 months) Public Relations Manager San Jose Convention & Visitors Bureau March 2003  –  September 2004  (1 year 7 months) San Jose, CA PR Account Manager Dovetail Public Relations May 2001  –  March 2003  (1 year 11 months) Los Gatos, CA PR Account Executive Dovetail Public Relations May 2000  –  May 2001  (1 year 1 month) Community Outreach & Special Projects Coordinator County of Santa Clara - Supervisor Blanca Alvarado - District 2 December 1997  –  May 2000  (2 years 6 months) Senior Communications Specialist Stanford University Human Resources January 2014  – Present (1 year 8 months) Stanford, CA Senior Communications Specialist Stanford University Human Resources January 2014  – Present (1 year 8 months) Stanford, CA Director of Marketing Communications & Event Presentation Stanford University Department of Athletics January 2009  –  January 2014  (5 years 1 month) Director of Marketing Communications & Event Presentation Stanford University Department of Athletics January 2009  –  January 2014  (5 years 1 month) Director of External Relations & Special Projects Stanford University Department of Athletics February 2007  –  January 2009  (2 years) Director of External Relations & Special Projects Stanford University Department of Athletics February 2007  –  January 2009  (2 years) PR & Community Relations Specialist Stanford University Department of Athletics November 2005  –  February 2007  (1 year 4 months) PR & Community Relations Specialist Stanford University Department of Athletics November 2005  –  February 2007  (1 year 4 months) Sr. Marketing Communications Manager/Interim Director of Marketing San Jose Convention & Visitors Bureau September 2004  –  November 2005  (1 year 3 months) San Jose, CA Sr. Marketing Communications Manager/Interim Director of Marketing San Jose Convention & Visitors Bureau September 2004  –  November 2005  (1 year 3 months) San Jose, CA Publicist Silicon Valley Football Classic November 2004  –  January 2005  (3 months) Publicist Silicon Valley Football Classic November 2004  –  January 2005  (3 months) Public Relations Manager San Jose Convention & Visitors Bureau March 2003  –  September 2004  (1 year 7 months) San Jose, CA Public Relations Manager San Jose Convention & Visitors Bureau March 2003  –  September 2004  (1 year 7 months) San Jose, CA PR Account Manager Dovetail Public Relations May 2001  –  March 2003  (1 year 11 months) Los Gatos, CA PR Account Manager Dovetail Public Relations May 2001  –  March 2003  (1 year 11 months) Los Gatos, CA PR Account Executive Dovetail Public Relations May 2000  –  May 2001  (1 year 1 month) PR Account Executive Dovetail Public Relations May 2000  –  May 2001  (1 year 1 month) Community Outreach & Special Projects Coordinator County of Santa Clara - Supervisor Blanca Alvarado - District 2 December 1997  –  May 2000  (2 years 6 months) Community Outreach & Special Projects Coordinator County of Santa Clara - Supervisor Blanca Alvarado - District 2 December 1997  –  May 2000  (2 years 6 months) Skills Social Media Marketing Marketing Communications Media Relations Press Releases Public Relations Strategic Planning Brand Management Customer Service Email Marketing Project Management Strategic Communications Social Media Web Marketing Staff Supervision Event Management Social Networking Integrated Marketing Copywriting Strategy Newsletters Advertising Sponsorship Corporate Communications Reporting & Analysis Department Budget... Event Planning Sports Marketing Marketing Strategy Digital Marketing Editing Time Management Research Public Speaking Management Program Management Nonprofits Publicity Marketing Budgets Leadership Lead Generation Facebook CRM Community Outreach Trade Shows Copy Editing Internal Communications See 32+     See less Skills  Social Media Marketing Marketing Communications Media Relations Press Releases Public Relations Strategic Planning Brand Management Customer Service Email Marketing Project Management Strategic Communications Social Media Web Marketing Staff Supervision Event Management Social Networking Integrated Marketing Copywriting Strategy Newsletters Advertising Sponsorship Corporate Communications Reporting & Analysis Department Budget... Event Planning Sports Marketing Marketing Strategy Digital Marketing Editing Time Management Research Public Speaking Management Program Management Nonprofits Publicity Marketing Budgets Leadership Lead Generation Facebook CRM Community Outreach Trade Shows Copy Editing Internal Communications See 32+     See less Social Media Marketing Marketing Communications Media Relations Press Releases Public Relations Strategic Planning Brand Management Customer Service Email Marketing Project Management Strategic Communications Social Media Web Marketing Staff Supervision Event Management Social Networking Integrated Marketing Copywriting Strategy Newsletters Advertising Sponsorship Corporate Communications Reporting & Analysis Department Budget... Event Planning Sports Marketing Marketing Strategy Digital Marketing Editing Time Management Research Public Speaking Management Program Management Nonprofits Publicity Marketing Budgets Leadership Lead Generation Facebook CRM Community Outreach Trade Shows Copy Editing Internal Communications See 32+     See less Social Media Marketing Marketing Communications Media Relations Press Releases Public Relations Strategic Planning Brand Management Customer Service Email Marketing Project Management Strategic Communications Social Media Web Marketing Staff Supervision Event Management Social Networking Integrated Marketing Copywriting Strategy Newsletters Advertising Sponsorship Corporate Communications Reporting & Analysis Department Budget... Event Planning Sports Marketing Marketing Strategy Digital Marketing Editing Time Management Research Public Speaking Management Program Management Nonprofits Publicity Marketing Budgets Leadership Lead Generation Facebook CRM Community Outreach Trade Shows Copy Editing Internal Communications See 32+     See less Education San Jose State University BS 1992  – 1997 San Jose State University BS 1992  – 1997 San Jose State University BS 1992  – 1997 San Jose State University BS 1992  – 1997 Honors & Awards Additional Honors & Awards Recipient of UHR's SPOT Award for excellence in June, 2014. \n \nRecognized with Silver & Bronze Adrian Awards from the Hospitality Sales & Marketing Association International (HSMAI) for advertising campaign focused on travel sales and web marketing Additional Honors & Awards Recipient of UHR's SPOT Award for excellence in June, 2014. \n \nRecognized with Silver & Bronze Adrian Awards from the Hospitality Sales & Marketing Association International (HSMAI) for advertising campaign focused on travel sales and web marketing Additional Honors & Awards Recipient of UHR's SPOT Award for excellence in June, 2014. \n \nRecognized with Silver & Bronze Adrian Awards from the Hospitality Sales & Marketing Association International (HSMAI) for advertising campaign focused on travel sales and web marketing Additional Honors & Awards Recipient of UHR's SPOT Award for excellence in June, 2014. \n \nRecognized with Silver & Bronze Adrian Awards from the Hospitality Sales & Marketing Association International (HSMAI) for advertising campaign focused on travel sales and web marketing ", "Experience Senior Editor Google August 2010  – Present (5 years 1 month) Mountain View, CA Marketing Communications Specialist Stanford University, Center for Professional Development August 2007  –  August 2010  (3 years 1 month) Palo Alto, CA Marketing Intern Sunset Magazine 2006  –  2007  (1 year) Menlo Park, CA Senior Editor Google August 2010  – Present (5 years 1 month) Mountain View, CA Senior Editor Google August 2010  – Present (5 years 1 month) Mountain View, CA Marketing Communications Specialist Stanford University, Center for Professional Development August 2007  –  August 2010  (3 years 1 month) Palo Alto, CA Marketing Communications Specialist Stanford University, Center for Professional Development August 2007  –  August 2010  (3 years 1 month) Palo Alto, CA Marketing Intern Sunset Magazine 2006  –  2007  (1 year) Menlo Park, CA Marketing Intern Sunset Magazine 2006  –  2007  (1 year) Menlo Park, CA Skills Marketing Communications Editing Blogging Online Advertising Digital Marketing Copy Editing Digital Media Project Management Skills  Marketing Communications Editing Blogging Online Advertising Digital Marketing Copy Editing Digital Media Project Management Marketing Communications Editing Blogging Online Advertising Digital Marketing Copy Editing Digital Media Project Management Marketing Communications Editing Blogging Online Advertising Digital Marketing Copy Editing Digital Media Project Management Education University of California, San Diego B.A.,  English Literature 2002  – 2006 Activities and Societies:  UCSD Guardian ,  The Tramp Bakersfield High School University of California, San Diego B.A.,  English Literature 2002  – 2006 Activities and Societies:  UCSD Guardian ,  The Tramp University of California, San Diego B.A.,  English Literature 2002  – 2006 Activities and Societies:  UCSD Guardian ,  The Tramp University of California, San Diego B.A.,  English Literature 2002  – 2006 Activities and Societies:  UCSD Guardian ,  The Tramp Bakersfield High School Bakersfield High School Bakersfield High School ", "Summary I am a well-rounded communications professional with editing, writing, and graphic design experience. I thrive in highly deadline-driven environments and am adept at streamlining written and visual content. \n \nMy specialties include: communications strategies; content management; print design with an emphasis in book design; identity systems; editorial, promotional and technical writing; copy editing; conceptual editing; photo retouching; and photo editing \n \nSoftware knowledge: Adobe Creative Suite, Microsoft Office, Drupal and a multitude of social media outlets Summary I am a well-rounded communications professional with editing, writing, and graphic design experience. I thrive in highly deadline-driven environments and am adept at streamlining written and visual content. \n \nMy specialties include: communications strategies; content management; print design with an emphasis in book design; identity systems; editorial, promotional and technical writing; copy editing; conceptual editing; photo retouching; and photo editing \n \nSoftware knowledge: Adobe Creative Suite, Microsoft Office, Drupal and a multitude of social media outlets I am a well-rounded communications professional with editing, writing, and graphic design experience. I thrive in highly deadline-driven environments and am adept at streamlining written and visual content. \n \nMy specialties include: communications strategies; content management; print design with an emphasis in book design; identity systems; editorial, promotional and technical writing; copy editing; conceptual editing; photo retouching; and photo editing \n \nSoftware knowledge: Adobe Creative Suite, Microsoft Office, Drupal and a multitude of social media outlets I am a well-rounded communications professional with editing, writing, and graphic design experience. I thrive in highly deadline-driven environments and am adept at streamlining written and visual content. \n \nMy specialties include: communications strategies; content management; print design with an emphasis in book design; identity systems; editorial, promotional and technical writing; copy editing; conceptual editing; photo retouching; and photo editing \n \nSoftware knowledge: Adobe Creative Suite, Microsoft Office, Drupal and a multitude of social media outlets Experience Editor Stanford University, Office of the Vice President for Development September 2013  – Present (2 years) Stanford, CA Edit and project manage all Office of Development communications for the President, Provost, Chair of the Board of Trustees and Vice President for Development. Maintain and coordinate calendars for university senior leadership for all OOD events, meetings and travel. Manage and update internal style guide used campus-wide by development staff. Write correspondence for external audiences. Freelance Communications Kim Kasabian Communications February 2007  –  September 2013  (6 years 8 months) Silicon Valley, CA Content Strategist, Writer, Editor, Designer I work with clients to build and manage their communications needs in a variety of industries, including including education, real estate, entertainment and music. Communications Specialist Stanford University December 2010  –  October 2012  (1 year 11 months) School of Engineering Designer, writer and editor for special projects within the School of Engineering, under direct supervision of the Senior Associate Dean of Finance & Administration. Design projects include logo / branding development for Stanford’s new Science & Engineering Quad, web graphics and content management for multiple administrative units, and new media productions to showcase faculty research projects. Writing projects reflect a broad range, including marketing materials, technical documents, web content, and user manuals. Senior Graphic Designer Alfred Publishing Co., Inc. February 1998  –  February 2007  (9 years 1 month) Creative lead for all editorial and promotional materials for the band, orchestra and percussion division of the world’s largest educational music publisher. Company culture was one of shared governance, working with groups of internal clientele (editors and project managers) to create visually compelling products and promotions for targeted external clientele. Projects included book design with complex style sheeting, book series art direction, multi-component promotions, die-cut product packaging, perfect-bound and saddle-stitched catalogs, display advertisements, trade show graphics, logo development and brochure design. Responsible for art directing photo shoots, freelance illustrators and mentoring junior designers. Writer/Editor Prognosis 1991  –  1993  (2 years) Prague, Czech Republic As a writer, I focused on topics such as health challenges in a post-Iron Curtain society, the environment and the push for the country's inclusion into NATO. \n \nMy duties as Eastern Europe Editor included editing, writing and assigning news feature stories from the Czech Republic's eastern neighbors. General Assignment Reporter The Fresno Bee 1989  –  1991  (2 years) General assignment reporter for major metropolitan newspaper, reaching 150,000+ readers daily. Covered breaking news, police beat, features and business stories. Editor Stanford University, Office of the Vice President for Development September 2013  – Present (2 years) Stanford, CA Edit and project manage all Office of Development communications for the President, Provost, Chair of the Board of Trustees and Vice President for Development. Maintain and coordinate calendars for university senior leadership for all OOD events, meetings and travel. Manage and update internal style guide used campus-wide by development staff. Write correspondence for external audiences. Editor Stanford University, Office of the Vice President for Development September 2013  – Present (2 years) Stanford, CA Edit and project manage all Office of Development communications for the President, Provost, Chair of the Board of Trustees and Vice President for Development. Maintain and coordinate calendars for university senior leadership for all OOD events, meetings and travel. Manage and update internal style guide used campus-wide by development staff. Write correspondence for external audiences. Freelance Communications Kim Kasabian Communications February 2007  –  September 2013  (6 years 8 months) Silicon Valley, CA Content Strategist, Writer, Editor, Designer I work with clients to build and manage their communications needs in a variety of industries, including including education, real estate, entertainment and music. Freelance Communications Kim Kasabian Communications February 2007  –  September 2013  (6 years 8 months) Silicon Valley, CA Content Strategist, Writer, Editor, Designer I work with clients to build and manage their communications needs in a variety of industries, including including education, real estate, entertainment and music. Communications Specialist Stanford University December 2010  –  October 2012  (1 year 11 months) School of Engineering Designer, writer and editor for special projects within the School of Engineering, under direct supervision of the Senior Associate Dean of Finance & Administration. Design projects include logo / branding development for Stanford’s new Science & Engineering Quad, web graphics and content management for multiple administrative units, and new media productions to showcase faculty research projects. Writing projects reflect a broad range, including marketing materials, technical documents, web content, and user manuals. Communications Specialist Stanford University December 2010  –  October 2012  (1 year 11 months) School of Engineering Designer, writer and editor for special projects within the School of Engineering, under direct supervision of the Senior Associate Dean of Finance & Administration. Design projects include logo / branding development for Stanford’s new Science & Engineering Quad, web graphics and content management for multiple administrative units, and new media productions to showcase faculty research projects. Writing projects reflect a broad range, including marketing materials, technical documents, web content, and user manuals. Senior Graphic Designer Alfred Publishing Co., Inc. February 1998  –  February 2007  (9 years 1 month) Creative lead for all editorial and promotional materials for the band, orchestra and percussion division of the world’s largest educational music publisher. Company culture was one of shared governance, working with groups of internal clientele (editors and project managers) to create visually compelling products and promotions for targeted external clientele. Projects included book design with complex style sheeting, book series art direction, multi-component promotions, die-cut product packaging, perfect-bound and saddle-stitched catalogs, display advertisements, trade show graphics, logo development and brochure design. Responsible for art directing photo shoots, freelance illustrators and mentoring junior designers. Senior Graphic Designer Alfred Publishing Co., Inc. February 1998  –  February 2007  (9 years 1 month) Creative lead for all editorial and promotional materials for the band, orchestra and percussion division of the world’s largest educational music publisher. Company culture was one of shared governance, working with groups of internal clientele (editors and project managers) to create visually compelling products and promotions for targeted external clientele. Projects included book design with complex style sheeting, book series art direction, multi-component promotions, die-cut product packaging, perfect-bound and saddle-stitched catalogs, display advertisements, trade show graphics, logo development and brochure design. Responsible for art directing photo shoots, freelance illustrators and mentoring junior designers. Writer/Editor Prognosis 1991  –  1993  (2 years) Prague, Czech Republic As a writer, I focused on topics such as health challenges in a post-Iron Curtain society, the environment and the push for the country's inclusion into NATO. \n \nMy duties as Eastern Europe Editor included editing, writing and assigning news feature stories from the Czech Republic's eastern neighbors. Writer/Editor Prognosis 1991  –  1993  (2 years) Prague, Czech Republic As a writer, I focused on topics such as health challenges in a post-Iron Curtain society, the environment and the push for the country's inclusion into NATO. \n \nMy duties as Eastern Europe Editor included editing, writing and assigning news feature stories from the Czech Republic's eastern neighbors. General Assignment Reporter The Fresno Bee 1989  –  1991  (2 years) General assignment reporter for major metropolitan newspaper, reaching 150,000+ readers daily. Covered breaking news, police beat, features and business stories. General Assignment Reporter The Fresno Bee 1989  –  1991  (2 years) General assignment reporter for major metropolitan newspaper, reaching 150,000+ readers daily. Covered breaking news, police beat, features and business stories. Skills Writing Graphic Design Copy Editing Photo Retouching Book Design Photoshop Illustrator InDesign Logo Design Proofreading Photo Editing Drupal Email Marketing Constant Contact Storytelling Facebook Chicago Manual Ap Style Microsoft Excel User Interface Design Adobe Creative Suite New Media Technical Writing Web Content Social Networking Multimedia Photography Social Media Marketing Publishing Mac Final Cut Pro Copywriting Image Manipulation Advertising Feature Articles Newspaper Web Design Social Media Content Management Creative Writing Magazines Wordpress Editorial Newsletters Content Development Blogging Publications Image Editing Brochures Digital Media See 35+     See less Skills  Writing Graphic Design Copy Editing Photo Retouching Book Design Photoshop Illustrator InDesign Logo Design Proofreading Photo Editing Drupal Email Marketing Constant Contact Storytelling Facebook Chicago Manual Ap Style Microsoft Excel User Interface Design Adobe Creative Suite New Media Technical Writing Web Content Social Networking Multimedia Photography Social Media Marketing Publishing Mac Final Cut Pro Copywriting Image Manipulation Advertising Feature Articles Newspaper Web Design Social Media Content Management Creative Writing Magazines Wordpress Editorial Newsletters Content Development Blogging Publications Image Editing Brochures Digital Media See 35+     See less Writing Graphic Design Copy Editing Photo Retouching Book Design Photoshop Illustrator InDesign Logo Design Proofreading Photo Editing Drupal Email Marketing Constant Contact Storytelling Facebook Chicago Manual Ap Style Microsoft Excel User Interface Design Adobe Creative Suite New Media Technical Writing Web Content Social Networking Multimedia Photography Social Media Marketing Publishing Mac Final Cut Pro Copywriting Image Manipulation Advertising Feature Articles Newspaper Web Design Social Media Content Management Creative Writing Magazines Wordpress Editorial Newsletters Content Development Blogging Publications Image Editing Brochures Digital Media See 35+     See less Writing Graphic Design Copy Editing Photo Retouching Book Design Photoshop Illustrator InDesign Logo Design Proofreading Photo Editing Drupal Email Marketing Constant Contact Storytelling Facebook Chicago Manual Ap Style Microsoft Excel User Interface Design Adobe Creative Suite New Media Technical Writing Web Content Social Networking Multimedia Photography Social Media Marketing Publishing Mac Final Cut Pro Copywriting Image Manipulation Advertising Feature Articles Newspaper Web Design Social Media Content Management Creative Writing Magazines Wordpress Editorial Newsletters Content Development Blogging Publications Image Editing Brochures Digital Media See 35+     See less Education California State University-Fresno Bachelor of Arts (B.A.),  Journalism News/Editorial emphasis California State University-Fresno Bachelor of Arts (B.A.),  Journalism News/Editorial emphasis California State University-Fresno Bachelor of Arts (B.A.),  Journalism News/Editorial emphasis California State University-Fresno Bachelor of Arts (B.A.),  Journalism News/Editorial emphasis ", "Summary Communications Specialist \n• Ten years of crafting marketing messages and strategic programs  \n• Extensive experience working with cross-functional teams  \n• Ability to juggle events, partnerships, web content, social media, newsletters, promotions, and campaigns with an eye for detail and focus on deadlines \n \nSpecialties:  \n• Creative problem solving \n• Project management \n• AP and Chicago Style manuals \n• Social media content creation \n• Internal and external customer service \n• Brand development and loyalty Summary Communications Specialist \n• Ten years of crafting marketing messages and strategic programs  \n• Extensive experience working with cross-functional teams  \n• Ability to juggle events, partnerships, web content, social media, newsletters, promotions, and campaigns with an eye for detail and focus on deadlines \n \nSpecialties:  \n• Creative problem solving \n• Project management \n• AP and Chicago Style manuals \n• Social media content creation \n• Internal and external customer service \n• Brand development and loyalty Communications Specialist \n• Ten years of crafting marketing messages and strategic programs  \n• Extensive experience working with cross-functional teams  \n• Ability to juggle events, partnerships, web content, social media, newsletters, promotions, and campaigns with an eye for detail and focus on deadlines \n \nSpecialties:  \n• Creative problem solving \n• Project management \n• AP and Chicago Style manuals \n• Social media content creation \n• Internal and external customer service \n• Brand development and loyalty Communications Specialist \n• Ten years of crafting marketing messages and strategic programs  \n• Extensive experience working with cross-functional teams  \n• Ability to juggle events, partnerships, web content, social media, newsletters, promotions, and campaigns with an eye for detail and focus on deadlines \n \nSpecialties:  \n• Creative problem solving \n• Project management \n• AP and Chicago Style manuals \n• Social media content creation \n• Internal and external customer service \n• Brand development and loyalty Experience Communications Specialist Stanford University Communications Specialist Stanford University May 2001  – Present (14 years 4 months) Stanford Blood Center in Palo Alto, CA • Conceive and produce communications projects and marketing campaigns for various channels including social media, blog, email, web, newsletters, and FDA-regulated technical guides \n• Work with public relations department and executive management to create and maintain a consistent communications strategy adhering to budget \n• Hold special events for targeted audiences, leveraging partnerships where appropriate \n• Write and deploy weekly marketing emails to 33,000+ recipients \n• Develop campaigns that integrate social media, email blasts, and on-site incentives \n• Manage projects requiring multiple stakeholders, tasks, and deadlines \n• Create and maintain a strategic marketing program geared towards lowering attrition rates \n• Write and deliver presentations to varied audiences, including internal departments and outside groups by demographic Content Manager Urbanite June 2000  –  December 2000  (7 months) San Mateo, CA • Managed a team of writers and editors \n• Worked with marketing, production, and sales teams to create copy, mock-ups, and demonstrations for sales pitches \n• Responsible for the online communities of seven websites including Baywatch.com \n• Created and deployed monthly text and HTML newsletters \n• Wrote copy for the launch of Baywatch.com’s Model Agency and greeting card products \n• Researched prospective clients and wrote/produced product demonstrations \n• Performed quality assurance on websites before launch Editor LookSmart March 1999  –  June 2000  (1 year 4 months) San Francisco, CA • Assisted in the launch, maintenance, and product development of a time-sensitive website submission project \n• Helped create and maintain house style  \n• Wrote and edited concise reviews of websites submitted to LookSmart.com \n• Wrote messaging for automated and personalized customer email responses Communications Specialist Stanford University Communications Specialist Stanford University Communications Specialist Stanford University May 2001  – Present (14 years 4 months) Stanford Blood Center in Palo Alto, CA • Conceive and produce communications projects and marketing campaigns for various channels including social media, blog, email, web, newsletters, and FDA-regulated technical guides \n• Work with public relations department and executive management to create and maintain a consistent communications strategy adhering to budget \n• Hold special events for targeted audiences, leveraging partnerships where appropriate \n• Write and deploy weekly marketing emails to 33,000+ recipients \n• Develop campaigns that integrate social media, email blasts, and on-site incentives \n• Manage projects requiring multiple stakeholders, tasks, and deadlines \n• Create and maintain a strategic marketing program geared towards lowering attrition rates \n• Write and deliver presentations to varied audiences, including internal departments and outside groups by demographic Communications Specialist Stanford University May 2001  – Present (14 years 4 months) Stanford Blood Center in Palo Alto, CA • Conceive and produce communications projects and marketing campaigns for various channels including social media, blog, email, web, newsletters, and FDA-regulated technical guides \n• Work with public relations department and executive management to create and maintain a consistent communications strategy adhering to budget \n• Hold special events for targeted audiences, leveraging partnerships where appropriate \n• Write and deploy weekly marketing emails to 33,000+ recipients \n• Develop campaigns that integrate social media, email blasts, and on-site incentives \n• Manage projects requiring multiple stakeholders, tasks, and deadlines \n• Create and maintain a strategic marketing program geared towards lowering attrition rates \n• Write and deliver presentations to varied audiences, including internal departments and outside groups by demographic Content Manager Urbanite June 2000  –  December 2000  (7 months) San Mateo, CA • Managed a team of writers and editors \n• Worked with marketing, production, and sales teams to create copy, mock-ups, and demonstrations for sales pitches \n• Responsible for the online communities of seven websites including Baywatch.com \n• Created and deployed monthly text and HTML newsletters \n• Wrote copy for the launch of Baywatch.com’s Model Agency and greeting card products \n• Researched prospective clients and wrote/produced product demonstrations \n• Performed quality assurance on websites before launch Content Manager Urbanite June 2000  –  December 2000  (7 months) San Mateo, CA • Managed a team of writers and editors \n• Worked with marketing, production, and sales teams to create copy, mock-ups, and demonstrations for sales pitches \n• Responsible for the online communities of seven websites including Baywatch.com \n• Created and deployed monthly text and HTML newsletters \n• Wrote copy for the launch of Baywatch.com’s Model Agency and greeting card products \n• Researched prospective clients and wrote/produced product demonstrations \n• Performed quality assurance on websites before launch Editor LookSmart March 1999  –  June 2000  (1 year 4 months) San Francisco, CA • Assisted in the launch, maintenance, and product development of a time-sensitive website submission project \n• Helped create and maintain house style  \n• Wrote and edited concise reviews of websites submitted to LookSmart.com \n• Wrote messaging for automated and personalized customer email responses Editor LookSmart March 1999  –  June 2000  (1 year 4 months) San Francisco, CA • Assisted in the launch, maintenance, and product development of a time-sensitive website submission project \n• Helped create and maintain house style  \n• Wrote and edited concise reviews of websites submitted to LookSmart.com \n• Wrote messaging for automated and personalized customer email responses Skills Marketing Writing Editing Social Media MS Office Suite Adobe Creative Suite Content Management Proprietary Software AP Style Chicago Manual of Style Editorial Project... Brand Development Brand Awareness Brand Communication Marketing Strategy Marketing Communications Email Marketing Strategic Planning Event Planning Event Management Event Marketing Special Events Social Media Marketing Campaign Strategy Campaign Development Website Copy Customer Service Customer Relations Customer Retention Customer Loyalty Customer Engagement Promotions Print Collateral Cross-functional Team... Multi-channel Marketing Strategic Partnerships Creative Problem Solving Marketing Web Content Public Relations See 24+     See less Skills  Marketing Writing Editing Social Media MS Office Suite Adobe Creative Suite Content Management Proprietary Software AP Style Chicago Manual of Style Editorial Project... Brand Development Brand Awareness Brand Communication Marketing Strategy Marketing Communications Email Marketing Strategic Planning Event Planning Event Management Event Marketing Special Events Social Media Marketing Campaign Strategy Campaign Development Website Copy Customer Service Customer Relations Customer Retention Customer Loyalty Customer Engagement Promotions Print Collateral Cross-functional Team... Multi-channel Marketing Strategic Partnerships Creative Problem Solving Marketing Web Content Public Relations See 24+     See less Marketing Writing Editing Social Media MS Office Suite Adobe Creative Suite Content Management Proprietary Software AP Style Chicago Manual of Style Editorial Project... Brand Development Brand Awareness Brand Communication Marketing Strategy Marketing Communications Email Marketing Strategic Planning Event Planning Event Management Event Marketing Special Events Social Media Marketing Campaign Strategy Campaign Development Website Copy Customer Service Customer Relations Customer Retention Customer Loyalty Customer Engagement Promotions Print Collateral Cross-functional Team... Multi-channel Marketing Strategic Partnerships Creative Problem Solving Marketing Web Content Public Relations See 24+     See less Marketing Writing Editing Social Media MS Office Suite Adobe Creative Suite Content Management Proprietary Software AP Style Chicago Manual of Style Editorial Project... Brand Development Brand Awareness Brand Communication Marketing Strategy Marketing Communications Email Marketing Strategic Planning Event Planning Event Management Event Marketing Special Events Social Media Marketing Campaign Strategy Campaign Development Website Copy Customer Service Customer Relations Customer Retention Customer Loyalty Customer Engagement Promotions Print Collateral Cross-functional Team... Multi-channel Marketing Strategic Partnerships Creative Problem Solving Marketing Web Content Public Relations See 24+     See less Education San Francisco State University BA,  English/Creative Writing 2000  – 2005 San Francisco State University BA,  English/Creative Writing 2000  – 2005 San Francisco State University BA,  English/Creative Writing 2000  – 2005 San Francisco State University BA,  English/Creative Writing 2000  – 2005 ", "Summary I'm an experienced writer and editor with a journalism background, including 20-plus years at the Mercury News. My work at the Merc included an award-winning series based on my year spent teaching 7th-grade English in a middle school.The series was especially well-received in the education community. The Merc submitted the series for Pulitzer consideration, but it may have gotten lost in transit, because it did not win.  \n \nI now work in communications for Stanford's Financial Management Services, doing communications that are primarily internal to the university. From my job description: \"The scope of responsibility ranges from crafting critical communications in support of day-to-day operations to defining and executing integrated communication plans in support of strategic initiatives and projects.\" \n \nAs one might imagine, there are many \"strategic initiatives and projects\" within Stanford finances. \n \nPrior to coming to Stanford, I oversaw the very broad range of communications at the Santa Clara County Office of Education, which is primarily a resource and support agency for public education in the county. The agency has about 1,700 employees, and serves 30-plus school districts in the county. Summary I'm an experienced writer and editor with a journalism background, including 20-plus years at the Mercury News. My work at the Merc included an award-winning series based on my year spent teaching 7th-grade English in a middle school.The series was especially well-received in the education community. The Merc submitted the series for Pulitzer consideration, but it may have gotten lost in transit, because it did not win.  \n \nI now work in communications for Stanford's Financial Management Services, doing communications that are primarily internal to the university. From my job description: \"The scope of responsibility ranges from crafting critical communications in support of day-to-day operations to defining and executing integrated communication plans in support of strategic initiatives and projects.\" \n \nAs one might imagine, there are many \"strategic initiatives and projects\" within Stanford finances. \n \nPrior to coming to Stanford, I oversaw the very broad range of communications at the Santa Clara County Office of Education, which is primarily a resource and support agency for public education in the county. The agency has about 1,700 employees, and serves 30-plus school districts in the county. I'm an experienced writer and editor with a journalism background, including 20-plus years at the Mercury News. My work at the Merc included an award-winning series based on my year spent teaching 7th-grade English in a middle school.The series was especially well-received in the education community. The Merc submitted the series for Pulitzer consideration, but it may have gotten lost in transit, because it did not win.  \n \nI now work in communications for Stanford's Financial Management Services, doing communications that are primarily internal to the university. From my job description: \"The scope of responsibility ranges from crafting critical communications in support of day-to-day operations to defining and executing integrated communication plans in support of strategic initiatives and projects.\" \n \nAs one might imagine, there are many \"strategic initiatives and projects\" within Stanford finances. \n \nPrior to coming to Stanford, I oversaw the very broad range of communications at the Santa Clara County Office of Education, which is primarily a resource and support agency for public education in the county. The agency has about 1,700 employees, and serves 30-plus school districts in the county. I'm an experienced writer and editor with a journalism background, including 20-plus years at the Mercury News. My work at the Merc included an award-winning series based on my year spent teaching 7th-grade English in a middle school.The series was especially well-received in the education community. The Merc submitted the series for Pulitzer consideration, but it may have gotten lost in transit, because it did not win.  \n \nI now work in communications for Stanford's Financial Management Services, doing communications that are primarily internal to the university. From my job description: \"The scope of responsibility ranges from crafting critical communications in support of day-to-day operations to defining and executing integrated communication plans in support of strategic initiatives and projects.\" \n \nAs one might imagine, there are many \"strategic initiatives and projects\" within Stanford finances. \n \nPrior to coming to Stanford, I oversaw the very broad range of communications at the Santa Clara County Office of Education, which is primarily a resource and support agency for public education in the county. The agency has about 1,700 employees, and serves 30-plus school districts in the county. Experience Communications Specialist Stanford University June 2013  – Present (2 years 3 months) As a Communications Specialist at Stanford, I do communications supporting daily, time-sensitive matters as well as long-term, large-scale projects. The work also includes ongoing support of a website, http://www.stanford.edu/group/fms/fingate/index.html \n \nI work in the Financial Management Consulting & Support group. More information on the organization and its functions can be found here: http://www.stanford.edu/group/fms/fingate/contact/about_FMS.html Public Information Coordinator and Supervisor Santa Clara County Office of Education November 2005  –  June 2013  (7 years 8 months) Write, edit and oversee content for newsletters, brochures and website \nWrite press releases; act as liaison to media \nMarket SCCOE departments and initiatives; oversee and promote SCCOE brand \nSupport superintendent and other staff in writings, presentations and public appearances \nResearch education issues and advise administration \nCounsel administration on sensitive and confidential issues \nPlan and manage various special events, targeted at both internal and external audiences \nSupervise communications staff and oversee Office public and community relations and communications, including internet-based media Reporter/editor/columnist San Jose Mercury News November 1983  –  November 2005  (22 years 1 month) San Jose, CA --Wrote a weekly column \n \n--Did daily and long-term reporting and writing, including writing numerous stories for Sunday magazine \n \n--Did assigning editing Communications Specialist Stanford University June 2013  – Present (2 years 3 months) As a Communications Specialist at Stanford, I do communications supporting daily, time-sensitive matters as well as long-term, large-scale projects. The work also includes ongoing support of a website, http://www.stanford.edu/group/fms/fingate/index.html \n \nI work in the Financial Management Consulting & Support group. More information on the organization and its functions can be found here: http://www.stanford.edu/group/fms/fingate/contact/about_FMS.html Communications Specialist Stanford University June 2013  – Present (2 years 3 months) As a Communications Specialist at Stanford, I do communications supporting daily, time-sensitive matters as well as long-term, large-scale projects. The work also includes ongoing support of a website, http://www.stanford.edu/group/fms/fingate/index.html \n \nI work in the Financial Management Consulting & Support group. More information on the organization and its functions can be found here: http://www.stanford.edu/group/fms/fingate/contact/about_FMS.html Public Information Coordinator and Supervisor Santa Clara County Office of Education November 2005  –  June 2013  (7 years 8 months) Write, edit and oversee content for newsletters, brochures and website \nWrite press releases; act as liaison to media \nMarket SCCOE departments and initiatives; oversee and promote SCCOE brand \nSupport superintendent and other staff in writings, presentations and public appearances \nResearch education issues and advise administration \nCounsel administration on sensitive and confidential issues \nPlan and manage various special events, targeted at both internal and external audiences \nSupervise communications staff and oversee Office public and community relations and communications, including internet-based media Public Information Coordinator and Supervisor Santa Clara County Office of Education November 2005  –  June 2013  (7 years 8 months) Write, edit and oversee content for newsletters, brochures and website \nWrite press releases; act as liaison to media \nMarket SCCOE departments and initiatives; oversee and promote SCCOE brand \nSupport superintendent and other staff in writings, presentations and public appearances \nResearch education issues and advise administration \nCounsel administration on sensitive and confidential issues \nPlan and manage various special events, targeted at both internal and external audiences \nSupervise communications staff and oversee Office public and community relations and communications, including internet-based media Reporter/editor/columnist San Jose Mercury News November 1983  –  November 2005  (22 years 1 month) San Jose, CA --Wrote a weekly column \n \n--Did daily and long-term reporting and writing, including writing numerous stories for Sunday magazine \n \n--Did assigning editing Reporter/editor/columnist San Jose Mercury News November 1983  –  November 2005  (22 years 1 month) San Jose, CA --Wrote a weekly column \n \n--Did daily and long-term reporting and writing, including writing numerous stories for Sunday magazine \n \n--Did assigning editing Skills Writing and editing Media relations Public information and... Strategic Communications Media Relations Newsletters Press Releases Editing Public Relations Event Management Public Speaking Community Development Research Storytelling Magazines Blogging Internal Communications Journalism See 3+     See less Skills  Writing and editing Media relations Public information and... Strategic Communications Media Relations Newsletters Press Releases Editing Public Relations Event Management Public Speaking Community Development Research Storytelling Magazines Blogging Internal Communications Journalism See 3+     See less Writing and editing Media relations Public information and... Strategic Communications Media Relations Newsletters Press Releases Editing Public Relations Event Management Public Speaking Community Development Research Storytelling Magazines Blogging Internal Communications Journalism See 3+     See less Writing and editing Media relations Public information and... Strategic Communications Media Relations Newsletters Press Releases Editing Public Relations Event Management Public Speaking Community Development Research Storytelling Magazines Blogging Internal Communications Journalism See 3+     See less Education Northwestern University B.S,  Journalism Other Experience & Accomplishments \nInstructor, expository writing, San Jose State University \nClassroom teacher (seventh-grade Language Arts), Brownell Middle School, Gilroy \nNumerous speeches and presentations on the topic of communications and the media to education and community groups Northwestern University B.S,  Journalism Other Experience & Accomplishments \nInstructor, expository writing, San Jose State University \nClassroom teacher (seventh-grade Language Arts), Brownell Middle School, Gilroy \nNumerous speeches and presentations on the topic of communications and the media to education and community groups Northwestern University B.S,  Journalism Other Experience & Accomplishments \nInstructor, expository writing, San Jose State University \nClassroom teacher (seventh-grade Language Arts), Brownell Middle School, Gilroy \nNumerous speeches and presentations on the topic of communications and the media to education and community groups Northwestern University B.S,  Journalism Other Experience & Accomplishments \nInstructor, expository writing, San Jose State University \nClassroom teacher (seventh-grade Language Arts), Brownell Middle School, Gilroy \nNumerous speeches and presentations on the topic of communications and the media to education and community groups ", "Summary Hi, I’m Paige Ryan, and since I was little my passion has caught everyone’s eye. From the boardroom to the arena, where I compete as a rodeo queen, I tackle things head on with a smile. I desire to merge my passion for inspiring people with my expertise in communications to become a valuable asset in the startup community.  Summary Hi, I’m Paige Ryan, and since I was little my passion has caught everyone’s eye. From the boardroom to the arena, where I compete as a rodeo queen, I tackle things head on with a smile. I desire to merge my passion for inspiring people with my expertise in communications to become a valuable asset in the startup community.  Hi, I’m Paige Ryan, and since I was little my passion has caught everyone’s eye. From the boardroom to the arena, where I compete as a rodeo queen, I tackle things head on with a smile. I desire to merge my passion for inspiring people with my expertise in communications to become a valuable asset in the startup community.  Hi, I’m Paige Ryan, and since I was little my passion has caught everyone’s eye. From the boardroom to the arena, where I compete as a rodeo queen, I tackle things head on with a smile. I desire to merge my passion for inspiring people with my expertise in communications to become a valuable asset in the startup community.  Experience Office Coordinator (Contract) NerdWallet 2015  – Present (less than a year) San Francisco Bay Area Manage \"swag\" or promotional materials including implementing new tracking systems to allow for better flow of branding  \nServe as first point of contact for visitors and new hires within the office  \nAssist with the reorganization and streamlining of the main office operations \nWork with the events team to plan and execute company events including themed Happy Hours and the Company Picnic \n 2015 Mother Lode Round-Up Queen Mother Lode Round-Up Rodeo 2015  – Present (less than a year) Sonora, CA Volunteer representative for the Tuolumne County Sherriff's Posse and the Mother Lode Round-Up Rodeo \nExtensive travel experience as a representative for the sport of Professional Rodeo, the TCSP.  \nRegular speaking engagements at local events, schools, and associated rodeo events \nOrganize fundraisers, acquired and expanded sponsorships from local and corporate businesses  \nVolunteer with the Special Needs rodeo events, helping to organize children and volunteers \nAppear in newspaper, radio and television news outlets  \n \n Marketing & Media Coordinator Old City Hotel 2008  – Present (7 years) Sonora, CA Maintain website and update all content in regards to changes in tenants and new events. Promote the business by creating marketing campaigns brochures and such. Sales and Web Carousel Saddlery 2013  –  2015  (2 years) Portola Valley, CA Fit clients with Ariat boots and apparel for English riding using knowledge of current trends and technologies to determine the best styles for their needs \nAssist with the building and launch of the Carousel Saddlery website as well as several social media sales campaigns Communications Specialist Stanford University 2013  –  2014  (1 year) Political Science Create and manage all print and web communications; building websites, launching social media, and creating printed materials. Manage IT needs, run workshops and Summer Research College. Administrative Associate & Fellowship Coordinator Stanford University 2013  –  2013  (less than a year) Stanford Medical School Act as a go between for doctors, handle scheduling, update media including websites. Manage all financial activities for the division. Coordinate communications materials and other aspects of the fellowship program Reporter Morgan Hill Times 2012  –  2013  (1 year) Morgan Hill, CA Covering education and agriculture for the Morgan Hill and San Martin areas. Freelance Reporter Hesperia Star May 2012  –  August 2012  (4 months) Hesperia, CA Covering events for the paper as well as develop feature stories. Shoot articles and prepare photos for publish in the newspaper. Video Intern K-State HDtv May 2011  –  May 2012  (1 year 1 month) Work to create video pieces for the KStateHD.tv video network, including feature, interview and season pieces. Cover athletics events assisting crews to obtain proper footage as well as filming b-roll. Sports Information Intern Kansas State Athletics August 2010  –  May 2012  (1 year 10 months) Address several gameday reporting tasks including assisting in writing gameday stories. Formulate stats, record game activities, monitor phones, and compile post-game notes; at home athletic events. Advertising Staff Agriculturalist Magazine Kansas State 2011  –  2012  (1 year) Manhattan, KS Worked to learn the process of creating a magazine from story brainstorming to proof review. Wrote articles, shot photos, designed advertisement and editorial spreads for the magazine. Communications Intern Big 12 Conference 2011  –  2012  (1 year) Compiled video on assigned student-athletes comprised of interviews conducted during the Big 12 Basketball media days, topical background features, and game film. Administrative Assistant Apple Valley Fire Protection District 2011  –  2012  (1 year) Apple Valley, CA Maintain the fleet services promotions, offices, paperwork, and technology systems. Promotions Assistant Oklahoma State Posse 2009  –  2011  (2 years) Promoted a friendly atmosphere for recruits and fans, at home football games, through answering questions, providing information, and conducting tours. Endorsed the athletics department via events to raise awareness and gain financial backing to the program. Reporting Intern Victor Valley Daily Press 2010  –  2010  (less than a year) Victorville, CA Wrote personal interest stories and features on community events and issues. Assisted with creation of press releases, gathering research and quotes in the field Production Intern San Bernardino County Fair 2009  –  2009  (less than a year) Victorville, CA Shadowed the CEO of the fair in public relations of concerts and fair events. Coordinated tours of the livestock barns, developed promotional and educational materials. Office Coordinator (Contract) NerdWallet 2015  – Present (less than a year) San Francisco Bay Area Manage \"swag\" or promotional materials including implementing new tracking systems to allow for better flow of branding  \nServe as first point of contact for visitors and new hires within the office  \nAssist with the reorganization and streamlining of the main office operations \nWork with the events team to plan and execute company events including themed Happy Hours and the Company Picnic \n Office Coordinator (Contract) NerdWallet 2015  – Present (less than a year) San Francisco Bay Area Manage \"swag\" or promotional materials including implementing new tracking systems to allow for better flow of branding  \nServe as first point of contact for visitors and new hires within the office  \nAssist with the reorganization and streamlining of the main office operations \nWork with the events team to plan and execute company events including themed Happy Hours and the Company Picnic \n 2015 Mother Lode Round-Up Queen Mother Lode Round-Up Rodeo 2015  – Present (less than a year) Sonora, CA Volunteer representative for the Tuolumne County Sherriff's Posse and the Mother Lode Round-Up Rodeo \nExtensive travel experience as a representative for the sport of Professional Rodeo, the TCSP.  \nRegular speaking engagements at local events, schools, and associated rodeo events \nOrganize fundraisers, acquired and expanded sponsorships from local and corporate businesses  \nVolunteer with the Special Needs rodeo events, helping to organize children and volunteers \nAppear in newspaper, radio and television news outlets  \n \n 2015 Mother Lode Round-Up Queen Mother Lode Round-Up Rodeo 2015  – Present (less than a year) Sonora, CA Volunteer representative for the Tuolumne County Sherriff's Posse and the Mother Lode Round-Up Rodeo \nExtensive travel experience as a representative for the sport of Professional Rodeo, the TCSP.  \nRegular speaking engagements at local events, schools, and associated rodeo events \nOrganize fundraisers, acquired and expanded sponsorships from local and corporate businesses  \nVolunteer with the Special Needs rodeo events, helping to organize children and volunteers \nAppear in newspaper, radio and television news outlets  \n \n Marketing & Media Coordinator Old City Hotel 2008  – Present (7 years) Sonora, CA Maintain website and update all content in regards to changes in tenants and new events. Promote the business by creating marketing campaigns brochures and such. Marketing & Media Coordinator Old City Hotel 2008  – Present (7 years) Sonora, CA Maintain website and update all content in regards to changes in tenants and new events. Promote the business by creating marketing campaigns brochures and such. Sales and Web Carousel Saddlery 2013  –  2015  (2 years) Portola Valley, CA Fit clients with Ariat boots and apparel for English riding using knowledge of current trends and technologies to determine the best styles for their needs \nAssist with the building and launch of the Carousel Saddlery website as well as several social media sales campaigns Sales and Web Carousel Saddlery 2013  –  2015  (2 years) Portola Valley, CA Fit clients with Ariat boots and apparel for English riding using knowledge of current trends and technologies to determine the best styles for their needs \nAssist with the building and launch of the Carousel Saddlery website as well as several social media sales campaigns Communications Specialist Stanford University 2013  –  2014  (1 year) Political Science Create and manage all print and web communications; building websites, launching social media, and creating printed materials. Manage IT needs, run workshops and Summer Research College. Communications Specialist Stanford University 2013  –  2014  (1 year) Political Science Create and manage all print and web communications; building websites, launching social media, and creating printed materials. Manage IT needs, run workshops and Summer Research College. Administrative Associate & Fellowship Coordinator Stanford University 2013  –  2013  (less than a year) Stanford Medical School Act as a go between for doctors, handle scheduling, update media including websites. Manage all financial activities for the division. Coordinate communications materials and other aspects of the fellowship program Administrative Associate & Fellowship Coordinator Stanford University 2013  –  2013  (less than a year) Stanford Medical School Act as a go between for doctors, handle scheduling, update media including websites. Manage all financial activities for the division. Coordinate communications materials and other aspects of the fellowship program Reporter Morgan Hill Times 2012  –  2013  (1 year) Morgan Hill, CA Covering education and agriculture for the Morgan Hill and San Martin areas. Reporter Morgan Hill Times 2012  –  2013  (1 year) Morgan Hill, CA Covering education and agriculture for the Morgan Hill and San Martin areas. Freelance Reporter Hesperia Star May 2012  –  August 2012  (4 months) Hesperia, CA Covering events for the paper as well as develop feature stories. Shoot articles and prepare photos for publish in the newspaper. Freelance Reporter Hesperia Star May 2012  –  August 2012  (4 months) Hesperia, CA Covering events for the paper as well as develop feature stories. Shoot articles and prepare photos for publish in the newspaper. Video Intern K-State HDtv May 2011  –  May 2012  (1 year 1 month) Work to create video pieces for the KStateHD.tv video network, including feature, interview and season pieces. Cover athletics events assisting crews to obtain proper footage as well as filming b-roll. Video Intern K-State HDtv May 2011  –  May 2012  (1 year 1 month) Work to create video pieces for the KStateHD.tv video network, including feature, interview and season pieces. Cover athletics events assisting crews to obtain proper footage as well as filming b-roll. Sports Information Intern Kansas State Athletics August 2010  –  May 2012  (1 year 10 months) Address several gameday reporting tasks including assisting in writing gameday stories. Formulate stats, record game activities, monitor phones, and compile post-game notes; at home athletic events. Sports Information Intern Kansas State Athletics August 2010  –  May 2012  (1 year 10 months) Address several gameday reporting tasks including assisting in writing gameday stories. Formulate stats, record game activities, monitor phones, and compile post-game notes; at home athletic events. Advertising Staff Agriculturalist Magazine Kansas State 2011  –  2012  (1 year) Manhattan, KS Worked to learn the process of creating a magazine from story brainstorming to proof review. Wrote articles, shot photos, designed advertisement and editorial spreads for the magazine. Advertising Staff Agriculturalist Magazine Kansas State 2011  –  2012  (1 year) Manhattan, KS Worked to learn the process of creating a magazine from story brainstorming to proof review. Wrote articles, shot photos, designed advertisement and editorial spreads for the magazine. Communications Intern Big 12 Conference 2011  –  2012  (1 year) Compiled video on assigned student-athletes comprised of interviews conducted during the Big 12 Basketball media days, topical background features, and game film. Communications Intern Big 12 Conference 2011  –  2012  (1 year) Compiled video on assigned student-athletes comprised of interviews conducted during the Big 12 Basketball media days, topical background features, and game film. Administrative Assistant Apple Valley Fire Protection District 2011  –  2012  (1 year) Apple Valley, CA Maintain the fleet services promotions, offices, paperwork, and technology systems. Administrative Assistant Apple Valley Fire Protection District 2011  –  2012  (1 year) Apple Valley, CA Maintain the fleet services promotions, offices, paperwork, and technology systems. Promotions Assistant Oklahoma State Posse 2009  –  2011  (2 years) Promoted a friendly atmosphere for recruits and fans, at home football games, through answering questions, providing information, and conducting tours. Endorsed the athletics department via events to raise awareness and gain financial backing to the program. Promotions Assistant Oklahoma State Posse 2009  –  2011  (2 years) Promoted a friendly atmosphere for recruits and fans, at home football games, through answering questions, providing information, and conducting tours. Endorsed the athletics department via events to raise awareness and gain financial backing to the program. Reporting Intern Victor Valley Daily Press 2010  –  2010  (less than a year) Victorville, CA Wrote personal interest stories and features on community events and issues. Assisted with creation of press releases, gathering research and quotes in the field Reporting Intern Victor Valley Daily Press 2010  –  2010  (less than a year) Victorville, CA Wrote personal interest stories and features on community events and issues. Assisted with creation of press releases, gathering research and quotes in the field Production Intern San Bernardino County Fair 2009  –  2009  (less than a year) Victorville, CA Shadowed the CEO of the fair in public relations of concerts and fair events. Coordinated tours of the livestock barns, developed promotional and educational materials. Production Intern San Bernardino County Fair 2009  –  2009  (less than a year) Victorville, CA Shadowed the CEO of the fair in public relations of concerts and fair events. Coordinated tours of the livestock barns, developed promotional and educational materials. Languages English English English Skills Sports Media Relations Social Media Sports Writing Editing Press Releases Broadcast Public Relations Journalism Video Editing Final Cut Pro Photoshop Radio Broadcasting Video Production Facebook Video Advertising Event Planning Marketing Public Speaking Social Networking Writing See 7+     See less Skills  Sports Media Relations Social Media Sports Writing Editing Press Releases Broadcast Public Relations Journalism Video Editing Final Cut Pro Photoshop Radio Broadcasting Video Production Facebook Video Advertising Event Planning Marketing Public Speaking Social Networking Writing See 7+     See less Sports Media Relations Social Media Sports Writing Editing Press Releases Broadcast Public Relations Journalism Video Editing Final Cut Pro Photoshop Radio Broadcasting Video Production Facebook Video Advertising Event Planning Marketing Public Speaking Social Networking Writing See 7+     See less Sports Media Relations Social Media Sports Writing Editing Press Releases Broadcast Public Relations Journalism Video Editing Final Cut Pro Photoshop Radio Broadcasting Video Production Facebook Video Advertising Event Planning Marketing Public Speaking Social Networking Writing See 7+     See less Education Kansas State University Bachelor's degree,  Agricultural Communications and Journalism 2010  – 2012 As a student at Kansas State University I was a member of their NCAA Division 1 Equestrian team, sister in the Zeta Tau Alpha sorority. Academically I was a Big 12 Commissioner's Honor Roll Recipient and received honors.  \n \nAs an athlete and public figure I had the opportunity to give back to the community by volunteering in several projects including Walkin' With a Wildcat, Special Olympics, and local community events.  \n \nAs a ZTA member I helped to launch the inception of Pink Day athletics events for breast cancer research and awareness, in addition I was a member of the sisterhood and judicial committees. Activities and Societies:  Kansas State Equestrian ,  Zeta Tau Alpha ,  Pink Day Athletics Events ,  Big 12 Conference Oklahoma State University Bachelor of Science (BS),  Agricultural Communication/Journalism 2008  – 2011 As a student-athlete at Oklahoma State University I was a Division 1 athlete. Active in the arena and in the classroom I still found time to contribute to the community volunteering for the Special Olympics, and with the Pinto Horse Association. As well I was a Big 12 Commissioner's Honor Roll Recipient and member of the Honors College. Activities and Societies:  Oklahoma State Equestrian ,  Zeta Tau Alpha ,  Agricultural Communicators of Tomorrow Kansas State University Bachelor's degree,  Agricultural Communications and Journalism 2010  – 2012 As a student at Kansas State University I was a member of their NCAA Division 1 Equestrian team, sister in the Zeta Tau Alpha sorority. Academically I was a Big 12 Commissioner's Honor Roll Recipient and received honors.  \n \nAs an athlete and public figure I had the opportunity to give back to the community by volunteering in several projects including Walkin' With a Wildcat, Special Olympics, and local community events.  \n \nAs a ZTA member I helped to launch the inception of Pink Day athletics events for breast cancer research and awareness, in addition I was a member of the sisterhood and judicial committees. Activities and Societies:  Kansas State Equestrian ,  Zeta Tau Alpha ,  Pink Day Athletics Events ,  Big 12 Conference Kansas State University Bachelor's degree,  Agricultural Communications and Journalism 2010  – 2012 As a student at Kansas State University I was a member of their NCAA Division 1 Equestrian team, sister in the Zeta Tau Alpha sorority. Academically I was a Big 12 Commissioner's Honor Roll Recipient and received honors.  \n \nAs an athlete and public figure I had the opportunity to give back to the community by volunteering in several projects including Walkin' With a Wildcat, Special Olympics, and local community events.  \n \nAs a ZTA member I helped to launch the inception of Pink Day athletics events for breast cancer research and awareness, in addition I was a member of the sisterhood and judicial committees. Activities and Societies:  Kansas State Equestrian ,  Zeta Tau Alpha ,  Pink Day Athletics Events ,  Big 12 Conference Kansas State University Bachelor's degree,  Agricultural Communications and Journalism 2010  – 2012 As a student at Kansas State University I was a member of their NCAA Division 1 Equestrian team, sister in the Zeta Tau Alpha sorority. Academically I was a Big 12 Commissioner's Honor Roll Recipient and received honors.  \n \nAs an athlete and public figure I had the opportunity to give back to the community by volunteering in several projects including Walkin' With a Wildcat, Special Olympics, and local community events.  \n \nAs a ZTA member I helped to launch the inception of Pink Day athletics events for breast cancer research and awareness, in addition I was a member of the sisterhood and judicial committees. Activities and Societies:  Kansas State Equestrian ,  Zeta Tau Alpha ,  Pink Day Athletics Events ,  Big 12 Conference Oklahoma State University Bachelor of Science (BS),  Agricultural Communication/Journalism 2008  – 2011 As a student-athlete at Oklahoma State University I was a Division 1 athlete. Active in the arena and in the classroom I still found time to contribute to the community volunteering for the Special Olympics, and with the Pinto Horse Association. As well I was a Big 12 Commissioner's Honor Roll Recipient and member of the Honors College. Activities and Societies:  Oklahoma State Equestrian ,  Zeta Tau Alpha ,  Agricultural Communicators of Tomorrow Oklahoma State University Bachelor of Science (BS),  Agricultural Communication/Journalism 2008  – 2011 As a student-athlete at Oklahoma State University I was a Division 1 athlete. Active in the arena and in the classroom I still found time to contribute to the community volunteering for the Special Olympics, and with the Pinto Horse Association. As well I was a Big 12 Commissioner's Honor Roll Recipient and member of the Honors College. Activities and Societies:  Oklahoma State Equestrian ,  Zeta Tau Alpha ,  Agricultural Communicators of Tomorrow Oklahoma State University Bachelor of Science (BS),  Agricultural Communication/Journalism 2008  – 2011 As a student-athlete at Oklahoma State University I was a Division 1 athlete. Active in the arena and in the classroom I still found time to contribute to the community volunteering for the Special Olympics, and with the Pinto Horse Association. As well I was a Big 12 Commissioner's Honor Roll Recipient and member of the Honors College. Activities and Societies:  Oklahoma State Equestrian ,  Zeta Tau Alpha ,  Agricultural Communicators of Tomorrow ", "Languages conversational Cantonese conversational Cantonese conversational Cantonese Skills Leadership Proposal Writing Coaching Workshop Facilitation Organizational... Strategy Strategic Partnerships Business Development Cross-functional Team... Program Management Program Development Management Leadership Development Training Product Management Career Development... Career Management See 2+     See less Skills  Leadership Proposal Writing Coaching Workshop Facilitation Organizational... Strategy Strategic Partnerships Business Development Cross-functional Team... Program Management Program Development Management Leadership Development Training Product Management Career Development... Career Management See 2+     See less Leadership Proposal Writing Coaching Workshop Facilitation Organizational... Strategy Strategic Partnerships Business Development Cross-functional Team... Program Management Program Development Management Leadership Development Training Product Management Career Development... Career Management See 2+     See less Leadership Proposal Writing Coaching Workshop Facilitation Organizational... Strategy Strategic Partnerships Business Development Cross-functional Team... Program Management Program Development Management Leadership Development Training Product Management Career Development... Career Management See 2+     See less ", "Experience Disaster Medical Assistance Team Safety Officer US Government, Department of Health & Human Services, HRSA November 2011  – Present (3 years 10 months) In November 2011, I was officially accepted as a member of the CA-6 Disaster Medical Assistance Team (DMAT) as a Safety Officer.  \n \nhttp://www.ca6dmat.org/ \n \nA DMAT is a team of intermittent federal employees organized under the National Disaster Medical System (NDMS) to provide emergency medical care and to augment local medical capabilities during times of disaster. Disasters may be earthquakes, hurricanes, epidemics, explosions, floods, or other devastating events. DMATs are typically composed of 100 - 150 medical professionals and support staff organized, trained and prepared to activate. In the event of a disaster, a team of about 35-40 will deploy as a unit to provide medical and health care to disaster victims. \n \nA DMAT provides essential medical care at the disaster site, triages and treats victims at casualty collection points, and provides medical care at staging and reception sites. DMATs have responded to hurricanes, floods, earthquakes, heat waves and terrorist attacks. They also pre-stage for large public events such as the Olympics. University Emergency Manager & Manager for EH&S Training & Communications Stanford University 2005  – Present (10 years) Stanford University Region IX Universities & Colleges Caucus repesentative International Association of Emergency Managers October 2008  –  October 2012  (4 years 1 month) The International Association of Emergency Managers, which has more than 5,000 members worldwide, is a non-profit educational organization dedicated to promoting the \"Principles of Emergency Management\" and representing those professionals whose goals are saving lives and protecting property and the environment during emergencies and disasters. \n \nOur Mission is to advance the profession by promoting the principles of emergency management; to serve our members by providing information, networking and professional development opportunities; and to advance the emergency management profession. Emergency Management & Training and Communications Specialist Stanford University School of Medicine 1996  –  2005  (9 years) EH&S manager Loral Space & Range Systems, Indian Ocean Station, Mahe Seychelles 1994  –  1996  (2 years) Mahe, Seychelles Full service health & safety representative specializing in international shipments of hazardous materials and hazardous waste in addition to drinking water treatment, waste water management and general OSHA compliance. Health & Safety Specialist Westinghouse Marine Division 1990  –  1993  (3 years) Disaster Medical Assistance Team Safety Officer US Government, Department of Health & Human Services, HRSA November 2011  – Present (3 years 10 months) In November 2011, I was officially accepted as a member of the CA-6 Disaster Medical Assistance Team (DMAT) as a Safety Officer.  \n \nhttp://www.ca6dmat.org/ \n \nA DMAT is a team of intermittent federal employees organized under the National Disaster Medical System (NDMS) to provide emergency medical care and to augment local medical capabilities during times of disaster. Disasters may be earthquakes, hurricanes, epidemics, explosions, floods, or other devastating events. DMATs are typically composed of 100 - 150 medical professionals and support staff organized, trained and prepared to activate. In the event of a disaster, a team of about 35-40 will deploy as a unit to provide medical and health care to disaster victims. \n \nA DMAT provides essential medical care at the disaster site, triages and treats victims at casualty collection points, and provides medical care at staging and reception sites. DMATs have responded to hurricanes, floods, earthquakes, heat waves and terrorist attacks. They also pre-stage for large public events such as the Olympics. Disaster Medical Assistance Team Safety Officer US Government, Department of Health & Human Services, HRSA November 2011  – Present (3 years 10 months) In November 2011, I was officially accepted as a member of the CA-6 Disaster Medical Assistance Team (DMAT) as a Safety Officer.  \n \nhttp://www.ca6dmat.org/ \n \nA DMAT is a team of intermittent federal employees organized under the National Disaster Medical System (NDMS) to provide emergency medical care and to augment local medical capabilities during times of disaster. Disasters may be earthquakes, hurricanes, epidemics, explosions, floods, or other devastating events. DMATs are typically composed of 100 - 150 medical professionals and support staff organized, trained and prepared to activate. In the event of a disaster, a team of about 35-40 will deploy as a unit to provide medical and health care to disaster victims. \n \nA DMAT provides essential medical care at the disaster site, triages and treats victims at casualty collection points, and provides medical care at staging and reception sites. DMATs have responded to hurricanes, floods, earthquakes, heat waves and terrorist attacks. They also pre-stage for large public events such as the Olympics. University Emergency Manager & Manager for EH&S Training & Communications Stanford University 2005  – Present (10 years) Stanford University University Emergency Manager & Manager for EH&S Training & Communications Stanford University 2005  – Present (10 years) Stanford University Region IX Universities & Colleges Caucus repesentative International Association of Emergency Managers October 2008  –  October 2012  (4 years 1 month) The International Association of Emergency Managers, which has more than 5,000 members worldwide, is a non-profit educational organization dedicated to promoting the \"Principles of Emergency Management\" and representing those professionals whose goals are saving lives and protecting property and the environment during emergencies and disasters. \n \nOur Mission is to advance the profession by promoting the principles of emergency management; to serve our members by providing information, networking and professional development opportunities; and to advance the emergency management profession. Region IX Universities & Colleges Caucus repesentative International Association of Emergency Managers October 2008  –  October 2012  (4 years 1 month) The International Association of Emergency Managers, which has more than 5,000 members worldwide, is a non-profit educational organization dedicated to promoting the \"Principles of Emergency Management\" and representing those professionals whose goals are saving lives and protecting property and the environment during emergencies and disasters. \n \nOur Mission is to advance the profession by promoting the principles of emergency management; to serve our members by providing information, networking and professional development opportunities; and to advance the emergency management profession. Emergency Management & Training and Communications Specialist Stanford University School of Medicine 1996  –  2005  (9 years) Emergency Management & Training and Communications Specialist Stanford University School of Medicine 1996  –  2005  (9 years) EH&S manager Loral Space & Range Systems, Indian Ocean Station, Mahe Seychelles 1994  –  1996  (2 years) Mahe, Seychelles Full service health & safety representative specializing in international shipments of hazardous materials and hazardous waste in addition to drinking water treatment, waste water management and general OSHA compliance. EH&S manager Loral Space & Range Systems, Indian Ocean Station, Mahe Seychelles 1994  –  1996  (2 years) Mahe, Seychelles Full service health & safety representative specializing in international shipments of hazardous materials and hazardous waste in addition to drinking water treatment, waste water management and general OSHA compliance. Health & Safety Specialist Westinghouse Marine Division 1990  –  1993  (3 years) Health & Safety Specialist Westinghouse Marine Division 1990  –  1993  (3 years) Skills Emergency Management Public Speaking Disaster Recovery Hazardous Materials Training Community Outreach Policy Grant Writing Program Development Program Management Crisis Management Strategic Planning Disaster Response Project Management Public Relations Volunteer Management Social Media Grants NIMS Incident Command Preparedness See 6+     See less Skills  Emergency Management Public Speaking Disaster Recovery Hazardous Materials Training Community Outreach Policy Grant Writing Program Development Program Management Crisis Management Strategic Planning Disaster Response Project Management Public Relations Volunteer Management Social Media Grants NIMS Incident Command Preparedness See 6+     See less Emergency Management Public Speaking Disaster Recovery Hazardous Materials Training Community Outreach Policy Grant Writing Program Development Program Management Crisis Management Strategic Planning Disaster Response Project Management Public Relations Volunteer Management Social Media Grants NIMS Incident Command Preparedness See 6+     See less Emergency Management Public Speaking Disaster Recovery Hazardous Materials Training Community Outreach Policy Grant Writing Program Development Program Management Crisis Management Strategic Planning Disaster Response Project Management Public Relations Volunteer Management Social Media Grants NIMS Incident Command Preparedness See 6+     See less Education University of Redlands BS,  Chemistry 1986  – 1990 Activities and Societies:  Omicron Delta Kappa ,  Varsity Baseball ,  Phi Mu Alpha ,  University Choir ,  Chapel Singers University of Redlands BS Chemistry 1986  – 1990 University of Redlands BS,  Chemistry 1986  – 1990 Activities and Societies:  Omicron Delta Kappa ,  Varsity Baseball ,  Phi Mu Alpha ,  University Choir ,  Chapel Singers University of Redlands BS,  Chemistry 1986  – 1990 Activities and Societies:  Omicron Delta Kappa ,  Varsity Baseball ,  Phi Mu Alpha ,  University Choir ,  Chapel Singers University of Redlands BS,  Chemistry 1986  – 1990 Activities and Societies:  Omicron Delta Kappa ,  Varsity Baseball ,  Phi Mu Alpha ,  University Choir ,  Chapel Singers University of Redlands BS Chemistry 1986  – 1990 University of Redlands BS Chemistry 1986  – 1990 University of Redlands BS Chemistry 1986  – 1990 ", "Summary One of my passions as a professional is to help people succeed in their jobs. I have the opportunity to do this through working in change management, communications and training development/delivery. I enjoy working with people. I enjoy interacting with stakeholders and like to dig in to understand their specific needs. \nAreas of Expertise: \n- Develop and Maintain Change Management project plans and activities \n- Design and Develop training programs to support internal employees and external clients \n- Manage and create communication plans and executables \n- Apply Instructional Systems Design to training programs, focusing on adult learning styles \n- Functional analysis of existing and new training and change management programs Summary One of my passions as a professional is to help people succeed in their jobs. I have the opportunity to do this through working in change management, communications and training development/delivery. I enjoy working with people. I enjoy interacting with stakeholders and like to dig in to understand their specific needs. \nAreas of Expertise: \n- Develop and Maintain Change Management project plans and activities \n- Design and Develop training programs to support internal employees and external clients \n- Manage and create communication plans and executables \n- Apply Instructional Systems Design to training programs, focusing on adult learning styles \n- Functional analysis of existing and new training and change management programs One of my passions as a professional is to help people succeed in their jobs. I have the opportunity to do this through working in change management, communications and training development/delivery. I enjoy working with people. I enjoy interacting with stakeholders and like to dig in to understand their specific needs. \nAreas of Expertise: \n- Develop and Maintain Change Management project plans and activities \n- Design and Develop training programs to support internal employees and external clients \n- Manage and create communication plans and executables \n- Apply Instructional Systems Design to training programs, focusing on adult learning styles \n- Functional analysis of existing and new training and change management programs One of my passions as a professional is to help people succeed in their jobs. I have the opportunity to do this through working in change management, communications and training development/delivery. I enjoy working with people. I enjoy interacting with stakeholders and like to dig in to understand their specific needs. \nAreas of Expertise: \n- Develop and Maintain Change Management project plans and activities \n- Design and Develop training programs to support internal employees and external clients \n- Manage and create communication plans and executables \n- Apply Instructional Systems Design to training programs, focusing on adult learning styles \n- Functional analysis of existing and new training and change management programs Experience Change Management Consultant Lead CSAA Insurance Group, a AAA Insurer August 2015  – Present (1 month) Walnut Creek, CA Organizational Change Management Manager jTask, Inc. February 2008  –  August 2015  (7 years 7 months) san francisco bay area Experienced consultant in Change Management and Training Development. \n \nChange Management: Stakeholder analysis & management, communication planning & distribution, system role mapping \nTraining Developer: Analysis, Design, Development, Implementation, Evaluation \n \nExperienced in the following business sectors: Federal Government, Government Contractors, Higher Education, Research Institutions, Semiconductor Manufacturers, Apparel & Footwear, Food Manufacturer, Software & Firmware. Change Management Lead, SuccessFactors Implementation Hula Partners April 2015  –  June 2015  (3 months) Hayward, CA Change Management Lead Responsible for the delivery of Overall Change Management Strategy \n- Determine Change Management strategy including the Resource Plan & Sponsorship Plan \n- Evaluate and Determine strategy to engage with Stakeholders \n- Determine Communications Strategy \n- Determine strategy for collection of Change Impacts \n- Determine Training/Learning and Development strategy \n- Determine measurement and benefits strategy of project implementation \n- Determine strategy for Sustainability Plan with Project Management Team \n SAP Training Developer Core-Mark International January 2015  –  March 2015  (3 months) San Francisco Bay Area Change Management Consultant Lead EPRI July 2014  –  January 2015  (7 months) Palo Alto, CA Lead Change Management consultant on Microsoft Dynamics CRM implementation. \nPrimarily Responsible for: \nStakeholder analysis & engagement \nChange impact analysis \nCommunication plan & execution \nCoordination of change activities between project team and the business Training Development Lead Blue Diamond Growers March 2014  –  July 2014  (5 months) sacramento, california On an RDS SAP Deployment, Phase 1: \n-Responsible for the training development on all SAP tracks: \nFA, GL, PTP, OTC, WM  \n-Schedule and track completion of SAP Training \n-Developed course content for Orders to Cash, Warehouse Management and Basic SAP Navigation. \nAll course content included WPB content. OCM Communications Specialist Columbia Sportswear January 2014  –  March 2014  (3 months) portland area, oregon Assisted OCM Team with: \nCutover communications \nCommunication strategy \nProject communications \nGo Live readiness communications \nAssisted IT with Go Live Support Model Organizational Change Management Lead: Multiple Projects Applied Materials June 2012  –  January 2014  (1 year 8 months) global •Perform Change Impact Analysis \n•Coordinated OCM activities on project plan with reports to Steering Committee and PMO \n•Managed stakeholders including Global Change Network \n•Create and Lead communications plan and strategy \n•Managed training development and delivery activities, including status reports \n•Coordinate testing activities and engage technical teams with Country Focals Change Management and Training Lead Applied Materials January 2010  –  June 2012  (2 years 6 months) Santa Clara, CA Responsible for designing, developing and deploying Payroll end-user communication and training for Enterprise eTime eV5 \n•Crafted and distributed communications to all company employees \n•Managed and created all course content, including simulations, quizzes, and flash-based files \n•Managed change impact with core project team Organizational Readiness - Training Developer Cadence Design Systems September 2009  –  January 2010  (5 months) SAP Training Developer SanDisk March 2009  –  June 2009  (4 months) Milpitas, CA SAP Training Developer and Instructor, responsible for designing, developing and deploying SAP end-user training for CRM, including internal and external sales representatives SAP Training Developer Applied Materials February 2008  –  April 2009  (1 year 3 months) SAP Training Developer responsible for designing, developing and deploying SAP end-user training for a worldwide SAP implementation. Scope included ownership of all Finance courses and a subset of Project Systems courses resulting in 48 courses distributed to over 7000 people. SAP Training Developer Organizational Readiness at Cadence 2009  –  2009  (less than a year) San Jose, CA SAP HRIM Training Developer responsible for designing, developing and deploying SAP end-user training for MSS, ESS and HR Admin roles \n•Created course descriptions for each course including: learning objectives, duration, delivery mode and validation method \n•Worked directly with HR team members and subject matter experts to obtain course information \n•Created and edited uPerform simulations in SAP NetWeaver, including HR Fast Forward \n•Created quizzes, job aids and classroom exercises in support of course delivery Vice President of Professional Development NPMA 2006  –  2008  (2 years) Senior Product Specialist Sunflower Systems April 2004  –  May 2006  (2 years 2 months) • Developed training materials and programs for product users. \n• Trained all level of users through various forms of media; classroom, web-based, video conferencing. \n• Involved with client implementation including change management, business analysis, and surveying the training needs of current and future clients. \n• Developed training documentation for new and updated software products including assessments and course tests Training and Communications Specialist Stanford University Office of Research Administration June 1996  –  May 2004  (8 years) • Responsible for the course development and delivery to core and distributed end-users for all property classes including: property policy and procedure, asset reporting, Sunflower Assets and Oracle Fixed Assets. This also included the written updates to policies and procedures mandated by regulatory requirements. \n• Represented the property management office to oversee business needs and functions; to ensure they would relate into the new system of record. This included data mapping and prototyping sessions. \n• Coordinated the integration and user acceptance training teams, on-line help tutorials, classroom tutorials, and delivery of training to all University employees. \n• Responsible for researching sponsor mandated training initiatives; then design, create training materials, including: handouts, desktop help-aids, manuals, course catalogues, etc. Property Specialist Stanford University 1996  –  2003  (7 years) Training and Communications Specialist/Property Analyst: Responsible for the course development and delivery to end-users for all property classes including property policy and procedure, asset reporting. Performed written updates to policies and procedures mandated by Federal and State regulatory requirements. Change Management Consultant Lead CSAA Insurance Group, a AAA Insurer August 2015  – Present (1 month) Walnut Creek, CA Change Management Consultant Lead CSAA Insurance Group, a AAA Insurer August 2015  – Present (1 month) Walnut Creek, CA Organizational Change Management Manager jTask, Inc. February 2008  –  August 2015  (7 years 7 months) san francisco bay area Experienced consultant in Change Management and Training Development. \n \nChange Management: Stakeholder analysis & management, communication planning & distribution, system role mapping \nTraining Developer: Analysis, Design, Development, Implementation, Evaluation \n \nExperienced in the following business sectors: Federal Government, Government Contractors, Higher Education, Research Institutions, Semiconductor Manufacturers, Apparel & Footwear, Food Manufacturer, Software & Firmware. Organizational Change Management Manager jTask, Inc. February 2008  –  August 2015  (7 years 7 months) san francisco bay area Experienced consultant in Change Management and Training Development. \n \nChange Management: Stakeholder analysis & management, communication planning & distribution, system role mapping \nTraining Developer: Analysis, Design, Development, Implementation, Evaluation \n \nExperienced in the following business sectors: Federal Government, Government Contractors, Higher Education, Research Institutions, Semiconductor Manufacturers, Apparel & Footwear, Food Manufacturer, Software & Firmware. Change Management Lead, SuccessFactors Implementation Hula Partners April 2015  –  June 2015  (3 months) Hayward, CA Change Management Lead Responsible for the delivery of Overall Change Management Strategy \n- Determine Change Management strategy including the Resource Plan & Sponsorship Plan \n- Evaluate and Determine strategy to engage with Stakeholders \n- Determine Communications Strategy \n- Determine strategy for collection of Change Impacts \n- Determine Training/Learning and Development strategy \n- Determine measurement and benefits strategy of project implementation \n- Determine strategy for Sustainability Plan with Project Management Team \n Change Management Lead, SuccessFactors Implementation Hula Partners April 2015  –  June 2015  (3 months) Hayward, CA Change Management Lead Responsible for the delivery of Overall Change Management Strategy \n- Determine Change Management strategy including the Resource Plan & Sponsorship Plan \n- Evaluate and Determine strategy to engage with Stakeholders \n- Determine Communications Strategy \n- Determine strategy for collection of Change Impacts \n- Determine Training/Learning and Development strategy \n- Determine measurement and benefits strategy of project implementation \n- Determine strategy for Sustainability Plan with Project Management Team \n SAP Training Developer Core-Mark International January 2015  –  March 2015  (3 months) San Francisco Bay Area SAP Training Developer Core-Mark International January 2015  –  March 2015  (3 months) San Francisco Bay Area Change Management Consultant Lead EPRI July 2014  –  January 2015  (7 months) Palo Alto, CA Lead Change Management consultant on Microsoft Dynamics CRM implementation. \nPrimarily Responsible for: \nStakeholder analysis & engagement \nChange impact analysis \nCommunication plan & execution \nCoordination of change activities between project team and the business Change Management Consultant Lead EPRI July 2014  –  January 2015  (7 months) Palo Alto, CA Lead Change Management consultant on Microsoft Dynamics CRM implementation. \nPrimarily Responsible for: \nStakeholder analysis & engagement \nChange impact analysis \nCommunication plan & execution \nCoordination of change activities between project team and the business Training Development Lead Blue Diamond Growers March 2014  –  July 2014  (5 months) sacramento, california On an RDS SAP Deployment, Phase 1: \n-Responsible for the training development on all SAP tracks: \nFA, GL, PTP, OTC, WM  \n-Schedule and track completion of SAP Training \n-Developed course content for Orders to Cash, Warehouse Management and Basic SAP Navigation. \nAll course content included WPB content. Training Development Lead Blue Diamond Growers March 2014  –  July 2014  (5 months) sacramento, california On an RDS SAP Deployment, Phase 1: \n-Responsible for the training development on all SAP tracks: \nFA, GL, PTP, OTC, WM  \n-Schedule and track completion of SAP Training \n-Developed course content for Orders to Cash, Warehouse Management and Basic SAP Navigation. \nAll course content included WPB content. OCM Communications Specialist Columbia Sportswear January 2014  –  March 2014  (3 months) portland area, oregon Assisted OCM Team with: \nCutover communications \nCommunication strategy \nProject communications \nGo Live readiness communications \nAssisted IT with Go Live Support Model OCM Communications Specialist Columbia Sportswear January 2014  –  March 2014  (3 months) portland area, oregon Assisted OCM Team with: \nCutover communications \nCommunication strategy \nProject communications \nGo Live readiness communications \nAssisted IT with Go Live Support Model Organizational Change Management Lead: Multiple Projects Applied Materials June 2012  –  January 2014  (1 year 8 months) global •Perform Change Impact Analysis \n•Coordinated OCM activities on project plan with reports to Steering Committee and PMO \n•Managed stakeholders including Global Change Network \n•Create and Lead communications plan and strategy \n•Managed training development and delivery activities, including status reports \n•Coordinate testing activities and engage technical teams with Country Focals Organizational Change Management Lead: Multiple Projects Applied Materials June 2012  –  January 2014  (1 year 8 months) global •Perform Change Impact Analysis \n•Coordinated OCM activities on project plan with reports to Steering Committee and PMO \n•Managed stakeholders including Global Change Network \n•Create and Lead communications plan and strategy \n•Managed training development and delivery activities, including status reports \n•Coordinate testing activities and engage technical teams with Country Focals Change Management and Training Lead Applied Materials January 2010  –  June 2012  (2 years 6 months) Santa Clara, CA Responsible for designing, developing and deploying Payroll end-user communication and training for Enterprise eTime eV5 \n•Crafted and distributed communications to all company employees \n•Managed and created all course content, including simulations, quizzes, and flash-based files \n•Managed change impact with core project team Change Management and Training Lead Applied Materials January 2010  –  June 2012  (2 years 6 months) Santa Clara, CA Responsible for designing, developing and deploying Payroll end-user communication and training for Enterprise eTime eV5 \n•Crafted and distributed communications to all company employees \n•Managed and created all course content, including simulations, quizzes, and flash-based files \n•Managed change impact with core project team Organizational Readiness - Training Developer Cadence Design Systems September 2009  –  January 2010  (5 months) Organizational Readiness - Training Developer Cadence Design Systems September 2009  –  January 2010  (5 months) SAP Training Developer SanDisk March 2009  –  June 2009  (4 months) Milpitas, CA SAP Training Developer and Instructor, responsible for designing, developing and deploying SAP end-user training for CRM, including internal and external sales representatives SAP Training Developer SanDisk March 2009  –  June 2009  (4 months) Milpitas, CA SAP Training Developer and Instructor, responsible for designing, developing and deploying SAP end-user training for CRM, including internal and external sales representatives SAP Training Developer Applied Materials February 2008  –  April 2009  (1 year 3 months) SAP Training Developer responsible for designing, developing and deploying SAP end-user training for a worldwide SAP implementation. Scope included ownership of all Finance courses and a subset of Project Systems courses resulting in 48 courses distributed to over 7000 people. SAP Training Developer Applied Materials February 2008  –  April 2009  (1 year 3 months) SAP Training Developer responsible for designing, developing and deploying SAP end-user training for a worldwide SAP implementation. Scope included ownership of all Finance courses and a subset of Project Systems courses resulting in 48 courses distributed to over 7000 people. SAP Training Developer Organizational Readiness at Cadence 2009  –  2009  (less than a year) San Jose, CA SAP HRIM Training Developer responsible for designing, developing and deploying SAP end-user training for MSS, ESS and HR Admin roles \n•Created course descriptions for each course including: learning objectives, duration, delivery mode and validation method \n•Worked directly with HR team members and subject matter experts to obtain course information \n•Created and edited uPerform simulations in SAP NetWeaver, including HR Fast Forward \n•Created quizzes, job aids and classroom exercises in support of course delivery SAP Training Developer Organizational Readiness at Cadence 2009  –  2009  (less than a year) San Jose, CA SAP HRIM Training Developer responsible for designing, developing and deploying SAP end-user training for MSS, ESS and HR Admin roles \n•Created course descriptions for each course including: learning objectives, duration, delivery mode and validation method \n•Worked directly with HR team members and subject matter experts to obtain course information \n•Created and edited uPerform simulations in SAP NetWeaver, including HR Fast Forward \n•Created quizzes, job aids and classroom exercises in support of course delivery Vice President of Professional Development NPMA 2006  –  2008  (2 years) Vice President of Professional Development NPMA 2006  –  2008  (2 years) Senior Product Specialist Sunflower Systems April 2004  –  May 2006  (2 years 2 months) • Developed training materials and programs for product users. \n• Trained all level of users through various forms of media; classroom, web-based, video conferencing. \n• Involved with client implementation including change management, business analysis, and surveying the training needs of current and future clients. \n• Developed training documentation for new and updated software products including assessments and course tests Senior Product Specialist Sunflower Systems April 2004  –  May 2006  (2 years 2 months) • Developed training materials and programs for product users. \n• Trained all level of users through various forms of media; classroom, web-based, video conferencing. \n• Involved with client implementation including change management, business analysis, and surveying the training needs of current and future clients. \n• Developed training documentation for new and updated software products including assessments and course tests Training and Communications Specialist Stanford University Office of Research Administration June 1996  –  May 2004  (8 years) • Responsible for the course development and delivery to core and distributed end-users for all property classes including: property policy and procedure, asset reporting, Sunflower Assets and Oracle Fixed Assets. This also included the written updates to policies and procedures mandated by regulatory requirements. \n• Represented the property management office to oversee business needs and functions; to ensure they would relate into the new system of record. This included data mapping and prototyping sessions. \n• Coordinated the integration and user acceptance training teams, on-line help tutorials, classroom tutorials, and delivery of training to all University employees. \n• Responsible for researching sponsor mandated training initiatives; then design, create training materials, including: handouts, desktop help-aids, manuals, course catalogues, etc. Training and Communications Specialist Stanford University Office of Research Administration June 1996  –  May 2004  (8 years) • Responsible for the course development and delivery to core and distributed end-users for all property classes including: property policy and procedure, asset reporting, Sunflower Assets and Oracle Fixed Assets. This also included the written updates to policies and procedures mandated by regulatory requirements. \n• Represented the property management office to oversee business needs and functions; to ensure they would relate into the new system of record. This included data mapping and prototyping sessions. \n• Coordinated the integration and user acceptance training teams, on-line help tutorials, classroom tutorials, and delivery of training to all University employees. \n• Responsible for researching sponsor mandated training initiatives; then design, create training materials, including: handouts, desktop help-aids, manuals, course catalogues, etc. Property Specialist Stanford University 1996  –  2003  (7 years) Training and Communications Specialist/Property Analyst: Responsible for the course development and delivery to end-users for all property classes including property policy and procedure, asset reporting. Performed written updates to policies and procedures mandated by Federal and State regulatory requirements. Property Specialist Stanford University 1996  –  2003  (7 years) Training and Communications Specialist/Property Analyst: Responsible for the course development and delivery to end-users for all property classes including property policy and procedure, asset reporting. Performed written updates to policies and procedures mandated by Federal and State regulatory requirements. Languages English English English Skills Process Improvement Program Management Visio Change Management Business Analysis SAP Team Building Software Documentation SharePoint Analysis Training Project Planning Microsoft Office ERP Data Analysis Technical Writing Project Management Cross-functional Team... Continuous Improvement Business Process... Six Sigma Leadership CRM Integration Business Process Team Leadership Management Consulting Instructional Design Vendor Management Business Intelligence Strategy Management Consulting Requirements Analysis MS Project PMP SAP Implementation Process Engineering Business Transformation Supply Chain Management Project Portfolio... SAP R/3 Enterprise Software SAP HR SDLC Business Process Design Resource Management SAP ERP ADDIE Business Process... See 35+     See less Skills  Process Improvement Program Management Visio Change Management Business Analysis SAP Team Building Software Documentation SharePoint Analysis Training Project Planning Microsoft Office ERP Data Analysis Technical Writing Project Management Cross-functional Team... Continuous Improvement Business Process... Six Sigma Leadership CRM Integration Business Process Team Leadership Management Consulting Instructional Design Vendor Management Business Intelligence Strategy Management Consulting Requirements Analysis MS Project PMP SAP Implementation Process Engineering Business Transformation Supply Chain Management Project Portfolio... SAP R/3 Enterprise Software SAP HR SDLC Business Process Design Resource Management SAP ERP ADDIE Business Process... See 35+     See less Process Improvement Program Management Visio Change Management Business Analysis SAP Team Building Software Documentation SharePoint Analysis Training Project Planning Microsoft Office ERP Data Analysis Technical Writing Project Management Cross-functional Team... Continuous Improvement Business Process... Six Sigma Leadership CRM Integration Business Process Team Leadership Management Consulting Instructional Design Vendor Management Business Intelligence Strategy Management Consulting Requirements Analysis MS Project PMP SAP Implementation Process Engineering Business Transformation Supply Chain Management Project Portfolio... SAP R/3 Enterprise Software SAP HR SDLC Business Process Design Resource Management SAP ERP ADDIE Business Process... See 35+     See less Process Improvement Program Management Visio Change Management Business Analysis SAP Team Building Software Documentation SharePoint Analysis Training Project Planning Microsoft Office ERP Data Analysis Technical Writing Project Management Cross-functional Team... Continuous Improvement Business Process... Six Sigma Leadership CRM Integration Business Process Team Leadership Management Consulting Instructional Design Vendor Management Business Intelligence Strategy Management Consulting Requirements Analysis MS Project PMP SAP Implementation Process Engineering Business Transformation Supply Chain Management Project Portfolio... SAP R/3 Enterprise Software SAP HR SDLC Business Process Design Resource Management SAP ERP ADDIE Business Process... See 35+     See less Honors & Awards ", "Experience Web and Communications Specialist Stanford University June 2014  – Present (1 year 3 months) Under minimal supervision, the Web and Communications Specialist develops and oversees web and communications channels. Job duties include: \n \n• Leading the design, development and maintenance of several project-specific websites, including written and multimedia content, quality control, usability, etc.; \n \n• Developing, distributing and maintaining digital communications; \n \n• Serving as a resource to staff on website and communications design and maintenance, social media, communications and technology; \n \n• Providing technical expertise to SBC on front and back end web development; \n \n• Bringing innovative multimedia and technology strategies to meet organizational goals and enhance SBC's reach and impact; \n \n• Leading web strategy and maintenance; \n \n• Troubleshooting problems and interacting with users (staff, project leaders, community) to improve user experience; \n \n• Maintaining, analyzing, and communicating web data; \n \n• Evaluating third-party technologies for functionality, accessibility, security, and maintainability; \n \n• Supporting end users, maintaining applications and content management tools; \n \n• Growing a digital community on behalf of, and while representing, Stanford Blood Center. CTO Block122 August 2012  – Present (3 years 1 month) San Francisco Bay Area As Chief Technology Officer and Vice-President of Block122, Inc., I am directly responsible for overseeing the primary design and back-end development, as well as executing the front-end development, of the corporate website and online presence. In the broadest sense, my role is comprised of envisioning the company’s service offerings as a web-based business, overseeing and sometimes directly designing/developing its branding assets, leading the implementation of web, mobile and desktop applications, and planning for risk and growth. \n \nAdditionally, in conference with the other corporate officers, I am responsible for finally creating and managing the brand direction of all print and web media/advertising; I also perform managerial duties in the branding and technology department, including hiring and managing design/development/web operations staff (collaborating with the COO, CFO and HR), sourcing vendors for printing and web development contract services, and providing accurate budget reports and projections for the branding/technology departments. \n \nFinally, I work with the other officers to maintain consistency of branding and company culture across all social media outlets. Owner / Designer Industrious Monkey January 2006  – Present (9 years 8 months) As sole-proprietor of a web design and development business, I have had a hand in every phase of the production process, from consultation and contracting, to design, to implementation and maintenance. I have worked with small businesses to develop their branding from the ground up, including logo and collateral design, web presence, and email marketing design and strategy.  \n \nAs an independent contractor, I have designed and built sites with a social media focus for small and mid-sized businesses, a Fortune 200 company, charitable organizations and several tech start-ups. \n \nI prefer clean, content-first web design, and am dedicated to adopting the highest level of web standards, including well-tested user experience best practices, responsive web design, progressive enhancement and graceful degradation techniques. Creative Director TheatreFIRST January 2013  – Present (2 years 8 months) Berkeley, CA The Creative Director is responsible for managing and/or participating in all visual creative consultations, production of promotional art, layout of ads/promotional materials, maintenance of the website including overseeing contractors, newsletter/email marketing design and management, coordinating video/photo production, and overseeing any other opportunities for visual branding/asset creation. Web and Communications Specialist Stanford University June 2014  – Present (1 year 3 months) Under minimal supervision, the Web and Communications Specialist develops and oversees web and communications channels. Job duties include: \n \n• Leading the design, development and maintenance of several project-specific websites, including written and multimedia content, quality control, usability, etc.; \n \n• Developing, distributing and maintaining digital communications; \n \n• Serving as a resource to staff on website and communications design and maintenance, social media, communications and technology; \n \n• Providing technical expertise to SBC on front and back end web development; \n \n• Bringing innovative multimedia and technology strategies to meet organizational goals and enhance SBC's reach and impact; \n \n• Leading web strategy and maintenance; \n \n• Troubleshooting problems and interacting with users (staff, project leaders, community) to improve user experience; \n \n• Maintaining, analyzing, and communicating web data; \n \n• Evaluating third-party technologies for functionality, accessibility, security, and maintainability; \n \n• Supporting end users, maintaining applications and content management tools; \n \n• Growing a digital community on behalf of, and while representing, Stanford Blood Center. Web and Communications Specialist Stanford University June 2014  – Present (1 year 3 months) Under minimal supervision, the Web and Communications Specialist develops and oversees web and communications channels. Job duties include: \n \n• Leading the design, development and maintenance of several project-specific websites, including written and multimedia content, quality control, usability, etc.; \n \n• Developing, distributing and maintaining digital communications; \n \n• Serving as a resource to staff on website and communications design and maintenance, social media, communications and technology; \n \n• Providing technical expertise to SBC on front and back end web development; \n \n• Bringing innovative multimedia and technology strategies to meet organizational goals and enhance SBC's reach and impact; \n \n• Leading web strategy and maintenance; \n \n• Troubleshooting problems and interacting with users (staff, project leaders, community) to improve user experience; \n \n• Maintaining, analyzing, and communicating web data; \n \n• Evaluating third-party technologies for functionality, accessibility, security, and maintainability; \n \n• Supporting end users, maintaining applications and content management tools; \n \n• Growing a digital community on behalf of, and while representing, Stanford Blood Center. CTO Block122 August 2012  – Present (3 years 1 month) San Francisco Bay Area As Chief Technology Officer and Vice-President of Block122, Inc., I am directly responsible for overseeing the primary design and back-end development, as well as executing the front-end development, of the corporate website and online presence. In the broadest sense, my role is comprised of envisioning the company’s service offerings as a web-based business, overseeing and sometimes directly designing/developing its branding assets, leading the implementation of web, mobile and desktop applications, and planning for risk and growth. \n \nAdditionally, in conference with the other corporate officers, I am responsible for finally creating and managing the brand direction of all print and web media/advertising; I also perform managerial duties in the branding and technology department, including hiring and managing design/development/web operations staff (collaborating with the COO, CFO and HR), sourcing vendors for printing and web development contract services, and providing accurate budget reports and projections for the branding/technology departments. \n \nFinally, I work with the other officers to maintain consistency of branding and company culture across all social media outlets. CTO Block122 August 2012  – Present (3 years 1 month) San Francisco Bay Area As Chief Technology Officer and Vice-President of Block122, Inc., I am directly responsible for overseeing the primary design and back-end development, as well as executing the front-end development, of the corporate website and online presence. In the broadest sense, my role is comprised of envisioning the company’s service offerings as a web-based business, overseeing and sometimes directly designing/developing its branding assets, leading the implementation of web, mobile and desktop applications, and planning for risk and growth. \n \nAdditionally, in conference with the other corporate officers, I am responsible for finally creating and managing the brand direction of all print and web media/advertising; I also perform managerial duties in the branding and technology department, including hiring and managing design/development/web operations staff (collaborating with the COO, CFO and HR), sourcing vendors for printing and web development contract services, and providing accurate budget reports and projections for the branding/technology departments. \n \nFinally, I work with the other officers to maintain consistency of branding and company culture across all social media outlets. Owner / Designer Industrious Monkey January 2006  – Present (9 years 8 months) As sole-proprietor of a web design and development business, I have had a hand in every phase of the production process, from consultation and contracting, to design, to implementation and maintenance. I have worked with small businesses to develop their branding from the ground up, including logo and collateral design, web presence, and email marketing design and strategy.  \n \nAs an independent contractor, I have designed and built sites with a social media focus for small and mid-sized businesses, a Fortune 200 company, charitable organizations and several tech start-ups. \n \nI prefer clean, content-first web design, and am dedicated to adopting the highest level of web standards, including well-tested user experience best practices, responsive web design, progressive enhancement and graceful degradation techniques. Owner / Designer Industrious Monkey January 2006  – Present (9 years 8 months) As sole-proprietor of a web design and development business, I have had a hand in every phase of the production process, from consultation and contracting, to design, to implementation and maintenance. I have worked with small businesses to develop their branding from the ground up, including logo and collateral design, web presence, and email marketing design and strategy.  \n \nAs an independent contractor, I have designed and built sites with a social media focus for small and mid-sized businesses, a Fortune 200 company, charitable organizations and several tech start-ups. \n \nI prefer clean, content-first web design, and am dedicated to adopting the highest level of web standards, including well-tested user experience best practices, responsive web design, progressive enhancement and graceful degradation techniques. Creative Director TheatreFIRST January 2013  – Present (2 years 8 months) Berkeley, CA The Creative Director is responsible for managing and/or participating in all visual creative consultations, production of promotional art, layout of ads/promotional materials, maintenance of the website including overseeing contractors, newsletter/email marketing design and management, coordinating video/photo production, and overseeing any other opportunities for visual branding/asset creation. Creative Director TheatreFIRST January 2013  – Present (2 years 8 months) Berkeley, CA The Creative Director is responsible for managing and/or participating in all visual creative consultations, production of promotional art, layout of ads/promotional materials, maintenance of the website including overseeing contractors, newsletter/email marketing design and management, coordinating video/photo production, and overseeing any other opportunities for visual branding/asset creation. Skills Web Design Web Development Graphic Design Start-up Leadership Project Management Writing Editing Performing Arts Voice Over Skills  Web Design Web Development Graphic Design Start-up Leadership Project Management Writing Editing Performing Arts Voice Over Web Design Web Development Graphic Design Start-up Leadership Project Management Writing Editing Performing Arts Voice Over Web Design Web Development Graphic Design Start-up Leadership Project Management Writing Editing Performing Arts Voice Over Education John Carroll University B.A.Cl.,  English Literature & Classical Languages 1990  – 1994 Castellano Scholar (4-year, full-tuition academic scholarship awarded to one student annually for the study of Classics). Dual degree in English Literature and Classical Languages, with a focus on Latin. Activities and Societies:  Theatre (Acting and Directing) John Carroll University B.A.Cl.,  English Literature & Classical Languages 1990  – 1994 Castellano Scholar (4-year, full-tuition academic scholarship awarded to one student annually for the study of Classics). Dual degree in English Literature and Classical Languages, with a focus on Latin. Activities and Societies:  Theatre (Acting and Directing) John Carroll University B.A.Cl.,  English Literature & Classical Languages 1990  – 1994 Castellano Scholar (4-year, full-tuition academic scholarship awarded to one student annually for the study of Classics). Dual degree in English Literature and Classical Languages, with a focus on Latin. Activities and Societies:  Theatre (Acting and Directing) John Carroll University B.A.Cl.,  English Literature & Classical Languages 1990  – 1994 Castellano Scholar (4-year, full-tuition academic scholarship awarded to one student annually for the study of Classics). Dual degree in English Literature and Classical Languages, with a focus on Latin. Activities and Societies:  Theatre (Acting and Directing) ", "Skills InDesign Photoshop Illustrator Acrobat Excel Fasttrack Schedule Filemaker Pro CCI pagination system Microsoft Word MIcrosoft Powerpoint QuarkXPress Newspaper Editing Magazines Editorial Stories Headline Writing Print Production Layout Copy Editing Adobe Creative Suite Photo Editing Writing Information Graphics Mac Illustration AP Style Journalism Proofreading Brochures Typography Art Direction HTML CSS Drupal Wordpress Chicago Style Ap Style Image Editing Storytelling Graphic Design Pagination Adobe Acrobat FileMaker Blogging WordPress Newspapers Newspaper Design News Writing Online Publishing See 35+     See less Skills  InDesign Photoshop Illustrator Acrobat Excel Fasttrack Schedule Filemaker Pro CCI pagination system Microsoft Word MIcrosoft Powerpoint QuarkXPress Newspaper Editing Magazines Editorial Stories Headline Writing Print Production Layout Copy Editing Adobe Creative Suite Photo Editing Writing Information Graphics Mac Illustration AP Style Journalism Proofreading Brochures Typography Art Direction HTML CSS Drupal Wordpress Chicago Style Ap Style Image Editing Storytelling Graphic Design Pagination Adobe Acrobat FileMaker Blogging WordPress Newspapers Newspaper Design News Writing Online Publishing See 35+     See less InDesign Photoshop Illustrator Acrobat Excel Fasttrack Schedule Filemaker Pro CCI pagination system Microsoft Word MIcrosoft Powerpoint QuarkXPress Newspaper Editing Magazines Editorial Stories Headline Writing Print Production Layout Copy Editing Adobe Creative Suite Photo Editing Writing Information Graphics Mac Illustration AP Style Journalism Proofreading Brochures Typography Art Direction HTML CSS Drupal Wordpress Chicago Style Ap Style Image Editing Storytelling Graphic Design Pagination Adobe Acrobat FileMaker Blogging WordPress Newspapers Newspaper Design News Writing Online Publishing See 35+     See less InDesign Photoshop Illustrator Acrobat Excel Fasttrack Schedule Filemaker Pro CCI pagination system Microsoft Word MIcrosoft Powerpoint QuarkXPress Newspaper Editing Magazines Editorial Stories Headline Writing Print Production Layout Copy Editing Adobe Creative Suite Photo Editing Writing Information Graphics Mac Illustration AP Style Journalism Proofreading Brochures Typography Art Direction HTML CSS Drupal Wordpress Chicago Style Ap Style Image Editing Storytelling Graphic Design Pagination Adobe Acrobat FileMaker Blogging WordPress Newspapers Newspaper Design News Writing Online Publishing See 35+     See less Honors & Awards ", "Summary Results-driven advertising/marketing professional with specialization in the pharmaceutical, biotechnology and medical device sectors. Over 7 years of experience in delivering effective communications across print, digital, broadcast, and social media. Experienced in brand planning, marketing strategy, tactical development, and project/ budgetary management. Exhibits excellence in leadership, teamwork, organization, attention-to-detail, and communication skills. Recognized for being innovative and solution-oriented by making recommendations that increase efficiencies and drive down costs.  \n \nSpecialties: advertising, marketing, communications, project management, tactical development, print, web, interactive, digital, strategic planning, branding, media, financial management, timeline development, staffing, event planning, editing, client-service, biotechnology, pharmaceuticals, health literacy, non-profit, conversational Spanish, proficiency in Microsoft Office and Microsoft Project Summary Results-driven advertising/marketing professional with specialization in the pharmaceutical, biotechnology and medical device sectors. Over 7 years of experience in delivering effective communications across print, digital, broadcast, and social media. Experienced in brand planning, marketing strategy, tactical development, and project/ budgetary management. Exhibits excellence in leadership, teamwork, organization, attention-to-detail, and communication skills. Recognized for being innovative and solution-oriented by making recommendations that increase efficiencies and drive down costs.  \n \nSpecialties: advertising, marketing, communications, project management, tactical development, print, web, interactive, digital, strategic planning, branding, media, financial management, timeline development, staffing, event planning, editing, client-service, biotechnology, pharmaceuticals, health literacy, non-profit, conversational Spanish, proficiency in Microsoft Office and Microsoft Project Results-driven advertising/marketing professional with specialization in the pharmaceutical, biotechnology and medical device sectors. Over 7 years of experience in delivering effective communications across print, digital, broadcast, and social media. Experienced in brand planning, marketing strategy, tactical development, and project/ budgetary management. Exhibits excellence in leadership, teamwork, organization, attention-to-detail, and communication skills. Recognized for being innovative and solution-oriented by making recommendations that increase efficiencies and drive down costs.  \n \nSpecialties: advertising, marketing, communications, project management, tactical development, print, web, interactive, digital, strategic planning, branding, media, financial management, timeline development, staffing, event planning, editing, client-service, biotechnology, pharmaceuticals, health literacy, non-profit, conversational Spanish, proficiency in Microsoft Office and Microsoft Project Results-driven advertising/marketing professional with specialization in the pharmaceutical, biotechnology and medical device sectors. Over 7 years of experience in delivering effective communications across print, digital, broadcast, and social media. Experienced in brand planning, marketing strategy, tactical development, and project/ budgetary management. Exhibits excellence in leadership, teamwork, organization, attention-to-detail, and communication skills. Recognized for being innovative and solution-oriented by making recommendations that increase efficiencies and drive down costs.  \n \nSpecialties: advertising, marketing, communications, project management, tactical development, print, web, interactive, digital, strategic planning, branding, media, financial management, timeline development, staffing, event planning, editing, client-service, biotechnology, pharmaceuticals, health literacy, non-profit, conversational Spanish, proficiency in Microsoft Office and Microsoft Project Experience Senior Communications Specialist Stanford University January 2014  – Present (1 year 8 months) Palo Alto Senior Account Executive Havas Worldwide San Francisco November 2011  –  October 2013  (2 years) San Francisco, CA Independently managed three key biopharmaceutical brands and increased ROI for clients through strategic, innovative, and targeted digital communications \n \n-Advised clients in the development of marketing and tactical plans that successfully delivered upon the brand's key goals and objectives \n-Oversaw and managed the development of all promotional tactics from start to finish, including creative briefing, project management, financial management, coordination with vendors, and post-launch optimization \n-Successfully launched Genentech's first-ever comprehensive social media program for a Cystic Fibrosis treatment  \n-Managed several site redesigns and mobile site launches, including Nutropin.com and CFLiving.com Senior Account Executive Mortar April 2011  –  November 2011  (8 months) San Francisco, CA Built the agency's portfolio in the medical device arena while guiding the creation of strong brands for existing clients \n \n-Contributed to the successful win of three new business accounts in the Medical Device arena  \n-Facilitated the development of key branding components such as positioning, messaging, value propositions, and creative executions in order to drive successful product launches \n-Effectively managed the re-brand of Golden Gate University including corporate identity, website development, online and outdoor advertising campaigns, media planning/campaign optimization, and social media integration Communications Manager (Volunteer) YWAM Destination Paradise June 2010  –  January 2011  (8 months) San Pedro, Belize Enhanced alumni programs, managed volunteer programs, and implemented innovative marketing protocols that increased enrollment in leadership-based Discipleship Training School by 40%  \n \n-Nurtured Alumni relations by developing and maintaining alumni database and created bi-annual alumni news-letter \n-Planned and implemented a “Week of Service” in San Pedro and coordinated volunteers to serve in areas matching their skills and expertise \n-Created strategic marketing plan based on market research insights, and executed relevant tactics \n-Oversaw development of ad campaign for 2010-2011 publications \n-Managed media buying and ad placements in two major publications \n-Maintained website, blog, and social networking sites including Facebook and Twitter Account Executive AbelsonTaylor, Inc. January 2009  –  January 2010  (1 year 1 month) Chicago Represented both the agency and the client in a dual role position which led to work efficiencies and agency growth \n \n-Facilitated Medical, Regulatory, and Legal review meetings at Eli Lilly and communicated recommendations to agency partners. Ensured that all promotional pieces met MRL requirements before going to production \n-Managed assigned projects (including global initiatives) from job initiation through production, ensuring that they met client expectations and were completed within appropriate timeframe, scope, and budget \n-Standardized workflow processes in order to decrease development costs and keep clients satisfied \n-Independently planned and implemented all aspects of a four-week preceptorship program which led to improved client/agency relations and a seamless transition into Integrated Network Marketing Assistant Account Executive AbelsonTaylor, Inc. November 2007  –  January 2009  (1 year 3 months) Chicago, IL Delivered excellence in client-service and project management while mentoring direct reports \n \n-Managed multi-million dollar client budget and developed unique system for financial tracking which reduced the need for revised estimates \n-Created and managed timelines for over 40 projects and proactively kept client and internal team informed of project status  \n-Spearheaded the development of a web-based Global Knowledge Exchange which resulted in shared resources and consistent messaging among Takeda affiliates \n-Led research efforts and project management of cross-cultural initiatives which influenced strategy, tactical direction, and agency revenue streams \n-Maintained thorough understanding of client and internal processes in order to mentor and guide Account and Traffic Coordinators Traffic/Account Coordinator AbelsonTaylor, Inc. July 2006  –  November 2007  (1 year 5 months) Chicago, IL -Maintained internal and client status reports for six brands and conducted weekly status meetings \n-Engaged in daily communication with the client through submissions to Medical, Regulatory, and Legal review teams \n-Independently managed the archiving of Amgen jobs in accordance with Amgen procedures \n-Improved workflow processes by commissioning senior executives for additional personnel in traffic department Senior Communications Specialist Stanford University January 2014  – Present (1 year 8 months) Palo Alto Senior Communications Specialist Stanford University January 2014  – Present (1 year 8 months) Palo Alto Senior Account Executive Havas Worldwide San Francisco November 2011  –  October 2013  (2 years) San Francisco, CA Independently managed three key biopharmaceutical brands and increased ROI for clients through strategic, innovative, and targeted digital communications \n \n-Advised clients in the development of marketing and tactical plans that successfully delivered upon the brand's key goals and objectives \n-Oversaw and managed the development of all promotional tactics from start to finish, including creative briefing, project management, financial management, coordination with vendors, and post-launch optimization \n-Successfully launched Genentech's first-ever comprehensive social media program for a Cystic Fibrosis treatment  \n-Managed several site redesigns and mobile site launches, including Nutropin.com and CFLiving.com Senior Account Executive Havas Worldwide San Francisco November 2011  –  October 2013  (2 years) San Francisco, CA Independently managed three key biopharmaceutical brands and increased ROI for clients through strategic, innovative, and targeted digital communications \n \n-Advised clients in the development of marketing and tactical plans that successfully delivered upon the brand's key goals and objectives \n-Oversaw and managed the development of all promotional tactics from start to finish, including creative briefing, project management, financial management, coordination with vendors, and post-launch optimization \n-Successfully launched Genentech's first-ever comprehensive social media program for a Cystic Fibrosis treatment  \n-Managed several site redesigns and mobile site launches, including Nutropin.com and CFLiving.com Senior Account Executive Mortar April 2011  –  November 2011  (8 months) San Francisco, CA Built the agency's portfolio in the medical device arena while guiding the creation of strong brands for existing clients \n \n-Contributed to the successful win of three new business accounts in the Medical Device arena  \n-Facilitated the development of key branding components such as positioning, messaging, value propositions, and creative executions in order to drive successful product launches \n-Effectively managed the re-brand of Golden Gate University including corporate identity, website development, online and outdoor advertising campaigns, media planning/campaign optimization, and social media integration Senior Account Executive Mortar April 2011  –  November 2011  (8 months) San Francisco, CA Built the agency's portfolio in the medical device arena while guiding the creation of strong brands for existing clients \n \n-Contributed to the successful win of three new business accounts in the Medical Device arena  \n-Facilitated the development of key branding components such as positioning, messaging, value propositions, and creative executions in order to drive successful product launches \n-Effectively managed the re-brand of Golden Gate University including corporate identity, website development, online and outdoor advertising campaigns, media planning/campaign optimization, and social media integration Communications Manager (Volunteer) YWAM Destination Paradise June 2010  –  January 2011  (8 months) San Pedro, Belize Enhanced alumni programs, managed volunteer programs, and implemented innovative marketing protocols that increased enrollment in leadership-based Discipleship Training School by 40%  \n \n-Nurtured Alumni relations by developing and maintaining alumni database and created bi-annual alumni news-letter \n-Planned and implemented a “Week of Service” in San Pedro and coordinated volunteers to serve in areas matching their skills and expertise \n-Created strategic marketing plan based on market research insights, and executed relevant tactics \n-Oversaw development of ad campaign for 2010-2011 publications \n-Managed media buying and ad placements in two major publications \n-Maintained website, blog, and social networking sites including Facebook and Twitter Communications Manager (Volunteer) YWAM Destination Paradise June 2010  –  January 2011  (8 months) San Pedro, Belize Enhanced alumni programs, managed volunteer programs, and implemented innovative marketing protocols that increased enrollment in leadership-based Discipleship Training School by 40%  \n \n-Nurtured Alumni relations by developing and maintaining alumni database and created bi-annual alumni news-letter \n-Planned and implemented a “Week of Service” in San Pedro and coordinated volunteers to serve in areas matching their skills and expertise \n-Created strategic marketing plan based on market research insights, and executed relevant tactics \n-Oversaw development of ad campaign for 2010-2011 publications \n-Managed media buying and ad placements in two major publications \n-Maintained website, blog, and social networking sites including Facebook and Twitter Account Executive AbelsonTaylor, Inc. January 2009  –  January 2010  (1 year 1 month) Chicago Represented both the agency and the client in a dual role position which led to work efficiencies and agency growth \n \n-Facilitated Medical, Regulatory, and Legal review meetings at Eli Lilly and communicated recommendations to agency partners. Ensured that all promotional pieces met MRL requirements before going to production \n-Managed assigned projects (including global initiatives) from job initiation through production, ensuring that they met client expectations and were completed within appropriate timeframe, scope, and budget \n-Standardized workflow processes in order to decrease development costs and keep clients satisfied \n-Independently planned and implemented all aspects of a four-week preceptorship program which led to improved client/agency relations and a seamless transition into Integrated Network Marketing Account Executive AbelsonTaylor, Inc. January 2009  –  January 2010  (1 year 1 month) Chicago Represented both the agency and the client in a dual role position which led to work efficiencies and agency growth \n \n-Facilitated Medical, Regulatory, and Legal review meetings at Eli Lilly and communicated recommendations to agency partners. Ensured that all promotional pieces met MRL requirements before going to production \n-Managed assigned projects (including global initiatives) from job initiation through production, ensuring that they met client expectations and were completed within appropriate timeframe, scope, and budget \n-Standardized workflow processes in order to decrease development costs and keep clients satisfied \n-Independently planned and implemented all aspects of a four-week preceptorship program which led to improved client/agency relations and a seamless transition into Integrated Network Marketing Assistant Account Executive AbelsonTaylor, Inc. November 2007  –  January 2009  (1 year 3 months) Chicago, IL Delivered excellence in client-service and project management while mentoring direct reports \n \n-Managed multi-million dollar client budget and developed unique system for financial tracking which reduced the need for revised estimates \n-Created and managed timelines for over 40 projects and proactively kept client and internal team informed of project status  \n-Spearheaded the development of a web-based Global Knowledge Exchange which resulted in shared resources and consistent messaging among Takeda affiliates \n-Led research efforts and project management of cross-cultural initiatives which influenced strategy, tactical direction, and agency revenue streams \n-Maintained thorough understanding of client and internal processes in order to mentor and guide Account and Traffic Coordinators Assistant Account Executive AbelsonTaylor, Inc. November 2007  –  January 2009  (1 year 3 months) Chicago, IL Delivered excellence in client-service and project management while mentoring direct reports \n \n-Managed multi-million dollar client budget and developed unique system for financial tracking which reduced the need for revised estimates \n-Created and managed timelines for over 40 projects and proactively kept client and internal team informed of project status  \n-Spearheaded the development of a web-based Global Knowledge Exchange which resulted in shared resources and consistent messaging among Takeda affiliates \n-Led research efforts and project management of cross-cultural initiatives which influenced strategy, tactical direction, and agency revenue streams \n-Maintained thorough understanding of client and internal processes in order to mentor and guide Account and Traffic Coordinators Traffic/Account Coordinator AbelsonTaylor, Inc. July 2006  –  November 2007  (1 year 5 months) Chicago, IL -Maintained internal and client status reports for six brands and conducted weekly status meetings \n-Engaged in daily communication with the client through submissions to Medical, Regulatory, and Legal review teams \n-Independently managed the archiving of Amgen jobs in accordance with Amgen procedures \n-Improved workflow processes by commissioning senior executives for additional personnel in traffic department Traffic/Account Coordinator AbelsonTaylor, Inc. July 2006  –  November 2007  (1 year 5 months) Chicago, IL -Maintained internal and client status reports for six brands and conducted weekly status meetings \n-Engaged in daily communication with the client through submissions to Medical, Regulatory, and Legal review teams \n-Independently managed the archiving of Amgen jobs in accordance with Amgen procedures \n-Improved workflow processes by commissioning senior executives for additional personnel in traffic department Languages Spanish Spanish Spanish Skills Advertising Integrated Marketing Marketing Marketing Communications Digital Strategy Marketing Strategy Facebook Pharmaceutical Industry Strategy Relationship Marketing Creative Direction Social Media Public Relations Account Management Strategic Planning Maintaining Strong... Mobile Marketing Market Research Digital Marketing Leadership See 5+     See less Skills  Advertising Integrated Marketing Marketing Marketing Communications Digital Strategy Marketing Strategy Facebook Pharmaceutical Industry Strategy Relationship Marketing Creative Direction Social Media Public Relations Account Management Strategic Planning Maintaining Strong... Mobile Marketing Market Research Digital Marketing Leadership See 5+     See less Advertising Integrated Marketing Marketing Marketing Communications Digital Strategy Marketing Strategy Facebook Pharmaceutical Industry Strategy Relationship Marketing Creative Direction Social Media Public Relations Account Management Strategic Planning Maintaining Strong... Mobile Marketing Market Research Digital Marketing Leadership See 5+     See less Advertising Integrated Marketing Marketing Marketing Communications Digital Strategy Marketing Strategy Facebook Pharmaceutical Industry Strategy Relationship Marketing Creative Direction Social Media Public Relations Account Management Strategic Planning Maintaining Strong... Mobile Marketing Market Research Digital Marketing Leadership See 5+     See less Education Indiana University Bloomington B.A,  Telecommunications 2002  – 2006 Indiana University Bloomington B.A,  Telecommunications 2002  – 2006 Indiana University Bloomington B.A,  Telecommunications 2002  – 2006 Indiana University Bloomington B.A,  Telecommunications 2002  – 2006 ", "Experience Communications Specialist Stanford University April 2012  – Present (3 years 5 months) Communications Specialist Stanford University April 2012  – Present (3 years 5 months) Communications Specialist Stanford University April 2012  – Present (3 years 5 months) Skills Skills     ", "Summary Holly Deremo is an Marketing and Communications Specialist at Stanford University in Palo Alto, California. With a focus in strategic implementation and communications development surrounding environmental based programs, as well as multimedia project management. She also manages EH&S'​ program branding and stakeholder relations. In her spare time she conducts research to better understand the use of behavior change to implement long term sustainable resource reduction.  \n \nHolly is a graduate of the University of Michigan's School of Natural Resources and Environment where she received her B.A. in Ecological Science, with an emphasis on Sustainability and Communications. While at UM, Holly was vice-president of the Net Impact Ross Business School Undergraduate Chapter, a Planet Blue Student Ambassador (UM's official student sustainability representatives), a student project manager for facilities, and a Communications associate at the Graham Institute for Sustainability research. Following her time at UM, Holly spent 2 years in the consumer products industry at Amway.  Summary Holly Deremo is an Marketing and Communications Specialist at Stanford University in Palo Alto, California. With a focus in strategic implementation and communications development surrounding environmental based programs, as well as multimedia project management. She also manages EH&S'​ program branding and stakeholder relations. In her spare time she conducts research to better understand the use of behavior change to implement long term sustainable resource reduction.  \n \nHolly is a graduate of the University of Michigan's School of Natural Resources and Environment where she received her B.A. in Ecological Science, with an emphasis on Sustainability and Communications. While at UM, Holly was vice-president of the Net Impact Ross Business School Undergraduate Chapter, a Planet Blue Student Ambassador (UM's official student sustainability representatives), a student project manager for facilities, and a Communications associate at the Graham Institute for Sustainability research. Following her time at UM, Holly spent 2 years in the consumer products industry at Amway.  Holly Deremo is an Marketing and Communications Specialist at Stanford University in Palo Alto, California. With a focus in strategic implementation and communications development surrounding environmental based programs, as well as multimedia project management. She also manages EH&S'​ program branding and stakeholder relations. In her spare time she conducts research to better understand the use of behavior change to implement long term sustainable resource reduction.  \n \nHolly is a graduate of the University of Michigan's School of Natural Resources and Environment where she received her B.A. in Ecological Science, with an emphasis on Sustainability and Communications. While at UM, Holly was vice-president of the Net Impact Ross Business School Undergraduate Chapter, a Planet Blue Student Ambassador (UM's official student sustainability representatives), a student project manager for facilities, and a Communications associate at the Graham Institute for Sustainability research. Following her time at UM, Holly spent 2 years in the consumer products industry at Amway.  Holly Deremo is an Marketing and Communications Specialist at Stanford University in Palo Alto, California. With a focus in strategic implementation and communications development surrounding environmental based programs, as well as multimedia project management. She also manages EH&S'​ program branding and stakeholder relations. In her spare time she conducts research to better understand the use of behavior change to implement long term sustainable resource reduction.  \n \nHolly is a graduate of the University of Michigan's School of Natural Resources and Environment where she received her B.A. in Ecological Science, with an emphasis on Sustainability and Communications. While at UM, Holly was vice-president of the Net Impact Ross Business School Undergraduate Chapter, a Planet Blue Student Ambassador (UM's official student sustainability representatives), a student project manager for facilities, and a Communications associate at the Graham Institute for Sustainability research. Following her time at UM, Holly spent 2 years in the consumer products industry at Amway.  Experience Marketing and Communications Specialist Stanford University June 2015  – Present (3 months) Palo Alto CA Corporate Social Responsibility Associate Amway Global 2012  –  May 2015  (3 years) Ada, MI Implement, support, and maintain a broad range of communications efforts, including project management and marketing, brand strategy, facilities and manufacturing communications, employee engagement, digital & web presence and global corporate social responsibility communications. Provide project development and implementation support on community and environmental based comms initiatives such as clean water, childhood nutrition, environmental stewardship, and materials cycling. Associate - Graham Institute for Sustainability University of Michigan 2011  –  2013  (2 years) Ann Arbor, Michigan Prepared promotional and marketing materials for student leaders, faculty, and staff on campus to encourage sustainability / recycling and environmental impact awareness within the greater University of Michigan system including hospitals, academia, and athletics. Engaged and supported the Planet Blue Student Leaders program by helping to establish and develop key stakeholder relationships with the community and student body. Corporate Citizenship Intern Amway Global May 2012  –  August 2012  (4 months) Ada, MI Created large scale competitive landscape market assessment to evaluate environmental and CSR messaging from an operational and product sustainability perspective from major competitors within the cosmetics, nutrition, and home-care marketplaces. Established and launched a printing paper reduction campaign in partnership with IT to reduce the amount of paper usage consumed by the corporate offices. Office of Campus Sustainability - Student Project Manager University of Michigan August 2011  –  May 2012  (10 months) Ann Arbor, Michigan Facilitated the development and implementation of a dynamic web based campus sustainability map, and directed the advocating for renewable energy programs on campus. Collected primary research on student body consensus in divestment of fossil fuels, and helped propel water access campaigns directed at the Huron River and surrounding watersheds. Marketing and Communications Specialist Stanford University June 2015  – Present (3 months) Palo Alto CA Marketing and Communications Specialist Stanford University June 2015  – Present (3 months) Palo Alto CA Corporate Social Responsibility Associate Amway Global 2012  –  May 2015  (3 years) Ada, MI Implement, support, and maintain a broad range of communications efforts, including project management and marketing, brand strategy, facilities and manufacturing communications, employee engagement, digital & web presence and global corporate social responsibility communications. Provide project development and implementation support on community and environmental based comms initiatives such as clean water, childhood nutrition, environmental stewardship, and materials cycling. Corporate Social Responsibility Associate Amway Global 2012  –  May 2015  (3 years) Ada, MI Implement, support, and maintain a broad range of communications efforts, including project management and marketing, brand strategy, facilities and manufacturing communications, employee engagement, digital & web presence and global corporate social responsibility communications. Provide project development and implementation support on community and environmental based comms initiatives such as clean water, childhood nutrition, environmental stewardship, and materials cycling. Associate - Graham Institute for Sustainability University of Michigan 2011  –  2013  (2 years) Ann Arbor, Michigan Prepared promotional and marketing materials for student leaders, faculty, and staff on campus to encourage sustainability / recycling and environmental impact awareness within the greater University of Michigan system including hospitals, academia, and athletics. Engaged and supported the Planet Blue Student Leaders program by helping to establish and develop key stakeholder relationships with the community and student body. Associate - Graham Institute for Sustainability University of Michigan 2011  –  2013  (2 years) Ann Arbor, Michigan Prepared promotional and marketing materials for student leaders, faculty, and staff on campus to encourage sustainability / recycling and environmental impact awareness within the greater University of Michigan system including hospitals, academia, and athletics. Engaged and supported the Planet Blue Student Leaders program by helping to establish and develop key stakeholder relationships with the community and student body. Corporate Citizenship Intern Amway Global May 2012  –  August 2012  (4 months) Ada, MI Created large scale competitive landscape market assessment to evaluate environmental and CSR messaging from an operational and product sustainability perspective from major competitors within the cosmetics, nutrition, and home-care marketplaces. Established and launched a printing paper reduction campaign in partnership with IT to reduce the amount of paper usage consumed by the corporate offices. Corporate Citizenship Intern Amway Global May 2012  –  August 2012  (4 months) Ada, MI Created large scale competitive landscape market assessment to evaluate environmental and CSR messaging from an operational and product sustainability perspective from major competitors within the cosmetics, nutrition, and home-care marketplaces. Established and launched a printing paper reduction campaign in partnership with IT to reduce the amount of paper usage consumed by the corporate offices. Office of Campus Sustainability - Student Project Manager University of Michigan August 2011  –  May 2012  (10 months) Ann Arbor, Michigan Facilitated the development and implementation of a dynamic web based campus sustainability map, and directed the advocating for renewable energy programs on campus. Collected primary research on student body consensus in divestment of fossil fuels, and helped propel water access campaigns directed at the Huron River and surrounding watersheds. Office of Campus Sustainability - Student Project Manager University of Michigan August 2011  –  May 2012  (10 months) Ann Arbor, Michigan Facilitated the development and implementation of a dynamic web based campus sustainability map, and directed the advocating for renewable energy programs on campus. Collected primary research on student body consensus in divestment of fossil fuels, and helped propel water access campaigns directed at the Huron River and surrounding watersheds. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Sustainability Reporting Corporate Social... Environmental... Corporate Sustainability Environmental Impact... Project Management Competitive Analysis Strategic Communications Proposal Writing Performance Metrics Environmental Issues Leadership Marketing Sustainability Corporate Communications Research Environmental Awareness Social Media See 3+     See less Skills  Sustainability Reporting Corporate Social... Environmental... Corporate Sustainability Environmental Impact... Project Management Competitive Analysis Strategic Communications Proposal Writing Performance Metrics Environmental Issues Leadership Marketing Sustainability Corporate Communications Research Environmental Awareness Social Media See 3+     See less Sustainability Reporting Corporate Social... Environmental... Corporate Sustainability Environmental Impact... Project Management Competitive Analysis Strategic Communications Proposal Writing Performance Metrics Environmental Issues Leadership Marketing Sustainability Corporate Communications Research Environmental Awareness Social Media See 3+     See less Sustainability Reporting Corporate Social... Environmental... Corporate Sustainability Environmental Impact... Project Management Competitive Analysis Strategic Communications Proposal Writing Performance Metrics Environmental Issues Leadership Marketing Sustainability Corporate Communications Research Environmental Awareness Social Media See 3+     See less Education University of Michigan Bachelor of Arts (B.A.),  Ecological Science , Sustainability Communications Activities and Societies:  Planet Blue Student Ambassadors ,  School of Natural Resources and Environment ,  East Quad Student Association ,  University Housing Board ,  Net Impact Ross Business School ,  University of Michigan Athletics University of Michigan Bachelor of Arts (B.A.),  Ecological Science , Sustainability Communications Activities and Societies:  Planet Blue Student Ambassadors ,  School of Natural Resources and Environment ,  East Quad Student Association ,  University Housing Board ,  Net Impact Ross Business School ,  University of Michigan Athletics University of Michigan Bachelor of Arts (B.A.),  Ecological Science , Sustainability Communications Activities and Societies:  Planet Blue Student Ambassadors ,  School of Natural Resources and Environment ,  East Quad Student Association ,  University Housing Board ,  Net Impact Ross Business School ,  University of Michigan Athletics University of Michigan Bachelor of Arts (B.A.),  Ecological Science , Sustainability Communications Activities and Societies:  Planet Blue Student Ambassadors ,  School of Natural Resources and Environment ,  East Quad Student Association ,  University Housing Board ,  Net Impact Ross Business School ,  University of Michigan Athletics Honors & Awards ", "Experience Communications Specialist 2 Stanford University Medical Center October 2002  – Present (12 years 11 months) Dispatcher Rural/Metro Corporation March 2012  –  August 2013  (1 year 6 months) Milpitas, CA Dispatcher American Medical Response November 2008  –  November 2011  (3 years 1 month) Emergency Room Technician Kaiser Permanente 2002  –  2005  (3 years) Communications Specialist 2 Stanford University Medical Center October 2002  – Present (12 years 11 months) Communications Specialist 2 Stanford University Medical Center October 2002  – Present (12 years 11 months) Dispatcher Rural/Metro Corporation March 2012  –  August 2013  (1 year 6 months) Milpitas, CA Dispatcher Rural/Metro Corporation March 2012  –  August 2013  (1 year 6 months) Milpitas, CA Dispatcher American Medical Response November 2008  –  November 2011  (3 years 1 month) Dispatcher American Medical Response November 2008  –  November 2011  (3 years 1 month) Emergency Room Technician Kaiser Permanente 2002  –  2005  (3 years) Emergency Room Technician Kaiser Permanente 2002  –  2005  (3 years) Skills BLS Emergency Medicine Emergency Communications Medical Terminology EKG EMT Emergency Services Critical Care Cpr Certified Skills  BLS Emergency Medicine Emergency Communications Medical Terminology EKG EMT Emergency Services Critical Care Cpr Certified BLS Emergency Medicine Emergency Communications Medical Terminology EKG EMT Emergency Services Critical Care Cpr Certified BLS Emergency Medicine Emergency Communications Medical Terminology EKG EMT Emergency Services Critical Care Cpr Certified Education Foothill College AS,  General Studdies 1995  – 2000 Activities and Societies:  EMT Certification St Francis High School Diploma 1991  – 1995 Foothill College AS,  General Studdies 1995  – 2000 Activities and Societies:  EMT Certification Foothill College AS,  General Studdies 1995  – 2000 Activities and Societies:  EMT Certification Foothill College AS,  General Studdies 1995  – 2000 Activities and Societies:  EMT Certification St Francis High School Diploma 1991  – 1995 St Francis High School Diploma 1991  – 1995 St Francis High School Diploma 1991  – 1995 ", "Summary I'm a content strategist, writer, editor, community manager and brand advocate who's worked in higher education and marketing for eight years.  \n \nSpecialities: Strong understanding of content strategy, including online and social media marketing. Experienced in editing, graphic and presentation design, Google Analytics, Photoshop CS6 and Dreamweaver Pro. Summary I'm a content strategist, writer, editor, community manager and brand advocate who's worked in higher education and marketing for eight years.  \n \nSpecialities: Strong understanding of content strategy, including online and social media marketing. Experienced in editing, graphic and presentation design, Google Analytics, Photoshop CS6 and Dreamweaver Pro. I'm a content strategist, writer, editor, community manager and brand advocate who's worked in higher education and marketing for eight years.  \n \nSpecialities: Strong understanding of content strategy, including online and social media marketing. Experienced in editing, graphic and presentation design, Google Analytics, Photoshop CS6 and Dreamweaver Pro. I'm a content strategist, writer, editor, community manager and brand advocate who's worked in higher education and marketing for eight years.  \n \nSpecialities: Strong understanding of content strategy, including online and social media marketing. Experienced in editing, graphic and presentation design, Google Analytics, Photoshop CS6 and Dreamweaver Pro. Experience Communications Specialist Stanford University February 2015  – Present (7 months) Stanford, CA Member of Stanford University IT project teams: \n• Plan and deliver communications and training to Stanford community \n• Prepare the Stanford community for service, technology and system introductions and changes \n• Write, design, edit and present University IT online and print communications, documentation and marketing materials  Social Media Team Leader Hope City July 2014  –  January 2015  (7 months) Houston, Texas Area Social media team leader for Hope City Houston launch team. Build and implement strategy for Hope City social media communications to build following, promote the brand and vision of the church. Create and curate social media content daily. Project lead for mobile app launch. Advise creative team on overall strategy for digital presence and audience engagement. Senior Web Editor Rice University May 2012  –  January 2015  (2 years 9 months) Houston, Texas Area Content Strategy: \n \nCreate weekly content plans and campaigns for Rice.edu, relying on Web analytics, editorial experience and traffic trends to determine the best content to compliment the goals of Rice University. Measure results and deliver ongoing analysis against key performance indicators for Web and social media content. Advise the Director of Web Development in order to create an overall Web content strategy and rotation designed to increase traffic to Rice.edu and create brand advocates through social media engagement. Train and support department and school communicators on Google Analytics implementation. \n \nEditing, Writing, Design and Content Management: \n \nWrite headlines and marketing copy for Rice.edu, social media pushes and special features. Edit photos, art and copy for Rice.edu homepage. Design and build visual presentations for the president of Rice University. Edit and approve content submitted by other university departments and schools to ensure that all copy is grammatically correct, error free and meets AP style and other university standards. Post articles to Rice.edu using Adobe Dreamweaver to form valid HTML 5 articles, Adobe Photoshop to edit photography and imagery, and Ektron CMS400.net (content management system). Freelance Social Media Manager New Breed Music August 2013  –  September 2014  (1 year 2 months) Houston, Texas Area Build and implement social media marketing strategy and communications for Israel & New Breed’s annual Deeper Conference. Actively manage six social media accounts for Deeper Conference, Grammy-winning artist Israel Houghton and New Breed with a total follower count surpassing one million. Social Media Director The429 December 2012  –  July 2014  (1 year 8 months) houston, texas Build and implement social media marketing strategy and communications for The429. Monitor and engage conversations across Facebook, Twitter, Instagram, YouTube and all social media communities. Maintain the429.com and the mobile app with weekly content, e.g., podcasts, copy edits and art. Measure results and deliver ongoing analysis against key performance indicators for Web and social media content. Advise The429 head pastor and creative team on media findings, Web presence and content strategy. Partner with Grace Church of Humble and Lakewood Church social media marketing for conferences and events. Freelance Writer Houstonia Magazine May 2013  –  September 2013  (5 months) Houston, Texas Area Write product reviews and fashion articles for Houstonia Magazine's Shop Talk blog. Executive & Special Projects Assistant Rice University July 2007  –  May 2012  (4 years 11 months) Houston, Texas Area Manage and implement various marketing, Web, print, media, government and community relations projects within the Office of Public Affairs. Work on special projects under the vice president for public affairs and the president of Rice University. This includes building presentations, compiling metric and measurement reports, planning special events and working closely with other departments across the university. Assist the vice president for public affairs with administrative functions and editorial work. Implement and maintain standard office procedures and business functions. Partner with the director of government relations in implementing the Rice Community Action Network (CAN). Duties include developing content for CAN website and emails, tracking and distributing emails, identifying new content to distribute to CAN target audiences and building strategy to grow the network. Communications Specialist Stanford University February 2015  – Present (7 months) Stanford, CA Member of Stanford University IT project teams: \n• Plan and deliver communications and training to Stanford community \n• Prepare the Stanford community for service, technology and system introductions and changes \n• Write, design, edit and present University IT online and print communications, documentation and marketing materials  Communications Specialist Stanford University February 2015  – Present (7 months) Stanford, CA Member of Stanford University IT project teams: \n• Plan and deliver communications and training to Stanford community \n• Prepare the Stanford community for service, technology and system introductions and changes \n• Write, design, edit and present University IT online and print communications, documentation and marketing materials  Social Media Team Leader Hope City July 2014  –  January 2015  (7 months) Houston, Texas Area Social media team leader for Hope City Houston launch team. Build and implement strategy for Hope City social media communications to build following, promote the brand and vision of the church. Create and curate social media content daily. Project lead for mobile app launch. Advise creative team on overall strategy for digital presence and audience engagement. Social Media Team Leader Hope City July 2014  –  January 2015  (7 months) Houston, Texas Area Social media team leader for Hope City Houston launch team. Build and implement strategy for Hope City social media communications to build following, promote the brand and vision of the church. Create and curate social media content daily. Project lead for mobile app launch. Advise creative team on overall strategy for digital presence and audience engagement. Senior Web Editor Rice University May 2012  –  January 2015  (2 years 9 months) Houston, Texas Area Content Strategy: \n \nCreate weekly content plans and campaigns for Rice.edu, relying on Web analytics, editorial experience and traffic trends to determine the best content to compliment the goals of Rice University. Measure results and deliver ongoing analysis against key performance indicators for Web and social media content. Advise the Director of Web Development in order to create an overall Web content strategy and rotation designed to increase traffic to Rice.edu and create brand advocates through social media engagement. Train and support department and school communicators on Google Analytics implementation. \n \nEditing, Writing, Design and Content Management: \n \nWrite headlines and marketing copy for Rice.edu, social media pushes and special features. Edit photos, art and copy for Rice.edu homepage. Design and build visual presentations for the president of Rice University. Edit and approve content submitted by other university departments and schools to ensure that all copy is grammatically correct, error free and meets AP style and other university standards. Post articles to Rice.edu using Adobe Dreamweaver to form valid HTML 5 articles, Adobe Photoshop to edit photography and imagery, and Ektron CMS400.net (content management system). Senior Web Editor Rice University May 2012  –  January 2015  (2 years 9 months) Houston, Texas Area Content Strategy: \n \nCreate weekly content plans and campaigns for Rice.edu, relying on Web analytics, editorial experience and traffic trends to determine the best content to compliment the goals of Rice University. Measure results and deliver ongoing analysis against key performance indicators for Web and social media content. Advise the Director of Web Development in order to create an overall Web content strategy and rotation designed to increase traffic to Rice.edu and create brand advocates through social media engagement. Train and support department and school communicators on Google Analytics implementation. \n \nEditing, Writing, Design and Content Management: \n \nWrite headlines and marketing copy for Rice.edu, social media pushes and special features. Edit photos, art and copy for Rice.edu homepage. Design and build visual presentations for the president of Rice University. Edit and approve content submitted by other university departments and schools to ensure that all copy is grammatically correct, error free and meets AP style and other university standards. Post articles to Rice.edu using Adobe Dreamweaver to form valid HTML 5 articles, Adobe Photoshop to edit photography and imagery, and Ektron CMS400.net (content management system). Freelance Social Media Manager New Breed Music August 2013  –  September 2014  (1 year 2 months) Houston, Texas Area Build and implement social media marketing strategy and communications for Israel & New Breed’s annual Deeper Conference. Actively manage six social media accounts for Deeper Conference, Grammy-winning artist Israel Houghton and New Breed with a total follower count surpassing one million. Freelance Social Media Manager New Breed Music August 2013  –  September 2014  (1 year 2 months) Houston, Texas Area Build and implement social media marketing strategy and communications for Israel & New Breed’s annual Deeper Conference. Actively manage six social media accounts for Deeper Conference, Grammy-winning artist Israel Houghton and New Breed with a total follower count surpassing one million. Social Media Director The429 December 2012  –  July 2014  (1 year 8 months) houston, texas Build and implement social media marketing strategy and communications for The429. Monitor and engage conversations across Facebook, Twitter, Instagram, YouTube and all social media communities. Maintain the429.com and the mobile app with weekly content, e.g., podcasts, copy edits and art. Measure results and deliver ongoing analysis against key performance indicators for Web and social media content. Advise The429 head pastor and creative team on media findings, Web presence and content strategy. Partner with Grace Church of Humble and Lakewood Church social media marketing for conferences and events. Social Media Director The429 December 2012  –  July 2014  (1 year 8 months) houston, texas Build and implement social media marketing strategy and communications for The429. Monitor and engage conversations across Facebook, Twitter, Instagram, YouTube and all social media communities. Maintain the429.com and the mobile app with weekly content, e.g., podcasts, copy edits and art. Measure results and deliver ongoing analysis against key performance indicators for Web and social media content. Advise The429 head pastor and creative team on media findings, Web presence and content strategy. Partner with Grace Church of Humble and Lakewood Church social media marketing for conferences and events. Freelance Writer Houstonia Magazine May 2013  –  September 2013  (5 months) Houston, Texas Area Write product reviews and fashion articles for Houstonia Magazine's Shop Talk blog. Freelance Writer Houstonia Magazine May 2013  –  September 2013  (5 months) Houston, Texas Area Write product reviews and fashion articles for Houstonia Magazine's Shop Talk blog. Executive & Special Projects Assistant Rice University July 2007  –  May 2012  (4 years 11 months) Houston, Texas Area Manage and implement various marketing, Web, print, media, government and community relations projects within the Office of Public Affairs. Work on special projects under the vice president for public affairs and the president of Rice University. This includes building presentations, compiling metric and measurement reports, planning special events and working closely with other departments across the university. Assist the vice president for public affairs with administrative functions and editorial work. Implement and maintain standard office procedures and business functions. Partner with the director of government relations in implementing the Rice Community Action Network (CAN). Duties include developing content for CAN website and emails, tracking and distributing emails, identifying new content to distribute to CAN target audiences and building strategy to grow the network. Executive & Special Projects Assistant Rice University July 2007  –  May 2012  (4 years 11 months) Houston, Texas Area Manage and implement various marketing, Web, print, media, government and community relations projects within the Office of Public Affairs. Work on special projects under the vice president for public affairs and the president of Rice University. This includes building presentations, compiling metric and measurement reports, planning special events and working closely with other departments across the university. Assist the vice president for public affairs with administrative functions and editorial work. Implement and maintain standard office procedures and business functions. Partner with the director of government relations in implementing the Rice Community Action Network (CAN). Duties include developing content for CAN website and emails, tracking and distributing emails, identifying new content to distribute to CAN target audiences and building strategy to grow the network. Skills Social Media Marketing Editing Dreamweaver Microsoft Office Google Analytics Writing Photoshop Web Editing Graphic Design Web Content Management Content Strategy Web Analytics PowerPoint Social Media... Presentation Design Content Marketing CRM databases Drupal Keynote InDesign Technical Documentation Technical Leadership Qualtrics Video Conferencing iMovie Email Marketing MailChimp WordPress Digital Marketing See 14+     See less Skills  Social Media Marketing Editing Dreamweaver Microsoft Office Google Analytics Writing Photoshop Web Editing Graphic Design Web Content Management Content Strategy Web Analytics PowerPoint Social Media... Presentation Design Content Marketing CRM databases Drupal Keynote InDesign Technical Documentation Technical Leadership Qualtrics Video Conferencing iMovie Email Marketing MailChimp WordPress Digital Marketing See 14+     See less Social Media Marketing Editing Dreamweaver Microsoft Office Google Analytics Writing Photoshop Web Editing Graphic Design Web Content Management Content Strategy Web Analytics PowerPoint Social Media... Presentation Design Content Marketing CRM databases Drupal Keynote InDesign Technical Documentation Technical Leadership Qualtrics Video Conferencing iMovie Email Marketing MailChimp WordPress Digital Marketing See 14+     See less Social Media Marketing Editing Dreamweaver Microsoft Office Google Analytics Writing Photoshop Web Editing Graphic Design Web Content Management Content Strategy Web Analytics PowerPoint Social Media... Presentation Design Content Marketing CRM databases Drupal Keynote InDesign Technical Documentation Technical Leadership Qualtrics Video Conferencing iMovie Email Marketing MailChimp WordPress Digital Marketing See 14+     See less Education Taylor University BA,  Public Relations 2003  – 2007 Activities and Societies:  Taylor University Women's Basketball Team Taylor University BA,  Public Relations 2003  – 2007 Activities and Societies:  Taylor University Women's Basketball Team Taylor University BA,  Public Relations 2003  – 2007 Activities and Societies:  Taylor University Women's Basketball Team Taylor University BA,  Public Relations 2003  – 2007 Activities and Societies:  Taylor University Women's Basketball Team Honors & Awards Additional Honors & Awards Centennial Star Award - March 2012: The Centennial Star Awards recognized 100 current staff members (beginning in January 2012 through December 2012) who routinely excel in their positions, support the goals and aspirations of the University, and serve as a positive influence on the Rice culture. (http://news.rice.edu/2012/03/02/this-weeks-centennial-stars-2/) Additional Honors & Awards Centennial Star Award - March 2012: The Centennial Star Awards recognized 100 current staff members (beginning in January 2012 through December 2012) who routinely excel in their positions, support the goals and aspirations of the University, and serve as a positive influence on the Rice culture. (http://news.rice.edu/2012/03/02/this-weeks-centennial-stars-2/) Additional Honors & Awards Centennial Star Award - March 2012: The Centennial Star Awards recognized 100 current staff members (beginning in January 2012 through December 2012) who routinely excel in their positions, support the goals and aspirations of the University, and serve as a positive influence on the Rice culture. (http://news.rice.edu/2012/03/02/this-weeks-centennial-stars-2/) Additional Honors & Awards Centennial Star Award - March 2012: The Centennial Star Awards recognized 100 current staff members (beginning in January 2012 through December 2012) who routinely excel in their positions, support the goals and aspirations of the University, and serve as a positive influence on the Rice culture. (http://news.rice.edu/2012/03/02/this-weeks-centennial-stars-2/) ", "Experience Insurance Agent Allstate May 2009  –  December 2010  (1 year 8 months) Albuquerque, New Mexico Area Sales Rep Budweiser October 2007  –  August 2008  (11 months) Lancaster, CA Communications Specialist Stanford University October 2003  –  October 2005  (2 years 1 month) Palo Alto, CA Communication Stanford University 2003  –  2004  (1 year) Lead Dispatcher Critical Air Medicine October 1998  –  December 2003  (5 years 3 months) Greater San Diego Area Subpoena Processor JPL PROCESS SERVICE January 1997  –  November 1998  (1 year 11 months) Oceanside, CA Insurance Agent Allstate May 2009  –  December 2010  (1 year 8 months) Albuquerque, New Mexico Area Insurance Agent Allstate May 2009  –  December 2010  (1 year 8 months) Albuquerque, New Mexico Area Sales Rep Budweiser October 2007  –  August 2008  (11 months) Lancaster, CA Sales Rep Budweiser October 2007  –  August 2008  (11 months) Lancaster, CA Communications Specialist Stanford University October 2003  –  October 2005  (2 years 1 month) Palo Alto, CA Communications Specialist Stanford University October 2003  –  October 2005  (2 years 1 month) Palo Alto, CA Communication Stanford University 2003  –  2004  (1 year) Communication Stanford University 2003  –  2004  (1 year) Lead Dispatcher Critical Air Medicine October 1998  –  December 2003  (5 years 3 months) Greater San Diego Area Lead Dispatcher Critical Air Medicine October 1998  –  December 2003  (5 years 3 months) Greater San Diego Area Subpoena Processor JPL PROCESS SERVICE January 1997  –  November 1998  (1 year 11 months) Oceanside, CA Subpoena Processor JPL PROCESS SERVICE January 1997  –  November 1998  (1 year 11 months) Oceanside, CA Skills Commercial Litigation Accounting Retail Healthcare Strategic Planning Trials Negotiation Project Management Leadership Business Strategy Sales Management Risk Management Business Planning Marketing Strategy Microsoft Office PowerPoint Team Building Microsoft Excel See 3+     See less Skills  Commercial Litigation Accounting Retail Healthcare Strategic Planning Trials Negotiation Project Management Leadership Business Strategy Sales Management Risk Management Business Planning Marketing Strategy Microsoft Office PowerPoint Team Building Microsoft Excel See 3+     See less Commercial Litigation Accounting Retail Healthcare Strategic Planning Trials Negotiation Project Management Leadership Business Strategy Sales Management Risk Management Business Planning Marketing Strategy Microsoft Office PowerPoint Team Building Microsoft Excel See 3+     See less Commercial Litigation Accounting Retail Healthcare Strategic Planning Trials Negotiation Project Management Leadership Business Strategy Sales Management Risk Management Business Planning Marketing Strategy Microsoft Office PowerPoint Team Building Microsoft Excel See 3+     See less Education The University of New Mexico Bachelor of Applied Science (B.A.Sc.),  Political Science 2010  – 2013 My studies focused on the powers of the state and federal government; relations between federal and state authority; limitations on governmental authority by virtue of a distribution of power. The rights of citizens; the nature of due process and the equal protection of the law; the protection of freedom from invidious discrimination; the Civil Rights Acts; freedoms of expression, association, and religion ability to identify and describe political issues. I have the ability to evaluate how well individuals, groups, and institutions understand and resolve political issues. The ability to think and act in a multicultural, often competitive context. I have learned how to analyze and act on political viewpoints, resolve conflicts, collaborate with others to mobilize political resources, and cope with political situations. I can effectively advance a group's interests by developing and identifying arguments to advocate on their behalf. University of Notre Dame Certificate,  Negation Tactics 2010  – 2010 The certificate focused on the developing interpersonal skills to effectively aid the ability in decision-making strategies, that both enhanced and produced optimal outcomes when working with difficult people, and difficult situations, effectively, through both verbal and non-verbal communication. University of Phoenix Associate's degree,  Business , Management, Marketing, and Related Support Services 2007  – 2010 Managing resources, identify and solving problems, work with others, understand markets, collect and analyze data,evaluate, organizational performance with a understanding of business practices that includes; principles of management, business law, financial management, organizational behavior, marketing, sales, accounting, retailing principles, business research and advertising. The University of New Mexico Bachelor of Applied Science (B.A.Sc.),  Political Science 2010  – 2013 My studies focused on the powers of the state and federal government; relations between federal and state authority; limitations on governmental authority by virtue of a distribution of power. The rights of citizens; the nature of due process and the equal protection of the law; the protection of freedom from invidious discrimination; the Civil Rights Acts; freedoms of expression, association, and religion ability to identify and describe political issues. I have the ability to evaluate how well individuals, groups, and institutions understand and resolve political issues. The ability to think and act in a multicultural, often competitive context. I have learned how to analyze and act on political viewpoints, resolve conflicts, collaborate with others to mobilize political resources, and cope with political situations. I can effectively advance a group's interests by developing and identifying arguments to advocate on their behalf. The University of New Mexico Bachelor of Applied Science (B.A.Sc.),  Political Science 2010  – 2013 My studies focused on the powers of the state and federal government; relations between federal and state authority; limitations on governmental authority by virtue of a distribution of power. The rights of citizens; the nature of due process and the equal protection of the law; the protection of freedom from invidious discrimination; the Civil Rights Acts; freedoms of expression, association, and religion ability to identify and describe political issues. I have the ability to evaluate how well individuals, groups, and institutions understand and resolve political issues. The ability to think and act in a multicultural, often competitive context. I have learned how to analyze and act on political viewpoints, resolve conflicts, collaborate with others to mobilize political resources, and cope with political situations. I can effectively advance a group's interests by developing and identifying arguments to advocate on their behalf. The University of New Mexico Bachelor of Applied Science (B.A.Sc.),  Political Science 2010  – 2013 My studies focused on the powers of the state and federal government; relations between federal and state authority; limitations on governmental authority by virtue of a distribution of power. The rights of citizens; the nature of due process and the equal protection of the law; the protection of freedom from invidious discrimination; the Civil Rights Acts; freedoms of expression, association, and religion ability to identify and describe political issues. I have the ability to evaluate how well individuals, groups, and institutions understand and resolve political issues. The ability to think and act in a multicultural, often competitive context. I have learned how to analyze and act on political viewpoints, resolve conflicts, collaborate with others to mobilize political resources, and cope with political situations. I can effectively advance a group's interests by developing and identifying arguments to advocate on their behalf. University of Notre Dame Certificate,  Negation Tactics 2010  – 2010 The certificate focused on the developing interpersonal skills to effectively aid the ability in decision-making strategies, that both enhanced and produced optimal outcomes when working with difficult people, and difficult situations, effectively, through both verbal and non-verbal communication. University of Notre Dame Certificate,  Negation Tactics 2010  – 2010 The certificate focused on the developing interpersonal skills to effectively aid the ability in decision-making strategies, that both enhanced and produced optimal outcomes when working with difficult people, and difficult situations, effectively, through both verbal and non-verbal communication. University of Notre Dame Certificate,  Negation Tactics 2010  – 2010 The certificate focused on the developing interpersonal skills to effectively aid the ability in decision-making strategies, that both enhanced and produced optimal outcomes when working with difficult people, and difficult situations, effectively, through both verbal and non-verbal communication. University of Phoenix Associate's degree,  Business , Management, Marketing, and Related Support Services 2007  – 2010 Managing resources, identify and solving problems, work with others, understand markets, collect and analyze data,evaluate, organizational performance with a understanding of business practices that includes; principles of management, business law, financial management, organizational behavior, marketing, sales, accounting, retailing principles, business research and advertising. University of Phoenix Associate's degree,  Business , Management, Marketing, and Related Support Services 2007  – 2010 Managing resources, identify and solving problems, work with others, understand markets, collect and analyze data,evaluate, organizational performance with a understanding of business practices that includes; principles of management, business law, financial management, organizational behavior, marketing, sales, accounting, retailing principles, business research and advertising. University of Phoenix Associate's degree,  Business , Management, Marketing, and Related Support Services 2007  – 2010 Managing resources, identify and solving problems, work with others, understand markets, collect and analyze data,evaluate, organizational performance with a understanding of business practices that includes; principles of management, business law, financial management, organizational behavior, marketing, sales, accounting, retailing principles, business research and advertising. ", "Summary I've been a content creator for 10 years. I have first-hand experience managing newsletters, establishing editorial calendars, writing articles, copywriting, editing and applying editorial style guide standards. When editing contributing and freelance writers, I make it a priority to keep their voice intact and only make changes for clarity, accuracy, grammar and punctuation.  \n \nWhether I'm creating Web content, a blog post or copy for marketing collateral, I can translate information into easy-to-understand language that resonates with a target audience. I'm currently working in a Marketing environment but ultimately I'd like to transition back to internal communications, corporate communications and editorial content. \n \nI take pride in my reputation for delivering accurate and clean copy before deadline. I know how to make meaningful contributions to a team and pay attention to details. Summary I've been a content creator for 10 years. I have first-hand experience managing newsletters, establishing editorial calendars, writing articles, copywriting, editing and applying editorial style guide standards. When editing contributing and freelance writers, I make it a priority to keep their voice intact and only make changes for clarity, accuracy, grammar and punctuation.  \n \nWhether I'm creating Web content, a blog post or copy for marketing collateral, I can translate information into easy-to-understand language that resonates with a target audience. I'm currently working in a Marketing environment but ultimately I'd like to transition back to internal communications, corporate communications and editorial content. \n \nI take pride in my reputation for delivering accurate and clean copy before deadline. I know how to make meaningful contributions to a team and pay attention to details. I've been a content creator for 10 years. I have first-hand experience managing newsletters, establishing editorial calendars, writing articles, copywriting, editing and applying editorial style guide standards. When editing contributing and freelance writers, I make it a priority to keep their voice intact and only make changes for clarity, accuracy, grammar and punctuation.  \n \nWhether I'm creating Web content, a blog post or copy for marketing collateral, I can translate information into easy-to-understand language that resonates with a target audience. I'm currently working in a Marketing environment but ultimately I'd like to transition back to internal communications, corporate communications and editorial content. \n \nI take pride in my reputation for delivering accurate and clean copy before deadline. I know how to make meaningful contributions to a team and pay attention to details. I've been a content creator for 10 years. I have first-hand experience managing newsletters, establishing editorial calendars, writing articles, copywriting, editing and applying editorial style guide standards. When editing contributing and freelance writers, I make it a priority to keep their voice intact and only make changes for clarity, accuracy, grammar and punctuation.  \n \nWhether I'm creating Web content, a blog post or copy for marketing collateral, I can translate information into easy-to-understand language that resonates with a target audience. I'm currently working in a Marketing environment but ultimately I'd like to transition back to internal communications, corporate communications and editorial content. \n \nI take pride in my reputation for delivering accurate and clean copy before deadline. I know how to make meaningful contributions to a team and pay attention to details. Experience Communications Specialist Stanford University November 2014  – Present (10 months) I’m an integral part of Stanford Blood Center’s Marketing and Communications Department as the Communications Specialist. My daily responsibilities include creating content for all communications channels, crafting messages for print, Web, audio and video ads, as well as writing and editing marketing collateral, donor information pieces, event publicity and internal memos.  \n \nIn addition to working on all marketing projects and donor initiatives, I work closely with the Recruitment and Customer Service teams to make sure staff and donors understand current promotions and campaigns. I am also responsible for creating the messages and slideshows displayed in the donor center canteens. \n \nI created an editorial style guide for the organization that includes everything from the names of the different bloodmobiles and apheresis machines used in our donor centers to the full names of blood industry associations and Stanford entities SBC partners with. I was also the project lead for a thorough audit of SBC’s donor portal, created all content revisions and worked closely with the vendor to correctly apply the changes and successfully launch the new site.  Managing Editor Jameco Electronics December 2013  –  November 2014  (1 year) Belmont, CA My official title was Managing Editor, but it could have been Queen of Content. I created and edited content across all of Jameco’s communications channels. From writing Web content and direct marketing emails to proofing collateral and editing blog posts, I touched everything that came through the Marketing Department. \n \nThe majority of my time was spent managing all the moving parts of two monthly newsletters. I slotted stories and managed editorial calendars, conducted interviews and researched topics for articles, managed and edited contributing writers, oversaw the production of newsletter landing pages, ran reports on open and click through rates using SilverPop, and replied to every single email from readers. \n \nThe projects I’m most proud of accomplishing in this role were creating the Jameco Blog from scratch on Word Press, establishing standards for newsletter landing pages, and auditing Marketing website pages for consistency and SEO optimization. Internal Communications Specialist UC San Diego Health System November 2010  –  June 2013  (2 years 8 months) San Diego, California I loved being the Internal Communications Specialist for UC San Diego Health System. I primarily managed a variety of internal communications channels, including all aspects of the employee newsletter, from creating it in Constant Contact every week to scheduling distribution to 6,000 employees. \n \nI worked closely with graphic designers to produce and execute organization-wide messaging for employees delivered through screensavers, HD display monitors in hospital lobbies and intranet banners. Those messages usually coordinated with marketing campaigns and were tailored for the internal audience. \n \nI created an Internal Communications Guide and was also on the team that established an Editorial Style Guide for UC San Diego Health Sciences. As part of the Marketing and Communications Department, I often edited and wrote copy for marketing collateral, specifically patient information brochures. I also had the opportunity to support c-suite leadership through PowerPoint presentations and ghost writing memos and speeches. \n \nI worked on several cross-departmental projects in the nearly four years I was at UC San Diego. The most successful was an open enrollment campaign that highlighted the benefits of receiving health care at UC San Diego Health System and encouraged employees to select a health insurance plan that would allow them to choose our doctors as their primary care physicians. Senior Writer UC San Diego Health System/Health Sciences July 2009  –  November 2010  (1 year 5 months) San Diego, California As Senior Writer, I helped write, edit and produce two weekly and one monthly employee newsletters. I worked on several special projects including redesigning and rewriting the new employee orientation PowerPoint for Human Resources, compiling PowerPoint presentations for the CEO, and editing the proposal for a new medical center, which resulted in a $75 million gift.  \n \nI also had the opportunity to work with Public Information Officers and wrote press releases on clinical trials and scientific research. I started in this position as a temp and became a career employee a few months later. Technical Writer Nan McKay and Associates September 2008  –  June 2009  (10 months) Greater San Diego Area Working as a Technical Writer for Nan McKay and Associates (NMA) was one of the most rewarding positions I’ve ever had. NMA conducts training across the country to teach others how to correctly execute Public Housing and Section 8 programs through seminars and training materials. \n \nThe challenging part of this role was analyzing U.S. Department of Housing and Urban Development (HUD) regulations and translating them from legalese into easy-to-understand language. \n \nMy main responsibilities were applying new editorial style guide standards to NMA’s existing library of publications and updating any handbook or training materials effected by a change in HUD regulations. I also wrote biographies and edited case studies and business proposals. \n \nMy bilingual skills came in handy when I proofed the training materials for the Puerto Rico Public Housing Authority in Spanish and noticed errors, including that the glossary had been translated but not re-alphabetized. Public Relations Assistant The Alarus Agency, Inc. May 2008  –  September 2008  (5 months) San Diego, California As a Public Relations Assistant at the Alarus Agency, I wrote and edited press releases, pitched to the media and updated media lists. I also reworked PowerPoint presentations and wrote talking points for clients.  \n \nMy other responsibilities included soliciting donations and creating a trivia contest for a fundraising auction, and staffing a variety of events. Communications Consultant Empire Water February 2008  –  April 2008  (3 months) San Diego, California While briefly working as a Communications Consultant for Empire Water, I coordinated with the graphic designer to develop the look and feel of the corporate website. I also created Web content and management team biographies. Marketing Assistant/Conference Coordinator Basin Water, Inc. December 2007  –  February 2008  (3 months) San Diego, California I had a dual role at Basin Water: Marketing Assistant and Conference Coordinator. My Marketing duties included working on research projects and proposals, writing and editing reports, and other miscellaneous administrative tasks. For nationwide industry conferences, I was tasked with researching dates for attendance, requirements for exhibiting and cost estimates. Communications Director Town of Palm Beach Civic Association September 2006  –  October 2007  (1 year 2 months) Palm Beach, Florida As the Communications Director for the non-profit Palm Beach Civic Association, the majority of my responsibilities were writing and producing town-wide newsletters, creating custom news updates for directors, writing press releases and updating marketing collateral. I was also the in-house photographer, elections point person and media liaison. \n \nI had the privilege of working with nine committees lead by extraordinary Palm Beach residents who ranged from former U.S. ambassadors and politicians, to retired captains of industry and philanthropists. I was tasked with creating monthly agendas and information packets on a variety of topics for each committee, taking meeting minutes, and following up on questions and research requests. Madison County Bureau Reporter The Post-Standard January 2006  –  June 2006  (6 months) Canastota, New York After completing my master’s degree in journalism, I transitioned into a full-time reporter position for The Post-Standard’s Madison County Bureau. My assigned beats included crime and safety, county court, Cazenovia College, the Town of Cazenovia and the Village of Cazenovia.  \n \nI covered two high-profile stories of national interest: the trial of the third man to be charged with making a terrorist threat in New York State and the homicide investigation of slain New Hartford Police Officer Joseph Corr. Some of my stories were featured on the front page (A-1) and in all editions of the newspaper (not just the Madison County edition). I also received two photo credits for photos I took of a melted semitruck and the scene of a car accident. Newhouse Fellow/Contributing Writer The Post-Standard January 2005  –  January 2006  (1 year 1 month) Syracuse, New York I was one of two recipients of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities for 2004-2005. While working on my master’s degree, I interned 30 hours a week at The Post-Standard as a Contributing Writer for the Metro and Regional Desks. Most of the stories I covered were community events, guest speakers, business profiles and school meetings. Associate Director SDSU International Business and Economics Internship Program August 2000  –  August 2001  (1 year 1 month) San Diego, California As Associate Director I managed a database that included 300 students and 150 employers for the San Diego State University International Business and Economics Internship Program. I met with students in the program during office hours to answer questions and receive their submissions. I was also responsible for some office administration work, funds management, clerical work and training new staff. Communications Specialist Stanford University November 2014  – Present (10 months) I’m an integral part of Stanford Blood Center’s Marketing and Communications Department as the Communications Specialist. My daily responsibilities include creating content for all communications channels, crafting messages for print, Web, audio and video ads, as well as writing and editing marketing collateral, donor information pieces, event publicity and internal memos.  \n \nIn addition to working on all marketing projects and donor initiatives, I work closely with the Recruitment and Customer Service teams to make sure staff and donors understand current promotions and campaigns. I am also responsible for creating the messages and slideshows displayed in the donor center canteens. \n \nI created an editorial style guide for the organization that includes everything from the names of the different bloodmobiles and apheresis machines used in our donor centers to the full names of blood industry associations and Stanford entities SBC partners with. I was also the project lead for a thorough audit of SBC’s donor portal, created all content revisions and worked closely with the vendor to correctly apply the changes and successfully launch the new site.  Communications Specialist Stanford University November 2014  – Present (10 months) I’m an integral part of Stanford Blood Center’s Marketing and Communications Department as the Communications Specialist. My daily responsibilities include creating content for all communications channels, crafting messages for print, Web, audio and video ads, as well as writing and editing marketing collateral, donor information pieces, event publicity and internal memos.  \n \nIn addition to working on all marketing projects and donor initiatives, I work closely with the Recruitment and Customer Service teams to make sure staff and donors understand current promotions and campaigns. I am also responsible for creating the messages and slideshows displayed in the donor center canteens. \n \nI created an editorial style guide for the organization that includes everything from the names of the different bloodmobiles and apheresis machines used in our donor centers to the full names of blood industry associations and Stanford entities SBC partners with. I was also the project lead for a thorough audit of SBC’s donor portal, created all content revisions and worked closely with the vendor to correctly apply the changes and successfully launch the new site.  Managing Editor Jameco Electronics December 2013  –  November 2014  (1 year) Belmont, CA My official title was Managing Editor, but it could have been Queen of Content. I created and edited content across all of Jameco’s communications channels. From writing Web content and direct marketing emails to proofing collateral and editing blog posts, I touched everything that came through the Marketing Department. \n \nThe majority of my time was spent managing all the moving parts of two monthly newsletters. I slotted stories and managed editorial calendars, conducted interviews and researched topics for articles, managed and edited contributing writers, oversaw the production of newsletter landing pages, ran reports on open and click through rates using SilverPop, and replied to every single email from readers. \n \nThe projects I’m most proud of accomplishing in this role were creating the Jameco Blog from scratch on Word Press, establishing standards for newsletter landing pages, and auditing Marketing website pages for consistency and SEO optimization. Managing Editor Jameco Electronics December 2013  –  November 2014  (1 year) Belmont, CA My official title was Managing Editor, but it could have been Queen of Content. I created and edited content across all of Jameco’s communications channels. From writing Web content and direct marketing emails to proofing collateral and editing blog posts, I touched everything that came through the Marketing Department. \n \nThe majority of my time was spent managing all the moving parts of two monthly newsletters. I slotted stories and managed editorial calendars, conducted interviews and researched topics for articles, managed and edited contributing writers, oversaw the production of newsletter landing pages, ran reports on open and click through rates using SilverPop, and replied to every single email from readers. \n \nThe projects I’m most proud of accomplishing in this role were creating the Jameco Blog from scratch on Word Press, establishing standards for newsletter landing pages, and auditing Marketing website pages for consistency and SEO optimization. Internal Communications Specialist UC San Diego Health System November 2010  –  June 2013  (2 years 8 months) San Diego, California I loved being the Internal Communications Specialist for UC San Diego Health System. I primarily managed a variety of internal communications channels, including all aspects of the employee newsletter, from creating it in Constant Contact every week to scheduling distribution to 6,000 employees. \n \nI worked closely with graphic designers to produce and execute organization-wide messaging for employees delivered through screensavers, HD display monitors in hospital lobbies and intranet banners. Those messages usually coordinated with marketing campaigns and were tailored for the internal audience. \n \nI created an Internal Communications Guide and was also on the team that established an Editorial Style Guide for UC San Diego Health Sciences. As part of the Marketing and Communications Department, I often edited and wrote copy for marketing collateral, specifically patient information brochures. I also had the opportunity to support c-suite leadership through PowerPoint presentations and ghost writing memos and speeches. \n \nI worked on several cross-departmental projects in the nearly four years I was at UC San Diego. The most successful was an open enrollment campaign that highlighted the benefits of receiving health care at UC San Diego Health System and encouraged employees to select a health insurance plan that would allow them to choose our doctors as their primary care physicians. Internal Communications Specialist UC San Diego Health System November 2010  –  June 2013  (2 years 8 months) San Diego, California I loved being the Internal Communications Specialist for UC San Diego Health System. I primarily managed a variety of internal communications channels, including all aspects of the employee newsletter, from creating it in Constant Contact every week to scheduling distribution to 6,000 employees. \n \nI worked closely with graphic designers to produce and execute organization-wide messaging for employees delivered through screensavers, HD display monitors in hospital lobbies and intranet banners. Those messages usually coordinated with marketing campaigns and were tailored for the internal audience. \n \nI created an Internal Communications Guide and was also on the team that established an Editorial Style Guide for UC San Diego Health Sciences. As part of the Marketing and Communications Department, I often edited and wrote copy for marketing collateral, specifically patient information brochures. I also had the opportunity to support c-suite leadership through PowerPoint presentations and ghost writing memos and speeches. \n \nI worked on several cross-departmental projects in the nearly four years I was at UC San Diego. The most successful was an open enrollment campaign that highlighted the benefits of receiving health care at UC San Diego Health System and encouraged employees to select a health insurance plan that would allow them to choose our doctors as their primary care physicians. Senior Writer UC San Diego Health System/Health Sciences July 2009  –  November 2010  (1 year 5 months) San Diego, California As Senior Writer, I helped write, edit and produce two weekly and one monthly employee newsletters. I worked on several special projects including redesigning and rewriting the new employee orientation PowerPoint for Human Resources, compiling PowerPoint presentations for the CEO, and editing the proposal for a new medical center, which resulted in a $75 million gift.  \n \nI also had the opportunity to work with Public Information Officers and wrote press releases on clinical trials and scientific research. I started in this position as a temp and became a career employee a few months later. Senior Writer UC San Diego Health System/Health Sciences July 2009  –  November 2010  (1 year 5 months) San Diego, California As Senior Writer, I helped write, edit and produce two weekly and one monthly employee newsletters. I worked on several special projects including redesigning and rewriting the new employee orientation PowerPoint for Human Resources, compiling PowerPoint presentations for the CEO, and editing the proposal for a new medical center, which resulted in a $75 million gift.  \n \nI also had the opportunity to work with Public Information Officers and wrote press releases on clinical trials and scientific research. I started in this position as a temp and became a career employee a few months later. Technical Writer Nan McKay and Associates September 2008  –  June 2009  (10 months) Greater San Diego Area Working as a Technical Writer for Nan McKay and Associates (NMA) was one of the most rewarding positions I’ve ever had. NMA conducts training across the country to teach others how to correctly execute Public Housing and Section 8 programs through seminars and training materials. \n \nThe challenging part of this role was analyzing U.S. Department of Housing and Urban Development (HUD) regulations and translating them from legalese into easy-to-understand language. \n \nMy main responsibilities were applying new editorial style guide standards to NMA’s existing library of publications and updating any handbook or training materials effected by a change in HUD regulations. I also wrote biographies and edited case studies and business proposals. \n \nMy bilingual skills came in handy when I proofed the training materials for the Puerto Rico Public Housing Authority in Spanish and noticed errors, including that the glossary had been translated but not re-alphabetized. Technical Writer Nan McKay and Associates September 2008  –  June 2009  (10 months) Greater San Diego Area Working as a Technical Writer for Nan McKay and Associates (NMA) was one of the most rewarding positions I’ve ever had. NMA conducts training across the country to teach others how to correctly execute Public Housing and Section 8 programs through seminars and training materials. \n \nThe challenging part of this role was analyzing U.S. Department of Housing and Urban Development (HUD) regulations and translating them from legalese into easy-to-understand language. \n \nMy main responsibilities were applying new editorial style guide standards to NMA’s existing library of publications and updating any handbook or training materials effected by a change in HUD regulations. I also wrote biographies and edited case studies and business proposals. \n \nMy bilingual skills came in handy when I proofed the training materials for the Puerto Rico Public Housing Authority in Spanish and noticed errors, including that the glossary had been translated but not re-alphabetized. Public Relations Assistant The Alarus Agency, Inc. May 2008  –  September 2008  (5 months) San Diego, California As a Public Relations Assistant at the Alarus Agency, I wrote and edited press releases, pitched to the media and updated media lists. I also reworked PowerPoint presentations and wrote talking points for clients.  \n \nMy other responsibilities included soliciting donations and creating a trivia contest for a fundraising auction, and staffing a variety of events. Public Relations Assistant The Alarus Agency, Inc. May 2008  –  September 2008  (5 months) San Diego, California As a Public Relations Assistant at the Alarus Agency, I wrote and edited press releases, pitched to the media and updated media lists. I also reworked PowerPoint presentations and wrote talking points for clients.  \n \nMy other responsibilities included soliciting donations and creating a trivia contest for a fundraising auction, and staffing a variety of events. Communications Consultant Empire Water February 2008  –  April 2008  (3 months) San Diego, California While briefly working as a Communications Consultant for Empire Water, I coordinated with the graphic designer to develop the look and feel of the corporate website. I also created Web content and management team biographies. Communications Consultant Empire Water February 2008  –  April 2008  (3 months) San Diego, California While briefly working as a Communications Consultant for Empire Water, I coordinated with the graphic designer to develop the look and feel of the corporate website. I also created Web content and management team biographies. Marketing Assistant/Conference Coordinator Basin Water, Inc. December 2007  –  February 2008  (3 months) San Diego, California I had a dual role at Basin Water: Marketing Assistant and Conference Coordinator. My Marketing duties included working on research projects and proposals, writing and editing reports, and other miscellaneous administrative tasks. For nationwide industry conferences, I was tasked with researching dates for attendance, requirements for exhibiting and cost estimates. Marketing Assistant/Conference Coordinator Basin Water, Inc. December 2007  –  February 2008  (3 months) San Diego, California I had a dual role at Basin Water: Marketing Assistant and Conference Coordinator. My Marketing duties included working on research projects and proposals, writing and editing reports, and other miscellaneous administrative tasks. For nationwide industry conferences, I was tasked with researching dates for attendance, requirements for exhibiting and cost estimates. Communications Director Town of Palm Beach Civic Association September 2006  –  October 2007  (1 year 2 months) Palm Beach, Florida As the Communications Director for the non-profit Palm Beach Civic Association, the majority of my responsibilities were writing and producing town-wide newsletters, creating custom news updates for directors, writing press releases and updating marketing collateral. I was also the in-house photographer, elections point person and media liaison. \n \nI had the privilege of working with nine committees lead by extraordinary Palm Beach residents who ranged from former U.S. ambassadors and politicians, to retired captains of industry and philanthropists. I was tasked with creating monthly agendas and information packets on a variety of topics for each committee, taking meeting minutes, and following up on questions and research requests. Communications Director Town of Palm Beach Civic Association September 2006  –  October 2007  (1 year 2 months) Palm Beach, Florida As the Communications Director for the non-profit Palm Beach Civic Association, the majority of my responsibilities were writing and producing town-wide newsletters, creating custom news updates for directors, writing press releases and updating marketing collateral. I was also the in-house photographer, elections point person and media liaison. \n \nI had the privilege of working with nine committees lead by extraordinary Palm Beach residents who ranged from former U.S. ambassadors and politicians, to retired captains of industry and philanthropists. I was tasked with creating monthly agendas and information packets on a variety of topics for each committee, taking meeting minutes, and following up on questions and research requests. Madison County Bureau Reporter The Post-Standard January 2006  –  June 2006  (6 months) Canastota, New York After completing my master’s degree in journalism, I transitioned into a full-time reporter position for The Post-Standard’s Madison County Bureau. My assigned beats included crime and safety, county court, Cazenovia College, the Town of Cazenovia and the Village of Cazenovia.  \n \nI covered two high-profile stories of national interest: the trial of the third man to be charged with making a terrorist threat in New York State and the homicide investigation of slain New Hartford Police Officer Joseph Corr. Some of my stories were featured on the front page (A-1) and in all editions of the newspaper (not just the Madison County edition). I also received two photo credits for photos I took of a melted semitruck and the scene of a car accident. Madison County Bureau Reporter The Post-Standard January 2006  –  June 2006  (6 months) Canastota, New York After completing my master’s degree in journalism, I transitioned into a full-time reporter position for The Post-Standard’s Madison County Bureau. My assigned beats included crime and safety, county court, Cazenovia College, the Town of Cazenovia and the Village of Cazenovia.  \n \nI covered two high-profile stories of national interest: the trial of the third man to be charged with making a terrorist threat in New York State and the homicide investigation of slain New Hartford Police Officer Joseph Corr. Some of my stories were featured on the front page (A-1) and in all editions of the newspaper (not just the Madison County edition). I also received two photo credits for photos I took of a melted semitruck and the scene of a car accident. Newhouse Fellow/Contributing Writer The Post-Standard January 2005  –  January 2006  (1 year 1 month) Syracuse, New York I was one of two recipients of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities for 2004-2005. While working on my master’s degree, I interned 30 hours a week at The Post-Standard as a Contributing Writer for the Metro and Regional Desks. Most of the stories I covered were community events, guest speakers, business profiles and school meetings. Newhouse Fellow/Contributing Writer The Post-Standard January 2005  –  January 2006  (1 year 1 month) Syracuse, New York I was one of two recipients of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities for 2004-2005. While working on my master’s degree, I interned 30 hours a week at The Post-Standard as a Contributing Writer for the Metro and Regional Desks. Most of the stories I covered were community events, guest speakers, business profiles and school meetings. Associate Director SDSU International Business and Economics Internship Program August 2000  –  August 2001  (1 year 1 month) San Diego, California As Associate Director I managed a database that included 300 students and 150 employers for the San Diego State University International Business and Economics Internship Program. I met with students in the program during office hours to answer questions and receive their submissions. I was also responsible for some office administration work, funds management, clerical work and training new staff. Associate Director SDSU International Business and Economics Internship Program August 2000  –  August 2001  (1 year 1 month) San Diego, California As Associate Director I managed a database that included 300 students and 150 employers for the San Diego State University International Business and Economics Internship Program. I met with students in the program during office hours to answer questions and receive their submissions. I was also responsible for some office administration work, funds management, clerical work and training new staff. Languages Spanish Limited working proficiency English Full professional proficiency Spanish Limited working proficiency English Full professional proficiency Spanish Limited working proficiency English Full professional proficiency Limited working proficiency Full professional proficiency Skills Editing Copy Editing Ap Style Press Releases Copywriting Storytelling Corporate Communications Marketing Communications Proofreading Journalism Crisis Communications Spanish-speaking Microsoft Word Microsoft Excel Adobe Acrobat Photoshop Elements Outlook Constant Contact Adobe Creative Suite Newsletters Editorial AP Style Internal Communications Feature Articles Creative Problem Solving Interviews Project Management Publications Public Relations Fundraising Social Media Newspapers Event Management Proposal Writing Community Outreach Media Relations Community Development Public Speaking Blogging Speech Writing Research Facebook Creative Direction Web Content Writing News Writing See 31+     See less Skills  Editing Copy Editing Ap Style Press Releases Copywriting Storytelling Corporate Communications Marketing Communications Proofreading Journalism Crisis Communications Spanish-speaking Microsoft Word Microsoft Excel Adobe Acrobat Photoshop Elements Outlook Constant Contact Adobe Creative Suite Newsletters Editorial AP Style Internal Communications Feature Articles Creative Problem Solving Interviews Project Management Publications Public Relations Fundraising Social Media Newspapers Event Management Proposal Writing Community Outreach Media Relations Community Development Public Speaking Blogging Speech Writing Research Facebook Creative Direction Web Content Writing News Writing See 31+     See less Editing Copy Editing Ap Style Press Releases Copywriting Storytelling Corporate Communications Marketing Communications Proofreading Journalism Crisis Communications Spanish-speaking Microsoft Word Microsoft Excel Adobe Acrobat Photoshop Elements Outlook Constant Contact Adobe Creative Suite Newsletters Editorial AP Style Internal Communications Feature Articles Creative Problem Solving Interviews Project Management Publications Public Relations Fundraising Social Media Newspapers Event Management Proposal Writing Community Outreach Media Relations Community Development Public Speaking Blogging Speech Writing Research Facebook Creative Direction Web Content Writing News Writing See 31+     See less Editing Copy Editing Ap Style Press Releases Copywriting Storytelling Corporate Communications Marketing Communications Proofreading Journalism Crisis Communications Spanish-speaking Microsoft Word Microsoft Excel Adobe Acrobat Photoshop Elements Outlook Constant Contact Adobe Creative Suite Newsletters Editorial AP Style Internal Communications Feature Articles Creative Problem Solving Interviews Project Management Publications Public Relations Fundraising Social Media Newspapers Event Management Proposal Writing Community Outreach Media Relations Community Development Public Speaking Blogging Speech Writing Research Facebook Creative Direction Web Content Writing News Writing See 31+     See less Education Syracuse University MA,  Magazine , Newspaper and Online Journalism 2004  – 2005 • 2004-2005 recipient of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities \n• Edited a special edition of The Student Voice, Spring 2005 \n• Wrote Sunday A-1 enterprise story about retail in suburbia for the Observer-Dispatch, Summer 2005 San Diego State University-California State University BA,  Economics ,  International Emphasis 1997  – 2001 • Minor in English with a Social Science emphasis \n• Center for Public Economics Scholarship recipient Activities and Societies:  Omicron Delta Episilon - International Economics Honor Society member Syracuse University MA,  Magazine , Newspaper and Online Journalism 2004  – 2005 • 2004-2005 recipient of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities \n• Edited a special edition of The Student Voice, Spring 2005 \n• Wrote Sunday A-1 enterprise story about retail in suburbia for the Observer-Dispatch, Summer 2005 Syracuse University MA,  Magazine , Newspaper and Online Journalism 2004  – 2005 • 2004-2005 recipient of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities \n• Edited a special edition of The Student Voice, Spring 2005 \n• Wrote Sunday A-1 enterprise story about retail in suburbia for the Observer-Dispatch, Summer 2005 Syracuse University MA,  Magazine , Newspaper and Online Journalism 2004  – 2005 • 2004-2005 recipient of the Newhouse Graduate Fellowship and Apprenticeship in Newspaper Journalism for Minorities \n• Edited a special edition of The Student Voice, Spring 2005 \n• Wrote Sunday A-1 enterprise story about retail in suburbia for the Observer-Dispatch, Summer 2005 San Diego State University-California State University BA,  Economics ,  International Emphasis 1997  – 2001 • Minor in English with a Social Science emphasis \n• Center for Public Economics Scholarship recipient Activities and Societies:  Omicron Delta Episilon - International Economics Honor Society member San Diego State University-California State University BA,  Economics ,  International Emphasis 1997  – 2001 • Minor in English with a Social Science emphasis \n• Center for Public Economics Scholarship recipient Activities and Societies:  Omicron Delta Episilon - International Economics Honor Society member San Diego State University-California State University BA,  Economics ,  International Emphasis 1997  – 2001 • Minor in English with a Social Science emphasis \n• Center for Public Economics Scholarship recipient Activities and Societies:  Omicron Delta Episilon - International Economics Honor Society member Honors & Awards Additional Honors & Awards • 2013 NIMS IS 700 & ICS 100-200 for Healthcare Professionals Course Completion Certificate \n• 2012 Bronze Edward L. Bernays Award, Mark of Excellence Award in Newsletters, from the Public Relations Society of America (PRSA) San Diego Chapter \n• 2011 Silver Finest Award, Online Communications - E-newsletters - Internal, from Health Care Communicators of San Diego \n• 2010 Gold Finest Award, Online Communications - E-zines and Internet Newsletters, from Health Care Communicators of San Diego. \n• 2010 Bronze Edward L. Bernays Award, Mark of Excellence in Multimedia Communications, from the Public Relations Society of America (PRSA) San Diego Chapter \n• Housing Choice Voucher (HCV) Specialist certification \n• Fair Housing Specialist certification \n• HCV Financial Management and Reporting certification Additional Honors & Awards • 2013 NIMS IS 700 & ICS 100-200 for Healthcare Professionals Course Completion Certificate \n• 2012 Bronze Edward L. Bernays Award, Mark of Excellence Award in Newsletters, from the Public Relations Society of America (PRSA) San Diego Chapter \n• 2011 Silver Finest Award, Online Communications - E-newsletters - Internal, from Health Care Communicators of San Diego \n• 2010 Gold Finest Award, Online Communications - E-zines and Internet Newsletters, from Health Care Communicators of San Diego. \n• 2010 Bronze Edward L. Bernays Award, Mark of Excellence in Multimedia Communications, from the Public Relations Society of America (PRSA) San Diego Chapter \n• Housing Choice Voucher (HCV) Specialist certification \n• Fair Housing Specialist certification \n• HCV Financial Management and Reporting certification Additional Honors & Awards • 2013 NIMS IS 700 & ICS 100-200 for Healthcare Professionals Course Completion Certificate \n• 2012 Bronze Edward L. Bernays Award, Mark of Excellence Award in Newsletters, from the Public Relations Society of America (PRSA) San Diego Chapter \n• 2011 Silver Finest Award, Online Communications - E-newsletters - Internal, from Health Care Communicators of San Diego \n• 2010 Gold Finest Award, Online Communications - E-zines and Internet Newsletters, from Health Care Communicators of San Diego. \n• 2010 Bronze Edward L. Bernays Award, Mark of Excellence in Multimedia Communications, from the Public Relations Society of America (PRSA) San Diego Chapter \n• Housing Choice Voucher (HCV) Specialist certification \n• Fair Housing Specialist certification \n• HCV Financial Management and Reporting certification Additional Honors & Awards • 2013 NIMS IS 700 & ICS 100-200 for Healthcare Professionals Course Completion Certificate \n• 2012 Bronze Edward L. Bernays Award, Mark of Excellence Award in Newsletters, from the Public Relations Society of America (PRSA) San Diego Chapter \n• 2011 Silver Finest Award, Online Communications - E-newsletters - Internal, from Health Care Communicators of San Diego \n• 2010 Gold Finest Award, Online Communications - E-zines and Internet Newsletters, from Health Care Communicators of San Diego. \n• 2010 Bronze Edward L. Bernays Award, Mark of Excellence in Multimedia Communications, from the Public Relations Society of America (PRSA) San Diego Chapter \n• Housing Choice Voucher (HCV) Specialist certification \n• Fair Housing Specialist certification \n• HCV Financial Management and Reporting certification ", "Summary You can find me on Twitter @girljournalist. \n \nI’m not your typical journalist. Part techie, part businesswoman, and an entrepreneur at heart, I enjoy learning and teaching as well as experimenting with new ways to produce, package, publish and promote digital content. \n \nWhen I’m not online or teaching I may be up in the air learning to fly, or in a pool swimming with my daughter. I love margaritas with a kick, hot yoga and cupcakes. \n \n \nSpecialties: Content strategy, Content Management Systems, strategic planning, production management, social media planning, social media strategy, social media management, public relations, business development, project management, mobile media, journalism and digital media education. Summary You can find me on Twitter @girljournalist. \n \nI’m not your typical journalist. Part techie, part businesswoman, and an entrepreneur at heart, I enjoy learning and teaching as well as experimenting with new ways to produce, package, publish and promote digital content. \n \nWhen I’m not online or teaching I may be up in the air learning to fly, or in a pool swimming with my daughter. I love margaritas with a kick, hot yoga and cupcakes. \n \n \nSpecialties: Content strategy, Content Management Systems, strategic planning, production management, social media planning, social media strategy, social media management, public relations, business development, project management, mobile media, journalism and digital media education. You can find me on Twitter @girljournalist. \n \nI’m not your typical journalist. Part techie, part businesswoman, and an entrepreneur at heart, I enjoy learning and teaching as well as experimenting with new ways to produce, package, publish and promote digital content. \n \nWhen I’m not online or teaching I may be up in the air learning to fly, or in a pool swimming with my daughter. I love margaritas with a kick, hot yoga and cupcakes. \n \n \nSpecialties: Content strategy, Content Management Systems, strategic planning, production management, social media planning, social media strategy, social media management, public relations, business development, project management, mobile media, journalism and digital media education. You can find me on Twitter @girljournalist. \n \nI’m not your typical journalist. Part techie, part businesswoman, and an entrepreneur at heart, I enjoy learning and teaching as well as experimenting with new ways to produce, package, publish and promote digital content. \n \nWhen I’m not online or teaching I may be up in the air learning to fly, or in a pool swimming with my daughter. I love margaritas with a kick, hot yoga and cupcakes. \n \n \nSpecialties: Content strategy, Content Management Systems, strategic planning, production management, social media planning, social media strategy, social media management, public relations, business development, project management, mobile media, journalism and digital media education. Experience Social Media Strategist Global Press Institute July 2015  – Present (2 months) Communications Specialist Stanford University January 2015  – Present (8 months) Developing new web content for Stanford Human Resources websites, working in collaboration with HR departments and groups. General communication support for HR communications team. Journalist in Residence Notre Dame de Namur University August 2014  –  May 2015  (10 months) Belmont, CA Associate Director of Digital & Social Media Stanford University, School of Engineering August 2011  –  August 2014  (3 years 1 month) Stanford, CA Lecturer San Francisco State University August 2009  –  August 2011  (2 years 1 month) San Francisco, CA Community Manager/Associate Content Manager - BNET.com CBS Interactive September 2009  –  March 2011  (1 year 7 months) Social Media/Community Manager Bizmore February 2010  –  June 2010  (5 months) Senior Internet Marketing Manager Lucasfilm January 2008  –  September 2009  (1 year 9 months) Instructor University of Tennessee July 2007  –  April 2008  (10 months) Innovations Project Manager E.W. Scripps April 2007  –  January 2008  (10 months) Multimedia Project Manager MSN Money 2006  –  2007  (1 year) Multimedia Coordinator University of Kansas June 2004  –  August 2006  (2 years 3 months) Social Media Strategist Global Press Institute July 2015  – Present (2 months) Social Media Strategist Global Press Institute July 2015  – Present (2 months) Communications Specialist Stanford University January 2015  – Present (8 months) Developing new web content for Stanford Human Resources websites, working in collaboration with HR departments and groups. General communication support for HR communications team. Communications Specialist Stanford University January 2015  – Present (8 months) Developing new web content for Stanford Human Resources websites, working in collaboration with HR departments and groups. General communication support for HR communications team. Journalist in Residence Notre Dame de Namur University August 2014  –  May 2015  (10 months) Belmont, CA Journalist in Residence Notre Dame de Namur University August 2014  –  May 2015  (10 months) Belmont, CA Associate Director of Digital & Social Media Stanford University, School of Engineering August 2011  –  August 2014  (3 years 1 month) Stanford, CA Associate Director of Digital & Social Media Stanford University, School of Engineering August 2011  –  August 2014  (3 years 1 month) Stanford, CA Lecturer San Francisco State University August 2009  –  August 2011  (2 years 1 month) San Francisco, CA Lecturer San Francisco State University August 2009  –  August 2011  (2 years 1 month) San Francisco, CA Community Manager/Associate Content Manager - BNET.com CBS Interactive September 2009  –  March 2011  (1 year 7 months) Community Manager/Associate Content Manager - BNET.com CBS Interactive September 2009  –  March 2011  (1 year 7 months) Social Media/Community Manager Bizmore February 2010  –  June 2010  (5 months) Social Media/Community Manager Bizmore February 2010  –  June 2010  (5 months) Senior Internet Marketing Manager Lucasfilm January 2008  –  September 2009  (1 year 9 months) Senior Internet Marketing Manager Lucasfilm January 2008  –  September 2009  (1 year 9 months) Instructor University of Tennessee July 2007  –  April 2008  (10 months) Instructor University of Tennessee July 2007  –  April 2008  (10 months) Innovations Project Manager E.W. Scripps April 2007  –  January 2008  (10 months) Innovations Project Manager E.W. Scripps April 2007  –  January 2008  (10 months) Multimedia Project Manager MSN Money 2006  –  2007  (1 year) Multimedia Project Manager MSN Money 2006  –  2007  (1 year) Multimedia Coordinator University of Kansas June 2004  –  August 2006  (2 years 3 months) Multimedia Coordinator University of Kansas June 2004  –  August 2006  (2 years 3 months) Skills Blogging Digital Media Social Media Content Strategy Social Media Marketing Facebook Social Networking CMS Online Marketing Content Management Multimedia Journalism Editing Digital Strategy New Media Copy Editing Email Marketing Copywriting Web Content Integrated Marketing WordPress Mobile Media Project Management Advertising Product Management Online Advertising Web Analytics SEO Public Relations Newsletters Storytelling Publishing Video Editorial Magazines Consultancy SPSS Radian6 CisionPoint See 24+     See less Skills  Blogging Digital Media Social Media Content Strategy Social Media Marketing Facebook Social Networking CMS Online Marketing Content Management Multimedia Journalism Editing Digital Strategy New Media Copy Editing Email Marketing Copywriting Web Content Integrated Marketing WordPress Mobile Media Project Management Advertising Product Management Online Advertising Web Analytics SEO Public Relations Newsletters Storytelling Publishing Video Editorial Magazines Consultancy SPSS Radian6 CisionPoint See 24+     See less Blogging Digital Media Social Media Content Strategy Social Media Marketing Facebook Social Networking CMS Online Marketing Content Management Multimedia Journalism Editing Digital Strategy New Media Copy Editing Email Marketing Copywriting Web Content Integrated Marketing WordPress Mobile Media Project Management Advertising Product Management Online Advertising Web Analytics SEO Public Relations Newsletters Storytelling Publishing Video Editorial Magazines Consultancy SPSS Radian6 CisionPoint See 24+     See less Blogging Digital Media Social Media Content Strategy Social Media Marketing Facebook Social Networking CMS Online Marketing Content Management Multimedia Journalism Editing Digital Strategy New Media Copy Editing Email Marketing Copywriting Web Content Integrated Marketing WordPress Mobile Media Project Management Advertising Product Management Online Advertising Web Analytics SEO Public Relations Newsletters Storytelling Publishing Video Editorial Magazines Consultancy SPSS Radian6 CisionPoint See 24+     See less Education Kent State University Master of Journalism,  Public Relations 2013  – 2015 Activities and Societies:  PRSA University of Kansas Masters ABT,  Journalism News & Information 2003  – 2006 Graduate Teaching Assistant for online journalism courses. \nHelped design and build Stauffer Multimedia Newsroom. \nLaunched redesigned KUJH-TV website. \nSupervised student web producers. Activities and Societies:  Web Editor ,  Daily Kansan\nMultimedia Coordinator ,  Stauffer Multimedia Newsroom University of Phoenix Bachelor of Science,  Business/Information Systems 1998  – 2001 Kent State University Master of Journalism,  Public Relations 2013  – 2015 Activities and Societies:  PRSA Kent State University Master of Journalism,  Public Relations 2013  – 2015 Activities and Societies:  PRSA Kent State University Master of Journalism,  Public Relations 2013  – 2015 Activities and Societies:  PRSA University of Kansas Masters ABT,  Journalism News & Information 2003  – 2006 Graduate Teaching Assistant for online journalism courses. \nHelped design and build Stauffer Multimedia Newsroom. \nLaunched redesigned KUJH-TV website. \nSupervised student web producers. Activities and Societies:  Web Editor ,  Daily Kansan\nMultimedia Coordinator ,  Stauffer Multimedia Newsroom University of Kansas Masters ABT,  Journalism News & Information 2003  – 2006 Graduate Teaching Assistant for online journalism courses. \nHelped design and build Stauffer Multimedia Newsroom. \nLaunched redesigned KUJH-TV website. \nSupervised student web producers. Activities and Societies:  Web Editor ,  Daily Kansan\nMultimedia Coordinator ,  Stauffer Multimedia Newsroom University of Kansas Masters ABT,  Journalism News & Information 2003  – 2006 Graduate Teaching Assistant for online journalism courses. \nHelped design and build Stauffer Multimedia Newsroom. \nLaunched redesigned KUJH-TV website. \nSupervised student web producers. Activities and Societies:  Web Editor ,  Daily Kansan\nMultimedia Coordinator ,  Stauffer Multimedia Newsroom University of Phoenix Bachelor of Science,  Business/Information Systems 1998  – 2001 University of Phoenix Bachelor of Science,  Business/Information Systems 1998  – 2001 University of Phoenix Bachelor of Science,  Business/Information Systems 1998  – 2001 Honors & Awards Distinguished Service to Journalism Education Award Journalism Association of Community Colleges April 2013 Each year JACC presents a Distinguished Service to Journalism Education Award to someone outside of the organization who has contributed significantly to community college journalism education and the organization. Annual scholarships are awarded in the name of the honoree. Additional Honors & Awards Society for New Communications Research, Excellence in New Communications Award for Stanford School of Engineering Website, 2012 \nSemifinalist, 2011 Adobe Design Achievement Awards, Innovation in Interactive Media in Education \nFinalist, Adobe Max Award 2008 \nLoeb Award for Online Financial Journalism 2008  \nBest independent news website, Society of Professional Journalists Region 12 2008 \nBest in Business, Society of American Business Editors 2007 \nBruce Linton Graduate Award in Broadcast 2006 \n10 student regional awards, Society of Professional Journalists 2005 \nTwo student awards, Kansas Association of Broadcasters 2005 \nFirst place website design, Kansas Professional Communicators 2005 \nFirst place undergraduate student station website, Kansas Professional Communicators 2005 Distinguished Service to Journalism Education Award Journalism Association of Community Colleges April 2013 Each year JACC presents a Distinguished Service to Journalism Education Award to someone outside of the organization who has contributed significantly to community college journalism education and the organization. Annual scholarships are awarded in the name of the honoree. Distinguished Service to Journalism Education Award Journalism Association of Community Colleges April 2013 Each year JACC presents a Distinguished Service to Journalism Education Award to someone outside of the organization who has contributed significantly to community college journalism education and the organization. Annual scholarships are awarded in the name of the honoree. Distinguished Service to Journalism Education Award Journalism Association of Community Colleges April 2013 Each year JACC presents a Distinguished Service to Journalism Education Award to someone outside of the organization who has contributed significantly to community college journalism education and the organization. Annual scholarships are awarded in the name of the honoree. Additional Honors & Awards Society for New Communications Research, Excellence in New Communications Award for Stanford School of Engineering Website, 2012 \nSemifinalist, 2011 Adobe Design Achievement Awards, Innovation in Interactive Media in Education \nFinalist, Adobe Max Award 2008 \nLoeb Award for Online Financial Journalism 2008  \nBest independent news website, Society of Professional Journalists Region 12 2008 \nBest in Business, Society of American Business Editors 2007 \nBruce Linton Graduate Award in Broadcast 2006 \n10 student regional awards, Society of Professional Journalists 2005 \nTwo student awards, Kansas Association of Broadcasters 2005 \nFirst place website design, Kansas Professional Communicators 2005 \nFirst place undergraduate student station website, Kansas Professional Communicators 2005 Additional Honors & Awards Society for New Communications Research, Excellence in New Communications Award for Stanford School of Engineering Website, 2012 \nSemifinalist, 2011 Adobe Design Achievement Awards, Innovation in Interactive Media in Education \nFinalist, Adobe Max Award 2008 \nLoeb Award for Online Financial Journalism 2008  \nBest independent news website, Society of Professional Journalists Region 12 2008 \nBest in Business, Society of American Business Editors 2007 \nBruce Linton Graduate Award in Broadcast 2006 \n10 student regional awards, Society of Professional Journalists 2005 \nTwo student awards, Kansas Association of Broadcasters 2005 \nFirst place website design, Kansas Professional Communicators 2005 \nFirst place undergraduate student station website, Kansas Professional Communicators 2005 Additional Honors & Awards Society for New Communications Research, Excellence in New Communications Award for Stanford School of Engineering Website, 2012 \nSemifinalist, 2011 Adobe Design Achievement Awards, Innovation in Interactive Media in Education \nFinalist, Adobe Max Award 2008 \nLoeb Award for Online Financial Journalism 2008  \nBest independent news website, Society of Professional Journalists Region 12 2008 \nBest in Business, Society of American Business Editors 2007 \nBruce Linton Graduate Award in Broadcast 2006 \n10 student regional awards, Society of Professional Journalists 2005 \nTwo student awards, Kansas Association of Broadcasters 2005 \nFirst place website design, Kansas Professional Communicators 2005 \nFirst place undergraduate student station website, Kansas Professional Communicators 2005 ", "Experience Technical Writer Xoom Corporation January 2015  – Present (8 months) San Francisco Bay Area Web Content Coordinator Kaiser Permanente July 2013  – Present (2 years 2 months) Oakland, CA Contracted via Modis. Converted to Permanent employee in June 2014. Sr. Technical Writer The Weather Channel October 2012  –  January 2014  (1 year 4 months) san francisco, ca Created documentation to assist with the migration and integration of Weather Underground with the Weather Company. Also documenting the hardware and software components for the IntelliStar product. Web Communications Specialist Stanford University School of Medicine January 2012  –  October 2012  (10 months) Menlo Park, CA Owner/Editor in Chief Front Runner Communications 2005  –  December 2011  (6 years) Documentation Consultant MyVest April 2011  –  August 2011  (5 months) Technical writing, Wiki management and administration, KnowledgeBase development, QA testing. Daily Confluence and Jira monitoring and usage. Technical Writing Consultant consilium1 April 2010  –  February 2011  (11 months) Maintain a suite of user documentation including User Guides, Release Notes, Knowledge Base, and Wiki pages to support a web-based order entry system for interactive television advertising system. Provide training and administration for Confluence Wiki site. Write marketing case studies and articles for publication. Perform user acceptance testing. Assist in creating and editing all written materials. Technical Writer IHG August 2007  –  February 2010  (2 years 7 months) Managed team of four technical writers. Produced weekly educational email for non-technical audience describing technical concepts. Researched and wrote white papers and industry journal articles. Prepared software requirements documents based on collaboration with business clients. Implemented Confluence Wiki and provided training and administration for over 1,000 daily global users. Graduate student Georgia State University 2001  –  2004  (3 years) Atlanta, GA Assisted in all lab duties while pursuing a Master’s degree in Communications. Administered and maintained software on lab computers (MAC and PC) including Final Cut Pro, Photoshop, Dreamweaver, Fireworks, Word, Excel, and PowerPoint. Provided software support to students and faculty. Provided digital photography for marketing. Created and maintained DAEL website, including streaming video pages. technical writer Bellsouth 1992  –  1999  (7 years) Technical Writer Xoom Corporation January 2015  – Present (8 months) San Francisco Bay Area Technical Writer Xoom Corporation January 2015  – Present (8 months) San Francisco Bay Area Web Content Coordinator Kaiser Permanente July 2013  – Present (2 years 2 months) Oakland, CA Contracted via Modis. Converted to Permanent employee in June 2014. Web Content Coordinator Kaiser Permanente July 2013  – Present (2 years 2 months) Oakland, CA Contracted via Modis. Converted to Permanent employee in June 2014. Sr. Technical Writer The Weather Channel October 2012  –  January 2014  (1 year 4 months) san francisco, ca Created documentation to assist with the migration and integration of Weather Underground with the Weather Company. Also documenting the hardware and software components for the IntelliStar product. Sr. Technical Writer The Weather Channel October 2012  –  January 2014  (1 year 4 months) san francisco, ca Created documentation to assist with the migration and integration of Weather Underground with the Weather Company. Also documenting the hardware and software components for the IntelliStar product. Web Communications Specialist Stanford University School of Medicine January 2012  –  October 2012  (10 months) Menlo Park, CA Web Communications Specialist Stanford University School of Medicine January 2012  –  October 2012  (10 months) Menlo Park, CA Owner/Editor in Chief Front Runner Communications 2005  –  December 2011  (6 years) Owner/Editor in Chief Front Runner Communications 2005  –  December 2011  (6 years) Documentation Consultant MyVest April 2011  –  August 2011  (5 months) Technical writing, Wiki management and administration, KnowledgeBase development, QA testing. Daily Confluence and Jira monitoring and usage. Documentation Consultant MyVest April 2011  –  August 2011  (5 months) Technical writing, Wiki management and administration, KnowledgeBase development, QA testing. Daily Confluence and Jira monitoring and usage. Technical Writing Consultant consilium1 April 2010  –  February 2011  (11 months) Maintain a suite of user documentation including User Guides, Release Notes, Knowledge Base, and Wiki pages to support a web-based order entry system for interactive television advertising system. Provide training and administration for Confluence Wiki site. Write marketing case studies and articles for publication. Perform user acceptance testing. Assist in creating and editing all written materials. Technical Writing Consultant consilium1 April 2010  –  February 2011  (11 months) Maintain a suite of user documentation including User Guides, Release Notes, Knowledge Base, and Wiki pages to support a web-based order entry system for interactive television advertising system. Provide training and administration for Confluence Wiki site. Write marketing case studies and articles for publication. Perform user acceptance testing. Assist in creating and editing all written materials. Technical Writer IHG August 2007  –  February 2010  (2 years 7 months) Managed team of four technical writers. Produced weekly educational email for non-technical audience describing technical concepts. Researched and wrote white papers and industry journal articles. Prepared software requirements documents based on collaboration with business clients. Implemented Confluence Wiki and provided training and administration for over 1,000 daily global users. Technical Writer IHG August 2007  –  February 2010  (2 years 7 months) Managed team of four technical writers. Produced weekly educational email for non-technical audience describing technical concepts. Researched and wrote white papers and industry journal articles. Prepared software requirements documents based on collaboration with business clients. Implemented Confluence Wiki and provided training and administration for over 1,000 daily global users. Graduate student Georgia State University 2001  –  2004  (3 years) Atlanta, GA Assisted in all lab duties while pursuing a Master’s degree in Communications. Administered and maintained software on lab computers (MAC and PC) including Final Cut Pro, Photoshop, Dreamweaver, Fireworks, Word, Excel, and PowerPoint. Provided software support to students and faculty. Provided digital photography for marketing. Created and maintained DAEL website, including streaming video pages. Graduate student Georgia State University 2001  –  2004  (3 years) Atlanta, GA Assisted in all lab duties while pursuing a Master’s degree in Communications. Administered and maintained software on lab computers (MAC and PC) including Final Cut Pro, Photoshop, Dreamweaver, Fireworks, Word, Excel, and PowerPoint. Provided software support to students and faculty. Provided digital photography for marketing. Created and maintained DAEL website, including streaming video pages. technical writer Bellsouth 1992  –  1999  (7 years) technical writer Bellsouth 1992  –  1999  (7 years) Skills Technical Writing Editing Information Architecture Blogging Copy Editing Copywriting Adobe Acrobat Dreamweaver Social Media Content Strategy Journalism Agile Methodologies Newsletters Creative Writing Web Content Management Content Management Quality Assurance Software Documentation Marketing Photography Training User Experience Advertising Web Content See 9+     See less Skills  Technical Writing Editing Information Architecture Blogging Copy Editing Copywriting Adobe Acrobat Dreamweaver Social Media Content Strategy Journalism Agile Methodologies Newsletters Creative Writing Web Content Management Content Management Quality Assurance Software Documentation Marketing Photography Training User Experience Advertising Web Content See 9+     See less Technical Writing Editing Information Architecture Blogging Copy Editing Copywriting Adobe Acrobat Dreamweaver Social Media Content Strategy Journalism Agile Methodologies Newsletters Creative Writing Web Content Management Content Management Quality Assurance Software Documentation Marketing Photography Training User Experience Advertising Web Content See 9+     See less Technical Writing Editing Information Architecture Blogging Copy Editing Copywriting Adobe Acrobat Dreamweaver Social Media Content Strategy Journalism Agile Methodologies Newsletters Creative Writing Web Content Management Content Management Quality Assurance Software Documentation Marketing Photography Training User Experience Advertising Web Content See 9+     See less Education Georgia State University MA,  Communications - Film/Video 2001  – 2004 Activities and Societies:  Graduate Research assistant at Digital Arts & Entertainment Lab (DAEL) Georgia State University BA,  Journalism 1978  – 1985 Activities and Societies:  The Signal student newspaper ,  writer ,  photo editor Georgia State University MA,  Communications - Film/Video 2001  – 2004 Activities and Societies:  Graduate Research assistant at Digital Arts & Entertainment Lab (DAEL) Georgia State University MA,  Communications - Film/Video 2001  – 2004 Activities and Societies:  Graduate Research assistant at Digital Arts & Entertainment Lab (DAEL) Georgia State University MA,  Communications - Film/Video 2001  – 2004 Activities and Societies:  Graduate Research assistant at Digital Arts & Entertainment Lab (DAEL) Georgia State University BA,  Journalism 1978  – 1985 Activities and Societies:  The Signal student newspaper ,  writer ,  photo editor Georgia State University BA,  Journalism 1978  – 1985 Activities and Societies:  The Signal student newspaper ,  writer ,  photo editor Georgia State University BA,  Journalism 1978  – 1985 Activities and Societies:  The Signal student newspaper ,  writer ,  photo editor Honors & Awards Additional Honors & Awards - Harold Davis Outstanding Graduate Service Award, Georgia State University, 2004 \n \n- Georgia College Press Association (GCPA), Best Editorial Photographer, 1985 \n \n- GCPA Best News Photographer, 1985 \n \n- GCPA Best News Photographer, 1984 \n \n- GCPA Best Sports Photographer, 1984 \n \n- National College Literary Anthology Photography winner, 1985 \n \n- National College Teachers of English (NCTE) Award, 1977 \n \n- Cherokee County Junior Miss, 1977 Additional Honors & Awards - Harold Davis Outstanding Graduate Service Award, Georgia State University, 2004 \n \n- Georgia College Press Association (GCPA), Best Editorial Photographer, 1985 \n \n- GCPA Best News Photographer, 1985 \n \n- GCPA Best News Photographer, 1984 \n \n- GCPA Best Sports Photographer, 1984 \n \n- National College Literary Anthology Photography winner, 1985 \n \n- National College Teachers of English (NCTE) Award, 1977 \n \n- Cherokee County Junior Miss, 1977 Additional Honors & Awards - Harold Davis Outstanding Graduate Service Award, Georgia State University, 2004 \n \n- Georgia College Press Association (GCPA), Best Editorial Photographer, 1985 \n \n- GCPA Best News Photographer, 1985 \n \n- GCPA Best News Photographer, 1984 \n \n- GCPA Best Sports Photographer, 1984 \n \n- National College Literary Anthology Photography winner, 1985 \n \n- National College Teachers of English (NCTE) Award, 1977 \n \n- Cherokee County Junior Miss, 1977 Additional Honors & Awards - Harold Davis Outstanding Graduate Service Award, Georgia State University, 2004 \n \n- Georgia College Press Association (GCPA), Best Editorial Photographer, 1985 \n \n- GCPA Best News Photographer, 1985 \n \n- GCPA Best News Photographer, 1984 \n \n- GCPA Best Sports Photographer, 1984 \n \n- National College Literary Anthology Photography winner, 1985 \n \n- National College Teachers of English (NCTE) Award, 1977 \n \n- Cherokee County Junior Miss, 1977 ", "Skills Microsoft Office Microsoft Excel Web Analytics Content Strategy PowerPoint Outlook SaaS Windows Dreamweaver Editing Fundraising Leadership Program Management Adobe Creative Suite Training Social Media Team Leadership Employee Training Team Motivation See 4+     See less Skills  Microsoft Office Microsoft Excel Web Analytics Content Strategy PowerPoint Outlook SaaS Windows Dreamweaver Editing Fundraising Leadership Program Management Adobe Creative Suite Training Social Media Team Leadership Employee Training Team Motivation See 4+     See less Microsoft Office Microsoft Excel Web Analytics Content Strategy PowerPoint Outlook SaaS Windows Dreamweaver Editing Fundraising Leadership Program Management Adobe Creative Suite Training Social Media Team Leadership Employee Training Team Motivation See 4+     See less Microsoft Office Microsoft Excel Web Analytics Content Strategy PowerPoint Outlook SaaS Windows Dreamweaver Editing Fundraising Leadership Program Management Adobe Creative Suite Training Social Media Team Leadership Employee Training Team Motivation See 4+     See less ", "Experience tele-communications specialist Stanford University May 1995  – Present (20 years 4 months) tele-communications specialist Stanford University May 1995  – Present (20 years 4 months) tele-communications specialist Stanford University May 1995  – Present (20 years 4 months) Skills Editing Research Higher Education Linux Microsoft Office Copy Editing Skills  Editing Research Higher Education Linux Microsoft Office Copy Editing Editing Research Higher Education Linux Microsoft Office Copy Editing Editing Research Higher Education Linux Microsoft Office Copy Editing "]}