{"position": "Database Curator", "company": "Stanford University", "profiles": ["Skills Environmental... Microbiology R Skills  Environmental... Microbiology R Environmental... Microbiology R Environmental... Microbiology R ", "Experience Senior Biocurator Stanford University School of Medicine August 2013  – Present (2 years 1 month) Saccharomyces Genome Database, Dept. of Genetics, Stanford, CA Computational Biologist Stanford University School of Medicine July 2011  –  August 2013  (2 years 2 months) EcoliHub 2.0 / Porteco.org, Dept. of Genetics, Stanford, CA Computational Biologist Stanford University School of Medicine July 2003  –  July 2011  (8 years 1 month) Stanford Microarray Database, Dept. of Biochemistry, Stanford, CA Database Curator Stanford University School of Medicine November 2001  –  July 2003  (1 year 9 months) Stanford Microarray Database, Dept. of Genetics, Stanford, CA Postdoctoral Fellow Stanford University October 1998  –  November 2001  (3 years 2 months) Dept. of Biology, Stanford University, Stanford, CA Curator (consultant) Ingenuity 2000  –  2001  (1 year) San Jose, CA Postgraduate Researcher UCSF June 1989  –  June 1992  (3 years 1 month) San Francisco, CA Senior Biocurator Stanford University School of Medicine August 2013  – Present (2 years 1 month) Saccharomyces Genome Database, Dept. of Genetics, Stanford, CA Senior Biocurator Stanford University School of Medicine August 2013  – Present (2 years 1 month) Saccharomyces Genome Database, Dept. of Genetics, Stanford, CA Computational Biologist Stanford University School of Medicine July 2011  –  August 2013  (2 years 2 months) EcoliHub 2.0 / Porteco.org, Dept. of Genetics, Stanford, CA Computational Biologist Stanford University School of Medicine July 2011  –  August 2013  (2 years 2 months) EcoliHub 2.0 / Porteco.org, Dept. of Genetics, Stanford, CA Computational Biologist Stanford University School of Medicine July 2003  –  July 2011  (8 years 1 month) Stanford Microarray Database, Dept. of Biochemistry, Stanford, CA Computational Biologist Stanford University School of Medicine July 2003  –  July 2011  (8 years 1 month) Stanford Microarray Database, Dept. of Biochemistry, Stanford, CA Database Curator Stanford University School of Medicine November 2001  –  July 2003  (1 year 9 months) Stanford Microarray Database, Dept. of Genetics, Stanford, CA Database Curator Stanford University School of Medicine November 2001  –  July 2003  (1 year 9 months) Stanford Microarray Database, Dept. of Genetics, Stanford, CA Postdoctoral Fellow Stanford University October 1998  –  November 2001  (3 years 2 months) Dept. of Biology, Stanford University, Stanford, CA Postdoctoral Fellow Stanford University October 1998  –  November 2001  (3 years 2 months) Dept. of Biology, Stanford University, Stanford, CA Curator (consultant) Ingenuity 2000  –  2001  (1 year) San Jose, CA Curator (consultant) Ingenuity 2000  –  2001  (1 year) San Jose, CA Postgraduate Researcher UCSF June 1989  –  June 1992  (3 years 1 month) San Francisco, CA Postgraduate Researcher UCSF June 1989  –  June 1992  (3 years 1 month) San Francisco, CA Languages English Native or bilingual proficiency Hungarian Native or bilingual proficiency English Native or bilingual proficiency Hungarian Native or bilingual proficiency English Native or bilingual proficiency Hungarian Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Genetics Genomics Molecular Biology Bioinformatics Biochemistry Lifesciences R Computational Biology PCR Cell Culture Skills  Genetics Genomics Molecular Biology Bioinformatics Biochemistry Lifesciences R Computational Biology PCR Cell Culture Genetics Genomics Molecular Biology Bioinformatics Biochemistry Lifesciences R Computational Biology PCR Cell Culture Genetics Genomics Molecular Biology Bioinformatics Biochemistry Lifesciences R Computational Biology PCR Cell Culture Education Baylor College of Medicine Doctor of Philosophy (Ph.D.),  Biochemisty 1992  – 1998 Eötvös Loránd University Master’s Degree,  Chemistry Baylor College of Medicine Doctor of Philosophy (Ph.D.),  Biochemisty 1992  – 1998 Baylor College of Medicine Doctor of Philosophy (Ph.D.),  Biochemisty 1992  – 1998 Baylor College of Medicine Doctor of Philosophy (Ph.D.),  Biochemisty 1992  – 1998 Eötvös Loránd University Master’s Degree,  Chemistry Eötvös Loránd University Master’s Degree,  Chemistry Eötvös Loránd University Master’s Degree,  Chemistry "]}