{"position": "Development Associate", "company": "Stanford University", "profiles": ["Experience Co-owner Little Miss Prim & Priss March 2012  – Present (3 years 6 months) Hayward, CA Development Associate Stanford University August 2005  – Present (10 years 1 month) Stanford, CA Responsible for reviewing gifts in the Gift Transmittal System (GTS) and processing gifts through the PostGrads database. Use Oracle-based systems in daily work. \nUpdate biographic information as needed and utilize all aspects of the Image system.  \nPull reports in GTS, validate donors as needed, determine which gifts need stewardship and know who to notify if they do. Analyze all gifts that are ready to be processed. Check to see if correct donors are selected, check assigned fund against donor documentation, check anonymity, pledge payments, donor alerts, etc. Process all gifts in batches as they are loaded into PostGrads. Assist with other categories as needed. Helped implement Next of Kin system for PostGrads Interactive database and trained staff on new system. Assisted programming team with testing for the new Gift Transmittal system. Information Specialist Stanford University December 1999  –  August 2005  (5 years 9 months) Stanford, CA Administrative Associate Department of Veterans Affairs 1996  –  December 1999  (3 years) Menlo Park, CA Performed administrative and office support activities for multiple supervisors. Routed telephone calls, received and directed visitors, assisted with weekly mass mailings, word processing, created spreadsheets and presentations, filed, and faxed. Assisted new clients with intake forms. Updated eligible candidates website weekly, assisted with client payroll. Administrative Assistant Jeffrey S. Kline, Ph.D. 1997  –  1998  (1 year) Menlo Park, CA Helped with word processing and mass mailing project, Provider Records Clerk American Western Life Insurance 1993  –  1995  (2 years) San Mateo, CA Prepared and input data into system in an accurate and efficient manner. \nVerified accuracy of information prior to keying, corroborate data accuracy after performing data entry procedures. Updated any new records and information in the database. Compiled statistical data for analysis purposes. Retrieved data for informational purposes as directed. Compared entered data with the source documents. Reviewed physician forms as directed. Co-owner Little Miss Prim & Priss March 2012  – Present (3 years 6 months) Hayward, CA Co-owner Little Miss Prim & Priss March 2012  – Present (3 years 6 months) Hayward, CA Development Associate Stanford University August 2005  – Present (10 years 1 month) Stanford, CA Responsible for reviewing gifts in the Gift Transmittal System (GTS) and processing gifts through the PostGrads database. Use Oracle-based systems in daily work. \nUpdate biographic information as needed and utilize all aspects of the Image system.  \nPull reports in GTS, validate donors as needed, determine which gifts need stewardship and know who to notify if they do. Analyze all gifts that are ready to be processed. Check to see if correct donors are selected, check assigned fund against donor documentation, check anonymity, pledge payments, donor alerts, etc. Process all gifts in batches as they are loaded into PostGrads. Assist with other categories as needed. Helped implement Next of Kin system for PostGrads Interactive database and trained staff on new system. Assisted programming team with testing for the new Gift Transmittal system. Development Associate Stanford University August 2005  – Present (10 years 1 month) Stanford, CA Responsible for reviewing gifts in the Gift Transmittal System (GTS) and processing gifts through the PostGrads database. Use Oracle-based systems in daily work. \nUpdate biographic information as needed and utilize all aspects of the Image system.  \nPull reports in GTS, validate donors as needed, determine which gifts need stewardship and know who to notify if they do. Analyze all gifts that are ready to be processed. Check to see if correct donors are selected, check assigned fund against donor documentation, check anonymity, pledge payments, donor alerts, etc. Process all gifts in batches as they are loaded into PostGrads. Assist with other categories as needed. Helped implement Next of Kin system for PostGrads Interactive database and trained staff on new system. Assisted programming team with testing for the new Gift Transmittal system. Information Specialist Stanford University December 1999  –  August 2005  (5 years 9 months) Stanford, CA Information Specialist Stanford University December 1999  –  August 2005  (5 years 9 months) Stanford, CA Administrative Associate Department of Veterans Affairs 1996  –  December 1999  (3 years) Menlo Park, CA Performed administrative and office support activities for multiple supervisors. Routed telephone calls, received and directed visitors, assisted with weekly mass mailings, word processing, created spreadsheets and presentations, filed, and faxed. Assisted new clients with intake forms. Updated eligible candidates website weekly, assisted with client payroll. Administrative Associate Department of Veterans Affairs 1996  –  December 1999  (3 years) Menlo Park, CA Performed administrative and office support activities for multiple supervisors. Routed telephone calls, received and directed visitors, assisted with weekly mass mailings, word processing, created spreadsheets and presentations, filed, and faxed. Assisted new clients with intake forms. Updated eligible candidates website weekly, assisted with client payroll. Administrative Assistant Jeffrey S. Kline, Ph.D. 1997  –  1998  (1 year) Menlo Park, CA Helped with word processing and mass mailing project, Administrative Assistant Jeffrey S. Kline, Ph.D. 1997  –  1998  (1 year) Menlo Park, CA Helped with word processing and mass mailing project, Provider Records Clerk American Western Life Insurance 1993  –  1995  (2 years) San Mateo, CA Prepared and input data into system in an accurate and efficient manner. \nVerified accuracy of information prior to keying, corroborate data accuracy after performing data entry procedures. Updated any new records and information in the database. Compiled statistical data for analysis purposes. Retrieved data for informational purposes as directed. Compared entered data with the source documents. Reviewed physician forms as directed. Provider Records Clerk American Western Life Insurance 1993  –  1995  (2 years) San Mateo, CA Prepared and input data into system in an accurate and efficient manner. \nVerified accuracy of information prior to keying, corroborate data accuracy after performing data entry procedures. Updated any new records and information in the database. Compiled statistical data for analysis purposes. Retrieved data for informational purposes as directed. Compared entered data with the source documents. Reviewed physician forms as directed. Skills Accounting Accounts Payable General Ledger Microsoft Excel PeopleSoft Accounts Receivable Financial Reporting Data Analysis Account Reconciliation Microsoft Office Research PowerPoint Analysis Skills  Accounting Accounts Payable General Ledger Microsoft Excel PeopleSoft Accounts Receivable Financial Reporting Data Analysis Account Reconciliation Microsoft Office Research PowerPoint Analysis Accounting Accounts Payable General Ledger Microsoft Excel PeopleSoft Accounts Receivable Financial Reporting Data Analysis Account Reconciliation Microsoft Office Research PowerPoint Analysis Accounting Accounts Payable General Ledger Microsoft Excel PeopleSoft Accounts Receivable Financial Reporting Data Analysis Account Reconciliation Microsoft Office Research PowerPoint Analysis Education Chabot College Biological and Physical Sciences 2012  – 2015 Current Student OICW Certificate of Completion,  Advanced Office Skills 1995  – 1996 Carlmont High School Diploma 1989  – 1993 Activities and Societies:  Black Student Union ,  The Bagpiper Newsletter Chabot College Biological and Physical Sciences 2012  – 2015 Current Student Chabot College Biological and Physical Sciences 2012  – 2015 Current Student Chabot College Biological and Physical Sciences 2012  – 2015 Current Student OICW Certificate of Completion,  Advanced Office Skills 1995  – 1996 OICW Certificate of Completion,  Advanced Office Skills 1995  – 1996 OICW Certificate of Completion,  Advanced Office Skills 1995  – 1996 Carlmont High School Diploma 1989  – 1993 Activities and Societies:  Black Student Union ,  The Bagpiper Newsletter Carlmont High School Diploma 1989  – 1993 Activities and Societies:  Black Student Union ,  The Bagpiper Newsletter Carlmont High School Diploma 1989  – 1993 Activities and Societies:  Black Student Union ,  The Bagpiper Newsletter ", "Experience Associate Director of Gift Planning Administration UC Berkeley January 2014  – Present (1 year 8 months) Berkeley Gift Planning Officer UC Berkeley January 2013  – Present (2 years 8 months) Development Officer College of Environmental Design, UC Berkeley May 2011  –  January 2013  (1 year 9 months) Law Clerk Illinois Attorney General's Office May 2009  –  August 2009  (4 months) Law Clerk Harpo November 2007  –  May 2009  (1 year 7 months) Assistant Director of Stewardship Stanford University October 2005  –  July 2006  (10 months) Development Associate Stanford University November 2000  –  October 2005  (5 years) Assistant to Owner Elizabeth Leach Gallery April 2000  –  November 2000  (8 months) Tasting Room Manager Rex Hill Vineyards March 1998  –  April 2000  (2 years 2 months) Resource Assistant Merck Forest and Farmland September 1997  –  January 1998  (5 months) Associate Director of Gift Planning Administration UC Berkeley January 2014  – Present (1 year 8 months) Berkeley Associate Director of Gift Planning Administration UC Berkeley January 2014  – Present (1 year 8 months) Berkeley Gift Planning Officer UC Berkeley January 2013  – Present (2 years 8 months) Gift Planning Officer UC Berkeley January 2013  – Present (2 years 8 months) Development Officer College of Environmental Design, UC Berkeley May 2011  –  January 2013  (1 year 9 months) Development Officer College of Environmental Design, UC Berkeley May 2011  –  January 2013  (1 year 9 months) Law Clerk Illinois Attorney General's Office May 2009  –  August 2009  (4 months) Law Clerk Illinois Attorney General's Office May 2009  –  August 2009  (4 months) Law Clerk Harpo November 2007  –  May 2009  (1 year 7 months) Law Clerk Harpo November 2007  –  May 2009  (1 year 7 months) Assistant Director of Stewardship Stanford University October 2005  –  July 2006  (10 months) Assistant Director of Stewardship Stanford University October 2005  –  July 2006  (10 months) Development Associate Stanford University November 2000  –  October 2005  (5 years) Development Associate Stanford University November 2000  –  October 2005  (5 years) Assistant to Owner Elizabeth Leach Gallery April 2000  –  November 2000  (8 months) Assistant to Owner Elizabeth Leach Gallery April 2000  –  November 2000  (8 months) Tasting Room Manager Rex Hill Vineyards March 1998  –  April 2000  (2 years 2 months) Tasting Room Manager Rex Hill Vineyards March 1998  –  April 2000  (2 years 2 months) Resource Assistant Merck Forest and Farmland September 1997  –  January 1998  (5 months) Resource Assistant Merck Forest and Farmland September 1997  –  January 1998  (5 months) Education Loyola University Chicago School of Law JD,  Law 2006  – 2010 San Francisco State University MA,  Museum Studies 2002  – 2004 University of Oregon BA,  Art History 1993  – 1997 Loyola University Chicago School of Law JD,  Law 2006  – 2010 Loyola University Chicago School of Law JD,  Law 2006  – 2010 Loyola University Chicago School of Law JD,  Law 2006  – 2010 San Francisco State University MA,  Museum Studies 2002  – 2004 San Francisco State University MA,  Museum Studies 2002  – 2004 San Francisco State University MA,  Museum Studies 2002  – 2004 University of Oregon BA,  Art History 1993  – 1997 University of Oregon BA,  Art History 1993  – 1997 University of Oregon BA,  Art History 1993  – 1997 ", "Experience Development Associate Stanford University Development Associate Stanford University Development Associate Stanford University ", "Experience Internal Mobility Specialist Google June 2014  – Present (1 year 3 months) Recruiting Coordinator Google June 2013  –  June 2014  (1 year 1 month) Foreign Service Officer U.S. Department of State January 2010  –  June 2013  (3 years 6 months) Development Associate Stanford University November 2007  –  February 2009  (1 year 4 months) Education Program Manager World Affairs Council of Pittsburgh September 2006  –  August 2007  (1 year) Greater Pittsburgh Area Internal Mobility Specialist Google June 2014  – Present (1 year 3 months) Internal Mobility Specialist Google June 2014  – Present (1 year 3 months) Recruiting Coordinator Google June 2013  –  June 2014  (1 year 1 month) Recruiting Coordinator Google June 2013  –  June 2014  (1 year 1 month) Foreign Service Officer U.S. Department of State January 2010  –  June 2013  (3 years 6 months) Foreign Service Officer U.S. Department of State January 2010  –  June 2013  (3 years 6 months) Development Associate Stanford University November 2007  –  February 2009  (1 year 4 months) Development Associate Stanford University November 2007  –  February 2009  (1 year 4 months) Education Program Manager World Affairs Council of Pittsburgh September 2006  –  August 2007  (1 year) Greater Pittsburgh Area Education Program Manager World Affairs Council of Pittsburgh September 2006  –  August 2007  (1 year) Greater Pittsburgh Area Languages French French French Skills Nonprofits Higher Education Program Development Editing Event Planning Project Management Writing Human Resources Policy Analysis Government Public Policy International Relations Skills  Nonprofits Higher Education Program Development Editing Event Planning Project Management Writing Human Resources Policy Analysis Government Public Policy International Relations Nonprofits Higher Education Program Development Editing Event Planning Project Management Writing Human Resources Policy Analysis Government Public Policy International Relations Nonprofits Higher Education Program Development Editing Event Planning Project Management Writing Human Resources Policy Analysis Government Public Policy International Relations Education Georgetown University Bachelor of Science (BS),  International Political Economy 2002  – 2006 Georgetown University Bachelor of Science (BS),  International Political Economy 2002  – 2006 Georgetown University Bachelor of Science (BS),  International Political Economy 2002  – 2006 Georgetown University Bachelor of Science (BS),  International Political Economy 2002  – 2006 ", "Languages Spanish Professional working proficiency French Elementary proficiency Spanish Professional working proficiency French Elementary proficiency Spanish Professional working proficiency French Elementary proficiency Professional working proficiency Elementary proficiency Skills Program Evaluation Grants Program Development Fundraising Reproductive Health Global Health Family Planning Public Health Non-profits Grant Writing Human Rights International... Proposal Writing Microsoft Office Education Budgeting Teacher Training Spanish-speaking Elementary Education Secondary Education Adult Education Financial Reporting Web Design Academic Tutoring Event Management See 10+     See less Skills  Program Evaluation Grants Program Development Fundraising Reproductive Health Global Health Family Planning Public Health Non-profits Grant Writing Human Rights International... Proposal Writing Microsoft Office Education Budgeting Teacher Training Spanish-speaking Elementary Education Secondary Education Adult Education Financial Reporting Web Design Academic Tutoring Event Management See 10+     See less Program Evaluation Grants Program Development Fundraising Reproductive Health Global Health Family Planning Public Health Non-profits Grant Writing Human Rights International... Proposal Writing Microsoft Office Education Budgeting Teacher Training Spanish-speaking Elementary Education Secondary Education Adult Education Financial Reporting Web Design Academic Tutoring Event Management See 10+     See less Program Evaluation Grants Program Development Fundraising Reproductive Health Global Health Family Planning Public Health Non-profits Grant Writing Human Rights International... Proposal Writing Microsoft Office Education Budgeting Teacher Training Spanish-speaking Elementary Education Secondary Education Adult Education Financial Reporting Web Design Academic Tutoring Event Management See 10+     See less Education University of California, Berkeley BA,  Political Science ,  Rhetoric San Francisco State University Teaching Certificate,  Social Sciences ,  Bilingual Education Mercy College Masters of Science,  Elementary Education ,  Bilingual Education University of California, Berkeley BA,  Political Science ,  Rhetoric University of California, Berkeley BA,  Political Science ,  Rhetoric University of California, Berkeley BA,  Political Science ,  Rhetoric San Francisco State University Teaching Certificate,  Social Sciences ,  Bilingual Education San Francisco State University Teaching Certificate,  Social Sciences ,  Bilingual Education San Francisco State University Teaching Certificate,  Social Sciences ,  Bilingual Education Mercy College Masters of Science,  Elementary Education ,  Bilingual Education Mercy College Masters of Science,  Elementary Education ,  Bilingual Education Mercy College Masters of Science,  Elementary Education ,  Bilingual Education ", "Skills Management Research Nonprofits Qualitative Research Higher Education Community Outreach Editing Event Planning Fundraising Program Development Program Management Project Management Data Analysis Program Evaluation Volunteer Management Event Management Grant Writing See 2+     See less Skills  Management Research Nonprofits Qualitative Research Higher Education Community Outreach Editing Event Planning Fundraising Program Development Program Management Project Management Data Analysis Program Evaluation Volunteer Management Event Management Grant Writing See 2+     See less Management Research Nonprofits Qualitative Research Higher Education Community Outreach Editing Event Planning Fundraising Program Development Program Management Project Management Data Analysis Program Evaluation Volunteer Management Event Management Grant Writing See 2+     See less Management Research Nonprofits Qualitative Research Higher Education Community Outreach Editing Event Planning Fundraising Program Development Program Management Project Management Data Analysis Program Evaluation Volunteer Management Event Management Grant Writing See 2+     See less ", "Skills Legal Research Civil Litigation Courts Immigration Law Skills  Legal Research Civil Litigation Courts Immigration Law Legal Research Civil Litigation Courts Immigration Law Legal Research Civil Litigation Courts Immigration Law Honors & Awards ", "Summary In the process of a mid-life career change to the creative industries and in pursuit of that elusive college degree. Summary In the process of a mid-life career change to the creative industries and in pursuit of that elusive college degree. In the process of a mid-life career change to the creative industries and in pursuit of that elusive college degree. In the process of a mid-life career change to the creative industries and in pursuit of that elusive college degree. Experience Finance Analyst/Grants Administration University of California San Francisco September 2009  – Present (6 years) Working as contract coordinator for the Pediatric Bone Marrow Transplant Division as part of the Pediatric Primary Immune Deficiency Treatment Consortium project. Design Intern Alite Designs June 2010  –  August 2010  (3 months) Awesome design internship and one of the best outdoor products design firms. Business Analyst University of California, San Francisco October 2007  –  June 2010  (2 years 9 months) Development of business requirements into software requirements specifications for the UCSF Faculty Information System. UCSF FIS is an secure web-based application that provides faculty, academics, and academic personnel administrators with online access to academic appointment status and upcoming advancement actions. Finance Manager UCSF Dept. of Pharmaceutical Sciences January 2007  –  October 2007  (10 months) Finance Manager for the Department of Pharmaceutical Chemistry, School of Pharmacy, UCSF. Finance Analyst Institute for Global Health 2001  –  2007  (6 years) Administered global research projects focused on HIV/AIDS, Tuberculosis, and Malaria. Project Research Assistant Stanford University, Stanford Center for Research in Disease Prevention January 2000  –  January 2001  (1 year 1 month) Research project support for a NIDA study on at-risk youth and smoking. Administration of project expenses, coordinating site visits, creating and maintaining project database, entering study data, and managing project administrative requirements. Development Associate Stanford University, School of Law December 1998  –  December 1999  (1 year 1 month) Project Assistant in charge of the Judicial Honor exhibit for the law school. Collected biographical information on every Stanford Law School graduate past and present that served as a Judge in any court, national or international. Finance Analyst/Grants Administration University of California San Francisco September 2009  – Present (6 years) Working as contract coordinator for the Pediatric Bone Marrow Transplant Division as part of the Pediatric Primary Immune Deficiency Treatment Consortium project. Finance Analyst/Grants Administration University of California San Francisco September 2009  – Present (6 years) Working as contract coordinator for the Pediatric Bone Marrow Transplant Division as part of the Pediatric Primary Immune Deficiency Treatment Consortium project. Design Intern Alite Designs June 2010  –  August 2010  (3 months) Awesome design internship and one of the best outdoor products design firms. Design Intern Alite Designs June 2010  –  August 2010  (3 months) Awesome design internship and one of the best outdoor products design firms. Business Analyst University of California, San Francisco October 2007  –  June 2010  (2 years 9 months) Development of business requirements into software requirements specifications for the UCSF Faculty Information System. UCSF FIS is an secure web-based application that provides faculty, academics, and academic personnel administrators with online access to academic appointment status and upcoming advancement actions. Business Analyst University of California, San Francisco October 2007  –  June 2010  (2 years 9 months) Development of business requirements into software requirements specifications for the UCSF Faculty Information System. UCSF FIS is an secure web-based application that provides faculty, academics, and academic personnel administrators with online access to academic appointment status and upcoming advancement actions. Finance Manager UCSF Dept. of Pharmaceutical Sciences January 2007  –  October 2007  (10 months) Finance Manager for the Department of Pharmaceutical Chemistry, School of Pharmacy, UCSF. Finance Manager UCSF Dept. of Pharmaceutical Sciences January 2007  –  October 2007  (10 months) Finance Manager for the Department of Pharmaceutical Chemistry, School of Pharmacy, UCSF. Finance Analyst Institute for Global Health 2001  –  2007  (6 years) Administered global research projects focused on HIV/AIDS, Tuberculosis, and Malaria. Finance Analyst Institute for Global Health 2001  –  2007  (6 years) Administered global research projects focused on HIV/AIDS, Tuberculosis, and Malaria. Project Research Assistant Stanford University, Stanford Center for Research in Disease Prevention January 2000  –  January 2001  (1 year 1 month) Research project support for a NIDA study on at-risk youth and smoking. Administration of project expenses, coordinating site visits, creating and maintaining project database, entering study data, and managing project administrative requirements. Project Research Assistant Stanford University, Stanford Center for Research in Disease Prevention January 2000  –  January 2001  (1 year 1 month) Research project support for a NIDA study on at-risk youth and smoking. Administration of project expenses, coordinating site visits, creating and maintaining project database, entering study data, and managing project administrative requirements. Development Associate Stanford University, School of Law December 1998  –  December 1999  (1 year 1 month) Project Assistant in charge of the Judicial Honor exhibit for the law school. Collected biographical information on every Stanford Law School graduate past and present that served as a Judge in any court, national or international. Development Associate Stanford University, School of Law December 1998  –  December 1999  (1 year 1 month) Project Assistant in charge of the Judicial Honor exhibit for the law school. Collected biographical information on every Stanford Law School graduate past and present that served as a Judge in any court, national or international. Languages Spanish Professional working proficiency Chinese Elementary proficiency Portuguese Elementary proficiency German Elementary proficiency French Elementary proficiency Spanish Professional working proficiency Chinese Elementary proficiency Portuguese Elementary proficiency German Elementary proficiency French Elementary proficiency Spanish Professional working proficiency Chinese Elementary proficiency Portuguese Elementary proficiency German Elementary proficiency French Elementary proficiency Professional working proficiency Elementary proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills Mac InDesign Graphic Design Illustrator Illustration Drawing Dreamweaver Photoshop Adobe Acrobat Painting Adobe Creative Suite Analysis Printmaking Letterpress Color Theory Freelance Design Administration Bookbinding Microsoft Excel Books Social Media Ceramic President, CCSF... Excel Gouache Book Arts Ceramics Woodblock carving FCPX Social Documentary Research Photography Editing Web Design See 19+     See less Skills  Mac InDesign Graphic Design Illustrator Illustration Drawing Dreamweaver Photoshop Adobe Acrobat Painting Adobe Creative Suite Analysis Printmaking Letterpress Color Theory Freelance Design Administration Bookbinding Microsoft Excel Books Social Media Ceramic President, CCSF... Excel Gouache Book Arts Ceramics Woodblock carving FCPX Social Documentary Research Photography Editing Web Design See 19+     See less Mac InDesign Graphic Design Illustrator Illustration Drawing Dreamweaver Photoshop Adobe Acrobat Painting Adobe Creative Suite Analysis Printmaking Letterpress Color Theory Freelance Design Administration Bookbinding Microsoft Excel Books Social Media Ceramic President, CCSF... Excel Gouache Book Arts Ceramics Woodblock carving FCPX Social Documentary Research Photography Editing Web Design See 19+     See less Mac InDesign Graphic Design Illustrator Illustration Drawing Dreamweaver Photoshop Adobe Acrobat Painting Adobe Creative Suite Analysis Printmaking Letterpress Color Theory Freelance Design Administration Bookbinding Microsoft Excel Books Social Media Ceramic President, CCSF... Excel Gouache Book Arts Ceramics Woodblock carving FCPX Social Documentary Research Photography Editing Web Design See 19+     See less Education UC Berkeley, College of Letters & Sciences Bachelor of Arts (B.A.) [in progress],  Art Practice ,  History of Art 2013  – 2016 City College of San Francisco A.A.,  Graphic Design , Honor Student, 3.7 GPA 2009  – 2013 Graphic Design, Art History & Studio Art Activities and Societies:  President ,  CCSF Letterpress Club 2011-2012 Extension Courses, University of California, Berkeley Extension Courses,  Mandarin , Epidemiology,  Biostatistics 2003  – 2006 UC Berkeley, College of Letters & Sciences Bachelor of Arts (B.A.) [in progress],  Art Practice ,  History of Art 2013  – 2016 UC Berkeley, College of Letters & Sciences Bachelor of Arts (B.A.) [in progress],  Art Practice ,  History of Art 2013  – 2016 UC Berkeley, College of Letters & Sciences Bachelor of Arts (B.A.) [in progress],  Art Practice ,  History of Art 2013  – 2016 City College of San Francisco A.A.,  Graphic Design , Honor Student, 3.7 GPA 2009  – 2013 Graphic Design, Art History & Studio Art Activities and Societies:  President ,  CCSF Letterpress Club 2011-2012 City College of San Francisco A.A.,  Graphic Design , Honor Student, 3.7 GPA 2009  – 2013 Graphic Design, Art History & Studio Art Activities and Societies:  President ,  CCSF Letterpress Club 2011-2012 City College of San Francisco A.A.,  Graphic Design , Honor Student, 3.7 GPA 2009  – 2013 Graphic Design, Art History & Studio Art Activities and Societies:  President ,  CCSF Letterpress Club 2011-2012 Extension Courses, University of California, Berkeley Extension Courses,  Mandarin , Epidemiology,  Biostatistics 2003  – 2006 Extension Courses, University of California, Berkeley Extension Courses,  Mandarin , Epidemiology,  Biostatistics 2003  – 2006 Extension Courses, University of California, Berkeley Extension Courses,  Mandarin , Epidemiology,  Biostatistics 2003  – 2006 ", "Experience President dLavish Project Specialists Development Associate Stanford University 2008  – Present (7 years) Research prospects for fundraisers; coordiantate development travel accomodations for the Dean, Development Officers and Faculty; process gifts; prepare briefings for Dean's visit with donors; calendaring/scheduling for Associate Dean of Development; create/prepare reports, data management; purchasing/reimbursments and much more. Executive Administrative Support Specialists Arizona State University June 2005  –  November 2007  (2 years 6 months) Managed a budget of $45M for Univerisity Technology Office; provided executive support to two FABULOUS Associcate Vice Presidents of UTO. Executive Administrative Support Specialists Arizona State University June 2005  –  November 2007  (2 years 6 months) Managed a budget of $45M for Univerisity Technology Office; provided executive support to two FABULOUS Associcate Vice Presidents of UTO. President dLavish Project Specialists President dLavish Project Specialists Development Associate Stanford University 2008  – Present (7 years) Research prospects for fundraisers; coordiantate development travel accomodations for the Dean, Development Officers and Faculty; process gifts; prepare briefings for Dean's visit with donors; calendaring/scheduling for Associate Dean of Development; create/prepare reports, data management; purchasing/reimbursments and much more. Development Associate Stanford University 2008  – Present (7 years) Research prospects for fundraisers; coordiantate development travel accomodations for the Dean, Development Officers and Faculty; process gifts; prepare briefings for Dean's visit with donors; calendaring/scheduling for Associate Dean of Development; create/prepare reports, data management; purchasing/reimbursments and much more. Executive Administrative Support Specialists Arizona State University June 2005  –  November 2007  (2 years 6 months) Managed a budget of $45M for Univerisity Technology Office; provided executive support to two FABULOUS Associcate Vice Presidents of UTO. Executive Administrative Support Specialists Arizona State University June 2005  –  November 2007  (2 years 6 months) Managed a budget of $45M for Univerisity Technology Office; provided executive support to two FABULOUS Associcate Vice Presidents of UTO. Executive Administrative Support Specialists Arizona State University June 2005  –  November 2007  (2 years 6 months) Managed a budget of $45M for Univerisity Technology Office; provided executive support to two FABULOUS Associcate Vice Presidents of UTO. Executive Administrative Support Specialists Arizona State University June 2005  –  November 2007  (2 years 6 months) Managed a budget of $45M for Univerisity Technology Office; provided executive support to two FABULOUS Associcate Vice Presidents of UTO. Skills Fundraising Research Budgets Event Planning Public Speaking Social Media Nonprofits Microsoft Office Community Outreach Teaching Skills  Fundraising Research Budgets Event Planning Public Speaking Social Media Nonprofits Microsoft Office Community Outreach Teaching Fundraising Research Budgets Event Planning Public Speaking Social Media Nonprofits Microsoft Office Community Outreach Teaching Fundraising Research Budgets Event Planning Public Speaking Social Media Nonprofits Microsoft Office Community Outreach Teaching ", "Experience Asst. Copy Editor Newsday Media Group January 2015  – Present (8 months) Melville, NY Copy Editing Intern Cape Cod Times June 2014  –  August 2014  (3 months) Hyannis, Massachusetts Review and edit copy ranging from briefs to features; write headlines and cutlines; post stories to website and CCT social media outlets; design pages. Assistant Director, Integrated Marketing Services (formerly, Direct Appeal Services) Stanford University October 2011  –  July 2013  (1 year 10 months) Stanford University Worked with annual fund director to come up with fundraising strategy for Stanford Hospital & Clinics annual fund. Helped raise $1 million in fiscal year 2012; tracked appeals, analyzed data and reported results for fund progress updates and strategy readjustment around key metrics such as ROI, participation and dollars raised. Wrote and edited some letter/email content for effective solicitation. Oversaw vendor management for timely production of monthly solicitations ranging from 400 to more than 100K prospects. Partnership Program Coordinator/Development Associate Stanford University March 2008  –  October 2011  (3 years 8 months) Stanford University As part of the Student/Young Alumni Development segment of The Stanford Fund, the annual undergraduate fund, helped coordinate TSF's cornerstone stewardship program, partnering with student groups to connect with close to 18,000 donors annually via thank you letters, postcards and phone calls. \n \n•Organize the stewardship commitment/activities of 100+ student groups each year \n•Recruit, train and supervise 8-12 part-time student employees who proofread donor correspondence \n•Train student group leaders regarding stewardship standards \n-Liaise with other departments to arrange student volunteer opportunities. \n•Provide administrative support for Student and Young Alumni Development programs Ally Public Allies, Silicon Valley November 2005  –  June 2007  (1 year 8 months) Milpitas and East Palo Alto, CA Year 2 Assignment: Ravenswood City School District, After School Program Liaison \n•\tCreator and Editor-in-Chief of first District-wide After School program newsletter. Coordinated distribution to over 4000 students at 11 school sites.  \n•\tSupported the Principal of Auxiliary Programs and 16 teachers to provide Small Group Instruction, an after school literacy program, for over 100 students. \n \nYear 1 Assignment: Community Development Institute, Research Assistant \n•\tRevived The CDI Report, the first organizational newsletter in over 10 years, increasing visibility through mass mailing to over 500 community partners, funders and associates and the Internet. \n•\tProvided research and administrative support for the launch of the Leadership Institute East Palo Alto (LIEP), a civic engagement initiative. \n \nSecond Year Ally/Coach \n•\tCoached team of 7 Allies to plan, develop and execute youth-centered community service projects. \n•\tFacilitated team of 4 Allies in developing/presenting a five-hour training on activism. Asst. Copy Editor Newsday Media Group January 2015  – Present (8 months) Melville, NY Asst. Copy Editor Newsday Media Group January 2015  – Present (8 months) Melville, NY Copy Editing Intern Cape Cod Times June 2014  –  August 2014  (3 months) Hyannis, Massachusetts Review and edit copy ranging from briefs to features; write headlines and cutlines; post stories to website and CCT social media outlets; design pages. Copy Editing Intern Cape Cod Times June 2014  –  August 2014  (3 months) Hyannis, Massachusetts Review and edit copy ranging from briefs to features; write headlines and cutlines; post stories to website and CCT social media outlets; design pages. Assistant Director, Integrated Marketing Services (formerly, Direct Appeal Services) Stanford University October 2011  –  July 2013  (1 year 10 months) Stanford University Worked with annual fund director to come up with fundraising strategy for Stanford Hospital & Clinics annual fund. Helped raise $1 million in fiscal year 2012; tracked appeals, analyzed data and reported results for fund progress updates and strategy readjustment around key metrics such as ROI, participation and dollars raised. Wrote and edited some letter/email content for effective solicitation. Oversaw vendor management for timely production of monthly solicitations ranging from 400 to more than 100K prospects. Assistant Director, Integrated Marketing Services (formerly, Direct Appeal Services) Stanford University October 2011  –  July 2013  (1 year 10 months) Stanford University Worked with annual fund director to come up with fundraising strategy for Stanford Hospital & Clinics annual fund. Helped raise $1 million in fiscal year 2012; tracked appeals, analyzed data and reported results for fund progress updates and strategy readjustment around key metrics such as ROI, participation and dollars raised. Wrote and edited some letter/email content for effective solicitation. Oversaw vendor management for timely production of monthly solicitations ranging from 400 to more than 100K prospects. Partnership Program Coordinator/Development Associate Stanford University March 2008  –  October 2011  (3 years 8 months) Stanford University As part of the Student/Young Alumni Development segment of The Stanford Fund, the annual undergraduate fund, helped coordinate TSF's cornerstone stewardship program, partnering with student groups to connect with close to 18,000 donors annually via thank you letters, postcards and phone calls. \n \n•Organize the stewardship commitment/activities of 100+ student groups each year \n•Recruit, train and supervise 8-12 part-time student employees who proofread donor correspondence \n•Train student group leaders regarding stewardship standards \n-Liaise with other departments to arrange student volunteer opportunities. \n•Provide administrative support for Student and Young Alumni Development programs Partnership Program Coordinator/Development Associate Stanford University March 2008  –  October 2011  (3 years 8 months) Stanford University As part of the Student/Young Alumni Development segment of The Stanford Fund, the annual undergraduate fund, helped coordinate TSF's cornerstone stewardship program, partnering with student groups to connect with close to 18,000 donors annually via thank you letters, postcards and phone calls. \n \n•Organize the stewardship commitment/activities of 100+ student groups each year \n•Recruit, train and supervise 8-12 part-time student employees who proofread donor correspondence \n•Train student group leaders regarding stewardship standards \n-Liaise with other departments to arrange student volunteer opportunities. \n•Provide administrative support for Student and Young Alumni Development programs Ally Public Allies, Silicon Valley November 2005  –  June 2007  (1 year 8 months) Milpitas and East Palo Alto, CA Year 2 Assignment: Ravenswood City School District, After School Program Liaison \n•\tCreator and Editor-in-Chief of first District-wide After School program newsletter. Coordinated distribution to over 4000 students at 11 school sites.  \n•\tSupported the Principal of Auxiliary Programs and 16 teachers to provide Small Group Instruction, an after school literacy program, for over 100 students. \n \nYear 1 Assignment: Community Development Institute, Research Assistant \n•\tRevived The CDI Report, the first organizational newsletter in over 10 years, increasing visibility through mass mailing to over 500 community partners, funders and associates and the Internet. \n•\tProvided research and administrative support for the launch of the Leadership Institute East Palo Alto (LIEP), a civic engagement initiative. \n \nSecond Year Ally/Coach \n•\tCoached team of 7 Allies to plan, develop and execute youth-centered community service projects. \n•\tFacilitated team of 4 Allies in developing/presenting a five-hour training on activism. Ally Public Allies, Silicon Valley November 2005  –  June 2007  (1 year 8 months) Milpitas and East Palo Alto, CA Year 2 Assignment: Ravenswood City School District, After School Program Liaison \n•\tCreator and Editor-in-Chief of first District-wide After School program newsletter. Coordinated distribution to over 4000 students at 11 school sites.  \n•\tSupported the Principal of Auxiliary Programs and 16 teachers to provide Small Group Instruction, an after school literacy program, for over 100 students. \n \nYear 1 Assignment: Community Development Institute, Research Assistant \n•\tRevived The CDI Report, the first organizational newsletter in over 10 years, increasing visibility through mass mailing to over 500 community partners, funders and associates and the Internet. \n•\tProvided research and administrative support for the launch of the Leadership Institute East Palo Alto (LIEP), a civic engagement initiative. \n \nSecond Year Ally/Coach \n•\tCoached team of 7 Allies to plan, develop and execute youth-centered community service projects. \n•\tFacilitated team of 4 Allies in developing/presenting a five-hour training on activism. Skills Newsletters Leadership Training Volunteer Management Research Community Development Stewardship Community Outreach Recruiting Proofreading Program Management Nonprofits Grant Writing Press Releases Fundraising Social Media Editing See 2+     See less Skills  Newsletters Leadership Training Volunteer Management Research Community Development Stewardship Community Outreach Recruiting Proofreading Program Management Nonprofits Grant Writing Press Releases Fundraising Social Media Editing See 2+     See less Newsletters Leadership Training Volunteer Management Research Community Development Stewardship Community Outreach Recruiting Proofreading Program Management Nonprofits Grant Writing Press Releases Fundraising Social Media Editing See 2+     See less Newsletters Leadership Training Volunteer Management Research Community Development Stewardship Community Outreach Recruiting Proofreading Program Management Nonprofits Grant Writing Press Releases Fundraising Social Media Editing See 2+     See less Education CUNY Graduate School of Journalism Master of Arts (M.A.),  Journalism 2013  – 2014 2014 Dow Jones News Fund Intern \n \nPrint emphasis with experience reporting, writing and editing for radio. International reporting concentration, with specific interest in the Caribbean and African Diaspora. \n \nPrevious freelance work: Hardbeat News; Counterpart International; East Palo Alto Today; Community Development Institute; Insight magazine; Bensonhurst Bean Stanford University Bachelor of Arts (B.A.),  Psychology ,  African & African American Studies 2001  – 2005 Activities and Societies:  Stanford Gospel Choir ,  Black Psychology Students Association ,  Black Pre-Law Society ,  Intervarsity Christian Fellowship ,  Adventist Christian Fellowship (ACF) ,  WYSE (Women & Youth Supporting Each Other) ,  Caribbean Student Association ,  En!gma ,  The Real News ,  Soul Sistah magazine CUNY Graduate School of Journalism Master of Arts (M.A.),  Journalism 2013  – 2014 2014 Dow Jones News Fund Intern \n \nPrint emphasis with experience reporting, writing and editing for radio. International reporting concentration, with specific interest in the Caribbean and African Diaspora. \n \nPrevious freelance work: Hardbeat News; Counterpart International; East Palo Alto Today; Community Development Institute; Insight magazine; Bensonhurst Bean CUNY Graduate School of Journalism Master of Arts (M.A.),  Journalism 2013  – 2014 2014 Dow Jones News Fund Intern \n \nPrint emphasis with experience reporting, writing and editing for radio. International reporting concentration, with specific interest in the Caribbean and African Diaspora. \n \nPrevious freelance work: Hardbeat News; Counterpart International; East Palo Alto Today; Community Development Institute; Insight magazine; Bensonhurst Bean CUNY Graduate School of Journalism Master of Arts (M.A.),  Journalism 2013  – 2014 2014 Dow Jones News Fund Intern \n \nPrint emphasis with experience reporting, writing and editing for radio. International reporting concentration, with specific interest in the Caribbean and African Diaspora. \n \nPrevious freelance work: Hardbeat News; Counterpart International; East Palo Alto Today; Community Development Institute; Insight magazine; Bensonhurst Bean Stanford University Bachelor of Arts (B.A.),  Psychology ,  African & African American Studies 2001  – 2005 Activities and Societies:  Stanford Gospel Choir ,  Black Psychology Students Association ,  Black Pre-Law Society ,  Intervarsity Christian Fellowship ,  Adventist Christian Fellowship (ACF) ,  WYSE (Women & Youth Supporting Each Other) ,  Caribbean Student Association ,  En!gma ,  The Real News ,  Soul Sistah magazine Stanford University Bachelor of Arts (B.A.),  Psychology ,  African & African American Studies 2001  – 2005 Activities and Societies:  Stanford Gospel Choir ,  Black Psychology Students Association ,  Black Pre-Law Society ,  Intervarsity Christian Fellowship ,  Adventist Christian Fellowship (ACF) ,  WYSE (Women & Youth Supporting Each Other) ,  Caribbean Student Association ,  En!gma ,  The Real News ,  Soul Sistah magazine Stanford University Bachelor of Arts (B.A.),  Psychology ,  African & African American Studies 2001  – 2005 Activities and Societies:  Stanford Gospel Choir ,  Black Psychology Students Association ,  Black Pre-Law Society ,  Intervarsity Christian Fellowship ,  Adventist Christian Fellowship (ACF) ,  WYSE (Women & Youth Supporting Each Other) ,  Caribbean Student Association ,  En!gma ,  The Real News ,  Soul Sistah magazine ", "Experience Development Associate Stanford University July 2012  – Present (3 years 2 months) Hoover Institution Program Coordinator Stanford University, Provost's Office January 2005  –  June 2012  (7 years 6 months) Assistant to the Associate Provost Stanford University June 2003  –  December 2004  (1 year 7 months) Sales, Marketing and Product Manager SGL Corporation 1999  –  January 2003  (4 years) Assistant to the Director/ESL Teacher/Librarian Girls' Middle School May 1998  –  December 1998  (8 months) Assistant English Teacher JET Program June 1994  –  June 1997  (3 years 1 month) Development Associate Stanford University July 2012  – Present (3 years 2 months) Hoover Institution Development Associate Stanford University July 2012  – Present (3 years 2 months) Hoover Institution Program Coordinator Stanford University, Provost's Office January 2005  –  June 2012  (7 years 6 months) Program Coordinator Stanford University, Provost's Office January 2005  –  June 2012  (7 years 6 months) Assistant to the Associate Provost Stanford University June 2003  –  December 2004  (1 year 7 months) Assistant to the Associate Provost Stanford University June 2003  –  December 2004  (1 year 7 months) Sales, Marketing and Product Manager SGL Corporation 1999  –  January 2003  (4 years) Sales, Marketing and Product Manager SGL Corporation 1999  –  January 2003  (4 years) Assistant to the Director/ESL Teacher/Librarian Girls' Middle School May 1998  –  December 1998  (8 months) Assistant to the Director/ESL Teacher/Librarian Girls' Middle School May 1998  –  December 1998  (8 months) Assistant English Teacher JET Program June 1994  –  June 1997  (3 years 1 month) Assistant English Teacher JET Program June 1994  –  June 1997  (3 years 1 month) Languages Japanese Limited working proficiency Japanese Limited working proficiency Japanese Limited working proficiency Limited working proficiency Skills Higher Education Teaching Program Management Program Development Event Planning Fundraising Editing Community Outreach Customer Service Volunteer Management Nonprofits Lesson Planning ESL Student Affairs Marketing Program Evaluation Grants Staff Development Qualitative Research See 4+     See less Skills  Higher Education Teaching Program Management Program Development Event Planning Fundraising Editing Community Outreach Customer Service Volunteer Management Nonprofits Lesson Planning ESL Student Affairs Marketing Program Evaluation Grants Staff Development Qualitative Research See 4+     See less Higher Education Teaching Program Management Program Development Event Planning Fundraising Editing Community Outreach Customer Service Volunteer Management Nonprofits Lesson Planning ESL Student Affairs Marketing Program Evaluation Grants Staff Development Qualitative Research See 4+     See less Higher Education Teaching Program Management Program Development Event Planning Fundraising Editing Community Outreach Customer Service Volunteer Management Nonprofits Lesson Planning ESL Student Affairs Marketing Program Evaluation Grants Staff Development Qualitative Research See 4+     See less Education University of California, Berkeley BA 1990  – 1994 Castilleja High School Diploma 1984  – 1990 University of California, Berkeley BA 1990  – 1994 University of California, Berkeley BA 1990  – 1994 University of California, Berkeley BA 1990  – 1994 Castilleja High School Diploma 1984  – 1990 Castilleja High School Diploma 1984  – 1990 Castilleja High School Diploma 1984  – 1990 ", "Experience Development Associate Stanford University Project Manager Stanford University Director of the Office of International Relations for the School of Communication University of Navarra April 2008  –  July 2009  (1 year 4 months) •\tSuccessfully launched international internship program from the ground level. Forged relationships and partnerships with US businesses to accept Spanish students as summer Interns.  \n•\tForged new relationships with other universities including a new exchange with London College of Communication, Bentley College and professor exchange with the University of Stirling and with the University of Southern California. Editor's Assistant/Contract Manager Ignatius Press July 1996  –  March 2008  (11 years 9 months) •\tEditor in Chief: \no\tFirst reviewer of manuscripts \no\tDo research for Editor as needed.  \n•\tContracts and Permissions: \nHandling all aspects of contracts, permissions and rights for Ignatius Press, providing recommendations to president and to editor-in-chief and founder. Oversee and work out details of contracts with authors, translators. Oversee and track all other contracts. Responsible for foreign rights. Key projects include: \no\tMain point of contact on copyright lawsuit, which included tracking all aspects of suit and dismissing an ineffective and then hiring another who successfully concluded lawsuit in Ignatius Press’ favor. \no\tObtaining legal rights and permissions to publish in English all works of Pope Benedict XVI. \n•\tForeign Rights \no\tWorked with foreign publishers who want to translate and publish our books \no\tSingle handedly represented company at world's largetst book fair buying and selling rights. Development Associate Stanford University Development Associate Stanford University Project Manager Stanford University Project Manager Stanford University Director of the Office of International Relations for the School of Communication University of Navarra April 2008  –  July 2009  (1 year 4 months) •\tSuccessfully launched international internship program from the ground level. Forged relationships and partnerships with US businesses to accept Spanish students as summer Interns.  \n•\tForged new relationships with other universities including a new exchange with London College of Communication, Bentley College and professor exchange with the University of Stirling and with the University of Southern California. Director of the Office of International Relations for the School of Communication University of Navarra April 2008  –  July 2009  (1 year 4 months) •\tSuccessfully launched international internship program from the ground level. Forged relationships and partnerships with US businesses to accept Spanish students as summer Interns.  \n•\tForged new relationships with other universities including a new exchange with London College of Communication, Bentley College and professor exchange with the University of Stirling and with the University of Southern California. Editor's Assistant/Contract Manager Ignatius Press July 1996  –  March 2008  (11 years 9 months) •\tEditor in Chief: \no\tFirst reviewer of manuscripts \no\tDo research for Editor as needed.  \n•\tContracts and Permissions: \nHandling all aspects of contracts, permissions and rights for Ignatius Press, providing recommendations to president and to editor-in-chief and founder. Oversee and work out details of contracts with authors, translators. Oversee and track all other contracts. Responsible for foreign rights. Key projects include: \no\tMain point of contact on copyright lawsuit, which included tracking all aspects of suit and dismissing an ineffective and then hiring another who successfully concluded lawsuit in Ignatius Press’ favor. \no\tObtaining legal rights and permissions to publish in English all works of Pope Benedict XVI. \n•\tForeign Rights \no\tWorked with foreign publishers who want to translate and publish our books \no\tSingle handedly represented company at world's largetst book fair buying and selling rights. Editor's Assistant/Contract Manager Ignatius Press July 1996  –  March 2008  (11 years 9 months) •\tEditor in Chief: \no\tFirst reviewer of manuscripts \no\tDo research for Editor as needed.  \n•\tContracts and Permissions: \nHandling all aspects of contracts, permissions and rights for Ignatius Press, providing recommendations to president and to editor-in-chief and founder. Oversee and work out details of contracts with authors, translators. Oversee and track all other contracts. Responsible for foreign rights. Key projects include: \no\tMain point of contact on copyright lawsuit, which included tracking all aspects of suit and dismissing an ineffective and then hiring another who successfully concluded lawsuit in Ignatius Press’ favor. \no\tObtaining legal rights and permissions to publish in English all works of Pope Benedict XVI. \n•\tForeign Rights \no\tWorked with foreign publishers who want to translate and publish our books \no\tSingle handedly represented company at world's largetst book fair buying and selling rights. Education Universidad de Navarra Spanish Language and Culture,  Spanish Language and Culture 2007  – 2009 Thomas Aquinas College Humanities,  Philosophy 1992  – 1996 Universidad de Navarra Spanish Language and Culture,  Spanish Language and Culture 2007  – 2009 Universidad de Navarra Spanish Language and Culture,  Spanish Language and Culture 2007  – 2009 Universidad de Navarra Spanish Language and Culture,  Spanish Language and Culture 2007  – 2009 Thomas Aquinas College Humanities,  Philosophy 1992  – 1996 Thomas Aquinas College Humanities,  Philosophy 1992  – 1996 Thomas Aquinas College Humanities,  Philosophy 1992  – 1996 ", "Summary Proven development professional with expertise in higher education fundraising both in record setting annual fund campaigns and strategic major gift relationship development, eager to learn cutting edge advancement and engagement tools through collaborative efforts Summary Proven development professional with expertise in higher education fundraising both in record setting annual fund campaigns and strategic major gift relationship development, eager to learn cutting edge advancement and engagement tools through collaborative efforts Proven development professional with expertise in higher education fundraising both in record setting annual fund campaigns and strategic major gift relationship development, eager to learn cutting edge advancement and engagement tools through collaborative efforts Proven development professional with expertise in higher education fundraising both in record setting annual fund campaigns and strategic major gift relationship development, eager to learn cutting edge advancement and engagement tools through collaborative efforts Experience Gift Planning Advisor Spectrum Health Foundation May 2013  – Present (2 years 4 months) greater grand rapids, michigan area Individual gift officer including major and planned gifts. \n \nCertified Fund Raising Executive Assistant Director of Development, College of Natural Sciences Michigan State University October 2011  –  February 2013  (1 year 5 months) East Lansing -Build and cultivate institution based philanthropic relationships resulting in major gifts benefiting future Spartans \n-Discover opportunities for MSU to better engage and connect with alumni \n-Travel throughout Michigan and the mid-west visiting and stewarding MSU alumni and friends \n-Manage annual fund appeals for the College of Natural Science in collaboration with central administration Records Clerk and Graduation Auditor Grand Valley State University November 2010  –  October 2011  (1 year) First point of contact for students, patrons, and parents concerning academic records, degree progress, and graduation. Development Associate Stanford University December 2007  –  August 2010  (2 years 9 months) · Stewardship, solicitation, and informative communication with leadership donors and volunteers for The Stanford Fund \n· Identification and segmentation of target populations based on data extraction from the Stanford University database PostGrads \n· Department administrative support including budget maintenance, vendor and intra-departmental relationship management, and gift \nand pledge processing \n· Technical support including complex spreadsheet & database maintenance, advanced report building in PostGrads database Youth and Family Program Coordinator Palo Alto Family YMCA June 2007  –  December 2007  (7 months) · Budget management, personnel coordination, and event planning for the Adventure Guides program \n· Planning and execution of three camp programs throughout the year for over a thousand enrolled youth in the Palo Alto area \n· Planning and execution of ten-weeks of a traditional day camp for over 126 teens exceeding retention and recruitment expectations \n· Staff capital campaign liaison-cultivating and stewarding staff campaign gifts in two successive record breaking campaigns Assistant to the Director of the Bureau of Health Professions State of Michigan May 2006  –  May 2007  (1 year 1 month) · Research and technical writing for the State of Michigan website on pain and symptom management \n· Primary editor and distributor of a quarterly newsletter to promote public awareness of regulatory rights \n· Partnership with Licensing Boards to produce regulatory efficiency in strategic healthcare areas, such as e-health Gift Planning Advisor Spectrum Health Foundation May 2013  – Present (2 years 4 months) greater grand rapids, michigan area Individual gift officer including major and planned gifts. \n \nCertified Fund Raising Executive Gift Planning Advisor Spectrum Health Foundation May 2013  – Present (2 years 4 months) greater grand rapids, michigan area Individual gift officer including major and planned gifts. \n \nCertified Fund Raising Executive Assistant Director of Development, College of Natural Sciences Michigan State University October 2011  –  February 2013  (1 year 5 months) East Lansing -Build and cultivate institution based philanthropic relationships resulting in major gifts benefiting future Spartans \n-Discover opportunities for MSU to better engage and connect with alumni \n-Travel throughout Michigan and the mid-west visiting and stewarding MSU alumni and friends \n-Manage annual fund appeals for the College of Natural Science in collaboration with central administration Assistant Director of Development, College of Natural Sciences Michigan State University October 2011  –  February 2013  (1 year 5 months) East Lansing -Build and cultivate institution based philanthropic relationships resulting in major gifts benefiting future Spartans \n-Discover opportunities for MSU to better engage and connect with alumni \n-Travel throughout Michigan and the mid-west visiting and stewarding MSU alumni and friends \n-Manage annual fund appeals for the College of Natural Science in collaboration with central administration Records Clerk and Graduation Auditor Grand Valley State University November 2010  –  October 2011  (1 year) First point of contact for students, patrons, and parents concerning academic records, degree progress, and graduation. Records Clerk and Graduation Auditor Grand Valley State University November 2010  –  October 2011  (1 year) First point of contact for students, patrons, and parents concerning academic records, degree progress, and graduation. Development Associate Stanford University December 2007  –  August 2010  (2 years 9 months) · Stewardship, solicitation, and informative communication with leadership donors and volunteers for The Stanford Fund \n· Identification and segmentation of target populations based on data extraction from the Stanford University database PostGrads \n· Department administrative support including budget maintenance, vendor and intra-departmental relationship management, and gift \nand pledge processing \n· Technical support including complex spreadsheet & database maintenance, advanced report building in PostGrads database Development Associate Stanford University December 2007  –  August 2010  (2 years 9 months) · Stewardship, solicitation, and informative communication with leadership donors and volunteers for The Stanford Fund \n· Identification and segmentation of target populations based on data extraction from the Stanford University database PostGrads \n· Department administrative support including budget maintenance, vendor and intra-departmental relationship management, and gift \nand pledge processing \n· Technical support including complex spreadsheet & database maintenance, advanced report building in PostGrads database Youth and Family Program Coordinator Palo Alto Family YMCA June 2007  –  December 2007  (7 months) · Budget management, personnel coordination, and event planning for the Adventure Guides program \n· Planning and execution of three camp programs throughout the year for over a thousand enrolled youth in the Palo Alto area \n· Planning and execution of ten-weeks of a traditional day camp for over 126 teens exceeding retention and recruitment expectations \n· Staff capital campaign liaison-cultivating and stewarding staff campaign gifts in two successive record breaking campaigns Youth and Family Program Coordinator Palo Alto Family YMCA June 2007  –  December 2007  (7 months) · Budget management, personnel coordination, and event planning for the Adventure Guides program \n· Planning and execution of three camp programs throughout the year for over a thousand enrolled youth in the Palo Alto area \n· Planning and execution of ten-weeks of a traditional day camp for over 126 teens exceeding retention and recruitment expectations \n· Staff capital campaign liaison-cultivating and stewarding staff campaign gifts in two successive record breaking campaigns Assistant to the Director of the Bureau of Health Professions State of Michigan May 2006  –  May 2007  (1 year 1 month) · Research and technical writing for the State of Michigan website on pain and symptom management \n· Primary editor and distributor of a quarterly newsletter to promote public awareness of regulatory rights \n· Partnership with Licensing Boards to produce regulatory efficiency in strategic healthcare areas, such as e-health Assistant to the Director of the Bureau of Health Professions State of Michigan May 2006  –  May 2007  (1 year 1 month) · Research and technical writing for the State of Michigan website on pain and symptom management \n· Primary editor and distributor of a quarterly newsletter to promote public awareness of regulatory rights \n· Partnership with Licensing Boards to produce regulatory efficiency in strategic healthcare areas, such as e-health Skills Volunteer Management Community Outreach Fundraising Non-profits Grant Writing Research Program Development Public Speaking Newsletters Editing Social Media Policy Analysis Teaching Public Policy Social Networking Press Releases Event Management See 2+     See less Skills  Volunteer Management Community Outreach Fundraising Non-profits Grant Writing Research Program Development Public Speaking Newsletters Editing Social Media Policy Analysis Teaching Public Policy Social Networking Press Releases Event Management See 2+     See less Volunteer Management Community Outreach Fundraising Non-profits Grant Writing Research Program Development Public Speaking Newsletters Editing Social Media Policy Analysis Teaching Public Policy Social Networking Press Releases Event Management See 2+     See less Volunteer Management Community Outreach Fundraising Non-profits Grant Writing Research Program Development Public Speaking Newsletters Editing Social Media Policy Analysis Teaching Public Policy Social Networking Press Releases Event Management See 2+     See less Education James Madison College of Public Affairs, Michigan State University Bachelor of Arts,  Social Relations; Policy and Political Theory/Constitutional Democracy 2003  – 2007 Michigan State University BA,  Political Theory Constitutional Democracy and Social Relations and Policy 2003  – 2007 University of Cambridge Political Theory 2005  – 2005 Study Abroad Program, hosted by James Madison College, Michigan State University July-Augest 2005 Activities and Societies:  Intense study of 'The Welfare State' and 'British Political Phillisophy' Madison Institute James Madison College of Public Affairs, Michigan State University Bachelor of Arts,  Social Relations; Policy and Political Theory/Constitutional Democracy 2003  – 2007 James Madison College of Public Affairs, Michigan State University Bachelor of Arts,  Social Relations; Policy and Political Theory/Constitutional Democracy 2003  – 2007 James Madison College of Public Affairs, Michigan State University Bachelor of Arts,  Social Relations; Policy and Political Theory/Constitutional Democracy 2003  – 2007 Michigan State University BA,  Political Theory Constitutional Democracy and Social Relations and Policy 2003  – 2007 Michigan State University BA,  Political Theory Constitutional Democracy and Social Relations and Policy 2003  – 2007 Michigan State University BA,  Political Theory Constitutional Democracy and Social Relations and Policy 2003  – 2007 University of Cambridge Political Theory 2005  – 2005 Study Abroad Program, hosted by James Madison College, Michigan State University July-Augest 2005 Activities and Societies:  Intense study of 'The Welfare State' and 'British Political Phillisophy' University of Cambridge Political Theory 2005  – 2005 Study Abroad Program, hosted by James Madison College, Michigan State University July-Augest 2005 Activities and Societies:  Intense study of 'The Welfare State' and 'British Political Phillisophy' University of Cambridge Political Theory 2005  – 2005 Study Abroad Program, hosted by James Madison College, Michigan State University July-Augest 2005 Activities and Societies:  Intense study of 'The Welfare State' and 'British Political Phillisophy' Madison Institute Madison Institute Madison Institute Honors & Awards Additional Honors & Awards Congressional Medal of Merit, Dean's Award, Englehardt Community Excellence Award Additional Honors & Awards Congressional Medal of Merit, Dean's Award, Englehardt Community Excellence Award Additional Honors & Awards Congressional Medal of Merit, Dean's Award, Englehardt Community Excellence Award Additional Honors & Awards Congressional Medal of Merit, Dean's Award, Englehardt Community Excellence Award ", "Experience Development Associate Stanford University Development Associate Stanford University Development Associate Stanford University Skills Fundraising Japanese Event Management Public Policy Event Planning Higher Education Community Outreach Non-profits Grant Writing Philanthropy Editing Research Social Media Policy Analysis Public Speaking Volunteer Management Politics Public Relations Social Networking Nonprofits Grants Program Evaluation Program Development Press Releases Media Relations Data Analysis See 11+     See less Skills  Fundraising Japanese Event Management Public Policy Event Planning Higher Education Community Outreach Non-profits Grant Writing Philanthropy Editing Research Social Media Policy Analysis Public Speaking Volunteer Management Politics Public Relations Social Networking Nonprofits Grants Program Evaluation Program Development Press Releases Media Relations Data Analysis See 11+     See less Fundraising Japanese Event Management Public Policy Event Planning Higher Education Community Outreach Non-profits Grant Writing Philanthropy Editing Research Social Media Policy Analysis Public Speaking Volunteer Management Politics Public Relations Social Networking Nonprofits Grants Program Evaluation Program Development Press Releases Media Relations Data Analysis See 11+     See less Fundraising Japanese Event Management Public Policy Event Planning Higher Education Community Outreach Non-profits Grant Writing Philanthropy Editing Research Social Media Policy Analysis Public Speaking Volunteer Management Politics Public Relations Social Networking Nonprofits Grants Program Evaluation Program Development Press Releases Media Relations Data Analysis See 11+     See less Education University of Hawaii at Manoa Master's,  Public Administration 2005  – 2007 University of Hawaii at Manoa Master's,  Public Administration 2005  – 2007 University of Hawaii at Manoa Master's,  Public Administration 2005  – 2007 University of Hawaii at Manoa Master's,  Public Administration 2005  – 2007 ", "Experience Executive Assistant Greywater Recycling Systems, Inc. April 2015  – Present (5 months) Volunteer Translator Peach Foundation 2011  – Present (4 years) Yunan Province, China Executive Assistant Greywater Recycling Systems, Inc. April 2015  – Present (5 months) Executive Assistant Greywater Recycling Systems, Inc. April 2015  – Present (5 months) Volunteer Translator Peach Foundation 2011  – Present (4 years) Yunan Province, China Volunteer Translator Peach Foundation 2011  – Present (4 years) Yunan Province, China Languages Mandarin Chinese Limited working proficiency English Native or bilingual proficiency Mandarin Chinese Limited working proficiency English Native or bilingual proficiency Mandarin Chinese Limited working proficiency English Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills First Aid Certified Mandarin; English Research Microsoft Office Community Outreach Event Planning Public Speaking Non-profits PowerPoint Microsoft Excel Policy Analysis Social Media English Strategic Planning Analysis Program Management Higher Education Nonprofits Healthcare Data Analysis See 5+     See less Skills  First Aid Certified Mandarin; English Research Microsoft Office Community Outreach Event Planning Public Speaking Non-profits PowerPoint Microsoft Excel Policy Analysis Social Media English Strategic Planning Analysis Program Management Higher Education Nonprofits Healthcare Data Analysis See 5+     See less First Aid Certified Mandarin; English Research Microsoft Office Community Outreach Event Planning Public Speaking Non-profits PowerPoint Microsoft Excel Policy Analysis Social Media English Strategic Planning Analysis Program Management Higher Education Nonprofits Healthcare Data Analysis See 5+     See less First Aid Certified Mandarin; English Research Microsoft Office Community Outreach Event Planning Public Speaking Non-profits PowerPoint Microsoft Excel Policy Analysis Social Media English Strategic Planning Analysis Program Management Higher Education Nonprofits Healthcare Data Analysis See 5+     See less Education University of California, Davis B.A.,  Economics ,  East Asian Studies 2003  – 2007 Activities and Societies:  TCCA - President 06-07 National Taiwan Normal University 2008  – 2008 University of California, Davis B.A.,  Economics ,  East Asian Studies 2003  – 2007 Activities and Societies:  TCCA - President 06-07 University of California, Davis B.A.,  Economics ,  East Asian Studies 2003  – 2007 Activities and Societies:  TCCA - President 06-07 University of California, Davis B.A.,  Economics ,  East Asian Studies 2003  – 2007 Activities and Societies:  TCCA - President 06-07 National Taiwan Normal University 2008  – 2008 National Taiwan Normal University 2008  – 2008 National Taiwan Normal University 2008  – 2008 Honors & Awards President Tzu Ching Collegiate Association 2007 Additional Honors & Awards Certificate of Merit - Advanced Level Piano President Tzu Ching Collegiate Association 2007 President Tzu Ching Collegiate Association 2007 President Tzu Ching Collegiate Association 2007 Additional Honors & Awards Certificate of Merit - Advanced Level Piano Additional Honors & Awards Certificate of Merit - Advanced Level Piano Additional Honors & Awards Certificate of Merit - Advanced Level Piano ", "Summary Specialties:Windows Systems, PowerPoint presentations, heavy public interaction/customer service, working in a very fast paced/high stress environment, constant prioritizing. Summary Specialties:Windows Systems, PowerPoint presentations, heavy public interaction/customer service, working in a very fast paced/high stress environment, constant prioritizing. Specialties:Windows Systems, PowerPoint presentations, heavy public interaction/customer service, working in a very fast paced/high stress environment, constant prioritizing. Specialties:Windows Systems, PowerPoint presentations, heavy public interaction/customer service, working in a very fast paced/high stress environment, constant prioritizing. Experience Facilities Specialist I/Emergency Dispatcher Penn State University, Office of Physical Plant July 2000  – Present (15 years 2 months) University Park, PA Answer extremely heavy phones, provide excellent customer service, receive work requests for service via telephone, band radio, walk-ins, mail and computer; coordinate action on emergency calls with supervisor, process non-emergency calls, coordinate and process work assignments, operate business band radio and page master system for communication, dispatch foremen, tradesmen and janitorial workers; issue keys, radios, equipment and vehicles; place general stores orders; maintain files, enter and maintain data, run reports with requested criteria; contact customers for billing approval; type and file correspondence, heavy data entry with attention to detail; work in a very high stress office with the ability to multi-task and prioritize. Also, main point of contact for all OPP Operations as it relates directly to football game day operations at Beaver Stadium. Coordinate all maintenance and janitorial staff in response to game day activities, forward other miscellaneous information received to appropriate departments, log all calls received in In-Stadium Solutions Facility Management system, coordinate all non-emergency work order requests to ensure they are processed in a timely manner and sent to the appropriate staff. Staff Assistant, Development & Alumni Relations Penn State University June 1999  –  July 2000  (1 year 2 months) University Park, PA Provide administrative support to the Director of Campaign Communications, answer busy phones, take detailed messages, heavy interaction with the public, handle highly confidential information, pay invoices and request purchase orders within the IBIS system, place orders through general stores, schedule meetings, draft correspondence, compose and mail letters from campaign chair to alumni and volunteers, proofread and edit documents, mail merges, mass mailings, assist in workshop/meeting preparation and presentation, assist in proposal preparation, collect information from BSR and Lotus Notes, heavy use of the Web, file, fax, sort mail. Development Associate Stanford University School of Law September 1997  –  June 1999  (1 year 10 months) Stanford, CA Make travel arrangements, arrange for various reimbursements from the University, Petty Cash reimbursements for the Law School Development office, process expense reports, monitor budget and reconcile monthly statements, constant use of a 10-key adding machine, handle highly confidential information, provide administrative support for the Director of Development, train all new employees to the Development Office, supervise student and temporary employees, draft correspondence, proofread and edit correspondence and solicitation mailings, transcribe dictation, prepare spreadsheet reports, access, interpret and present information from alumni database and other systems, maintain and report from tracking systems, create reports consisting of certain populations, downloads and mail merges, plan and execute special events which entails sending out invitations, call to get R.S.V.P.’s, keep lists consisting of attendees and regrets, assist with seating charts, set up of tables, greet guests, hand out information packets/programs, arrange meetings and conference calls. Stewardship Associate Stanford University School of Law January 1996  –  September 1997  (1 year 9 months) Stanford, CA Provide administrative support for the Stewardship Coordinator, \nhandle highly confidential information, receive and process all money that comes to the \nLaw School, request that new funds be set up, add new funds and update fund information in \nStewardship Tracking System, draft acknowledgment letters for the Dean or appropriate fund \nraiser, proof read correspondence drafted by other office members, create reports \nconsisting of certain populations, downloads and merges, create and maintain a database in \nExcel, assist with event planning and coordination which entails pulling reports that \ninclude which population to invite to a particular event, send out invitations, call to \nget R.S.V.P.'s, keep lists consisting of attendees and regrets, assist with seating \ncharts, set up tables, hand out information packets/programs. Administrative Associate, Office of Technology Licensing Stanford University April 1995  –  May 1996  (1 year 2 months) Palo Alto, CA Answer and transfer heavy volume of telephone calls, greet clients, create and maintain databases in Excel, data entry on Macintosh, handle highly confidential information, file, send faxes, sort and distribute mail, order and maintain office supplies, run miscellaneous errands. Receptionist Dr. Gail Lebovic July 1994  –  December 1994  (6 months) Menlo Park, CA Answer heavy volume of telephone calls, take detailed messages, \nschedule appointments and surgeries, greet patients, collect payments, prepare examination \nrooms, file, fax, data entry on Macintosh. Receptionist/Personnel Assistant Stanford University Temporary Services June 1993  –  August 1994  (1 year 3 months) Answer heavy volume of telephone calls, fill requisitions, data \nentry on Macintosh, greet clients, collect and process time sheets, maintain vacation/sick \nleave records, distribute paychecks, balance department expenditure statements, 10-key \nmachine, filing, faxing. Facilities Specialist I/Emergency Dispatcher Penn State University, Office of Physical Plant July 2000  – Present (15 years 2 months) University Park, PA Answer extremely heavy phones, provide excellent customer service, receive work requests for service via telephone, band radio, walk-ins, mail and computer; coordinate action on emergency calls with supervisor, process non-emergency calls, coordinate and process work assignments, operate business band radio and page master system for communication, dispatch foremen, tradesmen and janitorial workers; issue keys, radios, equipment and vehicles; place general stores orders; maintain files, enter and maintain data, run reports with requested criteria; contact customers for billing approval; type and file correspondence, heavy data entry with attention to detail; work in a very high stress office with the ability to multi-task and prioritize. Also, main point of contact for all OPP Operations as it relates directly to football game day operations at Beaver Stadium. Coordinate all maintenance and janitorial staff in response to game day activities, forward other miscellaneous information received to appropriate departments, log all calls received in In-Stadium Solutions Facility Management system, coordinate all non-emergency work order requests to ensure they are processed in a timely manner and sent to the appropriate staff. Facilities Specialist I/Emergency Dispatcher Penn State University, Office of Physical Plant July 2000  – Present (15 years 2 months) University Park, PA Answer extremely heavy phones, provide excellent customer service, receive work requests for service via telephone, band radio, walk-ins, mail and computer; coordinate action on emergency calls with supervisor, process non-emergency calls, coordinate and process work assignments, operate business band radio and page master system for communication, dispatch foremen, tradesmen and janitorial workers; issue keys, radios, equipment and vehicles; place general stores orders; maintain files, enter and maintain data, run reports with requested criteria; contact customers for billing approval; type and file correspondence, heavy data entry with attention to detail; work in a very high stress office with the ability to multi-task and prioritize. Also, main point of contact for all OPP Operations as it relates directly to football game day operations at Beaver Stadium. Coordinate all maintenance and janitorial staff in response to game day activities, forward other miscellaneous information received to appropriate departments, log all calls received in In-Stadium Solutions Facility Management system, coordinate all non-emergency work order requests to ensure they are processed in a timely manner and sent to the appropriate staff. Staff Assistant, Development & Alumni Relations Penn State University June 1999  –  July 2000  (1 year 2 months) University Park, PA Provide administrative support to the Director of Campaign Communications, answer busy phones, take detailed messages, heavy interaction with the public, handle highly confidential information, pay invoices and request purchase orders within the IBIS system, place orders through general stores, schedule meetings, draft correspondence, compose and mail letters from campaign chair to alumni and volunteers, proofread and edit documents, mail merges, mass mailings, assist in workshop/meeting preparation and presentation, assist in proposal preparation, collect information from BSR and Lotus Notes, heavy use of the Web, file, fax, sort mail. Staff Assistant, Development & Alumni Relations Penn State University June 1999  –  July 2000  (1 year 2 months) University Park, PA Provide administrative support to the Director of Campaign Communications, answer busy phones, take detailed messages, heavy interaction with the public, handle highly confidential information, pay invoices and request purchase orders within the IBIS system, place orders through general stores, schedule meetings, draft correspondence, compose and mail letters from campaign chair to alumni and volunteers, proofread and edit documents, mail merges, mass mailings, assist in workshop/meeting preparation and presentation, assist in proposal preparation, collect information from BSR and Lotus Notes, heavy use of the Web, file, fax, sort mail. Development Associate Stanford University School of Law September 1997  –  June 1999  (1 year 10 months) Stanford, CA Make travel arrangements, arrange for various reimbursements from the University, Petty Cash reimbursements for the Law School Development office, process expense reports, monitor budget and reconcile monthly statements, constant use of a 10-key adding machine, handle highly confidential information, provide administrative support for the Director of Development, train all new employees to the Development Office, supervise student and temporary employees, draft correspondence, proofread and edit correspondence and solicitation mailings, transcribe dictation, prepare spreadsheet reports, access, interpret and present information from alumni database and other systems, maintain and report from tracking systems, create reports consisting of certain populations, downloads and mail merges, plan and execute special events which entails sending out invitations, call to get R.S.V.P.’s, keep lists consisting of attendees and regrets, assist with seating charts, set up of tables, greet guests, hand out information packets/programs, arrange meetings and conference calls. Development Associate Stanford University School of Law September 1997  –  June 1999  (1 year 10 months) Stanford, CA Make travel arrangements, arrange for various reimbursements from the University, Petty Cash reimbursements for the Law School Development office, process expense reports, monitor budget and reconcile monthly statements, constant use of a 10-key adding machine, handle highly confidential information, provide administrative support for the Director of Development, train all new employees to the Development Office, supervise student and temporary employees, draft correspondence, proofread and edit correspondence and solicitation mailings, transcribe dictation, prepare spreadsheet reports, access, interpret and present information from alumni database and other systems, maintain and report from tracking systems, create reports consisting of certain populations, downloads and mail merges, plan and execute special events which entails sending out invitations, call to get R.S.V.P.’s, keep lists consisting of attendees and regrets, assist with seating charts, set up of tables, greet guests, hand out information packets/programs, arrange meetings and conference calls. Stewardship Associate Stanford University School of Law January 1996  –  September 1997  (1 year 9 months) Stanford, CA Provide administrative support for the Stewardship Coordinator, \nhandle highly confidential information, receive and process all money that comes to the \nLaw School, request that new funds be set up, add new funds and update fund information in \nStewardship Tracking System, draft acknowledgment letters for the Dean or appropriate fund \nraiser, proof read correspondence drafted by other office members, create reports \nconsisting of certain populations, downloads and merges, create and maintain a database in \nExcel, assist with event planning and coordination which entails pulling reports that \ninclude which population to invite to a particular event, send out invitations, call to \nget R.S.V.P.'s, keep lists consisting of attendees and regrets, assist with seating \ncharts, set up tables, hand out information packets/programs. Stewardship Associate Stanford University School of Law January 1996  –  September 1997  (1 year 9 months) Stanford, CA Provide administrative support for the Stewardship Coordinator, \nhandle highly confidential information, receive and process all money that comes to the \nLaw School, request that new funds be set up, add new funds and update fund information in \nStewardship Tracking System, draft acknowledgment letters for the Dean or appropriate fund \nraiser, proof read correspondence drafted by other office members, create reports \nconsisting of certain populations, downloads and merges, create and maintain a database in \nExcel, assist with event planning and coordination which entails pulling reports that \ninclude which population to invite to a particular event, send out invitations, call to \nget R.S.V.P.'s, keep lists consisting of attendees and regrets, assist with seating \ncharts, set up tables, hand out information packets/programs. Administrative Associate, Office of Technology Licensing Stanford University April 1995  –  May 1996  (1 year 2 months) Palo Alto, CA Answer and transfer heavy volume of telephone calls, greet clients, create and maintain databases in Excel, data entry on Macintosh, handle highly confidential information, file, send faxes, sort and distribute mail, order and maintain office supplies, run miscellaneous errands. Administrative Associate, Office of Technology Licensing Stanford University April 1995  –  May 1996  (1 year 2 months) Palo Alto, CA Answer and transfer heavy volume of telephone calls, greet clients, create and maintain databases in Excel, data entry on Macintosh, handle highly confidential information, file, send faxes, sort and distribute mail, order and maintain office supplies, run miscellaneous errands. Receptionist Dr. Gail Lebovic July 1994  –  December 1994  (6 months) Menlo Park, CA Answer heavy volume of telephone calls, take detailed messages, \nschedule appointments and surgeries, greet patients, collect payments, prepare examination \nrooms, file, fax, data entry on Macintosh. Receptionist Dr. Gail Lebovic July 1994  –  December 1994  (6 months) Menlo Park, CA Answer heavy volume of telephone calls, take detailed messages, \nschedule appointments and surgeries, greet patients, collect payments, prepare examination \nrooms, file, fax, data entry on Macintosh. Receptionist/Personnel Assistant Stanford University Temporary Services June 1993  –  August 1994  (1 year 3 months) Answer heavy volume of telephone calls, fill requisitions, data \nentry on Macintosh, greet clients, collect and process time sheets, maintain vacation/sick \nleave records, distribute paychecks, balance department expenditure statements, 10-key \nmachine, filing, faxing. Receptionist/Personnel Assistant Stanford University Temporary Services June 1993  –  August 1994  (1 year 3 months) Answer heavy volume of telephone calls, fill requisitions, data \nentry on Macintosh, greet clients, collect and process time sheets, maintain vacation/sick \nleave records, distribute paychecks, balance department expenditure statements, 10-key \nmachine, filing, faxing. Skills Administrative... Event Planning Data Entry Access Lotus Notes PowerPoint Spreadsheets Microsoft Excel Invoicing Customer Service Event Management Editing Budgets Facebook Skills  Administrative... Event Planning Data Entry Access Lotus Notes PowerPoint Spreadsheets Microsoft Excel Invoicing Customer Service Event Management Editing Budgets Facebook Administrative... Event Planning Data Entry Access Lotus Notes PowerPoint Spreadsheets Microsoft Excel Invoicing Customer Service Event Management Editing Budgets Facebook Administrative... Event Planning Data Entry Access Lotus Notes PowerPoint Spreadsheets Microsoft Excel Invoicing Customer Service Event Management Editing Budgets Facebook Education Mountain View High School 1991  – 1995 Mountain View High School 1991  – 1995 Mountain View High School 1991  – 1995 Mountain View High School 1991  – 1995 Honors & Awards Additional Honors & Awards Superior Performance Award, 2007 Additional Honors & Awards Superior Performance Award, 2007 Additional Honors & Awards Superior Performance Award, 2007 Additional Honors & Awards Superior Performance Award, 2007 ", "Experience Development Associate Stanford University May 2008  – Present (7 years 4 months) Graduate School of Business Development Associate Stanford Graduate School of Business 2008  – Present (7 years) Office Manager Stanford University June 2005  –  May 2008  (3 years) Division Administrator Stanford University July 1998  –  May 2005  (6 years 11 months) Product Realization Network formerly Alliance for Innovative Manufacturing Development Associate Stanford University May 2008  – Present (7 years 4 months) Graduate School of Business Development Associate Stanford University May 2008  – Present (7 years 4 months) Graduate School of Business Development Associate Stanford Graduate School of Business 2008  – Present (7 years) Development Associate Stanford Graduate School of Business 2008  – Present (7 years) Office Manager Stanford University June 2005  –  May 2008  (3 years) Office Manager Stanford University June 2005  –  May 2008  (3 years) Division Administrator Stanford University July 1998  –  May 2005  (6 years 11 months) Product Realization Network formerly Alliance for Innovative Manufacturing Division Administrator Stanford University July 1998  –  May 2005  (6 years 11 months) Product Realization Network formerly Alliance for Innovative Manufacturing Education Foothill College AA,  Business Administration 1983  – 1986 Woodside High School Diploma,  General Education 1979  – 1983 Foothill College AA,  Business Administration 1983  – 1986 Foothill College AA,  Business Administration 1983  – 1986 Foothill College AA,  Business Administration 1983  – 1986 Woodside High School Diploma,  General Education 1979  – 1983 Woodside High School Diploma,  General Education 1979  – 1983 Woodside High School Diploma,  General Education 1979  – 1983 ", "Experience Assistant Athletic Director for Engagement Stanford University September 2014  – Present (1 year) Department of Athletics, Physical Education, and Recreation Co-Executive Director Singular Humanitarian experience (SHe) January 2011  – Present (4 years 8 months) Staff Director, DAPER Investment Fund Stanford University Athletic Department August 2012  –  August 2014  (2 years 1 month) Director of Development Communications, Department of Athletics Stanford University Athletic Department August 2008  –  August 2014  (6 years 1 month) Director of Development Singular Humanitarian experience (SHe) October 2009  –  January 2011  (1 year 4 months) Development Writer Stanford University October 2004  –  July 2008  (3 years 10 months) Department of Athletics, Physical Education, and Recreation Development Associate Stanford University Athletic Department January 2001  –  October 2004  (3 years 10 months) Assistant Athletic Director for Engagement Stanford University September 2014  – Present (1 year) Department of Athletics, Physical Education, and Recreation Assistant Athletic Director for Engagement Stanford University September 2014  – Present (1 year) Department of Athletics, Physical Education, and Recreation Co-Executive Director Singular Humanitarian experience (SHe) January 2011  – Present (4 years 8 months) Co-Executive Director Singular Humanitarian experience (SHe) January 2011  – Present (4 years 8 months) Staff Director, DAPER Investment Fund Stanford University Athletic Department August 2012  –  August 2014  (2 years 1 month) Staff Director, DAPER Investment Fund Stanford University Athletic Department August 2012  –  August 2014  (2 years 1 month) Director of Development Communications, Department of Athletics Stanford University Athletic Department August 2008  –  August 2014  (6 years 1 month) Director of Development Communications, Department of Athletics Stanford University Athletic Department August 2008  –  August 2014  (6 years 1 month) Director of Development Singular Humanitarian experience (SHe) October 2009  –  January 2011  (1 year 4 months) Director of Development Singular Humanitarian experience (SHe) October 2009  –  January 2011  (1 year 4 months) Development Writer Stanford University October 2004  –  July 2008  (3 years 10 months) Department of Athletics, Physical Education, and Recreation Development Writer Stanford University October 2004  –  July 2008  (3 years 10 months) Department of Athletics, Physical Education, and Recreation Development Associate Stanford University Athletic Department January 2001  –  October 2004  (3 years 10 months) Development Associate Stanford University Athletic Department January 2001  –  October 2004  (3 years 10 months) Skills Alumni Relations Fundraising Volunteer Management Nonprofits Editing Skills  Alumni Relations Fundraising Volunteer Management Nonprofits Editing Alumni Relations Fundraising Volunteer Management Nonprofits Editing Alumni Relations Fundraising Volunteer Management Nonprofits Editing Education Brigham Young University BA,  Humanities ,  English emphasis 1997  – 1999 Brigham Young University - Idaho AA 1995  – 1997 Brigham Young University BA,  Humanities ,  English emphasis 1997  – 1999 Brigham Young University BA,  Humanities ,  English emphasis 1997  – 1999 Brigham Young University BA,  Humanities ,  English emphasis 1997  – 1999 Brigham Young University - Idaho AA 1995  – 1997 Brigham Young University - Idaho AA 1995  – 1997 Brigham Young University - Idaho AA 1995  – 1997 ", "Summary Creative professional with leadership experience focused on fund development. Ms. Nazareno has spent four years cultivating donors primarily through stewardship efforts and producing events. Her work as a project manager, playwright, and educator all serve as the backbone for her interest in learning and applying best practices for major gift and annual fund development. Specialties:Develops and implements fund raising strategies; creates marketing materials and donor solicitation proposals; skilled in prospect research; and can utilize Facebook, Twitter, and YouTube to achieve fund raising goals. Also coaches individuals and community groups for public speaking engagements. Summary Creative professional with leadership experience focused on fund development. Ms. Nazareno has spent four years cultivating donors primarily through stewardship efforts and producing events. Her work as a project manager, playwright, and educator all serve as the backbone for her interest in learning and applying best practices for major gift and annual fund development. Specialties:Develops and implements fund raising strategies; creates marketing materials and donor solicitation proposals; skilled in prospect research; and can utilize Facebook, Twitter, and YouTube to achieve fund raising goals. Also coaches individuals and community groups for public speaking engagements. Creative professional with leadership experience focused on fund development. Ms. Nazareno has spent four years cultivating donors primarily through stewardship efforts and producing events. Her work as a project manager, playwright, and educator all serve as the backbone for her interest in learning and applying best practices for major gift and annual fund development. Specialties:Develops and implements fund raising strategies; creates marketing materials and donor solicitation proposals; skilled in prospect research; and can utilize Facebook, Twitter, and YouTube to achieve fund raising goals. Also coaches individuals and community groups for public speaking engagements. Creative professional with leadership experience focused on fund development. Ms. Nazareno has spent four years cultivating donors primarily through stewardship efforts and producing events. Her work as a project manager, playwright, and educator all serve as the backbone for her interest in learning and applying best practices for major gift and annual fund development. Specialties:Develops and implements fund raising strategies; creates marketing materials and donor solicitation proposals; skilled in prospect research; and can utilize Facebook, Twitter, and YouTube to achieve fund raising goals. Also coaches individuals and community groups for public speaking engagements. Experience Assistant Director of Development Artistic Dreams International September 2012  – Present (3 years) Director of Development Leviathan Lab July 2011  –  October 2012  (1 year 4 months) New york, NY Development Associate Stanford University School of Medicine August 2008  –  June 2009  (11 months) Founder Pamana Theatre Project January 2004  –  December 2006  (3 years) Project Manager Filipino American Arts Exposition December 2004  –  August 2005  (9 months) Assistant Director of Development Artistic Dreams International September 2012  – Present (3 years) Assistant Director of Development Artistic Dreams International September 2012  – Present (3 years) Director of Development Leviathan Lab July 2011  –  October 2012  (1 year 4 months) New york, NY Director of Development Leviathan Lab July 2011  –  October 2012  (1 year 4 months) New york, NY Development Associate Stanford University School of Medicine August 2008  –  June 2009  (11 months) Development Associate Stanford University School of Medicine August 2008  –  June 2009  (11 months) Founder Pamana Theatre Project January 2004  –  December 2006  (3 years) Founder Pamana Theatre Project January 2004  –  December 2006  (3 years) Project Manager Filipino American Arts Exposition December 2004  –  August 2005  (9 months) Project Manager Filipino American Arts Exposition December 2004  –  August 2005  (9 months) Skills Grant Writing Non-profits Event Planning Public Speaking Research Fundraising Leadership Marketing Proposal Writing Nonprofits Stewardship Skills  Grant Writing Non-profits Event Planning Public Speaking Research Fundraising Leadership Marketing Proposal Writing Nonprofits Stewardship Grant Writing Non-profits Event Planning Public Speaking Research Fundraising Leadership Marketing Proposal Writing Nonprofits Stewardship Grant Writing Non-profits Event Planning Public Speaking Research Fundraising Leadership Marketing Proposal Writing Nonprofits Stewardship Education Harvard University Teaching Fellow,  Voice Pedagogy 2009  – 2010 Asian Institute of Management Certificate,  Non Profit Management 2005  – 2005 State University of New York at Binghamton BA,  Philosophy and English Rhetoric Harvard University Teaching Fellow,  Voice Pedagogy 2009  – 2010 Harvard University Teaching Fellow,  Voice Pedagogy 2009  – 2010 Harvard University Teaching Fellow,  Voice Pedagogy 2009  – 2010 Asian Institute of Management Certificate,  Non Profit Management 2005  – 2005 Asian Institute of Management Certificate,  Non Profit Management 2005  – 2005 Asian Institute of Management Certificate,  Non Profit Management 2005  – 2005 State University of New York at Binghamton BA,  Philosophy and English Rhetoric State University of New York at Binghamton BA,  Philosophy and English Rhetoric State University of New York at Binghamton BA,  Philosophy and English Rhetoric ", "Experience Development Associate Stanford University Development Associate Stanford University Development Associate Stanford University ", "Experience Senior Clinical Research Coordinator University of California, San Francisco February 2014  – Present (1 year 7 months) Department of Radiology and Biomedical Imaging - Interventional Radiology Clinical Research Coordinator and Protocol Manager:. Responsible for all aspects of clinical trial initiation, management, compliance and subject relations. Currently managing 18 research studies for over 6 Radiology faculty. Clinical Research Coordinator Center for Imaging of Neurodegenerative Diseases (CIND) February 2012  –  January 2014  (2 years) San Francisco VA Medical Center/UCSF Clinical research coordinator for brain imaging and clinical trials for Veterans with PTSD, Alzheimers and Dementia. Clinical study coordination; IRB approvals; grant & manuscript writing; data and imaging analysis; hardware and software management; patient recruitment and interviewing; statistical analysis. Assigned to one clinical trial on reducing post-operative cognitive decline in veterans with PTSD using Propranolol, and another using the β-amyloid tracer AV-45 and PET scanning to predict onset of Alzheimer’s in veterans with PTSD. Medical Assistant and Office Manager Dr. Stephen Ellis October 2008  –  August 2013  (4 years 11 months) San Francisco Responsible for patient care; patient triage and vitals; laboratory analysis; office management, web design and IT and patient outreach. Research and Development Associate Stanford University June 2005  –  June 2006  (1 year 1 month) Dept of Psychiatry and Behavioral Sciences 3.0 Tesla functional MRI technician and operator, programmer for interactive stimuli for subjects in fMRI experiments; web design; tech support; patient and test subject recruitment and management; grant and journal article writing and editing; statistical data analysis; cinematography and video editing of patient instructional videos. Senior Research Associate NASA Ames Research Center March 2002  –  June 2005  (3 years 4 months) Moffett Field, CA Robotics programmer for gravitation experiments; Light, SEM and TEM microscopy; 3D reconstruction of neural structures under microscope; web design and maintenance; tech support; grant and journal article writing and editing; animal care; CAD engineering design in SolidWorks; machining and engineering of gravitation experiment test equipment; cell culture; PCR; gene expression analyses; video cinematography and editing of project documentaries for NASA media relations office and news media. Senior Web Producer Topica September 1999  –  September 2001  (2 years 1 month) San Francisco Designed, tested and implemented HTML in email production for high end corporate HTML email newsletters for companies such as IBM, National Geographic and Conde Nast Senior Clinical Research Coordinator University of California, San Francisco February 2014  – Present (1 year 7 months) Department of Radiology and Biomedical Imaging - Interventional Radiology Clinical Research Coordinator and Protocol Manager:. Responsible for all aspects of clinical trial initiation, management, compliance and subject relations. Currently managing 18 research studies for over 6 Radiology faculty. Senior Clinical Research Coordinator University of California, San Francisco February 2014  – Present (1 year 7 months) Department of Radiology and Biomedical Imaging - Interventional Radiology Clinical Research Coordinator and Protocol Manager:. Responsible for all aspects of clinical trial initiation, management, compliance and subject relations. Currently managing 18 research studies for over 6 Radiology faculty. Clinical Research Coordinator Center for Imaging of Neurodegenerative Diseases (CIND) February 2012  –  January 2014  (2 years) San Francisco VA Medical Center/UCSF Clinical research coordinator for brain imaging and clinical trials for Veterans with PTSD, Alzheimers and Dementia. Clinical study coordination; IRB approvals; grant & manuscript writing; data and imaging analysis; hardware and software management; patient recruitment and interviewing; statistical analysis. Assigned to one clinical trial on reducing post-operative cognitive decline in veterans with PTSD using Propranolol, and another using the β-amyloid tracer AV-45 and PET scanning to predict onset of Alzheimer’s in veterans with PTSD. Clinical Research Coordinator Center for Imaging of Neurodegenerative Diseases (CIND) February 2012  –  January 2014  (2 years) San Francisco VA Medical Center/UCSF Clinical research coordinator for brain imaging and clinical trials for Veterans with PTSD, Alzheimers and Dementia. Clinical study coordination; IRB approvals; grant & manuscript writing; data and imaging analysis; hardware and software management; patient recruitment and interviewing; statistical analysis. Assigned to one clinical trial on reducing post-operative cognitive decline in veterans with PTSD using Propranolol, and another using the β-amyloid tracer AV-45 and PET scanning to predict onset of Alzheimer’s in veterans with PTSD. Medical Assistant and Office Manager Dr. Stephen Ellis October 2008  –  August 2013  (4 years 11 months) San Francisco Responsible for patient care; patient triage and vitals; laboratory analysis; office management, web design and IT and patient outreach. Medical Assistant and Office Manager Dr. Stephen Ellis October 2008  –  August 2013  (4 years 11 months) San Francisco Responsible for patient care; patient triage and vitals; laboratory analysis; office management, web design and IT and patient outreach. Research and Development Associate Stanford University June 2005  –  June 2006  (1 year 1 month) Dept of Psychiatry and Behavioral Sciences 3.0 Tesla functional MRI technician and operator, programmer for interactive stimuli for subjects in fMRI experiments; web design; tech support; patient and test subject recruitment and management; grant and journal article writing and editing; statistical data analysis; cinematography and video editing of patient instructional videos. Research and Development Associate Stanford University June 2005  –  June 2006  (1 year 1 month) Dept of Psychiatry and Behavioral Sciences 3.0 Tesla functional MRI technician and operator, programmer for interactive stimuli for subjects in fMRI experiments; web design; tech support; patient and test subject recruitment and management; grant and journal article writing and editing; statistical data analysis; cinematography and video editing of patient instructional videos. Senior Research Associate NASA Ames Research Center March 2002  –  June 2005  (3 years 4 months) Moffett Field, CA Robotics programmer for gravitation experiments; Light, SEM and TEM microscopy; 3D reconstruction of neural structures under microscope; web design and maintenance; tech support; grant and journal article writing and editing; animal care; CAD engineering design in SolidWorks; machining and engineering of gravitation experiment test equipment; cell culture; PCR; gene expression analyses; video cinematography and editing of project documentaries for NASA media relations office and news media. Senior Research Associate NASA Ames Research Center March 2002  –  June 2005  (3 years 4 months) Moffett Field, CA Robotics programmer for gravitation experiments; Light, SEM and TEM microscopy; 3D reconstruction of neural structures under microscope; web design and maintenance; tech support; grant and journal article writing and editing; animal care; CAD engineering design in SolidWorks; machining and engineering of gravitation experiment test equipment; cell culture; PCR; gene expression analyses; video cinematography and editing of project documentaries for NASA media relations office and news media. Senior Web Producer Topica September 1999  –  September 2001  (2 years 1 month) San Francisco Designed, tested and implemented HTML in email production for high end corporate HTML email newsletters for companies such as IBM, National Geographic and Conde Nast Senior Web Producer Topica September 1999  –  September 2001  (2 years 1 month) San Francisco Designed, tested and implemented HTML in email production for high end corporate HTML email newsletters for companies such as IBM, National Geographic and Conde Nast Languages English Native or bilingual proficiency Japanese Professional working proficiency spanish Full professional proficiency latin Limited working proficiency English Native or bilingual proficiency Japanese Professional working proficiency spanish Full professional proficiency latin Limited working proficiency English Native or bilingual proficiency Japanese Professional working proficiency spanish Full professional proficiency latin Limited working proficiency Native or bilingual proficiency Professional working proficiency Full professional proficiency Limited working proficiency Skills Neurolucida Microscopy Igor Pro Matlab Cognitive Assessment PTSD Alzheimer's disease IRB Certified Research Design Grant Coordination Laboratory Experimentation Western Blotting Clinical Research Neuroimaging Molecular Biology See 1+     See less Skills  Neurolucida Microscopy Igor Pro Matlab Cognitive Assessment PTSD Alzheimer's disease IRB Certified Research Design Grant Coordination Laboratory Experimentation Western Blotting Clinical Research Neuroimaging Molecular Biology See 1+     See less Neurolucida Microscopy Igor Pro Matlab Cognitive Assessment PTSD Alzheimer's disease IRB Certified Research Design Grant Coordination Laboratory Experimentation Western Blotting Clinical Research Neuroimaging Molecular Biology See 1+     See less Neurolucida Microscopy Igor Pro Matlab Cognitive Assessment PTSD Alzheimer's disease IRB Certified Research Design Grant Coordination Laboratory Experimentation Western Blotting Clinical Research Neuroimaging Molecular Biology See 1+     See less Education San Jose State University Neurobiology and Anatomy 2002  – 2005 3 years coursework towards a Master's Degree in Biology Pomona College Bachelor of Arts (B.A.),  Neuropsychology 1995  – 1999 San Jose State University Neurobiology and Anatomy 2002  – 2005 3 years coursework towards a Master's Degree in Biology San Jose State University Neurobiology and Anatomy 2002  – 2005 3 years coursework towards a Master's Degree in Biology San Jose State University Neurobiology and Anatomy 2002  – 2005 3 years coursework towards a Master's Degree in Biology Pomona College Bachelor of Arts (B.A.),  Neuropsychology 1995  – 1999 Pomona College Bachelor of Arts (B.A.),  Neuropsychology 1995  – 1999 Pomona College Bachelor of Arts (B.A.),  Neuropsychology 1995  – 1999 ", "Experience Advisory Board Member \"Dreams of a City 2\" April 2011  – Present (4 years 5 months) Board Member EPA Today 2008  – Present (7 years) Film Jury Member UNAFF (United Nations Association Film Festival) 2006  – Present (9 years) Stanford, CA Analyze and select documentary film submissions from around the World to be screened at UNAFF, a world-class documentary film festival. Development Associate Stanford University 2000  – Present (15 years) Editor in Chief TheWhatItDo.com 2009  –  August 2013  (4 years) Acting as an innovator of the group of writers with the aim of maintaining good journalism. Oversees stages in writing and special projects, makes edits in writing, photography, videography for style and substance; brainstorms creative articles in news and entertainment. Plan content for social media suites and the website. Approves content for publishing. Identify gaps in available resources and develop appropriate content to fill those gaps. Relationship builder. Staff and volunteer developer and motivator. Develop unique ideas to execute operational and strategic planning of expanding a new niche market. Public Affairs, Community & Media Relations LDS Church 2007  –  2013  (6 years) Public Relations Director Urban Islanders, 2010  –  September 2012  (2 years) Excecutive Producer/Writer of short series \"What's Going On\" Midpeninsula Community Media Center 2007  –  June 2010  (3 years) 2007 Wave award winner for Best Producer, \"What's Going On\", an episodic series aimed to cultivate the voices of the silent cultures of a new & old generation of multi-ethnic urban youth & young adults growing up in America. This series puts young people in a position of power while also teaching them valuable lessons about how to express and produce creative outlets for critical peace-building initiatives. Founder and Director EPA Peace & Unity 2006  –  2010  (4 years) EPA Peace & Unity (EPAPU), a coalition group founded on January 2007 in response to the Winter 2006/2007 homicides and youth violence in East Palo Alto. Specialty in community organizing, strategic consulting & fostering community relations. Board Member Youth Community Services 2007  –  2007  (less than a year) Advisory Board Member \"Dreams of a City 2\" April 2011  – Present (4 years 5 months) Advisory Board Member \"Dreams of a City 2\" April 2011  – Present (4 years 5 months) Board Member EPA Today 2008  – Present (7 years) Board Member EPA Today 2008  – Present (7 years) Film Jury Member UNAFF (United Nations Association Film Festival) 2006  – Present (9 years) Stanford, CA Analyze and select documentary film submissions from around the World to be screened at UNAFF, a world-class documentary film festival. Film Jury Member UNAFF (United Nations Association Film Festival) 2006  – Present (9 years) Stanford, CA Analyze and select documentary film submissions from around the World to be screened at UNAFF, a world-class documentary film festival. Development Associate Stanford University 2000  – Present (15 years) Development Associate Stanford University 2000  – Present (15 years) Editor in Chief TheWhatItDo.com 2009  –  August 2013  (4 years) Acting as an innovator of the group of writers with the aim of maintaining good journalism. Oversees stages in writing and special projects, makes edits in writing, photography, videography for style and substance; brainstorms creative articles in news and entertainment. Plan content for social media suites and the website. Approves content for publishing. Identify gaps in available resources and develop appropriate content to fill those gaps. Relationship builder. Staff and volunteer developer and motivator. Develop unique ideas to execute operational and strategic planning of expanding a new niche market. Editor in Chief TheWhatItDo.com 2009  –  August 2013  (4 years) Acting as an innovator of the group of writers with the aim of maintaining good journalism. Oversees stages in writing and special projects, makes edits in writing, photography, videography for style and substance; brainstorms creative articles in news and entertainment. Plan content for social media suites and the website. Approves content for publishing. Identify gaps in available resources and develop appropriate content to fill those gaps. Relationship builder. Staff and volunteer developer and motivator. Develop unique ideas to execute operational and strategic planning of expanding a new niche market. Public Affairs, Community & Media Relations LDS Church 2007  –  2013  (6 years) Public Affairs, Community & Media Relations LDS Church 2007  –  2013  (6 years) Public Relations Director Urban Islanders, 2010  –  September 2012  (2 years) Public Relations Director Urban Islanders, 2010  –  September 2012  (2 years) Excecutive Producer/Writer of short series \"What's Going On\" Midpeninsula Community Media Center 2007  –  June 2010  (3 years) 2007 Wave award winner for Best Producer, \"What's Going On\", an episodic series aimed to cultivate the voices of the silent cultures of a new & old generation of multi-ethnic urban youth & young adults growing up in America. This series puts young people in a position of power while also teaching them valuable lessons about how to express and produce creative outlets for critical peace-building initiatives. Excecutive Producer/Writer of short series \"What's Going On\" Midpeninsula Community Media Center 2007  –  June 2010  (3 years) 2007 Wave award winner for Best Producer, \"What's Going On\", an episodic series aimed to cultivate the voices of the silent cultures of a new & old generation of multi-ethnic urban youth & young adults growing up in America. This series puts young people in a position of power while also teaching them valuable lessons about how to express and produce creative outlets for critical peace-building initiatives. Founder and Director EPA Peace & Unity 2006  –  2010  (4 years) EPA Peace & Unity (EPAPU), a coalition group founded on January 2007 in response to the Winter 2006/2007 homicides and youth violence in East Palo Alto. Specialty in community organizing, strategic consulting & fostering community relations. Founder and Director EPA Peace & Unity 2006  –  2010  (4 years) EPA Peace & Unity (EPAPU), a coalition group founded on January 2007 in response to the Winter 2006/2007 homicides and youth violence in East Palo Alto. Specialty in community organizing, strategic consulting & fostering community relations. Board Member Youth Community Services 2007  –  2007  (less than a year) Board Member Youth Community Services 2007  –  2007  (less than a year) Skills Editing Video Production Non-profits Community Outreach Event Planning Fundraising Film Media Relations Research Event Management Grant Writing Teaching Nonprofits Public Speaking Community Organizing Microsoft Office Public Relations Video Social Media Strategic Planning Program Development PowerPoint Volunteer Management Community Development Photography Social Networking Documentaries Creative Writing Social Media Marketing Videography Journalism Press Releases Video Editing Facebook See 19+     See less Skills  Editing Video Production Non-profits Community Outreach Event Planning Fundraising Film Media Relations Research Event Management Grant Writing Teaching Nonprofits Public Speaking Community Organizing Microsoft Office Public Relations Video Social Media Strategic Planning Program Development PowerPoint Volunteer Management Community Development Photography Social Networking Documentaries Creative Writing Social Media Marketing Videography Journalism Press Releases Video Editing Facebook See 19+     See less Editing Video Production Non-profits Community Outreach Event Planning Fundraising Film Media Relations Research Event Management Grant Writing Teaching Nonprofits Public Speaking Community Organizing Microsoft Office Public Relations Video Social Media Strategic Planning Program Development PowerPoint Volunteer Management Community Development Photography Social Networking Documentaries Creative Writing Social Media Marketing Videography Journalism Press Releases Video Editing Facebook See 19+     See less Editing Video Production Non-profits Community Outreach Event Planning Fundraising Film Media Relations Research Event Management Grant Writing Teaching Nonprofits Public Speaking Community Organizing Microsoft Office Public Relations Video Social Media Strategic Planning Program Development PowerPoint Volunteer Management Community Development Photography Social Networking Documentaries Creative Writing Social Media Marketing Videography Journalism Press Releases Video Editing Facebook See 19+     See less ", "Summary I create optimal working environments by developing, implementing, and managing operations infrastructures, building the right teams, nurturing organizational culture, and never resting on past achievements. My goal is to always be ahead of the game by constantly focusing on innovation and process improvement. I have been successful at unlocking hidden talents in current employees and finding the right people to fill critical roles.  \n \nI’m a jack-of-all-trades, and provide leadership across all business functions. I intend to continue my success by working with small, growing companies where I build unique and scalable operational frameworks and cultures that enable motivated, talented people to thrive and the business to flourish. \n \nWhen not at work, I can be found with my family or coaching youth sports. Summary I create optimal working environments by developing, implementing, and managing operations infrastructures, building the right teams, nurturing organizational culture, and never resting on past achievements. My goal is to always be ahead of the game by constantly focusing on innovation and process improvement. I have been successful at unlocking hidden talents in current employees and finding the right people to fill critical roles.  \n \nI’m a jack-of-all-trades, and provide leadership across all business functions. I intend to continue my success by working with small, growing companies where I build unique and scalable operational frameworks and cultures that enable motivated, talented people to thrive and the business to flourish. \n \nWhen not at work, I can be found with my family or coaching youth sports. I create optimal working environments by developing, implementing, and managing operations infrastructures, building the right teams, nurturing organizational culture, and never resting on past achievements. My goal is to always be ahead of the game by constantly focusing on innovation and process improvement. I have been successful at unlocking hidden talents in current employees and finding the right people to fill critical roles.  \n \nI’m a jack-of-all-trades, and provide leadership across all business functions. I intend to continue my success by working with small, growing companies where I build unique and scalable operational frameworks and cultures that enable motivated, talented people to thrive and the business to flourish. \n \nWhen not at work, I can be found with my family or coaching youth sports. I create optimal working environments by developing, implementing, and managing operations infrastructures, building the right teams, nurturing organizational culture, and never resting on past achievements. My goal is to always be ahead of the game by constantly focusing on innovation and process improvement. I have been successful at unlocking hidden talents in current employees and finding the right people to fill critical roles.  \n \nI’m a jack-of-all-trades, and provide leadership across all business functions. I intend to continue my success by working with small, growing companies where I build unique and scalable operational frameworks and cultures that enable motivated, talented people to thrive and the business to flourish. \n \nWhen not at work, I can be found with my family or coaching youth sports. Experience Account Executive - College CaptainU January 2014  –  August 2015  (1 year 8 months) San Francisco Bay Area CaptainU is a successful, profitable company that helps youth athletes connect with college coaches, summer camps, and other athletic related events. \n \nI am developing strategies to assist college coaches and summer camp operators market their programs to the athletes within the CaptainU network. With over 5K monthly user growth, we are the leader in athlete data and marketing opportunities for cams and events. Business Development & Marketing Lead Greenough Consulting Group February 2012  –  January 2013  (1 year) Burlingame, CA Greenough Consulting Group (GCG) provides Financial, Administrative, and Human Resources services to technology focused startups, private equity firms, and mid-market companies. Our flexible, scalable and cost-effective model gives small and growing organizations access to trusted executives with decades of experience as CEOs, CFOs, HR executives and Fund Managers.  \n \nAs the Business Development Lead, I lead the expansion of the marketing efforts into the mid-market segment and found growth opportunities among startups and established companies. Leveraging CRM and search tools, I grew our marketing database by over 300 potential clients per month. I established a cohesive marketing campaign around emails, 1-page product sheets, and newly designed executive bios. Sr. Operations Manager House of Air November 2010  –  July 2011  (9 months) San Francisco, CA House of Air is the premier recreation and trampoline park in San Francisco. Our customer base included children, adults, and some of the best extreme sports athletes from North America.  \n \nAs the Sr. Operations Manager, I developed and implemented sustainable growth opportunities across all business functions. I created an employee training program and growth strategies to retain highly talented associates and delegated tasks based on their skills and knowledge. I created opportunities to grow our product offerings with unique leagues, training classes, and partnerships with local brands that matched our company ideals. Sales Associate AJ Associates June 2009  –  October 2010  (1 year 5 months) Carmel, CA AJ Associates was a third-party reseller of technology and computer chips for small technology companies based in California. We gained exclusive rights to both manufacture and sell the technology for the companies that created it. I assisted the owner/founder with developing the internal business structure and sales systems. Operations Manager Soiree Valet June 2008  –  June 2009  (1 year 1 month) San Francisco Bay Area Soiree Valet is the leader in private event and location based parking services in the Bay Area. Managing over 200 employees, I was responsible for the coordination and staffing for over 1100 events from Napa to San Jose including the SF Opera, Symphony, and Ballet galas. I also managed 8 fixed-base locations that included office buildings, restaurants, and hospitals as well as our Peninsula based satellite office. I was responsible for negotiating the transportation contract with the Stanford Athletic Department during the parking shortage for basketball and volleyball games with the building of the new business school. Additionally, I directed the training for new employees that included classroom and field training. Operations Director Stanford University Department of Athletics February 2004  –  May 2008  (4 years 4 months) Managed the day-to-day business functions for two premier collegiate golf programs.  \n \n•\tDirect and coordinate department budgets and financial planning. \n•\tCoordinate event operations for eight annual collegiate and fundraising golf tournaments. \n•\tMaintain equipment inventory and reorder levels with contracted vendors. \n•\tNegotiate contracts with local hospitality vendors. \n•\tRepresent golf teams during meetings and charity events. \n•\tDirect all administrative, fundraising, and marketing efforts in coordination with head coaches. Annual Giving/Development Associate Stanford University Department of Athletics April 2000  –  February 2004  (3 years 11 months) Stanford, CA •\tMonitor and report on the success of the $3 million annual scholarship campaign. \n•\tPlan and direct agendas for quarterly board meetings with 65 directors. \n•\tCoordinate fundraising efforts with head coaches and administrators of 34 varsity sports. \n•\tPlan and promote events and social functions for both select and large scale groups. \n•\tParticipate in departmental fundraising activities and encourage alumni participation. Operations Assistant Unicon International October 1999  –  April 2000  (7 months) Account Executive - College CaptainU January 2014  –  August 2015  (1 year 8 months) San Francisco Bay Area CaptainU is a successful, profitable company that helps youth athletes connect with college coaches, summer camps, and other athletic related events. \n \nI am developing strategies to assist college coaches and summer camp operators market their programs to the athletes within the CaptainU network. With over 5K monthly user growth, we are the leader in athlete data and marketing opportunities for cams and events. Account Executive - College CaptainU January 2014  –  August 2015  (1 year 8 months) San Francisco Bay Area CaptainU is a successful, profitable company that helps youth athletes connect with college coaches, summer camps, and other athletic related events. \n \nI am developing strategies to assist college coaches and summer camp operators market their programs to the athletes within the CaptainU network. With over 5K monthly user growth, we are the leader in athlete data and marketing opportunities for cams and events. Business Development & Marketing Lead Greenough Consulting Group February 2012  –  January 2013  (1 year) Burlingame, CA Greenough Consulting Group (GCG) provides Financial, Administrative, and Human Resources services to technology focused startups, private equity firms, and mid-market companies. Our flexible, scalable and cost-effective model gives small and growing organizations access to trusted executives with decades of experience as CEOs, CFOs, HR executives and Fund Managers.  \n \nAs the Business Development Lead, I lead the expansion of the marketing efforts into the mid-market segment and found growth opportunities among startups and established companies. Leveraging CRM and search tools, I grew our marketing database by over 300 potential clients per month. I established a cohesive marketing campaign around emails, 1-page product sheets, and newly designed executive bios. Business Development & Marketing Lead Greenough Consulting Group February 2012  –  January 2013  (1 year) Burlingame, CA Greenough Consulting Group (GCG) provides Financial, Administrative, and Human Resources services to technology focused startups, private equity firms, and mid-market companies. Our flexible, scalable and cost-effective model gives small and growing organizations access to trusted executives with decades of experience as CEOs, CFOs, HR executives and Fund Managers.  \n \nAs the Business Development Lead, I lead the expansion of the marketing efforts into the mid-market segment and found growth opportunities among startups and established companies. Leveraging CRM and search tools, I grew our marketing database by over 300 potential clients per month. I established a cohesive marketing campaign around emails, 1-page product sheets, and newly designed executive bios. Sr. Operations Manager House of Air November 2010  –  July 2011  (9 months) San Francisco, CA House of Air is the premier recreation and trampoline park in San Francisco. Our customer base included children, adults, and some of the best extreme sports athletes from North America.  \n \nAs the Sr. Operations Manager, I developed and implemented sustainable growth opportunities across all business functions. I created an employee training program and growth strategies to retain highly talented associates and delegated tasks based on their skills and knowledge. I created opportunities to grow our product offerings with unique leagues, training classes, and partnerships with local brands that matched our company ideals. Sr. Operations Manager House of Air November 2010  –  July 2011  (9 months) San Francisco, CA House of Air is the premier recreation and trampoline park in San Francisco. Our customer base included children, adults, and some of the best extreme sports athletes from North America.  \n \nAs the Sr. Operations Manager, I developed and implemented sustainable growth opportunities across all business functions. I created an employee training program and growth strategies to retain highly talented associates and delegated tasks based on their skills and knowledge. I created opportunities to grow our product offerings with unique leagues, training classes, and partnerships with local brands that matched our company ideals. Sales Associate AJ Associates June 2009  –  October 2010  (1 year 5 months) Carmel, CA AJ Associates was a third-party reseller of technology and computer chips for small technology companies based in California. We gained exclusive rights to both manufacture and sell the technology for the companies that created it. I assisted the owner/founder with developing the internal business structure and sales systems. Sales Associate AJ Associates June 2009  –  October 2010  (1 year 5 months) Carmel, CA AJ Associates was a third-party reseller of technology and computer chips for small technology companies based in California. We gained exclusive rights to both manufacture and sell the technology for the companies that created it. I assisted the owner/founder with developing the internal business structure and sales systems. Operations Manager Soiree Valet June 2008  –  June 2009  (1 year 1 month) San Francisco Bay Area Soiree Valet is the leader in private event and location based parking services in the Bay Area. Managing over 200 employees, I was responsible for the coordination and staffing for over 1100 events from Napa to San Jose including the SF Opera, Symphony, and Ballet galas. I also managed 8 fixed-base locations that included office buildings, restaurants, and hospitals as well as our Peninsula based satellite office. I was responsible for negotiating the transportation contract with the Stanford Athletic Department during the parking shortage for basketball and volleyball games with the building of the new business school. Additionally, I directed the training for new employees that included classroom and field training. Operations Manager Soiree Valet June 2008  –  June 2009  (1 year 1 month) San Francisco Bay Area Soiree Valet is the leader in private event and location based parking services in the Bay Area. Managing over 200 employees, I was responsible for the coordination and staffing for over 1100 events from Napa to San Jose including the SF Opera, Symphony, and Ballet galas. I also managed 8 fixed-base locations that included office buildings, restaurants, and hospitals as well as our Peninsula based satellite office. I was responsible for negotiating the transportation contract with the Stanford Athletic Department during the parking shortage for basketball and volleyball games with the building of the new business school. Additionally, I directed the training for new employees that included classroom and field training. Operations Director Stanford University Department of Athletics February 2004  –  May 2008  (4 years 4 months) Managed the day-to-day business functions for two premier collegiate golf programs.  \n \n•\tDirect and coordinate department budgets and financial planning. \n•\tCoordinate event operations for eight annual collegiate and fundraising golf tournaments. \n•\tMaintain equipment inventory and reorder levels with contracted vendors. \n•\tNegotiate contracts with local hospitality vendors. \n•\tRepresent golf teams during meetings and charity events. \n•\tDirect all administrative, fundraising, and marketing efforts in coordination with head coaches. Operations Director Stanford University Department of Athletics February 2004  –  May 2008  (4 years 4 months) Managed the day-to-day business functions for two premier collegiate golf programs.  \n \n•\tDirect and coordinate department budgets and financial planning. \n•\tCoordinate event operations for eight annual collegiate and fundraising golf tournaments. \n•\tMaintain equipment inventory and reorder levels with contracted vendors. \n•\tNegotiate contracts with local hospitality vendors. \n•\tRepresent golf teams during meetings and charity events. \n•\tDirect all administrative, fundraising, and marketing efforts in coordination with head coaches. Annual Giving/Development Associate Stanford University Department of Athletics April 2000  –  February 2004  (3 years 11 months) Stanford, CA •\tMonitor and report on the success of the $3 million annual scholarship campaign. \n•\tPlan and direct agendas for quarterly board meetings with 65 directors. \n•\tCoordinate fundraising efforts with head coaches and administrators of 34 varsity sports. \n•\tPlan and promote events and social functions for both select and large scale groups. \n•\tParticipate in departmental fundraising activities and encourage alumni participation. Annual Giving/Development Associate Stanford University Department of Athletics April 2000  –  February 2004  (3 years 11 months) Stanford, CA •\tMonitor and report on the success of the $3 million annual scholarship campaign. \n•\tPlan and direct agendas for quarterly board meetings with 65 directors. \n•\tCoordinate fundraising efforts with head coaches and administrators of 34 varsity sports. \n•\tPlan and promote events and social functions for both select and large scale groups. \n•\tParticipate in departmental fundraising activities and encourage alumni participation. Operations Assistant Unicon International October 1999  –  April 2000  (7 months) Operations Assistant Unicon International October 1999  –  April 2000  (7 months) Languages   Skills Event Planning Operations Management Management Microsoft Office Salesforce.com Event Management Start-ups Customer Service Microsoft Word Social Media Microsoft Excel Recruiting Strategic Planning Business Development Process Optimization Google Docs Google Analytics Infrastructure... Business Planning Business Process Design Scalability Strategic Policy... Business Strategy Procedure Development MS Office Mac OS Adobe Creative Suite 37 Signals (Basecamp) ADP Payroll Time Management Employee Management HR Policies Event Execution Small Business Budgets Team Building Employee Relations Sports Strategy Human Resources Management Consulting Business Analysis Performance Metrics Analytics CRM Sales Process See 31+     See less Skills  Event Planning Operations Management Management Microsoft Office Salesforce.com Event Management Start-ups Customer Service Microsoft Word Social Media Microsoft Excel Recruiting Strategic Planning Business Development Process Optimization Google Docs Google Analytics Infrastructure... Business Planning Business Process Design Scalability Strategic Policy... Business Strategy Procedure Development MS Office Mac OS Adobe Creative Suite 37 Signals (Basecamp) ADP Payroll Time Management Employee Management HR Policies Event Execution Small Business Budgets Team Building Employee Relations Sports Strategy Human Resources Management Consulting Business Analysis Performance Metrics Analytics CRM Sales Process See 31+     See less Event Planning Operations Management Management Microsoft Office Salesforce.com Event Management Start-ups Customer Service Microsoft Word Social Media Microsoft Excel Recruiting Strategic Planning Business Development Process Optimization Google Docs Google Analytics Infrastructure... Business Planning Business Process Design Scalability Strategic Policy... Business Strategy Procedure Development MS Office Mac OS Adobe Creative Suite 37 Signals (Basecamp) ADP Payroll Time Management Employee Management HR Policies Event Execution Small Business Budgets Team Building Employee Relations Sports Strategy Human Resources Management Consulting Business Analysis Performance Metrics Analytics CRM Sales Process See 31+     See less Event Planning Operations Management Management Microsoft Office Salesforce.com Event Management Start-ups Customer Service Microsoft Word Social Media Microsoft Excel Recruiting Strategic Planning Business Development Process Optimization Google Docs Google Analytics Infrastructure... Business Planning Business Process Design Scalability Strategic Policy... Business Strategy Procedure Development MS Office Mac OS Adobe Creative Suite 37 Signals (Basecamp) ADP Payroll Time Management Employee Management HR Policies Event Execution Small Business Budgets Team Building Employee Relations Sports Strategy Human Resources Management Consulting Business Analysis Performance Metrics Analytics CRM Sales Process See 31+     See less Education Villanova University BSBA,  Management (concentration in: International Business) 1995  – 1999 Activities and Societies:  Varsity Lacrosse ,  Phi Sigma Kappa Fraternity (Exec. Comm. Member) ,  Head Lacrosse Coach - St. Aloysius School Villanova University BSBA,  Management (concentration in: International Business) 1995  – 1999 Activities and Societies:  Varsity Lacrosse ,  Phi Sigma Kappa Fraternity (Exec. Comm. Member) ,  Head Lacrosse Coach - St. Aloysius School Villanova University BSBA,  Management (concentration in: International Business) 1995  – 1999 Activities and Societies:  Varsity Lacrosse ,  Phi Sigma Kappa Fraternity (Exec. Comm. Member) ,  Head Lacrosse Coach - St. Aloysius School Villanova University BSBA,  Management (concentration in: International Business) 1995  – 1999 Activities and Societies:  Varsity Lacrosse ,  Phi Sigma Kappa Fraternity (Exec. Comm. Member) ,  Head Lacrosse Coach - St. Aloysius School Honors & Awards ", "Experience Development Associate Stanford University Director of Client Services MadeToOrder.com 1996  –  2002  (6 years) Development Associate Stanford University Development Associate Stanford University Director of Client Services MadeToOrder.com 1996  –  2002  (6 years) Director of Client Services MadeToOrder.com 1996  –  2002  (6 years) Education UCLA Anderson School of Management MBA,  Non-Profit , Arts Management 1991  – 1993 University of California, Hastings College of the Law JD 1981  – 1984 Stanford University A.B.,  Human Biology 1976  – 1980 Marlborough School UCLA Anderson School of Management MBA,  Non-Profit , Arts Management 1991  – 1993 UCLA Anderson School of Management MBA,  Non-Profit , Arts Management 1991  – 1993 UCLA Anderson School of Management MBA,  Non-Profit , Arts Management 1991  – 1993 University of California, Hastings College of the Law JD 1981  – 1984 University of California, Hastings College of the Law JD 1981  – 1984 University of California, Hastings College of the Law JD 1981  – 1984 Stanford University A.B.,  Human Biology 1976  – 1980 Stanford University A.B.,  Human Biology 1976  – 1980 Stanford University A.B.,  Human Biology 1976  – 1980 Marlborough School Marlborough School Marlborough School "]}