{"position": "Engineer", "company": "Stanford University", "profiles": ["Experience Environmental Engineer Stanford University August 2014  – Present (1 year 1 month) Associate Environmental Engineer Stanford University March 2013  –  August 2014  (1 year 6 months) Stanford, CA Environmental Program Associate Stanford University September 2012  –  March 2013  (7 months) Environmental Quality & Water Conservation Intern Stanford University November 2011  –  August 2012  (10 months) Stanford, CA Environmental Quality and Water Conservation  \nStanford Utilities Division \nDepartment of Sustainability and Energy Management Surveyor ConserVision Consulting January 2009  –  April 2012  (3 years 4 months) Environmental Engineer Stanford University August 2014  – Present (1 year 1 month) Environmental Engineer Stanford University August 2014  – Present (1 year 1 month) Associate Environmental Engineer Stanford University March 2013  –  August 2014  (1 year 6 months) Stanford, CA Associate Environmental Engineer Stanford University March 2013  –  August 2014  (1 year 6 months) Stanford, CA Environmental Program Associate Stanford University September 2012  –  March 2013  (7 months) Environmental Program Associate Stanford University September 2012  –  March 2013  (7 months) Environmental Quality & Water Conservation Intern Stanford University November 2011  –  August 2012  (10 months) Stanford, CA Environmental Quality and Water Conservation  \nStanford Utilities Division \nDepartment of Sustainability and Energy Management Environmental Quality & Water Conservation Intern Stanford University November 2011  –  August 2012  (10 months) Stanford, CA Environmental Quality and Water Conservation  \nStanford Utilities Division \nDepartment of Sustainability and Energy Management Surveyor ConserVision Consulting January 2009  –  April 2012  (3 years 4 months) Surveyor ConserVision Consulting January 2009  –  April 2012  (3 years 4 months) Skills Sustainability Water Conservation Energy Management Environmental Awareness Environmental Policy Environmental Compliance Skills  Sustainability Water Conservation Energy Management Environmental Awareness Environmental Policy Environmental Compliance Sustainability Water Conservation Energy Management Environmental Awareness Environmental Policy Environmental Compliance Sustainability Water Conservation Energy Management Environmental Awareness Environmental Policy Environmental Compliance Education San Jose State University B.S.,  Environmental Studies 2005  – 2009 Cupertino High School 2001  – 2005 San Jose State University B.S.,  Environmental Studies 2005  – 2009 San Jose State University B.S.,  Environmental Studies 2005  – 2009 San Jose State University B.S.,  Environmental Studies 2005  – 2009 Cupertino High School 2001  – 2005 Cupertino High School 2001  – 2005 Cupertino High School 2001  – 2005 ", "Experience Principal Engineer Stanford University May 2003  – Present (12 years 4 months) Stanford Technical Architect spanning systems, network, storage Principal Engineer Stanford University May 2003  – Present (12 years 4 months) Stanford Technical Architect spanning systems, network, storage Principal Engineer Stanford University May 2003  – Present (12 years 4 months) Stanford Technical Architect spanning systems, network, storage Languages french french french Skills virtualization Storage Architecture Network Architecture Storage Scripting VMware High Availability NetApp Solaris RedHat Bash Cloud Computing Disaster Recovery Data Center Security vSphere Clustering Linux System Architecture Virtualization Unix Apache Firewalls Cisco Technologies Tomcat Xen Perl See 12+     See less Skills  virtualization Storage Architecture Network Architecture Storage Scripting VMware High Availability NetApp Solaris RedHat Bash Cloud Computing Disaster Recovery Data Center Security vSphere Clustering Linux System Architecture Virtualization Unix Apache Firewalls Cisco Technologies Tomcat Xen Perl See 12+     See less virtualization Storage Architecture Network Architecture Storage Scripting VMware High Availability NetApp Solaris RedHat Bash Cloud Computing Disaster Recovery Data Center Security vSphere Clustering Linux System Architecture Virtualization Unix Apache Firewalls Cisco Technologies Tomcat Xen Perl See 12+     See less virtualization Storage Architecture Network Architecture Storage Scripting VMware High Availability NetApp Solaris RedHat Bash Cloud Computing Disaster Recovery Data Center Security vSphere Clustering Linux System Architecture Virtualization Unix Apache Firewalls Cisco Technologies Tomcat Xen Perl See 12+     See less Education Stanford University 2008  – 2012 University of Alberta Bsc 1990  – 1994 Stanford University 2008  – 2012 Stanford University 2008  – 2012 Stanford University 2008  – 2012 University of Alberta Bsc 1990  – 1994 University of Alberta Bsc 1990  – 1994 University of Alberta Bsc 1990  – 1994 Honors & Awards vExpert 2011 VMware July 2011 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2012 VMware April 2012 Recognition of contributions to the VMware, virtualization, and cloud computing communities Stanford Technical Leadership Program Stanford University September 2012 Stanford Technical Leadership Program vExpert 2013 VMware June 2013 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2011 VMware July 2011 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2011 VMware July 2011 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2011 VMware July 2011 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2012 VMware April 2012 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2012 VMware April 2012 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2012 VMware April 2012 Recognition of contributions to the VMware, virtualization, and cloud computing communities Stanford Technical Leadership Program Stanford University September 2012 Stanford Technical Leadership Program Stanford Technical Leadership Program Stanford University September 2012 Stanford Technical Leadership Program Stanford Technical Leadership Program Stanford University September 2012 Stanford Technical Leadership Program vExpert 2013 VMware June 2013 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2013 VMware June 2013 Recognition of contributions to the VMware, virtualization, and cloud computing communities vExpert 2013 VMware June 2013 Recognition of contributions to the VMware, virtualization, and cloud computing communities ", "Experience Senior Software Engineer Stanford University January 2015  – Present (8 months) Stanford, CA Technical lead on CEDAR (med.stanford.edu/cedar.html) project. Founder Zippyrate May 2012  – Present (3 years 4 months) Research Software Engineer Stanford University 1997  –  2012  (15 years) Developed a range of open source ontology engineering tools, primarily centered around the Protege platform. \n \nAlso performed research in the areas of medical informatics, semantic web, ontologies. \n \nPublications: http://scholar.google.com/citations?user=ZScMRbwAAAAJ&hl=en Senior Software Engineer IBM September 1993  –  1997  (4 years) Senior Software Engineer Stanford University January 2015  – Present (8 months) Stanford, CA Technical lead on CEDAR (med.stanford.edu/cedar.html) project. Senior Software Engineer Stanford University January 2015  – Present (8 months) Stanford, CA Technical lead on CEDAR (med.stanford.edu/cedar.html) project. Founder Zippyrate May 2012  – Present (3 years 4 months) Founder Zippyrate May 2012  – Present (3 years 4 months) Research Software Engineer Stanford University 1997  –  2012  (15 years) Developed a range of open source ontology engineering tools, primarily centered around the Protege platform. \n \nAlso performed research in the areas of medical informatics, semantic web, ontologies. \n \nPublications: http://scholar.google.com/citations?user=ZScMRbwAAAAJ&hl=en Research Software Engineer Stanford University 1997  –  2012  (15 years) Developed a range of open source ontology engineering tools, primarily centered around the Protege platform. \n \nAlso performed research in the areas of medical informatics, semantic web, ontologies. \n \nPublications: http://scholar.google.com/citations?user=ZScMRbwAAAAJ&hl=en Senior Software Engineer IBM September 1993  –  1997  (4 years) Senior Software Engineer IBM September 1993  –  1997  (4 years) Skills Java Objective-C iOS development Ontology Engineering DSL Web Services Computer Science Semantic Web Client/server Ontologies Distributed Systems Artificial Intelligence Open Source SQL Skills  Java Objective-C iOS development Ontology Engineering DSL Web Services Computer Science Semantic Web Client/server Ontologies Distributed Systems Artificial Intelligence Open Source SQL Java Objective-C iOS development Ontology Engineering DSL Web Services Computer Science Semantic Web Client/server Ontologies Distributed Systems Artificial Intelligence Open Source SQL Java Objective-C iOS development Ontology Engineering DSL Web Services Computer Science Semantic Web Client/server Ontologies Distributed Systems Artificial Intelligence Open Source SQL Education Trinity College, Dublin B.A., M.Sc.,  Computer Science 1985  – 1993 Trinity College, Dublin B.A., M.Sc.,  Computer Science 1985  – 1993 Trinity College, Dublin B.A., M.Sc.,  Computer Science 1985  – 1993 Trinity College, Dublin B.A., M.Sc.,  Computer Science 1985  – 1993 ", "Skills Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less Skills  Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less Nanophotonics Plasmonics Nanoscale Apertures Metallic Waveguide... Metamaterials Metamaterials -... Metamaterials - Large... CMOS Sensors Image Sensors Pixel Optics Optics Matlab Physics Signal Processing Nanotechnology Numerical... Simulations Image Processing See 4+     See less ", "Skills Linux Perl Windows Oracle Operating Systems Shell Scripting Apache XML Architecture Web Applications Subversion JavaScript Unix Solaris Servers Software Development Databases MySQL Python Networking Bash SQL PHP PostgreSQL Microsoft SQL Server Integration Java Software Design Programming C C++ Data Center DNS Troubleshooting See 19+     See less Skills  Linux Perl Windows Oracle Operating Systems Shell Scripting Apache XML Architecture Web Applications Subversion JavaScript Unix Solaris Servers Software Development Databases MySQL Python Networking Bash SQL PHP PostgreSQL Microsoft SQL Server Integration Java Software Design Programming C C++ Data Center DNS Troubleshooting See 19+     See less Linux Perl Windows Oracle Operating Systems Shell Scripting Apache XML Architecture Web Applications Subversion JavaScript Unix Solaris Servers Software Development Databases MySQL Python Networking Bash SQL PHP PostgreSQL Microsoft SQL Server Integration Java Software Design Programming C C++ Data Center DNS Troubleshooting See 19+     See less Linux Perl Windows Oracle Operating Systems Shell Scripting Apache XML Architecture Web Applications Subversion JavaScript Unix Solaris Servers Software Development Databases MySQL Python Networking Bash SQL PHP PostgreSQL Microsoft SQL Server Integration Java Software Design Programming C C++ Data Center DNS Troubleshooting See 19+     See less ", "Experience Voice Network Engineer Stanford University August 2010  – Present (5 years 1 month) Network Engineer Stanford Hospital and Clinics (Dell - Perot Systems) March 2006  –  September 2010  (4 years 7 months) Voice Network Engineer Stanford University August 2010  – Present (5 years 1 month) Voice Network Engineer Stanford University August 2010  – Present (5 years 1 month) Network Engineer Stanford Hospital and Clinics (Dell - Perot Systems) March 2006  –  September 2010  (4 years 7 months) Network Engineer Stanford Hospital and Clinics (Dell - Perot Systems) March 2006  –  September 2010  (4 years 7 months) Skills Cisco IOS Cisco Technologies VoIP Network Architecture Unix Routing Wireless Networking IP Linux Network Administration Firewalls Switches Network Security Network Design System Deployment Network Engineering VPN Networking Disaster Recovery Virtualization TCP/IP Wireless Servers Troubleshooting VMware Data Center DNS Active Directory Routers VMware ESX System Administration Hardware LAN-WAN Ethernet Security CCNP BGP See 22+     See less Skills  Cisco IOS Cisco Technologies VoIP Network Architecture Unix Routing Wireless Networking IP Linux Network Administration Firewalls Switches Network Security Network Design System Deployment Network Engineering VPN Networking Disaster Recovery Virtualization TCP/IP Wireless Servers Troubleshooting VMware Data Center DNS Active Directory Routers VMware ESX System Administration Hardware LAN-WAN Ethernet Security CCNP BGP See 22+     See less Cisco IOS Cisco Technologies VoIP Network Architecture Unix Routing Wireless Networking IP Linux Network Administration Firewalls Switches Network Security Network Design System Deployment Network Engineering VPN Networking Disaster Recovery Virtualization TCP/IP Wireless Servers Troubleshooting VMware Data Center DNS Active Directory Routers VMware ESX System Administration Hardware LAN-WAN Ethernet Security CCNP BGP See 22+     See less Cisco IOS Cisco Technologies VoIP Network Architecture Unix Routing Wireless Networking IP Linux Network Administration Firewalls Switches Network Security Network Design System Deployment Network Engineering VPN Networking Disaster Recovery Virtualization TCP/IP Wireless Servers Troubleshooting VMware Data Center DNS Active Directory Routers VMware ESX System Administration Hardware LAN-WAN Ethernet Security CCNP BGP See 22+     See less Education Technical University Sofia Masters 1989  – 1994 Tehnièeski universitet Sofija Masters 1989  – 1994 Technical University Sofia Masters 1989  – 1994 Technical University Sofia Masters 1989  – 1994 Technical University Sofia Masters 1989  – 1994 Tehnièeski universitet Sofija Masters 1989  – 1994 Tehnièeski universitet Sofija Masters 1989  – 1994 Tehnièeski universitet Sofija Masters 1989  – 1994 ", "Summary Juan-Pablo is an experienced operator, investor, electrical engineer, and medical technology enthusiast. He is focused on bioelectronics, the next generation of nueromodulating medical devices. As a Partner at Action Potential Ventures (GSK's bioelectronics venture fund), Juan-Pablo invests in the companies and technologies that enable the future of targeted and adaptive bioelectronic devices.  \n \nAdditionally, Juan-Pablo is passionate about the future of mobile health technology that can deliver measurable impact to behavior change, health outcomes, and health economics (both by consumer and clinical standards). He is a believer that design and context drive engagement, that data must provide users a perpetual benefit, and that experiences must be pleasurable and habit forming to be adopted and remain relevant in a health context. Summary Juan-Pablo is an experienced operator, investor, electrical engineer, and medical technology enthusiast. He is focused on bioelectronics, the next generation of nueromodulating medical devices. As a Partner at Action Potential Ventures (GSK's bioelectronics venture fund), Juan-Pablo invests in the companies and technologies that enable the future of targeted and adaptive bioelectronic devices.  \n \nAdditionally, Juan-Pablo is passionate about the future of mobile health technology that can deliver measurable impact to behavior change, health outcomes, and health economics (both by consumer and clinical standards). He is a believer that design and context drive engagement, that data must provide users a perpetual benefit, and that experiences must be pleasurable and habit forming to be adopted and remain relevant in a health context. Juan-Pablo is an experienced operator, investor, electrical engineer, and medical technology enthusiast. He is focused on bioelectronics, the next generation of nueromodulating medical devices. As a Partner at Action Potential Ventures (GSK's bioelectronics venture fund), Juan-Pablo invests in the companies and technologies that enable the future of targeted and adaptive bioelectronic devices.  \n \nAdditionally, Juan-Pablo is passionate about the future of mobile health technology that can deliver measurable impact to behavior change, health outcomes, and health economics (both by consumer and clinical standards). He is a believer that design and context drive engagement, that data must provide users a perpetual benefit, and that experiences must be pleasurable and habit forming to be adopted and remain relevant in a health context. Juan-Pablo is an experienced operator, investor, electrical engineer, and medical technology enthusiast. He is focused on bioelectronics, the next generation of nueromodulating medical devices. As a Partner at Action Potential Ventures (GSK's bioelectronics venture fund), Juan-Pablo invests in the companies and technologies that enable the future of targeted and adaptive bioelectronic devices.  \n \nAdditionally, Juan-Pablo is passionate about the future of mobile health technology that can deliver measurable impact to behavior change, health outcomes, and health economics (both by consumer and clinical standards). He is a believer that design and context drive engagement, that data must provide users a perpetual benefit, and that experiences must be pleasurable and habit forming to be adopted and remain relevant in a health context. Experience Partner ACTION POTENTIAL VENTURE CAPITAL August 2014  – Present (1 year 1 month) Palo Alto, CA Member Board of Directors InnerCity Weightlifting (ICW) October 2011  – Present (3 years 11 months) Kendall Square, Cambridge, MA Vice President, Healthcare Investor Lightstone Ventures December 2011  –  July 2014  (2 years 8 months) Palo Alto, CA Senior Associate, Healthcare Investor Morgenthaler Ventures June 2010  –  July 2014  (4 years 2 months) Menlo Park, CA Global Marketing, Brand Strategy Eli Lilly September 2008  –  September 2009  (1 year 1 month) Indianapolis, Indiana Pipeline, Strategic Marketing & Business Development Medtronic September 2007  –  September 2008  (1 year 1 month) Santa Rosa, CA R&D Leader, Cardiovascular Division Medtronic September 2004  –  August 2008  (4 years) Boston, MA Electrophysiological Signal Processing Engineer Stanford University Hospital, Neurology Dept. June 2003  –  March 2004  (10 months) Embedded Software Engineer U.S. Department of Energy April 2002  –  August 2002  (5 months) Neural Signal Processing Engineer Stanford University, Electrical Engineering Dept. June 2001  –  August 2001  (3 months) Software Reliability Engineer Agilent Technologies, Healthcare Solutions Group June 2000  –  August 2000  (3 months) International Space Station Systems Engineer Hamilton Sundstrand June 1999  –  September 1999  (4 months) Windsor Locks, CT Mechanical Engineer Aerospace Research, University of Massachusetts, Amherst June 1998  –  September 1998  (4 months) Amherst, MA Partner ACTION POTENTIAL VENTURE CAPITAL August 2014  – Present (1 year 1 month) Palo Alto, CA Partner ACTION POTENTIAL VENTURE CAPITAL August 2014  – Present (1 year 1 month) Palo Alto, CA Member Board of Directors InnerCity Weightlifting (ICW) October 2011  – Present (3 years 11 months) Kendall Square, Cambridge, MA Member Board of Directors InnerCity Weightlifting (ICW) October 2011  – Present (3 years 11 months) Kendall Square, Cambridge, MA Vice President, Healthcare Investor Lightstone Ventures December 2011  –  July 2014  (2 years 8 months) Palo Alto, CA Vice President, Healthcare Investor Lightstone Ventures December 2011  –  July 2014  (2 years 8 months) Palo Alto, CA Senior Associate, Healthcare Investor Morgenthaler Ventures June 2010  –  July 2014  (4 years 2 months) Menlo Park, CA Senior Associate, Healthcare Investor Morgenthaler Ventures June 2010  –  July 2014  (4 years 2 months) Menlo Park, CA Global Marketing, Brand Strategy Eli Lilly September 2008  –  September 2009  (1 year 1 month) Indianapolis, Indiana Global Marketing, Brand Strategy Eli Lilly September 2008  –  September 2009  (1 year 1 month) Indianapolis, Indiana Pipeline, Strategic Marketing & Business Development Medtronic September 2007  –  September 2008  (1 year 1 month) Santa Rosa, CA Pipeline, Strategic Marketing & Business Development Medtronic September 2007  –  September 2008  (1 year 1 month) Santa Rosa, CA R&D Leader, Cardiovascular Division Medtronic September 2004  –  August 2008  (4 years) Boston, MA R&D Leader, Cardiovascular Division Medtronic September 2004  –  August 2008  (4 years) Boston, MA Electrophysiological Signal Processing Engineer Stanford University Hospital, Neurology Dept. June 2003  –  March 2004  (10 months) Electrophysiological Signal Processing Engineer Stanford University Hospital, Neurology Dept. June 2003  –  March 2004  (10 months) Embedded Software Engineer U.S. Department of Energy April 2002  –  August 2002  (5 months) Embedded Software Engineer U.S. Department of Energy April 2002  –  August 2002  (5 months) Neural Signal Processing Engineer Stanford University, Electrical Engineering Dept. June 2001  –  August 2001  (3 months) Neural Signal Processing Engineer Stanford University, Electrical Engineering Dept. June 2001  –  August 2001  (3 months) Software Reliability Engineer Agilent Technologies, Healthcare Solutions Group June 2000  –  August 2000  (3 months) Software Reliability Engineer Agilent Technologies, Healthcare Solutions Group June 2000  –  August 2000  (3 months) International Space Station Systems Engineer Hamilton Sundstrand June 1999  –  September 1999  (4 months) Windsor Locks, CT International Space Station Systems Engineer Hamilton Sundstrand June 1999  –  September 1999  (4 months) Windsor Locks, CT Mechanical Engineer Aerospace Research, University of Massachusetts, Amherst June 1998  –  September 1998  (4 months) Amherst, MA Mechanical Engineer Aerospace Research, University of Massachusetts, Amherst June 1998  –  September 1998  (4 months) Amherst, MA Languages Spanish Spanish Spanish Skills Venture Capital Product Management Start-ups Medical Devices Entrepreneurship Cross-functional Team... Product Development Business Development Mergers R&D Product Marketing Business Strategy Mergers & Acquisitions Corporate Development Marketing Strategy Private Equity Strategic Partnerships Lifesciences Financial Modeling Management Strategy Investments Executive Management See 8+     See less Skills  Venture Capital Product Management Start-ups Medical Devices Entrepreneurship Cross-functional Team... Product Development Business Development Mergers R&D Product Marketing Business Strategy Mergers & Acquisitions Corporate Development Marketing Strategy Private Equity Strategic Partnerships Lifesciences Financial Modeling Management Strategy Investments Executive Management See 8+     See less Venture Capital Product Management Start-ups Medical Devices Entrepreneurship Cross-functional Team... Product Development Business Development Mergers R&D Product Marketing Business Strategy Mergers & Acquisitions Corporate Development Marketing Strategy Private Equity Strategic Partnerships Lifesciences Financial Modeling Management Strategy Investments Executive Management See 8+     See less Venture Capital Product Management Start-ups Medical Devices Entrepreneurship Cross-functional Team... Product Development Business Development Mergers R&D Product Marketing Business Strategy Mergers & Acquisitions Corporate Development Marketing Strategy Private Equity Strategic Partnerships Lifesciences Financial Modeling Management Strategy Investments Executive Management See 8+     See less Education Stanford University Graduate School of Business MBA 2009  – 2011 Stanford University MS 2002  – 2004 University of Massachusetts, Amherst BS September 1997  – May 2001 Amherst Regional High School Stanford University Graduate School of Business MBA 2009  – 2011 Stanford University Graduate School of Business MBA 2009  – 2011 Stanford University Graduate School of Business MBA 2009  – 2011 Stanford University MS 2002  – 2004 Stanford University MS 2002  – 2004 Stanford University MS 2002  – 2004 University of Massachusetts, Amherst BS September 1997  – May 2001 University of Massachusetts, Amherst BS September 1997  – May 2001 University of Massachusetts, Amherst BS September 1997  – May 2001 Amherst Regional High School Amherst Regional High School Amherst Regional High School ", "Skills Java Software Engineering Ruby Ruby on Rails Puppet Git Skills  Java Software Engineering Ruby Ruby on Rails Puppet Git Java Software Engineering Ruby Ruby on Rails Puppet Git Java Software Engineering Ruby Ruby on Rails Puppet Git ", "Experience Software Engineer Stanford University May 2006  –  January 2012  (5 years 9 months) Developed molecular dynamics software to run on ATI (now AMD) and NVIDIA graphics processing units (GPUs) \nSupported and maintained the GPU version of Folding@Home, Senior Software Engineer Stanford University January 2006  –  January 2012  (6 years 1 month) Developed molecular dynamics software to run on ATI (now AMD) and NVIDIA graphics processing units (GPUs); the programs ran more than two orders of magnitude faster than CPU-based molecular dynamics programs. Software versions were available for Linux, Windows and Mac OSs. An extensive, automated testing framework for the programs was implemented \nSupported and maintained the GPU version of Folding@Home, a distributed computing application for folding proteins that runs worldwide on more than 70,000 GPUs  \nModified ISIM, a Grand Canonical Monte Carlo method for modeling electrolyte solutions of biomolecules, to allow for the graphical display of the results Principal Scientist Bristol-Myers Squibb January 2000  –  January 2006  (6 years 1 month) Developed processing pipeline and analysis software for proteomics data; a key element of the pipeline ran on a Linux cluster  \nDesigned and implemented framework for analyzing toxicogenomic datasets using Support Vector Machine algorithms Senior Technical Architect Bristol-Myers Squibb January 1998  –  January 2000  (2 years 1 month) Participated in the design and implementation of a three-tier intranet system for storing and retrieving tissue and blood samples to be used for genomic analysis; main contribution to the project was the database access layer and the business logic \nDesigned and developed Java/Corba/applet intranet application for registering chemical compounds and validating the registration information entered by the chemist Senior Architect Schrodinger Inc January 1997  –  January 1998  (1 year 1 month) Refactored a program that solves the Poisson-Boltzmann equation using a finite-element grid; enhancements included a large reduction in the memory requirements and computational time \nDesigned and implemented C-based architecture for molecular modeling Senior Research Investigator Bristol-Myers Squibb January 1990  –  January 1997  (7 years 1 month) Wrote a two-dimensional graphics GUI for displaying NMR experimental data using X and Motif libraries; wrote contour plotting software to minimize rendering time \nDesigned and implemented a program to fit protein NMR experimental data to a wide range of functional forms \nDesigned and developed a hierarchical database for storing protein NMR data \nParallelized a C/Fortran program for processing NMR spectral data \nImplemented a singular value decomposition algorithm for the analysis of NMR data \nEnhanced an existing scripting language used in processing and analyzing NMR data \nDeveloped algorithms that automated/semi-automated various tasks required in the analysis of protein NMR data Postdoctoral Fellow University of Illinois system January 1988  –  January 1990  (2 years 1 month) Wrote a neural network program to calculate protein structures consistent with a given a set of NMR constraints \nDeveloped a genetic algorithm for predicting the three-dimensional structure of proteins given the primary sequence and a database of structures Software Engineer Stanford University May 2006  –  January 2012  (5 years 9 months) Developed molecular dynamics software to run on ATI (now AMD) and NVIDIA graphics processing units (GPUs) \nSupported and maintained the GPU version of Folding@Home, Software Engineer Stanford University May 2006  –  January 2012  (5 years 9 months) Developed molecular dynamics software to run on ATI (now AMD) and NVIDIA graphics processing units (GPUs) \nSupported and maintained the GPU version of Folding@Home, Senior Software Engineer Stanford University January 2006  –  January 2012  (6 years 1 month) Developed molecular dynamics software to run on ATI (now AMD) and NVIDIA graphics processing units (GPUs); the programs ran more than two orders of magnitude faster than CPU-based molecular dynamics programs. Software versions were available for Linux, Windows and Mac OSs. An extensive, automated testing framework for the programs was implemented \nSupported and maintained the GPU version of Folding@Home, a distributed computing application for folding proteins that runs worldwide on more than 70,000 GPUs  \nModified ISIM, a Grand Canonical Monte Carlo method for modeling electrolyte solutions of biomolecules, to allow for the graphical display of the results Senior Software Engineer Stanford University January 2006  –  January 2012  (6 years 1 month) Developed molecular dynamics software to run on ATI (now AMD) and NVIDIA graphics processing units (GPUs); the programs ran more than two orders of magnitude faster than CPU-based molecular dynamics programs. Software versions were available for Linux, Windows and Mac OSs. An extensive, automated testing framework for the programs was implemented \nSupported and maintained the GPU version of Folding@Home, a distributed computing application for folding proteins that runs worldwide on more than 70,000 GPUs  \nModified ISIM, a Grand Canonical Monte Carlo method for modeling electrolyte solutions of biomolecules, to allow for the graphical display of the results Principal Scientist Bristol-Myers Squibb January 2000  –  January 2006  (6 years 1 month) Developed processing pipeline and analysis software for proteomics data; a key element of the pipeline ran on a Linux cluster  \nDesigned and implemented framework for analyzing toxicogenomic datasets using Support Vector Machine algorithms Principal Scientist Bristol-Myers Squibb January 2000  –  January 2006  (6 years 1 month) Developed processing pipeline and analysis software for proteomics data; a key element of the pipeline ran on a Linux cluster  \nDesigned and implemented framework for analyzing toxicogenomic datasets using Support Vector Machine algorithms Senior Technical Architect Bristol-Myers Squibb January 1998  –  January 2000  (2 years 1 month) Participated in the design and implementation of a three-tier intranet system for storing and retrieving tissue and blood samples to be used for genomic analysis; main contribution to the project was the database access layer and the business logic \nDesigned and developed Java/Corba/applet intranet application for registering chemical compounds and validating the registration information entered by the chemist Senior Technical Architect Bristol-Myers Squibb January 1998  –  January 2000  (2 years 1 month) Participated in the design and implementation of a three-tier intranet system for storing and retrieving tissue and blood samples to be used for genomic analysis; main contribution to the project was the database access layer and the business logic \nDesigned and developed Java/Corba/applet intranet application for registering chemical compounds and validating the registration information entered by the chemist Senior Architect Schrodinger Inc January 1997  –  January 1998  (1 year 1 month) Refactored a program that solves the Poisson-Boltzmann equation using a finite-element grid; enhancements included a large reduction in the memory requirements and computational time \nDesigned and implemented C-based architecture for molecular modeling Senior Architect Schrodinger Inc January 1997  –  January 1998  (1 year 1 month) Refactored a program that solves the Poisson-Boltzmann equation using a finite-element grid; enhancements included a large reduction in the memory requirements and computational time \nDesigned and implemented C-based architecture for molecular modeling Senior Research Investigator Bristol-Myers Squibb January 1990  –  January 1997  (7 years 1 month) Wrote a two-dimensional graphics GUI for displaying NMR experimental data using X and Motif libraries; wrote contour plotting software to minimize rendering time \nDesigned and implemented a program to fit protein NMR experimental data to a wide range of functional forms \nDesigned and developed a hierarchical database for storing protein NMR data \nParallelized a C/Fortran program for processing NMR spectral data \nImplemented a singular value decomposition algorithm for the analysis of NMR data \nEnhanced an existing scripting language used in processing and analyzing NMR data \nDeveloped algorithms that automated/semi-automated various tasks required in the analysis of protein NMR data Senior Research Investigator Bristol-Myers Squibb January 1990  –  January 1997  (7 years 1 month) Wrote a two-dimensional graphics GUI for displaying NMR experimental data using X and Motif libraries; wrote contour plotting software to minimize rendering time \nDesigned and implemented a program to fit protein NMR experimental data to a wide range of functional forms \nDesigned and developed a hierarchical database for storing protein NMR data \nParallelized a C/Fortran program for processing NMR spectral data \nImplemented a singular value decomposition algorithm for the analysis of NMR data \nEnhanced an existing scripting language used in processing and analyzing NMR data \nDeveloped algorithms that automated/semi-automated various tasks required in the analysis of protein NMR data Postdoctoral Fellow University of Illinois system January 1988  –  January 1990  (2 years 1 month) Wrote a neural network program to calculate protein structures consistent with a given a set of NMR constraints \nDeveloped a genetic algorithm for predicting the three-dimensional structure of proteins given the primary sequence and a database of structures Postdoctoral Fellow University of Illinois system January 1988  –  January 1990  (2 years 1 month) Wrote a neural network program to calculate protein structures consistent with a given a set of NMR constraints \nDeveloped a genetic algorithm for predicting the three-dimensional structure of proteins given the primary sequence and a database of structures Skills Java Python C++ Skills  Java Python C++ Java Python C++ Java Python C++ Education 42 M. S The University of Texas at Austin Ph.D,  Chemical Physics The University of Texas at Austin M.A,  Mathematics University of Texas B.S,  Mathematics 42 M. S 42 M. S 42 M. S The University of Texas at Austin Ph.D,  Chemical Physics The University of Texas at Austin Ph.D,  Chemical Physics The University of Texas at Austin Ph.D,  Chemical Physics The University of Texas at Austin M.A,  Mathematics The University of Texas at Austin M.A,  Mathematics The University of Texas at Austin M.A,  Mathematics University of Texas B.S,  Mathematics University of Texas B.S,  Mathematics University of Texas B.S,  Mathematics ", "Experience Software Engineer Stanford University 2013  – Present (2 years) Senior Release Engineer Stanford University 2007  –  2013  (6 years) Senior QA Engineer Stanford University 2002  –  2007  (5 years) QA Engineer Affymetrix 2001  –  2002  (1 year) QA Engineer Stanford University 2001  –  2001  (less than a year) QA Engineer Visa 2000  –  2000  (less than a year) QA Engineer Langoo 2000  –  2000  (less than a year) Software Engineer Stanford University 2013  – Present (2 years) Software Engineer Stanford University 2013  – Present (2 years) Senior Release Engineer Stanford University 2007  –  2013  (6 years) Senior Release Engineer Stanford University 2007  –  2013  (6 years) Senior QA Engineer Stanford University 2002  –  2007  (5 years) Senior QA Engineer Stanford University 2002  –  2007  (5 years) QA Engineer Affymetrix 2001  –  2002  (1 year) QA Engineer Affymetrix 2001  –  2002  (1 year) QA Engineer Stanford University 2001  –  2001  (less than a year) QA Engineer Stanford University 2001  –  2001  (less than a year) QA Engineer Visa 2000  –  2000  (less than a year) QA Engineer Visa 2000  –  2000  (less than a year) QA Engineer Langoo 2000  –  2000  (less than a year) QA Engineer Langoo 2000  –  2000  (less than a year) Skills Skills     Education Ural State University named after A.M.Gorky MS,  Mathematics 1986  – 1991 Ural State University named after A.M.Gorky MS,  Mathematics 1986  – 1991 Ural State University named after A.M.Gorky MS,  Mathematics 1986  – 1991 Ural State University named after A.M.Gorky MS,  Mathematics 1986  – 1991 ", "Summary Plant Engineer at Stanford University's Central Energy Facility.  \n \nSpecialties include engineering support for safe, reliable operation and maintenance of gas turbines, steam turbines, heat recovery steam generators, electrical systems, and plant support equipment including water treatment, hydraulics, pneumatics, and HVAC. Summary Plant Engineer at Stanford University's Central Energy Facility.  \n \nSpecialties include engineering support for safe, reliable operation and maintenance of gas turbines, steam turbines, heat recovery steam generators, electrical systems, and plant support equipment including water treatment, hydraulics, pneumatics, and HVAC. Plant Engineer at Stanford University's Central Energy Facility.  \n \nSpecialties include engineering support for safe, reliable operation and maintenance of gas turbines, steam turbines, heat recovery steam generators, electrical systems, and plant support equipment including water treatment, hydraulics, pneumatics, and HVAC. Plant Engineer at Stanford University's Central Energy Facility.  \n \nSpecialties include engineering support for safe, reliable operation and maintenance of gas turbines, steam turbines, heat recovery steam generators, electrical systems, and plant support equipment including water treatment, hydraulics, pneumatics, and HVAC. Experience Plant Engineer Stanford University January 2015  – Present (8 months) Stanford University Providing startup and commissioning engineering support and performance monitoring of Stanford's Replacement Central Energy Facility. Plant Engineer, Warranty Manager Calpine May 2012  –  January 2015  (2 years 9 months) Russell City Energy Center Built effective relationships with vendors, contractors and subcontractors to complete construction and commissioning of state-of-the-art combined cycle power plant. \n \nSupervise, plan and implement all engineering activities for power plant production equipment including planned, preventive and corrective maintenance. \n \nCoordinate with operations and maintenance departments to install, commission, monitor, and maintain all power generation equipment. \n \nAdministered and executed projects in support of over 200 warranty notices with multiple contractors and sub-contractors. Plant Engineer Calpine August 2009  –  May 2012  (2 years 10 months) Metcalf Energy Center Supervise, plan and implement all engineering activities for the gas-fired combined cycle plant. Work with operations and maintenance managers to monitor, maintain and enhance the performance of gas turbines, steam turbine and total combined plant. Manage all environmental compliance activities and reporting. Secretary ASME Santa Clara Valley Section July 2010  –  June 2011  (1 year) Silicon Valley Engineering Analyst Intern Structural Integrity May 2009  –  July 2009  (3 months) Performed heat transfer analyses of piping systems with stagnant branches. Performed aging penstock evaluations (wall thickness calculations) for a large utility company to identify areas of concern and guide physical inspection requirements. Conducted quality assurance performance monitoring reviews of completed and in-progress calculation packages. WorkPlace Resources Intern eBay June 2007  –  June 2008  (1 year 1 month) Completed benchmarking and obtained Energy Star certification on campus buildings. Implemented energy efficiency projects that reduced utility consumption. Participated in building commissioning projects and renewable energy performance evaluations. Field Service Engineer Alcatel Vacuum Products March 2001  –  June 2007  (6 years 4 months) Performed installation, maintenance and repair of vacuum pumps, high vacuum systems and helium leak detectors. Maintained accurate customer information and repair history of field service customer equipment. Served as site hazardous materials coordinator. Nuclear Power Plant Operator US Navy April 1995  –  March 2001  (6 years) Performed operation, maintenance and repair of nuclear reactor, steam power plant, and auxiliary systems including lubrication, cooling systems, air compressors, air conditioning/HVAC, water purification, and chemistry/chemical analysis. Certified quality assurance inspector, repair parts coordinator and power plant supervisor. Plant Engineer Stanford University January 2015  – Present (8 months) Stanford University Providing startup and commissioning engineering support and performance monitoring of Stanford's Replacement Central Energy Facility. Plant Engineer Stanford University January 2015  – Present (8 months) Stanford University Providing startup and commissioning engineering support and performance monitoring of Stanford's Replacement Central Energy Facility. Plant Engineer, Warranty Manager Calpine May 2012  –  January 2015  (2 years 9 months) Russell City Energy Center Built effective relationships with vendors, contractors and subcontractors to complete construction and commissioning of state-of-the-art combined cycle power plant. \n \nSupervise, plan and implement all engineering activities for power plant production equipment including planned, preventive and corrective maintenance. \n \nCoordinate with operations and maintenance departments to install, commission, monitor, and maintain all power generation equipment. \n \nAdministered and executed projects in support of over 200 warranty notices with multiple contractors and sub-contractors. Plant Engineer, Warranty Manager Calpine May 2012  –  January 2015  (2 years 9 months) Russell City Energy Center Built effective relationships with vendors, contractors and subcontractors to complete construction and commissioning of state-of-the-art combined cycle power plant. \n \nSupervise, plan and implement all engineering activities for power plant production equipment including planned, preventive and corrective maintenance. \n \nCoordinate with operations and maintenance departments to install, commission, monitor, and maintain all power generation equipment. \n \nAdministered and executed projects in support of over 200 warranty notices with multiple contractors and sub-contractors. Plant Engineer Calpine August 2009  –  May 2012  (2 years 10 months) Metcalf Energy Center Supervise, plan and implement all engineering activities for the gas-fired combined cycle plant. Work with operations and maintenance managers to monitor, maintain and enhance the performance of gas turbines, steam turbine and total combined plant. Manage all environmental compliance activities and reporting. Plant Engineer Calpine August 2009  –  May 2012  (2 years 10 months) Metcalf Energy Center Supervise, plan and implement all engineering activities for the gas-fired combined cycle plant. Work with operations and maintenance managers to monitor, maintain and enhance the performance of gas turbines, steam turbine and total combined plant. Manage all environmental compliance activities and reporting. Secretary ASME Santa Clara Valley Section July 2010  –  June 2011  (1 year) Silicon Valley Secretary ASME Santa Clara Valley Section July 2010  –  June 2011  (1 year) Silicon Valley Engineering Analyst Intern Structural Integrity May 2009  –  July 2009  (3 months) Performed heat transfer analyses of piping systems with stagnant branches. Performed aging penstock evaluations (wall thickness calculations) for a large utility company to identify areas of concern and guide physical inspection requirements. Conducted quality assurance performance monitoring reviews of completed and in-progress calculation packages. Engineering Analyst Intern Structural Integrity May 2009  –  July 2009  (3 months) Performed heat transfer analyses of piping systems with stagnant branches. Performed aging penstock evaluations (wall thickness calculations) for a large utility company to identify areas of concern and guide physical inspection requirements. Conducted quality assurance performance monitoring reviews of completed and in-progress calculation packages. WorkPlace Resources Intern eBay June 2007  –  June 2008  (1 year 1 month) Completed benchmarking and obtained Energy Star certification on campus buildings. Implemented energy efficiency projects that reduced utility consumption. Participated in building commissioning projects and renewable energy performance evaluations. WorkPlace Resources Intern eBay June 2007  –  June 2008  (1 year 1 month) Completed benchmarking and obtained Energy Star certification on campus buildings. Implemented energy efficiency projects that reduced utility consumption. Participated in building commissioning projects and renewable energy performance evaluations. Field Service Engineer Alcatel Vacuum Products March 2001  –  June 2007  (6 years 4 months) Performed installation, maintenance and repair of vacuum pumps, high vacuum systems and helium leak detectors. Maintained accurate customer information and repair history of field service customer equipment. Served as site hazardous materials coordinator. Field Service Engineer Alcatel Vacuum Products March 2001  –  June 2007  (6 years 4 months) Performed installation, maintenance and repair of vacuum pumps, high vacuum systems and helium leak detectors. Maintained accurate customer information and repair history of field service customer equipment. Served as site hazardous materials coordinator. Nuclear Power Plant Operator US Navy April 1995  –  March 2001  (6 years) Performed operation, maintenance and repair of nuclear reactor, steam power plant, and auxiliary systems including lubrication, cooling systems, air compressors, air conditioning/HVAC, water purification, and chemistry/chemical analysis. Certified quality assurance inspector, repair parts coordinator and power plant supervisor. Nuclear Power Plant Operator US Navy April 1995  –  March 2001  (6 years) Performed operation, maintenance and repair of nuclear reactor, steam power plant, and auxiliary systems including lubrication, cooling systems, air compressors, air conditioning/HVAC, water purification, and chemistry/chemical analysis. Certified quality assurance inspector, repair parts coordinator and power plant supervisor. Skills Power Generation Power Plants Engineering Energy Gas Turbines Steam Turbines Commissioning Microsoft Office Microsoft Excel Planned Preventative... Process Control Steam Piping Reliability Engineering Renewable Energy Energy Management Project Engineering Factory Inspection Maintenance & Repair Maintenance Planning Maximo Newforma InfoWorks Documentum Navisworks PlanGrid Revit See 13+     See less Skills  Power Generation Power Plants Engineering Energy Gas Turbines Steam Turbines Commissioning Microsoft Office Microsoft Excel Planned Preventative... Process Control Steam Piping Reliability Engineering Renewable Energy Energy Management Project Engineering Factory Inspection Maintenance & Repair Maintenance Planning Maximo Newforma InfoWorks Documentum Navisworks PlanGrid Revit See 13+     See less Power Generation Power Plants Engineering Energy Gas Turbines Steam Turbines Commissioning Microsoft Office Microsoft Excel Planned Preventative... Process Control Steam Piping Reliability Engineering Renewable Energy Energy Management Project Engineering Factory Inspection Maintenance & Repair Maintenance Planning Maximo Newforma InfoWorks Documentum Navisworks PlanGrid Revit See 13+     See less Power Generation Power Plants Engineering Energy Gas Turbines Steam Turbines Commissioning Microsoft Office Microsoft Excel Planned Preventative... Process Control Steam Piping Reliability Engineering Renewable Energy Energy Management Project Engineering Factory Inspection Maintenance & Repair Maintenance Planning Maximo Newforma InfoWorks Documentum Navisworks PlanGrid Revit See 13+     See less Education San Jose State University Master of Science (M.S.),  Systems Engineering 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Master of Business Administration (MBA) 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2009 Activities and Societies:  Tau Beta Pi Engineering Honor Society ,  Pi Tau Sigma Mechanical Engineering Honor Society ,  ASME ,  AFE San Jose State University Master of Science (M.S.),  Systems Engineering 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Master of Science (M.S.),  Systems Engineering 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Master of Science (M.S.),  Systems Engineering 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Master of Business Administration (MBA) 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Master of Business Administration (MBA) 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Master of Business Administration (MBA) 2010  – 2012 Activities and Societies:  Cohort 17 San Jose State University Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2009 Activities and Societies:  Tau Beta Pi Engineering Honor Society ,  Pi Tau Sigma Mechanical Engineering Honor Society ,  ASME ,  AFE San Jose State University Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2009 Activities and Societies:  Tau Beta Pi Engineering Honor Society ,  Pi Tau Sigma Mechanical Engineering Honor Society ,  ASME ,  AFE San Jose State University Bachelor of Science (B.S.),  Mechanical Engineering 2006  – 2009 Activities and Societies:  Tau Beta Pi Engineering Honor Society ,  Pi Tau Sigma Mechanical Engineering Honor Society ,  ASME ,  AFE Honors & Awards Additional Honors & Awards Dean's Scholar, San Jose State University (2008, 2009) \nTau Beta Pi Scholarship Recipient (2008) \nASME Scholarship Recipient (2008) \nNavy Achievement Award (1999) Additional Honors & Awards Dean's Scholar, San Jose State University (2008, 2009) \nTau Beta Pi Scholarship Recipient (2008) \nASME Scholarship Recipient (2008) \nNavy Achievement Award (1999) Additional Honors & Awards Dean's Scholar, San Jose State University (2008, 2009) \nTau Beta Pi Scholarship Recipient (2008) \nASME Scholarship Recipient (2008) \nNavy Achievement Award (1999) Additional Honors & Awards Dean's Scholar, San Jose State University (2008, 2009) \nTau Beta Pi Scholarship Recipient (2008) \nASME Scholarship Recipient (2008) \nNavy Achievement Award (1999) ", "Skills Biomedical Engineering Image Processing Matlab Simulations Algorithms Image Analysis Characterization Physics Medical Imaging Optics R&D LaTeX C++ Positron Emission... Compton Camera Compressed Sensing See 1+     See less Skills  Biomedical Engineering Image Processing Matlab Simulations Algorithms Image Analysis Characterization Physics Medical Imaging Optics R&D LaTeX C++ Positron Emission... Compton Camera Compressed Sensing See 1+     See less Biomedical Engineering Image Processing Matlab Simulations Algorithms Image Analysis Characterization Physics Medical Imaging Optics R&D LaTeX C++ Positron Emission... Compton Camera Compressed Sensing See 1+     See less Biomedical Engineering Image Processing Matlab Simulations Algorithms Image Analysis Characterization Physics Medical Imaging Optics R&D LaTeX C++ Positron Emission... Compton Camera Compressed Sensing See 1+     See less ", "Skills Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less Skills  Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less ", "Skills Cisco Cisco IOS Cisco NX-OS Network Security Network Design Wireless Networking Wireshark Mac OS X STP RSTP Brocade Juniper EIGRP OSPF Nmap NAT PAT IDS IPS Viso OmniGraffle Linux Cisco Technologies LDAP Windows See 10+     See less Skills  Cisco Cisco IOS Cisco NX-OS Network Security Network Design Wireless Networking Wireshark Mac OS X STP RSTP Brocade Juniper EIGRP OSPF Nmap NAT PAT IDS IPS Viso OmniGraffle Linux Cisco Technologies LDAP Windows See 10+     See less Cisco Cisco IOS Cisco NX-OS Network Security Network Design Wireless Networking Wireshark Mac OS X STP RSTP Brocade Juniper EIGRP OSPF Nmap NAT PAT IDS IPS Viso OmniGraffle Linux Cisco Technologies LDAP Windows See 10+     See less Cisco Cisco IOS Cisco NX-OS Network Security Network Design Wireless Networking Wireshark Mac OS X STP RSTP Brocade Juniper EIGRP OSPF Nmap NAT PAT IDS IPS Viso OmniGraffle Linux Cisco Technologies LDAP Windows See 10+     See less ", "Summary My name is Ahmed AlSum, currently I'm a web archiving engineer at Stanford University Library. I'm responsible of the techncial activitiies of the Web Archiving initiative at Stanford University. I've Phd in computer sciece from Old Dominion University, specialized in web archiving. My research interests are information retrieval and web sciences in the web archiving environment. Before that I was a staff software engineer in Cairo technology development center, IBM Egypt. My experience is a mix from academic experience in computer science and professional experience in IT industry. \n \nThe complete resume is available on this link:  \nhttp://stanford.edu/~aalsum/Ahmed%20ALSUM%20cv.pdf Summary My name is Ahmed AlSum, currently I'm a web archiving engineer at Stanford University Library. I'm responsible of the techncial activitiies of the Web Archiving initiative at Stanford University. I've Phd in computer sciece from Old Dominion University, specialized in web archiving. My research interests are information retrieval and web sciences in the web archiving environment. Before that I was a staff software engineer in Cairo technology development center, IBM Egypt. My experience is a mix from academic experience in computer science and professional experience in IT industry. \n \nThe complete resume is available on this link:  \nhttp://stanford.edu/~aalsum/Ahmed%20ALSUM%20cv.pdf My name is Ahmed AlSum, currently I'm a web archiving engineer at Stanford University Library. I'm responsible of the techncial activitiies of the Web Archiving initiative at Stanford University. I've Phd in computer sciece from Old Dominion University, specialized in web archiving. My research interests are information retrieval and web sciences in the web archiving environment. Before that I was a staff software engineer in Cairo technology development center, IBM Egypt. My experience is a mix from academic experience in computer science and professional experience in IT industry. \n \nThe complete resume is available on this link:  \nhttp://stanford.edu/~aalsum/Ahmed%20ALSUM%20cv.pdf My name is Ahmed AlSum, currently I'm a web archiving engineer at Stanford University Library. I'm responsible of the techncial activitiies of the Web Archiving initiative at Stanford University. I've Phd in computer sciece from Old Dominion University, specialized in web archiving. My research interests are information retrieval and web sciences in the web archiving environment. Before that I was a staff software engineer in Cairo technology development center, IBM Egypt. My experience is a mix from academic experience in computer science and professional experience in IT industry. \n \nThe complete resume is available on this link:  \nhttp://stanford.edu/~aalsum/Ahmed%20ALSUM%20cv.pdf Experience Web Archiving Engineer Stanford University March 2014  – Present (1 year 6 months) Stanford, California - Leading the technical activities to develop and operate web archiving service at Stanford University \nLibraries. \n- Reconstructing the first web site in North America back to 1991. \n- Build end-to-end infrastructure to crawl, preserve, index, and replay the web archiving \nmaterial (https://swap.stanford.edu). \n Research Assistant - PhD Candidate Old Dominion University August 2009  –  February 2014  (4 years 7 months) Norfolk, Virginia Area PhD candidate in Computer Science, specialized in Web Science and Digital Library. Software Engineer Intern Internet Archive January 2012  –  June 2012  (6 months) San Francisco Bay Area Contributing a new Web Archiving Meta-data extraction technique using Hadoop and MapReduce on a cluster environment on +700TB of data. Staff Software Engineer IBM March 2006  –  July 2009  (3 years 5 months) Cairo, Egypt Software Developer ITSoft, Cairo September 2005  –  February 2006  (6 months) Teaching assistant Mansoura University March 2004  –  September 2005  (1 year 7 months) Web Archiving Engineer Stanford University March 2014  – Present (1 year 6 months) Stanford, California - Leading the technical activities to develop and operate web archiving service at Stanford University \nLibraries. \n- Reconstructing the first web site in North America back to 1991. \n- Build end-to-end infrastructure to crawl, preserve, index, and replay the web archiving \nmaterial (https://swap.stanford.edu). \n Web Archiving Engineer Stanford University March 2014  – Present (1 year 6 months) Stanford, California - Leading the technical activities to develop and operate web archiving service at Stanford University \nLibraries. \n- Reconstructing the first web site in North America back to 1991. \n- Build end-to-end infrastructure to crawl, preserve, index, and replay the web archiving \nmaterial (https://swap.stanford.edu). \n Research Assistant - PhD Candidate Old Dominion University August 2009  –  February 2014  (4 years 7 months) Norfolk, Virginia Area PhD candidate in Computer Science, specialized in Web Science and Digital Library. Research Assistant - PhD Candidate Old Dominion University August 2009  –  February 2014  (4 years 7 months) Norfolk, Virginia Area PhD candidate in Computer Science, specialized in Web Science and Digital Library. Software Engineer Intern Internet Archive January 2012  –  June 2012  (6 months) San Francisco Bay Area Contributing a new Web Archiving Meta-data extraction technique using Hadoop and MapReduce on a cluster environment on +700TB of data. Software Engineer Intern Internet Archive January 2012  –  June 2012  (6 months) San Francisco Bay Area Contributing a new Web Archiving Meta-data extraction technique using Hadoop and MapReduce on a cluster environment on +700TB of data. Staff Software Engineer IBM March 2006  –  July 2009  (3 years 5 months) Cairo, Egypt Staff Software Engineer IBM March 2006  –  July 2009  (3 years 5 months) Cairo, Egypt Software Developer ITSoft, Cairo September 2005  –  February 2006  (6 months) Software Developer ITSoft, Cairo September 2005  –  February 2006  (6 months) Teaching assistant Mansoura University March 2004  –  September 2005  (1 year 7 months) Teaching assistant Mansoura University March 2004  –  September 2005  (1 year 7 months) Languages English Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency Arabic Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Java C++ WebSphere Portal... WebSphere Portal... MapReduce Hadoop Linux MySQL WebSphere Portal Python JavaScript Distributed Systems Software Engineering DB2 Cassandra Information Retrieval R Eclipse Algorithms Programming Web Services UML C# XML Databases Visual Studio Design Patterns AJAX SQL Distributed Architecture REST Web Development Large Scale Systems Digital Archiving Java Enterprise Edition Scalability PHP Software Design Machine Learning Perl Research OOP Object Oriented Design JSP See 29+     See less Skills  Java C++ WebSphere Portal... WebSphere Portal... MapReduce Hadoop Linux MySQL WebSphere Portal Python JavaScript Distributed Systems Software Engineering DB2 Cassandra Information Retrieval R Eclipse Algorithms Programming Web Services UML C# XML Databases Visual Studio Design Patterns AJAX SQL Distributed Architecture REST Web Development Large Scale Systems Digital Archiving Java Enterprise Edition Scalability PHP Software Design Machine Learning Perl Research OOP Object Oriented Design JSP See 29+     See less Java C++ WebSphere Portal... WebSphere Portal... MapReduce Hadoop Linux MySQL WebSphere Portal Python JavaScript Distributed Systems Software Engineering DB2 Cassandra Information Retrieval R Eclipse Algorithms Programming Web Services UML C# XML Databases Visual Studio Design Patterns AJAX SQL Distributed Architecture REST Web Development Large Scale Systems Digital Archiving Java Enterprise Edition Scalability PHP Software Design Machine Learning Perl Research OOP Object Oriented Design JSP See 29+     See less Java C++ WebSphere Portal... WebSphere Portal... MapReduce Hadoop Linux MySQL WebSphere Portal Python JavaScript Distributed Systems Software Engineering DB2 Cassandra Information Retrieval R Eclipse Algorithms Programming Web Services UML C# XML Databases Visual Studio Design Patterns AJAX SQL Distributed Architecture REST Web Development Large Scale Systems Digital Archiving Java Enterprise Edition Scalability PHP Software Design Machine Learning Perl Research OOP Object Oriented Design JSP See 29+     See less Education Old Dominion University PhD,  Computer Science , 4.0 2009  – 2014 Dissertation: A Services Framework for Tighter Integration of the Past and Present Web. \nAdvisor: Dr. Michael Nelson Arab Academy for Science and Technology MSc,  Computer Science , 3.89 2004  – 2009 Thesis: Application-Specific Dynamic Policy Rules for Mobile Execution Environment. Mansoura University BSc,  Computer Science 1999  – 2003 Old Dominion University PhD,  Computer Science , 4.0 2009  – 2014 Dissertation: A Services Framework for Tighter Integration of the Past and Present Web. \nAdvisor: Dr. Michael Nelson Old Dominion University PhD,  Computer Science , 4.0 2009  – 2014 Dissertation: A Services Framework for Tighter Integration of the Past and Present Web. \nAdvisor: Dr. Michael Nelson Old Dominion University PhD,  Computer Science , 4.0 2009  – 2014 Dissertation: A Services Framework for Tighter Integration of the Past and Present Web. \nAdvisor: Dr. Michael Nelson Arab Academy for Science and Technology MSc,  Computer Science , 3.89 2004  – 2009 Thesis: Application-Specific Dynamic Policy Rules for Mobile Execution Environment. Arab Academy for Science and Technology MSc,  Computer Science , 3.89 2004  – 2009 Thesis: Application-Specific Dynamic Policy Rules for Mobile Execution Environment. Arab Academy for Science and Technology MSc,  Computer Science , 3.89 2004  – 2009 Thesis: Application-Specific Dynamic Policy Rules for Mobile Execution Environment. Mansoura University BSc,  Computer Science 1999  – 2003 Mansoura University BSc,  Computer Science 1999  – 2003 Mansoura University BSc,  Computer Science 1999  – 2003 ", "Experience Power Systems Engineer Stanford University April 2000  – Present (15 years 5 months) Staff Electrical Engineer Stanford University April 2000  – Present (15 years 5 months) Power Systems Engineer Stanford University April 2000  – Present (15 years 5 months) Power Systems Engineer Stanford University April 2000  – Present (15 years 5 months) Staff Electrical Engineer Stanford University April 2000  – Present (15 years 5 months) Staff Electrical Engineer Stanford University April 2000  – Present (15 years 5 months) Skills Electrical Engineering Medium & Low Volt ... Skills  Electrical Engineering Medium & Low Volt ... Electrical Engineering Medium & Low Volt ... Electrical Engineering Medium & Low Volt ... Education California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering Activities and Societies:  Registered Electrical Engineer in State of California California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering Activities and Societies:  Registered Electrical Engineer in State of California California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering Activities and Societies:  Registered Electrical Engineer in State of California California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering Activities and Societies:  Registered Electrical Engineer in State of California ", "Experience Mechanical Engineer Stanford University May 2015  – Present (4 months) Stanford, CA • Provide mechanical engineering support for Control Systems Network Security project \n• Work with business owners to gather detailed control system inventory and requirements \n• Work with business owners to implement security plan and migrate devices to new networks \n Facilities Engineer Stanford University June 2011  –  April 2015  (3 years 11 months) Stanford, CA • Coordinate and document new maintenance programs and initiatives for the Stanford HVAC, Plumbing, & Electric shops \n• Support upper management by communicating key maintenance priorities to trade shop technicians and engineering team \n• Established key performance indicators (KPI) report for Preventive Maintenance (PM) program and chair monthly performance review meetings \n• Identified and hired facilities consulting firm to provide third party review of PM program and processes \n• Created and managed ongoing facilities evaluation program that assesses main building systems \n• Coordinate shop efforts for uploading new maintainable assets into central asset database. \n• Implement process improvements to the Preventive Maintenance program \n• Supervised summer intern during the creation of a new macro used for budgeting purposes Engineering Technician MediaMation, Inc. September 2010  –  June 2011  (10 months) Torrance, CA Create installation drawings and wiring diagrams using AutoCAD \nAssemble and test control rack components and motion bases for product delivery Intern - Reliability & Maitainability Northrop Grumman Aerospace Systems June 2009  –  August 2009  (3 months) Managed a material callout record for repair procedures in Cost Analysis project for Low Observable (LO) panels and doors on the Joint Strike Fighter (JSF) program Intern - Thermal Test Northrop Grumman Aerospace Systems June 2008  –  August 2008  (3 months) • Coauthored thermal vacuum bakeout test procedure used for non-flight hardware \n• Developed VBA program & templates to organize and manage bakeout test data for all non-flight bakeout tests; exceeded manager’s expectations by including automation, saving technicians’ time \n• Created PowerPoint presentation and training materials for the created Bakeout Process \n• Trained engineers and lead technicians how to use the program for data collection and retrieval Intern - Thermal Test Northrop Grumman Aerospace Systems June 2007  –  August 2007  (3 months) • Authored standard operating procedure document defining detailed procedures to be used for all thermal vacuum bakeouts performed in Test and Measurement Services  \n• Wrote governing test procedure for investigating the performance of a new thermal interface material Mechanical Engineer Stanford University May 2015  – Present (4 months) Stanford, CA • Provide mechanical engineering support for Control Systems Network Security project \n• Work with business owners to gather detailed control system inventory and requirements \n• Work with business owners to implement security plan and migrate devices to new networks \n Mechanical Engineer Stanford University May 2015  – Present (4 months) Stanford, CA • Provide mechanical engineering support for Control Systems Network Security project \n• Work with business owners to gather detailed control system inventory and requirements \n• Work with business owners to implement security plan and migrate devices to new networks \n Facilities Engineer Stanford University June 2011  –  April 2015  (3 years 11 months) Stanford, CA • Coordinate and document new maintenance programs and initiatives for the Stanford HVAC, Plumbing, & Electric shops \n• Support upper management by communicating key maintenance priorities to trade shop technicians and engineering team \n• Established key performance indicators (KPI) report for Preventive Maintenance (PM) program and chair monthly performance review meetings \n• Identified and hired facilities consulting firm to provide third party review of PM program and processes \n• Created and managed ongoing facilities evaluation program that assesses main building systems \n• Coordinate shop efforts for uploading new maintainable assets into central asset database. \n• Implement process improvements to the Preventive Maintenance program \n• Supervised summer intern during the creation of a new macro used for budgeting purposes Facilities Engineer Stanford University June 2011  –  April 2015  (3 years 11 months) Stanford, CA • Coordinate and document new maintenance programs and initiatives for the Stanford HVAC, Plumbing, & Electric shops \n• Support upper management by communicating key maintenance priorities to trade shop technicians and engineering team \n• Established key performance indicators (KPI) report for Preventive Maintenance (PM) program and chair monthly performance review meetings \n• Identified and hired facilities consulting firm to provide third party review of PM program and processes \n• Created and managed ongoing facilities evaluation program that assesses main building systems \n• Coordinate shop efforts for uploading new maintainable assets into central asset database. \n• Implement process improvements to the Preventive Maintenance program \n• Supervised summer intern during the creation of a new macro used for budgeting purposes Engineering Technician MediaMation, Inc. September 2010  –  June 2011  (10 months) Torrance, CA Create installation drawings and wiring diagrams using AutoCAD \nAssemble and test control rack components and motion bases for product delivery Engineering Technician MediaMation, Inc. September 2010  –  June 2011  (10 months) Torrance, CA Create installation drawings and wiring diagrams using AutoCAD \nAssemble and test control rack components and motion bases for product delivery Intern - Reliability & Maitainability Northrop Grumman Aerospace Systems June 2009  –  August 2009  (3 months) Managed a material callout record for repair procedures in Cost Analysis project for Low Observable (LO) panels and doors on the Joint Strike Fighter (JSF) program Intern - Reliability & Maitainability Northrop Grumman Aerospace Systems June 2009  –  August 2009  (3 months) Managed a material callout record for repair procedures in Cost Analysis project for Low Observable (LO) panels and doors on the Joint Strike Fighter (JSF) program Intern - Thermal Test Northrop Grumman Aerospace Systems June 2008  –  August 2008  (3 months) • Coauthored thermal vacuum bakeout test procedure used for non-flight hardware \n• Developed VBA program & templates to organize and manage bakeout test data for all non-flight bakeout tests; exceeded manager’s expectations by including automation, saving technicians’ time \n• Created PowerPoint presentation and training materials for the created Bakeout Process \n• Trained engineers and lead technicians how to use the program for data collection and retrieval Intern - Thermal Test Northrop Grumman Aerospace Systems June 2008  –  August 2008  (3 months) • Coauthored thermal vacuum bakeout test procedure used for non-flight hardware \n• Developed VBA program & templates to organize and manage bakeout test data for all non-flight bakeout tests; exceeded manager’s expectations by including automation, saving technicians’ time \n• Created PowerPoint presentation and training materials for the created Bakeout Process \n• Trained engineers and lead technicians how to use the program for data collection and retrieval Intern - Thermal Test Northrop Grumman Aerospace Systems June 2007  –  August 2007  (3 months) • Authored standard operating procedure document defining detailed procedures to be used for all thermal vacuum bakeouts performed in Test and Measurement Services  \n• Wrote governing test procedure for investigating the performance of a new thermal interface material Intern - Thermal Test Northrop Grumman Aerospace Systems June 2007  –  August 2007  (3 months) • Authored standard operating procedure document defining detailed procedures to be used for all thermal vacuum bakeouts performed in Test and Measurement Services  \n• Wrote governing test procedure for investigating the performance of a new thermal interface material Skills Matlab Simulink Nonlinear Control... Dynamics Vibration Control COMSOL Solidworks AutoCAD NI LabVIEW Visual Basic Finite Element Analysis Skills  Matlab Simulink Nonlinear Control... Dynamics Vibration Control COMSOL Solidworks AutoCAD NI LabVIEW Visual Basic Finite Element Analysis Matlab Simulink Nonlinear Control... Dynamics Vibration Control COMSOL Solidworks AutoCAD NI LabVIEW Visual Basic Finite Element Analysis Matlab Simulink Nonlinear Control... Dynamics Vibration Control COMSOL Solidworks AutoCAD NI LabVIEW Visual Basic Finite Element Analysis Education University of Southern California Master of Science (MS),  Mechanical Engineering - Dynamics & Controls 2011  – 2015 University of California, Berkeley BS,  Mechanical Engineering 2006  – 2010 Activities and Societies:  ASME ,  InterVarsity Christian Fellowship University of Southern California Master of Science (MS),  Mechanical Engineering - Dynamics & Controls 2011  – 2015 University of Southern California Master of Science (MS),  Mechanical Engineering - Dynamics & Controls 2011  – 2015 University of Southern California Master of Science (MS),  Mechanical Engineering - Dynamics & Controls 2011  – 2015 University of California, Berkeley BS,  Mechanical Engineering 2006  – 2010 Activities and Societies:  ASME ,  InterVarsity Christian Fellowship University of California, Berkeley BS,  Mechanical Engineering 2006  – 2010 Activities and Societies:  ASME ,  InterVarsity Christian Fellowship University of California, Berkeley BS,  Mechanical Engineering 2006  – 2010 Activities and Societies:  ASME ,  InterVarsity Christian Fellowship ", "Summary •\t17 years JAVA working experience and full lifecycle software development experience. \n•\tSolid expertise in troubleshooting, problem solving, and programming. \n•\tSelf-motivated, result-oriented, independent, and excellent team player.  \n•\tExperienced in Agile development, test driven design. Summary •\t17 years JAVA working experience and full lifecycle software development experience. \n•\tSolid expertise in troubleshooting, problem solving, and programming. \n•\tSelf-motivated, result-oriented, independent, and excellent team player.  \n•\tExperienced in Agile development, test driven design. •\t17 years JAVA working experience and full lifecycle software development experience. \n•\tSolid expertise in troubleshooting, problem solving, and programming. \n•\tSelf-motivated, result-oriented, independent, and excellent team player.  \n•\tExperienced in Agile development, test driven design. •\t17 years JAVA working experience and full lifecycle software development experience. \n•\tSolid expertise in troubleshooting, problem solving, and programming. \n•\tSelf-motivated, result-oriented, independent, and excellent team player.  \n•\tExperienced in Agile development, test driven design. Experience Sr Software Engineer Stanford University, Admintrative Systems September 2014  – Present (1 year) Stanford, CA Sr. Automation Engineer HyTrust September 2013  –  September 2014  (1 year 1 month) Lead REST API development  \nLead Automation Framework Sr. Application Engineer Stanford University, School of Medicine May 2008  –  August 2013  (5 years 4 months) Stanford, CA Lead Software Engineer Community Academic Profiles (CAP) Sr. Software Engineer Stanford University February 2002  –  May 2008  (6 years 4 months) Administrative Systems Sr. Software Engineer Electron Economy May 2000  –  June 2001  (1 year 2 months) Member of Architecture team that designed and developed the intelligent agent-based infrastructure for the company’s supply chain transaction management engine. Software Engineer Sun Microsystems January 1997  –  June 2000  (3 years 6 months) Sr Software Engineer Stanford University, Admintrative Systems September 2014  – Present (1 year) Stanford, CA Sr Software Engineer Stanford University, Admintrative Systems September 2014  – Present (1 year) Stanford, CA Sr. Automation Engineer HyTrust September 2013  –  September 2014  (1 year 1 month) Lead REST API development  \nLead Automation Framework Sr. Automation Engineer HyTrust September 2013  –  September 2014  (1 year 1 month) Lead REST API development  \nLead Automation Framework Sr. Application Engineer Stanford University, School of Medicine May 2008  –  August 2013  (5 years 4 months) Stanford, CA Lead Software Engineer Community Academic Profiles (CAP) Sr. Application Engineer Stanford University, School of Medicine May 2008  –  August 2013  (5 years 4 months) Stanford, CA Lead Software Engineer Community Academic Profiles (CAP) Sr. Software Engineer Stanford University February 2002  –  May 2008  (6 years 4 months) Administrative Systems Sr. Software Engineer Stanford University February 2002  –  May 2008  (6 years 4 months) Administrative Systems Sr. Software Engineer Electron Economy May 2000  –  June 2001  (1 year 2 months) Member of Architecture team that designed and developed the intelligent agent-based infrastructure for the company’s supply chain transaction management engine. Sr. Software Engineer Electron Economy May 2000  –  June 2001  (1 year 2 months) Member of Architecture team that designed and developed the intelligent agent-based infrastructure for the company’s supply chain transaction management engine. Software Engineer Sun Microsystems January 1997  –  June 2000  (3 years 6 months) Software Engineer Sun Microsystems January 1997  –  June 2000  (3 years 6 months) Skills Java J2EE JavaScript Web Applications JSP Hibernate System Architecture Unix Distributed Systems Object Oriented Design Software Engineering Tomcat Ruby Spring Servlets Continuous Integration HTML Java Enterprise Edition Databases JDBC REST Agile Methodologies Programming SDLC Test Driven Development Perl See 11+     See less Skills  Java J2EE JavaScript Web Applications JSP Hibernate System Architecture Unix Distributed Systems Object Oriented Design Software Engineering Tomcat Ruby Spring Servlets Continuous Integration HTML Java Enterprise Edition Databases JDBC REST Agile Methodologies Programming SDLC Test Driven Development Perl See 11+     See less Java J2EE JavaScript Web Applications JSP Hibernate System Architecture Unix Distributed Systems Object Oriented Design Software Engineering Tomcat Ruby Spring Servlets Continuous Integration HTML Java Enterprise Edition Databases JDBC REST Agile Methodologies Programming SDLC Test Driven Development Perl See 11+     See less Java J2EE JavaScript Web Applications JSP Hibernate System Architecture Unix Distributed Systems Object Oriented Design Software Engineering Tomcat Ruby Spring Servlets Continuous Integration HTML Java Enterprise Edition Databases JDBC REST Agile Methodologies Programming SDLC Test Driven Development Perl See 11+     See less Education San Jose State University M.Sc.,  Computer Engineer 1995  – 1996 San Jose State University M.Sc.,  Computer Engineer 1995  – 1996 San Jose State University M.Sc.,  Computer Engineer 1995  – 1996 San Jose State University M.Sc.,  Computer Engineer 1995  – 1996 ", "Languages C# Professional working proficiency Java Professional working proficiency C# Professional working proficiency Java Professional working proficiency C# Professional working proficiency Java Professional working proficiency Professional working proficiency Professional working proficiency Skills SQL Agile Methodologies Java Business Analysis Unix Oracle Microsoft SQL Server .NET XML Software Project... Databases Software Development SDLC PL/SQL Skills  SQL Agile Methodologies Java Business Analysis Unix Oracle Microsoft SQL Server .NET XML Software Project... Databases Software Development SDLC PL/SQL SQL Agile Methodologies Java Business Analysis Unix Oracle Microsoft SQL Server .NET XML Software Project... Databases Software Development SDLC PL/SQL SQL Agile Methodologies Java Business Analysis Unix Oracle Microsoft SQL Server .NET XML Software Project... Databases Software Development SDLC PL/SQL "]}