{"position": "Engineering Manager", "company": "Stanford University", "profiles": ["Summary Managed software development on successful projects for over 10 years, including frontend, backend, desktop, and mobile systems. Led local, distributed, and offshore teams of up to 30 engineers. Summary Managed software development on successful projects for over 10 years, including frontend, backend, desktop, and mobile systems. Led local, distributed, and offshore teams of up to 30 engineers. Managed software development on successful projects for over 10 years, including frontend, backend, desktop, and mobile systems. Led local, distributed, and offshore teams of up to 30 engineers. Managed software development on successful projects for over 10 years, including frontend, backend, desktop, and mobile systems. Led local, distributed, and offshore teams of up to 30 engineers. Experience Senior Software Engineering Manager Stanford University September 2010  – Present (5 years) Palo Alto, CA Managed software engineering team and overall coordination for the 8 sites participating in a $3.6M/year project to provide access to standardized biomedical vocabularies to a worldwide community. Led a team of 8 engineers in 4 locations developing a Web portal and a platform of REST Web services. External users have built over 100 applications on this platform. Software Consultant and Contractor various March 2010  –  September 2010  (7 months) Redword City, CA Developed prototype for Web advertising inventory management system (IMS) for mobile phone advertising client. Prototype predicted number of targeted ads available in the future.  Director of Engineering Bluepulse March 2009  –  July 2009  (5 months) Sunnyvale, CA Led team developing mobile phone application that allowed users to retrieve information with spoken commands (cf. Apple’s Siri). Team consisted of 7 employees and contractors at 2 sites, and included frontend and backend development, QA, and operations. Company closed in Aug 2009. Senior Software Engineering Manager Yahoo! November 2005  –  February 2009  (3 years 4 months) Sunnyvale, CA Managed software development for Yahoo’s display advertising inventory, supply forecasting, and pricing systems. These components are a key part of Yahoo's premium display advertising business. Software Manager and Technical Lead Stanford University September 1994  –  November 2005  (11 years 3 months) Palo Alto, CA Led the design and construction of the Protégé open-source modeling tool. Protégé is similar to an object-oriented database schema designer; system builders use it to create complex, adaptable applications. Independent evaluations rated Protégé superior to alternatives for robustness and usability. Protégé is now the de facto worldwide standard tool in its domain. Software Engineer Centigram 1989  –  1994  (5 years) San Jose, CA Centigram was a startup telecommunications (voicemail) company that had an IPO in 1993. Enhanced systems software for processing recorded voice, text, and generated speech. Senior Software Engineering Manager Stanford University September 2010  – Present (5 years) Palo Alto, CA Managed software engineering team and overall coordination for the 8 sites participating in a $3.6M/year project to provide access to standardized biomedical vocabularies to a worldwide community. Led a team of 8 engineers in 4 locations developing a Web portal and a platform of REST Web services. External users have built over 100 applications on this platform. Senior Software Engineering Manager Stanford University September 2010  – Present (5 years) Palo Alto, CA Managed software engineering team and overall coordination for the 8 sites participating in a $3.6M/year project to provide access to standardized biomedical vocabularies to a worldwide community. Led a team of 8 engineers in 4 locations developing a Web portal and a platform of REST Web services. External users have built over 100 applications on this platform. Software Consultant and Contractor various March 2010  –  September 2010  (7 months) Redword City, CA Developed prototype for Web advertising inventory management system (IMS) for mobile phone advertising client. Prototype predicted number of targeted ads available in the future.  Software Consultant and Contractor various March 2010  –  September 2010  (7 months) Redword City, CA Developed prototype for Web advertising inventory management system (IMS) for mobile phone advertising client. Prototype predicted number of targeted ads available in the future.  Director of Engineering Bluepulse March 2009  –  July 2009  (5 months) Sunnyvale, CA Led team developing mobile phone application that allowed users to retrieve information with spoken commands (cf. Apple’s Siri). Team consisted of 7 employees and contractors at 2 sites, and included frontend and backend development, QA, and operations. Company closed in Aug 2009. Director of Engineering Bluepulse March 2009  –  July 2009  (5 months) Sunnyvale, CA Led team developing mobile phone application that allowed users to retrieve information with spoken commands (cf. Apple’s Siri). Team consisted of 7 employees and contractors at 2 sites, and included frontend and backend development, QA, and operations. Company closed in Aug 2009. Senior Software Engineering Manager Yahoo! November 2005  –  February 2009  (3 years 4 months) Sunnyvale, CA Managed software development for Yahoo’s display advertising inventory, supply forecasting, and pricing systems. These components are a key part of Yahoo's premium display advertising business. Senior Software Engineering Manager Yahoo! November 2005  –  February 2009  (3 years 4 months) Sunnyvale, CA Managed software development for Yahoo’s display advertising inventory, supply forecasting, and pricing systems. These components are a key part of Yahoo's premium display advertising business. Software Manager and Technical Lead Stanford University September 1994  –  November 2005  (11 years 3 months) Palo Alto, CA Led the design and construction of the Protégé open-source modeling tool. Protégé is similar to an object-oriented database schema designer; system builders use it to create complex, adaptable applications. Independent evaluations rated Protégé superior to alternatives for robustness and usability. Protégé is now the de facto worldwide standard tool in its domain. Software Manager and Technical Lead Stanford University September 1994  –  November 2005  (11 years 3 months) Palo Alto, CA Led the design and construction of the Protégé open-source modeling tool. Protégé is similar to an object-oriented database schema designer; system builders use it to create complex, adaptable applications. Independent evaluations rated Protégé superior to alternatives for robustness and usability. Protégé is now the de facto worldwide standard tool in its domain. Software Engineer Centigram 1989  –  1994  (5 years) San Jose, CA Centigram was a startup telecommunications (voicemail) company that had an IPO in 1993. Enhanced systems software for processing recorded voice, text, and generated speech. Software Engineer Centigram 1989  –  1994  (5 years) San Jose, CA Centigram was a startup telecommunications (voicemail) company that had an IPO in 1993. Enhanced systems software for processing recorded voice, text, and generated speech. Languages English Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Distributed Systems Software Engineering Client/server Scalability Algorithms High Performance... Leadership Quality Assurance Fault Tolerant Systems Big Data Machine Learning Skills  Distributed Systems Software Engineering Client/server Scalability Algorithms High Performance... Leadership Quality Assurance Fault Tolerant Systems Big Data Machine Learning Distributed Systems Software Engineering Client/server Scalability Algorithms High Performance... Leadership Quality Assurance Fault Tolerant Systems Big Data Machine Learning Distributed Systems Software Engineering Client/server Scalability Algorithms High Performance... Leadership Quality Assurance Fault Tolerant Systems Big Data Machine Learning Education Colorado School of Mines Bachelor's Degree,  Physics The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Experimental Nuclear Physics Colorado School of Mines Bachelor's Degree,  Physics Colorado School of Mines Bachelor's Degree,  Physics Colorado School of Mines Bachelor's Degree,  Physics The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Experimental Nuclear Physics The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Experimental Nuclear Physics The University of Texas at Austin Doctor of Philosophy (Ph.D.),  Experimental Nuclear Physics ", "Experience Lab Manager Stanford University February 2013  – Present (2 years 7 months) Stanford, CA Lab manager at the Stanford Nanofabrication Facility on the Stanford Campus. Process Engineering Manager Stanford University 2001  – Present (14 years) Stanford, CA Senior researcher and technical staff member at the Stanford Nanofabrication Facility (SNF), a shared resource open to researchers from companies and other universities as well as Stanford and serving over 500 researchers annually. Job responsibilities include: process staff manager, technical liaison for bio/biotech/medical research projects, lab facilities support coordinator, lab safety manager, project manager. Primary function is to enable the research of the SNF labmembers by providing them tools, training, and expertise. Biology Domain Expert Stanford University 1998  –  2001  (3 years) Stanford, CA Research Associate at the Stanford Nanofabrication Facility (SNF). Responsible for recruiting and providing technical support for biology-based research projects at SNF. Organized educational workshops and conferences in topics such as: biomedical devices, MEMS for biologists, DNA microchips for engineers, nanosafety practice and ethics. Wrote grants and advised/participated in research projects; mentored undergraduates, lectured and supported lab-related course work. Post Doctoral Researcher UC Berkeley 1997  –  1998  (1 year) Berkeley, CA Research topic: the development of microfluidic devices for DNA sequencing analysis in the lab of Prof. Richard A. Mathies, Department of Chemistry. Process Engineer/Sr Process Eng Intel Corporation 1984  –  1991  (7 years) Santa Clara, CA Experience working in the following functional areas: plasma etch, plasma enhanced chemical vapor deposition, photolithography, quality control, integration. Lab Manager Stanford University February 2013  – Present (2 years 7 months) Stanford, CA Lab manager at the Stanford Nanofabrication Facility on the Stanford Campus. Lab Manager Stanford University February 2013  – Present (2 years 7 months) Stanford, CA Lab manager at the Stanford Nanofabrication Facility on the Stanford Campus. Process Engineering Manager Stanford University 2001  – Present (14 years) Stanford, CA Senior researcher and technical staff member at the Stanford Nanofabrication Facility (SNF), a shared resource open to researchers from companies and other universities as well as Stanford and serving over 500 researchers annually. Job responsibilities include: process staff manager, technical liaison for bio/biotech/medical research projects, lab facilities support coordinator, lab safety manager, project manager. Primary function is to enable the research of the SNF labmembers by providing them tools, training, and expertise. Process Engineering Manager Stanford University 2001  – Present (14 years) Stanford, CA Senior researcher and technical staff member at the Stanford Nanofabrication Facility (SNF), a shared resource open to researchers from companies and other universities as well as Stanford and serving over 500 researchers annually. Job responsibilities include: process staff manager, technical liaison for bio/biotech/medical research projects, lab facilities support coordinator, lab safety manager, project manager. Primary function is to enable the research of the SNF labmembers by providing them tools, training, and expertise. Biology Domain Expert Stanford University 1998  –  2001  (3 years) Stanford, CA Research Associate at the Stanford Nanofabrication Facility (SNF). Responsible for recruiting and providing technical support for biology-based research projects at SNF. Organized educational workshops and conferences in topics such as: biomedical devices, MEMS for biologists, DNA microchips for engineers, nanosafety practice and ethics. Wrote grants and advised/participated in research projects; mentored undergraduates, lectured and supported lab-related course work. Biology Domain Expert Stanford University 1998  –  2001  (3 years) Stanford, CA Research Associate at the Stanford Nanofabrication Facility (SNF). Responsible for recruiting and providing technical support for biology-based research projects at SNF. Organized educational workshops and conferences in topics such as: biomedical devices, MEMS for biologists, DNA microchips for engineers, nanosafety practice and ethics. Wrote grants and advised/participated in research projects; mentored undergraduates, lectured and supported lab-related course work. Post Doctoral Researcher UC Berkeley 1997  –  1998  (1 year) Berkeley, CA Research topic: the development of microfluidic devices for DNA sequencing analysis in the lab of Prof. Richard A. Mathies, Department of Chemistry. Post Doctoral Researcher UC Berkeley 1997  –  1998  (1 year) Berkeley, CA Research topic: the development of microfluidic devices for DNA sequencing analysis in the lab of Prof. Richard A. Mathies, Department of Chemistry. Process Engineer/Sr Process Eng Intel Corporation 1984  –  1991  (7 years) Santa Clara, CA Experience working in the following functional areas: plasma etch, plasma enhanced chemical vapor deposition, photolithography, quality control, integration. Process Engineer/Sr Process Eng Intel Corporation 1984  –  1991  (7 years) Santa Clara, CA Experience working in the following functional areas: plasma etch, plasma enhanced chemical vapor deposition, photolithography, quality control, integration. Skills Microfluidics Nanoparticles Bioengineering Laboratory Operations Microfabrication Plasma Etching Nanobiotechnology MEMS Biotechnology Skills  Microfluidics Nanoparticles Bioengineering Laboratory Operations Microfabrication Plasma Etching Nanobiotechnology MEMS Biotechnology Microfluidics Nanoparticles Bioengineering Laboratory Operations Microfabrication Plasma Etching Nanobiotechnology MEMS Biotechnology Microfluidics Nanoparticles Bioengineering Laboratory Operations Microfabrication Plasma Etching Nanobiotechnology MEMS Biotechnology Education University of California, San Francisco Ph.D.,  Bioengineering 1991  – 1996 Stanford University UCLA Occidental College University of California, San Francisco Ph.D.,  Bioengineering 1991  – 1996 University of California, San Francisco Ph.D.,  Bioengineering 1991  – 1996 University of California, San Francisco Ph.D.,  Bioengineering 1991  – 1996 Stanford University Stanford University Stanford University UCLA UCLA UCLA Occidental College Occidental College Occidental College ", "Summary I am a senior engineering executive experienced in building and managing agile engineering groups in start-up and large organizations. With strong people management skills, many years of agile management experience working with industry leaders i.e. ThoughtWorks and PivotalLabs and deep technical expertise in web and mobile development, video technologies, advertising and big data, I focus on getting things done, at all levels, and I have done it consistently. I have grown top-notch teams and designed, built, shipped/deployed and maintained multiple successful commercial software products.  \n \nCurrently I am the Software Development Manager for the Industrial Mobility team at GE Software. We are building an Industrial Mobility Platform that will be used to deliver the Right Information, to the Right Person, at the Right Time enabling Shorter Response Times that lead to a more efficient and effective mobile workforce (see http://www.wired.com/design/2013/10/three-design-trends-ges-using-to-make-software-for-jet-engines-and-wind-turbines/) \n \nPreviously I held engineering management positions working on both enterprise and consumer applications. I have recruited, retained, mentored and managed engineering managers, team leads, software engineers, UX designers and QA staff, through various stages of growth.  \n \nSpecialties \n \nTechnology strategy, organizational development, product process/agile methodologies, startups and vendor management. Software engineering in numerous stacks, large-scale high-availability systems and cloud architectures, \"big data\" collection & processing, online advertising tech, mobile application development, video platforms, social network integration and APIs. Summary I am a senior engineering executive experienced in building and managing agile engineering groups in start-up and large organizations. With strong people management skills, many years of agile management experience working with industry leaders i.e. ThoughtWorks and PivotalLabs and deep technical expertise in web and mobile development, video technologies, advertising and big data, I focus on getting things done, at all levels, and I have done it consistently. I have grown top-notch teams and designed, built, shipped/deployed and maintained multiple successful commercial software products.  \n \nCurrently I am the Software Development Manager for the Industrial Mobility team at GE Software. We are building an Industrial Mobility Platform that will be used to deliver the Right Information, to the Right Person, at the Right Time enabling Shorter Response Times that lead to a more efficient and effective mobile workforce (see http://www.wired.com/design/2013/10/three-design-trends-ges-using-to-make-software-for-jet-engines-and-wind-turbines/) \n \nPreviously I held engineering management positions working on both enterprise and consumer applications. I have recruited, retained, mentored and managed engineering managers, team leads, software engineers, UX designers and QA staff, through various stages of growth.  \n \nSpecialties \n \nTechnology strategy, organizational development, product process/agile methodologies, startups and vendor management. Software engineering in numerous stacks, large-scale high-availability systems and cloud architectures, \"big data\" collection & processing, online advertising tech, mobile application development, video platforms, social network integration and APIs. I am a senior engineering executive experienced in building and managing agile engineering groups in start-up and large organizations. With strong people management skills, many years of agile management experience working with industry leaders i.e. ThoughtWorks and PivotalLabs and deep technical expertise in web and mobile development, video technologies, advertising and big data, I focus on getting things done, at all levels, and I have done it consistently. I have grown top-notch teams and designed, built, shipped/deployed and maintained multiple successful commercial software products.  \n \nCurrently I am the Software Development Manager for the Industrial Mobility team at GE Software. We are building an Industrial Mobility Platform that will be used to deliver the Right Information, to the Right Person, at the Right Time enabling Shorter Response Times that lead to a more efficient and effective mobile workforce (see http://www.wired.com/design/2013/10/three-design-trends-ges-using-to-make-software-for-jet-engines-and-wind-turbines/) \n \nPreviously I held engineering management positions working on both enterprise and consumer applications. I have recruited, retained, mentored and managed engineering managers, team leads, software engineers, UX designers and QA staff, through various stages of growth.  \n \nSpecialties \n \nTechnology strategy, organizational development, product process/agile methodologies, startups and vendor management. Software engineering in numerous stacks, large-scale high-availability systems and cloud architectures, \"big data\" collection & processing, online advertising tech, mobile application development, video platforms, social network integration and APIs. I am a senior engineering executive experienced in building and managing agile engineering groups in start-up and large organizations. With strong people management skills, many years of agile management experience working with industry leaders i.e. ThoughtWorks and PivotalLabs and deep technical expertise in web and mobile development, video technologies, advertising and big data, I focus on getting things done, at all levels, and I have done it consistently. I have grown top-notch teams and designed, built, shipped/deployed and maintained multiple successful commercial software products.  \n \nCurrently I am the Software Development Manager for the Industrial Mobility team at GE Software. We are building an Industrial Mobility Platform that will be used to deliver the Right Information, to the Right Person, at the Right Time enabling Shorter Response Times that lead to a more efficient and effective mobile workforce (see http://www.wired.com/design/2013/10/three-design-trends-ges-using-to-make-software-for-jet-engines-and-wind-turbines/) \n \nPreviously I held engineering management positions working on both enterprise and consumer applications. I have recruited, retained, mentored and managed engineering managers, team leads, software engineers, UX designers and QA staff, through various stages of growth.  \n \nSpecialties \n \nTechnology strategy, organizational development, product process/agile methodologies, startups and vendor management. Software engineering in numerous stacks, large-scale high-availability systems and cloud architectures, \"big data\" collection & processing, online advertising tech, mobile application development, video platforms, social network integration and APIs. Experience Senior Software Development Manager- Predix Platform GE Software October 2013  – Present (1 year 11 months) San Ramon Principal Engineering Manager-Advertising and New Monetization Microsoft October 2011  –  October 2013  (2 years 1 month) Palo Alto, CA Chief Software Architect Tout September 2008  –  August 2011  (3 years) Director of Engineering Existory September 2007  –  September 2008  (1 year 1 month) San Francisco, CA Senior Engineering Manager Stanford University January 2005  –  September 2007  (2 years 9 months) Stanford, CA VP Engineering Resonant Software January 2004  –  December 2004  (1 year) Emeryville, CA Software Architect Educational Venture January 2003  –  January 2004  (1 year 1 month) VP Engineering ePropose January 2000  –  December 2002  (3 years) San Francisco, CA Senior Software Development Manager- Predix Platform GE Software October 2013  – Present (1 year 11 months) San Ramon Senior Software Development Manager- Predix Platform GE Software October 2013  – Present (1 year 11 months) San Ramon Principal Engineering Manager-Advertising and New Monetization Microsoft October 2011  –  October 2013  (2 years 1 month) Palo Alto, CA Principal Engineering Manager-Advertising and New Monetization Microsoft October 2011  –  October 2013  (2 years 1 month) Palo Alto, CA Chief Software Architect Tout September 2008  –  August 2011  (3 years) Chief Software Architect Tout September 2008  –  August 2011  (3 years) Director of Engineering Existory September 2007  –  September 2008  (1 year 1 month) San Francisco, CA Director of Engineering Existory September 2007  –  September 2008  (1 year 1 month) San Francisco, CA Senior Engineering Manager Stanford University January 2005  –  September 2007  (2 years 9 months) Stanford, CA Senior Engineering Manager Stanford University January 2005  –  September 2007  (2 years 9 months) Stanford, CA VP Engineering Resonant Software January 2004  –  December 2004  (1 year) Emeryville, CA VP Engineering Resonant Software January 2004  –  December 2004  (1 year) Emeryville, CA Software Architect Educational Venture January 2003  –  January 2004  (1 year 1 month) Software Architect Educational Venture January 2003  –  January 2004  (1 year 1 month) VP Engineering ePropose January 2000  –  December 2002  (3 years) San Francisco, CA VP Engineering ePropose January 2000  –  December 2002  (3 years) San Francisco, CA Skills Engineering Management Agile Methodologies Scalability Ruby JavaScript Mobile Applications Distributed Systems Start-ups Python Java Software Engineering Cloud Computing Agile Project Management Enterprise Software Software Development Objective-C Mobile Devices .NET Architecture Management See 5+     See less Skills  Engineering Management Agile Methodologies Scalability Ruby JavaScript Mobile Applications Distributed Systems Start-ups Python Java Software Engineering Cloud Computing Agile Project Management Enterprise Software Software Development Objective-C Mobile Devices .NET Architecture Management See 5+     See less Engineering Management Agile Methodologies Scalability Ruby JavaScript Mobile Applications Distributed Systems Start-ups Python Java Software Engineering Cloud Computing Agile Project Management Enterprise Software Software Development Objective-C Mobile Devices .NET Architecture Management See 5+     See less Engineering Management Agile Methodologies Scalability Ruby JavaScript Mobile Applications Distributed Systems Start-ups Python Java Software Engineering Cloud Computing Agile Project Management Enterprise Software Software Development Objective-C Mobile Devices .NET Architecture Management See 5+     See less ", "Skills C++ Computer Science Java Python Linux LaTeX C Skills  C++ Computer Science Java Python Linux LaTeX C C++ Computer Science Java Python Linux LaTeX C C++ Computer Science Java Python Linux LaTeX C Education Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2006  – 2013 Massachusetts Institute of Technology Master's Degree,  Electrical Engineering and Computer Science 1996  – 2002 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2006  – 2013 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2006  – 2013 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2006  – 2013 Massachusetts Institute of Technology Master's Degree,  Electrical Engineering and Computer Science 1996  – 2002 Massachusetts Institute of Technology Master's Degree,  Electrical Engineering and Computer Science 1996  – 2002 Massachusetts Institute of Technology Master's Degree,  Electrical Engineering and Computer Science 1996  – 2002 ", "Summary I thrive on applying my computer engineering know-how to facilitate and foster scientific research. In particular, I enjoy using my skills in Python programming, web technologies, systems administration, and enterprise-class data storage to enable scientific data management and high performance computing. \n \nSpecialties: \n• Software Engineering \n• Enterprise-class data storage \n• High performance computing Summary I thrive on applying my computer engineering know-how to facilitate and foster scientific research. In particular, I enjoy using my skills in Python programming, web technologies, systems administration, and enterprise-class data storage to enable scientific data management and high performance computing. \n \nSpecialties: \n• Software Engineering \n• Enterprise-class data storage \n• High performance computing I thrive on applying my computer engineering know-how to facilitate and foster scientific research. In particular, I enjoy using my skills in Python programming, web technologies, systems administration, and enterprise-class data storage to enable scientific data management and high performance computing. \n \nSpecialties: \n• Software Engineering \n• Enterprise-class data storage \n• High performance computing I thrive on applying my computer engineering know-how to facilitate and foster scientific research. In particular, I enjoy using my skills in Python programming, web technologies, systems administration, and enterprise-class data storage to enable scientific data management and high performance computing. \n \nSpecialties: \n• Software Engineering \n• Enterprise-class data storage \n• High performance computing Experience Software Engineering Manager Stanford University July 2013  – Present (2 years 2 months) • Project on Scientific Transparency (PoST) \n• Scientific data management \n• Docker, Nginx, Python, MongoDB, REST, webapp2, AngularJS Senior Systems Engineer Stanford University November 2010  –  June 2013  (2 years 8 months) • Center for Cognitive and Neurobiological Imaging \n• Neurobiological Image Management System (NIMS) \n• Scientific data management \n• Python, TurboGears, SQLAlchemy, PostgreSQL \n• Enterprise-class data storage, based on FreeBSD and ZFS Consulting Lab Manager Stanford University September 2010  –  February 2011  (6 months) • Stanford Psychophysiology Laboratory \n• Deployment of server infrastructure for data analysis, storage, and backup \n• Analysis of functional MRI data using AFNI \n• Assistance with analysis of physiological and EEG data Graduate Research Assistant EPFL September 2006  –  August 2009  (3 years) Research in wireless sensor networks for environmental monitoring: \n• Energy-efficient routing \n• Network health and performance monitoring \n• Theory, simulation, testing \n• Real-world deployments Network & Systems Administrator EPFL September 2006  –  December 2007  (1 year 4 months) • Deployment of server infrastructure for numerical simulation, data analysis, and storage \n• Deployment of SVN and CUPS \n• IT support for 30 Linux, Mac, and Windows users Research Intern Mercedes Benz Research and Development, India May 2005  –  December 2005  (8 months) • Integration of Six Sigma methodologies into the Capability Maturity Model Integration (CMMI) software and systems engineering quality framework Research Intern Mercedes-Benz Research & Development North America March 2003  –  August 2003  (6 months) • Augmented reality automobile navigation system \n• Stop sign warning system \n• Ubiquitous computing Software Engineering Manager Stanford University July 2013  – Present (2 years 2 months) • Project on Scientific Transparency (PoST) \n• Scientific data management \n• Docker, Nginx, Python, MongoDB, REST, webapp2, AngularJS Software Engineering Manager Stanford University July 2013  – Present (2 years 2 months) • Project on Scientific Transparency (PoST) \n• Scientific data management \n• Docker, Nginx, Python, MongoDB, REST, webapp2, AngularJS Senior Systems Engineer Stanford University November 2010  –  June 2013  (2 years 8 months) • Center for Cognitive and Neurobiological Imaging \n• Neurobiological Image Management System (NIMS) \n• Scientific data management \n• Python, TurboGears, SQLAlchemy, PostgreSQL \n• Enterprise-class data storage, based on FreeBSD and ZFS Senior Systems Engineer Stanford University November 2010  –  June 2013  (2 years 8 months) • Center for Cognitive and Neurobiological Imaging \n• Neurobiological Image Management System (NIMS) \n• Scientific data management \n• Python, TurboGears, SQLAlchemy, PostgreSQL \n• Enterprise-class data storage, based on FreeBSD and ZFS Consulting Lab Manager Stanford University September 2010  –  February 2011  (6 months) • Stanford Psychophysiology Laboratory \n• Deployment of server infrastructure for data analysis, storage, and backup \n• Analysis of functional MRI data using AFNI \n• Assistance with analysis of physiological and EEG data Consulting Lab Manager Stanford University September 2010  –  February 2011  (6 months) • Stanford Psychophysiology Laboratory \n• Deployment of server infrastructure for data analysis, storage, and backup \n• Analysis of functional MRI data using AFNI \n• Assistance with analysis of physiological and EEG data Graduate Research Assistant EPFL September 2006  –  August 2009  (3 years) Research in wireless sensor networks for environmental monitoring: \n• Energy-efficient routing \n• Network health and performance monitoring \n• Theory, simulation, testing \n• Real-world deployments Graduate Research Assistant EPFL September 2006  –  August 2009  (3 years) Research in wireless sensor networks for environmental monitoring: \n• Energy-efficient routing \n• Network health and performance monitoring \n• Theory, simulation, testing \n• Real-world deployments Network & Systems Administrator EPFL September 2006  –  December 2007  (1 year 4 months) • Deployment of server infrastructure for numerical simulation, data analysis, and storage \n• Deployment of SVN and CUPS \n• IT support for 30 Linux, Mac, and Windows users Network & Systems Administrator EPFL September 2006  –  December 2007  (1 year 4 months) • Deployment of server infrastructure for numerical simulation, data analysis, and storage \n• Deployment of SVN and CUPS \n• IT support for 30 Linux, Mac, and Windows users Research Intern Mercedes Benz Research and Development, India May 2005  –  December 2005  (8 months) • Integration of Six Sigma methodologies into the Capability Maturity Model Integration (CMMI) software and systems engineering quality framework Research Intern Mercedes Benz Research and Development, India May 2005  –  December 2005  (8 months) • Integration of Six Sigma methodologies into the Capability Maturity Model Integration (CMMI) software and systems engineering quality framework Research Intern Mercedes-Benz Research & Development North America March 2003  –  August 2003  (6 months) • Augmented reality automobile navigation system \n• Stop sign warning system \n• Ubiquitous computing Research Intern Mercedes-Benz Research & Development North America March 2003  –  August 2003  (6 months) • Augmented reality automobile navigation system \n• Stop sign warning system \n• Ubiquitous computing Languages English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Docker Nginx MongoDB Git Github Python Linux Software Engineering LaTeX System Administration Unix Vim DICOM NIfTI Systems Engineering Software Development System Design Bash FreeBSD Mac OS ZFS NFS PF C Objective-C System Architecture Engineering TurboGears SQLAlchemy PostgreSQL Sun Grid Engine SCons GCC Virtual Machines Kerberos Google App Engine See 21+     See less Skills  Docker Nginx MongoDB Git Github Python Linux Software Engineering LaTeX System Administration Unix Vim DICOM NIfTI Systems Engineering Software Development System Design Bash FreeBSD Mac OS ZFS NFS PF C Objective-C System Architecture Engineering TurboGears SQLAlchemy PostgreSQL Sun Grid Engine SCons GCC Virtual Machines Kerberos Google App Engine See 21+     See less Docker Nginx MongoDB Git Github Python Linux Software Engineering LaTeX System Administration Unix Vim DICOM NIfTI Systems Engineering Software Development System Design Bash FreeBSD Mac OS ZFS NFS PF C Objective-C System Architecture Engineering TurboGears SQLAlchemy PostgreSQL Sun Grid Engine SCons GCC Virtual Machines Kerberos Google App Engine See 21+     See less Docker Nginx MongoDB Git Github Python Linux Software Engineering LaTeX System Administration Unix Vim DICOM NIfTI Systems Engineering Software Development System Design Bash FreeBSD Mac OS ZFS NFS PF C Objective-C System Architecture Engineering TurboGears SQLAlchemy PostgreSQL Sun Grid Engine SCons GCC Virtual Machines Kerberos Google App Engine See 21+     See less Education Christian-Albrechts-Universität zu Kiel Diplom-Ingenieur,  Computer Engineering 1999  – 2006 • Design and implementation of embedded software \n• Concurrency and parallel computing \n• Mathematical optimization Activities and Societies:  Uni Film Club Virginia Wesleyan College Mathematics and Computer Science 1996  – 1998 Christian-Albrechts-Universität zu Kiel Diplom-Ingenieur,  Computer Engineering 1999  – 2006 • Design and implementation of embedded software \n• Concurrency and parallel computing \n• Mathematical optimization Activities and Societies:  Uni Film Club Christian-Albrechts-Universität zu Kiel Diplom-Ingenieur,  Computer Engineering 1999  – 2006 • Design and implementation of embedded software \n• Concurrency and parallel computing \n• Mathematical optimization Activities and Societies:  Uni Film Club Christian-Albrechts-Universität zu Kiel Diplom-Ingenieur,  Computer Engineering 1999  – 2006 • Design and implementation of embedded software \n• Concurrency and parallel computing \n• Mathematical optimization Activities and Societies:  Uni Film Club Virginia Wesleyan College Mathematics and Computer Science 1996  – 1998 Virginia Wesleyan College Mathematics and Computer Science 1996  – 1998 Virginia Wesleyan College Mathematics and Computer Science 1996  – 1998 ", "Experience Engineering manager Stanford University Engineering manager Stanford University Engineering manager Stanford University ", "Experience Research Assistant Professor University of Houston January 2015  – Present (8 months) Member Technical Staff big switch networks April 2012  –  April 2013  (1 year 1 month) OpenFlow Engineering Manager Stanford University October 2010  –  April 2012  (1 year 7 months) Stanford, CA Senior Software Architect OPNET Technologies January 2000  –  April 2012  (12 years 4 months) Bethesda, Maryland Network Operations Consultant Valkyrie Internet Services January 1998  –  January 2003  (5 years 1 month) Millersburg, OH Network Administrator RBB Systems, Inc. January 1998  –  January 2000  (2 years 1 month) Wooster, OH Systems Architect World Trade Center Internet Services January 1997  –  January 1998  (1 year 1 month) San Diego, CA Research Assistant Professor University of Houston January 2015  – Present (8 months) Research Assistant Professor University of Houston January 2015  – Present (8 months) Member Technical Staff big switch networks April 2012  –  April 2013  (1 year 1 month) Member Technical Staff big switch networks April 2012  –  April 2013  (1 year 1 month) OpenFlow Engineering Manager Stanford University October 2010  –  April 2012  (1 year 7 months) Stanford, CA OpenFlow Engineering Manager Stanford University October 2010  –  April 2012  (1 year 7 months) Stanford, CA Senior Software Architect OPNET Technologies January 2000  –  April 2012  (12 years 4 months) Bethesda, Maryland Senior Software Architect OPNET Technologies January 2000  –  April 2012  (12 years 4 months) Bethesda, Maryland Network Operations Consultant Valkyrie Internet Services January 1998  –  January 2003  (5 years 1 month) Millersburg, OH Network Operations Consultant Valkyrie Internet Services January 1998  –  January 2003  (5 years 1 month) Millersburg, OH Network Administrator RBB Systems, Inc. January 1998  –  January 2000  (2 years 1 month) Wooster, OH Network Administrator RBB Systems, Inc. January 1998  –  January 2000  (2 years 1 month) Wooster, OH Systems Architect World Trade Center Internet Services January 1997  –  January 1998  (1 year 1 month) San Diego, CA Systems Architect World Trade Center Internet Services January 1997  –  January 1998  (1 year 1 month) San Diego, CA Skills Networking Python Linux C++ Distributed Systems Unix Software Development Software Engineering OpenFlow TCP/IP Network Architecture System Architecture C Shell Scripting Algorithms Software Design Cloud Computing Object Oriented Design MySQL Device Drivers Scalability Network Design See 7+     See less Skills  Networking Python Linux C++ Distributed Systems Unix Software Development Software Engineering OpenFlow TCP/IP Network Architecture System Architecture C Shell Scripting Algorithms Software Design Cloud Computing Object Oriented Design MySQL Device Drivers Scalability Network Design See 7+     See less Networking Python Linux C++ Distributed Systems Unix Software Development Software Engineering OpenFlow TCP/IP Network Architecture System Architecture C Shell Scripting Algorithms Software Design Cloud Computing Object Oriented Design MySQL Device Drivers Scalability Network Design See 7+     See less Networking Python Linux C++ Distributed Systems Unix Software Development Software Engineering OpenFlow TCP/IP Network Architecture System Architecture C Shell Scripting Algorithms Software Design Cloud Computing Object Oriented Design MySQL Device Drivers Scalability Network Design See 7+     See less ", "Summary SUMMARY \n \nAn intuitive and inquisitive Engineering Generalist, Systems Architect and Designer with extensive experience in computer driven systems. Highly developed strengths in digital hardware, computer systems, communications, machine vision, and the electronic, mechanical and optical design of complete systems. Skilled in managing research and development programs, conceptualizing and implementing new ideas from early stage to finished product. A strong problem solver and \"big picture\" thinker who rapidly masters new technologies and can develop alternative approaches. Specialties:artificial intelligence, atm, automation, automotive, cad, computer hardware, computer networking, cpu, customer relations, design, digital design, digital signal processing, electronics, feasibility studies, gsm, image processing, interface design, isdn, new product development, pci, problem solving, processors, project management, robotics, sonet, strategic, system architecture, t1, unix, verilog, vhdl,vision Summary SUMMARY \n \nAn intuitive and inquisitive Engineering Generalist, Systems Architect and Designer with extensive experience in computer driven systems. Highly developed strengths in digital hardware, computer systems, communications, machine vision, and the electronic, mechanical and optical design of complete systems. Skilled in managing research and development programs, conceptualizing and implementing new ideas from early stage to finished product. A strong problem solver and \"big picture\" thinker who rapidly masters new technologies and can develop alternative approaches. Specialties:artificial intelligence, atm, automation, automotive, cad, computer hardware, computer networking, cpu, customer relations, design, digital design, digital signal processing, electronics, feasibility studies, gsm, image processing, interface design, isdn, new product development, pci, problem solving, processors, project management, robotics, sonet, strategic, system architecture, t1, unix, verilog, vhdl,vision SUMMARY \n \nAn intuitive and inquisitive Engineering Generalist, Systems Architect and Designer with extensive experience in computer driven systems. Highly developed strengths in digital hardware, computer systems, communications, machine vision, and the electronic, mechanical and optical design of complete systems. Skilled in managing research and development programs, conceptualizing and implementing new ideas from early stage to finished product. A strong problem solver and \"big picture\" thinker who rapidly masters new technologies and can develop alternative approaches. Specialties:artificial intelligence, atm, automation, automotive, cad, computer hardware, computer networking, cpu, customer relations, design, digital design, digital signal processing, electronics, feasibility studies, gsm, image processing, interface design, isdn, new product development, pci, problem solving, processors, project management, robotics, sonet, strategic, system architecture, t1, unix, verilog, vhdl,vision SUMMARY \n \nAn intuitive and inquisitive Engineering Generalist, Systems Architect and Designer with extensive experience in computer driven systems. Highly developed strengths in digital hardware, computer systems, communications, machine vision, and the electronic, mechanical and optical design of complete systems. Skilled in managing research and development programs, conceptualizing and implementing new ideas from early stage to finished product. A strong problem solver and \"big picture\" thinker who rapidly masters new technologies and can develop alternative approaches. Specialties:artificial intelligence, atm, automation, automotive, cad, computer hardware, computer networking, cpu, customer relations, design, digital design, digital signal processing, electronics, feasibility studies, gsm, image processing, interface design, isdn, new product development, pci, problem solving, processors, project management, robotics, sonet, strategic, system architecture, t1, unix, verilog, vhdl,vision Experience Technical Director TicTran February 2010  –  March 2013  (3 years 2 months) Future Products Ixia June 2009  –  October 2009  (5 months) Ixia, Leader in Converged IP Testing, has acquired Catapult Communications. Engineering Fellow Catapult Communications January 1995  –  June 2009  (14 years 6 months) Investigated new product ideas for strategic and tactical value and opportunity. \n· Conducted technical evaluation of potential acquisition targets. \n· Provided technical problem solving, evaluation and project management support for \nengineering and manufacturing activities. \n· Trained engineers in new technologies. \nManager, Product Design (1995-2006) \nManaged the Hardware Development Group with up to five Senior Hardware Engineers engaged \nin system and hardware design on new communications testing products. \n· Architected new PCI and cPCI (with high speed mesh backplane interconnect) based \ncommunications testing systems. \n· Designed co-processor modules with PowerPC communications processors for installation \ninto PCI workstations and cPCI mesh connected shelves. \n· Designed physical interfaces including DS3, E3, ATM 155 UTP, and ATM 155/622 Optical. \n· Developed JTAG test programs and diagnostics for manufacturing test. Technical Director DE LA RUE GIORI OF AMERICA January 1987  –  January 1995  (8 years 1 month) Provided overall technical direction of all company operations. \n· Served as chief system architect of a very large image processing system for the automatic in- \nprocess inspection of newly printed security documents. \n· Principal Designer of a massive parallel processing pipelined computer system consisting of 51 \nCCD color cameras, a 22 CPU distributed control computer and 300 custom VMEbus image \nprocessing modules (18 types) running at a data rate greater than 400 megabytes/second. \n· Developed system specifications by surveying/interviewing potential worldwide customer base. \n· Created specifications and supervised design and production for a paper transport system built \nby an Italian company. Manager, Research & Development MACHINE INTELLIGENCE CORPORATION January 1980  –  January 1987  (7 years 1 month) Managed company new product development efforts. \n· Designed first commercially available practical industrial vision system. \n· Led joint venture (Yaskawa Electric) design team in the development of a vision system for an \nindustrial robotics product line. \n· Provided major contributions to the definition and design of sensor/hardware/software systems \nfor automatic inspection and measuring equipment in the automotive and electronics industries. \n· Conducted feasibility studies for automatic examination of security documents leading to \nformation of company. Hardware and Systems Design Consultant Silicon January 1979  –  January 1980  (1 year 1 month) Provided technical expertise and assistance on a variety of projects to clients including Sun \nMicrosystems, Hewlett Packard, Imagen, Xerox, Catapult Communications and Hexcel. \n· Installed computer aided design systems, computer interface design and construction, ISDN \ntest interface design and automation of a 5-axis milling machine. Vice President, Engineering STANFORD SYSTEMS January 1978  –  January 1979  (1 year 1 month) Responsible for new product idea generation and development. \n· Explored concepts in computer aided design, computer graphics terminals, and computer \nnetworks and communication. Engineering Manager Stanford University January 1968  –  January 1978  (10 years 1 month) Maintained advanced computer systems. \n· Developed new hardware for artificial intelligence and other computer based technologies. \n· Contributed to projects dedicated to robotics and industrial automation, machine vision, music \nand acoustics, computer graphics, ARPA Net, and computer aided design systems. Technical Director TicTran February 2010  –  March 2013  (3 years 2 months) Technical Director TicTran February 2010  –  March 2013  (3 years 2 months) Future Products Ixia June 2009  –  October 2009  (5 months) Ixia, Leader in Converged IP Testing, has acquired Catapult Communications. Future Products Ixia June 2009  –  October 2009  (5 months) Ixia, Leader in Converged IP Testing, has acquired Catapult Communications. Engineering Fellow Catapult Communications January 1995  –  June 2009  (14 years 6 months) Investigated new product ideas for strategic and tactical value and opportunity. \n· Conducted technical evaluation of potential acquisition targets. \n· Provided technical problem solving, evaluation and project management support for \nengineering and manufacturing activities. \n· Trained engineers in new technologies. \nManager, Product Design (1995-2006) \nManaged the Hardware Development Group with up to five Senior Hardware Engineers engaged \nin system and hardware design on new communications testing products. \n· Architected new PCI and cPCI (with high speed mesh backplane interconnect) based \ncommunications testing systems. \n· Designed co-processor modules with PowerPC communications processors for installation \ninto PCI workstations and cPCI mesh connected shelves. \n· Designed physical interfaces including DS3, E3, ATM 155 UTP, and ATM 155/622 Optical. \n· Developed JTAG test programs and diagnostics for manufacturing test. Engineering Fellow Catapult Communications January 1995  –  June 2009  (14 years 6 months) Investigated new product ideas for strategic and tactical value and opportunity. \n· Conducted technical evaluation of potential acquisition targets. \n· Provided technical problem solving, evaluation and project management support for \nengineering and manufacturing activities. \n· Trained engineers in new technologies. \nManager, Product Design (1995-2006) \nManaged the Hardware Development Group with up to five Senior Hardware Engineers engaged \nin system and hardware design on new communications testing products. \n· Architected new PCI and cPCI (with high speed mesh backplane interconnect) based \ncommunications testing systems. \n· Designed co-processor modules with PowerPC communications processors for installation \ninto PCI workstations and cPCI mesh connected shelves. \n· Designed physical interfaces including DS3, E3, ATM 155 UTP, and ATM 155/622 Optical. \n· Developed JTAG test programs and diagnostics for manufacturing test. Technical Director DE LA RUE GIORI OF AMERICA January 1987  –  January 1995  (8 years 1 month) Provided overall technical direction of all company operations. \n· Served as chief system architect of a very large image processing system for the automatic in- \nprocess inspection of newly printed security documents. \n· Principal Designer of a massive parallel processing pipelined computer system consisting of 51 \nCCD color cameras, a 22 CPU distributed control computer and 300 custom VMEbus image \nprocessing modules (18 types) running at a data rate greater than 400 megabytes/second. \n· Developed system specifications by surveying/interviewing potential worldwide customer base. \n· Created specifications and supervised design and production for a paper transport system built \nby an Italian company. Technical Director DE LA RUE GIORI OF AMERICA January 1987  –  January 1995  (8 years 1 month) Provided overall technical direction of all company operations. \n· Served as chief system architect of a very large image processing system for the automatic in- \nprocess inspection of newly printed security documents. \n· Principal Designer of a massive parallel processing pipelined computer system consisting of 51 \nCCD color cameras, a 22 CPU distributed control computer and 300 custom VMEbus image \nprocessing modules (18 types) running at a data rate greater than 400 megabytes/second. \n· Developed system specifications by surveying/interviewing potential worldwide customer base. \n· Created specifications and supervised design and production for a paper transport system built \nby an Italian company. Manager, Research & Development MACHINE INTELLIGENCE CORPORATION January 1980  –  January 1987  (7 years 1 month) Managed company new product development efforts. \n· Designed first commercially available practical industrial vision system. \n· Led joint venture (Yaskawa Electric) design team in the development of a vision system for an \nindustrial robotics product line. \n· Provided major contributions to the definition and design of sensor/hardware/software systems \nfor automatic inspection and measuring equipment in the automotive and electronics industries. \n· Conducted feasibility studies for automatic examination of security documents leading to \nformation of company. Manager, Research & Development MACHINE INTELLIGENCE CORPORATION January 1980  –  January 1987  (7 years 1 month) Managed company new product development efforts. \n· Designed first commercially available practical industrial vision system. \n· Led joint venture (Yaskawa Electric) design team in the development of a vision system for an \nindustrial robotics product line. \n· Provided major contributions to the definition and design of sensor/hardware/software systems \nfor automatic inspection and measuring equipment in the automotive and electronics industries. \n· Conducted feasibility studies for automatic examination of security documents leading to \nformation of company. Hardware and Systems Design Consultant Silicon January 1979  –  January 1980  (1 year 1 month) Provided technical expertise and assistance on a variety of projects to clients including Sun \nMicrosystems, Hewlett Packard, Imagen, Xerox, Catapult Communications and Hexcel. \n· Installed computer aided design systems, computer interface design and construction, ISDN \ntest interface design and automation of a 5-axis milling machine. Hardware and Systems Design Consultant Silicon January 1979  –  January 1980  (1 year 1 month) Provided technical expertise and assistance on a variety of projects to clients including Sun \nMicrosystems, Hewlett Packard, Imagen, Xerox, Catapult Communications and Hexcel. \n· Installed computer aided design systems, computer interface design and construction, ISDN \ntest interface design and automation of a 5-axis milling machine. Vice President, Engineering STANFORD SYSTEMS January 1978  –  January 1979  (1 year 1 month) Responsible for new product idea generation and development. \n· Explored concepts in computer aided design, computer graphics terminals, and computer \nnetworks and communication. Vice President, Engineering STANFORD SYSTEMS January 1978  –  January 1979  (1 year 1 month) Responsible for new product idea generation and development. \n· Explored concepts in computer aided design, computer graphics terminals, and computer \nnetworks and communication. Engineering Manager Stanford University January 1968  –  January 1978  (10 years 1 month) Maintained advanced computer systems. \n· Developed new hardware for artificial intelligence and other computer based technologies. \n· Contributed to projects dedicated to robotics and industrial automation, machine vision, music \nand acoustics, computer graphics, ARPA Net, and computer aided design systems. Engineering Manager Stanford University January 1968  –  January 1978  (10 years 1 month) Maintained advanced computer systems. \n· Developed new hardware for artificial intelligence and other computer based technologies. \n· Contributed to projects dedicated to robotics and industrial automation, machine vision, music \nand acoustics, computer graphics, ARPA Net, and computer aided design systems. Skills Unix Linux System Architecture ATM networks GSM Hardware Architecture Testing Embedded Systems Processors Software Engineering Skills  Unix Linux System Architecture ATM networks GSM Hardware Architecture Testing Embedded Systems Processors Software Engineering Unix Linux System Architecture ATM networks GSM Hardware Architecture Testing Embedded Systems Processors Software Engineering Unix Linux System Architecture ATM networks GSM Hardware Architecture Testing Embedded Systems Processors Software Engineering "]}