{"position": "Finance Specialist", "company": "Stanford University", "profiles": ["Summary Throughout my career, I have been recognized for leading high-visibility financial management projects with diverse characteristics, and for driving customer satisfaction and compliant business performance. In addition, I seek to understand and listen to the customers being served, and to foster collaboration and mutual respect. \n \nProfessional Attributes: reliable, efficient, objective, organized, pragmatic, responsive, analytical, self-directed. \n \nTechnology Skills:  \nOffice Applications \nProficient in Microsoft Excel (e.g. Visual Basic Macros / Pivot Tables / Database Management) \nAdvanced in Microsoft Office Suite (Access Database / PowerPoint / Word)  \n \nFinancial Applications \nOracle Financial Modules (Labor Schedules & Adjustments, iJournals, IOU, PCard, Procurement, ReportMart3)  \nPeopleSoft Financials (NVision 2Tier Reporting) Summary Throughout my career, I have been recognized for leading high-visibility financial management projects with diverse characteristics, and for driving customer satisfaction and compliant business performance. In addition, I seek to understand and listen to the customers being served, and to foster collaboration and mutual respect. \n \nProfessional Attributes: reliable, efficient, objective, organized, pragmatic, responsive, analytical, self-directed. \n \nTechnology Skills:  \nOffice Applications \nProficient in Microsoft Excel (e.g. Visual Basic Macros / Pivot Tables / Database Management) \nAdvanced in Microsoft Office Suite (Access Database / PowerPoint / Word)  \n \nFinancial Applications \nOracle Financial Modules (Labor Schedules & Adjustments, iJournals, IOU, PCard, Procurement, ReportMart3)  \nPeopleSoft Financials (NVision 2Tier Reporting) Throughout my career, I have been recognized for leading high-visibility financial management projects with diverse characteristics, and for driving customer satisfaction and compliant business performance. In addition, I seek to understand and listen to the customers being served, and to foster collaboration and mutual respect. \n \nProfessional Attributes: reliable, efficient, objective, organized, pragmatic, responsive, analytical, self-directed. \n \nTechnology Skills:  \nOffice Applications \nProficient in Microsoft Excel (e.g. Visual Basic Macros / Pivot Tables / Database Management) \nAdvanced in Microsoft Office Suite (Access Database / PowerPoint / Word)  \n \nFinancial Applications \nOracle Financial Modules (Labor Schedules & Adjustments, iJournals, IOU, PCard, Procurement, ReportMart3)  \nPeopleSoft Financials (NVision 2Tier Reporting) Throughout my career, I have been recognized for leading high-visibility financial management projects with diverse characteristics, and for driving customer satisfaction and compliant business performance. In addition, I seek to understand and listen to the customers being served, and to foster collaboration and mutual respect. \n \nProfessional Attributes: reliable, efficient, objective, organized, pragmatic, responsive, analytical, self-directed. \n \nTechnology Skills:  \nOffice Applications \nProficient in Microsoft Excel (e.g. Visual Basic Macros / Pivot Tables / Database Management) \nAdvanced in Microsoft Office Suite (Access Database / PowerPoint / Word)  \n \nFinancial Applications \nOracle Financial Modules (Labor Schedules & Adjustments, iJournals, IOU, PCard, Procurement, ReportMart3)  \nPeopleSoft Financials (NVision 2Tier Reporting) Experience Finance & Budget Analyst UC Davis September 2014  – Present (1 year) Davis, CA Finance Specialist Stanford University School of Medicine August 2012  –  August 2014  (2 years 1 month) Stanford, CA Responsible for managing Stanford faculty funding sources (federal/state/foundation research grants and University-provided professorships) for total grant funding of $4M. Confidential Bookkeeper Delaware North Companies June 2010  –  August 2012  (2 years 3 months) Yosemite National Park Perform financial analyses using advanced technical skills in Microsoft Excel, Peoplesoft, NVision 2Tier, and Microsoft Access. \nAid in budget creation and forecasting. \nTrack and forecast the park's shuttle and utilities cost recovery programs. Finance & Budget Analyst UC Davis September 2014  – Present (1 year) Davis, CA Finance & Budget Analyst UC Davis September 2014  – Present (1 year) Davis, CA Finance Specialist Stanford University School of Medicine August 2012  –  August 2014  (2 years 1 month) Stanford, CA Responsible for managing Stanford faculty funding sources (federal/state/foundation research grants and University-provided professorships) for total grant funding of $4M. Finance Specialist Stanford University School of Medicine August 2012  –  August 2014  (2 years 1 month) Stanford, CA Responsible for managing Stanford faculty funding sources (federal/state/foundation research grants and University-provided professorships) for total grant funding of $4M. Confidential Bookkeeper Delaware North Companies June 2010  –  August 2012  (2 years 3 months) Yosemite National Park Perform financial analyses using advanced technical skills in Microsoft Excel, Peoplesoft, NVision 2Tier, and Microsoft Access. \nAid in budget creation and forecasting. \nTrack and forecast the park's shuttle and utilities cost recovery programs. Confidential Bookkeeper Delaware North Companies June 2010  –  August 2012  (2 years 3 months) Yosemite National Park Perform financial analyses using advanced technical skills in Microsoft Excel, Peoplesoft, NVision 2Tier, and Microsoft Access. \nAid in budget creation and forecasting. \nTrack and forecast the park's shuttle and utilities cost recovery programs. Languages   Skills Microsoft Excel PeopleSoft Financial Microsoft Word nVision Accounts Payable Managerial Finance General Ledger Skills  Microsoft Excel PeopleSoft Financial Microsoft Word nVision Accounts Payable Managerial Finance General Ledger Microsoft Excel PeopleSoft Financial Microsoft Word nVision Accounts Payable Managerial Finance General Ledger Microsoft Excel PeopleSoft Financial Microsoft Word nVision Accounts Payable Managerial Finance General Ledger Education University of California, Davis Bachelors of Science,  Managerial Economics , Graduated with Honors (+3.5 GPA) 2005  – 2009 UC Berkeley Extension Accounting 2009  – 2012 I successfully completed additional accounting coursework (Auditing, Taxation for Corporations, Cost Accounting & Financial Accounting) to supplement my managerial economics degree. University of California, Davis Bachelors of Science,  Managerial Economics , Graduated with Honors (+3.5 GPA) 2005  – 2009 University of California, Davis Bachelors of Science,  Managerial Economics , Graduated with Honors (+3.5 GPA) 2005  – 2009 University of California, Davis Bachelors of Science,  Managerial Economics , Graduated with Honors (+3.5 GPA) 2005  – 2009 UC Berkeley Extension Accounting 2009  – 2012 I successfully completed additional accounting coursework (Auditing, Taxation for Corporations, Cost Accounting & Financial Accounting) to supplement my managerial economics degree. UC Berkeley Extension Accounting 2009  – 2012 I successfully completed additional accounting coursework (Auditing, Taxation for Corporations, Cost Accounting & Financial Accounting) to supplement my managerial economics degree. UC Berkeley Extension Accounting 2009  – 2012 I successfully completed additional accounting coursework (Auditing, Taxation for Corporations, Cost Accounting & Financial Accounting) to supplement my managerial economics degree. Honors & Awards Additional Honors & Awards Graduated with Honors \nDean's List 2006-2009 Additional Honors & Awards Graduated with Honors \nDean's List 2006-2009 Additional Honors & Awards Graduated with Honors \nDean's List 2006-2009 Additional Honors & Awards Graduated with Honors \nDean's List 2006-2009 ", "Education Notre Dame de Namur University MBA 2009  – 2011 Florida State University BA 2006  – 2008 Notre Dame de Namur University MBA 2009  – 2011 Notre Dame de Namur University MBA 2009  – 2011 Notre Dame de Namur University MBA 2009  – 2011 Florida State University BA 2006  – 2008 Florida State University BA 2006  – 2008 Florida State University BA 2006  – 2008 ", "Experience Finance Specialist Stanford University School of Medicine December 2013  – Present (1 year 9 months) Stanford, CA Bookkeeper and Customer Service Agent International Society of Gynecological Pathologists November 2011  – Present (3 years 10 months) Palo Alto, CA Finance Specialist Stanford University School of Medicine December 2013  – Present (1 year 9 months) Stanford, CA Finance Specialist Stanford University School of Medicine December 2013  – Present (1 year 9 months) Stanford, CA Bookkeeper and Customer Service Agent International Society of Gynecological Pathologists November 2011  – Present (3 years 10 months) Palo Alto, CA Bookkeeper and Customer Service Agent International Society of Gynecological Pathologists November 2011  – Present (3 years 10 months) Palo Alto, CA Skills Skills     ", "Experience Director of Finance Stanford University School of Medicine 2015  – Present (less than a year) Associate Director of Finance Stanford University School of Medicine 2009  –  2015  (6 years) Senior Finance Specialist Stanford University School of Medicine 2009  –  2009  (less than a year) Senior Financial Analyst The Clorox Company 2007  –  2009  (2 years) Senior Cost Analyst The Clorox Company 2005  –  2007  (2 years) Associate Market Intelligence Manager The Clorox Company 2003  –  2005  (2 years) Market Planning Manager Genentech 2001  –  2003  (2 years) Director of Finance Stanford University School of Medicine 2015  – Present (less than a year) Director of Finance Stanford University School of Medicine 2015  – Present (less than a year) Associate Director of Finance Stanford University School of Medicine 2009  –  2015  (6 years) Associate Director of Finance Stanford University School of Medicine 2009  –  2015  (6 years) Senior Finance Specialist Stanford University School of Medicine 2009  –  2009  (less than a year) Senior Finance Specialist Stanford University School of Medicine 2009  –  2009  (less than a year) Senior Financial Analyst The Clorox Company 2007  –  2009  (2 years) Senior Financial Analyst The Clorox Company 2007  –  2009  (2 years) Senior Cost Analyst The Clorox Company 2005  –  2007  (2 years) Senior Cost Analyst The Clorox Company 2005  –  2007  (2 years) Associate Market Intelligence Manager The Clorox Company 2003  –  2005  (2 years) Associate Market Intelligence Manager The Clorox Company 2003  –  2005  (2 years) Market Planning Manager Genentech 2001  –  2003  (2 years) Market Planning Manager Genentech 2001  –  2003  (2 years) Skills Financial Modeling Forecasting Finance Accounting Competitive Analysis Financial Reporting Hyperion Enterprise Variance Analysis Process Improvement Financial Analysis Analytics Sarbanes-Oxley Act Cross-functional Team... Strategic Planning Analysis Skills  Financial Modeling Forecasting Finance Accounting Competitive Analysis Financial Reporting Hyperion Enterprise Variance Analysis Process Improvement Financial Analysis Analytics Sarbanes-Oxley Act Cross-functional Team... Strategic Planning Analysis Financial Modeling Forecasting Finance Accounting Competitive Analysis Financial Reporting Hyperion Enterprise Variance Analysis Process Improvement Financial Analysis Analytics Sarbanes-Oxley Act Cross-functional Team... Strategic Planning Analysis Financial Modeling Forecasting Finance Accounting Competitive Analysis Financial Reporting Hyperion Enterprise Variance Analysis Process Improvement Financial Analysis Analytics Sarbanes-Oxley Act Cross-functional Team... Strategic Planning Analysis Education University of Southern California - Marshall School of Business 1999  – 2001 Carleton College 1991  – 1995 Nichols University of Southern California - Marshall School of Business 1999  – 2001 University of Southern California - Marshall School of Business 1999  – 2001 University of Southern California - Marshall School of Business 1999  – 2001 Carleton College 1991  – 1995 Carleton College 1991  – 1995 Carleton College 1991  – 1995 Nichols Nichols Nichols ", "Experience Business Development Nok Nok Labs December 2014  – Present (9 months) Palo Alto, CA Head of Business Development and Sales Operations. Manage the Strategic Technology Partner Program. Responsible for partner qualification and vetting. Manager - Applications Acquisitions Avira July 2014  –  December 2014  (6 months) Burlingame, CA Identifying and evaluating potential applications for acquisition and inclusion in the Avira portfolio. Creating and executing a robust strategy designed to dramatically improve the results of the North American acquisition team. Lead the day-to-day training, operations and methodology of the North American acquisition team and liaise with the European steering group on objectives and strategy. Channel Sales Manger - West Avira August 2013  –  July 2014  (1 year) Burlingame, CA Built a partnership pipeline from 0 to over 120 active participants. Restructured target profile of partners increasing partner acquisition from 10 per month to 75 per month. Update rolled out to entire NA operations. Prospected, contacted, negotiated and on-boarded over 150 partners and partner-prospects. Finance Specialist Stanford University Medical Center, Department of Pathology August 2012  –  June 2013  (11 months) Stanford, CA Reconciled 47 months and over $1.5M in account transactions. Approved and accounted for on-going transactions in Oracle Financials based on grant accounting. Developed training material specific to both the Finance and General Pathology personnel. Identified and corrected inefficiencies in accounting and approval methodology. Property Manager Daly Dilbeck Property Management November 2007  –  December 2012  (5 years 2 months) Accounting for receipt of $432,000 in annual contract compliance fees. Implemented client acquisition strategies that lead to a 20% increase in annual return. Negotiated contracts regarding tenancy, work-orders, long-term services and dispute settlement. Ensured building code compliance and compliance with California Fair Employment and Housing Act. Analyst, Broker Absolute Mortgage Banking July 2011  –  July 2012  (1 year 1 month) Palo Alto, CA Performed risk analysis on over 90 commercial, residential and multi-family real-estate investments. Directed over $56 million in real estate investment. Determined debt ratio and liquidity ratio for potential investors. Prepared valuation summaries on investment proposals. Performed due diligence on lending packages. Generated and maintained external referral relationships providing market and financial analysis. Founder / Owner / Consultant Prime Paradigm Consulting August 2009  –  July 2012  (3 years) Mountain View, CA Created consultancy geared to seed-level start-ups. Primary architect for $1M seed request from Founder’s Fund. Performed services relating to business structure, developed/refined business plans, forecasting of revenue, expenses and break-even points. Advised on branding and IP protection Marketing Specialist Good Samaritan Hospital April 2011  –  July 2011  (4 months) Implemented a Return-on-Investment framework for analysis of referral network. Streamlined physician referral system expanding it to 2,268 physicians. Improved hospital community outreach and involvement regarding over 81 monthly events. Optimized digital presence for physicians over 5 separate online databases. Legal Research Specialist Law Offices of Douglas Slain June 2009  –  August 2009  (3 months) Researched and summarized Regulation D and Blue Sky events including filings before the Securities and Exchange Commission. Project included review of three potential Ponzi schemes, two Broker-Dealer violations and one Accountant Suspension Legal Research Specialist Mount & Stoelker May 2009  –  July 2009  (3 months) Research project focused on real property transfer but also included issues such as fraud, dissolution of property subsequent divorce proceedings, procedural issues in entering an appeal by interested third party and potential remedies. Prepared memorandum including research results and recommendations. Legal Intern Rigel May 2007  –  August 2007  (4 months) Stock option valuation, burn rate and peer company benchmarking. Executive compensation and severance planning which was then adopted by Compensation Committee. Drafted non-disclosure, material transfer, service and research agreements. Admin Assistant Stanford Law School May 2004  –  August 2006  (2 years 4 months) Held support positions in both the Office of External Relations and the Office of Career Services. At the Office of External Relations I was the corporate sponsor liaison during Directors College. I performed biographical research on law school alumni. I was also the front line respondent for inquiries regarding the Stanford Law School. While at the Office of Career Services I edited the 1L Job Search Handbook, developed a statistical database for alumni employment and researched diversity pipeline techniques and prepared reports for Associate Dean of Career Services. Business Development Nok Nok Labs December 2014  – Present (9 months) Palo Alto, CA Head of Business Development and Sales Operations. Manage the Strategic Technology Partner Program. Responsible for partner qualification and vetting. Business Development Nok Nok Labs December 2014  – Present (9 months) Palo Alto, CA Head of Business Development and Sales Operations. Manage the Strategic Technology Partner Program. Responsible for partner qualification and vetting. Manager - Applications Acquisitions Avira July 2014  –  December 2014  (6 months) Burlingame, CA Identifying and evaluating potential applications for acquisition and inclusion in the Avira portfolio. Creating and executing a robust strategy designed to dramatically improve the results of the North American acquisition team. Lead the day-to-day training, operations and methodology of the North American acquisition team and liaise with the European steering group on objectives and strategy. Manager - Applications Acquisitions Avira July 2014  –  December 2014  (6 months) Burlingame, CA Identifying and evaluating potential applications for acquisition and inclusion in the Avira portfolio. Creating and executing a robust strategy designed to dramatically improve the results of the North American acquisition team. Lead the day-to-day training, operations and methodology of the North American acquisition team and liaise with the European steering group on objectives and strategy. Channel Sales Manger - West Avira August 2013  –  July 2014  (1 year) Burlingame, CA Built a partnership pipeline from 0 to over 120 active participants. Restructured target profile of partners increasing partner acquisition from 10 per month to 75 per month. Update rolled out to entire NA operations. Prospected, contacted, negotiated and on-boarded over 150 partners and partner-prospects. Channel Sales Manger - West Avira August 2013  –  July 2014  (1 year) Burlingame, CA Built a partnership pipeline from 0 to over 120 active participants. Restructured target profile of partners increasing partner acquisition from 10 per month to 75 per month. Update rolled out to entire NA operations. Prospected, contacted, negotiated and on-boarded over 150 partners and partner-prospects. Finance Specialist Stanford University Medical Center, Department of Pathology August 2012  –  June 2013  (11 months) Stanford, CA Reconciled 47 months and over $1.5M in account transactions. Approved and accounted for on-going transactions in Oracle Financials based on grant accounting. Developed training material specific to both the Finance and General Pathology personnel. Identified and corrected inefficiencies in accounting and approval methodology. Finance Specialist Stanford University Medical Center, Department of Pathology August 2012  –  June 2013  (11 months) Stanford, CA Reconciled 47 months and over $1.5M in account transactions. Approved and accounted for on-going transactions in Oracle Financials based on grant accounting. Developed training material specific to both the Finance and General Pathology personnel. Identified and corrected inefficiencies in accounting and approval methodology. Property Manager Daly Dilbeck Property Management November 2007  –  December 2012  (5 years 2 months) Accounting for receipt of $432,000 in annual contract compliance fees. Implemented client acquisition strategies that lead to a 20% increase in annual return. Negotiated contracts regarding tenancy, work-orders, long-term services and dispute settlement. Ensured building code compliance and compliance with California Fair Employment and Housing Act. Property Manager Daly Dilbeck Property Management November 2007  –  December 2012  (5 years 2 months) Accounting for receipt of $432,000 in annual contract compliance fees. Implemented client acquisition strategies that lead to a 20% increase in annual return. Negotiated contracts regarding tenancy, work-orders, long-term services and dispute settlement. Ensured building code compliance and compliance with California Fair Employment and Housing Act. Analyst, Broker Absolute Mortgage Banking July 2011  –  July 2012  (1 year 1 month) Palo Alto, CA Performed risk analysis on over 90 commercial, residential and multi-family real-estate investments. Directed over $56 million in real estate investment. Determined debt ratio and liquidity ratio for potential investors. Prepared valuation summaries on investment proposals. Performed due diligence on lending packages. Generated and maintained external referral relationships providing market and financial analysis. Analyst, Broker Absolute Mortgage Banking July 2011  –  July 2012  (1 year 1 month) Palo Alto, CA Performed risk analysis on over 90 commercial, residential and multi-family real-estate investments. Directed over $56 million in real estate investment. Determined debt ratio and liquidity ratio for potential investors. Prepared valuation summaries on investment proposals. Performed due diligence on lending packages. Generated and maintained external referral relationships providing market and financial analysis. Founder / Owner / Consultant Prime Paradigm Consulting August 2009  –  July 2012  (3 years) Mountain View, CA Created consultancy geared to seed-level start-ups. Primary architect for $1M seed request from Founder’s Fund. Performed services relating to business structure, developed/refined business plans, forecasting of revenue, expenses and break-even points. Advised on branding and IP protection Founder / Owner / Consultant Prime Paradigm Consulting August 2009  –  July 2012  (3 years) Mountain View, CA Created consultancy geared to seed-level start-ups. Primary architect for $1M seed request from Founder’s Fund. Performed services relating to business structure, developed/refined business plans, forecasting of revenue, expenses and break-even points. Advised on branding and IP protection Marketing Specialist Good Samaritan Hospital April 2011  –  July 2011  (4 months) Implemented a Return-on-Investment framework for analysis of referral network. Streamlined physician referral system expanding it to 2,268 physicians. Improved hospital community outreach and involvement regarding over 81 monthly events. Optimized digital presence for physicians over 5 separate online databases. Marketing Specialist Good Samaritan Hospital April 2011  –  July 2011  (4 months) Implemented a Return-on-Investment framework for analysis of referral network. Streamlined physician referral system expanding it to 2,268 physicians. Improved hospital community outreach and involvement regarding over 81 monthly events. Optimized digital presence for physicians over 5 separate online databases. Legal Research Specialist Law Offices of Douglas Slain June 2009  –  August 2009  (3 months) Researched and summarized Regulation D and Blue Sky events including filings before the Securities and Exchange Commission. Project included review of three potential Ponzi schemes, two Broker-Dealer violations and one Accountant Suspension Legal Research Specialist Law Offices of Douglas Slain June 2009  –  August 2009  (3 months) Researched and summarized Regulation D and Blue Sky events including filings before the Securities and Exchange Commission. Project included review of three potential Ponzi schemes, two Broker-Dealer violations and one Accountant Suspension Legal Research Specialist Mount & Stoelker May 2009  –  July 2009  (3 months) Research project focused on real property transfer but also included issues such as fraud, dissolution of property subsequent divorce proceedings, procedural issues in entering an appeal by interested third party and potential remedies. Prepared memorandum including research results and recommendations. Legal Research Specialist Mount & Stoelker May 2009  –  July 2009  (3 months) Research project focused on real property transfer but also included issues such as fraud, dissolution of property subsequent divorce proceedings, procedural issues in entering an appeal by interested third party and potential remedies. Prepared memorandum including research results and recommendations. Legal Intern Rigel May 2007  –  August 2007  (4 months) Stock option valuation, burn rate and peer company benchmarking. Executive compensation and severance planning which was then adopted by Compensation Committee. Drafted non-disclosure, material transfer, service and research agreements. Legal Intern Rigel May 2007  –  August 2007  (4 months) Stock option valuation, burn rate and peer company benchmarking. Executive compensation and severance planning which was then adopted by Compensation Committee. Drafted non-disclosure, material transfer, service and research agreements. Admin Assistant Stanford Law School May 2004  –  August 2006  (2 years 4 months) Held support positions in both the Office of External Relations and the Office of Career Services. At the Office of External Relations I was the corporate sponsor liaison during Directors College. I performed biographical research on law school alumni. I was also the front line respondent for inquiries regarding the Stanford Law School. While at the Office of Career Services I edited the 1L Job Search Handbook, developed a statistical database for alumni employment and researched diversity pipeline techniques and prepared reports for Associate Dean of Career Services. Admin Assistant Stanford Law School May 2004  –  August 2006  (2 years 4 months) Held support positions in both the Office of External Relations and the Office of Career Services. At the Office of External Relations I was the corporate sponsor liaison during Directors College. I performed biographical research on law school alumni. I was also the front line respondent for inquiries regarding the Stanford Law School. While at the Office of Career Services I edited the 1L Job Search Handbook, developed a statistical database for alumni employment and researched diversity pipeline techniques and prepared reports for Associate Dean of Career Services. Languages French French French Skills Financial Analysis Sales Corporate Development Business Development Strategy Entrepreneurship Finance Due Diligence Strategic Partnerships Business Strategy Software Sales... Negotiation Competitive Analysis Mergers & Acquisitions Start-ups Valuation French Marketing Strategy Investments Contract Negotiation Software Solution Sales Management Mergers Acquisitions Portfolio Management Real Estate Financing Cash Flow Oracle Financial Consulting Corporate Law See 15+     See less Skills  Financial Analysis Sales Corporate Development Business Development Strategy Entrepreneurship Finance Due Diligence Strategic Partnerships Business Strategy Software Sales... Negotiation Competitive Analysis Mergers & Acquisitions Start-ups Valuation French Marketing Strategy Investments Contract Negotiation Software Solution Sales Management Mergers Acquisitions Portfolio Management Real Estate Financing Cash Flow Oracle Financial Consulting Corporate Law See 15+     See less Financial Analysis Sales Corporate Development Business Development Strategy Entrepreneurship Finance Due Diligence Strategic Partnerships Business Strategy Software Sales... Negotiation Competitive Analysis Mergers & Acquisitions Start-ups Valuation French Marketing Strategy Investments Contract Negotiation Software Solution Sales Management Mergers Acquisitions Portfolio Management Real Estate Financing Cash Flow Oracle Financial Consulting Corporate Law See 15+     See less Financial Analysis Sales Corporate Development Business Development Strategy Entrepreneurship Finance Due Diligence Strategic Partnerships Business Strategy Software Sales... Negotiation Competitive Analysis Mergers & Acquisitions Start-ups Valuation French Marketing Strategy Investments Contract Negotiation Software Solution Sales Management Mergers Acquisitions Portfolio Management Real Estate Financing Cash Flow Oracle Financial Consulting Corporate Law See 15+     See less Education Santa Clara University Leavy School of Business MBA,  Finance 2007  – 2012 Activities and Societies:  Winner- Belotti Prize Spring 2012 ,  Member-Real Estate Network ,  Finance Network ,  Consulting Club Santa Clara University School of Law JD,  Corporate Law 2006  – 2010 University of Utah BA,  Philosophy 2005  – 2006 Utah Valley University AOS,  Philosophy 2004  – 2005 Activities and Societies:  Member-Phi Theta Kappa Honors Society ,  Vice President-Phi Sigma Tau (Philosophy Honor's Society) ,  Founder and Editor-Dialectic: UVU's Journal of Undergraduate Philosophy. Timpview High School Timpview High School Santa Clara University Leavy School of Business MBA,  Finance 2007  – 2012 Activities and Societies:  Winner- Belotti Prize Spring 2012 ,  Member-Real Estate Network ,  Finance Network ,  Consulting Club Santa Clara University Leavy School of Business MBA,  Finance 2007  – 2012 Activities and Societies:  Winner- Belotti Prize Spring 2012 ,  Member-Real Estate Network ,  Finance Network ,  Consulting Club Santa Clara University Leavy School of Business MBA,  Finance 2007  – 2012 Activities and Societies:  Winner- Belotti Prize Spring 2012 ,  Member-Real Estate Network ,  Finance Network ,  Consulting Club Santa Clara University School of Law JD,  Corporate Law 2006  – 2010 Santa Clara University School of Law JD,  Corporate Law 2006  – 2010 Santa Clara University School of Law JD,  Corporate Law 2006  – 2010 University of Utah BA,  Philosophy 2005  – 2006 University of Utah BA,  Philosophy 2005  – 2006 University of Utah BA,  Philosophy 2005  – 2006 Utah Valley University AOS,  Philosophy 2004  – 2005 Activities and Societies:  Member-Phi Theta Kappa Honors Society ,  Vice President-Phi Sigma Tau (Philosophy Honor's Society) ,  Founder and Editor-Dialectic: UVU's Journal of Undergraduate Philosophy. Utah Valley University AOS,  Philosophy 2004  – 2005 Activities and Societies:  Member-Phi Theta Kappa Honors Society ,  Vice President-Phi Sigma Tau (Philosophy Honor's Society) ,  Founder and Editor-Dialectic: UVU's Journal of Undergraduate Philosophy. Utah Valley University AOS,  Philosophy 2004  – 2005 Activities and Societies:  Member-Phi Theta Kappa Honors Society ,  Vice President-Phi Sigma Tau (Philosophy Honor's Society) ,  Founder and Editor-Dialectic: UVU's Journal of Undergraduate Philosophy. Timpview High School Timpview High School Timpview High School Timpview High School Timpview High School Timpview High School ", "Experience Senior Finance Specialist Stanford University September 2014  – Present (1 year) Financial Analyst Apple November 2008  –  August 2014  (5 years 10 months) Financial Analyst Applied Materials September 2006  –  November 2008  (2 years 3 months) Credit Analyst Grand Pacific Financing Corporation December 2004  –  June 2006  (1 year 7 months) Senior Finance Specialist Stanford University September 2014  – Present (1 year) Senior Finance Specialist Stanford University September 2014  – Present (1 year) Financial Analyst Apple November 2008  –  August 2014  (5 years 10 months) Financial Analyst Apple November 2008  –  August 2014  (5 years 10 months) Financial Analyst Applied Materials September 2006  –  November 2008  (2 years 3 months) Financial Analyst Applied Materials September 2006  –  November 2008  (2 years 3 months) Credit Analyst Grand Pacific Financing Corporation December 2004  –  June 2006  (1 year 7 months) Credit Analyst Grand Pacific Financing Corporation December 2004  –  June 2006  (1 year 7 months) Languages Chinese Chinese Chinese Skills Forecasting Financial Modeling Financial Analysis Process Improvement SAP Financial Reporting Finance Budgets Analysis Microsoft Excel Microsoft Office Corporate Finance Accounting Financial Planning Business Process... Skills  Forecasting Financial Modeling Financial Analysis Process Improvement SAP Financial Reporting Finance Budgets Analysis Microsoft Excel Microsoft Office Corporate Finance Accounting Financial Planning Business Process... Forecasting Financial Modeling Financial Analysis Process Improvement SAP Financial Reporting Finance Budgets Analysis Microsoft Excel Microsoft Office Corporate Finance Accounting Financial Planning Business Process... Forecasting Financial Modeling Financial Analysis Process Improvement SAP Financial Reporting Finance Budgets Analysis Microsoft Excel Microsoft Office Corporate Finance Accounting Financial Planning Business Process... Education Duke University MA,  Economics 2002  – 2004 National Taipei University BA,  Economics 1998  – 2002 Duke University MA,  Economics 2002  – 2004 Duke University MA,  Economics 2002  – 2004 Duke University MA,  Economics 2002  – 2004 National Taipei University BA,  Economics 1998  – 2002 National Taipei University BA,  Economics 1998  – 2002 National Taipei University BA,  Economics 1998  – 2002 ", "Experience Accounting/Finance Associate Stanford Management Company October 2014  – Present (11 months) Stanford University Finance Specialist Stanford University School of Medicine December 2011  –  October 2014  (2 years 11 months) Contractor Blackhawk Network March 2011  –  December 2011  (10 months) Project Coordinator/Assistant Buyer Iron Systems, Inc March 2010  –  November 2010  (9 months) Account Manager SYNNEX CORP. October 2007  –  December 2008  (1 year 3 months) Account Executive HSBC October 2006  –  October 2007  (1 year 1 month) Accounting/Finance Associate Stanford Management Company October 2014  – Present (11 months) Stanford University Accounting/Finance Associate Stanford Management Company October 2014  – Present (11 months) Stanford University Finance Specialist Stanford University School of Medicine December 2011  –  October 2014  (2 years 11 months) Finance Specialist Stanford University School of Medicine December 2011  –  October 2014  (2 years 11 months) Contractor Blackhawk Network March 2011  –  December 2011  (10 months) Contractor Blackhawk Network March 2011  –  December 2011  (10 months) Project Coordinator/Assistant Buyer Iron Systems, Inc March 2010  –  November 2010  (9 months) Project Coordinator/Assistant Buyer Iron Systems, Inc March 2010  –  November 2010  (9 months) Account Manager SYNNEX CORP. October 2007  –  December 2008  (1 year 3 months) Account Manager SYNNEX CORP. October 2007  –  December 2008  (1 year 3 months) Account Executive HSBC October 2006  –  October 2007  (1 year 1 month) Account Executive HSBC October 2006  –  October 2007  (1 year 1 month) Languages Vietnamese Native or bilingual proficiency Vietnamese Native or bilingual proficiency Vietnamese Native or bilingual proficiency Native or bilingual proficiency Skills Customer Service Microsoft Excel PowerPoint Data Analysis Research Outlook Microsoft Word Photoshop Accounting Salesforce.com Data Entry English Microsoft Office Event Planning Windows Time Management Analysis Budgets Financial Analysis Management Social Media Access See 7+     See less Skills  Customer Service Microsoft Excel PowerPoint Data Analysis Research Outlook Microsoft Word Photoshop Accounting Salesforce.com Data Entry English Microsoft Office Event Planning Windows Time Management Analysis Budgets Financial Analysis Management Social Media Access See 7+     See less Customer Service Microsoft Excel PowerPoint Data Analysis Research Outlook Microsoft Word Photoshop Accounting Salesforce.com Data Entry English Microsoft Office Event Planning Windows Time Management Analysis Budgets Financial Analysis Management Social Media Access See 7+     See less Customer Service Microsoft Excel PowerPoint Data Analysis Research Outlook Microsoft Word Photoshop Accounting Salesforce.com Data Entry English Microsoft Office Event Planning Windows Time Management Analysis Budgets Financial Analysis Management Social Media Access See 7+     See less Education University of California, Davis B.A,  Economics (Double Minors: Communications; Textiles and Clothing) 2002  – 2006 International Business Association (IBA) \nSigma Omicron Pi University of California, Davis B.A,  Economics (Double Minors: Communications; Textiles and Clothing) 2002  – 2006 International Business Association (IBA) \nSigma Omicron Pi University of California, Davis B.A,  Economics (Double Minors: Communications; Textiles and Clothing) 2002  – 2006 International Business Association (IBA) \nSigma Omicron Pi University of California, Davis B.A,  Economics (Double Minors: Communications; Textiles and Clothing) 2002  – 2006 International Business Association (IBA) \nSigma Omicron Pi ", "Experience Finance Specialist Stanford University Senior Budget Analyst UCSF 2000  –  2010  (10 years) Finance Specialist Stanford University Finance Specialist Stanford University Senior Budget Analyst UCSF 2000  –  2010  (10 years) Senior Budget Analyst UCSF 2000  –  2010  (10 years) Skills Data Analysis Financial Modeling Economics Accounting Financial Analysis Financial Reporting Microsoft Office Finance Statistics Program Evaluation Skills  Data Analysis Financial Modeling Economics Accounting Financial Analysis Financial Reporting Microsoft Office Finance Statistics Program Evaluation Data Analysis Financial Modeling Economics Accounting Financial Analysis Financial Reporting Microsoft Office Finance Statistics Program Evaluation Data Analysis Financial Modeling Economics Accounting Financial Analysis Financial Reporting Microsoft Office Finance Statistics Program Evaluation ", "Summary Talented and accomplished professional with more than 8 years of combined experience in accounting, financial analysis and management. Proven ability to supervise effective teams, oversee daily operation, improve workflow, efficiency, and accuracy. Expertise in financial reporting, data analysis, reconciliations, grant management, budget preparation, policy interpretation and implementation. Able to liaison, and to establish relationships with, vendors and service providers. Thrive under challenging circumstances and enjoy setting goals which are difficult to achieve. Summary Talented and accomplished professional with more than 8 years of combined experience in accounting, financial analysis and management. Proven ability to supervise effective teams, oversee daily operation, improve workflow, efficiency, and accuracy. Expertise in financial reporting, data analysis, reconciliations, grant management, budget preparation, policy interpretation and implementation. Able to liaison, and to establish relationships with, vendors and service providers. Thrive under challenging circumstances and enjoy setting goals which are difficult to achieve. Talented and accomplished professional with more than 8 years of combined experience in accounting, financial analysis and management. Proven ability to supervise effective teams, oversee daily operation, improve workflow, efficiency, and accuracy. Expertise in financial reporting, data analysis, reconciliations, grant management, budget preparation, policy interpretation and implementation. Able to liaison, and to establish relationships with, vendors and service providers. Thrive under challenging circumstances and enjoy setting goals which are difficult to achieve. Talented and accomplished professional with more than 8 years of combined experience in accounting, financial analysis and management. Proven ability to supervise effective teams, oversee daily operation, improve workflow, efficiency, and accuracy. Expertise in financial reporting, data analysis, reconciliations, grant management, budget preparation, policy interpretation and implementation. Able to liaison, and to establish relationships with, vendors and service providers. Thrive under challenging circumstances and enjoy setting goals which are difficult to achieve. Experience Finance Managment Analyst SLAC National Accelerator Laboratory March 2015  – Present (6 months) Menlo Park, California Business Process and Accounting Manager CSofSC February 2014  – Present (1 year 7 months) San Carlos Associate Division Manager Stanford University November 2011  –  May 2014  (2 years 7 months) ▪\tStrategically standardize processes around research administration for a division of 12 million dollar yearly income \n▪\tSuccessfully support 12-15 faculty members and their programs in their research endeavors  \n▪\tCreate transparent financial planning for each research programs  \n▪\tDevelop job descriptions, participate in hiring process, train and orient new staff \n▪\tGuide, mentor and supervise several staff members as well as manage their process and workload \n▪\tCollaborate with cross functional teams \n▪\tApprove financial transactions for a division of 200 (estimated average daily expenses 20K-50K) \n▪\tPrepare long term projections for the research function of the division to ensure viable operation \n▪\tCreate and present high level financial managerial reports and charts to senior academic and managerial staff to review and project research administration for the division \n▪\tConduct internal division audit and effectively responded to A133 audit requests \n▪\tLead several projects and assign duties to meet strict sponsor and university deadlines \n▪\tPrepare recommendations to improve internal controls and increase efficiency of information flow by evaluating and adhering to complex university and sponsor rule and regulations \n▪\tCollaborate with contract officers, RMG and sponsors to negotiation contract terms and conditions \n▪\tFunction as a finance manager for several large and complex sponsored grants and contracts Finance Specialist Stanford University January 2009  –  October 2011  (2 years 10 months) ▪\tLead monthly meetings for Administrative staff to improve communication, technical skills and to create a cohesive work environment \n▪\tSupervise finance assistants and collaborate with other several staff \n▪\tConduct periodic Division internal audits to assist with compliance and monitor efficient/accurate use of funds \n▪\tPrepared interim and final financial reports per sponsor request \n▪\tEnsure consistency of coding, categorization of expenses and oversee compliance with Sponsor and University rules & regulations \n▪\tReview and approve financial transactions, invoices for contracts, subcontracts, awards and A/P \n▪\tReconcile project expenses and verify spending to ensure funds are available to cover the life of the project \n▪\tOversight of the timely certification monthly and quarterly process for all accounts working closely with the PIs  \n▪\tSet up and analyze contracts and consultant requisitions Finance Assistant Stanford University School of Medicine December 2006  –  December 2008  (2 years 1 month) ▪\tMonitor grants and contracts throughout project life cycle ensuring University and sponsor policies \n▪\tPerform complex and detailed reconciliation of grants and contracts with minimal supervision \n▪\tAnalyze financial reports and allocate expenses with the use of Oracle Financials \n▪\tInterpret complex government policies and procedures to follow rules and regulations \n▪\tApprove and verify business transactions for the Division of Neonatology \n▪\tAssist financial analyst and division manager in daily finance activities and in fiscal year closing \n▪\tRespond to internal and assist in federal audits \n▪\tHelp other administrative staff to clarify university and department procedures \n▪\tCreate and maintain a Master workspace to report nursing effort to NIH  \n▪\tTrain personnel to learn the use of databases \n▪\tReview new contracts and provide guidance to internal customers on contract terms and conditions Volunteer Stanford University June 2006  –  November 2006  (6 months) Palo Alto, CA ▪\tObtain good understanding of grant management \n▪\tLearn to use Oracle finance application  \n▪\tBuild relationship with costumers and staff members Bookkeeper Electric BT, Hungary 1999  –  March 2000  (1 year) Hungary ▪\tProcess and authorize accounts payable and accounts receivable \n▪\tAllocate expenses to ongoing projects \n▪\tAuthorize expense reports \n▪\tReconcile and manage bank accounts  \n▪\tManage Payroll \n▪\tResponsible for contract review and software revenue recognition.  \n▪\tAssist in the preparation of both international and domestic inter-company transfer pricing documentation, and calculations \n▪\tReconcile deferred revenue accounts and inter-company balances Finance Managment Analyst SLAC National Accelerator Laboratory March 2015  – Present (6 months) Menlo Park, California Finance Managment Analyst SLAC National Accelerator Laboratory March 2015  – Present (6 months) Menlo Park, California Business Process and Accounting Manager CSofSC February 2014  – Present (1 year 7 months) San Carlos Business Process and Accounting Manager CSofSC February 2014  – Present (1 year 7 months) San Carlos Associate Division Manager Stanford University November 2011  –  May 2014  (2 years 7 months) ▪\tStrategically standardize processes around research administration for a division of 12 million dollar yearly income \n▪\tSuccessfully support 12-15 faculty members and their programs in their research endeavors  \n▪\tCreate transparent financial planning for each research programs  \n▪\tDevelop job descriptions, participate in hiring process, train and orient new staff \n▪\tGuide, mentor and supervise several staff members as well as manage their process and workload \n▪\tCollaborate with cross functional teams \n▪\tApprove financial transactions for a division of 200 (estimated average daily expenses 20K-50K) \n▪\tPrepare long term projections for the research function of the division to ensure viable operation \n▪\tCreate and present high level financial managerial reports and charts to senior academic and managerial staff to review and project research administration for the division \n▪\tConduct internal division audit and effectively responded to A133 audit requests \n▪\tLead several projects and assign duties to meet strict sponsor and university deadlines \n▪\tPrepare recommendations to improve internal controls and increase efficiency of information flow by evaluating and adhering to complex university and sponsor rule and regulations \n▪\tCollaborate with contract officers, RMG and sponsors to negotiation contract terms and conditions \n▪\tFunction as a finance manager for several large and complex sponsored grants and contracts Associate Division Manager Stanford University November 2011  –  May 2014  (2 years 7 months) ▪\tStrategically standardize processes around research administration for a division of 12 million dollar yearly income \n▪\tSuccessfully support 12-15 faculty members and their programs in their research endeavors  \n▪\tCreate transparent financial planning for each research programs  \n▪\tDevelop job descriptions, participate in hiring process, train and orient new staff \n▪\tGuide, mentor and supervise several staff members as well as manage their process and workload \n▪\tCollaborate with cross functional teams \n▪\tApprove financial transactions for a division of 200 (estimated average daily expenses 20K-50K) \n▪\tPrepare long term projections for the research function of the division to ensure viable operation \n▪\tCreate and present high level financial managerial reports and charts to senior academic and managerial staff to review and project research administration for the division \n▪\tConduct internal division audit and effectively responded to A133 audit requests \n▪\tLead several projects and assign duties to meet strict sponsor and university deadlines \n▪\tPrepare recommendations to improve internal controls and increase efficiency of information flow by evaluating and adhering to complex university and sponsor rule and regulations \n▪\tCollaborate with contract officers, RMG and sponsors to negotiation contract terms and conditions \n▪\tFunction as a finance manager for several large and complex sponsored grants and contracts Finance Specialist Stanford University January 2009  –  October 2011  (2 years 10 months) ▪\tLead monthly meetings for Administrative staff to improve communication, technical skills and to create a cohesive work environment \n▪\tSupervise finance assistants and collaborate with other several staff \n▪\tConduct periodic Division internal audits to assist with compliance and monitor efficient/accurate use of funds \n▪\tPrepared interim and final financial reports per sponsor request \n▪\tEnsure consistency of coding, categorization of expenses and oversee compliance with Sponsor and University rules & regulations \n▪\tReview and approve financial transactions, invoices for contracts, subcontracts, awards and A/P \n▪\tReconcile project expenses and verify spending to ensure funds are available to cover the life of the project \n▪\tOversight of the timely certification monthly and quarterly process for all accounts working closely with the PIs  \n▪\tSet up and analyze contracts and consultant requisitions Finance Specialist Stanford University January 2009  –  October 2011  (2 years 10 months) ▪\tLead monthly meetings for Administrative staff to improve communication, technical skills and to create a cohesive work environment \n▪\tSupervise finance assistants and collaborate with other several staff \n▪\tConduct periodic Division internal audits to assist with compliance and monitor efficient/accurate use of funds \n▪\tPrepared interim and final financial reports per sponsor request \n▪\tEnsure consistency of coding, categorization of expenses and oversee compliance with Sponsor and University rules & regulations \n▪\tReview and approve financial transactions, invoices for contracts, subcontracts, awards and A/P \n▪\tReconcile project expenses and verify spending to ensure funds are available to cover the life of the project \n▪\tOversight of the timely certification monthly and quarterly process for all accounts working closely with the PIs  \n▪\tSet up and analyze contracts and consultant requisitions Finance Assistant Stanford University School of Medicine December 2006  –  December 2008  (2 years 1 month) ▪\tMonitor grants and contracts throughout project life cycle ensuring University and sponsor policies \n▪\tPerform complex and detailed reconciliation of grants and contracts with minimal supervision \n▪\tAnalyze financial reports and allocate expenses with the use of Oracle Financials \n▪\tInterpret complex government policies and procedures to follow rules and regulations \n▪\tApprove and verify business transactions for the Division of Neonatology \n▪\tAssist financial analyst and division manager in daily finance activities and in fiscal year closing \n▪\tRespond to internal and assist in federal audits \n▪\tHelp other administrative staff to clarify university and department procedures \n▪\tCreate and maintain a Master workspace to report nursing effort to NIH  \n▪\tTrain personnel to learn the use of databases \n▪\tReview new contracts and provide guidance to internal customers on contract terms and conditions Finance Assistant Stanford University School of Medicine December 2006  –  December 2008  (2 years 1 month) ▪\tMonitor grants and contracts throughout project life cycle ensuring University and sponsor policies \n▪\tPerform complex and detailed reconciliation of grants and contracts with minimal supervision \n▪\tAnalyze financial reports and allocate expenses with the use of Oracle Financials \n▪\tInterpret complex government policies and procedures to follow rules and regulations \n▪\tApprove and verify business transactions for the Division of Neonatology \n▪\tAssist financial analyst and division manager in daily finance activities and in fiscal year closing \n▪\tRespond to internal and assist in federal audits \n▪\tHelp other administrative staff to clarify university and department procedures \n▪\tCreate and maintain a Master workspace to report nursing effort to NIH  \n▪\tTrain personnel to learn the use of databases \n▪\tReview new contracts and provide guidance to internal customers on contract terms and conditions Volunteer Stanford University June 2006  –  November 2006  (6 months) Palo Alto, CA ▪\tObtain good understanding of grant management \n▪\tLearn to use Oracle finance application  \n▪\tBuild relationship with costumers and staff members Volunteer Stanford University June 2006  –  November 2006  (6 months) Palo Alto, CA ▪\tObtain good understanding of grant management \n▪\tLearn to use Oracle finance application  \n▪\tBuild relationship with costumers and staff members Bookkeeper Electric BT, Hungary 1999  –  March 2000  (1 year) Hungary ▪\tProcess and authorize accounts payable and accounts receivable \n▪\tAllocate expenses to ongoing projects \n▪\tAuthorize expense reports \n▪\tReconcile and manage bank accounts  \n▪\tManage Payroll \n▪\tResponsible for contract review and software revenue recognition.  \n▪\tAssist in the preparation of both international and domestic inter-company transfer pricing documentation, and calculations \n▪\tReconcile deferred revenue accounts and inter-company balances Bookkeeper Electric BT, Hungary 1999  –  March 2000  (1 year) Hungary ▪\tProcess and authorize accounts payable and accounts receivable \n▪\tAllocate expenses to ongoing projects \n▪\tAuthorize expense reports \n▪\tReconcile and manage bank accounts  \n▪\tManage Payroll \n▪\tResponsible for contract review and software revenue recognition.  \n▪\tAssist in the preparation of both international and domestic inter-company transfer pricing documentation, and calculations \n▪\tReconcile deferred revenue accounts and inter-company balances Languages English Native or bilingual proficiency Hungarian English Native or bilingual proficiency Hungarian English Native or bilingual proficiency Hungarian Native or bilingual proficiency Skills Data Analysis Nonprofits Microsoft Excel Microsoft Office PowerPoint Project Management Public Speaking Analysis Financial Analysis Policy Analysis Budgets Payroll Contract Management Strategic Planning Negotiation Leadership Auditing Conflict Resolution Employee Training Operations Management Mentoring Supervising Hiring Financial Modeling Collaboration Event Planning Curriculum Development Hungarian Research Accounting Program Management Financial Reporting Account Reconciliation Finance Accounts Receivable Accounts Payable Internal Audit Internal Controls Financial Statements Variance Analysis Microsoft Word Customer Service See 27+     See less Skills  Data Analysis Nonprofits Microsoft Excel Microsoft Office PowerPoint Project Management Public Speaking Analysis Financial Analysis Policy Analysis Budgets Payroll Contract Management Strategic Planning Negotiation Leadership Auditing Conflict Resolution Employee Training Operations Management Mentoring Supervising Hiring Financial Modeling Collaboration Event Planning Curriculum Development Hungarian Research Accounting Program Management Financial Reporting Account Reconciliation Finance Accounts Receivable Accounts Payable Internal Audit Internal Controls Financial Statements Variance Analysis Microsoft Word Customer Service See 27+     See less Data Analysis Nonprofits Microsoft Excel Microsoft Office PowerPoint Project Management Public Speaking Analysis Financial Analysis Policy Analysis Budgets Payroll Contract Management Strategic Planning Negotiation Leadership Auditing Conflict Resolution Employee Training Operations Management Mentoring Supervising Hiring Financial Modeling Collaboration Event Planning Curriculum Development Hungarian Research Accounting Program Management Financial Reporting Account Reconciliation Finance Accounts Receivable Accounts Payable Internal Audit Internal Controls Financial Statements Variance Analysis Microsoft Word Customer Service See 27+     See less Data Analysis Nonprofits Microsoft Excel Microsoft Office PowerPoint Project Management Public Speaking Analysis Financial Analysis Policy Analysis Budgets Payroll Contract Management Strategic Planning Negotiation Leadership Auditing Conflict Resolution Employee Training Operations Management Mentoring Supervising Hiring Financial Modeling Collaboration Event Planning Curriculum Development Hungarian Research Accounting Program Management Financial Reporting Account Reconciliation Finance Accounts Receivable Accounts Payable Internal Audit Internal Controls Financial Statements Variance Analysis Microsoft Word Customer Service See 27+     See less Education San Jose State University BS,  Accounting & Information Systems 2006  – 2008 Activities and Societies:  SRA ,  NCURA ,  National Association of Professional Women MMI Real Estate San Jose State University BS,  Accounting & Information Systems 2006  – 2008 Activities and Societies:  SRA ,  NCURA ,  National Association of Professional Women San Jose State University BS,  Accounting & Information Systems 2006  – 2008 Activities and Societies:  SRA ,  NCURA ,  National Association of Professional Women San Jose State University BS,  Accounting & Information Systems 2006  – 2008 Activities and Societies:  SRA ,  NCURA ,  National Association of Professional Women MMI MMI MMI Real Estate Real Estate Real Estate ", "Experience Finance Specialist Stanford University June 2014  – Present (1 year 3 months) Stanford, CA • Managed all finance, procurement, and accounting activities for several departments within the office of Educational Programs and Services \n• Reconciled monthly expenditure statements and prepared monthly projections \n• Processed financial transactions, including iJournals, reimbursements, labor distributions/adjustments, and invoice payments \n• Took role as the liaison between principal investigators and the research management group and office of sponsored research \n• Managed the internal pre-award process of grants and post-award sponsored funding \n• Provided high level projections, analyses and reporting Budget Analyst Tufts University School of Dental Medicine June 2013  –  June 2014  (1 year 1 month) Greater Boston Area •Develop and deliver the Dental School’s annual budget and quarterly forecasts to the University’s central finance team for consolidation into the University’s budget \n•Oversee month-end and year-end processes for all School operations, including reviewing reports, preparing and processing month end journal entries, and reconciling accounts  \n•Organize, prepare, and present briefings to executive team, department chairs and managers to assist with budget planning, and department level analytic support \n•Strategize with executive team to identify risks and opportunities and evaluate their operational feasibility \n•Critically evaluate and synthesize large sets of data and continuously worked to enhance financial reporting \n•Implement reporting and analysis of key metrics to be measured on a recurring basis \n•Support both internal and external audits \n•Act as customer point of contact for all financial inquires \n•Mentor and delegate work to the Budget & Accounting Coordinator Budget Administrator Tufts University School of Dental Medicine May 2012  –  May 2013  (1 year 1 month) Boston, MA •Assisted with the development and preparation of the Dental School’s annual budgets and quarterly projections  \n•Prepared month end journal entries and reconciled administrative accounts \n•Reconciled monthly results (budget vs. actuals) for clinic operations and provided analysis on discrepancies and evaluated trends \n•Supported departments in meeting their financial goals by providing assistance with financial issues and school policies \n•Facilitated departments with the completion of standard university forms (expense reimbursements, purchase orders, HR forms) and provided training for support staff to ensure proficiency  \n•Developed office procedures and protocols to maintain compliance with University policies and procedures Budget & Accounting Coordinator Tufts University School of Dental Medicine July 2009  –  April 2012  (2 years 10 months) Greater Boston Area •Assisted with the development and preparation of annual budget and quarterly projection templates  \n•Reconciled monthly results (budget vs. actuals) \n•Provided professional office coordination and support for the Office of Finance and Administration \n•Served as the front line contact for all internal and external customers, providing exceptional customer service by trouble shooting issues and prioritizing requests Intern Axial Financial Group September 2007  –  June 2009  (1 year 10 months) Burlington, MA •Assisted in preparation of Cost Basis Analysis \n•Developed group informational packets which were used to introduce clients to the financial tools and capabilities offered by the group to optimize client investments \n•Organized client portfolios  \n•Marketed company events, designed direct mailers and assisted in the organization of client events Finance Specialist Stanford University June 2014  – Present (1 year 3 months) Stanford, CA • Managed all finance, procurement, and accounting activities for several departments within the office of Educational Programs and Services \n• Reconciled monthly expenditure statements and prepared monthly projections \n• Processed financial transactions, including iJournals, reimbursements, labor distributions/adjustments, and invoice payments \n• Took role as the liaison between principal investigators and the research management group and office of sponsored research \n• Managed the internal pre-award process of grants and post-award sponsored funding \n• Provided high level projections, analyses and reporting Finance Specialist Stanford University June 2014  – Present (1 year 3 months) Stanford, CA • Managed all finance, procurement, and accounting activities for several departments within the office of Educational Programs and Services \n• Reconciled monthly expenditure statements and prepared monthly projections \n• Processed financial transactions, including iJournals, reimbursements, labor distributions/adjustments, and invoice payments \n• Took role as the liaison between principal investigators and the research management group and office of sponsored research \n• Managed the internal pre-award process of grants and post-award sponsored funding \n• Provided high level projections, analyses and reporting Budget Analyst Tufts University School of Dental Medicine June 2013  –  June 2014  (1 year 1 month) Greater Boston Area •Develop and deliver the Dental School’s annual budget and quarterly forecasts to the University’s central finance team for consolidation into the University’s budget \n•Oversee month-end and year-end processes for all School operations, including reviewing reports, preparing and processing month end journal entries, and reconciling accounts  \n•Organize, prepare, and present briefings to executive team, department chairs and managers to assist with budget planning, and department level analytic support \n•Strategize with executive team to identify risks and opportunities and evaluate their operational feasibility \n•Critically evaluate and synthesize large sets of data and continuously worked to enhance financial reporting \n•Implement reporting and analysis of key metrics to be measured on a recurring basis \n•Support both internal and external audits \n•Act as customer point of contact for all financial inquires \n•Mentor and delegate work to the Budget & Accounting Coordinator Budget Analyst Tufts University School of Dental Medicine June 2013  –  June 2014  (1 year 1 month) Greater Boston Area •Develop and deliver the Dental School’s annual budget and quarterly forecasts to the University’s central finance team for consolidation into the University’s budget \n•Oversee month-end and year-end processes for all School operations, including reviewing reports, preparing and processing month end journal entries, and reconciling accounts  \n•Organize, prepare, and present briefings to executive team, department chairs and managers to assist with budget planning, and department level analytic support \n•Strategize with executive team to identify risks and opportunities and evaluate their operational feasibility \n•Critically evaluate and synthesize large sets of data and continuously worked to enhance financial reporting \n•Implement reporting and analysis of key metrics to be measured on a recurring basis \n•Support both internal and external audits \n•Act as customer point of contact for all financial inquires \n•Mentor and delegate work to the Budget & Accounting Coordinator Budget Administrator Tufts University School of Dental Medicine May 2012  –  May 2013  (1 year 1 month) Boston, MA •Assisted with the development and preparation of the Dental School’s annual budgets and quarterly projections  \n•Prepared month end journal entries and reconciled administrative accounts \n•Reconciled monthly results (budget vs. actuals) for clinic operations and provided analysis on discrepancies and evaluated trends \n•Supported departments in meeting their financial goals by providing assistance with financial issues and school policies \n•Facilitated departments with the completion of standard university forms (expense reimbursements, purchase orders, HR forms) and provided training for support staff to ensure proficiency  \n•Developed office procedures and protocols to maintain compliance with University policies and procedures Budget Administrator Tufts University School of Dental Medicine May 2012  –  May 2013  (1 year 1 month) Boston, MA •Assisted with the development and preparation of the Dental School’s annual budgets and quarterly projections  \n•Prepared month end journal entries and reconciled administrative accounts \n•Reconciled monthly results (budget vs. actuals) for clinic operations and provided analysis on discrepancies and evaluated trends \n•Supported departments in meeting their financial goals by providing assistance with financial issues and school policies \n•Facilitated departments with the completion of standard university forms (expense reimbursements, purchase orders, HR forms) and provided training for support staff to ensure proficiency  \n•Developed office procedures and protocols to maintain compliance with University policies and procedures Budget & Accounting Coordinator Tufts University School of Dental Medicine July 2009  –  April 2012  (2 years 10 months) Greater Boston Area •Assisted with the development and preparation of annual budget and quarterly projection templates  \n•Reconciled monthly results (budget vs. actuals) \n•Provided professional office coordination and support for the Office of Finance and Administration \n•Served as the front line contact for all internal and external customers, providing exceptional customer service by trouble shooting issues and prioritizing requests Budget & Accounting Coordinator Tufts University School of Dental Medicine July 2009  –  April 2012  (2 years 10 months) Greater Boston Area •Assisted with the development and preparation of annual budget and quarterly projection templates  \n•Reconciled monthly results (budget vs. actuals) \n•Provided professional office coordination and support for the Office of Finance and Administration \n•Served as the front line contact for all internal and external customers, providing exceptional customer service by trouble shooting issues and prioritizing requests Intern Axial Financial Group September 2007  –  June 2009  (1 year 10 months) Burlington, MA •Assisted in preparation of Cost Basis Analysis \n•Developed group informational packets which were used to introduce clients to the financial tools and capabilities offered by the group to optimize client investments \n•Organized client portfolios  \n•Marketed company events, designed direct mailers and assisted in the organization of client events Intern Axial Financial Group September 2007  –  June 2009  (1 year 10 months) Burlington, MA •Assisted in preparation of Cost Basis Analysis \n•Developed group informational packets which were used to introduce clients to the financial tools and capabilities offered by the group to optimize client investments \n•Organized client portfolios  \n•Marketed company events, designed direct mailers and assisted in the organization of client events Skills Operating Budgets Forecasting Financial Analysis Financial Reporting Roster Management Microsoft Excel PeopleSoft Dentrix Account Reconciliation Analysis Budgets Accounting Training Finance Skills  Operating Budgets Forecasting Financial Analysis Financial Reporting Roster Management Microsoft Excel PeopleSoft Dentrix Account Reconciliation Analysis Budgets Accounting Training Finance Operating Budgets Forecasting Financial Analysis Financial Reporting Roster Management Microsoft Excel PeopleSoft Dentrix Account Reconciliation Analysis Budgets Accounting Training Finance Operating Budgets Forecasting Financial Analysis Financial Reporting Roster Management Microsoft Excel PeopleSoft Dentrix Account Reconciliation Analysis Budgets Accounting Training Finance Education Merrimack College BS,  Business , Accounting 2005  – 2009 Activities and Societies:  Theta Phi Alpha Merrimack College BS,  Business , Accounting 2005  – 2009 Activities and Societies:  Theta Phi Alpha Merrimack College BS,  Business , Accounting 2005  – 2009 Activities and Societies:  Theta Phi Alpha Merrimack College BS,  Business , Accounting 2005  – 2009 Activities and Societies:  Theta Phi Alpha Honors & Awards Nominee for Extra Mile Tufts Distinction Award 2011 Recognition of outstanding work in service to the Tufts community Nominee for Team Excellence Award 2012 TUSDM sponsors this school-wide program to recognize team or workgroup accomplishments that go beyond the parameters of daily business in addressing a challenging project or initiative that facilitates change at the Dental School. Winning teams will have demonstrated their commitment to the Dental School and the Tufts community through dedication to professionalism, teamwork and service. Nominee for Extra Mile Tufts Distinction Award 2011 Recognition of outstanding work in service to the Tufts community Nominee for Extra Mile Tufts Distinction Award 2011 Recognition of outstanding work in service to the Tufts community Nominee for Extra Mile Tufts Distinction Award 2011 Recognition of outstanding work in service to the Tufts community Nominee for Team Excellence Award 2012 TUSDM sponsors this school-wide program to recognize team or workgroup accomplishments that go beyond the parameters of daily business in addressing a challenging project or initiative that facilitates change at the Dental School. Winning teams will have demonstrated their commitment to the Dental School and the Tufts community through dedication to professionalism, teamwork and service. Nominee for Team Excellence Award 2012 TUSDM sponsors this school-wide program to recognize team or workgroup accomplishments that go beyond the parameters of daily business in addressing a challenging project or initiative that facilitates change at the Dental School. Winning teams will have demonstrated their commitment to the Dental School and the Tufts community through dedication to professionalism, teamwork and service. Nominee for Team Excellence Award 2012 TUSDM sponsors this school-wide program to recognize team or workgroup accomplishments that go beyond the parameters of daily business in addressing a challenging project or initiative that facilitates change at the Dental School. Winning teams will have demonstrated their commitment to the Dental School and the Tufts community through dedication to professionalism, teamwork and service. ", "Summary * Understanding of accounting policies, practices and systems \n* Projections analysis and forecasting Summary * Understanding of accounting policies, practices and systems \n* Projections analysis and forecasting * Understanding of accounting policies, practices and systems \n* Projections analysis and forecasting * Understanding of accounting policies, practices and systems \n* Projections analysis and forecasting Experience Finance Specialist Stanford University School of Medicine September 2014  – Present (1 year) Palo Alto, California Project Assistant ARCADIS U.S. November 2006  –  September 2014  (7 years 11 months) San Jose, CA Assistant Manager Century Theatres November 2001  –  November 2006  (5 years 1 month) Finance Specialist Stanford University School of Medicine September 2014  – Present (1 year) Palo Alto, California Finance Specialist Stanford University School of Medicine September 2014  – Present (1 year) Palo Alto, California Project Assistant ARCADIS U.S. November 2006  –  September 2014  (7 years 11 months) San Jose, CA Project Assistant ARCADIS U.S. November 2006  –  September 2014  (7 years 11 months) San Jose, CA Assistant Manager Century Theatres November 2001  –  November 2006  (5 years 1 month) Assistant Manager Century Theatres November 2001  –  November 2006  (5 years 1 month) Skills Microsoft Office PowerPoint Microsoft Excel Microsoft Word MS Project Accounting Databases Spreadsheets Invoicing Budgets Outlook Accounts Payable Data Analysis Supervisory Skills Microsoft Project Financial Analysis Analysis Access Customer Service See 4+     See less Skills  Microsoft Office PowerPoint Microsoft Excel Microsoft Word MS Project Accounting Databases Spreadsheets Invoicing Budgets Outlook Accounts Payable Data Analysis Supervisory Skills Microsoft Project Financial Analysis Analysis Access Customer Service See 4+     See less Microsoft Office PowerPoint Microsoft Excel Microsoft Word MS Project Accounting Databases Spreadsheets Invoicing Budgets Outlook Accounts Payable Data Analysis Supervisory Skills Microsoft Project Financial Analysis Analysis Access Customer Service See 4+     See less Microsoft Office PowerPoint Microsoft Excel Microsoft Word MS Project Accounting Databases Spreadsheets Invoicing Budgets Outlook Accounts Payable Data Analysis Supervisory Skills Microsoft Project Financial Analysis Analysis Access Customer Service See 4+     See less Education San Jose State University Bachelor of Science,  Business Administration/Finance San Jose State University Bachelor of Science,  Business Administration/Finance San Jose State University Bachelor of Science,  Business Administration/Finance San Jose State University Bachelor of Science,  Business Administration/Finance ", "Experience Financial Analyst Federal Reserve Bank of San Francisco September 2012  – Present (3 years) San Francisco Bay Area Finance Specialist Stanford University August 2011  –  September 2012  (1 year 2 months) • Present high level projections, analyses and reports, and ad hoc reports to Executive Staffs  \n• Manage all finance, procurement, and accounting activities for several departments within Stanford School of Medicine  \n• Reconcile monthly expenditure statements, preparing monthly projections and provide and present financial reports for the department directors and school Deans.  \n• Serve as a liaison between Principal Investigators (PIs) and the Research Management Group (RMG) and Office of Sponsored Research (OSR) by managing the internal pre-award process (including budget development and proposal submission) and post-award sponsored funding.  \n• Participate in annual operating budget development, Hyperion entry/management, and budget implementation; also provide high level projections, analyses and reporting for assigned accounts, and ad hoc reports requested by the Director of Finance.  \n• Manage several operating budgets (about $24M) as well as gift, discretionary, and income accounts for assigned units  \n• Ensure financial transactions are compliant with Federal, sponsor, and University standards  \n• Compiles, develops, and analyzes budget and expense data for annual reports and requests; including final budget drafts and justifications  \n• Review spending plans and ensures PI certification of statements  \n• Manage pre- and post-award finances of grants and contracts, including ongoing tracking of actual and projected expenditures \n• Train and advise department administrative staff regarding expenditures  \n• Prepare and provides data for annual reports and audits Senior Procurement Analyst EGCRC at University of California, San Francisco January 2008  –  August 2011  (3 years 8 months) • Prepare, create, analyze reports and statistics as required (cost benefit analysis, quantitative analysis, supplier performance, fill-rate report, line item report, etc.) \n• Identify and resolve supply chain related problems in day-to-day activities in an effort to improve overall efficiency and productivity. \n• Provide training for end users in procurement systems and tools. \n• Present procurement solutions and cost analysis to the senior executive staffs.  \n• Monitor and report suppliers’ performance. \n• Process purchase orders for assigned commodities and repairs. \n• Negotiate Contracts and pricing for about $4.5 million book of business. \n• Build and create positive relations with different Vendors. Associate underwriter Liberty Mutual Insurance 2007  –  2008  (1 year) Financial Analyst Federal Reserve Bank of San Francisco September 2012  – Present (3 years) San Francisco Bay Area Financial Analyst Federal Reserve Bank of San Francisco September 2012  – Present (3 years) San Francisco Bay Area Finance Specialist Stanford University August 2011  –  September 2012  (1 year 2 months) • Present high level projections, analyses and reports, and ad hoc reports to Executive Staffs  \n• Manage all finance, procurement, and accounting activities for several departments within Stanford School of Medicine  \n• Reconcile monthly expenditure statements, preparing monthly projections and provide and present financial reports for the department directors and school Deans.  \n• Serve as a liaison between Principal Investigators (PIs) and the Research Management Group (RMG) and Office of Sponsored Research (OSR) by managing the internal pre-award process (including budget development and proposal submission) and post-award sponsored funding.  \n• Participate in annual operating budget development, Hyperion entry/management, and budget implementation; also provide high level projections, analyses and reporting for assigned accounts, and ad hoc reports requested by the Director of Finance.  \n• Manage several operating budgets (about $24M) as well as gift, discretionary, and income accounts for assigned units  \n• Ensure financial transactions are compliant with Federal, sponsor, and University standards  \n• Compiles, develops, and analyzes budget and expense data for annual reports and requests; including final budget drafts and justifications  \n• Review spending plans and ensures PI certification of statements  \n• Manage pre- and post-award finances of grants and contracts, including ongoing tracking of actual and projected expenditures \n• Train and advise department administrative staff regarding expenditures  \n• Prepare and provides data for annual reports and audits Finance Specialist Stanford University August 2011  –  September 2012  (1 year 2 months) • Present high level projections, analyses and reports, and ad hoc reports to Executive Staffs  \n• Manage all finance, procurement, and accounting activities for several departments within Stanford School of Medicine  \n• Reconcile monthly expenditure statements, preparing monthly projections and provide and present financial reports for the department directors and school Deans.  \n• Serve as a liaison between Principal Investigators (PIs) and the Research Management Group (RMG) and Office of Sponsored Research (OSR) by managing the internal pre-award process (including budget development and proposal submission) and post-award sponsored funding.  \n• Participate in annual operating budget development, Hyperion entry/management, and budget implementation; also provide high level projections, analyses and reporting for assigned accounts, and ad hoc reports requested by the Director of Finance.  \n• Manage several operating budgets (about $24M) as well as gift, discretionary, and income accounts for assigned units  \n• Ensure financial transactions are compliant with Federal, sponsor, and University standards  \n• Compiles, develops, and analyzes budget and expense data for annual reports and requests; including final budget drafts and justifications  \n• Review spending plans and ensures PI certification of statements  \n• Manage pre- and post-award finances of grants and contracts, including ongoing tracking of actual and projected expenditures \n• Train and advise department administrative staff regarding expenditures  \n• Prepare and provides data for annual reports and audits Senior Procurement Analyst EGCRC at University of California, San Francisco January 2008  –  August 2011  (3 years 8 months) • Prepare, create, analyze reports and statistics as required (cost benefit analysis, quantitative analysis, supplier performance, fill-rate report, line item report, etc.) \n• Identify and resolve supply chain related problems in day-to-day activities in an effort to improve overall efficiency and productivity. \n• Provide training for end users in procurement systems and tools. \n• Present procurement solutions and cost analysis to the senior executive staffs.  \n• Monitor and report suppliers’ performance. \n• Process purchase orders for assigned commodities and repairs. \n• Negotiate Contracts and pricing for about $4.5 million book of business. \n• Build and create positive relations with different Vendors. Senior Procurement Analyst EGCRC at University of California, San Francisco January 2008  –  August 2011  (3 years 8 months) • Prepare, create, analyze reports and statistics as required (cost benefit analysis, quantitative analysis, supplier performance, fill-rate report, line item report, etc.) \n• Identify and resolve supply chain related problems in day-to-day activities in an effort to improve overall efficiency and productivity. \n• Provide training for end users in procurement systems and tools. \n• Present procurement solutions and cost analysis to the senior executive staffs.  \n• Monitor and report suppliers’ performance. \n• Process purchase orders for assigned commodities and repairs. \n• Negotiate Contracts and pricing for about $4.5 million book of business. \n• Build and create positive relations with different Vendors. Associate underwriter Liberty Mutual Insurance 2007  –  2008  (1 year) Associate underwriter Liberty Mutual Insurance 2007  –  2008  (1 year) Languages Hindi Professional working proficiency Tibetan Professional working proficiency ENGLISH Full professional proficiency Hindi Professional working proficiency Tibetan Professional working proficiency ENGLISH Full professional proficiency Hindi Professional working proficiency Tibetan Professional working proficiency ENGLISH Full professional proficiency Professional working proficiency Professional working proficiency Full professional proficiency Skills Microsoft Office Research Budgeting Accounting Auditing Financial Reporting Financial Analysis Financial Accounting Financial Risk Risk Assessment Risk Management Purchasing Procurement Public Procurement Contract Negotiation Supplier Negotiation Strategic Planning Problem Solving Strategic Sourcing Underwriting Compliance Hyperion Planning Oracle Financial PeopleSoft Cost Accounting Financial Variance... Month End Close Managerial Finance Budgets Financial Modeling Microsoft Excel Finance Account Reconciliation Forecasting Economics Hyperion Enterprise See 21+     See less Skills  Microsoft Office Research Budgeting Accounting Auditing Financial Reporting Financial Analysis Financial Accounting Financial Risk Risk Assessment Risk Management Purchasing Procurement Public Procurement Contract Negotiation Supplier Negotiation Strategic Planning Problem Solving Strategic Sourcing Underwriting Compliance Hyperion Planning Oracle Financial PeopleSoft Cost Accounting Financial Variance... Month End Close Managerial Finance Budgets Financial Modeling Microsoft Excel Finance Account Reconciliation Forecasting Economics Hyperion Enterprise See 21+     See less Microsoft Office Research Budgeting Accounting Auditing Financial Reporting Financial Analysis Financial Accounting Financial Risk Risk Assessment Risk Management Purchasing Procurement Public Procurement Contract Negotiation Supplier Negotiation Strategic Planning Problem Solving Strategic Sourcing Underwriting Compliance Hyperion Planning Oracle Financial PeopleSoft Cost Accounting Financial Variance... Month End Close Managerial Finance Budgets Financial Modeling Microsoft Excel Finance Account Reconciliation Forecasting Economics Hyperion Enterprise See 21+     See less Microsoft Office Research Budgeting Accounting Auditing Financial Reporting Financial Analysis Financial Accounting Financial Risk Risk Assessment Risk Management Purchasing Procurement Public Procurement Contract Negotiation Supplier Negotiation Strategic Planning Problem Solving Strategic Sourcing Underwriting Compliance Hyperion Planning Oracle Financial PeopleSoft Cost Accounting Financial Variance... Month End Close Managerial Finance Budgets Financial Modeling Microsoft Excel Finance Account Reconciliation Forecasting Economics Hyperion Enterprise See 21+     See less Education Mills College MBA,  FINANCE & GLOBAL BUSINESS 2008  – 2010 University of California, Davis Bachelor of Arts,  Economics & International Relations 2001  – 2005 Mills College MBA,  FINANCE & GLOBAL BUSINESS 2008  – 2010 Mills College MBA,  FINANCE & GLOBAL BUSINESS 2008  – 2010 Mills College MBA,  FINANCE & GLOBAL BUSINESS 2008  – 2010 University of California, Davis Bachelor of Arts,  Economics & International Relations 2001  – 2005 University of California, Davis Bachelor of Arts,  Economics & International Relations 2001  – 2005 University of California, Davis Bachelor of Arts,  Economics & International Relations 2001  – 2005 ", "Summary A seasoned marketing professional with outstanding software marketing experience, a talent for \nbuilding scalable processes, and a passion for problem-solving.  \n \nSpecialties: Email Marketing, Social Media, SEO & SEM, PPC Advertising, Branding & Identity, Hospitality Management, PR, Fundraising, HTML, Web Design & Usability, Graphic Design Summary A seasoned marketing professional with outstanding software marketing experience, a talent for \nbuilding scalable processes, and a passion for problem-solving.  \n \nSpecialties: Email Marketing, Social Media, SEO & SEM, PPC Advertising, Branding & Identity, Hospitality Management, PR, Fundraising, HTML, Web Design & Usability, Graphic Design A seasoned marketing professional with outstanding software marketing experience, a talent for \nbuilding scalable processes, and a passion for problem-solving.  \n \nSpecialties: Email Marketing, Social Media, SEO & SEM, PPC Advertising, Branding & Identity, Hospitality Management, PR, Fundraising, HTML, Web Design & Usability, Graphic Design A seasoned marketing professional with outstanding software marketing experience, a talent for \nbuilding scalable processes, and a passion for problem-solving.  \n \nSpecialties: Email Marketing, Social Media, SEO & SEM, PPC Advertising, Branding & Identity, Hospitality Management, PR, Fundraising, HTML, Web Design & Usability, Graphic Design Experience Owner - Marketing and Social Media Consultant Independent Consultant June 2012  – Present (3 years 3 months) San Francisco Bay Area Consulting engagements include: \n- Librato, Inc.: Interim marketing director of a technology startup (acquired by SolarWinds SWI) \n- Per Diem Restaurant: Social media and marketing consulting for one of the Financial District's busiest power-lunch destinations \n- Eat Drink SF Festival (formerly SF Chefs Festival): Social media correspondent for the Bay Area's largest and most comprehensive food, wine, and cocktail festival \n- Campton Place and Taj Hotels, a Michelin-rated fine dining restaurant and hotel: web, social,  \nand email marketing  \n- SeatMe: Strategic consulting for software sales, B-to-B marketing, and product  \n(acquired by Yelp.com) \n- Copilot, a startup BI platform for the hospitality industry: Sales strategy and product refinements (acquired by OpenTable)  \n- Featured Instructor: San Francisco SBA Entrepreneur Center – “Leveraging PR and Marketing Strategies” Director of Marketing Restaurants Unlimited 2011  –  2012  (1 year) Partner Development Manager VerticalResponse August 2009  –  December 2011  (2 years 5 months) Director of Restaurant Sales & Marketing Kimpton Hotels & Restaurants 2008  –  March 2009  (1 year) SF Chefs Festival - Director of Programming Andrew Freeman & Co 2009  –  2009  (less than a year) San Francisco Bay Area Sr. Manager, Restaurant Product Marketing OpenTable 2002  –  2008  (6 years) San Francisco, CA Marketing Communications Manager Navis LLC 2000  –  2002  (2 years) Oakland, Ca Marketing & Finance Specialist Stanford University - Housing & Dining Services 1994  –  2000  (6 years) Stanford, CA Owner - Marketing and Social Media Consultant Independent Consultant June 2012  – Present (3 years 3 months) San Francisco Bay Area Consulting engagements include: \n- Librato, Inc.: Interim marketing director of a technology startup (acquired by SolarWinds SWI) \n- Per Diem Restaurant: Social media and marketing consulting for one of the Financial District's busiest power-lunch destinations \n- Eat Drink SF Festival (formerly SF Chefs Festival): Social media correspondent for the Bay Area's largest and most comprehensive food, wine, and cocktail festival \n- Campton Place and Taj Hotels, a Michelin-rated fine dining restaurant and hotel: web, social,  \nand email marketing  \n- SeatMe: Strategic consulting for software sales, B-to-B marketing, and product  \n(acquired by Yelp.com) \n- Copilot, a startup BI platform for the hospitality industry: Sales strategy and product refinements (acquired by OpenTable)  \n- Featured Instructor: San Francisco SBA Entrepreneur Center – “Leveraging PR and Marketing Strategies” Owner - Marketing and Social Media Consultant Independent Consultant June 2012  – Present (3 years 3 months) San Francisco Bay Area Consulting engagements include: \n- Librato, Inc.: Interim marketing director of a technology startup (acquired by SolarWinds SWI) \n- Per Diem Restaurant: Social media and marketing consulting for one of the Financial District's busiest power-lunch destinations \n- Eat Drink SF Festival (formerly SF Chefs Festival): Social media correspondent for the Bay Area's largest and most comprehensive food, wine, and cocktail festival \n- Campton Place and Taj Hotels, a Michelin-rated fine dining restaurant and hotel: web, social,  \nand email marketing  \n- SeatMe: Strategic consulting for software sales, B-to-B marketing, and product  \n(acquired by Yelp.com) \n- Copilot, a startup BI platform for the hospitality industry: Sales strategy and product refinements (acquired by OpenTable)  \n- Featured Instructor: San Francisco SBA Entrepreneur Center – “Leveraging PR and Marketing Strategies” Director of Marketing Restaurants Unlimited 2011  –  2012  (1 year) Director of Marketing Restaurants Unlimited 2011  –  2012  (1 year) Partner Development Manager VerticalResponse August 2009  –  December 2011  (2 years 5 months) Partner Development Manager VerticalResponse August 2009  –  December 2011  (2 years 5 months) Director of Restaurant Sales & Marketing Kimpton Hotels & Restaurants 2008  –  March 2009  (1 year) Director of Restaurant Sales & Marketing Kimpton Hotels & Restaurants 2008  –  March 2009  (1 year) SF Chefs Festival - Director of Programming Andrew Freeman & Co 2009  –  2009  (less than a year) San Francisco Bay Area SF Chefs Festival - Director of Programming Andrew Freeman & Co 2009  –  2009  (less than a year) San Francisco Bay Area Sr. Manager, Restaurant Product Marketing OpenTable 2002  –  2008  (6 years) San Francisco, CA Sr. Manager, Restaurant Product Marketing OpenTable 2002  –  2008  (6 years) San Francisco, CA Marketing Communications Manager Navis LLC 2000  –  2002  (2 years) Oakland, Ca Marketing Communications Manager Navis LLC 2000  –  2002  (2 years) Oakland, Ca Marketing & Finance Specialist Stanford University - Housing & Dining Services 1994  –  2000  (6 years) Stanford, CA Marketing & Finance Specialist Stanford University - Housing & Dining Services 1994  –  2000  (6 years) Stanford, CA Skills Online Advertising Email Marketing Social Media Public Relations Marketing Fundraising Graphic Design HTML Branding & Identity Hospitality Management Social Media Marketing Marketing Strategy Marketing Communications Strategy E-commerce Social Networking Training Event Planning Strategic Partnerships SEO Facebook Management Sales SEM Start-ups See 10+     See less Skills  Online Advertising Email Marketing Social Media Public Relations Marketing Fundraising Graphic Design HTML Branding & Identity Hospitality Management Social Media Marketing Marketing Strategy Marketing Communications Strategy E-commerce Social Networking Training Event Planning Strategic Partnerships SEO Facebook Management Sales SEM Start-ups See 10+     See less Online Advertising Email Marketing Social Media Public Relations Marketing Fundraising Graphic Design HTML Branding & Identity Hospitality Management Social Media Marketing Marketing Strategy Marketing Communications Strategy E-commerce Social Networking Training Event Planning Strategic Partnerships SEO Facebook Management Sales SEM Start-ups See 10+     See less Online Advertising Email Marketing Social Media Public Relations Marketing Fundraising Graphic Design HTML Branding & Identity Hospitality Management Social Media Marketing Marketing Strategy Marketing Communications Strategy E-commerce Social Networking Training Event Planning Strategic Partnerships SEO Facebook Management Sales SEM Start-ups See 10+     See less Education The Culinary Institute of America at Greystone CE Units 1997  – 1999 Stanford University BA 1990  – 1994 The Culinary Institute of America at Greystone CE Units 1997  – 1999 The Culinary Institute of America at Greystone CE Units 1997  – 1999 The Culinary Institute of America at Greystone CE Units 1997  – 1999 Stanford University BA 1990  – 1994 Stanford University BA 1990  – 1994 Stanford University BA 1990  – 1994 Honors & Awards Additional Honors & Awards 2009 Share Our Strength National Advocate Award - Nominee Additional Honors & Awards 2009 Share Our Strength National Advocate Award - Nominee Additional Honors & Awards 2009 Share Our Strength National Advocate Award - Nominee Additional Honors & Awards 2009 Share Our Strength National Advocate Award - Nominee ", "Experience Finance Specialist Stanford University Finance Specialist Stanford University Finance Specialist Stanford University ", "Experience Senior Finance Manager - Student Houisng and CPPM Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Oversight of financial performance of R&DE CPPM (Capital Planning and Project Management) group and R&DE Student Housing (including Munger Housing and Off-Campus Housing program) and support to management and staff with accurate financial information and analyses, as well as guidance on policies and procedures related to Financial transactions and processes. \n \nPrimary responsibilities include: \n \n-Ensure accurate recording of revenues and expenses to the division's accounts \n-Validate appropriateness and compliance of financial transactions \n-Manage month-end and year-end close activities (non-labor).  \n-Lead financial planning, analyses and forecasting efforts of the department, including needs assessment, budget preparation, variance analyses and short-term and long-term forecasting of financial results.  \n-Lead and develop staff of the R&DE Student Housing and CPPM finance. Finance Manager - Student Housing and CPPM Stanford University April 2010  –  June 2014  (4 years 3 months) Stanford, CA Oversight of financial health of Student Housing (including Munger Housing and  \nOff-Campus Housing program) and its departments as well as financial management of CPPM (from FY2012 - onwards*).  \n \nResponsible for monitoring and analyses of financial trends, forecasting, budgeting, variance analyses and reporting, month-end and year-end close management, and oversight of financial transactions for accuracy and compliance. \n \nAdvised Executive Director on department-wide financial trends, areas of concern, opportunities and shortfalls, advise on corrective action where applicable and possible. \nAdvised Directors and Managers on expenditure trends, areas of concern and funding options and  \nLiased with and provided support to other departments within and outside of R&DE (Procurement, IT, Budget and Compliance, HR, Capital Accounting, ResEd, and others). \nDepartment's Form 1 process administration. \n \n*As a result of internal reorganization, the project's group was separated from Student Housing operations in FY2012 to become a new department within R&DE, with additional oversight of projects initiated/funded by Dining, Hospitality, SrAVP and other groups. After the reorganization, my duties were expanded to include oversight and management of the new project management group - CPPM (Capital Planning and Project Management). Financial Management Analyst - Student Housing, a division of Residential & Dining Enterprises Stanford University February 2008  –  March 2010  (2 years 2 months) Recording, tracking, analyses and forecasting of financial activities within Student Housing Services - a Division of Residential and Dining Enterprises at Stanford University. Advisory and analytical support to all stakeholders, including variance reporting and analyses, trend analyses, needs assessment and year-end projections. Compliance advise and oversight of financial transactions. Inventory management, monthly audits of student damage and maintenance parts and labor billing, financial statements review and reconciliation. Finance Specialist Stanford University August 2006  –  February 2008  (1 year 7 months) Stanford, CA SHARP, Utilities and Finance Specialist. Supported one of the larges groups in Stanford Student Housing - HP&SP (Housing Planned Projects and Sustainability Programs). This group primary responsibility was to repair, maintain and upgrade Student Housing buildings and facilities. Responsible for collecting, recording and analyzing data and maintaining databases in three key areas: 1) expenses on group and project levels; 2) lifecycle asset renewal and capital plan; 3) utilities. Served as a liaison to internal and external customers throughout the campus, including Environmental Health and Safety, Facility Operations, IT Services, Residential Education, Student Housing Financial Groups, and numerous external vendors and contractors. Intern - Accounting, Finance, Marketing, Operations Cocoa Pete's Chocolate Adventures May 2003  –  August 2005  (2 years 4 months) Campbell, CA Provided \"all hands on deck\" support to the team of the start-up Chocolate Company lead by Cocoa Pete (Pete Slosberg - CEO) and Scott Barnum (President). Supported various functions of Cocoa Pete's Chocolate Adventures from accountng, operations, marketing to customer care and chocolate tasting.  \n \nA note of appreciation on my first US assignment: \nWhile at Cocoa Pete's, I have not only completed a number of projects as part of the MBA Program, but also learned a great deal about US start-up business in the Food Industry, with it's rewards, challenges and pitfals. I have greatly enjoyed my experience at Cocoa Pete's and am grateful for knowledge, guidance and mentorship provided by senior management and every team member of the company. Working at Cocoa Pete's was some serious fun!. Project Coordinator - Milk Quality Improvement Project in the Leningrad Oblast, Russia Landell Mills Ltd. (for DFID - UK) August 1998  –  May 2003  (4 years 10 months) Lead a team of specialists and staff (3 staff and up to 6 consultants at different phases of the project) of the Milk Quality and Marketing Improvement Project (MQMIS), funded by British Government's Department For International Development (project managed by Management Consulting Company - Landell Mills Ltd.) Project was designed and implemented to improve quality of the dairy produce and profitability of the Dairy Industry in the Leningrad oblast by establishing a number of pilot operations in several regions in Leningrad Oblast that could be replicated elsewhare in Russia. The project engaged a number of small and large farms and Dairy processing plants in the region, as well as with educational institutions that delivered training in the field of milk production and Dairy processing. \nResponsible for planning and oversight of implementation of project activities to ensure that the project was meeting it's goals and successfully implementing tasks set forth in the Master Plan, while remaining within an established budget.  \nParticipated in traing sessions and explored synergies and collaboration routes with other similar initiatives throughout Russia's North-Western Region.  \nPrepared quarterly progress reports to the DFID (Department for international Development of the UK Foreign Office, formerly the British Know How Fund).  \nProvided liaison and ensured coordination of efforts between various project stakeholders. Commercial Director / Chief Accountant Super-Cool Ltd. January 1995  –  May 2003  (8 years 5 months) Performed a number of financial support functions in this family-owned business. \nDuties included full cycle accounting of the small business operation (including payroll).  \nPreparation of the Company's quarterly and annual financial reporting package (cash flow, balance sheet, P&L, payroll, specific tax reports - VAT, property tax, income tax and many other reports that were part of the quarterly financial reporting package to Tax Authorities in Russia in the 1990s-2000-s. ) \nActively participated in sales contract negotiations, deal closure and contract delivery process oversight. Involved in preparation of responses to RFPs from TACIS (technical Assistance to CIS program funded by the European Union) and the DFID/KHF. \nManagement of import and export operations of the company (including documentation and customs clearance). \nFrom August 1998 also performed duties of Project Coordinator and Finance specialist for the MQMIS (Milk Quality and Marketing Improvement Scheme in the Leningrad Oblast) Project. \nSupervisory responsibilities - 3 full-time staff. Senior Finance Manager - Student Houisng and CPPM Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Oversight of financial performance of R&DE CPPM (Capital Planning and Project Management) group and R&DE Student Housing (including Munger Housing and Off-Campus Housing program) and support to management and staff with accurate financial information and analyses, as well as guidance on policies and procedures related to Financial transactions and processes. \n \nPrimary responsibilities include: \n \n-Ensure accurate recording of revenues and expenses to the division's accounts \n-Validate appropriateness and compliance of financial transactions \n-Manage month-end and year-end close activities (non-labor).  \n-Lead financial planning, analyses and forecasting efforts of the department, including needs assessment, budget preparation, variance analyses and short-term and long-term forecasting of financial results.  \n-Lead and develop staff of the R&DE Student Housing and CPPM finance. Senior Finance Manager - Student Houisng and CPPM Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Oversight of financial performance of R&DE CPPM (Capital Planning and Project Management) group and R&DE Student Housing (including Munger Housing and Off-Campus Housing program) and support to management and staff with accurate financial information and analyses, as well as guidance on policies and procedures related to Financial transactions and processes. \n \nPrimary responsibilities include: \n \n-Ensure accurate recording of revenues and expenses to the division's accounts \n-Validate appropriateness and compliance of financial transactions \n-Manage month-end and year-end close activities (non-labor).  \n-Lead financial planning, analyses and forecasting efforts of the department, including needs assessment, budget preparation, variance analyses and short-term and long-term forecasting of financial results.  \n-Lead and develop staff of the R&DE Student Housing and CPPM finance. Finance Manager - Student Housing and CPPM Stanford University April 2010  –  June 2014  (4 years 3 months) Stanford, CA Oversight of financial health of Student Housing (including Munger Housing and  \nOff-Campus Housing program) and its departments as well as financial management of CPPM (from FY2012 - onwards*).  \n \nResponsible for monitoring and analyses of financial trends, forecasting, budgeting, variance analyses and reporting, month-end and year-end close management, and oversight of financial transactions for accuracy and compliance. \n \nAdvised Executive Director on department-wide financial trends, areas of concern, opportunities and shortfalls, advise on corrective action where applicable and possible. \nAdvised Directors and Managers on expenditure trends, areas of concern and funding options and  \nLiased with and provided support to other departments within and outside of R&DE (Procurement, IT, Budget and Compliance, HR, Capital Accounting, ResEd, and others). \nDepartment's Form 1 process administration. \n \n*As a result of internal reorganization, the project's group was separated from Student Housing operations in FY2012 to become a new department within R&DE, with additional oversight of projects initiated/funded by Dining, Hospitality, SrAVP and other groups. After the reorganization, my duties were expanded to include oversight and management of the new project management group - CPPM (Capital Planning and Project Management). Finance Manager - Student Housing and CPPM Stanford University April 2010  –  June 2014  (4 years 3 months) Stanford, CA Oversight of financial health of Student Housing (including Munger Housing and  \nOff-Campus Housing program) and its departments as well as financial management of CPPM (from FY2012 - onwards*).  \n \nResponsible for monitoring and analyses of financial trends, forecasting, budgeting, variance analyses and reporting, month-end and year-end close management, and oversight of financial transactions for accuracy and compliance. \n \nAdvised Executive Director on department-wide financial trends, areas of concern, opportunities and shortfalls, advise on corrective action where applicable and possible. \nAdvised Directors and Managers on expenditure trends, areas of concern and funding options and  \nLiased with and provided support to other departments within and outside of R&DE (Procurement, IT, Budget and Compliance, HR, Capital Accounting, ResEd, and others). \nDepartment's Form 1 process administration. \n \n*As a result of internal reorganization, the project's group was separated from Student Housing operations in FY2012 to become a new department within R&DE, with additional oversight of projects initiated/funded by Dining, Hospitality, SrAVP and other groups. After the reorganization, my duties were expanded to include oversight and management of the new project management group - CPPM (Capital Planning and Project Management). Financial Management Analyst - Student Housing, a division of Residential & Dining Enterprises Stanford University February 2008  –  March 2010  (2 years 2 months) Recording, tracking, analyses and forecasting of financial activities within Student Housing Services - a Division of Residential and Dining Enterprises at Stanford University. Advisory and analytical support to all stakeholders, including variance reporting and analyses, trend analyses, needs assessment and year-end projections. Compliance advise and oversight of financial transactions. Inventory management, monthly audits of student damage and maintenance parts and labor billing, financial statements review and reconciliation. Financial Management Analyst - Student Housing, a division of Residential & Dining Enterprises Stanford University February 2008  –  March 2010  (2 years 2 months) Recording, tracking, analyses and forecasting of financial activities within Student Housing Services - a Division of Residential and Dining Enterprises at Stanford University. Advisory and analytical support to all stakeholders, including variance reporting and analyses, trend analyses, needs assessment and year-end projections. Compliance advise and oversight of financial transactions. Inventory management, monthly audits of student damage and maintenance parts and labor billing, financial statements review and reconciliation. Finance Specialist Stanford University August 2006  –  February 2008  (1 year 7 months) Stanford, CA SHARP, Utilities and Finance Specialist. Supported one of the larges groups in Stanford Student Housing - HP&SP (Housing Planned Projects and Sustainability Programs). This group primary responsibility was to repair, maintain and upgrade Student Housing buildings and facilities. Responsible for collecting, recording and analyzing data and maintaining databases in three key areas: 1) expenses on group and project levels; 2) lifecycle asset renewal and capital plan; 3) utilities. Served as a liaison to internal and external customers throughout the campus, including Environmental Health and Safety, Facility Operations, IT Services, Residential Education, Student Housing Financial Groups, and numerous external vendors and contractors. Finance Specialist Stanford University August 2006  –  February 2008  (1 year 7 months) Stanford, CA SHARP, Utilities and Finance Specialist. Supported one of the larges groups in Stanford Student Housing - HP&SP (Housing Planned Projects and Sustainability Programs). This group primary responsibility was to repair, maintain and upgrade Student Housing buildings and facilities. Responsible for collecting, recording and analyzing data and maintaining databases in three key areas: 1) expenses on group and project levels; 2) lifecycle asset renewal and capital plan; 3) utilities. Served as a liaison to internal and external customers throughout the campus, including Environmental Health and Safety, Facility Operations, IT Services, Residential Education, Student Housing Financial Groups, and numerous external vendors and contractors. Intern - Accounting, Finance, Marketing, Operations Cocoa Pete's Chocolate Adventures May 2003  –  August 2005  (2 years 4 months) Campbell, CA Provided \"all hands on deck\" support to the team of the start-up Chocolate Company lead by Cocoa Pete (Pete Slosberg - CEO) and Scott Barnum (President). Supported various functions of Cocoa Pete's Chocolate Adventures from accountng, operations, marketing to customer care and chocolate tasting.  \n \nA note of appreciation on my first US assignment: \nWhile at Cocoa Pete's, I have not only completed a number of projects as part of the MBA Program, but also learned a great deal about US start-up business in the Food Industry, with it's rewards, challenges and pitfals. I have greatly enjoyed my experience at Cocoa Pete's and am grateful for knowledge, guidance and mentorship provided by senior management and every team member of the company. Working at Cocoa Pete's was some serious fun!. Intern - Accounting, Finance, Marketing, Operations Cocoa Pete's Chocolate Adventures May 2003  –  August 2005  (2 years 4 months) Campbell, CA Provided \"all hands on deck\" support to the team of the start-up Chocolate Company lead by Cocoa Pete (Pete Slosberg - CEO) and Scott Barnum (President). Supported various functions of Cocoa Pete's Chocolate Adventures from accountng, operations, marketing to customer care and chocolate tasting.  \n \nA note of appreciation on my first US assignment: \nWhile at Cocoa Pete's, I have not only completed a number of projects as part of the MBA Program, but also learned a great deal about US start-up business in the Food Industry, with it's rewards, challenges and pitfals. I have greatly enjoyed my experience at Cocoa Pete's and am grateful for knowledge, guidance and mentorship provided by senior management and every team member of the company. Working at Cocoa Pete's was some serious fun!. Project Coordinator - Milk Quality Improvement Project in the Leningrad Oblast, Russia Landell Mills Ltd. (for DFID - UK) August 1998  –  May 2003  (4 years 10 months) Lead a team of specialists and staff (3 staff and up to 6 consultants at different phases of the project) of the Milk Quality and Marketing Improvement Project (MQMIS), funded by British Government's Department For International Development (project managed by Management Consulting Company - Landell Mills Ltd.) Project was designed and implemented to improve quality of the dairy produce and profitability of the Dairy Industry in the Leningrad oblast by establishing a number of pilot operations in several regions in Leningrad Oblast that could be replicated elsewhare in Russia. The project engaged a number of small and large farms and Dairy processing plants in the region, as well as with educational institutions that delivered training in the field of milk production and Dairy processing. \nResponsible for planning and oversight of implementation of project activities to ensure that the project was meeting it's goals and successfully implementing tasks set forth in the Master Plan, while remaining within an established budget.  \nParticipated in traing sessions and explored synergies and collaboration routes with other similar initiatives throughout Russia's North-Western Region.  \nPrepared quarterly progress reports to the DFID (Department for international Development of the UK Foreign Office, formerly the British Know How Fund).  \nProvided liaison and ensured coordination of efforts between various project stakeholders. Project Coordinator - Milk Quality Improvement Project in the Leningrad Oblast, Russia Landell Mills Ltd. (for DFID - UK) August 1998  –  May 2003  (4 years 10 months) Lead a team of specialists and staff (3 staff and up to 6 consultants at different phases of the project) of the Milk Quality and Marketing Improvement Project (MQMIS), funded by British Government's Department For International Development (project managed by Management Consulting Company - Landell Mills Ltd.) Project was designed and implemented to improve quality of the dairy produce and profitability of the Dairy Industry in the Leningrad oblast by establishing a number of pilot operations in several regions in Leningrad Oblast that could be replicated elsewhare in Russia. The project engaged a number of small and large farms and Dairy processing plants in the region, as well as with educational institutions that delivered training in the field of milk production and Dairy processing. \nResponsible for planning and oversight of implementation of project activities to ensure that the project was meeting it's goals and successfully implementing tasks set forth in the Master Plan, while remaining within an established budget.  \nParticipated in traing sessions and explored synergies and collaboration routes with other similar initiatives throughout Russia's North-Western Region.  \nPrepared quarterly progress reports to the DFID (Department for international Development of the UK Foreign Office, formerly the British Know How Fund).  \nProvided liaison and ensured coordination of efforts between various project stakeholders. Commercial Director / Chief Accountant Super-Cool Ltd. January 1995  –  May 2003  (8 years 5 months) Performed a number of financial support functions in this family-owned business. \nDuties included full cycle accounting of the small business operation (including payroll).  \nPreparation of the Company's quarterly and annual financial reporting package (cash flow, balance sheet, P&L, payroll, specific tax reports - VAT, property tax, income tax and many other reports that were part of the quarterly financial reporting package to Tax Authorities in Russia in the 1990s-2000-s. ) \nActively participated in sales contract negotiations, deal closure and contract delivery process oversight. Involved in preparation of responses to RFPs from TACIS (technical Assistance to CIS program funded by the European Union) and the DFID/KHF. \nManagement of import and export operations of the company (including documentation and customs clearance). \nFrom August 1998 also performed duties of Project Coordinator and Finance specialist for the MQMIS (Milk Quality and Marketing Improvement Scheme in the Leningrad Oblast) Project. \nSupervisory responsibilities - 3 full-time staff. Commercial Director / Chief Accountant Super-Cool Ltd. January 1995  –  May 2003  (8 years 5 months) Performed a number of financial support functions in this family-owned business. \nDuties included full cycle accounting of the small business operation (including payroll).  \nPreparation of the Company's quarterly and annual financial reporting package (cash flow, balance sheet, P&L, payroll, specific tax reports - VAT, property tax, income tax and many other reports that were part of the quarterly financial reporting package to Tax Authorities in Russia in the 1990s-2000-s. ) \nActively participated in sales contract negotiations, deal closure and contract delivery process oversight. Involved in preparation of responses to RFPs from TACIS (technical Assistance to CIS program funded by the European Union) and the DFID/KHF. \nManagement of import and export operations of the company (including documentation and customs clearance). \nFrom August 1998 also performed duties of Project Coordinator and Finance specialist for the MQMIS (Milk Quality and Marketing Improvement Scheme in the Leningrad Oblast) Project. \nSupervisory responsibilities - 3 full-time staff. Education University of Phoenix Master of Science,  Accounting 2009  – 2012 Golden Gate University MBA,  Finance , Management,  Accounting 2004  – 2006 Saint Petersburg State University BA,  Economics 1988  – 1993 University of Phoenix Master of Science,  Accounting 2009  – 2012 University of Phoenix Master of Science,  Accounting 2009  – 2012 University of Phoenix Master of Science,  Accounting 2009  – 2012 Golden Gate University MBA,  Finance , Management,  Accounting 2004  – 2006 Golden Gate University MBA,  Finance , Management,  Accounting 2004  – 2006 Golden Gate University MBA,  Finance , Management,  Accounting 2004  – 2006 Saint Petersburg State University BA,  Economics 1988  – 1993 Saint Petersburg State University BA,  Economics 1988  – 1993 Saint Petersburg State University BA,  Economics 1988  – 1993 ", "Experience Finance Analyst UCSF Cardiovascular Research Institute June 2013  – Present (2 years 3 months) Finance Specialist Stanford University August 2012  –  June 2013  (11 months) Finance Analyst UCSF- Stem Cell October 2010  –  August 2012  (1 year 11 months) Operations Analyst UCSF October 2007  –  October 2010  (3 years 1 month) Credit Assistant Compass 2000  –  2007  (7 years) Finance Analyst UCSF Cardiovascular Research Institute June 2013  – Present (2 years 3 months) Finance Analyst UCSF Cardiovascular Research Institute June 2013  – Present (2 years 3 months) Finance Specialist Stanford University August 2012  –  June 2013  (11 months) Finance Specialist Stanford University August 2012  –  June 2013  (11 months) Finance Analyst UCSF- Stem Cell October 2010  –  August 2012  (1 year 11 months) Finance Analyst UCSF- Stem Cell October 2010  –  August 2012  (1 year 11 months) Operations Analyst UCSF October 2007  –  October 2010  (3 years 1 month) Operations Analyst UCSF October 2007  –  October 2010  (3 years 1 month) Credit Assistant Compass 2000  –  2007  (7 years) Credit Assistant Compass 2000  –  2007  (7 years) Skills Data Analysis Strategic Planning Program Management Microsoft Excel Research Analysis Finance Budgets Project Management Financial Reporting Nonprofits Customer Service Microsoft Word Skills  Data Analysis Strategic Planning Program Management Microsoft Excel Research Analysis Finance Budgets Project Management Financial Reporting Nonprofits Customer Service Microsoft Word Data Analysis Strategic Planning Program Management Microsoft Excel Research Analysis Finance Budgets Project Management Financial Reporting Nonprofits Customer Service Microsoft Word Data Analysis Strategic Planning Program Management Microsoft Excel Research Analysis Finance Budgets Project Management Financial Reporting Nonprofits Customer Service Microsoft Word Education San Francisco State University San Francisco State University San Francisco State University San Francisco State University ", "Languages Mandarin Native or bilingual proficiency Mandarin Native or bilingual proficiency Mandarin Native or bilingual proficiency Native or bilingual proficiency Skills Financial Analysis Financial Modeling Data Analysis Strategic Financial... Forecasting Budget Process Competitive Analysis QuickBooks Building Business... Business Process... Process Improvement Revenue Analysis Pricing Strategy Project Management Skills  Financial Analysis Financial Modeling Data Analysis Strategic Financial... Forecasting Budget Process Competitive Analysis QuickBooks Building Business... Business Process... Process Improvement Revenue Analysis Pricing Strategy Project Management Financial Analysis Financial Modeling Data Analysis Strategic Financial... Forecasting Budget Process Competitive Analysis QuickBooks Building Business... Business Process... Process Improvement Revenue Analysis Pricing Strategy Project Management Financial Analysis Financial Modeling Data Analysis Strategic Financial... Forecasting Budget Process Competitive Analysis QuickBooks Building Business... Business Process... Process Improvement Revenue Analysis Pricing Strategy Project Management ", "Summary Ambitious, detail-oriented Financial Analyst interested in making continuous improvements in the efficiency and accuracy of financial reporting and analysis. Summary Ambitious, detail-oriented Financial Analyst interested in making continuous improvements in the efficiency and accuracy of financial reporting and analysis. Ambitious, detail-oriented Financial Analyst interested in making continuous improvements in the efficiency and accuracy of financial reporting and analysis. Ambitious, detail-oriented Financial Analyst interested in making continuous improvements in the efficiency and accuracy of financial reporting and analysis. Experience Finance Specialist Stanford University School of Medicine August 2014  – Present (1 year 1 month) Palo Alto, CA I am currently working on improving and updating reports. I also approve purchase transaction and journal entries. Financial Analyst Stephen James Associates June 2014  –  August 2014  (3 months) San Francisco Bay Area This was a temporary position at UCSF as an Post Award Analyst. I reviewed various types funding and their cost to ensure it followed federal regulations. At the end of each year for the grants, I processed the paperwork for closing and the carry forward request. I also reviewed the reporting process to streamline and improve efficiency. Budget Analyst Al-Razaq Computing Services October 2008  –  June 2014  (5 years 9 months) I am currently supporting the IT Directorate at Ames Research Center in financial planning, programming, budgeting, and execution for a $30 million budget. I manage and perform monthly Contract Cost Report analysis for the government IT services contract to track performance and accuracy on over 100 tasks. I assist the service pool for IT purchases and services in reviewing needs, creating Purchase Requests, and managing the funding. I also present variance analysis and financial models for projects. Finance Specialist Stanford University School of Medicine August 2014  – Present (1 year 1 month) Palo Alto, CA I am currently working on improving and updating reports. I also approve purchase transaction and journal entries. Finance Specialist Stanford University School of Medicine August 2014  – Present (1 year 1 month) Palo Alto, CA I am currently working on improving and updating reports. I also approve purchase transaction and journal entries. Financial Analyst Stephen James Associates June 2014  –  August 2014  (3 months) San Francisco Bay Area This was a temporary position at UCSF as an Post Award Analyst. I reviewed various types funding and their cost to ensure it followed federal regulations. At the end of each year for the grants, I processed the paperwork for closing and the carry forward request. I also reviewed the reporting process to streamline and improve efficiency. Financial Analyst Stephen James Associates June 2014  –  August 2014  (3 months) San Francisco Bay Area This was a temporary position at UCSF as an Post Award Analyst. I reviewed various types funding and their cost to ensure it followed federal regulations. At the end of each year for the grants, I processed the paperwork for closing and the carry forward request. I also reviewed the reporting process to streamline and improve efficiency. Budget Analyst Al-Razaq Computing Services October 2008  –  June 2014  (5 years 9 months) I am currently supporting the IT Directorate at Ames Research Center in financial planning, programming, budgeting, and execution for a $30 million budget. I manage and perform monthly Contract Cost Report analysis for the government IT services contract to track performance and accuracy on over 100 tasks. I assist the service pool for IT purchases and services in reviewing needs, creating Purchase Requests, and managing the funding. I also present variance analysis and financial models for projects. Budget Analyst Al-Razaq Computing Services October 2008  –  June 2014  (5 years 9 months) I am currently supporting the IT Directorate at Ames Research Center in financial planning, programming, budgeting, and execution for a $30 million budget. I manage and perform monthly Contract Cost Report analysis for the government IT services contract to track performance and accuracy on over 100 tasks. I assist the service pool for IT purchases and services in reviewing needs, creating Purchase Requests, and managing the funding. I also present variance analysis and financial models for projects. Languages Chinese Chinese Chinese Skills Financial Analysis Managerial Finance Account Reconciliation Accounting Risk Management Budgets Microsoft Excel SAP BW PowerPoint Financial Reporting BEx Reporting Strategic Financial... Budget Estimating Contract Cost Reporting WBS Earned Value Management Customer Service Financial Planning Data Analysis Financial Modeling Analysis Microsoft Office Management See 8+     See less Skills  Financial Analysis Managerial Finance Account Reconciliation Accounting Risk Management Budgets Microsoft Excel SAP BW PowerPoint Financial Reporting BEx Reporting Strategic Financial... Budget Estimating Contract Cost Reporting WBS Earned Value Management Customer Service Financial Planning Data Analysis Financial Modeling Analysis Microsoft Office Management See 8+     See less Financial Analysis Managerial Finance Account Reconciliation Accounting Risk Management Budgets Microsoft Excel SAP BW PowerPoint Financial Reporting BEx Reporting Strategic Financial... Budget Estimating Contract Cost Reporting WBS Earned Value Management Customer Service Financial Planning Data Analysis Financial Modeling Analysis Microsoft Office Management See 8+     See less Financial Analysis Managerial Finance Account Reconciliation Accounting Risk Management Budgets Microsoft Excel SAP BW PowerPoint Financial Reporting BEx Reporting Strategic Financial... Budget Estimating Contract Cost Reporting WBS Earned Value Management Customer Service Financial Planning Data Analysis Financial Modeling Analysis Microsoft Office Management See 8+     See less Education University of California, Riverside Bachelor of Arts (B.A.),  Economics 2001  – 2005 De Anza Community College Accounting 2007  – 2008 University of California, Riverside Bachelor of Arts (B.A.),  Economics 2001  – 2005 University of California, Riverside Bachelor of Arts (B.A.),  Economics 2001  – 2005 University of California, Riverside Bachelor of Arts (B.A.),  Economics 2001  – 2005 De Anza Community College Accounting 2007  – 2008 De Anza Community College Accounting 2007  – 2008 De Anza Community College Accounting 2007  – 2008 Honors & Awards ", "Summary Dedicated, strategic financial professional offering more than 10 years of demonstrated leadership, project management and evaluation, analysis and reporting excellence. Special expertise and passion for the retail and consumer product industries. Armed with a hybrid set of creative and technical capabilities. Proven ability to provide analysis effective at increasing business insight and enhancing decision making at the executive level. Trusted communicator who builds lucrative relationships with customers and colleagues at all levels in demanding, cross-functional settings. Solution-driven, customer service-oriented, approachable team player noted for innovative thinking and continually going above and beyond to add value to team and organizational success. Recognized for high integrity, accuracy, and supreme organization. Summary Dedicated, strategic financial professional offering more than 10 years of demonstrated leadership, project management and evaluation, analysis and reporting excellence. Special expertise and passion for the retail and consumer product industries. Armed with a hybrid set of creative and technical capabilities. Proven ability to provide analysis effective at increasing business insight and enhancing decision making at the executive level. Trusted communicator who builds lucrative relationships with customers and colleagues at all levels in demanding, cross-functional settings. Solution-driven, customer service-oriented, approachable team player noted for innovative thinking and continually going above and beyond to add value to team and organizational success. Recognized for high integrity, accuracy, and supreme organization. Dedicated, strategic financial professional offering more than 10 years of demonstrated leadership, project management and evaluation, analysis and reporting excellence. Special expertise and passion for the retail and consumer product industries. Armed with a hybrid set of creative and technical capabilities. Proven ability to provide analysis effective at increasing business insight and enhancing decision making at the executive level. Trusted communicator who builds lucrative relationships with customers and colleagues at all levels in demanding, cross-functional settings. Solution-driven, customer service-oriented, approachable team player noted for innovative thinking and continually going above and beyond to add value to team and organizational success. Recognized for high integrity, accuracy, and supreme organization. Dedicated, strategic financial professional offering more than 10 years of demonstrated leadership, project management and evaluation, analysis and reporting excellence. Special expertise and passion for the retail and consumer product industries. Armed with a hybrid set of creative and technical capabilities. Proven ability to provide analysis effective at increasing business insight and enhancing decision making at the executive level. Trusted communicator who builds lucrative relationships with customers and colleagues at all levels in demanding, cross-functional settings. Solution-driven, customer service-oriented, approachable team player noted for innovative thinking and continually going above and beyond to add value to team and organizational success. Recognized for high integrity, accuracy, and supreme organization. Skills Due Diligence Microsoft Excel Finance Banking Time Management Financial Analysis Leadership Budgets Advertising Valuation Financial Modeling Investments Investment Banking Analysis Corporate Finance Project Management Customer Service See 2+     See less Skills  Due Diligence Microsoft Excel Finance Banking Time Management Financial Analysis Leadership Budgets Advertising Valuation Financial Modeling Investments Investment Banking Analysis Corporate Finance Project Management Customer Service See 2+     See less Due Diligence Microsoft Excel Finance Banking Time Management Financial Analysis Leadership Budgets Advertising Valuation Financial Modeling Investments Investment Banking Analysis Corporate Finance Project Management Customer Service See 2+     See less Due Diligence Microsoft Excel Finance Banking Time Management Financial Analysis Leadership Budgets Advertising Valuation Financial Modeling Investments Investment Banking Analysis Corporate Finance Project Management Customer Service See 2+     See less Education University of San Francisco Bachelors of Science in Business Administration,  Finance Activities and Societies:  Omicron Theta Chi Sorority ,  Beta Alpha Psi Fraternity ,  Kasamahan University of San Francisco Finance , General University of San Francisco Bachelors of Science in Business Administration,  Finance Activities and Societies:  Omicron Theta Chi Sorority ,  Beta Alpha Psi Fraternity ,  Kasamahan University of San Francisco Bachelors of Science in Business Administration,  Finance Activities and Societies:  Omicron Theta Chi Sorority ,  Beta Alpha Psi Fraternity ,  Kasamahan University of San Francisco Bachelors of Science in Business Administration,  Finance Activities and Societies:  Omicron Theta Chi Sorority ,  Beta Alpha Psi Fraternity ,  Kasamahan University of San Francisco Finance , General University of San Francisco Finance , General University of San Francisco Finance , General Honors & Awards ", "Summary Nothing is impossible with patience and dedications Summary Nothing is impossible with patience and dedications Nothing is impossible with patience and dedications Nothing is impossible with patience and dedications Languages   Skills Skills     ", "Experience Finance and Grants Management Specialist Stanford University March 2008  – Present (7 years 6 months) Research Accountant Stanford University School of Medicine March 2000  –  March 2008  (8 years 1 month) Financial Status report preparer for Federal and Non Federal Sponsors. Finance and Grants Management Specialist Stanford University March 2008  – Present (7 years 6 months) Finance and Grants Management Specialist Stanford University March 2008  – Present (7 years 6 months) Research Accountant Stanford University School of Medicine March 2000  –  March 2008  (8 years 1 month) Financial Status report preparer for Federal and Non Federal Sponsors. Research Accountant Stanford University School of Medicine March 2000  –  March 2008  (8 years 1 month) Financial Status report preparer for Federal and Non Federal Sponsors. Skills Financial Analysis Accounting Budgeting Excel Analysis Research Forecasting Microsoft Office Word Problem Solving Financial Reporting Data Analysis Accounts Receivable Financial Management PowerPoint Spanish Auditing Policy Compliance Customer Service Public Speaking Managerial Finance Budgets Microsoft Excel Grants See 10+     See less Skills  Financial Analysis Accounting Budgeting Excel Analysis Research Forecasting Microsoft Office Word Problem Solving Financial Reporting Data Analysis Accounts Receivable Financial Management PowerPoint Spanish Auditing Policy Compliance Customer Service Public Speaking Managerial Finance Budgets Microsoft Excel Grants See 10+     See less Financial Analysis Accounting Budgeting Excel Analysis Research Forecasting Microsoft Office Word Problem Solving Financial Reporting Data Analysis Accounts Receivable Financial Management PowerPoint Spanish Auditing Policy Compliance Customer Service Public Speaking Managerial Finance Budgets Microsoft Excel Grants See 10+     See less Financial Analysis Accounting Budgeting Excel Analysis Research Forecasting Microsoft Office Word Problem Solving Financial Reporting Data Analysis Accounts Receivable Financial Management PowerPoint Spanish Auditing Policy Compliance Customer Service Public Speaking Managerial Finance Budgets Microsoft Excel Grants See 10+     See less Education Universidad Tecnológica Metropolitana 1986  – 1991 Augusto Dhalmar Universidad Tecnológica Metropolitana 1986  – 1991 Universidad Tecnológica Metropolitana 1986  – 1991 Universidad Tecnológica Metropolitana 1986  – 1991 Augusto Dhalmar Augusto Dhalmar Augusto Dhalmar ", "Experience Finance Specialist Stanford University August 2014  – Present (1 year 1 month) San Francisco Bay Area Residing in central administration in the School of Medicine's Office of Educational Programs and Services, I provide financial management support to multiple program units. My portfolio is comprised of operating budgets, sponsored projects, gift, discretionary, and income accounts. In addition to the day-to-day responsibilities like approving procurement orders, reimbursements, and other financial transactions, an important part of my role is to work with Program Directors and Assistant/Associate Deans on the development of annual operating budgets for their respective units. Manager, Financial Planning & Analysis The Wilderness Society April 2014  –  August 2014  (5 months) San Francisco Bay Area Overseeing all grants-related activities, I am responsible not only for pre- and post-award management but also driving accounting processes like booking revenue and balance sheet accounts reconciliation. Besides contracts and grants management, another part of my role is to work closely with our Regional Directors, located across the U.S., on operating costs management and budget planning for their divisions. Financial Analyst UCSF October 2011  –  March 2014  (2 years 6 months) San Francisco Bay Area I managed and forecasted spending, oversaw GL reconciliation process, facilitated ongoing communications with clients and senior management in regards to budget status, and ensured all reporting requirements are met; so my clients could focus more on their research and less on the numbers. In addition to fulfilling the role of a financial analyst, I also took great pride in serving as an account manager. This helped to build trust. Even when I was unable to approve my clients' requests sometimes, they still understood my decision was made to protect them. Research Services Analyst UCSF January 2011  –  October 2011  (10 months) San Francisco Bay Area As a pre-award research services analyst, I was like a mysterious bin that somehow turned scattered pieces of information into a finished proposal. Before a turkey can be baked to golden brown, the preparation process included data and content collection, budget development, proofreading, inter-departmental communications, and most importantly, time management. Managing multiple projects at the same time was as usual of an activity as going to work. Deadlines were my best friend and also worst enemy; but in either perspective, they kept me on track. Compliance Assistant RCM September 2009  –  June 2010  (10 months) San Francisco Bay Area My primary role was to help administering the company's Code of Ethics process by monitoring employees' personal trading accounts and reviewing analysis results. I consider myself as the watchful gatekeeper, since no staff, including the CEO, could trade an approval-needed ticker without passing my checkpoint first. Finance Specialist Stanford University August 2014  – Present (1 year 1 month) San Francisco Bay Area Residing in central administration in the School of Medicine's Office of Educational Programs and Services, I provide financial management support to multiple program units. My portfolio is comprised of operating budgets, sponsored projects, gift, discretionary, and income accounts. In addition to the day-to-day responsibilities like approving procurement orders, reimbursements, and other financial transactions, an important part of my role is to work with Program Directors and Assistant/Associate Deans on the development of annual operating budgets for their respective units. Finance Specialist Stanford University August 2014  – Present (1 year 1 month) San Francisco Bay Area Residing in central administration in the School of Medicine's Office of Educational Programs and Services, I provide financial management support to multiple program units. My portfolio is comprised of operating budgets, sponsored projects, gift, discretionary, and income accounts. In addition to the day-to-day responsibilities like approving procurement orders, reimbursements, and other financial transactions, an important part of my role is to work with Program Directors and Assistant/Associate Deans on the development of annual operating budgets for their respective units. Manager, Financial Planning & Analysis The Wilderness Society April 2014  –  August 2014  (5 months) San Francisco Bay Area Overseeing all grants-related activities, I am responsible not only for pre- and post-award management but also driving accounting processes like booking revenue and balance sheet accounts reconciliation. Besides contracts and grants management, another part of my role is to work closely with our Regional Directors, located across the U.S., on operating costs management and budget planning for their divisions. Manager, Financial Planning & Analysis The Wilderness Society April 2014  –  August 2014  (5 months) San Francisco Bay Area Overseeing all grants-related activities, I am responsible not only for pre- and post-award management but also driving accounting processes like booking revenue and balance sheet accounts reconciliation. Besides contracts and grants management, another part of my role is to work closely with our Regional Directors, located across the U.S., on operating costs management and budget planning for their divisions. Financial Analyst UCSF October 2011  –  March 2014  (2 years 6 months) San Francisco Bay Area I managed and forecasted spending, oversaw GL reconciliation process, facilitated ongoing communications with clients and senior management in regards to budget status, and ensured all reporting requirements are met; so my clients could focus more on their research and less on the numbers. In addition to fulfilling the role of a financial analyst, I also took great pride in serving as an account manager. This helped to build trust. Even when I was unable to approve my clients' requests sometimes, they still understood my decision was made to protect them. Financial Analyst UCSF October 2011  –  March 2014  (2 years 6 months) San Francisco Bay Area I managed and forecasted spending, oversaw GL reconciliation process, facilitated ongoing communications with clients and senior management in regards to budget status, and ensured all reporting requirements are met; so my clients could focus more on their research and less on the numbers. In addition to fulfilling the role of a financial analyst, I also took great pride in serving as an account manager. This helped to build trust. Even when I was unable to approve my clients' requests sometimes, they still understood my decision was made to protect them. Research Services Analyst UCSF January 2011  –  October 2011  (10 months) San Francisco Bay Area As a pre-award research services analyst, I was like a mysterious bin that somehow turned scattered pieces of information into a finished proposal. Before a turkey can be baked to golden brown, the preparation process included data and content collection, budget development, proofreading, inter-departmental communications, and most importantly, time management. Managing multiple projects at the same time was as usual of an activity as going to work. Deadlines were my best friend and also worst enemy; but in either perspective, they kept me on track. Research Services Analyst UCSF January 2011  –  October 2011  (10 months) San Francisco Bay Area As a pre-award research services analyst, I was like a mysterious bin that somehow turned scattered pieces of information into a finished proposal. Before a turkey can be baked to golden brown, the preparation process included data and content collection, budget development, proofreading, inter-departmental communications, and most importantly, time management. Managing multiple projects at the same time was as usual of an activity as going to work. Deadlines were my best friend and also worst enemy; but in either perspective, they kept me on track. Compliance Assistant RCM September 2009  –  June 2010  (10 months) San Francisco Bay Area My primary role was to help administering the company's Code of Ethics process by monitoring employees' personal trading accounts and reviewing analysis results. I consider myself as the watchful gatekeeper, since no staff, including the CEO, could trade an approval-needed ticker without passing my checkpoint first. Compliance Assistant RCM September 2009  –  June 2010  (10 months) San Francisco Bay Area My primary role was to help administering the company's Code of Ethics process by monitoring employees' personal trading accounts and reviewing analysis results. I consider myself as the watchful gatekeeper, since no staff, including the CEO, could trade an approval-needed ticker without passing my checkpoint first. Languages English Native or bilingual proficiency Chinese (Cantonese) Native or bilingual proficiency Chinese (Mandarin) Native or bilingual proficiency English Native or bilingual proficiency Chinese (Cantonese) Native or bilingual proficiency Chinese (Mandarin) Native or bilingual proficiency English Native or bilingual proficiency Chinese (Cantonese) Native or bilingual proficiency Chinese (Mandarin) Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management Outlook Microsoft Excel Microsoft Office Financial Analysis PeopleSoft Adobe Acrobat Customer Service Federal Grants... Business Objects Microsoft Word Analytical Skills Research Administration Communication Skills Interpersonal Skill Follow Through Intellectually Curious Budget Proposals Budget Monitoring Sense Of Urgency Thrive in... See 6+     See less Skills  Project Management Outlook Microsoft Excel Microsoft Office Financial Analysis PeopleSoft Adobe Acrobat Customer Service Federal Grants... Business Objects Microsoft Word Analytical Skills Research Administration Communication Skills Interpersonal Skill Follow Through Intellectually Curious Budget Proposals Budget Monitoring Sense Of Urgency Thrive in... See 6+     See less Project Management Outlook Microsoft Excel Microsoft Office Financial Analysis PeopleSoft Adobe Acrobat Customer Service Federal Grants... Business Objects Microsoft Word Analytical Skills Research Administration Communication Skills Interpersonal Skill Follow Through Intellectually Curious Budget Proposals Budget Monitoring Sense Of Urgency Thrive in... See 6+     See less Project Management Outlook Microsoft Excel Microsoft Office Financial Analysis PeopleSoft Adobe Acrobat Customer Service Federal Grants... Business Objects Microsoft Word Analytical Skills Research Administration Communication Skills Interpersonal Skill Follow Through Intellectually Curious Budget Proposals Budget Monitoring Sense Of Urgency Thrive in... See 6+     See less Education UC Berkeley Bachelor of Arts (B.A.),  Sociology Activities and Societies:  Alpha Kappa Delta: International Sociology Honor Society UC Berkeley Bachelor of Arts (B.A.),  Sociology Activities and Societies:  Alpha Kappa Delta: International Sociology Honor Society UC Berkeley Bachelor of Arts (B.A.),  Sociology Activities and Societies:  Alpha Kappa Delta: International Sociology Honor Society UC Berkeley Bachelor of Arts (B.A.),  Sociology Activities and Societies:  Alpha Kappa Delta: International Sociology Honor Society ", "Summary Specialties:Microsoft Excel, Microsoft Word, Oracle Financial Management Reporting, Peoplesoft ePro, Adobe Acrobat, budget preparation, budgeting, contract management, data analysis, financial management, inventory management, purchasing, supervisory skills Summary Specialties:Microsoft Excel, Microsoft Word, Oracle Financial Management Reporting, Peoplesoft ePro, Adobe Acrobat, budget preparation, budgeting, contract management, data analysis, financial management, inventory management, purchasing, supervisory skills Specialties:Microsoft Excel, Microsoft Word, Oracle Financial Management Reporting, Peoplesoft ePro, Adobe Acrobat, budget preparation, budgeting, contract management, data analysis, financial management, inventory management, purchasing, supervisory skills Specialties:Microsoft Excel, Microsoft Word, Oracle Financial Management Reporting, Peoplesoft ePro, Adobe Acrobat, budget preparation, budgeting, contract management, data analysis, financial management, inventory management, purchasing, supervisory skills Experience Grants Manager/Finance Specialist Stanford University School of Medicine August 2013  – Present (2 years 1 month) I manage nearly 100 sponsored projected and gift/endowment awards for a faculty of 12 in one of the most decorated departments in the School of Medicine. I train the admins on grant policy and procedure and am responsible for all account setups and management. Research Administrator Stanford University School of Medicine August 2010  –  August 2013  (3 years 1 month) Grants/Finance Manager Litwin Zucker Alzheimer's Research Center December 2008  –  July 2010  (1 year 8 months) Responsible for all pre and post award grant applications and management, and all financial reconciliation of all grant accounts. Assistant Research Coordinator North Shore LIJ Health System 2005  –  2008  (3 years) Assisted in preparation of Institutional Review Board (human subjects research) submissions \nAdministered neuropsychological tests to research subjects \nMaintained and set up patient rooms \nUtilized PC to enter and retrieve patient data \nScheduled and greeted patients, updated patient charts \nIndependently prepared grant applications, federal and non-federal, including budget preparation Senior Secretary Albert Einstein College of Medicine March 2001  –  June 2005  (4 years 4 months) Assisted in preparation of grants (federal and non-federal) for 15-20 Principal Investigators including budget preparation \nIndependently prepared payroll forms for all new hires, transfers, and terminations for a department of 75-100 people \nMaintained confidential salary database for all department personnel \nPrepared internal financial reports for the Chairman and maintained financial spreadsheets of grant and departmental funds \nProcessed check request and travel expense reports \nAnswered and screened high volume of calls for the department and the administrator Senior lab technician Albert Einstein College of Medicine July 1999  –  March 2001  (1 year 9 months) Studied long distance transcriptional regulation of fetal and adult hepatocyte-specific genes, a-fetoprotein and albumin, and the consequences of AFP regulation on fetal development and cancer \nPromoted after 15 months; Trained new research staff \nOrganized lab files, and kept records of all grant expenditures, ordered all supplies \nParticipated in data analysis using computer programs including Word and Excel Grants Manager/Finance Specialist Stanford University School of Medicine August 2013  – Present (2 years 1 month) I manage nearly 100 sponsored projected and gift/endowment awards for a faculty of 12 in one of the most decorated departments in the School of Medicine. I train the admins on grant policy and procedure and am responsible for all account setups and management. Grants Manager/Finance Specialist Stanford University School of Medicine August 2013  – Present (2 years 1 month) I manage nearly 100 sponsored projected and gift/endowment awards for a faculty of 12 in one of the most decorated departments in the School of Medicine. I train the admins on grant policy and procedure and am responsible for all account setups and management. Research Administrator Stanford University School of Medicine August 2010  –  August 2013  (3 years 1 month) Research Administrator Stanford University School of Medicine August 2010  –  August 2013  (3 years 1 month) Grants/Finance Manager Litwin Zucker Alzheimer's Research Center December 2008  –  July 2010  (1 year 8 months) Responsible for all pre and post award grant applications and management, and all financial reconciliation of all grant accounts. Grants/Finance Manager Litwin Zucker Alzheimer's Research Center December 2008  –  July 2010  (1 year 8 months) Responsible for all pre and post award grant applications and management, and all financial reconciliation of all grant accounts. Assistant Research Coordinator North Shore LIJ Health System 2005  –  2008  (3 years) Assisted in preparation of Institutional Review Board (human subjects research) submissions \nAdministered neuropsychological tests to research subjects \nMaintained and set up patient rooms \nUtilized PC to enter and retrieve patient data \nScheduled and greeted patients, updated patient charts \nIndependently prepared grant applications, federal and non-federal, including budget preparation Assistant Research Coordinator North Shore LIJ Health System 2005  –  2008  (3 years) Assisted in preparation of Institutional Review Board (human subjects research) submissions \nAdministered neuropsychological tests to research subjects \nMaintained and set up patient rooms \nUtilized PC to enter and retrieve patient data \nScheduled and greeted patients, updated patient charts \nIndependently prepared grant applications, federal and non-federal, including budget preparation Senior Secretary Albert Einstein College of Medicine March 2001  –  June 2005  (4 years 4 months) Assisted in preparation of grants (federal and non-federal) for 15-20 Principal Investigators including budget preparation \nIndependently prepared payroll forms for all new hires, transfers, and terminations for a department of 75-100 people \nMaintained confidential salary database for all department personnel \nPrepared internal financial reports for the Chairman and maintained financial spreadsheets of grant and departmental funds \nProcessed check request and travel expense reports \nAnswered and screened high volume of calls for the department and the administrator Senior Secretary Albert Einstein College of Medicine March 2001  –  June 2005  (4 years 4 months) Assisted in preparation of grants (federal and non-federal) for 15-20 Principal Investigators including budget preparation \nIndependently prepared payroll forms for all new hires, transfers, and terminations for a department of 75-100 people \nMaintained confidential salary database for all department personnel \nPrepared internal financial reports for the Chairman and maintained financial spreadsheets of grant and departmental funds \nProcessed check request and travel expense reports \nAnswered and screened high volume of calls for the department and the administrator Senior lab technician Albert Einstein College of Medicine July 1999  –  March 2001  (1 year 9 months) Studied long distance transcriptional regulation of fetal and adult hepatocyte-specific genes, a-fetoprotein and albumin, and the consequences of AFP regulation on fetal development and cancer \nPromoted after 15 months; Trained new research staff \nOrganized lab files, and kept records of all grant expenditures, ordered all supplies \nParticipated in data analysis using computer programs including Word and Excel Senior lab technician Albert Einstein College of Medicine July 1999  –  March 2001  (1 year 9 months) Studied long distance transcriptional regulation of fetal and adult hepatocyte-specific genes, a-fetoprotein and albumin, and the consequences of AFP regulation on fetal development and cancer \nPromoted after 15 months; Trained new research staff \nOrganized lab files, and kept records of all grant expenditures, ordered all supplies \nParticipated in data analysis using computer programs including Word and Excel Skills Research Skills  Research Research Research Education The Johns Hopkins University BA,  Biology ,  Spanish 1995  – 1999 Activities and Societies:  George Washington Tutoring Program Del Mar The Johns Hopkins University BA,  Biology ,  Spanish 1995  – 1999 Activities and Societies:  George Washington Tutoring Program The Johns Hopkins University BA,  Biology ,  Spanish 1995  – 1999 Activities and Societies:  George Washington Tutoring Program The Johns Hopkins University BA,  Biology ,  Spanish 1995  – 1999 Activities and Societies:  George Washington Tutoring Program Del Mar Del Mar Del Mar "]}