{"position": "Grad Student", "company": "Stanford University", "profiles": ["Experience grad student Stanford University grad student Stanford University grad student Stanford University ", "Experience Grad Student Stanford University Grad Student Stanford University Grad Student Stanford University ", "Skills Skills     Education Stanford University Master of Science (MS) 2015  – 2016 University of Southern California Bachelor of Science (B.S.) 2009  – 2013 Stanford University Master of Science (MS) 2015  – 2016 Stanford University Master of Science (MS) 2015  – 2016 Stanford University Master of Science (MS) 2015  – 2016 University of Southern California Bachelor of Science (B.S.) 2009  – 2013 University of Southern California Bachelor of Science (B.S.) 2009  – 2013 University of Southern California Bachelor of Science (B.S.) 2009  – 2013 ", "Experience Research Intern Indian Institute of Science May 2014  –  June 2014  (2 months) Research Intern Indian Institute of Technology, Madras May 2013  –  June 2013  (2 months) Chennai, Tamil Nadu, India Research Intern Indian Institute of Science May 2014  –  June 2014  (2 months) Research Intern Indian Institute of Science May 2014  –  June 2014  (2 months) Research Intern Indian Institute of Technology, Madras May 2013  –  June 2013  (2 months) Chennai, Tamil Nadu, India Research Intern Indian Institute of Technology, Madras May 2013  –  June 2013  (2 months) Chennai, Tamil Nadu, India Skills C++ Java C SQL HTML Software Development Linux Programming Node.js Neo4j Microsoft Office Skills  C++ Java C SQL HTML Software Development Linux Programming Node.js Neo4j Microsoft Office C++ Java C SQL HTML Software Development Linux Programming Node.js Neo4j Microsoft Office C++ Java C SQL HTML Software Development Linux Programming Node.js Neo4j Microsoft Office Education Stanford University Master of Science (M.S.),  Computer Science 2015  – 2017 College of Engineering, Guindy Bachelor of Engineering (B.E.),  Computer Science and Engineering 2011  – 2015 Stanford University Master of Science (M.S.),  Computer Science 2015  – 2017 Stanford University Master of Science (M.S.),  Computer Science 2015  – 2017 Stanford University Master of Science (M.S.),  Computer Science 2015  – 2017 College of Engineering, Guindy Bachelor of Engineering (B.E.),  Computer Science and Engineering 2011  – 2015 College of Engineering, Guindy Bachelor of Engineering (B.E.),  Computer Science and Engineering 2011  – 2015 College of Engineering, Guindy Bachelor of Engineering (B.E.),  Computer Science and Engineering 2011  – 2015 ", "Experience Geophysics Grad Student Stanford University September 2007  – Present (8 years) Geophysics Grad Student Stanford University September 2007  – Present (8 years) Geophysics Grad Student Stanford University September 2007  – Present (8 years) Education Stanford University 2007  – 2012 Indian Institute of Technology, Kharagpur Stanford University 2007  – 2012 Stanford University 2007  – 2012 Stanford University 2007  – 2012 Indian Institute of Technology, Kharagpur Indian Institute of Technology, Kharagpur Indian Institute of Technology, Kharagpur ", "Experience Grad Student Stanford University Grad Student Stanford University Grad Student Stanford University ", "Summary As an Olympian, Mary achieved success beyond what was predictable--making the Olympic team on her final javelin throw, in the rain. As a business & life coach known for both her heart and rigor, she works with business people compelled to contribute beyond individual success, and who are willing to do the work to go beyond time constraints and competing priorities.  Summary As an Olympian, Mary achieved success beyond what was predictable--making the Olympic team on her final javelin throw, in the rain. As a business & life coach known for both her heart and rigor, she works with business people compelled to contribute beyond individual success, and who are willing to do the work to go beyond time constraints and competing priorities.  As an Olympian, Mary achieved success beyond what was predictable--making the Olympic team on her final javelin throw, in the rain. As a business & life coach known for both her heart and rigor, she works with business people compelled to contribute beyond individual success, and who are willing to do the work to go beyond time constraints and competing priorities.  As an Olympian, Mary achieved success beyond what was predictable--making the Olympic team on her final javelin throw, in the rain. As a business & life coach known for both her heart and rigor, she works with business people compelled to contribute beyond individual success, and who are willing to do the work to go beyond time constraints and competing priorities.  Experience Owner, Business/Life Coach, Organizational Performance Expert Andrews Performance Corporation August 2006  – Present (9 years 1 month) Mary is passionate about performance! She has over 20+ years in improving performance at the individual, team, and organizational level. Clients include small to mid-size businesses who are committed to breakthrough success through rigorous work on their culture, leadership, and bold declarations of results. Clients also include partnerships--whether it be around a business, marriage, or parenting of a young elite athlete. Individual clients include entrepreneurs and people from all walks of life wanting to break up anything that gets in the way of generating their desired results.  \n \nFrom studying performance as a grad student at Stanford University, to years of working in corporate training and development, inspiring people to Be Olympic in their life and work, to honing in on the value business and life coaching brings to clients, Mary takes a stand for her clients' greatness--and backs that up with practical tools that has clients accomplish the results they want.  \n \nMary has a Masters Degree from Stanford University and holds the designation of Professional Certified Coach through the International Coach Federation which upholds the ethics and standards of professional coaching worldwide. \n Owner, Business/Life Coach, Organizational Performance Expert Andrews Performance Corporation August 2006  – Present (9 years 1 month) Mary is passionate about performance! She has over 20+ years in improving performance at the individual, team, and organizational level. Clients include small to mid-size businesses who are committed to breakthrough success through rigorous work on their culture, leadership, and bold declarations of results. Clients also include partnerships--whether it be around a business, marriage, or parenting of a young elite athlete. Individual clients include entrepreneurs and people from all walks of life wanting to break up anything that gets in the way of generating their desired results.  \n \nFrom studying performance as a grad student at Stanford University, to years of working in corporate training and development, inspiring people to Be Olympic in their life and work, to honing in on the value business and life coaching brings to clients, Mary takes a stand for her clients' greatness--and backs that up with practical tools that has clients accomplish the results they want.  \n \nMary has a Masters Degree from Stanford University and holds the designation of Professional Certified Coach through the International Coach Federation which upholds the ethics and standards of professional coaching worldwide. \n Owner, Business/Life Coach, Organizational Performance Expert Andrews Performance Corporation August 2006  – Present (9 years 1 month) Mary is passionate about performance! She has over 20+ years in improving performance at the individual, team, and organizational level. Clients include small to mid-size businesses who are committed to breakthrough success through rigorous work on their culture, leadership, and bold declarations of results. Clients also include partnerships--whether it be around a business, marriage, or parenting of a young elite athlete. Individual clients include entrepreneurs and people from all walks of life wanting to break up anything that gets in the way of generating their desired results.  \n \nFrom studying performance as a grad student at Stanford University, to years of working in corporate training and development, inspiring people to Be Olympic in their life and work, to honing in on the value business and life coaching brings to clients, Mary takes a stand for her clients' greatness--and backs that up with practical tools that has clients accomplish the results they want.  \n \nMary has a Masters Degree from Stanford University and holds the designation of Professional Certified Coach through the International Coach Federation which upholds the ethics and standards of professional coaching worldwide. \n Skills Coaching Leadership Development Executive Coaching Workshop Facilitation Public Speaking Career Counseling Entrepreneurship Team Building Management Development Staff Development Emotional Intelligence Conflict Resolution Personal Development Organizational... Career Development Organizational... Culture Change Business Coaching Small Business Executive Development Leadership Life Coaching Motivational Speaking See 8+     See less Skills  Coaching Leadership Development Executive Coaching Workshop Facilitation Public Speaking Career Counseling Entrepreneurship Team Building Management Development Staff Development Emotional Intelligence Conflict Resolution Personal Development Organizational... Career Development Organizational... Culture Change Business Coaching Small Business Executive Development Leadership Life Coaching Motivational Speaking See 8+     See less Coaching Leadership Development Executive Coaching Workshop Facilitation Public Speaking Career Counseling Entrepreneurship Team Building Management Development Staff Development Emotional Intelligence Conflict Resolution Personal Development Organizational... Career Development Organizational... Culture Change Business Coaching Small Business Executive Development Leadership Life Coaching Motivational Speaking See 8+     See less Coaching Leadership Development Executive Coaching Workshop Facilitation Public Speaking Career Counseling Entrepreneurship Team Building Management Development Staff Development Emotional Intelligence Conflict Resolution Personal Development Organizational... Career Development Organizational... Culture Change Business Coaching Small Business Executive Development Leadership Life Coaching Motivational Speaking See 8+     See less Education Stanford University Masters,  Education 1983  – 1984 Stanford University Bachelors,  Sociology 1979  – 1983 Stanford University Masters,  Education 1983  – 1984 Stanford University Masters,  Education 1983  – 1984 Stanford University Masters,  Education 1983  – 1984 Stanford University Bachelors,  Sociology 1979  – 1983 Stanford University Bachelors,  Sociology 1979  – 1983 Stanford University Bachelors,  Sociology 1979  – 1983 ", "Summary \"Can you tell me which brain is male and which is female?\" I ask as I hand sample sheep brains to eager sixth graders at Brain Day. It's a trick question. You can't be certain of a brain's gender just by looking at its external features. I love posing this question to students since it inspires close inspection of the brain and intense debate. Every year, I look forward to opportunities, such as Brain Day, where I can communicate my enthusiasm for and knowledge of neuroscience to the broader community.  \n \nI am an inquisitive scientist seeking a research or support position in the Bay Area. \n \nBeyond communication between people, I'm also interested in communication within people. Our cells are constantly talking to one another to maintain our body temperature, recognize the voices of our loved ones, or calculate the tip for lunch. As an undergraduate student, I studied communication of circadian signals between neurons and helped identify a new potential treatment for jet-lag. Recently, I was developing a novel application of a fluorescent sensor to investigate the transmission of sound information in the inner ear. Summary \"Can you tell me which brain is male and which is female?\" I ask as I hand sample sheep brains to eager sixth graders at Brain Day. It's a trick question. You can't be certain of a brain's gender just by looking at its external features. I love posing this question to students since it inspires close inspection of the brain and intense debate. Every year, I look forward to opportunities, such as Brain Day, where I can communicate my enthusiasm for and knowledge of neuroscience to the broader community.  \n \nI am an inquisitive scientist seeking a research or support position in the Bay Area. \n \nBeyond communication between people, I'm also interested in communication within people. Our cells are constantly talking to one another to maintain our body temperature, recognize the voices of our loved ones, or calculate the tip for lunch. As an undergraduate student, I studied communication of circadian signals between neurons and helped identify a new potential treatment for jet-lag. Recently, I was developing a novel application of a fluorescent sensor to investigate the transmission of sound information in the inner ear. \"Can you tell me which brain is male and which is female?\" I ask as I hand sample sheep brains to eager sixth graders at Brain Day. It's a trick question. You can't be certain of a brain's gender just by looking at its external features. I love posing this question to students since it inspires close inspection of the brain and intense debate. Every year, I look forward to opportunities, such as Brain Day, where I can communicate my enthusiasm for and knowledge of neuroscience to the broader community.  \n \nI am an inquisitive scientist seeking a research or support position in the Bay Area. \n \nBeyond communication between people, I'm also interested in communication within people. Our cells are constantly talking to one another to maintain our body temperature, recognize the voices of our loved ones, or calculate the tip for lunch. As an undergraduate student, I studied communication of circadian signals between neurons and helped identify a new potential treatment for jet-lag. Recently, I was developing a novel application of a fluorescent sensor to investigate the transmission of sound information in the inner ear. \"Can you tell me which brain is male and which is female?\" I ask as I hand sample sheep brains to eager sixth graders at Brain Day. It's a trick question. You can't be certain of a brain's gender just by looking at its external features. I love posing this question to students since it inspires close inspection of the brain and intense debate. Every year, I look forward to opportunities, such as Brain Day, where I can communicate my enthusiasm for and knowledge of neuroscience to the broader community.  \n \nI am an inquisitive scientist seeking a research or support position in the Bay Area. \n \nBeyond communication between people, I'm also interested in communication within people. Our cells are constantly talking to one another to maintain our body temperature, recognize the voices of our loved ones, or calculate the tip for lunch. As an undergraduate student, I studied communication of circadian signals between neurons and helped identify a new potential treatment for jet-lag. Recently, I was developing a novel application of a fluorescent sensor to investigate the transmission of sound information in the inner ear. Experience Graduate Student Andreasson Lab April 2015  – Present (5 months) Stanford University -Identify therapeutic targets to delay the onset and slow the progression of Alzheimer's disease Customer Success Representative Quartzy, Inc July 2014  –  November 2014  (5 months) Palo Alto, CA - Trained and managed over 150 academic and industrial research groups on Quartzy.com, an online lab management platform. \n- Wrote and organized operations team documentation and onboarding materials. Graduate Student Ricci Lab June 2012  –  May 2014  (2 years) Stanford University - Investigate neurotransmitter release threshold and dynamic range at the inner hair cell ribbon synapse, the first synapse in the auditory pathway. \n- Develop novel application of fluorescent sensors to monitor release from multiple synapses. \n- Experience with electrophysiology, protein production, and protein purification. \n- Familiar with optical imaging techniques. Research Technician Herzog Lab June 2008  –  July 2011  (3 years 2 months) Washington University in St. Louis - Studied cellular mechanisms underlying the maintenance and synchronization of circadian rhythms in neurons and astrocytes. \n- Observed circadian expression of vasoactive intestinal polypeptide (VIP) and its receptor, VPAC2R. \n- Identified VIP as a novel, potential treatment for jet-lag. \n- Experience with rodent behavioral assays, western blotting, and immunohistochemistry. \n- Familiar with live cell imaging, cell culture techniques, and maintenance of mouse colonies. Teaching Assisant Physiological Control Systems January 2010  –  May 2010  (5 months) Washington University in St. Louis Transcribed lectures, held group and one-on-one tutoring sessions, and co-presented a final review session to 100+ students. Tutor - General Chemistry Peer Led Team Learning - The Teaching Center 2008  –  2010  (2 years) Washington University in St. Louis - Led groups of six to ten undergraduate students through weekly chemistry problem sets. \n- Utilized peer led team learning methods. \n- Received training to work with students with learning disabilities. Graduate Student Andreasson Lab April 2015  – Present (5 months) Stanford University -Identify therapeutic targets to delay the onset and slow the progression of Alzheimer's disease Graduate Student Andreasson Lab April 2015  – Present (5 months) Stanford University -Identify therapeutic targets to delay the onset and slow the progression of Alzheimer's disease Customer Success Representative Quartzy, Inc July 2014  –  November 2014  (5 months) Palo Alto, CA - Trained and managed over 150 academic and industrial research groups on Quartzy.com, an online lab management platform. \n- Wrote and organized operations team documentation and onboarding materials. Customer Success Representative Quartzy, Inc July 2014  –  November 2014  (5 months) Palo Alto, CA - Trained and managed over 150 academic and industrial research groups on Quartzy.com, an online lab management platform. \n- Wrote and organized operations team documentation and onboarding materials. Graduate Student Ricci Lab June 2012  –  May 2014  (2 years) Stanford University - Investigate neurotransmitter release threshold and dynamic range at the inner hair cell ribbon synapse, the first synapse in the auditory pathway. \n- Develop novel application of fluorescent sensors to monitor release from multiple synapses. \n- Experience with electrophysiology, protein production, and protein purification. \n- Familiar with optical imaging techniques. Graduate Student Ricci Lab June 2012  –  May 2014  (2 years) Stanford University - Investigate neurotransmitter release threshold and dynamic range at the inner hair cell ribbon synapse, the first synapse in the auditory pathway. \n- Develop novel application of fluorescent sensors to monitor release from multiple synapses. \n- Experience with electrophysiology, protein production, and protein purification. \n- Familiar with optical imaging techniques. Research Technician Herzog Lab June 2008  –  July 2011  (3 years 2 months) Washington University in St. Louis - Studied cellular mechanisms underlying the maintenance and synchronization of circadian rhythms in neurons and astrocytes. \n- Observed circadian expression of vasoactive intestinal polypeptide (VIP) and its receptor, VPAC2R. \n- Identified VIP as a novel, potential treatment for jet-lag. \n- Experience with rodent behavioral assays, western blotting, and immunohistochemistry. \n- Familiar with live cell imaging, cell culture techniques, and maintenance of mouse colonies. Research Technician Herzog Lab June 2008  –  July 2011  (3 years 2 months) Washington University in St. Louis - Studied cellular mechanisms underlying the maintenance and synchronization of circadian rhythms in neurons and astrocytes. \n- Observed circadian expression of vasoactive intestinal polypeptide (VIP) and its receptor, VPAC2R. \n- Identified VIP as a novel, potential treatment for jet-lag. \n- Experience with rodent behavioral assays, western blotting, and immunohistochemistry. \n- Familiar with live cell imaging, cell culture techniques, and maintenance of mouse colonies. Teaching Assisant Physiological Control Systems January 2010  –  May 2010  (5 months) Washington University in St. Louis Transcribed lectures, held group and one-on-one tutoring sessions, and co-presented a final review session to 100+ students. Teaching Assisant Physiological Control Systems January 2010  –  May 2010  (5 months) Washington University in St. Louis Transcribed lectures, held group and one-on-one tutoring sessions, and co-presented a final review session to 100+ students. Tutor - General Chemistry Peer Led Team Learning - The Teaching Center 2008  –  2010  (2 years) Washington University in St. Louis - Led groups of six to ten undergraduate students through weekly chemistry problem sets. \n- Utilized peer led team learning methods. \n- Received training to work with students with learning disabilities. Tutor - General Chemistry Peer Led Team Learning - The Teaching Center 2008  –  2010  (2 years) Washington University in St. Louis - Led groups of six to ten undergraduate students through weekly chemistry problem sets. \n- Utilized peer led team learning methods. \n- Received training to work with students with learning disabilities. Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Neuroscience Molecular Biology Biotechnology Cell Biology Fluorescence Microscopy Immunohistochemistry Western Blotting Microscopy Scientific Writing PCR Cell Culture Biochemistry In Vivo Animal Models Tissue Culture Molecular Cloning See 1+     See less Skills  Neuroscience Molecular Biology Biotechnology Cell Biology Fluorescence Microscopy Immunohistochemistry Western Blotting Microscopy Scientific Writing PCR Cell Culture Biochemistry In Vivo Animal Models Tissue Culture Molecular Cloning See 1+     See less Neuroscience Molecular Biology Biotechnology Cell Biology Fluorescence Microscopy Immunohistochemistry Western Blotting Microscopy Scientific Writing PCR Cell Culture Biochemistry In Vivo Animal Models Tissue Culture Molecular Cloning See 1+     See less Neuroscience Molecular Biology Biotechnology Cell Biology Fluorescence Microscopy Immunohistochemistry Western Blotting Microscopy Scientific Writing PCR Cell Culture Biochemistry In Vivo Animal Models Tissue Culture Molecular Cloning See 1+     See less Education Stanford University School of Medicine PhD,  Neuroscience 2011  – 2017 Washington University in St. Louis A.B. summa cum laude,  Major - Biology/Neuroscience; Minors - French ,  Psychology 2007  – 2011 Stanford University School of Medicine PhD,  Neuroscience 2011  – 2017 Stanford University School of Medicine PhD,  Neuroscience 2011  – 2017 Stanford University School of Medicine PhD,  Neuroscience 2011  – 2017 Washington University in St. Louis A.B. summa cum laude,  Major - Biology/Neuroscience; Minors - French ,  Psychology 2007  – 2011 Washington University in St. Louis A.B. summa cum laude,  Major - Biology/Neuroscience; Minors - French ,  Psychology 2007  – 2011 Washington University in St. Louis A.B. summa cum laude,  Major - Biology/Neuroscience; Minors - French ,  Psychology 2007  – 2011 Honors & Awards National Science Foundation Graduate Fellowship National Science Foundation April 2012 Three year national graduate fellowship that pays a $30,000 stipend and a portion of tuition each year. Phi Beta Kappa Member Phi Beta Kappa Society 2011 Elected into Phi Beta Kappa, America's oldest honorary society, for breadth and depth of studies in liberal arts. Sigma Xi Member Sigma Xi, The Scientific Research Society 2011 Honorary society which recognizes achievements in research. Society for Neuroscience FUN Travel Award Society for Neuroscience Faculty for Undergraduate Neuroscience 2010 $750 award to defray travel costs to present research at Society for Neuroscience, an international conference with more than 30,000 attendees each year. National Science Foundation Graduate Fellowship National Science Foundation April 2012 Three year national graduate fellowship that pays a $30,000 stipend and a portion of tuition each year. National Science Foundation Graduate Fellowship National Science Foundation April 2012 Three year national graduate fellowship that pays a $30,000 stipend and a portion of tuition each year. National Science Foundation Graduate Fellowship National Science Foundation April 2012 Three year national graduate fellowship that pays a $30,000 stipend and a portion of tuition each year. Phi Beta Kappa Member Phi Beta Kappa Society 2011 Elected into Phi Beta Kappa, America's oldest honorary society, for breadth and depth of studies in liberal arts. Phi Beta Kappa Member Phi Beta Kappa Society 2011 Elected into Phi Beta Kappa, America's oldest honorary society, for breadth and depth of studies in liberal arts. Phi Beta Kappa Member Phi Beta Kappa Society 2011 Elected into Phi Beta Kappa, America's oldest honorary society, for breadth and depth of studies in liberal arts. Sigma Xi Member Sigma Xi, The Scientific Research Society 2011 Honorary society which recognizes achievements in research. Sigma Xi Member Sigma Xi, The Scientific Research Society 2011 Honorary society which recognizes achievements in research. Sigma Xi Member Sigma Xi, The Scientific Research Society 2011 Honorary society which recognizes achievements in research. Society for Neuroscience FUN Travel Award Society for Neuroscience Faculty for Undergraduate Neuroscience 2010 $750 award to defray travel costs to present research at Society for Neuroscience, an international conference with more than 30,000 attendees each year. Society for Neuroscience FUN Travel Award Society for Neuroscience Faculty for Undergraduate Neuroscience 2010 $750 award to defray travel costs to present research at Society for Neuroscience, an international conference with more than 30,000 attendees each year. Society for Neuroscience FUN Travel Award Society for Neuroscience Faculty for Undergraduate Neuroscience 2010 $750 award to defray travel costs to present research at Society for Neuroscience, an international conference with more than 30,000 attendees each year. ", "Experience Grad Student Stanford University Grad Student Stanford University Grad Student Stanford University ", "Summary I'm a first-year Ph.D. student in Materials Science & Engineering at Stanford University. I'm in the Yi Cui group, working on lithium batteries. Summary I'm a first-year Ph.D. student in Materials Science & Engineering at Stanford University. I'm in the Yi Cui group, working on lithium batteries. I'm a first-year Ph.D. student in Materials Science & Engineering at Stanford University. I'm in the Yi Cui group, working on lithium batteries. I'm a first-year Ph.D. student in Materials Science & Engineering at Stanford University. I'm in the Yi Cui group, working on lithium batteries. Experience Research Assistant Cui Group September 2014  – Present (1 year) Stanford University Research Assistant NanoBioElectronics Lab - Joseph Wang Group September 2010  –  June 2014  (3 years 10 months) University of California, San Diego • Design and fab of nanomotors for biomedical, environmental, and defense applications. \n• Cleanroom processing & materials characterization. President Nanoengineering and Technology Society (NETS) April 2013  –  April 2014  (1 year 1 month) UC San Diego NETS is a student organization at UCSD for nanotechnology-enthusiasts.  \n \n• Managed an executive board of 14. \n• Increased member base by 150% and attendance by 300%. \n• Oversaw the inception and execution of the first UCSD Nano/Chem/Materials career fair.  \n• Initiated science outreach opportunites with San Diego youth. (Fleet Science Center) US Department of Homeland Security Intern Lawrence Berkeley National Laboratory June 2013  –  August 2013  (3 months) Berkeley, CA • Project: Deposition and Characterization of Peptoid Monolayers and Bilayer Nanosheets. \n• Optimized the deposition of self-assembled peptoid nanosheets and monolayers on solid substrates for characterization. \n• Explored different surface chemistries to probe peptoid assembly behavior and hydrophobic interactions. \n• Improved and characterized peptoid deposition methods for use by the group. Vice President, External Affairs Nanoengineering and Technology Society (NETS) May 2012  –  April 2013  (1 year) UC San Diego • Developed and established connections within the local nanotech industry. \n• Created career preparation events for members’ post-graduation plans. Research Assistant Cui Group September 2014  – Present (1 year) Stanford University Research Assistant Cui Group September 2014  – Present (1 year) Stanford University Research Assistant NanoBioElectronics Lab - Joseph Wang Group September 2010  –  June 2014  (3 years 10 months) University of California, San Diego • Design and fab of nanomotors for biomedical, environmental, and defense applications. \n• Cleanroom processing & materials characterization. Research Assistant NanoBioElectronics Lab - Joseph Wang Group September 2010  –  June 2014  (3 years 10 months) University of California, San Diego • Design and fab of nanomotors for biomedical, environmental, and defense applications. \n• Cleanroom processing & materials characterization. President Nanoengineering and Technology Society (NETS) April 2013  –  April 2014  (1 year 1 month) UC San Diego NETS is a student organization at UCSD for nanotechnology-enthusiasts.  \n \n• Managed an executive board of 14. \n• Increased member base by 150% and attendance by 300%. \n• Oversaw the inception and execution of the first UCSD Nano/Chem/Materials career fair.  \n• Initiated science outreach opportunites with San Diego youth. (Fleet Science Center) President Nanoengineering and Technology Society (NETS) April 2013  –  April 2014  (1 year 1 month) UC San Diego NETS is a student organization at UCSD for nanotechnology-enthusiasts.  \n \n• Managed an executive board of 14. \n• Increased member base by 150% and attendance by 300%. \n• Oversaw the inception and execution of the first UCSD Nano/Chem/Materials career fair.  \n• Initiated science outreach opportunites with San Diego youth. (Fleet Science Center) US Department of Homeland Security Intern Lawrence Berkeley National Laboratory June 2013  –  August 2013  (3 months) Berkeley, CA • Project: Deposition and Characterization of Peptoid Monolayers and Bilayer Nanosheets. \n• Optimized the deposition of self-assembled peptoid nanosheets and monolayers on solid substrates for characterization. \n• Explored different surface chemistries to probe peptoid assembly behavior and hydrophobic interactions. \n• Improved and characterized peptoid deposition methods for use by the group. US Department of Homeland Security Intern Lawrence Berkeley National Laboratory June 2013  –  August 2013  (3 months) Berkeley, CA • Project: Deposition and Characterization of Peptoid Monolayers and Bilayer Nanosheets. \n• Optimized the deposition of self-assembled peptoid nanosheets and monolayers on solid substrates for characterization. \n• Explored different surface chemistries to probe peptoid assembly behavior and hydrophobic interactions. \n• Improved and characterized peptoid deposition methods for use by the group. Vice President, External Affairs Nanoengineering and Technology Society (NETS) May 2012  –  April 2013  (1 year) UC San Diego • Developed and established connections within the local nanotech industry. \n• Created career preparation events for members’ post-graduation plans. Vice President, External Affairs Nanoengineering and Technology Society (NETS) May 2012  –  April 2013  (1 year) UC San Diego • Developed and established connections within the local nanotech industry. \n• Created career preparation events for members’ post-graduation plans. Languages English Native or bilingual proficiency Chinese Professional working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Chinese Professional working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Chinese Professional working proficiency Spanish Elementary proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Skills     Education Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2014 University of California, San Diego Bachelor of Science (BS),  Nanoengineering 2010  – 2014 Summa Cum Laude University of California, San Diego Bachelor of Science (BS),  Applied Mathematics 2010  – 2014 Summa Cum Laude Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2014 Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2014 Stanford University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 2014 University of California, San Diego Bachelor of Science (BS),  Nanoengineering 2010  – 2014 Summa Cum Laude University of California, San Diego Bachelor of Science (BS),  Nanoengineering 2010  – 2014 Summa Cum Laude University of California, San Diego Bachelor of Science (BS),  Nanoengineering 2010  – 2014 Summa Cum Laude University of California, San Diego Bachelor of Science (BS),  Applied Mathematics 2010  – 2014 Summa Cum Laude University of California, San Diego Bachelor of Science (BS),  Applied Mathematics 2010  – 2014 Summa Cum Laude University of California, San Diego Bachelor of Science (BS),  Applied Mathematics 2010  – 2014 Summa Cum Laude Honors & Awards NDSEG Fellowship 2014 National Defense Science & Engineering Graduate Fellowship NSF Graduate Research Fellowship 2014 National Science Foundation - Graduate Research Fellowship Program Stanford Graduate Fellowship 2014 http://sgf.stanford.edu Undergraduate Library Research Prize 2013 2nd prize, Physical Sciences Jacobs Scholar 2010 From the Jacobs School of Engineering at UCSD. 2010-2014 Edison Scholar 2010 Howard P. Allen Scholarship from Edison Intl. 2010-2014. Valedictorian 2010 Walnut High School, CA NDSEG Fellowship 2014 National Defense Science & Engineering Graduate Fellowship NDSEG Fellowship 2014 National Defense Science & Engineering Graduate Fellowship NDSEG Fellowship 2014 National Defense Science & Engineering Graduate Fellowship NSF Graduate Research Fellowship 2014 National Science Foundation - Graduate Research Fellowship Program NSF Graduate Research Fellowship 2014 National Science Foundation - Graduate Research Fellowship Program NSF Graduate Research Fellowship 2014 National Science Foundation - Graduate Research Fellowship Program Stanford Graduate Fellowship 2014 http://sgf.stanford.edu Stanford Graduate Fellowship 2014 http://sgf.stanford.edu Stanford Graduate Fellowship 2014 http://sgf.stanford.edu Undergraduate Library Research Prize 2013 2nd prize, Physical Sciences Undergraduate Library Research Prize 2013 2nd prize, Physical Sciences Undergraduate Library Research Prize 2013 2nd prize, Physical Sciences Jacobs Scholar 2010 From the Jacobs School of Engineering at UCSD. 2010-2014 Jacobs Scholar 2010 From the Jacobs School of Engineering at UCSD. 2010-2014 Jacobs Scholar 2010 From the Jacobs School of Engineering at UCSD. 2010-2014 Edison Scholar 2010 Howard P. Allen Scholarship from Edison Intl. 2010-2014. Edison Scholar 2010 Howard P. Allen Scholarship from Edison Intl. 2010-2014. Edison Scholar 2010 Howard P. Allen Scholarship from Edison Intl. 2010-2014. Valedictorian 2010 Walnut High School, CA Valedictorian 2010 Walnut High School, CA Valedictorian 2010 Walnut High School, CA ", "Summary A highly-motivated, and self-starting scholarship athlete (tennis) who is a grad student at Stanford University, studying environmental engineering and “Earth Systems” with an understanding of the connection points between science, ecology, economics and environmental technology. Summary A highly-motivated, and self-starting scholarship athlete (tennis) who is a grad student at Stanford University, studying environmental engineering and “Earth Systems” with an understanding of the connection points between science, ecology, economics and environmental technology. A highly-motivated, and self-starting scholarship athlete (tennis) who is a grad student at Stanford University, studying environmental engineering and “Earth Systems” with an understanding of the connection points between science, ecology, economics and environmental technology. A highly-motivated, and self-starting scholarship athlete (tennis) who is a grad student at Stanford University, studying environmental engineering and “Earth Systems” with an understanding of the connection points between science, ecology, economics and environmental technology. Experience Sustainable Agriculture Apprentice TomKat Ranch Educational Foundation June 2014  – Present (1 year 3 months) Intern Xicato June 2013  –  September 2013  (4 months) Full-time summer job as a part of the marketing team, helping with a wide range of tasks from researching potential clients to helping with press releases and presentation decks for the website. Also played a role in the launch of two new products. Teaching Pro Stanford Nike Tennis Camp June 2012  –  August 2012  (3 months) Stanford, CA Assisted with range of camp administrative work as well as on-court instruction and general counseling duties with campers of various ages. Clerk Robie & Matthai June 2011  –  August 2011  (3 months) Greater Los Angeles Area Full-time summer job encompassing wide spectrum of law office duties in downtown Los Angeles, including document handling, courthouse liaison and others. Experience sitting in on some hearings and observing the attorneys. Duties also included cataloging and organizing, and writing papers. Research Intern Palisades Beautiful June 2010  –  August 2010  (3 months) Pacific Palisades Part-time internship during summer of competitive tournament play in tennis. Led door-to-door campaigns for environmental awareness and beautification within the community. Coordinated and executed community events to raise awareness and foster community involvement, and arrange for parkway tree plantings. Established an organizational system for filing important documents and contact/donor information. Sustainable Agriculture Apprentice TomKat Ranch Educational Foundation June 2014  – Present (1 year 3 months) Sustainable Agriculture Apprentice TomKat Ranch Educational Foundation June 2014  – Present (1 year 3 months) Intern Xicato June 2013  –  September 2013  (4 months) Full-time summer job as a part of the marketing team, helping with a wide range of tasks from researching potential clients to helping with press releases and presentation decks for the website. Also played a role in the launch of two new products. Intern Xicato June 2013  –  September 2013  (4 months) Full-time summer job as a part of the marketing team, helping with a wide range of tasks from researching potential clients to helping with press releases and presentation decks for the website. Also played a role in the launch of two new products. Teaching Pro Stanford Nike Tennis Camp June 2012  –  August 2012  (3 months) Stanford, CA Assisted with range of camp administrative work as well as on-court instruction and general counseling duties with campers of various ages. Teaching Pro Stanford Nike Tennis Camp June 2012  –  August 2012  (3 months) Stanford, CA Assisted with range of camp administrative work as well as on-court instruction and general counseling duties with campers of various ages. Clerk Robie & Matthai June 2011  –  August 2011  (3 months) Greater Los Angeles Area Full-time summer job encompassing wide spectrum of law office duties in downtown Los Angeles, including document handling, courthouse liaison and others. Experience sitting in on some hearings and observing the attorneys. Duties also included cataloging and organizing, and writing papers. Clerk Robie & Matthai June 2011  –  August 2011  (3 months) Greater Los Angeles Area Full-time summer job encompassing wide spectrum of law office duties in downtown Los Angeles, including document handling, courthouse liaison and others. Experience sitting in on some hearings and observing the attorneys. Duties also included cataloging and organizing, and writing papers. Research Intern Palisades Beautiful June 2010  –  August 2010  (3 months) Pacific Palisades Part-time internship during summer of competitive tournament play in tennis. Led door-to-door campaigns for environmental awareness and beautification within the community. Coordinated and executed community events to raise awareness and foster community involvement, and arrange for parkway tree plantings. Established an organizational system for filing important documents and contact/donor information. Research Intern Palisades Beautiful June 2010  –  August 2010  (3 months) Pacific Palisades Part-time internship during summer of competitive tournament play in tennis. Led door-to-door campaigns for environmental awareness and beautification within the community. Coordinated and executed community events to raise awareness and foster community involvement, and arrange for parkway tree plantings. Established an organizational system for filing important documents and contact/donor information. Skills Environmental Design Renewable Energy Policy Renewable Energy Systems Green Building Energy Efficiency Energy Studies Energy Retrofits Energy Policy Sustainable Energy Skills  Environmental Design Renewable Energy Policy Renewable Energy Systems Green Building Energy Efficiency Energy Studies Energy Retrofits Energy Policy Sustainable Energy Environmental Design Renewable Energy Policy Renewable Energy Systems Green Building Energy Efficiency Energy Studies Energy Retrofits Energy Policy Sustainable Energy Environmental Design Renewable Energy Policy Renewable Energy Systems Green Building Energy Efficiency Energy Studies Energy Retrofits Energy Policy Sustainable Energy Education Stanford University Masters of Science,  Earth Systems 2013  – 2014 Stanford University Bachelor's of Science,  Science , Technology and Society 2009  – 2013 Stanford University Masters of Science,  Earth Systems 2013  – 2014 Stanford University Masters of Science,  Earth Systems 2013  – 2014 Stanford University Masters of Science,  Earth Systems 2013  – 2014 Stanford University Bachelor's of Science,  Science , Technology and Society 2009  – 2013 Stanford University Bachelor's of Science,  Science , Technology and Society 2009  – 2013 Stanford University Bachelor's of Science,  Science , Technology and Society 2009  – 2013 ", "Summary Civil society and the nature of democratic participation are changing. \n \nNonprofit organizations look and operate increasingly like for-profit organizations. Activism appears to be shifting from the streets to shareholder meetings, discussions of divestment, and is enacted through social media and ideologically-tinged consumption. Boycotts appear to have shifted to buycotts as customers are offered a plethora of opportunities to \"buy good\"​ (think Tom's shoes). Policy and social programs are increasingly grounded in evidence and decisions are cast in terms of costs and benefits. The super rich - both philanthropists and the underwriters of elections - play a substantial role in setting public agendas.  \n \nThe civil society of today is a far cry from the one de Tocqueville famously observed in the 1830s. And yet, we broadly maintain nostalgic notions of American civil religion, even lamenting its demise.  \n \nMy research seeks to better understand how these shifts shape the way citizens engage with and attempt to shape society. How does the rationalizing of nonprofit organizations change the work they do? What happens to policy creation as it is increasingly bounded by cost-benefit frameworks? What happens as extra-institutional contentiousness is leached from activism? How far does the private politics of politically-oriented consumerism go to placate other forms of engagement?  \n \nThese questions are important theoretically as they engage with political, organizational, and economic strains in sociology. Perhaps more importantly, however, my interests regard the evolving nature of citizen engagement in modern democratic societies.  \n \n \nPreviously: \nPrinceton University, A.B. \nMathematica Policy Research \nUrban Institute, Justice Policy Center \nAppalachian Trail Summary Civil society and the nature of democratic participation are changing. \n \nNonprofit organizations look and operate increasingly like for-profit organizations. Activism appears to be shifting from the streets to shareholder meetings, discussions of divestment, and is enacted through social media and ideologically-tinged consumption. Boycotts appear to have shifted to buycotts as customers are offered a plethora of opportunities to \"buy good\"​ (think Tom's shoes). Policy and social programs are increasingly grounded in evidence and decisions are cast in terms of costs and benefits. The super rich - both philanthropists and the underwriters of elections - play a substantial role in setting public agendas.  \n \nThe civil society of today is a far cry from the one de Tocqueville famously observed in the 1830s. And yet, we broadly maintain nostalgic notions of American civil religion, even lamenting its demise.  \n \nMy research seeks to better understand how these shifts shape the way citizens engage with and attempt to shape society. How does the rationalizing of nonprofit organizations change the work they do? What happens to policy creation as it is increasingly bounded by cost-benefit frameworks? What happens as extra-institutional contentiousness is leached from activism? How far does the private politics of politically-oriented consumerism go to placate other forms of engagement?  \n \nThese questions are important theoretically as they engage with political, organizational, and economic strains in sociology. Perhaps more importantly, however, my interests regard the evolving nature of citizen engagement in modern democratic societies.  \n \n \nPreviously: \nPrinceton University, A.B. \nMathematica Policy Research \nUrban Institute, Justice Policy Center \nAppalachian Trail Civil society and the nature of democratic participation are changing. \n \nNonprofit organizations look and operate increasingly like for-profit organizations. Activism appears to be shifting from the streets to shareholder meetings, discussions of divestment, and is enacted through social media and ideologically-tinged consumption. Boycotts appear to have shifted to buycotts as customers are offered a plethora of opportunities to \"buy good\"​ (think Tom's shoes). Policy and social programs are increasingly grounded in evidence and decisions are cast in terms of costs and benefits. The super rich - both philanthropists and the underwriters of elections - play a substantial role in setting public agendas.  \n \nThe civil society of today is a far cry from the one de Tocqueville famously observed in the 1830s. And yet, we broadly maintain nostalgic notions of American civil religion, even lamenting its demise.  \n \nMy research seeks to better understand how these shifts shape the way citizens engage with and attempt to shape society. How does the rationalizing of nonprofit organizations change the work they do? What happens to policy creation as it is increasingly bounded by cost-benefit frameworks? What happens as extra-institutional contentiousness is leached from activism? How far does the private politics of politically-oriented consumerism go to placate other forms of engagement?  \n \nThese questions are important theoretically as they engage with political, organizational, and economic strains in sociology. Perhaps more importantly, however, my interests regard the evolving nature of citizen engagement in modern democratic societies.  \n \n \nPreviously: \nPrinceton University, A.B. \nMathematica Policy Research \nUrban Institute, Justice Policy Center \nAppalachian Trail Civil society and the nature of democratic participation are changing. \n \nNonprofit organizations look and operate increasingly like for-profit organizations. Activism appears to be shifting from the streets to shareholder meetings, discussions of divestment, and is enacted through social media and ideologically-tinged consumption. Boycotts appear to have shifted to buycotts as customers are offered a plethora of opportunities to \"buy good\"​ (think Tom's shoes). Policy and social programs are increasingly grounded in evidence and decisions are cast in terms of costs and benefits. The super rich - both philanthropists and the underwriters of elections - play a substantial role in setting public agendas.  \n \nThe civil society of today is a far cry from the one de Tocqueville famously observed in the 1830s. And yet, we broadly maintain nostalgic notions of American civil religion, even lamenting its demise.  \n \nMy research seeks to better understand how these shifts shape the way citizens engage with and attempt to shape society. How does the rationalizing of nonprofit organizations change the work they do? What happens to policy creation as it is increasingly bounded by cost-benefit frameworks? What happens as extra-institutional contentiousness is leached from activism? How far does the private politics of politically-oriented consumerism go to placate other forms of engagement?  \n \nThese questions are important theoretically as they engage with political, organizational, and economic strains in sociology. Perhaps more importantly, however, my interests regard the evolving nature of citizen engagement in modern democratic societies.  \n \n \nPreviously: \nPrinceton University, A.B. \nMathematica Policy Research \nUrban Institute, Justice Policy Center \nAppalachian Trail Experience Research Assistant The Urban Institute March 2011  –  April 2013  (2 years 2 months) Washington, DC Research Assistant / Programmer Mathematica Policy Research August 2010  –  March 2011  (8 months) Cost-Benefit Analysis Intern Vera Institute of Justice June 2009  –  August 2009  (3 months) Strategic Resources Department Research Intern United Food and Commercial Workers International Union May 2008  –  August 2008  (4 months) Research Intern PCCI June 2006  –  August 2006  (3 months) Research Assistant The Urban Institute March 2011  –  April 2013  (2 years 2 months) Washington, DC Research Assistant The Urban Institute March 2011  –  April 2013  (2 years 2 months) Washington, DC Research Assistant / Programmer Mathematica Policy Research August 2010  –  March 2011  (8 months) Research Assistant / Programmer Mathematica Policy Research August 2010  –  March 2011  (8 months) Cost-Benefit Analysis Intern Vera Institute of Justice June 2009  –  August 2009  (3 months) Cost-Benefit Analysis Intern Vera Institute of Justice June 2009  –  August 2009  (3 months) Strategic Resources Department Research Intern United Food and Commercial Workers International Union May 2008  –  August 2008  (4 months) Strategic Resources Department Research Intern United Food and Commercial Workers International Union May 2008  –  August 2008  (4 months) Research Intern PCCI June 2006  –  August 2006  (3 months) Research Intern PCCI June 2006  –  August 2006  (3 months) Languages Spanish Spanish Spanish Skills Ethnography Econometrics Interviewing Participant Observation Stata ArcGIS SPSS Mixed Methods criticism witticism Skills  Ethnography Econometrics Interviewing Participant Observation Stata ArcGIS SPSS Mixed Methods criticism witticism Ethnography Econometrics Interviewing Participant Observation Stata ArcGIS SPSS Mixed Methods criticism witticism Ethnography Econometrics Interviewing Participant Observation Stata ArcGIS SPSS Mixed Methods criticism witticism Education Stanford University (Pursuing) PhD,  Sociology 2013  – 2020 Activities and Societies:  Center on Philanthropy and Civil Society\nStanford Project on Emerging Nonprofits Princeton University B.A.,  Sociology 2006  – 2010 Activities and Societies:  Princeton Microfinance Organization (PMO) ,  Cap & Gown Eating Club ,  Princeton Cycling Team ,  Princeton Varsity Rowing Stanford University (Pursuing) PhD,  Sociology 2013  – 2020 Activities and Societies:  Center on Philanthropy and Civil Society\nStanford Project on Emerging Nonprofits Stanford University (Pursuing) PhD,  Sociology 2013  – 2020 Activities and Societies:  Center on Philanthropy and Civil Society\nStanford Project on Emerging Nonprofits Stanford University (Pursuing) PhD,  Sociology 2013  – 2020 Activities and Societies:  Center on Philanthropy and Civil Society\nStanford Project on Emerging Nonprofits Princeton University B.A.,  Sociology 2006  – 2010 Activities and Societies:  Princeton Microfinance Organization (PMO) ,  Cap & Gown Eating Club ,  Princeton Cycling Team ,  Princeton Varsity Rowing Princeton University B.A.,  Sociology 2006  – 2010 Activities and Societies:  Princeton Microfinance Organization (PMO) ,  Cap & Gown Eating Club ,  Princeton Cycling Team ,  Princeton Varsity Rowing Princeton University B.A.,  Sociology 2006  – 2010 Activities and Societies:  Princeton Microfinance Organization (PMO) ,  Cap & Gown Eating Club ,  Princeton Cycling Team ,  Princeton Varsity Rowing Honors & Awards Additional Honors & Awards NSF GRFP Honorable Mention (2014) \nIsisdore Brown Senior Thesis Award (Princeton Sociology, 2010) \nGraduate with High Honors (Princeton Sociology, 2010) \nVoted Most Likely to Succeed in Mrs. McDowell's 2nd Grade Class (Sangster Elementary, 1996) Additional Honors & Awards NSF GRFP Honorable Mention (2014) \nIsisdore Brown Senior Thesis Award (Princeton Sociology, 2010) \nGraduate with High Honors (Princeton Sociology, 2010) \nVoted Most Likely to Succeed in Mrs. McDowell's 2nd Grade Class (Sangster Elementary, 1996) Additional Honors & Awards NSF GRFP Honorable Mention (2014) \nIsisdore Brown Senior Thesis Award (Princeton Sociology, 2010) \nGraduate with High Honors (Princeton Sociology, 2010) \nVoted Most Likely to Succeed in Mrs. McDowell's 2nd Grade Class (Sangster Elementary, 1996) Additional Honors & Awards NSF GRFP Honorable Mention (2014) \nIsisdore Brown Senior Thesis Award (Princeton Sociology, 2010) \nGraduate with High Honors (Princeton Sociology, 2010) \nVoted Most Likely to Succeed in Mrs. McDowell's 2nd Grade Class (Sangster Elementary, 1996) ", "Summary Grad Student at Stanford EE/CS, doing research at Stanford's InfoLab. Researching systems for easier and better data mining. Summary Grad Student at Stanford EE/CS, doing research at Stanford's InfoLab. Researching systems for easier and better data mining. Grad Student at Stanford EE/CS, doing research at Stanford's InfoLab. Researching systems for easier and better data mining. Grad Student at Stanford EE/CS, doing research at Stanford's InfoLab. Researching systems for easier and better data mining. Experience Research (Grad Student) Stanford University April 2013  –  June 2015  (2 years 3 months) Work on Ringo - a system for interactive graph analytics on big-memory machines, at SNAP group under Prof. Jure Leskovec. Ringo is a system for exploratory and interactive graph construction and analysis, targeted for big-memory many-core machines. Ringo enables fast and high-productivity graph analysis and ETL from structured data. \nLink to website: http://snap.stanford.edu/ringo/ Software Engineering Intern Google June 2014  –  September 2014  (4 months) Greater New York City Area Interned at Local Search, and worked on diversifying local related business recommendations Compiler Engineer CEVA August 2011  –  August 2012  (1 year 1 month) Hertzeliya, Israel Implementation and optimization of a C language compiler for a family of DSP architectures circuit design engineer (student position) Intel September 2009  –  April 2011  (1 year 8 months) VLSI circuit design engineer at mobile microprocessor core group. My work focused on data-path design inside the CPU core. Duties included design of data-path building blocks under timing, area and power constraints. Instructor Technion Students Association June 2008  –  August 2009  (1 year 3 months) Instructor of student study groups in calculus. \nDuties included lesson preparation and frontal teaching of calculus to students. Research (Grad Student) Stanford University April 2013  –  June 2015  (2 years 3 months) Work on Ringo - a system for interactive graph analytics on big-memory machines, at SNAP group under Prof. Jure Leskovec. Ringo is a system for exploratory and interactive graph construction and analysis, targeted for big-memory many-core machines. Ringo enables fast and high-productivity graph analysis and ETL from structured data. \nLink to website: http://snap.stanford.edu/ringo/ Research (Grad Student) Stanford University April 2013  –  June 2015  (2 years 3 months) Work on Ringo - a system for interactive graph analytics on big-memory machines, at SNAP group under Prof. Jure Leskovec. Ringo is a system for exploratory and interactive graph construction and analysis, targeted for big-memory many-core machines. Ringo enables fast and high-productivity graph analysis and ETL from structured data. \nLink to website: http://snap.stanford.edu/ringo/ Software Engineering Intern Google June 2014  –  September 2014  (4 months) Greater New York City Area Interned at Local Search, and worked on diversifying local related business recommendations Software Engineering Intern Google June 2014  –  September 2014  (4 months) Greater New York City Area Interned at Local Search, and worked on diversifying local related business recommendations Compiler Engineer CEVA August 2011  –  August 2012  (1 year 1 month) Hertzeliya, Israel Implementation and optimization of a C language compiler for a family of DSP architectures Compiler Engineer CEVA August 2011  –  August 2012  (1 year 1 month) Hertzeliya, Israel Implementation and optimization of a C language compiler for a family of DSP architectures circuit design engineer (student position) Intel September 2009  –  April 2011  (1 year 8 months) VLSI circuit design engineer at mobile microprocessor core group. My work focused on data-path design inside the CPU core. Duties included design of data-path building blocks under timing, area and power constraints. circuit design engineer (student position) Intel September 2009  –  April 2011  (1 year 8 months) VLSI circuit design engineer at mobile microprocessor core group. My work focused on data-path design inside the CPU core. Duties included design of data-path building blocks under timing, area and power constraints. Instructor Technion Students Association June 2008  –  August 2009  (1 year 3 months) Instructor of student study groups in calculus. \nDuties included lesson preparation and frontal teaching of calculus to students. Instructor Technion Students Association June 2008  –  August 2009  (1 year 3 months) Instructor of student study groups in calculus. \nDuties included lesson preparation and frontal teaching of calculus to students. Skills C Algorithms C++ Matlab Processors Software Engineering OOP Object Oriented Design Java Python Parallel Programming MapReduce SQL Databases Data Mining Machine Learning See 1+     See less Skills  C Algorithms C++ Matlab Processors Software Engineering OOP Object Oriented Design Java Python Parallel Programming MapReduce SQL Databases Data Mining Machine Learning See 1+     See less C Algorithms C++ Matlab Processors Software Engineering OOP Object Oriented Design Java Python Parallel Programming MapReduce SQL Databases Data Mining Machine Learning See 1+     See less C Algorithms C++ Matlab Processors Software Engineering OOP Object Oriented Design Java Python Parallel Programming MapReduce SQL Databases Data Mining Machine Learning See 1+     See less Education Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2012  – 2018 Stanford University Master of Science (MS),  Computer Science , GPA: 3.9 2012  – 2015 Technion - Israel Institute of Technology Bachlor's,  Computer Engineering (EE-CS joint degree) 2006  – 2011 Cumulative average: 91.6 - graduated with honors (cum laude) Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2012  – 2018 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2012  – 2018 Stanford University Doctor of Philosophy (Ph.D.),  Electrical Engineering 2012  – 2018 Stanford University Master of Science (MS),  Computer Science , GPA: 3.9 2012  – 2015 Stanford University Master of Science (MS),  Computer Science , GPA: 3.9 2012  – 2015 Stanford University Master of Science (MS),  Computer Science , GPA: 3.9 2012  – 2015 Technion - Israel Institute of Technology Bachlor's,  Computer Engineering (EE-CS joint degree) 2006  – 2011 Cumulative average: 91.6 - graduated with honors (cum laude) Technion - Israel Institute of Technology Bachlor's,  Computer Engineering (EE-CS joint degree) 2006  – 2011 Cumulative average: 91.6 - graduated with honors (cum laude) Technion - Israel Institute of Technology Bachlor's,  Computer Engineering (EE-CS joint degree) 2006  – 2011 Cumulative average: 91.6 - graduated with honors (cum laude) Honors & Awards P. Michael Farmwald Stanford Graduate Fellowship September 2012 P. Michael Farmwald Stanford Graduate Fellowship September 2012 P. Michael Farmwald Stanford Graduate Fellowship September 2012 P. Michael Farmwald Stanford Graduate Fellowship September 2012 ", "Experience Grad Student Stanford University Grad Student Stanford University Grad Student Stanford University Skills Python Skills  Python Python Python Education Stanford University PhD,  Applied Mathematics , Convex Optimization 2009  – 2015 Stanford University PhD,  Applied Mathematics , Convex Optimization 2009  – 2015 Stanford University PhD,  Applied Mathematics , Convex Optimization 2009  – 2015 Stanford University PhD,  Applied Mathematics , Convex Optimization 2009  – 2015 ", "Summary I work on resource-efficient scheduling and resource allocation techniques for large-scale datacenters. In the past I have also worked on workload and system modeling for datacenter applications.  \n \nSpecialties: Energy Efficient Datacenter Design, Computer Architecture, Computer Systems, Workload Characterization for Datacenter Applications. Summary I work on resource-efficient scheduling and resource allocation techniques for large-scale datacenters. In the past I have also worked on workload and system modeling for datacenter applications.  \n \nSpecialties: Energy Efficient Datacenter Design, Computer Architecture, Computer Systems, Workload Characterization for Datacenter Applications. I work on resource-efficient scheduling and resource allocation techniques for large-scale datacenters. In the past I have also worked on workload and system modeling for datacenter applications.  \n \nSpecialties: Energy Efficient Datacenter Design, Computer Architecture, Computer Systems, Workload Characterization for Datacenter Applications. I work on resource-efficient scheduling and resource allocation techniques for large-scale datacenters. In the past I have also worked on workload and system modeling for datacenter applications.  \n \nSpecialties: Energy Efficient Datacenter Design, Computer Architecture, Computer Systems, Workload Characterization for Datacenter Applications. Experience Grad Student Stanford University September 2009  – Present (6 years) Electrical Engineering Department Intern - Software Engineer Twitter June 2013  –  September 2013  (4 months) San Francisco Bay Area Intern Microsoft June 2010  –  September 2010  (4 months) Developed a model and generation framework for datacenter storage workloads like the backend of Websearch, Email and MapReduce. Validated the accuracy of this framework and applied it in several use cases to show the benefits of optimizations such as SSD caching and defragmentation. Undergraduate Student National Technical University of Athens 2004  –  2009  (5 years) Electrical And Computer Engineering Department Grad Student Stanford University September 2009  – Present (6 years) Electrical Engineering Department Grad Student Stanford University September 2009  – Present (6 years) Electrical Engineering Department Intern - Software Engineer Twitter June 2013  –  September 2013  (4 months) San Francisco Bay Area Intern - Software Engineer Twitter June 2013  –  September 2013  (4 months) San Francisco Bay Area Intern Microsoft June 2010  –  September 2010  (4 months) Developed a model and generation framework for datacenter storage workloads like the backend of Websearch, Email and MapReduce. Validated the accuracy of this framework and applied it in several use cases to show the benefits of optimizations such as SSD caching and defragmentation. Intern Microsoft June 2010  –  September 2010  (4 months) Developed a model and generation framework for datacenter storage workloads like the backend of Websearch, Email and MapReduce. Validated the accuracy of this framework and applied it in several use cases to show the benefits of optimizations such as SSD caching and defragmentation. Undergraduate Student National Technical University of Athens 2004  –  2009  (5 years) Electrical And Computer Engineering Department Undergraduate Student National Technical University of Athens 2004  –  2009  (5 years) Electrical And Computer Engineering Department Languages Greek English French Spanish Greek English French Spanish Greek English French Spanish Skills Machine Learning Computer Architecture Datacenter Architectures Optimization VLSI Electrical Engineering Circuit Design Parallel Programming High Performance... Algorithms Scalability LaTeX Simulations Parallel Computing MapReduce Skills  Machine Learning Computer Architecture Datacenter Architectures Optimization VLSI Electrical Engineering Circuit Design Parallel Programming High Performance... Algorithms Scalability LaTeX Simulations Parallel Computing MapReduce Machine Learning Computer Architecture Datacenter Architectures Optimization VLSI Electrical Engineering Circuit Design Parallel Programming High Performance... Algorithms Scalability LaTeX Simulations Parallel Computing MapReduce Machine Learning Computer Architecture Datacenter Architectures Optimization VLSI Electrical Engineering Circuit Design Parallel Programming High Performance... Algorithms Scalability LaTeX Simulations Parallel Computing MapReduce Education Ethniko Metsovio Polytechnico Diploma,  Electrical and Computer Engineering 2004  – 2009 National Technical University of Athens Diploma,  Electrical and Computer Engineering 2004  – 2009 Stanford University PhD,  Electrical Engineering 2009 Ethniko Metsovio Polytechnico Diploma,  Electrical and Computer Engineering 2004  – 2009 Ethniko Metsovio Polytechnico Diploma,  Electrical and Computer Engineering 2004  – 2009 Ethniko Metsovio Polytechnico Diploma,  Electrical and Computer Engineering 2004  – 2009 National Technical University of Athens Diploma,  Electrical and Computer Engineering 2004  – 2009 National Technical University of Athens Diploma,  Electrical and Computer Engineering 2004  – 2009 National Technical University of Athens Diploma,  Electrical and Computer Engineering 2004  – 2009 Stanford University PhD,  Electrical Engineering 2009 Stanford University PhD,  Electrical Engineering 2009 Stanford University PhD,  Electrical Engineering 2009 ", "Experience Investment Associate Prudential Financial 2012  – Present (3 years) Newark, NJ Investment Risk Management Investment Associate Prudential Financial 2012  – Present (3 years) Newark, NJ Investment Risk Management Investment Associate Prudential Financial 2012  – Present (3 years) Newark, NJ Investment Risk Management Skills Data Analysis Financial Markets Skills  Data Analysis Financial Markets Data Analysis Financial Markets Data Analysis Financial Markets Education Stanford University M.S.,  Computational and Mathematical Engineering 2008  – 2010 Stanford University M.S.,  Computational and Mathematical Engineering 2008  – 2010 Stanford University M.S.,  Computational and Mathematical Engineering 2008  – 2010 Stanford University M.S.,  Computational and Mathematical Engineering 2008  – 2010 ", "Experience Senior Matlab Developer Cargill March 2014  – Present (1 year 6 months) Geneva Area, Switzerland • Responsible for design, build and implementation of the engine that evaluate ocean freight and bunker using Matlab. \n• Application feature includes flexible architecture to cater for future functional add-ons, robust class based framework to accommodate increasing complexity of numerical calculations, setup agile development practices to aid support and future developments. \n• Implemented test driven development methodology to speed up UAT process \n• Other responsibilities include providing training for colleagues in Matlab OOD and development best practices. Credit Risk Analyst J.P. Morgan June 2011  –  May 2013  (2 years) Geneva Area, Switzerland * Developed the Management Information System (MIS) and Key Perfomance Indicators (KPI) for the entire credit department of the international private bank (EMEA).  \n*Performed stress and whatif analysis to provide senior management and investors with credit risk reports. \n* Automated credit control tasks using Bloomberg, BusinessObjects, MS Access and MS Excel including VBA and SQL. \n* Collated Credit Risk management data from Private Bank and Corporate systems and produced specific reporting (MIS, KPI, ad-hoc requests…) depending on the requirements of the business. \n* Data Analysis - performed analysis on Credit data, interpreted results and making recommendations. \n* Presented findings, solutions and recommendations in a business \n* Identified issues, explained causes, details business /client impact and built a business case and consensus for change. \n* Participated in technology and reengineering initiatives, implementation of solutions, including testing. \n* Developed over a short time frame an in - depth knowledge of the current policies, workflows, system functionality. \n* Executed some operational controls across the team, CSA update, Standard LV maintenance, set up of covenant and special monitoring. Grad Student at Stanford university Stanford University January 2011  –  January 2012  (1 year 1 month) Part time in the data mining program. Partner Feast Bay Farming January 2009  –  2011  (2 years) San Francisco (East) Bay Area Designed an implemented permaculture gardens in private properties and contributed to community gardens. Lead Analytic Software Engineer Fair Isaac Corporation February 2000  –  November 2008  (8 years 10 months) San Francisco Bay Area Lead Analytic Software Engineer \n* Conferred with analysts to design system and to obtain information on project limitations and requirements and interfaces that ensured customer satisfaction. \n* Developed scorecard software providing a crucial tool for analysts to compute FICO scores.  \n* Maintained and enhanced binning engine as the first step of scorecard development based on Groovy scripting language improving customer interface \n* Maintained linear and logistic regression, and neural nets engines and the main workbench written in Java using XML and Castor technologies increasing productivity \nAnalytics Consultant, Research and Development, Decision Technology \n* Researched and developed a prototype for credit card portfolio simulation analytics using econometric modeling, time series analysis, as well as implementing, analyzing, and documenting portfolio simulation models. Teaching Assistant, Computational Finance Department Oregon Health & Science University September 1998  –  September 1999  (1 year 1 month) . Teaching Assistant, Ecometrics department University of Geneva 1995  –  1998  (3 years) Econometrics department. Senior Matlab Developer Cargill March 2014  – Present (1 year 6 months) Geneva Area, Switzerland • Responsible for design, build and implementation of the engine that evaluate ocean freight and bunker using Matlab. \n• Application feature includes flexible architecture to cater for future functional add-ons, robust class based framework to accommodate increasing complexity of numerical calculations, setup agile development practices to aid support and future developments. \n• Implemented test driven development methodology to speed up UAT process \n• Other responsibilities include providing training for colleagues in Matlab OOD and development best practices. Senior Matlab Developer Cargill March 2014  – Present (1 year 6 months) Geneva Area, Switzerland • Responsible for design, build and implementation of the engine that evaluate ocean freight and bunker using Matlab. \n• Application feature includes flexible architecture to cater for future functional add-ons, robust class based framework to accommodate increasing complexity of numerical calculations, setup agile development practices to aid support and future developments. \n• Implemented test driven development methodology to speed up UAT process \n• Other responsibilities include providing training for colleagues in Matlab OOD and development best practices. Credit Risk Analyst J.P. Morgan June 2011  –  May 2013  (2 years) Geneva Area, Switzerland * Developed the Management Information System (MIS) and Key Perfomance Indicators (KPI) for the entire credit department of the international private bank (EMEA).  \n*Performed stress and whatif analysis to provide senior management and investors with credit risk reports. \n* Automated credit control tasks using Bloomberg, BusinessObjects, MS Access and MS Excel including VBA and SQL. \n* Collated Credit Risk management data from Private Bank and Corporate systems and produced specific reporting (MIS, KPI, ad-hoc requests…) depending on the requirements of the business. \n* Data Analysis - performed analysis on Credit data, interpreted results and making recommendations. \n* Presented findings, solutions and recommendations in a business \n* Identified issues, explained causes, details business /client impact and built a business case and consensus for change. \n* Participated in technology and reengineering initiatives, implementation of solutions, including testing. \n* Developed over a short time frame an in - depth knowledge of the current policies, workflows, system functionality. \n* Executed some operational controls across the team, CSA update, Standard LV maintenance, set up of covenant and special monitoring. Credit Risk Analyst J.P. Morgan June 2011  –  May 2013  (2 years) Geneva Area, Switzerland * Developed the Management Information System (MIS) and Key Perfomance Indicators (KPI) for the entire credit department of the international private bank (EMEA).  \n*Performed stress and whatif analysis to provide senior management and investors with credit risk reports. \n* Automated credit control tasks using Bloomberg, BusinessObjects, MS Access and MS Excel including VBA and SQL. \n* Collated Credit Risk management data from Private Bank and Corporate systems and produced specific reporting (MIS, KPI, ad-hoc requests…) depending on the requirements of the business. \n* Data Analysis - performed analysis on Credit data, interpreted results and making recommendations. \n* Presented findings, solutions and recommendations in a business \n* Identified issues, explained causes, details business /client impact and built a business case and consensus for change. \n* Participated in technology and reengineering initiatives, implementation of solutions, including testing. \n* Developed over a short time frame an in - depth knowledge of the current policies, workflows, system functionality. \n* Executed some operational controls across the team, CSA update, Standard LV maintenance, set up of covenant and special monitoring. Grad Student at Stanford university Stanford University January 2011  –  January 2012  (1 year 1 month) Part time in the data mining program. Grad Student at Stanford university Stanford University January 2011  –  January 2012  (1 year 1 month) Part time in the data mining program. Partner Feast Bay Farming January 2009  –  2011  (2 years) San Francisco (East) Bay Area Designed an implemented permaculture gardens in private properties and contributed to community gardens. Partner Feast Bay Farming January 2009  –  2011  (2 years) San Francisco (East) Bay Area Designed an implemented permaculture gardens in private properties and contributed to community gardens. Lead Analytic Software Engineer Fair Isaac Corporation February 2000  –  November 2008  (8 years 10 months) San Francisco Bay Area Lead Analytic Software Engineer \n* Conferred with analysts to design system and to obtain information on project limitations and requirements and interfaces that ensured customer satisfaction. \n* Developed scorecard software providing a crucial tool for analysts to compute FICO scores.  \n* Maintained and enhanced binning engine as the first step of scorecard development based on Groovy scripting language improving customer interface \n* Maintained linear and logistic regression, and neural nets engines and the main workbench written in Java using XML and Castor technologies increasing productivity \nAnalytics Consultant, Research and Development, Decision Technology \n* Researched and developed a prototype for credit card portfolio simulation analytics using econometric modeling, time series analysis, as well as implementing, analyzing, and documenting portfolio simulation models. Lead Analytic Software Engineer Fair Isaac Corporation February 2000  –  November 2008  (8 years 10 months) San Francisco Bay Area Lead Analytic Software Engineer \n* Conferred with analysts to design system and to obtain information on project limitations and requirements and interfaces that ensured customer satisfaction. \n* Developed scorecard software providing a crucial tool for analysts to compute FICO scores.  \n* Maintained and enhanced binning engine as the first step of scorecard development based on Groovy scripting language improving customer interface \n* Maintained linear and logistic regression, and neural nets engines and the main workbench written in Java using XML and Castor technologies increasing productivity \nAnalytics Consultant, Research and Development, Decision Technology \n* Researched and developed a prototype for credit card portfolio simulation analytics using econometric modeling, time series analysis, as well as implementing, analyzing, and documenting portfolio simulation models. Teaching Assistant, Computational Finance Department Oregon Health & Science University September 1998  –  September 1999  (1 year 1 month) . Teaching Assistant, Computational Finance Department Oregon Health & Science University September 1998  –  September 1999  (1 year 1 month) . Teaching Assistant, Ecometrics department University of Geneva 1995  –  1998  (3 years) Econometrics department. Teaching Assistant, Ecometrics department University of Geneva 1995  –  1998  (3 years) Econometrics department. Skills R Data Mining Analytics Econometrics Statistical Modeling Statistics Economics Quantitative Finance Financial Modeling Data Analysis Monte Carlo Simulation Time Series Analysis Matlab Financial Analysis Quantitative Analytics Credit Risk Analysis See 2+     See less Skills  R Data Mining Analytics Econometrics Statistical Modeling Statistics Economics Quantitative Finance Financial Modeling Data Analysis Monte Carlo Simulation Time Series Analysis Matlab Financial Analysis Quantitative Analytics Credit Risk Analysis See 2+     See less R Data Mining Analytics Econometrics Statistical Modeling Statistics Economics Quantitative Finance Financial Modeling Data Analysis Monte Carlo Simulation Time Series Analysis Matlab Financial Analysis Quantitative Analytics Credit Risk Analysis See 2+     See less R Data Mining Analytics Econometrics Statistical Modeling Statistics Economics Quantitative Finance Financial Modeling Data Analysis Monte Carlo Simulation Time Series Analysis Matlab Financial Analysis Quantitative Analytics Credit Risk Analysis See 2+     See less Education Stanford University Certificte,  Data Mining , A 2011  – 2011 Merritt College Certificate,  permaculture , A 2008  – 2010 Oregon Health and Science University Master's degree,  Computational Finance 1998  – 1999 University of Geneva Master,  Econometrics 1990  – 1998 Stanford University Certificte,  Data Mining , A 2011  – 2011 Stanford University Certificte,  Data Mining , A 2011  – 2011 Stanford University Certificte,  Data Mining , A 2011  – 2011 Merritt College Certificate,  permaculture , A 2008  – 2010 Merritt College Certificate,  permaculture , A 2008  – 2010 Merritt College Certificate,  permaculture , A 2008  – 2010 Oregon Health and Science University Master's degree,  Computational Finance 1998  – 1999 Oregon Health and Science University Master's degree,  Computational Finance 1998  – 1999 Oregon Health and Science University Master's degree,  Computational Finance 1998  – 1999 University of Geneva Master,  Econometrics 1990  – 1998 University of Geneva Master,  Econometrics 1990  – 1998 University of Geneva Master,  Econometrics 1990  – 1998 ", "Summary interested in conflict resolution, peacemaking, environmental issues, spirituality, teaching, workshops, healing, travel, family and friends Summary interested in conflict resolution, peacemaking, environmental issues, spirituality, teaching, workshops, healing, travel, family and friends interested in conflict resolution, peacemaking, environmental issues, spirituality, teaching, workshops, healing, travel, family and friends interested in conflict resolution, peacemaking, environmental issues, spirituality, teaching, workshops, healing, travel, family and friends Experience Supervising Chaplain Nevada Department of Correcetions 2003  –  2008  (5 years) Carson City, NV I arragned for all religious groups to have a time and place for their worship/gatherings, including Christian, Jewish, Budhist, Native Americans, Pagans, Muslims, etc. I trained and supervised several hundred volunteers from the outside and set them up with times to visit the groups they were affiliated with. I hired and trained other new Chaplains for different prisons. I did a lot of personal counseling at three prisons in Carson City and led Christian worship services at all three prisons. I also gave legal advice to the Director and other staff about the legal rights or prisoners, commented on prisoner complaints--pro and con, and visited the sick and dying prisoners in the prison hospital. Professor College of Transfiguration, Anglican Seminary 1998  –  1998  (less than a year) Grahamstown, South Africa Professor of Theology and Pastoral Care Professor of Criminal Justice Boise State University 1981  –  1995  (14 years) Boise, ID I taught mainly and regularly Social Justice, Victims of Crime, Corrections, Juvenile Justice. I occasionaly taught Reasons for Prison Riots, Ethics of Substance Abuse Counselers, Police, Criminal Law, etc. I arranged and led the annual Victims' Rights Week in April and Victims of Violence in October, both week-long occasions with many speakers and panels of experts and victims to which students and the publice could attend and earn 1-3 college units for attending the weeks activities. I served on the Faculty Senate and as the President of the the BSU Chapter of Association of American University Professors. Program Manager, NM Restitution Project New Mexico Criminal Justice Department 1978  –  1980  (2 years) Santa Fe, NM I superivsed a staff of nine people. The Project was part of a national LEAA funded study that included five states. We collected data from several sites about how effective the ordering of Restitution by judges for offenders to pay their victims, was for the victims, and the offenders. The sites included a District Attorney's office for offenders who were ordered to pay restitution instead of going to jail or prison; a Probation and Parole office for those who had been convicted and for thwom paying restitution was part of their probation or parole sentence.  Chief Planner New Mexico State Police 1975  –  1978  (3 years) Santa Fe, NM I had a staff of two, and collected data from all 13 District Offices on what the officers were accomplishing, what their office was responsible for, etc. I published an Annual Report that went to the Governor and the Legislature and interested citizens. We also wrote the Department's first Five Year Plan in 1977 with the input of officers from all 13 District offices and the Executive staff at HQ. I researched and wrote a paper on the Connection Between DWI and Accidents, and other papers, testified at the Legislature, wrote speeches for the Chief, and served on various commitees in-house and representing the Dept. with other agencies., Criminal Justice Specialist Bernalillo County Mental Health Center 1974  –  1975  (1 year) Albuquerque, NM I was the main liaison between the Mental Health Center, the local Jail, the state Prison, and the Federal Criminal Justice agencies in the state. I worked with the Center's Half-way House and its staff, did some groups in the state prison, and worked with local community health facilities. I wrote a grant that funded the Half-way house, and a Mental Health unit in the new Metro-Jail (city & county), worked with District Court judges, testified at the State Legislature, etc. Grad Student & Teacher Stanford-Soledad Teaching Project 1971  –  1974  (3 years) Stanford University & Soledad Prison, CA taught college courses at Soledad Prison as a volunteer while a grad student at Stanford University Supervising Chaplain Nevada Department of Correcetions 2003  –  2008  (5 years) Carson City, NV I arragned for all religious groups to have a time and place for their worship/gatherings, including Christian, Jewish, Budhist, Native Americans, Pagans, Muslims, etc. I trained and supervised several hundred volunteers from the outside and set them up with times to visit the groups they were affiliated with. I hired and trained other new Chaplains for different prisons. I did a lot of personal counseling at three prisons in Carson City and led Christian worship services at all three prisons. I also gave legal advice to the Director and other staff about the legal rights or prisoners, commented on prisoner complaints--pro and con, and visited the sick and dying prisoners in the prison hospital. Supervising Chaplain Nevada Department of Correcetions 2003  –  2008  (5 years) Carson City, NV I arragned for all religious groups to have a time and place for their worship/gatherings, including Christian, Jewish, Budhist, Native Americans, Pagans, Muslims, etc. I trained and supervised several hundred volunteers from the outside and set them up with times to visit the groups they were affiliated with. I hired and trained other new Chaplains for different prisons. I did a lot of personal counseling at three prisons in Carson City and led Christian worship services at all three prisons. I also gave legal advice to the Director and other staff about the legal rights or prisoners, commented on prisoner complaints--pro and con, and visited the sick and dying prisoners in the prison hospital. Professor College of Transfiguration, Anglican Seminary 1998  –  1998  (less than a year) Grahamstown, South Africa Professor of Theology and Pastoral Care Professor College of Transfiguration, Anglican Seminary 1998  –  1998  (less than a year) Grahamstown, South Africa Professor of Theology and Pastoral Care Professor of Criminal Justice Boise State University 1981  –  1995  (14 years) Boise, ID I taught mainly and regularly Social Justice, Victims of Crime, Corrections, Juvenile Justice. I occasionaly taught Reasons for Prison Riots, Ethics of Substance Abuse Counselers, Police, Criminal Law, etc. I arranged and led the annual Victims' Rights Week in April and Victims of Violence in October, both week-long occasions with many speakers and panels of experts and victims to which students and the publice could attend and earn 1-3 college units for attending the weeks activities. I served on the Faculty Senate and as the President of the the BSU Chapter of Association of American University Professors. Professor of Criminal Justice Boise State University 1981  –  1995  (14 years) Boise, ID I taught mainly and regularly Social Justice, Victims of Crime, Corrections, Juvenile Justice. I occasionaly taught Reasons for Prison Riots, Ethics of Substance Abuse Counselers, Police, Criminal Law, etc. I arranged and led the annual Victims' Rights Week in April and Victims of Violence in October, both week-long occasions with many speakers and panels of experts and victims to which students and the publice could attend and earn 1-3 college units for attending the weeks activities. I served on the Faculty Senate and as the President of the the BSU Chapter of Association of American University Professors. Program Manager, NM Restitution Project New Mexico Criminal Justice Department 1978  –  1980  (2 years) Santa Fe, NM I superivsed a staff of nine people. The Project was part of a national LEAA funded study that included five states. We collected data from several sites about how effective the ordering of Restitution by judges for offenders to pay their victims, was for the victims, and the offenders. The sites included a District Attorney's office for offenders who were ordered to pay restitution instead of going to jail or prison; a Probation and Parole office for those who had been convicted and for thwom paying restitution was part of their probation or parole sentence.  Program Manager, NM Restitution Project New Mexico Criminal Justice Department 1978  –  1980  (2 years) Santa Fe, NM I superivsed a staff of nine people. The Project was part of a national LEAA funded study that included five states. We collected data from several sites about how effective the ordering of Restitution by judges for offenders to pay their victims, was for the victims, and the offenders. The sites included a District Attorney's office for offenders who were ordered to pay restitution instead of going to jail or prison; a Probation and Parole office for those who had been convicted and for thwom paying restitution was part of their probation or parole sentence.  Chief Planner New Mexico State Police 1975  –  1978  (3 years) Santa Fe, NM I had a staff of two, and collected data from all 13 District Offices on what the officers were accomplishing, what their office was responsible for, etc. I published an Annual Report that went to the Governor and the Legislature and interested citizens. We also wrote the Department's first Five Year Plan in 1977 with the input of officers from all 13 District offices and the Executive staff at HQ. I researched and wrote a paper on the Connection Between DWI and Accidents, and other papers, testified at the Legislature, wrote speeches for the Chief, and served on various commitees in-house and representing the Dept. with other agencies., Chief Planner New Mexico State Police 1975  –  1978  (3 years) Santa Fe, NM I had a staff of two, and collected data from all 13 District Offices on what the officers were accomplishing, what their office was responsible for, etc. I published an Annual Report that went to the Governor and the Legislature and interested citizens. We also wrote the Department's first Five Year Plan in 1977 with the input of officers from all 13 District offices and the Executive staff at HQ. I researched and wrote a paper on the Connection Between DWI and Accidents, and other papers, testified at the Legislature, wrote speeches for the Chief, and served on various commitees in-house and representing the Dept. with other agencies., Criminal Justice Specialist Bernalillo County Mental Health Center 1974  –  1975  (1 year) Albuquerque, NM I was the main liaison between the Mental Health Center, the local Jail, the state Prison, and the Federal Criminal Justice agencies in the state. I worked with the Center's Half-way House and its staff, did some groups in the state prison, and worked with local community health facilities. I wrote a grant that funded the Half-way house, and a Mental Health unit in the new Metro-Jail (city & county), worked with District Court judges, testified at the State Legislature, etc. Criminal Justice Specialist Bernalillo County Mental Health Center 1974  –  1975  (1 year) Albuquerque, NM I was the main liaison between the Mental Health Center, the local Jail, the state Prison, and the Federal Criminal Justice agencies in the state. I worked with the Center's Half-way House and its staff, did some groups in the state prison, and worked with local community health facilities. I wrote a grant that funded the Half-way house, and a Mental Health unit in the new Metro-Jail (city & county), worked with District Court judges, testified at the State Legislature, etc. Grad Student & Teacher Stanford-Soledad Teaching Project 1971  –  1974  (3 years) Stanford University & Soledad Prison, CA taught college courses at Soledad Prison as a volunteer while a grad student at Stanford University Grad Student & Teacher Stanford-Soledad Teaching Project 1971  –  1974  (3 years) Stanford University & Soledad Prison, CA taught college courses at Soledad Prison as a volunteer while a grad student at Stanford University Languages English Spanish English Spanish English Spanish Skills Professor, Workshop... Microsoft Office Theology Meditation Conflict Resolution Poetry Pastoral Care Teaching Volunteer Management Leadership Community Outreach Grant Writing Public Speaking Program Development Nonprofits Community Organizing Fundraising Research Editing Hospice care Alternatives to Violence Non-profit Leadership Non-profit Boards Non-profit... Non-profit Volunteer Criminal Justice Clergy Care Giving Aministration Community Mental Health University Teaching Workshop Facilitation Teacher of Critical... Teaching of Criminal &... Teaching of... International Travel Mediation See 22+     See less Skills  Professor, Workshop... Microsoft Office Theology Meditation Conflict Resolution Poetry Pastoral Care Teaching Volunteer Management Leadership Community Outreach Grant Writing Public Speaking Program Development Nonprofits Community Organizing Fundraising Research Editing Hospice care Alternatives to Violence Non-profit Leadership Non-profit Boards Non-profit... Non-profit Volunteer Criminal Justice Clergy Care Giving Aministration Community Mental Health University Teaching Workshop Facilitation Teacher of Critical... Teaching of Criminal &... Teaching of... International Travel Mediation See 22+     See less Professor, Workshop... Microsoft Office Theology Meditation Conflict Resolution Poetry Pastoral Care Teaching Volunteer Management Leadership Community Outreach Grant Writing Public Speaking Program Development Nonprofits Community Organizing Fundraising Research Editing Hospice care Alternatives to Violence Non-profit Leadership Non-profit Boards Non-profit... Non-profit Volunteer Criminal Justice Clergy Care Giving Aministration Community Mental Health University Teaching Workshop Facilitation Teacher of Critical... Teaching of Criminal &... Teaching of... International Travel Mediation See 22+     See less Professor, Workshop... Microsoft Office Theology Meditation Conflict Resolution Poetry Pastoral Care Teaching Volunteer Management Leadership Community Outreach Grant Writing Public Speaking Program Development Nonprofits Community Organizing Fundraising Research Editing Hospice care Alternatives to Violence Non-profit Leadership Non-profit Boards Non-profit... Non-profit Volunteer Criminal Justice Clergy Care Giving Aministration Community Mental Health University Teaching Workshop Facilitation Teacher of Critical... Teaching of Criminal &... Teaching of... International Travel Mediation See 22+     See less Education Church Divinity School of the Pacific Master of Divinity (M.Div.),  Theology/Theological Studies , A 1994  – 1997 I attended three years and took classes at eight of the nine seminaries that are part of the Graduate Theological Union. I graduated with an M.Div. I did two years of residency with a church in San Francisco and a year as a Chaplain at Summit Hospital in Oakland, CA. Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government , A 1971  – 1974 I put myself through the Political Science doctoral program as a single parent with four young children, ages 2-7 at the beginning. I did a year of research at DVI Prison, which was scratched at the end due to an unprecented simultaneous lock-down of three main prisons, including DVI, which lasted for several months. I ended up finally earning my Ph.D. in 1985, based on research collected while I was Project Manager of New Mexico's Restitution Project, 1978-79, abd beginning teched at Boise State University in 1981.. Activities and Societies:  Fields of interest: Philosphy ,  Government ,  Public Administration Stanford University Doctor of Philosophy (Ph.D.),  Political Science ,  emphasis in Criminal Justice 1970  – 1974 University of California, Berkeley Bachelor's degree, Master's Degree,  Political Science and Government , A 1956  – 1960 I earned my BA in Political Science in 1959, and went on to do the course work fro my Master's degree in 1960. Church Divinity School of the Pacific Master of Divinity (M.Div.),  Theology/Theological Studies , A 1994  – 1997 I attended three years and took classes at eight of the nine seminaries that are part of the Graduate Theological Union. I graduated with an M.Div. I did two years of residency with a church in San Francisco and a year as a Chaplain at Summit Hospital in Oakland, CA. Church Divinity School of the Pacific Master of Divinity (M.Div.),  Theology/Theological Studies , A 1994  – 1997 I attended three years and took classes at eight of the nine seminaries that are part of the Graduate Theological Union. I graduated with an M.Div. I did two years of residency with a church in San Francisco and a year as a Chaplain at Summit Hospital in Oakland, CA. Church Divinity School of the Pacific Master of Divinity (M.Div.),  Theology/Theological Studies , A 1994  – 1997 I attended three years and took classes at eight of the nine seminaries that are part of the Graduate Theological Union. I graduated with an M.Div. I did two years of residency with a church in San Francisco and a year as a Chaplain at Summit Hospital in Oakland, CA. Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government , A 1971  – 1974 I put myself through the Political Science doctoral program as a single parent with four young children, ages 2-7 at the beginning. I did a year of research at DVI Prison, which was scratched at the end due to an unprecented simultaneous lock-down of three main prisons, including DVI, which lasted for several months. I ended up finally earning my Ph.D. in 1985, based on research collected while I was Project Manager of New Mexico's Restitution Project, 1978-79, abd beginning teched at Boise State University in 1981.. Activities and Societies:  Fields of interest: Philosphy ,  Government ,  Public Administration Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government , A 1971  – 1974 I put myself through the Political Science doctoral program as a single parent with four young children, ages 2-7 at the beginning. I did a year of research at DVI Prison, which was scratched at the end due to an unprecented simultaneous lock-down of three main prisons, including DVI, which lasted for several months. I ended up finally earning my Ph.D. in 1985, based on research collected while I was Project Manager of New Mexico's Restitution Project, 1978-79, abd beginning teched at Boise State University in 1981.. Activities and Societies:  Fields of interest: Philosphy ,  Government ,  Public Administration Stanford University Doctor of Philosophy (Ph.D.),  Political Science and Government , A 1971  – 1974 I put myself through the Political Science doctoral program as a single parent with four young children, ages 2-7 at the beginning. I did a year of research at DVI Prison, which was scratched at the end due to an unprecented simultaneous lock-down of three main prisons, including DVI, which lasted for several months. I ended up finally earning my Ph.D. in 1985, based on research collected while I was Project Manager of New Mexico's Restitution Project, 1978-79, abd beginning teched at Boise State University in 1981.. Activities and Societies:  Fields of interest: Philosphy ,  Government ,  Public Administration Stanford University Doctor of Philosophy (Ph.D.),  Political Science ,  emphasis in Criminal Justice 1970  – 1974 Stanford University Doctor of Philosophy (Ph.D.),  Political Science ,  emphasis in Criminal Justice 1970  – 1974 Stanford University Doctor of Philosophy (Ph.D.),  Political Science ,  emphasis in Criminal Justice 1970  – 1974 University of California, Berkeley Bachelor's degree, Master's Degree,  Political Science and Government , A 1956  – 1960 I earned my BA in Political Science in 1959, and went on to do the course work fro my Master's degree in 1960. University of California, Berkeley Bachelor's degree, Master's Degree,  Political Science and Government , A 1956  – 1960 I earned my BA in Political Science in 1959, and went on to do the course work fro my Master's degree in 1960. University of California, Berkeley Bachelor's degree, Master's Degree,  Political Science and Government , A 1956  – 1960 I earned my BA in Political Science in 1959, and went on to do the course work fro my Master's degree in 1960. ", "Summary Focus Groups with Psychological Insights. Great combination of marketing research and psychology to provide the perfect blend of research. And, many techniques honed over the years to get the \"good stuff\" from respondents! Have been invited speaker at many qualitative conferences over the years, detailing my unique methods of getting the most out of respondents, facilities, and more. Let's talk. \n \nSpecialties: Now moderating online focus groups with webcams in addition to traditional focus groups with travel. \n \nHonored as one of the top moderators in the nation by Survey Magazine in July, 2014. Proud of that! Summary Focus Groups with Psychological Insights. Great combination of marketing research and psychology to provide the perfect blend of research. And, many techniques honed over the years to get the \"good stuff\" from respondents! Have been invited speaker at many qualitative conferences over the years, detailing my unique methods of getting the most out of respondents, facilities, and more. Let's talk. \n \nSpecialties: Now moderating online focus groups with webcams in addition to traditional focus groups with travel. \n \nHonored as one of the top moderators in the nation by Survey Magazine in July, 2014. Proud of that! Focus Groups with Psychological Insights. Great combination of marketing research and psychology to provide the perfect blend of research. And, many techniques honed over the years to get the \"good stuff\" from respondents! Have been invited speaker at many qualitative conferences over the years, detailing my unique methods of getting the most out of respondents, facilities, and more. Let's talk. \n \nSpecialties: Now moderating online focus groups with webcams in addition to traditional focus groups with travel. \n \nHonored as one of the top moderators in the nation by Survey Magazine in July, 2014. Proud of that! Focus Groups with Psychological Insights. Great combination of marketing research and psychology to provide the perfect blend of research. And, many techniques honed over the years to get the \"good stuff\" from respondents! Have been invited speaker at many qualitative conferences over the years, detailing my unique methods of getting the most out of respondents, facilities, and more. Let's talk. \n \nSpecialties: Now moderating online focus groups with webcams in addition to traditional focus groups with travel. \n \nHonored as one of the top moderators in the nation by Survey Magazine in July, 2014. Proud of that! Experience Owner Frieden Qualitative Services 1984  – Present (31 years) Moderate focus groups and IDIs, provide full service for clients, including Full Analysis reports with recommendations. Assist in designing marketing research projects. Marketing Research Analyst ASI Market Research Inc. 1979  –  1984  (5 years) Assistant Professor University of Southern California 1978  –  1979  (1 year) Owner Frieden Qualitative Services 1984  – Present (31 years) Moderate focus groups and IDIs, provide full service for clients, including Full Analysis reports with recommendations. Assist in designing marketing research projects. Owner Frieden Qualitative Services 1984  – Present (31 years) Moderate focus groups and IDIs, provide full service for clients, including Full Analysis reports with recommendations. Assist in designing marketing research projects. Marketing Research Analyst ASI Market Research Inc. 1979  –  1984  (5 years) Marketing Research Analyst ASI Market Research Inc. 1979  –  1984  (5 years) Assistant Professor University of Southern California 1978  –  1979  (1 year) Assistant Professor University of Southern California 1978  –  1979  (1 year) Skills Focus Groups Qualitative Research Marketing Research Moderating Advertising Research Consumer Insights Qualitative Market... Online Research Copy Testing Market Research Customer Satisfaction Customer Insight Advertising Online Moderation Consumer Insight Data Collection Survey Design Exit Surveys Consumer Behaviour Questionnaire Design Research Design Online Focus Groups Questionnaires Analytics Segmentation Survey Research Brand Architecture Quantitative Research Qualitative Data Primary Research Competitive Intelligence Ethnography Brand Loyalty Insight Generation Secondary Research Mystery Shopping Business Insights Brand Equity Marketing SPSS Survey Methodology IDIs Market Intelligence Market Analysis Product Innovation Concept Generation Positioning Eye Tracking Shopper Marketing Quantitative Analytics See 35+     See less Skills  Focus Groups Qualitative Research Marketing Research Moderating Advertising Research Consumer Insights Qualitative Market... Online Research Copy Testing Market Research Customer Satisfaction Customer Insight Advertising Online Moderation Consumer Insight Data Collection Survey Design Exit Surveys Consumer Behaviour Questionnaire Design Research Design Online Focus Groups Questionnaires Analytics Segmentation Survey Research Brand Architecture Quantitative Research Qualitative Data Primary Research Competitive Intelligence Ethnography Brand Loyalty Insight Generation Secondary Research Mystery Shopping Business Insights Brand Equity Marketing SPSS Survey Methodology IDIs Market Intelligence Market Analysis Product Innovation Concept Generation Positioning Eye Tracking Shopper Marketing Quantitative Analytics See 35+     See less Focus Groups Qualitative Research Marketing Research Moderating Advertising Research Consumer Insights Qualitative Market... Online Research Copy Testing Market Research Customer Satisfaction Customer Insight Advertising Online Moderation Consumer Insight Data Collection Survey Design Exit Surveys Consumer Behaviour Questionnaire Design Research Design Online Focus Groups Questionnaires Analytics Segmentation Survey Research Brand Architecture Quantitative Research Qualitative Data Primary Research Competitive Intelligence Ethnography Brand Loyalty Insight Generation Secondary Research Mystery Shopping Business Insights Brand Equity Marketing SPSS Survey Methodology IDIs Market Intelligence Market Analysis Product Innovation Concept Generation Positioning Eye Tracking Shopper Marketing Quantitative Analytics See 35+     See less Focus Groups Qualitative Research Marketing Research Moderating Advertising Research Consumer Insights Qualitative Market... Online Research Copy Testing Market Research Customer Satisfaction Customer Insight Advertising Online Moderation Consumer Insight Data Collection Survey Design Exit Surveys Consumer Behaviour Questionnaire Design Research Design Online Focus Groups Questionnaires Analytics Segmentation Survey Research Brand Architecture Quantitative Research Qualitative Data Primary Research Competitive Intelligence Ethnography Brand Loyalty Insight Generation Secondary Research Mystery Shopping Business Insights Brand Equity Marketing SPSS Survey Methodology IDIs Market Intelligence Market Analysis Product Innovation Concept Generation Positioning Eye Tracking Shopper Marketing Quantitative Analytics See 35+     See less Education USC, UCLA, Stanford Ph.D.,  Social Psychology I've been written up in TIME Magazine, and have been highlighted on television on the news with Connie Chung, commented on the OJ Simpson trial on MSNBC, on Hour Magazine discussing my research, and more. Activities and Societies:  Undergrad: UCLA -- highest honors in Psychology\nTaught/lectured at USC and UCLA.\nVisiting grad student at Stanford University ,  where I gave guest lectures to graduate students. USC, UCLA, Stanford Ph.D.,  Social Psychology I've been written up in TIME Magazine, and have been highlighted on television on the news with Connie Chung, commented on the OJ Simpson trial on MSNBC, on Hour Magazine discussing my research, and more. Activities and Societies:  Undergrad: UCLA -- highest honors in Psychology\nTaught/lectured at USC and UCLA.\nVisiting grad student at Stanford University ,  where I gave guest lectures to graduate students. USC, UCLA, Stanford Ph.D.,  Social Psychology I've been written up in TIME Magazine, and have been highlighted on television on the news with Connie Chung, commented on the OJ Simpson trial on MSNBC, on Hour Magazine discussing my research, and more. Activities and Societies:  Undergrad: UCLA -- highest honors in Psychology\nTaught/lectured at USC and UCLA.\nVisiting grad student at Stanford University ,  where I gave guest lectures to graduate students. USC, UCLA, Stanford Ph.D.,  Social Psychology I've been written up in TIME Magazine, and have been highlighted on television on the news with Connie Chung, commented on the OJ Simpson trial on MSNBC, on Hour Magazine discussing my research, and more. Activities and Societies:  Undergrad: UCLA -- highest honors in Psychology\nTaught/lectured at USC and UCLA.\nVisiting grad student at Stanford University ,  where I gave guest lectures to graduate students. Honors & Awards One of the top moderators in the USA Survey Magazine July 2014 Was profiled as one of the best moderators in the nation in this online magazine. Great honor. A special thank you to LEK Consulting! One of the top moderators in the USA Survey Magazine July 2014 Was profiled as one of the best moderators in the nation in this online magazine. Great honor. A special thank you to LEK Consulting! One of the top moderators in the USA Survey Magazine July 2014 Was profiled as one of the best moderators in the nation in this online magazine. Great honor. A special thank you to LEK Consulting! One of the top moderators in the USA Survey Magazine July 2014 Was profiled as one of the best moderators in the nation in this online magazine. Great honor. A special thank you to LEK Consulting! "]}