{"position": "Graduate Student", "company": "Stanford University", "profiles": ["Summary I am a seismologist with a strong interest in the development of earthquake early warning systems. I am currently working on improving earthquake detections for the ElarmS earthquake early warning system. As a graduate student at Stanford University, I worked with the Quake-Catcher Network (QCN) team to develop a world-wide low-cost seismic network using inexpensive MEMS accelerometers to record earthquakes. Summary I am a seismologist with a strong interest in the development of earthquake early warning systems. I am currently working on improving earthquake detections for the ElarmS earthquake early warning system. As a graduate student at Stanford University, I worked with the Quake-Catcher Network (QCN) team to develop a world-wide low-cost seismic network using inexpensive MEMS accelerometers to record earthquakes. I am a seismologist with a strong interest in the development of earthquake early warning systems. I am currently working on improving earthquake detections for the ElarmS earthquake early warning system. As a graduate student at Stanford University, I worked with the Quake-Catcher Network (QCN) team to develop a world-wide low-cost seismic network using inexpensive MEMS accelerometers to record earthquakes. I am a seismologist with a strong interest in the development of earthquake early warning systems. I am currently working on improving earthquake detections for the ElarmS earthquake early warning system. As a graduate student at Stanford University, I worked with the Quake-Catcher Network (QCN) team to develop a world-wide low-cost seismic network using inexpensive MEMS accelerometers to record earthquakes. Experience Postdoctoral Research Scholar Berkeley Seismological Laboratory September 2014  – Present (1 year) For my postdoctoral research at the Berkeley Seismological Laboratory, I am exploring ways to improve the ElarmS earthquake early warning algorithm and methodology. I am particularly interested in using the frequency content soon after a trigger to determine whether or not the trigger was due to a local earthquake. Graduate Student Stanford University July 2008  –  August 2014  (6 years 2 months) Stanford, CA While at Stanford University, I expanded the network by leading teams to install hundreds of sensors in Chile, New Zealand, Mexico, and the San Francisco Bay Area. I then used the data to explore the rapid earthquake detection capabilities of the network. I also explored the use of MEMS sensors and the QCN network in determining the response of a building. The resolution of the sensors at the time was too low to calculate a good response, but the technology proved promising. QCN is also an excellent tool for teaching people of all ages about earthquakes and the physics of motion. Staff Research Associate Berkeley Seismological Lab June 2007  –  July 2008  (1 year 2 months) Berkeley, CA Investigated the rupture process of a sequence of repeating Mw2.1 earthquakes on the San Andreas Fault in Parkfield, CA. Postdoctoral Research Scholar Berkeley Seismological Laboratory September 2014  – Present (1 year) For my postdoctoral research at the Berkeley Seismological Laboratory, I am exploring ways to improve the ElarmS earthquake early warning algorithm and methodology. I am particularly interested in using the frequency content soon after a trigger to determine whether or not the trigger was due to a local earthquake. Postdoctoral Research Scholar Berkeley Seismological Laboratory September 2014  – Present (1 year) For my postdoctoral research at the Berkeley Seismological Laboratory, I am exploring ways to improve the ElarmS earthquake early warning algorithm and methodology. I am particularly interested in using the frequency content soon after a trigger to determine whether or not the trigger was due to a local earthquake. Graduate Student Stanford University July 2008  –  August 2014  (6 years 2 months) Stanford, CA While at Stanford University, I expanded the network by leading teams to install hundreds of sensors in Chile, New Zealand, Mexico, and the San Francisco Bay Area. I then used the data to explore the rapid earthquake detection capabilities of the network. I also explored the use of MEMS sensors and the QCN network in determining the response of a building. The resolution of the sensors at the time was too low to calculate a good response, but the technology proved promising. QCN is also an excellent tool for teaching people of all ages about earthquakes and the physics of motion. Graduate Student Stanford University July 2008  –  August 2014  (6 years 2 months) Stanford, CA While at Stanford University, I expanded the network by leading teams to install hundreds of sensors in Chile, New Zealand, Mexico, and the San Francisco Bay Area. I then used the data to explore the rapid earthquake detection capabilities of the network. I also explored the use of MEMS sensors and the QCN network in determining the response of a building. The resolution of the sensors at the time was too low to calculate a good response, but the technology proved promising. QCN is also an excellent tool for teaching people of all ages about earthquakes and the physics of motion. Staff Research Associate Berkeley Seismological Lab June 2007  –  July 2008  (1 year 2 months) Berkeley, CA Investigated the rupture process of a sequence of repeating Mw2.1 earthquakes on the San Andreas Fault in Parkfield, CA. Staff Research Associate Berkeley Seismological Lab June 2007  –  July 2008  (1 year 2 months) Berkeley, CA Investigated the rupture process of a sequence of repeating Mw2.1 earthquakes on the San Andreas Fault in Parkfield, CA. Languages Spanish Spanish Spanish Skills Physics Earth Science Seismology Sensors Numerical Analysis PowerPoint Geology Experimentation Teaching Scientific Computing Geophysics Science Matlab Data Analysis Research Skills  Physics Earth Science Seismology Sensors Numerical Analysis PowerPoint Geology Experimentation Teaching Scientific Computing Geophysics Science Matlab Data Analysis Research Physics Earth Science Seismology Sensors Numerical Analysis PowerPoint Geology Experimentation Teaching Scientific Computing Geophysics Science Matlab Data Analysis Research Physics Earth Science Seismology Sensors Numerical Analysis PowerPoint Geology Experimentation Teaching Scientific Computing Geophysics Science Matlab Data Analysis Research Education Stanford University Doctor of Philosophy (PhD),  Geophysics 2008  – 2014 PhD in Geophysics. University of California, Berkeley BA,  Geophysics 2003  – 2007 B.A. in Geophysics Stanford University Doctor of Philosophy (PhD),  Geophysics 2008  – 2014 PhD in Geophysics. Stanford University Doctor of Philosophy (PhD),  Geophysics 2008  – 2014 PhD in Geophysics. Stanford University Doctor of Philosophy (PhD),  Geophysics 2008  – 2014 PhD in Geophysics. University of California, Berkeley BA,  Geophysics 2003  – 2007 B.A. in Geophysics University of California, Berkeley BA,  Geophysics 2003  – 2007 B.A. in Geophysics University of California, Berkeley BA,  Geophysics 2003  – 2007 B.A. in Geophysics Honors & Awards Additional Honors & Awards 2012-2013 USGS-Stanford Fellowship \nOutstanding Student Presentation Award, 2012 SSA Annual Meeting Additional Honors & Awards 2012-2013 USGS-Stanford Fellowship \nOutstanding Student Presentation Award, 2012 SSA Annual Meeting Additional Honors & Awards 2012-2013 USGS-Stanford Fellowship \nOutstanding Student Presentation Award, 2012 SSA Annual Meeting Additional Honors & Awards 2012-2013 USGS-Stanford Fellowship \nOutstanding Student Presentation Award, 2012 SSA Annual Meeting ", "Experience Graduate Student Stanford University August 2012  – Present (3 years 1 month) Lead Experience Designer DIRECTV April 2010  –  August 2012  (2 years 5 months) User Experience Consultant Canadian Imperial Bank of Canada 2009  –  2010  (1 year) Researcher Interactive Media Lab 2006  –  2010  (4 years) Researcher Keio University, Japan May 2007  –  September 2007  (5 months) Intern Alias|Wavefront 2004  –  2005  (1 year) Graduate Student Stanford University August 2012  – Present (3 years 1 month) Graduate Student Stanford University August 2012  – Present (3 years 1 month) Lead Experience Designer DIRECTV April 2010  –  August 2012  (2 years 5 months) Lead Experience Designer DIRECTV April 2010  –  August 2012  (2 years 5 months) User Experience Consultant Canadian Imperial Bank of Canada 2009  –  2010  (1 year) User Experience Consultant Canadian Imperial Bank of Canada 2009  –  2010  (1 year) Researcher Interactive Media Lab 2006  –  2010  (4 years) Researcher Interactive Media Lab 2006  –  2010  (4 years) Researcher Keio University, Japan May 2007  –  September 2007  (5 months) Researcher Keio University, Japan May 2007  –  September 2007  (5 months) Intern Alias|Wavefront 2004  –  2005  (1 year) Intern Alias|Wavefront 2004  –  2005  (1 year) Skills Information Architecture Research Human Computer... Mobile Devices Experience Design Strategy Digital Media User-centered Design Data Analysis Usability Testing User Experience Interaction Design Heuristic Evaluation User Interface Design User Research User Interface Contextual Inquiry Rapid Prototyping Usability Engineering Research Design User Experience Design Wireframes HTML See 8+     See less Skills  Information Architecture Research Human Computer... Mobile Devices Experience Design Strategy Digital Media User-centered Design Data Analysis Usability Testing User Experience Interaction Design Heuristic Evaluation User Interface Design User Research User Interface Contextual Inquiry Rapid Prototyping Usability Engineering Research Design User Experience Design Wireframes HTML See 8+     See less Information Architecture Research Human Computer... Mobile Devices Experience Design Strategy Digital Media User-centered Design Data Analysis Usability Testing User Experience Interaction Design Heuristic Evaluation User Interface Design User Research User Interface Contextual Inquiry Rapid Prototyping Usability Engineering Research Design User Experience Design Wireframes HTML See 8+     See less Information Architecture Research Human Computer... Mobile Devices Experience Design Strategy Digital Media User-centered Design Data Analysis Usability Testing User Experience Interaction Design Heuristic Evaluation User Interface Design User Research User Interface Contextual Inquiry Rapid Prototyping Usability Engineering Research Design User Experience Design Wireframes HTML See 8+     See less Education University of Toronto Master of Applied Science 2006  – 2008 University of Toronto Bachelor of Applied Science 2001  – 2006 Stanford University Ph.D. 2012 University of Toronto Master of Applied Science 2006  – 2008 University of Toronto Master of Applied Science 2006  – 2008 University of Toronto Master of Applied Science 2006  – 2008 University of Toronto Bachelor of Applied Science 2001  – 2006 University of Toronto Bachelor of Applied Science 2001  – 2006 University of Toronto Bachelor of Applied Science 2001  – 2006 Stanford University Ph.D. 2012 Stanford University Ph.D. 2012 Stanford University Ph.D. 2012 Honors & Awards ", "Summary I am currently a graduate student at Stanford University, California. I study and conduct research on the problem of storing, analyzing and creating values from massive and distributed data sources in diverse formats such as relational, text, semi-structured and graphs. Summary I am currently a graduate student at Stanford University, California. I study and conduct research on the problem of storing, analyzing and creating values from massive and distributed data sources in diverse formats such as relational, text, semi-structured and graphs. I am currently a graduate student at Stanford University, California. I study and conduct research on the problem of storing, analyzing and creating values from massive and distributed data sources in diverse formats such as relational, text, semi-structured and graphs. I am currently a graduate student at Stanford University, California. I study and conduct research on the problem of storing, analyzing and creating values from massive and distributed data sources in diverse formats such as relational, text, semi-structured and graphs. Experience Graduate Student Stanford University September 2013  – Present (2 years) Software Engineer Nanyang Technological University June 2012  –  August 2013  (1 year 3 months) Singapore Led a team of four researchers to develop a maritime-focused news search engine and news aggregator for Singapore Ministry of Defense. The developed system fused various data mining and information retrieval techniques such as near-duplicate detection, HTML content extraction, topic modeling on short texts, named entity recognition to deliver reliability-ranked, real-time and maritime-focused news articles. Research Assistant Nanyang Technological University June 2010  –  August 2013  (3 years 3 months) Developed novel and efficient algorithms to query massive graph databases and a prototype system on Java to experiment the efficiency of the new algorithms on social networks and bio-chemical graphs with millions of nodes \n \nCollected millions of socially tagged images from Flickr and developed algorithms to extract and leverage these tags to improve both accuracy and usability of image search. \n \nDeveloped novel and highly efficient and effective algorithms to extract information from XML databases using keyword search, especially when XML database contains irregular and evolutionary data. Graduate Student Stanford University September 2013  – Present (2 years) Graduate Student Stanford University September 2013  – Present (2 years) Software Engineer Nanyang Technological University June 2012  –  August 2013  (1 year 3 months) Singapore Led a team of four researchers to develop a maritime-focused news search engine and news aggregator for Singapore Ministry of Defense. The developed system fused various data mining and information retrieval techniques such as near-duplicate detection, HTML content extraction, topic modeling on short texts, named entity recognition to deliver reliability-ranked, real-time and maritime-focused news articles. Software Engineer Nanyang Technological University June 2012  –  August 2013  (1 year 3 months) Singapore Led a team of four researchers to develop a maritime-focused news search engine and news aggregator for Singapore Ministry of Defense. The developed system fused various data mining and information retrieval techniques such as near-duplicate detection, HTML content extraction, topic modeling on short texts, named entity recognition to deliver reliability-ranked, real-time and maritime-focused news articles. Research Assistant Nanyang Technological University June 2010  –  August 2013  (3 years 3 months) Developed novel and efficient algorithms to query massive graph databases and a prototype system on Java to experiment the efficiency of the new algorithms on social networks and bio-chemical graphs with millions of nodes \n \nCollected millions of socially tagged images from Flickr and developed algorithms to extract and leverage these tags to improve both accuracy and usability of image search. \n \nDeveloped novel and highly efficient and effective algorithms to extract information from XML databases using keyword search, especially when XML database contains irregular and evolutionary data. Research Assistant Nanyang Technological University June 2010  –  August 2013  (3 years 3 months) Developed novel and efficient algorithms to query massive graph databases and a prototype system on Java to experiment the efficiency of the new algorithms on social networks and bio-chemical graphs with millions of nodes \n \nCollected millions of socially tagged images from Flickr and developed algorithms to extract and leverage these tags to improve both accuracy and usability of image search. \n \nDeveloped novel and highly efficient and effective algorithms to extract information from XML databases using keyword search, especially when XML database contains irregular and evolutionary data. Languages Vietnamese Vietnamese Vietnamese Skills Java C++ C C# Python MySQL Microsoft SQL Server Hadoop Lucene JavaScript HTML PHP JSP .NET CSS SQL Visual Studio Eclipse NetBeans Linux Matlab XML Software Engineering Design Patterns See 9+     See less Skills  Java C++ C C# Python MySQL Microsoft SQL Server Hadoop Lucene JavaScript HTML PHP JSP .NET CSS SQL Visual Studio Eclipse NetBeans Linux Matlab XML Software Engineering Design Patterns See 9+     See less Java C++ C C# Python MySQL Microsoft SQL Server Hadoop Lucene JavaScript HTML PHP JSP .NET CSS SQL Visual Studio Eclipse NetBeans Linux Matlab XML Software Engineering Design Patterns See 9+     See less Java C++ C C# Python MySQL Microsoft SQL Server Hadoop Lucene JavaScript HTML PHP JSP .NET CSS SQL Visual Studio Eclipse NetBeans Linux Matlab XML Software Engineering Design Patterns See 9+     See less Education Stanford University Master of Science (MS),  Computer Science 2013 Relevant Coursework: Advanced Database, Data Mining, System Programming Nanyang Technological University Bachelor of Engineering (B.Eng.),  Computer Science , First Class Honors 2006  – 2010 Stanford University Master of Science (MS),  Computer Science 2013 Relevant Coursework: Advanced Database, Data Mining, System Programming Stanford University Master of Science (MS),  Computer Science 2013 Relevant Coursework: Advanced Database, Data Mining, System Programming Stanford University Master of Science (MS),  Computer Science 2013 Relevant Coursework: Advanced Database, Data Mining, System Programming Nanyang Technological University Bachelor of Engineering (B.Eng.),  Computer Science , First Class Honors 2006  – 2010 Nanyang Technological University Bachelor of Engineering (B.Eng.),  Computer Science , First Class Honors 2006  – 2010 Nanyang Technological University Bachelor of Engineering (B.Eng.),  Computer Science , First Class Honors 2006  – 2010 ", "Summary I am a mechanical engineering graduate student at Stanford University with a concentration in energy systems and a minor concentration in reactive gas dynamics and combustion. I graduated from Loyola Marymount University with a bachelors degree in mechanical engineering with a minor in applied mathematics. As an engineer my interests include advanced combustion technologies and energy systems, renewable energy, nanotechnology, and space exploration. I look forward to pursuing these career aspirations in the top companies and firms in the industry. \n \nI have worked as a research assistant for two consecutive summers at top research universities in both material science and in mechanical engineering. I have also worked in a project management and engineering role for two construction management contracting firms on a $100M project in Southern California and on a $90M project in Miami, Florida. Through these experiences I have learned valuable lessons in both team work and also in leading independent projects without constant supervision. Summary I am a mechanical engineering graduate student at Stanford University with a concentration in energy systems and a minor concentration in reactive gas dynamics and combustion. I graduated from Loyola Marymount University with a bachelors degree in mechanical engineering with a minor in applied mathematics. As an engineer my interests include advanced combustion technologies and energy systems, renewable energy, nanotechnology, and space exploration. I look forward to pursuing these career aspirations in the top companies and firms in the industry. \n \nI have worked as a research assistant for two consecutive summers at top research universities in both material science and in mechanical engineering. I have also worked in a project management and engineering role for two construction management contracting firms on a $100M project in Southern California and on a $90M project in Miami, Florida. Through these experiences I have learned valuable lessons in both team work and also in leading independent projects without constant supervision. I am a mechanical engineering graduate student at Stanford University with a concentration in energy systems and a minor concentration in reactive gas dynamics and combustion. I graduated from Loyola Marymount University with a bachelors degree in mechanical engineering with a minor in applied mathematics. As an engineer my interests include advanced combustion technologies and energy systems, renewable energy, nanotechnology, and space exploration. I look forward to pursuing these career aspirations in the top companies and firms in the industry. \n \nI have worked as a research assistant for two consecutive summers at top research universities in both material science and in mechanical engineering. I have also worked in a project management and engineering role for two construction management contracting firms on a $100M project in Southern California and on a $90M project in Miami, Florida. Through these experiences I have learned valuable lessons in both team work and also in leading independent projects without constant supervision. I am a mechanical engineering graduate student at Stanford University with a concentration in energy systems and a minor concentration in reactive gas dynamics and combustion. I graduated from Loyola Marymount University with a bachelors degree in mechanical engineering with a minor in applied mathematics. As an engineer my interests include advanced combustion technologies and energy systems, renewable energy, nanotechnology, and space exploration. I look forward to pursuing these career aspirations in the top companies and firms in the industry. \n \nI have worked as a research assistant for two consecutive summers at top research universities in both material science and in mechanical engineering. I have also worked in a project management and engineering role for two construction management contracting firms on a $100M project in Southern California and on a $90M project in Miami, Florida. Through these experiences I have learned valuable lessons in both team work and also in leading independent projects without constant supervision. Experience Mechanical Engineering Graduate Student Stanford University April 2014  – Present (1 year 5 months) Stanford, CA Performing reactive gas dynamics research in the High Pressure Flow Reactor (HPFR) Facility under the guidance of Dr. C. T. Bowman. Most of the HPFR work focuses on studies of the combustion characteristics of jet and rocket fuels. Mechanical Engineering Intern Turner Construction Company June 2014  –  August 2014  (3 months) Miami/Fort Lauderdale Area I assisted on Turner's Brickell City Centre project in Miami, Florida. I collaborated with both the field team and the engineering team participating in the final stages of the project and the close-out phase, respectively. My duties in the field included taking equipment and man-power counts with the software e-Builder, checking in with city inspectors, and handling various safety procedures. My responsibilities with the engineering team consist of assisting on change orders, SISs, and contract reconciliations. Undergraduate Teaching Assistant Loyola Marymount University January 2012  –  May 2014  (2 years 5 months) Greater Los Angeles Area I aided professors in the mathematics, physics, and engineering department and handled various tasks. These tasks included grading papers, homework, laboratory reports, and projects. I also held review sessions for students for larger homework assignments and exams. Project Engineering Intern C.W. Driver August 2013  –  January 2014  (6 months) Greater Los Angeles Area I assisted in the planning, development, and implementation of the Loyola Marymount University Life Science Building, a $100+ M project. In my position I worked with senior project engineers, project managers, and superintendents on processing RFIs, product submittals, and construction drawings as well as ensuring proper workplace safety. Research Intern Colorado State University May 2013  –  August 2013  (4 months) I performed research in the Mechanical Engineering Dept. at the CSU Engines and Energy Conservation Laboratory in combustion analysis of biofuels under a National Science Foundation REU grant. I further developed and presented an original research paper and poster to colleagues and faculty as part of the Colorado Center for Biorefining and Biofuels. Research Intern University of Florida May 2012  –  August 2012  (4 months) I performed research in the Material Sciences and Engineering Dept. in the manufacturing of PZT nanofibers under a National Science Foundation REU grant. I also developed and presented an original research paper to colleagues and engineering faculty. Mechanical Engineering Graduate Student Stanford University April 2014  – Present (1 year 5 months) Stanford, CA Performing reactive gas dynamics research in the High Pressure Flow Reactor (HPFR) Facility under the guidance of Dr. C. T. Bowman. Most of the HPFR work focuses on studies of the combustion characteristics of jet and rocket fuels. Mechanical Engineering Graduate Student Stanford University April 2014  – Present (1 year 5 months) Stanford, CA Performing reactive gas dynamics research in the High Pressure Flow Reactor (HPFR) Facility under the guidance of Dr. C. T. Bowman. Most of the HPFR work focuses on studies of the combustion characteristics of jet and rocket fuels. Mechanical Engineering Intern Turner Construction Company June 2014  –  August 2014  (3 months) Miami/Fort Lauderdale Area I assisted on Turner's Brickell City Centre project in Miami, Florida. I collaborated with both the field team and the engineering team participating in the final stages of the project and the close-out phase, respectively. My duties in the field included taking equipment and man-power counts with the software e-Builder, checking in with city inspectors, and handling various safety procedures. My responsibilities with the engineering team consist of assisting on change orders, SISs, and contract reconciliations. Mechanical Engineering Intern Turner Construction Company June 2014  –  August 2014  (3 months) Miami/Fort Lauderdale Area I assisted on Turner's Brickell City Centre project in Miami, Florida. I collaborated with both the field team and the engineering team participating in the final stages of the project and the close-out phase, respectively. My duties in the field included taking equipment and man-power counts with the software e-Builder, checking in with city inspectors, and handling various safety procedures. My responsibilities with the engineering team consist of assisting on change orders, SISs, and contract reconciliations. Undergraduate Teaching Assistant Loyola Marymount University January 2012  –  May 2014  (2 years 5 months) Greater Los Angeles Area I aided professors in the mathematics, physics, and engineering department and handled various tasks. These tasks included grading papers, homework, laboratory reports, and projects. I also held review sessions for students for larger homework assignments and exams. Undergraduate Teaching Assistant Loyola Marymount University January 2012  –  May 2014  (2 years 5 months) Greater Los Angeles Area I aided professors in the mathematics, physics, and engineering department and handled various tasks. These tasks included grading papers, homework, laboratory reports, and projects. I also held review sessions for students for larger homework assignments and exams. Project Engineering Intern C.W. Driver August 2013  –  January 2014  (6 months) Greater Los Angeles Area I assisted in the planning, development, and implementation of the Loyola Marymount University Life Science Building, a $100+ M project. In my position I worked with senior project engineers, project managers, and superintendents on processing RFIs, product submittals, and construction drawings as well as ensuring proper workplace safety. Project Engineering Intern C.W. Driver August 2013  –  January 2014  (6 months) Greater Los Angeles Area I assisted in the planning, development, and implementation of the Loyola Marymount University Life Science Building, a $100+ M project. In my position I worked with senior project engineers, project managers, and superintendents on processing RFIs, product submittals, and construction drawings as well as ensuring proper workplace safety. Research Intern Colorado State University May 2013  –  August 2013  (4 months) I performed research in the Mechanical Engineering Dept. at the CSU Engines and Energy Conservation Laboratory in combustion analysis of biofuels under a National Science Foundation REU grant. I further developed and presented an original research paper and poster to colleagues and faculty as part of the Colorado Center for Biorefining and Biofuels. Research Intern Colorado State University May 2013  –  August 2013  (4 months) I performed research in the Mechanical Engineering Dept. at the CSU Engines and Energy Conservation Laboratory in combustion analysis of biofuels under a National Science Foundation REU grant. I further developed and presented an original research paper and poster to colleagues and faculty as part of the Colorado Center for Biorefining and Biofuels. Research Intern University of Florida May 2012  –  August 2012  (4 months) I performed research in the Material Sciences and Engineering Dept. in the manufacturing of PZT nanofibers under a National Science Foundation REU grant. I also developed and presented an original research paper to colleagues and engineering faculty. Research Intern University of Florida May 2012  –  August 2012  (4 months) I performed research in the Material Sciences and Engineering Dept. in the manufacturing of PZT nanofibers under a National Science Foundation REU grant. I also developed and presented an original research paper to colleagues and engineering faculty. Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Limited working proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Limited working proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Engineering Solidworks Mechanical Engineering Matlab Microsoft Office Research Project Management Project Planning JavaScript ANSYS Fluent Technical Writing Manufacturing Team Management Team Leadership Teamwork Team Building Physics Viewpoint Design of Experiments Renewable Energy Project Engineering Microsoft Word See 7+     See less Skills  Engineering Solidworks Mechanical Engineering Matlab Microsoft Office Research Project Management Project Planning JavaScript ANSYS Fluent Technical Writing Manufacturing Team Management Team Leadership Teamwork Team Building Physics Viewpoint Design of Experiments Renewable Energy Project Engineering Microsoft Word See 7+     See less Engineering Solidworks Mechanical Engineering Matlab Microsoft Office Research Project Management Project Planning JavaScript ANSYS Fluent Technical Writing Manufacturing Team Management Team Leadership Teamwork Team Building Physics Viewpoint Design of Experiments Renewable Energy Project Engineering Microsoft Word See 7+     See less Engineering Solidworks Mechanical Engineering Matlab Microsoft Office Research Project Management Project Planning JavaScript ANSYS Fluent Technical Writing Manufacturing Team Management Team Leadership Teamwork Team Building Physics Viewpoint Design of Experiments Renewable Energy Project Engineering Microsoft Word See 7+     See less Education Stanford University Master's Degree,  Mechanical Engineering 2014  – 2015 Core focus in Energy Systems with a minor concentration of high temperature gas dynamics and combustion. Loyola Marymount University Bachelor's Degree,  Mechanical Engineering 2010  – 2014 Graduated with Honors in Mechanical Engineering. Minored in Applied Mathematics. Research assistant and teaching assistant for multiple years. Received a Presidential Citation from LMU. Activities and Societies:  Tau Beta Pi (Engineering Honor Society)\nEngineers Without Borders\nAmerican Society of Mechanical Engineers (ASME)\nSociety of Hispanic Professional Engineers (SHPE)\nDelta Sigma Phi\nAlpha Sigma Nu (Jesuit Honor Society)\nOrder of Omega (Greek Fraternity & Sorority Leadership & Honor Society)\nProgram for an Engineering Education Community (PEEC) J.P. Taravella High School High School 2006  – 2010 Activities and Societies:  Mu Alpha Theta (Mathematics Honor Society)\nRho Kappa (History Honor Society)\nForeign Language Honor Society Stanford University Master's Degree,  Mechanical Engineering 2014  – 2015 Core focus in Energy Systems with a minor concentration of high temperature gas dynamics and combustion. Stanford University Master's Degree,  Mechanical Engineering 2014  – 2015 Core focus in Energy Systems with a minor concentration of high temperature gas dynamics and combustion. Stanford University Master's Degree,  Mechanical Engineering 2014  – 2015 Core focus in Energy Systems with a minor concentration of high temperature gas dynamics and combustion. Loyola Marymount University Bachelor's Degree,  Mechanical Engineering 2010  – 2014 Graduated with Honors in Mechanical Engineering. Minored in Applied Mathematics. Research assistant and teaching assistant for multiple years. Received a Presidential Citation from LMU. Activities and Societies:  Tau Beta Pi (Engineering Honor Society)\nEngineers Without Borders\nAmerican Society of Mechanical Engineers (ASME)\nSociety of Hispanic Professional Engineers (SHPE)\nDelta Sigma Phi\nAlpha Sigma Nu (Jesuit Honor Society)\nOrder of Omega (Greek Fraternity & Sorority Leadership & Honor Society)\nProgram for an Engineering Education Community (PEEC) Loyola Marymount University Bachelor's Degree,  Mechanical Engineering 2010  – 2014 Graduated with Honors in Mechanical Engineering. Minored in Applied Mathematics. Research assistant and teaching assistant for multiple years. Received a Presidential Citation from LMU. Activities and Societies:  Tau Beta Pi (Engineering Honor Society)\nEngineers Without Borders\nAmerican Society of Mechanical Engineers (ASME)\nSociety of Hispanic Professional Engineers (SHPE)\nDelta Sigma Phi\nAlpha Sigma Nu (Jesuit Honor Society)\nOrder of Omega (Greek Fraternity & Sorority Leadership & Honor Society)\nProgram for an Engineering Education Community (PEEC) Loyola Marymount University Bachelor's Degree,  Mechanical Engineering 2010  – 2014 Graduated with Honors in Mechanical Engineering. Minored in Applied Mathematics. Research assistant and teaching assistant for multiple years. Received a Presidential Citation from LMU. Activities and Societies:  Tau Beta Pi (Engineering Honor Society)\nEngineers Without Borders\nAmerican Society of Mechanical Engineers (ASME)\nSociety of Hispanic Professional Engineers (SHPE)\nDelta Sigma Phi\nAlpha Sigma Nu (Jesuit Honor Society)\nOrder of Omega (Greek Fraternity & Sorority Leadership & Honor Society)\nProgram for an Engineering Education Community (PEEC) J.P. Taravella High School High School 2006  – 2010 Activities and Societies:  Mu Alpha Theta (Mathematics Honor Society)\nRho Kappa (History Honor Society)\nForeign Language Honor Society J.P. Taravella High School High School 2006  – 2010 Activities and Societies:  Mu Alpha Theta (Mathematics Honor Society)\nRho Kappa (History Honor Society)\nForeign Language Honor Society J.P. Taravella High School High School 2006  – 2010 Activities and Societies:  Mu Alpha Theta (Mathematics Honor Society)\nRho Kappa (History Honor Society)\nForeign Language Honor Society Honors & Awards McKee Scholar Delta Sigma Phi Foundation July 2014 Recognized as one of the Fraternity's most accomplished scholars nationwide. Summa Cum Laude Loyola Marymount University May 2014 I graduated with latin honors, specifically Summa Cum Laude, signifying graduation with at least a 3.9/4.0 GPA. Paulo Freire Academic Excellence Award Loyola Marymount University - CLSS Office May 2014 I was one of two latino students awarded this honor for academic excellence at the Latino Pre-Graduation ceremony. Presidential Citation David Burcham April 2014 One of 19 graduating seniors selected for an award based on academics, service, and leadership. Alpha Sigma Nu Alpha Sigma Nu - National April 2014 I was offered membership into the highest academic honor society at Loyola Marymount. Graduate Engineering Fellowship Stanford University March 2014 Awarded a graduate engineering fellowship to attend Stanford University. Descartes Scholar Loyola Marymount University May 2013 Tau Beta Pi Member Loyola Marymount University February 2013 Freshman Engineer of the Year Loyola Marymount University April 2011 Honors at Entrance Loyola Marymount University August 2010 Awarded honors at entrance for distinguished academic attainment at J.P. Taravella High School President's Award for Educational Excellence President's Education Awards Program May 2010 Award presented for recognition of outstanding academic excellence. McKee Scholar Delta Sigma Phi Foundation July 2014 Recognized as one of the Fraternity's most accomplished scholars nationwide. McKee Scholar Delta Sigma Phi Foundation July 2014 Recognized as one of the Fraternity's most accomplished scholars nationwide. McKee Scholar Delta Sigma Phi Foundation July 2014 Recognized as one of the Fraternity's most accomplished scholars nationwide. Summa Cum Laude Loyola Marymount University May 2014 I graduated with latin honors, specifically Summa Cum Laude, signifying graduation with at least a 3.9/4.0 GPA. Summa Cum Laude Loyola Marymount University May 2014 I graduated with latin honors, specifically Summa Cum Laude, signifying graduation with at least a 3.9/4.0 GPA. Summa Cum Laude Loyola Marymount University May 2014 I graduated with latin honors, specifically Summa Cum Laude, signifying graduation with at least a 3.9/4.0 GPA. Paulo Freire Academic Excellence Award Loyola Marymount University - CLSS Office May 2014 I was one of two latino students awarded this honor for academic excellence at the Latino Pre-Graduation ceremony. Paulo Freire Academic Excellence Award Loyola Marymount University - CLSS Office May 2014 I was one of two latino students awarded this honor for academic excellence at the Latino Pre-Graduation ceremony. Paulo Freire Academic Excellence Award Loyola Marymount University - CLSS Office May 2014 I was one of two latino students awarded this honor for academic excellence at the Latino Pre-Graduation ceremony. Presidential Citation David Burcham April 2014 One of 19 graduating seniors selected for an award based on academics, service, and leadership. Presidential Citation David Burcham April 2014 One of 19 graduating seniors selected for an award based on academics, service, and leadership. Presidential Citation David Burcham April 2014 One of 19 graduating seniors selected for an award based on academics, service, and leadership. Alpha Sigma Nu Alpha Sigma Nu - National April 2014 I was offered membership into the highest academic honor society at Loyola Marymount. Alpha Sigma Nu Alpha Sigma Nu - National April 2014 I was offered membership into the highest academic honor society at Loyola Marymount. Alpha Sigma Nu Alpha Sigma Nu - National April 2014 I was offered membership into the highest academic honor society at Loyola Marymount. Graduate Engineering Fellowship Stanford University March 2014 Awarded a graduate engineering fellowship to attend Stanford University. Graduate Engineering Fellowship Stanford University March 2014 Awarded a graduate engineering fellowship to attend Stanford University. Graduate Engineering Fellowship Stanford University March 2014 Awarded a graduate engineering fellowship to attend Stanford University. Descartes Scholar Loyola Marymount University May 2013 Descartes Scholar Loyola Marymount University May 2013 Descartes Scholar Loyola Marymount University May 2013 Tau Beta Pi Member Loyola Marymount University February 2013 Tau Beta Pi Member Loyola Marymount University February 2013 Tau Beta Pi Member Loyola Marymount University February 2013 Freshman Engineer of the Year Loyola Marymount University April 2011 Freshman Engineer of the Year Loyola Marymount University April 2011 Freshman Engineer of the Year Loyola Marymount University April 2011 Honors at Entrance Loyola Marymount University August 2010 Awarded honors at entrance for distinguished academic attainment at J.P. Taravella High School Honors at Entrance Loyola Marymount University August 2010 Awarded honors at entrance for distinguished academic attainment at J.P. Taravella High School Honors at Entrance Loyola Marymount University August 2010 Awarded honors at entrance for distinguished academic attainment at J.P. Taravella High School President's Award for Educational Excellence President's Education Awards Program May 2010 Award presented for recognition of outstanding academic excellence. President's Award for Educational Excellence President's Education Awards Program May 2010 Award presented for recognition of outstanding academic excellence. President's Award for Educational Excellence President's Education Awards Program May 2010 Award presented for recognition of outstanding academic excellence. ", "Experience Graduate Student Stanford University Graduate Student Stanford University Graduate Student Stanford University Education Stanford University Ph.D.,  Chemistry 2002  – 2008 University of Central Florida MS,  Drug Discovery 1999  – 2001 South Ural State University (SUSU) 1994  – 1999 Stanford University Ph.D.,  Chemistry 2002  – 2008 Stanford University Ph.D.,  Chemistry 2002  – 2008 Stanford University Ph.D.,  Chemistry 2002  – 2008 University of Central Florida MS,  Drug Discovery 1999  – 2001 University of Central Florida MS,  Drug Discovery 1999  – 2001 University of Central Florida MS,  Drug Discovery 1999  – 2001 South Ural State University (SUSU) 1994  – 1999 South Ural State University (SUSU) 1994  – 1999 South Ural State University (SUSU) 1994  – 1999 ", "Skills Animation Computer Animation Feature Films Short Films Creative Direction Computer Graphics Skills  Animation Computer Animation Feature Films Short Films Creative Direction Computer Graphics Animation Computer Animation Feature Films Short Films Creative Direction Computer Graphics Animation Computer Animation Feature Films Short Films Creative Direction Computer Graphics Honors & Awards The Theodore and Frances Geballe Fellowship in the Fine Arts Fund Stanford University 2014 School of Humanities and Sciences, Department of Art and Art History SIGM Scholarship at the Stanford Graduate School of Business Stanford University 2015 The Theodore and Frances Geballe Fellowship in the Fine Arts Fund Stanford University 2014 School of Humanities and Sciences, Department of Art and Art History The Theodore and Frances Geballe Fellowship in the Fine Arts Fund Stanford University 2014 School of Humanities and Sciences, Department of Art and Art History The Theodore and Frances Geballe Fellowship in the Fine Arts Fund Stanford University 2014 School of Humanities and Sciences, Department of Art and Art History SIGM Scholarship at the Stanford Graduate School of Business Stanford University 2015 SIGM Scholarship at the Stanford Graduate School of Business Stanford University 2015 SIGM Scholarship at the Stanford Graduate School of Business Stanford University 2015 ", "Summary Graduate student at Stanford University working on population genetics. Summary Graduate student at Stanford University working on population genetics. Graduate student at Stanford University working on population genetics. Graduate student at Stanford University working on population genetics. Experience Graduate student Stanford University August 2012  – Present (3 years 1 month) Graduate student Stanford University August 2012  – Present (3 years 1 month) Graduate student Stanford University August 2012  – Present (3 years 1 month) Skills C Research Programming Microsoft Office Microsoft Excel Skills  C Research Programming Microsoft Office Microsoft Excel C Research Programming Microsoft Office Microsoft Excel C Research Programming Microsoft Office Microsoft Excel Education Stanford University 2012  – 2017 University of Iowa Bachelor of Science (B.Sc.) Stanford University 2012  – 2017 Stanford University 2012  – 2017 Stanford University 2012  – 2017 University of Iowa Bachelor of Science (B.Sc.) University of Iowa Bachelor of Science (B.Sc.) University of Iowa Bachelor of Science (B.Sc.) ", "Skills Neurobiology Protein Chemistry In Vitro Assay Development Molecular Biology DNA In Vivo Genomics ELISA Cancer Skills  Neurobiology Protein Chemistry In Vitro Assay Development Molecular Biology DNA In Vivo Genomics ELISA Cancer Neurobiology Protein Chemistry In Vitro Assay Development Molecular Biology DNA In Vivo Genomics ELISA Cancer Neurobiology Protein Chemistry In Vitro Assay Development Molecular Biology DNA In Vivo Genomics ELISA Cancer ", "Experience Graduate Student Stanford University School of Medicine June 2014  – Present (1 year 3 months) Laboratory of Dr. Theodore Jardetzky Graduate Student Stanford University May 2013  –  June 2014  (1 year 2 months) Palo Alto CA Laboratory of Dr. Michael Hsieh Medical Coordinator ECDC African Community Center June 2010  –  July 2011  (1 year 2 months) Research Assistant National Jewish Health June 2009  –  June 2010  (1 year 1 month) Greater Denver Area Laboratory of Dr. Leonard Dragone Student Research Assistant University of Pennsylvania June 2008  –  May 2009  (1 year) Greater Philadelphia Area Laboratory of Dr. Gary Koretzky Graduate Student Stanford University School of Medicine June 2014  – Present (1 year 3 months) Laboratory of Dr. Theodore Jardetzky Graduate Student Stanford University School of Medicine June 2014  – Present (1 year 3 months) Laboratory of Dr. Theodore Jardetzky Graduate Student Stanford University May 2013  –  June 2014  (1 year 2 months) Palo Alto CA Laboratory of Dr. Michael Hsieh Graduate Student Stanford University May 2013  –  June 2014  (1 year 2 months) Palo Alto CA Laboratory of Dr. Michael Hsieh Medical Coordinator ECDC African Community Center June 2010  –  July 2011  (1 year 2 months) Medical Coordinator ECDC African Community Center June 2010  –  July 2011  (1 year 2 months) Research Assistant National Jewish Health June 2009  –  June 2010  (1 year 1 month) Greater Denver Area Laboratory of Dr. Leonard Dragone Research Assistant National Jewish Health June 2009  –  June 2010  (1 year 1 month) Greater Denver Area Laboratory of Dr. Leonard Dragone Student Research Assistant University of Pennsylvania June 2008  –  May 2009  (1 year) Greater Philadelphia Area Laboratory of Dr. Gary Koretzky Student Research Assistant University of Pennsylvania June 2008  –  May 2009  (1 year) Greater Philadelphia Area Laboratory of Dr. Gary Koretzky Skills Research Public Health Program Evaluation Skills  Research Public Health Program Evaluation Research Public Health Program Evaluation Research Public Health Program Evaluation Education Stanford University School of Medicine MD/PhD,  Immunology 2011  – 2018 Haverford College Bachelor of Science (BS),  Biology 2005  – 2009 Stanford University School of Medicine MD/PhD,  Immunology 2011  – 2018 Stanford University School of Medicine MD/PhD,  Immunology 2011  – 2018 Stanford University School of Medicine MD/PhD,  Immunology 2011  – 2018 Haverford College Bachelor of Science (BS),  Biology 2005  – 2009 Haverford College Bachelor of Science (BS),  Biology 2005  – 2009 Haverford College Bachelor of Science (BS),  Biology 2005  – 2009 ", "Summary I am a Mixed-signal IC design engineer. I worked for High Precision Analog (HPA) Group in Texas Instruments and was responsible for designing Analog-to-Digital Converters to be integrated to Analog Front End (AFE) Applications and as catalogue products. Specialties:Mixed-signal IC designs: \n \n1. High-precision, Low Power, High Speed Analog-to-Digital Converter designs. \n \n2. Analog block designs like Reference Buffers, Switched Capacitor Circuits and Oscillators. \n \n3. RTL and Synthesis of Digital blocks. \n \n4. Modeling System Non-Linearities using MATLAB. Summary I am a Mixed-signal IC design engineer. I worked for High Precision Analog (HPA) Group in Texas Instruments and was responsible for designing Analog-to-Digital Converters to be integrated to Analog Front End (AFE) Applications and as catalogue products. Specialties:Mixed-signal IC designs: \n \n1. High-precision, Low Power, High Speed Analog-to-Digital Converter designs. \n \n2. Analog block designs like Reference Buffers, Switched Capacitor Circuits and Oscillators. \n \n3. RTL and Synthesis of Digital blocks. \n \n4. Modeling System Non-Linearities using MATLAB. I am a Mixed-signal IC design engineer. I worked for High Precision Analog (HPA) Group in Texas Instruments and was responsible for designing Analog-to-Digital Converters to be integrated to Analog Front End (AFE) Applications and as catalogue products. Specialties:Mixed-signal IC designs: \n \n1. High-precision, Low Power, High Speed Analog-to-Digital Converter designs. \n \n2. Analog block designs like Reference Buffers, Switched Capacitor Circuits and Oscillators. \n \n3. RTL and Synthesis of Digital blocks. \n \n4. Modeling System Non-Linearities using MATLAB. I am a Mixed-signal IC design engineer. I worked for High Precision Analog (HPA) Group in Texas Instruments and was responsible for designing Analog-to-Digital Converters to be integrated to Analog Front End (AFE) Applications and as catalogue products. Specialties:Mixed-signal IC designs: \n \n1. High-precision, Low Power, High Speed Analog-to-Digital Converter designs. \n \n2. Analog block designs like Reference Buffers, Switched Capacitor Circuits and Oscillators. \n \n3. RTL and Synthesis of Digital blocks. \n \n4. Modeling System Non-Linearities using MATLAB. Experience Graduate Student Stanford University September 2012  – Present (3 years) Graduate Student Stanford University September 2012  – Present (3 years) Graduate Student Stanford University September 2012  – Present (3 years) Languages Hindi English Gujarati Hindi English Gujarati Hindi English Gujarati Skills Low-power Design Mixed Signal VLSI ASIC Analog Circuit Design Integrated Circuit... IC Verilog CMOS Analog Cadence Virtuoso Spectre PLL Semiconductors Power Management Skills  Low-power Design Mixed Signal VLSI ASIC Analog Circuit Design Integrated Circuit... IC Verilog CMOS Analog Cadence Virtuoso Spectre PLL Semiconductors Power Management Low-power Design Mixed Signal VLSI ASIC Analog Circuit Design Integrated Circuit... IC Verilog CMOS Analog Cadence Virtuoso Spectre PLL Semiconductors Power Management Low-power Design Mixed Signal VLSI ASIC Analog Circuit Design Integrated Circuit... IC Verilog CMOS Analog Cadence Virtuoso Spectre PLL Semiconductors Power Management Education Stanford University Electrical Engineering 2012  – 2016 Dhirubhai Ambani Institute of Information and Communication Technology (DA-IICT) M.Tech, Information and Communication Technology(ICT),  VLSI , Communication Theory 2004  – 2006 L.D College of Engineering - Ahmedabad B.E., Electronics and Communications (EC),  VLSI, DSP 2000  – 2004 Activities and Societies:  IETE Stanford University Electrical Engineering 2012  – 2016 Stanford University Electrical Engineering 2012  – 2016 Stanford University Electrical Engineering 2012  – 2016 Dhirubhai Ambani Institute of Information and Communication Technology (DA-IICT) M.Tech, Information and Communication Technology(ICT),  VLSI , Communication Theory 2004  – 2006 Dhirubhai Ambani Institute of Information and Communication Technology (DA-IICT) M.Tech, Information and Communication Technology(ICT),  VLSI , Communication Theory 2004  – 2006 Dhirubhai Ambani Institute of Information and Communication Technology (DA-IICT) M.Tech, Information and Communication Technology(ICT),  VLSI , Communication Theory 2004  – 2006 L.D College of Engineering - Ahmedabad B.E., Electronics and Communications (EC),  VLSI, DSP 2000  – 2004 Activities and Societies:  IETE L.D College of Engineering - Ahmedabad B.E., Electronics and Communications (EC),  VLSI, DSP 2000  – 2004 Activities and Societies:  IETE L.D College of Engineering - Ahmedabad B.E., Electronics and Communications (EC),  VLSI, DSP 2000  – 2004 Activities and Societies:  IETE ", "Experience Graduate Student Stanford University September 2010  – Present (5 years) PhD student in the Computer Science group. Research intern Google 2011  –  2011  (less than a year) Research Developer Microsoft Research September 2009  –  September 2010  (1 year 1 month) Contracting as a Research developer on the Advanced Development and Prototyping team at Microsoft Research, Bangalore. \n \nDevelop prototypes for web-search and re-visitation and multimedia research. Research Intern Microsoft June 2009  –  September 2009  (4 months) Research intern with the Visualization and Interaction for Business and Entertainment (VIBE) team. Research Intern Barcelona Supercomputing Center January 2009  –  June 2009  (6 months) Research focus on software transactional memory and abstract memory transactions. Vice President, Networks Center for Entrepreneurial Leadership (CEL), BITS Pilani September 2006  –  December 2008  (2 years 4 months) Managed networking operations with industry and alum groups for the Center for Entrepreneurial Leadership at BITS Pilani; that hopes to make a difference by \"creating leaders through entrepreneurial thinking.\" Summer Intern Barcelona Supercomputing Center May 2008  –  August 2008  (4 months) Worked on software transactional memory, with a focus on increasing performance for Boosted Transactions Technology Team Member Center for Entrepreneurial Leadership (CEL), BITS Pilani November 2005  –  April 2006  (6 months) Graduate Student Stanford University September 2010  – Present (5 years) PhD student in the Computer Science group. Graduate Student Stanford University September 2010  – Present (5 years) PhD student in the Computer Science group. Research intern Google 2011  –  2011  (less than a year) Research intern Google 2011  –  2011  (less than a year) Research Developer Microsoft Research September 2009  –  September 2010  (1 year 1 month) Contracting as a Research developer on the Advanced Development and Prototyping team at Microsoft Research, Bangalore. \n \nDevelop prototypes for web-search and re-visitation and multimedia research. Research Developer Microsoft Research September 2009  –  September 2010  (1 year 1 month) Contracting as a Research developer on the Advanced Development and Prototyping team at Microsoft Research, Bangalore. \n \nDevelop prototypes for web-search and re-visitation and multimedia research. Research Intern Microsoft June 2009  –  September 2009  (4 months) Research intern with the Visualization and Interaction for Business and Entertainment (VIBE) team. Research Intern Microsoft June 2009  –  September 2009  (4 months) Research intern with the Visualization and Interaction for Business and Entertainment (VIBE) team. Research Intern Barcelona Supercomputing Center January 2009  –  June 2009  (6 months) Research focus on software transactional memory and abstract memory transactions. Research Intern Barcelona Supercomputing Center January 2009  –  June 2009  (6 months) Research focus on software transactional memory and abstract memory transactions. Vice President, Networks Center for Entrepreneurial Leadership (CEL), BITS Pilani September 2006  –  December 2008  (2 years 4 months) Managed networking operations with industry and alum groups for the Center for Entrepreneurial Leadership at BITS Pilani; that hopes to make a difference by \"creating leaders through entrepreneurial thinking.\" Vice President, Networks Center for Entrepreneurial Leadership (CEL), BITS Pilani September 2006  –  December 2008  (2 years 4 months) Managed networking operations with industry and alum groups for the Center for Entrepreneurial Leadership at BITS Pilani; that hopes to make a difference by \"creating leaders through entrepreneurial thinking.\" Summer Intern Barcelona Supercomputing Center May 2008  –  August 2008  (4 months) Worked on software transactional memory, with a focus on increasing performance for Boosted Transactions Summer Intern Barcelona Supercomputing Center May 2008  –  August 2008  (4 months) Worked on software transactional memory, with a focus on increasing performance for Boosted Transactions Technology Team Member Center for Entrepreneurial Leadership (CEL), BITS Pilani November 2005  –  April 2006  (6 months) Technology Team Member Center for Entrepreneurial Leadership (CEL), BITS Pilani November 2005  –  April 2006  (6 months) Skills Machine Learning Human-computer... Skills  Machine Learning Human-computer... Machine Learning Human-computer... Machine Learning Human-computer... Education Stanford University PhD,  Computer Science 2010  – 2015 Birla Institute of Technology and Science Bachelor of Engineering (BE) Hons.,  Computer Science 2005  – 2009 Activities and Societies:  Center for Entrepreneurial Leadership Stanford University PhD,  Computer Science 2010  – 2015 Stanford University PhD,  Computer Science 2010  – 2015 Stanford University PhD,  Computer Science 2010  – 2015 Birla Institute of Technology and Science Bachelor of Engineering (BE) Hons.,  Computer Science 2005  – 2009 Activities and Societies:  Center for Entrepreneurial Leadership Birla Institute of Technology and Science Bachelor of Engineering (BE) Hons.,  Computer Science 2005  – 2009 Activities and Societies:  Center for Entrepreneurial Leadership Birla Institute of Technology and Science Bachelor of Engineering (BE) Hons.,  Computer Science 2005  – 2009 Activities and Societies:  Center for Entrepreneurial Leadership ", "Experience Graduate Student Stanford University September 2005  – Present (10 years) student Dartmouth College September 2001  –  June 2005  (3 years 10 months) Graduate Student Stanford University September 2005  – Present (10 years) Graduate Student Stanford University September 2005  – Present (10 years) student Dartmouth College September 2001  –  June 2005  (3 years 10 months) student Dartmouth College September 2001  –  June 2005  (3 years 10 months) Education Dartmouth College 2001  – 2005 Dartmouth College 2001  – 2005 Dartmouth College 2001  – 2005 Dartmouth College 2001  – 2005 ", "Experience Graduate Student Stanford University September 2011  – Present (4 years) Graduate student in hydro group working with Steve Gorelick. Scientist Flexible Liner Underground Technologies February 2008  –  August 2011  (3 years 7 months) Product and science development for the suite of FLUTe solutions to environmental monitoring problems. Graduate Student; Research Assistant MIT, Department of Earth, Atmospheric, and Planetary Science August 2003  –  August 2006  (3 years 1 month) Teaching Assistant MIT, Department of Earth, Atmospheric, and Planetary Science February 2005  –  May 2005  (4 months) Undergraduate Student; Research Assistant Caltech, Division of Geological and Planetary Sciences January 2000  –  June 2003  (3 years 6 months) Graduate Student Stanford University September 2011  – Present (4 years) Graduate student in hydro group working with Steve Gorelick. Graduate Student Stanford University September 2011  – Present (4 years) Graduate student in hydro group working with Steve Gorelick. Scientist Flexible Liner Underground Technologies February 2008  –  August 2011  (3 years 7 months) Product and science development for the suite of FLUTe solutions to environmental monitoring problems. Scientist Flexible Liner Underground Technologies February 2008  –  August 2011  (3 years 7 months) Product and science development for the suite of FLUTe solutions to environmental monitoring problems. Graduate Student; Research Assistant MIT, Department of Earth, Atmospheric, and Planetary Science August 2003  –  August 2006  (3 years 1 month) Graduate Student; Research Assistant MIT, Department of Earth, Atmospheric, and Planetary Science August 2003  –  August 2006  (3 years 1 month) Teaching Assistant MIT, Department of Earth, Atmospheric, and Planetary Science February 2005  –  May 2005  (4 months) Teaching Assistant MIT, Department of Earth, Atmospheric, and Planetary Science February 2005  –  May 2005  (4 months) Undergraduate Student; Research Assistant Caltech, Division of Geological and Planetary Sciences January 2000  –  June 2003  (3 years 6 months) Undergraduate Student; Research Assistant Caltech, Division of Geological and Planetary Sciences January 2000  –  June 2003  (3 years 6 months) Skills Modeling Data Analysis Research Programming Matlab Remote Sensing Skills  Modeling Data Analysis Research Programming Matlab Remote Sensing Modeling Data Analysis Research Programming Matlab Remote Sensing Modeling Data Analysis Research Programming Matlab Remote Sensing Education Massachusetts Institute of Technology M.S.,  Earth and Planetary Science 2003  – 2006 Caltech B.S.,  Geological and Planetary Science 1998  – 2003 St. Michael's High School Massachusetts Institute of Technology M.S.,  Earth and Planetary Science 2003  – 2006 Massachusetts Institute of Technology M.S.,  Earth and Planetary Science 2003  – 2006 Massachusetts Institute of Technology M.S.,  Earth and Planetary Science 2003  – 2006 Caltech B.S.,  Geological and Planetary Science 1998  – 2003 Caltech B.S.,  Geological and Planetary Science 1998  – 2003 Caltech B.S.,  Geological and Planetary Science 1998  – 2003 St. Michael's High School St. Michael's High School St. Michael's High School ", "Experience Graduate Student Stanford University August 2013  – Present (2 years 1 month) Stanford, California Senior Associate, Attorney-at-law Roschier, Attorneys Ltd. August 2009  – Present (6 years 1 month) Helsinki, Finland and Stockholm, Sweden Graduate Student Stanford University August 2013  – Present (2 years 1 month) Stanford, California Graduate Student Stanford University August 2013  – Present (2 years 1 month) Stanford, California Senior Associate, Attorney-at-law Roschier, Attorneys Ltd. August 2009  – Present (6 years 1 month) Helsinki, Finland and Stockholm, Sweden Senior Associate, Attorney-at-law Roschier, Attorneys Ltd. August 2009  – Present (6 years 1 month) Helsinki, Finland and Stockholm, Sweden Skills Corporate Law M&A experience M&A analysis M&A execution Securities Regulation Securities Offerings Capital Markets Derivatives Financial Modeling Financial Structuring Corporate Governance Financial Institutions Hedge Funds Private Equity Alternative Investments Investment Management... Financial Regulation Due Diligence Venture Capital Prime Brokerage Fund Structuring Contract Law See 7+     See less Skills  Corporate Law M&A experience M&A analysis M&A execution Securities Regulation Securities Offerings Capital Markets Derivatives Financial Modeling Financial Structuring Corporate Governance Financial Institutions Hedge Funds Private Equity Alternative Investments Investment Management... Financial Regulation Due Diligence Venture Capital Prime Brokerage Fund Structuring Contract Law See 7+     See less Corporate Law M&A experience M&A analysis M&A execution Securities Regulation Securities Offerings Capital Markets Derivatives Financial Modeling Financial Structuring Corporate Governance Financial Institutions Hedge Funds Private Equity Alternative Investments Investment Management... Financial Regulation Due Diligence Venture Capital Prime Brokerage Fund Structuring Contract Law See 7+     See less Corporate Law M&A experience M&A analysis M&A execution Securities Regulation Securities Offerings Capital Markets Derivatives Financial Modeling Financial Structuring Corporate Governance Financial Institutions Hedge Funds Private Equity Alternative Investments Investment Management... Financial Regulation Due Diligence Venture Capital Prime Brokerage Fund Structuring Contract Law See 7+     See less ", "Experience Graduate Student Stanford University September 2014  – Present (1 year) Pursuing a PhD in Biology Life Sciences Research Assistant Stanford University October 2011  –  September 2014  (3 years) Publications to date: \n \nChen, H., Poduri, A., Raftrey, B., Nurmi, H.J., Kivelä, R., Saharinen, P., McKay, A.S., Raftrey, B., Churko, J., Tian, X., Zhou, B., Wu, J.C., Alitalo, K., and Red-Horse, K. VEGF-C and aortic cardiomyocytes guide coronary artery stem development. Accepted in The Journal of Clinical Investigation (JCI). \n \nChen, H., Sharma, B., Akerberg, B., Nurmi, H.J., Kivelä, R., Saharinen, P., Aghajanian, H., McKay, A.S., Bogard, P., Chang, A.H., Jacobs, A.H., Epstein, J.A., Stankunas, K., Alitalo, K., and Red-Horse, K. The sinus venosus contributes to coronary vasculature through VEGF-C-stimulated angiogenesis. Accepted in the journal Development. Student University of Oregon June 2009  –  September 2011  (2 years 4 months) Determining the role of Wnt signaling in heart valve development in the Stankunas Lab. Intern Makerere University - Johns Hopkins Research Collaboration (MUJHU) June 2010  –  September 2010  (4 months) Interned with the NIH-funded HIV/AIDS research collaboration between Makerere University and Johns Hopkins University in Kampala, Uganda. Associate Consultant Kaiser Associates June 2007  –  August 2008  (1 year 3 months) I collaboratively identified client needs, researched critical qualitative and quantitative information, analyzed findings, and presented iterated conclusions to client. \n \nI was responsible for extensive client contact including phone and in-person presentations. Intern Information Technology and Innovation Foundation (ITIF) May 2006  –  August 2006  (4 months) Co-authored a report with Dr. Robert Atkinson entitled \"Digital Prosperity\" that examined the benefits of information technology on the US economy. Graduate Student Stanford University September 2014  – Present (1 year) Pursuing a PhD in Biology Graduate Student Stanford University September 2014  – Present (1 year) Pursuing a PhD in Biology Life Sciences Research Assistant Stanford University October 2011  –  September 2014  (3 years) Publications to date: \n \nChen, H., Poduri, A., Raftrey, B., Nurmi, H.J., Kivelä, R., Saharinen, P., McKay, A.S., Raftrey, B., Churko, J., Tian, X., Zhou, B., Wu, J.C., Alitalo, K., and Red-Horse, K. VEGF-C and aortic cardiomyocytes guide coronary artery stem development. Accepted in The Journal of Clinical Investigation (JCI). \n \nChen, H., Sharma, B., Akerberg, B., Nurmi, H.J., Kivelä, R., Saharinen, P., Aghajanian, H., McKay, A.S., Bogard, P., Chang, A.H., Jacobs, A.H., Epstein, J.A., Stankunas, K., Alitalo, K., and Red-Horse, K. The sinus venosus contributes to coronary vasculature through VEGF-C-stimulated angiogenesis. Accepted in the journal Development. Life Sciences Research Assistant Stanford University October 2011  –  September 2014  (3 years) Publications to date: \n \nChen, H., Poduri, A., Raftrey, B., Nurmi, H.J., Kivelä, R., Saharinen, P., McKay, A.S., Raftrey, B., Churko, J., Tian, X., Zhou, B., Wu, J.C., Alitalo, K., and Red-Horse, K. VEGF-C and aortic cardiomyocytes guide coronary artery stem development. Accepted in The Journal of Clinical Investigation (JCI). \n \nChen, H., Sharma, B., Akerberg, B., Nurmi, H.J., Kivelä, R., Saharinen, P., Aghajanian, H., McKay, A.S., Bogard, P., Chang, A.H., Jacobs, A.H., Epstein, J.A., Stankunas, K., Alitalo, K., and Red-Horse, K. The sinus venosus contributes to coronary vasculature through VEGF-C-stimulated angiogenesis. Accepted in the journal Development. Student University of Oregon June 2009  –  September 2011  (2 years 4 months) Determining the role of Wnt signaling in heart valve development in the Stankunas Lab. Student University of Oregon June 2009  –  September 2011  (2 years 4 months) Determining the role of Wnt signaling in heart valve development in the Stankunas Lab. Intern Makerere University - Johns Hopkins Research Collaboration (MUJHU) June 2010  –  September 2010  (4 months) Interned with the NIH-funded HIV/AIDS research collaboration between Makerere University and Johns Hopkins University in Kampala, Uganda. Intern Makerere University - Johns Hopkins Research Collaboration (MUJHU) June 2010  –  September 2010  (4 months) Interned with the NIH-funded HIV/AIDS research collaboration between Makerere University and Johns Hopkins University in Kampala, Uganda. Associate Consultant Kaiser Associates June 2007  –  August 2008  (1 year 3 months) I collaboratively identified client needs, researched critical qualitative and quantitative information, analyzed findings, and presented iterated conclusions to client. \n \nI was responsible for extensive client contact including phone and in-person presentations. Associate Consultant Kaiser Associates June 2007  –  August 2008  (1 year 3 months) I collaboratively identified client needs, researched critical qualitative and quantitative information, analyzed findings, and presented iterated conclusions to client. \n \nI was responsible for extensive client contact including phone and in-person presentations. Intern Information Technology and Innovation Foundation (ITIF) May 2006  –  August 2006  (4 months) Co-authored a report with Dr. Robert Atkinson entitled \"Digital Prosperity\" that examined the benefits of information technology on the US economy. Intern Information Technology and Innovation Foundation (ITIF) May 2006  –  August 2006  (4 months) Co-authored a report with Dr. Robert Atkinson entitled \"Digital Prosperity\" that examined the benefits of information technology on the US economy. Languages Spanish (basic) Spanish (basic) Spanish (basic) Skills Stata Data Analysis Economics Research Management Consulting Financial Modeling Policy Analysis Strategy Grant Writing Lifesciences Qualitative Research Market Research Statistics Analysis Competitive Analysis Entrepreneurship PCR See 2+     See less Skills  Stata Data Analysis Economics Research Management Consulting Financial Modeling Policy Analysis Strategy Grant Writing Lifesciences Qualitative Research Market Research Statistics Analysis Competitive Analysis Entrepreneurship PCR See 2+     See less Stata Data Analysis Economics Research Management Consulting Financial Modeling Policy Analysis Strategy Grant Writing Lifesciences Qualitative Research Market Research Statistics Analysis Competitive Analysis Entrepreneurship PCR See 2+     See less Stata Data Analysis Economics Research Management Consulting Financial Modeling Policy Analysis Strategy Grant Writing Lifesciences Qualitative Research Market Research Statistics Analysis Competitive Analysis Entrepreneurship PCR See 2+     See less Education University of Oregon BS,  Biology 2009  – 2011 Swarthmore College BA, Honors,  Economics and Public Policy 2003  – 2007 Activities and Societies:  Committee for Investor Responsibility ,  Varsity Swimming ,  Earthlust University of Oregon BS,  Biology 2009  – 2011 University of Oregon BS,  Biology 2009  – 2011 University of Oregon BS,  Biology 2009  – 2011 Swarthmore College BA, Honors,  Economics and Public Policy 2003  – 2007 Activities and Societies:  Committee for Investor Responsibility ,  Varsity Swimming ,  Earthlust Swarthmore College BA, Honors,  Economics and Public Policy 2003  – 2007 Activities and Societies:  Committee for Investor Responsibility ,  Varsity Swimming ,  Earthlust Swarthmore College BA, Honors,  Economics and Public Policy 2003  – 2007 Activities and Societies:  Committee for Investor Responsibility ,  Varsity Swimming ,  Earthlust ", "Summary I'm currently a graduate student at Stanford University pursuing an M.S. and Ph.D. in Mechanical Engineering, with a focus in fluid dynamics, studying under the combined support of a National Science Foundation Graduate Research Fellowship and a Stanford University Office of Technology Licensing Graduate Fellowship. I earned a B.S. in Engineering Mechanics from the University of Illinois with a minor in Computer Science and certificate in Technology Commercialization. I have a strong interest in entrepreneurship, and hope to use graduate study not only to explore research careers, but also opportunities with start-up and early stage companies working at the leading edge of technology. The summer of 2013 I worked as a volunteer intern with Bump Nonprofit Design Studio, a Champaign-Urbana based start-up currently focused on development of the OpenSocket, which is a universal fit prosthetic arm accessible to amputees in developing countries due to its extremely low cost. \n \nAs an undergraduate student, I served as president of Illini Pride Student Athletic Board, a 3,600 member organization that includes the Block I, Orange Krush, and other student support groups for Illinois' athletic programs. With a long-time friend, I co-founded and ran HigherMed, Inc., a company whose goal was to design an easier-to-use pill-dispensing prescription bottle cap. Our start-up placed 2nd in the 2012 Cozad New Venture Competition at UIUC. I also enjoy music, particularly classical solo and choral works, and have performed as a baritone soloist or chorus member with a number of Champaign-Urbana groups including the Baroque Artists of Champaign-Urbana and the Champaign Symphony Orchestra. In addition, I've had the opportunity to perform the Star-Spangled Banner at Chicago Bulls, Chicago White Sox, and numerous Illinois athletic events. Summary I'm currently a graduate student at Stanford University pursuing an M.S. and Ph.D. in Mechanical Engineering, with a focus in fluid dynamics, studying under the combined support of a National Science Foundation Graduate Research Fellowship and a Stanford University Office of Technology Licensing Graduate Fellowship. I earned a B.S. in Engineering Mechanics from the University of Illinois with a minor in Computer Science and certificate in Technology Commercialization. I have a strong interest in entrepreneurship, and hope to use graduate study not only to explore research careers, but also opportunities with start-up and early stage companies working at the leading edge of technology. The summer of 2013 I worked as a volunteer intern with Bump Nonprofit Design Studio, a Champaign-Urbana based start-up currently focused on development of the OpenSocket, which is a universal fit prosthetic arm accessible to amputees in developing countries due to its extremely low cost. \n \nAs an undergraduate student, I served as president of Illini Pride Student Athletic Board, a 3,600 member organization that includes the Block I, Orange Krush, and other student support groups for Illinois' athletic programs. With a long-time friend, I co-founded and ran HigherMed, Inc., a company whose goal was to design an easier-to-use pill-dispensing prescription bottle cap. Our start-up placed 2nd in the 2012 Cozad New Venture Competition at UIUC. I also enjoy music, particularly classical solo and choral works, and have performed as a baritone soloist or chorus member with a number of Champaign-Urbana groups including the Baroque Artists of Champaign-Urbana and the Champaign Symphony Orchestra. In addition, I've had the opportunity to perform the Star-Spangled Banner at Chicago Bulls, Chicago White Sox, and numerous Illinois athletic events. I'm currently a graduate student at Stanford University pursuing an M.S. and Ph.D. in Mechanical Engineering, with a focus in fluid dynamics, studying under the combined support of a National Science Foundation Graduate Research Fellowship and a Stanford University Office of Technology Licensing Graduate Fellowship. I earned a B.S. in Engineering Mechanics from the University of Illinois with a minor in Computer Science and certificate in Technology Commercialization. I have a strong interest in entrepreneurship, and hope to use graduate study not only to explore research careers, but also opportunities with start-up and early stage companies working at the leading edge of technology. The summer of 2013 I worked as a volunteer intern with Bump Nonprofit Design Studio, a Champaign-Urbana based start-up currently focused on development of the OpenSocket, which is a universal fit prosthetic arm accessible to amputees in developing countries due to its extremely low cost. \n \nAs an undergraduate student, I served as president of Illini Pride Student Athletic Board, a 3,600 member organization that includes the Block I, Orange Krush, and other student support groups for Illinois' athletic programs. With a long-time friend, I co-founded and ran HigherMed, Inc., a company whose goal was to design an easier-to-use pill-dispensing prescription bottle cap. Our start-up placed 2nd in the 2012 Cozad New Venture Competition at UIUC. I also enjoy music, particularly classical solo and choral works, and have performed as a baritone soloist or chorus member with a number of Champaign-Urbana groups including the Baroque Artists of Champaign-Urbana and the Champaign Symphony Orchestra. In addition, I've had the opportunity to perform the Star-Spangled Banner at Chicago Bulls, Chicago White Sox, and numerous Illinois athletic events. I'm currently a graduate student at Stanford University pursuing an M.S. and Ph.D. in Mechanical Engineering, with a focus in fluid dynamics, studying under the combined support of a National Science Foundation Graduate Research Fellowship and a Stanford University Office of Technology Licensing Graduate Fellowship. I earned a B.S. in Engineering Mechanics from the University of Illinois with a minor in Computer Science and certificate in Technology Commercialization. I have a strong interest in entrepreneurship, and hope to use graduate study not only to explore research careers, but also opportunities with start-up and early stage companies working at the leading edge of technology. The summer of 2013 I worked as a volunteer intern with Bump Nonprofit Design Studio, a Champaign-Urbana based start-up currently focused on development of the OpenSocket, which is a universal fit prosthetic arm accessible to amputees in developing countries due to its extremely low cost. \n \nAs an undergraduate student, I served as president of Illini Pride Student Athletic Board, a 3,600 member organization that includes the Block I, Orange Krush, and other student support groups for Illinois' athletic programs. With a long-time friend, I co-founded and ran HigherMed, Inc., a company whose goal was to design an easier-to-use pill-dispensing prescription bottle cap. Our start-up placed 2nd in the 2012 Cozad New Venture Competition at UIUC. I also enjoy music, particularly classical solo and choral works, and have performed as a baritone soloist or chorus member with a number of Champaign-Urbana groups including the Baroque Artists of Champaign-Urbana and the Champaign Symphony Orchestra. In addition, I've had the opportunity to perform the Star-Spangled Banner at Chicago Bulls, Chicago White Sox, and numerous Illinois athletic events. Experience Graduate Student Stanford University September 2013  – Present (2 years) Stanford, CA Ph.D. research project to develop an MRI-based technique for measurement of particle concentration in turbulent flows. Co-Owner/Operator HigherMed, Inc. November 2011  –  December 2013  (2 years 2 months) Urbana-Champaign, Illinois Area HigherMed, Inc. exists with the goal of designing and marketing a low-cost, easy to use pill-dispensing prescription bottle cap. Our target market consists of individuals with arthritis or decreased dexterity, many of whom already request \"easy-open\" pill containers. The HigherMed pill-dispensing cap makes it easy to obtain a single pill at a time. Unlike electronic dispensers, our cap is low-cost and simple to use, installing directly to a standard pharmaceutical vial. \n \nAs a co-founder, duties have (so far) included: \n* Currently working to gain feedback through consumer focus groups in order to reach a minimum viable product \n* Design and rapid prototyping of numerous iterations of our prototype \n* Incorporation of company \n* Placed 2nd ($5000 prize) in 2012 Cozad New Venture Competition, which included: \n*** 1-minute elevator pitch round \n*** Development of detailed 5-page business plan \n*** Final round consisted of 10 minute presentation for panel of experienced entrepreneurs Volunteer Intern Bump Nonprofit Design Studio May 2013  –  September 2013  (5 months) EnterpriseWorks, Champaign, IL I began my involvement with Bump as a senior design student at the University of Illinois. Working in a team of 5 students, we investigated the feasibility of moving from in-house molding of polymer parts to various commercial processes such as injection molding, thermoforming, and so on. The team also investigated the strength properties of the product both before and after several design revisions that would be integral to this manufacturing change. \n \nAfter the conclusion of the senior design project, I've continued to work with Bump over the summer as a volunteer intern. Projects include updating flat CAD template models for use in a water jet and re-design of in-house wooden molds. Most recently, I've been responsible for the creation of 3D CAD models of the polymer parts as well as the associated CAD mold designs to be used for thermoforming. President Illini Pride Student Athletic Board March 2012  –  April 2013  (1 year 2 months) Urbana-Champaign, Illinois Area Illini Pride is a 3,600 member organization whose mission is the promotion and student support of University of Illinois Athletics programs. As president for the 2012-13 school year I oversaw all of the organization's operations, including our 27-member executive board as well as a $100k+ budget. One of my primary goals has been to build the technological infrastructure of our growing organization. In 2012, Illini Pride set up an online registration system for the first time, and saw a 25% growth in membership over the previous year. We're currently in the process of implementing a membership management system to replace outdated Excel spreadsheets and paper lists. Undergraduate Research Assistnat Mondal Research Group May 2011  –  January 2012  (9 months) Urbana-Champaign, Illinois Area Led the design of a high-pressure steel die used to extract liquid pore solution from hardened cement paste. Studied cement hydration modeling software as background research for a potential new project. Assisted graduate students in preparing and testing samples of cement, concrete, and cement pore solution. Tutor Illinois Division of Intercollegiate Athletics January 2011  –  December 2011  (1 year) Urbana-Champaign, Illinois Area Tutored student-athletes in Physics, Statics, and Solid Mechanics Graduate Student Stanford University September 2013  – Present (2 years) Stanford, CA Ph.D. research project to develop an MRI-based technique for measurement of particle concentration in turbulent flows. Graduate Student Stanford University September 2013  – Present (2 years) Stanford, CA Ph.D. research project to develop an MRI-based technique for measurement of particle concentration in turbulent flows. Co-Owner/Operator HigherMed, Inc. November 2011  –  December 2013  (2 years 2 months) Urbana-Champaign, Illinois Area HigherMed, Inc. exists with the goal of designing and marketing a low-cost, easy to use pill-dispensing prescription bottle cap. Our target market consists of individuals with arthritis or decreased dexterity, many of whom already request \"easy-open\" pill containers. The HigherMed pill-dispensing cap makes it easy to obtain a single pill at a time. Unlike electronic dispensers, our cap is low-cost and simple to use, installing directly to a standard pharmaceutical vial. \n \nAs a co-founder, duties have (so far) included: \n* Currently working to gain feedback through consumer focus groups in order to reach a minimum viable product \n* Design and rapid prototyping of numerous iterations of our prototype \n* Incorporation of company \n* Placed 2nd ($5000 prize) in 2012 Cozad New Venture Competition, which included: \n*** 1-minute elevator pitch round \n*** Development of detailed 5-page business plan \n*** Final round consisted of 10 minute presentation for panel of experienced entrepreneurs Co-Owner/Operator HigherMed, Inc. November 2011  –  December 2013  (2 years 2 months) Urbana-Champaign, Illinois Area HigherMed, Inc. exists with the goal of designing and marketing a low-cost, easy to use pill-dispensing prescription bottle cap. Our target market consists of individuals with arthritis or decreased dexterity, many of whom already request \"easy-open\" pill containers. The HigherMed pill-dispensing cap makes it easy to obtain a single pill at a time. Unlike electronic dispensers, our cap is low-cost and simple to use, installing directly to a standard pharmaceutical vial. \n \nAs a co-founder, duties have (so far) included: \n* Currently working to gain feedback through consumer focus groups in order to reach a minimum viable product \n* Design and rapid prototyping of numerous iterations of our prototype \n* Incorporation of company \n* Placed 2nd ($5000 prize) in 2012 Cozad New Venture Competition, which included: \n*** 1-minute elevator pitch round \n*** Development of detailed 5-page business plan \n*** Final round consisted of 10 minute presentation for panel of experienced entrepreneurs Volunteer Intern Bump Nonprofit Design Studio May 2013  –  September 2013  (5 months) EnterpriseWorks, Champaign, IL I began my involvement with Bump as a senior design student at the University of Illinois. Working in a team of 5 students, we investigated the feasibility of moving from in-house molding of polymer parts to various commercial processes such as injection molding, thermoforming, and so on. The team also investigated the strength properties of the product both before and after several design revisions that would be integral to this manufacturing change. \n \nAfter the conclusion of the senior design project, I've continued to work with Bump over the summer as a volunteer intern. Projects include updating flat CAD template models for use in a water jet and re-design of in-house wooden molds. Most recently, I've been responsible for the creation of 3D CAD models of the polymer parts as well as the associated CAD mold designs to be used for thermoforming. Volunteer Intern Bump Nonprofit Design Studio May 2013  –  September 2013  (5 months) EnterpriseWorks, Champaign, IL I began my involvement with Bump as a senior design student at the University of Illinois. Working in a team of 5 students, we investigated the feasibility of moving from in-house molding of polymer parts to various commercial processes such as injection molding, thermoforming, and so on. The team also investigated the strength properties of the product both before and after several design revisions that would be integral to this manufacturing change. \n \nAfter the conclusion of the senior design project, I've continued to work with Bump over the summer as a volunteer intern. Projects include updating flat CAD template models for use in a water jet and re-design of in-house wooden molds. Most recently, I've been responsible for the creation of 3D CAD models of the polymer parts as well as the associated CAD mold designs to be used for thermoforming. President Illini Pride Student Athletic Board March 2012  –  April 2013  (1 year 2 months) Urbana-Champaign, Illinois Area Illini Pride is a 3,600 member organization whose mission is the promotion and student support of University of Illinois Athletics programs. As president for the 2012-13 school year I oversaw all of the organization's operations, including our 27-member executive board as well as a $100k+ budget. One of my primary goals has been to build the technological infrastructure of our growing organization. In 2012, Illini Pride set up an online registration system for the first time, and saw a 25% growth in membership over the previous year. We're currently in the process of implementing a membership management system to replace outdated Excel spreadsheets and paper lists. President Illini Pride Student Athletic Board March 2012  –  April 2013  (1 year 2 months) Urbana-Champaign, Illinois Area Illini Pride is a 3,600 member organization whose mission is the promotion and student support of University of Illinois Athletics programs. As president for the 2012-13 school year I oversaw all of the organization's operations, including our 27-member executive board as well as a $100k+ budget. One of my primary goals has been to build the technological infrastructure of our growing organization. In 2012, Illini Pride set up an online registration system for the first time, and saw a 25% growth in membership over the previous year. We're currently in the process of implementing a membership management system to replace outdated Excel spreadsheets and paper lists. Undergraduate Research Assistnat Mondal Research Group May 2011  –  January 2012  (9 months) Urbana-Champaign, Illinois Area Led the design of a high-pressure steel die used to extract liquid pore solution from hardened cement paste. Studied cement hydration modeling software as background research for a potential new project. Assisted graduate students in preparing and testing samples of cement, concrete, and cement pore solution. Undergraduate Research Assistnat Mondal Research Group May 2011  –  January 2012  (9 months) Urbana-Champaign, Illinois Area Led the design of a high-pressure steel die used to extract liquid pore solution from hardened cement paste. Studied cement hydration modeling software as background research for a potential new project. Assisted graduate students in preparing and testing samples of cement, concrete, and cement pore solution. Tutor Illinois Division of Intercollegiate Athletics January 2011  –  December 2011  (1 year) Urbana-Champaign, Illinois Area Tutored student-athletes in Physics, Statics, and Solid Mechanics Tutor Illinois Division of Intercollegiate Athletics January 2011  –  December 2011  (1 year) Urbana-Champaign, Illinois Area Tutored student-athletes in Physics, Statics, and Solid Mechanics Languages German German German Skills Entrepreneurship Product Design Research Mathematica Microsoft Office Java Eclipse Teamwork Lean Manufacturing Python Nanotechnology Project Management CAD C++ LaTeX Photoshop Engaging Public Speaker Business Planning Rapid Prototyping Management Event Planning Event Management Meeting Planning Personnel Selection Vocal Performance Technology... Matlab Tecplot Public Speaking See 14+     See less Skills  Entrepreneurship Product Design Research Mathematica Microsoft Office Java Eclipse Teamwork Lean Manufacturing Python Nanotechnology Project Management CAD C++ LaTeX Photoshop Engaging Public Speaker Business Planning Rapid Prototyping Management Event Planning Event Management Meeting Planning Personnel Selection Vocal Performance Technology... Matlab Tecplot Public Speaking See 14+     See less Entrepreneurship Product Design Research Mathematica Microsoft Office Java Eclipse Teamwork Lean Manufacturing Python Nanotechnology Project Management CAD C++ LaTeX Photoshop Engaging Public Speaker Business Planning Rapid Prototyping Management Event Planning Event Management Meeting Planning Personnel Selection Vocal Performance Technology... Matlab Tecplot Public Speaking See 14+     See less Entrepreneurship Product Design Research Mathematica Microsoft Office Java Eclipse Teamwork Lean Manufacturing Python Nanotechnology Project Management CAD C++ LaTeX Photoshop Engaging Public Speaker Business Planning Rapid Prototyping Management Event Planning Event Management Meeting Planning Personnel Selection Vocal Performance Technology... Matlab Tecplot Public Speaking See 14+     See less Education Stanford University Master of Science (MS), Doctor of Philosophy (PhD),  Mechanical Engineering 2013  – 2018 Graduate Research Fellow in the Eaton research group. Experimental study of particle-laden flow phenomenon using medical imaging techniques. Activities and Societies:  Stanford Chamber Chorale University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Engineering Mechanics 2009  – 2013 Minor in Computer Science, Certificate in Technology Commercialization Activities and Societies:  Illini Pride Student Athletic Board\nIllini Pullers Tractor Design Team Stanford University Master of Science (MS), Doctor of Philosophy (PhD),  Mechanical Engineering 2013  – 2018 Graduate Research Fellow in the Eaton research group. Experimental study of particle-laden flow phenomenon using medical imaging techniques. Activities and Societies:  Stanford Chamber Chorale Stanford University Master of Science (MS), Doctor of Philosophy (PhD),  Mechanical Engineering 2013  – 2018 Graduate Research Fellow in the Eaton research group. Experimental study of particle-laden flow phenomenon using medical imaging techniques. Activities and Societies:  Stanford Chamber Chorale Stanford University Master of Science (MS), Doctor of Philosophy (PhD),  Mechanical Engineering 2013  – 2018 Graduate Research Fellow in the Eaton research group. Experimental study of particle-laden flow phenomenon using medical imaging techniques. Activities and Societies:  Stanford Chamber Chorale University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Engineering Mechanics 2009  – 2013 Minor in Computer Science, Certificate in Technology Commercialization Activities and Societies:  Illini Pride Student Athletic Board\nIllini Pullers Tractor Design Team University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Engineering Mechanics 2009  – 2013 Minor in Computer Science, Certificate in Technology Commercialization Activities and Societies:  Illini Pride Student Athletic Board\nIllini Pullers Tractor Design Team University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Engineering Mechanics 2009  – 2013 Minor in Computer Science, Certificate in Technology Commercialization Activities and Societies:  Illini Pride Student Athletic Board\nIllini Pullers Tractor Design Team Honors & Awards Harvey H. Jordan Award April 2013 The Harvey Jordan Award is given annually to the top graduating senior in the College of Engineering--the equivalent to a valedictorian for the senior class. Fred B. Seely Scholarship Department of Mechanical Science and Engineering September 2012 The Fred B. Seely Scholarships are awarded to entering or current undergraduate students in the Engineering Mechanics program. Awards are made on the basis of the student's performance in TAM and other UIUC courses, personal qualities, and professional and cultural activities. O.A. Leutwiler Award Department of Mechanical Science and Engineering January 2012 In honor of O. A. Leutwiler, professor mechanical engineering and head of the department from 1934-1945, funds have been made available for a monetary award to a senior in mechanical or industrial engineering. The award is based on scholarship, personal qualities, and professional and cultural activities. Marvin C. Stippes Scholarship Department of Mechanical Science and Engineering January 2011 The Marvin C. Stippes Scholarships are awarded to an entering or current undergraduate students in the Engineering Mechanics program. Awards are made primarily on the basis of demonstrated scholarship. Donald E. Carlson Scholarship Department of Mechanical Science and Engineering September 2011 Harvey H. Jordan Award April 2013 The Harvey Jordan Award is given annually to the top graduating senior in the College of Engineering--the equivalent to a valedictorian for the senior class. Harvey H. Jordan Award April 2013 The Harvey Jordan Award is given annually to the top graduating senior in the College of Engineering--the equivalent to a valedictorian for the senior class. Harvey H. Jordan Award April 2013 The Harvey Jordan Award is given annually to the top graduating senior in the College of Engineering--the equivalent to a valedictorian for the senior class. Fred B. Seely Scholarship Department of Mechanical Science and Engineering September 2012 The Fred B. Seely Scholarships are awarded to entering or current undergraduate students in the Engineering Mechanics program. Awards are made on the basis of the student's performance in TAM and other UIUC courses, personal qualities, and professional and cultural activities. Fred B. Seely Scholarship Department of Mechanical Science and Engineering September 2012 The Fred B. Seely Scholarships are awarded to entering or current undergraduate students in the Engineering Mechanics program. Awards are made on the basis of the student's performance in TAM and other UIUC courses, personal qualities, and professional and cultural activities. Fred B. Seely Scholarship Department of Mechanical Science and Engineering September 2012 The Fred B. Seely Scholarships are awarded to entering or current undergraduate students in the Engineering Mechanics program. Awards are made on the basis of the student's performance in TAM and other UIUC courses, personal qualities, and professional and cultural activities. O.A. Leutwiler Award Department of Mechanical Science and Engineering January 2012 In honor of O. A. Leutwiler, professor mechanical engineering and head of the department from 1934-1945, funds have been made available for a monetary award to a senior in mechanical or industrial engineering. The award is based on scholarship, personal qualities, and professional and cultural activities. O.A. Leutwiler Award Department of Mechanical Science and Engineering January 2012 In honor of O. A. Leutwiler, professor mechanical engineering and head of the department from 1934-1945, funds have been made available for a monetary award to a senior in mechanical or industrial engineering. The award is based on scholarship, personal qualities, and professional and cultural activities. O.A. Leutwiler Award Department of Mechanical Science and Engineering January 2012 In honor of O. A. Leutwiler, professor mechanical engineering and head of the department from 1934-1945, funds have been made available for a monetary award to a senior in mechanical or industrial engineering. The award is based on scholarship, personal qualities, and professional and cultural activities. Marvin C. Stippes Scholarship Department of Mechanical Science and Engineering January 2011 The Marvin C. Stippes Scholarships are awarded to an entering or current undergraduate students in the Engineering Mechanics program. Awards are made primarily on the basis of demonstrated scholarship. Marvin C. Stippes Scholarship Department of Mechanical Science and Engineering January 2011 The Marvin C. Stippes Scholarships are awarded to an entering or current undergraduate students in the Engineering Mechanics program. Awards are made primarily on the basis of demonstrated scholarship. Marvin C. Stippes Scholarship Department of Mechanical Science and Engineering January 2011 The Marvin C. Stippes Scholarships are awarded to an entering or current undergraduate students in the Engineering Mechanics program. Awards are made primarily on the basis of demonstrated scholarship. Donald E. Carlson Scholarship Department of Mechanical Science and Engineering September 2011 Donald E. Carlson Scholarship Department of Mechanical Science and Engineering September 2011 Donald E. Carlson Scholarship Department of Mechanical Science and Engineering September 2011 ", "Skills HPLC Biotechnology Sop GMP PCR Management Purification ELISA Gas Chromatography Quality Assurance SDS-PAGE Skills  HPLC Biotechnology Sop GMP PCR Management Purification ELISA Gas Chromatography Quality Assurance SDS-PAGE HPLC Biotechnology Sop GMP PCR Management Purification ELISA Gas Chromatography Quality Assurance SDS-PAGE HPLC Biotechnology Sop GMP PCR Management Purification ELISA Gas Chromatography Quality Assurance SDS-PAGE Honors & Awards ", "Summary A researcher and technology enthusiast with prior experience in solar photovoltaics and semiconductors. Particularly interested in new developments in high-efficiency, low-cost solar cells. Other interests include startups, entrepreneurship and development economics. Specialties:• Thin film silicon solar cells and organic solar cells  \n• Semiconductor processing technology and transistor fabrication Summary A researcher and technology enthusiast with prior experience in solar photovoltaics and semiconductors. Particularly interested in new developments in high-efficiency, low-cost solar cells. Other interests include startups, entrepreneurship and development economics. Specialties:• Thin film silicon solar cells and organic solar cells  \n• Semiconductor processing technology and transistor fabrication A researcher and technology enthusiast with prior experience in solar photovoltaics and semiconductors. Particularly interested in new developments in high-efficiency, low-cost solar cells. Other interests include startups, entrepreneurship and development economics. Specialties:• Thin film silicon solar cells and organic solar cells  \n• Semiconductor processing technology and transistor fabrication A researcher and technology enthusiast with prior experience in solar photovoltaics and semiconductors. Particularly interested in new developments in high-efficiency, low-cost solar cells. Other interests include startups, entrepreneurship and development economics. Specialties:• Thin film silicon solar cells and organic solar cells  \n• Semiconductor processing technology and transistor fabrication Skills Solar Cells Thin Films Semiconductors Characterization Entrepreneurship Start-ups R&D Solar Energy Device Characterization Silicon Physics Materials Science Photovoltaics Skills  Solar Cells Thin Films Semiconductors Characterization Entrepreneurship Start-ups R&D Solar Energy Device Characterization Silicon Physics Materials Science Photovoltaics Solar Cells Thin Films Semiconductors Characterization Entrepreneurship Start-ups R&D Solar Energy Device Characterization Silicon Physics Materials Science Photovoltaics Solar Cells Thin Films Semiconductors Characterization Entrepreneurship Start-ups R&D Solar Energy Device Characterization Silicon Physics Materials Science Photovoltaics Honors & Awards "]}