{"position": "Health Educator", "company": "Stanford University", "profiles": ["Summary 1st year at ADP: Mid-Atlantic Division RECORD HOLDER- DM Promotion (sold 100k and 20 units in 180 days); 3rd Highest Sales ADM Sales in the Mid-Atlantic Division; Capitol Region-HIGHEST DM over sales quota (206% over sales plan) consecutive over 6 months; 2nd Highest NATIONAL Simple IRA/ 401k sales (three consecutive months) Summary 1st year at ADP: Mid-Atlantic Division RECORD HOLDER- DM Promotion (sold 100k and 20 units in 180 days); 3rd Highest Sales ADM Sales in the Mid-Atlantic Division; Capitol Region-HIGHEST DM over sales quota (206% over sales plan) consecutive over 6 months; 2nd Highest NATIONAL Simple IRA/ 401k sales (three consecutive months) 1st year at ADP: Mid-Atlantic Division RECORD HOLDER- DM Promotion (sold 100k and 20 units in 180 days); 3rd Highest Sales ADM Sales in the Mid-Atlantic Division; Capitol Region-HIGHEST DM over sales quota (206% over sales plan) consecutive over 6 months; 2nd Highest NATIONAL Simple IRA/ 401k sales (three consecutive months) 1st year at ADP: Mid-Atlantic Division RECORD HOLDER- DM Promotion (sold 100k and 20 units in 180 days); 3rd Highest Sales ADM Sales in the Mid-Atlantic Division; Capitol Region-HIGHEST DM over sales quota (206% over sales plan) consecutive over 6 months; 2nd Highest NATIONAL Simple IRA/ 401k sales (three consecutive months) Experience Accountant Specialist | Fluent in Business Spanish and Portuguese ADP- Automatic Data Processing 2014  – Present (1 year) Greater Maryland | Washington D.C. Metro Area Specialties: \nCPE course instructor \nBusiness Payroll Consultant \nTax Savings Plans  \nGroup Health Insurance Plans \n**Fluent in Business Spanish and Portuguese*** \n \n \n***Please feel free to forward my profile to others you feel would benefit from my services.*** Teaching Fellow/ Spanish Instructor University of Pittsburgh August 2012  –  2014  (2 years) I teach Spanish 0001, Elementary Spanish, and Spanish 0002, Intermediate Spanish. I teach these courses everyday and am solely responsible for preparing lesson plans, administering tests, etc. Peer Health Educator Stanford University September 2008  –  June 2009  (10 months) I mentored 88 of my peers while promoting healthy living, providing one-on-one coaching throughout the year. Accountant Specialist | Fluent in Business Spanish and Portuguese ADP- Automatic Data Processing 2014  – Present (1 year) Greater Maryland | Washington D.C. Metro Area Specialties: \nCPE course instructor \nBusiness Payroll Consultant \nTax Savings Plans  \nGroup Health Insurance Plans \n**Fluent in Business Spanish and Portuguese*** \n \n \n***Please feel free to forward my profile to others you feel would benefit from my services.*** Accountant Specialist | Fluent in Business Spanish and Portuguese ADP- Automatic Data Processing 2014  – Present (1 year) Greater Maryland | Washington D.C. Metro Area Specialties: \nCPE course instructor \nBusiness Payroll Consultant \nTax Savings Plans  \nGroup Health Insurance Plans \n**Fluent in Business Spanish and Portuguese*** \n \n \n***Please feel free to forward my profile to others you feel would benefit from my services.*** Teaching Fellow/ Spanish Instructor University of Pittsburgh August 2012  –  2014  (2 years) I teach Spanish 0001, Elementary Spanish, and Spanish 0002, Intermediate Spanish. I teach these courses everyday and am solely responsible for preparing lesson plans, administering tests, etc. Teaching Fellow/ Spanish Instructor University of Pittsburgh August 2012  –  2014  (2 years) I teach Spanish 0001, Elementary Spanish, and Spanish 0002, Intermediate Spanish. I teach these courses everyday and am solely responsible for preparing lesson plans, administering tests, etc. Peer Health Educator Stanford University September 2008  –  June 2009  (10 months) I mentored 88 of my peers while promoting healthy living, providing one-on-one coaching throughout the year. Peer Health Educator Stanford University September 2008  –  June 2009  (10 months) I mentored 88 of my peers while promoting healthy living, providing one-on-one coaching throughout the year. Languages Spanish Native or bilingual proficiency Brazilian Portuguese Full professional proficiency Spanish Native or bilingual proficiency Brazilian Portuguese Full professional proficiency Spanish Native or bilingual proficiency Brazilian Portuguese Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Spanish Public Speaking Leadership Sales Marketing Customer Service Management Referrals Banker Partnership CPA partnership Cold Calling Fundraising Teaching Entrepreneurship Social Media Social Networking Event Planning Microsoft Office Nonprofits See 4+     See less Skills  Spanish Public Speaking Leadership Sales Marketing Customer Service Management Referrals Banker Partnership CPA partnership Cold Calling Fundraising Teaching Entrepreneurship Social Media Social Networking Event Planning Microsoft Office Nonprofits See 4+     See less Spanish Public Speaking Leadership Sales Marketing Customer Service Management Referrals Banker Partnership CPA partnership Cold Calling Fundraising Teaching Entrepreneurship Social Media Social Networking Event Planning Microsoft Office Nonprofits See 4+     See less Spanish Public Speaking Leadership Sales Marketing Customer Service Management Referrals Banker Partnership CPA partnership Cold Calling Fundraising Teaching Entrepreneurship Social Media Social Networking Event Planning Microsoft Office Nonprofits See 4+     See less Education University of Pittsburgh Master of Arts (M.A.),  Latin American and Caribbean Studies 2010  – 2012 Stanford University B.A.,  Iberian and Latin American Cultures 2006  – 2010 University of Pittsburgh Master of Arts (M.A.),  Latin American and Caribbean Studies 2010  – 2012 University of Pittsburgh Master of Arts (M.A.),  Latin American and Caribbean Studies 2010  – 2012 University of Pittsburgh Master of Arts (M.A.),  Latin American and Caribbean Studies 2010  – 2012 Stanford University B.A.,  Iberian and Latin American Cultures 2006  – 2010 Stanford University B.A.,  Iberian and Latin American Cultures 2006  – 2010 Stanford University B.A.,  Iberian and Latin American Cultures 2006  – 2010 Honors & Awards ", "Experience Human Biology Course Associate Stanford University September 2012  –  June 2013  (10 months) Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) Intern Vivecoach June 2011  –  September 2011  (4 months) Menlo Park, CA Health Education through Art Intern Mural Music & Arts Project June 2011  –  September 2011  (4 months) Human Biology Course Associate Stanford University September 2012  –  June 2013  (10 months) Human Biology Course Associate Stanford University September 2012  –  June 2013  (10 months) Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) Intern Vivecoach June 2011  –  September 2011  (4 months) Menlo Park, CA Intern Vivecoach June 2011  –  September 2011  (4 months) Menlo Park, CA Health Education through Art Intern Mural Music & Arts Project June 2011  –  September 2011  (4 months) Health Education through Art Intern Mural Music & Arts Project June 2011  –  September 2011  (4 months) Skills Research Community Outreach Skills  Research Community Outreach Research Community Outreach Research Community Outreach Education Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Castilleja School 2001  – 2008 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Castilleja School 2001  – 2008 Castilleja School 2001  – 2008 Castilleja School 2001  – 2008 Honors & Awards J.E. Wallace Sterling Award for Scholastic Achievement Stanford University 2012 Joshua Lederberg Award for Academic Excellence Program in Human Biology, Stanford University 2012 President's Award for Academic Achievement in the Freshman Year Stanford University 2009 National Merit Scholar 2008 Valedictorian Castilleja School 2008 J.E. Wallace Sterling Award for Scholastic Achievement Stanford University 2012 J.E. Wallace Sterling Award for Scholastic Achievement Stanford University 2012 J.E. Wallace Sterling Award for Scholastic Achievement Stanford University 2012 Joshua Lederberg Award for Academic Excellence Program in Human Biology, Stanford University 2012 Joshua Lederberg Award for Academic Excellence Program in Human Biology, Stanford University 2012 Joshua Lederberg Award for Academic Excellence Program in Human Biology, Stanford University 2012 President's Award for Academic Achievement in the Freshman Year Stanford University 2009 President's Award for Academic Achievement in the Freshman Year Stanford University 2009 President's Award for Academic Achievement in the Freshman Year Stanford University 2009 National Merit Scholar 2008 National Merit Scholar 2008 National Merit Scholar 2008 Valedictorian Castilleja School 2008 Valedictorian Castilleja School 2008 Valedictorian Castilleja School 2008 ", "Summary Jorge De Luna is an experienced health care professional with over 15 years of combined experience in the areas of public health, health care administration, human resources and program management. Jorge has an excellent understanding of health care delivery systems, program development, employee benefits administration, and adult learning principles. Summary Jorge De Luna is an experienced health care professional with over 15 years of combined experience in the areas of public health, health care administration, human resources and program management. Jorge has an excellent understanding of health care delivery systems, program development, employee benefits administration, and adult learning principles. Jorge De Luna is an experienced health care professional with over 15 years of combined experience in the areas of public health, health care administration, human resources and program management. Jorge has an excellent understanding of health care delivery systems, program development, employee benefits administration, and adult learning principles. Jorge De Luna is an experienced health care professional with over 15 years of combined experience in the areas of public health, health care administration, human resources and program management. Jorge has an excellent understanding of health care delivery systems, program development, employee benefits administration, and adult learning principles. Experience Educational Programs Coordinator Stanford University School of Medicine Director of Programs Community Health Partnership August 2008  –  December 2011  (3 years 5 months) Santa Clara California Implemented Quality Improvement and Population Health programs.Conducted grant research, program design, budgeting, reporting, and evaluation of chronic disease management programs. \nCollaborated with Primary Care Providers in the design of health education materials and chronic disease management programs. \nPrepared and delivered presentations to small and large audiences including Medical Directors, Administrative Executives, Quality Improvement Staff, Community Members. \nConvened, coordinated and facilitated health center peer groups including Medical Directors, Clinic Managers and Quality Improvement Committees. \nCollected, validated, analyzed and presented clinical outcome metrics such as hypertension, HbA1C, Cholesterol Level, medications prescribed, demographic information.  \nDelivered health education and provided technical assistance and training activities to clinical, administrative and frontline staff. \nFacilitated and supported collaborative initiatives and communication between community health centers, county government agencies, health plans, foundations and other community stakeholders. \nManaged Continuing Medical Education program. \nResearched project proposals, designed public health programs and interventions, implemented projects, and conducted program evaluations.  \nSupervised and provided guidance to program staff. \nProvided leadership, innovation, technical assistance, and training to community clinics in the area of process improvement, information systems, and chronic disease management. \nDeveloped and maintained collaborative partnerships to support community health center and consortium programs and services. Clinical Services Coordinator Community Health Partnership July 2007  –  July 2008  (1 year 1 month) Coordinated the implementation of Quality Improvement and Population Health programs such as PHASE (Preventing Heart Attacks and Strokes Everyday), Specialty Care Access Community Health Centers, Adoption of Chronic Disease Registries, etc. \nDeveloped dashboard of Chronic Disease Quality Improvement metrics. \nConducted data validation and provided analysis and feedback to Quality Improvement staff. \nPrepared Power Point presentations, reports, graphs, and program evaluations. Adjunct Instructor San Jose State University August 2007  –  December 2007  (5 months) Taught undergraduate course: Healthcare Issues in a Multicultural Society.  \nDeveloped, prepared and delivered course curriculum, lectures and exams.  \nProvided students with mentorship and guidance in accomplishing course objectives. \nConducted administrative tasks related to the course including reporting attendance, grades and course evaluations. Manager, Human Resources Wyse Technology October 2000  –  May 2007  (6 years 8 months) Managed a comprehensive medical benefits program for domestic and international employees including medical, dental, vision, life, disability, retirement, COBRA, etc. \nPlanned and executed HR initiatives such as Open Enrollment, Employee and Company charitable contributions, Updating of Policies and Procedures, Employee Awards and Annual Company events such as Health Fair and Holiday and Summer Parties. \nFacilitated meetings with insurance brokers to evaluate, negotiate, and finalize proposals, services, cost, and communications strategy. \nManaged diverse employee programs such as Stock Option, Profit Sharing, Referral Bonus, Tuition Reimbursement and Mandatory Training Programs.  \nCommunicated and interpreted policies and procedures to managers and employees.  \nCoached managers and employees in the communication and resolution of personnel issues. \nProvided guidance to employees on understanding benefits programs including coverage options, share of cost, Long and Short Term Disability, COBRA, Flexible Spending Accounts, etc. \nMet individually with employees to explain Leave of Absence Policies and Procedures: FMLA, Disability and Military Leave, Family Medical Leave, Maternity and Paternity Leave, etc. \nFacilitated annual 401K and Group Insurance Audit and Filing of IRS Form 5500. \nConducted New-hire Orientations and Safety Training.  \nDesigned and prepared reports for executive staff, finance team, auditors and government agencies. Benefits Counselor The Health Trust August 1996  –  October 1999  (3 years 3 months) Assessed patient needs for health education to prevent HIV infection or re-infection. \nDelivered lifestyle, risk reduction and disease management counseling to patients and their families.  \nAssigned clients to social work and nursing case-management and made referrals to other community agencies.  \nWorked with a multidisciplinary team of physicians, nurses, nutritionists and social workers to deliver care to patients living with HIV/AIDS.  \nConducted benefits workshops for community leaders, social workers, and agency clients utilizing adult learning theory concepts and principles.  \nAssisted HIV/AIDS patients with applications for public and private benefit programs, such as MediCal, Social Security, and California State Disability. \nProvided patients with on-going counseling, emotional support and patient advocacy. \nTranslated brochures and other informational materials, from English to Spanish, in a culturally appropriate manner. Educational Programs Coordinator Stanford University School of Medicine Educational Programs Coordinator Stanford University School of Medicine Director of Programs Community Health Partnership August 2008  –  December 2011  (3 years 5 months) Santa Clara California Implemented Quality Improvement and Population Health programs.Conducted grant research, program design, budgeting, reporting, and evaluation of chronic disease management programs. \nCollaborated with Primary Care Providers in the design of health education materials and chronic disease management programs. \nPrepared and delivered presentations to small and large audiences including Medical Directors, Administrative Executives, Quality Improvement Staff, Community Members. \nConvened, coordinated and facilitated health center peer groups including Medical Directors, Clinic Managers and Quality Improvement Committees. \nCollected, validated, analyzed and presented clinical outcome metrics such as hypertension, HbA1C, Cholesterol Level, medications prescribed, demographic information.  \nDelivered health education and provided technical assistance and training activities to clinical, administrative and frontline staff. \nFacilitated and supported collaborative initiatives and communication between community health centers, county government agencies, health plans, foundations and other community stakeholders. \nManaged Continuing Medical Education program. \nResearched project proposals, designed public health programs and interventions, implemented projects, and conducted program evaluations.  \nSupervised and provided guidance to program staff. \nProvided leadership, innovation, technical assistance, and training to community clinics in the area of process improvement, information systems, and chronic disease management. \nDeveloped and maintained collaborative partnerships to support community health center and consortium programs and services. Director of Programs Community Health Partnership August 2008  –  December 2011  (3 years 5 months) Santa Clara California Implemented Quality Improvement and Population Health programs.Conducted grant research, program design, budgeting, reporting, and evaluation of chronic disease management programs. \nCollaborated with Primary Care Providers in the design of health education materials and chronic disease management programs. \nPrepared and delivered presentations to small and large audiences including Medical Directors, Administrative Executives, Quality Improvement Staff, Community Members. \nConvened, coordinated and facilitated health center peer groups including Medical Directors, Clinic Managers and Quality Improvement Committees. \nCollected, validated, analyzed and presented clinical outcome metrics such as hypertension, HbA1C, Cholesterol Level, medications prescribed, demographic information.  \nDelivered health education and provided technical assistance and training activities to clinical, administrative and frontline staff. \nFacilitated and supported collaborative initiatives and communication between community health centers, county government agencies, health plans, foundations and other community stakeholders. \nManaged Continuing Medical Education program. \nResearched project proposals, designed public health programs and interventions, implemented projects, and conducted program evaluations.  \nSupervised and provided guidance to program staff. \nProvided leadership, innovation, technical assistance, and training to community clinics in the area of process improvement, information systems, and chronic disease management. \nDeveloped and maintained collaborative partnerships to support community health center and consortium programs and services. Clinical Services Coordinator Community Health Partnership July 2007  –  July 2008  (1 year 1 month) Coordinated the implementation of Quality Improvement and Population Health programs such as PHASE (Preventing Heart Attacks and Strokes Everyday), Specialty Care Access Community Health Centers, Adoption of Chronic Disease Registries, etc. \nDeveloped dashboard of Chronic Disease Quality Improvement metrics. \nConducted data validation and provided analysis and feedback to Quality Improvement staff. \nPrepared Power Point presentations, reports, graphs, and program evaluations. Clinical Services Coordinator Community Health Partnership July 2007  –  July 2008  (1 year 1 month) Coordinated the implementation of Quality Improvement and Population Health programs such as PHASE (Preventing Heart Attacks and Strokes Everyday), Specialty Care Access Community Health Centers, Adoption of Chronic Disease Registries, etc. \nDeveloped dashboard of Chronic Disease Quality Improvement metrics. \nConducted data validation and provided analysis and feedback to Quality Improvement staff. \nPrepared Power Point presentations, reports, graphs, and program evaluations. Adjunct Instructor San Jose State University August 2007  –  December 2007  (5 months) Taught undergraduate course: Healthcare Issues in a Multicultural Society.  \nDeveloped, prepared and delivered course curriculum, lectures and exams.  \nProvided students with mentorship and guidance in accomplishing course objectives. \nConducted administrative tasks related to the course including reporting attendance, grades and course evaluations. Adjunct Instructor San Jose State University August 2007  –  December 2007  (5 months) Taught undergraduate course: Healthcare Issues in a Multicultural Society.  \nDeveloped, prepared and delivered course curriculum, lectures and exams.  \nProvided students with mentorship and guidance in accomplishing course objectives. \nConducted administrative tasks related to the course including reporting attendance, grades and course evaluations. Manager, Human Resources Wyse Technology October 2000  –  May 2007  (6 years 8 months) Managed a comprehensive medical benefits program for domestic and international employees including medical, dental, vision, life, disability, retirement, COBRA, etc. \nPlanned and executed HR initiatives such as Open Enrollment, Employee and Company charitable contributions, Updating of Policies and Procedures, Employee Awards and Annual Company events such as Health Fair and Holiday and Summer Parties. \nFacilitated meetings with insurance brokers to evaluate, negotiate, and finalize proposals, services, cost, and communications strategy. \nManaged diverse employee programs such as Stock Option, Profit Sharing, Referral Bonus, Tuition Reimbursement and Mandatory Training Programs.  \nCommunicated and interpreted policies and procedures to managers and employees.  \nCoached managers and employees in the communication and resolution of personnel issues. \nProvided guidance to employees on understanding benefits programs including coverage options, share of cost, Long and Short Term Disability, COBRA, Flexible Spending Accounts, etc. \nMet individually with employees to explain Leave of Absence Policies and Procedures: FMLA, Disability and Military Leave, Family Medical Leave, Maternity and Paternity Leave, etc. \nFacilitated annual 401K and Group Insurance Audit and Filing of IRS Form 5500. \nConducted New-hire Orientations and Safety Training.  \nDesigned and prepared reports for executive staff, finance team, auditors and government agencies. Manager, Human Resources Wyse Technology October 2000  –  May 2007  (6 years 8 months) Managed a comprehensive medical benefits program for domestic and international employees including medical, dental, vision, life, disability, retirement, COBRA, etc. \nPlanned and executed HR initiatives such as Open Enrollment, Employee and Company charitable contributions, Updating of Policies and Procedures, Employee Awards and Annual Company events such as Health Fair and Holiday and Summer Parties. \nFacilitated meetings with insurance brokers to evaluate, negotiate, and finalize proposals, services, cost, and communications strategy. \nManaged diverse employee programs such as Stock Option, Profit Sharing, Referral Bonus, Tuition Reimbursement and Mandatory Training Programs.  \nCommunicated and interpreted policies and procedures to managers and employees.  \nCoached managers and employees in the communication and resolution of personnel issues. \nProvided guidance to employees on understanding benefits programs including coverage options, share of cost, Long and Short Term Disability, COBRA, Flexible Spending Accounts, etc. \nMet individually with employees to explain Leave of Absence Policies and Procedures: FMLA, Disability and Military Leave, Family Medical Leave, Maternity and Paternity Leave, etc. \nFacilitated annual 401K and Group Insurance Audit and Filing of IRS Form 5500. \nConducted New-hire Orientations and Safety Training.  \nDesigned and prepared reports for executive staff, finance team, auditors and government agencies. Benefits Counselor The Health Trust August 1996  –  October 1999  (3 years 3 months) Assessed patient needs for health education to prevent HIV infection or re-infection. \nDelivered lifestyle, risk reduction and disease management counseling to patients and their families.  \nAssigned clients to social work and nursing case-management and made referrals to other community agencies.  \nWorked with a multidisciplinary team of physicians, nurses, nutritionists and social workers to deliver care to patients living with HIV/AIDS.  \nConducted benefits workshops for community leaders, social workers, and agency clients utilizing adult learning theory concepts and principles.  \nAssisted HIV/AIDS patients with applications for public and private benefit programs, such as MediCal, Social Security, and California State Disability. \nProvided patients with on-going counseling, emotional support and patient advocacy. \nTranslated brochures and other informational materials, from English to Spanish, in a culturally appropriate manner. Benefits Counselor The Health Trust August 1996  –  October 1999  (3 years 3 months) Assessed patient needs for health education to prevent HIV infection or re-infection. \nDelivered lifestyle, risk reduction and disease management counseling to patients and their families.  \nAssigned clients to social work and nursing case-management and made referrals to other community agencies.  \nWorked with a multidisciplinary team of physicians, nurses, nutritionists and social workers to deliver care to patients living with HIV/AIDS.  \nConducted benefits workshops for community leaders, social workers, and agency clients utilizing adult learning theory concepts and principles.  \nAssisted HIV/AIDS patients with applications for public and private benefit programs, such as MediCal, Social Security, and California State Disability. \nProvided patients with on-going counseling, emotional support and patient advocacy. \nTranslated brochures and other informational materials, from English to Spanish, in a culturally appropriate manner. Education San Jose State University Master in Public Health,  Community Health Education , 3.55 2004  – 2006 San Jose State University Bachelor of Science (BS),  Business Administration , Management and Operations 1992  – 1995 San Jose State University Master in Public Health,  Community Health Education , 3.55 2004  – 2006 San Jose State University Master in Public Health,  Community Health Education , 3.55 2004  – 2006 San Jose State University Master in Public Health,  Community Health Education , 3.55 2004  – 2006 San Jose State University Bachelor of Science (BS),  Business Administration , Management and Operations 1992  – 1995 San Jose State University Bachelor of Science (BS),  Business Administration , Management and Operations 1992  – 1995 San Jose State University Bachelor of Science (BS),  Business Administration , Management and Operations 1992  – 1995 ", "Experience Orthodontic Resident Montefiore Medical Center July 2014  – Present (1 year 2 months) Bronx, New York Treat Phase I and Phase II adolescent and adult orthodontic patients in fast-paced clinical setting. \nAttend daily lectures on growth and development, biomechanics, current journal articles, and case presentations. \nParticipate in daily case treatment planning sessions. \nInvisalign certified. Residential Counselor Stanford University Education Program for Gifted Youth (EPGY) June 2010  –  August 2010  (3 months) Worked for Stanford University EPGY's academic summer camp for high school students as a biology teaching assistant. \nSupervised 80 students in residential housing. Resident Assistant Stanford University Residential Education September 2009  –  June 2010  (10 months) Fostered a positive, intellectual, and compassionate 65-person dorm community. \nCollaborated with dorm staff in carrying out both entertaining and educational dorm activities. \nAttended two week intensive training on diversity, community building, and crisis prevention. Peer Health Educator Stanford University Vaden Wellness and Health Promotion Services April 2008  –  June 2009  (1 year 3 months) Conducted programs, issued newsletters, and posted fliers promoting health/wellness in a 180-person dorm. \nObtained and studied up-to-date information on latest health issues, causes, and treatments. Orthodontic Resident Montefiore Medical Center July 2014  – Present (1 year 2 months) Bronx, New York Treat Phase I and Phase II adolescent and adult orthodontic patients in fast-paced clinical setting. \nAttend daily lectures on growth and development, biomechanics, current journal articles, and case presentations. \nParticipate in daily case treatment planning sessions. \nInvisalign certified. Orthodontic Resident Montefiore Medical Center July 2014  – Present (1 year 2 months) Bronx, New York Treat Phase I and Phase II adolescent and adult orthodontic patients in fast-paced clinical setting. \nAttend daily lectures on growth and development, biomechanics, current journal articles, and case presentations. \nParticipate in daily case treatment planning sessions. \nInvisalign certified. Residential Counselor Stanford University Education Program for Gifted Youth (EPGY) June 2010  –  August 2010  (3 months) Worked for Stanford University EPGY's academic summer camp for high school students as a biology teaching assistant. \nSupervised 80 students in residential housing. Residential Counselor Stanford University Education Program for Gifted Youth (EPGY) June 2010  –  August 2010  (3 months) Worked for Stanford University EPGY's academic summer camp for high school students as a biology teaching assistant. \nSupervised 80 students in residential housing. Resident Assistant Stanford University Residential Education September 2009  –  June 2010  (10 months) Fostered a positive, intellectual, and compassionate 65-person dorm community. \nCollaborated with dorm staff in carrying out both entertaining and educational dorm activities. \nAttended two week intensive training on diversity, community building, and crisis prevention. Resident Assistant Stanford University Residential Education September 2009  –  June 2010  (10 months) Fostered a positive, intellectual, and compassionate 65-person dorm community. \nCollaborated with dorm staff in carrying out both entertaining and educational dorm activities. \nAttended two week intensive training on diversity, community building, and crisis prevention. Peer Health Educator Stanford University Vaden Wellness and Health Promotion Services April 2008  –  June 2009  (1 year 3 months) Conducted programs, issued newsletters, and posted fliers promoting health/wellness in a 180-person dorm. \nObtained and studied up-to-date information on latest health issues, causes, and treatments. Peer Health Educator Stanford University Vaden Wellness and Health Promotion Services April 2008  –  June 2009  (1 year 3 months) Conducted programs, issued newsletters, and posted fliers promoting health/wellness in a 180-person dorm. \nObtained and studied up-to-date information on latest health issues, causes, and treatments. Languages Chinese (Mandarin) Native or bilingual proficiency Spanish Professional working proficiency Chinese (Mandarin) Native or bilingual proficiency Spanish Professional working proficiency Chinese (Mandarin) Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Medicine Leadership Dentistry Mental Health Music Drawing Program Development Skills  Medicine Leadership Dentistry Mental Health Music Drawing Program Development Medicine Leadership Dentistry Mental Health Music Drawing Program Development Medicine Leadership Dentistry Mental Health Music Drawing Program Development Education Montefiore Medical Center Orthodontics Residency Program 2014  – 2017 Activities and Societies:  American Association of Orthodontists ,  American Dental Association ,  California Dental Association UCLA Doctor of Dental Surgery (DDS) , Cum Laude 2010  – 2014 Activities and Societies:  Omicron Kappa Upsilon ,  Associated Student Body ,  Chinese Dental Student Association ,  American Student Dental Association (ASDA) ,  California Dental Association (CDA) ,  American Association of Women Dentists (AAWD) ,  Class Cabinet ,  Honduras Dental Mission Trip ,  China Dental Mission Trip ,  Delta Sigma Delta Stanford University B.S.,  Biology 2006  – 2010 Degree conferred with Distinction. Activities and Societies:  Cap & Gown Women's Honors Society ,  Heller Lab ,  Sapolsky Lab ,  Resident Assistant (RA) ,  Peer Health Educator (PHE) ,  The Bridge Peer Counseling Center ,  Taiwanese Cultural Society ,  Stanford Pre-Dental Association Montefiore Medical Center Orthodontics Residency Program 2014  – 2017 Activities and Societies:  American Association of Orthodontists ,  American Dental Association ,  California Dental Association Montefiore Medical Center Orthodontics Residency Program 2014  – 2017 Activities and Societies:  American Association of Orthodontists ,  American Dental Association ,  California Dental Association Montefiore Medical Center Orthodontics Residency Program 2014  – 2017 Activities and Societies:  American Association of Orthodontists ,  American Dental Association ,  California Dental Association UCLA Doctor of Dental Surgery (DDS) , Cum Laude 2010  – 2014 Activities and Societies:  Omicron Kappa Upsilon ,  Associated Student Body ,  Chinese Dental Student Association ,  American Student Dental Association (ASDA) ,  California Dental Association (CDA) ,  American Association of Women Dentists (AAWD) ,  Class Cabinet ,  Honduras Dental Mission Trip ,  China Dental Mission Trip ,  Delta Sigma Delta UCLA Doctor of Dental Surgery (DDS) , Cum Laude 2010  – 2014 Activities and Societies:  Omicron Kappa Upsilon ,  Associated Student Body ,  Chinese Dental Student Association ,  American Student Dental Association (ASDA) ,  California Dental Association (CDA) ,  American Association of Women Dentists (AAWD) ,  Class Cabinet ,  Honduras Dental Mission Trip ,  China Dental Mission Trip ,  Delta Sigma Delta UCLA Doctor of Dental Surgery (DDS) , Cum Laude 2010  – 2014 Activities and Societies:  Omicron Kappa Upsilon ,  Associated Student Body ,  Chinese Dental Student Association ,  American Student Dental Association (ASDA) ,  California Dental Association (CDA) ,  American Association of Women Dentists (AAWD) ,  Class Cabinet ,  Honduras Dental Mission Trip ,  China Dental Mission Trip ,  Delta Sigma Delta Stanford University B.S.,  Biology 2006  – 2010 Degree conferred with Distinction. Activities and Societies:  Cap & Gown Women's Honors Society ,  Heller Lab ,  Sapolsky Lab ,  Resident Assistant (RA) ,  Peer Health Educator (PHE) ,  The Bridge Peer Counseling Center ,  Taiwanese Cultural Society ,  Stanford Pre-Dental Association Stanford University B.S.,  Biology 2006  – 2010 Degree conferred with Distinction. Activities and Societies:  Cap & Gown Women's Honors Society ,  Heller Lab ,  Sapolsky Lab ,  Resident Assistant (RA) ,  Peer Health Educator (PHE) ,  The Bridge Peer Counseling Center ,  Taiwanese Cultural Society ,  Stanford Pre-Dental Association Stanford University B.S.,  Biology 2006  – 2010 Degree conferred with Distinction. Activities and Societies:  Cap & Gown Women's Honors Society ,  Heller Lab ,  Sapolsky Lab ,  Resident Assistant (RA) ,  Peer Health Educator (PHE) ,  The Bridge Peer Counseling Center ,  Taiwanese Cultural Society ,  Stanford Pre-Dental Association ", "Summary Clinical research professional with working knowledge of GCP/ICH guidelines. 5+ years of experience in academic research, clinical site, and biotech industry settings in translational medicine, emergency medicine, and oncology, respectively. Dedicated, organized, and self-directed with high attention to detail and accuracy. Summary Clinical research professional with working knowledge of GCP/ICH guidelines. 5+ years of experience in academic research, clinical site, and biotech industry settings in translational medicine, emergency medicine, and oncology, respectively. Dedicated, organized, and self-directed with high attention to detail and accuracy. Clinical research professional with working knowledge of GCP/ICH guidelines. 5+ years of experience in academic research, clinical site, and biotech industry settings in translational medicine, emergency medicine, and oncology, respectively. Dedicated, organized, and self-directed with high attention to detail and accuracy. Clinical research professional with working knowledge of GCP/ICH guidelines. 5+ years of experience in academic research, clinical site, and biotech industry settings in translational medicine, emergency medicine, and oncology, respectively. Dedicated, organized, and self-directed with high attention to detail and accuracy. Experience Clinical Trial Assistant Onyx Pharmaceuticals June 2013  –  September 2014  (1 year 4 months) South San Francisco, CA Staff Research Associate/Study Coordinator UCSF August 2011  –  February 2013  (1 year 7 months) Cohen Lab | San Francisco General Hospital • Achieved over a 98% informed consent rate from 150+ trauma patients and family members \n• Enrolled 100+ patients into a Phase 3 multicenter, prospective and randomized NIH trial (PROPPR) \n• Enrolled 200+ trauma patients in investigator-initiated coagulopathy study \n• Completed 200+ case report forms from data evaluation of blood sample analyses and medical record review \n• Facilitated 5 emergency massive blood transfusion protocols while documenting real-time clinical data \n• Implemented best practices for consenting procedures, trauma reporting, and sample collection \n• Collected and processed biological samples for up to six patients at a time for analysis Clinical Research Coordinator Stanford University Medical Center February 2009  –  August 2011  (2 years 7 months) Nadeau Lab of Allergy and Immunology •\tInitiated research projects investigating the link between environmental exposures and health outcomes in identical twins with respect to epigenetics, and Foxp3 gene and regulatory t-cell function \n•\tDeveloped source documentation templates, including case report forms \n•\tScreened and enrolled over 30 patients \n•\tCoordinated and conducted all patient clinic visits, including spirometry, buccal swab procedures, and medical history interviews \n•\tEstablished collaboration with Stanford Research Institute and organized meetings and site visits. \n• Developed standard operating procedures and laboratory procedures in accordance with GCP guidelines \n• Conducted flow cytometry, DNA purification, and PBMC isolation procedures \n• Trained and mentored high school interns and undergraduates \n• Assisted in the development and submission of manuscripts to peer-reviewed scientific journals. \n• Presented abstracts at Stanford Undergraduate Research Symposiums and relevant conferences Peer Health Educator Stanford University February 2009  –  June 2010  (1 year 5 months) •\tActed as primary liaison between Vaden Health Center and dedicated student dormitory through health assessments and referrals \n•\tSupervised the personal and intellectual growth of 90 freshman residents through peer mentoring, in-house workshops, and conflict mediation \n•\tCoordinated and facilitated 15 workshops and speaker panels on topics such as nutrition, alcohol use, and mental health \n•\tManaged advertising, programming, and presentations for annual “Take Back the Night” event, a vigil and march remembering those affected by sexual assault and domestic violence Health Educator/Volunteer Foundation for Sustainable Development and Research (FSDR) February 2009  –  September 2009  (8 months) Stanford University and Chaguitillo, Nicaragua •\tDeveloped and conducted 50 door-to-door surveys on health behavior practices in Chaguitillo  \n•\tImplemented school lessons on hand-washing and the effects of smoking  \n•\tTrained community members in establishing vegetable garden and ecotourism  \n•\tAided the establishment of the community’s first health fair and presented survey findings Clinical Trial Assistant Onyx Pharmaceuticals June 2013  –  September 2014  (1 year 4 months) South San Francisco, CA Clinical Trial Assistant Onyx Pharmaceuticals June 2013  –  September 2014  (1 year 4 months) South San Francisco, CA Staff Research Associate/Study Coordinator UCSF August 2011  –  February 2013  (1 year 7 months) Cohen Lab | San Francisco General Hospital • Achieved over a 98% informed consent rate from 150+ trauma patients and family members \n• Enrolled 100+ patients into a Phase 3 multicenter, prospective and randomized NIH trial (PROPPR) \n• Enrolled 200+ trauma patients in investigator-initiated coagulopathy study \n• Completed 200+ case report forms from data evaluation of blood sample analyses and medical record review \n• Facilitated 5 emergency massive blood transfusion protocols while documenting real-time clinical data \n• Implemented best practices for consenting procedures, trauma reporting, and sample collection \n• Collected and processed biological samples for up to six patients at a time for analysis Staff Research Associate/Study Coordinator UCSF August 2011  –  February 2013  (1 year 7 months) Cohen Lab | San Francisco General Hospital • Achieved over a 98% informed consent rate from 150+ trauma patients and family members \n• Enrolled 100+ patients into a Phase 3 multicenter, prospective and randomized NIH trial (PROPPR) \n• Enrolled 200+ trauma patients in investigator-initiated coagulopathy study \n• Completed 200+ case report forms from data evaluation of blood sample analyses and medical record review \n• Facilitated 5 emergency massive blood transfusion protocols while documenting real-time clinical data \n• Implemented best practices for consenting procedures, trauma reporting, and sample collection \n• Collected and processed biological samples for up to six patients at a time for analysis Clinical Research Coordinator Stanford University Medical Center February 2009  –  August 2011  (2 years 7 months) Nadeau Lab of Allergy and Immunology •\tInitiated research projects investigating the link between environmental exposures and health outcomes in identical twins with respect to epigenetics, and Foxp3 gene and regulatory t-cell function \n•\tDeveloped source documentation templates, including case report forms \n•\tScreened and enrolled over 30 patients \n•\tCoordinated and conducted all patient clinic visits, including spirometry, buccal swab procedures, and medical history interviews \n•\tEstablished collaboration with Stanford Research Institute and organized meetings and site visits. \n• Developed standard operating procedures and laboratory procedures in accordance with GCP guidelines \n• Conducted flow cytometry, DNA purification, and PBMC isolation procedures \n• Trained and mentored high school interns and undergraduates \n• Assisted in the development and submission of manuscripts to peer-reviewed scientific journals. \n• Presented abstracts at Stanford Undergraduate Research Symposiums and relevant conferences Clinical Research Coordinator Stanford University Medical Center February 2009  –  August 2011  (2 years 7 months) Nadeau Lab of Allergy and Immunology •\tInitiated research projects investigating the link between environmental exposures and health outcomes in identical twins with respect to epigenetics, and Foxp3 gene and regulatory t-cell function \n•\tDeveloped source documentation templates, including case report forms \n•\tScreened and enrolled over 30 patients \n•\tCoordinated and conducted all patient clinic visits, including spirometry, buccal swab procedures, and medical history interviews \n•\tEstablished collaboration with Stanford Research Institute and organized meetings and site visits. \n• Developed standard operating procedures and laboratory procedures in accordance with GCP guidelines \n• Conducted flow cytometry, DNA purification, and PBMC isolation procedures \n• Trained and mentored high school interns and undergraduates \n• Assisted in the development and submission of manuscripts to peer-reviewed scientific journals. \n• Presented abstracts at Stanford Undergraduate Research Symposiums and relevant conferences Peer Health Educator Stanford University February 2009  –  June 2010  (1 year 5 months) •\tActed as primary liaison between Vaden Health Center and dedicated student dormitory through health assessments and referrals \n•\tSupervised the personal and intellectual growth of 90 freshman residents through peer mentoring, in-house workshops, and conflict mediation \n•\tCoordinated and facilitated 15 workshops and speaker panels on topics such as nutrition, alcohol use, and mental health \n•\tManaged advertising, programming, and presentations for annual “Take Back the Night” event, a vigil and march remembering those affected by sexual assault and domestic violence Peer Health Educator Stanford University February 2009  –  June 2010  (1 year 5 months) •\tActed as primary liaison between Vaden Health Center and dedicated student dormitory through health assessments and referrals \n•\tSupervised the personal and intellectual growth of 90 freshman residents through peer mentoring, in-house workshops, and conflict mediation \n•\tCoordinated and facilitated 15 workshops and speaker panels on topics such as nutrition, alcohol use, and mental health \n•\tManaged advertising, programming, and presentations for annual “Take Back the Night” event, a vigil and march remembering those affected by sexual assault and domestic violence Health Educator/Volunteer Foundation for Sustainable Development and Research (FSDR) February 2009  –  September 2009  (8 months) Stanford University and Chaguitillo, Nicaragua •\tDeveloped and conducted 50 door-to-door surveys on health behavior practices in Chaguitillo  \n•\tImplemented school lessons on hand-washing and the effects of smoking  \n•\tTrained community members in establishing vegetable garden and ecotourism  \n•\tAided the establishment of the community’s first health fair and presented survey findings Health Educator/Volunteer Foundation for Sustainable Development and Research (FSDR) February 2009  –  September 2009  (8 months) Stanford University and Chaguitillo, Nicaragua •\tDeveloped and conducted 50 door-to-door surveys on health behavior practices in Chaguitillo  \n•\tImplemented school lessons on hand-washing and the effects of smoking  \n•\tTrained community members in establishing vegetable garden and ecotourism  \n•\tAided the establishment of the community’s first health fair and presented survey findings Languages Spanish Professional working proficiency Tagalog Limited working proficiency Spanish Professional working proficiency Tagalog Limited working proficiency Spanish Professional working proficiency Tagalog Limited working proficiency Professional working proficiency Limited working proficiency Skills Research Clinical Research Global Health Health Public Health Spanish-speaking Highly detail oriented Grant Writing Interpersonal Skill Leadership Cultural Sensitivity Organized Immunology PCR Lifesciences Molecular Biology Cell Culture Infectious Diseases Neuroscience IRB Protocol Genetics Stata Clinical Trials Oncology CTMS EDC See 12+     See less Skills  Research Clinical Research Global Health Health Public Health Spanish-speaking Highly detail oriented Grant Writing Interpersonal Skill Leadership Cultural Sensitivity Organized Immunology PCR Lifesciences Molecular Biology Cell Culture Infectious Diseases Neuroscience IRB Protocol Genetics Stata Clinical Trials Oncology CTMS EDC See 12+     See less Research Clinical Research Global Health Health Public Health Spanish-speaking Highly detail oriented Grant Writing Interpersonal Skill Leadership Cultural Sensitivity Organized Immunology PCR Lifesciences Molecular Biology Cell Culture Infectious Diseases Neuroscience IRB Protocol Genetics Stata Clinical Trials Oncology CTMS EDC See 12+     See less Research Clinical Research Global Health Health Public Health Spanish-speaking Highly detail oriented Grant Writing Interpersonal Skill Leadership Cultural Sensitivity Organized Immunology PCR Lifesciences Molecular Biology Cell Culture Infectious Diseases Neuroscience IRB Protocol Genetics Stata Clinical Trials Oncology CTMS EDC See 12+     See less Education Stanford University Bachelor of Arts (B.A.),  Human Biology (Global Health and Infectious Disease) 2007  – 2011 Minor in English Creative Writing \n \nStanford Bing Overseas Studies Program: 1 quarter in Cape Town, South Africa. Conducted service-learning project at Linawo Children's Home for orphans who lost parents to HIV/AIDS. Selected to perform at Annual Cape Town Carnival. Activities and Societies:  Delta Delta Delta ,  Dv8 Dance Troupe ,  Kayumanggi Pilipino Dance Troupe ,  Charity Fashion Show ,  A.S.S.U. Co-Chair of Sustainability Buffalo Grove High School 2004  – 2007 Graduated with Highest Honors. \nBackup dancer for Lupe Fiasco during MLS Soccer Halftime on ESPN, July '07. Activities and Societies:  Orchesis Dance Troupe ,  Basketball ,  Gymnastics ,  and Badminton Teams ,  New Vibes Choir ,  Child Life Intern at Lutheran General Hospital. Stanford University Bachelor of Arts (B.A.),  Human Biology (Global Health and Infectious Disease) 2007  – 2011 Minor in English Creative Writing \n \nStanford Bing Overseas Studies Program: 1 quarter in Cape Town, South Africa. Conducted service-learning project at Linawo Children's Home for orphans who lost parents to HIV/AIDS. Selected to perform at Annual Cape Town Carnival. Activities and Societies:  Delta Delta Delta ,  Dv8 Dance Troupe ,  Kayumanggi Pilipino Dance Troupe ,  Charity Fashion Show ,  A.S.S.U. Co-Chair of Sustainability Stanford University Bachelor of Arts (B.A.),  Human Biology (Global Health and Infectious Disease) 2007  – 2011 Minor in English Creative Writing \n \nStanford Bing Overseas Studies Program: 1 quarter in Cape Town, South Africa. Conducted service-learning project at Linawo Children's Home for orphans who lost parents to HIV/AIDS. Selected to perform at Annual Cape Town Carnival. Activities and Societies:  Delta Delta Delta ,  Dv8 Dance Troupe ,  Kayumanggi Pilipino Dance Troupe ,  Charity Fashion Show ,  A.S.S.U. Co-Chair of Sustainability Stanford University Bachelor of Arts (B.A.),  Human Biology (Global Health and Infectious Disease) 2007  – 2011 Minor in English Creative Writing \n \nStanford Bing Overseas Studies Program: 1 quarter in Cape Town, South Africa. Conducted service-learning project at Linawo Children's Home for orphans who lost parents to HIV/AIDS. Selected to perform at Annual Cape Town Carnival. Activities and Societies:  Delta Delta Delta ,  Dv8 Dance Troupe ,  Kayumanggi Pilipino Dance Troupe ,  Charity Fashion Show ,  A.S.S.U. Co-Chair of Sustainability Buffalo Grove High School 2004  – 2007 Graduated with Highest Honors. \nBackup dancer for Lupe Fiasco during MLS Soccer Halftime on ESPN, July '07. Activities and Societies:  Orchesis Dance Troupe ,  Basketball ,  Gymnastics ,  and Badminton Teams ,  New Vibes Choir ,  Child Life Intern at Lutheran General Hospital. Buffalo Grove High School 2004  – 2007 Graduated with Highest Honors. \nBackup dancer for Lupe Fiasco during MLS Soccer Halftime on ESPN, July '07. Activities and Societies:  Orchesis Dance Troupe ,  Basketball ,  Gymnastics ,  and Badminton Teams ,  New Vibes Choir ,  Child Life Intern at Lutheran General Hospital. Buffalo Grove High School 2004  – 2007 Graduated with Highest Honors. \nBackup dancer for Lupe Fiasco during MLS Soccer Halftime on ESPN, July '07. Activities and Societies:  Orchesis Dance Troupe ,  Basketball ,  Gymnastics ,  and Badminton Teams ,  New Vibes Choir ,  Child Life Intern at Lutheran General Hospital. Honors & Awards Major Research Grant Stanford University Vice Provost for Undergraduate Education October 2010 Minor Research Grant Stanford University Vice Provost for Undergraduate Education May 2010 Guest Speaker at International American Thoracic Society Conference in Denver, CO American Thoracic Society May 2011 Selected to present at symposium on research investigating the role of epigenetics in the development of asthma in identical twins with environmental exposures. Also selected to receive a travel grant. Major Research Grant Stanford University Vice Provost for Undergraduate Education October 2010 Major Research Grant Stanford University Vice Provost for Undergraduate Education October 2010 Major Research Grant Stanford University Vice Provost for Undergraduate Education October 2010 Minor Research Grant Stanford University Vice Provost for Undergraduate Education May 2010 Minor Research Grant Stanford University Vice Provost for Undergraduate Education May 2010 Minor Research Grant Stanford University Vice Provost for Undergraduate Education May 2010 Guest Speaker at International American Thoracic Society Conference in Denver, CO American Thoracic Society May 2011 Selected to present at symposium on research investigating the role of epigenetics in the development of asthma in identical twins with environmental exposures. Also selected to receive a travel grant. Guest Speaker at International American Thoracic Society Conference in Denver, CO American Thoracic Society May 2011 Selected to present at symposium on research investigating the role of epigenetics in the development of asthma in identical twins with environmental exposures. Also selected to receive a travel grant. Guest Speaker at International American Thoracic Society Conference in Denver, CO American Thoracic Society May 2011 Selected to present at symposium on research investigating the role of epigenetics in the development of asthma in identical twins with environmental exposures. Also selected to receive a travel grant. ", "Experience Teacher Bing Nursery School September 2011  – Present (4 years) Stanford, CA Research Assistant Stanford Pediatric Bipolar Disorders Program September 2011  –  September 2012  (1 year 1 month) Residential Counselor Wediko Children's Services 2010  –  October 2011  (1 year) Residential Peer Health Educator Stanford University Health Promotion Services September 2010  –  August 2011  (1 year) Residential Counselor Wediko Children's Services June 2010  –  August 2010  (3 months) Teaching and conducting behavioral interventions with behaviorally-challenged youth aged 7-17. Research Assistant Stanford University October 2008  –  March 2009  (6 months) Dr. Claude Steele's social psychology & stereotype threat lab. Intern Novartis Vaccines and Diagnostics June 2007  –  September 2007  (4 months) Teacher Bing Nursery School September 2011  – Present (4 years) Stanford, CA Teacher Bing Nursery School September 2011  – Present (4 years) Stanford, CA Research Assistant Stanford Pediatric Bipolar Disorders Program September 2011  –  September 2012  (1 year 1 month) Research Assistant Stanford Pediatric Bipolar Disorders Program September 2011  –  September 2012  (1 year 1 month) Residential Counselor Wediko Children's Services 2010  –  October 2011  (1 year) Residential Counselor Wediko Children's Services 2010  –  October 2011  (1 year) Residential Peer Health Educator Stanford University Health Promotion Services September 2010  –  August 2011  (1 year) Residential Peer Health Educator Stanford University Health Promotion Services September 2010  –  August 2011  (1 year) Residential Counselor Wediko Children's Services June 2010  –  August 2010  (3 months) Teaching and conducting behavioral interventions with behaviorally-challenged youth aged 7-17. Residential Counselor Wediko Children's Services June 2010  –  August 2010  (3 months) Teaching and conducting behavioral interventions with behaviorally-challenged youth aged 7-17. Research Assistant Stanford University October 2008  –  March 2009  (6 months) Dr. Claude Steele's social psychology & stereotype threat lab. Research Assistant Stanford University October 2008  –  March 2009  (6 months) Dr. Claude Steele's social psychology & stereotype threat lab. Intern Novartis Vaccines and Diagnostics June 2007  –  September 2007  (4 months) Intern Novartis Vaccines and Diagnostics June 2007  –  September 2007  (4 months) Skills Grant Writing Research Community Outreach Teaching Psychology Skills  Grant Writing Research Community Outreach Teaching Psychology Grant Writing Research Community Outreach Teaching Psychology Grant Writing Research Community Outreach Teaching Psychology Education Stanford University B.A.,  Human Biology , focus in Child & Adolescent Development 2007  – 2011 Activities and Societies:  Residential Peer Health Educators ,  Stanford YES+ ,  Stanford Pre-Orientation Wilderness Trips ,  Foundations for Education Math Teachers Stanford University B.A.,  Human Biology , focus in Child & Adolescent Development 2007  – 2011 Activities and Societies:  Residential Peer Health Educators ,  Stanford YES+ ,  Stanford Pre-Orientation Wilderness Trips ,  Foundations for Education Math Teachers Stanford University B.A.,  Human Biology , focus in Child & Adolescent Development 2007  – 2011 Activities and Societies:  Residential Peer Health Educators ,  Stanford YES+ ,  Stanford Pre-Orientation Wilderness Trips ,  Foundations for Education Math Teachers Stanford University B.A.,  Human Biology , focus in Child & Adolescent Development 2007  – 2011 Activities and Societies:  Residential Peer Health Educators ,  Stanford YES+ ,  Stanford Pre-Orientation Wilderness Trips ,  Foundations for Education Math Teachers ", "Experience Assistant Professor Carleton College August 2014  – Present (1 year 1 month) Assistant professor in computer science. Data Mining Intern WestEd May 2010  – Present (5 years 4 months) Oakland, CA Analyze data from students using a computerized chemistry tutor. Prepare reports with suggestions for decreasing errors due to interface issues and automatically recognizing common student errors reflecting conceptual misunderstandings. Use data mining techniques to determine behaviors in the tutor that are predictive of post-test scores and learning gains. Graduate student researcher UC Berkeley August 2008  –  May 2014  (5 years 10 months) I work primarily on computational models of cognition and applying these models to educational problems. My research focuses on estimating people's knowledge and adapting games or instruction based on that estimate. Intern in the Computational Intelligence Lab 3M May 2013  –  August 2013  (4 months) Apply machine learning techniques to problems in health information systems. Use tools such as Hadoop to work with large healthcare datasets. Graduate Student Instructor UC Berkeley August 2008  –  December 2008  (5 months) Teaching assistant for CS188: Introduction to Artificial Intelligence Research Programmer in NLP Stanford University July 2007  –  August 2008  (1 year 2 months) I work on research projects related to NLP and AI. Currently, I'm working on automatic detection of textual entailment. Peer Health Educator Stanford University September 2005  –  June 2006  (10 months) Create and deliver programming to educate and raise awareness of physical and mental health issues as a live-in staff member in a freshman dorm. Provide counseling, referrals, and para-clinical support. Work as part of a team of staff members in order to manage the students' needs in a holistic manner as well as address community needs. Assistant Professor Carleton College August 2014  – Present (1 year 1 month) Assistant professor in computer science. Assistant Professor Carleton College August 2014  – Present (1 year 1 month) Assistant professor in computer science. Data Mining Intern WestEd May 2010  – Present (5 years 4 months) Oakland, CA Analyze data from students using a computerized chemistry tutor. Prepare reports with suggestions for decreasing errors due to interface issues and automatically recognizing common student errors reflecting conceptual misunderstandings. Use data mining techniques to determine behaviors in the tutor that are predictive of post-test scores and learning gains. Data Mining Intern WestEd May 2010  – Present (5 years 4 months) Oakland, CA Analyze data from students using a computerized chemistry tutor. Prepare reports with suggestions for decreasing errors due to interface issues and automatically recognizing common student errors reflecting conceptual misunderstandings. Use data mining techniques to determine behaviors in the tutor that are predictive of post-test scores and learning gains. Graduate student researcher UC Berkeley August 2008  –  May 2014  (5 years 10 months) I work primarily on computational models of cognition and applying these models to educational problems. My research focuses on estimating people's knowledge and adapting games or instruction based on that estimate. Graduate student researcher UC Berkeley August 2008  –  May 2014  (5 years 10 months) I work primarily on computational models of cognition and applying these models to educational problems. My research focuses on estimating people's knowledge and adapting games or instruction based on that estimate. Intern in the Computational Intelligence Lab 3M May 2013  –  August 2013  (4 months) Apply machine learning techniques to problems in health information systems. Use tools such as Hadoop to work with large healthcare datasets. Intern in the Computational Intelligence Lab 3M May 2013  –  August 2013  (4 months) Apply machine learning techniques to problems in health information systems. Use tools such as Hadoop to work with large healthcare datasets. Graduate Student Instructor UC Berkeley August 2008  –  December 2008  (5 months) Teaching assistant for CS188: Introduction to Artificial Intelligence Graduate Student Instructor UC Berkeley August 2008  –  December 2008  (5 months) Teaching assistant for CS188: Introduction to Artificial Intelligence Research Programmer in NLP Stanford University July 2007  –  August 2008  (1 year 2 months) I work on research projects related to NLP and AI. Currently, I'm working on automatic detection of textual entailment. Research Programmer in NLP Stanford University July 2007  –  August 2008  (1 year 2 months) I work on research projects related to NLP and AI. Currently, I'm working on automatic detection of textual entailment. Peer Health Educator Stanford University September 2005  –  June 2006  (10 months) Create and deliver programming to educate and raise awareness of physical and mental health issues as a live-in staff member in a freshman dorm. Provide counseling, referrals, and para-clinical support. Work as part of a team of staff members in order to manage the students' needs in a holistic manner as well as address community needs. Peer Health Educator Stanford University September 2005  –  June 2006  (10 months) Create and deliver programming to educate and raise awareness of physical and mental health issues as a live-in staff member in a freshman dorm. Provide counseling, referrals, and para-clinical support. Work as part of a team of staff members in order to manage the students' needs in a holistic manner as well as address community needs. Skills Machine Learning Computer Science Artificial Intelligence Natural Language... Cognitive Science Programming Educational Data Mining Behavioral Experiments Hadoop R Python LaTeX Algorithms Data Mining Data Analysis Skills  Machine Learning Computer Science Artificial Intelligence Natural Language... Cognitive Science Programming Educational Data Mining Behavioral Experiments Hadoop R Python LaTeX Algorithms Data Mining Data Analysis Machine Learning Computer Science Artificial Intelligence Natural Language... Cognitive Science Programming Educational Data Mining Behavioral Experiments Hadoop R Python LaTeX Algorithms Data Mining Data Analysis Machine Learning Computer Science Artificial Intelligence Natural Language... Cognitive Science Programming Educational Data Mining Behavioral Experiments Hadoop R Python LaTeX Algorithms Data Mining Data Analysis Education University of California, Berkeley Ph.D.,  Computer Science 2008  – 2014 Stanford University Master of Science (MS),  Symbolic Systems 2003  – 2007 Also BS in Symbolic Systems, BA in Feminist Studies. University of California, Berkeley Ph.D.,  Computer Science 2008  – 2014 University of California, Berkeley Ph.D.,  Computer Science 2008  – 2014 University of California, Berkeley Ph.D.,  Computer Science 2008  – 2014 Stanford University Master of Science (MS),  Symbolic Systems 2003  – 2007 Also BS in Symbolic Systems, BA in Feminist Studies. Stanford University Master of Science (MS),  Symbolic Systems 2003  – 2007 Also BS in Symbolic Systems, BA in Feminist Studies. Stanford University Master of Science (MS),  Symbolic Systems 2003  – 2007 Also BS in Symbolic Systems, BA in Feminist Studies. Honors & Awards Dissertation Fellowship National Academy of Education/Spencer $25000 to support the final year of dissertation writing. Award is based on potential of dissertation to advance education, and is given to less than 10% of applicants. NSF Graduate Fellowship National Science Foundation April 2008 3 years of graduate funding for stipend and tuition.  NDSEG Fellowship Department of Defense April 2010 3 years of graduate funding for stipend and tuition. Dissertation Fellowship National Academy of Education/Spencer $25000 to support the final year of dissertation writing. Award is based on potential of dissertation to advance education, and is given to less than 10% of applicants. Dissertation Fellowship National Academy of Education/Spencer $25000 to support the final year of dissertation writing. Award is based on potential of dissertation to advance education, and is given to less than 10% of applicants. Dissertation Fellowship National Academy of Education/Spencer $25000 to support the final year of dissertation writing. Award is based on potential of dissertation to advance education, and is given to less than 10% of applicants. NSF Graduate Fellowship National Science Foundation April 2008 3 years of graduate funding for stipend and tuition.  NSF Graduate Fellowship National Science Foundation April 2008 3 years of graduate funding for stipend and tuition.  NSF Graduate Fellowship National Science Foundation April 2008 3 years of graduate funding for stipend and tuition.  NDSEG Fellowship Department of Defense April 2010 3 years of graduate funding for stipend and tuition. NDSEG Fellowship Department of Defense April 2010 3 years of graduate funding for stipend and tuition. NDSEG Fellowship Department of Defense April 2010 3 years of graduate funding for stipend and tuition. ", "Summary Enthusiastic and determined professional with a reputation for consistently delivering outcomes to a high standard. Hard working and efficient time manager, able to juggle multiple projects and priorities. Experience in communicating across a large organization while performing multiple functions and roles to develop critical programs and communication solutions. Proven ability to provide leadership and support on projects with an impact at local, regional and global levels. Summary Enthusiastic and determined professional with a reputation for consistently delivering outcomes to a high standard. Hard working and efficient time manager, able to juggle multiple projects and priorities. Experience in communicating across a large organization while performing multiple functions and roles to develop critical programs and communication solutions. Proven ability to provide leadership and support on projects with an impact at local, regional and global levels. Enthusiastic and determined professional with a reputation for consistently delivering outcomes to a high standard. Hard working and efficient time manager, able to juggle multiple projects and priorities. Experience in communicating across a large organization while performing multiple functions and roles to develop critical programs and communication solutions. Proven ability to provide leadership and support on projects with an impact at local, regional and global levels. Enthusiastic and determined professional with a reputation for consistently delivering outcomes to a high standard. Hard working and efficient time manager, able to juggle multiple projects and priorities. Experience in communicating across a large organization while performing multiple functions and roles to develop critical programs and communication solutions. Proven ability to provide leadership and support on projects with an impact at local, regional and global levels. Experience Manager - Business Operations, International Tough Mudder April 2015  – Present (5 months) London, United Kingdom Chief of Staff to the CEO Tough Mudder April 2014  –  April 2015  (1 year 1 month) brooklyn, new york Assisting Tough Mudder's CEO with day-to-day business processes and special projects. \n \nTough Mudder is the premier obstacle course series in the world. With the most innovative obstacles and over one million participants globally to date, Tough Mudder events are designed to test your all-around strength, stamina, mental grit and camaraderie (https://toughmudder.com/). Workforce Associate Tough Mudder April 2013  –  April 2014  (1 year 1 month) Brooklyn, New York Helped coordinate Tough Mudder’s world-wide volunteer program and event staff teams and supported the recruitment, training, deploying, and retaining of volunteers and event staff members. Internal Communications Coordinator Coach October 2011  –  March 2013  (1 year 6 months) New York, NY • Supported the Internal Communications Team in all employee-centered communications. \n• Worked with departments across the business to translate business critical initiatives into communications accessible to and tailored for colleagues. \n• Managed and facilitated company-wide employee volunteerism activities. Partnered with non-profits and colleagues across the business to create a culture of volunteerism at the company, coordinated logistics and organized and planned volunteer events. Communications Executive (Contract) Pfizer August 2010  –  August 2011  (1 year 1 month) • Supported Pfizer’s Regional and UK Communications team and Head of Business Operations in a graduate role (contractor) position with short and long-term projects, working with internal and external stakeholders to deliver business critical programs on local and global levels.  \n• Sharing daily responsibility for Press Office to support Pfizer UK’s relationship with external media. Involvement in full-cycle media relations campaigns- creating media lists, press release materials, sell-in, media coverage report, and internal communications program. \n• Supported Communications teams in activities to ensure that Pfizer’s reputation and vision was accurately portrayed through media contacts and branding projects. Created, edited and facilitated internal communication materials for dissemination to over 2,000 employees, using multiple mediums. (Experienced in different internal communication channels, including newsletters, magazine articles, handouts, intranet portal creation, copy and maintenance, and radio programs). Intern Planned Parenthood Golden Gate January 2009  –  March 2009  (3 months) • Interned in the Public Affairs and Media/Communications department to draft and edit documents for legislators, helped facilitate volunteer events and supported ongoing projects. Field Organizer Campaign for Change August 2008  –  November 2008  (4 months) • Trained and recruited volunteers and organized and led meetings. Administrative duties included data input, phone calling and canvassing. Worked about 100 hrs/wk for three months organizing and managing a cadre of 150+ volunteers. \n• Contributed to a 69% voter turnout in the “Near Campus” precincts and a 45% increase in youth votes within the University of Colorado, Boulder district. Co-Director, Sexual Health Peer Resources Center Stanford University September 2007  –  June 2008  (10 months) • Student-run facility serves nearly 7,000 members of the undergraduate community. During my tenure, the Center received Stanford University’s Dean’s Award for outstanding achievement and contributed to Stanford’s number 1 ranking among American universities on Trojan’s annual Sexual Health Report Card. \n• Led and managed 30 staff and worked with outreach coordinators and financial directors to initiate and implement projects related to improving the sexual health of the collegiate population. Peer Health Educator Stanford University September 2007  –  June 2008  (10 months) • Served as residential staff health resource educator for 250 person dorm and 21 person residential staff. \n• Oversaw peer counseling, health education, dorm programming, basic first aid and referrals. \n• Received top marks in peer performance evaluations. Manager - Business Operations, International Tough Mudder April 2015  – Present (5 months) London, United Kingdom Manager - Business Operations, International Tough Mudder April 2015  – Present (5 months) London, United Kingdom Chief of Staff to the CEO Tough Mudder April 2014  –  April 2015  (1 year 1 month) brooklyn, new york Assisting Tough Mudder's CEO with day-to-day business processes and special projects. \n \nTough Mudder is the premier obstacle course series in the world. With the most innovative obstacles and over one million participants globally to date, Tough Mudder events are designed to test your all-around strength, stamina, mental grit and camaraderie (https://toughmudder.com/). Chief of Staff to the CEO Tough Mudder April 2014  –  April 2015  (1 year 1 month) brooklyn, new york Assisting Tough Mudder's CEO with day-to-day business processes and special projects. \n \nTough Mudder is the premier obstacle course series in the world. With the most innovative obstacles and over one million participants globally to date, Tough Mudder events are designed to test your all-around strength, stamina, mental grit and camaraderie (https://toughmudder.com/). Workforce Associate Tough Mudder April 2013  –  April 2014  (1 year 1 month) Brooklyn, New York Helped coordinate Tough Mudder’s world-wide volunteer program and event staff teams and supported the recruitment, training, deploying, and retaining of volunteers and event staff members. Workforce Associate Tough Mudder April 2013  –  April 2014  (1 year 1 month) Brooklyn, New York Helped coordinate Tough Mudder’s world-wide volunteer program and event staff teams and supported the recruitment, training, deploying, and retaining of volunteers and event staff members. Internal Communications Coordinator Coach October 2011  –  March 2013  (1 year 6 months) New York, NY • Supported the Internal Communications Team in all employee-centered communications. \n• Worked with departments across the business to translate business critical initiatives into communications accessible to and tailored for colleagues. \n• Managed and facilitated company-wide employee volunteerism activities. Partnered with non-profits and colleagues across the business to create a culture of volunteerism at the company, coordinated logistics and organized and planned volunteer events. Internal Communications Coordinator Coach October 2011  –  March 2013  (1 year 6 months) New York, NY • Supported the Internal Communications Team in all employee-centered communications. \n• Worked with departments across the business to translate business critical initiatives into communications accessible to and tailored for colleagues. \n• Managed and facilitated company-wide employee volunteerism activities. Partnered with non-profits and colleagues across the business to create a culture of volunteerism at the company, coordinated logistics and organized and planned volunteer events. Communications Executive (Contract) Pfizer August 2010  –  August 2011  (1 year 1 month) • Supported Pfizer’s Regional and UK Communications team and Head of Business Operations in a graduate role (contractor) position with short and long-term projects, working with internal and external stakeholders to deliver business critical programs on local and global levels.  \n• Sharing daily responsibility for Press Office to support Pfizer UK’s relationship with external media. Involvement in full-cycle media relations campaigns- creating media lists, press release materials, sell-in, media coverage report, and internal communications program. \n• Supported Communications teams in activities to ensure that Pfizer’s reputation and vision was accurately portrayed through media contacts and branding projects. Created, edited and facilitated internal communication materials for dissemination to over 2,000 employees, using multiple mediums. (Experienced in different internal communication channels, including newsletters, magazine articles, handouts, intranet portal creation, copy and maintenance, and radio programs). Communications Executive (Contract) Pfizer August 2010  –  August 2011  (1 year 1 month) • Supported Pfizer’s Regional and UK Communications team and Head of Business Operations in a graduate role (contractor) position with short and long-term projects, working with internal and external stakeholders to deliver business critical programs on local and global levels.  \n• Sharing daily responsibility for Press Office to support Pfizer UK’s relationship with external media. Involvement in full-cycle media relations campaigns- creating media lists, press release materials, sell-in, media coverage report, and internal communications program. \n• Supported Communications teams in activities to ensure that Pfizer’s reputation and vision was accurately portrayed through media contacts and branding projects. Created, edited and facilitated internal communication materials for dissemination to over 2,000 employees, using multiple mediums. (Experienced in different internal communication channels, including newsletters, magazine articles, handouts, intranet portal creation, copy and maintenance, and radio programs). Intern Planned Parenthood Golden Gate January 2009  –  March 2009  (3 months) • Interned in the Public Affairs and Media/Communications department to draft and edit documents for legislators, helped facilitate volunteer events and supported ongoing projects. Intern Planned Parenthood Golden Gate January 2009  –  March 2009  (3 months) • Interned in the Public Affairs and Media/Communications department to draft and edit documents for legislators, helped facilitate volunteer events and supported ongoing projects. Field Organizer Campaign for Change August 2008  –  November 2008  (4 months) • Trained and recruited volunteers and organized and led meetings. Administrative duties included data input, phone calling and canvassing. Worked about 100 hrs/wk for three months organizing and managing a cadre of 150+ volunteers. \n• Contributed to a 69% voter turnout in the “Near Campus” precincts and a 45% increase in youth votes within the University of Colorado, Boulder district. Field Organizer Campaign for Change August 2008  –  November 2008  (4 months) • Trained and recruited volunteers and organized and led meetings. Administrative duties included data input, phone calling and canvassing. Worked about 100 hrs/wk for three months organizing and managing a cadre of 150+ volunteers. \n• Contributed to a 69% voter turnout in the “Near Campus” precincts and a 45% increase in youth votes within the University of Colorado, Boulder district. Co-Director, Sexual Health Peer Resources Center Stanford University September 2007  –  June 2008  (10 months) • Student-run facility serves nearly 7,000 members of the undergraduate community. During my tenure, the Center received Stanford University’s Dean’s Award for outstanding achievement and contributed to Stanford’s number 1 ranking among American universities on Trojan’s annual Sexual Health Report Card. \n• Led and managed 30 staff and worked with outreach coordinators and financial directors to initiate and implement projects related to improving the sexual health of the collegiate population. Co-Director, Sexual Health Peer Resources Center Stanford University September 2007  –  June 2008  (10 months) • Student-run facility serves nearly 7,000 members of the undergraduate community. During my tenure, the Center received Stanford University’s Dean’s Award for outstanding achievement and contributed to Stanford’s number 1 ranking among American universities on Trojan’s annual Sexual Health Report Card. \n• Led and managed 30 staff and worked with outreach coordinators and financial directors to initiate and implement projects related to improving the sexual health of the collegiate population. Peer Health Educator Stanford University September 2007  –  June 2008  (10 months) • Served as residential staff health resource educator for 250 person dorm and 21 person residential staff. \n• Oversaw peer counseling, health education, dorm programming, basic first aid and referrals. \n• Received top marks in peer performance evaluations. Peer Health Educator Stanford University September 2007  –  June 2008  (10 months) • Served as residential staff health resource educator for 250 person dorm and 21 person residential staff. \n• Oversaw peer counseling, health education, dorm programming, basic first aid and referrals. \n• Received top marks in peer performance evaluations. Skills Media Relations Newsletters Press Releases Nonprofits Internal Communications Editing Program Management Non-profits Leadership Public Relations Community Outreach Management Skills  Media Relations Newsletters Press Releases Nonprofits Internal Communications Editing Program Management Non-profits Leadership Public Relations Community Outreach Management Media Relations Newsletters Press Releases Nonprofits Internal Communications Editing Program Management Non-profits Leadership Public Relations Community Outreach Management Media Relations Newsletters Press Releases Nonprofits Internal Communications Editing Program Management Non-profits Leadership Public Relations Community Outreach Management Education The London School of Economics and Political Science (LSE) MSc,  Organizational and Social Psychology 2009  – 2010 Stanford University Graduate School of Business Certification,  Summer Institute for General Management 2009  – 2009 Stanford University MA,  Communication 2008  – 2009 Stanford University BA,  American Studies , with Honors 2004  – 2008 The Pingry School 2002  – 2004 The London School of Economics and Political Science (LSE) MSc,  Organizational and Social Psychology 2009  – 2010 The London School of Economics and Political Science (LSE) MSc,  Organizational and Social Psychology 2009  – 2010 The London School of Economics and Political Science (LSE) MSc,  Organizational and Social Psychology 2009  – 2010 Stanford University Graduate School of Business Certification,  Summer Institute for General Management 2009  – 2009 Stanford University Graduate School of Business Certification,  Summer Institute for General Management 2009  – 2009 Stanford University Graduate School of Business Certification,  Summer Institute for General Management 2009  – 2009 Stanford University MA,  Communication 2008  – 2009 Stanford University MA,  Communication 2008  – 2009 Stanford University MA,  Communication 2008  – 2009 Stanford University BA,  American Studies , with Honors 2004  – 2008 Stanford University BA,  American Studies , with Honors 2004  – 2008 Stanford University BA,  American Studies , with Honors 2004  – 2008 The Pingry School 2002  – 2004 The Pingry School 2002  – 2004 The Pingry School 2002  – 2004 ", "Summary I am an optometrist set to begin a residency in Primary Care and Low Vision Rehabilitation at the VA Palo Alto Health Care System in July 2014. I am experienced with research and teaching and envision my eventual career to include clinical optometric practice in a variety of practice modes, as well as research and teaching experiences within the field of optometry. Summary I am an optometrist set to begin a residency in Primary Care and Low Vision Rehabilitation at the VA Palo Alto Health Care System in July 2014. I am experienced with research and teaching and envision my eventual career to include clinical optometric practice in a variety of practice modes, as well as research and teaching experiences within the field of optometry. I am an optometrist set to begin a residency in Primary Care and Low Vision Rehabilitation at the VA Palo Alto Health Care System in July 2014. I am experienced with research and teaching and envision my eventual career to include clinical optometric practice in a variety of practice modes, as well as research and teaching experiences within the field of optometry. I am an optometrist set to begin a residency in Primary Care and Low Vision Rehabilitation at the VA Palo Alto Health Care System in July 2014. I am experienced with research and teaching and envision my eventual career to include clinical optometric practice in a variety of practice modes, as well as research and teaching experiences within the field of optometry. Experience Optometry Resident (Primary Care/Low Vision Rehabilitation) VA Palo Alto Health Care System July 2014  – Present (1 year 2 months) San Francisco Bay Area Optometric Intern Southeast Health Center March 2014  –  May 2014  (3 months) San Francisco, CA Provided eye exams and optical services to community health clinic patients. Refined treatment, management, and referral skills while working within the confines of limited resources. Optometric Intern University of California Meredith W. Morgan Eye Center May 2012  –  May 2014  (2 years 1 month) Berkeley, CA Extensive experience in examination, diagnosis, and treatment of a variety of patients in primary care optometry and in specialty clinics such as:  \n \nBinocular Vision  \nOcular Disease  \nContact Lens  \nPediatrics and School Vision Screenings \nLow Vision National Eye Institute Research Trainee Wildsoet Laboratory, University of California, Berkeley May 2011  –  May 2014  (3 years 1 month) San Francisco Bay Area Researched causes and associations of refractive error and utilized optical coherence tomography (OCT) technology to evaluate ocular structures in human subjects. Completed an honors thesis entitled \"Refractive Error and Ocular Parameters - Comparison of Two SD-OCT Systems,\" mentored by Drs. Lisa Ostrin and Christine Wildsoet. Optometric Intern Omni Eye Services January 2014  –  March 2014  (3 months) Greater New York City Area Provided tertiary eye care in a busy referral center with high incidence of ocular disease. Co-management of patient cases with ophthalmologists, including a retinal specialist, pediatric ophthalmologist, a glaucoma and cataract specialist, and oculoplastics specialists. Extensive experience with pre-operative and post-operative care. Optometric Intern Portland Veterans Administration Medical Center October 2013  –  December 2013  (3 months) Vancouver, WA Provided primary optometric care to a largely geriatric population. Enhanced knowledge of treatment and management of ocular disease, and the use of diagnostic technologies such as threshold visual fields and optical coherence tomography. Optometric Intern Castle Family Health Centers, Inc. May 2013  –  August 2013  (4 months) Atwater, CA Provided primary optometric care in a low-income Hispanic population ranging in age from infants to geriatric patients with extensive exposure to ocular disease, including glaucoma, diabetes, and macular degeneration. Expanded skills in optometric Spanish and diagnosis and treatment of refractive error, binocular vision, and ocular disease. Presented case reports and journal article summaries at weekly seminars. Graduate Student Instructor UC Berkeley January 2011  –  May 2011  (5 months) San Francisco Bay Area Taught discussion sections and office hours for the undergraduate course Biology 1A: General Biology. Research Student, Devers Eye Institute Legacy Health June 2007  –  August 2010  (3 years 3 months) Portland, Oregon Area Investigated biological factors affecting the onset and course of glaucoma. Research Intern Oregon Nikkei Endowment June 2009  –  August 2009  (3 months) Portland, Oregon Area Recipient of Stanford University Comparative Studies in Race and Ethnicity Community Research Summer Internship grant to conduct research for an exhibit at a Japanese American history museum. Peer Health Educator Stanford University September 2008  –  June 2009  (10 months) San Francisco Bay Area Served as the health specialist on the residential staff of a dormitory with 85 freshman residents. High School Intern/Teller Washington Mutual July 2004  –  August 2006  (2 years 2 months) Portland, Oregon Area Provided customer service and performed financial transactions in a retail bank setting. Homework Helpline Tutor/Hostess Evergreen School District May 2003  –  June 2006  (3 years 2 months) Portland, Oregon Area Created and presented educational segments and lessons for Homework Helpline, a live cable access television show. Optometry Resident (Primary Care/Low Vision Rehabilitation) VA Palo Alto Health Care System July 2014  – Present (1 year 2 months) San Francisco Bay Area Optometry Resident (Primary Care/Low Vision Rehabilitation) VA Palo Alto Health Care System July 2014  – Present (1 year 2 months) San Francisco Bay Area Optometric Intern Southeast Health Center March 2014  –  May 2014  (3 months) San Francisco, CA Provided eye exams and optical services to community health clinic patients. Refined treatment, management, and referral skills while working within the confines of limited resources. Optometric Intern Southeast Health Center March 2014  –  May 2014  (3 months) San Francisco, CA Provided eye exams and optical services to community health clinic patients. Refined treatment, management, and referral skills while working within the confines of limited resources. Optometric Intern University of California Meredith W. Morgan Eye Center May 2012  –  May 2014  (2 years 1 month) Berkeley, CA Extensive experience in examination, diagnosis, and treatment of a variety of patients in primary care optometry and in specialty clinics such as:  \n \nBinocular Vision  \nOcular Disease  \nContact Lens  \nPediatrics and School Vision Screenings \nLow Vision Optometric Intern University of California Meredith W. Morgan Eye Center May 2012  –  May 2014  (2 years 1 month) Berkeley, CA Extensive experience in examination, diagnosis, and treatment of a variety of patients in primary care optometry and in specialty clinics such as:  \n \nBinocular Vision  \nOcular Disease  \nContact Lens  \nPediatrics and School Vision Screenings \nLow Vision National Eye Institute Research Trainee Wildsoet Laboratory, University of California, Berkeley May 2011  –  May 2014  (3 years 1 month) San Francisco Bay Area Researched causes and associations of refractive error and utilized optical coherence tomography (OCT) technology to evaluate ocular structures in human subjects. Completed an honors thesis entitled \"Refractive Error and Ocular Parameters - Comparison of Two SD-OCT Systems,\" mentored by Drs. Lisa Ostrin and Christine Wildsoet. National Eye Institute Research Trainee Wildsoet Laboratory, University of California, Berkeley May 2011  –  May 2014  (3 years 1 month) San Francisco Bay Area Researched causes and associations of refractive error and utilized optical coherence tomography (OCT) technology to evaluate ocular structures in human subjects. Completed an honors thesis entitled \"Refractive Error and Ocular Parameters - Comparison of Two SD-OCT Systems,\" mentored by Drs. Lisa Ostrin and Christine Wildsoet. Optometric Intern Omni Eye Services January 2014  –  March 2014  (3 months) Greater New York City Area Provided tertiary eye care in a busy referral center with high incidence of ocular disease. Co-management of patient cases with ophthalmologists, including a retinal specialist, pediatric ophthalmologist, a glaucoma and cataract specialist, and oculoplastics specialists. Extensive experience with pre-operative and post-operative care. Optometric Intern Omni Eye Services January 2014  –  March 2014  (3 months) Greater New York City Area Provided tertiary eye care in a busy referral center with high incidence of ocular disease. Co-management of patient cases with ophthalmologists, including a retinal specialist, pediatric ophthalmologist, a glaucoma and cataract specialist, and oculoplastics specialists. Extensive experience with pre-operative and post-operative care. Optometric Intern Portland Veterans Administration Medical Center October 2013  –  December 2013  (3 months) Vancouver, WA Provided primary optometric care to a largely geriatric population. Enhanced knowledge of treatment and management of ocular disease, and the use of diagnostic technologies such as threshold visual fields and optical coherence tomography. Optometric Intern Portland Veterans Administration Medical Center October 2013  –  December 2013  (3 months) Vancouver, WA Provided primary optometric care to a largely geriatric population. Enhanced knowledge of treatment and management of ocular disease, and the use of diagnostic technologies such as threshold visual fields and optical coherence tomography. Optometric Intern Castle Family Health Centers, Inc. May 2013  –  August 2013  (4 months) Atwater, CA Provided primary optometric care in a low-income Hispanic population ranging in age from infants to geriatric patients with extensive exposure to ocular disease, including glaucoma, diabetes, and macular degeneration. Expanded skills in optometric Spanish and diagnosis and treatment of refractive error, binocular vision, and ocular disease. Presented case reports and journal article summaries at weekly seminars. Optometric Intern Castle Family Health Centers, Inc. May 2013  –  August 2013  (4 months) Atwater, CA Provided primary optometric care in a low-income Hispanic population ranging in age from infants to geriatric patients with extensive exposure to ocular disease, including glaucoma, diabetes, and macular degeneration. Expanded skills in optometric Spanish and diagnosis and treatment of refractive error, binocular vision, and ocular disease. Presented case reports and journal article summaries at weekly seminars. Graduate Student Instructor UC Berkeley January 2011  –  May 2011  (5 months) San Francisco Bay Area Taught discussion sections and office hours for the undergraduate course Biology 1A: General Biology. Graduate Student Instructor UC Berkeley January 2011  –  May 2011  (5 months) San Francisco Bay Area Taught discussion sections and office hours for the undergraduate course Biology 1A: General Biology. Research Student, Devers Eye Institute Legacy Health June 2007  –  August 2010  (3 years 3 months) Portland, Oregon Area Investigated biological factors affecting the onset and course of glaucoma. Research Student, Devers Eye Institute Legacy Health June 2007  –  August 2010  (3 years 3 months) Portland, Oregon Area Investigated biological factors affecting the onset and course of glaucoma. Research Intern Oregon Nikkei Endowment June 2009  –  August 2009  (3 months) Portland, Oregon Area Recipient of Stanford University Comparative Studies in Race and Ethnicity Community Research Summer Internship grant to conduct research for an exhibit at a Japanese American history museum. Research Intern Oregon Nikkei Endowment June 2009  –  August 2009  (3 months) Portland, Oregon Area Recipient of Stanford University Comparative Studies in Race and Ethnicity Community Research Summer Internship grant to conduct research for an exhibit at a Japanese American history museum. Peer Health Educator Stanford University September 2008  –  June 2009  (10 months) San Francisco Bay Area Served as the health specialist on the residential staff of a dormitory with 85 freshman residents. Peer Health Educator Stanford University September 2008  –  June 2009  (10 months) San Francisco Bay Area Served as the health specialist on the residential staff of a dormitory with 85 freshman residents. High School Intern/Teller Washington Mutual July 2004  –  August 2006  (2 years 2 months) Portland, Oregon Area Provided customer service and performed financial transactions in a retail bank setting. High School Intern/Teller Washington Mutual July 2004  –  August 2006  (2 years 2 months) Portland, Oregon Area Provided customer service and performed financial transactions in a retail bank setting. Homework Helpline Tutor/Hostess Evergreen School District May 2003  –  June 2006  (3 years 2 months) Portland, Oregon Area Created and presented educational segments and lessons for Homework Helpline, a live cable access television show. Homework Helpline Tutor/Hostess Evergreen School District May 2003  –  June 2006  (3 years 2 months) Portland, Oregon Area Created and presented educational segments and lessons for Homework Helpline, a live cable access television show. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Research Eye Exams Writing Teaching Microsoft Office Clinical Research Data Analysis Optometry Skills  Research Eye Exams Writing Teaching Microsoft Office Clinical Research Data Analysis Optometry Research Eye Exams Writing Teaching Microsoft Office Clinical Research Data Analysis Optometry Research Eye Exams Writing Teaching Microsoft Office Clinical Research Data Analysis Optometry Education University of California, Berkeley Doctor of Optometry (OD),  Optometry 2010  – 2014 Graduated in May 2014 with Honors in Research. University of California Optometric Student Association Secretary, 2011-2013. Student American Academy of Optometry Newsletter Editor, 2012-2013. Student American Academy of Optometry Educational Co-Director, 2011-2012. Class of 2014 Secretary, 2010-2011. Student American Academy of Optometry Fundraising Coordinator, 2010-2011. Activities and Societies:  University of California Optometric Student Association ,  Student Chapter of the American Academy of Optometry ,  Berkeley Optometry Ambassador ,  Beta Sigma Kappa Optometric Honor Society ,  OJOS Optometric Spanish Club ,  Nikkei Student Union Stanford University Bachelor of Arts and Science (BAS),  Biology and Asian American Studies 2006  – 2010 Co-led a student-initiated course entitled \"Japanese American Internment and the Manzanar Pilgrimage,\" 2009-2010. Student intern at the Vaden Health Center Department of Physical Therapy, 2008-2009. Assisted with the Stanford University School of Medicine research study, \"Potential Genetic Risk Factors for Open-Angle Glaucoma,\" 2008-2009. Activities and Societies:  Pilipino American Student Union ,  Kayumanggi Filipino Dance Troupe ,  Peer Health Educator ,  Pacific Free Clinic ,  Henry's Place Science Mentorship ,  Campus Girl Scouts ,  American Red Cross Club ,  Stanford Wind Ensemble University of California, Berkeley Doctor of Optometry (OD),  Optometry 2010  – 2014 Graduated in May 2014 with Honors in Research. University of California Optometric Student Association Secretary, 2011-2013. Student American Academy of Optometry Newsletter Editor, 2012-2013. Student American Academy of Optometry Educational Co-Director, 2011-2012. Class of 2014 Secretary, 2010-2011. Student American Academy of Optometry Fundraising Coordinator, 2010-2011. Activities and Societies:  University of California Optometric Student Association ,  Student Chapter of the American Academy of Optometry ,  Berkeley Optometry Ambassador ,  Beta Sigma Kappa Optometric Honor Society ,  OJOS Optometric Spanish Club ,  Nikkei Student Union University of California, Berkeley Doctor of Optometry (OD),  Optometry 2010  – 2014 Graduated in May 2014 with Honors in Research. University of California Optometric Student Association Secretary, 2011-2013. Student American Academy of Optometry Newsletter Editor, 2012-2013. Student American Academy of Optometry Educational Co-Director, 2011-2012. Class of 2014 Secretary, 2010-2011. Student American Academy of Optometry Fundraising Coordinator, 2010-2011. Activities and Societies:  University of California Optometric Student Association ,  Student Chapter of the American Academy of Optometry ,  Berkeley Optometry Ambassador ,  Beta Sigma Kappa Optometric Honor Society ,  OJOS Optometric Spanish Club ,  Nikkei Student Union University of California, Berkeley Doctor of Optometry (OD),  Optometry 2010  – 2014 Graduated in May 2014 with Honors in Research. University of California Optometric Student Association Secretary, 2011-2013. Student American Academy of Optometry Newsletter Editor, 2012-2013. Student American Academy of Optometry Educational Co-Director, 2011-2012. Class of 2014 Secretary, 2010-2011. Student American Academy of Optometry Fundraising Coordinator, 2010-2011. Activities and Societies:  University of California Optometric Student Association ,  Student Chapter of the American Academy of Optometry ,  Berkeley Optometry Ambassador ,  Beta Sigma Kappa Optometric Honor Society ,  OJOS Optometric Spanish Club ,  Nikkei Student Union Stanford University Bachelor of Arts and Science (BAS),  Biology and Asian American Studies 2006  – 2010 Co-led a student-initiated course entitled \"Japanese American Internment and the Manzanar Pilgrimage,\" 2009-2010. Student intern at the Vaden Health Center Department of Physical Therapy, 2008-2009. Assisted with the Stanford University School of Medicine research study, \"Potential Genetic Risk Factors for Open-Angle Glaucoma,\" 2008-2009. Activities and Societies:  Pilipino American Student Union ,  Kayumanggi Filipino Dance Troupe ,  Peer Health Educator ,  Pacific Free Clinic ,  Henry's Place Science Mentorship ,  Campus Girl Scouts ,  American Red Cross Club ,  Stanford Wind Ensemble Stanford University Bachelor of Arts and Science (BAS),  Biology and Asian American Studies 2006  – 2010 Co-led a student-initiated course entitled \"Japanese American Internment and the Manzanar Pilgrimage,\" 2009-2010. Student intern at the Vaden Health Center Department of Physical Therapy, 2008-2009. Assisted with the Stanford University School of Medicine research study, \"Potential Genetic Risk Factors for Open-Angle Glaucoma,\" 2008-2009. Activities and Societies:  Pilipino American Student Union ,  Kayumanggi Filipino Dance Troupe ,  Peer Health Educator ,  Pacific Free Clinic ,  Henry's Place Science Mentorship ,  Campus Girl Scouts ,  American Red Cross Club ,  Stanford Wind Ensemble Stanford University Bachelor of Arts and Science (BAS),  Biology and Asian American Studies 2006  – 2010 Co-led a student-initiated course entitled \"Japanese American Internment and the Manzanar Pilgrimage,\" 2009-2010. Student intern at the Vaden Health Center Department of Physical Therapy, 2008-2009. Assisted with the Stanford University School of Medicine research study, \"Potential Genetic Risk Factors for Open-Angle Glaucoma,\" 2008-2009. Activities and Societies:  Pilipino American Student Union ,  Kayumanggi Filipino Dance Troupe ,  Peer Health Educator ,  Pacific Free Clinic ,  Henry's Place Science Mentorship ,  Campus Girl Scouts ,  American Red Cross Club ,  Stanford Wind Ensemble Honors & Awards Additional Honors & Awards UC Berkeley School of Optometry Graduation with Honors in Research, 2014 \nUC Berkeley School of Optometry Low Vision Clinic Award, 2014 \nRobert and Jeanene Greer Professional Student Support Fund, 2014 \nVistakon Student Travel Fellowship to the American Academy of Optometry Meeting, 2013 \nJohn R. and Norma M. Austin Optometry Professional Student Support Fund, 2013 \nRobert C. Byrd Honors Scholarship, 2006 \nSouthwest Washington Medical Center Health Career Scholarship, 2006 \nPortland Japanese American Citizens League Scholarship, 2006 \nGirl Scout Gold Award, 2005 Additional Honors & Awards UC Berkeley School of Optometry Graduation with Honors in Research, 2014 \nUC Berkeley School of Optometry Low Vision Clinic Award, 2014 \nRobert and Jeanene Greer Professional Student Support Fund, 2014 \nVistakon Student Travel Fellowship to the American Academy of Optometry Meeting, 2013 \nJohn R. and Norma M. Austin Optometry Professional Student Support Fund, 2013 \nRobert C. Byrd Honors Scholarship, 2006 \nSouthwest Washington Medical Center Health Career Scholarship, 2006 \nPortland Japanese American Citizens League Scholarship, 2006 \nGirl Scout Gold Award, 2005 Additional Honors & Awards UC Berkeley School of Optometry Graduation with Honors in Research, 2014 \nUC Berkeley School of Optometry Low Vision Clinic Award, 2014 \nRobert and Jeanene Greer Professional Student Support Fund, 2014 \nVistakon Student Travel Fellowship to the American Academy of Optometry Meeting, 2013 \nJohn R. and Norma M. Austin Optometry Professional Student Support Fund, 2013 \nRobert C. Byrd Honors Scholarship, 2006 \nSouthwest Washington Medical Center Health Career Scholarship, 2006 \nPortland Japanese American Citizens League Scholarship, 2006 \nGirl Scout Gold Award, 2005 Additional Honors & Awards UC Berkeley School of Optometry Graduation with Honors in Research, 2014 \nUC Berkeley School of Optometry Low Vision Clinic Award, 2014 \nRobert and Jeanene Greer Professional Student Support Fund, 2014 \nVistakon Student Travel Fellowship to the American Academy of Optometry Meeting, 2013 \nJohn R. and Norma M. Austin Optometry Professional Student Support Fund, 2013 \nRobert C. Byrd Honors Scholarship, 2006 \nSouthwest Washington Medical Center Health Career Scholarship, 2006 \nPortland Japanese American Citizens League Scholarship, 2006 \nGirl Scout Gold Award, 2005 ", "Experience Family Resource Coordinator Lucille Packard Children's Hospital at Stanford July 2012  –  June 2014  (2 years) Assistant Teacher Bing Nursery School June 2011  –  June 2012  (1 year 1 month) Peer Health Educator Stanford University April 2011  –  June 2012  (1 year 3 months) Family Resource Coordinator Lucille Packard Children's Hospital at Stanford July 2012  –  June 2014  (2 years) Family Resource Coordinator Lucille Packard Children's Hospital at Stanford July 2012  –  June 2014  (2 years) Assistant Teacher Bing Nursery School June 2011  –  June 2012  (1 year 1 month) Assistant Teacher Bing Nursery School June 2011  –  June 2012  (1 year 1 month) Peer Health Educator Stanford University April 2011  –  June 2012  (1 year 3 months) Peer Health Educator Stanford University April 2011  –  June 2012  (1 year 3 months) Languages Spanish Spanish Spanish Skills Spanish-speaking Japanese Communication Skills Health Education Child Development Early Childhood... Event Planning Project Planning Microsoft Word PowerPoint Adolescent Health Sexuality Education Student Counseling Biology Skills  Spanish-speaking Japanese Communication Skills Health Education Child Development Early Childhood... Event Planning Project Planning Microsoft Word PowerPoint Adolescent Health Sexuality Education Student Counseling Biology Spanish-speaking Japanese Communication Skills Health Education Child Development Early Childhood... Event Planning Project Planning Microsoft Word PowerPoint Adolescent Health Sexuality Education Student Counseling Biology Spanish-speaking Japanese Communication Skills Health Education Child Development Early Childhood... Event Planning Project Planning Microsoft Word PowerPoint Adolescent Health Sexuality Education Student Counseling Biology Education Columbia University in the City of New York Postbacc Pre Medical Certificate 2014  – 2016 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Everett Alvarez High School Columbia University in the City of New York Postbacc Pre Medical Certificate 2014  – 2016 Columbia University in the City of New York Postbacc Pre Medical Certificate 2014  – 2016 Columbia University in the City of New York Postbacc Pre Medical Certificate 2014  – 2016 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Stanford University Bachelor of Arts (B.A.),  Human Biology 2008  – 2012 Everett Alvarez High School Everett Alvarez High School Everett Alvarez High School ", "Experience Registered Dietitian and Founder Jae Berman Nutrition January 2006  – Present (9 years 8 months) San Francisco Health Educator Stanford University School of Medicine September 2013  – Present (2 years) Sports Dietitian University of San Francisco January 2012  – Present (3 years 8 months) Registered Dietitian and Personal Trainer Bay Club San Francisco 2007  – Present (8 years) Registered Dietitian and Founder Jae Berman Nutrition January 2006  – Present (9 years 8 months) San Francisco Registered Dietitian and Founder Jae Berman Nutrition January 2006  – Present (9 years 8 months) San Francisco Health Educator Stanford University School of Medicine September 2013  – Present (2 years) Health Educator Stanford University School of Medicine September 2013  – Present (2 years) Sports Dietitian University of San Francisco January 2012  – Present (3 years 8 months) Sports Dietitian University of San Francisco January 2012  – Present (3 years 8 months) Registered Dietitian and Personal Trainer Bay Club San Francisco 2007  – Present (8 years) Registered Dietitian and Personal Trainer Bay Club San Francisco 2007  – Present (8 years) Skills Strength Training Fitness Training Fitness Nutritional Counseling Nutrition Personal Training Wellness Public Speaking Health Education Exercise Physiology Yoga Social Media Event Planning Nutrition Education Health Promotion Rehabilitation Research Holistic Health Athletics See 4+     See less Skills  Strength Training Fitness Training Fitness Nutritional Counseling Nutrition Personal Training Wellness Public Speaking Health Education Exercise Physiology Yoga Social Media Event Planning Nutrition Education Health Promotion Rehabilitation Research Holistic Health Athletics See 4+     See less Strength Training Fitness Training Fitness Nutritional Counseling Nutrition Personal Training Wellness Public Speaking Health Education Exercise Physiology Yoga Social Media Event Planning Nutrition Education Health Promotion Rehabilitation Research Holistic Health Athletics See 4+     See less Strength Training Fitness Training Fitness Nutritional Counseling Nutrition Personal Training Wellness Public Speaking Health Education Exercise Physiology Yoga Social Media Event Planning Nutrition Education Health Promotion Rehabilitation Research Holistic Health Athletics See 4+     See less Education Teachers College of Columbia University MS,  Applied Physiology and Nutrition 2003  – 2006 University of California, San Francisco Dietetic Internship 2006  – 2007 University of California, San Diego B.S.,  Management Science 1996  – 2000 Teachers College of Columbia University MS,  Applied Physiology and Nutrition 2003  – 2006 Teachers College of Columbia University MS,  Applied Physiology and Nutrition 2003  – 2006 Teachers College of Columbia University MS,  Applied Physiology and Nutrition 2003  – 2006 University of California, San Francisco Dietetic Internship 2006  – 2007 University of California, San Francisco Dietetic Internship 2006  – 2007 University of California, San Francisco Dietetic Internship 2006  – 2007 University of California, San Diego B.S.,  Management Science 1996  – 2000 University of California, San Diego B.S.,  Management Science 1996  – 2000 University of California, San Diego B.S.,  Management Science 1996  – 2000 ", "Experience Social Media Coordinator Wetpaint January 2015  – Present (8 months) Greater New York City Area - Distributes Wetpaint Entertainment content on Facebook, Twitter and Instagram to several target audiences, driving 500,000-1 million organic Facebook clicks per day to Wetpaint landing pages.  \n- Tracks performance of post activity and reports weekly results. \n- Launched Empire social media assets, which has gained 120,000+ fans to date, majority gained organically. \n- Successfully launched Wetpaint Snapchat account and acquired 200+ followers.  \n- Act in editor capacity to pitch traffic driving content for reality TV and urban entertainment audiences. \n- Owns social campaigns and initiatives that include ad trafficking, sponsored video, and driving Viggle platform registrations.  \n Freelance Marketing Consultant Creative Circle & Independent Freelancing May 2014  –  December 2014  (8 months) New York, New York Creative Circle duties include:  \n- Analyzing social media data using tools such as Crowdbooster and Radian 6  \n- Compiling data into Excel graphs and creating client-facing presentations \nIndependent freelancing include:  \n- Social media marketing for NYC Guesthouse  \n- Research and transcribing data Marketing Assistant Shared Vision Marketing January 2013  –  January 2014  (1 year 1 month) Greater Atlanta Area - Assisted Account Executive with day-to-day client management needs. \n- Researched trends on consumer behavior developing insights from data that is used to create and deliver presentations to team members. \n- Collaborated across teams and with external partners to uncover and incorporate additional data and insights to develop strategic social media data to implement in a time sensitive environment. \n- Delivered weekly and monthly social media metrics and analysis to clients and external partners. \n- Led the development of episodic engagement plans on a weekly basis for the TV show Master of the Mix, where social media assets follower count have seen great increases. \n- Reviewed Master of the Mix episode rough cuts and fine cuts for legal and content issues and from the viewpoint of target demographic.  \n- Collaborated in the development and deployment of the social media plan for Master of the Mix show activation at Winter Music Conference in Miami, FL. \n- Identified, researched, and recommended the social media tracking tool Simply Measured that was later adopted by Shared Vision Marketing. Social Media Intern TraMaí Entertainment Inc January 2011  –  January 2013  (2 years 1 month) Oakland, CA - Used HootSuite application to develop, update, and compile internal user data and metrics from the California Music Industry Summit social media web pages, which include Facebook, Twitter, and LinkedIn. \n- Assisted with stage managerial duties that included overseeing logistics during the California Music Industry Summit. Contributor soulhead.com May 2012  –  December 2012  (8 months) - Submissions include: Track-by-track reviews of newly released albums, Concert and festival guide for the summer 2012 season featuring 25 events on the East Coast. (http://www.soulhead.com/?s=jabari)  \n- Utilized WordPress to format and document blog posts. Student Manager Tressider Meeting Services January 2010  –  June 2012  (2 years 6 months) Stanford, CA - Responded to faculty, staff, students, and external guests for services related to the set-up of meeting rooms, conferences, and special events.  \n- Oversaw the implementation of and completion of guest requests. \n- Managed student team to see that requests are met. Peer Health Educator Stanford University Residential Education January 2010  –  June 2012  (2 years 6 months) Stanford, CA - Residential staff specialist who promotes student health, wellness, and safety initiatives within the dorm through creation of marketing campaigns and programs.  \n- Developed and implemented a series of cross platform health campaigns individually within the dorm and campus-wide with a team of 30 other Peer Health Educators. Artists & Repertoire Intern EMI Music Group July 2010  –  August 2010  (2 months) New York, NY - Traveled to diverse music venues across New York City to source and evaluate independent music artists. \n- Complied reports to deliver to A&R executives.  \n- Assisted with the management of international recording artists within the record company. Host/Producer KZSU 90.1 FM April 2009  –  January 2010  (10 months) - Produced and hosted over 30+ weekly shows that focused on hip-hop trends across the United States. \n- Held in-studio interviews with up and coming artists. \n- Complied written reviews of music across genres. Social Media Coordinator Wetpaint January 2015  – Present (8 months) Greater New York City Area - Distributes Wetpaint Entertainment content on Facebook, Twitter and Instagram to several target audiences, driving 500,000-1 million organic Facebook clicks per day to Wetpaint landing pages.  \n- Tracks performance of post activity and reports weekly results. \n- Launched Empire social media assets, which has gained 120,000+ fans to date, majority gained organically. \n- Successfully launched Wetpaint Snapchat account and acquired 200+ followers.  \n- Act in editor capacity to pitch traffic driving content for reality TV and urban entertainment audiences. \n- Owns social campaigns and initiatives that include ad trafficking, sponsored video, and driving Viggle platform registrations.  \n Social Media Coordinator Wetpaint January 2015  – Present (8 months) Greater New York City Area - Distributes Wetpaint Entertainment content on Facebook, Twitter and Instagram to several target audiences, driving 500,000-1 million organic Facebook clicks per day to Wetpaint landing pages.  \n- Tracks performance of post activity and reports weekly results. \n- Launched Empire social media assets, which has gained 120,000+ fans to date, majority gained organically. \n- Successfully launched Wetpaint Snapchat account and acquired 200+ followers.  \n- Act in editor capacity to pitch traffic driving content for reality TV and urban entertainment audiences. \n- Owns social campaigns and initiatives that include ad trafficking, sponsored video, and driving Viggle platform registrations.  \n Freelance Marketing Consultant Creative Circle & Independent Freelancing May 2014  –  December 2014  (8 months) New York, New York Creative Circle duties include:  \n- Analyzing social media data using tools such as Crowdbooster and Radian 6  \n- Compiling data into Excel graphs and creating client-facing presentations \nIndependent freelancing include:  \n- Social media marketing for NYC Guesthouse  \n- Research and transcribing data Freelance Marketing Consultant Creative Circle & Independent Freelancing May 2014  –  December 2014  (8 months) New York, New York Creative Circle duties include:  \n- Analyzing social media data using tools such as Crowdbooster and Radian 6  \n- Compiling data into Excel graphs and creating client-facing presentations \nIndependent freelancing include:  \n- Social media marketing for NYC Guesthouse  \n- Research and transcribing data Marketing Assistant Shared Vision Marketing January 2013  –  January 2014  (1 year 1 month) Greater Atlanta Area - Assisted Account Executive with day-to-day client management needs. \n- Researched trends on consumer behavior developing insights from data that is used to create and deliver presentations to team members. \n- Collaborated across teams and with external partners to uncover and incorporate additional data and insights to develop strategic social media data to implement in a time sensitive environment. \n- Delivered weekly and monthly social media metrics and analysis to clients and external partners. \n- Led the development of episodic engagement plans on a weekly basis for the TV show Master of the Mix, where social media assets follower count have seen great increases. \n- Reviewed Master of the Mix episode rough cuts and fine cuts for legal and content issues and from the viewpoint of target demographic.  \n- Collaborated in the development and deployment of the social media plan for Master of the Mix show activation at Winter Music Conference in Miami, FL. \n- Identified, researched, and recommended the social media tracking tool Simply Measured that was later adopted by Shared Vision Marketing. Marketing Assistant Shared Vision Marketing January 2013  –  January 2014  (1 year 1 month) Greater Atlanta Area - Assisted Account Executive with day-to-day client management needs. \n- Researched trends on consumer behavior developing insights from data that is used to create and deliver presentations to team members. \n- Collaborated across teams and with external partners to uncover and incorporate additional data and insights to develop strategic social media data to implement in a time sensitive environment. \n- Delivered weekly and monthly social media metrics and analysis to clients and external partners. \n- Led the development of episodic engagement plans on a weekly basis for the TV show Master of the Mix, where social media assets follower count have seen great increases. \n- Reviewed Master of the Mix episode rough cuts and fine cuts for legal and content issues and from the viewpoint of target demographic.  \n- Collaborated in the development and deployment of the social media plan for Master of the Mix show activation at Winter Music Conference in Miami, FL. \n- Identified, researched, and recommended the social media tracking tool Simply Measured that was later adopted by Shared Vision Marketing. Social Media Intern TraMaí Entertainment Inc January 2011  –  January 2013  (2 years 1 month) Oakland, CA - Used HootSuite application to develop, update, and compile internal user data and metrics from the California Music Industry Summit social media web pages, which include Facebook, Twitter, and LinkedIn. \n- Assisted with stage managerial duties that included overseeing logistics during the California Music Industry Summit. Social Media Intern TraMaí Entertainment Inc January 2011  –  January 2013  (2 years 1 month) Oakland, CA - Used HootSuite application to develop, update, and compile internal user data and metrics from the California Music Industry Summit social media web pages, which include Facebook, Twitter, and LinkedIn. \n- Assisted with stage managerial duties that included overseeing logistics during the California Music Industry Summit. Contributor soulhead.com May 2012  –  December 2012  (8 months) - Submissions include: Track-by-track reviews of newly released albums, Concert and festival guide for the summer 2012 season featuring 25 events on the East Coast. (http://www.soulhead.com/?s=jabari)  \n- Utilized WordPress to format and document blog posts. Contributor soulhead.com May 2012  –  December 2012  (8 months) - Submissions include: Track-by-track reviews of newly released albums, Concert and festival guide for the summer 2012 season featuring 25 events on the East Coast. (http://www.soulhead.com/?s=jabari)  \n- Utilized WordPress to format and document blog posts. Student Manager Tressider Meeting Services January 2010  –  June 2012  (2 years 6 months) Stanford, CA - Responded to faculty, staff, students, and external guests for services related to the set-up of meeting rooms, conferences, and special events.  \n- Oversaw the implementation of and completion of guest requests. \n- Managed student team to see that requests are met. Student Manager Tressider Meeting Services January 2010  –  June 2012  (2 years 6 months) Stanford, CA - Responded to faculty, staff, students, and external guests for services related to the set-up of meeting rooms, conferences, and special events.  \n- Oversaw the implementation of and completion of guest requests. \n- Managed student team to see that requests are met. Peer Health Educator Stanford University Residential Education January 2010  –  June 2012  (2 years 6 months) Stanford, CA - Residential staff specialist who promotes student health, wellness, and safety initiatives within the dorm through creation of marketing campaigns and programs.  \n- Developed and implemented a series of cross platform health campaigns individually within the dorm and campus-wide with a team of 30 other Peer Health Educators. Peer Health Educator Stanford University Residential Education January 2010  –  June 2012  (2 years 6 months) Stanford, CA - Residential staff specialist who promotes student health, wellness, and safety initiatives within the dorm through creation of marketing campaigns and programs.  \n- Developed and implemented a series of cross platform health campaigns individually within the dorm and campus-wide with a team of 30 other Peer Health Educators. Artists & Repertoire Intern EMI Music Group July 2010  –  August 2010  (2 months) New York, NY - Traveled to diverse music venues across New York City to source and evaluate independent music artists. \n- Complied reports to deliver to A&R executives.  \n- Assisted with the management of international recording artists within the record company. Artists & Repertoire Intern EMI Music Group July 2010  –  August 2010  (2 months) New York, NY - Traveled to diverse music venues across New York City to source and evaluate independent music artists. \n- Complied reports to deliver to A&R executives.  \n- Assisted with the management of international recording artists within the record company. Host/Producer KZSU 90.1 FM April 2009  –  January 2010  (10 months) - Produced and hosted over 30+ weekly shows that focused on hip-hop trends across the United States. \n- Held in-studio interviews with up and coming artists. \n- Complied written reviews of music across genres. Host/Producer KZSU 90.1 FM April 2009  –  January 2010  (10 months) - Produced and hosted over 30+ weekly shows that focused on hip-hop trends across the United States. \n- Held in-studio interviews with up and coming artists. \n- Complied written reviews of music across genres. Skills Social Media Marketing Social Media Blogging Social Networking Event Planning Wordpress Facebook Market Research Event Management Marketing Digital Strategy Music Management Data Analysis WordPress Digital Marketing See 1+     See less Skills  Social Media Marketing Social Media Blogging Social Networking Event Planning Wordpress Facebook Market Research Event Management Marketing Digital Strategy Music Management Data Analysis WordPress Digital Marketing See 1+     See less Social Media Marketing Social Media Blogging Social Networking Event Planning Wordpress Facebook Market Research Event Management Marketing Digital Strategy Music Management Data Analysis WordPress Digital Marketing See 1+     See less Social Media Marketing Social Media Blogging Social Networking Event Planning Wordpress Facebook Market Research Event Management Marketing Digital Strategy Music Management Data Analysis WordPress Digital Marketing See 1+     See less Education Stanford University B.A,  Science; Work , Technology, and Social Organizations 2008  – 2012 Activities and Societies:  National Society of Black Engineers Stanford University B.A,  Science; Work , Technology, and Social Organizations 2008  – 2012 Activities and Societies:  National Society of Black Engineers Stanford University B.A,  Science; Work , Technology, and Social Organizations 2008  – 2012 Activities and Societies:  National Society of Black Engineers Stanford University B.A,  Science; Work , Technology, and Social Organizations 2008  – 2012 Activities and Societies:  National Society of Black Engineers ", "Summary I am dedicated working with communities and individuals to eliminate trends of chronic disease at the point of care and through reform of health systems. I seek to develop expertise as a clinician and a health system administrator and use my expertise to reduce health barriers in underserved communities within the United States. Summary I am dedicated working with communities and individuals to eliminate trends of chronic disease at the point of care and through reform of health systems. I seek to develop expertise as a clinician and a health system administrator and use my expertise to reduce health barriers in underserved communities within the United States. I am dedicated working with communities and individuals to eliminate trends of chronic disease at the point of care and through reform of health systems. I seek to develop expertise as a clinician and a health system administrator and use my expertise to reduce health barriers in underserved communities within the United States. I am dedicated working with communities and individuals to eliminate trends of chronic disease at the point of care and through reform of health systems. I seek to develop expertise as a clinician and a health system administrator and use my expertise to reduce health barriers in underserved communities within the United States. Experience John Gardner Public Service Fellow Stanford University March 2013  – Present (2 years 6 months) Baltimore, Maryland Area As a Gardner Fellow, working toward reducing health disparities in Maryland through the Maryland Department of Health and Mental Hygiene under current Secretary of the Health Department Dr. Joshua Sharfstein. Current responsibilities include streamlining implementation of Health Enterprise Zone project by assessing reporting ability of grantees and developing strategies to improve capacity while reducing cost. Office of Alcohol Policy and Education Intern Stanford Office of Alcohol Policy and Education July 2012  – Present (3 years 2 months) As an Office of Alcohol Policy and Education Intern, responsibilities include designing student centered alcohol education programming, organizing and participating in a yearly survey of student drinking habits, running the 21st birthday behavioral change research project, and teaching incoming freshmen about how to drink responsibly through dorm presentations. Stanford Community Health Advocacy Fellow MayView Community Health Center September 2011  – Present (4 years) MayView Community Health Center 270 Grant Ave. Palo Alto, CA 94306 As a patient advocate, chief responsibility is ensuring that patients' chief complaints are heard and that their clinic experience is satisfying. Additionally advocates, assist physicians in understanding and communicating with Spanish speaking patients, take chief complaints and vital statistics, implement a yearly progress report and link patients with necessary social services, and check with patients at the end of clinic visits to ensure an understanding of the doctor's proscription. Chief Managing Officer African American Mentorship Program September 2011  – Present (4 years) Stanford University As chief marketing officer, responsibilities include maintaining contact with a network of medical professionals that constitute our mentors, ensuring that they stay in contact with their mentees, and organizing educational and inspirational programming that informs mentees about the challenges and rewards of the pre-medical process and how to gain the most through their mentorship experience Peer Health Educator Stanford University September 2012  –  June 2013  (10 months) Junipero Dormitory As a Peer Health Educator, responsibilities include triaging health emergencies, designing programming to encourage positive and healthy behavior and create positive behavior change, introducing students to methods of maintaining and assessing personal health, addressing academic, mental, physical and emotional health concerns, celebrating achievements and referring them to the many health resources on campus when necessary. Panelist Student Outreach for Understanding Racial and Cultural Experiences January 2013  –  May 2013  (5 months) Stanford University SOURCE panelists are a university resource developed to allow candid conversation and understanding of underrepresented racial and cultural experiences. Panelists are trained in integrating their experiences and the experiences of others into a constructive dialogue about race, class, and culture. Panels are often facilitated in university classes and work spaces with the goal of creating dialogue and increasing cultural competency. Panelists responsibilities include being able to communicate, facilitate discussions, and organize panels customized to an array of university audiences from staff to students. Miami-Dade County Health Department Junior Intern Florida Department of Health June 2012  –  September 2012  (4 months) Miami-Dade County Health Department 8600 NW 17 Street, Suite 200 Miami, FL 33126 As a MDCHD Intern, shadowed an EIS officer (Alazandra Cruze) and Edhelene (Gigi) Rico the director of the surveillance department, observed investigations into hospital Mycobacterium outbreaks,pre-emptive prison Hepatitis vaccinations, the use of Florida Department of Health officers as expert witnesses in lawsuits, foodborne outbreak investigations, statistical analysis of outbreak patterns, investigation of ASLF strongyloides outbreaks, streamlined the departments \"on-call\" emergency system, and sat in and presented at bi-monthly conference calls between the FDOH and the CDC. National Association for the Advancement of Colored People California NAACP September 2011  –  June 2012  (10 months) Stanford University As the Environmental Justice Coordinator for the NAACP responsibilities included organizing awareness events around issues of superfund site placement, government repossession of Native American lands, Bay Area environmental justice and reparations campaigns. Notable events included an environmental justice summit attended by local environmental justice advocates and a Bay Area wide Slam Poetry Contest. Research Assistant Mary Beth Mudgett Plant Biology Laboratory September 2009  –  March 2010  (7 months) As a Research Assistant in the Mary Beth Mudgett lab, participated in and learned the dynamics of DNA cloning, bacterial transformation, cellular culture, extraction of DNA, PCR dynamics, Gel electrophoresis, Western blot. John Gardner Public Service Fellow Stanford University March 2013  – Present (2 years 6 months) Baltimore, Maryland Area As a Gardner Fellow, working toward reducing health disparities in Maryland through the Maryland Department of Health and Mental Hygiene under current Secretary of the Health Department Dr. Joshua Sharfstein. Current responsibilities include streamlining implementation of Health Enterprise Zone project by assessing reporting ability of grantees and developing strategies to improve capacity while reducing cost. John Gardner Public Service Fellow Stanford University March 2013  – Present (2 years 6 months) Baltimore, Maryland Area As a Gardner Fellow, working toward reducing health disparities in Maryland through the Maryland Department of Health and Mental Hygiene under current Secretary of the Health Department Dr. Joshua Sharfstein. Current responsibilities include streamlining implementation of Health Enterprise Zone project by assessing reporting ability of grantees and developing strategies to improve capacity while reducing cost. Office of Alcohol Policy and Education Intern Stanford Office of Alcohol Policy and Education July 2012  – Present (3 years 2 months) As an Office of Alcohol Policy and Education Intern, responsibilities include designing student centered alcohol education programming, organizing and participating in a yearly survey of student drinking habits, running the 21st birthday behavioral change research project, and teaching incoming freshmen about how to drink responsibly through dorm presentations. Office of Alcohol Policy and Education Intern Stanford Office of Alcohol Policy and Education July 2012  – Present (3 years 2 months) As an Office of Alcohol Policy and Education Intern, responsibilities include designing student centered alcohol education programming, organizing and participating in a yearly survey of student drinking habits, running the 21st birthday behavioral change research project, and teaching incoming freshmen about how to drink responsibly through dorm presentations. Stanford Community Health Advocacy Fellow MayView Community Health Center September 2011  – Present (4 years) MayView Community Health Center 270 Grant Ave. Palo Alto, CA 94306 As a patient advocate, chief responsibility is ensuring that patients' chief complaints are heard and that their clinic experience is satisfying. Additionally advocates, assist physicians in understanding and communicating with Spanish speaking patients, take chief complaints and vital statistics, implement a yearly progress report and link patients with necessary social services, and check with patients at the end of clinic visits to ensure an understanding of the doctor's proscription. Stanford Community Health Advocacy Fellow MayView Community Health Center September 2011  – Present (4 years) MayView Community Health Center 270 Grant Ave. Palo Alto, CA 94306 As a patient advocate, chief responsibility is ensuring that patients' chief complaints are heard and that their clinic experience is satisfying. Additionally advocates, assist physicians in understanding and communicating with Spanish speaking patients, take chief complaints and vital statistics, implement a yearly progress report and link patients with necessary social services, and check with patients at the end of clinic visits to ensure an understanding of the doctor's proscription. Chief Managing Officer African American Mentorship Program September 2011  – Present (4 years) Stanford University As chief marketing officer, responsibilities include maintaining contact with a network of medical professionals that constitute our mentors, ensuring that they stay in contact with their mentees, and organizing educational and inspirational programming that informs mentees about the challenges and rewards of the pre-medical process and how to gain the most through their mentorship experience Chief Managing Officer African American Mentorship Program September 2011  – Present (4 years) Stanford University As chief marketing officer, responsibilities include maintaining contact with a network of medical professionals that constitute our mentors, ensuring that they stay in contact with their mentees, and organizing educational and inspirational programming that informs mentees about the challenges and rewards of the pre-medical process and how to gain the most through their mentorship experience Peer Health Educator Stanford University September 2012  –  June 2013  (10 months) Junipero Dormitory As a Peer Health Educator, responsibilities include triaging health emergencies, designing programming to encourage positive and healthy behavior and create positive behavior change, introducing students to methods of maintaining and assessing personal health, addressing academic, mental, physical and emotional health concerns, celebrating achievements and referring them to the many health resources on campus when necessary. Peer Health Educator Stanford University September 2012  –  June 2013  (10 months) Junipero Dormitory As a Peer Health Educator, responsibilities include triaging health emergencies, designing programming to encourage positive and healthy behavior and create positive behavior change, introducing students to methods of maintaining and assessing personal health, addressing academic, mental, physical and emotional health concerns, celebrating achievements and referring them to the many health resources on campus when necessary. Panelist Student Outreach for Understanding Racial and Cultural Experiences January 2013  –  May 2013  (5 months) Stanford University SOURCE panelists are a university resource developed to allow candid conversation and understanding of underrepresented racial and cultural experiences. Panelists are trained in integrating their experiences and the experiences of others into a constructive dialogue about race, class, and culture. Panels are often facilitated in university classes and work spaces with the goal of creating dialogue and increasing cultural competency. Panelists responsibilities include being able to communicate, facilitate discussions, and organize panels customized to an array of university audiences from staff to students. Panelist Student Outreach for Understanding Racial and Cultural Experiences January 2013  –  May 2013  (5 months) Stanford University SOURCE panelists are a university resource developed to allow candid conversation and understanding of underrepresented racial and cultural experiences. Panelists are trained in integrating their experiences and the experiences of others into a constructive dialogue about race, class, and culture. Panels are often facilitated in university classes and work spaces with the goal of creating dialogue and increasing cultural competency. Panelists responsibilities include being able to communicate, facilitate discussions, and organize panels customized to an array of university audiences from staff to students. Miami-Dade County Health Department Junior Intern Florida Department of Health June 2012  –  September 2012  (4 months) Miami-Dade County Health Department 8600 NW 17 Street, Suite 200 Miami, FL 33126 As a MDCHD Intern, shadowed an EIS officer (Alazandra Cruze) and Edhelene (Gigi) Rico the director of the surveillance department, observed investigations into hospital Mycobacterium outbreaks,pre-emptive prison Hepatitis vaccinations, the use of Florida Department of Health officers as expert witnesses in lawsuits, foodborne outbreak investigations, statistical analysis of outbreak patterns, investigation of ASLF strongyloides outbreaks, streamlined the departments \"on-call\" emergency system, and sat in and presented at bi-monthly conference calls between the FDOH and the CDC. Miami-Dade County Health Department Junior Intern Florida Department of Health June 2012  –  September 2012  (4 months) Miami-Dade County Health Department 8600 NW 17 Street, Suite 200 Miami, FL 33126 As a MDCHD Intern, shadowed an EIS officer (Alazandra Cruze) and Edhelene (Gigi) Rico the director of the surveillance department, observed investigations into hospital Mycobacterium outbreaks,pre-emptive prison Hepatitis vaccinations, the use of Florida Department of Health officers as expert witnesses in lawsuits, foodborne outbreak investigations, statistical analysis of outbreak patterns, investigation of ASLF strongyloides outbreaks, streamlined the departments \"on-call\" emergency system, and sat in and presented at bi-monthly conference calls between the FDOH and the CDC. National Association for the Advancement of Colored People California NAACP September 2011  –  June 2012  (10 months) Stanford University As the Environmental Justice Coordinator for the NAACP responsibilities included organizing awareness events around issues of superfund site placement, government repossession of Native American lands, Bay Area environmental justice and reparations campaigns. Notable events included an environmental justice summit attended by local environmental justice advocates and a Bay Area wide Slam Poetry Contest. National Association for the Advancement of Colored People California NAACP September 2011  –  June 2012  (10 months) Stanford University As the Environmental Justice Coordinator for the NAACP responsibilities included organizing awareness events around issues of superfund site placement, government repossession of Native American lands, Bay Area environmental justice and reparations campaigns. Notable events included an environmental justice summit attended by local environmental justice advocates and a Bay Area wide Slam Poetry Contest. Research Assistant Mary Beth Mudgett Plant Biology Laboratory September 2009  –  March 2010  (7 months) As a Research Assistant in the Mary Beth Mudgett lab, participated in and learned the dynamics of DNA cloning, bacterial transformation, cellular culture, extraction of DNA, PCR dynamics, Gel electrophoresis, Western blot. Research Assistant Mary Beth Mudgett Plant Biology Laboratory September 2009  –  March 2010  (7 months) As a Research Assistant in the Mary Beth Mudgett lab, participated in and learned the dynamics of DNA cloning, bacterial transformation, cellular culture, extraction of DNA, PCR dynamics, Gel electrophoresis, Western blot. Languages Spanish Spanish Spanish Skills Skills     Education Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Activities and Societies:  Alpha Delta Phi Literary Society ,  National Association for the Advancement of Colored People Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Activities and Societies:  Alpha Delta Phi Literary Society ,  National Association for the Advancement of Colored People Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Activities and Societies:  Alpha Delta Phi Literary Society ,  National Association for the Advancement of Colored People Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Activities and Societies:  Alpha Delta Phi Literary Society ,  National Association for the Advancement of Colored People Honors & Awards Mary and Jacquelyn Edmonds Prize in Human Biology Human Biology Department at Stanford University May 2012 This prize was established in 2002 in honor of Mary Edmonds, Stanford University’s former Vice Provost and Dean of Student Affairs. It is awarded to a Human Biology major during their junior year who has shown distinguished academic performance. Stanford Award of Excellence Stanford Alumni Community June 2013 The Award of Excellence is presented to a select group of graduating seniors who exemplify service to Stanford, leadership in student activities, and a dedication to the University. The Award recognizes those in the senior class who have made Stanford a better place and a more vibrant community. Deans Award for Academic Excellence Stanford University African-American Community June 2013 Award given to top performing African American Students determined by term grade point average. Received every year of attendance at Stanford.  Mobile Health 2011 Scholar BJ Fogg Persuasive Technology Laboratory May 2011 The Mobile Health Scholarship is given yearly to a small cohort of Stanford students to allow them access to the international Mobile Health Conference on hosted yearly on Stanford's campus. Students use the information and connections they make at the conference to support projects using modern technology to change health behaviors.  Mary and Jacquelyn Edmonds Prize in Human Biology Human Biology Department at Stanford University May 2012 This prize was established in 2002 in honor of Mary Edmonds, Stanford University’s former Vice Provost and Dean of Student Affairs. It is awarded to a Human Biology major during their junior year who has shown distinguished academic performance. Mary and Jacquelyn Edmonds Prize in Human Biology Human Biology Department at Stanford University May 2012 This prize was established in 2002 in honor of Mary Edmonds, Stanford University’s former Vice Provost and Dean of Student Affairs. It is awarded to a Human Biology major during their junior year who has shown distinguished academic performance. Mary and Jacquelyn Edmonds Prize in Human Biology Human Biology Department at Stanford University May 2012 This prize was established in 2002 in honor of Mary Edmonds, Stanford University’s former Vice Provost and Dean of Student Affairs. It is awarded to a Human Biology major during their junior year who has shown distinguished academic performance. Stanford Award of Excellence Stanford Alumni Community June 2013 The Award of Excellence is presented to a select group of graduating seniors who exemplify service to Stanford, leadership in student activities, and a dedication to the University. The Award recognizes those in the senior class who have made Stanford a better place and a more vibrant community. Stanford Award of Excellence Stanford Alumni Community June 2013 The Award of Excellence is presented to a select group of graduating seniors who exemplify service to Stanford, leadership in student activities, and a dedication to the University. The Award recognizes those in the senior class who have made Stanford a better place and a more vibrant community. Stanford Award of Excellence Stanford Alumni Community June 2013 The Award of Excellence is presented to a select group of graduating seniors who exemplify service to Stanford, leadership in student activities, and a dedication to the University. The Award recognizes those in the senior class who have made Stanford a better place and a more vibrant community. Deans Award for Academic Excellence Stanford University African-American Community June 2013 Award given to top performing African American Students determined by term grade point average. Received every year of attendance at Stanford.  Deans Award for Academic Excellence Stanford University African-American Community June 2013 Award given to top performing African American Students determined by term grade point average. Received every year of attendance at Stanford.  Deans Award for Academic Excellence Stanford University African-American Community June 2013 Award given to top performing African American Students determined by term grade point average. Received every year of attendance at Stanford.  Mobile Health 2011 Scholar BJ Fogg Persuasive Technology Laboratory May 2011 The Mobile Health Scholarship is given yearly to a small cohort of Stanford students to allow them access to the international Mobile Health Conference on hosted yearly on Stanford's campus. Students use the information and connections they make at the conference to support projects using modern technology to change health behaviors.  Mobile Health 2011 Scholar BJ Fogg Persuasive Technology Laboratory May 2011 The Mobile Health Scholarship is given yearly to a small cohort of Stanford students to allow them access to the international Mobile Health Conference on hosted yearly on Stanford's campus. Students use the information and connections they make at the conference to support projects using modern technology to change health behaviors.  Mobile Health 2011 Scholar BJ Fogg Persuasive Technology Laboratory May 2011 The Mobile Health Scholarship is given yearly to a small cohort of Stanford students to allow them access to the international Mobile Health Conference on hosted yearly on Stanford's campus. Students use the information and connections they make at the conference to support projects using modern technology to change health behaviors.  ", "Experience Product Marketing Manager Google October 2014  – Present (11 months) Mountain View I am on the Art, Copy & Code team at Google. We aim to work with the most iconic and forward-thinking brands to experiment and co-create ‘invent the future’ caliber marketing that uses Google’s products in pioneering, industry-leading and scalable ways. Check out some of our projects at www.artcopycode.com.  \n \nWhy the name? This names was inspired by the creative revolution of the 1960's (aka Mad Men era), when art directors and copywriters were paired up. The idea of an advertising team made up of Art and Copy was born. Today, we’re in the midst of a second creative revolution, driven by technology. Code (i.e. engineering) is shaping how advertising is made and delivered.  Product Marketing Manager Google October 2013  –  October 2014  (1 year 1 month) London, United Kingdom Marketing for Nexus & Google Play Associate Product Marketing Manager Google September 2012  –  October 2013  (1 year 2 months) Mountain View Global Marketing Strategy & Communications team Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) Kappa Alpha Theta As a residential staff specialist, actively promoted and supported student health and wellness. Planned health education programming, provided peer counseling, and acted as a role model for healthy living. BOLD/APMM Intern in Commerce Marketing Google June 2011  –  August 2011  (3 months) Mountain View, CA Corporate Communications Intern Apple Inc. January 2011  –  March 2011  (3 months) Tracked press coverage, captured broadcasts and sent to appropriate product teams, corresponded with media contacts and customers, assisted with planning campus events. Marketing Intern Socialtext June 2010  –  September 2010  (4 months) Product Marketing Manager Google October 2014  – Present (11 months) Mountain View I am on the Art, Copy & Code team at Google. We aim to work with the most iconic and forward-thinking brands to experiment and co-create ‘invent the future’ caliber marketing that uses Google’s products in pioneering, industry-leading and scalable ways. Check out some of our projects at www.artcopycode.com.  \n \nWhy the name? This names was inspired by the creative revolution of the 1960's (aka Mad Men era), when art directors and copywriters were paired up. The idea of an advertising team made up of Art and Copy was born. Today, we’re in the midst of a second creative revolution, driven by technology. Code (i.e. engineering) is shaping how advertising is made and delivered.  Product Marketing Manager Google October 2014  – Present (11 months) Mountain View I am on the Art, Copy & Code team at Google. We aim to work with the most iconic and forward-thinking brands to experiment and co-create ‘invent the future’ caliber marketing that uses Google’s products in pioneering, industry-leading and scalable ways. Check out some of our projects at www.artcopycode.com.  \n \nWhy the name? This names was inspired by the creative revolution of the 1960's (aka Mad Men era), when art directors and copywriters were paired up. The idea of an advertising team made up of Art and Copy was born. Today, we’re in the midst of a second creative revolution, driven by technology. Code (i.e. engineering) is shaping how advertising is made and delivered.  Product Marketing Manager Google October 2013  –  October 2014  (1 year 1 month) London, United Kingdom Marketing for Nexus & Google Play Product Marketing Manager Google October 2013  –  October 2014  (1 year 1 month) London, United Kingdom Marketing for Nexus & Google Play Associate Product Marketing Manager Google September 2012  –  October 2013  (1 year 2 months) Mountain View Global Marketing Strategy & Communications team Associate Product Marketing Manager Google September 2012  –  October 2013  (1 year 2 months) Mountain View Global Marketing Strategy & Communications team Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) Kappa Alpha Theta As a residential staff specialist, actively promoted and supported student health and wellness. Planned health education programming, provided peer counseling, and acted as a role model for healthy living. Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) Kappa Alpha Theta As a residential staff specialist, actively promoted and supported student health and wellness. Planned health education programming, provided peer counseling, and acted as a role model for healthy living. BOLD/APMM Intern in Commerce Marketing Google June 2011  –  August 2011  (3 months) Mountain View, CA BOLD/APMM Intern in Commerce Marketing Google June 2011  –  August 2011  (3 months) Mountain View, CA Corporate Communications Intern Apple Inc. January 2011  –  March 2011  (3 months) Tracked press coverage, captured broadcasts and sent to appropriate product teams, corresponded with media contacts and customers, assisted with planning campus events. Corporate Communications Intern Apple Inc. January 2011  –  March 2011  (3 months) Tracked press coverage, captured broadcasts and sent to appropriate product teams, corresponded with media contacts and customers, assisted with planning campus events. Marketing Intern Socialtext June 2010  –  September 2010  (4 months) Marketing Intern Socialtext June 2010  –  September 2010  (4 months) Languages Spanish Spanish Spanish Skills Social Media Product Marketing Social Media Marketing Event Planning Social Networking Public Relations Marketing Strategy Research Market Research Blogging Marketing Salesforce.com PowerPoint Public Speaking SEM Lead Generation Email Marketing See 2+     See less Skills  Social Media Product Marketing Social Media Marketing Event Planning Social Networking Public Relations Marketing Strategy Research Market Research Blogging Marketing Salesforce.com PowerPoint Public Speaking SEM Lead Generation Email Marketing See 2+     See less Social Media Product Marketing Social Media Marketing Event Planning Social Networking Public Relations Marketing Strategy Research Market Research Blogging Marketing Salesforce.com PowerPoint Public Speaking SEM Lead Generation Email Marketing See 2+     See less Social Media Product Marketing Social Media Marketing Event Planning Social Networking Public Relations Marketing Strategy Research Market Research Blogging Marketing Salesforce.com PowerPoint Public Speaking SEM Lead Generation Email Marketing See 2+     See less Education Stanford University BA,  Psychology ,  Communication 2008  – 2012 Activities and Societies:  Stanford Dollies 2009-2010 ,  Kappa Alpha Theta (Chief Information Officer) ,  Urban Styles Jazz Dance ,  Dv8 Hip Hop ,  Charity Fashion Show ,  Alliance Streetdance ,  Arabesque Middle Eastern Dance ,  Restorative Justice Pilot Program ,  Reflections Body Image Program facilitator Universitat Pompeu Fabra Spanish , Catalan,  Art History 2010  – 2010 Menlo School High School 2004  – 2008 Activities and Societies:  Activities Coordinator ,  Disciplinary Committee ,  Knight Jazz Dancers ,  Knight Life Hip Hop Stanford University BA,  Psychology ,  Communication 2008  – 2012 Activities and Societies:  Stanford Dollies 2009-2010 ,  Kappa Alpha Theta (Chief Information Officer) ,  Urban Styles Jazz Dance ,  Dv8 Hip Hop ,  Charity Fashion Show ,  Alliance Streetdance ,  Arabesque Middle Eastern Dance ,  Restorative Justice Pilot Program ,  Reflections Body Image Program facilitator Stanford University BA,  Psychology ,  Communication 2008  – 2012 Activities and Societies:  Stanford Dollies 2009-2010 ,  Kappa Alpha Theta (Chief Information Officer) ,  Urban Styles Jazz Dance ,  Dv8 Hip Hop ,  Charity Fashion Show ,  Alliance Streetdance ,  Arabesque Middle Eastern Dance ,  Restorative Justice Pilot Program ,  Reflections Body Image Program facilitator Stanford University BA,  Psychology ,  Communication 2008  – 2012 Activities and Societies:  Stanford Dollies 2009-2010 ,  Kappa Alpha Theta (Chief Information Officer) ,  Urban Styles Jazz Dance ,  Dv8 Hip Hop ,  Charity Fashion Show ,  Alliance Streetdance ,  Arabesque Middle Eastern Dance ,  Restorative Justice Pilot Program ,  Reflections Body Image Program facilitator Universitat Pompeu Fabra Spanish , Catalan,  Art History 2010  – 2010 Universitat Pompeu Fabra Spanish , Catalan,  Art History 2010  – 2010 Universitat Pompeu Fabra Spanish , Catalan,  Art History 2010  – 2010 Menlo School High School 2004  – 2008 Activities and Societies:  Activities Coordinator ,  Disciplinary Committee ,  Knight Jazz Dancers ,  Knight Life Hip Hop Menlo School High School 2004  – 2008 Activities and Societies:  Activities Coordinator ,  Disciplinary Committee ,  Knight Jazz Dancers ,  Knight Life Hip Hop Menlo School High School 2004  – 2008 Activities and Societies:  Activities Coordinator ,  Disciplinary Committee ,  Knight Jazz Dancers ,  Knight Life Hip Hop ", "Experience Business Intelligence Analyst Twitter April 2013  – Present (2 years 5 months) San Francisco Bay Area People Programs Specialist Google February 2012  –  March 2013  (1 year 2 months) San Francisco Bay Area People Analyst Google January 2010  –  February 2012  (2 years 2 months) San Francisco Bay Area People Operations Associate Google August 2008  –  January 2010  (1 year 6 months) San Francisco Bay Area Research Assistant Stanford Center on Longevity October 2007  –  June 2008  (9 months) Peer Health Educator Stanford University September 2006  –  June 2008  (1 year 10 months) Business Intelligence Analyst Twitter April 2013  – Present (2 years 5 months) San Francisco Bay Area Business Intelligence Analyst Twitter April 2013  – Present (2 years 5 months) San Francisco Bay Area People Programs Specialist Google February 2012  –  March 2013  (1 year 2 months) San Francisco Bay Area People Programs Specialist Google February 2012  –  March 2013  (1 year 2 months) San Francisco Bay Area People Analyst Google January 2010  –  February 2012  (2 years 2 months) San Francisco Bay Area People Analyst Google January 2010  –  February 2012  (2 years 2 months) San Francisco Bay Area People Operations Associate Google August 2008  –  January 2010  (1 year 6 months) San Francisco Bay Area People Operations Associate Google August 2008  –  January 2010  (1 year 6 months) San Francisco Bay Area Research Assistant Stanford Center on Longevity October 2007  –  June 2008  (9 months) Research Assistant Stanford Center on Longevity October 2007  –  June 2008  (9 months) Peer Health Educator Stanford University September 2006  –  June 2008  (1 year 10 months) Peer Health Educator Stanford University September 2006  –  June 2008  (1 year 10 months) Languages Danish Native or bilingual proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills SPSS Statistics Data Analysis Research Program Evaluation Public Speaking Quantitative Research Microsoft Office R Analytics Microsoft Excel Oral & Written... MySQL Survey Design Skills  SPSS Statistics Data Analysis Research Program Evaluation Public Speaking Quantitative Research Microsoft Office R Analytics Microsoft Excel Oral & Written... MySQL Survey Design SPSS Statistics Data Analysis Research Program Evaluation Public Speaking Quantitative Research Microsoft Office R Analytics Microsoft Excel Oral & Written... MySQL Survey Design SPSS Statistics Data Analysis Research Program Evaluation Public Speaking Quantitative Research Microsoft Office R Analytics Microsoft Excel Oral & Written... MySQL Survey Design Education Stanford University Bachelor of Arts,  Psychology 2004  – 2008 Stanford University Bachelor of Arts,  Psychology 2004  – 2008 Stanford University Bachelor of Arts,  Psychology 2004  – 2008 Stanford University Bachelor of Arts,  Psychology 2004  – 2008 ", "Summary Former pre-med (immunology, allergic dermatology, perinatology, developmental disorders, pediatrics) \nExperience with youth and disability populations, equestrian culture, public health education. Experience in philanthropy, management and boards. Summary Former pre-med (immunology, allergic dermatology, perinatology, developmental disorders, pediatrics) \nExperience with youth and disability populations, equestrian culture, public health education. Experience in philanthropy, management and boards. Former pre-med (immunology, allergic dermatology, perinatology, developmental disorders, pediatrics) \nExperience with youth and disability populations, equestrian culture, public health education. Experience in philanthropy, management and boards. Former pre-med (immunology, allergic dermatology, perinatology, developmental disorders, pediatrics) \nExperience with youth and disability populations, equestrian culture, public health education. Experience in philanthropy, management and boards. Experience Mostly Small Business & Non-Profits Business Literacy Development 2014  – Present (1 year) Greater New York City Area Shadow Medicine 2004  –  2014  (10 years) Nanny & Education Child Care 2000  –  2014  (14 years) Mostly Small Business & Non-Profits Business Literacy Development 2014  – Present (1 year) Greater New York City Area Mostly Small Business & Non-Profits Business Literacy Development 2014  – Present (1 year) Greater New York City Area Shadow Medicine 2004  –  2014  (10 years) Shadow Medicine 2004  –  2014  (10 years) Nanny & Education Child Care 2000  –  2014  (14 years) Nanny & Education Child Care 2000  –  2014  (14 years) Languages   Skills Community Outreach Program Development Nonprofit Literacy Equine Assisted Learning Animal Welfare Art History Special Events... Skills  Community Outreach Program Development Nonprofit Literacy Equine Assisted Learning Animal Welfare Art History Special Events... Community Outreach Program Development Nonprofit Literacy Equine Assisted Learning Animal Welfare Art History Special Events... Community Outreach Program Development Nonprofit Literacy Equine Assisted Learning Animal Welfare Art History Special Events... Education Purchase College, SUNY Post Bacchelaureate 2009  – 2014 Foothill College 2011  – 2011 Stanford University Bachelor's Degree 2004  – 2007 Purchase College, SUNY Post Bacchelaureate 2009  – 2014 Purchase College, SUNY Post Bacchelaureate 2009  – 2014 Purchase College, SUNY Post Bacchelaureate 2009  – 2014 Foothill College 2011  – 2011 Foothill College 2011  – 2011 Foothill College 2011  – 2011 Stanford University Bachelor's Degree 2004  – 2007 Stanford University Bachelor's Degree 2004  – 2007 Stanford University Bachelor's Degree 2004  – 2007 Honors & Awards ", "Experience Stanford Dining Hall Gardener Stanford University April 2013  –  March 2014  (1 year) Designed, cultivated, and harvested a garden near my dorm to showcase sustainable growing practices (in the first 3 months, while still a student). \nExpanded my responsibilities in June to cover all 6 gardens across campus. \nKept 10 sustainability interns informed and engaged with the gardens once they returned to campus in September. \n Peer Health Educator Stanford University September 2012  –  June 2013  (10 months) West Lagunita Dorm Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) West Lagunita Dorm Stanford Dining Hall Gardener Stanford University April 2013  –  March 2014  (1 year) Designed, cultivated, and harvested a garden near my dorm to showcase sustainable growing practices (in the first 3 months, while still a student). \nExpanded my responsibilities in June to cover all 6 gardens across campus. \nKept 10 sustainability interns informed and engaged with the gardens once they returned to campus in September. \n Stanford Dining Hall Gardener Stanford University April 2013  –  March 2014  (1 year) Designed, cultivated, and harvested a garden near my dorm to showcase sustainable growing practices (in the first 3 months, while still a student). \nExpanded my responsibilities in June to cover all 6 gardens across campus. \nKept 10 sustainability interns informed and engaged with the gardens once they returned to campus in September. \n Peer Health Educator Stanford University September 2012  –  June 2013  (10 months) West Lagunita Dorm Peer Health Educator Stanford University September 2012  –  June 2013  (10 months) West Lagunita Dorm Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) West Lagunita Dorm Peer Health Educator Stanford University September 2011  –  June 2012  (10 months) West Lagunita Dorm Languages   Skills Ruby on Rails Ruby JavaScript jQuery Backbone.js SQL HTML CSS Web Development Git Python Java Skills  Ruby on Rails Ruby JavaScript jQuery Backbone.js SQL HTML CSS Web Development Git Python Java Ruby on Rails Ruby JavaScript jQuery Backbone.js SQL HTML CSS Web Development Git Python Java Ruby on Rails Ruby JavaScript jQuery Backbone.js SQL HTML CSS Web Development Git Python Java Education App Academy (San Francisco) Web Development 2015  – 2015 Full-stack web development course with an acceptance rate below 5% and a strong emphasis on code quality and design patterns. Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 App Academy (San Francisco) Web Development 2015  – 2015 Full-stack web development course with an acceptance rate below 5% and a strong emphasis on code quality and design patterns. App Academy (San Francisco) Web Development 2015  – 2015 Full-stack web development course with an acceptance rate below 5% and a strong emphasis on code quality and design patterns. App Academy (San Francisco) Web Development 2015  – 2015 Full-stack web development course with an acceptance rate below 5% and a strong emphasis on code quality and design patterns. Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Stanford University Bachelor of Arts (B.A.),  Human Biology 2009  – 2013 Honors & Awards ", "Summary Michal is a second-year MD candidate at Harvard Medical School. In summer 2014, she conducted orthopedic surgery research of the hand at Johns Hopkins exploring quality of life metrics in patients with trapeziometacarpal osteoarthritis. At Harvard Medical School, Michal served as a Co-President of the LGBTQ and Allied Students at Harvard Medical School/Harvard School of Dental Medicine (LAHMS) and the Harvard Medical School Med Students for Choice (MSFC) chapter. In addition, she researches barriers to care for trans* patients at Fenway Health and co-chairs the Medical Education team at Harvard's Crimson Care Collaborative. She is a student member on the Massachusetts Medical Society's Committee on LGBT Matters. She is also actively involved in Harvard Medical School's curricular reform efforts through her work with the Health Equity in the Curriculum working group. \n \nPrior to Harvard Medical School, Michal served as an Allan Rosenfield Fellow at the Foundation for AIDS Research (amfAR). Before that, she tracked Affordable Care Act implementation as a Research Assistant working on a grant from the Robert Wood Johnson Foundation. \n \nThrough these experiences, Michal has developed a passion for the clinical research and advocacy work. Summary Michal is a second-year MD candidate at Harvard Medical School. In summer 2014, she conducted orthopedic surgery research of the hand at Johns Hopkins exploring quality of life metrics in patients with trapeziometacarpal osteoarthritis. At Harvard Medical School, Michal served as a Co-President of the LGBTQ and Allied Students at Harvard Medical School/Harvard School of Dental Medicine (LAHMS) and the Harvard Medical School Med Students for Choice (MSFC) chapter. In addition, she researches barriers to care for trans* patients at Fenway Health and co-chairs the Medical Education team at Harvard's Crimson Care Collaborative. She is a student member on the Massachusetts Medical Society's Committee on LGBT Matters. She is also actively involved in Harvard Medical School's curricular reform efforts through her work with the Health Equity in the Curriculum working group. \n \nPrior to Harvard Medical School, Michal served as an Allan Rosenfield Fellow at the Foundation for AIDS Research (amfAR). Before that, she tracked Affordable Care Act implementation as a Research Assistant working on a grant from the Robert Wood Johnson Foundation. \n \nThrough these experiences, Michal has developed a passion for the clinical research and advocacy work. Michal is a second-year MD candidate at Harvard Medical School. In summer 2014, she conducted orthopedic surgery research of the hand at Johns Hopkins exploring quality of life metrics in patients with trapeziometacarpal osteoarthritis. At Harvard Medical School, Michal served as a Co-President of the LGBTQ and Allied Students at Harvard Medical School/Harvard School of Dental Medicine (LAHMS) and the Harvard Medical School Med Students for Choice (MSFC) chapter. In addition, she researches barriers to care for trans* patients at Fenway Health and co-chairs the Medical Education team at Harvard's Crimson Care Collaborative. She is a student member on the Massachusetts Medical Society's Committee on LGBT Matters. She is also actively involved in Harvard Medical School's curricular reform efforts through her work with the Health Equity in the Curriculum working group. \n \nPrior to Harvard Medical School, Michal served as an Allan Rosenfield Fellow at the Foundation for AIDS Research (amfAR). Before that, she tracked Affordable Care Act implementation as a Research Assistant working on a grant from the Robert Wood Johnson Foundation. \n \nThrough these experiences, Michal has developed a passion for the clinical research and advocacy work. Michal is a second-year MD candidate at Harvard Medical School. In summer 2014, she conducted orthopedic surgery research of the hand at Johns Hopkins exploring quality of life metrics in patients with trapeziometacarpal osteoarthritis. At Harvard Medical School, Michal served as a Co-President of the LGBTQ and Allied Students at Harvard Medical School/Harvard School of Dental Medicine (LAHMS) and the Harvard Medical School Med Students for Choice (MSFC) chapter. In addition, she researches barriers to care for trans* patients at Fenway Health and co-chairs the Medical Education team at Harvard's Crimson Care Collaborative. She is a student member on the Massachusetts Medical Society's Committee on LGBT Matters. She is also actively involved in Harvard Medical School's curricular reform efforts through her work with the Health Equity in the Curriculum working group. \n \nPrior to Harvard Medical School, Michal served as an Allan Rosenfield Fellow at the Foundation for AIDS Research (amfAR). Before that, she tracked Affordable Care Act implementation as a Research Assistant working on a grant from the Robert Wood Johnson Foundation. \n \nThrough these experiences, Michal has developed a passion for the clinical research and advocacy work. Experience Allan Rosenfield Fellow amfAR, The Foundation for AIDS Research March 2013  –  July 2013  (5 months) 1150 17th street, nw washington, dc 20036 Center for Perinatal Advocacy Intern Providence Hospital September 2011  –  June 2013  (1 year 10 months) Washington D.C. Metro Area Assist in the development of the carseat, safe sleep, and breastfeeding initiatives at Providence Hospital's Center for Perinatal Advocacy. Research Assistant Stanford University School of Medicine January 2011  –  June 2013  (2 years 6 months) Worked with and shadowed Dr. Natali Aziz (OB/GYN) at Stanford University Medical School in clinic and labor/delivery. Researched and analyzed data regarding a comparison of cytomegalovirus testing strategies, including cell culture, shell vial cell culture, and polymerase chain reaction results. Health Policy Research Assistant George Washington University (Robert Wood Johnson Foundation) September 2011  –  February 2013  (1 year 6 months) Washington D.C. Metro Area Manage Health Reform GPS, a website that tracks Affordable Care Act Implementation. Conduct research and writing associated with other ACA implementation issues, such as Medicaid expansion, Exchange implementation, community health center funding, and end of life care. MCAT Instructor Examkrackers, INC June 2012  –  January 2013  (8 months) Georgetown University Instruct classes for and privately tutor students preparing for the MCAT. Patient/Physician Outreach Coordinator Avva January 2011  –  June 2011  (6 months) Avva is a start-up web application for breast cancer patients created by two Stanford graduates. Through Avva, the team intends to help patients organize and manage their information, track symptoms, and communicate important details to their physician. I coordinate patient and physician outreach through interviews regarding website improvement and general feedback. Alcohol Education Representative Health Promotion Services September 2010  –  June 2011  (10 months) Develop Alcohol and Substance Abuse Prevention Projects. Present alcohol education talks in Stanford Peer Health Educator Stanford University September 2010  –  June 2011  (10 months) Work in a Stanford dorm as a PHE. Facilitate numerous dorm talks about prevalent health topics, consult with and refer students with health related issues, and serve as a liaison between Vaden Health Center and my 60-person dorm. Student Advisor Stanford University September 2010  –  June 2011  (10 months) Counsel students through the declaration, internship, and honors process for the Human Biology major. Help match students with faculty advisors and organize Human Biology events. Patient Advocate Patient Advocacy Program July 2010  –  June 2011  (1 year) Volunteer at Ravenswood Family Health Center in East Palo Alto, CA. Develop the pediatrics asthma care management database for Ravenswood and conduct a chart review and corresponding literature report regarding asthma status in the United States. Research Assistant Stanford University June 2010  –  August 2010  (3 months) Worked with Dr. Stacy Sims, Exercise Physiologist-Sports Nutritionist. Ran participants for Dr. Sims' research using Dr. Craig Heller's cool down exercise enhancement glove. Research Assistant Stanford University January 2010  –  April 2010  (4 months) Dr. James Gross's psychology lab. Researched the effects of stress on cognitive reappraisal and ran participants for Dr. Gal Sheppes's research on emotion regulation. Used a low-level shock device and EEG to run studies. Tutor and Mentor East Palo Alto Tennis and Tutoring January 2009  –  June 2009  (6 months) Mentored elementary and middle school students from local public schools about eating well and exercising regularly. Tutored students in history, science, math, and English. Education Coordinator FACE AIDS September 2008  –  June 2009  (10 months) FACEAIDS, Stanford Chapter, Stanford, CA. Organized events, helped recruit speakers and facilitated prevention/awareness talks. Member, Stanford Students for Choice, Stanford, CA. Helped organize pro-choice awareness gatherings and events. Stanford University Stanford Students for Choice Stanford University September 2008  –  June 2009  (10 months) Helped organize pro-choice awareness gatherings and events. Entertainment Media Partnerships Intern Kaiser Family Foundation June 2008  –  August 2008  (3 months) Facilitated activities and translated Spanish at the XVIII International AIDS Conference, Mexico City. Developed communication platforms for HIV/AIDS prevention, awareness, and education campaigns. Allan Rosenfield Fellow amfAR, The Foundation for AIDS Research March 2013  –  July 2013  (5 months) 1150 17th street, nw washington, dc 20036 Allan Rosenfield Fellow amfAR, The Foundation for AIDS Research March 2013  –  July 2013  (5 months) 1150 17th street, nw washington, dc 20036 Center for Perinatal Advocacy Intern Providence Hospital September 2011  –  June 2013  (1 year 10 months) Washington D.C. Metro Area Assist in the development of the carseat, safe sleep, and breastfeeding initiatives at Providence Hospital's Center for Perinatal Advocacy. Center for Perinatal Advocacy Intern Providence Hospital September 2011  –  June 2013  (1 year 10 months) Washington D.C. Metro Area Assist in the development of the carseat, safe sleep, and breastfeeding initiatives at Providence Hospital's Center for Perinatal Advocacy. Research Assistant Stanford University School of Medicine January 2011  –  June 2013  (2 years 6 months) Worked with and shadowed Dr. Natali Aziz (OB/GYN) at Stanford University Medical School in clinic and labor/delivery. Researched and analyzed data regarding a comparison of cytomegalovirus testing strategies, including cell culture, shell vial cell culture, and polymerase chain reaction results. Research Assistant Stanford University School of Medicine January 2011  –  June 2013  (2 years 6 months) Worked with and shadowed Dr. Natali Aziz (OB/GYN) at Stanford University Medical School in clinic and labor/delivery. Researched and analyzed data regarding a comparison of cytomegalovirus testing strategies, including cell culture, shell vial cell culture, and polymerase chain reaction results. Health Policy Research Assistant George Washington University (Robert Wood Johnson Foundation) September 2011  –  February 2013  (1 year 6 months) Washington D.C. Metro Area Manage Health Reform GPS, a website that tracks Affordable Care Act Implementation. Conduct research and writing associated with other ACA implementation issues, such as Medicaid expansion, Exchange implementation, community health center funding, and end of life care. Health Policy Research Assistant George Washington University (Robert Wood Johnson Foundation) September 2011  –  February 2013  (1 year 6 months) Washington D.C. Metro Area Manage Health Reform GPS, a website that tracks Affordable Care Act Implementation. Conduct research and writing associated with other ACA implementation issues, such as Medicaid expansion, Exchange implementation, community health center funding, and end of life care. MCAT Instructor Examkrackers, INC June 2012  –  January 2013  (8 months) Georgetown University Instruct classes for and privately tutor students preparing for the MCAT. MCAT Instructor Examkrackers, INC June 2012  –  January 2013  (8 months) Georgetown University Instruct classes for and privately tutor students preparing for the MCAT. Patient/Physician Outreach Coordinator Avva January 2011  –  June 2011  (6 months) Avva is a start-up web application for breast cancer patients created by two Stanford graduates. Through Avva, the team intends to help patients organize and manage their information, track symptoms, and communicate important details to their physician. I coordinate patient and physician outreach through interviews regarding website improvement and general feedback. Patient/Physician Outreach Coordinator Avva January 2011  –  June 2011  (6 months) Avva is a start-up web application for breast cancer patients created by two Stanford graduates. Through Avva, the team intends to help patients organize and manage their information, track symptoms, and communicate important details to their physician. I coordinate patient and physician outreach through interviews regarding website improvement and general feedback. Alcohol Education Representative Health Promotion Services September 2010  –  June 2011  (10 months) Develop Alcohol and Substance Abuse Prevention Projects. Present alcohol education talks in Stanford Alcohol Education Representative Health Promotion Services September 2010  –  June 2011  (10 months) Develop Alcohol and Substance Abuse Prevention Projects. Present alcohol education talks in Stanford Peer Health Educator Stanford University September 2010  –  June 2011  (10 months) Work in a Stanford dorm as a PHE. Facilitate numerous dorm talks about prevalent health topics, consult with and refer students with health related issues, and serve as a liaison between Vaden Health Center and my 60-person dorm. Peer Health Educator Stanford University September 2010  –  June 2011  (10 months) Work in a Stanford dorm as a PHE. Facilitate numerous dorm talks about prevalent health topics, consult with and refer students with health related issues, and serve as a liaison between Vaden Health Center and my 60-person dorm. Student Advisor Stanford University September 2010  –  June 2011  (10 months) Counsel students through the declaration, internship, and honors process for the Human Biology major. Help match students with faculty advisors and organize Human Biology events. Student Advisor Stanford University September 2010  –  June 2011  (10 months) Counsel students through the declaration, internship, and honors process for the Human Biology major. Help match students with faculty advisors and organize Human Biology events. Patient Advocate Patient Advocacy Program July 2010  –  June 2011  (1 year) Volunteer at Ravenswood Family Health Center in East Palo Alto, CA. Develop the pediatrics asthma care management database for Ravenswood and conduct a chart review and corresponding literature report regarding asthma status in the United States. Patient Advocate Patient Advocacy Program July 2010  –  June 2011  (1 year) Volunteer at Ravenswood Family Health Center in East Palo Alto, CA. Develop the pediatrics asthma care management database for Ravenswood and conduct a chart review and corresponding literature report regarding asthma status in the United States. Research Assistant Stanford University June 2010  –  August 2010  (3 months) Worked with Dr. Stacy Sims, Exercise Physiologist-Sports Nutritionist. Ran participants for Dr. Sims' research using Dr. Craig Heller's cool down exercise enhancement glove. Research Assistant Stanford University June 2010  –  August 2010  (3 months) Worked with Dr. Stacy Sims, Exercise Physiologist-Sports Nutritionist. Ran participants for Dr. Sims' research using Dr. Craig Heller's cool down exercise enhancement glove. Research Assistant Stanford University January 2010  –  April 2010  (4 months) Dr. James Gross's psychology lab. Researched the effects of stress on cognitive reappraisal and ran participants for Dr. Gal Sheppes's research on emotion regulation. Used a low-level shock device and EEG to run studies. Research Assistant Stanford University January 2010  –  April 2010  (4 months) Dr. James Gross's psychology lab. Researched the effects of stress on cognitive reappraisal and ran participants for Dr. Gal Sheppes's research on emotion regulation. Used a low-level shock device and EEG to run studies. Tutor and Mentor East Palo Alto Tennis and Tutoring January 2009  –  June 2009  (6 months) Mentored elementary and middle school students from local public schools about eating well and exercising regularly. Tutored students in history, science, math, and English. Tutor and Mentor East Palo Alto Tennis and Tutoring January 2009  –  June 2009  (6 months) Mentored elementary and middle school students from local public schools about eating well and exercising regularly. Tutored students in history, science, math, and English. Education Coordinator FACE AIDS September 2008  –  June 2009  (10 months) FACEAIDS, Stanford Chapter, Stanford, CA. Organized events, helped recruit speakers and facilitated prevention/awareness talks. Member, Stanford Students for Choice, Stanford, CA. Helped organize pro-choice awareness gatherings and events. Education Coordinator FACE AIDS September 2008  –  June 2009  (10 months) FACEAIDS, Stanford Chapter, Stanford, CA. Organized events, helped recruit speakers and facilitated prevention/awareness talks. Member, Stanford Students for Choice, Stanford, CA. Helped organize pro-choice awareness gatherings and events. Stanford University Stanford Students for Choice Stanford University September 2008  –  June 2009  (10 months) Helped organize pro-choice awareness gatherings and events. Stanford University Stanford Students for Choice Stanford University September 2008  –  June 2009  (10 months) Helped organize pro-choice awareness gatherings and events. Entertainment Media Partnerships Intern Kaiser Family Foundation June 2008  –  August 2008  (3 months) Facilitated activities and translated Spanish at the XVIII International AIDS Conference, Mexico City. Developed communication platforms for HIV/AIDS prevention, awareness, and education campaigns. Entertainment Media Partnerships Intern Kaiser Family Foundation June 2008  –  August 2008  (3 months) Facilitated activities and translated Spanish at the XVIII International AIDS Conference, Mexico City. Developed communication platforms for HIV/AIDS prevention, awareness, and education campaigns. Languages English Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency English Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency English Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Community Outreach Research Public Speaking Spanish Facebook Teaching Data Analysis Qualitative Research Psychology Public Health Policy Analysis Microsoft Office Fundraising Building Coalitions Program Evaluation Health Policy See 1+     See less Skills  Community Outreach Research Public Speaking Spanish Facebook Teaching Data Analysis Qualitative Research Psychology Public Health Policy Analysis Microsoft Office Fundraising Building Coalitions Program Evaluation Health Policy See 1+     See less Community Outreach Research Public Speaking Spanish Facebook Teaching Data Analysis Qualitative Research Psychology Public Health Policy Analysis Microsoft Office Fundraising Building Coalitions Program Evaluation Health Policy See 1+     See less Community Outreach Research Public Speaking Spanish Facebook Teaching Data Analysis Qualitative Research Psychology Public Health Policy Analysis Microsoft Office Fundraising Building Coalitions Program Evaluation Health Policy See 1+     See less Education Harvard Medical School Doctor of Medicine (MD) 2013  – 2017 Stanford University Bachelor of Arts,  Human Biology; Premed; Iberian and Latin American Cultures 2007  – 2011 Activities and Societies:  Kappa Alpha Theta ,  Vaden Health Promotion Services ,  Human Biology Student Advisor ,  Gaieties ,  FACE AIDS Harvard Medical School Doctor of Medicine (MD) 2013  – 2017 Harvard Medical School Doctor of Medicine (MD) 2013  – 2017 Harvard Medical School Doctor of Medicine (MD) 2013  – 2017 Stanford University Bachelor of Arts,  Human Biology; Premed; Iberian and Latin American Cultures 2007  – 2011 Activities and Societies:  Kappa Alpha Theta ,  Vaden Health Promotion Services ,  Human Biology Student Advisor ,  Gaieties ,  FACE AIDS Stanford University Bachelor of Arts,  Human Biology; Premed; Iberian and Latin American Cultures 2007  – 2011 Activities and Societies:  Kappa Alpha Theta ,  Vaden Health Promotion Services ,  Human Biology Student Advisor ,  Gaieties ,  FACE AIDS Stanford University Bachelor of Arts,  Human Biology; Premed; Iberian and Latin American Cultures 2007  – 2011 Activities and Societies:  Kappa Alpha Theta ,  Vaden Health Promotion Services ,  Human Biology Student Advisor ,  Gaieties ,  FACE AIDS ", "Summary ◆ Wellness Consultant ◆ Health Educator ◆ Group Facilitator ◆ \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \nAccomplished facilitator and consultant with expertise in education, wellness and nutrition focused on helping people make practical health and wellness decisions for daily living. Strong knowledge base in health promotion, disease prevention and the maintenance of an active lifestyle.  \n \nInsightful listener and effective coach. Experienced working one-on-one or with groups to create innovative ways to enrich quality of life. Highly skilled in program development and design, including presentations, handouts, newsletters and brochures. Consistent high rating and positive feedback for knowledge, thoroughness, pace and group interaction. \n \n♦ Program Development, Presentation, Facilitation & Evaluation \n♦ Creative Educational Materials Design  \n♦ Client Centered: Service, Satisfaction, Retention  \n♦ Communication & Coaching \n♦ Organizational Effectiveness \n♦ Strategic Planning \n♦ Research Activities: Recruitment, Screening, Orientation Sessions, Randomization, Data Collection and Entry, Adherence and Retention \n \n✉ caprosak@gmail.com \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ Summary ◆ Wellness Consultant ◆ Health Educator ◆ Group Facilitator ◆ \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \nAccomplished facilitator and consultant with expertise in education, wellness and nutrition focused on helping people make practical health and wellness decisions for daily living. Strong knowledge base in health promotion, disease prevention and the maintenance of an active lifestyle.  \n \nInsightful listener and effective coach. Experienced working one-on-one or with groups to create innovative ways to enrich quality of life. Highly skilled in program development and design, including presentations, handouts, newsletters and brochures. Consistent high rating and positive feedback for knowledge, thoroughness, pace and group interaction. \n \n♦ Program Development, Presentation, Facilitation & Evaluation \n♦ Creative Educational Materials Design  \n♦ Client Centered: Service, Satisfaction, Retention  \n♦ Communication & Coaching \n♦ Organizational Effectiveness \n♦ Strategic Planning \n♦ Research Activities: Recruitment, Screening, Orientation Sessions, Randomization, Data Collection and Entry, Adherence and Retention \n \n✉ caprosak@gmail.com \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ◆ Wellness Consultant ◆ Health Educator ◆ Group Facilitator ◆ \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \nAccomplished facilitator and consultant with expertise in education, wellness and nutrition focused on helping people make practical health and wellness decisions for daily living. Strong knowledge base in health promotion, disease prevention and the maintenance of an active lifestyle.  \n \nInsightful listener and effective coach. Experienced working one-on-one or with groups to create innovative ways to enrich quality of life. Highly skilled in program development and design, including presentations, handouts, newsletters and brochures. Consistent high rating and positive feedback for knowledge, thoroughness, pace and group interaction. \n \n♦ Program Development, Presentation, Facilitation & Evaluation \n♦ Creative Educational Materials Design  \n♦ Client Centered: Service, Satisfaction, Retention  \n♦ Communication & Coaching \n♦ Organizational Effectiveness \n♦ Strategic Planning \n♦ Research Activities: Recruitment, Screening, Orientation Sessions, Randomization, Data Collection and Entry, Adherence and Retention \n \n✉ caprosak@gmail.com \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ ◆ Wellness Consultant ◆ Health Educator ◆ Group Facilitator ◆ \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \nAccomplished facilitator and consultant with expertise in education, wellness and nutrition focused on helping people make practical health and wellness decisions for daily living. Strong knowledge base in health promotion, disease prevention and the maintenance of an active lifestyle.  \n \nInsightful listener and effective coach. Experienced working one-on-one or with groups to create innovative ways to enrich quality of life. Highly skilled in program development and design, including presentations, handouts, newsletters and brochures. Consistent high rating and positive feedback for knowledge, thoroughness, pace and group interaction. \n \n♦ Program Development, Presentation, Facilitation & Evaluation \n♦ Creative Educational Materials Design  \n♦ Client Centered: Service, Satisfaction, Retention  \n♦ Communication & Coaching \n♦ Organizational Effectiveness \n♦ Strategic Planning \n♦ Research Activities: Recruitment, Screening, Orientation Sessions, Randomization, Data Collection and Entry, Adherence and Retention \n \n✉ caprosak@gmail.com \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ Experience Health Educator Stanford University, School of Medicine, Stanford Prevention Research Center 2009  –  March 2014  (5 years) Palo Alto, California, United States Lifestyle Intervention & Independence for Elders (LIFE-Main) Study, NIH/NIA  \nCoordinated Successful Aging Intervention in multi-center, national study researching the \neffectiveness of lifestyle interventions in delaying and preventing disability. \n \n► Developed content for intervention protocol, created resource materials and conducted training for national and local interventionists. \n► Designed and led 450 workshops for 100 participants, aged 70-90 years, each with original presentations featuring over 120 speakers.  \n► Planned and organized two national campaigns on hydration and sleep. \n► Composed 42 months of health newsletters and coordinated a senior health fair for participants. \n► Compiled, edited, printed and distributed participant life reflections in “Wisdom & Aging” booklet, “Our Stories” and “Faces of Aging” photo essay. Group Facilitator Stanford University, School of Medicine, Stanford Prevention Research Center 2008  –  2009  (1 year) Palo Alto, California, United States FRESH START Study, Stanford University/NCI  \nFacilitated behavioral intervention program focusing on long-term lifestyle change to support \nweight loss and maintenance. \n \n► Led participants in choosing healthy eating options and adopting mindful (non-diet) stability skills. \n► Strengthened behavioral change using a participant-centered problem-solving model. \n► Increased participant physical activity by introducing a walking program using an electronic monitoring device. Health Educator Stanford University, School of Medicine, Stanford Prevention Research Center 2006  –  2008  (2 years) Palo Alto, California, United States Counseling Advice For Lifestyle Management, (CALM) Study, NIA/NHLBI  \nImplemented telephone-based counseling sessions to deliver individualized health behavior modification programs focused on physical activity, nutrition and stress management to adults 50+.  \n \n► Evaluated participants’ present habits and assessed willingness to make health changes. \n► Addressed resistance, helped participants identify potential barriers and develop goals and  \nstrategies using problem-solving techniques. \n► Followed-up and provided feedback relating to participant plans, actions and outcomes. Health Educator, Interventionist Stanford University, School of Medicine, Stanford Prevention Research Center 2004  –  2006  (2 years) Palo Alto, California, United States Lifestyle Intervention & Independence for Elders (LIFE-Pilot) Study, NIH/NIA  \nCoordinated the Successful Aging Intervention in multi-center, national study, facilitating and \npresenting workshops for 50 participants, aged 70-90 years. \n \n► Scheduled over 50 speakers and facilitated 100 workshops - including original presentations, discussion groups and special sessions. \n► Developed a holistic successful aging “map” which was adopted study-wide to educate, \ninspire and empower older adults in making lifestyle choices to remain healthy and independent. \n► Generated list of speakers, community programs, activities and resources related to aging well. Group Nutritionist Stanford University, School of Medicine, Stanford Prevention Research Center 1997  –  2004  (7 years) San Jose, California, United States Women’s’ Health Initiative (WHI) Study, NIH/ NHLBI  \nLed intervention groups in multi-center, national study, facilitating and presenting workshops, \none-on-one consults and telephone follow-ups for 155 participants, aged 50-79. \n \n► Delivered a comprehensive program including behavioral skills, problem solving, stress reduction, label reading, cooking and taste testing. \n► Led discussions and activities related to dietary change to effect a diet low in fat and high in vegetables, grains and fruits, replacing refined foods. \n► Enhanced participants’ internal motivation to make health behavior changes, using a variety of \nnegotiating strategies based on readiness to consider change. Health Educator Stanford University, School of Medicine, Stanford Prevention Research Center 2009  –  March 2014  (5 years) Palo Alto, California, United States Lifestyle Intervention & Independence for Elders (LIFE-Main) Study, NIH/NIA  \nCoordinated Successful Aging Intervention in multi-center, national study researching the \neffectiveness of lifestyle interventions in delaying and preventing disability. \n \n► Developed content for intervention protocol, created resource materials and conducted training for national and local interventionists. \n► Designed and led 450 workshops for 100 participants, aged 70-90 years, each with original presentations featuring over 120 speakers.  \n► Planned and organized two national campaigns on hydration and sleep. \n► Composed 42 months of health newsletters and coordinated a senior health fair for participants. \n► Compiled, edited, printed and distributed participant life reflections in “Wisdom & Aging” booklet, “Our Stories” and “Faces of Aging” photo essay. Health Educator Stanford University, School of Medicine, Stanford Prevention Research Center 2009  –  March 2014  (5 years) Palo Alto, California, United States Lifestyle Intervention & Independence for Elders (LIFE-Main) Study, NIH/NIA  \nCoordinated Successful Aging Intervention in multi-center, national study researching the \neffectiveness of lifestyle interventions in delaying and preventing disability. \n \n► Developed content for intervention protocol, created resource materials and conducted training for national and local interventionists. \n► Designed and led 450 workshops for 100 participants, aged 70-90 years, each with original presentations featuring over 120 speakers.  \n► Planned and organized two national campaigns on hydration and sleep. \n► Composed 42 months of health newsletters and coordinated a senior health fair for participants. \n► Compiled, edited, printed and distributed participant life reflections in “Wisdom & Aging” booklet, “Our Stories” and “Faces of Aging” photo essay. Group Facilitator Stanford University, School of Medicine, Stanford Prevention Research Center 2008  –  2009  (1 year) Palo Alto, California, United States FRESH START Study, Stanford University/NCI  \nFacilitated behavioral intervention program focusing on long-term lifestyle change to support \nweight loss and maintenance. \n \n► Led participants in choosing healthy eating options and adopting mindful (non-diet) stability skills. \n► Strengthened behavioral change using a participant-centered problem-solving model. \n► Increased participant physical activity by introducing a walking program using an electronic monitoring device. Group Facilitator Stanford University, School of Medicine, Stanford Prevention Research Center 2008  –  2009  (1 year) Palo Alto, California, United States FRESH START Study, Stanford University/NCI  \nFacilitated behavioral intervention program focusing on long-term lifestyle change to support \nweight loss and maintenance. \n \n► Led participants in choosing healthy eating options and adopting mindful (non-diet) stability skills. \n► Strengthened behavioral change using a participant-centered problem-solving model. \n► Increased participant physical activity by introducing a walking program using an electronic monitoring device. Health Educator Stanford University, School of Medicine, Stanford Prevention Research Center 2006  –  2008  (2 years) Palo Alto, California, United States Counseling Advice For Lifestyle Management, (CALM) Study, NIA/NHLBI  \nImplemented telephone-based counseling sessions to deliver individualized health behavior modification programs focused on physical activity, nutrition and stress management to adults 50+.  \n \n► Evaluated participants’ present habits and assessed willingness to make health changes. \n► Addressed resistance, helped participants identify potential barriers and develop goals and  \nstrategies using problem-solving techniques. \n► Followed-up and provided feedback relating to participant plans, actions and outcomes. Health Educator Stanford University, School of Medicine, Stanford Prevention Research Center 2006  –  2008  (2 years) Palo Alto, California, United States Counseling Advice For Lifestyle Management, (CALM) Study, NIA/NHLBI  \nImplemented telephone-based counseling sessions to deliver individualized health behavior modification programs focused on physical activity, nutrition and stress management to adults 50+.  \n \n► Evaluated participants’ present habits and assessed willingness to make health changes. \n► Addressed resistance, helped participants identify potential barriers and develop goals and  \nstrategies using problem-solving techniques. \n► Followed-up and provided feedback relating to participant plans, actions and outcomes. Health Educator, Interventionist Stanford University, School of Medicine, Stanford Prevention Research Center 2004  –  2006  (2 years) Palo Alto, California, United States Lifestyle Intervention & Independence for Elders (LIFE-Pilot) Study, NIH/NIA  \nCoordinated the Successful Aging Intervention in multi-center, national study, facilitating and \npresenting workshops for 50 participants, aged 70-90 years. \n \n► Scheduled over 50 speakers and facilitated 100 workshops - including original presentations, discussion groups and special sessions. \n► Developed a holistic successful aging “map” which was adopted study-wide to educate, \ninspire and empower older adults in making lifestyle choices to remain healthy and independent. \n► Generated list of speakers, community programs, activities and resources related to aging well. Health Educator, Interventionist Stanford University, School of Medicine, Stanford Prevention Research Center 2004  –  2006  (2 years) Palo Alto, California, United States Lifestyle Intervention & Independence for Elders (LIFE-Pilot) Study, NIH/NIA  \nCoordinated the Successful Aging Intervention in multi-center, national study, facilitating and \npresenting workshops for 50 participants, aged 70-90 years. \n \n► Scheduled over 50 speakers and facilitated 100 workshops - including original presentations, discussion groups and special sessions. \n► Developed a holistic successful aging “map” which was adopted study-wide to educate, \ninspire and empower older adults in making lifestyle choices to remain healthy and independent. \n► Generated list of speakers, community programs, activities and resources related to aging well. Group Nutritionist Stanford University, School of Medicine, Stanford Prevention Research Center 1997  –  2004  (7 years) San Jose, California, United States Women’s’ Health Initiative (WHI) Study, NIH/ NHLBI  \nLed intervention groups in multi-center, national study, facilitating and presenting workshops, \none-on-one consults and telephone follow-ups for 155 participants, aged 50-79. \n \n► Delivered a comprehensive program including behavioral skills, problem solving, stress reduction, label reading, cooking and taste testing. \n► Led discussions and activities related to dietary change to effect a diet low in fat and high in vegetables, grains and fruits, replacing refined foods. \n► Enhanced participants’ internal motivation to make health behavior changes, using a variety of \nnegotiating strategies based on readiness to consider change. Group Nutritionist Stanford University, School of Medicine, Stanford Prevention Research Center 1997  –  2004  (7 years) San Jose, California, United States Women’s’ Health Initiative (WHI) Study, NIH/ NHLBI  \nLed intervention groups in multi-center, national study, facilitating and presenting workshops, \none-on-one consults and telephone follow-ups for 155 participants, aged 50-79. \n \n► Delivered a comprehensive program including behavioral skills, problem solving, stress reduction, label reading, cooking and taste testing. \n► Led discussions and activities related to dietary change to effect a diet low in fat and high in vegetables, grains and fruits, replacing refined foods. \n► Enhanced participants’ internal motivation to make health behavior changes, using a variety of \nnegotiating strategies based on readiness to consider change. Languages   Skills Health Education Health Promotion Nutrition Public Health Clinical Research Program Facilitation Program Evaluation Public Speaking Skills  Health Education Health Promotion Nutrition Public Health Clinical Research Program Facilitation Program Evaluation Public Speaking Health Education Health Promotion Nutrition Public Health Clinical Research Program Facilitation Program Evaluation Public Speaking Health Education Health Promotion Nutrition Public Health Clinical Research Program Facilitation Program Evaluation Public Speaking Education University of California, Berkeley Nutritional Science Activities and Societies:  Phi Beta Kappa University of California, Berkeley Nutritional Science Activities and Societies:  Phi Beta Kappa University of California, Berkeley Nutritional Science Activities and Societies:  Phi Beta Kappa University of California, Berkeley Nutritional Science Activities and Societies:  Phi Beta Kappa Honors & Awards Employee of the Month, Stanford University, School of Medicine Outstanding Service Award The American Dietetic Association Leadership Award Girl Scouts of USA, Santa Clara County Employee of the Month, Stanford University, School of Medicine Employee of the Month, Stanford University, School of Medicine Employee of the Month, Stanford University, School of Medicine Outstanding Service Award The American Dietetic Association Outstanding Service Award The American Dietetic Association Outstanding Service Award The American Dietetic Association Leadership Award Girl Scouts of USA, Santa Clara County Leadership Award Girl Scouts of USA, Santa Clara County Leadership Award Girl Scouts of USA, Santa Clara County ", "Experience M.D. , Ph.D./ Senior Research Consultant Universities, Health and Wellness Organizations and for the Pharmaceutical Industry January 2005  – Present (10 years 8 months) Global Research Consultant Bioceans Care 2010  –  2011  (1 year) Genetics/Molecular Biology/Preventive Medicine Research Assistant and Health Educator Stanford University 1999  –  2004  (5 years) Student/Associate Researcher and Editor Tianjin University of Traditional Chinese Medicine 1996  –  1998  (2 years) Physician and Hospitalist (Urgent care and Internal Medicine) Hospital de Ecopetrol 1994  –  1996  (2 years) Hospital Director \"Centro de Salud Cantagallo\" Ecopetrol-Colombia 1993  –  1994  (1 year) M.D. , Ph.D./ Senior Research Consultant Universities, Health and Wellness Organizations and for the Pharmaceutical Industry January 2005  – Present (10 years 8 months) M.D. , Ph.D./ Senior Research Consultant Universities, Health and Wellness Organizations and for the Pharmaceutical Industry January 2005  – Present (10 years 8 months) Global Research Consultant Bioceans Care 2010  –  2011  (1 year) Global Research Consultant Bioceans Care 2010  –  2011  (1 year) Genetics/Molecular Biology/Preventive Medicine Research Assistant and Health Educator Stanford University 1999  –  2004  (5 years) Genetics/Molecular Biology/Preventive Medicine Research Assistant and Health Educator Stanford University 1999  –  2004  (5 years) Student/Associate Researcher and Editor Tianjin University of Traditional Chinese Medicine 1996  –  1998  (2 years) Student/Associate Researcher and Editor Tianjin University of Traditional Chinese Medicine 1996  –  1998  (2 years) Physician and Hospitalist (Urgent care and Internal Medicine) Hospital de Ecopetrol 1994  –  1996  (2 years) Physician and Hospitalist (Urgent care and Internal Medicine) Hospital de Ecopetrol 1994  –  1996  (2 years) Hospital Director \"Centro de Salud Cantagallo\" Ecopetrol-Colombia 1993  –  1994  (1 year) Hospital Director \"Centro de Salud Cantagallo\" Ecopetrol-Colombia 1993  –  1994  (1 year) Education Stanford University Tianjin University of Traditional Chinese Medicine Universidad Pontificia Bolivariana Stanford University Stanford University Stanford University Tianjin University of Traditional Chinese Medicine Tianjin University of Traditional Chinese Medicine Tianjin University of Traditional Chinese Medicine Universidad Pontificia Bolivariana Universidad Pontificia Bolivariana Universidad Pontificia Bolivariana ", "Languages English Spanish English Spanish English Spanish Skills Teaching Tutoring Leadership Youth Development Mentoring Community Outreach Fundraising Grant Writing Public Speaking Event Planning Research Nonprofits Analysis Program Development Qualitative Research Statistics Microsoft Office Non-profits Spanish Volunteer Management Staff Development Leadership Development Public Health Writing Budgets Business Networking Program Management Policy Community Organizing Editing Government Grants Policy Analysis Program Evaluation Budgeting Professional Networking Problem Solving See 22+     See less Skills  Teaching Tutoring Leadership Youth Development Mentoring Community Outreach Fundraising Grant Writing Public Speaking Event Planning Research Nonprofits Analysis Program Development Qualitative Research Statistics Microsoft Office Non-profits Spanish Volunteer Management Staff Development Leadership Development Public Health Writing Budgets Business Networking Program Management Policy Community Organizing Editing Government Grants Policy Analysis Program Evaluation Budgeting Professional Networking Problem Solving See 22+     See less Teaching Tutoring Leadership Youth Development Mentoring Community Outreach Fundraising Grant Writing Public Speaking Event Planning Research Nonprofits Analysis Program Development Qualitative Research Statistics Microsoft Office Non-profits Spanish Volunteer Management Staff Development Leadership Development Public Health Writing Budgets Business Networking Program Management Policy Community Organizing Editing Government Grants Policy Analysis Program Evaluation Budgeting Professional Networking Problem Solving See 22+     See less Teaching Tutoring Leadership Youth Development Mentoring Community Outreach Fundraising Grant Writing Public Speaking Event Planning Research Nonprofits Analysis Program Development Qualitative Research Statistics Microsoft Office Non-profits Spanish Volunteer Management Staff Development Leadership Development Public Health Writing Budgets Business Networking Program Management Policy Community Organizing Editing Government Grants Policy Analysis Program Evaluation Budgeting Professional Networking Problem Solving See 22+     See less Honors & Awards Bezos Educator Scholar Bezos Family Foundation May 2014 I was selected as one of 12 public school educators nationwide to attend the Aspen Ideas Festival alongside a Bezos Student Scholar in order to plan and launch a sustainable Local Ideas Festival. Louisiana Teacher Leader New Beginnings Schools Foundation May 2014 I was selected as one of two teachers to represent my school as a Teacher Leader in order to ensure that teachers are equipped with and maximizing the use of educational tools and resources to promote student learning. The program is run by the Louisiana Department of Education. Teacher of the Year - Nominee Lake Area New Tech Early College High School May 2014 I was selected as one of five nominees for the schoolwide \"Teacher of the Year\" award based on academic achievement, classroom management, and school involvement. ETS Recognition of Excellence Award Educational Testing Service July 2013 For scoring within the top 15% of all test takers who have taken the Praxis II Math: Content Knowledge assessment. This award indicates a high level of proficiency in an area critical for professional educators. Teacher of the Month Lake Area New Tech Early College High School October 2014 Selected by administration as Teacher of the Month for October 2014. 2nd Year Corps Member of Color Catalyst Award National Alumni of Color Association - The Collective GNO May 2015 I was selected as the first recipient of the award for outstanding achievement and continuous contributions to the success of my students, colleagues, and the community. Additional Honors & Awards Google for Education Certificate of Achievement, 2014 \nAlbert Schweitzer Fellow, 2011-2012 \nFront Line Leaders Academy, 2010 \nRBS Business Plan Scholar Choice Award, 2009 \nRBS Business Plan Competition (2nd place), 2009 \nRBSCSF Grant Recipient, 2008 \nMonster Scholar, 2007 \nYoung People For Fellow, 2007 \nNSBE Torchbearer, 2005-2007 \nNSBE Chapter Member of the Year (2x), 2006-2007 \nNSBE Ambassador, 2007 \nNSBE Academic Tech Bowl Region VI Champion, 2005 & 2007 \nNSBE Academic Tech Bowl National Champion, 2006 \nDean's Award for Academic Excellence (3x), 2005-2007 \nHaas Public Service Leadership Fellow, 2006-2007 \nJames W. Lyons Award for Service, 2006 \nStanford University Outstanding Male Freshman of the Year, 2005 \nStanford Engineering Diversity Leadership, Outreach, and Community Development Award, 2005 \nRon Brown Scholar, 2004 \nCoca-Cola Scholar, 2004 \nGates Millennium Scholar, 2004 \nSam Walton Community Scholar, 2004 \nNational Merit Scholar, 2004 \nNational Achievement Scholar, 2004 Bezos Educator Scholar Bezos Family Foundation May 2014 I was selected as one of 12 public school educators nationwide to attend the Aspen Ideas Festival alongside a Bezos Student Scholar in order to plan and launch a sustainable Local Ideas Festival. Bezos Educator Scholar Bezos Family Foundation May 2014 I was selected as one of 12 public school educators nationwide to attend the Aspen Ideas Festival alongside a Bezos Student Scholar in order to plan and launch a sustainable Local Ideas Festival. Bezos Educator Scholar Bezos Family Foundation May 2014 I was selected as one of 12 public school educators nationwide to attend the Aspen Ideas Festival alongside a Bezos Student Scholar in order to plan and launch a sustainable Local Ideas Festival. Louisiana Teacher Leader New Beginnings Schools Foundation May 2014 I was selected as one of two teachers to represent my school as a Teacher Leader in order to ensure that teachers are equipped with and maximizing the use of educational tools and resources to promote student learning. The program is run by the Louisiana Department of Education. Louisiana Teacher Leader New Beginnings Schools Foundation May 2014 I was selected as one of two teachers to represent my school as a Teacher Leader in order to ensure that teachers are equipped with and maximizing the use of educational tools and resources to promote student learning. The program is run by the Louisiana Department of Education. Louisiana Teacher Leader New Beginnings Schools Foundation May 2014 I was selected as one of two teachers to represent my school as a Teacher Leader in order to ensure that teachers are equipped with and maximizing the use of educational tools and resources to promote student learning. The program is run by the Louisiana Department of Education. Teacher of the Year - Nominee Lake Area New Tech Early College High School May 2014 I was selected as one of five nominees for the schoolwide \"Teacher of the Year\" award based on academic achievement, classroom management, and school involvement. Teacher of the Year - Nominee Lake Area New Tech Early College High School May 2014 I was selected as one of five nominees for the schoolwide \"Teacher of the Year\" award based on academic achievement, classroom management, and school involvement. Teacher of the Year - Nominee Lake Area New Tech Early College High School May 2014 I was selected as one of five nominees for the schoolwide \"Teacher of the Year\" award based on academic achievement, classroom management, and school involvement. ETS Recognition of Excellence Award Educational Testing Service July 2013 For scoring within the top 15% of all test takers who have taken the Praxis II Math: Content Knowledge assessment. This award indicates a high level of proficiency in an area critical for professional educators. ETS Recognition of Excellence Award Educational Testing Service July 2013 For scoring within the top 15% of all test takers who have taken the Praxis II Math: Content Knowledge assessment. This award indicates a high level of proficiency in an area critical for professional educators. ETS Recognition of Excellence Award Educational Testing Service July 2013 For scoring within the top 15% of all test takers who have taken the Praxis II Math: Content Knowledge assessment. This award indicates a high level of proficiency in an area critical for professional educators. Teacher of the Month Lake Area New Tech Early College High School October 2014 Selected by administration as Teacher of the Month for October 2014. Teacher of the Month Lake Area New Tech Early College High School October 2014 Selected by administration as Teacher of the Month for October 2014. Teacher of the Month Lake Area New Tech Early College High School October 2014 Selected by administration as Teacher of the Month for October 2014. 2nd Year Corps Member of Color Catalyst Award National Alumni of Color Association - The Collective GNO May 2015 I was selected as the first recipient of the award for outstanding achievement and continuous contributions to the success of my students, colleagues, and the community. 2nd Year Corps Member of Color Catalyst Award National Alumni of Color Association - The Collective GNO May 2015 I was selected as the first recipient of the award for outstanding achievement and continuous contributions to the success of my students, colleagues, and the community. 2nd Year Corps Member of Color Catalyst Award National Alumni of Color Association - The Collective GNO May 2015 I was selected as the first recipient of the award for outstanding achievement and continuous contributions to the success of my students, colleagues, and the community. Additional Honors & Awards Google for Education Certificate of Achievement, 2014 \nAlbert Schweitzer Fellow, 2011-2012 \nFront Line Leaders Academy, 2010 \nRBS Business Plan Scholar Choice Award, 2009 \nRBS Business Plan Competition (2nd place), 2009 \nRBSCSF Grant Recipient, 2008 \nMonster Scholar, 2007 \nYoung People For Fellow, 2007 \nNSBE Torchbearer, 2005-2007 \nNSBE Chapter Member of the Year (2x), 2006-2007 \nNSBE Ambassador, 2007 \nNSBE Academic Tech Bowl Region VI Champion, 2005 & 2007 \nNSBE Academic Tech Bowl National Champion, 2006 \nDean's Award for Academic Excellence (3x), 2005-2007 \nHaas Public Service Leadership Fellow, 2006-2007 \nJames W. Lyons Award for Service, 2006 \nStanford University Outstanding Male Freshman of the Year, 2005 \nStanford Engineering Diversity Leadership, Outreach, and Community Development Award, 2005 \nRon Brown Scholar, 2004 \nCoca-Cola Scholar, 2004 \nGates Millennium Scholar, 2004 \nSam Walton Community Scholar, 2004 \nNational Merit Scholar, 2004 \nNational Achievement Scholar, 2004 Additional Honors & Awards Google for Education Certificate of Achievement, 2014 \nAlbert Schweitzer Fellow, 2011-2012 \nFront Line Leaders Academy, 2010 \nRBS Business Plan Scholar Choice Award, 2009 \nRBS Business Plan Competition (2nd place), 2009 \nRBSCSF Grant Recipient, 2008 \nMonster Scholar, 2007 \nYoung People For Fellow, 2007 \nNSBE Torchbearer, 2005-2007 \nNSBE Chapter Member of the Year (2x), 2006-2007 \nNSBE Ambassador, 2007 \nNSBE Academic Tech Bowl Region VI Champion, 2005 & 2007 \nNSBE Academic Tech Bowl National Champion, 2006 \nDean's Award for Academic Excellence (3x), 2005-2007 \nHaas Public Service Leadership Fellow, 2006-2007 \nJames W. Lyons Award for Service, 2006 \nStanford University Outstanding Male Freshman of the Year, 2005 \nStanford Engineering Diversity Leadership, Outreach, and Community Development Award, 2005 \nRon Brown Scholar, 2004 \nCoca-Cola Scholar, 2004 \nGates Millennium Scholar, 2004 \nSam Walton Community Scholar, 2004 \nNational Merit Scholar, 2004 \nNational Achievement Scholar, 2004 Additional Honors & Awards Google for Education Certificate of Achievement, 2014 \nAlbert Schweitzer Fellow, 2011-2012 \nFront Line Leaders Academy, 2010 \nRBS Business Plan Scholar Choice Award, 2009 \nRBS Business Plan Competition (2nd place), 2009 \nRBSCSF Grant Recipient, 2008 \nMonster Scholar, 2007 \nYoung People For Fellow, 2007 \nNSBE Torchbearer, 2005-2007 \nNSBE Chapter Member of the Year (2x), 2006-2007 \nNSBE Ambassador, 2007 \nNSBE Academic Tech Bowl Region VI Champion, 2005 & 2007 \nNSBE Academic Tech Bowl National Champion, 2006 \nDean's Award for Academic Excellence (3x), 2005-2007 \nHaas Public Service Leadership Fellow, 2006-2007 \nJames W. Lyons Award for Service, 2006 \nStanford University Outstanding Male Freshman of the Year, 2005 \nStanford Engineering Diversity Leadership, Outreach, and Community Development Award, 2005 \nRon Brown Scholar, 2004 \nCoca-Cola Scholar, 2004 \nGates Millennium Scholar, 2004 \nSam Walton Community Scholar, 2004 \nNational Merit Scholar, 2004 \nNational Achievement Scholar, 2004 ", "Experience Owner Wright Health & Fitness July 2001  – Present (14 years 2 months) One hat is providing services, the other is being Fitness Director! Exercise Physiologist/Health Educator Stanford University Medical Center May 1991  –  August 1998  (7 years 4 months) Instructor Harvard University September 1989  –  May 1991  (1 year 9 months) Owner Wright Health & Fitness July 2001  – Present (14 years 2 months) One hat is providing services, the other is being Fitness Director! Owner Wright Health & Fitness July 2001  – Present (14 years 2 months) One hat is providing services, the other is being Fitness Director! Exercise Physiologist/Health Educator Stanford University Medical Center May 1991  –  August 1998  (7 years 4 months) Exercise Physiologist/Health Educator Stanford University Medical Center May 1991  –  August 1998  (7 years 4 months) Instructor Harvard University September 1989  –  May 1991  (1 year 9 months) Instructor Harvard University September 1989  –  May 1991  (1 year 9 months) Languages Spanish Spanish Spanish Skills Instructor - Certified Personal Training Management Customer Service Fitness Director Kinesiology Exercise Prescription Strength Training Exercise Physiology Fitness Training Strength & Conditioning Nutrition Fitness Cpr Certified Healing Skills  Instructor - Certified Personal Training Management Customer Service Fitness Director Kinesiology Exercise Prescription Strength Training Exercise Physiology Fitness Training Strength & Conditioning Nutrition Fitness Cpr Certified Healing Instructor - Certified Personal Training Management Customer Service Fitness Director Kinesiology Exercise Prescription Strength Training Exercise Physiology Fitness Training Strength & Conditioning Nutrition Fitness Cpr Certified Healing Instructor - Certified Personal Training Management Customer Service Fitness Director Kinesiology Exercise Prescription Strength Training Exercise Physiology Fitness Training Strength & Conditioning Nutrition Fitness Cpr Certified Healing Education Springfield College Masters of Education,  Exercise Physiology 1989  – 1991 Had a great experience here...taught movement in the very gymnasium where basketball was invented! Loved the graduate curriculum and professors. Finished with an internship at Harvard and my Thesis written in part during a 2nd internship at the Aerobics Activity Center in Dallas. Activities and Societies:  Graduate Teaching Fellow\nCross-cultural Club Northfield Mount Hermon 1979  – 1981 University of Michigan Bachelor of Science (B.S.),  Kinesiology and Exercise Science Springfield College Masters of Education,  Exercise Physiology 1989  – 1991 Had a great experience here...taught movement in the very gymnasium where basketball was invented! Loved the graduate curriculum and professors. Finished with an internship at Harvard and my Thesis written in part during a 2nd internship at the Aerobics Activity Center in Dallas. Activities and Societies:  Graduate Teaching Fellow\nCross-cultural Club Springfield College Masters of Education,  Exercise Physiology 1989  – 1991 Had a great experience here...taught movement in the very gymnasium where basketball was invented! Loved the graduate curriculum and professors. Finished with an internship at Harvard and my Thesis written in part during a 2nd internship at the Aerobics Activity Center in Dallas. Activities and Societies:  Graduate Teaching Fellow\nCross-cultural Club Springfield College Masters of Education,  Exercise Physiology 1989  – 1991 Had a great experience here...taught movement in the very gymnasium where basketball was invented! Loved the graduate curriculum and professors. Finished with an internship at Harvard and my Thesis written in part during a 2nd internship at the Aerobics Activity Center in Dallas. Activities and Societies:  Graduate Teaching Fellow\nCross-cultural Club Northfield Mount Hermon 1979  – 1981 Northfield Mount Hermon 1979  – 1981 Northfield Mount Hermon 1979  – 1981 University of Michigan Bachelor of Science (B.S.),  Kinesiology and Exercise Science University of Michigan Bachelor of Science (B.S.),  Kinesiology and Exercise Science University of Michigan Bachelor of Science (B.S.),  Kinesiology and Exercise Science ", "Experience CME Quality Coordinator/Analyst Palo Alto Medical Foundation November 2011  – Present (3 years 10 months) Health Educator Stanford University School of Medicine February 2010  –  November 2011  (1 year 10 months) San Jose, CA Served as a health educator and research associate within the Stanford Prevention Research Center working with research staff to ensure a safe, effective program was delivered to all participants. Required immense problem-solving skills to assess potential obstacles but also initiative in situations that may not be directly assessed in the research protocols.  \n \n•\tConducted individual cognitive-behavioral interventions and counseling, prepared and administered pharmacotherapy and monitored physiological measures for participants in the program \n•\tAssisted with recruitment efforts, conducted in-person screenings, and physiological and psychosocial screenings  \n•\tAssisted in the management of the data collection and maintained participant files including data entry and participant tracking \n CME Quality Coordinator/Analyst Palo Alto Medical Foundation November 2011  – Present (3 years 10 months) CME Quality Coordinator/Analyst Palo Alto Medical Foundation November 2011  – Present (3 years 10 months) Health Educator Stanford University School of Medicine February 2010  –  November 2011  (1 year 10 months) San Jose, CA Served as a health educator and research associate within the Stanford Prevention Research Center working with research staff to ensure a safe, effective program was delivered to all participants. Required immense problem-solving skills to assess potential obstacles but also initiative in situations that may not be directly assessed in the research protocols.  \n \n•\tConducted individual cognitive-behavioral interventions and counseling, prepared and administered pharmacotherapy and monitored physiological measures for participants in the program \n•\tAssisted with recruitment efforts, conducted in-person screenings, and physiological and psychosocial screenings  \n•\tAssisted in the management of the data collection and maintained participant files including data entry and participant tracking \n Health Educator Stanford University School of Medicine February 2010  –  November 2011  (1 year 10 months) San Jose, CA Served as a health educator and research associate within the Stanford Prevention Research Center working with research staff to ensure a safe, effective program was delivered to all participants. Required immense problem-solving skills to assess potential obstacles but also initiative in situations that may not be directly assessed in the research protocols.  \n \n•\tConducted individual cognitive-behavioral interventions and counseling, prepared and administered pharmacotherapy and monitored physiological measures for participants in the program \n•\tAssisted with recruitment efforts, conducted in-person screenings, and physiological and psychosocial screenings  \n•\tAssisted in the management of the data collection and maintained participant files including data entry and participant tracking \n Skills Clinical Research Nutrition Education Nutrition Healthcare Quality Improvement Research Non-profits EHR Health Education Prevention Event Planning Community Health Pediatrics Clarity Data Model -... Healthcare Management Hospitals Nonprofits Public Health See 3+     See less Skills  Clinical Research Nutrition Education Nutrition Healthcare Quality Improvement Research Non-profits EHR Health Education Prevention Event Planning Community Health Pediatrics Clarity Data Model -... Healthcare Management Hospitals Nonprofits Public Health See 3+     See less Clinical Research Nutrition Education Nutrition Healthcare Quality Improvement Research Non-profits EHR Health Education Prevention Event Planning Community Health Pediatrics Clarity Data Model -... Healthcare Management Hospitals Nonprofits Public Health See 3+     See less Clinical Research Nutrition Education Nutrition Healthcare Quality Improvement Research Non-profits EHR Health Education Prevention Event Planning Community Health Pediatrics Clarity Data Model -... Healthcare Management Hospitals Nonprofits Public Health See 3+     See less Education San Jose State University BS,  Nutrition San Jose State University BS,  Nutrition San Jose State University BS,  Nutrition San Jose State University BS,  Nutrition "]}