{"position": "IT Business Analyst", "company": "Stanford University", "profiles": ["Languages English Native or bilingual proficiency French Native or bilingual proficiency Danish Professional working proficiency Armenian Professional working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Danish Professional working proficiency Armenian Professional working proficiency English Native or bilingual proficiency French Native or bilingual proficiency Danish Professional working proficiency Armenian Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Requirements Analysis Business Analysis Integration Requirements Gathering User Acceptance Testing Business Requirements Business Process Design Functional... Functional Analysis Project Management Analytical Skills Software Project... Teamwork PMP Telecommunications PL/SQL C++ Siebel Project Planning Perl Requirements Management Team-oriented Client Liaison Helping Clients Succeed IT Solutions Oracle CRM Oracle Clinical Oracle Forms Oracle PL/SQL... 21 CFR Part 11 Computer System... See 16+     See less Skills  Requirements Analysis Business Analysis Integration Requirements Gathering User Acceptance Testing Business Requirements Business Process Design Functional... Functional Analysis Project Management Analytical Skills Software Project... Teamwork PMP Telecommunications PL/SQL C++ Siebel Project Planning Perl Requirements Management Team-oriented Client Liaison Helping Clients Succeed IT Solutions Oracle CRM Oracle Clinical Oracle Forms Oracle PL/SQL... 21 CFR Part 11 Computer System... See 16+     See less Requirements Analysis Business Analysis Integration Requirements Gathering User Acceptance Testing Business Requirements Business Process Design Functional... Functional Analysis Project Management Analytical Skills Software Project... Teamwork PMP Telecommunications PL/SQL C++ Siebel Project Planning Perl Requirements Management Team-oriented Client Liaison Helping Clients Succeed IT Solutions Oracle CRM Oracle Clinical Oracle Forms Oracle PL/SQL... 21 CFR Part 11 Computer System... See 16+     See less Requirements Analysis Business Analysis Integration Requirements Gathering User Acceptance Testing Business Requirements Business Process Design Functional... Functional Analysis Project Management Analytical Skills Software Project... Teamwork PMP Telecommunications PL/SQL C++ Siebel Project Planning Perl Requirements Management Team-oriented Client Liaison Helping Clients Succeed IT Solutions Oracle CRM Oracle Clinical Oracle Forms Oracle PL/SQL... 21 CFR Part 11 Computer System... See 16+     See less ", "Experience IT Business Analyst Stanford University IT Business Analyst Stanford University IT Business Analyst Stanford University Skills Business Analysis Research Data Analysis Project Management Microsoft Office Skills  Business Analysis Research Data Analysis Project Management Microsoft Office Business Analysis Research Data Analysis Project Management Microsoft Office Business Analysis Research Data Analysis Project Management Microsoft Office Education University of San Francisco Master’s Degree,  Management Information Systems 2012  – 2014 UC Davis Bachelor's degree,  Psychology 2004  – 2008 University of San Francisco Master’s Degree,  Management Information Systems 2012  – 2014 University of San Francisco Master’s Degree,  Management Information Systems 2012  – 2014 University of San Francisco Master’s Degree,  Management Information Systems 2012  – 2014 UC Davis Bachelor's degree,  Psychology 2004  – 2008 UC Davis Bachelor's degree,  Psychology 2004  – 2008 UC Davis Bachelor's degree,  Psychology 2004  – 2008 ", "Experience Program Manager, Stanford Electronic Research Administration (SeRA) Stanford University May 2014  – Present (1 year 4 months) Palo Alto, CA IT Business Analyst Manager Stanford University May 2012  –  May 2014  (2 years 1 month) IT Business Analyst Stanford University February 2012  –  May 2012  (4 months) Palo Alto, CA Manager, Research Systems The University of British Columbia September 2011  –  February 2012  (6 months) Project Manager The University of British Columbia September 2010  –  February 2012  (1 year 6 months) Business Analyst The University of British Columbia November 2004  –  September 2010  (5 years 11 months) Business Systems Analyst RPO Management Consultants March 2003  –  November 2004  (1 year 9 months) Quality Assurance and Implementation Analyst ResponseTek September 2002  –  March 2003  (7 months) Program Manager, Stanford Electronic Research Administration (SeRA) Stanford University May 2014  – Present (1 year 4 months) Palo Alto, CA Program Manager, Stanford Electronic Research Administration (SeRA) Stanford University May 2014  – Present (1 year 4 months) Palo Alto, CA IT Business Analyst Manager Stanford University May 2012  –  May 2014  (2 years 1 month) IT Business Analyst Manager Stanford University May 2012  –  May 2014  (2 years 1 month) IT Business Analyst Stanford University February 2012  –  May 2012  (4 months) Palo Alto, CA IT Business Analyst Stanford University February 2012  –  May 2012  (4 months) Palo Alto, CA Manager, Research Systems The University of British Columbia September 2011  –  February 2012  (6 months) Manager, Research Systems The University of British Columbia September 2011  –  February 2012  (6 months) Project Manager The University of British Columbia September 2010  –  February 2012  (1 year 6 months) Project Manager The University of British Columbia September 2010  –  February 2012  (1 year 6 months) Business Analyst The University of British Columbia November 2004  –  September 2010  (5 years 11 months) Business Analyst The University of British Columbia November 2004  –  September 2010  (5 years 11 months) Business Systems Analyst RPO Management Consultants March 2003  –  November 2004  (1 year 9 months) Business Systems Analyst RPO Management Consultants March 2003  –  November 2004  (1 year 9 months) Quality Assurance and Implementation Analyst ResponseTek September 2002  –  March 2003  (7 months) Quality Assurance and Implementation Analyst ResponseTek September 2002  –  March 2003  (7 months) Skills Requirements Gathering Business Requirements User Acceptance Testing Business Process Design Business Analysis Visio Software Project... Business Process Business Process... Project Management SDLC Quality Assurance Agile Methodologies Functional Requirements Business Process... Functional... Business Process Mapping Wireframes Mockups Gap Analysis Elicitation Process Flow Prototype Team Management System Testing JIRA BizAgi Training Process Mapping Project Planning User Manual Development Use Case Job Aids Axure balsamiq Confluence UAT coordination User Guide Creation User Stories Functional Design Scrum Product Management See 27+     See less Skills  Requirements Gathering Business Requirements User Acceptance Testing Business Process Design Business Analysis Visio Software Project... Business Process Business Process... Project Management SDLC Quality Assurance Agile Methodologies Functional Requirements Business Process... Functional... Business Process Mapping Wireframes Mockups Gap Analysis Elicitation Process Flow Prototype Team Management System Testing JIRA BizAgi Training Process Mapping Project Planning User Manual Development Use Case Job Aids Axure balsamiq Confluence UAT coordination User Guide Creation User Stories Functional Design Scrum Product Management See 27+     See less Requirements Gathering Business Requirements User Acceptance Testing Business Process Design Business Analysis Visio Software Project... Business Process Business Process... Project Management SDLC Quality Assurance Agile Methodologies Functional Requirements Business Process... Functional... Business Process Mapping Wireframes Mockups Gap Analysis Elicitation Process Flow Prototype Team Management System Testing JIRA BizAgi Training Process Mapping Project Planning User Manual Development Use Case Job Aids Axure balsamiq Confluence UAT coordination User Guide Creation User Stories Functional Design Scrum Product Management See 27+     See less Requirements Gathering Business Requirements User Acceptance Testing Business Process Design Business Analysis Visio Software Project... Business Process Business Process... Project Management SDLC Quality Assurance Agile Methodologies Functional Requirements Business Process... Functional... Business Process Mapping Wireframes Mockups Gap Analysis Elicitation Process Flow Prototype Team Management System Testing JIRA BizAgi Training Process Mapping Project Planning User Manual Development Use Case Job Aids Axure balsamiq Confluence UAT coordination User Guide Creation User Stories Functional Design Scrum Product Management See 27+     See less Education The University of British Columbia BCOM,  Management Information Systems 1997  – 2002 The University of British Columbia BCOM,  Management Information Systems 1997  – 2002 The University of British Columbia BCOM,  Management Information Systems 1997  – 2002 The University of British Columbia BCOM,  Management Information Systems 1997  – 2002 ", "Experience Senior Instructional Designer Fredrickson Communications July 2014  – Present (1 year 2 months) Currently developing training and reference materials for Microsoft Office 365 rollout at client site. \n \nSOFTWARE SKILLS:  \nMicrosoft Word / PowerPoint / Excel / Access / Visio / OneNote \nArticulate / QuizMaker / Engage / Storyline / Captivate \nRoboHelp / Adobe Acrobat / SnagIt / OneNote \nHTML / FrontPage / Dreamweaver \nMicrosoft SharePoint Designer \nSQL / Oracle (Siebel) eCRM LMS / Salesforce / Peoplesoft SA HR LMS / LearnShare LMS \nWebEx, Adobe Connect, Level 3 Hardware/Software Consultant University of Minnesota March 2014  –  June 2014  (4 months) Assisted staff with migration from Windows XP to Windows 7. Setup new laptops and docking stations. \n- Temporary position. \n- Conducted troubleshooting working with appropriate support teams to see issues through to resolution. \n- Wrote documentation on new and revised processes. \n- Provided vacation coverage for office staff. Training Consultant | Oracle eCRM, Salesforce.com eCRM, PeopleSoft LMS, Project Management UnitedHealthcare January 2004  –  June 2013  (9 years 6 months) Engaged with application development, help desk, sales leadership and Subject Matter Experts (SMEs) to plan, develop, deliver and maintain training programs for UnitedHealthcare’s Oracle applications. \n- Used PowerPoint, Word, WebEx, Articulate Presenter, QuizMaker, Engage and Captivate to develop, deliver and maintain a suite of instructor-led webinars, classroom sessions, on-line courses and Job Aids for various projects consistently achieving high customer satisfaction. \n- Wrote monthly communications explaining impacts and benefits of application changes to support current business needs. Incorporated these changes into curriculum as needed to provide best practices. \n- Conducted monthly and ad hoc webcasts for UnitedHealthcare's 4,400 Key Account, Public Sector and Small Business Oracle eCRM and Sales Analytics users to help them use sales force automation tools more effectively and efficiently. \n- Served as Project Manager for a variety of data clean-up projects and field initiatives working with various Health Plans and departments. \n- Participated in weekly calls with application development providing training development status as well as feedback on application development's design approach during Business Requirement Document and Detail Design reviews and User Acceptance Testing. \n- SME for Learning Management System (LMS) addressing user questions and sharing best practices. \n- Active member of Learning & Development's Training Forum and department's LMS user group. \n- Defined and implemented best practices for department's use of LMS. \n- Led project and co-developed training portal for posting Job Aids, reference material and training opportunities making Performance Support resources accessible to users so they can work more efficiently. Received recognition bonus. \n- Served as SME and co-managed project to migrate 3,330 courses from department's proprietary Learning Management System (LMS) to corporate LMS. Received recognition bonus. IT Business Analyst Stanford University February 2002  –  July 2003  (1 year 6 months) Planned, coordinated and managed the administration, analysis, design and coding of required changes to PeopleSoft Student Administration’s Financial Aid and proprietary Graduate Financial Support modules. \n- Met with developers and business owners to define user requirements and implemented fixes and enhancements to address academic department needs. \n- Wrote functional specifications for development and configuration requirements to result in the best design for new features. \n- Created test plans and testing scripts for user acceptance testing to ensure design worked as intended. \n- Resolved escalated help desk calls. \n- Managed implementation and testing of application patches. Software Instructor Stanford University April 2001  –  February 2002  (11 months) Developed and delivered training to support the implementation of PeopleSoft Student Administration and Brio Reports. \n- Developed on-line courses for transient student workers to learn how to complete tasks as well as refresh staff on proper procedures. \n- Delivered instructor-led classes as well as customized department training workshops and presentations which increased adoption of the new system. \n- Shared Help Desk responsibilities ensuring adequate coverage and quality customer service.  \n- Created and maintained website to facilitate distribution of user documentation and training materials. eLearning Services Manager Interwise July 1999  –  January 2001  (1 year 7 months) Responsible for development, design and implementation of all employee and customer training programs. \n- Designed and implemented standardized role-based employee curriculum. \n- Produced and delivered internal training program for Siebel and Remedy implementations which improved sales and help desk productivity. \n- Conceived and assumed leadership role in global product training program which increased employee product knowledge. Senior Sales Trainer Cisco Systems March 1998  –  June 1999  (1 year 4 months) Worked with help desk, leadership and SMEs to develop and deliver training for Cisco’s sales force’s use of Oracle and other applications and on-line resources used for forecasting and streamlining the sales process. \n- Full-time Contractor with Adecco working in Cisco's Sales IT organization. \n- Developed and managed Cisco's sales tools training program for the Americas and Americas International Theatre. \n- Delivered standard sales tools classes as well as special training requests. \n- Trained new instructors. Lead Developer Cisco Systems February 1997  –  March 1998  (1 year 2 months) Developed and managed Cisco's IT New Hire Training Program and training team. \n- Full-time Contractor with Learnsoft University working in Cisco's IT Training organization. \n- Developed and managed Cisco's IT New Hire Training Program. \n- Managed on-site training-support team. \n- Met with departments throughout the company assessing training needs, creating and implementing effective training and support solutions to achieve their objectives. Software Instructor Learnsoft University July 1993  –  February 1997  (3 years 8 months) Delivered classroom training classes specializing in database and spreadsheet applications. \n- Defined training needs of customers and wrote customized curriculum providing them with effective training solutions to improve employee productivity. \n- Served as mentor for new instructors sharing best practices and helping them to be productive faster. Senior Instructional Designer Fredrickson Communications July 2014  – Present (1 year 2 months) Currently developing training and reference materials for Microsoft Office 365 rollout at client site. \n \nSOFTWARE SKILLS:  \nMicrosoft Word / PowerPoint / Excel / Access / Visio / OneNote \nArticulate / QuizMaker / Engage / Storyline / Captivate \nRoboHelp / Adobe Acrobat / SnagIt / OneNote \nHTML / FrontPage / Dreamweaver \nMicrosoft SharePoint Designer \nSQL / Oracle (Siebel) eCRM LMS / Salesforce / Peoplesoft SA HR LMS / LearnShare LMS \nWebEx, Adobe Connect, Level 3 Senior Instructional Designer Fredrickson Communications July 2014  – Present (1 year 2 months) Currently developing training and reference materials for Microsoft Office 365 rollout at client site. \n \nSOFTWARE SKILLS:  \nMicrosoft Word / PowerPoint / Excel / Access / Visio / OneNote \nArticulate / QuizMaker / Engage / Storyline / Captivate \nRoboHelp / Adobe Acrobat / SnagIt / OneNote \nHTML / FrontPage / Dreamweaver \nMicrosoft SharePoint Designer \nSQL / Oracle (Siebel) eCRM LMS / Salesforce / Peoplesoft SA HR LMS / LearnShare LMS \nWebEx, Adobe Connect, Level 3 Hardware/Software Consultant University of Minnesota March 2014  –  June 2014  (4 months) Assisted staff with migration from Windows XP to Windows 7. Setup new laptops and docking stations. \n- Temporary position. \n- Conducted troubleshooting working with appropriate support teams to see issues through to resolution. \n- Wrote documentation on new and revised processes. \n- Provided vacation coverage for office staff. Hardware/Software Consultant University of Minnesota March 2014  –  June 2014  (4 months) Assisted staff with migration from Windows XP to Windows 7. Setup new laptops and docking stations. \n- Temporary position. \n- Conducted troubleshooting working with appropriate support teams to see issues through to resolution. \n- Wrote documentation on new and revised processes. \n- Provided vacation coverage for office staff. Training Consultant | Oracle eCRM, Salesforce.com eCRM, PeopleSoft LMS, Project Management UnitedHealthcare January 2004  –  June 2013  (9 years 6 months) Engaged with application development, help desk, sales leadership and Subject Matter Experts (SMEs) to plan, develop, deliver and maintain training programs for UnitedHealthcare’s Oracle applications. \n- Used PowerPoint, Word, WebEx, Articulate Presenter, QuizMaker, Engage and Captivate to develop, deliver and maintain a suite of instructor-led webinars, classroom sessions, on-line courses and Job Aids for various projects consistently achieving high customer satisfaction. \n- Wrote monthly communications explaining impacts and benefits of application changes to support current business needs. Incorporated these changes into curriculum as needed to provide best practices. \n- Conducted monthly and ad hoc webcasts for UnitedHealthcare's 4,400 Key Account, Public Sector and Small Business Oracle eCRM and Sales Analytics users to help them use sales force automation tools more effectively and efficiently. \n- Served as Project Manager for a variety of data clean-up projects and field initiatives working with various Health Plans and departments. \n- Participated in weekly calls with application development providing training development status as well as feedback on application development's design approach during Business Requirement Document and Detail Design reviews and User Acceptance Testing. \n- SME for Learning Management System (LMS) addressing user questions and sharing best practices. \n- Active member of Learning & Development's Training Forum and department's LMS user group. \n- Defined and implemented best practices for department's use of LMS. \n- Led project and co-developed training portal for posting Job Aids, reference material and training opportunities making Performance Support resources accessible to users so they can work more efficiently. Received recognition bonus. \n- Served as SME and co-managed project to migrate 3,330 courses from department's proprietary Learning Management System (LMS) to corporate LMS. Received recognition bonus. Training Consultant | Oracle eCRM, Salesforce.com eCRM, PeopleSoft LMS, Project Management UnitedHealthcare January 2004  –  June 2013  (9 years 6 months) Engaged with application development, help desk, sales leadership and Subject Matter Experts (SMEs) to plan, develop, deliver and maintain training programs for UnitedHealthcare’s Oracle applications. \n- Used PowerPoint, Word, WebEx, Articulate Presenter, QuizMaker, Engage and Captivate to develop, deliver and maintain a suite of instructor-led webinars, classroom sessions, on-line courses and Job Aids for various projects consistently achieving high customer satisfaction. \n- Wrote monthly communications explaining impacts and benefits of application changes to support current business needs. Incorporated these changes into curriculum as needed to provide best practices. \n- Conducted monthly and ad hoc webcasts for UnitedHealthcare's 4,400 Key Account, Public Sector and Small Business Oracle eCRM and Sales Analytics users to help them use sales force automation tools more effectively and efficiently. \n- Served as Project Manager for a variety of data clean-up projects and field initiatives working with various Health Plans and departments. \n- Participated in weekly calls with application development providing training development status as well as feedback on application development's design approach during Business Requirement Document and Detail Design reviews and User Acceptance Testing. \n- SME for Learning Management System (LMS) addressing user questions and sharing best practices. \n- Active member of Learning & Development's Training Forum and department's LMS user group. \n- Defined and implemented best practices for department's use of LMS. \n- Led project and co-developed training portal for posting Job Aids, reference material and training opportunities making Performance Support resources accessible to users so they can work more efficiently. Received recognition bonus. \n- Served as SME and co-managed project to migrate 3,330 courses from department's proprietary Learning Management System (LMS) to corporate LMS. Received recognition bonus. IT Business Analyst Stanford University February 2002  –  July 2003  (1 year 6 months) Planned, coordinated and managed the administration, analysis, design and coding of required changes to PeopleSoft Student Administration’s Financial Aid and proprietary Graduate Financial Support modules. \n- Met with developers and business owners to define user requirements and implemented fixes and enhancements to address academic department needs. \n- Wrote functional specifications for development and configuration requirements to result in the best design for new features. \n- Created test plans and testing scripts for user acceptance testing to ensure design worked as intended. \n- Resolved escalated help desk calls. \n- Managed implementation and testing of application patches. IT Business Analyst Stanford University February 2002  –  July 2003  (1 year 6 months) Planned, coordinated and managed the administration, analysis, design and coding of required changes to PeopleSoft Student Administration’s Financial Aid and proprietary Graduate Financial Support modules. \n- Met with developers and business owners to define user requirements and implemented fixes and enhancements to address academic department needs. \n- Wrote functional specifications for development and configuration requirements to result in the best design for new features. \n- Created test plans and testing scripts for user acceptance testing to ensure design worked as intended. \n- Resolved escalated help desk calls. \n- Managed implementation and testing of application patches. Software Instructor Stanford University April 2001  –  February 2002  (11 months) Developed and delivered training to support the implementation of PeopleSoft Student Administration and Brio Reports. \n- Developed on-line courses for transient student workers to learn how to complete tasks as well as refresh staff on proper procedures. \n- Delivered instructor-led classes as well as customized department training workshops and presentations which increased adoption of the new system. \n- Shared Help Desk responsibilities ensuring adequate coverage and quality customer service.  \n- Created and maintained website to facilitate distribution of user documentation and training materials. Software Instructor Stanford University April 2001  –  February 2002  (11 months) Developed and delivered training to support the implementation of PeopleSoft Student Administration and Brio Reports. \n- Developed on-line courses for transient student workers to learn how to complete tasks as well as refresh staff on proper procedures. \n- Delivered instructor-led classes as well as customized department training workshops and presentations which increased adoption of the new system. \n- Shared Help Desk responsibilities ensuring adequate coverage and quality customer service.  \n- Created and maintained website to facilitate distribution of user documentation and training materials. eLearning Services Manager Interwise July 1999  –  January 2001  (1 year 7 months) Responsible for development, design and implementation of all employee and customer training programs. \n- Designed and implemented standardized role-based employee curriculum. \n- Produced and delivered internal training program for Siebel and Remedy implementations which improved sales and help desk productivity. \n- Conceived and assumed leadership role in global product training program which increased employee product knowledge. eLearning Services Manager Interwise July 1999  –  January 2001  (1 year 7 months) Responsible for development, design and implementation of all employee and customer training programs. \n- Designed and implemented standardized role-based employee curriculum. \n- Produced and delivered internal training program for Siebel and Remedy implementations which improved sales and help desk productivity. \n- Conceived and assumed leadership role in global product training program which increased employee product knowledge. Senior Sales Trainer Cisco Systems March 1998  –  June 1999  (1 year 4 months) Worked with help desk, leadership and SMEs to develop and deliver training for Cisco’s sales force’s use of Oracle and other applications and on-line resources used for forecasting and streamlining the sales process. \n- Full-time Contractor with Adecco working in Cisco's Sales IT organization. \n- Developed and managed Cisco's sales tools training program for the Americas and Americas International Theatre. \n- Delivered standard sales tools classes as well as special training requests. \n- Trained new instructors. Senior Sales Trainer Cisco Systems March 1998  –  June 1999  (1 year 4 months) Worked with help desk, leadership and SMEs to develop and deliver training for Cisco’s sales force’s use of Oracle and other applications and on-line resources used for forecasting and streamlining the sales process. \n- Full-time Contractor with Adecco working in Cisco's Sales IT organization. \n- Developed and managed Cisco's sales tools training program for the Americas and Americas International Theatre. \n- Delivered standard sales tools classes as well as special training requests. \n- Trained new instructors. Lead Developer Cisco Systems February 1997  –  March 1998  (1 year 2 months) Developed and managed Cisco's IT New Hire Training Program and training team. \n- Full-time Contractor with Learnsoft University working in Cisco's IT Training organization. \n- Developed and managed Cisco's IT New Hire Training Program. \n- Managed on-site training-support team. \n- Met with departments throughout the company assessing training needs, creating and implementing effective training and support solutions to achieve their objectives. Lead Developer Cisco Systems February 1997  –  March 1998  (1 year 2 months) Developed and managed Cisco's IT New Hire Training Program and training team. \n- Full-time Contractor with Learnsoft University working in Cisco's IT Training organization. \n- Developed and managed Cisco's IT New Hire Training Program. \n- Managed on-site training-support team. \n- Met with departments throughout the company assessing training needs, creating and implementing effective training and support solutions to achieve their objectives. Software Instructor Learnsoft University July 1993  –  February 1997  (3 years 8 months) Delivered classroom training classes specializing in database and spreadsheet applications. \n- Defined training needs of customers and wrote customized curriculum providing them with effective training solutions to improve employee productivity. \n- Served as mentor for new instructors sharing best practices and helping them to be productive faster. Software Instructor Learnsoft University July 1993  –  February 1997  (3 years 8 months) Delivered classroom training classes specializing in database and spreadsheet applications. \n- Defined training needs of customers and wrote customized curriculum providing them with effective training solutions to improve employee productivity. \n- Served as mentor for new instructors sharing best practices and helping them to be productive faster. Skills Blended Learning Online Training Instructor-led Training Instructional Design Learning Management Captivate ADDIE Microsoft Excel PowerPoint Project Management Technical Writing Presenter Adult Learning... Training Delivery Articulate Suite Oracle eCRM Oracle Applications FrontPage HTML Webcasting Dreamweaver RoboHelp Adobe Acrobat Learning Management... Microsoft Word Outlook Lotus Notes SQL Public Speaking Communication Skills Writing Quizmaker Training Articulate Engage Visio Articulate Communicator Webcast Producer Articulate Presenter WebEx Adobe Connect Microsoft Access Microsoft SharePoint... PeopleSoft Student... Articulate Studio Articulate Storyline OneNote Performance Support See 32+     See less Skills  Blended Learning Online Training Instructor-led Training Instructional Design Learning Management Captivate ADDIE Microsoft Excel PowerPoint Project Management Technical Writing Presenter Adult Learning... Training Delivery Articulate Suite Oracle eCRM Oracle Applications FrontPage HTML Webcasting Dreamweaver RoboHelp Adobe Acrobat Learning Management... Microsoft Word Outlook Lotus Notes SQL Public Speaking Communication Skills Writing Quizmaker Training Articulate Engage Visio Articulate Communicator Webcast Producer Articulate Presenter WebEx Adobe Connect Microsoft Access Microsoft SharePoint... PeopleSoft Student... Articulate Studio Articulate Storyline OneNote Performance Support See 32+     See less Blended Learning Online Training Instructor-led Training Instructional Design Learning Management Captivate ADDIE Microsoft Excel PowerPoint Project Management Technical Writing Presenter Adult Learning... Training Delivery Articulate Suite Oracle eCRM Oracle Applications FrontPage HTML Webcasting Dreamweaver RoboHelp Adobe Acrobat Learning Management... Microsoft Word Outlook Lotus Notes SQL Public Speaking Communication Skills Writing Quizmaker Training Articulate Engage Visio Articulate Communicator Webcast Producer Articulate Presenter WebEx Adobe Connect Microsoft Access Microsoft SharePoint... PeopleSoft Student... Articulate Studio Articulate Storyline OneNote Performance Support See 32+     See less Blended Learning Online Training Instructor-led Training Instructional Design Learning Management Captivate ADDIE Microsoft Excel PowerPoint Project Management Technical Writing Presenter Adult Learning... Training Delivery Articulate Suite Oracle eCRM Oracle Applications FrontPage HTML Webcasting Dreamweaver RoboHelp Adobe Acrobat Learning Management... Microsoft Word Outlook Lotus Notes SQL Public Speaking Communication Skills Writing Quizmaker Training Articulate Engage Visio Articulate Communicator Webcast Producer Articulate Presenter WebEx Adobe Connect Microsoft Access Microsoft SharePoint... PeopleSoft Student... Articulate Studio Articulate Storyline OneNote Performance Support See 32+     See less Education Minnesota State University, Mankato Bachelor's degree,  Marketing and International Business Activities and Societies:  AIESEC Minnesota State University, Mankato Bachelor's degree,  Marketing and International Business Activities and Societies:  AIESEC Minnesota State University, Mankato Bachelor's degree,  Marketing and International Business Activities and Societies:  AIESEC Minnesota State University, Mankato Bachelor's degree,  Marketing and International Business Activities and Societies:  AIESEC ", "Skills Oracle Applications Program Management Project Management Software Documentation Product Management Functional Design Analysis Business Process... Enterprise Software Oracle E-Business Suite Software Design Databases Access Process Improvement Training Leadership Oracle Project Planning Management See 4+     See less Skills  Oracle Applications Program Management Project Management Software Documentation Product Management Functional Design Analysis Business Process... Enterprise Software Oracle E-Business Suite Software Design Databases Access Process Improvement Training Leadership Oracle Project Planning Management See 4+     See less Oracle Applications Program Management Project Management Software Documentation Product Management Functional Design Analysis Business Process... Enterprise Software Oracle E-Business Suite Software Design Databases Access Process Improvement Training Leadership Oracle Project Planning Management See 4+     See less Oracle Applications Program Management Project Management Software Documentation Product Management Functional Design Analysis Business Process... Enterprise Software Oracle E-Business Suite Software Design Databases Access Process Improvement Training Leadership Oracle Project Planning Management See 4+     See less ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Program Management Software Project... Requirements Analysis Business Analysis Training Data Analysis Testing Requirements Gathering Business Process Business Process... Analysis Software Documentation Business Intelligence Skills  Program Management Software Project... Requirements Analysis Business Analysis Training Data Analysis Testing Requirements Gathering Business Process Business Process... Analysis Software Documentation Business Intelligence Program Management Software Project... Requirements Analysis Business Analysis Training Data Analysis Testing Requirements Gathering Business Process Business Process... Analysis Software Documentation Business Intelligence Program Management Software Project... Requirements Analysis Business Analysis Training Data Analysis Testing Requirements Gathering Business Process Business Process... Analysis Software Documentation Business Intelligence ", "Summary Business Systems Analyst with experience in both small-scale and large-scale, enterprise projects involving both off-the-shelf and custom built systems. Involved in all aspects of the system development lifecycle from conception, project scoping, requirements elicitation, product selection, technical design, implementation, testing, and operational support. \n \nStrengths: Analytical, detail-oriented, data-oriented, client focused, excellent communication skills, intelligent Summary Business Systems Analyst with experience in both small-scale and large-scale, enterprise projects involving both off-the-shelf and custom built systems. Involved in all aspects of the system development lifecycle from conception, project scoping, requirements elicitation, product selection, technical design, implementation, testing, and operational support. \n \nStrengths: Analytical, detail-oriented, data-oriented, client focused, excellent communication skills, intelligent Business Systems Analyst with experience in both small-scale and large-scale, enterprise projects involving both off-the-shelf and custom built systems. Involved in all aspects of the system development lifecycle from conception, project scoping, requirements elicitation, product selection, technical design, implementation, testing, and operational support. \n \nStrengths: Analytical, detail-oriented, data-oriented, client focused, excellent communication skills, intelligent Business Systems Analyst with experience in both small-scale and large-scale, enterprise projects involving both off-the-shelf and custom built systems. Involved in all aspects of the system development lifecycle from conception, project scoping, requirements elicitation, product selection, technical design, implementation, testing, and operational support. \n \nStrengths: Analytical, detail-oriented, data-oriented, client focused, excellent communication skills, intelligent Experience IT Business Analyst Stanford University April 2012  – Present (3 years 5 months) Business Analyst working on Stanford's electronic Research Administration system (SeRA). Business Systems Analyst Mycroft Inc January 2012  –  March 2012  (3 months) St. Louis, MO Business Systems Analyst for a boutique consulting company specializing in Identity and Access Management and Cloud Computing solutions. Business Systems Analyst - Enterprise Role Services Team Amgen Inc. December 2008  –  January 2012  (3 years 2 months) Thousand Oaks, CA Business Systems Analyst for a large-scale, multi-year, enterprise program developing Amgen’s new Identity and Access Management infrastructure. Systems developed deliver capabilities to securely collaborate with external business partners. Systems include IBM’s Tivoli Identity Manager, SailPoint, Active Directory, SiteMinder, and custom built components. \nSelected accomplishments: \n• Authored the solution vision document for the program \n• Engaged business stakeholders from across the enterprise to understand current processes and pain \npoints as well as to propose process improvements and automation opportunities \n• Documented detailed analysis of business processes \n• Developed and maintained system requirements, use cases, and functional specifications \n• Collaborated with technical team members to establish the solution design \n• Assisted with functional and non-­‐functional testing \n• Organized and conducted end user acceptance testing \n• Developed and documented system procedures, user training, and help desk instructions \n \nService team member responsible for operating and supporting the new services enabled by the above Identity and Access Management infrastructure. Services included designing and deploying enterprise roles as well as enabling the ability to create external accounts for new business partners. \nSelected accomplishments: \n• Created and maintained a client-facing, SharePoint portal used for operational services \n• Created a service catalog and service processes for the Enterprise Role Services group \n• Led training sessions with clients to explain the system and services available \n• Engaged with clients (including international clients) across the enterprise to develop and implement \nover 50 enterprise roles \n• Supported the account creation activities for more than 250 external business partners from over 50 \ndifferent companies Business Systems Analyst - Regulated Information Systems Amgen Inc. September 2007  –  December 2008  (1 year 4 months) Thousand Oaks, CA Business Systems Analyst responsible for the coordination and guidance of Information Systems Sarbanes–Oxley (SOX) activities.  \nSelected accomplishments: \n• Created and documented a quarterly SOX attestation procedure \n• Consolidated Amgen's Information Systems SOX processes \n• Facilitated quarterly attestations and yearly internal and external SOX audits \n \nBusiness Systems Analyst responsible for the creation of an Information Systems Risk Assessment process to track, mitigate, and manage IS risk exposure at Amgen. \nSelected accomplishments: \n• Created and documented the procedure in a Standard Operating Procedure \n• Created associated worksheets and templates to manage risks Research Assistant UC Santa Barbara January 2005  –  June 2007  (2 years 6 months) Santa Barbara, CA Theoretical computation researcher analyzing the computability of various membrane computing models. Teaching Assistant UC Santa Barbara August 2003  –  June 2007  (3 years 11 months) Santa Barbara Computer Science Teaching Assistant responsible for holding weekly discussion sections, holding twice-­‐weekly office hours, grading assignments and exams, and giving class lectures during professor absences. Classes included Discrete Math, Computational Theory, and Automata-­‐Based Complexity. Received numerous “Outstanding Computer Science Teaching Assistant” awards. IT Office Assistant First Horizon Home Loans May 2002  –  August 2002  (4 months) Los Gatos, CA IT office assistant responsible for restructuring the client database and customizing the new customer management system (ACT!). Summer Intern IBM May 2001  –  August 2001  (4 months) Almaden, CA Intern responsible for adding new features (using Java) to an XML document mapping system. IT Business Analyst Stanford University April 2012  – Present (3 years 5 months) Business Analyst working on Stanford's electronic Research Administration system (SeRA). IT Business Analyst Stanford University April 2012  – Present (3 years 5 months) Business Analyst working on Stanford's electronic Research Administration system (SeRA). Business Systems Analyst Mycroft Inc January 2012  –  March 2012  (3 months) St. Louis, MO Business Systems Analyst for a boutique consulting company specializing in Identity and Access Management and Cloud Computing solutions. Business Systems Analyst Mycroft Inc January 2012  –  March 2012  (3 months) St. Louis, MO Business Systems Analyst for a boutique consulting company specializing in Identity and Access Management and Cloud Computing solutions. Business Systems Analyst - Enterprise Role Services Team Amgen Inc. December 2008  –  January 2012  (3 years 2 months) Thousand Oaks, CA Business Systems Analyst for a large-scale, multi-year, enterprise program developing Amgen’s new Identity and Access Management infrastructure. Systems developed deliver capabilities to securely collaborate with external business partners. Systems include IBM’s Tivoli Identity Manager, SailPoint, Active Directory, SiteMinder, and custom built components. \nSelected accomplishments: \n• Authored the solution vision document for the program \n• Engaged business stakeholders from across the enterprise to understand current processes and pain \npoints as well as to propose process improvements and automation opportunities \n• Documented detailed analysis of business processes \n• Developed and maintained system requirements, use cases, and functional specifications \n• Collaborated with technical team members to establish the solution design \n• Assisted with functional and non-­‐functional testing \n• Organized and conducted end user acceptance testing \n• Developed and documented system procedures, user training, and help desk instructions \n \nService team member responsible for operating and supporting the new services enabled by the above Identity and Access Management infrastructure. Services included designing and deploying enterprise roles as well as enabling the ability to create external accounts for new business partners. \nSelected accomplishments: \n• Created and maintained a client-facing, SharePoint portal used for operational services \n• Created a service catalog and service processes for the Enterprise Role Services group \n• Led training sessions with clients to explain the system and services available \n• Engaged with clients (including international clients) across the enterprise to develop and implement \nover 50 enterprise roles \n• Supported the account creation activities for more than 250 external business partners from over 50 \ndifferent companies Business Systems Analyst - Enterprise Role Services Team Amgen Inc. December 2008  –  January 2012  (3 years 2 months) Thousand Oaks, CA Business Systems Analyst for a large-scale, multi-year, enterprise program developing Amgen’s new Identity and Access Management infrastructure. Systems developed deliver capabilities to securely collaborate with external business partners. Systems include IBM’s Tivoli Identity Manager, SailPoint, Active Directory, SiteMinder, and custom built components. \nSelected accomplishments: \n• Authored the solution vision document for the program \n• Engaged business stakeholders from across the enterprise to understand current processes and pain \npoints as well as to propose process improvements and automation opportunities \n• Documented detailed analysis of business processes \n• Developed and maintained system requirements, use cases, and functional specifications \n• Collaborated with technical team members to establish the solution design \n• Assisted with functional and non-­‐functional testing \n• Organized and conducted end user acceptance testing \n• Developed and documented system procedures, user training, and help desk instructions \n \nService team member responsible for operating and supporting the new services enabled by the above Identity and Access Management infrastructure. Services included designing and deploying enterprise roles as well as enabling the ability to create external accounts for new business partners. \nSelected accomplishments: \n• Created and maintained a client-facing, SharePoint portal used for operational services \n• Created a service catalog and service processes for the Enterprise Role Services group \n• Led training sessions with clients to explain the system and services available \n• Engaged with clients (including international clients) across the enterprise to develop and implement \nover 50 enterprise roles \n• Supported the account creation activities for more than 250 external business partners from over 50 \ndifferent companies Business Systems Analyst - Regulated Information Systems Amgen Inc. September 2007  –  December 2008  (1 year 4 months) Thousand Oaks, CA Business Systems Analyst responsible for the coordination and guidance of Information Systems Sarbanes–Oxley (SOX) activities.  \nSelected accomplishments: \n• Created and documented a quarterly SOX attestation procedure \n• Consolidated Amgen's Information Systems SOX processes \n• Facilitated quarterly attestations and yearly internal and external SOX audits \n \nBusiness Systems Analyst responsible for the creation of an Information Systems Risk Assessment process to track, mitigate, and manage IS risk exposure at Amgen. \nSelected accomplishments: \n• Created and documented the procedure in a Standard Operating Procedure \n• Created associated worksheets and templates to manage risks Business Systems Analyst - Regulated Information Systems Amgen Inc. September 2007  –  December 2008  (1 year 4 months) Thousand Oaks, CA Business Systems Analyst responsible for the coordination and guidance of Information Systems Sarbanes–Oxley (SOX) activities.  \nSelected accomplishments: \n• Created and documented a quarterly SOX attestation procedure \n• Consolidated Amgen's Information Systems SOX processes \n• Facilitated quarterly attestations and yearly internal and external SOX audits \n \nBusiness Systems Analyst responsible for the creation of an Information Systems Risk Assessment process to track, mitigate, and manage IS risk exposure at Amgen. \nSelected accomplishments: \n• Created and documented the procedure in a Standard Operating Procedure \n• Created associated worksheets and templates to manage risks Research Assistant UC Santa Barbara January 2005  –  June 2007  (2 years 6 months) Santa Barbara, CA Theoretical computation researcher analyzing the computability of various membrane computing models. Research Assistant UC Santa Barbara January 2005  –  June 2007  (2 years 6 months) Santa Barbara, CA Theoretical computation researcher analyzing the computability of various membrane computing models. Teaching Assistant UC Santa Barbara August 2003  –  June 2007  (3 years 11 months) Santa Barbara Computer Science Teaching Assistant responsible for holding weekly discussion sections, holding twice-­‐weekly office hours, grading assignments and exams, and giving class lectures during professor absences. Classes included Discrete Math, Computational Theory, and Automata-­‐Based Complexity. Received numerous “Outstanding Computer Science Teaching Assistant” awards. Teaching Assistant UC Santa Barbara August 2003  –  June 2007  (3 years 11 months) Santa Barbara Computer Science Teaching Assistant responsible for holding weekly discussion sections, holding twice-­‐weekly office hours, grading assignments and exams, and giving class lectures during professor absences. Classes included Discrete Math, Computational Theory, and Automata-­‐Based Complexity. Received numerous “Outstanding Computer Science Teaching Assistant” awards. IT Office Assistant First Horizon Home Loans May 2002  –  August 2002  (4 months) Los Gatos, CA IT office assistant responsible for restructuring the client database and customizing the new customer management system (ACT!). IT Office Assistant First Horizon Home Loans May 2002  –  August 2002  (4 months) Los Gatos, CA IT office assistant responsible for restructuring the client database and customizing the new customer management system (ACT!). Summer Intern IBM May 2001  –  August 2001  (4 months) Almaden, CA Intern responsible for adding new features (using Java) to an XML document mapping system. Summer Intern IBM May 2001  –  August 2001  (4 months) Almaden, CA Intern responsible for adding new features (using Java) to an XML document mapping system. Skills Skills     Education University of California, Santa Barbara Doctorate of Philosophy,  Computer Science 2002  – 2007 Thesis: Computability Boundaries in Membrane Computing; Advisor: Professor Oscar H. Ibarra St. Lawrence University Bachelor of Science,  Mathematics / Computer Science 1998  – 2002 University of California, Santa Barbara Doctorate of Philosophy,  Computer Science 2002  – 2007 Thesis: Computability Boundaries in Membrane Computing; Advisor: Professor Oscar H. Ibarra University of California, Santa Barbara Doctorate of Philosophy,  Computer Science 2002  – 2007 Thesis: Computability Boundaries in Membrane Computing; Advisor: Professor Oscar H. Ibarra University of California, Santa Barbara Doctorate of Philosophy,  Computer Science 2002  – 2007 Thesis: Computability Boundaries in Membrane Computing; Advisor: Professor Oscar H. Ibarra St. Lawrence University Bachelor of Science,  Mathematics / Computer Science 1998  – 2002 St. Lawrence University Bachelor of Science,  Mathematics / Computer Science 1998  – 2002 St. Lawrence University Bachelor of Science,  Mathematics / Computer Science 1998  – 2002 Honors & Awards Outstanding Computer Science Teaching Assistant of the Quarter University of California at Santa Barbara - Computer Science Department Winter 2004, Spring 2004, Fall 2004, Winter 2005, Spring 2005, Spring 2006, Winter 2007 Outstanding Computer Science Teaching Assistant of the Year University of California at Santa Barbara - Computer Science Department 2006 Nominated School‐wide Outstanding Teaching Assistant University of California at Santa Barbara - Computer Science Department 2005 University Fellowship University of California at Santa Barbara - Computer Science Department 2002 O.K. Bates Award St. Lawrence University 2002 Exemplary honors student in Mathematics Dean’s List St. Lawrence University 2000 Spring 2000, Fall 2000, Spring 2002 Pi Mu Epsilon St. Lawrence University 2001 Mathematics honorary society. Phi Beta Kappa St. Lawrence University 2001 Greek honorary society. First Year Program Scholar St. Lawrence University 1998 Outstanding Computer Science Teaching Assistant of the Quarter University of California at Santa Barbara - Computer Science Department Winter 2004, Spring 2004, Fall 2004, Winter 2005, Spring 2005, Spring 2006, Winter 2007 Outstanding Computer Science Teaching Assistant of the Quarter University of California at Santa Barbara - Computer Science Department Winter 2004, Spring 2004, Fall 2004, Winter 2005, Spring 2005, Spring 2006, Winter 2007 Outstanding Computer Science Teaching Assistant of the Quarter University of California at Santa Barbara - Computer Science Department Winter 2004, Spring 2004, Fall 2004, Winter 2005, Spring 2005, Spring 2006, Winter 2007 Outstanding Computer Science Teaching Assistant of the Year University of California at Santa Barbara - Computer Science Department 2006 Outstanding Computer Science Teaching Assistant of the Year University of California at Santa Barbara - Computer Science Department 2006 Outstanding Computer Science Teaching Assistant of the Year University of California at Santa Barbara - Computer Science Department 2006 Nominated School‐wide Outstanding Teaching Assistant University of California at Santa Barbara - Computer Science Department 2005 Nominated School‐wide Outstanding Teaching Assistant University of California at Santa Barbara - Computer Science Department 2005 Nominated School‐wide Outstanding Teaching Assistant University of California at Santa Barbara - Computer Science Department 2005 University Fellowship University of California at Santa Barbara - Computer Science Department 2002 University Fellowship University of California at Santa Barbara - Computer Science Department 2002 University Fellowship University of California at Santa Barbara - Computer Science Department 2002 O.K. Bates Award St. Lawrence University 2002 Exemplary honors student in Mathematics O.K. Bates Award St. Lawrence University 2002 Exemplary honors student in Mathematics O.K. Bates Award St. Lawrence University 2002 Exemplary honors student in Mathematics Dean’s List St. Lawrence University 2000 Spring 2000, Fall 2000, Spring 2002 Dean’s List St. Lawrence University 2000 Spring 2000, Fall 2000, Spring 2002 Dean’s List St. Lawrence University 2000 Spring 2000, Fall 2000, Spring 2002 Pi Mu Epsilon St. Lawrence University 2001 Mathematics honorary society. Pi Mu Epsilon St. Lawrence University 2001 Mathematics honorary society. Pi Mu Epsilon St. Lawrence University 2001 Mathematics honorary society. Phi Beta Kappa St. Lawrence University 2001 Greek honorary society. Phi Beta Kappa St. Lawrence University 2001 Greek honorary society. Phi Beta Kappa St. Lawrence University 2001 Greek honorary society. First Year Program Scholar St. Lawrence University 1998 First Year Program Scholar St. Lawrence University 1998 First Year Program Scholar St. Lawrence University 1998 ", "Languages   Skills Skills     "]}