{"position": "Postdoctoral Teaching Fellow", "company": "Stanford University", "profiles": ["Experience Postdoctoral Teaching Fellow Stanford University Postdoctoral Teaching Fellow Stanford University Postdoctoral Teaching Fellow Stanford University ", "Summary My current research and publication interests are in technology and writing, digital literacy and visual communication. I have taught academic writing, oral communication, visual design in advertising and information design at Stanford. As an Assistant Director at Hume Center of Writing and Speaking, I launched graduate services that included writing consultations, writing workshops across disciplines, and Dissertation Bootcamps (2008-2010). I also founded the Digital Media Program at Hume as Associate Director (2011-2012).  \n \nI have over fifteen years of experience teaching writing, rhetoric, and literature. I have helped writers on doctoral dissertations, grant proposals, job and graduate school applications, book manuscripts, speeches and talks, web, academic posters, PowerPoint and print design. I am especially interested in visual design, information design, branding, and advertising.  \n \nI am co-author of The Routledge Reader on Writing Centers and New Media, (Routledge 2013). Currently, I am working on a college textbook, Design for Composition, and researching multimodal communication across disciplines. Summary My current research and publication interests are in technology and writing, digital literacy and visual communication. I have taught academic writing, oral communication, visual design in advertising and information design at Stanford. As an Assistant Director at Hume Center of Writing and Speaking, I launched graduate services that included writing consultations, writing workshops across disciplines, and Dissertation Bootcamps (2008-2010). I also founded the Digital Media Program at Hume as Associate Director (2011-2012).  \n \nI have over fifteen years of experience teaching writing, rhetoric, and literature. I have helped writers on doctoral dissertations, grant proposals, job and graduate school applications, book manuscripts, speeches and talks, web, academic posters, PowerPoint and print design. I am especially interested in visual design, information design, branding, and advertising.  \n \nI am co-author of The Routledge Reader on Writing Centers and New Media, (Routledge 2013). Currently, I am working on a college textbook, Design for Composition, and researching multimodal communication across disciplines. My current research and publication interests are in technology and writing, digital literacy and visual communication. I have taught academic writing, oral communication, visual design in advertising and information design at Stanford. As an Assistant Director at Hume Center of Writing and Speaking, I launched graduate services that included writing consultations, writing workshops across disciplines, and Dissertation Bootcamps (2008-2010). I also founded the Digital Media Program at Hume as Associate Director (2011-2012).  \n \nI have over fifteen years of experience teaching writing, rhetoric, and literature. I have helped writers on doctoral dissertations, grant proposals, job and graduate school applications, book manuscripts, speeches and talks, web, academic posters, PowerPoint and print design. I am especially interested in visual design, information design, branding, and advertising.  \n \nI am co-author of The Routledge Reader on Writing Centers and New Media, (Routledge 2013). Currently, I am working on a college textbook, Design for Composition, and researching multimodal communication across disciplines. My current research and publication interests are in technology and writing, digital literacy and visual communication. I have taught academic writing, oral communication, visual design in advertising and information design at Stanford. As an Assistant Director at Hume Center of Writing and Speaking, I launched graduate services that included writing consultations, writing workshops across disciplines, and Dissertation Bootcamps (2008-2010). I also founded the Digital Media Program at Hume as Associate Director (2011-2012).  \n \nI have over fifteen years of experience teaching writing, rhetoric, and literature. I have helped writers on doctoral dissertations, grant proposals, job and graduate school applications, book manuscripts, speeches and talks, web, academic posters, PowerPoint and print design. I am especially interested in visual design, information design, branding, and advertising.  \n \nI am co-author of The Routledge Reader on Writing Centers and New Media, (Routledge 2013). Currently, I am working on a college textbook, Design for Composition, and researching multimodal communication across disciplines. Skills Pedagogy Higher Education University Teaching Teaching Tutoring College Teaching Student Affairs Academic Writing Lecturing Curriculum Design Editing Research Public Speaking Curriculum Development Academic Administration Grant Writing Rhetoric Teaching Writing Educational Technology Information Design Faculty Development International Education See 7+     See less Skills  Pedagogy Higher Education University Teaching Teaching Tutoring College Teaching Student Affairs Academic Writing Lecturing Curriculum Design Editing Research Public Speaking Curriculum Development Academic Administration Grant Writing Rhetoric Teaching Writing Educational Technology Information Design Faculty Development International Education See 7+     See less Pedagogy Higher Education University Teaching Teaching Tutoring College Teaching Student Affairs Academic Writing Lecturing Curriculum Design Editing Research Public Speaking Curriculum Development Academic Administration Grant Writing Rhetoric Teaching Writing Educational Technology Information Design Faculty Development International Education See 7+     See less Pedagogy Higher Education University Teaching Teaching Tutoring College Teaching Student Affairs Academic Writing Lecturing Curriculum Design Editing Research Public Speaking Curriculum Development Academic Administration Grant Writing Rhetoric Teaching Writing Educational Technology Information Design Faculty Development International Education See 7+     See less ", "Experience Curriculum Developer Minerva Project 2015  – Present (less than a year) Developing social sciences curriculum. Assistant Professor of Philosophy Rutgers University July 2013  – Present (2 years 2 months) Visiting Assistant Professor of Philosophy Franklin & Marshall College July 2012  –  June 2013  (1 year) Postdoctoral Teaching Fellow Stanford University July 2009  –  June 2012  (3 years) Curriculum Developer Minerva Project 2015  – Present (less than a year) Developing social sciences curriculum. Curriculum Developer Minerva Project 2015  – Present (less than a year) Developing social sciences curriculum. Assistant Professor of Philosophy Rutgers University July 2013  – Present (2 years 2 months) Assistant Professor of Philosophy Rutgers University July 2013  – Present (2 years 2 months) Visiting Assistant Professor of Philosophy Franklin & Marshall College July 2012  –  June 2013  (1 year) Visiting Assistant Professor of Philosophy Franklin & Marshall College July 2012  –  June 2013  (1 year) Postdoctoral Teaching Fellow Stanford University July 2009  –  June 2012  (3 years) Postdoctoral Teaching Fellow Stanford University July 2009  –  June 2012  (3 years) Languages English English English Skills Higher Education University Teaching Teaching Research Curriculum Design Curriculum Development Student Affairs Student Development Public Speaking Grant Writing Skills  Higher Education University Teaching Teaching Research Curriculum Design Curriculum Development Student Affairs Student Development Public Speaking Grant Writing Higher Education University Teaching Teaching Research Curriculum Design Curriculum Development Student Affairs Student Development Public Speaking Grant Writing Higher Education University Teaching Teaching Research Curriculum Design Curriculum Development Student Affairs Student Development Public Speaking Grant Writing Education University of California, Berkeley Doctor of Philosophy (PhD),  Philosophy 2001  – 2009 Boston College Master of Arts (M.A.),  Philosophy 1999  – 2001 University of California, Berkeley Doctor of Philosophy (PhD),  Philosophy 2001  – 2009 University of California, Berkeley Doctor of Philosophy (PhD),  Philosophy 2001  – 2009 University of California, Berkeley Doctor of Philosophy (PhD),  Philosophy 2001  – 2009 Boston College Master of Arts (M.A.),  Philosophy 1999  – 2001 Boston College Master of Arts (M.A.),  Philosophy 1999  – 2001 Boston College Master of Arts (M.A.),  Philosophy 1999  – 2001 ", "Summary I’ve been employed in many different capacities in my life, but in the past twelve years I’ve primarily taught philosophy (mostly ethics, political philosophy, and philosophy of religion) to undergraduates. In this process, I’ve honed my critical thinking skills -- especially in relationship to being able to find creative solutions to problems. I’ve also increased my ability to both manage and teach others in various ways, as well as effectively working together with peers to develop new paths to achieve desired outcomes.  \n \nSpecialties: Teaching, public speaking, research, personnel management, knowledge management, ethics, political philosophy, philosophy of religion Summary I’ve been employed in many different capacities in my life, but in the past twelve years I’ve primarily taught philosophy (mostly ethics, political philosophy, and philosophy of religion) to undergraduates. In this process, I’ve honed my critical thinking skills -- especially in relationship to being able to find creative solutions to problems. I’ve also increased my ability to both manage and teach others in various ways, as well as effectively working together with peers to develop new paths to achieve desired outcomes.  \n \nSpecialties: Teaching, public speaking, research, personnel management, knowledge management, ethics, political philosophy, philosophy of religion I’ve been employed in many different capacities in my life, but in the past twelve years I’ve primarily taught philosophy (mostly ethics, political philosophy, and philosophy of religion) to undergraduates. In this process, I’ve honed my critical thinking skills -- especially in relationship to being able to find creative solutions to problems. I’ve also increased my ability to both manage and teach others in various ways, as well as effectively working together with peers to develop new paths to achieve desired outcomes.  \n \nSpecialties: Teaching, public speaking, research, personnel management, knowledge management, ethics, political philosophy, philosophy of religion I’ve been employed in many different capacities in my life, but in the past twelve years I’ve primarily taught philosophy (mostly ethics, political philosophy, and philosophy of religion) to undergraduates. In this process, I’ve honed my critical thinking skills -- especially in relationship to being able to find creative solutions to problems. I’ve also increased my ability to both manage and teach others in various ways, as well as effectively working together with peers to develop new paths to achieve desired outcomes.  \n \nSpecialties: Teaching, public speaking, research, personnel management, knowledge management, ethics, political philosophy, philosophy of religion Experience Assistant Professor of Philosophy University of Wisconsin-Fox Valley August 2012  – Present (3 years 1 month) Menasha, WI Visiting Instructor Bowling Green State University August 2010  –  May 2012  (1 year 10 months) Bowling Green, OH IHUM Postdoctoral Teaching Fellow Stanford University August 2007  –  July 2010  (3 years) Stanford, CA Teaching Assistant Syracuse University August 2002  –  July 2007  (5 years) Syracuse, NY Assistant Professor of Philosophy University of Wisconsin-Fox Valley August 2012  – Present (3 years 1 month) Menasha, WI Assistant Professor of Philosophy University of Wisconsin-Fox Valley August 2012  – Present (3 years 1 month) Menasha, WI Visiting Instructor Bowling Green State University August 2010  –  May 2012  (1 year 10 months) Bowling Green, OH Visiting Instructor Bowling Green State University August 2010  –  May 2012  (1 year 10 months) Bowling Green, OH IHUM Postdoctoral Teaching Fellow Stanford University August 2007  –  July 2010  (3 years) Stanford, CA IHUM Postdoctoral Teaching Fellow Stanford University August 2007  –  July 2010  (3 years) Stanford, CA Teaching Assistant Syracuse University August 2002  –  July 2007  (5 years) Syracuse, NY Teaching Assistant Syracuse University August 2002  –  July 2007  (5 years) Syracuse, NY Skills Philosophy Higher Education Teaching Research Philosophy of Religion Political Philosophy Ethics Public Speaking Academic Writing Lecturing University Teaching Skills  Philosophy Higher Education Teaching Research Philosophy of Religion Political Philosophy Ethics Public Speaking Academic Writing Lecturing University Teaching Philosophy Higher Education Teaching Research Philosophy of Religion Political Philosophy Ethics Public Speaking Academic Writing Lecturing University Teaching Philosophy Higher Education Teaching Research Philosophy of Religion Political Philosophy Ethics Public Speaking Academic Writing Lecturing University Teaching Education Syracuse University Ph.D.,  Philosophy 2002  – 2007 Ashland University B.A,  Philosophy ,  Political Science ,  History 1997  – 2001 Columbiana High School Salem High School Syracuse University Ph.D.,  Philosophy 2002  – 2007 Syracuse University Ph.D.,  Philosophy 2002  – 2007 Syracuse University Ph.D.,  Philosophy 2002  – 2007 Ashland University B.A,  Philosophy ,  Political Science ,  History 1997  – 2001 Ashland University B.A,  Philosophy ,  Political Science ,  History 1997  – 2001 Ashland University B.A,  Philosophy ,  Political Science ,  History 1997  – 2001 Columbiana High School Columbiana High School Columbiana High School Salem High School Salem High School Salem High School ", "Experience Research Associate MIT Sloan School Office of Communications 2013  – Present (2 years) Cambridge, MA Research Associate MIT Museum / Edgerton Center 2008  –  2012  (4 years) Maritime Archaeologist Boston University / Universita di Napoli 2006  –  2008  (2 years) Wadi Gawasis, Red Sea, Egypt Post-Doctoral Research Fellow Dibner Institute for the History of Science and Technology 2004  –  2006  (2 years) Visiting Scholar MIT Program in Science, Technology & Society 2002  –  2003  (1 year) Cambridge, MA Visiiting Lecturer, Dept. Archaeology University of Southampton (UK) 2002  –  2002  (less than a year) Southampton, England (UK) Postdoctoral Teaching Fellow Stanford University 2001  –  2002  (1 year) Palo Alto, Ca Adjunct Assistant Professor, Maritime Archaeology Boston University 1999  –  2000  (1 year) Boston, MA Underwater Archaeologist, Cataloguer Uluburun shipwreck site, Turkey 1991  –  1992  (1 year) Research Associate MIT Sloan School Office of Communications 2013  – Present (2 years) Cambridge, MA Research Associate MIT Sloan School Office of Communications 2013  – Present (2 years) Cambridge, MA Research Associate MIT Museum / Edgerton Center 2008  –  2012  (4 years) Research Associate MIT Museum / Edgerton Center 2008  –  2012  (4 years) Maritime Archaeologist Boston University / Universita di Napoli 2006  –  2008  (2 years) Wadi Gawasis, Red Sea, Egypt Maritime Archaeologist Boston University / Universita di Napoli 2006  –  2008  (2 years) Wadi Gawasis, Red Sea, Egypt Post-Doctoral Research Fellow Dibner Institute for the History of Science and Technology 2004  –  2006  (2 years) Post-Doctoral Research Fellow Dibner Institute for the History of Science and Technology 2004  –  2006  (2 years) Visiting Scholar MIT Program in Science, Technology & Society 2002  –  2003  (1 year) Cambridge, MA Visiting Scholar MIT Program in Science, Technology & Society 2002  –  2003  (1 year) Cambridge, MA Visiiting Lecturer, Dept. Archaeology University of Southampton (UK) 2002  –  2002  (less than a year) Southampton, England (UK) Visiiting Lecturer, Dept. Archaeology University of Southampton (UK) 2002  –  2002  (less than a year) Southampton, England (UK) Postdoctoral Teaching Fellow Stanford University 2001  –  2002  (1 year) Palo Alto, Ca Postdoctoral Teaching Fellow Stanford University 2001  –  2002  (1 year) Palo Alto, Ca Adjunct Assistant Professor, Maritime Archaeology Boston University 1999  –  2000  (1 year) Boston, MA Adjunct Assistant Professor, Maritime Archaeology Boston University 1999  –  2000  (1 year) Boston, MA Underwater Archaeologist, Cataloguer Uluburun shipwreck site, Turkey 1991  –  1992  (1 year) Underwater Archaeologist, Cataloguer Uluburun shipwreck site, Turkey 1991  –  1992  (1 year) Languages English Native or bilingual proficiency Italian Native or bilingual proficiency French Full professional proficiency Spanish Limited working proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency French Full professional proficiency Spanish Limited working proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency French Full professional proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills Grant Writing Archaeology Research Maritime Museum Collections Museums Teaching Higher Education Editing Skills  Grant Writing Archaeology Research Maritime Museum Collections Museums Teaching Higher Education Editing Grant Writing Archaeology Research Maritime Museum Collections Museums Teaching Higher Education Editing Grant Writing Archaeology Research Maritime Museum Collections Museums Teaching Higher Education Editing Education University of Oxford D.Phil,  Archaeology 1991  – 1997 Texas A&M University Nautical Archaeology (MA studies) 1990  – 1991 Harvard University A.B.,  Fine Arts 1978  – 1982 Institut d'Etudes politiques de Paris / Sciences Po Paris Political Science (BA studies) 1980  – 1981 Université de Paris - Sorbonne History of Art (BA studies) 1980  – 1981 University of Oxford D.Phil,  Archaeology 1991  – 1997 University of Oxford D.Phil,  Archaeology 1991  – 1997 University of Oxford D.Phil,  Archaeology 1991  – 1997 Texas A&M University Nautical Archaeology (MA studies) 1990  – 1991 Texas A&M University Nautical Archaeology (MA studies) 1990  – 1991 Texas A&M University Nautical Archaeology (MA studies) 1990  – 1991 Harvard University A.B.,  Fine Arts 1978  – 1982 Harvard University A.B.,  Fine Arts 1978  – 1982 Harvard University A.B.,  Fine Arts 1978  – 1982 Institut d'Etudes politiques de Paris / Sciences Po Paris Political Science (BA studies) 1980  – 1981 Institut d'Etudes politiques de Paris / Sciences Po Paris Political Science (BA studies) 1980  – 1981 Institut d'Etudes politiques de Paris / Sciences Po Paris Political Science (BA studies) 1980  – 1981 Université de Paris - Sorbonne History of Art (BA studies) 1980  – 1981 Université de Paris - Sorbonne History of Art (BA studies) 1980  – 1981 Université de Paris - Sorbonne History of Art (BA studies) 1980  – 1981 ", "Experience Storyteller, researcher Silk Road House 2013  – Present (2 years) Berkeley, CA Lecturer Saint Mary's College of California February 2012  – Present (3 years 7 months) I am teaching in the Collegiate Seminar Program, a required two-year sequence of humanities courses for incoming students. Storyteller and historian Stagebridge Theater Company 2009  – Present (6 years) San Francisco Bay Area I was once a respectable historian of Russia. Then, I turned to a life of storytelling, crafting stories that transform historical events into tales of wonder and horror. I also tell traditional, literary, and original tales to young and adult audiences alike. Postdoctoral Teaching Fellow Stanford University 2007  –  2009  (2 years) Lecturer, Russian History UC Davis 2004  –  2006  (2 years) Storyteller, researcher Silk Road House 2013  – Present (2 years) Berkeley, CA Storyteller, researcher Silk Road House 2013  – Present (2 years) Berkeley, CA Lecturer Saint Mary's College of California February 2012  – Present (3 years 7 months) I am teaching in the Collegiate Seminar Program, a required two-year sequence of humanities courses for incoming students. Lecturer Saint Mary's College of California February 2012  – Present (3 years 7 months) I am teaching in the Collegiate Seminar Program, a required two-year sequence of humanities courses for incoming students. Storyteller and historian Stagebridge Theater Company 2009  – Present (6 years) San Francisco Bay Area I was once a respectable historian of Russia. Then, I turned to a life of storytelling, crafting stories that transform historical events into tales of wonder and horror. I also tell traditional, literary, and original tales to young and adult audiences alike. Storyteller and historian Stagebridge Theater Company 2009  – Present (6 years) San Francisco Bay Area I was once a respectable historian of Russia. Then, I turned to a life of storytelling, crafting stories that transform historical events into tales of wonder and horror. I also tell traditional, literary, and original tales to young and adult audiences alike. Postdoctoral Teaching Fellow Stanford University 2007  –  2009  (2 years) Postdoctoral Teaching Fellow Stanford University 2007  –  2009  (2 years) Lecturer, Russian History UC Davis 2004  –  2006  (2 years) Lecturer, Russian History UC Davis 2004  –  2006  (2 years) Skills Higher Education Teaching Storytelling Literature History University Teaching Editing Grant Writing Translation Creative Writing Books Intercultural... Curriculum Development Skills  Higher Education Teaching Storytelling Literature History University Teaching Editing Grant Writing Translation Creative Writing Books Intercultural... Curriculum Development Higher Education Teaching Storytelling Literature History University Teaching Editing Grant Writing Translation Creative Writing Books Intercultural... Curriculum Development Higher Education Teaching Storytelling Literature History University Teaching Editing Grant Writing Translation Creative Writing Books Intercultural... Curriculum Development Education Central European University MA,  Sociology and History UC Davis PhD,  History , Modern Europe University of California, Berkeley BA,  Slavic Languages and Literatures University of Washington MA,  Slavic Languages and Literatures Central European University MA,  Sociology and History Central European University MA,  Sociology and History Central European University MA,  Sociology and History UC Davis PhD,  History , Modern Europe UC Davis PhD,  History , Modern Europe UC Davis PhD,  History , Modern Europe University of California, Berkeley BA,  Slavic Languages and Literatures University of California, Berkeley BA,  Slavic Languages and Literatures University of California, Berkeley BA,  Slavic Languages and Literatures University of Washington MA,  Slavic Languages and Literatures University of Washington MA,  Slavic Languages and Literatures University of Washington MA,  Slavic Languages and Literatures ", "Experience Academic Director Stanford University December 2010  – Present (4 years 9 months) Introduction to the Humanities: Postdoctoral Teaching Fellow Stanford University September 2007  –  December 2010  (3 years 4 months) Brittain Postdoctoral Teaching Fellow Georgia Institute of Technology August 2005  –  July 2007  (2 years) Graduate Student Instructor University of California Santa Barbara 1997  –  2005  (8 years) Academic Director Stanford University December 2010  – Present (4 years 9 months) Academic Director Stanford University December 2010  – Present (4 years 9 months) Introduction to the Humanities: Postdoctoral Teaching Fellow Stanford University September 2007  –  December 2010  (3 years 4 months) Introduction to the Humanities: Postdoctoral Teaching Fellow Stanford University September 2007  –  December 2010  (3 years 4 months) Brittain Postdoctoral Teaching Fellow Georgia Institute of Technology August 2005  –  July 2007  (2 years) Brittain Postdoctoral Teaching Fellow Georgia Institute of Technology August 2005  –  July 2007  (2 years) Graduate Student Instructor University of California Santa Barbara 1997  –  2005  (8 years) Graduate Student Instructor University of California Santa Barbara 1997  –  2005  (8 years) Skills Teaching Higher Education Research Tutoring Student Services Student Affairs Research Design Program Development Editing Qualitative Research Program Evaluation Grant Writing Fundraising History Community Outreach Curriculum Development Proofreading Blogging University Teaching Lecturing E-Learning Curriculum Design Statistics Critical Thinking Data Analysis Public Speaking Social Media Event Planning Nonprofits See 14+     See less Skills  Teaching Higher Education Research Tutoring Student Services Student Affairs Research Design Program Development Editing Qualitative Research Program Evaluation Grant Writing Fundraising History Community Outreach Curriculum Development Proofreading Blogging University Teaching Lecturing E-Learning Curriculum Design Statistics Critical Thinking Data Analysis Public Speaking Social Media Event Planning Nonprofits See 14+     See less Teaching Higher Education Research Tutoring Student Services Student Affairs Research Design Program Development Editing Qualitative Research Program Evaluation Grant Writing Fundraising History Community Outreach Curriculum Development Proofreading Blogging University Teaching Lecturing E-Learning Curriculum Design Statistics Critical Thinking Data Analysis Public Speaking Social Media Event Planning Nonprofits See 14+     See less Teaching Higher Education Research Tutoring Student Services Student Affairs Research Design Program Development Editing Qualitative Research Program Evaluation Grant Writing Fundraising History Community Outreach Curriculum Development Proofreading Blogging University Teaching Lecturing E-Learning Curriculum Design Statistics Critical Thinking Data Analysis Public Speaking Social Media Event Planning Nonprofits See 14+     See less Education University of California, Santa Barbara Ph.D.,  English 1997  – 2005 Stanford University BA,  English 1994  – 1996 University of California, Santa Barbara Ph.D.,  English 1997  – 2005 University of California, Santa Barbara Ph.D.,  English 1997  – 2005 University of California, Santa Barbara Ph.D.,  English 1997  – 2005 Stanford University BA,  English 1994  – 1996 Stanford University BA,  English 1994  – 1996 Stanford University BA,  English 1994  – 1996 ", "Experience Assistant Professor Trinity University Director, California Actors Workshop Education Unlimited Inc. 2007  –  2010  (3 years) Fellow Commonweal Institute 2007  –  2009  (2 years) Postdoctoral Teaching Fellow Stanford University 2008  –  2008  (less than a year) Instructor American Conservatory Theater 2007  –  2008  (1 year) Assistant Professor Trinity University Assistant Professor Trinity University Director, California Actors Workshop Education Unlimited Inc. 2007  –  2010  (3 years) Director, California Actors Workshop Education Unlimited Inc. 2007  –  2010  (3 years) Fellow Commonweal Institute 2007  –  2009  (2 years) Fellow Commonweal Institute 2007  –  2009  (2 years) Postdoctoral Teaching Fellow Stanford University 2008  –  2008  (less than a year) Postdoctoral Teaching Fellow Stanford University 2008  –  2008  (less than a year) Instructor American Conservatory Theater 2007  –  2008  (1 year) Instructor American Conservatory Theater 2007  –  2008  (1 year) Education Stanford University PhD,  Drama 2001  – 2007 Stanford University PhD,  Drama 2001  – 2007 Stanford University PhD,  Drama 2001  – 2007 Stanford University PhD,  Drama 2001  – 2007 ", "Skills Curriculum Development Teaching Project Management MS Office Suite Adobe Acrobat Adobe Photoshop Adobe Illustrator Laboratory Research Life Sciences Science Education Science Communication Mentoring Project Planning Project Implementation Project Coordination Scientific Writing Attention To Detail Research Molecular Biology Cell Biology Science Genetics Data Analysis Public Speaking Cell Culture PowerPoint Excel Word Microsoft Office Mac OS X Cell Based Assays PCR Western Blotting Sustainability qPCR Higher Education Lifesciences Tissue Culture Biology Confocal Microscopy See 25+     See less Skills  Curriculum Development Teaching Project Management MS Office Suite Adobe Acrobat Adobe Photoshop Adobe Illustrator Laboratory Research Life Sciences Science Education Science Communication Mentoring Project Planning Project Implementation Project Coordination Scientific Writing Attention To Detail Research Molecular Biology Cell Biology Science Genetics Data Analysis Public Speaking Cell Culture PowerPoint Excel Word Microsoft Office Mac OS X Cell Based Assays PCR Western Blotting Sustainability qPCR Higher Education Lifesciences Tissue Culture Biology Confocal Microscopy See 25+     See less Curriculum Development Teaching Project Management MS Office Suite Adobe Acrobat Adobe Photoshop Adobe Illustrator Laboratory Research Life Sciences Science Education Science Communication Mentoring Project Planning Project Implementation Project Coordination Scientific Writing Attention To Detail Research Molecular Biology Cell Biology Science Genetics Data Analysis Public Speaking Cell Culture PowerPoint Excel Word Microsoft Office Mac OS X Cell Based Assays PCR Western Blotting Sustainability qPCR Higher Education Lifesciences Tissue Culture Biology Confocal Microscopy See 25+     See less Curriculum Development Teaching Project Management MS Office Suite Adobe Acrobat Adobe Photoshop Adobe Illustrator Laboratory Research Life Sciences Science Education Science Communication Mentoring Project Planning Project Implementation Project Coordination Scientific Writing Attention To Detail Research Molecular Biology Cell Biology Science Genetics Data Analysis Public Speaking Cell Culture PowerPoint Excel Word Microsoft Office Mac OS X Cell Based Assays PCR Western Blotting Sustainability qPCR Higher Education Lifesciences Tissue Culture Biology Confocal Microscopy See 25+     See less ", "Summary Ecologist and teacher. As an ecologist, I conduct research in microbial ecology and biogeochemistry with experience in academic and government settings. As a teacher, I am interested in science and environmental education at all levels. Summary Ecologist and teacher. As an ecologist, I conduct research in microbial ecology and biogeochemistry with experience in academic and government settings. As a teacher, I am interested in science and environmental education at all levels. Ecologist and teacher. As an ecologist, I conduct research in microbial ecology and biogeochemistry with experience in academic and government settings. As a teacher, I am interested in science and environmental education at all levels. Ecologist and teacher. As an ecologist, I conduct research in microbial ecology and biogeochemistry with experience in academic and government settings. As a teacher, I am interested in science and environmental education at all levels. Experience Gordon and Betty Moore Postdoctoral Fellow of the Life Sciences Research Foundation the University of Arizona November 2013  – Present (1 year 10 months) Tucson, AZ Conducting research in Betsy Arnold's lab focused on understanding the different factors affecting the life histories of foliar fungi, primarily based on greenhouse experiments and meta-transcriptomic methods. Postdoctoral Teaching Fellow Stanford University March 2013  –  June 2013  (4 months) Coordinated and taught (with a team of other instructors and teaching assistants) an introductory ecology field and lab course to ~120 upper level undergraduates. Course content focused on the microbial ecology of communities of microorganisms in floral nectar, and included field observations at Jasper Ridge Biological Preserve, molecular and culture based methods for microbe community quantification, and statistical analyses in the R programming language. PhD Candidate in Ecology Stanford University September 2007  –  March 2013  (5 years 7 months) Dissertation research focused on microbial community ecology at the landscape scale using next-generation sequencing techniques - specifically with an interest in understanding how symbiotic organisms shape their hosts' function in ecosystems. Tutor Stutors November 2008  –  June 2010  (1 year 8 months) Tutored elementary to college students in a range of subjects (Math, English, Biology, Chemistry, Environmental Science), writing skills, and test prep (SSAT/ISEE, CSU Writing Proficiency Exam, SAT, SAT II, ACT, APs, GRE). Teacher IBS Academy August 2006  –  August 2007  (1 year 1 month) Taught a variety of AP subjects (Macro/Micro Economics, Biology, Chemistry, Calculus) and test preparation (AP, SAT I/II, GRE, TOEFL) at a private academy in Seoul, South Korea. Research Technician Harvard University September 2005  –  July 2006  (11 months) Technician in the Schrag Geochemical Oceanography Lab working on past climate reconstruction using isotopic techniques. Research Intern USDA Forest Service 2003  –  2005  (2 years) Conducted field ecology research on community vegetation ecology, succession, and invasive species - with a focus on lowland wet forests and the invasive tree Psidium cattleianum (strawberry guava). Gordon and Betty Moore Postdoctoral Fellow of the Life Sciences Research Foundation the University of Arizona November 2013  – Present (1 year 10 months) Tucson, AZ Conducting research in Betsy Arnold's lab focused on understanding the different factors affecting the life histories of foliar fungi, primarily based on greenhouse experiments and meta-transcriptomic methods. Gordon and Betty Moore Postdoctoral Fellow of the Life Sciences Research Foundation the University of Arizona November 2013  – Present (1 year 10 months) Tucson, AZ Conducting research in Betsy Arnold's lab focused on understanding the different factors affecting the life histories of foliar fungi, primarily based on greenhouse experiments and meta-transcriptomic methods. Postdoctoral Teaching Fellow Stanford University March 2013  –  June 2013  (4 months) Coordinated and taught (with a team of other instructors and teaching assistants) an introductory ecology field and lab course to ~120 upper level undergraduates. Course content focused on the microbial ecology of communities of microorganisms in floral nectar, and included field observations at Jasper Ridge Biological Preserve, molecular and culture based methods for microbe community quantification, and statistical analyses in the R programming language. Postdoctoral Teaching Fellow Stanford University March 2013  –  June 2013  (4 months) Coordinated and taught (with a team of other instructors and teaching assistants) an introductory ecology field and lab course to ~120 upper level undergraduates. Course content focused on the microbial ecology of communities of microorganisms in floral nectar, and included field observations at Jasper Ridge Biological Preserve, molecular and culture based methods for microbe community quantification, and statistical analyses in the R programming language. PhD Candidate in Ecology Stanford University September 2007  –  March 2013  (5 years 7 months) Dissertation research focused on microbial community ecology at the landscape scale using next-generation sequencing techniques - specifically with an interest in understanding how symbiotic organisms shape their hosts' function in ecosystems. PhD Candidate in Ecology Stanford University September 2007  –  March 2013  (5 years 7 months) Dissertation research focused on microbial community ecology at the landscape scale using next-generation sequencing techniques - specifically with an interest in understanding how symbiotic organisms shape their hosts' function in ecosystems. Tutor Stutors November 2008  –  June 2010  (1 year 8 months) Tutored elementary to college students in a range of subjects (Math, English, Biology, Chemistry, Environmental Science), writing skills, and test prep (SSAT/ISEE, CSU Writing Proficiency Exam, SAT, SAT II, ACT, APs, GRE). Tutor Stutors November 2008  –  June 2010  (1 year 8 months) Tutored elementary to college students in a range of subjects (Math, English, Biology, Chemistry, Environmental Science), writing skills, and test prep (SSAT/ISEE, CSU Writing Proficiency Exam, SAT, SAT II, ACT, APs, GRE). Teacher IBS Academy August 2006  –  August 2007  (1 year 1 month) Taught a variety of AP subjects (Macro/Micro Economics, Biology, Chemistry, Calculus) and test preparation (AP, SAT I/II, GRE, TOEFL) at a private academy in Seoul, South Korea. Teacher IBS Academy August 2006  –  August 2007  (1 year 1 month) Taught a variety of AP subjects (Macro/Micro Economics, Biology, Chemistry, Calculus) and test preparation (AP, SAT I/II, GRE, TOEFL) at a private academy in Seoul, South Korea. Research Technician Harvard University September 2005  –  July 2006  (11 months) Technician in the Schrag Geochemical Oceanography Lab working on past climate reconstruction using isotopic techniques. Research Technician Harvard University September 2005  –  July 2006  (11 months) Technician in the Schrag Geochemical Oceanography Lab working on past climate reconstruction using isotopic techniques. Research Intern USDA Forest Service 2003  –  2005  (2 years) Conducted field ecology research on community vegetation ecology, succession, and invasive species - with a focus on lowland wet forests and the invasive tree Psidium cattleianum (strawberry guava). Research Intern USDA Forest Service 2003  –  2005  (2 years) Conducted field ecology research on community vegetation ecology, succession, and invasive species - with a focus on lowland wet forests and the invasive tree Psidium cattleianum (strawberry guava). Languages Korean Limited working proficiency Spanish Limited working proficiency Korean Limited working proficiency Spanish Limited working proficiency Korean Limited working proficiency Spanish Limited working proficiency Limited working proficiency Limited working proficiency Skills Tutoring Grant Writing HTML Microbiology PowerPoint PCR Microsoft Office Teaching Matlab Excel Life Sciences Data Analysis Statistics Research Science Molecular Biology Ecology Environmental Education Lifesciences Biology R Experimental Design Environmental Science Scientific Writing Genetics Evolutionary Biology Microscopy University Teaching Microsoft Excel See 14+     See less Skills  Tutoring Grant Writing HTML Microbiology PowerPoint PCR Microsoft Office Teaching Matlab Excel Life Sciences Data Analysis Statistics Research Science Molecular Biology Ecology Environmental Education Lifesciences Biology R Experimental Design Environmental Science Scientific Writing Genetics Evolutionary Biology Microscopy University Teaching Microsoft Excel See 14+     See less Tutoring Grant Writing HTML Microbiology PowerPoint PCR Microsoft Office Teaching Matlab Excel Life Sciences Data Analysis Statistics Research Science Molecular Biology Ecology Environmental Education Lifesciences Biology R Experimental Design Environmental Science Scientific Writing Genetics Evolutionary Biology Microscopy University Teaching Microsoft Excel See 14+     See less Tutoring Grant Writing HTML Microbiology PowerPoint PCR Microsoft Office Teaching Matlab Excel Life Sciences Data Analysis Statistics Research Science Molecular Biology Ecology Environmental Education Lifesciences Biology R Experimental Design Environmental Science Scientific Writing Genetics Evolutionary Biology Microscopy University Teaching Microsoft Excel See 14+     See less Education Stanford University PhD,  Ecology 2007  – 2013 Activities and Societies:  NSF Graduate Research Fellow (2009 - 2012) ,  Chair - Ecological Society of America Student Section ,  International Network of Next-Generation Ecologists (innge.net) Harvard University A.B. with Honors,  Environmental Science and Public Policy and Social Anthropology 2001  – 2005 Activities and Societies:  Sociology Research Assistant in the Podolny Group ,  Harvard Rugby Football Club ,  Mather House Council ,  Sigma Chi Waiakea High School High School Diploma 1997  – 2001 Stanford University PhD,  Ecology 2007  – 2013 Activities and Societies:  NSF Graduate Research Fellow (2009 - 2012) ,  Chair - Ecological Society of America Student Section ,  International Network of Next-Generation Ecologists (innge.net) Stanford University PhD,  Ecology 2007  – 2013 Activities and Societies:  NSF Graduate Research Fellow (2009 - 2012) ,  Chair - Ecological Society of America Student Section ,  International Network of Next-Generation Ecologists (innge.net) Stanford University PhD,  Ecology 2007  – 2013 Activities and Societies:  NSF Graduate Research Fellow (2009 - 2012) ,  Chair - Ecological Society of America Student Section ,  International Network of Next-Generation Ecologists (innge.net) Harvard University A.B. with Honors,  Environmental Science and Public Policy and Social Anthropology 2001  – 2005 Activities and Societies:  Sociology Research Assistant in the Podolny Group ,  Harvard Rugby Football Club ,  Mather House Council ,  Sigma Chi Harvard University A.B. with Honors,  Environmental Science and Public Policy and Social Anthropology 2001  – 2005 Activities and Societies:  Sociology Research Assistant in the Podolny Group ,  Harvard Rugby Football Club ,  Mather House Council ,  Sigma Chi Harvard University A.B. with Honors,  Environmental Science and Public Policy and Social Anthropology 2001  – 2005 Activities and Societies:  Sociology Research Assistant in the Podolny Group ,  Harvard Rugby Football Club ,  Mather House Council ,  Sigma Chi Waiakea High School High School Diploma 1997  – 2001 Waiakea High School High School Diploma 1997  – 2001 Waiakea High School High School Diploma 1997  – 2001 ", "Experience Assistant Professor Rangsit University August 2013  – Present (2 years 1 month) Pathum Thani, Thailand Teach English reading, writing, listening, speaking, and grammar skills. \nTeaching graduate level TEFL, and Research and Proposal writing courses. Assistant Professor College of San Mateo 2005  –  2013  (8 years) Postdoctoral Teaching Fellow Stanford University August 2004  –  August 2005  (1 year 1 month) Program in Writing International Relations English Language Consultant Srinakharinwirot University August 2002  –  August 2003  (1 year 1 month) Bangkok, Thailand Graduate Teaching Assistant Illinois State University August 1996  –  May 2002  (5 years 10 months) English Department Assistant Professor Rangsit University August 2013  – Present (2 years 1 month) Pathum Thani, Thailand Teach English reading, writing, listening, speaking, and grammar skills. \nTeaching graduate level TEFL, and Research and Proposal writing courses. Assistant Professor Rangsit University August 2013  – Present (2 years 1 month) Pathum Thani, Thailand Teach English reading, writing, listening, speaking, and grammar skills. \nTeaching graduate level TEFL, and Research and Proposal writing courses. Assistant Professor College of San Mateo 2005  –  2013  (8 years) Assistant Professor College of San Mateo 2005  –  2013  (8 years) Postdoctoral Teaching Fellow Stanford University August 2004  –  August 2005  (1 year 1 month) Program in Writing Postdoctoral Teaching Fellow Stanford University August 2004  –  August 2005  (1 year 1 month) Program in Writing International Relations English Language Consultant Srinakharinwirot University August 2002  –  August 2003  (1 year 1 month) Bangkok, Thailand International Relations English Language Consultant Srinakharinwirot University August 2002  –  August 2003  (1 year 1 month) Bangkok, Thailand Graduate Teaching Assistant Illinois State University August 1996  –  May 2002  (5 years 10 months) English Department Graduate Teaching Assistant Illinois State University August 1996  –  May 2002  (5 years 10 months) English Department Skills Teaching English... Higher Education University Teaching International Relations Teaching Student Affairs Skills  Teaching English... Higher Education University Teaching International Relations Teaching Student Affairs Teaching English... Higher Education University Teaching International Relations Teaching Student Affairs Teaching English... Higher Education University Teaching International Relations Teaching Student Affairs Education Illinois State University Doctor of Philosophy (Ph.D.),  English Studies and TEFL 1996  – 2005 San Jose State University M.A. and B.A.,  English Language and Literature/Letters 1991  – 1996 Illinois State University Doctor of Philosophy (Ph.D.),  English Studies and TEFL 1996  – 2005 Illinois State University Doctor of Philosophy (Ph.D.),  English Studies and TEFL 1996  – 2005 Illinois State University Doctor of Philosophy (Ph.D.),  English Studies and TEFL 1996  – 2005 San Jose State University M.A. and B.A.,  English Language and Literature/Letters 1991  – 1996 San Jose State University M.A. and B.A.,  English Language and Literature/Letters 1991  – 1996 San Jose State University M.A. and B.A.,  English Language and Literature/Letters 1991  – 1996 "]}