{"position": "Postdoctoral Scholar", "company": "Stanford University", "profiles": ["Summary I am a biochemist with experience in diverse areas of human diseases ranging from ovarian cancer to disorders in lipid metabolism and extracellular matrix metabolism such as obesity, diabetes, female pelvic organ disorder, uterine fibroids. I am interested in applying my skills and enthusiasm in the biotech and pharmaceutical sectors. Specialties:Basic protein analysis techniques (such as western blot, subcellular fractionation, immunoprecipitation, spectrophotometric enzyme assay) basic molecular biology techniques, lipid analysis, apoptosis and cell proliferation assays,analysis of anti-cancer effects of small molecules, handling animal and human tissues/body fluids, tissue culture (both cell line and primary culture). Summary I am a biochemist with experience in diverse areas of human diseases ranging from ovarian cancer to disorders in lipid metabolism and extracellular matrix metabolism such as obesity, diabetes, female pelvic organ disorder, uterine fibroids. I am interested in applying my skills and enthusiasm in the biotech and pharmaceutical sectors. Specialties:Basic protein analysis techniques (such as western blot, subcellular fractionation, immunoprecipitation, spectrophotometric enzyme assay) basic molecular biology techniques, lipid analysis, apoptosis and cell proliferation assays,analysis of anti-cancer effects of small molecules, handling animal and human tissues/body fluids, tissue culture (both cell line and primary culture). I am a biochemist with experience in diverse areas of human diseases ranging from ovarian cancer to disorders in lipid metabolism and extracellular matrix metabolism such as obesity, diabetes, female pelvic organ disorder, uterine fibroids. I am interested in applying my skills and enthusiasm in the biotech and pharmaceutical sectors. Specialties:Basic protein analysis techniques (such as western blot, subcellular fractionation, immunoprecipitation, spectrophotometric enzyme assay) basic molecular biology techniques, lipid analysis, apoptosis and cell proliferation assays,analysis of anti-cancer effects of small molecules, handling animal and human tissues/body fluids, tissue culture (both cell line and primary culture). I am a biochemist with experience in diverse areas of human diseases ranging from ovarian cancer to disorders in lipid metabolism and extracellular matrix metabolism such as obesity, diabetes, female pelvic organ disorder, uterine fibroids. I am interested in applying my skills and enthusiasm in the biotech and pharmaceutical sectors. Specialties:Basic protein analysis techniques (such as western blot, subcellular fractionation, immunoprecipitation, spectrophotometric enzyme assay) basic molecular biology techniques, lipid analysis, apoptosis and cell proliferation assays,analysis of anti-cancer effects of small molecules, handling animal and human tissues/body fluids, tissue culture (both cell line and primary culture). Experience Instructor UC-Berkeley Extension September 2009  – Present (6 years) Instructor of Biochemistry Postdoctoral Scholar Stanford University School of Medicine September 2008  –  March 2009  (7 months) Studying the potential of several small molecules in the treatment of ovarian cancer. Postdoctoral Scholar Stanford University School of Medicine June 2006  –  June 2008  (2 years 1 month) performing research with medical doctors to understand the molecular basis of diseases involving defects in extracellular matrix metabolism such as pelvic organ prolapse and formation of fibroids. Graduate research assistant University of Wisconsin-Madison September 1999  –  December 2005  (6 years 4 months) Initiated a project that relied heavily on molecular biology techniques in a lab specializing in studies using mouse models. The project addressed the physical aspects of the protein stearoyl-CoA desaturase including the topology and its spatial relationship with enzyme involved in triglyceride synthesis. Also worked as teaching assistant and research mentor for undergraduate students Instructor UC-Berkeley Extension September 2009  – Present (6 years) Instructor of Biochemistry Instructor UC-Berkeley Extension September 2009  – Present (6 years) Instructor of Biochemistry Postdoctoral Scholar Stanford University School of Medicine September 2008  –  March 2009  (7 months) Studying the potential of several small molecules in the treatment of ovarian cancer. Postdoctoral Scholar Stanford University School of Medicine September 2008  –  March 2009  (7 months) Studying the potential of several small molecules in the treatment of ovarian cancer. Postdoctoral Scholar Stanford University School of Medicine June 2006  –  June 2008  (2 years 1 month) performing research with medical doctors to understand the molecular basis of diseases involving defects in extracellular matrix metabolism such as pelvic organ prolapse and formation of fibroids. Postdoctoral Scholar Stanford University School of Medicine June 2006  –  June 2008  (2 years 1 month) performing research with medical doctors to understand the molecular basis of diseases involving defects in extracellular matrix metabolism such as pelvic organ prolapse and formation of fibroids. Graduate research assistant University of Wisconsin-Madison September 1999  –  December 2005  (6 years 4 months) Initiated a project that relied heavily on molecular biology techniques in a lab specializing in studies using mouse models. The project addressed the physical aspects of the protein stearoyl-CoA desaturase including the topology and its spatial relationship with enzyme involved in triglyceride synthesis. Also worked as teaching assistant and research mentor for undergraduate students Graduate research assistant University of Wisconsin-Madison September 1999  –  December 2005  (6 years 4 months) Initiated a project that relied heavily on molecular biology techniques in a lab specializing in studies using mouse models. The project addressed the physical aspects of the protein stearoyl-CoA desaturase including the topology and its spatial relationship with enzyme involved in triglyceride synthesis. Also worked as teaching assistant and research mentor for undergraduate students Languages Chinese (Mandarin) Chinese (Cantonese) Chinese (Mandarin) Chinese (Cantonese) Chinese (Mandarin) Chinese (Cantonese) Skills Western Blotting Cell Molecular Biology Immunoprecipitation Cell Culture Enzyme Assays Tissue Culture Molecular Cloning Immunofluorescence Fluorescence Microscopy Animal Models qPCR In Vivo Skills  Western Blotting Cell Molecular Biology Immunoprecipitation Cell Culture Enzyme Assays Tissue Culture Molecular Cloning Immunofluorescence Fluorescence Microscopy Animal Models qPCR In Vivo Western Blotting Cell Molecular Biology Immunoprecipitation Cell Culture Enzyme Assays Tissue Culture Molecular Cloning Immunofluorescence Fluorescence Microscopy Animal Models qPCR In Vivo Western Blotting Cell Molecular Biology Immunoprecipitation Cell Culture Enzyme Assays Tissue Culture Molecular Cloning Immunofluorescence Fluorescence Microscopy Animal Models qPCR In Vivo Education University of Wisconsin-Madison PhD,  Biochemistry 1999  – 2005 Work in the disseration titled \"Topology of Stearoyl-CoA desaturease (SCD) 1 and its co-localization with acyl-CoA diacylglycerol acyltransferase (DGAT) 2 in the endoplasmic reticulum\" was published in the Journal of Biological Chemistry (2005) and the Journal of Lipid Research (2006) \nRecipient of Biochemistry Scholar Award at the University of Wisconsin-Madison University of Wisconsin-Madison B.S.,  Biochemistry 1995  – 1999 Graduated with distinction  \nRecipient of Mary Shine Peterson scholarship for undergraduate biochemistry major. Awarded to 5 students per year who conduct senior thesis research in biochemistry Activities and Societies:  choir member at St. Paul's Catholic Center UCSC extension University of Wisconsin-Madison PhD,  Biochemistry 1999  – 2005 Work in the disseration titled \"Topology of Stearoyl-CoA desaturease (SCD) 1 and its co-localization with acyl-CoA diacylglycerol acyltransferase (DGAT) 2 in the endoplasmic reticulum\" was published in the Journal of Biological Chemistry (2005) and the Journal of Lipid Research (2006) \nRecipient of Biochemistry Scholar Award at the University of Wisconsin-Madison University of Wisconsin-Madison PhD,  Biochemistry 1999  – 2005 Work in the disseration titled \"Topology of Stearoyl-CoA desaturease (SCD) 1 and its co-localization with acyl-CoA diacylglycerol acyltransferase (DGAT) 2 in the endoplasmic reticulum\" was published in the Journal of Biological Chemistry (2005) and the Journal of Lipid Research (2006) \nRecipient of Biochemistry Scholar Award at the University of Wisconsin-Madison University of Wisconsin-Madison PhD,  Biochemistry 1999  – 2005 Work in the disseration titled \"Topology of Stearoyl-CoA desaturease (SCD) 1 and its co-localization with acyl-CoA diacylglycerol acyltransferase (DGAT) 2 in the endoplasmic reticulum\" was published in the Journal of Biological Chemistry (2005) and the Journal of Lipid Research (2006) \nRecipient of Biochemistry Scholar Award at the University of Wisconsin-Madison University of Wisconsin-Madison B.S.,  Biochemistry 1995  – 1999 Graduated with distinction  \nRecipient of Mary Shine Peterson scholarship for undergraduate biochemistry major. Awarded to 5 students per year who conduct senior thesis research in biochemistry Activities and Societies:  choir member at St. Paul's Catholic Center University of Wisconsin-Madison B.S.,  Biochemistry 1995  – 1999 Graduated with distinction  \nRecipient of Mary Shine Peterson scholarship for undergraduate biochemistry major. Awarded to 5 students per year who conduct senior thesis research in biochemistry Activities and Societies:  choir member at St. Paul's Catholic Center University of Wisconsin-Madison B.S.,  Biochemistry 1995  – 1999 Graduated with distinction  \nRecipient of Mary Shine Peterson scholarship for undergraduate biochemistry major. Awarded to 5 students per year who conduct senior thesis research in biochemistry Activities and Societies:  choir member at St. Paul's Catholic Center UCSC extension UCSC extension UCSC extension ", "Summary Wei-Shiuen Ng is a Postdoctoral Scholar in the Precourt Energy Efficiency Center at Stanford University. Her recent research focuses on the evaluation of parking pricing and its influence on travel behavior, as well as the development of transportation policies that will reduce energy use and emissions. \n \nWei-Shiuen holds a Ph.D. in City and Regional Planning from the University of California, Berkeley, a Masters in Environmental Science from Yale University School of Forestry and Environmental Studies and a Bachelor of Science in Environmental Economics and Environmental Management from the University of York. Prior to starting her doctoral program at the University of California, Berkeley, she was a transportation policy analyst at EMBARQ, the World Resources Institute Center for Sustainable Transport in Washington DC. She has previously studied the economic impact of climate change induced sea level rise and has experience in areas of transportation emissions and energy modeling, transportation policy scenarios building, environmental and social impact analysis of motorization, and sustainable urban transportation development in Asia.  \n \nWei-Shiuen is especially interested in solving urban environmental problems through transportation demand management. She hopes to help reduce carbon emissions from the transportation sector and create livable cities though good planning and policy implementation. \n \nSpecialties: Climate change economics, energy and transportation scenarios modeling, transportation policy analysis, project management, proposal writing, project planning, budgeting and grant management, stakeholders management Summary Wei-Shiuen Ng is a Postdoctoral Scholar in the Precourt Energy Efficiency Center at Stanford University. Her recent research focuses on the evaluation of parking pricing and its influence on travel behavior, as well as the development of transportation policies that will reduce energy use and emissions. \n \nWei-Shiuen holds a Ph.D. in City and Regional Planning from the University of California, Berkeley, a Masters in Environmental Science from Yale University School of Forestry and Environmental Studies and a Bachelor of Science in Environmental Economics and Environmental Management from the University of York. Prior to starting her doctoral program at the University of California, Berkeley, she was a transportation policy analyst at EMBARQ, the World Resources Institute Center for Sustainable Transport in Washington DC. She has previously studied the economic impact of climate change induced sea level rise and has experience in areas of transportation emissions and energy modeling, transportation policy scenarios building, environmental and social impact analysis of motorization, and sustainable urban transportation development in Asia.  \n \nWei-Shiuen is especially interested in solving urban environmental problems through transportation demand management. She hopes to help reduce carbon emissions from the transportation sector and create livable cities though good planning and policy implementation. \n \nSpecialties: Climate change economics, energy and transportation scenarios modeling, transportation policy analysis, project management, proposal writing, project planning, budgeting and grant management, stakeholders management Wei-Shiuen Ng is a Postdoctoral Scholar in the Precourt Energy Efficiency Center at Stanford University. Her recent research focuses on the evaluation of parking pricing and its influence on travel behavior, as well as the development of transportation policies that will reduce energy use and emissions. \n \nWei-Shiuen holds a Ph.D. in City and Regional Planning from the University of California, Berkeley, a Masters in Environmental Science from Yale University School of Forestry and Environmental Studies and a Bachelor of Science in Environmental Economics and Environmental Management from the University of York. Prior to starting her doctoral program at the University of California, Berkeley, she was a transportation policy analyst at EMBARQ, the World Resources Institute Center for Sustainable Transport in Washington DC. She has previously studied the economic impact of climate change induced sea level rise and has experience in areas of transportation emissions and energy modeling, transportation policy scenarios building, environmental and social impact analysis of motorization, and sustainable urban transportation development in Asia.  \n \nWei-Shiuen is especially interested in solving urban environmental problems through transportation demand management. She hopes to help reduce carbon emissions from the transportation sector and create livable cities though good planning and policy implementation. \n \nSpecialties: Climate change economics, energy and transportation scenarios modeling, transportation policy analysis, project management, proposal writing, project planning, budgeting and grant management, stakeholders management Wei-Shiuen Ng is a Postdoctoral Scholar in the Precourt Energy Efficiency Center at Stanford University. Her recent research focuses on the evaluation of parking pricing and its influence on travel behavior, as well as the development of transportation policies that will reduce energy use and emissions. \n \nWei-Shiuen holds a Ph.D. in City and Regional Planning from the University of California, Berkeley, a Masters in Environmental Science from Yale University School of Forestry and Environmental Studies and a Bachelor of Science in Environmental Economics and Environmental Management from the University of York. Prior to starting her doctoral program at the University of California, Berkeley, she was a transportation policy analyst at EMBARQ, the World Resources Institute Center for Sustainable Transport in Washington DC. She has previously studied the economic impact of climate change induced sea level rise and has experience in areas of transportation emissions and energy modeling, transportation policy scenarios building, environmental and social impact analysis of motorization, and sustainable urban transportation development in Asia.  \n \nWei-Shiuen is especially interested in solving urban environmental problems through transportation demand management. She hopes to help reduce carbon emissions from the transportation sector and create livable cities though good planning and policy implementation. \n \nSpecialties: Climate change economics, energy and transportation scenarios modeling, transportation policy analysis, project management, proposal writing, project planning, budgeting and grant management, stakeholders management Experience Postdoctoral Scholar Stanford University September 2014  – Present (1 year) Graduate Student Instructor UC Berkeley January 2012  –  December 2012  (1 year) Graduate Student Researcher UC Berkeley Center for Global Metropolitan Studies August 2009  –  December 2011  (2 years 5 months) Young Scientist Summer Program Participant International Institute for Applied Systems Analysis (IIASA) June 2010  –  August 2010  (3 months) Vienna, Austria Consultant Asian Development Bank April 2008  –  August 2009  (1 year 5 months) Associate Tellus Institute August 2007  –  April 2008  (9 months) Boston, Massachusetts Research Associate World Resources Institute March 2004  –  May 2007  (3 years 3 months) Washington D.C. Metro Area Consultant Massachusetts Office of Coastal Zone Management - The Great Marsh Coalition July 2003  –  December 2003  (6 months) Essex, Massachusetts Postdoctoral Scholar Stanford University September 2014  – Present (1 year) Postdoctoral Scholar Stanford University September 2014  – Present (1 year) Graduate Student Instructor UC Berkeley January 2012  –  December 2012  (1 year) Graduate Student Instructor UC Berkeley January 2012  –  December 2012  (1 year) Graduate Student Researcher UC Berkeley Center for Global Metropolitan Studies August 2009  –  December 2011  (2 years 5 months) Graduate Student Researcher UC Berkeley Center for Global Metropolitan Studies August 2009  –  December 2011  (2 years 5 months) Young Scientist Summer Program Participant International Institute for Applied Systems Analysis (IIASA) June 2010  –  August 2010  (3 months) Vienna, Austria Young Scientist Summer Program Participant International Institute for Applied Systems Analysis (IIASA) June 2010  –  August 2010  (3 months) Vienna, Austria Consultant Asian Development Bank April 2008  –  August 2009  (1 year 5 months) Consultant Asian Development Bank April 2008  –  August 2009  (1 year 5 months) Associate Tellus Institute August 2007  –  April 2008  (9 months) Boston, Massachusetts Associate Tellus Institute August 2007  –  April 2008  (9 months) Boston, Massachusetts Research Associate World Resources Institute March 2004  –  May 2007  (3 years 3 months) Washington D.C. Metro Area Research Associate World Resources Institute March 2004  –  May 2007  (3 years 3 months) Washington D.C. Metro Area Consultant Massachusetts Office of Coastal Zone Management - The Great Marsh Coalition July 2003  –  December 2003  (6 months) Essex, Massachusetts Consultant Massachusetts Office of Coastal Zone Management - The Great Marsh Coalition July 2003  –  December 2003  (6 months) Essex, Massachusetts Languages   Skills Proposal Writing Project Planning Stakeholder Management Climate Change Sustainability Data Analysis Policy Analysis System Modeling Research Transportation Planning Energy Policy Grant Writing Scenario Analysis Research Project... Environmental Science Sustainable Development Environmental Awareness Policy Analysis Environmental Policy See 5+     See less Skills  Proposal Writing Project Planning Stakeholder Management Climate Change Sustainability Data Analysis Policy Analysis System Modeling Research Transportation Planning Energy Policy Grant Writing Scenario Analysis Research Project... Environmental Science Sustainable Development Environmental Awareness Policy Analysis Environmental Policy See 5+     See less Proposal Writing Project Planning Stakeholder Management Climate Change Sustainability Data Analysis Policy Analysis System Modeling Research Transportation Planning Energy Policy Grant Writing Scenario Analysis Research Project... Environmental Science Sustainable Development Environmental Awareness Policy Analysis Environmental Policy See 5+     See less Proposal Writing Project Planning Stakeholder Management Climate Change Sustainability Data Analysis Policy Analysis System Modeling Research Transportation Planning Energy Policy Grant Writing Scenario Analysis Research Project... Environmental Science Sustainable Development Environmental Awareness Policy Analysis Environmental Policy See 5+     See less Education University of California, Berkeley Doctoral 2009  – 2014 Yale University MSc 2001  – 2003 University of York BSc 1998  – 2001 University of California, Berkeley Doctoral 2009  – 2014 University of California, Berkeley Doctoral 2009  – 2014 University of California, Berkeley Doctoral 2009  – 2014 Yale University MSc 2001  – 2003 Yale University MSc 2001  – 2003 Yale University MSc 2001  – 2003 University of York BSc 1998  – 2001 University of York BSc 1998  – 2001 University of York BSc 1998  – 2001 ", "Skills Matlab Physics Simulations Semiconductors Nanotechnology Characterization Research Sensors Thin Films MEMS Integrated Circuit... Analog Circuit Design RF Engineering Microwave Engineering Ansoft HFSS Vacuum Electronics See 1+     See less Skills  Matlab Physics Simulations Semiconductors Nanotechnology Characterization Research Sensors Thin Films MEMS Integrated Circuit... Analog Circuit Design RF Engineering Microwave Engineering Ansoft HFSS Vacuum Electronics See 1+     See less Matlab Physics Simulations Semiconductors Nanotechnology Characterization Research Sensors Thin Films MEMS Integrated Circuit... Analog Circuit Design RF Engineering Microwave Engineering Ansoft HFSS Vacuum Electronics See 1+     See less Matlab Physics Simulations Semiconductors Nanotechnology Characterization Research Sensors Thin Films MEMS Integrated Circuit... Analog Circuit Design RF Engineering Microwave Engineering Ansoft HFSS Vacuum Electronics See 1+     See less Honors & Awards NSF Graduate Research Fellow National Science Foundation 2003 1st place, Agilent Technologies Project Award in Electrical Engineering at Stanford Agilent Technologies / Stanford EE Dept. June 2003 Departmental award sponsored in conjunction with Agilent Technologies based on lab course student design projects.  \n \nReceived first place award in 2002 and 2003. 1st Place Lincoln/Douglas HS Debate for Washington State 2000 Was state champion in high school debate in 1999 and 2000 and 2nd place in 1998. NSF Graduate Research Fellow National Science Foundation 2003 NSF Graduate Research Fellow National Science Foundation 2003 NSF Graduate Research Fellow National Science Foundation 2003 1st place, Agilent Technologies Project Award in Electrical Engineering at Stanford Agilent Technologies / Stanford EE Dept. June 2003 Departmental award sponsored in conjunction with Agilent Technologies based on lab course student design projects.  \n \nReceived first place award in 2002 and 2003. 1st place, Agilent Technologies Project Award in Electrical Engineering at Stanford Agilent Technologies / Stanford EE Dept. June 2003 Departmental award sponsored in conjunction with Agilent Technologies based on lab course student design projects.  \n \nReceived first place award in 2002 and 2003. 1st place, Agilent Technologies Project Award in Electrical Engineering at Stanford Agilent Technologies / Stanford EE Dept. June 2003 Departmental award sponsored in conjunction with Agilent Technologies based on lab course student design projects.  \n \nReceived first place award in 2002 and 2003. 1st Place Lincoln/Douglas HS Debate for Washington State 2000 Was state champion in high school debate in 1999 and 2000 and 2nd place in 1998. 1st Place Lincoln/Douglas HS Debate for Washington State 2000 Was state champion in high school debate in 1999 and 2000 and 2nd place in 1998. 1st Place Lincoln/Douglas HS Debate for Washington State 2000 Was state champion in high school debate in 1999 and 2000 and 2nd place in 1998. ", "Summary I am a postdoctoral scholar at Stanford University. I received the PhD degree from EURECOM/Telecom Paris Tech in 2013, the M.Sc. degree from Beijing University of Posts and Telecommunications in 2010, and the B.Sc. degree from Tianjin University in 2007. During 2013, I was a visiting scholar at University of California, Irvine. \n \nI am hardworking, targets-oriented, passionate, and a team player.  \nMy industry experience includes doing internship at Ericsson, Beijing. \nMy research interests include information theory, communication theory and estimation theory, as well as their applications in heterogeneous network, relay network, massive MIMO, big data and bioinformatics. Summary I am a postdoctoral scholar at Stanford University. I received the PhD degree from EURECOM/Telecom Paris Tech in 2013, the M.Sc. degree from Beijing University of Posts and Telecommunications in 2010, and the B.Sc. degree from Tianjin University in 2007. During 2013, I was a visiting scholar at University of California, Irvine. \n \nI am hardworking, targets-oriented, passionate, and a team player.  \nMy industry experience includes doing internship at Ericsson, Beijing. \nMy research interests include information theory, communication theory and estimation theory, as well as their applications in heterogeneous network, relay network, massive MIMO, big data and bioinformatics. I am a postdoctoral scholar at Stanford University. I received the PhD degree from EURECOM/Telecom Paris Tech in 2013, the M.Sc. degree from Beijing University of Posts and Telecommunications in 2010, and the B.Sc. degree from Tianjin University in 2007. During 2013, I was a visiting scholar at University of California, Irvine. \n \nI am hardworking, targets-oriented, passionate, and a team player.  \nMy industry experience includes doing internship at Ericsson, Beijing. \nMy research interests include information theory, communication theory and estimation theory, as well as their applications in heterogeneous network, relay network, massive MIMO, big data and bioinformatics. I am a postdoctoral scholar at Stanford University. I received the PhD degree from EURECOM/Telecom Paris Tech in 2013, the M.Sc. degree from Beijing University of Posts and Telecommunications in 2010, and the B.Sc. degree from Tianjin University in 2007. During 2013, I was a visiting scholar at University of California, Irvine. \n \nI am hardworking, targets-oriented, passionate, and a team player.  \nMy industry experience includes doing internship at Ericsson, Beijing. \nMy research interests include information theory, communication theory and estimation theory, as well as their applications in heterogeneous network, relay network, massive MIMO, big data and bioinformatics. Experience Postdoctoral Scholar Stanford University April 2014  – Present (1 year 5 months) Visiting Scholar Stanford University August 2013  –  January 2014  (6 months) Visiting Scholar University of California, Irvine July 2013  –  August 2013  (2 months) Irvine, California Research Assistant EURECOM March 2010  –  August 2013  (3 years 6 months) Intern Research Fellow at Ericsson Beijing Ericsson in Beijing June 2009  –  December 2009  (7 months) Beijing Postdoctoral Scholar Stanford University April 2014  – Present (1 year 5 months) Postdoctoral Scholar Stanford University April 2014  – Present (1 year 5 months) Visiting Scholar Stanford University August 2013  –  January 2014  (6 months) Visiting Scholar Stanford University August 2013  –  January 2014  (6 months) Visiting Scholar University of California, Irvine July 2013  –  August 2013  (2 months) Irvine, California Visiting Scholar University of California, Irvine July 2013  –  August 2013  (2 months) Irvine, California Research Assistant EURECOM March 2010  –  August 2013  (3 years 6 months) Research Assistant EURECOM March 2010  –  August 2013  (3 years 6 months) Intern Research Fellow at Ericsson Beijing Ericsson in Beijing June 2009  –  December 2009  (7 months) Beijing Intern Research Fellow at Ericsson Beijing Ericsson in Beijing June 2009  –  December 2009  (7 months) Beijing Skills Telecommunications LTE Optimization LaTeX Information Theory MIMO Communication Theory Matlab VHDL FPGA C++ OFDM Algorithms Digital Signal... Signal Processing Skills  Telecommunications LTE Optimization LaTeX Information Theory MIMO Communication Theory Matlab VHDL FPGA C++ OFDM Algorithms Digital Signal... Signal Processing Telecommunications LTE Optimization LaTeX Information Theory MIMO Communication Theory Matlab VHDL FPGA C++ OFDM Algorithms Digital Signal... Signal Processing Telecommunications LTE Optimization LaTeX Information Theory MIMO Communication Theory Matlab VHDL FPGA C++ OFDM Algorithms Digital Signal... Signal Processing Education EURECOM / Telecom Paris Tech PhD,  Network information theory and communication theory 2010  – 2013 Beijing University of Post and Telecommunications Master of Science,  Information theory and signal processing 2007  – 2010 Tianjin University Bachelor of Science,  Electronic Information and Engineering 2003  – 2007 EURECOM / Telecom Paris Tech PhD,  Network information theory and communication theory 2010  – 2013 EURECOM / Telecom Paris Tech PhD,  Network information theory and communication theory 2010  – 2013 EURECOM / Telecom Paris Tech PhD,  Network information theory and communication theory 2010  – 2013 Beijing University of Post and Telecommunications Master of Science,  Information theory and signal processing 2007  – 2010 Beijing University of Post and Telecommunications Master of Science,  Information theory and signal processing 2007  – 2010 Beijing University of Post and Telecommunications Master of Science,  Information theory and signal processing 2007  – 2010 Tianjin University Bachelor of Science,  Electronic Information and Engineering 2003  – 2007 Tianjin University Bachelor of Science,  Electronic Information and Engineering 2003  – 2007 Tianjin University Bachelor of Science,  Electronic Information and Engineering 2003  – 2007 ", "Experience Postdoctoral Scholar Stanford University August 2015  – Present (1 month) Palo Alto, California Graduate Research Assistant The University of Iowa August 2008  –  July 2015  (7 years) Currently exploring natural language processing (NLP) applications in disease \nsurveillance using social media (e.g., Craigslist) and electronic medical record text. \n \nLead developer on the Iowa Electronic Health Markets (IEhM), a website researching the use of prediction markets to collect surveillance data on the spread of diseases such as influenza. University of Iowa Campus Ambassador Cerner Corporation August 2006  –  May 2007  (10 months) Iowa City, Iowa Coordinated student outreach with Cerner’s campus recruiter. Software Engineer Intern Cerner Corporation May 2006  –  September 2006  (5 months) Kansas City, Missouri Responsible for re-engineering Cerner’s internal, international process management website “CAPEWeb”.  \n \nCoordinated interdepartmental discussions regarding broad CAPEWeb design goals and specifc \ntechnical requirements for the new site design. \n \nImplemented development site demonstrating all new features which, at summer’s end, was approved for further development and eventual deployment. \n \nResponsible for writing project documentation and educating a full time engineer to continue \nCAPEWeb development. Postdoctoral Scholar Stanford University August 2015  – Present (1 month) Palo Alto, California Postdoctoral Scholar Stanford University August 2015  – Present (1 month) Palo Alto, California Graduate Research Assistant The University of Iowa August 2008  –  July 2015  (7 years) Currently exploring natural language processing (NLP) applications in disease \nsurveillance using social media (e.g., Craigslist) and electronic medical record text. \n \nLead developer on the Iowa Electronic Health Markets (IEhM), a website researching the use of prediction markets to collect surveillance data on the spread of diseases such as influenza. Graduate Research Assistant The University of Iowa August 2008  –  July 2015  (7 years) Currently exploring natural language processing (NLP) applications in disease \nsurveillance using social media (e.g., Craigslist) and electronic medical record text. \n \nLead developer on the Iowa Electronic Health Markets (IEhM), a website researching the use of prediction markets to collect surveillance data on the spread of diseases such as influenza. University of Iowa Campus Ambassador Cerner Corporation August 2006  –  May 2007  (10 months) Iowa City, Iowa Coordinated student outreach with Cerner’s campus recruiter. University of Iowa Campus Ambassador Cerner Corporation August 2006  –  May 2007  (10 months) Iowa City, Iowa Coordinated student outreach with Cerner’s campus recruiter. Software Engineer Intern Cerner Corporation May 2006  –  September 2006  (5 months) Kansas City, Missouri Responsible for re-engineering Cerner’s internal, international process management website “CAPEWeb”.  \n \nCoordinated interdepartmental discussions regarding broad CAPEWeb design goals and specifc \ntechnical requirements for the new site design. \n \nImplemented development site demonstrating all new features which, at summer’s end, was approved for further development and eventual deployment. \n \nResponsible for writing project documentation and educating a full time engineer to continue \nCAPEWeb development. Software Engineer Intern Cerner Corporation May 2006  –  September 2006  (5 months) Kansas City, Missouri Responsible for re-engineering Cerner’s internal, international process management website “CAPEWeb”.  \n \nCoordinated interdepartmental discussions regarding broad CAPEWeb design goals and specifc \ntechnical requirements for the new site design. \n \nImplemented development site demonstrating all new features which, at summer’s end, was approved for further development and eventual deployment. \n \nResponsible for writing project documentation and educating a full time engineer to continue \nCAPEWeb development. Languages German German German Skills Natural Language... Python C++ Machine Learning Algorithms Data Mining LaTeX Computer Science Pattern Recognition Java Statistics Skills  Natural Language... Python C++ Machine Learning Algorithms Data Mining LaTeX Computer Science Pattern Recognition Java Statistics Natural Language... Python C++ Machine Learning Algorithms Data Mining LaTeX Computer Science Pattern Recognition Java Statistics Natural Language... Python C++ Machine Learning Algorithms Data Mining LaTeX Computer Science Pattern Recognition Java Statistics Education University of Iowa Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2015 University of Iowa MS,  Computer Science 2009  – 2013 University of Iowa BA,  English ,  Computer Science 2005  – 2009 University of Iowa Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2015 University of Iowa Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2015 University of Iowa Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2015 University of Iowa MS,  Computer Science 2009  – 2013 University of Iowa MS,  Computer Science 2009  – 2013 University of Iowa MS,  Computer Science 2009  – 2013 University of Iowa BA,  English ,  Computer Science 2005  – 2009 University of Iowa BA,  English ,  Computer Science 2005  – 2009 University of Iowa BA,  English ,  Computer Science 2005  – 2009 ", "Experience Postdoctoral Scholar Stanford University October 2014  – Present (11 months) Assistant Research Scientist New York University October 2012  –  September 2014  (2 years) PhD student Charles University June 2008  –  September 2012  (4 years 4 months) PhD student Institute of Organic Chemistry and Biochemistry, Academy of Sciences, Prague June 2008  –  September 2012  (4 years 4 months) Undergraduate researcher Institute of Physics, Academy of Sciences of the Czech Republic January 2007  –  August 2007  (8 months) English Tutor English Just for You, s.r.o. 2005  –  2006  (1 year) External translator Ando Translations 2000  –  2004  (4 years) Postdoctoral Scholar Stanford University October 2014  – Present (11 months) Postdoctoral Scholar Stanford University October 2014  – Present (11 months) Assistant Research Scientist New York University October 2012  –  September 2014  (2 years) Assistant Research Scientist New York University October 2012  –  September 2014  (2 years) PhD student Charles University June 2008  –  September 2012  (4 years 4 months) PhD student Charles University June 2008  –  September 2012  (4 years 4 months) PhD student Institute of Organic Chemistry and Biochemistry, Academy of Sciences, Prague June 2008  –  September 2012  (4 years 4 months) PhD student Institute of Organic Chemistry and Biochemistry, Academy of Sciences, Prague June 2008  –  September 2012  (4 years 4 months) Undergraduate researcher Institute of Physics, Academy of Sciences of the Czech Republic January 2007  –  August 2007  (8 months) Undergraduate researcher Institute of Physics, Academy of Sciences of the Czech Republic January 2007  –  August 2007  (8 months) English Tutor English Just for You, s.r.o. 2005  –  2006  (1 year) English Tutor English Just for You, s.r.o. 2005  –  2006  (1 year) External translator Ando Translations 2000  –  2004  (4 years) External translator Ando Translations 2000  –  2004  (4 years) Skills Physics Science Scientific Computing LaTeX High Performance... Programming Computer Science Chemistry Theory Biophysics Numerical Simulation Python Molecular Dynamics C++ Spectroscopy Simulations Algorithms Research Linux Parallel Computing See 5+     See less Skills  Physics Science Scientific Computing LaTeX High Performance... Programming Computer Science Chemistry Theory Biophysics Numerical Simulation Python Molecular Dynamics C++ Spectroscopy Simulations Algorithms Research Linux Parallel Computing See 5+     See less Physics Science Scientific Computing LaTeX High Performance... Programming Computer Science Chemistry Theory Biophysics Numerical Simulation Python Molecular Dynamics C++ Spectroscopy Simulations Algorithms Research Linux Parallel Computing See 5+     See less Physics Science Scientific Computing LaTeX High Performance... Programming Computer Science Chemistry Theory Biophysics Numerical Simulation Python Molecular Dynamics C++ Spectroscopy Simulations Algorithms Research Linux Parallel Computing See 5+     See less Education Charles University in Prague PhD,  Biophysics ,  Chemical and Macromolecular Physics 2008  – 2012 Charles University in Prague MSc,  theoretical physics 2002  – 2008 MSc thesis with the title \"Advanced techniques of computer modelling in plasma physics\" Activities and Societies:  academic debating Gymnázium Olomouc-Hejčín English section ,  bilingual education 1996  – 2002 Charles University in Prague PhD,  Biophysics ,  Chemical and Macromolecular Physics 2008  – 2012 Charles University in Prague PhD,  Biophysics ,  Chemical and Macromolecular Physics 2008  – 2012 Charles University in Prague PhD,  Biophysics ,  Chemical and Macromolecular Physics 2008  – 2012 Charles University in Prague MSc,  theoretical physics 2002  – 2008 MSc thesis with the title \"Advanced techniques of computer modelling in plasma physics\" Activities and Societies:  academic debating Charles University in Prague MSc,  theoretical physics 2002  – 2008 MSc thesis with the title \"Advanced techniques of computer modelling in plasma physics\" Activities and Societies:  academic debating Charles University in Prague MSc,  theoretical physics 2002  – 2008 MSc thesis with the title \"Advanced techniques of computer modelling in plasma physics\" Activities and Societies:  academic debating Gymnázium Olomouc-Hejčín English section ,  bilingual education 1996  – 2002 Gymnázium Olomouc-Hejčín English section ,  bilingual education 1996  – 2002 Gymnázium Olomouc-Hejčín English section ,  bilingual education 1996  – 2002 Honors & Awards Česká hlava - cena MŠMT ČR November 2013 An award for the best PhD thesis endorsed by the Ministry of Education of the Czech Republic. \n \nOfficial website (in Czech): \nhttp://www.ceskahlava.cz/cz/2013/vitezove-ceska-hlava/vitez-mgr-ondrej-marsalek-phd-139/ Additional Honors & Awards McKinsey Scholarship, Prague, 2006 Česká hlava - cena MŠMT ČR November 2013 An award for the best PhD thesis endorsed by the Ministry of Education of the Czech Republic. \n \nOfficial website (in Czech): \nhttp://www.ceskahlava.cz/cz/2013/vitezove-ceska-hlava/vitez-mgr-ondrej-marsalek-phd-139/ Česká hlava - cena MŠMT ČR November 2013 An award for the best PhD thesis endorsed by the Ministry of Education of the Czech Republic. \n \nOfficial website (in Czech): \nhttp://www.ceskahlava.cz/cz/2013/vitezove-ceska-hlava/vitez-mgr-ondrej-marsalek-phd-139/ Česká hlava - cena MŠMT ČR November 2013 An award for the best PhD thesis endorsed by the Ministry of Education of the Czech Republic. \n \nOfficial website (in Czech): \nhttp://www.ceskahlava.cz/cz/2013/vitezove-ceska-hlava/vitez-mgr-ondrej-marsalek-phd-139/ Additional Honors & Awards McKinsey Scholarship, Prague, 2006 Additional Honors & Awards McKinsey Scholarship, Prague, 2006 Additional Honors & Awards McKinsey Scholarship, Prague, 2006 ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Education University of California, Berkeley Doctor of Philosophy (PhD),  Molecular and Biochemical Nutrition/Metabolic Biology 2007  – 2012 McGill University BSc,  Biology Honours 2002  – 2007 Oak Ridge High School High School Diploma,  Cumma Sum Laude 1998  – 2002 Activities and Societies:  Academy of Science and Technology University of California, Berkeley Doctor of Philosophy (PhD),  Molecular and Biochemical Nutrition/Metabolic Biology 2007  – 2012 University of California, Berkeley Doctor of Philosophy (PhD),  Molecular and Biochemical Nutrition/Metabolic Biology 2007  – 2012 University of California, Berkeley Doctor of Philosophy (PhD),  Molecular and Biochemical Nutrition/Metabolic Biology 2007  – 2012 McGill University BSc,  Biology Honours 2002  – 2007 McGill University BSc,  Biology Honours 2002  – 2007 McGill University BSc,  Biology Honours 2002  – 2007 Oak Ridge High School High School Diploma,  Cumma Sum Laude 1998  – 2002 Activities and Societies:  Academy of Science and Technology Oak Ridge High School High School Diploma,  Cumma Sum Laude 1998  – 2002 Activities and Societies:  Academy of Science and Technology Oak Ridge High School High School Diploma,  Cumma Sum Laude 1998  – 2002 Activities and Societies:  Academy of Science and Technology Honors & Awards Cell Reports: Best of 2013 Cell Reports January 2014 Authored article \" SIRT3 Reverses Aging-Associated Dysfunction\" Selected as one of Cell Reports' Best of 2013.  Presentation Finalist- BCG Case Competition Boston Consulting Group ( through Stanford School of Medicine Career Center) August 2013 Competed in a team with two other life scientists at Stanford on a fictional, but representative, consulting case for a two week period on our own time. Our team's proposal was selected for the final round presentations in front of a panel of judges. We achieved 3rd place.  Keystone Symposia Scholarship Keystone Symposium Future of Science Fund February 2012 Travel award of $1200 offered based on quality of submitted abstract and recommendation by mentor. The award is meant to defray expenses incurred by attending the symposia.  Program speaker(short talk)- Hot topics in Cancer Metabolism Keystone Symposia on Cancer Metabolism February 2012 Invited to give a short talk/presentation to an audience of a few hundred members. Selection was based on quality and interest of submitted abstract.  Poster Presentation- Cancer and Metabolism Rueben J Shaw and David Sabbatini February 2012 Presentation of poster during poster session. Invited to present poster based on quality of submitted abstract.  Poster presentation Berkeley Stem Cell Center Retreat organizers April 2010 Presentation of poster on genetic factors influencing adult murine hematopoietic stem cell aging amongst peers and principle investigators from UC Berkeley.  Program Speaker( short talk) Bay Area Aging Meeting organizers April 2010 Invited to give a short talk/presentation on research related to genetic mediators of the benefits of calorie restriction in mice.  Cell Reports: Best of 2013 Cell Reports January 2014 Authored article \" SIRT3 Reverses Aging-Associated Dysfunction\" Selected as one of Cell Reports' Best of 2013.  Cell Reports: Best of 2013 Cell Reports January 2014 Authored article \" SIRT3 Reverses Aging-Associated Dysfunction\" Selected as one of Cell Reports' Best of 2013.  Cell Reports: Best of 2013 Cell Reports January 2014 Authored article \" SIRT3 Reverses Aging-Associated Dysfunction\" Selected as one of Cell Reports' Best of 2013.  Presentation Finalist- BCG Case Competition Boston Consulting Group ( through Stanford School of Medicine Career Center) August 2013 Competed in a team with two other life scientists at Stanford on a fictional, but representative, consulting case for a two week period on our own time. Our team's proposal was selected for the final round presentations in front of a panel of judges. We achieved 3rd place.  Presentation Finalist- BCG Case Competition Boston Consulting Group ( through Stanford School of Medicine Career Center) August 2013 Competed in a team with two other life scientists at Stanford on a fictional, but representative, consulting case for a two week period on our own time. Our team's proposal was selected for the final round presentations in front of a panel of judges. We achieved 3rd place.  Presentation Finalist- BCG Case Competition Boston Consulting Group ( through Stanford School of Medicine Career Center) August 2013 Competed in a team with two other life scientists at Stanford on a fictional, but representative, consulting case for a two week period on our own time. Our team's proposal was selected for the final round presentations in front of a panel of judges. We achieved 3rd place.  Keystone Symposia Scholarship Keystone Symposium Future of Science Fund February 2012 Travel award of $1200 offered based on quality of submitted abstract and recommendation by mentor. The award is meant to defray expenses incurred by attending the symposia.  Keystone Symposia Scholarship Keystone Symposium Future of Science Fund February 2012 Travel award of $1200 offered based on quality of submitted abstract and recommendation by mentor. The award is meant to defray expenses incurred by attending the symposia.  Keystone Symposia Scholarship Keystone Symposium Future of Science Fund February 2012 Travel award of $1200 offered based on quality of submitted abstract and recommendation by mentor. The award is meant to defray expenses incurred by attending the symposia.  Program speaker(short talk)- Hot topics in Cancer Metabolism Keystone Symposia on Cancer Metabolism February 2012 Invited to give a short talk/presentation to an audience of a few hundred members. Selection was based on quality and interest of submitted abstract.  Program speaker(short talk)- Hot topics in Cancer Metabolism Keystone Symposia on Cancer Metabolism February 2012 Invited to give a short talk/presentation to an audience of a few hundred members. Selection was based on quality and interest of submitted abstract.  Program speaker(short talk)- Hot topics in Cancer Metabolism Keystone Symposia on Cancer Metabolism February 2012 Invited to give a short talk/presentation to an audience of a few hundred members. Selection was based on quality and interest of submitted abstract.  Poster Presentation- Cancer and Metabolism Rueben J Shaw and David Sabbatini February 2012 Presentation of poster during poster session. Invited to present poster based on quality of submitted abstract.  Poster Presentation- Cancer and Metabolism Rueben J Shaw and David Sabbatini February 2012 Presentation of poster during poster session. Invited to present poster based on quality of submitted abstract.  Poster Presentation- Cancer and Metabolism Rueben J Shaw and David Sabbatini February 2012 Presentation of poster during poster session. Invited to present poster based on quality of submitted abstract.  Poster presentation Berkeley Stem Cell Center Retreat organizers April 2010 Presentation of poster on genetic factors influencing adult murine hematopoietic stem cell aging amongst peers and principle investigators from UC Berkeley.  Poster presentation Berkeley Stem Cell Center Retreat organizers April 2010 Presentation of poster on genetic factors influencing adult murine hematopoietic stem cell aging amongst peers and principle investigators from UC Berkeley.  Poster presentation Berkeley Stem Cell Center Retreat organizers April 2010 Presentation of poster on genetic factors influencing adult murine hematopoietic stem cell aging amongst peers and principle investigators from UC Berkeley.  Program Speaker( short talk) Bay Area Aging Meeting organizers April 2010 Invited to give a short talk/presentation on research related to genetic mediators of the benefits of calorie restriction in mice.  Program Speaker( short talk) Bay Area Aging Meeting organizers April 2010 Invited to give a short talk/presentation on research related to genetic mediators of the benefits of calorie restriction in mice.  Program Speaker( short talk) Bay Area Aging Meeting organizers April 2010 Invited to give a short talk/presentation on research related to genetic mediators of the benefits of calorie restriction in mice.  ", "Experience Postdoctoral Scholar Stanford University Postdoctoral Scholar Stanford University Postdoctoral Scholar Stanford University Education Massachusetts Institute of Technology 2000  – 2006 Massachusetts Institute of Technology 2000  – 2006 Massachusetts Institute of Technology 2000  – 2006 Massachusetts Institute of Technology 2000  – 2006 ", "Experience Postdoctoral scholar Stanford University February 2005  – Present (10 years 7 months) Postdoctoral Fellow Postdoctoral scholar Stanford University February 2005  – Present (10 years 7 months) Postdoctoral Fellow Postdoctoral scholar Stanford University February 2005  – Present (10 years 7 months) Postdoctoral Fellow Education University of Wisconsin-Madison 1998  – 2004 University of Wisconsin-Madison 1998  – 2004 University of Wisconsin-Madison 1998  – 2004 University of Wisconsin-Madison 1998  – 2004 ", "Summary My motto: \"shaping the future with research; managing the presence to excellence\". \n \nThere is one question I ask myself every day: how can I make a real impact on people lives? Scientific research and commitment to leadership are my answers. \n \nEnergy is the most important challenge of the next century. I am interested in energy efficiency and new approaches to enable competitive renewable energy sources. In my research, I work with light and matter. I create semiconductor nanostructures specifically designed to be efficient light sources; on a different side, I manipulate and trap light to envision next generation of silicon-based solar cells. I am a physicist by training (PhD in 2010). Right now, my research activity is across physics, materials science, and engineering. The perfect balance between fundamental concepts applied to real devices. I always had a strong interaction with semiconductor industries. I have large experience and ability to design, fabricate and test new materials and device prototypes, developing a new idea from the basic physical principles to an actual implementation. \n \nI am aware that innovation can be made only by a diverse team of people focused on the same goal. Getting the best out of each of us is the most challenging role of a leader. I had the possibility to manage small and large groups of people, achieving unexpected great results, with a large impact on the group members as well as on a large community. \n \nMy strengths are: excellent time management, people values and interests evaluation, peer support and consulting, mentoring experience, events organization, tasks organization and coordination. \n \nPeople I met with think I am action-oriented and collaborative. \nMy friends define me as trustworthy and problem solver. \nI consider myself curious and organized. \n \nFor more information about me and my projects take a look at my website: Summary My motto: \"shaping the future with research; managing the presence to excellence\". \n \nThere is one question I ask myself every day: how can I make a real impact on people lives? Scientific research and commitment to leadership are my answers. \n \nEnergy is the most important challenge of the next century. I am interested in energy efficiency and new approaches to enable competitive renewable energy sources. In my research, I work with light and matter. I create semiconductor nanostructures specifically designed to be efficient light sources; on a different side, I manipulate and trap light to envision next generation of silicon-based solar cells. I am a physicist by training (PhD in 2010). Right now, my research activity is across physics, materials science, and engineering. The perfect balance between fundamental concepts applied to real devices. I always had a strong interaction with semiconductor industries. I have large experience and ability to design, fabricate and test new materials and device prototypes, developing a new idea from the basic physical principles to an actual implementation. \n \nI am aware that innovation can be made only by a diverse team of people focused on the same goal. Getting the best out of each of us is the most challenging role of a leader. I had the possibility to manage small and large groups of people, achieving unexpected great results, with a large impact on the group members as well as on a large community. \n \nMy strengths are: excellent time management, people values and interests evaluation, peer support and consulting, mentoring experience, events organization, tasks organization and coordination. \n \nPeople I met with think I am action-oriented and collaborative. \nMy friends define me as trustworthy and problem solver. \nI consider myself curious and organized. \n \nFor more information about me and my projects take a look at my website: My motto: \"shaping the future with research; managing the presence to excellence\". \n \nThere is one question I ask myself every day: how can I make a real impact on people lives? Scientific research and commitment to leadership are my answers. \n \nEnergy is the most important challenge of the next century. I am interested in energy efficiency and new approaches to enable competitive renewable energy sources. In my research, I work with light and matter. I create semiconductor nanostructures specifically designed to be efficient light sources; on a different side, I manipulate and trap light to envision next generation of silicon-based solar cells. I am a physicist by training (PhD in 2010). Right now, my research activity is across physics, materials science, and engineering. The perfect balance between fundamental concepts applied to real devices. I always had a strong interaction with semiconductor industries. I have large experience and ability to design, fabricate and test new materials and device prototypes, developing a new idea from the basic physical principles to an actual implementation. \n \nI am aware that innovation can be made only by a diverse team of people focused on the same goal. Getting the best out of each of us is the most challenging role of a leader. I had the possibility to manage small and large groups of people, achieving unexpected great results, with a large impact on the group members as well as on a large community. \n \nMy strengths are: excellent time management, people values and interests evaluation, peer support and consulting, mentoring experience, events organization, tasks organization and coordination. \n \nPeople I met with think I am action-oriented and collaborative. \nMy friends define me as trustworthy and problem solver. \nI consider myself curious and organized. \n \nFor more information about me and my projects take a look at my website: My motto: \"shaping the future with research; managing the presence to excellence\". \n \nThere is one question I ask myself every day: how can I make a real impact on people lives? Scientific research and commitment to leadership are my answers. \n \nEnergy is the most important challenge of the next century. I am interested in energy efficiency and new approaches to enable competitive renewable energy sources. In my research, I work with light and matter. I create semiconductor nanostructures specifically designed to be efficient light sources; on a different side, I manipulate and trap light to envision next generation of silicon-based solar cells. I am a physicist by training (PhD in 2010). Right now, my research activity is across physics, materials science, and engineering. The perfect balance between fundamental concepts applied to real devices. I always had a strong interaction with semiconductor industries. I have large experience and ability to design, fabricate and test new materials and device prototypes, developing a new idea from the basic physical principles to an actual implementation. \n \nI am aware that innovation can be made only by a diverse team of people focused on the same goal. Getting the best out of each of us is the most challenging role of a leader. I had the possibility to manage small and large groups of people, achieving unexpected great results, with a large impact on the group members as well as on a large community. \n \nMy strengths are: excellent time management, people values and interests evaluation, peer support and consulting, mentoring experience, events organization, tasks organization and coordination. \n \nPeople I met with think I am action-oriented and collaborative. \nMy friends define me as trustworthy and problem solver. \nI consider myself curious and organized. \n \nFor more information about me and my projects take a look at my website: Experience Postdoctoral Scholar Stanford University September 2013  – Present (2 years) I joined Stanford University in September, 2013 as a PostDoctoral Scholar in the group of Prof. Mark Brongersma. My research project focuses on improving the existing solar cells and make them cheaper and a real alternative to traditional energy sources. My project here is funded by 3Sun / Enel Green Power / ST Microelectronics.  \n \nInvited talk: \nTransparent Conductive Oxides: a new material platform for optoelectronic, plasmonic and photovoltaic, Department of Physics and Astronomy, University of Catania & EPS Young Minds Catania chapter & OSA Catania chapter (January 8th, 2014) \n \nConference participation: \n- BAPVC meeting Spring 2013 – Stanford University \n- BAPVC meeting Fall 2013 – UC Berkeley \n- MRS Spring meeting 2014 – San Francisco, CA (USA) Poster presentation \n- BAPVC meeting Spring 2014 – Stanford University \n- BAPVC meeting Fall 2014 – UC Berkeley \n- MRS Fall meeting 2014 – Boston, MA (USA) Oral presentation \n \nLeadership formation: \n \n- Admitted at the full time Stanford Ignite program by the Stanford Graduate School of Business (Summer 2015) \n- Admitted at \"The Improviser’s Mindset\" class offered by the Stanford Office of the Vice Provost for Graduate Education (Summer 2014) \n- Negotiation skills class, offered by the Stanford Office of Postdoctoral Affairs \n- Future Faculty Seminar INDE/CTL231 class, offered by the Stanford University \n- iRite/iSpeak course, offered by the Stanford Office of Postdoctoral Affairs \n- Stanford future leaders: Mentoring Workshop, offered by the Stanford Office of Postdoctoral Affairs Coach Stanford Leaders in Communication club November 2013  – Present (1 year 10 months) Stanford, CA Our motto is: Leadership is the art of getting someone else to do something you want done, because he wants to do it (D. Eisenhower).  \n \nWe learn all the persuasion and communication techniques by practicing on real-world case scenario and learning by examples.  \n \nSelected by the Director of the Stanford Interdisciplinary Life Science Communications as a facilitator for a scientific pitch training workshop for 3rd year Stanford grad students. \n \nSelected by the Associate Director of Curriculum Development of the Stanford School of Medicine Career Center as a facilitator for the class INDE231A - Academic Interviews: Workshop and Clinic (Fall 2014) \n \nMentor at StartX - Stanford start-up accelerator Chief Organizer TEDxSSCLive January 2015  –  March 2015  (3 months) Catania Area, Italy President of the Association Alumni Scuola Superiore di Catania January 2011  –  December 2014  (4 years) I strongly believe in the give-back idea. I hold my current position also because of my education. This is because I decided to get involved in my alma mater alumni association. This really is a rewarding experience in terms of positive feedbacks, satisfactions for all the organized events, and recognition from the current students.  \n \n \nWho we are \n \n130+ alumni of a high-excellence education institution within the University of Catania (Scuola Superiore di Catania). The institution acceptance rate is very low (less than 10%). It provides a full scholarship for all the college years, including lodging in an historical campus (Villa San Saverio). Very high grade average and strict deadlines are required to maintain the scholarship. Attendance of complementary and high-level classes is required, along with a research thesis at the end of the scholarship (in addition to the standard university classes and master thesis). As alumni, we contribute to the education of the current students, create a network of diverse experiences and skills, represent the best output of our alma mater. \n \n \nWhat we do \n \nWe organize scientific seminars and conferences (once a week during the school year) and orientation activities. We mentor current students. We organize social events. \n \n \nMy role and responsibilities \n \nAs a President, I run and lead the organization of all the events and activities; I interact with the academic and students representatives; I organize an yearly fund-raising campaign to support the Association activities; I interact with all the alumni members to involve, motivate, and support their active participation; I am the administrator of the Association website, Facebook and LinkedIn groups, Twitter and YouTube accounts. Chief Organizer TEDxSSC April 2014  –  October 2014  (7 months) TEDxSSC - Dall'eccezione alla regola (From the exception to the rule) \n \nLeading the entire organization of a TEDx event (100+ guests, 20+ speakers, 18 organizing \nteam members, $20k budget). \n \nTED is a world-wide recognized brand ensuring high quality talks, speakers and ideas. As a President of the SSC Alumni Association, along with the Student Association and the academic leaders, we decided to bring TED experience in our institution and community through TEDxSSC. In fact, many of the TEDx values match our institution values (interdisciplinarity, fostering new ideas, spreading innovation and creativity). TEDx mission is to communicate the power of ideas to change attitudes, lives and, ultimately, the world. We want to demonstrate how uncommon ideas and people (the exceptions) can make a real difference, change the world and set a new standard for our everyday life. We have chosen an extremely fascinating theme: “Dall’eccezione alla regola” (“From the exception to the standard”). Our speakers will be unheard local voices as well as known personalities. We will select our list of speakers choosing those people that can tell their personal story as an example of something first considered an exception, then becoming a new standard. iFarm Team program volunteer Stanford University Office of Technology Licensing January 2014  –  June 2014  (6 months) Moving technology form the research lab to everyday life. This is my goal. \n \nI was admitted in the Stanford iFarm program during Winter 2014. The Stanford Innovation Farm Teams Project seeks to improve success and overall efficiency of the commercialization of Stanford-owned inventions while providing an educational experience to iFarm Team participants. Participation in the iFarm Team Project provides individuals with a unique educational experience and opportunity to network in highly competitive industries. Together with my other teammates, we will select one of the Stanford-owned technology and move it to a commercialization stage. PostDoctoral Associate Boston University March 2011  –  August 2013  (2 years 6 months) Research projects funded by Air Force OSR and DARPA \n \n \nPublication output: \n \nPhotonic–Plasmonic Coupling of GaAs Single Nanowires to Optical Nanoantennas \nNano Letters 14, 2271 (2014) \n \nSize-dependent second-harmonic generation from gold nanoparticles \nPhysical Review B 89, 125414 (2014) \n \nPhotonic-Plasmonic coupled Nanoantennas for Polarization-controlled Multispectral Nanofocusing \nOptics Letters 38, 4861 (2013) \n \nEnhanced second harmonic generation from InAs nano-wing structures on silicon \nNanoscale 5, 10163 (2013) \n \nDevelopment of AlGaN-based GRINSCH deep UV emitters by Molecular Beam Epitaxy \nJournal of Vacuum Science and Technology B 31, 03C117 (2013) \n \nGeneration of second harmonic radiation from sub-stoichiometric silicon nitride thin films \nApplied Physics Letters 102, 141114 (2013) \n \nVertical III-V V-shaped membranes epitaxially grown on a patterned Si[001] substrate and their enhanced light scattering \nACS Nano 6, 10982 (2012) \n \nRare-earth doped Si-rich ZnO for multiband near-infrared light emitting devices \nApplied Physics Letters 101, 191115 (2012) \n \nSub-250nm light emission and optical gain in AlGaN materials \nJournal of Applied Physics 113, 013106 (2013) \n \nPolarization Properties of Deep-UV Optical Gain in Al-rich AlGaN Structures \nApplied Physics Express 5, 032103 (2012) \n \nNanopatterning of silicon nanowires for enhancing visible photoluminescence \nNanoscale 4, 2863 (2012) \n \nSub-250nm room-temperature optical gain from AlGaN/AlN multiple quantum wells with strong band-structure potential fluctuations \nApplied Physics Letters, 100, 061111 (2012) \n \n \nConference proceedings: \n \nInternational Conference on One dimensional Nanomaterials \n \nThe International Conference on Surface Plasmon Photonics \n \nBulletin of the American Physical Society \n \nFrontiers in Optics (FiO) – Novel Silicon Waveguides and Nanophotonics (FM4E) \n \nCLEO: Science and Innovations Laboratory Safety Coordinator Boston University Research Compliance – Environmental Health & Safety March 2011  –  August 2013  (2 years 6 months) Postdoctoral Fellow University of Catania November 2009  –  December 2010  (1 year 2 months) Research project: \n \nGrowth and characterization of Si and Ge nanowires, funded by Centro Siciliano di Fisica Nucleare e Struttura della Materia \n \n \nPublication output: \n \nTemperature dependence and aging effects on silicon nanowires photoluminescence \nOptics Express 20, 1483 (2012) \n \nQuantum confinement and electroluminescence in ultrathin silicon nanowires fabricated by a maskless etching technique \nNanotechnology 23, 075204 (2012) \n \n \nBook / Book chapter: \n \nSilicon Nanowires Light Emitting Devices at Room Temperature in Nano-Optics for Enhancing Light-Matter Interactions on a Molecular Scale – Di Bartolo, Baldassare; Collins, John (Eds.) \nSpringer (2013), ISBN: 978-9400753129 Vice-President and member of the Executive Board Alumni Scuola Superiore di Catania January 2009  –  December 2010  (2 years) Webmaster Matis - CNR-IMM November 2006  –  December 2010  (4 years 2 months) http://www.matis.imm.cnr.it Representative of Ph. D. Students in the Department Executive Committee Department of Physics and Astronomy, University of Catania November 2007  –  October 2009  (2 years) PhD Student University of Catania November 2006  –  October 2009  (3 years) PhD in Physics, cum laude \n \nThesis title: Growth, properties and processing of group IV semiconductor nanowires \n \nTutor: prof. Francesco Priolo \n \n \nPublication output: \n \nKinetics of Si and Ge Nanowires Growth through Electron Beam Evaporation \nNanoscale Research Letters 6, 162 (2011) \n \nHeteroepitaxial growth of Ge nanowires on Si substrates \nInternational Journal of Photoenergy 2012, 782835 (2012) \n \nIon beam-induced bending of silicon nanowires \nPhysica E 44, 1074 (2012) \n \nNanoscale amorphization, bending and recrystallization in silicon nanowires \nApplied Physics A 102, 13 (2011) \nInvited paper \n \nHeteroepitaxial growth and faceting of Ge nanowires on (111) Si by electron beam evaporation \nElectrochemical and Solid State Letters 13, K53 (2010) \n \nInfluence of O contamination and Au cluster properties on the structural features of Si nanowires \nThin Solid Films 518, 2562 (2010) \n \nControl of growth mechanisms and orientation in epitaxial Si nanowires grown by electron beam evaporation \nNanotechnology 20, 135601 (2009) \n \n \nBook / Book chapter: \n \nGrowth, properties and processing of group IV semiconductor nanowires \nVDM Verlag Dr. Muller (August 4, 2011), ISBN: 978-3639375763 \n \n \nConference participation: \n \nE-MRS Fall Meeting 2010 – Warsaw (PL) September 13-17, 2010 Oral presentation, Symposium E \n \nInternational School on “Materials for Renewable Energies” – Erice (TP, Italy) May 28 – June 2, 2010 Poster session \n \nE-MRS 2009 – Strasbourg (F) June 8-12, 2009 Oral presentation, Symposium I \n \nNODE International Summer School – Cortona (AR, Italy) July 1-5, 2008 Poster session \n \nXV International Winter School on “New Developments in Solid State Physics” – Bad HofGastein (Salzburg, AT) February 18-22, 2008 \n \nXIII National School of Materials Science – Bressanone (Bz, Italy) September 30 – October 9, 2007 Poster session \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) September 18-22, 2006 Poster session Postdoctoral Scholar Stanford University September 2013  – Present (2 years) I joined Stanford University in September, 2013 as a PostDoctoral Scholar in the group of Prof. Mark Brongersma. My research project focuses on improving the existing solar cells and make them cheaper and a real alternative to traditional energy sources. My project here is funded by 3Sun / Enel Green Power / ST Microelectronics.  \n \nInvited talk: \nTransparent Conductive Oxides: a new material platform for optoelectronic, plasmonic and photovoltaic, Department of Physics and Astronomy, University of Catania & EPS Young Minds Catania chapter & OSA Catania chapter (January 8th, 2014) \n \nConference participation: \n- BAPVC meeting Spring 2013 – Stanford University \n- BAPVC meeting Fall 2013 – UC Berkeley \n- MRS Spring meeting 2014 – San Francisco, CA (USA) Poster presentation \n- BAPVC meeting Spring 2014 – Stanford University \n- BAPVC meeting Fall 2014 – UC Berkeley \n- MRS Fall meeting 2014 – Boston, MA (USA) Oral presentation \n \nLeadership formation: \n \n- Admitted at the full time Stanford Ignite program by the Stanford Graduate School of Business (Summer 2015) \n- Admitted at \"The Improviser’s Mindset\" class offered by the Stanford Office of the Vice Provost for Graduate Education (Summer 2014) \n- Negotiation skills class, offered by the Stanford Office of Postdoctoral Affairs \n- Future Faculty Seminar INDE/CTL231 class, offered by the Stanford University \n- iRite/iSpeak course, offered by the Stanford Office of Postdoctoral Affairs \n- Stanford future leaders: Mentoring Workshop, offered by the Stanford Office of Postdoctoral Affairs Postdoctoral Scholar Stanford University September 2013  – Present (2 years) I joined Stanford University in September, 2013 as a PostDoctoral Scholar in the group of Prof. Mark Brongersma. My research project focuses on improving the existing solar cells and make them cheaper and a real alternative to traditional energy sources. My project here is funded by 3Sun / Enel Green Power / ST Microelectronics.  \n \nInvited talk: \nTransparent Conductive Oxides: a new material platform for optoelectronic, plasmonic and photovoltaic, Department of Physics and Astronomy, University of Catania & EPS Young Minds Catania chapter & OSA Catania chapter (January 8th, 2014) \n \nConference participation: \n- BAPVC meeting Spring 2013 – Stanford University \n- BAPVC meeting Fall 2013 – UC Berkeley \n- MRS Spring meeting 2014 – San Francisco, CA (USA) Poster presentation \n- BAPVC meeting Spring 2014 – Stanford University \n- BAPVC meeting Fall 2014 – UC Berkeley \n- MRS Fall meeting 2014 – Boston, MA (USA) Oral presentation \n \nLeadership formation: \n \n- Admitted at the full time Stanford Ignite program by the Stanford Graduate School of Business (Summer 2015) \n- Admitted at \"The Improviser’s Mindset\" class offered by the Stanford Office of the Vice Provost for Graduate Education (Summer 2014) \n- Negotiation skills class, offered by the Stanford Office of Postdoctoral Affairs \n- Future Faculty Seminar INDE/CTL231 class, offered by the Stanford University \n- iRite/iSpeak course, offered by the Stanford Office of Postdoctoral Affairs \n- Stanford future leaders: Mentoring Workshop, offered by the Stanford Office of Postdoctoral Affairs Coach Stanford Leaders in Communication club November 2013  – Present (1 year 10 months) Stanford, CA Our motto is: Leadership is the art of getting someone else to do something you want done, because he wants to do it (D. Eisenhower).  \n \nWe learn all the persuasion and communication techniques by practicing on real-world case scenario and learning by examples.  \n \nSelected by the Director of the Stanford Interdisciplinary Life Science Communications as a facilitator for a scientific pitch training workshop for 3rd year Stanford grad students. \n \nSelected by the Associate Director of Curriculum Development of the Stanford School of Medicine Career Center as a facilitator for the class INDE231A - Academic Interviews: Workshop and Clinic (Fall 2014) \n \nMentor at StartX - Stanford start-up accelerator Coach Stanford Leaders in Communication club November 2013  – Present (1 year 10 months) Stanford, CA Our motto is: Leadership is the art of getting someone else to do something you want done, because he wants to do it (D. Eisenhower).  \n \nWe learn all the persuasion and communication techniques by practicing on real-world case scenario and learning by examples.  \n \nSelected by the Director of the Stanford Interdisciplinary Life Science Communications as a facilitator for a scientific pitch training workshop for 3rd year Stanford grad students. \n \nSelected by the Associate Director of Curriculum Development of the Stanford School of Medicine Career Center as a facilitator for the class INDE231A - Academic Interviews: Workshop and Clinic (Fall 2014) \n \nMentor at StartX - Stanford start-up accelerator Chief Organizer TEDxSSCLive January 2015  –  March 2015  (3 months) Catania Area, Italy Chief Organizer TEDxSSCLive January 2015  –  March 2015  (3 months) Catania Area, Italy President of the Association Alumni Scuola Superiore di Catania January 2011  –  December 2014  (4 years) I strongly believe in the give-back idea. I hold my current position also because of my education. This is because I decided to get involved in my alma mater alumni association. This really is a rewarding experience in terms of positive feedbacks, satisfactions for all the organized events, and recognition from the current students.  \n \n \nWho we are \n \n130+ alumni of a high-excellence education institution within the University of Catania (Scuola Superiore di Catania). The institution acceptance rate is very low (less than 10%). It provides a full scholarship for all the college years, including lodging in an historical campus (Villa San Saverio). Very high grade average and strict deadlines are required to maintain the scholarship. Attendance of complementary and high-level classes is required, along with a research thesis at the end of the scholarship (in addition to the standard university classes and master thesis). As alumni, we contribute to the education of the current students, create a network of diverse experiences and skills, represent the best output of our alma mater. \n \n \nWhat we do \n \nWe organize scientific seminars and conferences (once a week during the school year) and orientation activities. We mentor current students. We organize social events. \n \n \nMy role and responsibilities \n \nAs a President, I run and lead the organization of all the events and activities; I interact with the academic and students representatives; I organize an yearly fund-raising campaign to support the Association activities; I interact with all the alumni members to involve, motivate, and support their active participation; I am the administrator of the Association website, Facebook and LinkedIn groups, Twitter and YouTube accounts. President of the Association Alumni Scuola Superiore di Catania January 2011  –  December 2014  (4 years) I strongly believe in the give-back idea. I hold my current position also because of my education. This is because I decided to get involved in my alma mater alumni association. This really is a rewarding experience in terms of positive feedbacks, satisfactions for all the organized events, and recognition from the current students.  \n \n \nWho we are \n \n130+ alumni of a high-excellence education institution within the University of Catania (Scuola Superiore di Catania). The institution acceptance rate is very low (less than 10%). It provides a full scholarship for all the college years, including lodging in an historical campus (Villa San Saverio). Very high grade average and strict deadlines are required to maintain the scholarship. Attendance of complementary and high-level classes is required, along with a research thesis at the end of the scholarship (in addition to the standard university classes and master thesis). As alumni, we contribute to the education of the current students, create a network of diverse experiences and skills, represent the best output of our alma mater. \n \n \nWhat we do \n \nWe organize scientific seminars and conferences (once a week during the school year) and orientation activities. We mentor current students. We organize social events. \n \n \nMy role and responsibilities \n \nAs a President, I run and lead the organization of all the events and activities; I interact with the academic and students representatives; I organize an yearly fund-raising campaign to support the Association activities; I interact with all the alumni members to involve, motivate, and support their active participation; I am the administrator of the Association website, Facebook and LinkedIn groups, Twitter and YouTube accounts. Chief Organizer TEDxSSC April 2014  –  October 2014  (7 months) TEDxSSC - Dall'eccezione alla regola (From the exception to the rule) \n \nLeading the entire organization of a TEDx event (100+ guests, 20+ speakers, 18 organizing \nteam members, $20k budget). \n \nTED is a world-wide recognized brand ensuring high quality talks, speakers and ideas. As a President of the SSC Alumni Association, along with the Student Association and the academic leaders, we decided to bring TED experience in our institution and community through TEDxSSC. In fact, many of the TEDx values match our institution values (interdisciplinarity, fostering new ideas, spreading innovation and creativity). TEDx mission is to communicate the power of ideas to change attitudes, lives and, ultimately, the world. We want to demonstrate how uncommon ideas and people (the exceptions) can make a real difference, change the world and set a new standard for our everyday life. We have chosen an extremely fascinating theme: “Dall’eccezione alla regola” (“From the exception to the standard”). Our speakers will be unheard local voices as well as known personalities. We will select our list of speakers choosing those people that can tell their personal story as an example of something first considered an exception, then becoming a new standard. Chief Organizer TEDxSSC April 2014  –  October 2014  (7 months) TEDxSSC - Dall'eccezione alla regola (From the exception to the rule) \n \nLeading the entire organization of a TEDx event (100+ guests, 20+ speakers, 18 organizing \nteam members, $20k budget). \n \nTED is a world-wide recognized brand ensuring high quality talks, speakers and ideas. As a President of the SSC Alumni Association, along with the Student Association and the academic leaders, we decided to bring TED experience in our institution and community through TEDxSSC. In fact, many of the TEDx values match our institution values (interdisciplinarity, fostering new ideas, spreading innovation and creativity). TEDx mission is to communicate the power of ideas to change attitudes, lives and, ultimately, the world. We want to demonstrate how uncommon ideas and people (the exceptions) can make a real difference, change the world and set a new standard for our everyday life. We have chosen an extremely fascinating theme: “Dall’eccezione alla regola” (“From the exception to the standard”). Our speakers will be unheard local voices as well as known personalities. We will select our list of speakers choosing those people that can tell their personal story as an example of something first considered an exception, then becoming a new standard. iFarm Team program volunteer Stanford University Office of Technology Licensing January 2014  –  June 2014  (6 months) Moving technology form the research lab to everyday life. This is my goal. \n \nI was admitted in the Stanford iFarm program during Winter 2014. The Stanford Innovation Farm Teams Project seeks to improve success and overall efficiency of the commercialization of Stanford-owned inventions while providing an educational experience to iFarm Team participants. Participation in the iFarm Team Project provides individuals with a unique educational experience and opportunity to network in highly competitive industries. Together with my other teammates, we will select one of the Stanford-owned technology and move it to a commercialization stage. iFarm Team program volunteer Stanford University Office of Technology Licensing January 2014  –  June 2014  (6 months) Moving technology form the research lab to everyday life. This is my goal. \n \nI was admitted in the Stanford iFarm program during Winter 2014. The Stanford Innovation Farm Teams Project seeks to improve success and overall efficiency of the commercialization of Stanford-owned inventions while providing an educational experience to iFarm Team participants. Participation in the iFarm Team Project provides individuals with a unique educational experience and opportunity to network in highly competitive industries. Together with my other teammates, we will select one of the Stanford-owned technology and move it to a commercialization stage. PostDoctoral Associate Boston University March 2011  –  August 2013  (2 years 6 months) Research projects funded by Air Force OSR and DARPA \n \n \nPublication output: \n \nPhotonic–Plasmonic Coupling of GaAs Single Nanowires to Optical Nanoantennas \nNano Letters 14, 2271 (2014) \n \nSize-dependent second-harmonic generation from gold nanoparticles \nPhysical Review B 89, 125414 (2014) \n \nPhotonic-Plasmonic coupled Nanoantennas for Polarization-controlled Multispectral Nanofocusing \nOptics Letters 38, 4861 (2013) \n \nEnhanced second harmonic generation from InAs nano-wing structures on silicon \nNanoscale 5, 10163 (2013) \n \nDevelopment of AlGaN-based GRINSCH deep UV emitters by Molecular Beam Epitaxy \nJournal of Vacuum Science and Technology B 31, 03C117 (2013) \n \nGeneration of second harmonic radiation from sub-stoichiometric silicon nitride thin films \nApplied Physics Letters 102, 141114 (2013) \n \nVertical III-V V-shaped membranes epitaxially grown on a patterned Si[001] substrate and their enhanced light scattering \nACS Nano 6, 10982 (2012) \n \nRare-earth doped Si-rich ZnO for multiband near-infrared light emitting devices \nApplied Physics Letters 101, 191115 (2012) \n \nSub-250nm light emission and optical gain in AlGaN materials \nJournal of Applied Physics 113, 013106 (2013) \n \nPolarization Properties of Deep-UV Optical Gain in Al-rich AlGaN Structures \nApplied Physics Express 5, 032103 (2012) \n \nNanopatterning of silicon nanowires for enhancing visible photoluminescence \nNanoscale 4, 2863 (2012) \n \nSub-250nm room-temperature optical gain from AlGaN/AlN multiple quantum wells with strong band-structure potential fluctuations \nApplied Physics Letters, 100, 061111 (2012) \n \n \nConference proceedings: \n \nInternational Conference on One dimensional Nanomaterials \n \nThe International Conference on Surface Plasmon Photonics \n \nBulletin of the American Physical Society \n \nFrontiers in Optics (FiO) – Novel Silicon Waveguides and Nanophotonics (FM4E) \n \nCLEO: Science and Innovations PostDoctoral Associate Boston University March 2011  –  August 2013  (2 years 6 months) Research projects funded by Air Force OSR and DARPA \n \n \nPublication output: \n \nPhotonic–Plasmonic Coupling of GaAs Single Nanowires to Optical Nanoantennas \nNano Letters 14, 2271 (2014) \n \nSize-dependent second-harmonic generation from gold nanoparticles \nPhysical Review B 89, 125414 (2014) \n \nPhotonic-Plasmonic coupled Nanoantennas for Polarization-controlled Multispectral Nanofocusing \nOptics Letters 38, 4861 (2013) \n \nEnhanced second harmonic generation from InAs nano-wing structures on silicon \nNanoscale 5, 10163 (2013) \n \nDevelopment of AlGaN-based GRINSCH deep UV emitters by Molecular Beam Epitaxy \nJournal of Vacuum Science and Technology B 31, 03C117 (2013) \n \nGeneration of second harmonic radiation from sub-stoichiometric silicon nitride thin films \nApplied Physics Letters 102, 141114 (2013) \n \nVertical III-V V-shaped membranes epitaxially grown on a patterned Si[001] substrate and their enhanced light scattering \nACS Nano 6, 10982 (2012) \n \nRare-earth doped Si-rich ZnO for multiband near-infrared light emitting devices \nApplied Physics Letters 101, 191115 (2012) \n \nSub-250nm light emission and optical gain in AlGaN materials \nJournal of Applied Physics 113, 013106 (2013) \n \nPolarization Properties of Deep-UV Optical Gain in Al-rich AlGaN Structures \nApplied Physics Express 5, 032103 (2012) \n \nNanopatterning of silicon nanowires for enhancing visible photoluminescence \nNanoscale 4, 2863 (2012) \n \nSub-250nm room-temperature optical gain from AlGaN/AlN multiple quantum wells with strong band-structure potential fluctuations \nApplied Physics Letters, 100, 061111 (2012) \n \n \nConference proceedings: \n \nInternational Conference on One dimensional Nanomaterials \n \nThe International Conference on Surface Plasmon Photonics \n \nBulletin of the American Physical Society \n \nFrontiers in Optics (FiO) – Novel Silicon Waveguides and Nanophotonics (FM4E) \n \nCLEO: Science and Innovations Laboratory Safety Coordinator Boston University Research Compliance – Environmental Health & Safety March 2011  –  August 2013  (2 years 6 months) Laboratory Safety Coordinator Boston University Research Compliance – Environmental Health & Safety March 2011  –  August 2013  (2 years 6 months) Postdoctoral Fellow University of Catania November 2009  –  December 2010  (1 year 2 months) Research project: \n \nGrowth and characterization of Si and Ge nanowires, funded by Centro Siciliano di Fisica Nucleare e Struttura della Materia \n \n \nPublication output: \n \nTemperature dependence and aging effects on silicon nanowires photoluminescence \nOptics Express 20, 1483 (2012) \n \nQuantum confinement and electroluminescence in ultrathin silicon nanowires fabricated by a maskless etching technique \nNanotechnology 23, 075204 (2012) \n \n \nBook / Book chapter: \n \nSilicon Nanowires Light Emitting Devices at Room Temperature in Nano-Optics for Enhancing Light-Matter Interactions on a Molecular Scale – Di Bartolo, Baldassare; Collins, John (Eds.) \nSpringer (2013), ISBN: 978-9400753129 Postdoctoral Fellow University of Catania November 2009  –  December 2010  (1 year 2 months) Research project: \n \nGrowth and characterization of Si and Ge nanowires, funded by Centro Siciliano di Fisica Nucleare e Struttura della Materia \n \n \nPublication output: \n \nTemperature dependence and aging effects on silicon nanowires photoluminescence \nOptics Express 20, 1483 (2012) \n \nQuantum confinement and electroluminescence in ultrathin silicon nanowires fabricated by a maskless etching technique \nNanotechnology 23, 075204 (2012) \n \n \nBook / Book chapter: \n \nSilicon Nanowires Light Emitting Devices at Room Temperature in Nano-Optics for Enhancing Light-Matter Interactions on a Molecular Scale – Di Bartolo, Baldassare; Collins, John (Eds.) \nSpringer (2013), ISBN: 978-9400753129 Vice-President and member of the Executive Board Alumni Scuola Superiore di Catania January 2009  –  December 2010  (2 years) Vice-President and member of the Executive Board Alumni Scuola Superiore di Catania January 2009  –  December 2010  (2 years) Webmaster Matis - CNR-IMM November 2006  –  December 2010  (4 years 2 months) http://www.matis.imm.cnr.it Webmaster Matis - CNR-IMM November 2006  –  December 2010  (4 years 2 months) http://www.matis.imm.cnr.it Representative of Ph. D. Students in the Department Executive Committee Department of Physics and Astronomy, University of Catania November 2007  –  October 2009  (2 years) Representative of Ph. D. Students in the Department Executive Committee Department of Physics and Astronomy, University of Catania November 2007  –  October 2009  (2 years) PhD Student University of Catania November 2006  –  October 2009  (3 years) PhD in Physics, cum laude \n \nThesis title: Growth, properties and processing of group IV semiconductor nanowires \n \nTutor: prof. Francesco Priolo \n \n \nPublication output: \n \nKinetics of Si and Ge Nanowires Growth through Electron Beam Evaporation \nNanoscale Research Letters 6, 162 (2011) \n \nHeteroepitaxial growth of Ge nanowires on Si substrates \nInternational Journal of Photoenergy 2012, 782835 (2012) \n \nIon beam-induced bending of silicon nanowires \nPhysica E 44, 1074 (2012) \n \nNanoscale amorphization, bending and recrystallization in silicon nanowires \nApplied Physics A 102, 13 (2011) \nInvited paper \n \nHeteroepitaxial growth and faceting of Ge nanowires on (111) Si by electron beam evaporation \nElectrochemical and Solid State Letters 13, K53 (2010) \n \nInfluence of O contamination and Au cluster properties on the structural features of Si nanowires \nThin Solid Films 518, 2562 (2010) \n \nControl of growth mechanisms and orientation in epitaxial Si nanowires grown by electron beam evaporation \nNanotechnology 20, 135601 (2009) \n \n \nBook / Book chapter: \n \nGrowth, properties and processing of group IV semiconductor nanowires \nVDM Verlag Dr. Muller (August 4, 2011), ISBN: 978-3639375763 \n \n \nConference participation: \n \nE-MRS Fall Meeting 2010 – Warsaw (PL) September 13-17, 2010 Oral presentation, Symposium E \n \nInternational School on “Materials for Renewable Energies” – Erice (TP, Italy) May 28 – June 2, 2010 Poster session \n \nE-MRS 2009 – Strasbourg (F) June 8-12, 2009 Oral presentation, Symposium I \n \nNODE International Summer School – Cortona (AR, Italy) July 1-5, 2008 Poster session \n \nXV International Winter School on “New Developments in Solid State Physics” – Bad HofGastein (Salzburg, AT) February 18-22, 2008 \n \nXIII National School of Materials Science – Bressanone (Bz, Italy) September 30 – October 9, 2007 Poster session \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) September 18-22, 2006 Poster session PhD Student University of Catania November 2006  –  October 2009  (3 years) PhD in Physics, cum laude \n \nThesis title: Growth, properties and processing of group IV semiconductor nanowires \n \nTutor: prof. Francesco Priolo \n \n \nPublication output: \n \nKinetics of Si and Ge Nanowires Growth through Electron Beam Evaporation \nNanoscale Research Letters 6, 162 (2011) \n \nHeteroepitaxial growth of Ge nanowires on Si substrates \nInternational Journal of Photoenergy 2012, 782835 (2012) \n \nIon beam-induced bending of silicon nanowires \nPhysica E 44, 1074 (2012) \n \nNanoscale amorphization, bending and recrystallization in silicon nanowires \nApplied Physics A 102, 13 (2011) \nInvited paper \n \nHeteroepitaxial growth and faceting of Ge nanowires on (111) Si by electron beam evaporation \nElectrochemical and Solid State Letters 13, K53 (2010) \n \nInfluence of O contamination and Au cluster properties on the structural features of Si nanowires \nThin Solid Films 518, 2562 (2010) \n \nControl of growth mechanisms and orientation in epitaxial Si nanowires grown by electron beam evaporation \nNanotechnology 20, 135601 (2009) \n \n \nBook / Book chapter: \n \nGrowth, properties and processing of group IV semiconductor nanowires \nVDM Verlag Dr. Muller (August 4, 2011), ISBN: 978-3639375763 \n \n \nConference participation: \n \nE-MRS Fall Meeting 2010 – Warsaw (PL) September 13-17, 2010 Oral presentation, Symposium E \n \nInternational School on “Materials for Renewable Energies” – Erice (TP, Italy) May 28 – June 2, 2010 Poster session \n \nE-MRS 2009 – Strasbourg (F) June 8-12, 2009 Oral presentation, Symposium I \n \nNODE International Summer School – Cortona (AR, Italy) July 1-5, 2008 Poster session \n \nXV International Winter School on “New Developments in Solid State Physics” – Bad HofGastein (Salzburg, AT) February 18-22, 2008 \n \nXIII National School of Materials Science – Bressanone (Bz, Italy) September 30 – October 9, 2007 Poster session \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) September 18-22, 2006 Poster session Languages   Skills Physics Nanotechnology Renewable Energy Problem Solving Photovoltaics Semiconductors Leadership Silicon Optics Team organization Characterization Spectroscopy Scanning Electron... LaTeX Nanofabrication Thin Films Research Materials Science Nanomaterials Science Photonics Electron Beam... Fortran Sputtering Windows Microfabrication Laser Nanoparticles Experimentation SEM Photolithography Nonlinear Optics PHP CSS MySQL HTML Microscopy Teaching TEM Powder X-ray Diffraction Ellipsometry Mathematica Communication Event Management Plasmonics See 30+     See less Skills  Physics Nanotechnology Renewable Energy Problem Solving Photovoltaics Semiconductors Leadership Silicon Optics Team organization Characterization Spectroscopy Scanning Electron... LaTeX Nanofabrication Thin Films Research Materials Science Nanomaterials Science Photonics Electron Beam... Fortran Sputtering Windows Microfabrication Laser Nanoparticles Experimentation SEM Photolithography Nonlinear Optics PHP CSS MySQL HTML Microscopy Teaching TEM Powder X-ray Diffraction Ellipsometry Mathematica Communication Event Management Plasmonics See 30+     See less Physics Nanotechnology Renewable Energy Problem Solving Photovoltaics Semiconductors Leadership Silicon Optics Team organization Characterization Spectroscopy Scanning Electron... LaTeX Nanofabrication Thin Films Research Materials Science Nanomaterials Science Photonics Electron Beam... Fortran Sputtering Windows Microfabrication Laser Nanoparticles Experimentation SEM Photolithography Nonlinear Optics PHP CSS MySQL HTML Microscopy Teaching TEM Powder X-ray Diffraction Ellipsometry Mathematica Communication Event Management Plasmonics See 30+     See less Physics Nanotechnology Renewable Energy Problem Solving Photovoltaics Semiconductors Leadership Silicon Optics Team organization Characterization Spectroscopy Scanning Electron... LaTeX Nanofabrication Thin Films Research Materials Science Nanomaterials Science Photonics Electron Beam... Fortran Sputtering Windows Microfabrication Laser Nanoparticles Experimentation SEM Photolithography Nonlinear Optics PHP CSS MySQL HTML Microscopy Teaching TEM Powder X-ray Diffraction Ellipsometry Mathematica Communication Event Management Plasmonics See 30+     See less Education Scuola Superiore di Catania Experimental Science,  Physics 2004  – 2006 Diploma, summa cum laude \n \nThesis title: Boron diffusion and clustering in amorphous silicon \n \nAdvisors: prof. Francesco Priolo, dr. Salvatore Mirabella \n \n \nPublication output: \n \nB clustering in amorphous Si \nThe Journal of Vacuum Science and Technology B 26, 382 (2008) \n \nExperimental investigations of boron diffusion mechanisms in crystalline and amorphous silicon \nMaterials Science and Engineering B, 154-155, 240 (2008) \n \nMechanism of boron diffusion in amorphous silicon \nPhysical Review Letters, 100, 155901 (2008) \n \n \nConference proceeding: \n \nIndirect Diffusion of Boron Atoms in Crystalline and Amorphous Silicon \nMat. Res. Soc. Symp. Proc. 1070, E05-08 (2008) Università di Catania 2006,  Physics 2004  – 2006 Laurea Specialistica (M.Sc. equivalent) in Physics, summa cum laude \n \nThesis title: Role of the silicon content in substoichiometric silicon oxide matrices on the Er luminescence \n \nTutor: prof. Francesco Priolo, dr. Giorgia Franzò \n \nPublication output: \n \nRole of the Si excess on the excitation of Er doped SiOx \nApplied Physics Letters 90, 183102 (2007) \n \nEr-based materials for Si microphotonics \nOptical Materials, 31, 1269 (2009) \n \nErbium doped materials for a Si-based microphotonics \nSolid State Phenomena 131-133, 563 (2008) \n \n \nConference participation: \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) \n \nXCI Conference of the “Società Italiana di Fisica” – Catania (Italy) Università di Catania Physics,  Physics of matter 2001  – 2004 Laurea (B.Sc. equivalent) in Physics, summa cum laude at University of Catania \n \nThesis title: Quantum confinement effects in silicon nanocrystals \n \nTutor: prof. Francesco Priolo, dr. Domenico Pacifici Scuola Superiore di Catania Experimental Science,  Physics 2004  – 2006 Diploma, summa cum laude \n \nThesis title: Boron diffusion and clustering in amorphous silicon \n \nAdvisors: prof. Francesco Priolo, dr. Salvatore Mirabella \n \n \nPublication output: \n \nB clustering in amorphous Si \nThe Journal of Vacuum Science and Technology B 26, 382 (2008) \n \nExperimental investigations of boron diffusion mechanisms in crystalline and amorphous silicon \nMaterials Science and Engineering B, 154-155, 240 (2008) \n \nMechanism of boron diffusion in amorphous silicon \nPhysical Review Letters, 100, 155901 (2008) \n \n \nConference proceeding: \n \nIndirect Diffusion of Boron Atoms in Crystalline and Amorphous Silicon \nMat. Res. Soc. Symp. Proc. 1070, E05-08 (2008) Scuola Superiore di Catania Experimental Science,  Physics 2004  – 2006 Diploma, summa cum laude \n \nThesis title: Boron diffusion and clustering in amorphous silicon \n \nAdvisors: prof. Francesco Priolo, dr. Salvatore Mirabella \n \n \nPublication output: \n \nB clustering in amorphous Si \nThe Journal of Vacuum Science and Technology B 26, 382 (2008) \n \nExperimental investigations of boron diffusion mechanisms in crystalline and amorphous silicon \nMaterials Science and Engineering B, 154-155, 240 (2008) \n \nMechanism of boron diffusion in amorphous silicon \nPhysical Review Letters, 100, 155901 (2008) \n \n \nConference proceeding: \n \nIndirect Diffusion of Boron Atoms in Crystalline and Amorphous Silicon \nMat. Res. Soc. Symp. Proc. 1070, E05-08 (2008) Scuola Superiore di Catania Experimental Science,  Physics 2004  – 2006 Diploma, summa cum laude \n \nThesis title: Boron diffusion and clustering in amorphous silicon \n \nAdvisors: prof. Francesco Priolo, dr. Salvatore Mirabella \n \n \nPublication output: \n \nB clustering in amorphous Si \nThe Journal of Vacuum Science and Technology B 26, 382 (2008) \n \nExperimental investigations of boron diffusion mechanisms in crystalline and amorphous silicon \nMaterials Science and Engineering B, 154-155, 240 (2008) \n \nMechanism of boron diffusion in amorphous silicon \nPhysical Review Letters, 100, 155901 (2008) \n \n \nConference proceeding: \n \nIndirect Diffusion of Boron Atoms in Crystalline and Amorphous Silicon \nMat. Res. Soc. Symp. Proc. 1070, E05-08 (2008) Università di Catania 2006,  Physics 2004  – 2006 Laurea Specialistica (M.Sc. equivalent) in Physics, summa cum laude \n \nThesis title: Role of the silicon content in substoichiometric silicon oxide matrices on the Er luminescence \n \nTutor: prof. Francesco Priolo, dr. Giorgia Franzò \n \nPublication output: \n \nRole of the Si excess on the excitation of Er doped SiOx \nApplied Physics Letters 90, 183102 (2007) \n \nEr-based materials for Si microphotonics \nOptical Materials, 31, 1269 (2009) \n \nErbium doped materials for a Si-based microphotonics \nSolid State Phenomena 131-133, 563 (2008) \n \n \nConference participation: \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) \n \nXCI Conference of the “Società Italiana di Fisica” – Catania (Italy) Università di Catania 2006,  Physics 2004  – 2006 Laurea Specialistica (M.Sc. equivalent) in Physics, summa cum laude \n \nThesis title: Role of the silicon content in substoichiometric silicon oxide matrices on the Er luminescence \n \nTutor: prof. Francesco Priolo, dr. Giorgia Franzò \n \nPublication output: \n \nRole of the Si excess on the excitation of Er doped SiOx \nApplied Physics Letters 90, 183102 (2007) \n \nEr-based materials for Si microphotonics \nOptical Materials, 31, 1269 (2009) \n \nErbium doped materials for a Si-based microphotonics \nSolid State Phenomena 131-133, 563 (2008) \n \n \nConference participation: \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) \n \nXCI Conference of the “Società Italiana di Fisica” – Catania (Italy) Università di Catania 2006,  Physics 2004  – 2006 Laurea Specialistica (M.Sc. equivalent) in Physics, summa cum laude \n \nThesis title: Role of the silicon content in substoichiometric silicon oxide matrices on the Er luminescence \n \nTutor: prof. Francesco Priolo, dr. Giorgia Franzò \n \nPublication output: \n \nRole of the Si excess on the excitation of Er doped SiOx \nApplied Physics Letters 90, 183102 (2007) \n \nEr-based materials for Si microphotonics \nOptical Materials, 31, 1269 (2009) \n \nErbium doped materials for a Si-based microphotonics \nSolid State Phenomena 131-133, 563 (2008) \n \n \nConference participation: \n \nXV International conference on “Ion Beam Modification of Materials” – Taormina (ME, Italy) \n \nXCI Conference of the “Società Italiana di Fisica” – Catania (Italy) Università di Catania Physics,  Physics of matter 2001  – 2004 Laurea (B.Sc. equivalent) in Physics, summa cum laude at University of Catania \n \nThesis title: Quantum confinement effects in silicon nanocrystals \n \nTutor: prof. Francesco Priolo, dr. Domenico Pacifici Università di Catania Physics,  Physics of matter 2001  – 2004 Laurea (B.Sc. equivalent) in Physics, summa cum laude at University of Catania \n \nThesis title: Quantum confinement effects in silicon nanocrystals \n \nTutor: prof. Francesco Priolo, dr. Domenico Pacifici Università di Catania Physics,  Physics of matter 2001  – 2004 Laurea (B.Sc. equivalent) in Physics, summa cum laude at University of Catania \n \nThesis title: Quantum confinement effects in silicon nanocrystals \n \nTutor: prof. Francesco Priolo, dr. Domenico Pacifici Honors & Awards ", "Experience Postdoctoral Scholar Stanford University April 2007  –  October 2010  (3 years 7 months) I am a postdoctoral scholar studying neuroscience at Stanford University. I am working in Tirin Moore's laboratory studying the neural basis of vison. I use a combination of physiological and computational techniques to investigate how neurons in the brain encode information about visual world that can be used to guide behavior. Currently my focus is on understanding how neurons in frontal cortex (a region of the brain critical for complex cognitive functioning) can integrate visual information over time to create the persistent internal representations required for goal-driven behaviors. This work lies at the intersection of sensory processing and memory, two functions that are most often studied in isolation, despite the fact that in daily life they are often intertwined. Laboratory Instructor Princeton University January 2003  –  May 2003  (5 months) Led a weekly lab section for an undergraduate course on cognitive neuroscience. Activities included giving brief presentations on relevant course material, answering student questions, leading experimental exercises in neuroanatomy and perception, and editing and grading student term papers. Software Design Engineer Intern Microsoft - Macintosh Power Point Division June 2000  –  August 2000  (3 months) During my time at Microsoft I developed a \"print preview\" capability for a program that integrated several features of Power Point into a software package for graphics design and illustration. I used CodeWarrior development tools to design and test my project, which was created in C++. Teaching Assistant - Introduction to Computing University of Michigan College of Engineering August 1999  –  December 1999  (5 months) Led a weekly discussion section for an introductory electrical engineering and computer science class. Course material covered fundamentals of digital representations, computer architecture and assembly coding, and C programming. Activities included designing and giving presentations to summarize the week's lectures and to give added emphasis to important concepts, to address student questions, provide consultation on problem sets, and prepare and lead review sessions before exams. Web Development Assistant University of Michigan Hospitals - Radiation Oncology May 1999  –  August 1999  (4 months) Developed a web site that allowed doctors to securely access a database of patient scheduling information remotely. Self-taught web page development including HTML and server-side scripting using Microsoft Active Server Pages. Postdoctoral Scholar Stanford University April 2007  –  October 2010  (3 years 7 months) I am a postdoctoral scholar studying neuroscience at Stanford University. I am working in Tirin Moore's laboratory studying the neural basis of vison. I use a combination of physiological and computational techniques to investigate how neurons in the brain encode information about visual world that can be used to guide behavior. Currently my focus is on understanding how neurons in frontal cortex (a region of the brain critical for complex cognitive functioning) can integrate visual information over time to create the persistent internal representations required for goal-driven behaviors. This work lies at the intersection of sensory processing and memory, two functions that are most often studied in isolation, despite the fact that in daily life they are often intertwined. Postdoctoral Scholar Stanford University April 2007  –  October 2010  (3 years 7 months) I am a postdoctoral scholar studying neuroscience at Stanford University. I am working in Tirin Moore's laboratory studying the neural basis of vison. I use a combination of physiological and computational techniques to investigate how neurons in the brain encode information about visual world that can be used to guide behavior. Currently my focus is on understanding how neurons in frontal cortex (a region of the brain critical for complex cognitive functioning) can integrate visual information over time to create the persistent internal representations required for goal-driven behaviors. This work lies at the intersection of sensory processing and memory, two functions that are most often studied in isolation, despite the fact that in daily life they are often intertwined. Laboratory Instructor Princeton University January 2003  –  May 2003  (5 months) Led a weekly lab section for an undergraduate course on cognitive neuroscience. Activities included giving brief presentations on relevant course material, answering student questions, leading experimental exercises in neuroanatomy and perception, and editing and grading student term papers. Laboratory Instructor Princeton University January 2003  –  May 2003  (5 months) Led a weekly lab section for an undergraduate course on cognitive neuroscience. Activities included giving brief presentations on relevant course material, answering student questions, leading experimental exercises in neuroanatomy and perception, and editing and grading student term papers. Software Design Engineer Intern Microsoft - Macintosh Power Point Division June 2000  –  August 2000  (3 months) During my time at Microsoft I developed a \"print preview\" capability for a program that integrated several features of Power Point into a software package for graphics design and illustration. I used CodeWarrior development tools to design and test my project, which was created in C++. Software Design Engineer Intern Microsoft - Macintosh Power Point Division June 2000  –  August 2000  (3 months) During my time at Microsoft I developed a \"print preview\" capability for a program that integrated several features of Power Point into a software package for graphics design and illustration. I used CodeWarrior development tools to design and test my project, which was created in C++. Teaching Assistant - Introduction to Computing University of Michigan College of Engineering August 1999  –  December 1999  (5 months) Led a weekly discussion section for an introductory electrical engineering and computer science class. Course material covered fundamentals of digital representations, computer architecture and assembly coding, and C programming. Activities included designing and giving presentations to summarize the week's lectures and to give added emphasis to important concepts, to address student questions, provide consultation on problem sets, and prepare and lead review sessions before exams. Teaching Assistant - Introduction to Computing University of Michigan College of Engineering August 1999  –  December 1999  (5 months) Led a weekly discussion section for an introductory electrical engineering and computer science class. Course material covered fundamentals of digital representations, computer architecture and assembly coding, and C programming. Activities included designing and giving presentations to summarize the week's lectures and to give added emphasis to important concepts, to address student questions, provide consultation on problem sets, and prepare and lead review sessions before exams. Web Development Assistant University of Michigan Hospitals - Radiation Oncology May 1999  –  August 1999  (4 months) Developed a web site that allowed doctors to securely access a database of patient scheduling information remotely. Self-taught web page development including HTML and server-side scripting using Microsoft Active Server Pages. Web Development Assistant University of Michigan Hospitals - Radiation Oncology May 1999  –  August 1999  (4 months) Developed a web site that allowed doctors to securely access a database of patient scheduling information remotely. Self-taught web page development including HTML and server-side scripting using Microsoft Active Server Pages. Education Stanford University Ph.D.,  Neuroscience 2003  – 2007 Stanford Take Our Daughters And Sons To Work Day - co-created and led a 3 hour interactive workshop for 10-13 yr old children about the brain, 2005-2007.  \n \nPalo Alto Middle Schools Brain Day - organized a series of visits to seventh grade science classrooms in 3 Palo Alto public middle schools. During the visits graduate students in neuroscience at Stanford talked to the middle schoolers about their research, led a discussion about the brain's functions and disorders, and presented human and animal brain samples to the class. Cold Spring Harbor Laboratory Computational Neuroscience 2004  – 2004 Participated in a summer course on computational approaches to studying the visual system. Topics included signal detection theory, maximum likelihood estimators, and reverse correlation techniques. Princeton University Psychology and Neuroscience 2001  – 2003 Secured funding for and organized a student-run seminar series, Neurolunch, in which neuroscientists from different universities visited Princeton to deliver a scientific presentation. Unlike the existing talk-series on campus, Neurolunch gave students an opportunity to hear from scientists that they had selected themselves, and provided a chance to meet with the speaker either individually or in small groups. University of Michigan B.S.,  Computer Engineering 1997  – 2001 Project Chair for Eta Kappa Nu (HKN), an Electrical Engineering and Computer Science honor society in 1999. I was responsible for coordinating and leading volunteer service opportunities for current and aspiring HKN members, as well as planning weekly meetings and social functions with the other society officers. \n \nParticipated in the New England Literature Program, an intensive 6-week program held in rural New Hampshire. The curriculum included reading New England authors, writing, and exploring New England culture and history. During this time I participated in a Creative Non-fiction writing workshop and wrote an essay that earned a University of Michigan Hopwood Award. \n \nStarting goalie for the club water polo team from 1998-2000, during which time we won 3 Big Ten championships and qualified for the national collegiate tournament 3 times. Won All-America honorable mention in 1998. Activities and Societies:  Eta Kappa Nu ,  Club Water Polo Team ,  New England Literature Program ,  Leadershape Stanford University Ph.D.,  Neuroscience 2003  – 2007 Stanford Take Our Daughters And Sons To Work Day - co-created and led a 3 hour interactive workshop for 10-13 yr old children about the brain, 2005-2007.  \n \nPalo Alto Middle Schools Brain Day - organized a series of visits to seventh grade science classrooms in 3 Palo Alto public middle schools. During the visits graduate students in neuroscience at Stanford talked to the middle schoolers about their research, led a discussion about the brain's functions and disorders, and presented human and animal brain samples to the class. Stanford University Ph.D.,  Neuroscience 2003  – 2007 Stanford Take Our Daughters And Sons To Work Day - co-created and led a 3 hour interactive workshop for 10-13 yr old children about the brain, 2005-2007.  \n \nPalo Alto Middle Schools Brain Day - organized a series of visits to seventh grade science classrooms in 3 Palo Alto public middle schools. During the visits graduate students in neuroscience at Stanford talked to the middle schoolers about their research, led a discussion about the brain's functions and disorders, and presented human and animal brain samples to the class. Stanford University Ph.D.,  Neuroscience 2003  – 2007 Stanford Take Our Daughters And Sons To Work Day - co-created and led a 3 hour interactive workshop for 10-13 yr old children about the brain, 2005-2007.  \n \nPalo Alto Middle Schools Brain Day - organized a series of visits to seventh grade science classrooms in 3 Palo Alto public middle schools. During the visits graduate students in neuroscience at Stanford talked to the middle schoolers about their research, led a discussion about the brain's functions and disorders, and presented human and animal brain samples to the class. Cold Spring Harbor Laboratory Computational Neuroscience 2004  – 2004 Participated in a summer course on computational approaches to studying the visual system. Topics included signal detection theory, maximum likelihood estimators, and reverse correlation techniques. Cold Spring Harbor Laboratory Computational Neuroscience 2004  – 2004 Participated in a summer course on computational approaches to studying the visual system. Topics included signal detection theory, maximum likelihood estimators, and reverse correlation techniques. Cold Spring Harbor Laboratory Computational Neuroscience 2004  – 2004 Participated in a summer course on computational approaches to studying the visual system. Topics included signal detection theory, maximum likelihood estimators, and reverse correlation techniques. Princeton University Psychology and Neuroscience 2001  – 2003 Secured funding for and organized a student-run seminar series, Neurolunch, in which neuroscientists from different universities visited Princeton to deliver a scientific presentation. Unlike the existing talk-series on campus, Neurolunch gave students an opportunity to hear from scientists that they had selected themselves, and provided a chance to meet with the speaker either individually or in small groups. Princeton University Psychology and Neuroscience 2001  – 2003 Secured funding for and organized a student-run seminar series, Neurolunch, in which neuroscientists from different universities visited Princeton to deliver a scientific presentation. Unlike the existing talk-series on campus, Neurolunch gave students an opportunity to hear from scientists that they had selected themselves, and provided a chance to meet with the speaker either individually or in small groups. Princeton University Psychology and Neuroscience 2001  – 2003 Secured funding for and organized a student-run seminar series, Neurolunch, in which neuroscientists from different universities visited Princeton to deliver a scientific presentation. Unlike the existing talk-series on campus, Neurolunch gave students an opportunity to hear from scientists that they had selected themselves, and provided a chance to meet with the speaker either individually or in small groups. University of Michigan B.S.,  Computer Engineering 1997  – 2001 Project Chair for Eta Kappa Nu (HKN), an Electrical Engineering and Computer Science honor society in 1999. I was responsible for coordinating and leading volunteer service opportunities for current and aspiring HKN members, as well as planning weekly meetings and social functions with the other society officers. \n \nParticipated in the New England Literature Program, an intensive 6-week program held in rural New Hampshire. The curriculum included reading New England authors, writing, and exploring New England culture and history. During this time I participated in a Creative Non-fiction writing workshop and wrote an essay that earned a University of Michigan Hopwood Award. \n \nStarting goalie for the club water polo team from 1998-2000, during which time we won 3 Big Ten championships and qualified for the national collegiate tournament 3 times. Won All-America honorable mention in 1998. Activities and Societies:  Eta Kappa Nu ,  Club Water Polo Team ,  New England Literature Program ,  Leadershape University of Michigan B.S.,  Computer Engineering 1997  – 2001 Project Chair for Eta Kappa Nu (HKN), an Electrical Engineering and Computer Science honor society in 1999. I was responsible for coordinating and leading volunteer service opportunities for current and aspiring HKN members, as well as planning weekly meetings and social functions with the other society officers. \n \nParticipated in the New England Literature Program, an intensive 6-week program held in rural New Hampshire. The curriculum included reading New England authors, writing, and exploring New England culture and history. During this time I participated in a Creative Non-fiction writing workshop and wrote an essay that earned a University of Michigan Hopwood Award. \n \nStarting goalie for the club water polo team from 1998-2000, during which time we won 3 Big Ten championships and qualified for the national collegiate tournament 3 times. Won All-America honorable mention in 1998. Activities and Societies:  Eta Kappa Nu ,  Club Water Polo Team ,  New England Literature Program ,  Leadershape University of Michigan B.S.,  Computer Engineering 1997  – 2001 Project Chair for Eta Kappa Nu (HKN), an Electrical Engineering and Computer Science honor society in 1999. I was responsible for coordinating and leading volunteer service opportunities for current and aspiring HKN members, as well as planning weekly meetings and social functions with the other society officers. \n \nParticipated in the New England Literature Program, an intensive 6-week program held in rural New Hampshire. The curriculum included reading New England authors, writing, and exploring New England culture and history. During this time I participated in a Creative Non-fiction writing workshop and wrote an essay that earned a University of Michigan Hopwood Award. \n \nStarting goalie for the club water polo team from 1998-2000, during which time we won 3 Big Ten championships and qualified for the national collegiate tournament 3 times. Won All-America honorable mention in 1998. Activities and Societies:  Eta Kappa Nu ,  Club Water Polo Team ,  New England Literature Program ,  Leadershape Honors & Awards Additional Honors & Awards Howard Hughes Medical Institute Predoctoral Research Fellowship, 2002-2007 \nNational Science Foundation Graduate Research Fellowship, 2002 (not accepted). \nNational Defense Science and Engineering Graduate Fellowship, 2002 (not accepted). \nAvery Hopwood Award (Summer Essay), University of Michigan, 2001. \nUniversity of Michigan Dean’s List, 1997-2001. Additional Honors & Awards Howard Hughes Medical Institute Predoctoral Research Fellowship, 2002-2007 \nNational Science Foundation Graduate Research Fellowship, 2002 (not accepted). \nNational Defense Science and Engineering Graduate Fellowship, 2002 (not accepted). \nAvery Hopwood Award (Summer Essay), University of Michigan, 2001. \nUniversity of Michigan Dean’s List, 1997-2001. Additional Honors & Awards Howard Hughes Medical Institute Predoctoral Research Fellowship, 2002-2007 \nNational Science Foundation Graduate Research Fellowship, 2002 (not accepted). \nNational Defense Science and Engineering Graduate Fellowship, 2002 (not accepted). \nAvery Hopwood Award (Summer Essay), University of Michigan, 2001. \nUniversity of Michigan Dean’s List, 1997-2001. Additional Honors & Awards Howard Hughes Medical Institute Predoctoral Research Fellowship, 2002-2007 \nNational Science Foundation Graduate Research Fellowship, 2002 (not accepted). \nNational Defense Science and Engineering Graduate Fellowship, 2002 (not accepted). \nAvery Hopwood Award (Summer Essay), University of Michigan, 2001. \nUniversity of Michigan Dean’s List, 1997-2001. ", "Experience Postdoctoral Scholar Stanford University September 2012  – Present (3 years) Research Officer Centre for the Study of African Economies, University of Oxford September 2008  –  August 2011  (3 years) Consultant United Nations Industrial Development Organization November 2007  –  October 2008  (1 year) Research Assistant Center for Global Development March 2005  –  August 2006  (1 year 6 months) Postdoctoral Scholar Stanford University September 2012  – Present (3 years) Postdoctoral Scholar Stanford University September 2012  – Present (3 years) Research Officer Centre for the Study of African Economies, University of Oxford September 2008  –  August 2011  (3 years) Research Officer Centre for the Study of African Economies, University of Oxford September 2008  –  August 2011  (3 years) Consultant United Nations Industrial Development Organization November 2007  –  October 2008  (1 year) Consultant United Nations Industrial Development Organization November 2007  –  October 2008  (1 year) Research Assistant Center for Global Development March 2005  –  August 2006  (1 year 6 months) Research Assistant Center for Global Development March 2005  –  August 2006  (1 year 6 months) Languages English Urdu Hindi English Urdu Hindi English Urdu Hindi Skills International... Policy Analysis Stata Capacity Building Economics Econometrics Development Economics Statistics Public Policy Research NGOs Data Analysis Human Rights Program Evaluation Emerging Markets Skills  International... Policy Analysis Stata Capacity Building Economics Econometrics Development Economics Statistics Public Policy Research NGOs Data Analysis Human Rights Program Evaluation Emerging Markets International... Policy Analysis Stata Capacity Building Economics Econometrics Development Economics Statistics Public Policy Research NGOs Data Analysis Human Rights Program Evaluation Emerging Markets International... Policy Analysis Stata Capacity Building Economics Econometrics Development Economics Statistics Public Policy Research NGOs Data Analysis Human Rights Program Evaluation Emerging Markets Education University of Oxford Doctor of Philosophy (Ph.D.),  Economics 2006  – 2012 University of Oxford Master of Philosophy (M.Phil.),  Economics 2002  – 2004 Lahore University of Management Sciences Bachelor of Science (B.Sc.),  Economics 1997  – 2001 University of Oxford Doctor of Philosophy (Ph.D.),  Economics 2006  – 2012 University of Oxford Doctor of Philosophy (Ph.D.),  Economics 2006  – 2012 University of Oxford Doctor of Philosophy (Ph.D.),  Economics 2006  – 2012 University of Oxford Master of Philosophy (M.Phil.),  Economics 2002  – 2004 University of Oxford Master of Philosophy (M.Phil.),  Economics 2002  – 2004 University of Oxford Master of Philosophy (M.Phil.),  Economics 2002  – 2004 Lahore University of Management Sciences Bachelor of Science (B.Sc.),  Economics 1997  – 2001 Lahore University of Management Sciences Bachelor of Science (B.Sc.),  Economics 1997  – 2001 Lahore University of Management Sciences Bachelor of Science (B.Sc.),  Economics 1997  – 2001 ", "Summary I'm an Assistant Professor in the Department of Economics at Boise State University. I'm an applied social scientist - an economist by training - working on issues of urbanization, global environmental change and sustainability. My work has touched upon several topics; among a few, urban land use change modeling and its policy relevance, the evolution of urban landscape patterns and the bi-directional interactions of urban spatial structure with the environment, urban land teleconnections, urban ecology and environmental justice, urban infrastructure and vulnerability. I teach various courses: Microeconomics, Economics of Sustainability, Quantitative Methods and Econometrics.  \n \nHave served as a lead author in two large assessment reports including the 'UN-CBD Cities and Biodiversity Outlook' and the '2013 National Climate Assessment' of the US Global Change Research Program. I have also been a contributing author in the Fifth Assessment Report of the IPCC. \n \nSpecialties: Urbanization; global environmental change/environmental studies; quantitative research methods, geospatial technologies (GIS and remote sensing); sustainability; data visualization \n \nPast work: Between 2006 and 2012 I was the Executive Officer of the International Human Dimensions Programme's (IHDP) core project on Urbanization and Global Environmental Change (UGEC), based at Arizona State University in Tempe, Arizona, U.S.A. From 2003 to 2006 I was a postdoctoral scholar at Stanford University at the Center for Environmental Science and Policy at the Freeman-Spogli Institute for International Studies. I hold Ph.D. in Economics - with a focus on economic geography and the environment - from Clark University in Massachusetts, U.S.A. Summary I'm an Assistant Professor in the Department of Economics at Boise State University. I'm an applied social scientist - an economist by training - working on issues of urbanization, global environmental change and sustainability. My work has touched upon several topics; among a few, urban land use change modeling and its policy relevance, the evolution of urban landscape patterns and the bi-directional interactions of urban spatial structure with the environment, urban land teleconnections, urban ecology and environmental justice, urban infrastructure and vulnerability. I teach various courses: Microeconomics, Economics of Sustainability, Quantitative Methods and Econometrics.  \n \nHave served as a lead author in two large assessment reports including the 'UN-CBD Cities and Biodiversity Outlook' and the '2013 National Climate Assessment' of the US Global Change Research Program. I have also been a contributing author in the Fifth Assessment Report of the IPCC. \n \nSpecialties: Urbanization; global environmental change/environmental studies; quantitative research methods, geospatial technologies (GIS and remote sensing); sustainability; data visualization \n \nPast work: Between 2006 and 2012 I was the Executive Officer of the International Human Dimensions Programme's (IHDP) core project on Urbanization and Global Environmental Change (UGEC), based at Arizona State University in Tempe, Arizona, U.S.A. From 2003 to 2006 I was a postdoctoral scholar at Stanford University at the Center for Environmental Science and Policy at the Freeman-Spogli Institute for International Studies. I hold Ph.D. in Economics - with a focus on economic geography and the environment - from Clark University in Massachusetts, U.S.A. I'm an Assistant Professor in the Department of Economics at Boise State University. I'm an applied social scientist - an economist by training - working on issues of urbanization, global environmental change and sustainability. My work has touched upon several topics; among a few, urban land use change modeling and its policy relevance, the evolution of urban landscape patterns and the bi-directional interactions of urban spatial structure with the environment, urban land teleconnections, urban ecology and environmental justice, urban infrastructure and vulnerability. I teach various courses: Microeconomics, Economics of Sustainability, Quantitative Methods and Econometrics.  \n \nHave served as a lead author in two large assessment reports including the 'UN-CBD Cities and Biodiversity Outlook' and the '2013 National Climate Assessment' of the US Global Change Research Program. I have also been a contributing author in the Fifth Assessment Report of the IPCC. \n \nSpecialties: Urbanization; global environmental change/environmental studies; quantitative research methods, geospatial technologies (GIS and remote sensing); sustainability; data visualization \n \nPast work: Between 2006 and 2012 I was the Executive Officer of the International Human Dimensions Programme's (IHDP) core project on Urbanization and Global Environmental Change (UGEC), based at Arizona State University in Tempe, Arizona, U.S.A. From 2003 to 2006 I was a postdoctoral scholar at Stanford University at the Center for Environmental Science and Policy at the Freeman-Spogli Institute for International Studies. I hold Ph.D. in Economics - with a focus on economic geography and the environment - from Clark University in Massachusetts, U.S.A. I'm an Assistant Professor in the Department of Economics at Boise State University. I'm an applied social scientist - an economist by training - working on issues of urbanization, global environmental change and sustainability. My work has touched upon several topics; among a few, urban land use change modeling and its policy relevance, the evolution of urban landscape patterns and the bi-directional interactions of urban spatial structure with the environment, urban land teleconnections, urban ecology and environmental justice, urban infrastructure and vulnerability. I teach various courses: Microeconomics, Economics of Sustainability, Quantitative Methods and Econometrics.  \n \nHave served as a lead author in two large assessment reports including the 'UN-CBD Cities and Biodiversity Outlook' and the '2013 National Climate Assessment' of the US Global Change Research Program. I have also been a contributing author in the Fifth Assessment Report of the IPCC. \n \nSpecialties: Urbanization; global environmental change/environmental studies; quantitative research methods, geospatial technologies (GIS and remote sensing); sustainability; data visualization \n \nPast work: Between 2006 and 2012 I was the Executive Officer of the International Human Dimensions Programme's (IHDP) core project on Urbanization and Global Environmental Change (UGEC), based at Arizona State University in Tempe, Arizona, U.S.A. From 2003 to 2006 I was a postdoctoral scholar at Stanford University at the Center for Environmental Science and Policy at the Freeman-Spogli Institute for International Studies. I hold Ph.D. in Economics - with a focus on economic geography and the environment - from Clark University in Massachusetts, U.S.A. Experience Assistant Professor, Department of Economics Boise State University July 2014  – Present (1 year 2 months) Boise, Idaho Area Director, Center for Business Research and Economic Development (BRED) Boise State University August 2013  –  July 2014  (1 year) Boise, Idaho Area Visiting Professor, Department of Economics Boise State University August 2012  –  July 2014  (2 years) Boise, ID Executive Officer of the UGEC project Arizona State University November 2006  –  August 2012  (5 years 10 months) Tempe, AZ Postdoctoral Scholar Stanford University September 2003  –  September 2006  (3 years 1 month) Stanford, CA Research Assistant Clark University June 2001  –  June 2003  (2 years 1 month) Worcester, MA Teaching Assistant Clark University January 2001  –  April 2001  (4 months) Worcester, MA Assistant Professor, Department of Economics Boise State University July 2014  – Present (1 year 2 months) Boise, Idaho Area Assistant Professor, Department of Economics Boise State University July 2014  – Present (1 year 2 months) Boise, Idaho Area Director, Center for Business Research and Economic Development (BRED) Boise State University August 2013  –  July 2014  (1 year) Boise, Idaho Area Director, Center for Business Research and Economic Development (BRED) Boise State University August 2013  –  July 2014  (1 year) Boise, Idaho Area Visiting Professor, Department of Economics Boise State University August 2012  –  July 2014  (2 years) Boise, ID Visiting Professor, Department of Economics Boise State University August 2012  –  July 2014  (2 years) Boise, ID Executive Officer of the UGEC project Arizona State University November 2006  –  August 2012  (5 years 10 months) Tempe, AZ Executive Officer of the UGEC project Arizona State University November 2006  –  August 2012  (5 years 10 months) Tempe, AZ Postdoctoral Scholar Stanford University September 2003  –  September 2006  (3 years 1 month) Stanford, CA Postdoctoral Scholar Stanford University September 2003  –  September 2006  (3 years 1 month) Stanford, CA Research Assistant Clark University June 2001  –  June 2003  (2 years 1 month) Worcester, MA Research Assistant Clark University June 2001  –  June 2003  (2 years 1 month) Worcester, MA Teaching Assistant Clark University January 2001  –  April 2001  (4 months) Worcester, MA Teaching Assistant Clark University January 2001  –  April 2001  (4 months) Worcester, MA Languages English Native or bilingual proficiency Greek Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills ArcGIS Matlab GIS Research Science Sustainability Economics Environmental R Higher Education Data Analysis Modeling Stata Qualitative Research Programming Python Machine Learning Econometrics Environmental Science University Teaching Statistics Environmental Awareness Climate Change LaTeX Analysis Government Biodiversity Economic Development Quantitative Research Politics Remote Sensing Teaching Policy Data Mining Policy Analysis SPSS Sustainable Development Environmental Policy See 23+     See less Skills  ArcGIS Matlab GIS Research Science Sustainability Economics Environmental R Higher Education Data Analysis Modeling Stata Qualitative Research Programming Python Machine Learning Econometrics Environmental Science University Teaching Statistics Environmental Awareness Climate Change LaTeX Analysis Government Biodiversity Economic Development Quantitative Research Politics Remote Sensing Teaching Policy Data Mining Policy Analysis SPSS Sustainable Development Environmental Policy See 23+     See less ArcGIS Matlab GIS Research Science Sustainability Economics Environmental R Higher Education Data Analysis Modeling Stata Qualitative Research Programming Python Machine Learning Econometrics Environmental Science University Teaching Statistics Environmental Awareness Climate Change LaTeX Analysis Government Biodiversity Economic Development Quantitative Research Politics Remote Sensing Teaching Policy Data Mining Policy Analysis SPSS Sustainable Development Environmental Policy See 23+     See less ArcGIS Matlab GIS Research Science Sustainability Economics Environmental R Higher Education Data Analysis Modeling Stata Qualitative Research Programming Python Machine Learning Econometrics Environmental Science University Teaching Statistics Environmental Awareness Climate Change LaTeX Analysis Government Biodiversity Economic Development Quantitative Research Politics Remote Sensing Teaching Policy Data Mining Policy Analysis SPSS Sustainable Development Environmental Policy See 23+     See less Education Clark University Ph.D. 1999  – 2004 National & Kapodistrian University of Athens Ptychion 1994  – 1999 Clark University Ph.D. 1999  – 2004 Clark University Ph.D. 1999  – 2004 Clark University Ph.D. 1999  – 2004 National & Kapodistrian University of Athens Ptychion 1994  – 1999 National & Kapodistrian University of Athens Ptychion 1994  – 1999 National & Kapodistrian University of Athens Ptychion 1994  – 1999 ", "Languages Gujarati Hindi Gujarati Hindi Gujarati Hindi Skills Primary Cell Culture Multi color flow... In vitro molecular... Ex vivo tissue culture GraphPad Prism FlowJo BD FACSDiva Adobe Illustrator qPCR miRNA GLP cGMP ELISA PCR Arrays Histology Immunohistochemistry Luminex Biotechnology Softmax Pro PBMC isolation PBMC stimulation assays FileMaker LIMS GMP Lifesciences Genetics Molecular Biology Manuscript Non-human primate models Cell Culture Life Sciences See 16+     See less Skills  Primary Cell Culture Multi color flow... In vitro molecular... Ex vivo tissue culture GraphPad Prism FlowJo BD FACSDiva Adobe Illustrator qPCR miRNA GLP cGMP ELISA PCR Arrays Histology Immunohistochemistry Luminex Biotechnology Softmax Pro PBMC isolation PBMC stimulation assays FileMaker LIMS GMP Lifesciences Genetics Molecular Biology Manuscript Non-human primate models Cell Culture Life Sciences See 16+     See less Primary Cell Culture Multi color flow... In vitro molecular... Ex vivo tissue culture GraphPad Prism FlowJo BD FACSDiva Adobe Illustrator qPCR miRNA GLP cGMP ELISA PCR Arrays Histology Immunohistochemistry Luminex Biotechnology Softmax Pro PBMC isolation PBMC stimulation assays FileMaker LIMS GMP Lifesciences Genetics Molecular Biology Manuscript Non-human primate models Cell Culture Life Sciences See 16+     See less Primary Cell Culture Multi color flow... In vitro molecular... Ex vivo tissue culture GraphPad Prism FlowJo BD FACSDiva Adobe Illustrator qPCR miRNA GLP cGMP ELISA PCR Arrays Histology Immunohistochemistry Luminex Biotechnology Softmax Pro PBMC isolation PBMC stimulation assays FileMaker LIMS GMP Lifesciences Genetics Molecular Biology Manuscript Non-human primate models Cell Culture Life Sciences See 16+     See less Honors & Awards ", "Skills Editing Statistics Research Grant Writing Program Evaluation SPSS Data Analysis Community Outreach Nonprofits Program Development Public Speaking Qualitative Research Skills  Editing Statistics Research Grant Writing Program Evaluation SPSS Data Analysis Community Outreach Nonprofits Program Development Public Speaking Qualitative Research Editing Statistics Research Grant Writing Program Evaluation SPSS Data Analysis Community Outreach Nonprofits Program Development Public Speaking Qualitative Research Editing Statistics Research Grant Writing Program Evaluation SPSS Data Analysis Community Outreach Nonprofits Program Development Public Speaking Qualitative Research ", "Summary I study practice-based designs for teacher education focusing particularly on how teacher educators attend to their social justice commitments when designing for practice. Before beginning my current position as a postdoctoral scholar at Stanford University, I received my doctorate from the University of Washington where I led a team in the development of Teacher Education by Design (TEDD.org) a web-based, free-content library of practice-based tools for teacher educators. I come to research from a career as a middle and high school teacher of English Language Arts and History and a curriculum designer for the New York Times Learning Network. Summary I study practice-based designs for teacher education focusing particularly on how teacher educators attend to their social justice commitments when designing for practice. Before beginning my current position as a postdoctoral scholar at Stanford University, I received my doctorate from the University of Washington where I led a team in the development of Teacher Education by Design (TEDD.org) a web-based, free-content library of practice-based tools for teacher educators. I come to research from a career as a middle and high school teacher of English Language Arts and History and a curriculum designer for the New York Times Learning Network. I study practice-based designs for teacher education focusing particularly on how teacher educators attend to their social justice commitments when designing for practice. Before beginning my current position as a postdoctoral scholar at Stanford University, I received my doctorate from the University of Washington where I led a team in the development of Teacher Education by Design (TEDD.org) a web-based, free-content library of practice-based tools for teacher educators. I come to research from a career as a middle and high school teacher of English Language Arts and History and a curriculum designer for the New York Times Learning Network. I study practice-based designs for teacher education focusing particularly on how teacher educators attend to their social justice commitments when designing for practice. Before beginning my current position as a postdoctoral scholar at Stanford University, I received my doctorate from the University of Washington where I led a team in the development of Teacher Education by Design (TEDD.org) a web-based, free-content library of practice-based tools for teacher educators. I come to research from a career as a middle and high school teacher of English Language Arts and History and a curriculum designer for the New York Times Learning Network. Experience Postdoctoral Scholar Stanford University January 2015  – Present (8 months) Stanford, CA In my position as a postdoctoral scholar at the Center to Support Excellence in Teaching at Stanford University my research is focused on practice-based pedagogical approaches to professional development for early-career teachers.  Ph.D. Candidate University of Washington September 2009  –  January 2015  (5 years 5 months) My dissertation study is a comparative case study examining social justice teaching practices. I am examining these practices through the lens of one case of social justice teaching, LGBTQ-support. The study follows four LGBTQ-supportive teachers through a year of teaching as they engage in a set of practices aimed at disrupting the inequities that disadvantage LGBTQ students. \n \nWhile a doctoral candidate at the University of Washington, I worked on various research and development projects: I led the team that developed Teacher Education by Design, or TEDD.org, an open-source library of practice-based tools for teacher education and professional development. Along with developing TEDD.org, I worked on the design teams of two new practice-based teacher education programs: U-ACT and a redesign of Teach for America's summer institute in Chicago. In addition, I taught three graduate-level courses in the College of Education: (1) Multicultural Teaching, a course for pre-service secondary teacher candidates in all disciplines, (2) Humanities Methods, a course for Language Arts and Social Studies middle and high school teachers in their first year as classroom teachers, and (3) Justice in Practice, a course for elementary teaching candidates that brought practice-based methods pedagogies to a foundations course in multicultural education.  Writer The New York Times 2005  –  2012  (7 years) Wrote American history and civics curriculum for the New York Times Learning Network. Program Director Middle Grades Partnership 2008  –  2009  (1 year) Directed an academic enrichment program aimed at Algebra readiness for 80 girls from two Baltimore City public middle schools. Teacher Garrison Forest School 2007  –  2009  (2 years) Taught Middle School History and Drama Teacher The Marin School 2004  –  2006  (2 years) Taught High School Global History, English Literature, American Literature, and Drama. Postdoctoral Scholar Stanford University January 2015  – Present (8 months) Stanford, CA In my position as a postdoctoral scholar at the Center to Support Excellence in Teaching at Stanford University my research is focused on practice-based pedagogical approaches to professional development for early-career teachers.  Postdoctoral Scholar Stanford University January 2015  – Present (8 months) Stanford, CA In my position as a postdoctoral scholar at the Center to Support Excellence in Teaching at Stanford University my research is focused on practice-based pedagogical approaches to professional development for early-career teachers.  Ph.D. Candidate University of Washington September 2009  –  January 2015  (5 years 5 months) My dissertation study is a comparative case study examining social justice teaching practices. I am examining these practices through the lens of one case of social justice teaching, LGBTQ-support. The study follows four LGBTQ-supportive teachers through a year of teaching as they engage in a set of practices aimed at disrupting the inequities that disadvantage LGBTQ students. \n \nWhile a doctoral candidate at the University of Washington, I worked on various research and development projects: I led the team that developed Teacher Education by Design, or TEDD.org, an open-source library of practice-based tools for teacher education and professional development. Along with developing TEDD.org, I worked on the design teams of two new practice-based teacher education programs: U-ACT and a redesign of Teach for America's summer institute in Chicago. In addition, I taught three graduate-level courses in the College of Education: (1) Multicultural Teaching, a course for pre-service secondary teacher candidates in all disciplines, (2) Humanities Methods, a course for Language Arts and Social Studies middle and high school teachers in their first year as classroom teachers, and (3) Justice in Practice, a course for elementary teaching candidates that brought practice-based methods pedagogies to a foundations course in multicultural education.  Ph.D. Candidate University of Washington September 2009  –  January 2015  (5 years 5 months) My dissertation study is a comparative case study examining social justice teaching practices. I am examining these practices through the lens of one case of social justice teaching, LGBTQ-support. The study follows four LGBTQ-supportive teachers through a year of teaching as they engage in a set of practices aimed at disrupting the inequities that disadvantage LGBTQ students. \n \nWhile a doctoral candidate at the University of Washington, I worked on various research and development projects: I led the team that developed Teacher Education by Design, or TEDD.org, an open-source library of practice-based tools for teacher education and professional development. Along with developing TEDD.org, I worked on the design teams of two new practice-based teacher education programs: U-ACT and a redesign of Teach for America's summer institute in Chicago. In addition, I taught three graduate-level courses in the College of Education: (1) Multicultural Teaching, a course for pre-service secondary teacher candidates in all disciplines, (2) Humanities Methods, a course for Language Arts and Social Studies middle and high school teachers in their first year as classroom teachers, and (3) Justice in Practice, a course for elementary teaching candidates that brought practice-based methods pedagogies to a foundations course in multicultural education.  Writer The New York Times 2005  –  2012  (7 years) Wrote American history and civics curriculum for the New York Times Learning Network. Writer The New York Times 2005  –  2012  (7 years) Wrote American history and civics curriculum for the New York Times Learning Network. Program Director Middle Grades Partnership 2008  –  2009  (1 year) Directed an academic enrichment program aimed at Algebra readiness for 80 girls from two Baltimore City public middle schools. Program Director Middle Grades Partnership 2008  –  2009  (1 year) Directed an academic enrichment program aimed at Algebra readiness for 80 girls from two Baltimore City public middle schools. Teacher Garrison Forest School 2007  –  2009  (2 years) Taught Middle School History and Drama Teacher Garrison Forest School 2007  –  2009  (2 years) Taught Middle School History and Drama Teacher The Marin School 2004  –  2006  (2 years) Taught High School Global History, English Literature, American Literature, and Drama. Teacher The Marin School 2004  –  2006  (2 years) Taught High School Global History, English Literature, American Literature, and Drama. Education University of Washington, College of Education Doctor of Philosophy (Ph.D.),  Curriculum & Instruction ,  Multicultural Education and Teacher Education concentrations 2009  – 2014 Wesleyan University Bachelor of Arts,  American Studies; Ethnic Studies concentration Phi Beta Kappa, High Honors, M.G. White Award for Best Honors Thesis University of Washington, College of Education Doctor of Philosophy (Ph.D.),  Curriculum & Instruction ,  Multicultural Education and Teacher Education concentrations 2009  – 2014 University of Washington, College of Education Doctor of Philosophy (Ph.D.),  Curriculum & Instruction ,  Multicultural Education and Teacher Education concentrations 2009  – 2014 University of Washington, College of Education Doctor of Philosophy (Ph.D.),  Curriculum & Instruction ,  Multicultural Education and Teacher Education concentrations 2009  – 2014 Wesleyan University Bachelor of Arts,  American Studies; Ethnic Studies concentration Phi Beta Kappa, High Honors, M.G. White Award for Best Honors Thesis Wesleyan University Bachelor of Arts,  American Studies; Ethnic Studies concentration Phi Beta Kappa, High Honors, M.G. White Award for Best Honors Thesis Wesleyan University Bachelor of Arts,  American Studies; Ethnic Studies concentration Phi Beta Kappa, High Honors, M.G. White Award for Best Honors Thesis ", "Summary Liping Wang, M.D.,Ph.D.,Clinical Fellow from California Institute for Regenerative Medicine (CIRM) and Postdoctoral Scholar at Department of Bioengineering of Stanford University.  \nLiping has more than eight years experience in Neuroscience, Bioengineering, Stem Cell research, eight years experience in Clinical Medicine, including Neurosurgery, Surgical Oncology,Regenerative Medicine and Cardiovascular Diseases. \nPrior to receiving his Ph.D. in medical neuroscience from Universitatsmedizin Berlin, Charite, Germany, Liping worked as an attending surgeon (Neurosurgery and Thoracic & Cardiovascular Diseases) with his M.D.. Summary Liping Wang, M.D.,Ph.D.,Clinical Fellow from California Institute for Regenerative Medicine (CIRM) and Postdoctoral Scholar at Department of Bioengineering of Stanford University.  \nLiping has more than eight years experience in Neuroscience, Bioengineering, Stem Cell research, eight years experience in Clinical Medicine, including Neurosurgery, Surgical Oncology,Regenerative Medicine and Cardiovascular Diseases. \nPrior to receiving his Ph.D. in medical neuroscience from Universitatsmedizin Berlin, Charite, Germany, Liping worked as an attending surgeon (Neurosurgery and Thoracic & Cardiovascular Diseases) with his M.D.. Liping Wang, M.D.,Ph.D.,Clinical Fellow from California Institute for Regenerative Medicine (CIRM) and Postdoctoral Scholar at Department of Bioengineering of Stanford University.  \nLiping has more than eight years experience in Neuroscience, Bioengineering, Stem Cell research, eight years experience in Clinical Medicine, including Neurosurgery, Surgical Oncology,Regenerative Medicine and Cardiovascular Diseases. \nPrior to receiving his Ph.D. in medical neuroscience from Universitatsmedizin Berlin, Charite, Germany, Liping worked as an attending surgeon (Neurosurgery and Thoracic & Cardiovascular Diseases) with his M.D.. Liping Wang, M.D.,Ph.D.,Clinical Fellow from California Institute for Regenerative Medicine (CIRM) and Postdoctoral Scholar at Department of Bioengineering of Stanford University.  \nLiping has more than eight years experience in Neuroscience, Bioengineering, Stem Cell research, eight years experience in Clinical Medicine, including Neurosurgery, Surgical Oncology,Regenerative Medicine and Cardiovascular Diseases. \nPrior to receiving his Ph.D. in medical neuroscience from Universitatsmedizin Berlin, Charite, Germany, Liping worked as an attending surgeon (Neurosurgery and Thoracic & Cardiovascular Diseases) with his M.D.. Experience Clinical Fellow/Postdoctoral Scholar Stanford University June 2005  – Present (10 years 3 months) Postdoc Deisseroth Lab 2005  –  2009  (4 years) Graduate Student, Medical Neuroscience Max Delbrück Centre for Molecular Medicine (MDC) Berlin,Germany January 2002  –  May 2005  (3 years 5 months) Clinical Fellow/Postdoctoral Scholar Stanford University June 2005  – Present (10 years 3 months) Clinical Fellow/Postdoctoral Scholar Stanford University June 2005  – Present (10 years 3 months) Postdoc Deisseroth Lab 2005  –  2009  (4 years) Postdoc Deisseroth Lab 2005  –  2009  (4 years) Graduate Student, Medical Neuroscience Max Delbrück Centre for Molecular Medicine (MDC) Berlin,Germany January 2002  –  May 2005  (3 years 5 months) Graduate Student, Medical Neuroscience Max Delbrück Centre for Molecular Medicine (MDC) Berlin,Germany January 2002  –  May 2005  (3 years 5 months) Education Universitatsmedizin Berlin, Charite, Germany Ph.D. 2002  – 2005 Chengde Medical College, Chengde, P.R. China Medical Degree 1989  – 1994 Universitatsmedizin Berlin, Charite, Germany Ph.D. 2002  – 2005 Universitatsmedizin Berlin, Charite, Germany Ph.D. 2002  – 2005 Universitatsmedizin Berlin, Charite, Germany Ph.D. 2002  – 2005 Chengde Medical College, Chengde, P.R. China Medical Degree 1989  – 1994 Chengde Medical College, Chengde, P.R. China Medical Degree 1989  – 1994 Chengde Medical College, Chengde, P.R. China Medical Degree 1989  – 1994 Honors & Awards Additional Honors & Awards California Institute for Regenerative Medicine (CIRM) clinical fellow training fellowship, 2006-2009 \n \nHumboldt University (Berlin) Graduate Program Fellowship from German Research Foundation (DFG), Germany, 2002-2005 Additional Honors & Awards California Institute for Regenerative Medicine (CIRM) clinical fellow training fellowship, 2006-2009 \n \nHumboldt University (Berlin) Graduate Program Fellowship from German Research Foundation (DFG), Germany, 2002-2005 Additional Honors & Awards California Institute for Regenerative Medicine (CIRM) clinical fellow training fellowship, 2006-2009 \n \nHumboldt University (Berlin) Graduate Program Fellowship from German Research Foundation (DFG), Germany, 2002-2005 Additional Honors & Awards California Institute for Regenerative Medicine (CIRM) clinical fellow training fellowship, 2006-2009 \n \nHumboldt University (Berlin) Graduate Program Fellowship from German Research Foundation (DFG), Germany, 2002-2005 ", "", "Summary I am an enthusiastic researcher in the field of nanophotonics, a border where nanotechnology meets optics. My research interests lie in plasmonics, metamaterials, and material chemistry. Summary I am an enthusiastic researcher in the field of nanophotonics, a border where nanotechnology meets optics. My research interests lie in plasmonics, metamaterials, and material chemistry. I am an enthusiastic researcher in the field of nanophotonics, a border where nanotechnology meets optics. My research interests lie in plasmonics, metamaterials, and material chemistry. I am an enthusiastic researcher in the field of nanophotonics, a border where nanotechnology meets optics. My research interests lie in plasmonics, metamaterials, and material chemistry. Experience Postdoctoral Scholar Stanford University October 2013  – Present (1 year 11 months) Graduate Student Staff Purdue University January 2009  –  August 2013  (4 years 8 months) Develop new materials and their nanofabrication techniques for applications in plasmonics and metamaterials. Project Associate Indian Institute of Science August 2008  –  December 2008  (5 months) - Characterize organic semiconductors for photovoltaic applications. \n- Assist in teaching a course on nanoelectronics. Postdoctoral Scholar Stanford University October 2013  – Present (1 year 11 months) Postdoctoral Scholar Stanford University October 2013  – Present (1 year 11 months) Graduate Student Staff Purdue University January 2009  –  August 2013  (4 years 8 months) Develop new materials and their nanofabrication techniques for applications in plasmonics and metamaterials. Graduate Student Staff Purdue University January 2009  –  August 2013  (4 years 8 months) Develop new materials and their nanofabrication techniques for applications in plasmonics and metamaterials. Project Associate Indian Institute of Science August 2008  –  December 2008  (5 months) - Characterize organic semiconductors for photovoltaic applications. \n- Assist in teaching a course on nanoelectronics. Project Associate Indian Institute of Science August 2008  –  December 2008  (5 months) - Characterize organic semiconductors for photovoltaic applications. \n- Assist in teaching a course on nanoelectronics. Skills Matlab Simulation COMSOL Nanotechnology Nanofabrication Simulations Plasmonics Metamaterials Materials Science Characterization Experimentation Scanning Electron... Physics AFM Optics Nanophotonics Spectroscopy Photonics Nanomaterials Sensors Photolithography Thin Films Photovoltaics MEMS CVD Semiconductors Powder X-ray Diffraction Lithography Signal Processing Numerical Analysis Numerical Simulation Design of Experiments Circuit Design Analog Circuit Design Microfabrication Materials Microscopy Electron Beam... LaTeX CMOS Nonlinear Optics Nanoparticles Ellipsometry See 28+     See less Skills  Matlab Simulation COMSOL Nanotechnology Nanofabrication Simulations Plasmonics Metamaterials Materials Science Characterization Experimentation Scanning Electron... Physics AFM Optics Nanophotonics Spectroscopy Photonics Nanomaterials Sensors Photolithography Thin Films Photovoltaics MEMS CVD Semiconductors Powder X-ray Diffraction Lithography Signal Processing Numerical Analysis Numerical Simulation Design of Experiments Circuit Design Analog Circuit Design Microfabrication Materials Microscopy Electron Beam... LaTeX CMOS Nonlinear Optics Nanoparticles Ellipsometry See 28+     See less Matlab Simulation COMSOL Nanotechnology Nanofabrication Simulations Plasmonics Metamaterials Materials Science Characterization Experimentation Scanning Electron... Physics AFM Optics Nanophotonics Spectroscopy Photonics Nanomaterials Sensors Photolithography Thin Films Photovoltaics MEMS CVD Semiconductors Powder X-ray Diffraction Lithography Signal Processing Numerical Analysis Numerical Simulation Design of Experiments Circuit Design Analog Circuit Design Microfabrication Materials Microscopy Electron Beam... LaTeX CMOS Nonlinear Optics Nanoparticles Ellipsometry See 28+     See less Matlab Simulation COMSOL Nanotechnology Nanofabrication Simulations Plasmonics Metamaterials Materials Science Characterization Experimentation Scanning Electron... Physics AFM Optics Nanophotonics Spectroscopy Photonics Nanomaterials Sensors Photolithography Thin Films Photovoltaics MEMS CVD Semiconductors Powder X-ray Diffraction Lithography Signal Processing Numerical Analysis Numerical Simulation Design of Experiments Circuit Design Analog Circuit Design Microfabrication Materials Microscopy Electron Beam... LaTeX CMOS Nonlinear Optics Nanoparticles Ellipsometry See 28+     See less Education Purdue University PhD,  Electrical and Electronics Engineering 2009  – 2013 Indian Institute of Science M.E,  Microelectronic Systems 2006  – 2008 B.M.S College of Engineering B.E,  Electronics & Communication 2002  – 2006 Vijaya High School Purdue University PhD,  Electrical and Electronics Engineering 2009  – 2013 Purdue University PhD,  Electrical and Electronics Engineering 2009  – 2013 Purdue University PhD,  Electrical and Electronics Engineering 2009  – 2013 Indian Institute of Science M.E,  Microelectronic Systems 2006  – 2008 Indian Institute of Science M.E,  Microelectronic Systems 2006  – 2008 Indian Institute of Science M.E,  Microelectronic Systems 2006  – 2008 B.M.S College of Engineering B.E,  Electronics & Communication 2002  – 2006 B.M.S College of Engineering B.E,  Electronics & Communication 2002  – 2006 B.M.S College of Engineering B.E,  Electronics & Communication 2002  – 2006 Vijaya High School Vijaya High School Vijaya High School ", "Summary Expertise: fiber laser, high-power lasers, spatial-temporal optical pulse generation/characterization, femtosecond timing distribution and synchronization, nonlinear optics, phase retrieval, image processing, and numerical simulations. Summary Expertise: fiber laser, high-power lasers, spatial-temporal optical pulse generation/characterization, femtosecond timing distribution and synchronization, nonlinear optics, phase retrieval, image processing, and numerical simulations. Expertise: fiber laser, high-power lasers, spatial-temporal optical pulse generation/characterization, femtosecond timing distribution and synchronization, nonlinear optics, phase retrieval, image processing, and numerical simulations. Expertise: fiber laser, high-power lasers, spatial-temporal optical pulse generation/characterization, femtosecond timing distribution and synchronization, nonlinear optics, phase retrieval, image processing, and numerical simulations. Experience Postdoctoral Scholar Stanford University October 2012  – Present (2 years 11 months) Menlo Park, CA • Worked on the femtosecond fiber timing distribution system of the Linac Coherent \nLight Source at SLAC National Accelerator Laboratory. Achieved 3.3 fs rms remote two-color optical-optical synchronization between a Ti:sapphire oscillator and an Er-doped fiber laser through 360 m dispersion compensated length-stabilized fiber link. \n• Mentored one Science Undergraduate Laboratory Internships student in the summer of 2013. Postdoctoral Scholar Stanford University October 2012  – Present (2 years 11 months) Menlo Park, CA • Worked on the femtosecond fiber timing distribution system of the Linac Coherent \nLight Source at SLAC National Accelerator Laboratory. Achieved 3.3 fs rms remote two-color optical-optical synchronization between a Ti:sapphire oscillator and an Er-doped fiber laser through 360 m dispersion compensated length-stabilized fiber link. \n• Mentored one Science Undergraduate Laboratory Internships student in the summer of 2013. Postdoctoral Scholar Stanford University October 2012  – Present (2 years 11 months) Menlo Park, CA • Worked on the femtosecond fiber timing distribution system of the Linac Coherent \nLight Source at SLAC National Accelerator Laboratory. Achieved 3.3 fs rms remote two-color optical-optical synchronization between a Ti:sapphire oscillator and an Er-doped fiber laser through 360 m dispersion compensated length-stabilized fiber link. \n• Mentored one Science Undergraduate Laboratory Internships student in the summer of 2013. Skills Physics Matlab LaTeX Image Processing Experimentation Laser Skills  Physics Matlab LaTeX Image Processing Experimentation Laser Physics Matlab LaTeX Image Processing Experimentation Laser Physics Matlab LaTeX Image Processing Experimentation Laser Education Cornell University Doctor of Philosophy (Ph.D.),  Physics 2005  – 2012 • Achieved the smallest emittances with usable bunch charge (20 pC and 80 pC) at 5 MeV from the Cornell Energy Recovery Linac (ERL) photoinjector prototype with colleagues in 2011; it was reported as one milestone of the Cornell ERL. \n• Involved in the high-power and high-repetition-rate Yb-doped fiber laser system development for \nthe Cornell Energy Recovery Linac (ERL) between 2007 and 2012. \n• Developed the three-dimensional laser intensity and temporal phase retrieval technique between 2009 and 2010. \n• Built the soliton and dissipative soliton Yb-doped fiber lasers, and studied their starting dynamics in 2009. \n• Built and tested the Compact Muon Solenoid pixel detector test station for the Large Hadron \nCollider with colleagues at Cornell in 2006. University of Science and Technology of China Bachelor's Degree,  Physics 2001  – 2005 Cornell University Doctor of Philosophy (Ph.D.),  Physics 2005  – 2012 • Achieved the smallest emittances with usable bunch charge (20 pC and 80 pC) at 5 MeV from the Cornell Energy Recovery Linac (ERL) photoinjector prototype with colleagues in 2011; it was reported as one milestone of the Cornell ERL. \n• Involved in the high-power and high-repetition-rate Yb-doped fiber laser system development for \nthe Cornell Energy Recovery Linac (ERL) between 2007 and 2012. \n• Developed the three-dimensional laser intensity and temporal phase retrieval technique between 2009 and 2010. \n• Built the soliton and dissipative soliton Yb-doped fiber lasers, and studied their starting dynamics in 2009. \n• Built and tested the Compact Muon Solenoid pixel detector test station for the Large Hadron \nCollider with colleagues at Cornell in 2006. Cornell University Doctor of Philosophy (Ph.D.),  Physics 2005  – 2012 • Achieved the smallest emittances with usable bunch charge (20 pC and 80 pC) at 5 MeV from the Cornell Energy Recovery Linac (ERL) photoinjector prototype with colleagues in 2011; it was reported as one milestone of the Cornell ERL. \n• Involved in the high-power and high-repetition-rate Yb-doped fiber laser system development for \nthe Cornell Energy Recovery Linac (ERL) between 2007 and 2012. \n• Developed the three-dimensional laser intensity and temporal phase retrieval technique between 2009 and 2010. \n• Built the soliton and dissipative soliton Yb-doped fiber lasers, and studied their starting dynamics in 2009. \n• Built and tested the Compact Muon Solenoid pixel detector test station for the Large Hadron \nCollider with colleagues at Cornell in 2006. Cornell University Doctor of Philosophy (Ph.D.),  Physics 2005  – 2012 • Achieved the smallest emittances with usable bunch charge (20 pC and 80 pC) at 5 MeV from the Cornell Energy Recovery Linac (ERL) photoinjector prototype with colleagues in 2011; it was reported as one milestone of the Cornell ERL. \n• Involved in the high-power and high-repetition-rate Yb-doped fiber laser system development for \nthe Cornell Energy Recovery Linac (ERL) between 2007 and 2012. \n• Developed the three-dimensional laser intensity and temporal phase retrieval technique between 2009 and 2010. \n• Built the soliton and dissipative soliton Yb-doped fiber lasers, and studied their starting dynamics in 2009. \n• Built and tested the Compact Muon Solenoid pixel detector test station for the Large Hadron \nCollider with colleagues at Cornell in 2006. University of Science and Technology of China Bachelor's Degree,  Physics 2001  – 2005 University of Science and Technology of China Bachelor's Degree,  Physics 2001  – 2005 University of Science and Technology of China Bachelor's Degree,  Physics 2001  – 2005 ", "Experience Research Health Science Specialist VA Palo Alto Health Care System (GRECC) 2003  –  2006  (3 years) VA Palo Alto Health Care System (GRECC) •\tCo-investigator, Project Manager of QUERI-SDP: Group Visits to Improve Hypertension Management \n•\tPrincipal Investigator, QUERI-LIP Group Visits to Improve Medication Compliance Research Associate Stanford University 2000  –  2003  (3 years) Palo Alto, California Clinical Coordinator/Project Director: \n•\tNIA co-op studies Grant, Cholesterol Lowering Agent to Slow Progression of Alzheimer’s disease (CLASP) study \n•\tSBIR grant: Telephonic Remote Evaluation of Neuropsychological Deficits \n•\tStanford NIA Alzheimer’s Disease Core Center (my focus was on economic impact of AD) \n•\tBristol-Myers-Squibb: double-blind placebo controlled, ascending multiple dose study to evaluate the safety, tolerability, pharmacokinetic and pharmacodynamics of the study drug. Research Psychologist Stanford University 1997  –  2000  (3 years) Palo Alto, California •\tWorked with colleagues Ischemic Research Foundation. \n•\tNIA study survey of advance directives for dementia \n•\tParke-Davis Study: Economic Impact of Alzheimer’s Disease Postdoctoral Scholar Stanford University 1995  –  1997  (2 years) Palo Alto , California health services research \nDepartment of Psychiatry, Stanford University and the Center for Health Care Evaluation at the Palo Alto Veterans Affairs Health Care System Postdoctoral Scholar Stanford University 1994  –  1995  (1 year) Palo Alto, California Department of Psychiatry, Clinical Research Center (focus on Aging); sponsor: Jerome Yesavage Research Associate Stanford University 1986  –  1988  (2 years) Palo Alto , California Postdoctoral Scholar Stanford University 1982  –  1985  (3 years) Palo Alto, California Department of Psychiatry, Social Ecology Laboratory; sponsor: Rudolph Moos, Ph.D. Staff Research Associate UCSF 1980  –  1981  (1 year) San Francisco Bay Area Principal Investigator UCSF Medical Center 1978  –  1979  (1 year) San Francisco Bay Area Neurophysiological Assessment of Down's Syndrome. Approved by: Human Subjects Committees (University of California, San Francisco; Sacramento; and Sonoma State Hospital) and research committee (Sonoma State Hospital). Part-time Faculty Dominican University of California 1978  –  1978  (less than a year) San Rafael, California Taught \nPhysiological Psychology Staff Research Associate UCSF Medical Center 1974  –  1978  (4 years) San Francisco Bay Area Instructor University of Maryland Far East Division January 1977  –  April 1977  (4 months) Okinawa, Japan Taught Introduction to Psychology to undergraduates in the United States Armed Forces Research Health Science Specialist VA Palo Alto Health Care System (GRECC) 2003  –  2006  (3 years) VA Palo Alto Health Care System (GRECC) •\tCo-investigator, Project Manager of QUERI-SDP: Group Visits to Improve Hypertension Management \n•\tPrincipal Investigator, QUERI-LIP Group Visits to Improve Medication Compliance Research Health Science Specialist VA Palo Alto Health Care System (GRECC) 2003  –  2006  (3 years) VA Palo Alto Health Care System (GRECC) •\tCo-investigator, Project Manager of QUERI-SDP: Group Visits to Improve Hypertension Management \n•\tPrincipal Investigator, QUERI-LIP Group Visits to Improve Medication Compliance Research Associate Stanford University 2000  –  2003  (3 years) Palo Alto, California Clinical Coordinator/Project Director: \n•\tNIA co-op studies Grant, Cholesterol Lowering Agent to Slow Progression of Alzheimer’s disease (CLASP) study \n•\tSBIR grant: Telephonic Remote Evaluation of Neuropsychological Deficits \n•\tStanford NIA Alzheimer’s Disease Core Center (my focus was on economic impact of AD) \n•\tBristol-Myers-Squibb: double-blind placebo controlled, ascending multiple dose study to evaluate the safety, tolerability, pharmacokinetic and pharmacodynamics of the study drug. Research Associate Stanford University 2000  –  2003  (3 years) Palo Alto, California Clinical Coordinator/Project Director: \n•\tNIA co-op studies Grant, Cholesterol Lowering Agent to Slow Progression of Alzheimer’s disease (CLASP) study \n•\tSBIR grant: Telephonic Remote Evaluation of Neuropsychological Deficits \n•\tStanford NIA Alzheimer’s Disease Core Center (my focus was on economic impact of AD) \n•\tBristol-Myers-Squibb: double-blind placebo controlled, ascending multiple dose study to evaluate the safety, tolerability, pharmacokinetic and pharmacodynamics of the study drug. Research Psychologist Stanford University 1997  –  2000  (3 years) Palo Alto, California •\tWorked with colleagues Ischemic Research Foundation. \n•\tNIA study survey of advance directives for dementia \n•\tParke-Davis Study: Economic Impact of Alzheimer’s Disease Research Psychologist Stanford University 1997  –  2000  (3 years) Palo Alto, California •\tWorked with colleagues Ischemic Research Foundation. \n•\tNIA study survey of advance directives for dementia \n•\tParke-Davis Study: Economic Impact of Alzheimer’s Disease Postdoctoral Scholar Stanford University 1995  –  1997  (2 years) Palo Alto , California health services research \nDepartment of Psychiatry, Stanford University and the Center for Health Care Evaluation at the Palo Alto Veterans Affairs Health Care System Postdoctoral Scholar Stanford University 1995  –  1997  (2 years) Palo Alto , California health services research \nDepartment of Psychiatry, Stanford University and the Center for Health Care Evaluation at the Palo Alto Veterans Affairs Health Care System Postdoctoral Scholar Stanford University 1994  –  1995  (1 year) Palo Alto, California Department of Psychiatry, Clinical Research Center (focus on Aging); sponsor: Jerome Yesavage Postdoctoral Scholar Stanford University 1994  –  1995  (1 year) Palo Alto, California Department of Psychiatry, Clinical Research Center (focus on Aging); sponsor: Jerome Yesavage Research Associate Stanford University 1986  –  1988  (2 years) Palo Alto , California Research Associate Stanford University 1986  –  1988  (2 years) Palo Alto , California Postdoctoral Scholar Stanford University 1982  –  1985  (3 years) Palo Alto, California Department of Psychiatry, Social Ecology Laboratory; sponsor: Rudolph Moos, Ph.D. Postdoctoral Scholar Stanford University 1982  –  1985  (3 years) Palo Alto, California Department of Psychiatry, Social Ecology Laboratory; sponsor: Rudolph Moos, Ph.D. Staff Research Associate UCSF 1980  –  1981  (1 year) San Francisco Bay Area Staff Research Associate UCSF 1980  –  1981  (1 year) San Francisco Bay Area Principal Investigator UCSF Medical Center 1978  –  1979  (1 year) San Francisco Bay Area Neurophysiological Assessment of Down's Syndrome. Approved by: Human Subjects Committees (University of California, San Francisco; Sacramento; and Sonoma State Hospital) and research committee (Sonoma State Hospital). Principal Investigator UCSF Medical Center 1978  –  1979  (1 year) San Francisco Bay Area Neurophysiological Assessment of Down's Syndrome. Approved by: Human Subjects Committees (University of California, San Francisco; Sacramento; and Sonoma State Hospital) and research committee (Sonoma State Hospital). Part-time Faculty Dominican University of California 1978  –  1978  (less than a year) San Rafael, California Taught \nPhysiological Psychology Part-time Faculty Dominican University of California 1978  –  1978  (less than a year) San Rafael, California Taught \nPhysiological Psychology Staff Research Associate UCSF Medical Center 1974  –  1978  (4 years) San Francisco Bay Area Staff Research Associate UCSF Medical Center 1974  –  1978  (4 years) San Francisco Bay Area Instructor University of Maryland Far East Division January 1977  –  April 1977  (4 months) Okinawa, Japan Taught Introduction to Psychology to undergraduates in the United States Armed Forces Instructor University of Maryland Far East Division January 1977  –  April 1977  (4 months) Okinawa, Japan Taught Introduction to Psychology to undergraduates in the United States Armed Forces Skills Clinical Research Clinical Trials Skills  Clinical Research Clinical Trials Clinical Research Clinical Trials Clinical Research Clinical Trials Education University of California, San Francisco PhD,  Psychology 1973  – 1981 University of California, San Francisco PhD,  Psychology 1973  – 1981 University of California, San Francisco PhD,  Psychology 1973  – 1981 University of California, San Francisco PhD,  Psychology 1973  – 1981 ", "Summary I am an astrophysicist and cosmologist studying how the Universe formed and why its expansion is suddenly accelerating. Day-to-day, I use supercomputers, data from large imaging surveys of the night sky and lots of code in Python and C to study these problems.  \n \nI am currently a Postdoctoral Scholar at Stanford University in the Department of Physics and Kavli Institute for Particle Astrophysics and Cosmology. Additionally, I work heavily on the Dark Energy Survey. Summary I am an astrophysicist and cosmologist studying how the Universe formed and why its expansion is suddenly accelerating. Day-to-day, I use supercomputers, data from large imaging surveys of the night sky and lots of code in Python and C to study these problems.  \n \nI am currently a Postdoctoral Scholar at Stanford University in the Department of Physics and Kavli Institute for Particle Astrophysics and Cosmology. Additionally, I work heavily on the Dark Energy Survey. I am an astrophysicist and cosmologist studying how the Universe formed and why its expansion is suddenly accelerating. Day-to-day, I use supercomputers, data from large imaging surveys of the night sky and lots of code in Python and C to study these problems.  \n \nI am currently a Postdoctoral Scholar at Stanford University in the Department of Physics and Kavli Institute for Particle Astrophysics and Cosmology. Additionally, I work heavily on the Dark Energy Survey. I am an astrophysicist and cosmologist studying how the Universe formed and why its expansion is suddenly accelerating. Day-to-day, I use supercomputers, data from large imaging surveys of the night sky and lots of code in Python and C to study these problems.  \n \nI am currently a Postdoctoral Scholar at Stanford University in the Department of Physics and Kavli Institute for Particle Astrophysics and Cosmology. Additionally, I work heavily on the Dark Energy Survey. Experience Postdoctoral Scholar Stanford University October 2013  – Present (1 year 11 months) Stanford, CA Researcher in cosmology and astrophysics working on problems in large-scale structure, weak gravitational lensing and the data analysis of large-area sky surveys. \n \n- Co-organizer of Monday Cosmology Seminars Research Assistant The University of Chicago September 2008  –  May 2013  (4 years 9 months) Chicago, IL Performed research in cosmology and astrophysics on the computational modeling of weak gravitational lensing signals. Teaching Assistant The University of Chicago 2007  –  2008  (1 year) Chicago, IL Prepared and taught a recitation and lab section of the introductory physics course for science majors. Postdoctoral Scholar Stanford University October 2013  – Present (1 year 11 months) Stanford, CA Researcher in cosmology and astrophysics working on problems in large-scale structure, weak gravitational lensing and the data analysis of large-area sky surveys. \n \n- Co-organizer of Monday Cosmology Seminars Postdoctoral Scholar Stanford University October 2013  – Present (1 year 11 months) Stanford, CA Researcher in cosmology and astrophysics working on problems in large-scale structure, weak gravitational lensing and the data analysis of large-area sky surveys. \n \n- Co-organizer of Monday Cosmology Seminars Research Assistant The University of Chicago September 2008  –  May 2013  (4 years 9 months) Chicago, IL Performed research in cosmology and astrophysics on the computational modeling of weak gravitational lensing signals. Research Assistant The University of Chicago September 2008  –  May 2013  (4 years 9 months) Chicago, IL Performed research in cosmology and astrophysics on the computational modeling of weak gravitational lensing signals. Teaching Assistant The University of Chicago 2007  –  2008  (1 year) Chicago, IL Prepared and taught a recitation and lab section of the introductory physics course for science majors. Teaching Assistant The University of Chicago 2007  –  2008  (1 year) Chicago, IL Prepared and taught a recitation and lab section of the introductory physics course for science majors. Skills Statistics Scientific Computing Data Analysis Higher Education Python C MPI OpenMP LaTeX Mercurial Git IDL High Performance... Science Research Physics Astrophysics Mathematical Modeling See 3+     See less Skills  Statistics Scientific Computing Data Analysis Higher Education Python C MPI OpenMP LaTeX Mercurial Git IDL High Performance... Science Research Physics Astrophysics Mathematical Modeling See 3+     See less Statistics Scientific Computing Data Analysis Higher Education Python C MPI OpenMP LaTeX Mercurial Git IDL High Performance... Science Research Physics Astrophysics Mathematical Modeling See 3+     See less Statistics Scientific Computing Data Analysis Higher Education Python C MPI OpenMP LaTeX Mercurial Git IDL High Performance... Science Research Physics Astrophysics Mathematical Modeling See 3+     See less Education The University of Chicago Doctor of Philosophy (Ph.D.),  Physics 2007  – 2013 - Served on the Graduate Admissions Committee, 2008 \n- Professor Andrey Kravtsov was my dissertation advisor \n- Dissertation titled \"CALCLENS: Weak Lensing Simulations for Large-Area Sky Surveys and Second-Order Effects in Cosmic Shear Power Spectra\", 2013. Published in the Monthly Notices of the Royal Astronomical Society, 2013, volume 435, page 115. The University of Chicago Master's Degree,  Physics 2007  – 2008 - Worked on QUIET experiment in Professor Bruce Winstein's research group, optimizing the detector performance. University of Michigan Bachelor's Degree with Highest Distinction , Physics w/ Highest Honors, Mathematics w/ High Honors 2003  – 2007 - Served on the Provost Student Academic Advisory Board, 2006 \n- Undergraduate Thesis titled \"The Velocity Structure of MaxBCG Galaxy Clusters from the Sloan Digital Sky Survey\", 2007. Published in the Astrophysical Journal, 2007, volume 669, page 905. The University of Chicago Doctor of Philosophy (Ph.D.),  Physics 2007  – 2013 - Served on the Graduate Admissions Committee, 2008 \n- Professor Andrey Kravtsov was my dissertation advisor \n- Dissertation titled \"CALCLENS: Weak Lensing Simulations for Large-Area Sky Surveys and Second-Order Effects in Cosmic Shear Power Spectra\", 2013. Published in the Monthly Notices of the Royal Astronomical Society, 2013, volume 435, page 115. The University of Chicago Doctor of Philosophy (Ph.D.),  Physics 2007  – 2013 - Served on the Graduate Admissions Committee, 2008 \n- Professor Andrey Kravtsov was my dissertation advisor \n- Dissertation titled \"CALCLENS: Weak Lensing Simulations for Large-Area Sky Surveys and Second-Order Effects in Cosmic Shear Power Spectra\", 2013. Published in the Monthly Notices of the Royal Astronomical Society, 2013, volume 435, page 115. The University of Chicago Doctor of Philosophy (Ph.D.),  Physics 2007  – 2013 - Served on the Graduate Admissions Committee, 2008 \n- Professor Andrey Kravtsov was my dissertation advisor \n- Dissertation titled \"CALCLENS: Weak Lensing Simulations for Large-Area Sky Surveys and Second-Order Effects in Cosmic Shear Power Spectra\", 2013. Published in the Monthly Notices of the Royal Astronomical Society, 2013, volume 435, page 115. The University of Chicago Master's Degree,  Physics 2007  – 2008 - Worked on QUIET experiment in Professor Bruce Winstein's research group, optimizing the detector performance. The University of Chicago Master's Degree,  Physics 2007  – 2008 - Worked on QUIET experiment in Professor Bruce Winstein's research group, optimizing the detector performance. The University of Chicago Master's Degree,  Physics 2007  – 2008 - Worked on QUIET experiment in Professor Bruce Winstein's research group, optimizing the detector performance. University of Michigan Bachelor's Degree with Highest Distinction , Physics w/ Highest Honors, Mathematics w/ High Honors 2003  – 2007 - Served on the Provost Student Academic Advisory Board, 2006 \n- Undergraduate Thesis titled \"The Velocity Structure of MaxBCG Galaxy Clusters from the Sloan Digital Sky Survey\", 2007. Published in the Astrophysical Journal, 2007, volume 669, page 905. University of Michigan Bachelor's Degree with Highest Distinction , Physics w/ Highest Honors, Mathematics w/ High Honors 2003  – 2007 - Served on the Provost Student Academic Advisory Board, 2006 \n- Undergraduate Thesis titled \"The Velocity Structure of MaxBCG Galaxy Clusters from the Sloan Digital Sky Survey\", 2007. Published in the Astrophysical Journal, 2007, volume 669, page 905. University of Michigan Bachelor's Degree with Highest Distinction , Physics w/ Highest Honors, Mathematics w/ High Honors 2003  – 2007 - Served on the Provost Student Academic Advisory Board, 2006 \n- Undergraduate Thesis titled \"The Velocity Structure of MaxBCG Galaxy Clusters from the Sloan Digital Sky Survey\", 2007. Published in the Astrophysical Journal, 2007, volume 669, page 905. Honors & Awards Nathan Sugarman Award for Excellence in Graduate Student Research Department of Physics, University of Chicago 2013 Recognized my graduate thesis work in the computational modeling of large-area sky surveys. GAANN Graduate Fellowship Department of Physics, University of Chicago 2007-2008 \n \nGraduate fellowship from the Department of Energy GAANN program. LeRoy Apker Award for Undergraduate Thesis American Physical Society 2007 Recognized my undergraduate thesis on the velocity structure of large groups of galaxies.  Jerome and Isabella Karl Award in Science University of Michigan 2007 Recognized outstanding academic achievement in the physical sciences. Barry M. Goldwater Scholarship The Barry Goldwater Scholarship and Excellence in Education Program 2006 Phi Beta Kappa Member 2006 Additional Honors and Awards - Plotnick Fellowship, University of Chicago, 2012 \n- Illinois Space Grant Consortium Graduate Fellow, 2010 \n- William L. Williams Award for Undergraduate Thesis, University of Michigan, 2007 \n- Michigan Space Grant Consortium Undergraduate Fellow and Grant Recipient, 2006 \n- Sigma Pi Sigma, 2006 Nathan Sugarman Award for Excellence in Graduate Student Research Department of Physics, University of Chicago 2013 Recognized my graduate thesis work in the computational modeling of large-area sky surveys. Nathan Sugarman Award for Excellence in Graduate Student Research Department of Physics, University of Chicago 2013 Recognized my graduate thesis work in the computational modeling of large-area sky surveys. Nathan Sugarman Award for Excellence in Graduate Student Research Department of Physics, University of Chicago 2013 Recognized my graduate thesis work in the computational modeling of large-area sky surveys. GAANN Graduate Fellowship Department of Physics, University of Chicago 2007-2008 \n \nGraduate fellowship from the Department of Energy GAANN program. GAANN Graduate Fellowship Department of Physics, University of Chicago 2007-2008 \n \nGraduate fellowship from the Department of Energy GAANN program. GAANN Graduate Fellowship Department of Physics, University of Chicago 2007-2008 \n \nGraduate fellowship from the Department of Energy GAANN program. LeRoy Apker Award for Undergraduate Thesis American Physical Society 2007 Recognized my undergraduate thesis on the velocity structure of large groups of galaxies.  LeRoy Apker Award for Undergraduate Thesis American Physical Society 2007 Recognized my undergraduate thesis on the velocity structure of large groups of galaxies.  LeRoy Apker Award for Undergraduate Thesis American Physical Society 2007 Recognized my undergraduate thesis on the velocity structure of large groups of galaxies.  Jerome and Isabella Karl Award in Science University of Michigan 2007 Recognized outstanding academic achievement in the physical sciences. Jerome and Isabella Karl Award in Science University of Michigan 2007 Recognized outstanding academic achievement in the physical sciences. Jerome and Isabella Karl Award in Science University of Michigan 2007 Recognized outstanding academic achievement in the physical sciences. Barry M. Goldwater Scholarship The Barry Goldwater Scholarship and Excellence in Education Program 2006 Barry M. Goldwater Scholarship The Barry Goldwater Scholarship and Excellence in Education Program 2006 Barry M. Goldwater Scholarship The Barry Goldwater Scholarship and Excellence in Education Program 2006 Phi Beta Kappa Member 2006 Phi Beta Kappa Member 2006 Phi Beta Kappa Member 2006 Additional Honors and Awards - Plotnick Fellowship, University of Chicago, 2012 \n- Illinois Space Grant Consortium Graduate Fellow, 2010 \n- William L. Williams Award for Undergraduate Thesis, University of Michigan, 2007 \n- Michigan Space Grant Consortium Undergraduate Fellow and Grant Recipient, 2006 \n- Sigma Pi Sigma, 2006 Additional Honors and Awards - Plotnick Fellowship, University of Chicago, 2012 \n- Illinois Space Grant Consortium Graduate Fellow, 2010 \n- William L. Williams Award for Undergraduate Thesis, University of Michigan, 2007 \n- Michigan Space Grant Consortium Undergraduate Fellow and Grant Recipient, 2006 \n- Sigma Pi Sigma, 2006 Additional Honors and Awards - Plotnick Fellowship, University of Chicago, 2012 \n- Illinois Space Grant Consortium Graduate Fellow, 2010 \n- William L. Williams Award for Undergraduate Thesis, University of Michigan, 2007 \n- Michigan Space Grant Consortium Undergraduate Fellow and Grant Recipient, 2006 \n- Sigma Pi Sigma, 2006 "]}