{"position": "Professor, Education", "company": "Stanford University", "profiles": ["Experience Assistant Professor Stanford University 2008  – Present (7 years) Assistant Professor Stanford University 2008  – Present (7 years) Assistant Professor Stanford University 2008  – Present (7 years) ", "Summary I am a professor of education at Stanford University. My research explores teacher cognition and the process of learning to teach, with an emphasis on changes in novice and experienced teachers’ knowledge and beliefs about teaching, learning, and assessment; classroom practices; and professional identities as they participate in reform-based teacher education and professional development programs. I am currently co-principal investigator on two research projects funded by the National Science Foundation: a field-test of the Problem-Solving Cycle professional development program for middle school mathematics teachers (which I developed with the other co-PIs on the project), and a Collaborative Research project in partnership with the Lawrence Hall of Science to study the effectiveness of an innovative model of science PD developed by LHS, for improving discourse and inquiry in science classrooms and students’ science learning outcomes. With colleagues, I also recently completed “Quality Assessment in Science,” a project funded by the W.T.Grant and Spencer Foundations to develop a measure of assessment practices in science classrooms (the QAS Notebook) and investigate the instrument’s reliability and validity. I served as President of the American Educational Research Association (2003-2004), am a member of the National Academy of Education, and have served as a member and chair of various committees for the American Educational Research Association, Association of Mathematics Teacher Educators, Educational Psychology Division of the American Psychological Association, and National Academy of Education. Summary I am a professor of education at Stanford University. My research explores teacher cognition and the process of learning to teach, with an emphasis on changes in novice and experienced teachers’ knowledge and beliefs about teaching, learning, and assessment; classroom practices; and professional identities as they participate in reform-based teacher education and professional development programs. I am currently co-principal investigator on two research projects funded by the National Science Foundation: a field-test of the Problem-Solving Cycle professional development program for middle school mathematics teachers (which I developed with the other co-PIs on the project), and a Collaborative Research project in partnership with the Lawrence Hall of Science to study the effectiveness of an innovative model of science PD developed by LHS, for improving discourse and inquiry in science classrooms and students’ science learning outcomes. With colleagues, I also recently completed “Quality Assessment in Science,” a project funded by the W.T.Grant and Spencer Foundations to develop a measure of assessment practices in science classrooms (the QAS Notebook) and investigate the instrument’s reliability and validity. I served as President of the American Educational Research Association (2003-2004), am a member of the National Academy of Education, and have served as a member and chair of various committees for the American Educational Research Association, Association of Mathematics Teacher Educators, Educational Psychology Division of the American Psychological Association, and National Academy of Education. I am a professor of education at Stanford University. My research explores teacher cognition and the process of learning to teach, with an emphasis on changes in novice and experienced teachers’ knowledge and beliefs about teaching, learning, and assessment; classroom practices; and professional identities as they participate in reform-based teacher education and professional development programs. I am currently co-principal investigator on two research projects funded by the National Science Foundation: a field-test of the Problem-Solving Cycle professional development program for middle school mathematics teachers (which I developed with the other co-PIs on the project), and a Collaborative Research project in partnership with the Lawrence Hall of Science to study the effectiveness of an innovative model of science PD developed by LHS, for improving discourse and inquiry in science classrooms and students’ science learning outcomes. With colleagues, I also recently completed “Quality Assessment in Science,” a project funded by the W.T.Grant and Spencer Foundations to develop a measure of assessment practices in science classrooms (the QAS Notebook) and investigate the instrument’s reliability and validity. I served as President of the American Educational Research Association (2003-2004), am a member of the National Academy of Education, and have served as a member and chair of various committees for the American Educational Research Association, Association of Mathematics Teacher Educators, Educational Psychology Division of the American Psychological Association, and National Academy of Education. I am a professor of education at Stanford University. My research explores teacher cognition and the process of learning to teach, with an emphasis on changes in novice and experienced teachers’ knowledge and beliefs about teaching, learning, and assessment; classroom practices; and professional identities as they participate in reform-based teacher education and professional development programs. I am currently co-principal investigator on two research projects funded by the National Science Foundation: a field-test of the Problem-Solving Cycle professional development program for middle school mathematics teachers (which I developed with the other co-PIs on the project), and a Collaborative Research project in partnership with the Lawrence Hall of Science to study the effectiveness of an innovative model of science PD developed by LHS, for improving discourse and inquiry in science classrooms and students’ science learning outcomes. With colleagues, I also recently completed “Quality Assessment in Science,” a project funded by the W.T.Grant and Spencer Foundations to develop a measure of assessment practices in science classrooms (the QAS Notebook) and investigate the instrument’s reliability and validity. I served as President of the American Educational Research Association (2003-2004), am a member of the National Academy of Education, and have served as a member and chair of various committees for the American Educational Research Association, Association of Mathematics Teacher Educators, Educational Psychology Division of the American Psychological Association, and National Academy of Education. Experience professor Stanford University professor Stanford University professor Stanford University Skills Higher Education Qualitative Research Teaching Educational Research Educational Technology Research Curriculum Development Skills  Higher Education Qualitative Research Teaching Educational Research Educational Technology Research Curriculum Development Higher Education Qualitative Research Teaching Educational Research Educational Technology Research Curriculum Development Higher Education Qualitative Research Teaching Educational Research Educational Technology Research Curriculum Development ", "Skills Fundraising Teacher Training Social Media Marketing Curriculum Design Social Media Teaching Organizational... Nonprofits Public Speaking Editing Community Development Entrepreneurship Grant Writing Community Outreach Event Management Event Planning Conflict Resolution Research Workshop Facilitation Team Building Leadership Development Staff Development Leadership Strategic Planning Blogging Public Relations Coaching Program Development Social Networking Creative Writing Curriculum Development See 16+     See less Skills  Fundraising Teacher Training Social Media Marketing Curriculum Design Social Media Teaching Organizational... Nonprofits Public Speaking Editing Community Development Entrepreneurship Grant Writing Community Outreach Event Management Event Planning Conflict Resolution Research Workshop Facilitation Team Building Leadership Development Staff Development Leadership Strategic Planning Blogging Public Relations Coaching Program Development Social Networking Creative Writing Curriculum Development See 16+     See less Fundraising Teacher Training Social Media Marketing Curriculum Design Social Media Teaching Organizational... Nonprofits Public Speaking Editing Community Development Entrepreneurship Grant Writing Community Outreach Event Management Event Planning Conflict Resolution Research Workshop Facilitation Team Building Leadership Development Staff Development Leadership Strategic Planning Blogging Public Relations Coaching Program Development Social Networking Creative Writing Curriculum Development See 16+     See less Fundraising Teacher Training Social Media Marketing Curriculum Design Social Media Teaching Organizational... Nonprofits Public Speaking Editing Community Development Entrepreneurship Grant Writing Community Outreach Event Management Event Planning Conflict Resolution Research Workshop Facilitation Team Building Leadership Development Staff Development Leadership Strategic Planning Blogging Public Relations Coaching Program Development Social Networking Creative Writing Curriculum Development See 16+     See less ", "Summary One of the world’s leading scholars of human development, William Damon is Professor of Education at Stanford University and the Director of the Stanford Center on Adolescence. Prior to joining Stanford in 1997, he was University Professor and Director of the Center for the Study of Human Development at Brown University. \n \nBy focusing his work on the positive aspects of “growing up” rather than on the severe behavioral problems of adolescents, Damon has put himself on the forefront of the emerging positive psychology movement in the United States. Damon speaks regularly to public and academic audiences about contemporary trends in child development and has written widely about personal development and moral commitment at all ages of life.  \n \nHe is the author of 17 different books. Summary One of the world’s leading scholars of human development, William Damon is Professor of Education at Stanford University and the Director of the Stanford Center on Adolescence. Prior to joining Stanford in 1997, he was University Professor and Director of the Center for the Study of Human Development at Brown University. \n \nBy focusing his work on the positive aspects of “growing up” rather than on the severe behavioral problems of adolescents, Damon has put himself on the forefront of the emerging positive psychology movement in the United States. Damon speaks regularly to public and academic audiences about contemporary trends in child development and has written widely about personal development and moral commitment at all ages of life.  \n \nHe is the author of 17 different books. One of the world’s leading scholars of human development, William Damon is Professor of Education at Stanford University and the Director of the Stanford Center on Adolescence. Prior to joining Stanford in 1997, he was University Professor and Director of the Center for the Study of Human Development at Brown University. \n \nBy focusing his work on the positive aspects of “growing up” rather than on the severe behavioral problems of adolescents, Damon has put himself on the forefront of the emerging positive psychology movement in the United States. Damon speaks regularly to public and academic audiences about contemporary trends in child development and has written widely about personal development and moral commitment at all ages of life.  \n \nHe is the author of 17 different books. One of the world’s leading scholars of human development, William Damon is Professor of Education at Stanford University and the Director of the Stanford Center on Adolescence. Prior to joining Stanford in 1997, he was University Professor and Director of the Center for the Study of Human Development at Brown University. \n \nBy focusing his work on the positive aspects of “growing up” rather than on the severe behavioral problems of adolescents, Damon has put himself on the forefront of the emerging positive psychology movement in the United States. Damon speaks regularly to public and academic audiences about contemporary trends in child development and has written widely about personal development and moral commitment at all ages of life.  \n \nHe is the author of 17 different books. Experience Professor Stanford University September 1997  – Present (18 years) Professor of Education and Director Stanford Center on Adolescence Advisory Board member John Templeton Foundation 2000  –  2011  (11 years) Professor Brown University September 1989  –  August 1997  (8 years) Professor Stanford University September 1997  – Present (18 years) Professor of Education and Director Stanford Center on Adolescence Professor Stanford University September 1997  – Present (18 years) Professor of Education and Director Stanford Center on Adolescence Advisory Board member John Templeton Foundation 2000  –  2011  (11 years) Advisory Board member John Templeton Foundation 2000  –  2011  (11 years) Professor Brown University September 1989  –  August 1997  (8 years) Professor Brown University September 1989  –  August 1997  (8 years) Skills Higher Education Research Adolescents Research Design Teaching Child Development Science Personal Development University Teaching Qualitative Research Lecturing Grant Writing Psychology Skills  Higher Education Research Adolescents Research Design Teaching Child Development Science Personal Development University Teaching Qualitative Research Lecturing Grant Writing Psychology Higher Education Research Adolescents Research Design Teaching Child Development Science Personal Development University Teaching Qualitative Research Lecturing Grant Writing Psychology Higher Education Research Adolescents Research Design Teaching Child Development Science Personal Development University Teaching Qualitative Research Lecturing Grant Writing Psychology Education University of California, Berkeley PhD,  Developmental Psychology 1967  – 1973 Harvard University B. A.,  Social Relations 1963  – 1967 University of California, Berkeley PhD,  Developmental Psychology 1967  – 1973 University of California, Berkeley PhD,  Developmental Psychology 1967  – 1973 University of California, Berkeley PhD,  Developmental Psychology 1967  – 1973 Harvard University B. A.,  Social Relations 1963  – 1967 Harvard University B. A.,  Social Relations 1963  – 1967 Harvard University B. A.,  Social Relations 1963  – 1967 ", "Summary Named a \"Top Big Data Pro To Follow On Twitter\"​: http://tinyurl.com/TopDataPros (>11k followers) \n \n-> Currently leading/building Sears Data Science practice \n-> Advisor to federal governmental agencies/projects in Colombia, Germany, and U.S.  \n-> Former Chair, Research & Evaluation Methodology doctoral program at U. of Colorado \n-> Former McKinsey management consultant \n-> Stanford-trained PhD Statistician/Data Scientist \n-> 20+ years experience in Big Data & Analytics consulting \n \nIn my work as a data scientist and strategy specialist, I leverage rich experience in business strategy as well as superior quantitative/analytical and leadership/interpersonal skills. Across my professional experiences I've developed a proven record of generating and implementing creative ideas to bring about measurable change. \n \nAs Chief Data Scientist at Sears Holdings (NASDAQ: SHLD), I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. \n \nImmediately prior to joining Sears, I led a team of data scientists at Seagate Technology (NASDAQ: STX) as we pushed the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I served as Seagate's primary strategist, subject matter expert and external spokesperson for Big Data Analytics. \n Summary Named a \"Top Big Data Pro To Follow On Twitter\"​: http://tinyurl.com/TopDataPros (>11k followers) \n \n-> Currently leading/building Sears Data Science practice \n-> Advisor to federal governmental agencies/projects in Colombia, Germany, and U.S.  \n-> Former Chair, Research & Evaluation Methodology doctoral program at U. of Colorado \n-> Former McKinsey management consultant \n-> Stanford-trained PhD Statistician/Data Scientist \n-> 20+ years experience in Big Data & Analytics consulting \n \nIn my work as a data scientist and strategy specialist, I leverage rich experience in business strategy as well as superior quantitative/analytical and leadership/interpersonal skills. Across my professional experiences I've developed a proven record of generating and implementing creative ideas to bring about measurable change. \n \nAs Chief Data Scientist at Sears Holdings (NASDAQ: SHLD), I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. \n \nImmediately prior to joining Sears, I led a team of data scientists at Seagate Technology (NASDAQ: STX) as we pushed the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I served as Seagate's primary strategist, subject matter expert and external spokesperson for Big Data Analytics. \n Named a \"Top Big Data Pro To Follow On Twitter\"​: http://tinyurl.com/TopDataPros (>11k followers) \n \n-> Currently leading/building Sears Data Science practice \n-> Advisor to federal governmental agencies/projects in Colombia, Germany, and U.S.  \n-> Former Chair, Research & Evaluation Methodology doctoral program at U. of Colorado \n-> Former McKinsey management consultant \n-> Stanford-trained PhD Statistician/Data Scientist \n-> 20+ years experience in Big Data & Analytics consulting \n \nIn my work as a data scientist and strategy specialist, I leverage rich experience in business strategy as well as superior quantitative/analytical and leadership/interpersonal skills. Across my professional experiences I've developed a proven record of generating and implementing creative ideas to bring about measurable change. \n \nAs Chief Data Scientist at Sears Holdings (NASDAQ: SHLD), I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. \n \nImmediately prior to joining Sears, I led a team of data scientists at Seagate Technology (NASDAQ: STX) as we pushed the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I served as Seagate's primary strategist, subject matter expert and external spokesperson for Big Data Analytics. \n Named a \"Top Big Data Pro To Follow On Twitter\"​: http://tinyurl.com/TopDataPros (>11k followers) \n \n-> Currently leading/building Sears Data Science practice \n-> Advisor to federal governmental agencies/projects in Colombia, Germany, and U.S.  \n-> Former Chair, Research & Evaluation Methodology doctoral program at U. of Colorado \n-> Former McKinsey management consultant \n-> Stanford-trained PhD Statistician/Data Scientist \n-> 20+ years experience in Big Data & Analytics consulting \n \nIn my work as a data scientist and strategy specialist, I leverage rich experience in business strategy as well as superior quantitative/analytical and leadership/interpersonal skills. Across my professional experiences I've developed a proven record of generating and implementing creative ideas to bring about measurable change. \n \nAs Chief Data Scientist at Sears Holdings (NASDAQ: SHLD), I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. \n \nImmediately prior to joining Sears, I led a team of data scientists at Seagate Technology (NASDAQ: STX) as we pushed the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I served as Seagate's primary strategist, subject matter expert and external spokesperson for Big Data Analytics. \n Experience Chief Data Scientist; DVP Pricing Sears Holdings Corporation 2015  – Present (less than a year) A Chief Data Scientist I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. Owner Boulder Strategic Analytics 1996  – Present (19 years) Louisville, CO Boulder Strategic Analytics represents the formal home for my consulting practice – a practice that has encompassed my work with over 45 national and international, public and private sector organizations over the past 17 years. Client engagements have focused on quantitative business analytics, strategy and pricing, marketing/consumer insights research, investment/risk management (primarily in hedge funds, private equity, and venture capital), and deep statistical analysis. Many engagements focus on value capture in building client capability to leverage 'Big Data' (see http://tiny.cc/McKinsey_on_Big_Data). \n \n \nBSA's specific capabilities include: \n \n• Experimental Design & Causal Modeling \n– Propensity score methods \n– Exact and coarsened matching \n• Psychometric Methods \n– Foundations of Item Response Theory, Classical Test Theory, & Generalizability Theory \n– Rasch/2PL/3PL models; multifacet IRT models; multidimensional IRT methods; scaling and equating \n– Bayes nets \n• Advanced Linear Modeling Methods \n– Latent variable/structural equation models \n– Multilevel/hierarchical/growth models \n– Latent class and growth mixture models \n– Time series; survival models \n• Supervised Learning \n– Quantile/lasso/logistic/local/spline models \n– Regression trees/boosting/bagging \n– Support vector machines; neural nets; additive models \n– Targeted statistical learning \n• Unsupervised Learning \n– Clustering; factor analysis \n– Ensemble learning; random forests \n• Survey Methods \n– Sample design, stratiﬁcation, and power analysis \n– Weighting (post-stratiﬁcation; nonresponse; sample weighting); variance estimation \n• Iterative and Simulation-based Methods \n– Monte Carlo methods \n– Bootstrap methods \n– Bayesian simulation (e.g., MCMC) Volunteer Statistics Without Borders 2010  – Present (5 years) Senior Engineering Manager - Big Data Analytics Seagate Technology 2013  –  2015  (2 years) Longmont, CO I lead a team of highly trained data scientists, engineers, and researchers as we push the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I serve as strategist, subject matter expert and external spokesperson for this newly-formed initiative within Seagate’s Data Center Operations group. Chair and Assistant Professor: Quantitative Methods (Research & Evaluation Methodology Program) University of Colorado at Boulder August 2004  –  August 2011  (7 years 1 month) Teaching and research in basic and advanced statistical methods. \nPublished 75+ articles & presentations.  \nChaired two and served on four national professional committees.  \nAdvised five state departments of education. \nRegularly taught five courses: \n1. Quantitative Methods in Educational Research I \n2. Basic Statistical Methods \n3. Latent Variable and Structural Equation Modeling \n4. Multi-Level (Hierarchical) Statistical Modeling (Longitudinal Data Analysis) \n5. Advanced Topics in Applied Statistics (Logistic Regression, Local Regression Modeling) Senior Associate (Analytics, Pricing, & Portfolio/Risk Strategy Expert) McKinsey & Company August 2001  –  December 2004  (3 years 5 months) San Francisco Bay Area Client engagements primarily in (1) institutional investment; (2) professional services; and (3) public sector:  \n(1) Served North American and European institutional investor clients (from C-level executives to individual portfolio managers) on issues of policy, organization/governance, and investment/risk strategy.  \n(2) Served global professional services clients on issues of pricing, organization, and operations. \n(3) Served state (California), local (Bay Area), and public and private educational organizations on issues of strategy. \nFunctional expertise includes pricing and strategy; risk-based pricing; alternative investment (private equity, venture capital, hedge funds, and natural resources); real options asset pricing models Senior Research Scientist American Institutes for Research June 1998  –  August 2001  (3 years 3 months) Palo Alto, CA Managed comprehensive evaluations of state/federal social programs Research Assistant and Lecturer Stanford University September 1996  –  June 2001  (4 years 10 months) Stanford, CA Taught or co-taught eight courses: \n1. Hierarchical Linear Models (PhD seminar) \n2. Analysis of Variance (PhD course) \n3. Spencer Doctoral Seminar - Research Design and Methodology \n4. Spencer Doctoral Seminar - Quantitative Methods  \n5. Spencer Doctoral Seminar - Qualitative Methods \n6. Introduction to Research: Quantitative and Qualitative Methods (PhD seminar) \n7. Principles of Regression (PhD course) \n8. Social Science Research Methods (MA course) \n \nResearch assistantships/consultancies: \n \n1. California Department of Education: Modeled impact of several candidate indices designed to measure academic performance of California public schools \n2. Stanford University School of Education: Collaborated with five faculty on statistical methods including factor analysis, longitudinal analysis, and structural equation modeling \n3. Kenji Hakuta, Professor of Education, Stanford University: Employed local regression methods to test the critical period hypothesis for second language acquisition using data from the U.S. Census \n4. Stanford University Department of Medicine: Evaluated Stanford’s innovative sub-specialty system for pediatric residency training \n5. Santa Clara University Department of Psychology: Consulted with faculty on psychometrics of instrument development  \n6. Richard Shavelson, Dean, Stanford University School of Education: Developed and tested alternative assessment methods for (a) evaluating hands-on science curricula, and (b) assessing statistics knowledge of graduate students. \n7. David Rogosa, Associate Professor of Education, Stanford University: Compared structural equation models and mixed-effects models for longitudinal research Assistant Director of Development University of Nebraska Foundation 1995  –  1996  (1 year) Lincoln, Nebraska Area Responsibilities include coordination of all major gift development activities for the UNL College of Business Administration and College of Dentistry, including identification of prospective donors, gift feasibility research, donor calls, major gift solicitation, gift proposal writing, and alumni stewardship. Created major gift summary and tracking software still used by university deans. Assistant Director of Admissions University of Nebraska-Lincoln 1993  –  1995  (2 years) Lincoln, Nebraska Area Responsibilities include recruitment to UNL of prospective students, contact with parents and counselors, maintenance of student admissions data; service as University Residency Specialist; and management of team charged with recruiting in Lincoln (NE) Public Schools. Chief Data Scientist; DVP Pricing Sears Holdings Corporation 2015  – Present (less than a year) A Chief Data Scientist I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. Chief Data Scientist; DVP Pricing Sears Holdings Corporation 2015  – Present (less than a year) A Chief Data Scientist I am building and leading a newly-formed team focused on developing production-scale solutions to identify and capture $100M+ margin enhancing opportunities in the areas of pricing, offers and other appropriate sales and marketing instruments. We use methods of modern day data science – e.g., machine learning, Bayesian simulation (MCMC), in-memory/distributed computing – to overcome the limitations of quantitative approaches traditionally employed in pricing and marketing. As leader of this group I am charged with not only working with our senior executive team (including CEO) to communicate our vision and strategy, but also identifying, recruiting, and retaining the data science talent critical to supporting this major initiative. Owner Boulder Strategic Analytics 1996  – Present (19 years) Louisville, CO Boulder Strategic Analytics represents the formal home for my consulting practice – a practice that has encompassed my work with over 45 national and international, public and private sector organizations over the past 17 years. Client engagements have focused on quantitative business analytics, strategy and pricing, marketing/consumer insights research, investment/risk management (primarily in hedge funds, private equity, and venture capital), and deep statistical analysis. Many engagements focus on value capture in building client capability to leverage 'Big Data' (see http://tiny.cc/McKinsey_on_Big_Data). \n \n \nBSA's specific capabilities include: \n \n• Experimental Design & Causal Modeling \n– Propensity score methods \n– Exact and coarsened matching \n• Psychometric Methods \n– Foundations of Item Response Theory, Classical Test Theory, & Generalizability Theory \n– Rasch/2PL/3PL models; multifacet IRT models; multidimensional IRT methods; scaling and equating \n– Bayes nets \n• Advanced Linear Modeling Methods \n– Latent variable/structural equation models \n– Multilevel/hierarchical/growth models \n– Latent class and growth mixture models \n– Time series; survival models \n• Supervised Learning \n– Quantile/lasso/logistic/local/spline models \n– Regression trees/boosting/bagging \n– Support vector machines; neural nets; additive models \n– Targeted statistical learning \n• Unsupervised Learning \n– Clustering; factor analysis \n– Ensemble learning; random forests \n• Survey Methods \n– Sample design, stratiﬁcation, and power analysis \n– Weighting (post-stratiﬁcation; nonresponse; sample weighting); variance estimation \n• Iterative and Simulation-based Methods \n– Monte Carlo methods \n– Bootstrap methods \n– Bayesian simulation (e.g., MCMC) Owner Boulder Strategic Analytics 1996  – Present (19 years) Louisville, CO Boulder Strategic Analytics represents the formal home for my consulting practice – a practice that has encompassed my work with over 45 national and international, public and private sector organizations over the past 17 years. Client engagements have focused on quantitative business analytics, strategy and pricing, marketing/consumer insights research, investment/risk management (primarily in hedge funds, private equity, and venture capital), and deep statistical analysis. Many engagements focus on value capture in building client capability to leverage 'Big Data' (see http://tiny.cc/McKinsey_on_Big_Data). \n \n \nBSA's specific capabilities include: \n \n• Experimental Design & Causal Modeling \n– Propensity score methods \n– Exact and coarsened matching \n• Psychometric Methods \n– Foundations of Item Response Theory, Classical Test Theory, & Generalizability Theory \n– Rasch/2PL/3PL models; multifacet IRT models; multidimensional IRT methods; scaling and equating \n– Bayes nets \n• Advanced Linear Modeling Methods \n– Latent variable/structural equation models \n– Multilevel/hierarchical/growth models \n– Latent class and growth mixture models \n– Time series; survival models \n• Supervised Learning \n– Quantile/lasso/logistic/local/spline models \n– Regression trees/boosting/bagging \n– Support vector machines; neural nets; additive models \n– Targeted statistical learning \n• Unsupervised Learning \n– Clustering; factor analysis \n– Ensemble learning; random forests \n• Survey Methods \n– Sample design, stratiﬁcation, and power analysis \n– Weighting (post-stratiﬁcation; nonresponse; sample weighting); variance estimation \n• Iterative and Simulation-based Methods \n– Monte Carlo methods \n– Bootstrap methods \n– Bayesian simulation (e.g., MCMC) Volunteer Statistics Without Borders 2010  – Present (5 years) Volunteer Statistics Without Borders 2010  – Present (5 years) Senior Engineering Manager - Big Data Analytics Seagate Technology 2013  –  2015  (2 years) Longmont, CO I lead a team of highly trained data scientists, engineers, and researchers as we push the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I serve as strategist, subject matter expert and external spokesperson for this newly-formed initiative within Seagate’s Data Center Operations group. Senior Engineering Manager - Big Data Analytics Seagate Technology 2013  –  2015  (2 years) Longmont, CO I lead a team of highly trained data scientists, engineers, and researchers as we push the envelope of Big Data Analytics, primarily related to next-generation Cloud technologies. In this role I serve as strategist, subject matter expert and external spokesperson for this newly-formed initiative within Seagate’s Data Center Operations group. Chair and Assistant Professor: Quantitative Methods (Research & Evaluation Methodology Program) University of Colorado at Boulder August 2004  –  August 2011  (7 years 1 month) Teaching and research in basic and advanced statistical methods. \nPublished 75+ articles & presentations.  \nChaired two and served on four national professional committees.  \nAdvised five state departments of education. \nRegularly taught five courses: \n1. Quantitative Methods in Educational Research I \n2. Basic Statistical Methods \n3. Latent Variable and Structural Equation Modeling \n4. Multi-Level (Hierarchical) Statistical Modeling (Longitudinal Data Analysis) \n5. Advanced Topics in Applied Statistics (Logistic Regression, Local Regression Modeling) Chair and Assistant Professor: Quantitative Methods (Research & Evaluation Methodology Program) University of Colorado at Boulder August 2004  –  August 2011  (7 years 1 month) Teaching and research in basic and advanced statistical methods. \nPublished 75+ articles & presentations.  \nChaired two and served on four national professional committees.  \nAdvised five state departments of education. \nRegularly taught five courses: \n1. Quantitative Methods in Educational Research I \n2. Basic Statistical Methods \n3. Latent Variable and Structural Equation Modeling \n4. Multi-Level (Hierarchical) Statistical Modeling (Longitudinal Data Analysis) \n5. Advanced Topics in Applied Statistics (Logistic Regression, Local Regression Modeling) Senior Associate (Analytics, Pricing, & Portfolio/Risk Strategy Expert) McKinsey & Company August 2001  –  December 2004  (3 years 5 months) San Francisco Bay Area Client engagements primarily in (1) institutional investment; (2) professional services; and (3) public sector:  \n(1) Served North American and European institutional investor clients (from C-level executives to individual portfolio managers) on issues of policy, organization/governance, and investment/risk strategy.  \n(2) Served global professional services clients on issues of pricing, organization, and operations. \n(3) Served state (California), local (Bay Area), and public and private educational organizations on issues of strategy. \nFunctional expertise includes pricing and strategy; risk-based pricing; alternative investment (private equity, venture capital, hedge funds, and natural resources); real options asset pricing models Senior Associate (Analytics, Pricing, & Portfolio/Risk Strategy Expert) McKinsey & Company August 2001  –  December 2004  (3 years 5 months) San Francisco Bay Area Client engagements primarily in (1) institutional investment; (2) professional services; and (3) public sector:  \n(1) Served North American and European institutional investor clients (from C-level executives to individual portfolio managers) on issues of policy, organization/governance, and investment/risk strategy.  \n(2) Served global professional services clients on issues of pricing, organization, and operations. \n(3) Served state (California), local (Bay Area), and public and private educational organizations on issues of strategy. \nFunctional expertise includes pricing and strategy; risk-based pricing; alternative investment (private equity, venture capital, hedge funds, and natural resources); real options asset pricing models Senior Research Scientist American Institutes for Research June 1998  –  August 2001  (3 years 3 months) Palo Alto, CA Managed comprehensive evaluations of state/federal social programs Senior Research Scientist American Institutes for Research June 1998  –  August 2001  (3 years 3 months) Palo Alto, CA Managed comprehensive evaluations of state/federal social programs Research Assistant and Lecturer Stanford University September 1996  –  June 2001  (4 years 10 months) Stanford, CA Taught or co-taught eight courses: \n1. Hierarchical Linear Models (PhD seminar) \n2. Analysis of Variance (PhD course) \n3. Spencer Doctoral Seminar - Research Design and Methodology \n4. Spencer Doctoral Seminar - Quantitative Methods  \n5. Spencer Doctoral Seminar - Qualitative Methods \n6. Introduction to Research: Quantitative and Qualitative Methods (PhD seminar) \n7. Principles of Regression (PhD course) \n8. Social Science Research Methods (MA course) \n \nResearch assistantships/consultancies: \n \n1. California Department of Education: Modeled impact of several candidate indices designed to measure academic performance of California public schools \n2. Stanford University School of Education: Collaborated with five faculty on statistical methods including factor analysis, longitudinal analysis, and structural equation modeling \n3. Kenji Hakuta, Professor of Education, Stanford University: Employed local regression methods to test the critical period hypothesis for second language acquisition using data from the U.S. Census \n4. Stanford University Department of Medicine: Evaluated Stanford’s innovative sub-specialty system for pediatric residency training \n5. Santa Clara University Department of Psychology: Consulted with faculty on psychometrics of instrument development  \n6. Richard Shavelson, Dean, Stanford University School of Education: Developed and tested alternative assessment methods for (a) evaluating hands-on science curricula, and (b) assessing statistics knowledge of graduate students. \n7. David Rogosa, Associate Professor of Education, Stanford University: Compared structural equation models and mixed-effects models for longitudinal research Research Assistant and Lecturer Stanford University September 1996  –  June 2001  (4 years 10 months) Stanford, CA Taught or co-taught eight courses: \n1. Hierarchical Linear Models (PhD seminar) \n2. Analysis of Variance (PhD course) \n3. Spencer Doctoral Seminar - Research Design and Methodology \n4. Spencer Doctoral Seminar - Quantitative Methods  \n5. Spencer Doctoral Seminar - Qualitative Methods \n6. Introduction to Research: Quantitative and Qualitative Methods (PhD seminar) \n7. Principles of Regression (PhD course) \n8. Social Science Research Methods (MA course) \n \nResearch assistantships/consultancies: \n \n1. California Department of Education: Modeled impact of several candidate indices designed to measure academic performance of California public schools \n2. Stanford University School of Education: Collaborated with five faculty on statistical methods including factor analysis, longitudinal analysis, and structural equation modeling \n3. Kenji Hakuta, Professor of Education, Stanford University: Employed local regression methods to test the critical period hypothesis for second language acquisition using data from the U.S. Census \n4. Stanford University Department of Medicine: Evaluated Stanford’s innovative sub-specialty system for pediatric residency training \n5. Santa Clara University Department of Psychology: Consulted with faculty on psychometrics of instrument development  \n6. Richard Shavelson, Dean, Stanford University School of Education: Developed and tested alternative assessment methods for (a) evaluating hands-on science curricula, and (b) assessing statistics knowledge of graduate students. \n7. David Rogosa, Associate Professor of Education, Stanford University: Compared structural equation models and mixed-effects models for longitudinal research Assistant Director of Development University of Nebraska Foundation 1995  –  1996  (1 year) Lincoln, Nebraska Area Responsibilities include coordination of all major gift development activities for the UNL College of Business Administration and College of Dentistry, including identification of prospective donors, gift feasibility research, donor calls, major gift solicitation, gift proposal writing, and alumni stewardship. Created major gift summary and tracking software still used by university deans. Assistant Director of Development University of Nebraska Foundation 1995  –  1996  (1 year) Lincoln, Nebraska Area Responsibilities include coordination of all major gift development activities for the UNL College of Business Administration and College of Dentistry, including identification of prospective donors, gift feasibility research, donor calls, major gift solicitation, gift proposal writing, and alumni stewardship. Created major gift summary and tracking software still used by university deans. Assistant Director of Admissions University of Nebraska-Lincoln 1993  –  1995  (2 years) Lincoln, Nebraska Area Responsibilities include recruitment to UNL of prospective students, contact with parents and counselors, maintenance of student admissions data; service as University Residency Specialist; and management of team charged with recruiting in Lincoln (NE) Public Schools. Assistant Director of Admissions University of Nebraska-Lincoln 1993  –  1995  (2 years) Lincoln, Nebraska Area Responsibilities include recruitment to UNL of prospective students, contact with parents and counselors, maintenance of student admissions data; service as University Residency Specialist; and management of team charged with recruiting in Lincoln (NE) Public Schools. Skills SAS Statistical Modeling Statistics Data Mining SPSS Analytics Strategy R Market Research Business Strategy Leadership Research Design Quantitative Research Data Analysis Quantitative Analytics Management Consulting Competitive Intelligence Program Evaluation Proposal Writing Predictive Analytics Analysis Strategic Consulting Survey Design Risk Management Linux Portfolio Management Financial Risk Machine Learning Microsoft Excel Business Analytics Big Data Predictive Modeling Investment Strategies Hedge Funds Structural Equation... Monte Carlo Simulation Statistical Consulting Mathematical Modeling Psychometrics Data Science Statistical Learning Bayesian statistics Risk Analysis Quantitative Analysis Bayesian methods Logistic Regression Management Consulting Research Strategic Planning See 35+     See less Skills  SAS Statistical Modeling Statistics Data Mining SPSS Analytics Strategy R Market Research Business Strategy Leadership Research Design Quantitative Research Data Analysis Quantitative Analytics Management Consulting Competitive Intelligence Program Evaluation Proposal Writing Predictive Analytics Analysis Strategic Consulting Survey Design Risk Management Linux Portfolio Management Financial Risk Machine Learning Microsoft Excel Business Analytics Big Data Predictive Modeling Investment Strategies Hedge Funds Structural Equation... Monte Carlo Simulation Statistical Consulting Mathematical Modeling Psychometrics Data Science Statistical Learning Bayesian statistics Risk Analysis Quantitative Analysis Bayesian methods Logistic Regression Management Consulting Research Strategic Planning See 35+     See less SAS Statistical Modeling Statistics Data Mining SPSS Analytics Strategy R Market Research Business Strategy Leadership Research Design Quantitative Research Data Analysis Quantitative Analytics Management Consulting Competitive Intelligence Program Evaluation Proposal Writing Predictive Analytics Analysis Strategic Consulting Survey Design Risk Management Linux Portfolio Management Financial Risk Machine Learning Microsoft Excel Business Analytics Big Data Predictive Modeling Investment Strategies Hedge Funds Structural Equation... Monte Carlo Simulation Statistical Consulting Mathematical Modeling Psychometrics Data Science Statistical Learning Bayesian statistics Risk Analysis Quantitative Analysis Bayesian methods Logistic Regression Management Consulting Research Strategic Planning See 35+     See less SAS Statistical Modeling Statistics Data Mining SPSS Analytics Strategy R Market Research Business Strategy Leadership Research Design Quantitative Research Data Analysis Quantitative Analytics Management Consulting Competitive Intelligence Program Evaluation Proposal Writing Predictive Analytics Analysis Strategic Consulting Survey Design Risk Management Linux Portfolio Management Financial Risk Machine Learning Microsoft Excel Business Analytics Big Data Predictive Modeling Investment Strategies Hedge Funds Structural Equation... Monte Carlo Simulation Statistical Consulting Mathematical Modeling Psychometrics Data Science Statistical Learning Bayesian statistics Risk Analysis Quantitative Analysis Bayesian methods Logistic Regression Management Consulting Research Strategic Planning See 35+     See less Education Stanford University PhD,  Psychological Studies 1996  – 2000 Dissertation: Bootstrap Strategies for Variance Component Estimation: Analytical and Empirical Results.  \nDissertation Committee: Richard Shavelson, Edward Haertel, Bradley Efron, Kenji Hakuta, and Ewart Thomas.  \nDissertation study established new algorithms to estimate variance components and their standard errors. Study derived mathematical demonstration of bias in bootstrap estimation of variance components, the accuracy of which was demonstrated via Monte Carlo simulation. Study solved problem that had puzzled researchers for over 13 years. Dissertation won both national award (NCME's Brenda Loyd Outstanding Dissertation Award), as well as $20,000 Stanford Gerald Lieberman fellowship. Activities and Societies:  First student in my school to be awarded the 3-year ($20 ,  000/yr) Stanford President's Graduate Fellowship in Science and Engineering.\nReceived \"Outstanding\" teaching ratings in eight basic and advanced statistics courses.\nOne of three Stanford students named to Stanford Trustees' Committees on Research and Graduate Studies.\nInvited speaker for Inaugural Celebration of Stanford President's Graduate Fellowship in Science/Engineering Stanford University M.S.,  Statistics 1996  – 2000 Activities and Societies:  Completed doctoral courses in applied statistics and statistical learning in the course of earning my M.S. under advisor Ingram Olkin. University of Nebraska-Lincoln MA,  Quantitative and Qualitative Methods 1995  – 1996 Thesis: Validity of intercollegiate athletic eligibility standards as predictors of student athlete collegiate success. Invited by Nebraska football coach Tom Osborne to prepare thesis findings for inclusion in Big XII deliberations regarding eligibility of 'partial qualifiers' . Activities and Societies:  Awarded \"High Honors\" in passing Master's Comprehesive Exam. University of Nebraska-Lincoln B.A.,  Mathematics (Minors in English and Psychology) 1990  – 1994 Activities and Societies:  President of 135-member fraternity.\nAwarded Regents Scholarship; Eastman Honorary Mathematics Fellowship; and U.S. Department of Education's Robert C Byrd Fellowship.\nNamed to 13-member senior honorary (Chancellor's Society of Innocents) for outstanding scholarship ,  leadership ,  and service.\nElected 1993 University of Nebraska Homecoming King by student body of 25 ,  000-student campus.\nTrained and managed two teams of 26 student orientation leaders. Stanford University PhD,  Psychological Studies 1996  – 2000 Dissertation: Bootstrap Strategies for Variance Component Estimation: Analytical and Empirical Results.  \nDissertation Committee: Richard Shavelson, Edward Haertel, Bradley Efron, Kenji Hakuta, and Ewart Thomas.  \nDissertation study established new algorithms to estimate variance components and their standard errors. Study derived mathematical demonstration of bias in bootstrap estimation of variance components, the accuracy of which was demonstrated via Monte Carlo simulation. Study solved problem that had puzzled researchers for over 13 years. Dissertation won both national award (NCME's Brenda Loyd Outstanding Dissertation Award), as well as $20,000 Stanford Gerald Lieberman fellowship. Activities and Societies:  First student in my school to be awarded the 3-year ($20 ,  000/yr) Stanford President's Graduate Fellowship in Science and Engineering.\nReceived \"Outstanding\" teaching ratings in eight basic and advanced statistics courses.\nOne of three Stanford students named to Stanford Trustees' Committees on Research and Graduate Studies.\nInvited speaker for Inaugural Celebration of Stanford President's Graduate Fellowship in Science/Engineering Stanford University PhD,  Psychological Studies 1996  – 2000 Dissertation: Bootstrap Strategies for Variance Component Estimation: Analytical and Empirical Results.  \nDissertation Committee: Richard Shavelson, Edward Haertel, Bradley Efron, Kenji Hakuta, and Ewart Thomas.  \nDissertation study established new algorithms to estimate variance components and their standard errors. Study derived mathematical demonstration of bias in bootstrap estimation of variance components, the accuracy of which was demonstrated via Monte Carlo simulation. Study solved problem that had puzzled researchers for over 13 years. Dissertation won both national award (NCME's Brenda Loyd Outstanding Dissertation Award), as well as $20,000 Stanford Gerald Lieberman fellowship. Activities and Societies:  First student in my school to be awarded the 3-year ($20 ,  000/yr) Stanford President's Graduate Fellowship in Science and Engineering.\nReceived \"Outstanding\" teaching ratings in eight basic and advanced statistics courses.\nOne of three Stanford students named to Stanford Trustees' Committees on Research and Graduate Studies.\nInvited speaker for Inaugural Celebration of Stanford President's Graduate Fellowship in Science/Engineering Stanford University PhD,  Psychological Studies 1996  – 2000 Dissertation: Bootstrap Strategies for Variance Component Estimation: Analytical and Empirical Results.  \nDissertation Committee: Richard Shavelson, Edward Haertel, Bradley Efron, Kenji Hakuta, and Ewart Thomas.  \nDissertation study established new algorithms to estimate variance components and their standard errors. Study derived mathematical demonstration of bias in bootstrap estimation of variance components, the accuracy of which was demonstrated via Monte Carlo simulation. Study solved problem that had puzzled researchers for over 13 years. Dissertation won both national award (NCME's Brenda Loyd Outstanding Dissertation Award), as well as $20,000 Stanford Gerald Lieberman fellowship. Activities and Societies:  First student in my school to be awarded the 3-year ($20 ,  000/yr) Stanford President's Graduate Fellowship in Science and Engineering.\nReceived \"Outstanding\" teaching ratings in eight basic and advanced statistics courses.\nOne of three Stanford students named to Stanford Trustees' Committees on Research and Graduate Studies.\nInvited speaker for Inaugural Celebration of Stanford President's Graduate Fellowship in Science/Engineering Stanford University M.S.,  Statistics 1996  – 2000 Activities and Societies:  Completed doctoral courses in applied statistics and statistical learning in the course of earning my M.S. under advisor Ingram Olkin. Stanford University M.S.,  Statistics 1996  – 2000 Activities and Societies:  Completed doctoral courses in applied statistics and statistical learning in the course of earning my M.S. under advisor Ingram Olkin. Stanford University M.S.,  Statistics 1996  – 2000 Activities and Societies:  Completed doctoral courses in applied statistics and statistical learning in the course of earning my M.S. under advisor Ingram Olkin. University of Nebraska-Lincoln MA,  Quantitative and Qualitative Methods 1995  – 1996 Thesis: Validity of intercollegiate athletic eligibility standards as predictors of student athlete collegiate success. Invited by Nebraska football coach Tom Osborne to prepare thesis findings for inclusion in Big XII deliberations regarding eligibility of 'partial qualifiers' . Activities and Societies:  Awarded \"High Honors\" in passing Master's Comprehesive Exam. University of Nebraska-Lincoln MA,  Quantitative and Qualitative Methods 1995  – 1996 Thesis: Validity of intercollegiate athletic eligibility standards as predictors of student athlete collegiate success. Invited by Nebraska football coach Tom Osborne to prepare thesis findings for inclusion in Big XII deliberations regarding eligibility of 'partial qualifiers' . Activities and Societies:  Awarded \"High Honors\" in passing Master's Comprehesive Exam. University of Nebraska-Lincoln MA,  Quantitative and Qualitative Methods 1995  – 1996 Thesis: Validity of intercollegiate athletic eligibility standards as predictors of student athlete collegiate success. Invited by Nebraska football coach Tom Osborne to prepare thesis findings for inclusion in Big XII deliberations regarding eligibility of 'partial qualifiers' . Activities and Societies:  Awarded \"High Honors\" in passing Master's Comprehesive Exam. University of Nebraska-Lincoln B.A.,  Mathematics (Minors in English and Psychology) 1990  – 1994 Activities and Societies:  President of 135-member fraternity.\nAwarded Regents Scholarship; Eastman Honorary Mathematics Fellowship; and U.S. Department of Education's Robert C Byrd Fellowship.\nNamed to 13-member senior honorary (Chancellor's Society of Innocents) for outstanding scholarship ,  leadership ,  and service.\nElected 1993 University of Nebraska Homecoming King by student body of 25 ,  000-student campus.\nTrained and managed two teams of 26 student orientation leaders. University of Nebraska-Lincoln B.A.,  Mathematics (Minors in English and Psychology) 1990  – 1994 Activities and Societies:  President of 135-member fraternity.\nAwarded Regents Scholarship; Eastman Honorary Mathematics Fellowship; and U.S. Department of Education's Robert C Byrd Fellowship.\nNamed to 13-member senior honorary (Chancellor's Society of Innocents) for outstanding scholarship ,  leadership ,  and service.\nElected 1993 University of Nebraska Homecoming King by student body of 25 ,  000-student campus.\nTrained and managed two teams of 26 student orientation leaders. University of Nebraska-Lincoln B.A.,  Mathematics (Minors in English and Psychology) 1990  – 1994 Activities and Societies:  President of 135-member fraternity.\nAwarded Regents Scholarship; Eastman Honorary Mathematics Fellowship; and U.S. Department of Education's Robert C Byrd Fellowship.\nNamed to 13-member senior honorary (Chancellor's Society of Innocents) for outstanding scholarship ,  leadership ,  and service.\nElected 1993 University of Nebraska Homecoming King by student body of 25 ,  000-student campus.\nTrained and managed two teams of 26 student orientation leaders. Honors & Awards Elected Vice-Chair (Chair Elect), Hierarchical Linear Modeling Special Interest Group American Educational Research Association December 2010 Appointed to NRC Expert Standing Committee on Promising Educational Practices National Research Council 2006 Appointed to Editorial Board: New Frontiers in Quantitative Psychology 2006 Appointed to Editorial Board: Educational Measurement - Issues & Practices 2006 Appointed to Editorial Board: Educational Policy Analysis Archives 2009 Awarded Brenda Loyd Outstanding Dissertation National Council of Measurement in Educaiton 2002 Gerald Lieberman Honorary Graduate Fellowship Stanford University 2000 1-year Stanford fellowship awarded for promise as scholar, teacher, and academic community leader Invited Speaker, Inaugural Celebration of the Stanford Graduate Fellowship Stanford University 1998 Stanford President's Graduate Fellowship in Science/Engineering Stanford University 1997 3-year Stanford fellowship awarded for outstanding research potential; first ever awarded to Psychological Studies student Pauline Phillips Honorary Graduate Fellowship Stanford University 1996 1-year Stanford doctoral fellowship  Pass with Honors, Master's Comprehensive Exam University of Nebraska - Lincoln 1996 Regents Scholarship (4-year full tuition scholarship) University of Nebraska - Lincoln 1990 Eastman Honorary Mathematics Scholarship Award (4-year full housing/tuition grant) University of Nebraska - Lincoln 1990 Robert C. Byrd Scholarship U.S. Department of Education 1990 Ameritas Life Insurance Actuarial Science Award (4-year book grant and internship) 1990 Elected to Chancellor's Society of Innocents (13-member academic honorary) University of Nebraska - Lincoln 1993 Selected Visuals Editor, Educational Measurement: Issues and Practice National Council of Measurement in Education 2006 Elected Vice-Chair (Chair Elect), Hierarchical Linear Modeling Special Interest Group American Educational Research Association December 2010 Elected Vice-Chair (Chair Elect), Hierarchical Linear Modeling Special Interest Group American Educational Research Association December 2010 Elected Vice-Chair (Chair Elect), Hierarchical Linear Modeling Special Interest Group American Educational Research Association December 2010 Appointed to NRC Expert Standing Committee on Promising Educational Practices National Research Council 2006 Appointed to NRC Expert Standing Committee on Promising Educational Practices National Research Council 2006 Appointed to NRC Expert Standing Committee on Promising Educational Practices National Research Council 2006 Appointed to Editorial Board: New Frontiers in Quantitative Psychology 2006 Appointed to Editorial Board: New Frontiers in Quantitative Psychology 2006 Appointed to Editorial Board: New Frontiers in Quantitative Psychology 2006 Appointed to Editorial Board: Educational Measurement - Issues & Practices 2006 Appointed to Editorial Board: Educational Measurement - Issues & Practices 2006 Appointed to Editorial Board: Educational Measurement - Issues & Practices 2006 Appointed to Editorial Board: Educational Policy Analysis Archives 2009 Appointed to Editorial Board: Educational Policy Analysis Archives 2009 Appointed to Editorial Board: Educational Policy Analysis Archives 2009 Awarded Brenda Loyd Outstanding Dissertation National Council of Measurement in Educaiton 2002 Awarded Brenda Loyd Outstanding Dissertation National Council of Measurement in Educaiton 2002 Awarded Brenda Loyd Outstanding Dissertation National Council of Measurement in Educaiton 2002 Gerald Lieberman Honorary Graduate Fellowship Stanford University 2000 1-year Stanford fellowship awarded for promise as scholar, teacher, and academic community leader Gerald Lieberman Honorary Graduate Fellowship Stanford University 2000 1-year Stanford fellowship awarded for promise as scholar, teacher, and academic community leader Gerald Lieberman Honorary Graduate Fellowship Stanford University 2000 1-year Stanford fellowship awarded for promise as scholar, teacher, and academic community leader Invited Speaker, Inaugural Celebration of the Stanford Graduate Fellowship Stanford University 1998 Invited Speaker, Inaugural Celebration of the Stanford Graduate Fellowship Stanford University 1998 Invited Speaker, Inaugural Celebration of the Stanford Graduate Fellowship Stanford University 1998 Stanford President's Graduate Fellowship in Science/Engineering Stanford University 1997 3-year Stanford fellowship awarded for outstanding research potential; first ever awarded to Psychological Studies student Stanford President's Graduate Fellowship in Science/Engineering Stanford University 1997 3-year Stanford fellowship awarded for outstanding research potential; first ever awarded to Psychological Studies student Stanford President's Graduate Fellowship in Science/Engineering Stanford University 1997 3-year Stanford fellowship awarded for outstanding research potential; first ever awarded to Psychological Studies student Pauline Phillips Honorary Graduate Fellowship Stanford University 1996 1-year Stanford doctoral fellowship  Pauline Phillips Honorary Graduate Fellowship Stanford University 1996 1-year Stanford doctoral fellowship  Pauline Phillips Honorary Graduate Fellowship Stanford University 1996 1-year Stanford doctoral fellowship  Pass with Honors, Master's Comprehensive Exam University of Nebraska - Lincoln 1996 Pass with Honors, Master's Comprehensive Exam University of Nebraska - Lincoln 1996 Pass with Honors, Master's Comprehensive Exam University of Nebraska - Lincoln 1996 Regents Scholarship (4-year full tuition scholarship) University of Nebraska - Lincoln 1990 Regents Scholarship (4-year full tuition scholarship) University of Nebraska - Lincoln 1990 Regents Scholarship (4-year full tuition scholarship) University of Nebraska - Lincoln 1990 Eastman Honorary Mathematics Scholarship Award (4-year full housing/tuition grant) University of Nebraska - Lincoln 1990 Eastman Honorary Mathematics Scholarship Award (4-year full housing/tuition grant) University of Nebraska - Lincoln 1990 Eastman Honorary Mathematics Scholarship Award (4-year full housing/tuition grant) University of Nebraska - Lincoln 1990 Robert C. Byrd Scholarship U.S. Department of Education 1990 Robert C. Byrd Scholarship U.S. Department of Education 1990 Robert C. Byrd Scholarship U.S. Department of Education 1990 Ameritas Life Insurance Actuarial Science Award (4-year book grant and internship) 1990 Ameritas Life Insurance Actuarial Science Award (4-year book grant and internship) 1990 Ameritas Life Insurance Actuarial Science Award (4-year book grant and internship) 1990 Elected to Chancellor's Society of Innocents (13-member academic honorary) University of Nebraska - Lincoln 1993 Elected to Chancellor's Society of Innocents (13-member academic honorary) University of Nebraska - Lincoln 1993 Elected to Chancellor's Society of Innocents (13-member academic honorary) University of Nebraska - Lincoln 1993 Selected Visuals Editor, Educational Measurement: Issues and Practice National Council of Measurement in Education 2006 Selected Visuals Editor, Educational Measurement: Issues and Practice National Council of Measurement in Education 2006 Selected Visuals Editor, Educational Measurement: Issues and Practice National Council of Measurement in Education 2006 ", "Experience Nomellini-Olivier Professor of Education Stanford University Graduate School of Education Nomellini-Olivier Professor of Education Stanford University Graduate School of Education Nomellini-Olivier Professor of Education Stanford University Graduate School of Education Education Yale University; UC Berkeley, Stanford University Yale University; UC Berkeley, Stanford University Yale University; UC Berkeley, Stanford University Yale University; UC Berkeley, Stanford University ", "Summary Adjunct professor & NBCT specializing in in teacher preparation for the 21st century. Interested in researching accomplished early childhood practices in diverse & high poverty settings. Summary Adjunct professor & NBCT specializing in in teacher preparation for the 21st century. Interested in researching accomplished early childhood practices in diverse & high poverty settings. Adjunct professor & NBCT specializing in in teacher preparation for the 21st century. Interested in researching accomplished early childhood practices in diverse & high poverty settings. Adjunct professor & NBCT specializing in in teacher preparation for the 21st century. Interested in researching accomplished early childhood practices in diverse & high poverty settings. Experience Adjunct Faculty, Department of Foundations of Education Virginia Commonwealth University April 2013  – Present (2 years 5 months) Richmond, Virginia Area Utilize blended learning to develop student understanding of social, cultural, and ideological foundations of education. National Board Certified Teacher Richmond Public Schools 2004  – Present (11 years) Accomplished early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Thought Leaders Circle, (Member) Center for Teaching Quality October 2013  – Present (1 year 11 months) Carrboro, NC Act as catalyst in transforming teaching and learning for the 21st century. Provide insights to inform the Center for Teaching Quality's efforts to connect, ready, and mobilize the teaching profession to create the educational system students deserve. Writer Center for Teaching Quality 2006  – Present (9 years) Coauthor of Teaching 2030: What we must do for our students and our public schools --now and in the future.  \nCoauthor of policy reports on teacher preparation and teacher evaluation.  \nCowriter at the blog The Collaborateurs Head Start Teacher Richmond Public Schools August 2002  – Present (13 years 1 month) Richmond, Virginia Area National Board Certified early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Mentored and trained Head Start staff. Founder rightSTART Solutions August 2008  – Present (7 years 1 month) Richmond, VA System design solutions for education: organic design solutions in applied educational contexts. A project of Mox-eMedia LLC. Member Teacher Leaders Network 2006  – Present (9 years) Strategy & thought leadership Artist Much Too Bright 1995  – Present (20 years) My paintings investigate the intimate relationship between man-made structures and the natural environment. I am fascinated by the way the two types of space affect each other. The Inside Outbuildings series explores how nature pushes back against man's structures, often committing slow violence against the offending structures. Outbuildings are created for entirely functional reasons. Water, bugs, and sunlight decay these buildings over a long period of time. Because they are entirely functional and still useful as they decay, they are often are not \"kept up\" by the people who use them. These paintings show landscapes framed by the buildings in them. They show patterns, colors, and shadows that rest just outside of abstract. I maintain my fidelity to the subject matter while bending the painting’s execution towards abstraction, creating an aesthetically beautiful painting that acknowledges the history of the landscape. Writer New America Foundation April 2013  –  September 2013  (6 months) Washington D.C. Metro Area Consulted on Head Start policy, wrote opinion pieces for Early Ed Watch. Clinical Faculty Level III Virginia Commonwealth University, University 2005  –  June 2012  (7 years) Project Lead: Clinical Faculty Plus (CF+), Recruiting\tand Training Clinical Faculty for High-need and Diverse Schools, VCU Center for Teacher Leadership, 2008 - 2009. Cooperating teacher for pre-service teachers. Led project to revise university supervisor handbook to reflect current pre-service teacher experience. 2005 - 2009 . President, Educational Leadership Doctoral Student Association Virginia Commonwealth University 2010  –  2012  (2 years) Richmond, Virginia Area Project Lead: Curriculum Teacher Leadership Initiative Head Start, Richmond Public Schools 2009  –  2011  (2 years) Designed and implemented collaborative teacher leadership initiative to develop guidance document to 3 year-old teachers in Richmond Public Schools Head Start. Writer/Blogger Pre-K Now August 2008  –  August 2010  (2 years 1 month) I have always felt that stories are an intricate part of how people live and interpret their lives. Having good stories to tell is part of why I became a preschool teacher. I helped to tell the stories of early childhood education for PreK Now from 2008-2010. Curator and designer Chimborazo Elementary, Carver Elementary, Richmond Public Schools' Head Start and National Board January 1998  –  2009  (11 years) Professional Development 2006 Technology January 1998  –  January 2002  (4 years 1 month) Designed and implemented the technology professional development program.  \n2002 Technology Advisor to system-wide curriculum development initiative. Pre-K Teacher Virginia Preschool Initiative, Richmond Public Schools January 1997  –  January 2002  (5 years 1 month) Richmond, Virginia Area Early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Instructor J. Sargent Reynolds Community College 2001  –  2002  (1 year) Technology for Teaching Adjunct Faculty, Department of Foundations of Education Virginia Commonwealth University April 2013  – Present (2 years 5 months) Richmond, Virginia Area Utilize blended learning to develop student understanding of social, cultural, and ideological foundations of education. Adjunct Faculty, Department of Foundations of Education Virginia Commonwealth University April 2013  – Present (2 years 5 months) Richmond, Virginia Area Utilize blended learning to develop student understanding of social, cultural, and ideological foundations of education. National Board Certified Teacher Richmond Public Schools 2004  – Present (11 years) Accomplished early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. National Board Certified Teacher Richmond Public Schools 2004  – Present (11 years) Accomplished early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Thought Leaders Circle, (Member) Center for Teaching Quality October 2013  – Present (1 year 11 months) Carrboro, NC Act as catalyst in transforming teaching and learning for the 21st century. Provide insights to inform the Center for Teaching Quality's efforts to connect, ready, and mobilize the teaching profession to create the educational system students deserve. Thought Leaders Circle, (Member) Center for Teaching Quality October 2013  – Present (1 year 11 months) Carrboro, NC Act as catalyst in transforming teaching and learning for the 21st century. Provide insights to inform the Center for Teaching Quality's efforts to connect, ready, and mobilize the teaching profession to create the educational system students deserve. Writer Center for Teaching Quality 2006  – Present (9 years) Coauthor of Teaching 2030: What we must do for our students and our public schools --now and in the future.  \nCoauthor of policy reports on teacher preparation and teacher evaluation.  \nCowriter at the blog The Collaborateurs Writer Center for Teaching Quality 2006  – Present (9 years) Coauthor of Teaching 2030: What we must do for our students and our public schools --now and in the future.  \nCoauthor of policy reports on teacher preparation and teacher evaluation.  \nCowriter at the blog The Collaborateurs Head Start Teacher Richmond Public Schools August 2002  – Present (13 years 1 month) Richmond, Virginia Area National Board Certified early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Mentored and trained Head Start staff. Head Start Teacher Richmond Public Schools August 2002  – Present (13 years 1 month) Richmond, Virginia Area National Board Certified early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Mentored and trained Head Start staff. Founder rightSTART Solutions August 2008  – Present (7 years 1 month) Richmond, VA System design solutions for education: organic design solutions in applied educational contexts. A project of Mox-eMedia LLC. Founder rightSTART Solutions August 2008  – Present (7 years 1 month) Richmond, VA System design solutions for education: organic design solutions in applied educational contexts. A project of Mox-eMedia LLC. Member Teacher Leaders Network 2006  – Present (9 years) Strategy & thought leadership Member Teacher Leaders Network 2006  – Present (9 years) Strategy & thought leadership Artist Much Too Bright 1995  – Present (20 years) My paintings investigate the intimate relationship between man-made structures and the natural environment. I am fascinated by the way the two types of space affect each other. The Inside Outbuildings series explores how nature pushes back against man's structures, often committing slow violence against the offending structures. Outbuildings are created for entirely functional reasons. Water, bugs, and sunlight decay these buildings over a long period of time. Because they are entirely functional and still useful as they decay, they are often are not \"kept up\" by the people who use them. These paintings show landscapes framed by the buildings in them. They show patterns, colors, and shadows that rest just outside of abstract. I maintain my fidelity to the subject matter while bending the painting’s execution towards abstraction, creating an aesthetically beautiful painting that acknowledges the history of the landscape. Artist Much Too Bright 1995  – Present (20 years) My paintings investigate the intimate relationship between man-made structures and the natural environment. I am fascinated by the way the two types of space affect each other. The Inside Outbuildings series explores how nature pushes back against man's structures, often committing slow violence against the offending structures. Outbuildings are created for entirely functional reasons. Water, bugs, and sunlight decay these buildings over a long period of time. Because they are entirely functional and still useful as they decay, they are often are not \"kept up\" by the people who use them. These paintings show landscapes framed by the buildings in them. They show patterns, colors, and shadows that rest just outside of abstract. I maintain my fidelity to the subject matter while bending the painting’s execution towards abstraction, creating an aesthetically beautiful painting that acknowledges the history of the landscape. Writer New America Foundation April 2013  –  September 2013  (6 months) Washington D.C. Metro Area Consulted on Head Start policy, wrote opinion pieces for Early Ed Watch. Writer New America Foundation April 2013  –  September 2013  (6 months) Washington D.C. Metro Area Consulted on Head Start policy, wrote opinion pieces for Early Ed Watch. Clinical Faculty Level III Virginia Commonwealth University, University 2005  –  June 2012  (7 years) Project Lead: Clinical Faculty Plus (CF+), Recruiting\tand Training Clinical Faculty for High-need and Diverse Schools, VCU Center for Teacher Leadership, 2008 - 2009. Cooperating teacher for pre-service teachers. Led project to revise university supervisor handbook to reflect current pre-service teacher experience. 2005 - 2009 . Clinical Faculty Level III Virginia Commonwealth University, University 2005  –  June 2012  (7 years) Project Lead: Clinical Faculty Plus (CF+), Recruiting\tand Training Clinical Faculty for High-need and Diverse Schools, VCU Center for Teacher Leadership, 2008 - 2009. Cooperating teacher for pre-service teachers. Led project to revise university supervisor handbook to reflect current pre-service teacher experience. 2005 - 2009 . President, Educational Leadership Doctoral Student Association Virginia Commonwealth University 2010  –  2012  (2 years) Richmond, Virginia Area President, Educational Leadership Doctoral Student Association Virginia Commonwealth University 2010  –  2012  (2 years) Richmond, Virginia Area Project Lead: Curriculum Teacher Leadership Initiative Head Start, Richmond Public Schools 2009  –  2011  (2 years) Designed and implemented collaborative teacher leadership initiative to develop guidance document to 3 year-old teachers in Richmond Public Schools Head Start. Project Lead: Curriculum Teacher Leadership Initiative Head Start, Richmond Public Schools 2009  –  2011  (2 years) Designed and implemented collaborative teacher leadership initiative to develop guidance document to 3 year-old teachers in Richmond Public Schools Head Start. Writer/Blogger Pre-K Now August 2008  –  August 2010  (2 years 1 month) I have always felt that stories are an intricate part of how people live and interpret their lives. Having good stories to tell is part of why I became a preschool teacher. I helped to tell the stories of early childhood education for PreK Now from 2008-2010. Writer/Blogger Pre-K Now August 2008  –  August 2010  (2 years 1 month) I have always felt that stories are an intricate part of how people live and interpret their lives. Having good stories to tell is part of why I became a preschool teacher. I helped to tell the stories of early childhood education for PreK Now from 2008-2010. Curator and designer Chimborazo Elementary, Carver Elementary, Richmond Public Schools' Head Start and National Board January 1998  –  2009  (11 years) Curator and designer Chimborazo Elementary, Carver Elementary, Richmond Public Schools' Head Start and National Board January 1998  –  2009  (11 years) Professional Development 2006 Technology January 1998  –  January 2002  (4 years 1 month) Designed and implemented the technology professional development program.  \n2002 Technology Advisor to system-wide curriculum development initiative. Professional Development 2006 Technology January 1998  –  January 2002  (4 years 1 month) Designed and implemented the technology professional development program.  \n2002 Technology Advisor to system-wide curriculum development initiative. Pre-K Teacher Virginia Preschool Initiative, Richmond Public Schools January 1997  –  January 2002  (5 years 1 month) Richmond, Virginia Area Early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Pre-K Teacher Virginia Preschool Initiative, Richmond Public Schools January 1997  –  January 2002  (5 years 1 month) Richmond, Virginia Area Early childhood educator, providing innovative education services to at risk 3 & 4 year old children and their families. Instructor J. Sargent Reynolds Community College 2001  –  2002  (1 year) Technology for Teaching Instructor J. Sargent Reynolds Community College 2001  –  2002  (1 year) Technology for Teaching Languages   Skills Educator Innovator Artist Creative Services Strategic Thinking Education Research Curriculum Design Staff Development Leadership Instructional Design Newsletters Nonprofits Lesson Planning Higher Education Program Evaluation Grant Writing Curriculum Development Writing Educational Technology Educational Leadership Classroom Training E-Learning Mentoring Program Development Instructional Technology Teaching University Teaching Blogging Early Childhood... Leadership Development Literacy Early Intervention Early Childhood Music... Early Childhood Literacy Early Childhood... Teacher Training Tutoring K-12 Distance Learning Education Policy Community Outreach Elementary Education Adult Education Classroom Management Policy Public Speaking See 33+     See less Skills  Educator Innovator Artist Creative Services Strategic Thinking Education Research Curriculum Design Staff Development Leadership Instructional Design Newsletters Nonprofits Lesson Planning Higher Education Program Evaluation Grant Writing Curriculum Development Writing Educational Technology Educational Leadership Classroom Training E-Learning Mentoring Program Development Instructional Technology Teaching University Teaching Blogging Early Childhood... Leadership Development Literacy Early Intervention Early Childhood Music... Early Childhood Literacy Early Childhood... Teacher Training Tutoring K-12 Distance Learning Education Policy Community Outreach Elementary Education Adult Education Classroom Management Policy Public Speaking See 33+     See less Educator Innovator Artist Creative Services Strategic Thinking Education Research Curriculum Design Staff Development Leadership Instructional Design Newsletters Nonprofits Lesson Planning Higher Education Program Evaluation Grant Writing Curriculum Development Writing Educational Technology Educational Leadership Classroom Training E-Learning Mentoring Program Development Instructional Technology Teaching University Teaching Blogging Early Childhood... Leadership Development Literacy Early Intervention Early Childhood Music... Early Childhood Literacy Early Childhood... Teacher Training Tutoring K-12 Distance Learning Education Policy Community Outreach Elementary Education Adult Education Classroom Management Policy Public Speaking See 33+     See less Educator Innovator Artist Creative Services Strategic Thinking Education Research Curriculum Design Staff Development Leadership Instructional Design Newsletters Nonprofits Lesson Planning Higher Education Program Evaluation Grant Writing Curriculum Development Writing Educational Technology Educational Leadership Classroom Training E-Learning Mentoring Program Development Instructional Technology Teaching University Teaching Blogging Early Childhood... Leadership Development Literacy Early Intervention Early Childhood Music... Early Childhood Literacy Early Childhood... Teacher Training Tutoring K-12 Distance Learning Education Policy Community Outreach Elementary Education Adult Education Classroom Management Policy Public Speaking See 33+     See less Education Virginia Commonwealth University Doctor of Philosophy (Ph.D.),  Education 2008  – 2012 Focus in Early Childhood, Teacher Agency, and Leadership. Activities and Societies:  President ,  Doctoral Student Association\nMember ,  Phi Kappa Phi\nAmerican Educational Research Association Virginia Commonwealth University M.Ed.,  Teaching 2006  – 2008 Educational Leadership Virginia Commonwealth University Bachelors of Fine Arts,  Sculpture 1989  – 1995 Virginia Commonwealth University Doctor of Philosophy (Ph.D.),  Education 2008  – 2012 Focus in Early Childhood, Teacher Agency, and Leadership. Activities and Societies:  President ,  Doctoral Student Association\nMember ,  Phi Kappa Phi\nAmerican Educational Research Association Virginia Commonwealth University Doctor of Philosophy (Ph.D.),  Education 2008  – 2012 Focus in Early Childhood, Teacher Agency, and Leadership. Activities and Societies:  President ,  Doctoral Student Association\nMember ,  Phi Kappa Phi\nAmerican Educational Research Association Virginia Commonwealth University Doctor of Philosophy (Ph.D.),  Education 2008  – 2012 Focus in Early Childhood, Teacher Agency, and Leadership. Activities and Societies:  President ,  Doctoral Student Association\nMember ,  Phi Kappa Phi\nAmerican Educational Research Association Virginia Commonwealth University M.Ed.,  Teaching 2006  – 2008 Educational Leadership Virginia Commonwealth University M.Ed.,  Teaching 2006  – 2008 Educational Leadership Virginia Commonwealth University M.Ed.,  Teaching 2006  – 2008 Educational Leadership Virginia Commonwealth University Bachelors of Fine Arts,  Sculpture 1989  – 1995 Virginia Commonwealth University Bachelors of Fine Arts,  Sculpture 1989  – 1995 Virginia Commonwealth University Bachelors of Fine Arts,  Sculpture 1989  – 1995 Honors & Awards Additional Honors & Awards Phi Kappa Phi Honor Society \n2009 Style Magazine's Richmond Top 40 Under 40 \n2009 Seyfarth Family Scholarship \n2010 Seyfarth Family Scholarship \n2004 National Board Certified Teacher Additional Honors & Awards Phi Kappa Phi Honor Society \n2009 Style Magazine's Richmond Top 40 Under 40 \n2009 Seyfarth Family Scholarship \n2010 Seyfarth Family Scholarship \n2004 National Board Certified Teacher Additional Honors & Awards Phi Kappa Phi Honor Society \n2009 Style Magazine's Richmond Top 40 Under 40 \n2009 Seyfarth Family Scholarship \n2010 Seyfarth Family Scholarship \n2004 National Board Certified Teacher Additional Honors & Awards Phi Kappa Phi Honor Society \n2009 Style Magazine's Richmond Top 40 Under 40 \n2009 Seyfarth Family Scholarship \n2010 Seyfarth Family Scholarship \n2004 National Board Certified Teacher ", "Experience Senior Associate Dean and Professor of Education George Mason University 1993  – Present (22 years) Associate Dean and Professor of Education Stanford University August 1980  –  July 1993  (13 years) Professor of Education Stanford University September 1980  –  June 1993  (12 years 10 months) Senior Associate Dean and Professor of Education George Mason University 1993  – Present (22 years) Senior Associate Dean and Professor of Education George Mason University 1993  – Present (22 years) Associate Dean and Professor of Education Stanford University August 1980  –  July 1993  (13 years) Associate Dean and Professor of Education Stanford University August 1980  –  July 1993  (13 years) Professor of Education Stanford University September 1980  –  June 1993  (12 years 10 months) Professor of Education Stanford University September 1980  –  June 1993  (12 years 10 months) Skills Higher Education University Teaching Program Development Motivation Human Development Leadership Human Resources Educational Psychology Organizational... Motivational Systems... Optimal Functioning Assessment of Personal... Staff Development Teaching Student Affairs Curriculum Development Academic Advising College Teaching See 3+     See less Skills  Higher Education University Teaching Program Development Motivation Human Development Leadership Human Resources Educational Psychology Organizational... Motivational Systems... Optimal Functioning Assessment of Personal... Staff Development Teaching Student Affairs Curriculum Development Academic Advising College Teaching See 3+     See less Higher Education University Teaching Program Development Motivation Human Development Leadership Human Resources Educational Psychology Organizational... Motivational Systems... Optimal Functioning Assessment of Personal... Staff Development Teaching Student Affairs Curriculum Development Academic Advising College Teaching See 3+     See less Higher Education University Teaching Program Development Motivation Human Development Leadership Human Resources Educational Psychology Organizational... Motivational Systems... Optimal Functioning Assessment of Personal... Staff Development Teaching Student Affairs Curriculum Development Academic Advising College Teaching See 3+     See less Education University of Minnesota PhD,  Child Psychology 1976  – 1980 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Developmental and Child Psychology 1976  – 1980 University of Minnesota PhD,  Child Psychology 1976  – 1980 University of Minnesota PhD,  Child Psychology 1976  – 1980 University of Minnesota PhD,  Child Psychology 1976  – 1980 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Developmental and Child Psychology 1976  – 1980 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Developmental and Child Psychology 1976  – 1980 University of Minnesota-Twin Cities Doctor of Philosophy (PhD),  Developmental and Child Psychology 1976  – 1980 ", "Summary I am an experimental psycholinguist wandering around in the world of education. I try to apply my research skills to improving schools and education policy, especially for lingusitic minority students. Specialties:Bilingualism and second language acquisition; education policy; social and experimental research; rock climbing. Summary I am an experimental psycholinguist wandering around in the world of education. I try to apply my research skills to improving schools and education policy, especially for lingusitic minority students. Specialties:Bilingualism and second language acquisition; education policy; social and experimental research; rock climbing. I am an experimental psycholinguist wandering around in the world of education. I try to apply my research skills to improving schools and education policy, especially for lingusitic minority students. Specialties:Bilingualism and second language acquisition; education policy; social and experimental research; rock climbing. I am an experimental psycholinguist wandering around in the world of education. I try to apply my research skills to improving schools and education policy, especially for lingusitic minority students. Specialties:Bilingualism and second language acquisition; education policy; social and experimental research; rock climbing. Experience Lee L. Jacks Professor of Education Stanford University 2006  – Present (9 years) Check out my website: www.stanford.edu/~hakuta Founding Dean of Social Sciences, Humanities and Art University of California, Merced 2003  –  2006  (3 years) I was part of the start-up team that founded the first UC campus in the Central Valley of California. Founding Dean, Social Sciences Humanities and Arts UC Merced 2003  –  2006  (3 years) Vida Jacks Professor of Education Stanford University 1989  –  2003  (14 years) Professor of Education University of California, Santa Cruz 1987  –  1989  (2 years) Assistant to Associate Professor of Psychology Yale University 1979  –  1987  (8 years) Lee L. Jacks Professor of Education Stanford University 2006  – Present (9 years) Check out my website: www.stanford.edu/~hakuta Lee L. Jacks Professor of Education Stanford University 2006  – Present (9 years) Check out my website: www.stanford.edu/~hakuta Founding Dean of Social Sciences, Humanities and Art University of California, Merced 2003  –  2006  (3 years) I was part of the start-up team that founded the first UC campus in the Central Valley of California. Founding Dean of Social Sciences, Humanities and Art University of California, Merced 2003  –  2006  (3 years) I was part of the start-up team that founded the first UC campus in the Central Valley of California. Founding Dean, Social Sciences Humanities and Arts UC Merced 2003  –  2006  (3 years) Founding Dean, Social Sciences Humanities and Arts UC Merced 2003  –  2006  (3 years) Vida Jacks Professor of Education Stanford University 1989  –  2003  (14 years) Vida Jacks Professor of Education Stanford University 1989  –  2003  (14 years) Professor of Education University of California, Santa Cruz 1987  –  1989  (2 years) Professor of Education University of California, Santa Cruz 1987  –  1989  (2 years) Assistant to Associate Professor of Psychology Yale University 1979  –  1987  (8 years) Assistant to Associate Professor of Psychology Yale University 1979  –  1987  (8 years) Skills Qualitative Research Research Social Sciences Higher Education Education Policy Grant Writing Research Design Stata Skills  Qualitative Research Research Social Sciences Higher Education Education Policy Grant Writing Research Design Stata Qualitative Research Research Social Sciences Higher Education Education Policy Grant Writing Research Design Stata Qualitative Research Research Social Sciences Higher Education Education Policy Grant Writing Research Design Stata Education Harvard University Ph.D.,  Experimental Psychology 1975  – 1979 Harvard University Ph.D.,  Experimental Psychology 1975  – 1979 Harvard University Ph.D.,  Experimental Psychology 1975  – 1979 Harvard University Ph.D.,  Experimental Psychology 1975  – 1979 "]}