{"position": "Research Coordinator", "company": "Stanford University", "profiles": ["Experience Clinical Research Coordinator Stanford University October 2001  – Present (13 years 11 months) Clinical Research Coordinator Stanford University October 2001  – Present (13 years 11 months) Clinical Research Coordinator Stanford University October 2001  – Present (13 years 11 months) Skills IRB Skills  IRB IRB IRB Education Chung Li *CYCU\", Taiwan San Francisco State University Chung Li *CYCU\", Taiwan Chung Li *CYCU\", Taiwan Chung Li *CYCU\", Taiwan San Francisco State University San Francisco State University San Francisco State University ", "Summary The core of my scholarship experience revolves around the understanding of local knowledge, perceptions and responses to crises in the 21st Century. The Ph.D. dissertation demonstrates that the study of cognitive and symbolic aspects of weather and climate is as important as the study of responses to specific weather events or conditions. What people know about weather and climate conditions (the categorical knowledge that help them describe weather and climate) and what people feel (the knowledge based on senses and moral order that help people comprehend weather and climate) both evoke strong responses. Moreover, values and beliefs about spirituality, nature, morality, work, sociality, and responsibility, linked to experience-based ecological and economic knowledge, appear to be the main ingredients in people's responses to any type of crises. Knowledge, perceptions and responses to crises then, are inseparable domains; and the understanding of one should include the analysis of the others. Summary The core of my scholarship experience revolves around the understanding of local knowledge, perceptions and responses to crises in the 21st Century. The Ph.D. dissertation demonstrates that the study of cognitive and symbolic aspects of weather and climate is as important as the study of responses to specific weather events or conditions. What people know about weather and climate conditions (the categorical knowledge that help them describe weather and climate) and what people feel (the knowledge based on senses and moral order that help people comprehend weather and climate) both evoke strong responses. Moreover, values and beliefs about spirituality, nature, morality, work, sociality, and responsibility, linked to experience-based ecological and economic knowledge, appear to be the main ingredients in people's responses to any type of crises. Knowledge, perceptions and responses to crises then, are inseparable domains; and the understanding of one should include the analysis of the others. The core of my scholarship experience revolves around the understanding of local knowledge, perceptions and responses to crises in the 21st Century. The Ph.D. dissertation demonstrates that the study of cognitive and symbolic aspects of weather and climate is as important as the study of responses to specific weather events or conditions. What people know about weather and climate conditions (the categorical knowledge that help them describe weather and climate) and what people feel (the knowledge based on senses and moral order that help people comprehend weather and climate) both evoke strong responses. Moreover, values and beliefs about spirituality, nature, morality, work, sociality, and responsibility, linked to experience-based ecological and economic knowledge, appear to be the main ingredients in people's responses to any type of crises. Knowledge, perceptions and responses to crises then, are inseparable domains; and the understanding of one should include the analysis of the others. The core of my scholarship experience revolves around the understanding of local knowledge, perceptions and responses to crises in the 21st Century. The Ph.D. dissertation demonstrates that the study of cognitive and symbolic aspects of weather and climate is as important as the study of responses to specific weather events or conditions. What people know about weather and climate conditions (the categorical knowledge that help them describe weather and climate) and what people feel (the knowledge based on senses and moral order that help people comprehend weather and climate) both evoke strong responses. Moreover, values and beliefs about spirituality, nature, morality, work, sociality, and responsibility, linked to experience-based ecological and economic knowledge, appear to be the main ingredients in people's responses to any type of crises. Knowledge, perceptions and responses to crises then, are inseparable domains; and the understanding of one should include the analysis of the others. Experience Clinical Research Coordinator Stanford University School of Medicine April 2015  – Present (5 months) Stanford Center for Clinical Research (SCCR) In this position, as a member of the Stanford Center for Clinical Research (SCCR), I work across multiple therapeutic areas and/or Divisions and Principal Investigators, depending on the studies available at a given time. In general, I am responsible for the overall management and implementation of clinical research protocols.  Clinical Research Coordinator Stanford University School of Medicine September 2014  –  April 2015  (8 months) March of Dimes Prematurity Research Center As a Clinical Research Coordinator (CRC) I am responsible for the overall management and implementation of multiple clinical research protocols in assuring efficiency and regulatory compliance. I support clinical research studies with a focus on preterm birth, including epidemiological and investigative work in support of clinical research and biomedical research focusing on “bench to bedside” technology. The primary population I work with is pregnant women. Data Consultant Lucile Packard Foundation for Children's Health September 2012  –  August 2014  (2 years) San Francisco Bay Area My goal was to assist the kidsdata.org team in ensuring the quality, rigor and comprehensiveness of data provided on the website and through related data and information products. Research Assistant Stanford University June 2012  –  May 2013  (1 year) San Francisco Bay Area My primary responsibilities were to conduct necessary literature reviews, to coordinate stakeholder interviews (patients and providers), to assist with IRB protocol development and communications, and to assist with data management, data presentation, and preparation of manuscripts. I reported directly to Dr. Lee M. Sanders. Quality Assurance Analyst Telenav May 2012  –  June 2012  (2 months) Sunnyvale, CA As a quality assurance analyst at a software firm I tested navigational programs to make sure they were reliable, fully functional, and user-friendly. I inspected multiple lines of code to make sure they were entirely error-free. As analyst I also looked for weaknesses in the program, such as an unappealing interface or a slow loading speed. I explained my findings to technicians so the correct tweaks could be made. Once the program was completed, I reviewed it once again before it was released to the public. Ph.D. University of Kent September 2007  –  April 2012  (4 years 8 months) By extending ethnobiological and ethnographic methods to the study of climate variation, my investigation among Kenyah Badeng in the village of Data Kakus, Sarawak, East Malaysia, aimed to understand how traditional knowledge of weather and climate influences individual and collective decisions concerning agriculture and other economic activities. Bilingual Ads Quality Rater Google December 2006  –  July 2007  (8 months) The job involved analyzing and providing feedback on text, web pages, images and other types of information for Google, using online tools and Google guidelines on how to choose a rating for a result. The position required in-depth, current knowledge of web culture and media, the ability to deal with a broad range of interests and topics, excellent communication skills and web analytic capabilities. Data Collector Stanford University November 2006  –  July 2007  (9 months) Stanford, California In 2006, I joined a multi-disciplinary team for a two-year community based evaluation of after school team sports compared with health education for weight control in overweight children. This job required the ability to follow research protocols, excellent communication and interpersonal skills, and flexibility to work non/standard hours including early mornings, evenings and weekends. Laboratory Technician USDA August 2005  –  June 2006  (11 months) Reno, Nevada Area As Laboratory Technician, I was responsible for data collection in the field and the laboratory. This work involved setting up, collecting, and gathering physiological data from remote field sites. I processed samples from the field and prepared them for chemical analysis. I was also responsible for entering and organizing data and its general maintenance. Then, I developed strong decision-making skills and the ability to work with accuracy in a fast paced work environment. Research Assistant University of Nevada Reno August 2003  –  June 2005  (1 year 11 months) Reno, Nevada Area During my Master's degree at the University of Nevada, Reno, I worked for two years in the Basque Library Studies. This work concerned the search for, translation, scanning, and indexing of articles and documents related to Basque topics. The goal was to place on the Internet 300,000 summaries and/or full texts. Then, I acquired experience in library databases, international catalogues, and administrative support. One of my responsibilities was to establish and maintain communication with scholars, students, and librarians from many different countries. I also developed administrative experience in resource management and bookkeeping through the incorporation of new materials in the collection and control of the main catalogue. Clinical Research Coordinator Stanford University School of Medicine April 2015  – Present (5 months) Stanford Center for Clinical Research (SCCR) In this position, as a member of the Stanford Center for Clinical Research (SCCR), I work across multiple therapeutic areas and/or Divisions and Principal Investigators, depending on the studies available at a given time. In general, I am responsible for the overall management and implementation of clinical research protocols.  Clinical Research Coordinator Stanford University School of Medicine April 2015  – Present (5 months) Stanford Center for Clinical Research (SCCR) In this position, as a member of the Stanford Center for Clinical Research (SCCR), I work across multiple therapeutic areas and/or Divisions and Principal Investigators, depending on the studies available at a given time. In general, I am responsible for the overall management and implementation of clinical research protocols.  Clinical Research Coordinator Stanford University School of Medicine September 2014  –  April 2015  (8 months) March of Dimes Prematurity Research Center As a Clinical Research Coordinator (CRC) I am responsible for the overall management and implementation of multiple clinical research protocols in assuring efficiency and regulatory compliance. I support clinical research studies with a focus on preterm birth, including epidemiological and investigative work in support of clinical research and biomedical research focusing on “bench to bedside” technology. The primary population I work with is pregnant women. Clinical Research Coordinator Stanford University School of Medicine September 2014  –  April 2015  (8 months) March of Dimes Prematurity Research Center As a Clinical Research Coordinator (CRC) I am responsible for the overall management and implementation of multiple clinical research protocols in assuring efficiency and regulatory compliance. I support clinical research studies with a focus on preterm birth, including epidemiological and investigative work in support of clinical research and biomedical research focusing on “bench to bedside” technology. The primary population I work with is pregnant women. Data Consultant Lucile Packard Foundation for Children's Health September 2012  –  August 2014  (2 years) San Francisco Bay Area My goal was to assist the kidsdata.org team in ensuring the quality, rigor and comprehensiveness of data provided on the website and through related data and information products. Data Consultant Lucile Packard Foundation for Children's Health September 2012  –  August 2014  (2 years) San Francisco Bay Area My goal was to assist the kidsdata.org team in ensuring the quality, rigor and comprehensiveness of data provided on the website and through related data and information products. Research Assistant Stanford University June 2012  –  May 2013  (1 year) San Francisco Bay Area My primary responsibilities were to conduct necessary literature reviews, to coordinate stakeholder interviews (patients and providers), to assist with IRB protocol development and communications, and to assist with data management, data presentation, and preparation of manuscripts. I reported directly to Dr. Lee M. Sanders. Research Assistant Stanford University June 2012  –  May 2013  (1 year) San Francisco Bay Area My primary responsibilities were to conduct necessary literature reviews, to coordinate stakeholder interviews (patients and providers), to assist with IRB protocol development and communications, and to assist with data management, data presentation, and preparation of manuscripts. I reported directly to Dr. Lee M. Sanders. Quality Assurance Analyst Telenav May 2012  –  June 2012  (2 months) Sunnyvale, CA As a quality assurance analyst at a software firm I tested navigational programs to make sure they were reliable, fully functional, and user-friendly. I inspected multiple lines of code to make sure they were entirely error-free. As analyst I also looked for weaknesses in the program, such as an unappealing interface or a slow loading speed. I explained my findings to technicians so the correct tweaks could be made. Once the program was completed, I reviewed it once again before it was released to the public. Quality Assurance Analyst Telenav May 2012  –  June 2012  (2 months) Sunnyvale, CA As a quality assurance analyst at a software firm I tested navigational programs to make sure they were reliable, fully functional, and user-friendly. I inspected multiple lines of code to make sure they were entirely error-free. As analyst I also looked for weaknesses in the program, such as an unappealing interface or a slow loading speed. I explained my findings to technicians so the correct tweaks could be made. Once the program was completed, I reviewed it once again before it was released to the public. Ph.D. University of Kent September 2007  –  April 2012  (4 years 8 months) By extending ethnobiological and ethnographic methods to the study of climate variation, my investigation among Kenyah Badeng in the village of Data Kakus, Sarawak, East Malaysia, aimed to understand how traditional knowledge of weather and climate influences individual and collective decisions concerning agriculture and other economic activities. Ph.D. University of Kent September 2007  –  April 2012  (4 years 8 months) By extending ethnobiological and ethnographic methods to the study of climate variation, my investigation among Kenyah Badeng in the village of Data Kakus, Sarawak, East Malaysia, aimed to understand how traditional knowledge of weather and climate influences individual and collective decisions concerning agriculture and other economic activities. Bilingual Ads Quality Rater Google December 2006  –  July 2007  (8 months) The job involved analyzing and providing feedback on text, web pages, images and other types of information for Google, using online tools and Google guidelines on how to choose a rating for a result. The position required in-depth, current knowledge of web culture and media, the ability to deal with a broad range of interests and topics, excellent communication skills and web analytic capabilities. Bilingual Ads Quality Rater Google December 2006  –  July 2007  (8 months) The job involved analyzing and providing feedback on text, web pages, images and other types of information for Google, using online tools and Google guidelines on how to choose a rating for a result. The position required in-depth, current knowledge of web culture and media, the ability to deal with a broad range of interests and topics, excellent communication skills and web analytic capabilities. Data Collector Stanford University November 2006  –  July 2007  (9 months) Stanford, California In 2006, I joined a multi-disciplinary team for a two-year community based evaluation of after school team sports compared with health education for weight control in overweight children. This job required the ability to follow research protocols, excellent communication and interpersonal skills, and flexibility to work non/standard hours including early mornings, evenings and weekends. Data Collector Stanford University November 2006  –  July 2007  (9 months) Stanford, California In 2006, I joined a multi-disciplinary team for a two-year community based evaluation of after school team sports compared with health education for weight control in overweight children. This job required the ability to follow research protocols, excellent communication and interpersonal skills, and flexibility to work non/standard hours including early mornings, evenings and weekends. Laboratory Technician USDA August 2005  –  June 2006  (11 months) Reno, Nevada Area As Laboratory Technician, I was responsible for data collection in the field and the laboratory. This work involved setting up, collecting, and gathering physiological data from remote field sites. I processed samples from the field and prepared them for chemical analysis. I was also responsible for entering and organizing data and its general maintenance. Then, I developed strong decision-making skills and the ability to work with accuracy in a fast paced work environment. Laboratory Technician USDA August 2005  –  June 2006  (11 months) Reno, Nevada Area As Laboratory Technician, I was responsible for data collection in the field and the laboratory. This work involved setting up, collecting, and gathering physiological data from remote field sites. I processed samples from the field and prepared them for chemical analysis. I was also responsible for entering and organizing data and its general maintenance. Then, I developed strong decision-making skills and the ability to work with accuracy in a fast paced work environment. Research Assistant University of Nevada Reno August 2003  –  June 2005  (1 year 11 months) Reno, Nevada Area During my Master's degree at the University of Nevada, Reno, I worked for two years in the Basque Library Studies. This work concerned the search for, translation, scanning, and indexing of articles and documents related to Basque topics. The goal was to place on the Internet 300,000 summaries and/or full texts. Then, I acquired experience in library databases, international catalogues, and administrative support. One of my responsibilities was to establish and maintain communication with scholars, students, and librarians from many different countries. I also developed administrative experience in resource management and bookkeeping through the incorporation of new materials in the collection and control of the main catalogue. Research Assistant University of Nevada Reno August 2003  –  June 2005  (1 year 11 months) Reno, Nevada Area During my Master's degree at the University of Nevada, Reno, I worked for two years in the Basque Library Studies. This work concerned the search for, translation, scanning, and indexing of articles and documents related to Basque topics. The goal was to place on the Internet 300,000 summaries and/or full texts. Then, I acquired experience in library databases, international catalogues, and administrative support. One of my responsibilities was to establish and maintain communication with scholars, students, and librarians from many different countries. I also developed administrative experience in resource management and bookkeeping through the incorporation of new materials in the collection and control of the main catalogue. Languages English Full professional proficiency Spanish Native or bilingual proficiency Basque Native or bilingual proficiency Kenyah Badeng Professional working proficiency Malay Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Basque Native or bilingual proficiency Kenyah Badeng Professional working proficiency Malay Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Basque Native or bilingual proficiency Kenyah Badeng Professional working proficiency Malay Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Qualitative Research Traditional Knowledge Local responses to... Kenyah Badeng... Sarawak, East Malaysia... Social impacts of El... Rice farmers'... Research Program Management Anthropology Ethnography Data Analysis Higher Education University Teaching Analysis Skills  Qualitative Research Traditional Knowledge Local responses to... Kenyah Badeng... Sarawak, East Malaysia... Social impacts of El... Rice farmers'... Research Program Management Anthropology Ethnography Data Analysis Higher Education University Teaching Analysis Qualitative Research Traditional Knowledge Local responses to... Kenyah Badeng... Sarawak, East Malaysia... Social impacts of El... Rice farmers'... Research Program Management Anthropology Ethnography Data Analysis Higher Education University Teaching Analysis Qualitative Research Traditional Knowledge Local responses to... Kenyah Badeng... Sarawak, East Malaysia... Social impacts of El... Rice farmers'... Research Program Management Anthropology Ethnography Data Analysis Higher Education University Teaching Analysis Education University of Kent, Canterbury Doctor of Philosophy (Ph.D.),  Anthropology 2007  – 2012 Activities and Societies:  Royal Geographical Society (with IBG).\nAmerican Meteorological Society. University of Nevada-Reno Master's degree,  Anthropology 2003  – 2006 Activities and Societies:  American Anthropological Association.\nNevada Wilderness.\nAmnesty International. Universidad del País Vasco/Euskal Herriko Unibertsitatea Bachelor's degree,  Anthropology 1999  – 2001 Activities and Societies:  Ankulegi Anthropological Association.\nFieldwork research conducted in Polaciones ,  Spain. Identity and cultural adaptation to high altitude areas. Universidad de Deusto Bachelor's degree,  Social Education 1998  – 2001 Activities and Societies:  EDEX Foundation.\nResearch training conducted in the Bizitegi Rekalde Center.\nHirugarren Mundua ta Bakea NGO.\nGalduezinak Mendi Taldea. University of Kent, Canterbury Doctor of Philosophy (Ph.D.),  Anthropology 2007  – 2012 Activities and Societies:  Royal Geographical Society (with IBG).\nAmerican Meteorological Society. University of Kent, Canterbury Doctor of Philosophy (Ph.D.),  Anthropology 2007  – 2012 Activities and Societies:  Royal Geographical Society (with IBG).\nAmerican Meteorological Society. University of Kent, Canterbury Doctor of Philosophy (Ph.D.),  Anthropology 2007  – 2012 Activities and Societies:  Royal Geographical Society (with IBG).\nAmerican Meteorological Society. University of Nevada-Reno Master's degree,  Anthropology 2003  – 2006 Activities and Societies:  American Anthropological Association.\nNevada Wilderness.\nAmnesty International. University of Nevada-Reno Master's degree,  Anthropology 2003  – 2006 Activities and Societies:  American Anthropological Association.\nNevada Wilderness.\nAmnesty International. University of Nevada-Reno Master's degree,  Anthropology 2003  – 2006 Activities and Societies:  American Anthropological Association.\nNevada Wilderness.\nAmnesty International. Universidad del País Vasco/Euskal Herriko Unibertsitatea Bachelor's degree,  Anthropology 1999  – 2001 Activities and Societies:  Ankulegi Anthropological Association.\nFieldwork research conducted in Polaciones ,  Spain. Identity and cultural adaptation to high altitude areas. Universidad del País Vasco/Euskal Herriko Unibertsitatea Bachelor's degree,  Anthropology 1999  – 2001 Activities and Societies:  Ankulegi Anthropological Association.\nFieldwork research conducted in Polaciones ,  Spain. Identity and cultural adaptation to high altitude areas. Universidad del País Vasco/Euskal Herriko Unibertsitatea Bachelor's degree,  Anthropology 1999  – 2001 Activities and Societies:  Ankulegi Anthropological Association.\nFieldwork research conducted in Polaciones ,  Spain. Identity and cultural adaptation to high altitude areas. Universidad de Deusto Bachelor's degree,  Social Education 1998  – 2001 Activities and Societies:  EDEX Foundation.\nResearch training conducted in the Bizitegi Rekalde Center.\nHirugarren Mundua ta Bakea NGO.\nGalduezinak Mendi Taldea. Universidad de Deusto Bachelor's degree,  Social Education 1998  – 2001 Activities and Societies:  EDEX Foundation.\nResearch training conducted in the Bizitegi Rekalde Center.\nHirugarren Mundua ta Bakea NGO.\nGalduezinak Mendi Taldea. Universidad de Deusto Bachelor's degree,  Social Education 1998  – 2001 Activities and Societies:  EDEX Foundation.\nResearch training conducted in the Bizitegi Rekalde Center.\nHirugarren Mundua ta Bakea NGO.\nGalduezinak Mendi Taldea. ", "Summary I have over 5 years of experience in project management, writing and editing, operations management, human resources, Internet research, and social media and marketing. I have a diverse background that enables me to adjust quickly and smoothly to change, work independently and with a team, innovate and maintain, and creatively solve any problem or task that comes my way. Summary I have over 5 years of experience in project management, writing and editing, operations management, human resources, Internet research, and social media and marketing. I have a diverse background that enables me to adjust quickly and smoothly to change, work independently and with a team, innovate and maintain, and creatively solve any problem or task that comes my way. I have over 5 years of experience in project management, writing and editing, operations management, human resources, Internet research, and social media and marketing. I have a diverse background that enables me to adjust quickly and smoothly to change, work independently and with a team, innovate and maintain, and creatively solve any problem or task that comes my way. I have over 5 years of experience in project management, writing and editing, operations management, human resources, Internet research, and social media and marketing. I have a diverse background that enables me to adjust quickly and smoothly to change, work independently and with a team, innovate and maintain, and creatively solve any problem or task that comes my way. Experience Psychology Research Coordinator Stanford University December 2014  – Present (9 months) Psychology Research Coordinator Stanford University December 2014  – Present (9 months) Manager of Operations JRP Group January 2014  –  August 2014  (8 months) Greater Denver Area • Executive assistant to the president. Additionally assist 5 executive recruiters. \n• Implement and manage all aspects of daily company wide operations including billing,  \nvendor relations, maintenance of office equipment and supplies, and facility management. \n• Resolve all technology related issues. \n• Implement hiring process of new employees including screening resumes,  \ninterviewing, checking references and backgrounds, and administering and interpreting  \npre-employment assessments. \n• Execute all HR duties including the entire process for incoming and exiting  \nemployees, training protocol, employee incentives and benefits, and continuing education. \n• Develop and implement website content and marketing strategies using graphic design,  \nsearch engine optimization, LinkedIn, Facebook, Twitter, print and email marketing, and through  \ncollaboration with a PR firm.  \n• Internet research for potential candidates, clients, and vendors. \n• Complex database management. \n• Track metrics for company, recruiters, database, website, and job boards. \n• Project management and additional administrative duties. Assistant Property Manager Carmel Partners March 2013  –  December 2013  (10 months) Greater Denver Area • Executive assistant to the Property Manager. \n• Provided superior customer service through consistent communication with all incoming and  \ncurrent tenants, realtors, vendors, owners, contractors, and engineers, helping to troubleshoot  \nconstantly evolving problems and find quick solutions. \n• Aided in the management of day-to-day class A building operations, including management of  \njanitorial service, security, and maintenance of all building systems and structures. \n• Project Management. \n• Managed complex system and database for all building parking and key cards. \n• Worked with Property Manager to coordinate tenant finish construction and building  \nimprovements. \n• Assisted in facilitating Lease renewals and new lease negotiations and signings. \n• Worked with a team to assemble all information necessary for the due diligence  \nprocess central to the sale of the building. Fundraising and Grant Manager Keep it in Colorado .net November 2012  –  February 2013  (4 months) Lakewood, CO • Managed efforts to raise funds supporting grant for local businesses and non-profits.  \n• Wrote grant and facilitated application and decision making processes to determine  \ngrant recipients. Community Support Team, PR, Company Culture, Writing and Project Management Clean Program June 2011  –  July 2012  (1 year 2 months) Virtual • Consistently worked with customers via phone, email, online chat, and text to provide  \nhealth coaching and world-class customer support.  \n• Developed comprehensive training guide and system for future employees. \n• Worked with the CEO and a team to enhance company culture by creating company crest \nand core values. Additionally, facilitated team building discussions and weekly team challenges. \n• Established and maintained company partnership with a non-profit. \n• Wrote and edited content for new product manual, website, and blog. \n• Managed Social Media including Facebook and Twitter. \n• Researched and presented findings on potential manufacturers of future products. Instructor of Record The Universty of Georgia August 2009  –  May 2011  (1 year 10 months) Athens, GA Introduction to Judaism, Christianity, and Islam. \n• Researched, planned, and facilitated all aspects of a college level course. Manager The Loft Art Supply Store March 2008  –  March 2009  (1 year 1 month) Athens, GA Was promoted to manager after working only three months at entry level \n• Recruited, hired, trained, and supervised five employees and proceeding manager.  \n• Managed all aspects of the art supply store including inventory, cash register,  \nCommunity engagement, marketing, and administrative duties. Psychology Research Coordinator Stanford University December 2014  – Present (9 months) Psychology Research Coordinator Stanford University December 2014  – Present (9 months) Psychology Research Coordinator Stanford University December 2014  – Present (9 months) Psychology Research Coordinator Stanford University December 2014  – Present (9 months) Manager of Operations JRP Group January 2014  –  August 2014  (8 months) Greater Denver Area • Executive assistant to the president. Additionally assist 5 executive recruiters. \n• Implement and manage all aspects of daily company wide operations including billing,  \nvendor relations, maintenance of office equipment and supplies, and facility management. \n• Resolve all technology related issues. \n• Implement hiring process of new employees including screening resumes,  \ninterviewing, checking references and backgrounds, and administering and interpreting  \npre-employment assessments. \n• Execute all HR duties including the entire process for incoming and exiting  \nemployees, training protocol, employee incentives and benefits, and continuing education. \n• Develop and implement website content and marketing strategies using graphic design,  \nsearch engine optimization, LinkedIn, Facebook, Twitter, print and email marketing, and through  \ncollaboration with a PR firm.  \n• Internet research for potential candidates, clients, and vendors. \n• Complex database management. \n• Track metrics for company, recruiters, database, website, and job boards. \n• Project management and additional administrative duties. Manager of Operations JRP Group January 2014  –  August 2014  (8 months) Greater Denver Area • Executive assistant to the president. Additionally assist 5 executive recruiters. \n• Implement and manage all aspects of daily company wide operations including billing,  \nvendor relations, maintenance of office equipment and supplies, and facility management. \n• Resolve all technology related issues. \n• Implement hiring process of new employees including screening resumes,  \ninterviewing, checking references and backgrounds, and administering and interpreting  \npre-employment assessments. \n• Execute all HR duties including the entire process for incoming and exiting  \nemployees, training protocol, employee incentives and benefits, and continuing education. \n• Develop and implement website content and marketing strategies using graphic design,  \nsearch engine optimization, LinkedIn, Facebook, Twitter, print and email marketing, and through  \ncollaboration with a PR firm.  \n• Internet research for potential candidates, clients, and vendors. \n• Complex database management. \n• Track metrics for company, recruiters, database, website, and job boards. \n• Project management and additional administrative duties. Assistant Property Manager Carmel Partners March 2013  –  December 2013  (10 months) Greater Denver Area • Executive assistant to the Property Manager. \n• Provided superior customer service through consistent communication with all incoming and  \ncurrent tenants, realtors, vendors, owners, contractors, and engineers, helping to troubleshoot  \nconstantly evolving problems and find quick solutions. \n• Aided in the management of day-to-day class A building operations, including management of  \njanitorial service, security, and maintenance of all building systems and structures. \n• Project Management. \n• Managed complex system and database for all building parking and key cards. \n• Worked with Property Manager to coordinate tenant finish construction and building  \nimprovements. \n• Assisted in facilitating Lease renewals and new lease negotiations and signings. \n• Worked with a team to assemble all information necessary for the due diligence  \nprocess central to the sale of the building. Assistant Property Manager Carmel Partners March 2013  –  December 2013  (10 months) Greater Denver Area • Executive assistant to the Property Manager. \n• Provided superior customer service through consistent communication with all incoming and  \ncurrent tenants, realtors, vendors, owners, contractors, and engineers, helping to troubleshoot  \nconstantly evolving problems and find quick solutions. \n• Aided in the management of day-to-day class A building operations, including management of  \njanitorial service, security, and maintenance of all building systems and structures. \n• Project Management. \n• Managed complex system and database for all building parking and key cards. \n• Worked with Property Manager to coordinate tenant finish construction and building  \nimprovements. \n• Assisted in facilitating Lease renewals and new lease negotiations and signings. \n• Worked with a team to assemble all information necessary for the due diligence  \nprocess central to the sale of the building. Fundraising and Grant Manager Keep it in Colorado .net November 2012  –  February 2013  (4 months) Lakewood, CO • Managed efforts to raise funds supporting grant for local businesses and non-profits.  \n• Wrote grant and facilitated application and decision making processes to determine  \ngrant recipients. Fundraising and Grant Manager Keep it in Colorado .net November 2012  –  February 2013  (4 months) Lakewood, CO • Managed efforts to raise funds supporting grant for local businesses and non-profits.  \n• Wrote grant and facilitated application and decision making processes to determine  \ngrant recipients. Community Support Team, PR, Company Culture, Writing and Project Management Clean Program June 2011  –  July 2012  (1 year 2 months) Virtual • Consistently worked with customers via phone, email, online chat, and text to provide  \nhealth coaching and world-class customer support.  \n• Developed comprehensive training guide and system for future employees. \n• Worked with the CEO and a team to enhance company culture by creating company crest \nand core values. Additionally, facilitated team building discussions and weekly team challenges. \n• Established and maintained company partnership with a non-profit. \n• Wrote and edited content for new product manual, website, and blog. \n• Managed Social Media including Facebook and Twitter. \n• Researched and presented findings on potential manufacturers of future products. Community Support Team, PR, Company Culture, Writing and Project Management Clean Program June 2011  –  July 2012  (1 year 2 months) Virtual • Consistently worked with customers via phone, email, online chat, and text to provide  \nhealth coaching and world-class customer support.  \n• Developed comprehensive training guide and system for future employees. \n• Worked with the CEO and a team to enhance company culture by creating company crest \nand core values. Additionally, facilitated team building discussions and weekly team challenges. \n• Established and maintained company partnership with a non-profit. \n• Wrote and edited content for new product manual, website, and blog. \n• Managed Social Media including Facebook and Twitter. \n• Researched and presented findings on potential manufacturers of future products. Instructor of Record The Universty of Georgia August 2009  –  May 2011  (1 year 10 months) Athens, GA Introduction to Judaism, Christianity, and Islam. \n• Researched, planned, and facilitated all aspects of a college level course. Instructor of Record The Universty of Georgia August 2009  –  May 2011  (1 year 10 months) Athens, GA Introduction to Judaism, Christianity, and Islam. \n• Researched, planned, and facilitated all aspects of a college level course. Manager The Loft Art Supply Store March 2008  –  March 2009  (1 year 1 month) Athens, GA Was promoted to manager after working only three months at entry level \n• Recruited, hired, trained, and supervised five employees and proceeding manager.  \n• Managed all aspects of the art supply store including inventory, cash register,  \nCommunity engagement, marketing, and administrative duties. Manager The Loft Art Supply Store March 2008  –  March 2009  (1 year 1 month) Athens, GA Was promoted to manager after working only three months at entry level \n• Recruited, hired, trained, and supervised five employees and proceeding manager.  \n• Managed all aspects of the art supply store including inventory, cash register,  \nCommunity engagement, marketing, and administrative duties. Languages Some French Some French Some French Skills Public Speaking Social Media Social Networking Community Outreach Research Grant Writing Facebook Nonprofits Microsoft Office iWork PCR QuickBooks Outlook Mac PC LinkedIn LinkedIn Recruiter Writing Editing Creative Problem Solving Project Management Human Resources Organization Training Operations Management Supervising Executive... Aperture Twitter Google+ Photoshop Pinterest See 17+     See less Skills  Public Speaking Social Media Social Networking Community Outreach Research Grant Writing Facebook Nonprofits Microsoft Office iWork PCR QuickBooks Outlook Mac PC LinkedIn LinkedIn Recruiter Writing Editing Creative Problem Solving Project Management Human Resources Organization Training Operations Management Supervising Executive... Aperture Twitter Google+ Photoshop Pinterest See 17+     See less Public Speaking Social Media Social Networking Community Outreach Research Grant Writing Facebook Nonprofits Microsoft Office iWork PCR QuickBooks Outlook Mac PC LinkedIn LinkedIn Recruiter Writing Editing Creative Problem Solving Project Management Human Resources Organization Training Operations Management Supervising Executive... Aperture Twitter Google+ Photoshop Pinterest See 17+     See less Public Speaking Social Media Social Networking Community Outreach Research Grant Writing Facebook Nonprofits Microsoft Office iWork PCR QuickBooks Outlook Mac PC LinkedIn LinkedIn Recruiter Writing Editing Creative Problem Solving Project Management Human Resources Organization Training Operations Management Supervising Executive... Aperture Twitter Google+ Photoshop Pinterest See 17+     See less Education The University of Georgia Master of Arts (M.A.),  Religion/Religious Studies , 4.0 2009  – 2011 Focused on ritual studies and how ritual can be used intentionally as a tool for healing. Activities and Societies:  Theta Alpha Kappa - President Rubber Soul Yoga Revolution, Athens, GA 200 Hour Yoga Teacher Training 2011 Activities and Societies:  I am sad to say goodbye to JRP Group as I head to California to pursue my dreams ,  but JRP is excited to find the next member of their growing team! JRP Group is a great place to work - with the flexibility to work out of their Denver or Dillon offices ,  and an emphasis on work-life balance. Check out the job listing here ,  and please pass it along to anyone you know who may fit the bill! http://jrpgroup.net/refresh/templates/opportunity.php?job_id=404&industry=accounting_finance&type= UGA Bachelor of Arts (B.A.),  Religion/Religious Studies 2003  – 2008 Activities and Societies:  Lacrosse ,  Hiking and Camping ,  The Roots Farm ,  Athens Sustainability Club ,  Art - Painting ,  Drawing ,  and Photography. The University of Georgia Master of Arts (M.A.),  Religion/Religious Studies , 4.0 2009  – 2011 Focused on ritual studies and how ritual can be used intentionally as a tool for healing. Activities and Societies:  Theta Alpha Kappa - President The University of Georgia Master of Arts (M.A.),  Religion/Religious Studies , 4.0 2009  – 2011 Focused on ritual studies and how ritual can be used intentionally as a tool for healing. Activities and Societies:  Theta Alpha Kappa - President The University of Georgia Master of Arts (M.A.),  Religion/Religious Studies , 4.0 2009  – 2011 Focused on ritual studies and how ritual can be used intentionally as a tool for healing. Activities and Societies:  Theta Alpha Kappa - President Rubber Soul Yoga Revolution, Athens, GA 200 Hour Yoga Teacher Training 2011 Activities and Societies:  I am sad to say goodbye to JRP Group as I head to California to pursue my dreams ,  but JRP is excited to find the next member of their growing team! JRP Group is a great place to work - with the flexibility to work out of their Denver or Dillon offices ,  and an emphasis on work-life balance. Check out the job listing here ,  and please pass it along to anyone you know who may fit the bill! http://jrpgroup.net/refresh/templates/opportunity.php?job_id=404&industry=accounting_finance&type= Rubber Soul Yoga Revolution, Athens, GA 200 Hour Yoga Teacher Training 2011 Activities and Societies:  I am sad to say goodbye to JRP Group as I head to California to pursue my dreams ,  but JRP is excited to find the next member of their growing team! JRP Group is a great place to work - with the flexibility to work out of their Denver or Dillon offices ,  and an emphasis on work-life balance. Check out the job listing here ,  and please pass it along to anyone you know who may fit the bill! http://jrpgroup.net/refresh/templates/opportunity.php?job_id=404&industry=accounting_finance&type= Rubber Soul Yoga Revolution, Athens, GA 200 Hour Yoga Teacher Training 2011 Activities and Societies:  I am sad to say goodbye to JRP Group as I head to California to pursue my dreams ,  but JRP is excited to find the next member of their growing team! JRP Group is a great place to work - with the flexibility to work out of their Denver or Dillon offices ,  and an emphasis on work-life balance. Check out the job listing here ,  and please pass it along to anyone you know who may fit the bill! http://jrpgroup.net/refresh/templates/opportunity.php?job_id=404&industry=accounting_finance&type= UGA Bachelor of Arts (B.A.),  Religion/Religious Studies 2003  – 2008 Activities and Societies:  Lacrosse ,  Hiking and Camping ,  The Roots Farm ,  Athens Sustainability Club ,  Art - Painting ,  Drawing ,  and Photography. UGA Bachelor of Arts (B.A.),  Religion/Religious Studies 2003  – 2008 Activities and Societies:  Lacrosse ,  Hiking and Camping ,  The Roots Farm ,  Athens Sustainability Club ,  Art - Painting ,  Drawing ,  and Photography. UGA Bachelor of Arts (B.A.),  Religion/Religious Studies 2003  – 2008 Activities and Societies:  Lacrosse ,  Hiking and Camping ,  The Roots Farm ,  Athens Sustainability Club ,  Art - Painting ,  Drawing ,  and Photography. ", "Summary Clinical Research Coordinator at Stanford University School of Medicine, Department of Pediatrics - Division of Neonatology and Developmental Medicine. Data Coordinator for Global Maternal-Fetal health research studies. Areas of interest include: Newborn Jaundice, Biotechnology, Affordable and equitable access to healthcare, and increasing diversity in healthcare workforce. Summary Clinical Research Coordinator at Stanford University School of Medicine, Department of Pediatrics - Division of Neonatology and Developmental Medicine. Data Coordinator for Global Maternal-Fetal health research studies. Areas of interest include: Newborn Jaundice, Biotechnology, Affordable and equitable access to healthcare, and increasing diversity in healthcare workforce. Clinical Research Coordinator at Stanford University School of Medicine, Department of Pediatrics - Division of Neonatology and Developmental Medicine. Data Coordinator for Global Maternal-Fetal health research studies. Areas of interest include: Newborn Jaundice, Biotechnology, Affordable and equitable access to healthcare, and increasing diversity in healthcare workforce. Clinical Research Coordinator at Stanford University School of Medicine, Department of Pediatrics - Division of Neonatology and Developmental Medicine. Data Coordinator for Global Maternal-Fetal health research studies. Areas of interest include: Newborn Jaundice, Biotechnology, Affordable and equitable access to healthcare, and increasing diversity in healthcare workforce. Experience Clinical Research Coordinator Stanford University September 2012  – Present (3 years) Stanford University -Study recruitment in the Neonatal Intensive Care Unit (NICU), Packard Intermediate Care Nursery (PICN I & II), Well Baby Nursery (WBN) \n-Bench testing: Unbound Bilirubin, G6PD, TSH, TSB, Carboxyhemoglobin assays \n-Bedside testing: Embrace Thermal warming mattress, End-tidal carbon monoxide, Transcutaneous Bilirubin testing  \n-Scientific writing of abstracts and manuscripts \n-Data management and analysis \n \nAbstracts: \n \n\"Bench to Bedside Evaluation of a New End-Tidal Carbon Monoxide Monitor to Identify Hemolysis in Infants\" \nMartin E Castillo Cuadrado, Hendrik J Vreman, Ronald J Wong, David K Stevenson and Vinod K Bhutani. Pediatrics, Stanford University, Stanford, CA, United States \n \n\"Prevention of Kernicterus in South Asia: Role of Neonatal G6PD Deficiency and its Identification\" \nYassar H Arain, MD, Martin E Castillo Cuadrado, BS and Vinod K Bhutani, MD. Pediatrics, Stanford University, Stanford, CA, 94305, United States \n \n\"Early Clinical Screening for Severe Neonatal Hyperbilirubinemia (age <6 hours) in Resource Constrained Settings\" \nLalithambal Venugopalan, MD, Martin Cuadrado, BS, Yassar Arain, MD and Vinod K Bhutani, MD. Neonatology, Lucile Packard Children's Hospital, Palo Alto, California, United States \n \nAcknowledgements: \n \n\"Prevention of Kernicterus in South Asia: Role of Neonatal G6PD Deficiency and its Identification\" \nArain YH and Bhutani VK. 2014  \nhttp://link.springer.com/article/10.1007/s12098-014-1410-y/fulltext.html \n \nNeonatal hyperbilirubinemia and Rhesus disease of the newborn: incidence and impairment estimates for 2010 at regional and global levels \nBhutani VK, Zipursky A, Blencowe H, et al. 2013 \nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3873706/ Server The Cliff House April 2009  –  January 2013  (3 years 10 months) San Francisco Bay Area Deliver superior customer service, ServSafe Certified QI Fellowship San Francisco Department of Public Health 2013  –  2013  (less than a year) Project Coordinator Alta Bates Medical Group June 2011  –  August 2011  (3 months) San Francisco Bay Area Coordinated quality improvement projects and handled day-to-day logistics for an Independent Physicians Association (IPA) with more than 600 physicians and close to 40,000 health plan members. Project Coordinator YouthNoise September 2010  –  December 2010  (4 months) San Francisco Bay Area Supervised the Youth Participatory-Action Research (YPAR) Project in Albuquerque, Detroit, and Oakland. Policy & Advocacy Assistant Community Clinic Consortium of Contra Costa and Solano Counties May 2010  –  August 2010  (4 months) San Francisco Bay Area Conducted advocacy and outreach for 23 member clinics in both counties, serving more than 190,000 patients. Clinical Research Coordinator Stanford University September 2012  – Present (3 years) Stanford University -Study recruitment in the Neonatal Intensive Care Unit (NICU), Packard Intermediate Care Nursery (PICN I & II), Well Baby Nursery (WBN) \n-Bench testing: Unbound Bilirubin, G6PD, TSH, TSB, Carboxyhemoglobin assays \n-Bedside testing: Embrace Thermal warming mattress, End-tidal carbon monoxide, Transcutaneous Bilirubin testing  \n-Scientific writing of abstracts and manuscripts \n-Data management and analysis \n \nAbstracts: \n \n\"Bench to Bedside Evaluation of a New End-Tidal Carbon Monoxide Monitor to Identify Hemolysis in Infants\" \nMartin E Castillo Cuadrado, Hendrik J Vreman, Ronald J Wong, David K Stevenson and Vinod K Bhutani. Pediatrics, Stanford University, Stanford, CA, United States \n \n\"Prevention of Kernicterus in South Asia: Role of Neonatal G6PD Deficiency and its Identification\" \nYassar H Arain, MD, Martin E Castillo Cuadrado, BS and Vinod K Bhutani, MD. Pediatrics, Stanford University, Stanford, CA, 94305, United States \n \n\"Early Clinical Screening for Severe Neonatal Hyperbilirubinemia (age <6 hours) in Resource Constrained Settings\" \nLalithambal Venugopalan, MD, Martin Cuadrado, BS, Yassar Arain, MD and Vinod K Bhutani, MD. Neonatology, Lucile Packard Children's Hospital, Palo Alto, California, United States \n \nAcknowledgements: \n \n\"Prevention of Kernicterus in South Asia: Role of Neonatal G6PD Deficiency and its Identification\" \nArain YH and Bhutani VK. 2014  \nhttp://link.springer.com/article/10.1007/s12098-014-1410-y/fulltext.html \n \nNeonatal hyperbilirubinemia and Rhesus disease of the newborn: incidence and impairment estimates for 2010 at regional and global levels \nBhutani VK, Zipursky A, Blencowe H, et al. 2013 \nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3873706/ Clinical Research Coordinator Stanford University September 2012  – Present (3 years) Stanford University -Study recruitment in the Neonatal Intensive Care Unit (NICU), Packard Intermediate Care Nursery (PICN I & II), Well Baby Nursery (WBN) \n-Bench testing: Unbound Bilirubin, G6PD, TSH, TSB, Carboxyhemoglobin assays \n-Bedside testing: Embrace Thermal warming mattress, End-tidal carbon monoxide, Transcutaneous Bilirubin testing  \n-Scientific writing of abstracts and manuscripts \n-Data management and analysis \n \nAbstracts: \n \n\"Bench to Bedside Evaluation of a New End-Tidal Carbon Monoxide Monitor to Identify Hemolysis in Infants\" \nMartin E Castillo Cuadrado, Hendrik J Vreman, Ronald J Wong, David K Stevenson and Vinod K Bhutani. Pediatrics, Stanford University, Stanford, CA, United States \n \n\"Prevention of Kernicterus in South Asia: Role of Neonatal G6PD Deficiency and its Identification\" \nYassar H Arain, MD, Martin E Castillo Cuadrado, BS and Vinod K Bhutani, MD. Pediatrics, Stanford University, Stanford, CA, 94305, United States \n \n\"Early Clinical Screening for Severe Neonatal Hyperbilirubinemia (age <6 hours) in Resource Constrained Settings\" \nLalithambal Venugopalan, MD, Martin Cuadrado, BS, Yassar Arain, MD and Vinod K Bhutani, MD. Neonatology, Lucile Packard Children's Hospital, Palo Alto, California, United States \n \nAcknowledgements: \n \n\"Prevention of Kernicterus in South Asia: Role of Neonatal G6PD Deficiency and its Identification\" \nArain YH and Bhutani VK. 2014  \nhttp://link.springer.com/article/10.1007/s12098-014-1410-y/fulltext.html \n \nNeonatal hyperbilirubinemia and Rhesus disease of the newborn: incidence and impairment estimates for 2010 at regional and global levels \nBhutani VK, Zipursky A, Blencowe H, et al. 2013 \nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3873706/ Server The Cliff House April 2009  –  January 2013  (3 years 10 months) San Francisco Bay Area Deliver superior customer service, ServSafe Certified Server The Cliff House April 2009  –  January 2013  (3 years 10 months) San Francisco Bay Area Deliver superior customer service, ServSafe Certified QI Fellowship San Francisco Department of Public Health 2013  –  2013  (less than a year) QI Fellowship San Francisco Department of Public Health 2013  –  2013  (less than a year) Project Coordinator Alta Bates Medical Group June 2011  –  August 2011  (3 months) San Francisco Bay Area Coordinated quality improvement projects and handled day-to-day logistics for an Independent Physicians Association (IPA) with more than 600 physicians and close to 40,000 health plan members. Project Coordinator Alta Bates Medical Group June 2011  –  August 2011  (3 months) San Francisco Bay Area Coordinated quality improvement projects and handled day-to-day logistics for an Independent Physicians Association (IPA) with more than 600 physicians and close to 40,000 health plan members. Project Coordinator YouthNoise September 2010  –  December 2010  (4 months) San Francisco Bay Area Supervised the Youth Participatory-Action Research (YPAR) Project in Albuquerque, Detroit, and Oakland. Project Coordinator YouthNoise September 2010  –  December 2010  (4 months) San Francisco Bay Area Supervised the Youth Participatory-Action Research (YPAR) Project in Albuquerque, Detroit, and Oakland. Policy & Advocacy Assistant Community Clinic Consortium of Contra Costa and Solano Counties May 2010  –  August 2010  (4 months) San Francisco Bay Area Conducted advocacy and outreach for 23 member clinics in both counties, serving more than 190,000 patients. Policy & Advocacy Assistant Community Clinic Consortium of Contra Costa and Solano Counties May 2010  –  August 2010  (4 months) San Francisco Bay Area Conducted advocacy and outreach for 23 member clinics in both counties, serving more than 190,000 patients. Skills Project Coordination Advocacy Health Education Community Outreach Public Health Access Health Administration Skills  Project Coordination Advocacy Health Education Community Outreach Public Health Access Health Administration Project Coordination Advocacy Health Education Community Outreach Public Health Access Health Administration Project Coordination Advocacy Health Education Community Outreach Public Health Access Health Administration Education San Francisco State University BS,  Health Education - Community-Based Public Health - Business Administration 2006  – 2011 Activities and Societies:  Pi Kappa Phi Fraternity ,  Peer Educators Advocating Campus Health (P.E.A.C.H.) ,  Health Career Connection Oceanside High School 2002  – 2006 San Francisco State University BS,  Health Education - Community-Based Public Health - Business Administration 2006  – 2011 Activities and Societies:  Pi Kappa Phi Fraternity ,  Peer Educators Advocating Campus Health (P.E.A.C.H.) ,  Health Career Connection San Francisco State University BS,  Health Education - Community-Based Public Health - Business Administration 2006  – 2011 Activities and Societies:  Pi Kappa Phi Fraternity ,  Peer Educators Advocating Campus Health (P.E.A.C.H.) ,  Health Career Connection San Francisco State University BS,  Health Education - Community-Based Public Health - Business Administration 2006  – 2011 Activities and Societies:  Pi Kappa Phi Fraternity ,  Peer Educators Advocating Campus Health (P.E.A.C.H.) ,  Health Career Connection Oceanside High School 2002  – 2006 Oceanside High School 2002  – 2006 Oceanside High School 2002  – 2006 ", "Summary Clinical Research Coordinator at Stanford University's School of Medicine Concussion and Brain Performance Center, Department of Neurosurgery. Responsible for data collection in study investigating attention deficiencies as a result of mild traumatic brain injuries (mTBI). For more information about SCBPC, see our website at http://med.stanford.edu/braincenter.html. \n \nMay 2015 graduate of American University in Washington, DC with a BA in Psychology and a minor in Biology (cum laude, University Honors in Psychology). \n \nPrevious experience:  \n \n-Research Intern, University College London Speech Research Group \n-Research Assistant, Princeton University's Neuroscience Institute  \n-Undergraduate Research Assistant, American University's Center for Behavioral Neuroscience  \n-Teaching assistant and tutor (Spring 2013: MATH 211-002, Spring 2014: PHYS 205) \n-Volunteer, American University GLBTA Resource Center.  \n \nHas background in mathematics, data analysis, medical research, and the biological sciences. Seeking further research opportunities (particularly in the fields of neuroscience, general psychology, and LGBT psychology) before enrollment in graduate school. Summary Clinical Research Coordinator at Stanford University's School of Medicine Concussion and Brain Performance Center, Department of Neurosurgery. Responsible for data collection in study investigating attention deficiencies as a result of mild traumatic brain injuries (mTBI). For more information about SCBPC, see our website at http://med.stanford.edu/braincenter.html. \n \nMay 2015 graduate of American University in Washington, DC with a BA in Psychology and a minor in Biology (cum laude, University Honors in Psychology). \n \nPrevious experience:  \n \n-Research Intern, University College London Speech Research Group \n-Research Assistant, Princeton University's Neuroscience Institute  \n-Undergraduate Research Assistant, American University's Center for Behavioral Neuroscience  \n-Teaching assistant and tutor (Spring 2013: MATH 211-002, Spring 2014: PHYS 205) \n-Volunteer, American University GLBTA Resource Center.  \n \nHas background in mathematics, data analysis, medical research, and the biological sciences. Seeking further research opportunities (particularly in the fields of neuroscience, general psychology, and LGBT psychology) before enrollment in graduate school. Clinical Research Coordinator at Stanford University's School of Medicine Concussion and Brain Performance Center, Department of Neurosurgery. Responsible for data collection in study investigating attention deficiencies as a result of mild traumatic brain injuries (mTBI). For more information about SCBPC, see our website at http://med.stanford.edu/braincenter.html. \n \nMay 2015 graduate of American University in Washington, DC with a BA in Psychology and a minor in Biology (cum laude, University Honors in Psychology). \n \nPrevious experience:  \n \n-Research Intern, University College London Speech Research Group \n-Research Assistant, Princeton University's Neuroscience Institute  \n-Undergraduate Research Assistant, American University's Center for Behavioral Neuroscience  \n-Teaching assistant and tutor (Spring 2013: MATH 211-002, Spring 2014: PHYS 205) \n-Volunteer, American University GLBTA Resource Center.  \n \nHas background in mathematics, data analysis, medical research, and the biological sciences. Seeking further research opportunities (particularly in the fields of neuroscience, general psychology, and LGBT psychology) before enrollment in graduate school. Clinical Research Coordinator at Stanford University's School of Medicine Concussion and Brain Performance Center, Department of Neurosurgery. Responsible for data collection in study investigating attention deficiencies as a result of mild traumatic brain injuries (mTBI). For more information about SCBPC, see our website at http://med.stanford.edu/braincenter.html. \n \nMay 2015 graduate of American University in Washington, DC with a BA in Psychology and a minor in Biology (cum laude, University Honors in Psychology). \n \nPrevious experience:  \n \n-Research Intern, University College London Speech Research Group \n-Research Assistant, Princeton University's Neuroscience Institute  \n-Undergraduate Research Assistant, American University's Center for Behavioral Neuroscience  \n-Teaching assistant and tutor (Spring 2013: MATH 211-002, Spring 2014: PHYS 205) \n-Volunteer, American University GLBTA Resource Center.  \n \nHas background in mathematics, data analysis, medical research, and the biological sciences. Seeking further research opportunities (particularly in the fields of neuroscience, general psychology, and LGBT psychology) before enrollment in graduate school. Experience Clinical Research Coordinator Stanford University School of Medicine June 2015  – Present (3 months) Palo Alto, CA Stanford Concussion and Brain Performance Center Research Intern University College London October 2014  –  December 2014  (3 months) London, United Kingdom Summer Research Fellow Princeton University June 2014  –  August 2014  (3 months) Princeton, NJ Weekend/Holiday Animal Facilities Manager American University May 2013  –  May 2014  (1 year 1 month) Research Assistant Center for Behavioral Neuroscience February 2013  –  May 2014  (1 year 4 months) American University, Washington, D.C. Teaching Assistant/Tutor American University January 2013  –  May 2014  (1 year 5 months) Summer Intern Green Spring Internal Medicine, LLC June 2012  –  July 2012  (2 months) Timonium, MD Barista Starbucks July 2010  –  August 2011  (1 year 2 months) Towson, MD Clinical Research Coordinator Stanford University School of Medicine June 2015  – Present (3 months) Palo Alto, CA Stanford Concussion and Brain Performance Center Clinical Research Coordinator Stanford University School of Medicine June 2015  – Present (3 months) Palo Alto, CA Stanford Concussion and Brain Performance Center Research Intern University College London October 2014  –  December 2014  (3 months) London, United Kingdom Research Intern University College London October 2014  –  December 2014  (3 months) London, United Kingdom Summer Research Fellow Princeton University June 2014  –  August 2014  (3 months) Princeton, NJ Summer Research Fellow Princeton University June 2014  –  August 2014  (3 months) Princeton, NJ Weekend/Holiday Animal Facilities Manager American University May 2013  –  May 2014  (1 year 1 month) Weekend/Holiday Animal Facilities Manager American University May 2013  –  May 2014  (1 year 1 month) Research Assistant Center for Behavioral Neuroscience February 2013  –  May 2014  (1 year 4 months) American University, Washington, D.C. Research Assistant Center for Behavioral Neuroscience February 2013  –  May 2014  (1 year 4 months) American University, Washington, D.C. Teaching Assistant/Tutor American University January 2013  –  May 2014  (1 year 5 months) Teaching Assistant/Tutor American University January 2013  –  May 2014  (1 year 5 months) Summer Intern Green Spring Internal Medicine, LLC June 2012  –  July 2012  (2 months) Timonium, MD Summer Intern Green Spring Internal Medicine, LLC June 2012  –  July 2012  (2 months) Timonium, MD Barista Starbucks July 2010  –  August 2011  (1 year 2 months) Towson, MD Barista Starbucks July 2010  –  August 2011  (1 year 2 months) Towson, MD Languages   Skills Mathematics Calculus Social Theory Commercial Aviation Vocal Performance Visual Arts Acting Social Science Research Data Analysis Keynote Social Media Microsoft Excel Singing Social Sciences General Physics Time Management See 1+     See less Skills  Mathematics Calculus Social Theory Commercial Aviation Vocal Performance Visual Arts Acting Social Science Research Data Analysis Keynote Social Media Microsoft Excel Singing Social Sciences General Physics Time Management See 1+     See less Mathematics Calculus Social Theory Commercial Aviation Vocal Performance Visual Arts Acting Social Science Research Data Analysis Keynote Social Media Microsoft Excel Singing Social Sciences General Physics Time Management See 1+     See less Mathematics Calculus Social Theory Commercial Aviation Vocal Performance Visual Arts Acting Social Science Research Data Analysis Keynote Social Media Microsoft Excel Singing Social Sciences General Physics Time Management See 1+     See less Education American University 2011  – 2015 UCL 2014  – 2014 Calvert Hall College High School, Baltimore, MD 2007  – 2011 American University 2011  – 2015 American University 2011  – 2015 American University 2011  – 2015 UCL 2014  – 2014 UCL 2014  – 2014 UCL 2014  – 2014 Calvert Hall College High School, Baltimore, MD 2007  – 2011 Calvert Hall College High School, Baltimore, MD 2007  – 2011 Calvert Hall College High School, Baltimore, MD 2007  – 2011 Honors & Awards ", "Skills Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol Skills  Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol Clinical Trials Clinical Research Infectious Diseases Research Biotechnology Molecular Biology Life Sciences Laboratory Protocol ", "Experience Clinical Research Coordinator Stanford University Clinical Research Coordinator Stanford University Clinical Research Coordinator Stanford University Skills Neuroscience Molecular Biology Clinical Development Clinical Trials IRB Microsoft Office Skills  Neuroscience Molecular Biology Clinical Development Clinical Trials IRB Microsoft Office Neuroscience Molecular Biology Clinical Development Clinical Trials IRB Microsoft Office Neuroscience Molecular Biology Clinical Development Clinical Trials IRB Microsoft Office Education San Francisco Art Institute Master of Fine Arts (MFA),  Photography 1989  – 1991 University of California, Santa Cruz Bachelor of Arts (B.A.),  Psychology San Francisco Art Institute Master of Fine Arts (MFA),  Photography 1989  – 1991 San Francisco Art Institute Master of Fine Arts (MFA),  Photography 1989  – 1991 San Francisco Art Institute Master of Fine Arts (MFA),  Photography 1989  – 1991 University of California, Santa Cruz Bachelor of Arts (B.A.),  Psychology University of California, Santa Cruz Bachelor of Arts (B.A.),  Psychology University of California, Santa Cruz Bachelor of Arts (B.A.),  Psychology ", "Experience Clinical Research Coordinator Stanford University Roche Palo Alto Roche-Palo Alto 2001  –  2006  (5 years) Research Associate III Roche Pharmaceuticals 2001  –  2006  (5 years) Clinical Research Coordinator Stanford University Clinical Research Coordinator Stanford University Roche Palo Alto Roche-Palo Alto 2001  –  2006  (5 years) Roche Palo Alto Roche-Palo Alto 2001  –  2006  (5 years) Research Associate III Roche Pharmaceuticals 2001  –  2006  (5 years) Research Associate III Roche Pharmaceuticals 2001  –  2006  (5 years) Education University of Wisconsin-Whitewater University of Wisconsin-Whitewater University of Wisconsin-Whitewater University of Wisconsin-Whitewater ", "Summary In the 1990's I had a seven-year career as a technical writer in software. I wrote user guides for the Java Station at Sun Microsystems, for example. In the early 2000's I was drawn to learn more about medicine, and in 2010 I completed a Nursing degree at San Francisco State University. While in training I stumbled upon my passion: Clinical Research, where I combine my love of medicine with my strengths in communication and writing. I like having a positive impact on people's wellness and being part of a community that's uplifting. Summary In the 1990's I had a seven-year career as a technical writer in software. I wrote user guides for the Java Station at Sun Microsystems, for example. In the early 2000's I was drawn to learn more about medicine, and in 2010 I completed a Nursing degree at San Francisco State University. While in training I stumbled upon my passion: Clinical Research, where I combine my love of medicine with my strengths in communication and writing. I like having a positive impact on people's wellness and being part of a community that's uplifting. In the 1990's I had a seven-year career as a technical writer in software. I wrote user guides for the Java Station at Sun Microsystems, for example. In the early 2000's I was drawn to learn more about medicine, and in 2010 I completed a Nursing degree at San Francisco State University. While in training I stumbled upon my passion: Clinical Research, where I combine my love of medicine with my strengths in communication and writing. I like having a positive impact on people's wellness and being part of a community that's uplifting. In the 1990's I had a seven-year career as a technical writer in software. I wrote user guides for the Java Station at Sun Microsystems, for example. In the early 2000's I was drawn to learn more about medicine, and in 2010 I completed a Nursing degree at San Francisco State University. While in training I stumbled upon my passion: Clinical Research, where I combine my love of medicine with my strengths in communication and writing. I like having a positive impact on people's wellness and being part of a community that's uplifting. Experience Clinical Research Coordinator Stanford University School of Medicine January 2012  – Present (3 years 8 months) Department of Radiation Oncology I manage clinical research protocols from start to finish, gaining patient consent and following patients during treatment and throughout follow-up. I maintain good clinical practice and communicate on a regular basis with the organizers of national trials. I add value with strict attention to detail. Staff Nurse Menlo Medical Clinic November 2010  –  May 2011  (7 months) • Provided initial telephone contact for patients in two physicians’ practices \n• Triaged patients for care (Emergency Room, appointments, or home care) \n• Provided telephone nursing advice \n• Scheduled appointments \n• Secured prescription medications  \n• Provided backup for rooming patients, taking blood pressure, temperature, pulse, weight and height \n• Documented actions fully Senior Technical Writer Sun Microsystems August 1997  –  July 2000  (3 years) • Led documentation teams for two new network appliances \n• Wrote technical web pages for network appliances and server software  \n• Wrote client software guide and technical briefs  \n• Contributed to an administrator’s guide \n• Visited customer sites and reported feedback on software and documents Senior Technical Writer Integrated Systems May 1995  –  August 1997  (2 years 4 months) • Designed online help systems for software development tools \n• Wrote and maintained conceptual and reference guides  \n• Led documentation teams \n• Interviewed potential writers and made hiring recommendations Clinical Research Coordinator Stanford University School of Medicine January 2012  – Present (3 years 8 months) Department of Radiation Oncology I manage clinical research protocols from start to finish, gaining patient consent and following patients during treatment and throughout follow-up. I maintain good clinical practice and communicate on a regular basis with the organizers of national trials. I add value with strict attention to detail. Clinical Research Coordinator Stanford University School of Medicine January 2012  – Present (3 years 8 months) Department of Radiation Oncology I manage clinical research protocols from start to finish, gaining patient consent and following patients during treatment and throughout follow-up. I maintain good clinical practice and communicate on a regular basis with the organizers of national trials. I add value with strict attention to detail. Staff Nurse Menlo Medical Clinic November 2010  –  May 2011  (7 months) • Provided initial telephone contact for patients in two physicians’ practices \n• Triaged patients for care (Emergency Room, appointments, or home care) \n• Provided telephone nursing advice \n• Scheduled appointments \n• Secured prescription medications  \n• Provided backup for rooming patients, taking blood pressure, temperature, pulse, weight and height \n• Documented actions fully Staff Nurse Menlo Medical Clinic November 2010  –  May 2011  (7 months) • Provided initial telephone contact for patients in two physicians’ practices \n• Triaged patients for care (Emergency Room, appointments, or home care) \n• Provided telephone nursing advice \n• Scheduled appointments \n• Secured prescription medications  \n• Provided backup for rooming patients, taking blood pressure, temperature, pulse, weight and height \n• Documented actions fully Senior Technical Writer Sun Microsystems August 1997  –  July 2000  (3 years) • Led documentation teams for two new network appliances \n• Wrote technical web pages for network appliances and server software  \n• Wrote client software guide and technical briefs  \n• Contributed to an administrator’s guide \n• Visited customer sites and reported feedback on software and documents Senior Technical Writer Sun Microsystems August 1997  –  July 2000  (3 years) • Led documentation teams for two new network appliances \n• Wrote technical web pages for network appliances and server software  \n• Wrote client software guide and technical briefs  \n• Contributed to an administrator’s guide \n• Visited customer sites and reported feedback on software and documents Senior Technical Writer Integrated Systems May 1995  –  August 1997  (2 years 4 months) • Designed online help systems for software development tools \n• Wrote and maintained conceptual and reference guides  \n• Led documentation teams \n• Interviewed potential writers and made hiring recommendations Senior Technical Writer Integrated Systems May 1995  –  August 1997  (2 years 4 months) • Designed online help systems for software development tools \n• Wrote and maintained conceptual and reference guides  \n• Led documentation teams \n• Interviewed potential writers and made hiring recommendations Skills Healthcare Documentation Writing ACLS BLS Nursing Education Vital Signs Clinical Research Skills  Healthcare Documentation Writing ACLS BLS Nursing Education Vital Signs Clinical Research Healthcare Documentation Writing ACLS BLS Nursing Education Vital Signs Clinical Research Healthcare Documentation Writing ACLS BLS Nursing Education Vital Signs Clinical Research Education San Francisco State University B.S.,  Nursing 2008  – 2010 Activities and Societies:  Nursing Student Association Stanford University B.A.,  English 1984  – 1988 Activities and Societies:  Leland Stanford Junior University Marching Band San Francisco State University B.S.,  Nursing 2008  – 2010 Activities and Societies:  Nursing Student Association San Francisco State University B.S.,  Nursing 2008  – 2010 Activities and Societies:  Nursing Student Association San Francisco State University B.S.,  Nursing 2008  – 2010 Activities and Societies:  Nursing Student Association Stanford University B.A.,  English 1984  – 1988 Activities and Societies:  Leland Stanford Junior University Marching Band Stanford University B.A.,  English 1984  – 1988 Activities and Societies:  Leland Stanford Junior University Marching Band Stanford University B.A.,  English 1984  – 1988 Activities and Societies:  Leland Stanford Junior University Marching Band ", "Skills Skills     Honors & Awards ", "Summary I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n Summary I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n I am a clinical research professional with 8 years of experience managing coordination and implementation of complex research protocols of Phase I - Phase IV randomized double blind clinical trials and Investigator initiated studies according to Good Clinical Practice (GCP), ICH, assuring efficiency, regulatory compliance, safety and patient well-being.  \n \n Experience Clinical Research Coordinator Stanford University School of Medicine January 2015  –  June 2015  (6 months) Stanford University School of Medicine Division of Blood and Marrow Transplantation  \n Clinical Research Coordinator Stanford University School of Medicine 2010  –  January 2015  (5 years) Division of Immunology and Rheumatology Clinical Research Assistant Stanford University School of Medicine 2007  –  2010  (3 years) Division of Health Research and Policy Clinical Research Associate Deapartment of Veterans Affair June 2007  –  August 2007  (3 months) Realtor Prudential Ca Realty October 1998  –  June 2007  (8 years 9 months) Instructor San Mateo Community College District 1996  –  1996  (less than a year) Instructor (Adjunct Faculty) Los Angeles Harbor College 1994  –  1994  (less than a year) Clinical Research Coordinator Stanford University School of Medicine January 2015  –  June 2015  (6 months) Stanford University School of Medicine Division of Blood and Marrow Transplantation  \n Clinical Research Coordinator Stanford University School of Medicine January 2015  –  June 2015  (6 months) Stanford University School of Medicine Division of Blood and Marrow Transplantation  \n Clinical Research Coordinator Stanford University School of Medicine 2010  –  January 2015  (5 years) Division of Immunology and Rheumatology Clinical Research Coordinator Stanford University School of Medicine 2010  –  January 2015  (5 years) Division of Immunology and Rheumatology Clinical Research Assistant Stanford University School of Medicine 2007  –  2010  (3 years) Division of Health Research and Policy Clinical Research Assistant Stanford University School of Medicine 2007  –  2010  (3 years) Division of Health Research and Policy Clinical Research Associate Deapartment of Veterans Affair June 2007  –  August 2007  (3 months) Clinical Research Associate Deapartment of Veterans Affair June 2007  –  August 2007  (3 months) Realtor Prudential Ca Realty October 1998  –  June 2007  (8 years 9 months) Realtor Prudential Ca Realty October 1998  –  June 2007  (8 years 9 months) Instructor San Mateo Community College District 1996  –  1996  (less than a year) Instructor San Mateo Community College District 1996  –  1996  (less than a year) Instructor (Adjunct Faculty) Los Angeles Harbor College 1994  –  1994  (less than a year) Instructor (Adjunct Faculty) Los Angeles Harbor College 1994  –  1994  (less than a year) Languages Punjabi, Hindi Punjabi, Hindi Punjabi, Hindi Skills Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Skills  Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Clinical Trials GCP Research Microsoft Office Time Management IRB Supervisory Skills Clinical Research SOP FDA Immunology Science Database Design and... Sop Clinical Study Design Patient Recruitment Protocol See 2+     See less Education Middlesex University MS,  Applied computer technology 1989  – 1990 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 Middlesex University MS,  Applied computer technology 1989  – 1990 Middlesex University MS,  Applied computer technology 1989  – 1990 Middlesex University MS,  Applied computer technology 1989  – 1990 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University MS,  Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 Guru Nanak Dev University BS,  Biology & Chemistry 1985  – 1987 ", "Experience Clinical Research Coordinator Stanford University May 2015  – Present (4 months) Palo Alto, CA Stanford is one of the world's leading teaching and research universities. As a Clinical Research Coordinator for the Stanford University School of Medicine, I coordinate studies from start-up through close-out as primary contact with research participants, sponsors, and regulatory agencies. Cofounder Scholarati 2014  – Present (1 year) San Jose, CA Scholarati is a learning design company focused on shaping great learning environments, and producing learning tech that we'd love to use. Administrative Associate Stanford University June 2014  –  May 2015  (1 year) Palo Alto, CA Stanford is one of the world's leading teaching and research universities. As an administrative team member of the Stanford University School of Medicine, my focus was on driving the school's administrative infrastructure to support the pursuit of excellence in education, patient care and innovation, and research. Director of Administration LAMA College for Music Professionals 2007  –  2013  (6 years) Pasadena, CA LAMA, with an enrollment of ~250 students, is a degree-granting professional college built around a faculty of practitioners who perform at the highest levels of the music industry. My goal was ensuring that operations supported a learning environment in which students and faculty could perform at their best. Clinical Research Coordinator Stanford University May 2015  – Present (4 months) Palo Alto, CA Stanford is one of the world's leading teaching and research universities. As a Clinical Research Coordinator for the Stanford University School of Medicine, I coordinate studies from start-up through close-out as primary contact with research participants, sponsors, and regulatory agencies. Clinical Research Coordinator Stanford University May 2015  – Present (4 months) Palo Alto, CA Stanford is one of the world's leading teaching and research universities. As a Clinical Research Coordinator for the Stanford University School of Medicine, I coordinate studies from start-up through close-out as primary contact with research participants, sponsors, and regulatory agencies. Cofounder Scholarati 2014  – Present (1 year) San Jose, CA Scholarati is a learning design company focused on shaping great learning environments, and producing learning tech that we'd love to use. Cofounder Scholarati 2014  – Present (1 year) San Jose, CA Scholarati is a learning design company focused on shaping great learning environments, and producing learning tech that we'd love to use. Administrative Associate Stanford University June 2014  –  May 2015  (1 year) Palo Alto, CA Stanford is one of the world's leading teaching and research universities. As an administrative team member of the Stanford University School of Medicine, my focus was on driving the school's administrative infrastructure to support the pursuit of excellence in education, patient care and innovation, and research. Administrative Associate Stanford University June 2014  –  May 2015  (1 year) Palo Alto, CA Stanford is one of the world's leading teaching and research universities. As an administrative team member of the Stanford University School of Medicine, my focus was on driving the school's administrative infrastructure to support the pursuit of excellence in education, patient care and innovation, and research. Director of Administration LAMA College for Music Professionals 2007  –  2013  (6 years) Pasadena, CA LAMA, with an enrollment of ~250 students, is a degree-granting professional college built around a faculty of practitioners who perform at the highest levels of the music industry. My goal was ensuring that operations supported a learning environment in which students and faculty could perform at their best. Director of Administration LAMA College for Music Professionals 2007  –  2013  (6 years) Pasadena, CA LAMA, with an enrollment of ~250 students, is a degree-granting professional college built around a faculty of practitioners who perform at the highest levels of the music industry. My goal was ensuring that operations supported a learning environment in which students and faculty could perform at their best. Languages English Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Indonesian Native or bilingual proficiency English Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Indonesian Native or bilingual proficiency English Native or bilingual proficiency Spanish Limited working proficiency French Limited working proficiency Indonesian Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Native or bilingual proficiency Skills Editing Sage CRM SEVIS Policy Peachtree FERPA Populi Research Entrepreneurship Administration International Relations Intercultural... Higher Education Social Entrepreneurship Skills  Editing Sage CRM SEVIS Policy Peachtree FERPA Populi Research Entrepreneurship Administration International Relations Intercultural... Higher Education Social Entrepreneurship Editing Sage CRM SEVIS Policy Peachtree FERPA Populi Research Entrepreneurship Administration International Relations Intercultural... Higher Education Social Entrepreneurship Editing Sage CRM SEVIS Policy Peachtree FERPA Populi Research Entrepreneurship Administration International Relations Intercultural... Higher Education Social Entrepreneurship Education University of California, Irvine Bachelor of Arts (B.A.),  History 2006 University of California, Irvine Bachelor of Arts (B.A.),  History 2006 University of California, Irvine Bachelor of Arts (B.A.),  History 2006 University of California, Irvine Bachelor of Arts (B.A.),  History 2006 Honors & Awards ", "Experience Social Science Research Coordinator Stanford University August 2012  – Present (3 years 1 month) Graduate School of Education -Perform research functions including qualitative data analysis. \n \n-Provide outstanding financial, administrative, and technical support to the California World Language Project and its regional sites throughout California.  \n \n-Process all financial transactions for the California World Language Project (CWLP) programs using Stanford financial systems. Create and maintain records of all invoices, receipts, and deposits. Reconcile monthly and quarterly expenditures. Create grant budget spreadsheets. Process account closeout.  \n \n-Manage administrative and some technical aspects of local Stanford World Language Project (SWLP) program and other CWLP programs. Communicate program logistical information with all relevant stakeholders. Create and maintain program records. \n \n-Perform event planning functions for local SWLP program and other CWLP programs. Coordinate catering and other administrative tasks to prepare for events. When applicable, coordinate hotel accommodations, business dinners, and other administrative tasks. \n \n-Perform programmatic functions for CWLP such as participation in site and research meetings and providing feedback on program content. \n \n-Act as a supervisor to two Stanford undergraduate students. Tutor WyzAnt Tutoring November 2011  – Present (3 years 10 months) Multiple -Experienced Spanish and English language tutor. \n-Educational content writer for Spanish help section. Research Coordinator Stanford University June 2011  –  June 2012  (1 year 1 month) Palo Alto, CA Act as project manager for grant in the Division of Vascular Surgery. Collect and enter study data for analysis. Manage administrative and financial aspects of grant. High School Spanish Teacher Modesto Christian High School August 2010  –  May 2011  (10 months) Modesto, California Area Taught Spanish II-IV A.P. to high school students. Developed age-appropriate curriculum addressing different learning styles. Collaborated with other foreign language department faculty to enhance courses taught. Pre-Award Analyst UCSF December 2009  –  July 2010  (8 months) San Francisco Bay Area Provide high quality pre-award management for extramural funds including government and private grants, contracts, and subcontracts for the Department of Physiology for 23 primary faculty and 80 postdoctoral fellows. \nDevelop complex proposal budgets that comply with all applicable departmental, UC, and agency policies and regulations. \nInitiate and maintain ongoing, timely and effective communication with all relevant parties throughout the proposal process. Social Science Research Coordinator Stanford University August 2012  – Present (3 years 1 month) Graduate School of Education -Perform research functions including qualitative data analysis. \n \n-Provide outstanding financial, administrative, and technical support to the California World Language Project and its regional sites throughout California.  \n \n-Process all financial transactions for the California World Language Project (CWLP) programs using Stanford financial systems. Create and maintain records of all invoices, receipts, and deposits. Reconcile monthly and quarterly expenditures. Create grant budget spreadsheets. Process account closeout.  \n \n-Manage administrative and some technical aspects of local Stanford World Language Project (SWLP) program and other CWLP programs. Communicate program logistical information with all relevant stakeholders. Create and maintain program records. \n \n-Perform event planning functions for local SWLP program and other CWLP programs. Coordinate catering and other administrative tasks to prepare for events. When applicable, coordinate hotel accommodations, business dinners, and other administrative tasks. \n \n-Perform programmatic functions for CWLP such as participation in site and research meetings and providing feedback on program content. \n \n-Act as a supervisor to two Stanford undergraduate students. Social Science Research Coordinator Stanford University August 2012  – Present (3 years 1 month) Graduate School of Education -Perform research functions including qualitative data analysis. \n \n-Provide outstanding financial, administrative, and technical support to the California World Language Project and its regional sites throughout California.  \n \n-Process all financial transactions for the California World Language Project (CWLP) programs using Stanford financial systems. Create and maintain records of all invoices, receipts, and deposits. Reconcile monthly and quarterly expenditures. Create grant budget spreadsheets. Process account closeout.  \n \n-Manage administrative and some technical aspects of local Stanford World Language Project (SWLP) program and other CWLP programs. Communicate program logistical information with all relevant stakeholders. Create and maintain program records. \n \n-Perform event planning functions for local SWLP program and other CWLP programs. Coordinate catering and other administrative tasks to prepare for events. When applicable, coordinate hotel accommodations, business dinners, and other administrative tasks. \n \n-Perform programmatic functions for CWLP such as participation in site and research meetings and providing feedback on program content. \n \n-Act as a supervisor to two Stanford undergraduate students. Tutor WyzAnt Tutoring November 2011  – Present (3 years 10 months) Multiple -Experienced Spanish and English language tutor. \n-Educational content writer for Spanish help section. Tutor WyzAnt Tutoring November 2011  – Present (3 years 10 months) Multiple -Experienced Spanish and English language tutor. \n-Educational content writer for Spanish help section. Research Coordinator Stanford University June 2011  –  June 2012  (1 year 1 month) Palo Alto, CA Act as project manager for grant in the Division of Vascular Surgery. Collect and enter study data for analysis. Manage administrative and financial aspects of grant. Research Coordinator Stanford University June 2011  –  June 2012  (1 year 1 month) Palo Alto, CA Act as project manager for grant in the Division of Vascular Surgery. Collect and enter study data for analysis. Manage administrative and financial aspects of grant. High School Spanish Teacher Modesto Christian High School August 2010  –  May 2011  (10 months) Modesto, California Area Taught Spanish II-IV A.P. to high school students. Developed age-appropriate curriculum addressing different learning styles. Collaborated with other foreign language department faculty to enhance courses taught. High School Spanish Teacher Modesto Christian High School August 2010  –  May 2011  (10 months) Modesto, California Area Taught Spanish II-IV A.P. to high school students. Developed age-appropriate curriculum addressing different learning styles. Collaborated with other foreign language department faculty to enhance courses taught. Pre-Award Analyst UCSF December 2009  –  July 2010  (8 months) San Francisco Bay Area Provide high quality pre-award management for extramural funds including government and private grants, contracts, and subcontracts for the Department of Physiology for 23 primary faculty and 80 postdoctoral fellows. \nDevelop complex proposal budgets that comply with all applicable departmental, UC, and agency policies and regulations. \nInitiate and maintain ongoing, timely and effective communication with all relevant parties throughout the proposal process. Pre-Award Analyst UCSF December 2009  –  July 2010  (8 months) San Francisco Bay Area Provide high quality pre-award management for extramural funds including government and private grants, contracts, and subcontracts for the Department of Physiology for 23 primary faculty and 80 postdoctoral fellows. \nDevelop complex proposal budgets that comply with all applicable departmental, UC, and agency policies and regulations. \nInitiate and maintain ongoing, timely and effective communication with all relevant parties throughout the proposal process. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Research Teaching Proposal Writing Spanish Writing Higher Education Event Planning Grants Management Editing Public Speaking Grant Writing Analysis Educational Policy Educational Research Atlas.ti B-Line Medical Simbionix Simulator Curriculum Development Spanish Translation curriculum Tutoring See 7+     See less Skills  Research Teaching Proposal Writing Spanish Writing Higher Education Event Planning Grants Management Editing Public Speaking Grant Writing Analysis Educational Policy Educational Research Atlas.ti B-Line Medical Simbionix Simulator Curriculum Development Spanish Translation curriculum Tutoring See 7+     See less Research Teaching Proposal Writing Spanish Writing Higher Education Event Planning Grants Management Editing Public Speaking Grant Writing Analysis Educational Policy Educational Research Atlas.ti B-Line Medical Simbionix Simulator Curriculum Development Spanish Translation curriculum Tutoring See 7+     See less Research Teaching Proposal Writing Spanish Writing Higher Education Event Planning Grants Management Editing Public Speaking Grant Writing Analysis Educational Policy Educational Research Atlas.ti B-Line Medical Simbionix Simulator Curriculum Development Spanish Translation curriculum Tutoring See 7+     See less Education University of San Francisco Master of Arts (M.A.),  International and Multicultural Education 2015  – 2018 California State University-Stanislaus Bachelor of Arts (B.A.),  Liberal Studies 2005  – 2008 Universitat d'Alacant / Universidad de Alicante Spanish and Iberian Studies 2007  – 2007 University of San Francisco Master of Arts (M.A.),  International and Multicultural Education 2015  – 2018 University of San Francisco Master of Arts (M.A.),  International and Multicultural Education 2015  – 2018 University of San Francisco Master of Arts (M.A.),  International and Multicultural Education 2015  – 2018 California State University-Stanislaus Bachelor of Arts (B.A.),  Liberal Studies 2005  – 2008 California State University-Stanislaus Bachelor of Arts (B.A.),  Liberal Studies 2005  – 2008 California State University-Stanislaus Bachelor of Arts (B.A.),  Liberal Studies 2005  – 2008 Universitat d'Alacant / Universidad de Alicante Spanish and Iberian Studies 2007  – 2007 Universitat d'Alacant / Universidad de Alicante Spanish and Iberian Studies 2007  – 2007 Universitat d'Alacant / Universidad de Alicante Spanish and Iberian Studies 2007  – 2007 ", "Summary Project management, writing, editing \n \nSpecialties:  \n- Device and drug clinical trial management, from subject recruitment to journal publications \n- Research compliance and FDA audit preparation \n- Able to distill complex scientific concepts with attention to detail and accuracy \n- Highly resourceful \n- Newsroom management in electronic and print publication Summary Project management, writing, editing \n \nSpecialties:  \n- Device and drug clinical trial management, from subject recruitment to journal publications \n- Research compliance and FDA audit preparation \n- Able to distill complex scientific concepts with attention to detail and accuracy \n- Highly resourceful \n- Newsroom management in electronic and print publication Project management, writing, editing \n \nSpecialties:  \n- Device and drug clinical trial management, from subject recruitment to journal publications \n- Research compliance and FDA audit preparation \n- Able to distill complex scientific concepts with attention to detail and accuracy \n- Highly resourceful \n- Newsroom management in electronic and print publication Project management, writing, editing \n \nSpecialties:  \n- Device and drug clinical trial management, from subject recruitment to journal publications \n- Research compliance and FDA audit preparation \n- Able to distill complex scientific concepts with attention to detail and accuracy \n- Highly resourceful \n- Newsroom management in electronic and print publication Experience Clinical Research Coordinator Stanford University School of Medicine May 2011  – Present (4 years 4 months) Writer and Editor Freelance January 2010  –  May 2012  (2 years 5 months) Research Analyst Cedar Associates October 2009  –  December 2009  (3 months) Science Writing Intern 23andMe June 2009  –  November 2009  (6 months) Science Writing Intern Brookhaven National Laboratory September 2008  –  June 2009  (10 months) Editor in Chief, Copy Editor and Writer of Technograph magazine Illini Media September 2006  –  May 2008  (1 year 9 months) Systems Analyst and Communications Intern Allstate Financial June 2007  –  August 2007  (3 months) Writer: College of Engineering website University of Illinois at Urbana-Champaign September 2006  –  May 2007  (9 months) Staff reporter for The Daily Illini Illini Media September 2005  –  January 2006  (5 months) Clinical Research Coordinator Stanford University School of Medicine May 2011  – Present (4 years 4 months) Clinical Research Coordinator Stanford University School of Medicine May 2011  – Present (4 years 4 months) Writer and Editor Freelance January 2010  –  May 2012  (2 years 5 months) Writer and Editor Freelance January 2010  –  May 2012  (2 years 5 months) Research Analyst Cedar Associates October 2009  –  December 2009  (3 months) Research Analyst Cedar Associates October 2009  –  December 2009  (3 months) Science Writing Intern 23andMe June 2009  –  November 2009  (6 months) Science Writing Intern 23andMe June 2009  –  November 2009  (6 months) Science Writing Intern Brookhaven National Laboratory September 2008  –  June 2009  (10 months) Science Writing Intern Brookhaven National Laboratory September 2008  –  June 2009  (10 months) Editor in Chief, Copy Editor and Writer of Technograph magazine Illini Media September 2006  –  May 2008  (1 year 9 months) Editor in Chief, Copy Editor and Writer of Technograph magazine Illini Media September 2006  –  May 2008  (1 year 9 months) Systems Analyst and Communications Intern Allstate Financial June 2007  –  August 2007  (3 months) Systems Analyst and Communications Intern Allstate Financial June 2007  –  August 2007  (3 months) Writer: College of Engineering website University of Illinois at Urbana-Champaign September 2006  –  May 2007  (9 months) Writer: College of Engineering website University of Illinois at Urbana-Champaign September 2006  –  May 2007  (9 months) Staff reporter for The Daily Illini Illini Media September 2005  –  January 2006  (5 months) Staff reporter for The Daily Illini Illini Media September 2005  –  January 2006  (5 months) Languages English French - Intermediate Spanish - Beginner Tamil - Beginner English French - Intermediate Spanish - Beginner Tamil - Beginner English French - Intermediate Spanish - Beginner Tamil - Beginner Skills Blogging Research Feature Articles Journalism Genetics Newspapers Science Science Journalism Lifesciences Editing Newsletters Publications Press Releases Proofreading Neuroscience Science Communication Media Relations Advertising Technical Writing Publishing Creative Writing Copy Editing News Writing See 8+     See less Skills  Blogging Research Feature Articles Journalism Genetics Newspapers Science Science Journalism Lifesciences Editing Newsletters Publications Press Releases Proofreading Neuroscience Science Communication Media Relations Advertising Technical Writing Publishing Creative Writing Copy Editing News Writing See 8+     See less Blogging Research Feature Articles Journalism Genetics Newspapers Science Science Journalism Lifesciences Editing Newsletters Publications Press Releases Proofreading Neuroscience Science Communication Media Relations Advertising Technical Writing Publishing Creative Writing Copy Editing News Writing See 8+     See less Blogging Research Feature Articles Journalism Genetics Newspapers Science Science Journalism Lifesciences Editing Newsletters Publications Press Releases Proofreading Neuroscience Science Communication Media Relations Advertising Technical Writing Publishing Creative Writing Copy Editing News Writing See 8+     See less Education University of Illinois at Urbana-Champaign B.S. 2004  – 2008 University of Illinois at Urbana-Champaign B.S. 2004  – 2008 University of Illinois at Urbana-Champaign B.S. 2004  – 2008 University of Illinois at Urbana-Champaign B.S. 2004  – 2008 ", "Experience Lead Clinical Research Coordinator Stanford University School of Medicine May 2015  – Present (4 months) Clinical Research Coordinator Stanford University School of Medicine September 2013  – Present (2 years) Palo Alto, CA Clinical Research Coordinator San Francisco VA Medical Center June 2010  –  June 2011  (1 year 1 month) San Francisco Bay Area Assessor/Data Manager Oregon Social Learning Center May 2009  –  June 2010  (1 year 2 months) Eugene, Oregon Area Research Coordinator Lane Independent Living Alliance January 2008  –  September 2009  (1 year 9 months) Eugene, Oregon Clinical Research Coordinator California Clinical Trials October 2003  –  September 2006  (3 years) Glendale, CA Lead Clinical Research Coordinator Stanford University School of Medicine May 2015  – Present (4 months) Lead Clinical Research Coordinator Stanford University School of Medicine May 2015  – Present (4 months) Clinical Research Coordinator Stanford University School of Medicine September 2013  – Present (2 years) Palo Alto, CA Clinical Research Coordinator Stanford University School of Medicine September 2013  – Present (2 years) Palo Alto, CA Clinical Research Coordinator San Francisco VA Medical Center June 2010  –  June 2011  (1 year 1 month) San Francisco Bay Area Clinical Research Coordinator San Francisco VA Medical Center June 2010  –  June 2011  (1 year 1 month) San Francisco Bay Area Assessor/Data Manager Oregon Social Learning Center May 2009  –  June 2010  (1 year 2 months) Eugene, Oregon Area Assessor/Data Manager Oregon Social Learning Center May 2009  –  June 2010  (1 year 2 months) Eugene, Oregon Area Research Coordinator Lane Independent Living Alliance January 2008  –  September 2009  (1 year 9 months) Eugene, Oregon Research Coordinator Lane Independent Living Alliance January 2008  –  September 2009  (1 year 9 months) Eugene, Oregon Clinical Research Coordinator California Clinical Trials October 2003  –  September 2006  (3 years) Glendale, CA Clinical Research Coordinator California Clinical Trials October 2003  –  September 2006  (3 years) Glendale, CA Skills Psychology Clinical Research Treatment Research Mental Health Data Analysis Policy Nonprofits Microsoft Office Psychotherapy Program Evaluation Community Outreach Public Health Clinical Trials Healthcare Grant Writing See 1+     See less Skills  Psychology Clinical Research Treatment Research Mental Health Data Analysis Policy Nonprofits Microsoft Office Psychotherapy Program Evaluation Community Outreach Public Health Clinical Trials Healthcare Grant Writing See 1+     See less Psychology Clinical Research Treatment Research Mental Health Data Analysis Policy Nonprofits Microsoft Office Psychotherapy Program Evaluation Community Outreach Public Health Clinical Trials Healthcare Grant Writing See 1+     See less Psychology Clinical Research Treatment Research Mental Health Data Analysis Policy Nonprofits Microsoft Office Psychotherapy Program Evaluation Community Outreach Public Health Clinical Trials Healthcare Grant Writing See 1+     See less Education Portland State University MSW,  Social Work 2007  – 2010 Cornell University BA,  Psychology 1999  – 2003 Portland State University MSW,  Social Work 2007  – 2010 Portland State University MSW,  Social Work 2007  – 2010 Portland State University MSW,  Social Work 2007  – 2010 Cornell University BA,  Psychology 1999  – 2003 Cornell University BA,  Psychology 1999  – 2003 Cornell University BA,  Psychology 1999  – 2003 ", "Experience Clinical Research Coordinator Stanford University October 2006  – Present (8 years 11 months) Sr clinical Research Coordinator Stanford University School of Medicine October 2005  – Present (9 years 11 months) Clinical Research Coordinator Stanford University Medical Center October 2005  –  December 2014  (9 years 3 months) Clinical Research Coordinator Stanford University October 2006  – Present (8 years 11 months) Clinical Research Coordinator Stanford University October 2006  – Present (8 years 11 months) Sr clinical Research Coordinator Stanford University School of Medicine October 2005  – Present (9 years 11 months) Sr clinical Research Coordinator Stanford University School of Medicine October 2005  – Present (9 years 11 months) Clinical Research Coordinator Stanford University Medical Center October 2005  –  December 2014  (9 years 3 months) Clinical Research Coordinator Stanford University Medical Center October 2005  –  December 2014  (9 years 3 months) Skills Expertise in advanced... Skills  Expertise in advanced... Expertise in advanced... Expertise in advanced... Education 13 years experience in cancer research at Yale Medical Center 13 years experience in cancer research at Yale Medical Center 13 years experience in cancer research at Yale Medical Center 13 years experience in cancer research at Yale Medical Center ", "Skills Medical Education Medical Terminology Clinical Trials GCP Clinical Clinical Development Drug Development Drug Safety Molecular Biology Immunology Life Sciences Skills  Medical Education Medical Terminology Clinical Trials GCP Clinical Clinical Development Drug Development Drug Safety Molecular Biology Immunology Life Sciences Medical Education Medical Terminology Clinical Trials GCP Clinical Clinical Development Drug Development Drug Safety Molecular Biology Immunology Life Sciences Medical Education Medical Terminology Clinical Trials GCP Clinical Clinical Development Drug Development Drug Safety Molecular Biology Immunology Life Sciences ", "Languages English Native or bilingual proficiency Hungarian Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Hungarian Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Hungarian Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Counseling Psychology Teaching Treatment Grant Writing Hatha Yoga Skills  Counseling Psychology Teaching Treatment Grant Writing Hatha Yoga Counseling Psychology Teaching Treatment Grant Writing Hatha Yoga Counseling Psychology Teaching Treatment Grant Writing Hatha Yoga Education Alliant International University-San Francisco Bay Master's degree 2013  – 2016 Nosara Yoga Institute 200-hour Interdisciplinary Yoga Teacher Training 2010  – 2010 Szegedi Tudományegyetem Masters 2003  – 2005 Eötvös Loránd University BA 1997  – 2003 Alliant International University-San Francisco Bay Master's degree 2013  – 2016 Alliant International University-San Francisco Bay Master's degree 2013  – 2016 Alliant International University-San Francisco Bay Master's degree 2013  – 2016 Nosara Yoga Institute 200-hour Interdisciplinary Yoga Teacher Training 2010  – 2010 Nosara Yoga Institute 200-hour Interdisciplinary Yoga Teacher Training 2010  – 2010 Nosara Yoga Institute 200-hour Interdisciplinary Yoga Teacher Training 2010  – 2010 Szegedi Tudományegyetem Masters 2003  – 2005 Szegedi Tudományegyetem Masters 2003  – 2005 Szegedi Tudományegyetem Masters 2003  – 2005 Eötvös Loránd University BA 1997  – 2003 Eötvös Loránd University BA 1997  – 2003 Eötvös Loránd University BA 1997  – 2003 ", "Summary Versatile and motivated clinical research professional, with 6 years of experience in site management and medical device industry. Innovative and results-oriented, adaptable team player. Well-versed in regulatory compliance. Excellent track record of patient recruitment, enrollment, and retention. Other skill sets include medical/technical writing, statistical analysis, study design, and CRF and protocol development. Summary Versatile and motivated clinical research professional, with 6 years of experience in site management and medical device industry. Innovative and results-oriented, adaptable team player. Well-versed in regulatory compliance. Excellent track record of patient recruitment, enrollment, and retention. Other skill sets include medical/technical writing, statistical analysis, study design, and CRF and protocol development. Versatile and motivated clinical research professional, with 6 years of experience in site management and medical device industry. Innovative and results-oriented, adaptable team player. Well-versed in regulatory compliance. Excellent track record of patient recruitment, enrollment, and retention. Other skill sets include medical/technical writing, statistical analysis, study design, and CRF and protocol development. Versatile and motivated clinical research professional, with 6 years of experience in site management and medical device industry. Innovative and results-oriented, adaptable team player. Well-versed in regulatory compliance. Excellent track record of patient recruitment, enrollment, and retention. Other skill sets include medical/technical writing, statistical analysis, study design, and CRF and protocol development. Experience Clinical Research Associate ZELTIQ March 2014  – Present (1 year 6 months) Clinical Research Coordinator Stanford University January 2014  –  March 2014  (3 months) Palo Alto, CA Department of Neurology - neuromyelitis optica (NMO) research coordinator Clinical Research Associate CuraSeal inc. May 2012  –  September 2012  (5 months) Sunnyvale, CA Responsible for the development and implementation of a Phase II medical device clinical trial in Mexico City. Worked with CRO to perform site evaluations and regulatory authority submissions. Coordinated team of physicians and investigators to carry out the clinical trial and perform intermittent monitoring for protocol adherence. Developed sponsor database and managed all stages of data collection and analysis, including report and manuscript preparation. Clinical Research Consultant Pelvalon October 2011  –  June 2012  (9 months) Palo Alto, CA Clinical Trial Management: Regulatory, IRB submissions, recruitment/enrollment, patient tracking, CRF design, data management Clinical Research Consultant Neodyne Biosciences, Inc September 2011  –  January 2012  (5 months) Menlo Park, CA Clinical Research Recruitment and Enrollment Services Clinical Research Coordinator Stanford University February 2007  –  September 2011  (4 years 8 months) Managed and implemented multiple research protocols in the areas of urology, gynecologic-oncology, cardiology, and infertility. Served as liaison between principle investigators, study sponsors, patients, and institutional organizations. Set up and maintained study files for multiple NIH and industry-sponsored projects. Prepared initial clinical research study proposals for submission to the IRB and study sponsors, work with industry CRAs to monitor and review patient CRFs and source documentation; screen, interview and consent patients for new research protocols; develop and maintain databases; perform statistical analyses. Clinical Research Associate ZELTIQ March 2014  – Present (1 year 6 months) Clinical Research Associate ZELTIQ March 2014  – Present (1 year 6 months) Clinical Research Coordinator Stanford University January 2014  –  March 2014  (3 months) Palo Alto, CA Department of Neurology - neuromyelitis optica (NMO) research coordinator Clinical Research Coordinator Stanford University January 2014  –  March 2014  (3 months) Palo Alto, CA Department of Neurology - neuromyelitis optica (NMO) research coordinator Clinical Research Associate CuraSeal inc. May 2012  –  September 2012  (5 months) Sunnyvale, CA Responsible for the development and implementation of a Phase II medical device clinical trial in Mexico City. Worked with CRO to perform site evaluations and regulatory authority submissions. Coordinated team of physicians and investigators to carry out the clinical trial and perform intermittent monitoring for protocol adherence. Developed sponsor database and managed all stages of data collection and analysis, including report and manuscript preparation. Clinical Research Associate CuraSeal inc. May 2012  –  September 2012  (5 months) Sunnyvale, CA Responsible for the development and implementation of a Phase II medical device clinical trial in Mexico City. Worked with CRO to perform site evaluations and regulatory authority submissions. Coordinated team of physicians and investigators to carry out the clinical trial and perform intermittent monitoring for protocol adherence. Developed sponsor database and managed all stages of data collection and analysis, including report and manuscript preparation. Clinical Research Consultant Pelvalon October 2011  –  June 2012  (9 months) Palo Alto, CA Clinical Trial Management: Regulatory, IRB submissions, recruitment/enrollment, patient tracking, CRF design, data management Clinical Research Consultant Pelvalon October 2011  –  June 2012  (9 months) Palo Alto, CA Clinical Trial Management: Regulatory, IRB submissions, recruitment/enrollment, patient tracking, CRF design, data management Clinical Research Consultant Neodyne Biosciences, Inc September 2011  –  January 2012  (5 months) Menlo Park, CA Clinical Research Recruitment and Enrollment Services Clinical Research Consultant Neodyne Biosciences, Inc September 2011  –  January 2012  (5 months) Menlo Park, CA Clinical Research Recruitment and Enrollment Services Clinical Research Coordinator Stanford University February 2007  –  September 2011  (4 years 8 months) Managed and implemented multiple research protocols in the areas of urology, gynecologic-oncology, cardiology, and infertility. Served as liaison between principle investigators, study sponsors, patients, and institutional organizations. Set up and maintained study files for multiple NIH and industry-sponsored projects. Prepared initial clinical research study proposals for submission to the IRB and study sponsors, work with industry CRAs to monitor and review patient CRFs and source documentation; screen, interview and consent patients for new research protocols; develop and maintain databases; perform statistical analyses. Clinical Research Coordinator Stanford University February 2007  –  September 2011  (4 years 8 months) Managed and implemented multiple research protocols in the areas of urology, gynecologic-oncology, cardiology, and infertility. Served as liaison between principle investigators, study sponsors, patients, and institutional organizations. Set up and maintained study files for multiple NIH and industry-sponsored projects. Prepared initial clinical research study proposals for submission to the IRB and study sponsors, work with industry CRAs to monitor and review patient CRFs and source documentation; screen, interview and consent patients for new research protocols; develop and maintain databases; perform statistical analyses. Languages Spanish Spanish Spanish Skills Neuroscience Clinical Research Data Management Medical Devices Clinical Trials Clinical Development Biotechnology CTMS Medical Writing Regulatory Affairs GCP FDA Epidemiology IRB CRO Scientific Writing Cardiology Cancer Cell Culture Clinical Data Management Statistics Protocol Biostatistics Research Genetics EDC Clinical Monitoring Science Regulatory Submissions Cell Biology Biochemistry Molecular Biology See 17+     See less Skills  Neuroscience Clinical Research Data Management Medical Devices Clinical Trials Clinical Development Biotechnology CTMS Medical Writing Regulatory Affairs GCP FDA Epidemiology IRB CRO Scientific Writing Cardiology Cancer Cell Culture Clinical Data Management Statistics Protocol Biostatistics Research Genetics EDC Clinical Monitoring Science Regulatory Submissions Cell Biology Biochemistry Molecular Biology See 17+     See less Neuroscience Clinical Research Data Management Medical Devices Clinical Trials Clinical Development Biotechnology CTMS Medical Writing Regulatory Affairs GCP FDA Epidemiology IRB CRO Scientific Writing Cardiology Cancer Cell Culture Clinical Data Management Statistics Protocol Biostatistics Research Genetics EDC Clinical Monitoring Science Regulatory Submissions Cell Biology Biochemistry Molecular Biology See 17+     See less Neuroscience Clinical Research Data Management Medical Devices Clinical Trials Clinical Development Biotechnology CTMS Medical Writing Regulatory Affairs GCP FDA Epidemiology IRB CRO Scientific Writing Cardiology Cancer Cell Culture Clinical Data Management Statistics Protocol Biostatistics Research Genetics EDC Clinical Monitoring Science Regulatory Submissions Cell Biology Biochemistry Molecular Biology See 17+     See less Education University of California, Berkeley M.A.,  Psychology: Cognition , Brain,  Behavior 2003  – 2006 Activities and Societies:  Berkeley Science Review Brown University B.S.,  Neuroscience 1998  – 2002 Activities and Societies:  XC ,  Track and Field University of California, Berkeley M.A.,  Psychology: Cognition , Brain,  Behavior 2003  – 2006 Activities and Societies:  Berkeley Science Review University of California, Berkeley M.A.,  Psychology: Cognition , Brain,  Behavior 2003  – 2006 Activities and Societies:  Berkeley Science Review University of California, Berkeley M.A.,  Psychology: Cognition , Brain,  Behavior 2003  – 2006 Activities and Societies:  Berkeley Science Review Brown University B.S.,  Neuroscience 1998  – 2002 Activities and Societies:  XC ,  Track and Field Brown University B.S.,  Neuroscience 1998  – 2002 Activities and Societies:  XC ,  Track and Field Brown University B.S.,  Neuroscience 1998  – 2002 Activities and Societies:  XC ,  Track and Field ", "Experience Exercise Physiologist Apple December 2013  – Present (1 year 9 months) Research Health Science Specialist Department of Veterans Affairs June 2012  –  December 2013  (1 year 7 months) Palo Alto, CA Clinical Research Coordinator Stanford University Medical Center January 2010  –  December 2013  (4 years) clinical research coordinator Stanford University School of Medicine 2010  –  2012  (2 years) Exercise Physiologist Apple December 2013  – Present (1 year 9 months) Exercise Physiologist Apple December 2013  – Present (1 year 9 months) Research Health Science Specialist Department of Veterans Affairs June 2012  –  December 2013  (1 year 7 months) Palo Alto, CA Research Health Science Specialist Department of Veterans Affairs June 2012  –  December 2013  (1 year 7 months) Palo Alto, CA Clinical Research Coordinator Stanford University Medical Center January 2010  –  December 2013  (4 years) Clinical Research Coordinator Stanford University Medical Center January 2010  –  December 2013  (4 years) clinical research coordinator Stanford University School of Medicine 2010  –  2012  (2 years) clinical research coordinator Stanford University School of Medicine 2010  –  2012  (2 years) Skills Clinical Trials Research Public Health Molecular Biology Clinical Research Neuroscience Lifesciences Biochemistry Science Biotechnology Life Sciences Cell Culture Statistics Public Speaking Data Analysis Healthcare See 1+     See less Skills  Clinical Trials Research Public Health Molecular Biology Clinical Research Neuroscience Lifesciences Biochemistry Science Biotechnology Life Sciences Cell Culture Statistics Public Speaking Data Analysis Healthcare See 1+     See less Clinical Trials Research Public Health Molecular Biology Clinical Research Neuroscience Lifesciences Biochemistry Science Biotechnology Life Sciences Cell Culture Statistics Public Speaking Data Analysis Healthcare See 1+     See less Clinical Trials Research Public Health Molecular Biology Clinical Research Neuroscience Lifesciences Biochemistry Science Biotechnology Life Sciences Cell Culture Statistics Public Speaking Data Analysis Healthcare See 1+     See less Education University of California, Davis MS,  Exercise Physiology 2007  – 2008 UC Santa Cruz BS,  Biology 2000  – 2004 University of California, Davis MS,  Exercise Physiology 2007  – 2008 University of California, Davis MS,  Exercise Physiology 2007  – 2008 University of California, Davis MS,  Exercise Physiology 2007  – 2008 UC Santa Cruz BS,  Biology 2000  – 2004 UC Santa Cruz BS,  Biology 2000  – 2004 UC Santa Cruz BS,  Biology 2000  – 2004 ", "Experience Clinical Trial Manager Pharmacyclics May 2015  – Present (4 months) Sunnyvale, CA Senior Clinical Trial Manager Edison Pharmaceuticals March 2014  –  May 2015  (1 year 3 months) Senior Clinical Trial Management Associate Gilead Sciences July 2012  –  March 2014  (1 year 9 months) Foster City, CA Clinical Research Coordinator & Data Safety Monitoring Committee member Stanford University April 2011  –  July 2012  (1 year 4 months) Senior Clinical Site Manager/Lead CRA Quintiles Transnational May 2008  –  April 2011  (3 years) Clinical Trials Monitor-Data Safety Monitoring Committee Stanford University 2007  –  May 2008  (1 year) Clinical Research Coordinator Stanford University School of Medicine 2001  –  May 2008  (7 years) Research Coordinator Stanford University Medical Center 2002  –  2004  (2 years) Chief Resident Doctor Cama and Abless Hospital, Sir J J Group of Hospitals February 2000  –  February 2001  (1 year 1 month) Resident Doctor Sion Hospital (LTMGH) February 1998  –  February 2000  (2 years 1 month) Clinical Trial Manager Pharmacyclics May 2015  – Present (4 months) Sunnyvale, CA Clinical Trial Manager Pharmacyclics May 2015  – Present (4 months) Sunnyvale, CA Senior Clinical Trial Manager Edison Pharmaceuticals March 2014  –  May 2015  (1 year 3 months) Senior Clinical Trial Manager Edison Pharmaceuticals March 2014  –  May 2015  (1 year 3 months) Senior Clinical Trial Management Associate Gilead Sciences July 2012  –  March 2014  (1 year 9 months) Foster City, CA Senior Clinical Trial Management Associate Gilead Sciences July 2012  –  March 2014  (1 year 9 months) Foster City, CA Clinical Research Coordinator & Data Safety Monitoring Committee member Stanford University April 2011  –  July 2012  (1 year 4 months) Clinical Research Coordinator & Data Safety Monitoring Committee member Stanford University April 2011  –  July 2012  (1 year 4 months) Senior Clinical Site Manager/Lead CRA Quintiles Transnational May 2008  –  April 2011  (3 years) Senior Clinical Site Manager/Lead CRA Quintiles Transnational May 2008  –  April 2011  (3 years) Clinical Trials Monitor-Data Safety Monitoring Committee Stanford University 2007  –  May 2008  (1 year) Clinical Trials Monitor-Data Safety Monitoring Committee Stanford University 2007  –  May 2008  (1 year) Clinical Research Coordinator Stanford University School of Medicine 2001  –  May 2008  (7 years) Clinical Research Coordinator Stanford University School of Medicine 2001  –  May 2008  (7 years) Research Coordinator Stanford University Medical Center 2002  –  2004  (2 years) Research Coordinator Stanford University Medical Center 2002  –  2004  (2 years) Chief Resident Doctor Cama and Abless Hospital, Sir J J Group of Hospitals February 2000  –  February 2001  (1 year 1 month) Chief Resident Doctor Cama and Abless Hospital, Sir J J Group of Hospitals February 2000  –  February 2001  (1 year 1 month) Resident Doctor Sion Hospital (LTMGH) February 1998  –  February 2000  (2 years 1 month) Resident Doctor Sion Hospital (LTMGH) February 1998  –  February 2000  (2 years 1 month) Languages Marathi English Hindi Gujarati Marathi English Hindi Gujarati Marathi English Hindi Gujarati Skills Detail Oriented Great People Skills Calm Under Pressure Clinical Research Oncology Clinical Trials GCP CRO Clinical Trial... Clinical Supervision Budget Preparation Data Safety Monitoring Auditing Regulatory auditing CTMS Clinical Monitoring Surgery Clinical Development EDC Budgets Cardiology Cancer Pharmaceutical Industry Biotechnology Life Sciences IRB ICH-GCP Drug Development SOP Clinical Data Management Protocol Medical Writing Medicine See 18+     See less Skills  Detail Oriented Great People Skills Calm Under Pressure Clinical Research Oncology Clinical Trials GCP CRO Clinical Trial... Clinical Supervision Budget Preparation Data Safety Monitoring Auditing Regulatory auditing CTMS Clinical Monitoring Surgery Clinical Development EDC Budgets Cardiology Cancer Pharmaceutical Industry Biotechnology Life Sciences IRB ICH-GCP Drug Development SOP Clinical Data Management Protocol Medical Writing Medicine See 18+     See less Detail Oriented Great People Skills Calm Under Pressure Clinical Research Oncology Clinical Trials GCP CRO Clinical Trial... Clinical Supervision Budget Preparation Data Safety Monitoring Auditing Regulatory auditing CTMS Clinical Monitoring Surgery Clinical Development EDC Budgets Cardiology Cancer Pharmaceutical Industry Biotechnology Life Sciences IRB ICH-GCP Drug Development SOP Clinical Data Management Protocol Medical Writing Medicine See 18+     See less Detail Oriented Great People Skills Calm Under Pressure Clinical Research Oncology Clinical Trials GCP CRO Clinical Trial... Clinical Supervision Budget Preparation Data Safety Monitoring Auditing Regulatory auditing CTMS Clinical Monitoring Surgery Clinical Development EDC Budgets Cardiology Cancer Pharmaceutical Industry Biotechnology Life Sciences IRB ICH-GCP Drug Development SOP Clinical Data Management Protocol Medical Writing Medicine See 18+     See less Education University of California, Santa Cruz Clinical Trials Design and Management Certificate 2007  – 2008 University of Mumbai Diploma in Obstetrics and Gynecology 1991  – 2001 University of Mumbai MBBS 1991  – 1997 Grant Medical College MBBS 1991  – 1996 University of California, Santa Cruz Clinical Trials Design and Management Certificate 2007  – 2008 University of California, Santa Cruz Clinical Trials Design and Management Certificate 2007  – 2008 University of California, Santa Cruz Clinical Trials Design and Management Certificate 2007  – 2008 University of Mumbai Diploma in Obstetrics and Gynecology 1991  – 2001 University of Mumbai Diploma in Obstetrics and Gynecology 1991  – 2001 University of Mumbai Diploma in Obstetrics and Gynecology 1991  – 2001 University of Mumbai MBBS 1991  – 1997 University of Mumbai MBBS 1991  – 1997 University of Mumbai MBBS 1991  – 1997 Grant Medical College MBBS 1991  – 1996 Grant Medical College MBBS 1991  – 1996 Grant Medical College MBBS 1991  – 1996 Honors & Awards Additional Honors & Awards Best Student of the year 1991- Mahatma Gandhi Vidyalaya for standing 1st in the college in the HSC boards. Additional Honors & Awards Best Student of the year 1991- Mahatma Gandhi Vidyalaya for standing 1st in the college in the HSC boards. Additional Honors & Awards Best Student of the year 1991- Mahatma Gandhi Vidyalaya for standing 1st in the college in the HSC boards. Additional Honors & Awards Best Student of the year 1991- Mahatma Gandhi Vidyalaya for standing 1st in the college in the HSC boards. ", "Experience Clinical Research Coordinator Stanford University School of Medicine 2013  – Present (2 years) Laboratory Manager Stanford University School of Medicine 2007  –  2012  (5 years) Clinical Research Coordinator Stanford University School of Medicine 2013  – Present (2 years) Clinical Research Coordinator Stanford University School of Medicine 2013  – Present (2 years) Laboratory Manager Stanford University School of Medicine 2007  –  2012  (5 years) Laboratory Manager Stanford University School of Medicine 2007  –  2012  (5 years) Skills Laboratory Molecular Biology Cell Culture Cell Biology Life Sciences Research Skills  Laboratory Molecular Biology Cell Culture Cell Biology Life Sciences Research Laboratory Molecular Biology Cell Culture Cell Biology Life Sciences Research Laboratory Molecular Biology Cell Culture Cell Biology Life Sciences Research "]}