{"position": "Research Nurse", "company": "Stanford University", "profiles": ["Skills Clinical Research Oncology Ambulatory Patient Education Healthcare Nursing Medical/Surgical Acute Care Ambulatory Care Chemotherapy Microsoft Office Clinical Trials Ophthalmology BLS Epic Systems Patient Advocacy Hospitals Cancer Nursing Education Research IV Inpatient Patient Safety ICU See 9+     See less Skills  Clinical Research Oncology Ambulatory Patient Education Healthcare Nursing Medical/Surgical Acute Care Ambulatory Care Chemotherapy Microsoft Office Clinical Trials Ophthalmology BLS Epic Systems Patient Advocacy Hospitals Cancer Nursing Education Research IV Inpatient Patient Safety ICU See 9+     See less Clinical Research Oncology Ambulatory Patient Education Healthcare Nursing Medical/Surgical Acute Care Ambulatory Care Chemotherapy Microsoft Office Clinical Trials Ophthalmology BLS Epic Systems Patient Advocacy Hospitals Cancer Nursing Education Research IV Inpatient Patient Safety ICU See 9+     See less Clinical Research Oncology Ambulatory Patient Education Healthcare Nursing Medical/Surgical Acute Care Ambulatory Care Chemotherapy Microsoft Office Clinical Trials Ophthalmology BLS Epic Systems Patient Advocacy Hospitals Cancer Nursing Education Research IV Inpatient Patient Safety ICU See 9+     See less ", "Experience Research Nurse Stanford University July 2012  – Present (3 years 2 months) Palo Alto, CA Registered Nurse LifeConnections Health Center-Cisco Systems October 2010  –  July 2012  (1 year 10 months) San Jose Provided primary and urgent care services including triage, point-of-care testing, blood draws, wound care, treadmill stress testing, and education for internal medicine patients. Registered Nurse RockMed September 2010  –  September 2011  (1 year 1 month) Bay Area, CA Triage with rapid assessment and treatment (wounds, drug OD, ETOH, hypoglycemia, general complaints). Study Coordinator Stanford University 2000  –  2008  (8 years) Stanford, CA Coordinated a study on treating depression during pregnancy. Performed psychological interviews. Contributing author on research papers. Consultant SRI Consulting July 1998  –  December 1999  (1 year 6 months) Conducted market research on the pharmaceutical industry. Research Nurse Stanford University July 2012  – Present (3 years 2 months) Palo Alto, CA Research Nurse Stanford University July 2012  – Present (3 years 2 months) Palo Alto, CA Registered Nurse LifeConnections Health Center-Cisco Systems October 2010  –  July 2012  (1 year 10 months) San Jose Provided primary and urgent care services including triage, point-of-care testing, blood draws, wound care, treadmill stress testing, and education for internal medicine patients. Registered Nurse LifeConnections Health Center-Cisco Systems October 2010  –  July 2012  (1 year 10 months) San Jose Provided primary and urgent care services including triage, point-of-care testing, blood draws, wound care, treadmill stress testing, and education for internal medicine patients. Registered Nurse RockMed September 2010  –  September 2011  (1 year 1 month) Bay Area, CA Triage with rapid assessment and treatment (wounds, drug OD, ETOH, hypoglycemia, general complaints). Registered Nurse RockMed September 2010  –  September 2011  (1 year 1 month) Bay Area, CA Triage with rapid assessment and treatment (wounds, drug OD, ETOH, hypoglycemia, general complaints). Study Coordinator Stanford University 2000  –  2008  (8 years) Stanford, CA Coordinated a study on treating depression during pregnancy. Performed psychological interviews. Contributing author on research papers. Study Coordinator Stanford University 2000  –  2008  (8 years) Stanford, CA Coordinated a study on treating depression during pregnancy. Performed psychological interviews. Contributing author on research papers. Consultant SRI Consulting July 1998  –  December 1999  (1 year 6 months) Conducted market research on the pharmaceutical industry. Consultant SRI Consulting July 1998  –  December 1999  (1 year 6 months) Conducted market research on the pharmaceutical industry. Skills Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Skills  Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Pediatrics Clinical Research Public Health Inpatient Hospitals Healthcare Medicine Treatment Nursing Psychology Pharmaceutical Industry Clinical Trials Wound Care Patient Safety Internal Medicine Critical Care See 1+     See less Education Samuel Merritt University BSN,  Nursing 2009  – 2010 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 Samuel Merritt University BSN,  Nursing 2009  – 2010 Samuel Merritt University BSN,  Nursing 2009  – 2010 Samuel Merritt University BSN,  Nursing 2009  – 2010 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 University of California, Davis Bachelor of Science (BS),  Physiology 1983  – 1986 ", "Experience Research Nurse Stanford University December 2014  – Present (9 months) Palo Alto, CA Infusion RN and Study Coordinator Bay Area Arthritis Care October 2013  –  November 2014  (1 year 2 months) San Jose, CA Clinical Research Nurse Global Cancer Research Institute, Inc., November 2012  –  October 2014  (2 years) San Jose Home Health Nurse Amity Home Health June 2013  –  September 2014  (1 year 4 months) Hayward, CA Abstracts Abstracts 2013  –  2014  (1 year) Abstracts Ta Park, V.M., Goyal, D., Lien, H., Le, N., & Rosidi, D. 2013 American Public Health Association Annual Meeting. Abstract # 281367. Vietnamese mothers’ perceptions of and experiences with postpartum traditions, postpartum depression, and help-seeking. \n \nTa Park, V.M., Goyal, D., Rosidi, D.*, Lien, H.*, & Le, N.* 2014 American Public Health Association Annual Meeting. Cultural perceptions and experiences on postpartum depression and associated traditions and help-seeking behaviors among Vietnamese, Chinese and Asian Indian mothers. \n \nTa Park, V.M., Goyal, D., Lien, H., Le, N., & Rosidi, D. 2013 AcademyHealth Annual Meeting. Perceptions of Postpartum Traditions, Postpartum Depression, and Help-Seeking among Vietnamese American Mothers. Research Assistant San Jose State University January 2012  –  March 2013  (1 year 3 months) San Jose Registered Nurse/Charge Nurse Kyakameena Skilled Nursing April 2012  –  September 2012  (6 months) Nursing Student Representative Kaplan August 2011  –  December 2011  (5 months) San Jose State University Skills Lab Assistant San Jose State University August 2011  –  November 2011  (4 months) Student RN Preceptee Barton Hospital, Emergency Department June 2011  –  July 2011  (2 months) South Lake Tahoe Nursing Simulation (SIM) Laboratory Assistant San Jose State University August 2010  –  December 2010  (5 months) Research Nurse Stanford University December 2014  – Present (9 months) Palo Alto, CA Research Nurse Stanford University December 2014  – Present (9 months) Palo Alto, CA Infusion RN and Study Coordinator Bay Area Arthritis Care October 2013  –  November 2014  (1 year 2 months) San Jose, CA Infusion RN and Study Coordinator Bay Area Arthritis Care October 2013  –  November 2014  (1 year 2 months) San Jose, CA Clinical Research Nurse Global Cancer Research Institute, Inc., November 2012  –  October 2014  (2 years) San Jose Clinical Research Nurse Global Cancer Research Institute, Inc., November 2012  –  October 2014  (2 years) San Jose Home Health Nurse Amity Home Health June 2013  –  September 2014  (1 year 4 months) Hayward, CA Home Health Nurse Amity Home Health June 2013  –  September 2014  (1 year 4 months) Hayward, CA Abstracts Abstracts 2013  –  2014  (1 year) Abstracts Ta Park, V.M., Goyal, D., Lien, H., Le, N., & Rosidi, D. 2013 American Public Health Association Annual Meeting. Abstract # 281367. Vietnamese mothers’ perceptions of and experiences with postpartum traditions, postpartum depression, and help-seeking. \n \nTa Park, V.M., Goyal, D., Rosidi, D.*, Lien, H.*, & Le, N.* 2014 American Public Health Association Annual Meeting. Cultural perceptions and experiences on postpartum depression and associated traditions and help-seeking behaviors among Vietnamese, Chinese and Asian Indian mothers. \n \nTa Park, V.M., Goyal, D., Lien, H., Le, N., & Rosidi, D. 2013 AcademyHealth Annual Meeting. Perceptions of Postpartum Traditions, Postpartum Depression, and Help-Seeking among Vietnamese American Mothers. Abstracts Abstracts 2013  –  2014  (1 year) Abstracts Ta Park, V.M., Goyal, D., Lien, H., Le, N., & Rosidi, D. 2013 American Public Health Association Annual Meeting. Abstract # 281367. Vietnamese mothers’ perceptions of and experiences with postpartum traditions, postpartum depression, and help-seeking. \n \nTa Park, V.M., Goyal, D., Rosidi, D.*, Lien, H.*, & Le, N.* 2014 American Public Health Association Annual Meeting. Cultural perceptions and experiences on postpartum depression and associated traditions and help-seeking behaviors among Vietnamese, Chinese and Asian Indian mothers. \n \nTa Park, V.M., Goyal, D., Lien, H., Le, N., & Rosidi, D. 2013 AcademyHealth Annual Meeting. Perceptions of Postpartum Traditions, Postpartum Depression, and Help-Seeking among Vietnamese American Mothers. Research Assistant San Jose State University January 2012  –  March 2013  (1 year 3 months) San Jose Research Assistant San Jose State University January 2012  –  March 2013  (1 year 3 months) San Jose Registered Nurse/Charge Nurse Kyakameena Skilled Nursing April 2012  –  September 2012  (6 months) Registered Nurse/Charge Nurse Kyakameena Skilled Nursing April 2012  –  September 2012  (6 months) Nursing Student Representative Kaplan August 2011  –  December 2011  (5 months) San Jose State University Nursing Student Representative Kaplan August 2011  –  December 2011  (5 months) San Jose State University Skills Lab Assistant San Jose State University August 2011  –  November 2011  (4 months) Skills Lab Assistant San Jose State University August 2011  –  November 2011  (4 months) Student RN Preceptee Barton Hospital, Emergency Department June 2011  –  July 2011  (2 months) South Lake Tahoe Student RN Preceptee Barton Hospital, Emergency Department June 2011  –  July 2011  (2 months) South Lake Tahoe Nursing Simulation (SIM) Laboratory Assistant San Jose State University August 2010  –  December 2010  (5 months) Nursing Simulation (SIM) Laboratory Assistant San Jose State University August 2010  –  December 2010  (5 months) Languages English Native or bilingual proficiency Vietnamese Native or bilingual proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Customer Service Tutoring Organizational... Internet Research Intercultural... Community Outreach Cpr Certified Patient Advocacy ACLS BLS Clinical Research Critical Thinking EMR Health Education Healthcare IV Teamwork See 2+     See less Skills  Customer Service Tutoring Organizational... Internet Research Intercultural... Community Outreach Cpr Certified Patient Advocacy ACLS BLS Clinical Research Critical Thinking EMR Health Education Healthcare IV Teamwork See 2+     See less Customer Service Tutoring Organizational... Internet Research Intercultural... Community Outreach Cpr Certified Patient Advocacy ACLS BLS Clinical Research Critical Thinking EMR Health Education Healthcare IV Teamwork See 2+     See less Customer Service Tutoring Organizational... Internet Research Intercultural... Community Outreach Cpr Certified Patient Advocacy ACLS BLS Clinical Research Critical Thinking EMR Health Education Healthcare IV Teamwork See 2+     See less Education Chabot College Transfer,  General Education San Jose State University BSN,  Nursing Activities and Societies:  * Phi Kappa Phi Theta Honor Society ,  SJSU Public Health Club ,  Maternal Child/Pediatrics Club UC Davis Biochemistry Chabot College Transfer,  General Education Chabot College Transfer,  General Education Chabot College Transfer,  General Education San Jose State University BSN,  Nursing Activities and Societies:  * Phi Kappa Phi Theta Honor Society ,  SJSU Public Health Club ,  Maternal Child/Pediatrics Club San Jose State University BSN,  Nursing Activities and Societies:  * Phi Kappa Phi Theta Honor Society ,  SJSU Public Health Club ,  Maternal Child/Pediatrics Club San Jose State University BSN,  Nursing Activities and Societies:  * Phi Kappa Phi Theta Honor Society ,  SJSU Public Health Club ,  Maternal Child/Pediatrics Club UC Davis Biochemistry UC Davis Biochemistry UC Davis Biochemistry Honors & Awards Cum Laude Academic Honor San Jose State University December 2011 Honor List Chabot College from 2004-2006, 2008 Additional Honors & Awards - SJSU Cum Laude Honor: 2008-2011 \n- Chabot College Honor List: 2004-2006, 2008 Cum Laude Academic Honor San Jose State University December 2011 Cum Laude Academic Honor San Jose State University December 2011 Cum Laude Academic Honor San Jose State University December 2011 Honor List Chabot College from 2004-2006, 2008 Honor List Chabot College from 2004-2006, 2008 Honor List Chabot College from 2004-2006, 2008 Additional Honors & Awards - SJSU Cum Laude Honor: 2008-2011 \n- Chabot College Honor List: 2004-2006, 2008 Additional Honors & Awards - SJSU Cum Laude Honor: 2008-2011 \n- Chabot College Honor List: 2004-2006, 2008 Additional Honors & Awards - SJSU Cum Laude Honor: 2008-2011 \n- Chabot College Honor List: 2004-2006, 2008 ", "Experience Psychiatric Nurse Practitioner Adventist Clearlake Health Center August 2009  – Present (6 years 1 month) Provide medication management and supportive therapy for a diverse client population in a rural health clinic. Provide treatment for clients with mild to severe mental illnesses. Psychiatric Nurse Practitioner Consultant Self March 2011  –  August 2012  (1 year 6 months) Provided medication management and therapy for a diverse client population in a private office. Provided treatment for clients with a wide range of mental illnesses. Registered Nurse Stanford Hospital and Clinics September 2000  –  May 2009  (8 years 9 months) Provided triage, phone advice, direct patient care and after-hours urgent care at Vaden Health Center, Stanford’s student health center. Conducted a pediatric immunization clinic from 2000 until it’s closure in 2005. Nurse Practitioner O.M.I. Family Center September 2007  –  April 2008  (8 months) Provided medication management and supportive therapy for a diverse client population at a county mental health clinic. This fellowship was coordinated through U.C.S.F. Registered Nurse Consultant Self March 1997  –  June 1999  (2 years 4 months) Provided nursing services, care planning, assessments, inservice training, and patient advocacy for developmentally disabled adolescents. (Crestview Group Home, Belmont, California) \n Registered Nurse Stanford Student Health Services/Palo Alto Medical Foundation September 1988  –  September 1996  (8 years 1 month) Cowell Student Health Center, Stanford Provided urgent care in outpatient clinic. Provided telephone advice. Functioned as triage nurse. Worked independently in nurse-run clinic after hours.  Registered Nurse Stanford University Hospital R.N February 1982  –  June 1988  (6 years 5 months) Provided nursing care in acute medical/neurology (2/82—6/84) and a behavioral medicine (6/84—6/88). Research Nurse Stanford University June 1985  –  March 1988  (2 years 10 months) Managed research projects, coordinated outpatient studies, wrote study outlines, dispensed research medication and assessed drug effectiveness, followed research protocols, screened and recruited patients, conducted structured diagnostic interviews, \nobtained informed consent, scheduled testing and procedures, maintained patient records and performed and assisted with procedures for the purpose of investigating the biological causes of mental illnesses. Psychiatric Nurse Practitioner Adventist Clearlake Health Center August 2009  – Present (6 years 1 month) Provide medication management and supportive therapy for a diverse client population in a rural health clinic. Provide treatment for clients with mild to severe mental illnesses. Psychiatric Nurse Practitioner Adventist Clearlake Health Center August 2009  – Present (6 years 1 month) Provide medication management and supportive therapy for a diverse client population in a rural health clinic. Provide treatment for clients with mild to severe mental illnesses. Psychiatric Nurse Practitioner Consultant Self March 2011  –  August 2012  (1 year 6 months) Provided medication management and therapy for a diverse client population in a private office. Provided treatment for clients with a wide range of mental illnesses. Psychiatric Nurse Practitioner Consultant Self March 2011  –  August 2012  (1 year 6 months) Provided medication management and therapy for a diverse client population in a private office. Provided treatment for clients with a wide range of mental illnesses. Registered Nurse Stanford Hospital and Clinics September 2000  –  May 2009  (8 years 9 months) Provided triage, phone advice, direct patient care and after-hours urgent care at Vaden Health Center, Stanford’s student health center. Conducted a pediatric immunization clinic from 2000 until it’s closure in 2005. Registered Nurse Stanford Hospital and Clinics September 2000  –  May 2009  (8 years 9 months) Provided triage, phone advice, direct patient care and after-hours urgent care at Vaden Health Center, Stanford’s student health center. Conducted a pediatric immunization clinic from 2000 until it’s closure in 2005. Nurse Practitioner O.M.I. Family Center September 2007  –  April 2008  (8 months) Provided medication management and supportive therapy for a diverse client population at a county mental health clinic. This fellowship was coordinated through U.C.S.F. Nurse Practitioner O.M.I. Family Center September 2007  –  April 2008  (8 months) Provided medication management and supportive therapy for a diverse client population at a county mental health clinic. This fellowship was coordinated through U.C.S.F. Registered Nurse Consultant Self March 1997  –  June 1999  (2 years 4 months) Provided nursing services, care planning, assessments, inservice training, and patient advocacy for developmentally disabled adolescents. (Crestview Group Home, Belmont, California) \n Registered Nurse Consultant Self March 1997  –  June 1999  (2 years 4 months) Provided nursing services, care planning, assessments, inservice training, and patient advocacy for developmentally disabled adolescents. (Crestview Group Home, Belmont, California) \n Registered Nurse Stanford Student Health Services/Palo Alto Medical Foundation September 1988  –  September 1996  (8 years 1 month) Cowell Student Health Center, Stanford Provided urgent care in outpatient clinic. Provided telephone advice. Functioned as triage nurse. Worked independently in nurse-run clinic after hours.  Registered Nurse Stanford Student Health Services/Palo Alto Medical Foundation September 1988  –  September 1996  (8 years 1 month) Cowell Student Health Center, Stanford Provided urgent care in outpatient clinic. Provided telephone advice. Functioned as triage nurse. Worked independently in nurse-run clinic after hours.  Registered Nurse Stanford University Hospital R.N February 1982  –  June 1988  (6 years 5 months) Provided nursing care in acute medical/neurology (2/82—6/84) and a behavioral medicine (6/84—6/88). Registered Nurse Stanford University Hospital R.N February 1982  –  June 1988  (6 years 5 months) Provided nursing care in acute medical/neurology (2/82—6/84) and a behavioral medicine (6/84—6/88). Research Nurse Stanford University June 1985  –  March 1988  (2 years 10 months) Managed research projects, coordinated outpatient studies, wrote study outlines, dispensed research medication and assessed drug effectiveness, followed research protocols, screened and recruited patients, conducted structured diagnostic interviews, \nobtained informed consent, scheduled testing and procedures, maintained patient records and performed and assisted with procedures for the purpose of investigating the biological causes of mental illnesses. Research Nurse Stanford University June 1985  –  March 1988  (2 years 10 months) Managed research projects, coordinated outpatient studies, wrote study outlines, dispensed research medication and assessed drug effectiveness, followed research protocols, screened and recruited patients, conducted structured diagnostic interviews, \nobtained informed consent, scheduled testing and procedures, maintained patient records and performed and assisted with procedures for the purpose of investigating the biological causes of mental illnesses. Skills Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Skills  Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Psychiatric Nurse... Mental Health Nurse... ANCC Adult Psychiatric... Certified Clinical... California Furnishing... NPI DEA (former) ANCC Adult... Education University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship University of California, San Francisco Fellowship,  Psychiatric/Mental Health Nursing 2007  – 2008 Post Graduate Fellowship UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center UCSF School of Nursing Master of Science,  Nursing 2005  – 2007 Adult Nurse Practitioner \nPsychiatric/Mental Health Nurse Practitioner Activities and Societies:  Transformational Scholarship ,  Stanford University Medical Center Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Samuel Merritt College Bachelor of Science,  Nursing 1999  – 2000 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 Marian College, Indianapolis, Indiana Associate Degree,  Nursing 1980  – 1981 ", "Summary Over 20 years of nursing experience with strong focus in Clinical Research and Refugee Health. My practice background includes pediatric and adult medical/surgical nursing, Case Management and Study Coordination. \n \nSpecialized in: Allergy and Infectious Disease; HIV; Parasitic Diseases; Refugee Health \n \nSkilled in: Clinical Trials Management; Institutional Review Board (IRB) preparation and management, Data Base design and utility, Protocol design and implementation. Summary Over 20 years of nursing experience with strong focus in Clinical Research and Refugee Health. My practice background includes pediatric and adult medical/surgical nursing, Case Management and Study Coordination. \n \nSpecialized in: Allergy and Infectious Disease; HIV; Parasitic Diseases; Refugee Health \n \nSkilled in: Clinical Trials Management; Institutional Review Board (IRB) preparation and management, Data Base design and utility, Protocol design and implementation. Over 20 years of nursing experience with strong focus in Clinical Research and Refugee Health. My practice background includes pediatric and adult medical/surgical nursing, Case Management and Study Coordination. \n \nSpecialized in: Allergy and Infectious Disease; HIV; Parasitic Diseases; Refugee Health \n \nSkilled in: Clinical Trials Management; Institutional Review Board (IRB) preparation and management, Data Base design and utility, Protocol design and implementation. Over 20 years of nursing experience with strong focus in Clinical Research and Refugee Health. My practice background includes pediatric and adult medical/surgical nursing, Case Management and Study Coordination. \n \nSpecialized in: Allergy and Infectious Disease; HIV; Parasitic Diseases; Refugee Health \n \nSkilled in: Clinical Trials Management; Institutional Review Board (IRB) preparation and management, Data Base design and utility, Protocol design and implementation. Experience Case Manager National Institutes of Health July 2013  – Present (2 years 2 months) Bethesda, MD Part time Case Manager /clinical support for the National Institutes of Allergy and Infectious Disease (NIAID) - Division of Intramural Research (DIR) program which specializes in Lyme Disease, Epstein-Barr virus (EBV), herpes simplex virus (HSV), varicella-zoster virus (VZV), and cytomegalovirus (CMV) and other novel viruses. Community Health Nurse II Department of Health and Human Services - Montgomery County April 2012  –  July 2012  (4 months) Silver Spring, MD Provides health screening and vaccination services for Refugees and Asylees resettling in Montgomery County. Senior Nurse Officer / Nurse Consultant / Study Coordinator National Institutes of Health September 1998  –  March 2011  (12 years 7 months) Retired CDR in the United States Public Health Service. During my early tenure in this position I served as the sole Case Manger and Study Coordinator and while doing so developed the roles for both. In the later years, as the service unit expanded, I operated as the senior Study Coordinator and team lead where I managed ten research studies with 251 active subjects; carried out subject recruitment/scheduling; obtained informed consent; performed data entry and retrieval; oriented and mentored junior staff ; wrote, reviewed & revised protocol and consent documents and submitted reports to the Investigational Review Board as well as other ancillary duties. Senior Assistant Nurse Officer / Research Case Manager National Institutes of Health October 1997  –  September 1998  (1 year) Case manager for adult HIV/AIDS research participants & healthy volunteers who were participating in complex phase I, II and III research protocols. Role included performing daily patient assessments and symptom directed physical examinations; providing treatment of adverse events; perform ing phone triage as needed. Senior Assistant Nurse Officer National Institutes of Health February 1997  –  September 1997  (8 months) Provided medical/surgical nursing care to adult patients with complex immunological diseases who were participating in complex phase I, II and III research protocols to include a four-month detail to the Outpatient HIV clinic, functioning in the role of a Case Manager. Research Nurse Stanford University February 1996  –  July 1996  (6 months) Performed preliminary and follow-up patient assessments; phone triage; provided emotional support; provided study, resource and general medical information for HIV+ participants enrolled in an investigational medication research trial. Nurse Researcher II Davies Medical Center September 1995  –  February 1996  (6 months) Primary assignment was as a nurse researcher for a phase II new drug clinical trial for HIV+ participants. Duties included recruitment, screening, carrying out all aspects of pharmacokinetics study as well as data collection management. Also had ancillary duties as assigned to include preparing reports for the Investigational Review Board. Assistant Nurse Officer National Institutes of Health May 1990  –  July 1995  (5 years 3 months) Worked as a medical surgical staff nurse caring for paitents with a variety of allergic and infectious diseases who were participating on phase I, II and III clinical trials. Also worked as a Nurse Coordinator for Outpatient Day Hospital for the same population of patients. Case Manager National Institutes of Health July 2013  – Present (2 years 2 months) Bethesda, MD Part time Case Manager /clinical support for the National Institutes of Allergy and Infectious Disease (NIAID) - Division of Intramural Research (DIR) program which specializes in Lyme Disease, Epstein-Barr virus (EBV), herpes simplex virus (HSV), varicella-zoster virus (VZV), and cytomegalovirus (CMV) and other novel viruses. Case Manager National Institutes of Health July 2013  – Present (2 years 2 months) Bethesda, MD Part time Case Manager /clinical support for the National Institutes of Allergy and Infectious Disease (NIAID) - Division of Intramural Research (DIR) program which specializes in Lyme Disease, Epstein-Barr virus (EBV), herpes simplex virus (HSV), varicella-zoster virus (VZV), and cytomegalovirus (CMV) and other novel viruses. Community Health Nurse II Department of Health and Human Services - Montgomery County April 2012  –  July 2012  (4 months) Silver Spring, MD Provides health screening and vaccination services for Refugees and Asylees resettling in Montgomery County. Community Health Nurse II Department of Health and Human Services - Montgomery County April 2012  –  July 2012  (4 months) Silver Spring, MD Provides health screening and vaccination services for Refugees and Asylees resettling in Montgomery County. Senior Nurse Officer / Nurse Consultant / Study Coordinator National Institutes of Health September 1998  –  March 2011  (12 years 7 months) Retired CDR in the United States Public Health Service. During my early tenure in this position I served as the sole Case Manger and Study Coordinator and while doing so developed the roles for both. In the later years, as the service unit expanded, I operated as the senior Study Coordinator and team lead where I managed ten research studies with 251 active subjects; carried out subject recruitment/scheduling; obtained informed consent; performed data entry and retrieval; oriented and mentored junior staff ; wrote, reviewed & revised protocol and consent documents and submitted reports to the Investigational Review Board as well as other ancillary duties. Senior Nurse Officer / Nurse Consultant / Study Coordinator National Institutes of Health September 1998  –  March 2011  (12 years 7 months) Retired CDR in the United States Public Health Service. During my early tenure in this position I served as the sole Case Manger and Study Coordinator and while doing so developed the roles for both. In the later years, as the service unit expanded, I operated as the senior Study Coordinator and team lead where I managed ten research studies with 251 active subjects; carried out subject recruitment/scheduling; obtained informed consent; performed data entry and retrieval; oriented and mentored junior staff ; wrote, reviewed & revised protocol and consent documents and submitted reports to the Investigational Review Board as well as other ancillary duties. Senior Assistant Nurse Officer / Research Case Manager National Institutes of Health October 1997  –  September 1998  (1 year) Case manager for adult HIV/AIDS research participants & healthy volunteers who were participating in complex phase I, II and III research protocols. Role included performing daily patient assessments and symptom directed physical examinations; providing treatment of adverse events; perform ing phone triage as needed. Senior Assistant Nurse Officer / Research Case Manager National Institutes of Health October 1997  –  September 1998  (1 year) Case manager for adult HIV/AIDS research participants & healthy volunteers who were participating in complex phase I, II and III research protocols. Role included performing daily patient assessments and symptom directed physical examinations; providing treatment of adverse events; perform ing phone triage as needed. Senior Assistant Nurse Officer National Institutes of Health February 1997  –  September 1997  (8 months) Provided medical/surgical nursing care to adult patients with complex immunological diseases who were participating in complex phase I, II and III research protocols to include a four-month detail to the Outpatient HIV clinic, functioning in the role of a Case Manager. Senior Assistant Nurse Officer National Institutes of Health February 1997  –  September 1997  (8 months) Provided medical/surgical nursing care to adult patients with complex immunological diseases who were participating in complex phase I, II and III research protocols to include a four-month detail to the Outpatient HIV clinic, functioning in the role of a Case Manager. Research Nurse Stanford University February 1996  –  July 1996  (6 months) Performed preliminary and follow-up patient assessments; phone triage; provided emotional support; provided study, resource and general medical information for HIV+ participants enrolled in an investigational medication research trial. Research Nurse Stanford University February 1996  –  July 1996  (6 months) Performed preliminary and follow-up patient assessments; phone triage; provided emotional support; provided study, resource and general medical information for HIV+ participants enrolled in an investigational medication research trial. Nurse Researcher II Davies Medical Center September 1995  –  February 1996  (6 months) Primary assignment was as a nurse researcher for a phase II new drug clinical trial for HIV+ participants. Duties included recruitment, screening, carrying out all aspects of pharmacokinetics study as well as data collection management. Also had ancillary duties as assigned to include preparing reports for the Investigational Review Board. Nurse Researcher II Davies Medical Center September 1995  –  February 1996  (6 months) Primary assignment was as a nurse researcher for a phase II new drug clinical trial for HIV+ participants. Duties included recruitment, screening, carrying out all aspects of pharmacokinetics study as well as data collection management. Also had ancillary duties as assigned to include preparing reports for the Investigational Review Board. Assistant Nurse Officer National Institutes of Health May 1990  –  July 1995  (5 years 3 months) Worked as a medical surgical staff nurse caring for paitents with a variety of allergic and infectious diseases who were participating on phase I, II and III clinical trials. Also worked as a Nurse Coordinator for Outpatient Day Hospital for the same population of patients. Assistant Nurse Officer National Institutes of Health May 1990  –  July 1995  (5 years 3 months) Worked as a medical surgical staff nurse caring for paitents with a variety of allergic and infectious diseases who were participating on phase I, II and III clinical trials. Also worked as a Nurse Coordinator for Outpatient Day Hospital for the same population of patients. Skills CPR Certified Research Nursing Clinical Research Infectious Diseases Clinical Trials Healthcare Clinical Microsoft Office Databases Database Design Data Entry Data Extraction Database Management Global Health Parasitic Diseases Investigational Review... Case Management Study Coordination Study Management Medical Research Annual Reports Protocol Development Routing Protocols Protocol Writing Protocol Management Health HIV/AIDS Refugee Health Vaccinations Phlebotomy Protocol See 17+     See less Skills  CPR Certified Research Nursing Clinical Research Infectious Diseases Clinical Trials Healthcare Clinical Microsoft Office Databases Database Design Data Entry Data Extraction Database Management Global Health Parasitic Diseases Investigational Review... Case Management Study Coordination Study Management Medical Research Annual Reports Protocol Development Routing Protocols Protocol Writing Protocol Management Health HIV/AIDS Refugee Health Vaccinations Phlebotomy Protocol See 17+     See less CPR Certified Research Nursing Clinical Research Infectious Diseases Clinical Trials Healthcare Clinical Microsoft Office Databases Database Design Data Entry Data Extraction Database Management Global Health Parasitic Diseases Investigational Review... Case Management Study Coordination Study Management Medical Research Annual Reports Protocol Development Routing Protocols Protocol Writing Protocol Management Health HIV/AIDS Refugee Health Vaccinations Phlebotomy Protocol See 17+     See less CPR Certified Research Nursing Clinical Research Infectious Diseases Clinical Trials Healthcare Clinical Microsoft Office Databases Database Design Data Entry Data Extraction Database Management Global Health Parasitic Diseases Investigational Review... Case Management Study Coordination Study Management Medical Research Annual Reports Protocol Development Routing Protocols Protocol Writing Protocol Management Health HIV/AIDS Refugee Health Vaccinations Phlebotomy Protocol See 17+     See less Education University of Maryland Baltimore Bachelor of Science,  Nursing 1988  – 1990 University of Maryland Baltimore County undergraduate studies 1985  – 1988 University of Maryland Baltimore Bachelor of Science,  Nursing 1988  – 1990 University of Maryland Baltimore Bachelor of Science,  Nursing 1988  – 1990 University of Maryland Baltimore Bachelor of Science,  Nursing 1988  – 1990 University of Maryland Baltimore County undergraduate studies 1985  – 1988 University of Maryland Baltimore County undergraduate studies 1985  – 1988 University of Maryland Baltimore County undergraduate studies 1985  – 1988 Honors & Awards Additional Honors & Awards USPHS Unit Commendation Medal November 2010\t \nUSPHS Unit Commendation Medal June 2009\t \nUSPHS Achievement Medal June 2008\t \nUSPHS Unit Commendation Aug 2001 \nUSPHS Bicentennial Unit Commendation\tJan 1998\t \nUSPHS Achievement Medal July 1993 Additional Honors & Awards USPHS Unit Commendation Medal November 2010\t \nUSPHS Unit Commendation Medal June 2009\t \nUSPHS Achievement Medal June 2008\t \nUSPHS Unit Commendation Aug 2001 \nUSPHS Bicentennial Unit Commendation\tJan 1998\t \nUSPHS Achievement Medal July 1993 Additional Honors & Awards USPHS Unit Commendation Medal November 2010\t \nUSPHS Unit Commendation Medal June 2009\t \nUSPHS Achievement Medal June 2008\t \nUSPHS Unit Commendation Aug 2001 \nUSPHS Bicentennial Unit Commendation\tJan 1998\t \nUSPHS Achievement Medal July 1993 Additional Honors & Awards USPHS Unit Commendation Medal November 2010\t \nUSPHS Unit Commendation Medal June 2009\t \nUSPHS Achievement Medal June 2008\t \nUSPHS Unit Commendation Aug 2001 \nUSPHS Bicentennial Unit Commendation\tJan 1998\t \nUSPHS Achievement Medal July 1993 ", "Skills Fundraising Clinical Trials Medical Devices Clinical Research FDA Start-ups Training Protocol Strategy GCP CRO Oncology Hospitals Regulatory Submissions Healthcare CTMS Data Analysis Medicine Management Public Health Lifesciences Clinical Development Program Management Leadership Infectious Diseases Research Informatics Life Sciences See 13+     See less Skills  Fundraising Clinical Trials Medical Devices Clinical Research FDA Start-ups Training Protocol Strategy GCP CRO Oncology Hospitals Regulatory Submissions Healthcare CTMS Data Analysis Medicine Management Public Health Lifesciences Clinical Development Program Management Leadership Infectious Diseases Research Informatics Life Sciences See 13+     See less Fundraising Clinical Trials Medical Devices Clinical Research FDA Start-ups Training Protocol Strategy GCP CRO Oncology Hospitals Regulatory Submissions Healthcare CTMS Data Analysis Medicine Management Public Health Lifesciences Clinical Development Program Management Leadership Infectious Diseases Research Informatics Life Sciences See 13+     See less Fundraising Clinical Trials Medical Devices Clinical Research FDA Start-ups Training Protocol Strategy GCP CRO Oncology Hospitals Regulatory Submissions Healthcare CTMS Data Analysis Medicine Management Public Health Lifesciences Clinical Development Program Management Leadership Infectious Diseases Research Informatics Life Sciences See 13+     See less Education Harvard T.H. Chan School of Public Health certificate of public health 1987  – 1989 Boston College Nursing 1982  – 1986 Harvard T.H. Chan School of Public Health certificate of public health 1987  – 1989 Harvard T.H. Chan School of Public Health certificate of public health 1987  – 1989 Harvard T.H. Chan School of Public Health certificate of public health 1987  – 1989 Boston College Nursing 1982  – 1986 Boston College Nursing 1982  – 1986 Boston College Nursing 1982  – 1986 ", "Experience Nurse Practitioner UC Davis Health System Emergency Room Nurse Kaiser Permanente 2002  –  2004  (2 years) Pediatric Research Nurse Stanford University Medical Center 2000  –  2002  (2 years) Staff Nurse I & II Mt. Diablo Medical Center 1999  –  2000  (1 year) Nurse Practitioner UC Davis Health System Nurse Practitioner UC Davis Health System Emergency Room Nurse Kaiser Permanente 2002  –  2004  (2 years) Emergency Room Nurse Kaiser Permanente 2002  –  2004  (2 years) Pediatric Research Nurse Stanford University Medical Center 2000  –  2002  (2 years) Pediatric Research Nurse Stanford University Medical Center 2000  –  2002  (2 years) Staff Nurse I & II Mt. Diablo Medical Center 1999  –  2000  (1 year) Staff Nurse I & II Mt. Diablo Medical Center 1999  –  2000  (1 year) Education University of California, San Francisco MSN,  Nursing 2002  – 2004 The Johns Hopkins University BSN,  Nursing 1998  – 1999 University of California, Davis BS,  Genetics ,  Spanish 1992  – 1996 St. Louis University, Madrid Campus Spanish 1994  – 1994 University of California, San Francisco MSN,  Nursing 2002  – 2004 University of California, San Francisco MSN,  Nursing 2002  – 2004 University of California, San Francisco MSN,  Nursing 2002  – 2004 The Johns Hopkins University BSN,  Nursing 1998  – 1999 The Johns Hopkins University BSN,  Nursing 1998  – 1999 The Johns Hopkins University BSN,  Nursing 1998  – 1999 University of California, Davis BS,  Genetics ,  Spanish 1992  – 1996 University of California, Davis BS,  Genetics ,  Spanish 1992  – 1996 University of California, Davis BS,  Genetics ,  Spanish 1992  – 1996 St. Louis University, Madrid Campus Spanish 1994  – 1994 St. Louis University, Madrid Campus Spanish 1994  – 1994 St. Louis University, Madrid Campus Spanish 1994  – 1994 ", "Experience Research Nurse Stanford University January 2006  – Present (9 years 8 months) Research Nurse Stanford University 2006  –  2013  (7 years) Research Nurse Stanford University January 2006  – Present (9 years 8 months) Research Nurse Stanford University January 2006  – Present (9 years 8 months) Research Nurse Stanford University 2006  –  2013  (7 years) Research Nurse Stanford University 2006  –  2013  (7 years) ", "Experience Clinical Research Stanford University School of Medicine May 2006  – Present (9 years 4 months) Stanford School of Medicine - Clinical Research Translation Unit Clinical Research Nurse Stanford University February 2006  – Present (9 years 7 months) Clinical Research Nurse Stanford University Medical Center August 2007  –  May 2013  (5 years 10 months) Stanford School of Medicine Pediatric Stem Cell Transplantation Program. Responsible for clinical trials compliance and FDA submissions. Co-chair of quality and process improvement committee. Clinical Research Stanford University School of Medicine May 2006  – Present (9 years 4 months) Stanford School of Medicine - Clinical Research Translation Unit Clinical Research Stanford University School of Medicine May 2006  – Present (9 years 4 months) Stanford School of Medicine - Clinical Research Translation Unit Clinical Research Nurse Stanford University February 2006  – Present (9 years 7 months) Clinical Research Nurse Stanford University February 2006  – Present (9 years 7 months) Clinical Research Nurse Stanford University Medical Center August 2007  –  May 2013  (5 years 10 months) Stanford School of Medicine Pediatric Stem Cell Transplantation Program. Responsible for clinical trials compliance and FDA submissions. Co-chair of quality and process improvement committee. Clinical Research Nurse Stanford University Medical Center August 2007  –  May 2013  (5 years 10 months) Stanford School of Medicine Pediatric Stem Cell Transplantation Program. Responsible for clinical trials compliance and FDA submissions. Co-chair of quality and process improvement committee. Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Clinical Research Molecular Biology Research Leukemia Public Health Science Hospitals DNA Patient Safety Clinical Development Drug Development Pediatrics Lifesciences Healthcare Nursing Education Literature Reviews Medical Education Antibodies Oncology Nursing Fluorescence Teaching Clinical Trials Critical Care Neuroscience Cancer Infectious Diseases Cell Culture IRB Psychotherapy See 15+     See less Skills  Clinical Research Molecular Biology Research Leukemia Public Health Science Hospitals DNA Patient Safety Clinical Development Drug Development Pediatrics Lifesciences Healthcare Nursing Education Literature Reviews Medical Education Antibodies Oncology Nursing Fluorescence Teaching Clinical Trials Critical Care Neuroscience Cancer Infectious Diseases Cell Culture IRB Psychotherapy See 15+     See less Clinical Research Molecular Biology Research Leukemia Public Health Science Hospitals DNA Patient Safety Clinical Development Drug Development Pediatrics Lifesciences Healthcare Nursing Education Literature Reviews Medical Education Antibodies Oncology Nursing Fluorescence Teaching Clinical Trials Critical Care Neuroscience Cancer Infectious Diseases Cell Culture IRB Psychotherapy See 15+     See less Clinical Research Molecular Biology Research Leukemia Public Health Science Hospitals DNA Patient Safety Clinical Development Drug Development Pediatrics Lifesciences Healthcare Nursing Education Literature Reviews Medical Education Antibodies Oncology Nursing Fluorescence Teaching Clinical Trials Critical Care Neuroscience Cancer Infectious Diseases Cell Culture IRB Psychotherapy See 15+     See less Education Stanford University Stanford University Stanford University Stanford University ", "Experience Clinical Research Nurse Stanford University Clinical Research Nurse Stanford University Clinical Research Nurse Stanford University ", "Experience Clinical Research Nurse Stanford University September 2013  – Present (2 years) San Francisco Bay Area Site Manager Benchmark Research September 2011  –  August 2013  (2 years) San Francisco Bay Area Clinical Research Nurse St. Mary's Medical Center April 2008  –  September 2011  (3 years 6 months) San Francisco Bay Area Clinical Research Manager St. Francis Medical Technologies 2006  –  2007  (1 year) Clinical Research Manager ViOptix, Inc. 2004  –  2006  (2 years) Clinical Research Nurse Stanford University September 2013  – Present (2 years) San Francisco Bay Area Clinical Research Nurse Stanford University September 2013  – Present (2 years) San Francisco Bay Area Site Manager Benchmark Research September 2011  –  August 2013  (2 years) San Francisco Bay Area Site Manager Benchmark Research September 2011  –  August 2013  (2 years) San Francisco Bay Area Clinical Research Nurse St. Mary's Medical Center April 2008  –  September 2011  (3 years 6 months) San Francisco Bay Area Clinical Research Nurse St. Mary's Medical Center April 2008  –  September 2011  (3 years 6 months) San Francisco Bay Area Clinical Research Manager St. Francis Medical Technologies 2006  –  2007  (1 year) Clinical Research Manager St. Francis Medical Technologies 2006  –  2007  (1 year) Clinical Research Manager ViOptix, Inc. 2004  –  2006  (2 years) Clinical Research Manager ViOptix, Inc. 2004  –  2006  (2 years) Skills Clinical Research Clinical Trials Medical Devices Oncology Biotechnology Patient Recruitment Pharmaceutical Industry Trial Management IRB Clinical Research... Clinical Development Lifesciences Skills  Clinical Research Clinical Trials Medical Devices Oncology Biotechnology Patient Recruitment Pharmaceutical Industry Trial Management IRB Clinical Research... Clinical Development Lifesciences Clinical Research Clinical Trials Medical Devices Oncology Biotechnology Patient Recruitment Pharmaceutical Industry Trial Management IRB Clinical Research... Clinical Development Lifesciences Clinical Research Clinical Trials Medical Devices Oncology Biotechnology Patient Recruitment Pharmaceutical Industry Trial Management IRB Clinical Research... Clinical Development Lifesciences Education San Francisco State University Clinical Trials Design and Management 2008  – 2009 University of North Carolina at Greensboro BSN,  Nursing 1986  – 1992 Northern High School 1983  – 1986 San Francisco State University Clinical Trials Design and Management 2008  – 2009 San Francisco State University Clinical Trials Design and Management 2008  – 2009 San Francisco State University Clinical Trials Design and Management 2008  – 2009 University of North Carolina at Greensboro BSN,  Nursing 1986  – 1992 University of North Carolina at Greensboro BSN,  Nursing 1986  – 1992 University of North Carolina at Greensboro BSN,  Nursing 1986  – 1992 Northern High School 1983  – 1986 Northern High School 1983  – 1986 Northern High School 1983  – 1986 ", "Experience Project Safety Admin Turner Construction April 2012  –  October 2014  (2 years 7 months) Levi's Stadium Certified Field Collector/Coordinator Sacramento Mobile Drug and Alcohol Testing 2010  –  August 2012  (2 years) San Francisco Bay Area Operations Manager Podiatry Group 2000  –  2009  (9 years) Private Medical Office Cardiovascular Clinical Research Nurse Stanford University Medical Center; Palo Alto VA Medical Center 1989  –  1999  (10 years) Project Safety Admin Turner Construction April 2012  –  October 2014  (2 years 7 months) Levi's Stadium Project Safety Admin Turner Construction April 2012  –  October 2014  (2 years 7 months) Levi's Stadium Certified Field Collector/Coordinator Sacramento Mobile Drug and Alcohol Testing 2010  –  August 2012  (2 years) San Francisco Bay Area Certified Field Collector/Coordinator Sacramento Mobile Drug and Alcohol Testing 2010  –  August 2012  (2 years) San Francisco Bay Area Operations Manager Podiatry Group 2000  –  2009  (9 years) Private Medical Office Operations Manager Podiatry Group 2000  –  2009  (9 years) Private Medical Office Cardiovascular Clinical Research Nurse Stanford University Medical Center; Palo Alto VA Medical Center 1989  –  1999  (10 years) Cardiovascular Clinical Research Nurse Stanford University Medical Center; Palo Alto VA Medical Center 1989  –  1999  (10 years) Skills Strategic Planning Management Microsoft Excel Microsoft Office Public Speaking Leadership Sales Team Building Budgets Customer Service Project assistance Healthcare Clinical Research... Fundraising Volunteering Contract Negotiation Clinical Research Microsoft Word Start-ups Nonprofits Accounting Event Planning See 7+     See less Skills  Strategic Planning Management Microsoft Excel Microsoft Office Public Speaking Leadership Sales Team Building Budgets Customer Service Project assistance Healthcare Clinical Research... Fundraising Volunteering Contract Negotiation Clinical Research Microsoft Word Start-ups Nonprofits Accounting Event Planning See 7+     See less Strategic Planning Management Microsoft Excel Microsoft Office Public Speaking Leadership Sales Team Building Budgets Customer Service Project assistance Healthcare Clinical Research... Fundraising Volunteering Contract Negotiation Clinical Research Microsoft Word Start-ups Nonprofits Accounting Event Planning See 7+     See less Strategic Planning Management Microsoft Excel Microsoft Office Public Speaking Leadership Sales Team Building Budgets Customer Service Project assistance Healthcare Clinical Research... Fundraising Volunteering Contract Negotiation Clinical Research Microsoft Word Start-ups Nonprofits Accounting Event Planning See 7+     See less Education Blackhawk High School, PA Heritage Valley Sewickley School of Nursing Blackhawk High School, PA Blackhawk High School, PA Blackhawk High School, PA Heritage Valley Sewickley School of Nursing Heritage Valley Sewickley School of Nursing Heritage Valley Sewickley School of Nursing ", "Experience Research Nurse Stanford University Stanford University Research Nurse Stanford University Stanford University Research Nurse Stanford University Stanford University ", "Experience Clinical Research Nurse Stanford University May 2006  – Present (9 years 4 months) Spectrum Child Health RN Lucile Packard Children's Hospital May 2000  –  May 2006  (6 years 1 month) R.N. Children's Healthcare of Atlanta 1997  –  2000  (3 years) Clinical Research Nurse Stanford University May 2006  – Present (9 years 4 months) Spectrum Child Health Clinical Research Nurse Stanford University May 2006  – Present (9 years 4 months) Spectrum Child Health RN Lucile Packard Children's Hospital May 2000  –  May 2006  (6 years 1 month) RN Lucile Packard Children's Hospital May 2000  –  May 2006  (6 years 1 month) R.N. Children's Healthcare of Atlanta 1997  –  2000  (3 years) R.N. Children's Healthcare of Atlanta 1997  –  2000  (3 years) Skills Clinical Trials Clinical Research Cancer Clinical Monitoring Public Speaking Oncology Microsoft Office Public Health CTMS Good Clinical Practice Regulatory Requirements Pediatrics Pediatric Nursing Neonatal Nursing Sop GCP IRB Cardiology Infectious Diseases Rheumatology Budget Monitoring Clinical Data Management Mentoring Flexibility Flexible Approach Highly detail oriented Highly responsible Highly self-motivated Highly Dedicated Learning Quickly See 15+     See less Skills  Clinical Trials Clinical Research Cancer Clinical Monitoring Public Speaking Oncology Microsoft Office Public Health CTMS Good Clinical Practice Regulatory Requirements Pediatrics Pediatric Nursing Neonatal Nursing Sop GCP IRB Cardiology Infectious Diseases Rheumatology Budget Monitoring Clinical Data Management Mentoring Flexibility Flexible Approach Highly detail oriented Highly responsible Highly self-motivated Highly Dedicated Learning Quickly See 15+     See less Clinical Trials Clinical Research Cancer Clinical Monitoring Public Speaking Oncology Microsoft Office Public Health CTMS Good Clinical Practice Regulatory Requirements Pediatrics Pediatric Nursing Neonatal Nursing Sop GCP IRB Cardiology Infectious Diseases Rheumatology Budget Monitoring Clinical Data Management Mentoring Flexibility Flexible Approach Highly detail oriented Highly responsible Highly self-motivated Highly Dedicated Learning Quickly See 15+     See less Clinical Trials Clinical Research Cancer Clinical Monitoring Public Speaking Oncology Microsoft Office Public Health CTMS Good Clinical Practice Regulatory Requirements Pediatrics Pediatric Nursing Neonatal Nursing Sop GCP IRB Cardiology Infectious Diseases Rheumatology Budget Monitoring Clinical Data Management Mentoring Flexibility Flexible Approach Highly detail oriented Highly responsible Highly self-motivated Highly Dedicated Learning Quickly See 15+     See less Education CSU Chico Public Health 2011  – 2012 DeAnza CSU Chico Public Health 2011  – 2012 CSU Chico Public Health 2011  – 2012 CSU Chico Public Health 2011  – 2012 DeAnza DeAnza DeAnza ", "Experience Oncology Nurse Sutter Health 2003  – Present (12 years) Clinical Research Manager CollabRx 2009  –  2010  (1 year) Oncology Research Nurse Stanford University / UCSF 2007  –  2009  (2 years) Oncology Nurse Sutter Health 2003  – Present (12 years) Oncology Nurse Sutter Health 2003  – Present (12 years) Clinical Research Manager CollabRx 2009  –  2010  (1 year) Clinical Research Manager CollabRx 2009  –  2010  (1 year) Oncology Research Nurse Stanford University / UCSF 2007  –  2009  (2 years) Oncology Research Nurse Stanford University / UCSF 2007  –  2009  (2 years) Skills Healthcare Information... Healthcare Clinical Research Skills  Healthcare Information... Healthcare Clinical Research Healthcare Information... Healthcare Clinical Research Healthcare Information... Healthcare Clinical Research Education University of California, San Francisco MS,  Nursing Informatics University of San Francisco MBA,  International Business/Finance University of California, San Francisco MS,  Nursing Informatics University of California, San Francisco MS,  Nursing Informatics University of California, San Francisco MS,  Nursing Informatics University of San Francisco MBA,  International Business/Finance University of San Francisco MBA,  International Business/Finance University of San Francisco MBA,  International Business/Finance ", "Experience Hospice Volunteer Visiting Nurse and Hospice Care of Santa Barbara March 2015  – Present (6 months) Clinical Research Coordinator Sansum Clinic February 2014  –  February 2015  (1 year 1 month) Vineyard Manager Fazio Farms 2005  –  2013  (8 years) Research Nurse Stanford University School of Medicine February 1998  –  August 2000  (2 years 7 months) Worked part-time as a research nurse for Dr. Ron Levy. Managed study for tumor vaccine for follicular small cleaved lymphoma, managed patients on Rituxan study. Oncology Clinical Nurse Specialist Private Practice-for Steven Scates, MD September 1995  –  August 1997  (2 years) Worked in outpatient oncology practice, mixed and administered all chemotherapy, administered blood products and did symptom management of all outpatient chemotherapy patients. Program Director Salick Health Care-Westlake Comprehensive Breast Center July 1994  –  August 1995  (1 year 2 months) Helped to launch an Outpatient Comprehensive Breast Center. Surgery, Radiology, and Medicine under one community facility. Nurse Manager UCLA Outpatient Oncology Center November 1990  –  June 1994  (3 years 8 months) Nurse Manager/Clinical Nurse Specialist Outpatient Cancer Center Research Nurse UCLA Health System June 1989  –  August 1990  (1 year 3 months) Worked as a research nurse for Hematology/Oncology, worked on Phase III study of G-CSF, Congenital Neutropenia and G-CSF, Her2nu Phase I safety study. CNIII UCLA Health System August 1988  –  June 1989  (11 months) Clinical Nurse III on 5-E. Heme/Onc overflow. Staff RN Johns Hopkins Oncology Center June 1987  –  July 1988  (1 year 2 months) Staff nurse for solid tumor unit. Hospice Volunteer Visiting Nurse and Hospice Care of Santa Barbara March 2015  – Present (6 months) Hospice Volunteer Visiting Nurse and Hospice Care of Santa Barbara March 2015  – Present (6 months) Clinical Research Coordinator Sansum Clinic February 2014  –  February 2015  (1 year 1 month) Clinical Research Coordinator Sansum Clinic February 2014  –  February 2015  (1 year 1 month) Vineyard Manager Fazio Farms 2005  –  2013  (8 years) Vineyard Manager Fazio Farms 2005  –  2013  (8 years) Research Nurse Stanford University School of Medicine February 1998  –  August 2000  (2 years 7 months) Worked part-time as a research nurse for Dr. Ron Levy. Managed study for tumor vaccine for follicular small cleaved lymphoma, managed patients on Rituxan study. Research Nurse Stanford University School of Medicine February 1998  –  August 2000  (2 years 7 months) Worked part-time as a research nurse for Dr. Ron Levy. Managed study for tumor vaccine for follicular small cleaved lymphoma, managed patients on Rituxan study. Oncology Clinical Nurse Specialist Private Practice-for Steven Scates, MD September 1995  –  August 1997  (2 years) Worked in outpatient oncology practice, mixed and administered all chemotherapy, administered blood products and did symptom management of all outpatient chemotherapy patients. Oncology Clinical Nurse Specialist Private Practice-for Steven Scates, MD September 1995  –  August 1997  (2 years) Worked in outpatient oncology practice, mixed and administered all chemotherapy, administered blood products and did symptom management of all outpatient chemotherapy patients. Program Director Salick Health Care-Westlake Comprehensive Breast Center July 1994  –  August 1995  (1 year 2 months) Helped to launch an Outpatient Comprehensive Breast Center. Surgery, Radiology, and Medicine under one community facility. Program Director Salick Health Care-Westlake Comprehensive Breast Center July 1994  –  August 1995  (1 year 2 months) Helped to launch an Outpatient Comprehensive Breast Center. Surgery, Radiology, and Medicine under one community facility. Nurse Manager UCLA Outpatient Oncology Center November 1990  –  June 1994  (3 years 8 months) Nurse Manager/Clinical Nurse Specialist Outpatient Cancer Center Nurse Manager UCLA Outpatient Oncology Center November 1990  –  June 1994  (3 years 8 months) Nurse Manager/Clinical Nurse Specialist Outpatient Cancer Center Research Nurse UCLA Health System June 1989  –  August 1990  (1 year 3 months) Worked as a research nurse for Hematology/Oncology, worked on Phase III study of G-CSF, Congenital Neutropenia and G-CSF, Her2nu Phase I safety study. Research Nurse UCLA Health System June 1989  –  August 1990  (1 year 3 months) Worked as a research nurse for Hematology/Oncology, worked on Phase III study of G-CSF, Congenital Neutropenia and G-CSF, Her2nu Phase I safety study. CNIII UCLA Health System August 1988  –  June 1989  (11 months) Clinical Nurse III on 5-E. Heme/Onc overflow. CNIII UCLA Health System August 1988  –  June 1989  (11 months) Clinical Nurse III on 5-E. Heme/Onc overflow. Staff RN Johns Hopkins Oncology Center June 1987  –  July 1988  (1 year 2 months) Staff nurse for solid tumor unit. Staff RN Johns Hopkins Oncology Center June 1987  –  July 1988  (1 year 2 months) Staff nurse for solid tumor unit. Skills Oncology Clinical Research Cancer Nursing Program Development Fundraising Nonprofits Public Speaking Community Outreach Event Planning Strategic Planning Volunteer Management Teaching Team Building Leadership Medicine Healthcare Management See 2+     See less Skills  Oncology Clinical Research Cancer Nursing Program Development Fundraising Nonprofits Public Speaking Community Outreach Event Planning Strategic Planning Volunteer Management Teaching Team Building Leadership Medicine Healthcare Management See 2+     See less Oncology Clinical Research Cancer Nursing Program Development Fundraising Nonprofits Public Speaking Community Outreach Event Planning Strategic Planning Volunteer Management Teaching Team Building Leadership Medicine Healthcare Management See 2+     See less Oncology Clinical Research Cancer Nursing Program Development Fundraising Nonprofits Public Speaking Community Outreach Event Planning Strategic Planning Volunteer Management Teaching Team Building Leadership Medicine Healthcare Management See 2+     See less Education University of California, Los Angeles MN,  Oncology Clinical Nurse Specialist 1988  – 1990 The Johns Hopkins University BSN,  Nursing 1985  – 1987 University of California, Los Angeles MN,  Oncology Clinical Nurse Specialist 1988  – 1990 University of California, Los Angeles MN,  Oncology Clinical Nurse Specialist 1988  – 1990 University of California, Los Angeles MN,  Oncology Clinical Nurse Specialist 1988  – 1990 The Johns Hopkins University BSN,  Nursing 1985  – 1987 The Johns Hopkins University BSN,  Nursing 1985  – 1987 The Johns Hopkins University BSN,  Nursing 1985  – 1987 ", "Experience Clinical Research Nurse Stanford University August 2003  – Present (12 years 1 month) Clinical Research Nurse Stanford University August 2003  – Present (12 years 1 month) Clinical Research Nurse Stanford University August 2003  – Present (12 years 1 month) Education California State University-Long Beach California State University-Long Beach California State University-Long Beach California State University-Long Beach ", "Summary Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Summary Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Clinical experience as a registered nurse \n \nExtensive knowledge of health care data and analytics \n \nIn-depth understanding of health insurance, managed care, health economics and quality improvement and cost controls \n \nExperience in health benefits consulting with Fortune 500 clients \n \nExcellent analytic, writing, project management and presentation skills \n \nCertified as a private patient advocate Specialties:Health care analytics \nHealth care quality \nHealth insurance \nEmployee health benefits \nPatient advocacy Experience Vice President, Clinical Consulting Precept/Proview March 2013  – Present (2 years 6 months) Irvine, CA As part of the Health Management Services Department, I work with mid-size companies to help them understand the health issues of their employee population and provide services - such as corporate wellness and health improvement programs - aimed at keeping employees as healthy as possible. Independent Consultant Health Advocates of Orange County, Inc. June 2009  –  February 2013  (3 years 9 months) Irvine, CA Provide heatlh advocacy and navigation services directly to patients and families, including decision support, coordination of care, senior care and resolution of insurance issues. Director, Healthcare Performance UltraLink (now Secova) March 2000  –  June 2005  (5 years 4 months) Costa Mesa, CA Led the Healthcare Performance department of a benefits consulting firm. Oversaw development of an annual health plan rating index, annual CAHPS surveys of clients' employees for satisfaction with health plans, and an advocacy service for clients' employees. Consulted with Fortune 500 clients regarding value-based purchasing of health benefits. Manager University of Michigan Health System January 1996  –  January 1999  (3 years 1 month) Ann Arbor, MI Developed and managed an analytic unit within a managed care organization responsible for utilization and financial reporting. Oversaw HEDIS and regulatory reporting; collaborated on the development, testing and use of a data warehouse and reporting tools; led corporate initiative to purchase and implement physician profiling software. Co-Director University of Michigan Health System November 1993  –  June 1996  (2 years 8 months) Ann Arbor, MI Collaborated on the development and implementation of disease management and wellness programs for a managed care population Research Associate University of California January 1990  –  January 1992  (2 years 1 month) Analyzed Medicare billing data to support to research projects examining the relationship between the volume of surgical procedures and the quality of outcomes at the hospital level Project Manager/Research Associate University of Pennsylvania January 1988  –  January 1989  (1 year 1 month) Manager of Research American College of Physicians January 1986  –  January 1988  (2 years 1 month) Staff Associate Georgetown University January 1985  –  January 1986  (1 year 1 month) Oncology Research Nurse Stanford University Medical Center January 1981  –  January 1984  (3 years 1 month) Coordinated a clinical trial involving patients at three institutions, including administration of experimental agent, data collection and management and liaison with research sponsor Registerd Nurse Stanford University Medical Center 1978  –  1984  (6 years) Staff Nurse Creighton Memorial St. Joseph Hospital January 1976  –  January 1978  (2 years 1 month) Vice President, Clinical Consulting Precept/Proview March 2013  – Present (2 years 6 months) Irvine, CA As part of the Health Management Services Department, I work with mid-size companies to help them understand the health issues of their employee population and provide services - such as corporate wellness and health improvement programs - aimed at keeping employees as healthy as possible. Vice President, Clinical Consulting Precept/Proview March 2013  – Present (2 years 6 months) Irvine, CA As part of the Health Management Services Department, I work with mid-size companies to help them understand the health issues of their employee population and provide services - such as corporate wellness and health improvement programs - aimed at keeping employees as healthy as possible. Independent Consultant Health Advocates of Orange County, Inc. June 2009  –  February 2013  (3 years 9 months) Irvine, CA Provide heatlh advocacy and navigation services directly to patients and families, including decision support, coordination of care, senior care and resolution of insurance issues. Independent Consultant Health Advocates of Orange County, Inc. June 2009  –  February 2013  (3 years 9 months) Irvine, CA Provide heatlh advocacy and navigation services directly to patients and families, including decision support, coordination of care, senior care and resolution of insurance issues. Director, Healthcare Performance UltraLink (now Secova) March 2000  –  June 2005  (5 years 4 months) Costa Mesa, CA Led the Healthcare Performance department of a benefits consulting firm. Oversaw development of an annual health plan rating index, annual CAHPS surveys of clients' employees for satisfaction with health plans, and an advocacy service for clients' employees. Consulted with Fortune 500 clients regarding value-based purchasing of health benefits. Director, Healthcare Performance UltraLink (now Secova) March 2000  –  June 2005  (5 years 4 months) Costa Mesa, CA Led the Healthcare Performance department of a benefits consulting firm. Oversaw development of an annual health plan rating index, annual CAHPS surveys of clients' employees for satisfaction with health plans, and an advocacy service for clients' employees. Consulted with Fortune 500 clients regarding value-based purchasing of health benefits. Manager University of Michigan Health System January 1996  –  January 1999  (3 years 1 month) Ann Arbor, MI Developed and managed an analytic unit within a managed care organization responsible for utilization and financial reporting. Oversaw HEDIS and regulatory reporting; collaborated on the development, testing and use of a data warehouse and reporting tools; led corporate initiative to purchase and implement physician profiling software. Manager University of Michigan Health System January 1996  –  January 1999  (3 years 1 month) Ann Arbor, MI Developed and managed an analytic unit within a managed care organization responsible for utilization and financial reporting. Oversaw HEDIS and regulatory reporting; collaborated on the development, testing and use of a data warehouse and reporting tools; led corporate initiative to purchase and implement physician profiling software. Co-Director University of Michigan Health System November 1993  –  June 1996  (2 years 8 months) Ann Arbor, MI Collaborated on the development and implementation of disease management and wellness programs for a managed care population Co-Director University of Michigan Health System November 1993  –  June 1996  (2 years 8 months) Ann Arbor, MI Collaborated on the development and implementation of disease management and wellness programs for a managed care population Research Associate University of California January 1990  –  January 1992  (2 years 1 month) Analyzed Medicare billing data to support to research projects examining the relationship between the volume of surgical procedures and the quality of outcomes at the hospital level Research Associate University of California January 1990  –  January 1992  (2 years 1 month) Analyzed Medicare billing data to support to research projects examining the relationship between the volume of surgical procedures and the quality of outcomes at the hospital level Project Manager/Research Associate University of Pennsylvania January 1988  –  January 1989  (1 year 1 month) Project Manager/Research Associate University of Pennsylvania January 1988  –  January 1989  (1 year 1 month) Manager of Research American College of Physicians January 1986  –  January 1988  (2 years 1 month) Manager of Research American College of Physicians January 1986  –  January 1988  (2 years 1 month) Staff Associate Georgetown University January 1985  –  January 1986  (1 year 1 month) Staff Associate Georgetown University January 1985  –  January 1986  (1 year 1 month) Oncology Research Nurse Stanford University Medical Center January 1981  –  January 1984  (3 years 1 month) Coordinated a clinical trial involving patients at three institutions, including administration of experimental agent, data collection and management and liaison with research sponsor Oncology Research Nurse Stanford University Medical Center January 1981  –  January 1984  (3 years 1 month) Coordinated a clinical trial involving patients at three institutions, including administration of experimental agent, data collection and management and liaison with research sponsor Registerd Nurse Stanford University Medical Center 1978  –  1984  (6 years) Registerd Nurse Stanford University Medical Center 1978  –  1984  (6 years) Staff Nurse Creighton Memorial St. Joseph Hospital January 1976  –  January 1978  (2 years 1 month) Staff Nurse Creighton Memorial St. Joseph Hospital January 1976  –  January 1978  (2 years 1 month) Skills health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less Skills  health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less health insurance and... health data and... population health... health economics private patient advocacy Patient Advocacy Healthcare Population Health Health Insurance Health Economics Managed Care Medicare Quality Improvement Employee Benefits Healthcare Management Disease Management Hospitals Clinical Research Health Policy Medicine Pain Management Prevention Healthcare Consulting Patient Safety See 9+     See less Education Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Georgetown University Masters in Public Policy,  Public Policy 1984  – 1986 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Notre Dame de Namur University BS,  Business Administration 1982  – 1984 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Nebraska Methodist College Diploma,  Nursing 1973  – 1976 Honors & Awards Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. Additional Honors & Awards Certified as a Health Care Advocate through Healthcare Liaison, Inc. ", "Summary Specialties:Clinical and Regulatory Affairs;  \nMedical Device Trials (Class II and III) - Vascular, Cardiovascular, Gastroenterology, and Ophthalmology; Oncology; Clinical Research Nurse; Advanced Project Management \n \nRegistered Nurse Licenses: State of California, August 1999; State of Texas, June 2010 Summary Specialties:Clinical and Regulatory Affairs;  \nMedical Device Trials (Class II and III) - Vascular, Cardiovascular, Gastroenterology, and Ophthalmology; Oncology; Clinical Research Nurse; Advanced Project Management \n \nRegistered Nurse Licenses: State of California, August 1999; State of Texas, June 2010 Specialties:Clinical and Regulatory Affairs;  \nMedical Device Trials (Class II and III) - Vascular, Cardiovascular, Gastroenterology, and Ophthalmology; Oncology; Clinical Research Nurse; Advanced Project Management \n \nRegistered Nurse Licenses: State of California, August 1999; State of Texas, June 2010 Specialties:Clinical and Regulatory Affairs;  \nMedical Device Trials (Class II and III) - Vascular, Cardiovascular, Gastroenterology, and Ophthalmology; Oncology; Clinical Research Nurse; Advanced Project Management \n \nRegistered Nurse Licenses: State of California, August 1999; State of Texas, June 2010 Experience TBA TBA July 2015  – Present (2 months) Dallas/Fort Worth Area Director, Clinical Oncology Research-Cancer Center Administration Baylor Health Care System April 2013  –  May 2015  (2 years 2 months) Dallas/Fort Worth Area Division of Surgical Oncology-Cancer Center Administration Baylor Health Care System October 2010  –  April 2013  (2 years 7 months) Sr. Manager, Clinical Operations Ivantis, Inc. (Private Start-up) October 2009  –  October 2010  (1 year 1 month) Responsible for the overall Clinical Operations of international medical device studies. Sr. Clinical Affairs Manager Avantis Medical Systems (Private Start-up) February 2009  –  October 2009  (9 months) Responsible for the overall Clinical Affairs' operations of domestic, gastroenterology medical device studies. Clinical/Regulatory Affairs Program Manager XTENT, Inc. (The Foundry) 2007  –  2009  (2 years) Responsible for Clinical and Regulatory Affairs operations of international, combination, cardiovascular medical device studies. Clinical Project Manager Cierra, Inc. (The Foundry) January 2007  –  September 2007  (9 months) Rollout/management of international, cardiovascular medical device programs. Clinical Project Manager Abbott Vascular December 2005  –  January 2007  (1 year 2 months) Rollout/managment of domestic, cardiovascular medical device trials. Clinical Research Nurse Stanford University Medical Center January 2000  –  December 2005  (6 years) Management of 15-20 vascular clinical trials involving Class II and III medical devices. Extensive regulatory filings directly with FDA as well as clinical trial management for physician-sponsored IDEs. Additionally, direct OR and outpatient clinical management of vascular study patients. TBA TBA July 2015  – Present (2 months) Dallas/Fort Worth Area TBA TBA July 2015  – Present (2 months) Dallas/Fort Worth Area Director, Clinical Oncology Research-Cancer Center Administration Baylor Health Care System April 2013  –  May 2015  (2 years 2 months) Dallas/Fort Worth Area Director, Clinical Oncology Research-Cancer Center Administration Baylor Health Care System April 2013  –  May 2015  (2 years 2 months) Dallas/Fort Worth Area Division of Surgical Oncology-Cancer Center Administration Baylor Health Care System October 2010  –  April 2013  (2 years 7 months) Division of Surgical Oncology-Cancer Center Administration Baylor Health Care System October 2010  –  April 2013  (2 years 7 months) Sr. Manager, Clinical Operations Ivantis, Inc. (Private Start-up) October 2009  –  October 2010  (1 year 1 month) Responsible for the overall Clinical Operations of international medical device studies. Sr. Manager, Clinical Operations Ivantis, Inc. (Private Start-up) October 2009  –  October 2010  (1 year 1 month) Responsible for the overall Clinical Operations of international medical device studies. Sr. Clinical Affairs Manager Avantis Medical Systems (Private Start-up) February 2009  –  October 2009  (9 months) Responsible for the overall Clinical Affairs' operations of domestic, gastroenterology medical device studies. Sr. Clinical Affairs Manager Avantis Medical Systems (Private Start-up) February 2009  –  October 2009  (9 months) Responsible for the overall Clinical Affairs' operations of domestic, gastroenterology medical device studies. Clinical/Regulatory Affairs Program Manager XTENT, Inc. (The Foundry) 2007  –  2009  (2 years) Responsible for Clinical and Regulatory Affairs operations of international, combination, cardiovascular medical device studies. Clinical/Regulatory Affairs Program Manager XTENT, Inc. (The Foundry) 2007  –  2009  (2 years) Responsible for Clinical and Regulatory Affairs operations of international, combination, cardiovascular medical device studies. Clinical Project Manager Cierra, Inc. (The Foundry) January 2007  –  September 2007  (9 months) Rollout/management of international, cardiovascular medical device programs. Clinical Project Manager Cierra, Inc. (The Foundry) January 2007  –  September 2007  (9 months) Rollout/management of international, cardiovascular medical device programs. Clinical Project Manager Abbott Vascular December 2005  –  January 2007  (1 year 2 months) Rollout/managment of domestic, cardiovascular medical device trials. Clinical Project Manager Abbott Vascular December 2005  –  January 2007  (1 year 2 months) Rollout/managment of domestic, cardiovascular medical device trials. Clinical Research Nurse Stanford University Medical Center January 2000  –  December 2005  (6 years) Management of 15-20 vascular clinical trials involving Class II and III medical devices. Extensive regulatory filings directly with FDA as well as clinical trial management for physician-sponsored IDEs. Additionally, direct OR and outpatient clinical management of vascular study patients. Clinical Research Nurse Stanford University Medical Center January 2000  –  December 2005  (6 years) Management of 15-20 vascular clinical trials involving Class II and III medical devices. Extensive regulatory filings directly with FDA as well as clinical trial management for physician-sponsored IDEs. Additionally, direct OR and outpatient clinical management of vascular study patients. Skills Cardiology Gastroenterology Clinical Research Clinical Trials FDA CTMS EDC Medical Devices Regulatory Affairs Biotechnology Healthcare Healthcare Industry GCP Oncology Surgery Clinical Development Clinical Monitoring Clinical Operations ICH-GCP See 4+     See less Skills  Cardiology Gastroenterology Clinical Research Clinical Trials FDA CTMS EDC Medical Devices Regulatory Affairs Biotechnology Healthcare Healthcare Industry GCP Oncology Surgery Clinical Development Clinical Monitoring Clinical Operations ICH-GCP See 4+     See less Cardiology Gastroenterology Clinical Research Clinical Trials FDA CTMS EDC Medical Devices Regulatory Affairs Biotechnology Healthcare Healthcare Industry GCP Oncology Surgery Clinical Development Clinical Monitoring Clinical Operations ICH-GCP See 4+     See less Cardiology Gastroenterology Clinical Research Clinical Trials FDA CTMS EDC Medical Devices Regulatory Affairs Biotechnology Healthcare Healthcare Industry GCP Oncology Surgery Clinical Development Clinical Monitoring Clinical Operations ICH-GCP See 4+     See less Education The George Washington University Master of Science,  Nursing 2008  – 2013 Stanford University Certificate,  Advanced Project Management 2010  – 2011 Lewis University Bachelor of Science,  Nursing 1995  – 1999 The George Washington University Master of Science,  Nursing 2008  – 2013 The George Washington University Master of Science,  Nursing 2008  – 2013 The George Washington University Master of Science,  Nursing 2008  – 2013 Stanford University Certificate,  Advanced Project Management 2010  – 2011 Stanford University Certificate,  Advanced Project Management 2010  – 2011 Stanford University Certificate,  Advanced Project Management 2010  – 2011 Lewis University Bachelor of Science,  Nursing 1995  – 1999 Lewis University Bachelor of Science,  Nursing 1995  – 1999 Lewis University Bachelor of Science,  Nursing 1995  – 1999 ", "Experience Oncology Research Nurse Stanford University School of Medicine June 2006  – Present (9 years 3 months) Oncology Research Nurse Stanford University School of Medicine June 2006  – Present (9 years 3 months) Oncology Research Nurse Stanford University School of Medicine June 2006  – Present (9 years 3 months) ", "Experience RN, Research Nurse Stanford University School of Medicine RN, Research Nurse Stanford University School of Medicine RN, Research Nurse Stanford University School of Medicine ", "Summary Family Nurse Practitioner Certificate: SFSU, December 2013.  \nPediatric Nurse Practitioner Certificate: UCSF, December 1999. \n \n14+ years as Pediatric Nurse Practitioner / Clinical Research RN/NP with extensive experience in pediatric neurology, pediatric cardiovascular disease and adolescent primary care. Summary Family Nurse Practitioner Certificate: SFSU, December 2013.  \nPediatric Nurse Practitioner Certificate: UCSF, December 1999. \n \n14+ years as Pediatric Nurse Practitioner / Clinical Research RN/NP with extensive experience in pediatric neurology, pediatric cardiovascular disease and adolescent primary care. Family Nurse Practitioner Certificate: SFSU, December 2013.  \nPediatric Nurse Practitioner Certificate: UCSF, December 1999. \n \n14+ years as Pediatric Nurse Practitioner / Clinical Research RN/NP with extensive experience in pediatric neurology, pediatric cardiovascular disease and adolescent primary care. Family Nurse Practitioner Certificate: SFSU, December 2013.  \nPediatric Nurse Practitioner Certificate: UCSF, December 1999. \n \n14+ years as Pediatric Nurse Practitioner / Clinical Research RN/NP with extensive experience in pediatric neurology, pediatric cardiovascular disease and adolescent primary care. Experience Family Nurse Practitioner BAART Medical Clinics - San Francisco CA July 2014  – Present (1 year 2 months) Menlo Park, CA Provide medical care and methadone maintenance therapy (MMT) to adults patients with opiate dependence. This is a part-time position I do in addition to my current position as Clinical Research Nurse Practitioner at Stanford University. Pediatric Nurse Practitioner, Clinical Research Stanford University 2010  – Present (5 years) LPCH Cardiovascular Intensive Care Unit Manage and oversee all clinical research on pediatric cardiovascular intensive care unit at Lucile Packard Children's Hospital. Clinical Research Nurse Stanford University September 2009  –  November 2009  (3 months) Temporary full-time position on NIH-sponsored H1N1 vaccine research study. Pediatric Nurse Practitioner / Clinical Research NP Stanford University January 2002  –  November 2009  (7 years 11 months) Managed the clinical practice and coordinated academic research for pediatric neurology practice specializing in pediatric movement disorders. Per Diem Nurse / Per Diem Nurse Practitioner County of San Mateo June 1999  –  January 2002  (2 years 8 months) Provided primary care to pediatric and adolescent patients in San Mateo County Clinical Research Nurse - Epilepsy Center UCSF June 1997  –  October 1998  (1 year 5 months) Clinical research nurse for UCSF Epilepsy Center. Family Nurse Practitioner BAART Medical Clinics - San Francisco CA July 2014  – Present (1 year 2 months) Menlo Park, CA Provide medical care and methadone maintenance therapy (MMT) to adults patients with opiate dependence. This is a part-time position I do in addition to my current position as Clinical Research Nurse Practitioner at Stanford University. Family Nurse Practitioner BAART Medical Clinics - San Francisco CA July 2014  – Present (1 year 2 months) Menlo Park, CA Provide medical care and methadone maintenance therapy (MMT) to adults patients with opiate dependence. This is a part-time position I do in addition to my current position as Clinical Research Nurse Practitioner at Stanford University. Pediatric Nurse Practitioner, Clinical Research Stanford University 2010  – Present (5 years) LPCH Cardiovascular Intensive Care Unit Manage and oversee all clinical research on pediatric cardiovascular intensive care unit at Lucile Packard Children's Hospital. Pediatric Nurse Practitioner, Clinical Research Stanford University 2010  – Present (5 years) LPCH Cardiovascular Intensive Care Unit Manage and oversee all clinical research on pediatric cardiovascular intensive care unit at Lucile Packard Children's Hospital. Clinical Research Nurse Stanford University September 2009  –  November 2009  (3 months) Temporary full-time position on NIH-sponsored H1N1 vaccine research study. Clinical Research Nurse Stanford University September 2009  –  November 2009  (3 months) Temporary full-time position on NIH-sponsored H1N1 vaccine research study. Pediatric Nurse Practitioner / Clinical Research NP Stanford University January 2002  –  November 2009  (7 years 11 months) Managed the clinical practice and coordinated academic research for pediatric neurology practice specializing in pediatric movement disorders. Pediatric Nurse Practitioner / Clinical Research NP Stanford University January 2002  –  November 2009  (7 years 11 months) Managed the clinical practice and coordinated academic research for pediatric neurology practice specializing in pediatric movement disorders. Per Diem Nurse / Per Diem Nurse Practitioner County of San Mateo June 1999  –  January 2002  (2 years 8 months) Provided primary care to pediatric and adolescent patients in San Mateo County Per Diem Nurse / Per Diem Nurse Practitioner County of San Mateo June 1999  –  January 2002  (2 years 8 months) Provided primary care to pediatric and adolescent patients in San Mateo County Clinical Research Nurse - Epilepsy Center UCSF June 1997  –  October 1998  (1 year 5 months) Clinical research nurse for UCSF Epilepsy Center. Clinical Research Nurse - Epilepsy Center UCSF June 1997  –  October 1998  (1 year 5 months) Clinical research nurse for UCSF Epilepsy Center. Languages Spanish  Spanish  Spanish  Skills Clinical Research Pediatrics Adolescents Addiction Medicine Nursing Primary Care Healthcare Medicine Critical Care Clinical Trials Nurse Practitioners ICU Vaccines Hospitals Patient Safety Public Health Neurology Health Education Healthcare Management Research Fundraising See 6+     See less Skills  Clinical Research Pediatrics Adolescents Addiction Medicine Nursing Primary Care Healthcare Medicine Critical Care Clinical Trials Nurse Practitioners ICU Vaccines Hospitals Patient Safety Public Health Neurology Health Education Healthcare Management Research Fundraising See 6+     See less Clinical Research Pediatrics Adolescents Addiction Medicine Nursing Primary Care Healthcare Medicine Critical Care Clinical Trials Nurse Practitioners ICU Vaccines Hospitals Patient Safety Public Health Neurology Health Education Healthcare Management Research Fundraising See 6+     See less Clinical Research Pediatrics Adolescents Addiction Medicine Nursing Primary Care Healthcare Medicine Critical Care Clinical Trials Nurse Practitioners ICU Vaccines Hospitals Patient Safety Public Health Neurology Health Education Healthcare Management Research Fundraising See 6+     See less Education San Francisco State University Post-Masters FNP Certificate 2012  – 2013 Emphasis: Management of Chronic Pain, Specialty Headache clinic (adult neurology), Adult Primary Care. University of California, San Francisco Post Master's,  Pediatric Nurse Practitioner Certificate 1998  – 1999 for Pediatric Nurse Practitioners  \nDegree: NP Certificate \nCore emphasis: Adolescent Primary Care San Francisco State University Masters of Science,  Nursing; MSN; Nursing Case Management 1995  – 1997 San Francisco State University Degree: BA,  Creative Arts; Broadcast Communications 1981  – 1983 San Francisco State University Post-Masters FNP Certificate 2012  – 2013 Emphasis: Management of Chronic Pain, Specialty Headache clinic (adult neurology), Adult Primary Care. San Francisco State University Post-Masters FNP Certificate 2012  – 2013 Emphasis: Management of Chronic Pain, Specialty Headache clinic (adult neurology), Adult Primary Care. San Francisco State University Post-Masters FNP Certificate 2012  – 2013 Emphasis: Management of Chronic Pain, Specialty Headache clinic (adult neurology), Adult Primary Care. University of California, San Francisco Post Master's,  Pediatric Nurse Practitioner Certificate 1998  – 1999 for Pediatric Nurse Practitioners  \nDegree: NP Certificate \nCore emphasis: Adolescent Primary Care University of California, San Francisco Post Master's,  Pediatric Nurse Practitioner Certificate 1998  – 1999 for Pediatric Nurse Practitioners  \nDegree: NP Certificate \nCore emphasis: Adolescent Primary Care University of California, San Francisco Post Master's,  Pediatric Nurse Practitioner Certificate 1998  – 1999 for Pediatric Nurse Practitioners  \nDegree: NP Certificate \nCore emphasis: Adolescent Primary Care San Francisco State University Masters of Science,  Nursing; MSN; Nursing Case Management 1995  – 1997 San Francisco State University Masters of Science,  Nursing; MSN; Nursing Case Management 1995  – 1997 San Francisco State University Masters of Science,  Nursing; MSN; Nursing Case Management 1995  – 1997 San Francisco State University Degree: BA,  Creative Arts; Broadcast Communications 1981  – 1983 San Francisco State University Degree: BA,  Creative Arts; Broadcast Communications 1981  – 1983 San Francisco State University Degree: BA,  Creative Arts; Broadcast Communications 1981  – 1983 "]}