{"position": "Research Process Manager", "company": "Stanford University", "profiles": ["Experience Research Process Manager Stanford University Research Process Manager Stanford University Research Process Manager Stanford University Education School name: School name: School name: School name: ", "Experience Research Process Manager Stanford University School of Medicine June 2015  – Present (3 months) Palo Alto, CA Research Administrator Stanford University School of Medicine January 2014  –  June 2015  (1 year 6 months) Stanford, CA Administrative Associate, Deisseroth Lab Stanford University February 2010  –  January 2014  (4 years) Stanford, CA Research Associate Ternion Bio Industries October 2009  –  February 2010  (5 months) San Jose, CA Administrative and Billing Associate Associated Hand Surgeons June 2008  –  September 2009  (1 year 4 months) Santa Barbara, California Area Research Assistant, Relman Lab Stanford University School of Medicine June 2007  –  September 2007  (4 months) Stanford, CA Day Camp Leader YMCA May 2005  –  August 2006  (1 year 4 months) Saratoga, CA Research Process Manager Stanford University School of Medicine June 2015  – Present (3 months) Palo Alto, CA Research Process Manager Stanford University School of Medicine June 2015  – Present (3 months) Palo Alto, CA Research Administrator Stanford University School of Medicine January 2014  –  June 2015  (1 year 6 months) Stanford, CA Research Administrator Stanford University School of Medicine January 2014  –  June 2015  (1 year 6 months) Stanford, CA Administrative Associate, Deisseroth Lab Stanford University February 2010  –  January 2014  (4 years) Stanford, CA Administrative Associate, Deisseroth Lab Stanford University February 2010  –  January 2014  (4 years) Stanford, CA Research Associate Ternion Bio Industries October 2009  –  February 2010  (5 months) San Jose, CA Research Associate Ternion Bio Industries October 2009  –  February 2010  (5 months) San Jose, CA Administrative and Billing Associate Associated Hand Surgeons June 2008  –  September 2009  (1 year 4 months) Santa Barbara, California Area Administrative and Billing Associate Associated Hand Surgeons June 2008  –  September 2009  (1 year 4 months) Santa Barbara, California Area Research Assistant, Relman Lab Stanford University School of Medicine June 2007  –  September 2007  (4 months) Stanford, CA Research Assistant, Relman Lab Stanford University School of Medicine June 2007  –  September 2007  (4 months) Stanford, CA Day Camp Leader YMCA May 2005  –  August 2006  (1 year 4 months) Saratoga, CA Day Camp Leader YMCA May 2005  –  August 2006  (1 year 4 months) Saratoga, CA Languages   Skills Molecular Biology Neuroscience Lifesciences Science Cell Culture Research Gel Electrophoresis Grant Writing Grant Preparation Grant Administration Transfection Biotechnology Statistics Bioengineering Material Transfer... Grant Coordination Capital Equipment... Financial Analysis Financial Reporting Financial Accounting Strategic Financial... Microsoft Excel Federal Grant Management Grant Monitoring NIH DoD NSF See 12+     See less Skills  Molecular Biology Neuroscience Lifesciences Science Cell Culture Research Gel Electrophoresis Grant Writing Grant Preparation Grant Administration Transfection Biotechnology Statistics Bioengineering Material Transfer... Grant Coordination Capital Equipment... Financial Analysis Financial Reporting Financial Accounting Strategic Financial... Microsoft Excel Federal Grant Management Grant Monitoring NIH DoD NSF See 12+     See less Molecular Biology Neuroscience Lifesciences Science Cell Culture Research Gel Electrophoresis Grant Writing Grant Preparation Grant Administration Transfection Biotechnology Statistics Bioengineering Material Transfer... Grant Coordination Capital Equipment... Financial Analysis Financial Reporting Financial Accounting Strategic Financial... Microsoft Excel Federal Grant Management Grant Monitoring NIH DoD NSF See 12+     See less Molecular Biology Neuroscience Lifesciences Science Cell Culture Research Gel Electrophoresis Grant Writing Grant Preparation Grant Administration Transfection Biotechnology Statistics Bioengineering Material Transfer... Grant Coordination Capital Equipment... Financial Analysis Financial Reporting Financial Accounting Strategic Financial... Microsoft Excel Federal Grant Management Grant Monitoring NIH DoD NSF See 12+     See less Education Arizona State University Master of Business Administration,  Finance 2013  – 2014 W.P. Carey School of Business Activities and Societies:  W. P. Carey School of Business Official Online MBA Ambassador University of California, Santa Barbara Bachelor of Science,  Biological Sciences 2004  – 2008 Activities and Societies:  Intramural soccer Arizona State University Master of Business Administration,  Finance 2013  – 2014 W.P. Carey School of Business Activities and Societies:  W. P. Carey School of Business Official Online MBA Ambassador Arizona State University Master of Business Administration,  Finance 2013  – 2014 W.P. Carey School of Business Activities and Societies:  W. P. Carey School of Business Official Online MBA Ambassador Arizona State University Master of Business Administration,  Finance 2013  – 2014 W.P. Carey School of Business Activities and Societies:  W. P. Carey School of Business Official Online MBA Ambassador University of California, Santa Barbara Bachelor of Science,  Biological Sciences 2004  – 2008 Activities and Societies:  Intramural soccer University of California, Santa Barbara Bachelor of Science,  Biological Sciences 2004  – 2008 Activities and Societies:  Intramural soccer University of California, Santa Barbara Bachelor of Science,  Biological Sciences 2004  – 2008 Activities and Societies:  Intramural soccer Honors & Awards ", "Experience Senior Research Process Manager Stanford University School of Medicine September 2000  – Present (15 years) Research Process Manager Stanford University School of Medicine September 2000  – Present (15 years) Palo Alto The Research Process Manager (RPM) is the University’s sponsored projects institutional representative for School of Medicine faculty and is the primary point of contact for sponsor and University grant and contract administrators. RPMs provide compliance oversight of federal regulations and confirm that sponsored projects in the School of Medicine can withstand Congressional review, federal audits, and public scrutiny on the use of taxpayer support. In General the RPM operates under a two tier program (a junior level and senior level) upon which varying responsibilities are placed. The senior level RPM has met all requirements of the Junior level RPM, has passed Certification levels I and II, has been granted full signature authority by the Office of Research Administration for all grant proposal types and grant awards, and now operates independently to provide consultation to the PI and/or staff to ensure that sponsored research funds are managed and expended in compliance with internal and external policies and consequently, continues as the institutional representative throughout the life of the award. The RPM promotes a collaborative model of stewardship among faculty and staff and is an advocate for a responsive, effective research administration process. Reporting to one of the Team Managers and partnering with faculty and staff, the RPM directs and manages the proposal process to ensure timely, compliant and accurate submissions. This process includes: budget development, interpretation of sponsor requirements for both contracts and grants, recommendations to the PI regarding best practices for gathering content to be included in the proposal package, as well as final approval and sign-off (signature authority) before submission. As a representative of Stanford University, an RPM’s signature ensures the proposal meets sponsor, University, and School pre-and post-award guidelines and regulations. Grants & Contracts Manager City of Hope May 1990  –  August 2000  (10 years 4 months) Senior Research Process Manager Stanford University School of Medicine September 2000  – Present (15 years) Senior Research Process Manager Stanford University School of Medicine September 2000  – Present (15 years) Research Process Manager Stanford University School of Medicine September 2000  – Present (15 years) Palo Alto The Research Process Manager (RPM) is the University’s sponsored projects institutional representative for School of Medicine faculty and is the primary point of contact for sponsor and University grant and contract administrators. RPMs provide compliance oversight of federal regulations and confirm that sponsored projects in the School of Medicine can withstand Congressional review, federal audits, and public scrutiny on the use of taxpayer support. In General the RPM operates under a two tier program (a junior level and senior level) upon which varying responsibilities are placed. The senior level RPM has met all requirements of the Junior level RPM, has passed Certification levels I and II, has been granted full signature authority by the Office of Research Administration for all grant proposal types and grant awards, and now operates independently to provide consultation to the PI and/or staff to ensure that sponsored research funds are managed and expended in compliance with internal and external policies and consequently, continues as the institutional representative throughout the life of the award. The RPM promotes a collaborative model of stewardship among faculty and staff and is an advocate for a responsive, effective research administration process. Reporting to one of the Team Managers and partnering with faculty and staff, the RPM directs and manages the proposal process to ensure timely, compliant and accurate submissions. This process includes: budget development, interpretation of sponsor requirements for both contracts and grants, recommendations to the PI regarding best practices for gathering content to be included in the proposal package, as well as final approval and sign-off (signature authority) before submission. As a representative of Stanford University, an RPM’s signature ensures the proposal meets sponsor, University, and School pre-and post-award guidelines and regulations. Research Process Manager Stanford University School of Medicine September 2000  – Present (15 years) Palo Alto The Research Process Manager (RPM) is the University’s sponsored projects institutional representative for School of Medicine faculty and is the primary point of contact for sponsor and University grant and contract administrators. RPMs provide compliance oversight of federal regulations and confirm that sponsored projects in the School of Medicine can withstand Congressional review, federal audits, and public scrutiny on the use of taxpayer support. In General the RPM operates under a two tier program (a junior level and senior level) upon which varying responsibilities are placed. The senior level RPM has met all requirements of the Junior level RPM, has passed Certification levels I and II, has been granted full signature authority by the Office of Research Administration for all grant proposal types and grant awards, and now operates independently to provide consultation to the PI and/or staff to ensure that sponsored research funds are managed and expended in compliance with internal and external policies and consequently, continues as the institutional representative throughout the life of the award. The RPM promotes a collaborative model of stewardship among faculty and staff and is an advocate for a responsive, effective research administration process. Reporting to one of the Team Managers and partnering with faculty and staff, the RPM directs and manages the proposal process to ensure timely, compliant and accurate submissions. This process includes: budget development, interpretation of sponsor requirements for both contracts and grants, recommendations to the PI regarding best practices for gathering content to be included in the proposal package, as well as final approval and sign-off (signature authority) before submission. As a representative of Stanford University, an RPM’s signature ensures the proposal meets sponsor, University, and School pre-and post-award guidelines and regulations. Grants & Contracts Manager City of Hope May 1990  –  August 2000  (10 years 4 months) Grants & Contracts Manager City of Hope May 1990  –  August 2000  (10 years 4 months) Skills Data Analysis Grants Neuroscience Research Social Networking Lifesciences Proposal Writing Grant Writing Nonprofits Management Public Health Project Management Budgets Program Evaluation Statistics Process Management Contract Management Process Improvement Life Sciences Grant Administration See 5+     See less Skills  Data Analysis Grants Neuroscience Research Social Networking Lifesciences Proposal Writing Grant Writing Nonprofits Management Public Health Project Management Budgets Program Evaluation Statistics Process Management Contract Management Process Improvement Life Sciences Grant Administration See 5+     See less Data Analysis Grants Neuroscience Research Social Networking Lifesciences Proposal Writing Grant Writing Nonprofits Management Public Health Project Management Budgets Program Evaluation Statistics Process Management Contract Management Process Improvement Life Sciences Grant Administration See 5+     See less Data Analysis Grants Neuroscience Research Social Networking Lifesciences Proposal Writing Grant Writing Nonprofits Management Public Health Project Management Budgets Program Evaluation Statistics Process Management Contract Management Process Improvement Life Sciences Grant Administration See 5+     See less Education Azusa Pacific University BS,  Business Activities and Societies:  None California State University-Los Angeles Business - Accounting Azusa Pacific University BS,  Business Activities and Societies:  None Azusa Pacific University BS,  Business Activities and Societies:  None Azusa Pacific University BS,  Business Activities and Societies:  None California State University-Los Angeles Business - Accounting California State University-Los Angeles Business - Accounting California State University-Los Angeles Business - Accounting ", "Summary * 10 years experience in full project life-cycle management in consulting, training, organizational development, public and private sector.  \n* Proven track record of conducting successful research projects in various fields (industry overviews, market research, feasibility studies, case studies, etc.). Created and coauthored several studies and handbooks. \n* Five years of results-driven consulting experience in Quality Management, specializing in small and medium-sized businesses. \n* Proven ability to seamlessly integrate key customer, regulator, and internal business requirements while maximizing quality and efficiency.  \n* Exemplary organizational, interpersonal and communication skills, with strong sense of ownership and commitment.  \n* Fluent in English, German, Russian, and Estonian, with strong cross-cultural competence and experience. Summary * 10 years experience in full project life-cycle management in consulting, training, organizational development, public and private sector.  \n* Proven track record of conducting successful research projects in various fields (industry overviews, market research, feasibility studies, case studies, etc.). Created and coauthored several studies and handbooks. \n* Five years of results-driven consulting experience in Quality Management, specializing in small and medium-sized businesses. \n* Proven ability to seamlessly integrate key customer, regulator, and internal business requirements while maximizing quality and efficiency.  \n* Exemplary organizational, interpersonal and communication skills, with strong sense of ownership and commitment.  \n* Fluent in English, German, Russian, and Estonian, with strong cross-cultural competence and experience. * 10 years experience in full project life-cycle management in consulting, training, organizational development, public and private sector.  \n* Proven track record of conducting successful research projects in various fields (industry overviews, market research, feasibility studies, case studies, etc.). Created and coauthored several studies and handbooks. \n* Five years of results-driven consulting experience in Quality Management, specializing in small and medium-sized businesses. \n* Proven ability to seamlessly integrate key customer, regulator, and internal business requirements while maximizing quality and efficiency.  \n* Exemplary organizational, interpersonal and communication skills, with strong sense of ownership and commitment.  \n* Fluent in English, German, Russian, and Estonian, with strong cross-cultural competence and experience. * 10 years experience in full project life-cycle management in consulting, training, organizational development, public and private sector.  \n* Proven track record of conducting successful research projects in various fields (industry overviews, market research, feasibility studies, case studies, etc.). Created and coauthored several studies and handbooks. \n* Five years of results-driven consulting experience in Quality Management, specializing in small and medium-sized businesses. \n* Proven ability to seamlessly integrate key customer, regulator, and internal business requirements while maximizing quality and efficiency.  \n* Exemplary organizational, interpersonal and communication skills, with strong sense of ownership and commitment.  \n* Fluent in English, German, Russian, and Estonian, with strong cross-cultural competence and experience. Experience Clinical Trial Research Process Manager Stanford University School of Medicine January 2014  – Present (1 year 8 months) Palo Alto, Stanford, CA Research Process Manager Stanford University School of Medicine July 2011  –  December 2013  (2 years 6 months) Stanford, CA, USA Contract and Grant Administrator Palo Alto Institute for Research & Education March 2010  –  July 2011  (1 year 5 months) Project Manager Cureline March 2009  –  March 2010  (1 year 1 month) Operations Associate Next Step August 2007  –  November 2008  (1 year 4 months) Project Lead and US Coordinator Cross Border Mentor 2005  –  2007  (2 years) Reuters Digital Vision Fellow Stanford University September 2005  –  June 2006  (10 months) Project Manager BDA Estonia 2002  –  2005  (3 years) Executive Officer Department of Economic Affairs of Estonia 1999  –  2002  (3 years) Consultant and Project Manager Christiansen Consulting 1998  –  2002  (4 years) Clinical Trial Research Process Manager Stanford University School of Medicine January 2014  – Present (1 year 8 months) Palo Alto, Stanford, CA Clinical Trial Research Process Manager Stanford University School of Medicine January 2014  – Present (1 year 8 months) Palo Alto, Stanford, CA Research Process Manager Stanford University School of Medicine July 2011  –  December 2013  (2 years 6 months) Stanford, CA, USA Research Process Manager Stanford University School of Medicine July 2011  –  December 2013  (2 years 6 months) Stanford, CA, USA Contract and Grant Administrator Palo Alto Institute for Research & Education March 2010  –  July 2011  (1 year 5 months) Contract and Grant Administrator Palo Alto Institute for Research & Education March 2010  –  July 2011  (1 year 5 months) Project Manager Cureline March 2009  –  March 2010  (1 year 1 month) Project Manager Cureline March 2009  –  March 2010  (1 year 1 month) Operations Associate Next Step August 2007  –  November 2008  (1 year 4 months) Operations Associate Next Step August 2007  –  November 2008  (1 year 4 months) Project Lead and US Coordinator Cross Border Mentor 2005  –  2007  (2 years) Project Lead and US Coordinator Cross Border Mentor 2005  –  2007  (2 years) Reuters Digital Vision Fellow Stanford University September 2005  –  June 2006  (10 months) Reuters Digital Vision Fellow Stanford University September 2005  –  June 2006  (10 months) Project Manager BDA Estonia 2002  –  2005  (3 years) Project Manager BDA Estonia 2002  –  2005  (3 years) Executive Officer Department of Economic Affairs of Estonia 1999  –  2002  (3 years) Executive Officer Department of Economic Affairs of Estonia 1999  –  2002  (3 years) Consultant and Project Manager Christiansen Consulting 1998  –  2002  (4 years) Consultant and Project Manager Christiansen Consulting 1998  –  2002  (4 years) Skills Grant Management Research Management Public Funding Non-profits Organizational... Grant Writing Grants Skills  Grant Management Research Management Public Funding Non-profits Organizational... Grant Writing Grants Grant Management Research Management Public Funding Non-profits Organizational... Grant Writing Grants Grant Management Research Management Public Funding Non-profits Organizational... Grant Writing Grants Education Tallinn University Masters 1999  – 2001 Tallinna Tehnikaülikool Masters 1983  – 1989 Voru I KK Tallinn University Masters 1999  – 2001 Tallinn University Masters 1999  – 2001 Tallinn University Masters 1999  – 2001 Tallinna Tehnikaülikool Masters 1983  – 1989 Tallinna Tehnikaülikool Masters 1983  – 1989 Tallinna Tehnikaülikool Masters 1983  – 1989 Voru I KK Voru I KK Voru I KK ", "Skills Managerial Finance Grants Data Analysis Project Management Strategic Planning Accounting Statistics Grant Writing Research Program Evaluation Skills  Managerial Finance Grants Data Analysis Project Management Strategic Planning Accounting Statistics Grant Writing Research Program Evaluation Managerial Finance Grants Data Analysis Project Management Strategic Planning Accounting Statistics Grant Writing Research Program Evaluation Managerial Finance Grants Data Analysis Project Management Strategic Planning Accounting Statistics Grant Writing Research Program Evaluation ", "Summary SPECIALTIES \n \nEntrepreneur . Customer Loyalty . Strategic Planning . Product & Brand Development . Operations Management . Event Management Summary SPECIALTIES \n \nEntrepreneur . Customer Loyalty . Strategic Planning . Product & Brand Development . Operations Management . Event Management SPECIALTIES \n \nEntrepreneur . Customer Loyalty . Strategic Planning . Product & Brand Development . Operations Management . Event Management SPECIALTIES \n \nEntrepreneur . Customer Loyalty . Strategic Planning . Product & Brand Development . Operations Management . Event Management Experience Research Process Manager Stanford University School of Medicine August 2015  – Present (1 month) Palo Alto, CA To facilitate the research mission in the School of Medicine, the Research Management Group (RMG) serves as the central resource and expert partner on research administration providing support and oversight of sponsored projects. RMG represents Stanford University as the institutional official for proposal submission and award acceptance ensuring compliance with federal regulations, sponsor requirements and University policies. Administrative Associate Stanford University School of Medicine November 2009  –  August 2015  (5 years 10 months) ~ Manage academic office of Stanford's Movement Disorders Center. \n~ Coordinate schedules for center's professors/physicians. \n~ Coordinate faculty, fellowship, and personnel recruitment. \n~ NIH grants submission support. \n~ Track and manage center's expenses. Registration Assistant Stanford Alumni Association August 2009  –  October 2009  (3 months) Alumni Event Services ~ Managed registration process for guests and alumni of Stanford's 2009 Reunion Homecoming Weekend. \n \n~ Worked cross-functionally with internal departments to provide excellent customer service to over 3,000 internal and external customers. Proprietor & Artist Bryson Studios June 2003  –  October 2009  (6 years 5 months) ~ Founded and operated handmade artisan jewelry and gift business catering to high-end retail gift boutiques to include resort and museum gift shops, and artisan galleries. \n \n~ Managed all aspects of the business including design, production, sales, marketing, customer service, purchasing, accounting and HR. \n \n~ Awarded three US Design Patents in the first three years of operation. Senior Program Manager, Strategic Events Marketing Cadence Design Systems April 1999  –  May 2003  (4 years 2 months) ~ Developed and managed innovative, special events for executive management team, and meetings for internal and external customers with budgets of up to $2M. Events included foreign dignitary visits, industry press/analyst and customer events, Cadence Board of Directors meetings, executive management offsites, President’s Club annual incentive trip, and corporate sponsorship programs. \n \n~ Sourced speakers/presenters and event entertainment to include big name entertainment such Earth, Wind & Fire, The Beach Boys, Jay Leno, and the Pointer Sisters. \n \n~ Partnered with external vendors: travel/incentive houses, graphic design agencies, print and distribution centers, production companies, restaurants and hotels. Assistant Manager, Executive Briefing Center Cadence Design Systems April 1997  –  March 1999  (2 years) ~ Led initial planning and roll-out of Cadence's first EBC. \n \n~ Partnered with sales teams to coordinate logistics of executive level customer visits. Executive Administrator, Employee Communications Cadence Design Systems April 1996  –  April 1997  (1 year 1 month) ~ Provided executive level support to Employee Communications Vice President and team. Client Services Manager Lee Hecht Harrison 1994  –  1996  (2 years) ~ Coordinated career workshops for outplacement customers. \n \n~ Resume creation support as well as marketing collateral development to executive level customers starting their consulting businesses. Research Process Manager Stanford University School of Medicine August 2015  – Present (1 month) Palo Alto, CA To facilitate the research mission in the School of Medicine, the Research Management Group (RMG) serves as the central resource and expert partner on research administration providing support and oversight of sponsored projects. RMG represents Stanford University as the institutional official for proposal submission and award acceptance ensuring compliance with federal regulations, sponsor requirements and University policies. Research Process Manager Stanford University School of Medicine August 2015  – Present (1 month) Palo Alto, CA To facilitate the research mission in the School of Medicine, the Research Management Group (RMG) serves as the central resource and expert partner on research administration providing support and oversight of sponsored projects. RMG represents Stanford University as the institutional official for proposal submission and award acceptance ensuring compliance with federal regulations, sponsor requirements and University policies. Administrative Associate Stanford University School of Medicine November 2009  –  August 2015  (5 years 10 months) ~ Manage academic office of Stanford's Movement Disorders Center. \n~ Coordinate schedules for center's professors/physicians. \n~ Coordinate faculty, fellowship, and personnel recruitment. \n~ NIH grants submission support. \n~ Track and manage center's expenses. Administrative Associate Stanford University School of Medicine November 2009  –  August 2015  (5 years 10 months) ~ Manage academic office of Stanford's Movement Disorders Center. \n~ Coordinate schedules for center's professors/physicians. \n~ Coordinate faculty, fellowship, and personnel recruitment. \n~ NIH grants submission support. \n~ Track and manage center's expenses. Registration Assistant Stanford Alumni Association August 2009  –  October 2009  (3 months) Alumni Event Services ~ Managed registration process for guests and alumni of Stanford's 2009 Reunion Homecoming Weekend. \n \n~ Worked cross-functionally with internal departments to provide excellent customer service to over 3,000 internal and external customers. Registration Assistant Stanford Alumni Association August 2009  –  October 2009  (3 months) Alumni Event Services ~ Managed registration process for guests and alumni of Stanford's 2009 Reunion Homecoming Weekend. \n \n~ Worked cross-functionally with internal departments to provide excellent customer service to over 3,000 internal and external customers. Proprietor & Artist Bryson Studios June 2003  –  October 2009  (6 years 5 months) ~ Founded and operated handmade artisan jewelry and gift business catering to high-end retail gift boutiques to include resort and museum gift shops, and artisan galleries. \n \n~ Managed all aspects of the business including design, production, sales, marketing, customer service, purchasing, accounting and HR. \n \n~ Awarded three US Design Patents in the first three years of operation. Proprietor & Artist Bryson Studios June 2003  –  October 2009  (6 years 5 months) ~ Founded and operated handmade artisan jewelry and gift business catering to high-end retail gift boutiques to include resort and museum gift shops, and artisan galleries. \n \n~ Managed all aspects of the business including design, production, sales, marketing, customer service, purchasing, accounting and HR. \n \n~ Awarded three US Design Patents in the first three years of operation. Senior Program Manager, Strategic Events Marketing Cadence Design Systems April 1999  –  May 2003  (4 years 2 months) ~ Developed and managed innovative, special events for executive management team, and meetings for internal and external customers with budgets of up to $2M. Events included foreign dignitary visits, industry press/analyst and customer events, Cadence Board of Directors meetings, executive management offsites, President’s Club annual incentive trip, and corporate sponsorship programs. \n \n~ Sourced speakers/presenters and event entertainment to include big name entertainment such Earth, Wind & Fire, The Beach Boys, Jay Leno, and the Pointer Sisters. \n \n~ Partnered with external vendors: travel/incentive houses, graphic design agencies, print and distribution centers, production companies, restaurants and hotels. Senior Program Manager, Strategic Events Marketing Cadence Design Systems April 1999  –  May 2003  (4 years 2 months) ~ Developed and managed innovative, special events for executive management team, and meetings for internal and external customers with budgets of up to $2M. Events included foreign dignitary visits, industry press/analyst and customer events, Cadence Board of Directors meetings, executive management offsites, President’s Club annual incentive trip, and corporate sponsorship programs. \n \n~ Sourced speakers/presenters and event entertainment to include big name entertainment such Earth, Wind & Fire, The Beach Boys, Jay Leno, and the Pointer Sisters. \n \n~ Partnered with external vendors: travel/incentive houses, graphic design agencies, print and distribution centers, production companies, restaurants and hotels. Assistant Manager, Executive Briefing Center Cadence Design Systems April 1997  –  March 1999  (2 years) ~ Led initial planning and roll-out of Cadence's first EBC. \n \n~ Partnered with sales teams to coordinate logistics of executive level customer visits. Assistant Manager, Executive Briefing Center Cadence Design Systems April 1997  –  March 1999  (2 years) ~ Led initial planning and roll-out of Cadence's first EBC. \n \n~ Partnered with sales teams to coordinate logistics of executive level customer visits. Executive Administrator, Employee Communications Cadence Design Systems April 1996  –  April 1997  (1 year 1 month) ~ Provided executive level support to Employee Communications Vice President and team. Executive Administrator, Employee Communications Cadence Design Systems April 1996  –  April 1997  (1 year 1 month) ~ Provided executive level support to Employee Communications Vice President and team. Client Services Manager Lee Hecht Harrison 1994  –  1996  (2 years) ~ Coordinated career workshops for outplacement customers. \n \n~ Resume creation support as well as marketing collateral development to executive level customers starting their consulting businesses. Client Services Manager Lee Hecht Harrison 1994  –  1996  (2 years) ~ Coordinated career workshops for outplacement customers. \n \n~ Resume creation support as well as marketing collateral development to executive level customers starting their consulting businesses. Languages Cantonese Cantonese Cantonese Skills Entrepreneur Project Manager Customer Loyalty Strategic Planning Operations Management Event Management Web Design Graphic Design Adobe Creative Suite Quickbooks Salesforce.com Jewelry Design Manufacturing Operations Patent Development Grants Administration Entrepreneurship Management See 2+     See less Skills  Entrepreneur Project Manager Customer Loyalty Strategic Planning Operations Management Event Management Web Design Graphic Design Adobe Creative Suite Quickbooks Salesforce.com Jewelry Design Manufacturing Operations Patent Development Grants Administration Entrepreneurship Management See 2+     See less Entrepreneur Project Manager Customer Loyalty Strategic Planning Operations Management Event Management Web Design Graphic Design Adobe Creative Suite Quickbooks Salesforce.com Jewelry Design Manufacturing Operations Patent Development Grants Administration Entrepreneurship Management See 2+     See less Entrepreneur Project Manager Customer Loyalty Strategic Planning Operations Management Event Management Web Design Graphic Design Adobe Creative Suite Quickbooks Salesforce.com Jewelry Design Manufacturing Operations Patent Development Grants Administration Entrepreneurship Management See 2+     See less Education University of California, Davis Bachelor of Arts (B.A.),  Sociology , Organizational Studies 1988  – 1993 University of California, Davis Bachelor of Arts (B.A.),  Sociology , Organizational Studies 1988  – 1993 University of California, Davis Bachelor of Arts (B.A.),  Sociology , Organizational Studies 1988  – 1993 University of California, Davis Bachelor of Arts (B.A.),  Sociology , Organizational Studies 1988  – 1993 ", "Summary Skilled and dedicated Research Administrator with significant experience in pre- and post-award management \n•\tExperience in non-profit, government, research institute, medical and academic environments \n•\tFamiliar with federal, state and foundation sponsors \n•\tKnowledgeable in Grants.gov, FastLane, CDMRP eReceipt and Proposal Central electronic grant submissions in addition to paper submissions \n•\tInformed on OMB Circulars A -21, A -110, A -122 and A -133, NIH Grants Policy Statement and GAAP Accounting Principles  \n•\tAbility to multi-task and remain calm in deadline driven environments \n•\tSkilled in communicating with all types of individuals both verbally and in writing \n•\tProficient in Word, Excel, Access, Outlook, Lotus Notes, Adobe Acrobat, Raiser’s Edge, Milestones Simplicity, People Soft, Hyperion \n•\tExperience in Cost Point, Microsoft Dynamics SL and Oracle Financials accounting software \n•\tVersed in simple and complex budget preparation and analysis \n•\tProficient in both PC and Mac Summary Skilled and dedicated Research Administrator with significant experience in pre- and post-award management \n•\tExperience in non-profit, government, research institute, medical and academic environments \n•\tFamiliar with federal, state and foundation sponsors \n•\tKnowledgeable in Grants.gov, FastLane, CDMRP eReceipt and Proposal Central electronic grant submissions in addition to paper submissions \n•\tInformed on OMB Circulars A -21, A -110, A -122 and A -133, NIH Grants Policy Statement and GAAP Accounting Principles  \n•\tAbility to multi-task and remain calm in deadline driven environments \n•\tSkilled in communicating with all types of individuals both verbally and in writing \n•\tProficient in Word, Excel, Access, Outlook, Lotus Notes, Adobe Acrobat, Raiser’s Edge, Milestones Simplicity, People Soft, Hyperion \n•\tExperience in Cost Point, Microsoft Dynamics SL and Oracle Financials accounting software \n•\tVersed in simple and complex budget preparation and analysis \n•\tProficient in both PC and Mac Skilled and dedicated Research Administrator with significant experience in pre- and post-award management \n•\tExperience in non-profit, government, research institute, medical and academic environments \n•\tFamiliar with federal, state and foundation sponsors \n•\tKnowledgeable in Grants.gov, FastLane, CDMRP eReceipt and Proposal Central electronic grant submissions in addition to paper submissions \n•\tInformed on OMB Circulars A -21, A -110, A -122 and A -133, NIH Grants Policy Statement and GAAP Accounting Principles  \n•\tAbility to multi-task and remain calm in deadline driven environments \n•\tSkilled in communicating with all types of individuals both verbally and in writing \n•\tProficient in Word, Excel, Access, Outlook, Lotus Notes, Adobe Acrobat, Raiser’s Edge, Milestones Simplicity, People Soft, Hyperion \n•\tExperience in Cost Point, Microsoft Dynamics SL and Oracle Financials accounting software \n•\tVersed in simple and complex budget preparation and analysis \n•\tProficient in both PC and Mac Skilled and dedicated Research Administrator with significant experience in pre- and post-award management \n•\tExperience in non-profit, government, research institute, medical and academic environments \n•\tFamiliar with federal, state and foundation sponsors \n•\tKnowledgeable in Grants.gov, FastLane, CDMRP eReceipt and Proposal Central electronic grant submissions in addition to paper submissions \n•\tInformed on OMB Circulars A -21, A -110, A -122 and A -133, NIH Grants Policy Statement and GAAP Accounting Principles  \n•\tAbility to multi-task and remain calm in deadline driven environments \n•\tSkilled in communicating with all types of individuals both verbally and in writing \n•\tProficient in Word, Excel, Access, Outlook, Lotus Notes, Adobe Acrobat, Raiser’s Edge, Milestones Simplicity, People Soft, Hyperion \n•\tExperience in Cost Point, Microsoft Dynamics SL and Oracle Financials accounting software \n•\tVersed in simple and complex budget preparation and analysis \n•\tProficient in both PC and Mac Experience Research Process Manager Stanford University December 2014  – Present (9 months) Palo Alto, CA Grants Manager, Stanford Cancer Institute Stanford University, School of Medicine May 2010  –  December 2014  (4 years 8 months) -Financial management for sponsored projects, developmental funds and programs \n-Monitor sponsored project activity from pre-award stages through closeout \n-Perform monthly review and reconciliation for sponsored projects \n-Maintain financial spreadsheets and summaries for sponsored accounts and developmental funds \n-Meet monthly with Faculty to review commitments and projections \n-Monitor and manage faculty effort allocations, communicate to home department for entry \n-Approve financial transactions for Cancer Institute sponsored projects and developmental funds (signature authority)  \n-Program and financial management for Institute’s Developmental Cancer Research Award Program \n-Pre and Post award management of complex cooperative agreement (UM1) and training programs (T-32 and R25) Contract and Grant Administrator Palo Alto Institue for Research & Education, Inc. (VA Hospital) March 2009  –  March 2010  (1 year 1 month) Provided pre- and post-award administration of contracts, grants, clinical trials and other accounts for 113 Principal Investigators (many who have appointments at Stanford University) at the VA Palo Alto Health Care System. Grants & Contracts Coordinator Northern California Cancer Center May 2007  –  June 2008  (1 year 2 months) Provided pre- and post-award services for a non-profit Cancer research organization. Contracts & Grants/ Regulatory Affairs Assistant IV Northern California Cancer Center August 2006  –  May 2007  (10 months) Provided high level administrative and grant support for Contract & Grants and The Regulatrory Affairs (IRB) Departments. Grants Coordinator Impact Assessment, Inc. April 2003  –  July 2006  (3 years 4 months) Contractor to the California Department of Health Services, Environmental Health Investigations Branch. Provided administrative and grants administration for an environmental public health federally funded program. Office/ Finance Assistant The Sierra Club Foundation March 2001  –  December 2002  (1 year 10 months) Provided general office/finance support and direct support to the Director of Finance. Research Process Manager Stanford University December 2014  – Present (9 months) Palo Alto, CA Research Process Manager Stanford University December 2014  – Present (9 months) Palo Alto, CA Grants Manager, Stanford Cancer Institute Stanford University, School of Medicine May 2010  –  December 2014  (4 years 8 months) -Financial management for sponsored projects, developmental funds and programs \n-Monitor sponsored project activity from pre-award stages through closeout \n-Perform monthly review and reconciliation for sponsored projects \n-Maintain financial spreadsheets and summaries for sponsored accounts and developmental funds \n-Meet monthly with Faculty to review commitments and projections \n-Monitor and manage faculty effort allocations, communicate to home department for entry \n-Approve financial transactions for Cancer Institute sponsored projects and developmental funds (signature authority)  \n-Program and financial management for Institute’s Developmental Cancer Research Award Program \n-Pre and Post award management of complex cooperative agreement (UM1) and training programs (T-32 and R25) Grants Manager, Stanford Cancer Institute Stanford University, School of Medicine May 2010  –  December 2014  (4 years 8 months) -Financial management for sponsored projects, developmental funds and programs \n-Monitor sponsored project activity from pre-award stages through closeout \n-Perform monthly review and reconciliation for sponsored projects \n-Maintain financial spreadsheets and summaries for sponsored accounts and developmental funds \n-Meet monthly with Faculty to review commitments and projections \n-Monitor and manage faculty effort allocations, communicate to home department for entry \n-Approve financial transactions for Cancer Institute sponsored projects and developmental funds (signature authority)  \n-Program and financial management for Institute’s Developmental Cancer Research Award Program \n-Pre and Post award management of complex cooperative agreement (UM1) and training programs (T-32 and R25) Contract and Grant Administrator Palo Alto Institue for Research & Education, Inc. (VA Hospital) March 2009  –  March 2010  (1 year 1 month) Provided pre- and post-award administration of contracts, grants, clinical trials and other accounts for 113 Principal Investigators (many who have appointments at Stanford University) at the VA Palo Alto Health Care System. Contract and Grant Administrator Palo Alto Institue for Research & Education, Inc. (VA Hospital) March 2009  –  March 2010  (1 year 1 month) Provided pre- and post-award administration of contracts, grants, clinical trials and other accounts for 113 Principal Investigators (many who have appointments at Stanford University) at the VA Palo Alto Health Care System. Grants & Contracts Coordinator Northern California Cancer Center May 2007  –  June 2008  (1 year 2 months) Provided pre- and post-award services for a non-profit Cancer research organization. Grants & Contracts Coordinator Northern California Cancer Center May 2007  –  June 2008  (1 year 2 months) Provided pre- and post-award services for a non-profit Cancer research organization. Contracts & Grants/ Regulatory Affairs Assistant IV Northern California Cancer Center August 2006  –  May 2007  (10 months) Provided high level administrative and grant support for Contract & Grants and The Regulatrory Affairs (IRB) Departments. Contracts & Grants/ Regulatory Affairs Assistant IV Northern California Cancer Center August 2006  –  May 2007  (10 months) Provided high level administrative and grant support for Contract & Grants and The Regulatrory Affairs (IRB) Departments. Grants Coordinator Impact Assessment, Inc. April 2003  –  July 2006  (3 years 4 months) Contractor to the California Department of Health Services, Environmental Health Investigations Branch. Provided administrative and grants administration for an environmental public health federally funded program. Grants Coordinator Impact Assessment, Inc. April 2003  –  July 2006  (3 years 4 months) Contractor to the California Department of Health Services, Environmental Health Investigations Branch. Provided administrative and grants administration for an environmental public health federally funded program. Office/ Finance Assistant The Sierra Club Foundation March 2001  –  December 2002  (1 year 10 months) Provided general office/finance support and direct support to the Director of Finance. Office/ Finance Assistant The Sierra Club Foundation March 2001  –  December 2002  (1 year 10 months) Provided general office/finance support and direct support to the Director of Finance. Skills PeopleSoft Hyperion Oracle E-Business Suite Microsoft Excel Microsoft Word Access Financial Analysis Grant Preparation Grant Administration Federal Grants... Outlook Contract Negotiation Program Management Nonprofits Grant Writing Grants Research Budgets Hyperion Enterprise Analysis Process Improvement Management Microsoft Office See 8+     See less Skills  PeopleSoft Hyperion Oracle E-Business Suite Microsoft Excel Microsoft Word Access Financial Analysis Grant Preparation Grant Administration Federal Grants... Outlook Contract Negotiation Program Management Nonprofits Grant Writing Grants Research Budgets Hyperion Enterprise Analysis Process Improvement Management Microsoft Office See 8+     See less PeopleSoft Hyperion Oracle E-Business Suite Microsoft Excel Microsoft Word Access Financial Analysis Grant Preparation Grant Administration Federal Grants... Outlook Contract Negotiation Program Management Nonprofits Grant Writing Grants Research Budgets Hyperion Enterprise Analysis Process Improvement Management Microsoft Office See 8+     See less PeopleSoft Hyperion Oracle E-Business Suite Microsoft Excel Microsoft Word Access Financial Analysis Grant Preparation Grant Administration Federal Grants... Outlook Contract Negotiation Program Management Nonprofits Grant Writing Grants Research Budgets Hyperion Enterprise Analysis Process Improvement Management Microsoft Office See 8+     See less Education San Francisco State University 1997  – 2001 San Francisco State University 1997  – 2001 San Francisco State University 1997  – 2001 San Francisco State University 1997  – 2001 ", "Summary • Customer focused approach: personal goal of exceeding customer expectations \n• Strong communication ability: effective communication both verbally and written to help improve customer service \n• Effective personal workflow and time management skills: increasing work productivity in conjunction with assisting the team  \n• Excellent leadership and teamwork skills: providing advice and assistance wherever necessary to help colleagues, while also increasing personal independent efficiency \n• Extensive experience with Microsoft Office programs \n• Team building and motivating, successful in dispute resolution and mediation \n \nSpecialties:  \n• Budget analysis & projections \n• Microsoft Office Suite (Word, Excel, Access, PowerPoint, & Outlook) \n• Internet related activities \n• Mac operating systems \n• Oracle Financials proficient \n• HTML proficient \n• Database building \n• Technological troubleshooter \n• Excellent interpersonal & communication skills \n• Demonstrated leadership ability to implement change and encourage colleagues to reach their highest potential \n \nAfter work activities: \n• Traveling to experience different cultures \n• Running (1/2 marathons and shorter distances) to train my mind \n• Cooking and eating adventurously Summary • Customer focused approach: personal goal of exceeding customer expectations \n• Strong communication ability: effective communication both verbally and written to help improve customer service \n• Effective personal workflow and time management skills: increasing work productivity in conjunction with assisting the team  \n• Excellent leadership and teamwork skills: providing advice and assistance wherever necessary to help colleagues, while also increasing personal independent efficiency \n• Extensive experience with Microsoft Office programs \n• Team building and motivating, successful in dispute resolution and mediation \n \nSpecialties:  \n• Budget analysis & projections \n• Microsoft Office Suite (Word, Excel, Access, PowerPoint, & Outlook) \n• Internet related activities \n• Mac operating systems \n• Oracle Financials proficient \n• HTML proficient \n• Database building \n• Technological troubleshooter \n• Excellent interpersonal & communication skills \n• Demonstrated leadership ability to implement change and encourage colleagues to reach their highest potential \n \nAfter work activities: \n• Traveling to experience different cultures \n• Running (1/2 marathons and shorter distances) to train my mind \n• Cooking and eating adventurously • Customer focused approach: personal goal of exceeding customer expectations \n• Strong communication ability: effective communication both verbally and written to help improve customer service \n• Effective personal workflow and time management skills: increasing work productivity in conjunction with assisting the team  \n• Excellent leadership and teamwork skills: providing advice and assistance wherever necessary to help colleagues, while also increasing personal independent efficiency \n• Extensive experience with Microsoft Office programs \n• Team building and motivating, successful in dispute resolution and mediation \n \nSpecialties:  \n• Budget analysis & projections \n• Microsoft Office Suite (Word, Excel, Access, PowerPoint, & Outlook) \n• Internet related activities \n• Mac operating systems \n• Oracle Financials proficient \n• HTML proficient \n• Database building \n• Technological troubleshooter \n• Excellent interpersonal & communication skills \n• Demonstrated leadership ability to implement change and encourage colleagues to reach their highest potential \n \nAfter work activities: \n• Traveling to experience different cultures \n• Running (1/2 marathons and shorter distances) to train my mind \n• Cooking and eating adventurously • Customer focused approach: personal goal of exceeding customer expectations \n• Strong communication ability: effective communication both verbally and written to help improve customer service \n• Effective personal workflow and time management skills: increasing work productivity in conjunction with assisting the team  \n• Excellent leadership and teamwork skills: providing advice and assistance wherever necessary to help colleagues, while also increasing personal independent efficiency \n• Extensive experience with Microsoft Office programs \n• Team building and motivating, successful in dispute resolution and mediation \n \nSpecialties:  \n• Budget analysis & projections \n• Microsoft Office Suite (Word, Excel, Access, PowerPoint, & Outlook) \n• Internet related activities \n• Mac operating systems \n• Oracle Financials proficient \n• HTML proficient \n• Database building \n• Technological troubleshooter \n• Excellent interpersonal & communication skills \n• Demonstrated leadership ability to implement change and encourage colleagues to reach their highest potential \n \nAfter work activities: \n• Traveling to experience different cultures \n• Running (1/2 marathons and shorter distances) to train my mind \n• Cooking and eating adventurously Experience Contract and Grant Officer Stanford University June 2012  – Present (3 years 3 months) Stanford, CA Provides timely, high-quality and coordinated research administrative services to Stanford faculty and departments. Responsible for the formal solicitation, negotiation and administration of extramural support for University research, training, and public service projects funded by government and non-government sponsors. Responsible for conducting comprehensive analysis of proposals for extramural support to government and non-government entities, and negotiating a full array of contracts, subcontracts and grants with special conditions. Prepares, negotiates and oversees subawards issued under Stanford sponsored projects awards. Division Manager, Gastroenterology & Hepatology Stanford University School of Medicine March 2012  –  June 2012  (4 months) Oversees and manages financial and administrative affairs of the division consistent with standards of performance that ensure University, School of Medicine, Stanford Hospital & Clinics and Department of Medicine business standards and objectives are met. Assists and advises the Division Chief. Ensures compliance in all functional areas (i.e. Finance, Human Resources, Research Administration, Clinical Administration, Facilities, Health & Safety, Education & Student Affairs, and Faculty Affairs) with applicable School, University, Federal, State, Local, agency and Hospital/Clinic policies, procedures, laws, etc. Responsible for achieving the goals of both the Department and the Division through effective long-range planning, program development and administration; policy formulation; financial management; supervision of administrative staff; human resources management including health and safety compliance; and space & facilities management. Senior Research Process Manager Stanford University January 2008  –  February 2012  (4 years 2 months) Institutional Representative for sponsored projects and is responsible for management, compliance oversight, and facilitation of the complete sponsored research administration process for a defined set of School of Medicine faculty. Working in collaboration with faculty, business managers and other department and University staff. Ensures timely, accurate proposal submission, develops budgets, and provides institutional signature, ensuring that the proposal meets sponsor, University, and School guidelines/regulations. Functions as an expert partner and facilitator in post-award administration, coordinating with the PI and staff and sponsors to ensure that sponsored research funds are expended in accordance with internal and external policies, providing compliance oversight and guidance and policy communication, interpretation, and recommendations. Advocate for a responsive, effective research administration process in a deadline-driven customer service organization. Grants Manager Stanford University August 2007  –  January 2008  (6 months) Serves as approver for financial transactions and initiates/documents corrections to comply with sponsor’s rules and University/School of Medicine policies. Engages in forecasting of grant period, account reconciliation, monthly review of expenditure statements, and timely Principal Investigator quarterly certifications. Familiar with government contract and grant accounting as detailed in OMB Circular A-21 and A-110 cost principles. Financial transactions and reporting done in Oracle Financials. Contract & Grant Administrator PAIRE, Inc. March 2006  –  August 2007  (1 year 6 months) Pre- and post-award administration of research grants and contracts awards; review of grant applications to assure compliance with sponsor requirements; negotiation of clinical research agreements; post award review and coordination of funds flow to assure timeliness and appropriateness of expenditures, e.g., account set-up, sponsor financial reporting, and award closeout. Communicate effectively with Principal Investigators, administrators and sponsors, self-motivated and able to work effectively as part of a team. Analyst SAIC February 2005  –  March 2006  (1 year 2 months) Science Applications International Corporation (SAIC): Conducts analyses in direct support of the Navy Converged Solutions Program (CSP). Provides analytical and administrative services to SPAWAR 08E Converged Solutions Program Manager. Reviews Space and Naval Warfare Systems Command (SPAWAR) planning and implementation material and prepares recommendations for remedial action. Maintains CSP tracking schedules and coordinates the collection and dissemination of government-to-government furnished information (GGI). Develops briefing material, graphic flowcharts and matrices. Participates in technical and programmatic working groups, conferences and meetings affiliated with communications implementation. Has daily interaction with high-level SPAWAR managers. Benefits Analyst San Diego Pension Consultants (dba PENFLEX, Inc.) September 2003  –  February 2005  (1 year 6 months) (Company part of National Financial Partners.) Processes distributions of retirement pensions as well as prepares loans taken out against such pensions. Prepares and analyzes documents to send to clients (employers) and participants (employees) of retirement plans, utilizing various principles of accounting and acute analysis of details. Researches pension issues, financial reporting, preparation and coordination of quarterly reports and pension activities. Corresponds directly with tax authorities and lenders as well as clients and participants, requiring impeccable communication and customer service skills. Contract and Grant Officer Stanford University June 2012  – Present (3 years 3 months) Stanford, CA Provides timely, high-quality and coordinated research administrative services to Stanford faculty and departments. Responsible for the formal solicitation, negotiation and administration of extramural support for University research, training, and public service projects funded by government and non-government sponsors. Responsible for conducting comprehensive analysis of proposals for extramural support to government and non-government entities, and negotiating a full array of contracts, subcontracts and grants with special conditions. Prepares, negotiates and oversees subawards issued under Stanford sponsored projects awards. Contract and Grant Officer Stanford University June 2012  – Present (3 years 3 months) Stanford, CA Provides timely, high-quality and coordinated research administrative services to Stanford faculty and departments. Responsible for the formal solicitation, negotiation and administration of extramural support for University research, training, and public service projects funded by government and non-government sponsors. Responsible for conducting comprehensive analysis of proposals for extramural support to government and non-government entities, and negotiating a full array of contracts, subcontracts and grants with special conditions. Prepares, negotiates and oversees subawards issued under Stanford sponsored projects awards. Division Manager, Gastroenterology & Hepatology Stanford University School of Medicine March 2012  –  June 2012  (4 months) Oversees and manages financial and administrative affairs of the division consistent with standards of performance that ensure University, School of Medicine, Stanford Hospital & Clinics and Department of Medicine business standards and objectives are met. Assists and advises the Division Chief. Ensures compliance in all functional areas (i.e. Finance, Human Resources, Research Administration, Clinical Administration, Facilities, Health & Safety, Education & Student Affairs, and Faculty Affairs) with applicable School, University, Federal, State, Local, agency and Hospital/Clinic policies, procedures, laws, etc. Responsible for achieving the goals of both the Department and the Division through effective long-range planning, program development and administration; policy formulation; financial management; supervision of administrative staff; human resources management including health and safety compliance; and space & facilities management. Division Manager, Gastroenterology & Hepatology Stanford University School of Medicine March 2012  –  June 2012  (4 months) Oversees and manages financial and administrative affairs of the division consistent with standards of performance that ensure University, School of Medicine, Stanford Hospital & Clinics and Department of Medicine business standards and objectives are met. Assists and advises the Division Chief. Ensures compliance in all functional areas (i.e. Finance, Human Resources, Research Administration, Clinical Administration, Facilities, Health & Safety, Education & Student Affairs, and Faculty Affairs) with applicable School, University, Federal, State, Local, agency and Hospital/Clinic policies, procedures, laws, etc. Responsible for achieving the goals of both the Department and the Division through effective long-range planning, program development and administration; policy formulation; financial management; supervision of administrative staff; human resources management including health and safety compliance; and space & facilities management. Senior Research Process Manager Stanford University January 2008  –  February 2012  (4 years 2 months) Institutional Representative for sponsored projects and is responsible for management, compliance oversight, and facilitation of the complete sponsored research administration process for a defined set of School of Medicine faculty. Working in collaboration with faculty, business managers and other department and University staff. Ensures timely, accurate proposal submission, develops budgets, and provides institutional signature, ensuring that the proposal meets sponsor, University, and School guidelines/regulations. Functions as an expert partner and facilitator in post-award administration, coordinating with the PI and staff and sponsors to ensure that sponsored research funds are expended in accordance with internal and external policies, providing compliance oversight and guidance and policy communication, interpretation, and recommendations. Advocate for a responsive, effective research administration process in a deadline-driven customer service organization. Senior Research Process Manager Stanford University January 2008  –  February 2012  (4 years 2 months) Institutional Representative for sponsored projects and is responsible for management, compliance oversight, and facilitation of the complete sponsored research administration process for a defined set of School of Medicine faculty. Working in collaboration with faculty, business managers and other department and University staff. Ensures timely, accurate proposal submission, develops budgets, and provides institutional signature, ensuring that the proposal meets sponsor, University, and School guidelines/regulations. Functions as an expert partner and facilitator in post-award administration, coordinating with the PI and staff and sponsors to ensure that sponsored research funds are expended in accordance with internal and external policies, providing compliance oversight and guidance and policy communication, interpretation, and recommendations. Advocate for a responsive, effective research administration process in a deadline-driven customer service organization. Grants Manager Stanford University August 2007  –  January 2008  (6 months) Serves as approver for financial transactions and initiates/documents corrections to comply with sponsor’s rules and University/School of Medicine policies. Engages in forecasting of grant period, account reconciliation, monthly review of expenditure statements, and timely Principal Investigator quarterly certifications. Familiar with government contract and grant accounting as detailed in OMB Circular A-21 and A-110 cost principles. Financial transactions and reporting done in Oracle Financials. Grants Manager Stanford University August 2007  –  January 2008  (6 months) Serves as approver for financial transactions and initiates/documents corrections to comply with sponsor’s rules and University/School of Medicine policies. Engages in forecasting of grant period, account reconciliation, monthly review of expenditure statements, and timely Principal Investigator quarterly certifications. Familiar with government contract and grant accounting as detailed in OMB Circular A-21 and A-110 cost principles. Financial transactions and reporting done in Oracle Financials. Contract & Grant Administrator PAIRE, Inc. March 2006  –  August 2007  (1 year 6 months) Pre- and post-award administration of research grants and contracts awards; review of grant applications to assure compliance with sponsor requirements; negotiation of clinical research agreements; post award review and coordination of funds flow to assure timeliness and appropriateness of expenditures, e.g., account set-up, sponsor financial reporting, and award closeout. Communicate effectively with Principal Investigators, administrators and sponsors, self-motivated and able to work effectively as part of a team. Contract & Grant Administrator PAIRE, Inc. March 2006  –  August 2007  (1 year 6 months) Pre- and post-award administration of research grants and contracts awards; review of grant applications to assure compliance with sponsor requirements; negotiation of clinical research agreements; post award review and coordination of funds flow to assure timeliness and appropriateness of expenditures, e.g., account set-up, sponsor financial reporting, and award closeout. Communicate effectively with Principal Investigators, administrators and sponsors, self-motivated and able to work effectively as part of a team. Analyst SAIC February 2005  –  March 2006  (1 year 2 months) Science Applications International Corporation (SAIC): Conducts analyses in direct support of the Navy Converged Solutions Program (CSP). Provides analytical and administrative services to SPAWAR 08E Converged Solutions Program Manager. Reviews Space and Naval Warfare Systems Command (SPAWAR) planning and implementation material and prepares recommendations for remedial action. Maintains CSP tracking schedules and coordinates the collection and dissemination of government-to-government furnished information (GGI). Develops briefing material, graphic flowcharts and matrices. Participates in technical and programmatic working groups, conferences and meetings affiliated with communications implementation. Has daily interaction with high-level SPAWAR managers. Analyst SAIC February 2005  –  March 2006  (1 year 2 months) Science Applications International Corporation (SAIC): Conducts analyses in direct support of the Navy Converged Solutions Program (CSP). Provides analytical and administrative services to SPAWAR 08E Converged Solutions Program Manager. Reviews Space and Naval Warfare Systems Command (SPAWAR) planning and implementation material and prepares recommendations for remedial action. Maintains CSP tracking schedules and coordinates the collection and dissemination of government-to-government furnished information (GGI). Develops briefing material, graphic flowcharts and matrices. Participates in technical and programmatic working groups, conferences and meetings affiliated with communications implementation. Has daily interaction with high-level SPAWAR managers. Benefits Analyst San Diego Pension Consultants (dba PENFLEX, Inc.) September 2003  –  February 2005  (1 year 6 months) (Company part of National Financial Partners.) Processes distributions of retirement pensions as well as prepares loans taken out against such pensions. Prepares and analyzes documents to send to clients (employers) and participants (employees) of retirement plans, utilizing various principles of accounting and acute analysis of details. Researches pension issues, financial reporting, preparation and coordination of quarterly reports and pension activities. Corresponds directly with tax authorities and lenders as well as clients and participants, requiring impeccable communication and customer service skills. Benefits Analyst San Diego Pension Consultants (dba PENFLEX, Inc.) September 2003  –  February 2005  (1 year 6 months) (Company part of National Financial Partners.) Processes distributions of retirement pensions as well as prepares loans taken out against such pensions. Prepares and analyzes documents to send to clients (employers) and participants (employees) of retirement plans, utilizing various principles of accounting and acute analysis of details. Researches pension issues, financial reporting, preparation and coordination of quarterly reports and pension activities. Corresponds directly with tax authorities and lenders as well as clients and participants, requiring impeccable communication and customer service skills. Languages French French French Skills Access Outlook Microsoft Excel PowerPoint Microsoft Word Databases HTML Oracle E-Business Suite Microsoft Office Leadership Teamwork Team Building Policy Grants Research Data Analysis Training Budget Monitoring Public Speaking Grant Administration Proposal Writing Grant Monitoring Federal Grant Management Program Management Management Grant Writing Analysis See 12+     See less Skills  Access Outlook Microsoft Excel PowerPoint Microsoft Word Databases HTML Oracle E-Business Suite Microsoft Office Leadership Teamwork Team Building Policy Grants Research Data Analysis Training Budget Monitoring Public Speaking Grant Administration Proposal Writing Grant Monitoring Federal Grant Management Program Management Management Grant Writing Analysis See 12+     See less Access Outlook Microsoft Excel PowerPoint Microsoft Word Databases HTML Oracle E-Business Suite Microsoft Office Leadership Teamwork Team Building Policy Grants Research Data Analysis Training Budget Monitoring Public Speaking Grant Administration Proposal Writing Grant Monitoring Federal Grant Management Program Management Management Grant Writing Analysis See 12+     See less Access Outlook Microsoft Excel PowerPoint Microsoft Word Databases HTML Oracle E-Business Suite Microsoft Office Leadership Teamwork Team Building Policy Grants Research Data Analysis Training Budget Monitoring Public Speaking Grant Administration Proposal Writing Grant Monitoring Federal Grant Management Program Management Management Grant Writing Analysis See 12+     See less Education UC San Diego BA,  Political Science September 1997  – June 2002 (Also took classes at University of California, Santa Cruz) Courses in Political Science relating to Political Theory, International Relations, Constitutional Law; Programs of Concentration focused around Science & Technology and Humanities, including Calculus, Physics, Biology, Literature, French Language, History, et cetera. Activities and Societies:  Phi Alpha Delta (pre-law Fraternity) St. Francis High School 1993  – 1997 UC San Diego BA,  Political Science September 1997  – June 2002 (Also took classes at University of California, Santa Cruz) Courses in Political Science relating to Political Theory, International Relations, Constitutional Law; Programs of Concentration focused around Science & Technology and Humanities, including Calculus, Physics, Biology, Literature, French Language, History, et cetera. Activities and Societies:  Phi Alpha Delta (pre-law Fraternity) UC San Diego BA,  Political Science September 1997  – June 2002 (Also took classes at University of California, Santa Cruz) Courses in Political Science relating to Political Theory, International Relations, Constitutional Law; Programs of Concentration focused around Science & Technology and Humanities, including Calculus, Physics, Biology, Literature, French Language, History, et cetera. Activities and Societies:  Phi Alpha Delta (pre-law Fraternity) UC San Diego BA,  Political Science September 1997  – June 2002 (Also took classes at University of California, Santa Cruz) Courses in Political Science relating to Political Theory, International Relations, Constitutional Law; Programs of Concentration focused around Science & Technology and Humanities, including Calculus, Physics, Biology, Literature, French Language, History, et cetera. Activities and Societies:  Phi Alpha Delta (pre-law Fraternity) St. Francis High School 1993  – 1997 St. Francis High School 1993  – 1997 St. Francis High School 1993  – 1997 Honors & Awards Additional Honors & Awards Leadership certification, SRA International Additional Honors & Awards Leadership certification, SRA International Additional Honors & Awards Leadership certification, SRA International Additional Honors & Awards Leadership certification, SRA International ", "Experience Research Process Manager Stanford University Research Process Manager Stanford University Research Process Manager Stanford University ", "Summary A well trained, results oriented financial and academic research professional with over 5 years of specialized experience in financial system data analysis and interpretation; significant experience in areas of grant and contract compliance management; full knowledge of University and government administration policies and guidelines. Highly capable in utilizing a variety of analytic techniques to understand data and relay the implications of the results to the project team. Able to effectively collaborate as a team member including outstanding leadership skills. \n \n Summary A well trained, results oriented financial and academic research professional with over 5 years of specialized experience in financial system data analysis and interpretation; significant experience in areas of grant and contract compliance management; full knowledge of University and government administration policies and guidelines. Highly capable in utilizing a variety of analytic techniques to understand data and relay the implications of the results to the project team. Able to effectively collaborate as a team member including outstanding leadership skills. \n \n A well trained, results oriented financial and academic research professional with over 5 years of specialized experience in financial system data analysis and interpretation; significant experience in areas of grant and contract compliance management; full knowledge of University and government administration policies and guidelines. Highly capable in utilizing a variety of analytic techniques to understand data and relay the implications of the results to the project team. Able to effectively collaborate as a team member including outstanding leadership skills. \n \n A well trained, results oriented financial and academic research professional with over 5 years of specialized experience in financial system data analysis and interpretation; significant experience in areas of grant and contract compliance management; full knowledge of University and government administration policies and guidelines. Highly capable in utilizing a variety of analytic techniques to understand data and relay the implications of the results to the project team. Able to effectively collaborate as a team member including outstanding leadership skills. \n \n Experience Research Process Manager Stanford University June 2015  – Present (3 months) Palo Alto, California Faculty Research Assistant San Francisco State University January 2011  –  July 2015  (4 years 7 months) San Francisco Bay Area Research Financial Analyst Trainee-Community Affairs Division Federal Deposit Insurance Corporation 2013  –  June 2015  (2 years) San Francisco Bay Area Data Visualization Specialist Latino Decisions 2013  –  May 2015  (2 years) http://www.latinodecisions.com/ Teacher (Graduate Teacher Assistant) San Francisco State University 2012  –  2014  (2 years) San Francisco Bay Area Inside Sales Support Specialist Clipper Controls 2000  –  2007  (7 years) San Francisco Bay Area Supervisor, Front-End Manager Safeway Stores Inc. 1990  –  1999  (9 years) San Francisco Bay Area Research Process Manager Stanford University June 2015  – Present (3 months) Palo Alto, California Research Process Manager Stanford University June 2015  – Present (3 months) Palo Alto, California Faculty Research Assistant San Francisco State University January 2011  –  July 2015  (4 years 7 months) San Francisco Bay Area Faculty Research Assistant San Francisco State University January 2011  –  July 2015  (4 years 7 months) San Francisco Bay Area Research Financial Analyst Trainee-Community Affairs Division Federal Deposit Insurance Corporation 2013  –  June 2015  (2 years) San Francisco Bay Area Research Financial Analyst Trainee-Community Affairs Division Federal Deposit Insurance Corporation 2013  –  June 2015  (2 years) San Francisco Bay Area Data Visualization Specialist Latino Decisions 2013  –  May 2015  (2 years) http://www.latinodecisions.com/ Data Visualization Specialist Latino Decisions 2013  –  May 2015  (2 years) http://www.latinodecisions.com/ Teacher (Graduate Teacher Assistant) San Francisco State University 2012  –  2014  (2 years) San Francisco Bay Area Teacher (Graduate Teacher Assistant) San Francisco State University 2012  –  2014  (2 years) San Francisco Bay Area Inside Sales Support Specialist Clipper Controls 2000  –  2007  (7 years) San Francisco Bay Area Inside Sales Support Specialist Clipper Controls 2000  –  2007  (7 years) San Francisco Bay Area Supervisor, Front-End Manager Safeway Stores Inc. 1990  –  1999  (9 years) San Francisco Bay Area Supervisor, Front-End Manager Safeway Stores Inc. 1990  –  1999  (9 years) San Francisco Bay Area Languages Spanish Native or bilingual proficiency Spanish Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Skills Grant Administration Budget Forecasts Research Public Speaking Statistics Microsoft Office WordPress Windows PowerPoint SPSS Business Spanish Microsoft Excel Data Visualization HTML Marketing Teaching Social Media Cisco IOS Customer Service Web Design Skilled with computer... Demonstrated record of... Bilingual in Spanish. Excellent communication... Certification and... Experience in... Directed the work of... Supervised more than 30... Experience and... Skilled with computer... Played instrumental... Exchanged information... Extensive public... Respectfully and... Facilitated... Coordinated community,... Demonstrated success as... Ability to analyze... Assistant Manager... Certificate of... Data Analysis Qualitative Research Management Microsoft Word Psychology Project Management See 32+     See less Skills  Grant Administration Budget Forecasts Research Public Speaking Statistics Microsoft Office WordPress Windows PowerPoint SPSS Business Spanish Microsoft Excel Data Visualization HTML Marketing Teaching Social Media Cisco IOS Customer Service Web Design Skilled with computer... Demonstrated record of... Bilingual in Spanish. Excellent communication... Certification and... Experience in... Directed the work of... Supervised more than 30... Experience and... Skilled with computer... Played instrumental... Exchanged information... Extensive public... Respectfully and... Facilitated... Coordinated community,... Demonstrated success as... Ability to analyze... Assistant Manager... Certificate of... Data Analysis Qualitative Research Management Microsoft Word Psychology Project Management See 32+     See less Grant Administration Budget Forecasts Research Public Speaking Statistics Microsoft Office WordPress Windows PowerPoint SPSS Business Spanish Microsoft Excel Data Visualization HTML Marketing Teaching Social Media Cisco IOS Customer Service Web Design Skilled with computer... Demonstrated record of... Bilingual in Spanish. Excellent communication... Certification and... Experience in... Directed the work of... Supervised more than 30... Experience and... Skilled with computer... Played instrumental... Exchanged information... Extensive public... Respectfully and... Facilitated... Coordinated community,... Demonstrated success as... Ability to analyze... Assistant Manager... Certificate of... Data Analysis Qualitative Research Management Microsoft Word Psychology Project Management See 32+     See less Grant Administration Budget Forecasts Research Public Speaking Statistics Microsoft Office WordPress Windows PowerPoint SPSS Business Spanish Microsoft Excel Data Visualization HTML Marketing Teaching Social Media Cisco IOS Customer Service Web Design Skilled with computer... Demonstrated record of... Bilingual in Spanish. Excellent communication... Certification and... Experience in... Directed the work of... Supervised more than 30... Experience and... Skilled with computer... Played instrumental... Exchanged information... Extensive public... Respectfully and... Facilitated... Coordinated community,... Demonstrated success as... Ability to analyze... Assistant Manager... Certificate of... Data Analysis Qualitative Research Management Microsoft Word Psychology Project Management See 32+     See less Education San Francisco State University Master's Degree,  Experimental Psychology/Mind Brain Behavior 2012  – 2015 Activities and Societies:  Psi Chi International Honor Society in Psychology San Francisco State University BA,  Psychology 2010  – 2012 City College of San Francisco AA,  Liberal Arts 2006  – 2009 City College of San Francisco Certificate of Achievement,  Multimedia Studies 2006  – 2009 San Francisco State University Master's Degree,  Experimental Psychology/Mind Brain Behavior 2012  – 2015 Activities and Societies:  Psi Chi International Honor Society in Psychology San Francisco State University Master's Degree,  Experimental Psychology/Mind Brain Behavior 2012  – 2015 Activities and Societies:  Psi Chi International Honor Society in Psychology San Francisco State University Master's Degree,  Experimental Psychology/Mind Brain Behavior 2012  – 2015 Activities and Societies:  Psi Chi International Honor Society in Psychology San Francisco State University BA,  Psychology 2010  – 2012 San Francisco State University BA,  Psychology 2010  – 2012 San Francisco State University BA,  Psychology 2010  – 2012 City College of San Francisco AA,  Liberal Arts 2006  – 2009 City College of San Francisco AA,  Liberal Arts 2006  – 2009 City College of San Francisco AA,  Liberal Arts 2006  – 2009 City College of San Francisco Certificate of Achievement,  Multimedia Studies 2006  – 2009 City College of San Francisco Certificate of Achievement,  Multimedia Studies 2006  – 2009 City College of San Francisco Certificate of Achievement,  Multimedia Studies 2006  – 2009 ", "Experience Research Process Manager at Stanford University School of Medicine Stanford University Financial Planning & Analysis Manager DHL Airways, Inc. 1984  –  1998  (14 years) Research Process Manager at Stanford University School of Medicine Stanford University Research Process Manager at Stanford University School of Medicine Stanford University Financial Planning & Analysis Manager DHL Airways, Inc. 1984  –  1998  (14 years) Financial Planning & Analysis Manager DHL Airways, Inc. 1984  –  1998  (14 years) Education Santa Clara University B.S. in Commerce,  Accounting 1981  – 1982 completed undergraduate prerequisites at the  \nUniversity of California at Berkeley Santa Clara University B.S. in Commerce,  Accounting 1981  – 1982 completed undergraduate prerequisites at the  \nUniversity of California at Berkeley Santa Clara University B.S. in Commerce,  Accounting 1981  – 1982 completed undergraduate prerequisites at the  \nUniversity of California at Berkeley Santa Clara University B.S. in Commerce,  Accounting 1981  – 1982 completed undergraduate prerequisites at the  \nUniversity of California at Berkeley ", "Experience Research Process Manager Stanford University Research Process Manager Stanford University Research Process Manager Stanford University Skills Higher Education Research Statistics Public Speaking Management Matlab Microsoft Word Data Analysis Grant Writing Event Planning Teaching Microsoft Excel Microsoft Office Social Media Skills  Higher Education Research Statistics Public Speaking Management Matlab Microsoft Word Data Analysis Grant Writing Event Planning Teaching Microsoft Excel Microsoft Office Social Media Higher Education Research Statistics Public Speaking Management Matlab Microsoft Word Data Analysis Grant Writing Event Planning Teaching Microsoft Excel Microsoft Office Social Media Higher Education Research Statistics Public Speaking Management Matlab Microsoft Word Data Analysis Grant Writing Event Planning Teaching Microsoft Excel Microsoft Office Social Media ", "Experience Research Process Manager Stanford University, School of Medicine May 1994  – Present (21 years 4 months) Research Process Manager Stanford University, School of Medicine May 1994  – Present (21 years 4 months) Research Process Manager Stanford University, School of Medicine May 1994  – Present (21 years 4 months) Skills Research Skills  Research Research Research ", "Experience Research Process Manager Stanford University September 2013  – Present (2 years) Stanford University Institutional representative for Stanford School of Medicine grant and contract administration. \n \nDuties include: \nBudget development and interpretation of sponsor requirements. \nGrantsmanship and strategic advice for sponsored research activity. \nInstitutional review and signature authority on behalf of Stanford University. \nOversee research administrative process ensuring research proposals meed sponsor and University guidelines and regulations. \nAccepts awards on behalf of Stanford University. \nProvide expert consultation and oversight to ensure that sponsored research funds are managed in compliance with internal and external policies, Research Administration/Compliance Stanford University September 2011  –  August 2013  (2 years) Stanford University Policy and research administration and compliance. Research Process Manager Stanford University September 2007  –  August 2011  (4 years) Stanford School ov Medicine Institutional signature authority for research administrative proposals for Stanford School of Medicine. Research Process Manager Stanford University September 2013  – Present (2 years) Stanford University Institutional representative for Stanford School of Medicine grant and contract administration. \n \nDuties include: \nBudget development and interpretation of sponsor requirements. \nGrantsmanship and strategic advice for sponsored research activity. \nInstitutional review and signature authority on behalf of Stanford University. \nOversee research administrative process ensuring research proposals meed sponsor and University guidelines and regulations. \nAccepts awards on behalf of Stanford University. \nProvide expert consultation and oversight to ensure that sponsored research funds are managed in compliance with internal and external policies, Research Process Manager Stanford University September 2013  – Present (2 years) Stanford University Institutional representative for Stanford School of Medicine grant and contract administration. \n \nDuties include: \nBudget development and interpretation of sponsor requirements. \nGrantsmanship and strategic advice for sponsored research activity. \nInstitutional review and signature authority on behalf of Stanford University. \nOversee research administrative process ensuring research proposals meed sponsor and University guidelines and regulations. \nAccepts awards on behalf of Stanford University. \nProvide expert consultation and oversight to ensure that sponsored research funds are managed in compliance with internal and external policies, Research Administration/Compliance Stanford University September 2011  –  August 2013  (2 years) Stanford University Policy and research administration and compliance. Research Administration/Compliance Stanford University September 2011  –  August 2013  (2 years) Stanford University Policy and research administration and compliance. Research Process Manager Stanford University September 2007  –  August 2011  (4 years) Stanford School ov Medicine Institutional signature authority for research administrative proposals for Stanford School of Medicine. Research Process Manager Stanford University September 2007  –  August 2011  (4 years) Stanford School ov Medicine Institutional signature authority for research administrative proposals for Stanford School of Medicine. Skills Research Microsoft Office Project Management Higher Education Nonprofits Budgeting Reseach management Critical Thinking Skills  Research Microsoft Office Project Management Higher Education Nonprofits Budgeting Reseach management Critical Thinking Research Microsoft Office Project Management Higher Education Nonprofits Budgeting Reseach management Critical Thinking Research Microsoft Office Project Management Higher Education Nonprofits Budgeting Reseach management Critical Thinking ", "Experience Clinical Trials Research Process Manager Stanford University March 2013  – Present (2 years 6 months) Sponsored Programs Manager SJSU Research Foundation December 2009  –  January 2011  (1 year 2 months) HR Associate Stanford Alumni Association 1998  –  1999  (1 year) Corporate Affairs Specialist Apple Computer, Inc. December 1988  –  May 1991  (2 years 6 months) Clinical Trials Research Process Manager Stanford University March 2013  – Present (2 years 6 months) Clinical Trials Research Process Manager Stanford University March 2013  – Present (2 years 6 months) Sponsored Programs Manager SJSU Research Foundation December 2009  –  January 2011  (1 year 2 months) Sponsored Programs Manager SJSU Research Foundation December 2009  –  January 2011  (1 year 2 months) HR Associate Stanford Alumni Association 1998  –  1999  (1 year) HR Associate Stanford Alumni Association 1998  –  1999  (1 year) Corporate Affairs Specialist Apple Computer, Inc. December 1988  –  May 1991  (2 years 6 months) Corporate Affairs Specialist Apple Computer, Inc. December 1988  –  May 1991  (2 years 6 months) Skills Research Microsoft Office Microsoft Excel Project Management PowerPoint English Microsoft Word Analysis project budgetting Higher Education Skills  Research Microsoft Office Microsoft Excel Project Management PowerPoint English Microsoft Word Analysis project budgetting Higher Education Research Microsoft Office Microsoft Excel Project Management PowerPoint English Microsoft Word Analysis project budgetting Higher Education Research Microsoft Office Microsoft Excel Project Management PowerPoint English Microsoft Word Analysis project budgetting Higher Education Education London School of Economics and Political Science Master of Science (MSc),  Politics of the World Economy (IPE-PWE) 1987  – 1988 Santa Clara University Bachelor of Science (B.S.),  Anthropology 1981  – 1985 Dhahran Senior Staff School London School of Economics and Political Science Master of Science (MSc),  Politics of the World Economy (IPE-PWE) 1987  – 1988 London School of Economics and Political Science Master of Science (MSc),  Politics of the World Economy (IPE-PWE) 1987  – 1988 London School of Economics and Political Science Master of Science (MSc),  Politics of the World Economy (IPE-PWE) 1987  – 1988 Santa Clara University Bachelor of Science (B.S.),  Anthropology 1981  – 1985 Santa Clara University Bachelor of Science (B.S.),  Anthropology 1981  – 1985 Santa Clara University Bachelor of Science (B.S.),  Anthropology 1981  – 1985 Dhahran Senior Staff School Dhahran Senior Staff School Dhahran Senior Staff School ", "Experience Senior Research Process Manager / Institutional Official Stanford University School of Medicine April 2012  – Present (3 years 5 months) Research Process Manager Stanford University School of Medicine March 2010  –  April 2012  (2 years 2 months) Clinical Trials Research Manager Associate Stanford University School of Medicine July 2007  –  March 2010  (2 years 9 months) Research administration, clinical site budgeting, quality assurance, and internal and external compliance for industry-sponsored clinical trials. Research Associate Genentech June 2005  –  August 2007  (2 years 3 months) Life Science Research Associate Stanford University June 2003  –  June 2005  (2 years 1 month) Senior Research Process Manager / Institutional Official Stanford University School of Medicine April 2012  – Present (3 years 5 months) Senior Research Process Manager / Institutional Official Stanford University School of Medicine April 2012  – Present (3 years 5 months) Research Process Manager Stanford University School of Medicine March 2010  –  April 2012  (2 years 2 months) Research Process Manager Stanford University School of Medicine March 2010  –  April 2012  (2 years 2 months) Clinical Trials Research Manager Associate Stanford University School of Medicine July 2007  –  March 2010  (2 years 9 months) Research administration, clinical site budgeting, quality assurance, and internal and external compliance for industry-sponsored clinical trials. Clinical Trials Research Manager Associate Stanford University School of Medicine July 2007  –  March 2010  (2 years 9 months) Research administration, clinical site budgeting, quality assurance, and internal and external compliance for industry-sponsored clinical trials. Research Associate Genentech June 2005  –  August 2007  (2 years 3 months) Research Associate Genentech June 2005  –  August 2007  (2 years 3 months) Life Science Research Associate Stanford University June 2003  –  June 2005  (2 years 1 month) Life Science Research Associate Stanford University June 2003  –  June 2005  (2 years 1 month) Skills Lifesciences Clinical Research Clinical Trials Molecular Biology Research Quality Assurance Cell Biology Biotechnology Neuroscience Cell Culture Drug Discovery Biochemistry Genetics Medical Devices Data Analysis Science Grant Administration Grant Preparation Federal Grants... Grantsmanship Grant Reviewing NIH FDA Contract Management Financial Analysis Non-profit... Life Sciences See 12+     See less Skills  Lifesciences Clinical Research Clinical Trials Molecular Biology Research Quality Assurance Cell Biology Biotechnology Neuroscience Cell Culture Drug Discovery Biochemistry Genetics Medical Devices Data Analysis Science Grant Administration Grant Preparation Federal Grants... Grantsmanship Grant Reviewing NIH FDA Contract Management Financial Analysis Non-profit... Life Sciences See 12+     See less Lifesciences Clinical Research Clinical Trials Molecular Biology Research Quality Assurance Cell Biology Biotechnology Neuroscience Cell Culture Drug Discovery Biochemistry Genetics Medical Devices Data Analysis Science Grant Administration Grant Preparation Federal Grants... Grantsmanship Grant Reviewing NIH FDA Contract Management Financial Analysis Non-profit... Life Sciences See 12+     See less Lifesciences Clinical Research Clinical Trials Molecular Biology Research Quality Assurance Cell Biology Biotechnology Neuroscience Cell Culture Drug Discovery Biochemistry Genetics Medical Devices Data Analysis Science Grant Administration Grant Preparation Federal Grants... Grantsmanship Grant Reviewing NIH FDA Contract Management Financial Analysis Non-profit... Life Sciences See 12+     See less Education University of California, Los Angeles B.S.,  Molecular , Cell and Developmental Biology 1999  – 2003 University of California, Santa Cruz Certificate,  Clinical Trials Design and Management 2006  – 2007 University of California, Los Angeles B.S.,  Molecular , Cell and Developmental Biology 1999  – 2003 University of California, Los Angeles B.S.,  Molecular , Cell and Developmental Biology 1999  – 2003 University of California, Los Angeles B.S.,  Molecular , Cell and Developmental Biology 1999  – 2003 University of California, Santa Cruz Certificate,  Clinical Trials Design and Management 2006  – 2007 University of California, Santa Cruz Certificate,  Clinical Trials Design and Management 2006  – 2007 University of California, Santa Cruz Certificate,  Clinical Trials Design and Management 2006  – 2007 ", "Summary Significant functional and technical expertise in research finance, accounting and administration with over 10 years of combined experience with academic medical centers and business consulting firms. Results oriented team player with proven experience in research accounting, reporting and analysis, business process re-engineering, policy development and operations management. Strong communication skills, written and oral, and experience as a presenter and educator for the on-boarding and continuing professional development of clinical research staff on all aspects of financial management. Summary Significant functional and technical expertise in research finance, accounting and administration with over 10 years of combined experience with academic medical centers and business consulting firms. Results oriented team player with proven experience in research accounting, reporting and analysis, business process re-engineering, policy development and operations management. Strong communication skills, written and oral, and experience as a presenter and educator for the on-boarding and continuing professional development of clinical research staff on all aspects of financial management. Significant functional and technical expertise in research finance, accounting and administration with over 10 years of combined experience with academic medical centers and business consulting firms. Results oriented team player with proven experience in research accounting, reporting and analysis, business process re-engineering, policy development and operations management. Strong communication skills, written and oral, and experience as a presenter and educator for the on-boarding and continuing professional development of clinical research staff on all aspects of financial management. Significant functional and technical expertise in research finance, accounting and administration with over 10 years of combined experience with academic medical centers and business consulting firms. Results oriented team player with proven experience in research accounting, reporting and analysis, business process re-engineering, policy development and operations management. Strong communication skills, written and oral, and experience as a presenter and educator for the on-boarding and continuing professional development of clinical research staff on all aspects of financial management. Experience Research Process Manager Stanford University June 2015  – Present (3 months) Research Financial Analyst Cedars-Sinai Medical Center July 2012  –  May 2015  (2 years 11 months) Greater Los Angeles Area Business Consultant Attain September 2009  –  June 2012  (2 years 10 months) McLean, VA Business Analyst BearingPoint June 2008  –  August 2009  (1 year 3 months) Vienna, VA Research Grant Assistant Partners HealthCare June 2004  –  April 2008  (3 years 11 months) Greater Boston Area Research Process Manager Stanford University June 2015  – Present (3 months) Research Process Manager Stanford University June 2015  – Present (3 months) Research Financial Analyst Cedars-Sinai Medical Center July 2012  –  May 2015  (2 years 11 months) Greater Los Angeles Area Research Financial Analyst Cedars-Sinai Medical Center July 2012  –  May 2015  (2 years 11 months) Greater Los Angeles Area Business Consultant Attain September 2009  –  June 2012  (2 years 10 months) McLean, VA Business Consultant Attain September 2009  –  June 2012  (2 years 10 months) McLean, VA Business Analyst BearingPoint June 2008  –  August 2009  (1 year 3 months) Vienna, VA Business Analyst BearingPoint June 2008  –  August 2009  (1 year 3 months) Vienna, VA Research Grant Assistant Partners HealthCare June 2004  –  April 2008  (3 years 11 months) Greater Boston Area Research Grant Assistant Partners HealthCare June 2004  –  April 2008  (3 years 11 months) Greater Boston Area Skills Grants PeopleSoft Data Analysis Business Process... Nonprofits Clinical Research Federal Grants... Philanthropy Project Management Lean Six Sigma Skills  Grants PeopleSoft Data Analysis Business Process... Nonprofits Clinical Research Federal Grants... Philanthropy Project Management Lean Six Sigma Grants PeopleSoft Data Analysis Business Process... Nonprofits Clinical Research Federal Grants... Philanthropy Project Management Lean Six Sigma Grants PeopleSoft Data Analysis Business Process... Nonprofits Clinical Research Federal Grants... Philanthropy Project Management Lean Six Sigma Education Boston University Bachelor of Arts (B.A.) 2004  – 2008 Boston University Bachelor of Arts (B.A.) 2004  – 2008 Boston University Bachelor of Arts (B.A.) 2004  – 2008 Boston University Bachelor of Arts (B.A.) 2004  – 2008 ", "Experience Research Process Manager Stanford University School of Medicine April 2012  – Present (3 years 5 months) 3172 Porter Drive, Palo Alato Work with Stanford University faculty members to submit grant proposals. Analyst II UCSF April 2012  – Present (3 years 5 months) CTSI CRS Protocol Manager University of California, San Francisco 2006  – Present (9 years) Research Process Manager Stanford University School of Medicine April 2012  – Present (3 years 5 months) 3172 Porter Drive, Palo Alato Work with Stanford University faculty members to submit grant proposals. Research Process Manager Stanford University School of Medicine April 2012  – Present (3 years 5 months) 3172 Porter Drive, Palo Alato Work with Stanford University faculty members to submit grant proposals. Analyst II UCSF April 2012  – Present (3 years 5 months) Analyst II UCSF April 2012  – Present (3 years 5 months) CTSI CRS Protocol Manager University of California, San Francisco 2006  – Present (9 years) CTSI CRS Protocol Manager University of California, San Francisco 2006  – Present (9 years) Education UC Davis BS,  Economics , Business Studies,  Communication 1995  – 1998 UC Davis BS,  Economics , Business Studies,  Communication 1995  – 1998 UC Davis BS,  Economics , Business Studies,  Communication 1995  – 1998 UC Davis BS,  Economics , Business Studies,  Communication 1995  – 1998 ", "Experience Research Process Manager Stanford University School of Medicine Department Administrator Rush University Medical Center 1973  –  1979  (6 years) Chicago, Illinois Research Technician Illinois Institute of Technology 1969  –  1973  (4 years) Chicago, Illinois Clinical Laboratory Technologist Washington Hospital Center 1967  –  1969  (2 years) Washington D.C. Metro Area Research Technician The University of Chicago 1965  –  1967  (2 years) Chicago, Illinois Research Process Manager Stanford University School of Medicine Research Process Manager Stanford University School of Medicine Department Administrator Rush University Medical Center 1973  –  1979  (6 years) Chicago, Illinois Department Administrator Rush University Medical Center 1973  –  1979  (6 years) Chicago, Illinois Research Technician Illinois Institute of Technology 1969  –  1973  (4 years) Chicago, Illinois Research Technician Illinois Institute of Technology 1969  –  1973  (4 years) Chicago, Illinois Clinical Laboratory Technologist Washington Hospital Center 1967  –  1969  (2 years) Washington D.C. Metro Area Clinical Laboratory Technologist Washington Hospital Center 1967  –  1969  (2 years) Washington D.C. Metro Area Research Technician The University of Chicago 1965  –  1967  (2 years) Chicago, Illinois Research Technician The University of Chicago 1965  –  1967  (2 years) Chicago, Illinois Languages   Skills Skills     Education Stanford University Graduate School of Business Accounting courses Loyola University of Chicago Master of Business Administration (M.B.A.),  Finance Miami University Bachelor's degree,  Major: Biology ,  Minor: Chemistry Stanford University Graduate School of Business Accounting courses Stanford University Graduate School of Business Accounting courses Stanford University Graduate School of Business Accounting courses Loyola University of Chicago Master of Business Administration (M.B.A.),  Finance Loyola University of Chicago Master of Business Administration (M.B.A.),  Finance Loyola University of Chicago Master of Business Administration (M.B.A.),  Finance Miami University Bachelor's degree,  Major: Biology ,  Minor: Chemistry Miami University Bachelor's degree,  Major: Biology ,  Minor: Chemistry Miami University Bachelor's degree,  Major: Biology ,  Minor: Chemistry Honors & Awards ", "Experience Clinical Trials Research Process Manager Stanford University Clinical Trials Research Process Manager Stanford University Clinical Trials Research Process Manager Stanford University ", "Experience Senior Research Process Manager/ Institutional Official Stanford University August 2014  – Present (1 year 1 month) Research Process Manager Stanford University November 2012  – Present (2 years 10 months) Senior Research Process Manager/ Institutional Official Stanford University August 2014  – Present (1 year 1 month) Senior Research Process Manager/ Institutional Official Stanford University August 2014  – Present (1 year 1 month) Research Process Manager Stanford University November 2012  – Present (2 years 10 months) Research Process Manager Stanford University November 2012  – Present (2 years 10 months) Skills Grants Project Management Data Analysis Research Grant Writing Nonprofits Qualitative Research Policy Analysis Statistics Program Development Community Outreach Skills  Grants Project Management Data Analysis Research Grant Writing Nonprofits Qualitative Research Policy Analysis Statistics Program Development Community Outreach Grants Project Management Data Analysis Research Grant Writing Nonprofits Qualitative Research Policy Analysis Statistics Program Development Community Outreach Grants Project Management Data Analysis Research Grant Writing Nonprofits Qualitative Research Policy Analysis Statistics Program Development Community Outreach Education Teachers College of Columbia University MA 2005  – 2006 University of California, Berkeley BA 2001  – 2005 Teachers College of Columbia University MA 2005  – 2006 Teachers College of Columbia University MA 2005  – 2006 Teachers College of Columbia University MA 2005  – 2006 University of California, Berkeley BA 2001  – 2005 University of California, Berkeley BA 2001  – 2005 University of California, Berkeley BA 2001  – 2005 ", "Experience Research Process Manager Stanford University School of Medicine Research Process Manager Stanford University School of Medicine Research Process Manager Stanford University School of Medicine Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Nonprofits Research Data Analysis Biotechnology Grants Project Management Neuroscience Management Healthcare Negotiation Microsoft Office Microsoft Excel Microsoft Word Contract Negotiation Program Management Skills  Nonprofits Research Data Analysis Biotechnology Grants Project Management Neuroscience Management Healthcare Negotiation Microsoft Office Microsoft Excel Microsoft Word Contract Negotiation Program Management Nonprofits Research Data Analysis Biotechnology Grants Project Management Neuroscience Management Healthcare Negotiation Microsoft Office Microsoft Excel Microsoft Word Contract Negotiation Program Management Nonprofits Research Data Analysis Biotechnology Grants Project Management Neuroscience Management Healthcare Negotiation Microsoft Office Microsoft Excel Microsoft Word Contract Negotiation Program Management ", "Experience Research Process Manager Stanford University School of Medicine Research Process Manager Stanford University School of Medicine Research Process Manager Stanford University School of Medicine ", "Experience Research Process Manager Stanford University School of Medicine November 2004  – Present (10 years 10 months) IRB Panel Manager Stanford University October 1999  –  November 2004  (5 years 2 months) RPM Associate Stanford University School of Medicine August 1998  –  October 1999  (1 year 3 months) Research Compliance Analyst Stanford University August 1996  –  August 1998  (2 years 1 month) Research Process Manager Stanford University School of Medicine November 2004  – Present (10 years 10 months) Research Process Manager Stanford University School of Medicine November 2004  – Present (10 years 10 months) IRB Panel Manager Stanford University October 1999  –  November 2004  (5 years 2 months) IRB Panel Manager Stanford University October 1999  –  November 2004  (5 years 2 months) RPM Associate Stanford University School of Medicine August 1998  –  October 1999  (1 year 3 months) RPM Associate Stanford University School of Medicine August 1998  –  October 1999  (1 year 3 months) Research Compliance Analyst Stanford University August 1996  –  August 1998  (2 years 1 month) Research Compliance Analyst Stanford University August 1996  –  August 1998  (2 years 1 month) Skills Data Analysis Skills  Data Analysis Data Analysis Data Analysis Education Notre Dame de Namur University Bachelor of Science (BS),  Business Administration and Management , General 1999  – 2001 University of California, Santa Barbara Notre Dame de Namur University Bachelor of Science (BS),  Business Administration and Management , General 1999  – 2001 Notre Dame de Namur University Bachelor of Science (BS),  Business Administration and Management , General 1999  – 2001 Notre Dame de Namur University Bachelor of Science (BS),  Business Administration and Management , General 1999  – 2001 University of California, Santa Barbara University of California, Santa Barbara University of California, Santa Barbara "]}