{"position": "Resident Assistant", "company": "Stanford University", "profiles": ["Summary I see myself as someone who wants their work to positively impact as many community members as possible. If i'm not the expert on a given topic, I try to outreach to those who are for and get them involved. The more people with diverse expertise that are working together within a community, the more output of productivity. I try to be non-biased in my approaches to tasks and that has served me well in collaboration efforts in the professional world. I'm always willing to learn and have an open mind to ideas and criticism. I'm very much a hands-on learner and from watching an example I can generally pick things up step-by-step very quickly. I am both gregarious and focused within the work environment, whenever necessary. I have grant writing capabilities and can read data charts and graphs with ease. Summary I see myself as someone who wants their work to positively impact as many community members as possible. If i'm not the expert on a given topic, I try to outreach to those who are for and get them involved. The more people with diverse expertise that are working together within a community, the more output of productivity. I try to be non-biased in my approaches to tasks and that has served me well in collaboration efforts in the professional world. I'm always willing to learn and have an open mind to ideas and criticism. I'm very much a hands-on learner and from watching an example I can generally pick things up step-by-step very quickly. I am both gregarious and focused within the work environment, whenever necessary. I have grant writing capabilities and can read data charts and graphs with ease. I see myself as someone who wants their work to positively impact as many community members as possible. If i'm not the expert on a given topic, I try to outreach to those who are for and get them involved. The more people with diverse expertise that are working together within a community, the more output of productivity. I try to be non-biased in my approaches to tasks and that has served me well in collaboration efforts in the professional world. I'm always willing to learn and have an open mind to ideas and criticism. I'm very much a hands-on learner and from watching an example I can generally pick things up step-by-step very quickly. I am both gregarious and focused within the work environment, whenever necessary. I have grant writing capabilities and can read data charts and graphs with ease. I see myself as someone who wants their work to positively impact as many community members as possible. If i'm not the expert on a given topic, I try to outreach to those who are for and get them involved. The more people with diverse expertise that are working together within a community, the more output of productivity. I try to be non-biased in my approaches to tasks and that has served me well in collaboration efforts in the professional world. I'm always willing to learn and have an open mind to ideas and criticism. I'm very much a hands-on learner and from watching an example I can generally pick things up step-by-step very quickly. I am both gregarious and focused within the work environment, whenever necessary. I have grant writing capabilities and can read data charts and graphs with ease. Experience Public Health Intern K'ima:w Medical Center June 2014  – Present (1 year 3 months) Hoopa, California Most of my work revolves around community-based service through providing information on health concerns. I design pamphlets that can be distributed in-person or that can be viewed online on personal healthcare that can be practiced within my Native American reservation. Other work is also being done, which remains to be clarified when the time is right. Resident Assistant Stanford University September 2013  – Present (2 years) I was an available resource for lockouts, counseling on personal issues as a student, organizer of staff meetings and dorm house agendas, organizer of dorm trips, resource for contacting Residential Director in case of emergencies etc. Operator and Driver Stanford University January 2012  – Present (3 years 8 months) Under the office of Alcohol Education, I acted as a phone operator for scheduling rides for students that felt unsafe or compromised in their attempts to migrate from one area of campus to another. I also was the driver that shuttled students from point A to point B safely Engineering Intern Trinity Valley Consulting Enginneers June 2013  –  September 2013  (4 months) Worked in ICAD and drew up schematics for insertion of sewage systems. Worked in the field as a surveyor of property and construction progress Community Coordinator Stanford University September 2012  –  June 2013  (10 months) Wrote grants to various departments to fund cultural activities and bring in guest speakers from across the U.S. Also managed the upkeep of the NACC (Native American Cultural Center) at Stanford University. Provided technical services for presenters within the center for powerpoint. Summer Adult Camp Counselor United Indian Health Services June 2012  –  July 2012  (2 months) Worked with children and helped facilitate bonding experience between them in a traditional, cultural setting. Encouraged activities with health benefits or traditional meaning, such as cultural arts and ceremonies. Public Health Intern K'ima:w Medical Center June 2014  – Present (1 year 3 months) Hoopa, California Most of my work revolves around community-based service through providing information on health concerns. I design pamphlets that can be distributed in-person or that can be viewed online on personal healthcare that can be practiced within my Native American reservation. Other work is also being done, which remains to be clarified when the time is right. Public Health Intern K'ima:w Medical Center June 2014  – Present (1 year 3 months) Hoopa, California Most of my work revolves around community-based service through providing information on health concerns. I design pamphlets that can be distributed in-person or that can be viewed online on personal healthcare that can be practiced within my Native American reservation. Other work is also being done, which remains to be clarified when the time is right. Resident Assistant Stanford University September 2013  – Present (2 years) I was an available resource for lockouts, counseling on personal issues as a student, organizer of staff meetings and dorm house agendas, organizer of dorm trips, resource for contacting Residential Director in case of emergencies etc. Resident Assistant Stanford University September 2013  – Present (2 years) I was an available resource for lockouts, counseling on personal issues as a student, organizer of staff meetings and dorm house agendas, organizer of dorm trips, resource for contacting Residential Director in case of emergencies etc. Operator and Driver Stanford University January 2012  – Present (3 years 8 months) Under the office of Alcohol Education, I acted as a phone operator for scheduling rides for students that felt unsafe or compromised in their attempts to migrate from one area of campus to another. I also was the driver that shuttled students from point A to point B safely Operator and Driver Stanford University January 2012  – Present (3 years 8 months) Under the office of Alcohol Education, I acted as a phone operator for scheduling rides for students that felt unsafe or compromised in their attempts to migrate from one area of campus to another. I also was the driver that shuttled students from point A to point B safely Engineering Intern Trinity Valley Consulting Enginneers June 2013  –  September 2013  (4 months) Worked in ICAD and drew up schematics for insertion of sewage systems. Worked in the field as a surveyor of property and construction progress Engineering Intern Trinity Valley Consulting Enginneers June 2013  –  September 2013  (4 months) Worked in ICAD and drew up schematics for insertion of sewage systems. Worked in the field as a surveyor of property and construction progress Community Coordinator Stanford University September 2012  –  June 2013  (10 months) Wrote grants to various departments to fund cultural activities and bring in guest speakers from across the U.S. Also managed the upkeep of the NACC (Native American Cultural Center) at Stanford University. Provided technical services for presenters within the center for powerpoint. Community Coordinator Stanford University September 2012  –  June 2013  (10 months) Wrote grants to various departments to fund cultural activities and bring in guest speakers from across the U.S. Also managed the upkeep of the NACC (Native American Cultural Center) at Stanford University. Provided technical services for presenters within the center for powerpoint. Summer Adult Camp Counselor United Indian Health Services June 2012  –  July 2012  (2 months) Worked with children and helped facilitate bonding experience between them in a traditional, cultural setting. Encouraged activities with health benefits or traditional meaning, such as cultural arts and ceremonies. Summer Adult Camp Counselor United Indian Health Services June 2012  –  July 2012  (2 months) Worked with children and helped facilitate bonding experience between them in a traditional, cultural setting. Encouraged activities with health benefits or traditional meaning, such as cultural arts and ceremonies. Languages Spanish Hupa Spanish Hupa Spanish Hupa Skills Public Speaking Research Healthcare Data Analysis Event Planning Statistics Nonprofits Program Development Fundraising Grant Writing Grants Microsoft Word Acting Human Rights Activism Final Cut Pro Logic Pro MASSIVE HD Camera Operation Volunteer Management See 4+     See less Skills  Public Speaking Research Healthcare Data Analysis Event Planning Statistics Nonprofits Program Development Fundraising Grant Writing Grants Microsoft Word Acting Human Rights Activism Final Cut Pro Logic Pro MASSIVE HD Camera Operation Volunteer Management See 4+     See less Public Speaking Research Healthcare Data Analysis Event Planning Statistics Nonprofits Program Development Fundraising Grant Writing Grants Microsoft Word Acting Human Rights Activism Final Cut Pro Logic Pro MASSIVE HD Camera Operation Volunteer Management See 4+     See less Public Speaking Research Healthcare Data Analysis Event Planning Statistics Nonprofits Program Development Fundraising Grant Writing Grants Microsoft Word Acting Human Rights Activism Final Cut Pro Logic Pro MASSIVE HD Camera Operation Volunteer Management See 4+     See less Education Stanford University Bachelor of Arts (BA),  Comparative Studies in Race & Ethnicity 2011  – 2015 Activities and Societies:  Residential Education ,  5-SURE ,  Stanford Powwow ,  Stanford American Indian Organization Hoopa Valley high School 2007  – 2011 Activities and Societies:  ASB ,  California Scholastic Federation ,  Hoopa Valley Warrior Football ,  Student Peer Counseling Stanford University Bachelor of Arts (BA),  Comparative Studies in Race & Ethnicity 2011  – 2015 Activities and Societies:  Residential Education ,  5-SURE ,  Stanford Powwow ,  Stanford American Indian Organization Stanford University Bachelor of Arts (BA),  Comparative Studies in Race & Ethnicity 2011  – 2015 Activities and Societies:  Residential Education ,  5-SURE ,  Stanford Powwow ,  Stanford American Indian Organization Stanford University Bachelor of Arts (BA),  Comparative Studies in Race & Ethnicity 2011  – 2015 Activities and Societies:  Residential Education ,  5-SURE ,  Stanford Powwow ,  Stanford American Indian Organization Hoopa Valley high School 2007  – 2011 Activities and Societies:  ASB ,  California Scholastic Federation ,  Hoopa Valley Warrior Football ,  Student Peer Counseling Hoopa Valley high School 2007  – 2011 Activities and Societies:  ASB ,  California Scholastic Federation ,  Hoopa Valley Warrior Football ,  Student Peer Counseling Hoopa Valley high School 2007  – 2011 Activities and Societies:  ASB ,  California Scholastic Federation ,  Hoopa Valley Warrior Football ,  Student Peer Counseling Honors & Awards Gates Millenium Scholarship Gates Millennium Foundation May 2011 Recipient of the Gates Millennium Scholarship for higher education Gates Millenium Scholarship Gates Millennium Foundation May 2011 Recipient of the Gates Millennium Scholarship for higher education Gates Millenium Scholarship Gates Millennium Foundation May 2011 Recipient of the Gates Millennium Scholarship for higher education Gates Millenium Scholarship Gates Millennium Foundation May 2011 Recipient of the Gates Millennium Scholarship for higher education ", "Summary I keep http://zahanm.com/ more up to date. See the projects page. Summary I keep http://zahanm.com/ more up to date. See the projects page. I keep http://zahanm.com/ more up to date. See the projects page. I keep http://zahanm.com/ more up to date. See the projects page. Experience Software Engineer Facebook January 2013  – Present (2 years 8 months) Menlo Park, CA Research Assistant MIT Media Lab June 2012  –  September 2012  (4 months) Greater Boston Area Resident Assistant Stanford University September 2011  –  June 2012  (10 months) Software Engineering Intern Facebook June 2011  –  September 2011  (4 months) Palo Alto, CA Residential Computer Consultant Stanford University September 2009  –  June 2011  (1 year 10 months) Research Intern Hewlett-Packard Laboratories June 2010  –  August 2010  (3 months) Physics Research Assistant Stanford University June 2009  –  September 2009  (4 months) Summer Intern TiE May 2007  –  June 2007  (2 months) Project Shiksha Intern Microsoft December 2006  –  January 2007  (2 months) Software Engineer Facebook January 2013  – Present (2 years 8 months) Menlo Park, CA Software Engineer Facebook January 2013  – Present (2 years 8 months) Menlo Park, CA Research Assistant MIT Media Lab June 2012  –  September 2012  (4 months) Greater Boston Area Research Assistant MIT Media Lab June 2012  –  September 2012  (4 months) Greater Boston Area Resident Assistant Stanford University September 2011  –  June 2012  (10 months) Resident Assistant Stanford University September 2011  –  June 2012  (10 months) Software Engineering Intern Facebook June 2011  –  September 2011  (4 months) Palo Alto, CA Software Engineering Intern Facebook June 2011  –  September 2011  (4 months) Palo Alto, CA Residential Computer Consultant Stanford University September 2009  –  June 2011  (1 year 10 months) Residential Computer Consultant Stanford University September 2009  –  June 2011  (1 year 10 months) Research Intern Hewlett-Packard Laboratories June 2010  –  August 2010  (3 months) Research Intern Hewlett-Packard Laboratories June 2010  –  August 2010  (3 months) Physics Research Assistant Stanford University June 2009  –  September 2009  (4 months) Physics Research Assistant Stanford University June 2009  –  September 2009  (4 months) Summer Intern TiE May 2007  –  June 2007  (2 months) Summer Intern TiE May 2007  –  June 2007  (2 months) Project Shiksha Intern Microsoft December 2006  –  January 2007  (2 months) Project Shiksha Intern Microsoft December 2006  –  January 2007  (2 months) Skills Computer Science Research Teaching Physics Python Skills  Computer Science Research Teaching Physics Python Computer Science Research Teaching Physics Python Computer Science Research Teaching Physics Python Education Stanford University MS,  Computer Science 2011  – 2013 Stanford University BS,  Physics 2008  – 2012 Cathedral and John Connon School ISC 1996  – 2008 Stanford University MS,  Computer Science 2011  – 2013 Stanford University MS,  Computer Science 2011  – 2013 Stanford University MS,  Computer Science 2011  – 2013 Stanford University BS,  Physics 2008  – 2012 Stanford University BS,  Physics 2008  – 2012 Stanford University BS,  Physics 2008  – 2012 Cathedral and John Connon School ISC 1996  – 2008 Cathedral and John Connon School ISC 1996  – 2008 Cathedral and John Connon School ISC 1996  – 2008 ", "Summary I am passionate for studying and experiencing the natural world and in particular oceanic and freshwater environments. I have a strong interest in environmental fluid mechanics and in how marine ecosystems interact with the fluid environment. I intend on pursuing graduate study in oceanography. Summary I am passionate for studying and experiencing the natural world and in particular oceanic and freshwater environments. I have a strong interest in environmental fluid mechanics and in how marine ecosystems interact with the fluid environment. I intend on pursuing graduate study in oceanography. I am passionate for studying and experiencing the natural world and in particular oceanic and freshwater environments. I have a strong interest in environmental fluid mechanics and in how marine ecosystems interact with the fluid environment. I intend on pursuing graduate study in oceanography. I am passionate for studying and experiencing the natural world and in particular oceanic and freshwater environments. I have a strong interest in environmental fluid mechanics and in how marine ecosystems interact with the fluid environment. I intend on pursuing graduate study in oceanography. Experience Resident Assistant Stanford University September 2014  –  June 2015  (10 months) -RA in the upper class row house Mars \n-Responsible for community building, event planning, safety, and well-being of 34 residents. \n-Work with Residential Education to provide academically/personally enriching programs to residents Resident Assistant Stanford University September 2013  –  June 2014  (10 months) - RA in a 100 resident all-freshman house at Stanford University. \n- Planned activities and events during the year, involving coordination with transport services, University administration, logistics and purchases. e.x. dorm-wide overnight stay at Monterey Bay Aquarium \n- Preformed roles related with providing academic and psychological support and advice to first-year students.  \n- Responsible for weekly on-call nights to ensure safety and well-being of residents. Research Assistant Stanford Stable Isotope and Biogeochemistry Lab September 2012  –  April 2013  (8 months) -Prepared paleosoil samples containing carbonate for carbon and oxygen isotope analysis with the Thermo Finnigan Delta XL. \n-Prepared clays for identification with X-Ray Diffraction Resident Assistant Stanford University September 2014  –  June 2015  (10 months) -RA in the upper class row house Mars \n-Responsible for community building, event planning, safety, and well-being of 34 residents. \n-Work with Residential Education to provide academically/personally enriching programs to residents Resident Assistant Stanford University September 2014  –  June 2015  (10 months) -RA in the upper class row house Mars \n-Responsible for community building, event planning, safety, and well-being of 34 residents. \n-Work with Residential Education to provide academically/personally enriching programs to residents Resident Assistant Stanford University September 2013  –  June 2014  (10 months) - RA in a 100 resident all-freshman house at Stanford University. \n- Planned activities and events during the year, involving coordination with transport services, University administration, logistics and purchases. e.x. dorm-wide overnight stay at Monterey Bay Aquarium \n- Preformed roles related with providing academic and psychological support and advice to first-year students.  \n- Responsible for weekly on-call nights to ensure safety and well-being of residents. Resident Assistant Stanford University September 2013  –  June 2014  (10 months) - RA in a 100 resident all-freshman house at Stanford University. \n- Planned activities and events during the year, involving coordination with transport services, University administration, logistics and purchases. e.x. dorm-wide overnight stay at Monterey Bay Aquarium \n- Preformed roles related with providing academic and psychological support and advice to first-year students.  \n- Responsible for weekly on-call nights to ensure safety and well-being of residents. Research Assistant Stanford Stable Isotope and Biogeochemistry Lab September 2012  –  April 2013  (8 months) -Prepared paleosoil samples containing carbonate for carbon and oxygen isotope analysis with the Thermo Finnigan Delta XL. \n-Prepared clays for identification with X-Ray Diffraction Research Assistant Stanford Stable Isotope and Biogeochemistry Lab September 2012  –  April 2013  (8 months) -Prepared paleosoil samples containing carbonate for carbon and oxygen isotope analysis with the Thermo Finnigan Delta XL. \n-Prepared clays for identification with X-Ray Diffraction Skills Matlab Ocean Data View (ODV) PADI Advanced Open... Stanford Scientific... SSI Rescue Diver SBE Thermistor-39 Aquadopp Current... Logic Pro X Skills  Matlab Ocean Data View (ODV) PADI Advanced Open... Stanford Scientific... SSI Rescue Diver SBE Thermistor-39 Aquadopp Current... Logic Pro X Matlab Ocean Data View (ODV) PADI Advanced Open... Stanford Scientific... SSI Rescue Diver SBE Thermistor-39 Aquadopp Current... Logic Pro X Matlab Ocean Data View (ODV) PADI Advanced Open... Stanford Scientific... SSI Rescue Diver SBE Thermistor-39 Aquadopp Current... Logic Pro X Education Stanford University Master of Science (MS),  Environmental Fluid Mechanics and Hydrology 2014  – 2016 Stanford University Earth Systems 2011  – 2015 Activities and Societies:  Men's Club Soccer ,  Classical Guitar ,  Stanford Underwater Stanford University Master of Science (MS),  Environmental Fluid Mechanics and Hydrology 2014  – 2016 Stanford University Master of Science (MS),  Environmental Fluid Mechanics and Hydrology 2014  – 2016 Stanford University Master of Science (MS),  Environmental Fluid Mechanics and Hydrology 2014  – 2016 Stanford University Earth Systems 2011  – 2015 Activities and Societies:  Men's Club Soccer ,  Classical Guitar ,  Stanford Underwater Stanford University Earth Systems 2011  – 2015 Activities and Societies:  Men's Club Soccer ,  Classical Guitar ,  Stanford Underwater Stanford University Earth Systems 2011  – 2015 Activities and Societies:  Men's Club Soccer ,  Classical Guitar ,  Stanford Underwater ", "Summary I am a senior at Stanford University currently pursuing a B.A. in English. During my four years at Stanford, I have taken diverse and challenging courses in literature, language, philosophy, and art, as well as working part- or full-time whenever possible. My senior year at Stanford has been busy but intensely rewarding as I find myself juggling commitments such as a variety of advanced classes, my honors thesis, and my job as a resident assistant in a freshman dorm.  \n \nAs a resident assistant at Stanford, it is my responsibility to promote and contribute to a safe, fun, and healthy dorm community for my inspiring and engaging residents. My fellow staff members and I plan and execute small- and large-scale dorm activities, from quarterly dinners to a weekend stay in Lake Tahoe; I also counsel individual residents on emotional and academic issues, which has contributed to what I perceive as my position as a confidant and role model for many of my residents. I take my job very seriously, and it has been a source of tremendous satisfaction and personal and professional growth this year. While at Stanford, I have also worked part-time as a student assistant at the Stanford Law School and as a tutor for the Structured Liberal Education (SLE) program. Additionally, I interned in the marketing division of SAS Institute for four consecutive summers. \n \nAs graduation nears, I am interested in and pursuing careers in the fields of publishing, education, media, art, advertising, marketing, and sales. I believe my education in the humanities and my work experience have prepared me for diverse positions in these industries, and I am eager to challenge myself, apply my skills, and contribute to the success of a fine company or organization during this exciting transition.  \n \nI would love to hear from prospective employers, recruiters, or anyone working in these fields; new perspectives are always valuable to me, so please contact me if you'd like to connect! Summary I am a senior at Stanford University currently pursuing a B.A. in English. During my four years at Stanford, I have taken diverse and challenging courses in literature, language, philosophy, and art, as well as working part- or full-time whenever possible. My senior year at Stanford has been busy but intensely rewarding as I find myself juggling commitments such as a variety of advanced classes, my honors thesis, and my job as a resident assistant in a freshman dorm.  \n \nAs a resident assistant at Stanford, it is my responsibility to promote and contribute to a safe, fun, and healthy dorm community for my inspiring and engaging residents. My fellow staff members and I plan and execute small- and large-scale dorm activities, from quarterly dinners to a weekend stay in Lake Tahoe; I also counsel individual residents on emotional and academic issues, which has contributed to what I perceive as my position as a confidant and role model for many of my residents. I take my job very seriously, and it has been a source of tremendous satisfaction and personal and professional growth this year. While at Stanford, I have also worked part-time as a student assistant at the Stanford Law School and as a tutor for the Structured Liberal Education (SLE) program. Additionally, I interned in the marketing division of SAS Institute for four consecutive summers. \n \nAs graduation nears, I am interested in and pursuing careers in the fields of publishing, education, media, art, advertising, marketing, and sales. I believe my education in the humanities and my work experience have prepared me for diverse positions in these industries, and I am eager to challenge myself, apply my skills, and contribute to the success of a fine company or organization during this exciting transition.  \n \nI would love to hear from prospective employers, recruiters, or anyone working in these fields; new perspectives are always valuable to me, so please contact me if you'd like to connect! I am a senior at Stanford University currently pursuing a B.A. in English. During my four years at Stanford, I have taken diverse and challenging courses in literature, language, philosophy, and art, as well as working part- or full-time whenever possible. My senior year at Stanford has been busy but intensely rewarding as I find myself juggling commitments such as a variety of advanced classes, my honors thesis, and my job as a resident assistant in a freshman dorm.  \n \nAs a resident assistant at Stanford, it is my responsibility to promote and contribute to a safe, fun, and healthy dorm community for my inspiring and engaging residents. My fellow staff members and I plan and execute small- and large-scale dorm activities, from quarterly dinners to a weekend stay in Lake Tahoe; I also counsel individual residents on emotional and academic issues, which has contributed to what I perceive as my position as a confidant and role model for many of my residents. I take my job very seriously, and it has been a source of tremendous satisfaction and personal and professional growth this year. While at Stanford, I have also worked part-time as a student assistant at the Stanford Law School and as a tutor for the Structured Liberal Education (SLE) program. Additionally, I interned in the marketing division of SAS Institute for four consecutive summers. \n \nAs graduation nears, I am interested in and pursuing careers in the fields of publishing, education, media, art, advertising, marketing, and sales. I believe my education in the humanities and my work experience have prepared me for diverse positions in these industries, and I am eager to challenge myself, apply my skills, and contribute to the success of a fine company or organization during this exciting transition.  \n \nI would love to hear from prospective employers, recruiters, or anyone working in these fields; new perspectives are always valuable to me, so please contact me if you'd like to connect! I am a senior at Stanford University currently pursuing a B.A. in English. During my four years at Stanford, I have taken diverse and challenging courses in literature, language, philosophy, and art, as well as working part- or full-time whenever possible. My senior year at Stanford has been busy but intensely rewarding as I find myself juggling commitments such as a variety of advanced classes, my honors thesis, and my job as a resident assistant in a freshman dorm.  \n \nAs a resident assistant at Stanford, it is my responsibility to promote and contribute to a safe, fun, and healthy dorm community for my inspiring and engaging residents. My fellow staff members and I plan and execute small- and large-scale dorm activities, from quarterly dinners to a weekend stay in Lake Tahoe; I also counsel individual residents on emotional and academic issues, which has contributed to what I perceive as my position as a confidant and role model for many of my residents. I take my job very seriously, and it has been a source of tremendous satisfaction and personal and professional growth this year. While at Stanford, I have also worked part-time as a student assistant at the Stanford Law School and as a tutor for the Structured Liberal Education (SLE) program. Additionally, I interned in the marketing division of SAS Institute for four consecutive summers. \n \nAs graduation nears, I am interested in and pursuing careers in the fields of publishing, education, media, art, advertising, marketing, and sales. I believe my education in the humanities and my work experience have prepared me for diverse positions in these industries, and I am eager to challenge myself, apply my skills, and contribute to the success of a fine company or organization during this exciting transition.  \n \nI would love to hear from prospective employers, recruiters, or anyone working in these fields; new perspectives are always valuable to me, so please contact me if you'd like to connect! Experience Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, California Full-time resident assistant in a mixed freshmen and upper class dormitory of sixty students at Stanford. Extensive training in crisis management, resident mentoring and support, and team building. Responsibilities include event planning (large-scale social activities, volunteer opportunities, etc.), finance management, and general administrative responsibilities. I am available to residents on a daily basis as a private resource, guidance counselor, and community leader. Tutor for Structured Liberal Education (SLE) Stanford University September 2013  – Present (2 years) Stanford, California Writing tutor for Structured Liberal Education, a freshman residential education program at \nStanford University with a focus on western philosophy, literature, art, history, and religion. \nResponsibilities include constructive essay feedback and weekly meetings with students. Student Assistant Stanford Law School May 2012  –  December 2013  (1 year 8 months) Stanford, California Part-time administrative assistant for the Office of Student Affairs at the Stanford Law School. \nResponsibilities included researching law firms, data entry and organization, event planning and \nsupport, and general administrative tasks. Summer Marketing Intern SAS June 2010  –  September 2013  (3 years 4 months) Cary, NC Intern for the SAS Americas Marketing and Support organization for four consecutive summers. \nResponsibilities included composing weekly blog posts, editing and revising articles, conducting \ninterviews, video editing, event planning and support, data entry and organization, marketing \ncampaign research, and general administrative duties. Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, California Full-time resident assistant in a mixed freshmen and upper class dormitory of sixty students at Stanford. Extensive training in crisis management, resident mentoring and support, and team building. Responsibilities include event planning (large-scale social activities, volunteer opportunities, etc.), finance management, and general administrative responsibilities. I am available to residents on a daily basis as a private resource, guidance counselor, and community leader. Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, California Full-time resident assistant in a mixed freshmen and upper class dormitory of sixty students at Stanford. Extensive training in crisis management, resident mentoring and support, and team building. Responsibilities include event planning (large-scale social activities, volunteer opportunities, etc.), finance management, and general administrative responsibilities. I am available to residents on a daily basis as a private resource, guidance counselor, and community leader. Tutor for Structured Liberal Education (SLE) Stanford University September 2013  – Present (2 years) Stanford, California Writing tutor for Structured Liberal Education, a freshman residential education program at \nStanford University with a focus on western philosophy, literature, art, history, and religion. \nResponsibilities include constructive essay feedback and weekly meetings with students. Tutor for Structured Liberal Education (SLE) Stanford University September 2013  – Present (2 years) Stanford, California Writing tutor for Structured Liberal Education, a freshman residential education program at \nStanford University with a focus on western philosophy, literature, art, history, and religion. \nResponsibilities include constructive essay feedback and weekly meetings with students. Student Assistant Stanford Law School May 2012  –  December 2013  (1 year 8 months) Stanford, California Part-time administrative assistant for the Office of Student Affairs at the Stanford Law School. \nResponsibilities included researching law firms, data entry and organization, event planning and \nsupport, and general administrative tasks. Student Assistant Stanford Law School May 2012  –  December 2013  (1 year 8 months) Stanford, California Part-time administrative assistant for the Office of Student Affairs at the Stanford Law School. \nResponsibilities included researching law firms, data entry and organization, event planning and \nsupport, and general administrative tasks. Summer Marketing Intern SAS June 2010  –  September 2013  (3 years 4 months) Cary, NC Intern for the SAS Americas Marketing and Support organization for four consecutive summers. \nResponsibilities included composing weekly blog posts, editing and revising articles, conducting \ninterviews, video editing, event planning and support, data entry and organization, marketing \ncampaign research, and general administrative duties. Summer Marketing Intern SAS June 2010  –  September 2013  (3 years 4 months) Cary, NC Intern for the SAS Americas Marketing and Support organization for four consecutive summers. \nResponsibilities included composing weekly blog posts, editing and revising articles, conducting \ninterviews, video editing, event planning and support, data entry and organization, marketing \ncampaign research, and general administrative duties. Languages English Native or bilingual proficiency French Full professional proficiency German Limited working proficiency English Native or bilingual proficiency French Full professional proficiency German Limited working proficiency English Native or bilingual proficiency French Full professional proficiency German Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills English Literature Marketing Research Event Planning Editing Administrative... French Literature German Literature Philosophy Literary Theory Queer Theory Modern Art Fiction Writing Marketing Social Media Marketing Blogging Twitter Marketing Facebook Marketing Crisis Counselling Interpersonal... Marketing Event Planning Academic Tutoring LGBT Rights Interviewing Skills Budget Management Grant Writing See 10+     See less Skills  English Literature Marketing Research Event Planning Editing Administrative... French Literature German Literature Philosophy Literary Theory Queer Theory Modern Art Fiction Writing Marketing Social Media Marketing Blogging Twitter Marketing Facebook Marketing Crisis Counselling Interpersonal... Marketing Event Planning Academic Tutoring LGBT Rights Interviewing Skills Budget Management Grant Writing See 10+     See less English Literature Marketing Research Event Planning Editing Administrative... French Literature German Literature Philosophy Literary Theory Queer Theory Modern Art Fiction Writing Marketing Social Media Marketing Blogging Twitter Marketing Facebook Marketing Crisis Counselling Interpersonal... Marketing Event Planning Academic Tutoring LGBT Rights Interviewing Skills Budget Management Grant Writing See 10+     See less English Literature Marketing Research Event Planning Editing Administrative... French Literature German Literature Philosophy Literary Theory Queer Theory Modern Art Fiction Writing Marketing Social Media Marketing Blogging Twitter Marketing Facebook Marketing Crisis Counselling Interpersonal... Marketing Event Planning Academic Tutoring LGBT Rights Interviewing Skills Budget Management Grant Writing See 10+     See less Education Stanford University Bachelor of Arts (B.A.),  English , Senior 2011  – 2015 Writing an honors thesis of sixty pages to be completed in May of 2015. Extensive coursework in nineteenth- and twentieth-century British and American literature, literary theory, French and German language literature, feminist queer theory, modern philosophy, twentieth-century art, Western cultural and religious studies, and creative writing.  Activities and Societies:  Studied abroad at Oxford and in Paris for six months during my junior year; assistant producer for annual Gaieties musical; staff editor and financial officer for Leland Quarterly. Stanford University Bachelor of Arts (B.A.),  English , Senior 2011  – 2015 Writing an honors thesis of sixty pages to be completed in May of 2015. Extensive coursework in nineteenth- and twentieth-century British and American literature, literary theory, French and German language literature, feminist queer theory, modern philosophy, twentieth-century art, Western cultural and religious studies, and creative writing.  Activities and Societies:  Studied abroad at Oxford and in Paris for six months during my junior year; assistant producer for annual Gaieties musical; staff editor and financial officer for Leland Quarterly. Stanford University Bachelor of Arts (B.A.),  English , Senior 2011  – 2015 Writing an honors thesis of sixty pages to be completed in May of 2015. Extensive coursework in nineteenth- and twentieth-century British and American literature, literary theory, French and German language literature, feminist queer theory, modern philosophy, twentieth-century art, Western cultural and religious studies, and creative writing.  Activities and Societies:  Studied abroad at Oxford and in Paris for six months during my junior year; assistant producer for annual Gaieties musical; staff editor and financial officer for Leland Quarterly. Stanford University Bachelor of Arts (B.A.),  English , Senior 2011  – 2015 Writing an honors thesis of sixty pages to be completed in May of 2015. Extensive coursework in nineteenth- and twentieth-century British and American literature, literary theory, French and German language literature, feminist queer theory, modern philosophy, twentieth-century art, Western cultural and religious studies, and creative writing.  Activities and Societies:  Studied abroad at Oxford and in Paris for six months during my junior year; assistant producer for annual Gaieties musical; staff editor and financial officer for Leland Quarterly. Honors & Awards Recipient of a Chappell Lougee Scholarship Grant Stanford University June 2013 Applied for and received six thousand dollars to research speculative fiction, fantasy literature, and mythology. I also began a novel based on that research, which I presented at the Stanford Undergraduate Research Symposium in October 2013. The Chappell Lougee Scholarship grant is one of the most selective humanities research grants for Stanford students, available only for sophomores.  Recipient of a Stanford Major Research Grant Stanford University June 2014 Applied for and received six thousand dollars to begin research on my senior honors thesis, reading Gone With the Wind and related secondary texts and critical responses to the novel. Recipient of a Chappell Lougee Scholarship Grant Stanford University June 2013 Applied for and received six thousand dollars to research speculative fiction, fantasy literature, and mythology. I also began a novel based on that research, which I presented at the Stanford Undergraduate Research Symposium in October 2013. The Chappell Lougee Scholarship grant is one of the most selective humanities research grants for Stanford students, available only for sophomores.  Recipient of a Chappell Lougee Scholarship Grant Stanford University June 2013 Applied for and received six thousand dollars to research speculative fiction, fantasy literature, and mythology. I also began a novel based on that research, which I presented at the Stanford Undergraduate Research Symposium in October 2013. The Chappell Lougee Scholarship grant is one of the most selective humanities research grants for Stanford students, available only for sophomores.  Recipient of a Chappell Lougee Scholarship Grant Stanford University June 2013 Applied for and received six thousand dollars to research speculative fiction, fantasy literature, and mythology. I also began a novel based on that research, which I presented at the Stanford Undergraduate Research Symposium in October 2013. The Chappell Lougee Scholarship grant is one of the most selective humanities research grants for Stanford students, available only for sophomores.  Recipient of a Stanford Major Research Grant Stanford University June 2014 Applied for and received six thousand dollars to begin research on my senior honors thesis, reading Gone With the Wind and related secondary texts and critical responses to the novel. Recipient of a Stanford Major Research Grant Stanford University June 2014 Applied for and received six thousand dollars to begin research on my senior honors thesis, reading Gone With the Wind and related secondary texts and critical responses to the novel. Recipient of a Stanford Major Research Grant Stanford University June 2014 Applied for and received six thousand dollars to begin research on my senior honors thesis, reading Gone With the Wind and related secondary texts and critical responses to the novel. ", "Summary I am a senior at Stanford majoring in Human Biology with a concentration in Genetic Counseling and Diseases. I am interested in pursuing a career related to genetic counseling, human genetics, or public health. Summary I am a senior at Stanford majoring in Human Biology with a concentration in Genetic Counseling and Diseases. I am interested in pursuing a career related to genetic counseling, human genetics, or public health. I am a senior at Stanford majoring in Human Biology with a concentration in Genetic Counseling and Diseases. I am interested in pursuing a career related to genetic counseling, human genetics, or public health. I am a senior at Stanford majoring in Human Biology with a concentration in Genetic Counseling and Diseases. I am interested in pursuing a career related to genetic counseling, human genetics, or public health. Experience Student Advisor The Program in Human Biology September 2014  – Present (1 year) Stanford, CA I assist Human Biology students in designing cohesive areas of concentration for the major, meeting major requirements, declaring, finding internships, and selecting faculty advisors through weekly drop-in hours. I compile a bi-monthly newsletter with department announcements and job opportunities, attend university events and department meetings, plan department events for students, and serve as a student liaison for Human Biology faculty. Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, CA I am a residential dorm staff member trained to promote a house culture of intellectual, personal, and interpersonal growth, safety, student accountability, and diverse inclusion. I serve as a liaison to resources and centers on campus, plan events for residents, and respond to emergencies and personal/interpersonal problems as they arise while working closely with our dorm's 15-member student staff and resident fellows. Summer Research Scholar SENS Research Foundation June 2014  –  September 2014  (4 months) Mountain View, CA I worked on a project with the LysoSENS team to create a cell model of age-related macular degeneration (AMD) from RNAi-transfected cells for testing of a lysosomal enzyme on rescuing diseased cells. I did tissue culture work with human retinal pigment epithelium (RPE) ARPE-19 cells, and I performed western blotting and immunofluorescent staining to compare expression of key AMD and RPE proteins in aged and non-aged cells. I led bi-monthly presentations of the project goals and progress, drafted research reports, and attended and presented a poster at the SRF “Rejuvenation Biotechnology” conference in Santa Clara, CA. Peer Health Educator Stanford University September 2013  –  June 2014  (10 months) Stanford University Health-focused residential staff member trained in basic first aid, peer counseling, and knowledge of campus health and community resources. Plan health and wellness events. Research Assistant Department of Developmental Biology, Stanford University June 2013  –  June 2014  (1 year 1 month) Margaret Fuller Lab, Department of Developmental Biology, Stanford University My summer project as a student research assistant was to help on a project investigating the role of alternative polyadenylation of the 3' untranslated region (UTR) of RNA in Drosophila spermatocytes and testis stem cells. \n \nExperience with molecular biology lab work (gels, PCR, recombinant plasmid work), fly dissection, fly genetics, and fly maintenance. \n \nMy later work in the lab was to conduct an RNAi screen identifying RNA binding proteins that have functions in spermatogenesis. This research involves dissection, immunofluorescent staining with conjugated antibodies, and learning more about Drosophila genetics to set up crosses. I identified 6 proteins that may have functions in spermatogenesis through binding the 3' UTRs of mRNA in germline stem cells. Treasurer Chi Omega, Nu Alpha Chapter January 2013  –  December 2013  (1 year) Stanford, California Managed $80,000+ budget for sorority chapter, including budgeting, reimbursements, checks, debit card, and communication with Chi Omega national organization. Assistant to Property Manager HP Investors June 2012  –  January 2013  (8 months) Managed correspondence with tenants, investors, and service providers for commercial real estate investment office. Research on local property markets, created invoices and estoppels, and managed office organization using Excel. Teacher's Aide Temple Adat Shalom September 2006  –  June 2011  (4 years 10 months) Poway, California Teacher's aide in 2nd grade Hebrew school class once a week. Helped with teaching and one-on-one tutoring, as well as general classroom organization. Student Advisor The Program in Human Biology September 2014  – Present (1 year) Stanford, CA I assist Human Biology students in designing cohesive areas of concentration for the major, meeting major requirements, declaring, finding internships, and selecting faculty advisors through weekly drop-in hours. I compile a bi-monthly newsletter with department announcements and job opportunities, attend university events and department meetings, plan department events for students, and serve as a student liaison for Human Biology faculty. Student Advisor The Program in Human Biology September 2014  – Present (1 year) Stanford, CA I assist Human Biology students in designing cohesive areas of concentration for the major, meeting major requirements, declaring, finding internships, and selecting faculty advisors through weekly drop-in hours. I compile a bi-monthly newsletter with department announcements and job opportunities, attend university events and department meetings, plan department events for students, and serve as a student liaison for Human Biology faculty. Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, CA I am a residential dorm staff member trained to promote a house culture of intellectual, personal, and interpersonal growth, safety, student accountability, and diverse inclusion. I serve as a liaison to resources and centers on campus, plan events for residents, and respond to emergencies and personal/interpersonal problems as they arise while working closely with our dorm's 15-member student staff and resident fellows. Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, CA I am a residential dorm staff member trained to promote a house culture of intellectual, personal, and interpersonal growth, safety, student accountability, and diverse inclusion. I serve as a liaison to resources and centers on campus, plan events for residents, and respond to emergencies and personal/interpersonal problems as they arise while working closely with our dorm's 15-member student staff and resident fellows. Summer Research Scholar SENS Research Foundation June 2014  –  September 2014  (4 months) Mountain View, CA I worked on a project with the LysoSENS team to create a cell model of age-related macular degeneration (AMD) from RNAi-transfected cells for testing of a lysosomal enzyme on rescuing diseased cells. I did tissue culture work with human retinal pigment epithelium (RPE) ARPE-19 cells, and I performed western blotting and immunofluorescent staining to compare expression of key AMD and RPE proteins in aged and non-aged cells. I led bi-monthly presentations of the project goals and progress, drafted research reports, and attended and presented a poster at the SRF “Rejuvenation Biotechnology” conference in Santa Clara, CA. Summer Research Scholar SENS Research Foundation June 2014  –  September 2014  (4 months) Mountain View, CA I worked on a project with the LysoSENS team to create a cell model of age-related macular degeneration (AMD) from RNAi-transfected cells for testing of a lysosomal enzyme on rescuing diseased cells. I did tissue culture work with human retinal pigment epithelium (RPE) ARPE-19 cells, and I performed western blotting and immunofluorescent staining to compare expression of key AMD and RPE proteins in aged and non-aged cells. I led bi-monthly presentations of the project goals and progress, drafted research reports, and attended and presented a poster at the SRF “Rejuvenation Biotechnology” conference in Santa Clara, CA. Peer Health Educator Stanford University September 2013  –  June 2014  (10 months) Stanford University Health-focused residential staff member trained in basic first aid, peer counseling, and knowledge of campus health and community resources. Plan health and wellness events. Peer Health Educator Stanford University September 2013  –  June 2014  (10 months) Stanford University Health-focused residential staff member trained in basic first aid, peer counseling, and knowledge of campus health and community resources. Plan health and wellness events. Research Assistant Department of Developmental Biology, Stanford University June 2013  –  June 2014  (1 year 1 month) Margaret Fuller Lab, Department of Developmental Biology, Stanford University My summer project as a student research assistant was to help on a project investigating the role of alternative polyadenylation of the 3' untranslated region (UTR) of RNA in Drosophila spermatocytes and testis stem cells. \n \nExperience with molecular biology lab work (gels, PCR, recombinant plasmid work), fly dissection, fly genetics, and fly maintenance. \n \nMy later work in the lab was to conduct an RNAi screen identifying RNA binding proteins that have functions in spermatogenesis. This research involves dissection, immunofluorescent staining with conjugated antibodies, and learning more about Drosophila genetics to set up crosses. I identified 6 proteins that may have functions in spermatogenesis through binding the 3' UTRs of mRNA in germline stem cells. Research Assistant Department of Developmental Biology, Stanford University June 2013  –  June 2014  (1 year 1 month) Margaret Fuller Lab, Department of Developmental Biology, Stanford University My summer project as a student research assistant was to help on a project investigating the role of alternative polyadenylation of the 3' untranslated region (UTR) of RNA in Drosophila spermatocytes and testis stem cells. \n \nExperience with molecular biology lab work (gels, PCR, recombinant plasmid work), fly dissection, fly genetics, and fly maintenance. \n \nMy later work in the lab was to conduct an RNAi screen identifying RNA binding proteins that have functions in spermatogenesis. This research involves dissection, immunofluorescent staining with conjugated antibodies, and learning more about Drosophila genetics to set up crosses. I identified 6 proteins that may have functions in spermatogenesis through binding the 3' UTRs of mRNA in germline stem cells. Treasurer Chi Omega, Nu Alpha Chapter January 2013  –  December 2013  (1 year) Stanford, California Managed $80,000+ budget for sorority chapter, including budgeting, reimbursements, checks, debit card, and communication with Chi Omega national organization. Treasurer Chi Omega, Nu Alpha Chapter January 2013  –  December 2013  (1 year) Stanford, California Managed $80,000+ budget for sorority chapter, including budgeting, reimbursements, checks, debit card, and communication with Chi Omega national organization. Assistant to Property Manager HP Investors June 2012  –  January 2013  (8 months) Managed correspondence with tenants, investors, and service providers for commercial real estate investment office. Research on local property markets, created invoices and estoppels, and managed office organization using Excel. Assistant to Property Manager HP Investors June 2012  –  January 2013  (8 months) Managed correspondence with tenants, investors, and service providers for commercial real estate investment office. Research on local property markets, created invoices and estoppels, and managed office organization using Excel. Teacher's Aide Temple Adat Shalom September 2006  –  June 2011  (4 years 10 months) Poway, California Teacher's aide in 2nd grade Hebrew school class once a week. Helped with teaching and one-on-one tutoring, as well as general classroom organization. Teacher's Aide Temple Adat Shalom September 2006  –  June 2011  (4 years 10 months) Poway, California Teacher's aide in 2nd grade Hebrew school class once a week. Helped with teaching and one-on-one tutoring, as well as general classroom organization. Skills Molecular Biology Peer Counseling Agarose Gel... Immunofluorescence Bacterial Transformation Bacterial Culture Protein Chemistry Data Analysis Research Microsoft Office Public Speaking Skills  Molecular Biology Peer Counseling Agarose Gel... Immunofluorescence Bacterial Transformation Bacterial Culture Protein Chemistry Data Analysis Research Microsoft Office Public Speaking Molecular Biology Peer Counseling Agarose Gel... Immunofluorescence Bacterial Transformation Bacterial Culture Protein Chemistry Data Analysis Research Microsoft Office Public Speaking Molecular Biology Peer Counseling Agarose Gel... Immunofluorescence Bacterial Transformation Bacterial Culture Protein Chemistry Data Analysis Research Microsoft Office Public Speaking Education Stanford University Bachelor of Arts (B.A.),  Human Biology: Genetic Counseling and Diseases 2011  – 2015 Activities and Societies:  Peer Health Educator ,  Research Assistant ,  The Bridge Peer Counseling Center volunteer ,  Urban Styles Dance Company ,  Chi Omega Sorority Poway High School 2007  – 2011 Activities and Societies:  Dance Team ,  Peer Counseling ,  Key Club ,  NHS ,  CSF Stanford University Bachelor of Arts (B.A.),  Human Biology: Genetic Counseling and Diseases 2011  – 2015 Activities and Societies:  Peer Health Educator ,  Research Assistant ,  The Bridge Peer Counseling Center volunteer ,  Urban Styles Dance Company ,  Chi Omega Sorority Stanford University Bachelor of Arts (B.A.),  Human Biology: Genetic Counseling and Diseases 2011  – 2015 Activities and Societies:  Peer Health Educator ,  Research Assistant ,  The Bridge Peer Counseling Center volunteer ,  Urban Styles Dance Company ,  Chi Omega Sorority Stanford University Bachelor of Arts (B.A.),  Human Biology: Genetic Counseling and Diseases 2011  – 2015 Activities and Societies:  Peer Health Educator ,  Research Assistant ,  The Bridge Peer Counseling Center volunteer ,  Urban Styles Dance Company ,  Chi Omega Sorority Poway High School 2007  – 2011 Activities and Societies:  Dance Team ,  Peer Counseling ,  Key Club ,  NHS ,  CSF Poway High School 2007  – 2011 Activities and Societies:  Dance Team ,  Peer Counseling ,  Key Club ,  NHS ,  CSF Poway High School 2007  – 2011 Activities and Societies:  Dance Team ,  Peer Counseling ,  Key Club ,  NHS ,  CSF ", "Experience Resident Assistant Stanford University May 2014  –  June 2015  (1 year 2 months) Stanford, CA Resident Assistant Stanford University May 2014  –  June 2015  (1 year 2 months) Stanford, CA Resident Assistant Stanford University May 2014  –  June 2015  (1 year 2 months) Stanford, CA Education Stanford University Bachelor of Arts (B.A.),  Sociology 2012  – 2016 Stanford University Bachelor of Arts (B.A.),  Sociology 2012  – 2016 Stanford University Bachelor of Arts (B.A.),  Sociology 2012  – 2016 Stanford University Bachelor of Arts (B.A.),  Sociology 2012  – 2016 ", "Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Market Research Strategy Marketing Strategy Strategic Planning Business Strategy Competitive Analysis Management Start-ups Program Management Mergers & Acquisitions Strategic Partnerships Social Media Marketing Analysis Marketing Business Development Fundraising Social Media See 2+     See less Skills  Market Research Strategy Marketing Strategy Strategic Planning Business Strategy Competitive Analysis Management Start-ups Program Management Mergers & Acquisitions Strategic Partnerships Social Media Marketing Analysis Marketing Business Development Fundraising Social Media See 2+     See less Market Research Strategy Marketing Strategy Strategic Planning Business Strategy Competitive Analysis Management Start-ups Program Management Mergers & Acquisitions Strategic Partnerships Social Media Marketing Analysis Marketing Business Development Fundraising Social Media See 2+     See less Market Research Strategy Marketing Strategy Strategic Planning Business Strategy Competitive Analysis Management Start-ups Program Management Mergers & Acquisitions Strategic Partnerships Social Media Marketing Analysis Marketing Business Development Fundraising Social Media See 2+     See less ", "Experience Principal Program Manager Lead - Outlook.com Microsoft March 2014  – Present (1 year 6 months) Mountain View, Ca Senior Program Manager Lead - Outlook.com/Hotmail Microsoft October 2011  –  March 2014  (2 years 6 months) Mountain View, Ca Senior Program Manager - Hotmail Microsoft August 2010  –  October 2011  (1 year 3 months) Mountain View, Ca Program Manager II - Hotmail Microsoft August 2007  –  August 2010  (3 years 1 month) Mountain View, Ca Program Manager - Windows Live Microsoft July 2006  –  August 2007  (1 year 2 months) Redmond, Wa Engineering Intern Google June 2005  –  August 2005  (3 months) New York, New York Summer Analyst Goldman, Sachs & Co. June 2004  –  August 2004  (3 months) Resident Assistant Stanford University September 2003  –  June 2004  (10 months) Engineering Intern Beckman Coulter, Inc June 2003  –  August 2003  (3 months) Software Engineering Intern Lucent Technology, Inc June 2002  –  August 2002  (3 months) Principal Program Manager Lead - Outlook.com Microsoft March 2014  – Present (1 year 6 months) Mountain View, Ca Principal Program Manager Lead - Outlook.com Microsoft March 2014  – Present (1 year 6 months) Mountain View, Ca Senior Program Manager Lead - Outlook.com/Hotmail Microsoft October 2011  –  March 2014  (2 years 6 months) Mountain View, Ca Senior Program Manager Lead - Outlook.com/Hotmail Microsoft October 2011  –  March 2014  (2 years 6 months) Mountain View, Ca Senior Program Manager - Hotmail Microsoft August 2010  –  October 2011  (1 year 3 months) Mountain View, Ca Senior Program Manager - Hotmail Microsoft August 2010  –  October 2011  (1 year 3 months) Mountain View, Ca Program Manager II - Hotmail Microsoft August 2007  –  August 2010  (3 years 1 month) Mountain View, Ca Program Manager II - Hotmail Microsoft August 2007  –  August 2010  (3 years 1 month) Mountain View, Ca Program Manager - Windows Live Microsoft July 2006  –  August 2007  (1 year 2 months) Redmond, Wa Program Manager - Windows Live Microsoft July 2006  –  August 2007  (1 year 2 months) Redmond, Wa Engineering Intern Google June 2005  –  August 2005  (3 months) New York, New York Engineering Intern Google June 2005  –  August 2005  (3 months) New York, New York Summer Analyst Goldman, Sachs & Co. June 2004  –  August 2004  (3 months) Summer Analyst Goldman, Sachs & Co. June 2004  –  August 2004  (3 months) Resident Assistant Stanford University September 2003  –  June 2004  (10 months) Resident Assistant Stanford University September 2003  –  June 2004  (10 months) Engineering Intern Beckman Coulter, Inc June 2003  –  August 2003  (3 months) Engineering Intern Beckman Coulter, Inc June 2003  –  August 2003  (3 months) Software Engineering Intern Lucent Technology, Inc June 2002  –  August 2002  (3 months) Software Engineering Intern Lucent Technology, Inc June 2002  –  August 2002  (3 months) Languages Chinese (conversational) Chinese (conversational) Chinese (conversational) Skills Agile Project Management Distributed Systems Software Engineering Agile Methodologies Product Management User Experience Software Development Software Project... Software Design Cloud Computing Program Management Mobile Devices User Interface Mobile Applications Management Skills  Agile Project Management Distributed Systems Software Engineering Agile Methodologies Product Management User Experience Software Development Software Project... Software Design Cloud Computing Program Management Mobile Devices User Interface Mobile Applications Management Agile Project Management Distributed Systems Software Engineering Agile Methodologies Product Management User Experience Software Development Software Project... Software Design Cloud Computing Program Management Mobile Devices User Interface Mobile Applications Management Agile Project Management Distributed Systems Software Engineering Agile Methodologies Product Management User Experience Software Development Software Project... Software Design Cloud Computing Program Management Mobile Devices User Interface Mobile Applications Management Education Stanford University MS 2005  – 2006 Stanford University BS 2001  – 2005 Stanford University MS 2005  – 2006 Stanford University MS 2005  – 2006 Stanford University MS 2005  – 2006 Stanford University BS 2001  – 2005 Stanford University BS 2001  – 2005 Stanford University BS 2001  – 2005 ", "Experience Senior Mechanical Engineer Jaunt VR December 2014  – Present (9 months) Palo Alto Product Manager MyoScience March 2013  –  November 2014  (1 year 9 months) Redwood City, California Senior Product Development Engineer MyoScience January 2011  –  February 2013  (2 years 2 months) Redwood City, California R&D Engineer MyoScience June 2009  –  December 2010  (1 year 7 months) Redwood City, California R&D Intern W.L. Gore & Associates June 2008  –  April 2009  (11 months) Resident Assistant Stanford University September 2007  –  June 2008  (10 months) R&D Intern Nellix Endovascular June 2007  –  September 2007  (4 months) Nanoscale Model Designer Stanford Center for Probing the Nanoscale January 2007  –  June 2007  (6 months) Head Peer Academic Coordinator Stanford University September 2006  –  June 2007  (10 months) Research Assistant Mechanics & Computation Department, Stanford University June 2006  –  December 2006  (7 months) Lab Technician California Cement July 2006  –  August 2006  (2 months) Senior Mechanical Engineer Jaunt VR December 2014  – Present (9 months) Palo Alto Senior Mechanical Engineer Jaunt VR December 2014  – Present (9 months) Palo Alto Product Manager MyoScience March 2013  –  November 2014  (1 year 9 months) Redwood City, California Product Manager MyoScience March 2013  –  November 2014  (1 year 9 months) Redwood City, California Senior Product Development Engineer MyoScience January 2011  –  February 2013  (2 years 2 months) Redwood City, California Senior Product Development Engineer MyoScience January 2011  –  February 2013  (2 years 2 months) Redwood City, California R&D Engineer MyoScience June 2009  –  December 2010  (1 year 7 months) Redwood City, California R&D Engineer MyoScience June 2009  –  December 2010  (1 year 7 months) Redwood City, California R&D Intern W.L. Gore & Associates June 2008  –  April 2009  (11 months) R&D Intern W.L. Gore & Associates June 2008  –  April 2009  (11 months) Resident Assistant Stanford University September 2007  –  June 2008  (10 months) Resident Assistant Stanford University September 2007  –  June 2008  (10 months) R&D Intern Nellix Endovascular June 2007  –  September 2007  (4 months) R&D Intern Nellix Endovascular June 2007  –  September 2007  (4 months) Nanoscale Model Designer Stanford Center for Probing the Nanoscale January 2007  –  June 2007  (6 months) Nanoscale Model Designer Stanford Center for Probing the Nanoscale January 2007  –  June 2007  (6 months) Head Peer Academic Coordinator Stanford University September 2006  –  June 2007  (10 months) Head Peer Academic Coordinator Stanford University September 2006  –  June 2007  (10 months) Research Assistant Mechanics & Computation Department, Stanford University June 2006  –  December 2006  (7 months) Research Assistant Mechanics & Computation Department, Stanford University June 2006  –  December 2006  (7 months) Lab Technician California Cement July 2006  –  August 2006  (2 months) Lab Technician California Cement July 2006  –  August 2006  (2 months) Languages French Gujarati French Gujarati French Gujarati Skills Solidworks Machining Medical Devices R&D Product Development Biomedical Engineering Prototyping CAD FMEA Microsoft Office Design Control Injection Molding Product Design Design for Manufacturing Manufacturing Design of Experiments ISO 13485 SolidWorks FDA See 4+     See less Skills  Solidworks Machining Medical Devices R&D Product Development Biomedical Engineering Prototyping CAD FMEA Microsoft Office Design Control Injection Molding Product Design Design for Manufacturing Manufacturing Design of Experiments ISO 13485 SolidWorks FDA See 4+     See less Solidworks Machining Medical Devices R&D Product Development Biomedical Engineering Prototyping CAD FMEA Microsoft Office Design Control Injection Molding Product Design Design for Manufacturing Manufacturing Design of Experiments ISO 13485 SolidWorks FDA See 4+     See less Solidworks Machining Medical Devices R&D Product Development Biomedical Engineering Prototyping CAD FMEA Microsoft Office Design Control Injection Molding Product Design Design for Manufacturing Manufacturing Design of Experiments ISO 13485 SolidWorks FDA See 4+     See less Education Stanford University Master of Science 2008  – 2009 Stanford University Bachelor of Science 2004  – 2008 Stanford University Master of Science 2008  – 2009 Stanford University Master of Science 2008  – 2009 Stanford University Master of Science 2008  – 2009 Stanford University Bachelor of Science 2004  – 2008 Stanford University Bachelor of Science 2004  – 2008 Stanford University Bachelor of Science 2004  – 2008 ", "Experience Resident Assistant Stanford University September 2014  – Present (1 year) Research Intern Kawasaki Heavy Industries June 2014  –  August 2014  (3 months) Akashi, Hyogo Prefecture, Japan Designed air suspension controllers for commuter trains. Resident Assistant Stanford University September 2014  – Present (1 year) Resident Assistant Stanford University September 2014  – Present (1 year) Research Intern Kawasaki Heavy Industries June 2014  –  August 2014  (3 months) Akashi, Hyogo Prefecture, Japan Designed air suspension controllers for commuter trains. Research Intern Kawasaki Heavy Industries June 2014  –  August 2014  (3 months) Akashi, Hyogo Prefecture, Japan Designed air suspension controllers for commuter trains. Languages English Spanish Japanese Professional working proficiency English Spanish Japanese Professional working proficiency English Spanish Japanese Professional working proficiency Professional working proficiency Skills Matlab Simulink SolidWorks Simpack Public Speaking Community Organizing Skills  Matlab Simulink SolidWorks Simpack Public Speaking Community Organizing Matlab Simulink SolidWorks Simpack Public Speaking Community Organizing Matlab Simulink SolidWorks Simpack Public Speaking Community Organizing Education Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Co-chair of MEChA de Stanford ,  Co-chair of Ballet Folklorico de Stanford ,  Phoenix Scholars Mentor Franklin High School 2007  – 2011 Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Co-chair of MEChA de Stanford ,  Co-chair of Ballet Folklorico de Stanford ,  Phoenix Scholars Mentor Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Co-chair of MEChA de Stanford ,  Co-chair of Ballet Folklorico de Stanford ,  Phoenix Scholars Mentor Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Co-chair of MEChA de Stanford ,  Co-chair of Ballet Folklorico de Stanford ,  Phoenix Scholars Mentor Franklin High School 2007  – 2011 Franklin High School 2007  – 2011 Franklin High School 2007  – 2011 ", "Experience Electrical Engineering Intern Hewlett-Packard June 2014  – Present (1 year 3 months) San Francisco Bay Area Ernest Houston Johnson Scholars Program Coordinator Stanford University August 2014  –  March 2015  (8 months) Stanford, CA • Helped instruct and lead a course that is dedicated to mentoring the incoming African American Freshmen class at Stanford. \n• Interviewed graduate students who want to be a part of the program as mentors for these students. \n• Acted as the point of contact for the students, their mentors, and faculty members who teach these students. \n• Organized a retreat and other events that are meant for community building and exposure to resources and mentorship. Resident Assistant Stanford University September 2012  –  September 2014  (2 years 1 month) Oak Creek Apartments • Hired as a resident assistant (and summer resident assistant during the summer of 2014) to undergraduate students living in off campus housing. \n• Check in with both residents and staff weekly to figure out how to best accommodate residents, especially through programming. \n• Re-enforce rules and regulations to ensure the safety of the residents who reside in Oak Creek. \n• Counsel students in apartment living, and what best ways to ensure that their living space is comfortable and suitable for being a successful student. Student Image Developer Stanford University March 2014  –  June 2014  (4 months) Academic Computing Services • Installed the required applications and utilities on the master images and ensuring that they work properly. Performing updates and revisions as needed. \n• Documented the process of creating and deploying images, and documenting all changes or modifications to existing images. \n• Responded to trouble reports regarding the images and resolving them. Electrical Engineering Intern Hewlett-Packard June 2013  –  August 2013  (3 months) San Francisco Bay Area • Hired as the electrical engineering intern on the research and development team to enhance the audio quality of Hewlett-Packard’s all-in-one desktop computers.  \n• Used audio digital signal processing software to improve the sound of the AiO speakers. \n• Learned about amplifier technology to optimize the performance of the speakers in the AiO. \n• Worked with the mechanical engineering interns to design and make a demo model of an optimized AiO audio subsystem. Summer Resident Assistant Stanford University June 2012  –  September 2012  (4 months) Manzanita Park • Hired to be one of six Manzanita Park resident assistants to incoming athletes, visiting students and matriculated Stanford students.  \n• Met weekly with staff in order to discuss dorm logistics and plan social events for the residents. \n• Re-enforced rules of the rules to ensure the safety of residents living in Manzanita Park. \n• Assisted students with any troubles they encountered, and ensured that their living space was comfortable and suitable for their success during the summer. Electrical Engineering Intern Research Experience for Undergraduates (REU) June 2012  –  August 2012  (3 months) Stanford University • Selected for a ten week research program only for Stanford Electrical Engineering majors; all students were dispersed into various labs depending on their interests and specific Electrical Engineering tracks.  \n• Worked in a lab, with one other partner, that focused on music to design user friendly electric drums. \n• Applied knowledge of filters, amplifiers and physics in order to create the proper electronic and mechanical hardware for the drums. \n• Learned about digital/analog inputs and outputs for an Arduino and proper coding of the microcontroller to create the actual drum sounds, played by striking Piezo sensors. Education & Youth Development Fellow East Palo Alto Stanford Academy October 2010  –  June 2012  (1 year 9 months) Stanford University • Served as a mentor and role model to forty middle school children from East Palo Alto. \n• Taught twenty eighth grade students mathematics in preparation for meeting the California standards in Algebra I, Geometry and Algebra II. \n• Met with other fellows and directors to develop strategies to best mentor youth. \n• Planned recreational events for the kids that allowed them to bond with their tutors. Electrical Engineering Intern Tigo Energy August 2011  –  September 2011  (2 months) San Francisco Bay Area • Acquired knowledge of solar panel hardware and its relationship to electronics and signals \n• Gained knowledge of the electrical engineering behind Tigo’s solar panels, by shadowing an employee, and testing its effectiveness using a computer. \n• Strengthened technical writing skills and documented steps that tested the effectiveness of specific types of solar panels. \n• Applied previous knowledge of basic circuits in order to fully analyze devices and product. Summer Youth Employment Program On-Site Coordinator Kaiser Permanente June 2011  –  August 2011  (3 months) San Francisco Bay Area • Accommodated high school students, who were interning in various medical fields, with their jobs by dealing with paperwork and calls related to their hiring and placement in Kaiser. \n• Assisted the head coordinator of the program by stepping in and acting as the supervisor for the interns. \n• Planned “Education Days” for all of the interns, in which they reconvened on Fridays and learned about different aspects of the medical field. Student Intern Raising Interest in Science and Engineering (RISE) June 2010  –  August 2010  (3 months) Stanford University • Picked to participate in a paid internship at Stanford in which students were dispersed across various engineering and science fields depending on interests. \n• Worked on a combined Electrical Engineering and Astrophysics project in order to create a device to measure gravitational waves. \n• Created a poster to display research, which showed the higher level mathematics and physics of the device. Participant Minority Introduction to Engineering and Sciences (MITES) June 2009  –  August 2009  (3 months) • Chosen to participate in competitive science program at the Massachusetts Institute of Technology in which participants took college level classes. \n• Courses taken included: Chemistry, Calculus, Physics and Humanities. \n• Took an elective course called Digital Design where students learned the Objective C language in order to create iPhone applications. Electrical Engineering Intern Hewlett-Packard June 2014  – Present (1 year 3 months) San Francisco Bay Area Electrical Engineering Intern Hewlett-Packard June 2014  – Present (1 year 3 months) San Francisco Bay Area Ernest Houston Johnson Scholars Program Coordinator Stanford University August 2014  –  March 2015  (8 months) Stanford, CA • Helped instruct and lead a course that is dedicated to mentoring the incoming African American Freshmen class at Stanford. \n• Interviewed graduate students who want to be a part of the program as mentors for these students. \n• Acted as the point of contact for the students, their mentors, and faculty members who teach these students. \n• Organized a retreat and other events that are meant for community building and exposure to resources and mentorship. Ernest Houston Johnson Scholars Program Coordinator Stanford University August 2014  –  March 2015  (8 months) Stanford, CA • Helped instruct and lead a course that is dedicated to mentoring the incoming African American Freshmen class at Stanford. \n• Interviewed graduate students who want to be a part of the program as mentors for these students. \n• Acted as the point of contact for the students, their mentors, and faculty members who teach these students. \n• Organized a retreat and other events that are meant for community building and exposure to resources and mentorship. Resident Assistant Stanford University September 2012  –  September 2014  (2 years 1 month) Oak Creek Apartments • Hired as a resident assistant (and summer resident assistant during the summer of 2014) to undergraduate students living in off campus housing. \n• Check in with both residents and staff weekly to figure out how to best accommodate residents, especially through programming. \n• Re-enforce rules and regulations to ensure the safety of the residents who reside in Oak Creek. \n• Counsel students in apartment living, and what best ways to ensure that their living space is comfortable and suitable for being a successful student. Resident Assistant Stanford University September 2012  –  September 2014  (2 years 1 month) Oak Creek Apartments • Hired as a resident assistant (and summer resident assistant during the summer of 2014) to undergraduate students living in off campus housing. \n• Check in with both residents and staff weekly to figure out how to best accommodate residents, especially through programming. \n• Re-enforce rules and regulations to ensure the safety of the residents who reside in Oak Creek. \n• Counsel students in apartment living, and what best ways to ensure that their living space is comfortable and suitable for being a successful student. Student Image Developer Stanford University March 2014  –  June 2014  (4 months) Academic Computing Services • Installed the required applications and utilities on the master images and ensuring that they work properly. Performing updates and revisions as needed. \n• Documented the process of creating and deploying images, and documenting all changes or modifications to existing images. \n• Responded to trouble reports regarding the images and resolving them. Student Image Developer Stanford University March 2014  –  June 2014  (4 months) Academic Computing Services • Installed the required applications and utilities on the master images and ensuring that they work properly. Performing updates and revisions as needed. \n• Documented the process of creating and deploying images, and documenting all changes or modifications to existing images. \n• Responded to trouble reports regarding the images and resolving them. Electrical Engineering Intern Hewlett-Packard June 2013  –  August 2013  (3 months) San Francisco Bay Area • Hired as the electrical engineering intern on the research and development team to enhance the audio quality of Hewlett-Packard’s all-in-one desktop computers.  \n• Used audio digital signal processing software to improve the sound of the AiO speakers. \n• Learned about amplifier technology to optimize the performance of the speakers in the AiO. \n• Worked with the mechanical engineering interns to design and make a demo model of an optimized AiO audio subsystem. Electrical Engineering Intern Hewlett-Packard June 2013  –  August 2013  (3 months) San Francisco Bay Area • Hired as the electrical engineering intern on the research and development team to enhance the audio quality of Hewlett-Packard’s all-in-one desktop computers.  \n• Used audio digital signal processing software to improve the sound of the AiO speakers. \n• Learned about amplifier technology to optimize the performance of the speakers in the AiO. \n• Worked with the mechanical engineering interns to design and make a demo model of an optimized AiO audio subsystem. Summer Resident Assistant Stanford University June 2012  –  September 2012  (4 months) Manzanita Park • Hired to be one of six Manzanita Park resident assistants to incoming athletes, visiting students and matriculated Stanford students.  \n• Met weekly with staff in order to discuss dorm logistics and plan social events for the residents. \n• Re-enforced rules of the rules to ensure the safety of residents living in Manzanita Park. \n• Assisted students with any troubles they encountered, and ensured that their living space was comfortable and suitable for their success during the summer. Summer Resident Assistant Stanford University June 2012  –  September 2012  (4 months) Manzanita Park • Hired to be one of six Manzanita Park resident assistants to incoming athletes, visiting students and matriculated Stanford students.  \n• Met weekly with staff in order to discuss dorm logistics and plan social events for the residents. \n• Re-enforced rules of the rules to ensure the safety of residents living in Manzanita Park. \n• Assisted students with any troubles they encountered, and ensured that their living space was comfortable and suitable for their success during the summer. Electrical Engineering Intern Research Experience for Undergraduates (REU) June 2012  –  August 2012  (3 months) Stanford University • Selected for a ten week research program only for Stanford Electrical Engineering majors; all students were dispersed into various labs depending on their interests and specific Electrical Engineering tracks.  \n• Worked in a lab, with one other partner, that focused on music to design user friendly electric drums. \n• Applied knowledge of filters, amplifiers and physics in order to create the proper electronic and mechanical hardware for the drums. \n• Learned about digital/analog inputs and outputs for an Arduino and proper coding of the microcontroller to create the actual drum sounds, played by striking Piezo sensors. Electrical Engineering Intern Research Experience for Undergraduates (REU) June 2012  –  August 2012  (3 months) Stanford University • Selected for a ten week research program only for Stanford Electrical Engineering majors; all students were dispersed into various labs depending on their interests and specific Electrical Engineering tracks.  \n• Worked in a lab, with one other partner, that focused on music to design user friendly electric drums. \n• Applied knowledge of filters, amplifiers and physics in order to create the proper electronic and mechanical hardware for the drums. \n• Learned about digital/analog inputs and outputs for an Arduino and proper coding of the microcontroller to create the actual drum sounds, played by striking Piezo sensors. Education & Youth Development Fellow East Palo Alto Stanford Academy October 2010  –  June 2012  (1 year 9 months) Stanford University • Served as a mentor and role model to forty middle school children from East Palo Alto. \n• Taught twenty eighth grade students mathematics in preparation for meeting the California standards in Algebra I, Geometry and Algebra II. \n• Met with other fellows and directors to develop strategies to best mentor youth. \n• Planned recreational events for the kids that allowed them to bond with their tutors. Education & Youth Development Fellow East Palo Alto Stanford Academy October 2010  –  June 2012  (1 year 9 months) Stanford University • Served as a mentor and role model to forty middle school children from East Palo Alto. \n• Taught twenty eighth grade students mathematics in preparation for meeting the California standards in Algebra I, Geometry and Algebra II. \n• Met with other fellows and directors to develop strategies to best mentor youth. \n• Planned recreational events for the kids that allowed them to bond with their tutors. Electrical Engineering Intern Tigo Energy August 2011  –  September 2011  (2 months) San Francisco Bay Area • Acquired knowledge of solar panel hardware and its relationship to electronics and signals \n• Gained knowledge of the electrical engineering behind Tigo’s solar panels, by shadowing an employee, and testing its effectiveness using a computer. \n• Strengthened technical writing skills and documented steps that tested the effectiveness of specific types of solar panels. \n• Applied previous knowledge of basic circuits in order to fully analyze devices and product. Electrical Engineering Intern Tigo Energy August 2011  –  September 2011  (2 months) San Francisco Bay Area • Acquired knowledge of solar panel hardware and its relationship to electronics and signals \n• Gained knowledge of the electrical engineering behind Tigo’s solar panels, by shadowing an employee, and testing its effectiveness using a computer. \n• Strengthened technical writing skills and documented steps that tested the effectiveness of specific types of solar panels. \n• Applied previous knowledge of basic circuits in order to fully analyze devices and product. Summer Youth Employment Program On-Site Coordinator Kaiser Permanente June 2011  –  August 2011  (3 months) San Francisco Bay Area • Accommodated high school students, who were interning in various medical fields, with their jobs by dealing with paperwork and calls related to their hiring and placement in Kaiser. \n• Assisted the head coordinator of the program by stepping in and acting as the supervisor for the interns. \n• Planned “Education Days” for all of the interns, in which they reconvened on Fridays and learned about different aspects of the medical field. Summer Youth Employment Program On-Site Coordinator Kaiser Permanente June 2011  –  August 2011  (3 months) San Francisco Bay Area • Accommodated high school students, who were interning in various medical fields, with their jobs by dealing with paperwork and calls related to their hiring and placement in Kaiser. \n• Assisted the head coordinator of the program by stepping in and acting as the supervisor for the interns. \n• Planned “Education Days” for all of the interns, in which they reconvened on Fridays and learned about different aspects of the medical field. Student Intern Raising Interest in Science and Engineering (RISE) June 2010  –  August 2010  (3 months) Stanford University • Picked to participate in a paid internship at Stanford in which students were dispersed across various engineering and science fields depending on interests. \n• Worked on a combined Electrical Engineering and Astrophysics project in order to create a device to measure gravitational waves. \n• Created a poster to display research, which showed the higher level mathematics and physics of the device. Student Intern Raising Interest in Science and Engineering (RISE) June 2010  –  August 2010  (3 months) Stanford University • Picked to participate in a paid internship at Stanford in which students were dispersed across various engineering and science fields depending on interests. \n• Worked on a combined Electrical Engineering and Astrophysics project in order to create a device to measure gravitational waves. \n• Created a poster to display research, which showed the higher level mathematics and physics of the device. Participant Minority Introduction to Engineering and Sciences (MITES) June 2009  –  August 2009  (3 months) • Chosen to participate in competitive science program at the Massachusetts Institute of Technology in which participants took college level classes. \n• Courses taken included: Chemistry, Calculus, Physics and Humanities. \n• Took an elective course called Digital Design where students learned the Objective C language in order to create iPhone applications. Participant Minority Introduction to Engineering and Sciences (MITES) June 2009  –  August 2009  (3 months) • Chosen to participate in competitive science program at the Massachusetts Institute of Technology in which participants took college level classes. \n• Courses taken included: Chemistry, Calculus, Physics and Humanities. \n• Took an elective course called Digital Design where students learned the Objective C language in order to create iPhone applications. Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Teaching Leadership Public Speaking Matlab C++ PowerPoint Microsoft Office Java Tutoring Engineering Spanish Microsoft Excel Lesson Planning Analysis C Time Management Higher Education Technical Writing Microsoft Word Mentoring Cross-functional... Verilog Audio Engineering See 8+     See less Skills  Teaching Leadership Public Speaking Matlab C++ PowerPoint Microsoft Office Java Tutoring Engineering Spanish Microsoft Excel Lesson Planning Analysis C Time Management Higher Education Technical Writing Microsoft Word Mentoring Cross-functional... Verilog Audio Engineering See 8+     See less Teaching Leadership Public Speaking Matlab C++ PowerPoint Microsoft Office Java Tutoring Engineering Spanish Microsoft Excel Lesson Planning Analysis C Time Management Higher Education Technical Writing Microsoft Word Mentoring Cross-functional... Verilog Audio Engineering See 8+     See less Teaching Leadership Public Speaking Matlab C++ PowerPoint Microsoft Office Java Tutoring Engineering Spanish Microsoft Excel Lesson Planning Analysis C Time Management Higher Education Technical Writing Microsoft Word Mentoring Cross-functional... Verilog Audio Engineering See 8+     See less Education Stanford University Master of Science (M.S.),  Electrical Engineering 2014  – 2015 Stanford University Bachelor of Science in Electrical Engineering, Minor in Education , Senior 2010  – 2014 Activities and Societies:  East Palo Alto Stanford Academy ,  First Generation Low Income Partnership ,  Stanford Society of Black Scientists and Engineers (SBSE) ,  Phi Beta Sigma Fraternity ,  Inc. Eastside College Preparatory School High School Diploma 2006  – 2010 Activities and Societies:  Student Council ,  Step by Step (Community Service Group) ,  Choir ,  National Society of Black Engineers (NSBE) ,  Invisible Children Stanford University Master of Science (M.S.),  Electrical Engineering 2014  – 2015 Stanford University Master of Science (M.S.),  Electrical Engineering 2014  – 2015 Stanford University Master of Science (M.S.),  Electrical Engineering 2014  – 2015 Stanford University Bachelor of Science in Electrical Engineering, Minor in Education , Senior 2010  – 2014 Activities and Societies:  East Palo Alto Stanford Academy ,  First Generation Low Income Partnership ,  Stanford Society of Black Scientists and Engineers (SBSE) ,  Phi Beta Sigma Fraternity ,  Inc. Stanford University Bachelor of Science in Electrical Engineering, Minor in Education , Senior 2010  – 2014 Activities and Societies:  East Palo Alto Stanford Academy ,  First Generation Low Income Partnership ,  Stanford Society of Black Scientists and Engineers (SBSE) ,  Phi Beta Sigma Fraternity ,  Inc. Stanford University Bachelor of Science in Electrical Engineering, Minor in Education , Senior 2010  – 2014 Activities and Societies:  East Palo Alto Stanford Academy ,  First Generation Low Income Partnership ,  Stanford Society of Black Scientists and Engineers (SBSE) ,  Phi Beta Sigma Fraternity ,  Inc. Eastside College Preparatory School High School Diploma 2006  – 2010 Activities and Societies:  Student Council ,  Step by Step (Community Service Group) ,  Choir ,  National Society of Black Engineers (NSBE) ,  Invisible Children Eastside College Preparatory School High School Diploma 2006  – 2010 Activities and Societies:  Student Council ,  Step by Step (Community Service Group) ,  Choir ,  National Society of Black Engineers (NSBE) ,  Invisible Children Eastside College Preparatory School High School Diploma 2006  – 2010 Activities and Societies:  Student Council ,  Step by Step (Community Service Group) ,  Choir ,  National Society of Black Engineers (NSBE) ,  Invisible Children ", "Experience Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, CA Acting Apprentice Williamstown Theatre Festival June 2015  –  August 2015  (3 months) Williamstown, MA Actor Stanford Repertory Theater June 2014  –  August 2014  (3 months) Stanford, CA Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, CA Resident Assistant Stanford University September 2014  – Present (1 year) Stanford, CA Acting Apprentice Williamstown Theatre Festival June 2015  –  August 2015  (3 months) Williamstown, MA Acting Apprentice Williamstown Theatre Festival June 2015  –  August 2015  (3 months) Williamstown, MA Actor Stanford Repertory Theater June 2014  –  August 2014  (3 months) Stanford, CA Actor Stanford Repertory Theater June 2014  –  August 2014  (3 months) Stanford, CA Education Stanford University Bachelor of Arts (B.A.),  Theater and Performance Studies 2012  – 2016 Stanford University Bachelor of Arts (B.A.),  Theater and Performance Studies 2012  – 2016 Stanford University Bachelor of Arts (B.A.),  Theater and Performance Studies 2012  – 2016 Stanford University Bachelor of Arts (B.A.),  Theater and Performance Studies 2012  – 2016 ", "Experience Summer Resident Assistant Stanford University June 2015  – Present (3 months) Jenkins House, Governor's Corner Resident Assistant University of California, Santa Cruz September 2013  –  June 2014  (10 months) Stevenson College - Provided cultural, educational, and social programming throughout the year for students in residence \n- Developed a safe and academically conducive residential environment \n- Maintained visibility and accessibility to residents \n- Provided conflict mediation and peer counseling \n- Served as a resource for residents and directed residents to campus resources and services \n- Responded to emergency situations and assisted with evacuations when necessary \n- Served as a Mandated Reporter; fulfilled all documentation and reporting requirements as outlined \nin the Clery Act (Campus Security Authorities - CSA) and the Child Abuse and Neglect \nReporting Act (CANRA) \n- Upheld and enforced all housing and university policies and documented all policy violations Producer Vagina Organization September 2012  –  June 2014  (1 year 10 months) University of California, Santa Cruz - Responsible for fundraising in order to produce The Vagina Monologues annually  \n- Acted as liaison between Student Organization Advising & Resources and the Vagina Organization  \n- Managed the organization's finances and handled merchandise and philanthropic donations \n- Handled ticket and merchandise sales  \n- Created playbills for the productions Mailroom Clerk University of California, Santa Cruz September 2012  –  June 2013  (10 months) Stevenson College - Sorted and stuffed mail \n- Logged in and delivered packages to the Stevenson residential community \n- Signed for package deliveries from mail delivery services \n- Assigned mailboxes to residents of the Stevenson community \n- Maintained box assignments and key inventory Summer Resident Assistant Stanford University June 2015  – Present (3 months) Jenkins House, Governor's Corner Summer Resident Assistant Stanford University June 2015  – Present (3 months) Jenkins House, Governor's Corner Resident Assistant University of California, Santa Cruz September 2013  –  June 2014  (10 months) Stevenson College - Provided cultural, educational, and social programming throughout the year for students in residence \n- Developed a safe and academically conducive residential environment \n- Maintained visibility and accessibility to residents \n- Provided conflict mediation and peer counseling \n- Served as a resource for residents and directed residents to campus resources and services \n- Responded to emergency situations and assisted with evacuations when necessary \n- Served as a Mandated Reporter; fulfilled all documentation and reporting requirements as outlined \nin the Clery Act (Campus Security Authorities - CSA) and the Child Abuse and Neglect \nReporting Act (CANRA) \n- Upheld and enforced all housing and university policies and documented all policy violations Resident Assistant University of California, Santa Cruz September 2013  –  June 2014  (10 months) Stevenson College - Provided cultural, educational, and social programming throughout the year for students in residence \n- Developed a safe and academically conducive residential environment \n- Maintained visibility and accessibility to residents \n- Provided conflict mediation and peer counseling \n- Served as a resource for residents and directed residents to campus resources and services \n- Responded to emergency situations and assisted with evacuations when necessary \n- Served as a Mandated Reporter; fulfilled all documentation and reporting requirements as outlined \nin the Clery Act (Campus Security Authorities - CSA) and the Child Abuse and Neglect \nReporting Act (CANRA) \n- Upheld and enforced all housing and university policies and documented all policy violations Producer Vagina Organization September 2012  –  June 2014  (1 year 10 months) University of California, Santa Cruz - Responsible for fundraising in order to produce The Vagina Monologues annually  \n- Acted as liaison between Student Organization Advising & Resources and the Vagina Organization  \n- Managed the organization's finances and handled merchandise and philanthropic donations \n- Handled ticket and merchandise sales  \n- Created playbills for the productions Producer Vagina Organization September 2012  –  June 2014  (1 year 10 months) University of California, Santa Cruz - Responsible for fundraising in order to produce The Vagina Monologues annually  \n- Acted as liaison between Student Organization Advising & Resources and the Vagina Organization  \n- Managed the organization's finances and handled merchandise and philanthropic donations \n- Handled ticket and merchandise sales  \n- Created playbills for the productions Mailroom Clerk University of California, Santa Cruz September 2012  –  June 2013  (10 months) Stevenson College - Sorted and stuffed mail \n- Logged in and delivered packages to the Stevenson residential community \n- Signed for package deliveries from mail delivery services \n- Assigned mailboxes to residents of the Stevenson community \n- Maintained box assignments and key inventory Mailroom Clerk University of California, Santa Cruz September 2012  –  June 2013  (10 months) Stevenson College - Sorted and stuffed mail \n- Logged in and delivered packages to the Stevenson residential community \n- Signed for package deliveries from mail delivery services \n- Assigned mailboxes to residents of the Stevenson community \n- Maintained box assignments and key inventory Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Microsoft Excel Public Speaking Microsoft Office PowerPoint Research Microsoft Word Social Media Event Planning Community Outreach Higher Education Teamwork Customer Service Teaching Editing Time Management Skills  Microsoft Excel Public Speaking Microsoft Office PowerPoint Research Microsoft Word Social Media Event Planning Community Outreach Higher Education Teamwork Customer Service Teaching Editing Time Management Microsoft Excel Public Speaking Microsoft Office PowerPoint Research Microsoft Word Social Media Event Planning Community Outreach Higher Education Teamwork Customer Service Teaching Editing Time Management Microsoft Excel Public Speaking Microsoft Office PowerPoint Research Microsoft Word Social Media Event Planning Community Outreach Higher Education Teamwork Customer Service Teaching Editing Time Management Education Stanford University Bachelor's Degree,  Classics and Classical Languages , Literatures, and Linguistics 2014  – 2016 Activities and Societies:  Leland Stanford Junior University Marching Band University of California, Santa Cruz 2012  – 2014 Stanford University Bachelor's Degree,  Classics and Classical Languages , Literatures, and Linguistics 2014  – 2016 Activities and Societies:  Leland Stanford Junior University Marching Band Stanford University Bachelor's Degree,  Classics and Classical Languages , Literatures, and Linguistics 2014  – 2016 Activities and Societies:  Leland Stanford Junior University Marching Band Stanford University Bachelor's Degree,  Classics and Classical Languages , Literatures, and Linguistics 2014  – 2016 Activities and Societies:  Leland Stanford Junior University Marching Band University of California, Santa Cruz 2012  – 2014 University of California, Santa Cruz 2012  – 2014 University of California, Santa Cruz 2012  – 2014 Honors & Awards Minority Scholarship in Classics and Classical Archaeology American Philological Association January 2014 Received a scholarship from the American Philological Association for summer 2014. The APA awards this fellowship to further an undergraduate's preparation for graduate work in classics or classical archaeology. Summer Session II member American School of Classical Studies at Athens June 2014 6 week summer session in Greece studying with the American School of Classical Studies at Athens.  Dean's Honors List University of California, Santa Cruz June 2014 Maintained place on Dean's Honors List during undergraduate period at the University of California, Santa Cruz. (Fall 2012 - Spring 2014) Gildas Hamel Book Prize in Latin Classical Studies Department at the University of California, Santa Cruz June 2013 Awarded by the Classical Studies department at the University of California, Santa Cruz for outstanding undergraduate work in Latin.  Minority Scholarship in Classics and Classical Archaeology American Philological Association January 2014 Received a scholarship from the American Philological Association for summer 2014. The APA awards this fellowship to further an undergraduate's preparation for graduate work in classics or classical archaeology. Minority Scholarship in Classics and Classical Archaeology American Philological Association January 2014 Received a scholarship from the American Philological Association for summer 2014. The APA awards this fellowship to further an undergraduate's preparation for graduate work in classics or classical archaeology. Minority Scholarship in Classics and Classical Archaeology American Philological Association January 2014 Received a scholarship from the American Philological Association for summer 2014. The APA awards this fellowship to further an undergraduate's preparation for graduate work in classics or classical archaeology. Summer Session II member American School of Classical Studies at Athens June 2014 6 week summer session in Greece studying with the American School of Classical Studies at Athens.  Summer Session II member American School of Classical Studies at Athens June 2014 6 week summer session in Greece studying with the American School of Classical Studies at Athens.  Summer Session II member American School of Classical Studies at Athens June 2014 6 week summer session in Greece studying with the American School of Classical Studies at Athens.  Dean's Honors List University of California, Santa Cruz June 2014 Maintained place on Dean's Honors List during undergraduate period at the University of California, Santa Cruz. (Fall 2012 - Spring 2014) Dean's Honors List University of California, Santa Cruz June 2014 Maintained place on Dean's Honors List during undergraduate period at the University of California, Santa Cruz. (Fall 2012 - Spring 2014) Dean's Honors List University of California, Santa Cruz June 2014 Maintained place on Dean's Honors List during undergraduate period at the University of California, Santa Cruz. (Fall 2012 - Spring 2014) Gildas Hamel Book Prize in Latin Classical Studies Department at the University of California, Santa Cruz June 2013 Awarded by the Classical Studies department at the University of California, Santa Cruz for outstanding undergraduate work in Latin.  Gildas Hamel Book Prize in Latin Classical Studies Department at the University of California, Santa Cruz June 2013 Awarded by the Classical Studies department at the University of California, Santa Cruz for outstanding undergraduate work in Latin.  Gildas Hamel Book Prize in Latin Classical Studies Department at the University of California, Santa Cruz June 2013 Awarded by the Classical Studies department at the University of California, Santa Cruz for outstanding undergraduate work in Latin.  ", "Summary I’m in my senior year at Stanford. I am hard working, intelligent, resourceful, analytic, a fast learner, a team player, and determined to do a great job. Summary I’m in my senior year at Stanford. I am hard working, intelligent, resourceful, analytic, a fast learner, a team player, and determined to do a great job. I’m in my senior year at Stanford. I am hard working, intelligent, resourceful, analytic, a fast learner, a team player, and determined to do a great job. I’m in my senior year at Stanford. I am hard working, intelligent, resourceful, analytic, a fast learner, a team player, and determined to do a great job. Experience Resident Assistant Stanford University September 2014  – Present (1 year) Live and work in the Larkin dorm, which houses 99 freshmen, preparing events and supervising and supporting residents. Legislative Intern Office of Marijuana Coordination -- Colorado Governor's Office June 2014  –  August 2014  (3 months) Denver, CO Wrote memos, researched issues of importance, and prepared briefings to help facilitate the implementation of legal marijuana in Colorado. Nightwatch Stanford Sierra Camp June 2013  –  September 2013  (4 months) Acted as primary point of contact at night for Stanford alumni Camp, while also maintaining Camp facilities and preparing for the next day Recruiting Coordinator Intern VonChurch June 2012  –  September 2012  (4 months) Worked in HR and Operations at digital entertainment recruiting firm. Compiled and analyzed the firm’s entire contract history, and sourced and contacted potential new hires Campaign Intern Fix MUNI Now! May 2010  –  July 2010  (3 months) Worked in an office setting, distributing petitions and aiding in promotional activities for San Francisco city proposition. St. Ignatius Summer Drama Camp St. Ignatius College Preparatory May 2009  –  July 2009  (3 months) Taught acting to 3rd-8th graders over two two-week sessions, directing them in a musical number at each session's conclusion Resident Assistant Stanford University September 2014  – Present (1 year) Live and work in the Larkin dorm, which houses 99 freshmen, preparing events and supervising and supporting residents. Resident Assistant Stanford University September 2014  – Present (1 year) Live and work in the Larkin dorm, which houses 99 freshmen, preparing events and supervising and supporting residents. Legislative Intern Office of Marijuana Coordination -- Colorado Governor's Office June 2014  –  August 2014  (3 months) Denver, CO Wrote memos, researched issues of importance, and prepared briefings to help facilitate the implementation of legal marijuana in Colorado. Legislative Intern Office of Marijuana Coordination -- Colorado Governor's Office June 2014  –  August 2014  (3 months) Denver, CO Wrote memos, researched issues of importance, and prepared briefings to help facilitate the implementation of legal marijuana in Colorado. Nightwatch Stanford Sierra Camp June 2013  –  September 2013  (4 months) Acted as primary point of contact at night for Stanford alumni Camp, while also maintaining Camp facilities and preparing for the next day Nightwatch Stanford Sierra Camp June 2013  –  September 2013  (4 months) Acted as primary point of contact at night for Stanford alumni Camp, while also maintaining Camp facilities and preparing for the next day Recruiting Coordinator Intern VonChurch June 2012  –  September 2012  (4 months) Worked in HR and Operations at digital entertainment recruiting firm. Compiled and analyzed the firm’s entire contract history, and sourced and contacted potential new hires Recruiting Coordinator Intern VonChurch June 2012  –  September 2012  (4 months) Worked in HR and Operations at digital entertainment recruiting firm. Compiled and analyzed the firm’s entire contract history, and sourced and contacted potential new hires Campaign Intern Fix MUNI Now! May 2010  –  July 2010  (3 months) Worked in an office setting, distributing petitions and aiding in promotional activities for San Francisco city proposition. Campaign Intern Fix MUNI Now! May 2010  –  July 2010  (3 months) Worked in an office setting, distributing petitions and aiding in promotional activities for San Francisco city proposition. St. Ignatius Summer Drama Camp St. Ignatius College Preparatory May 2009  –  July 2009  (3 months) Taught acting to 3rd-8th graders over two two-week sessions, directing them in a musical number at each session's conclusion St. Ignatius Summer Drama Camp St. Ignatius College Preparatory May 2009  –  July 2009  (3 months) Taught acting to 3rd-8th graders over two two-week sessions, directing them in a musical number at each session's conclusion Skills Talent Acquisition Sourcing Social Networking Social Media Microsoft Office Research Public Speaking Creative Writing Proposal Writing Teamwork Skills  Talent Acquisition Sourcing Social Networking Social Media Microsoft Office Research Public Speaking Creative Writing Proposal Writing Teamwork Talent Acquisition Sourcing Social Networking Social Media Microsoft Office Research Public Speaking Creative Writing Proposal Writing Teamwork Talent Acquisition Sourcing Social Networking Social Media Microsoft Office Research Public Speaking Creative Writing Proposal Writing Teamwork Education Stanford University BA Candidate,  Political Science and Government 2011  – 2015 Activities and Societies:  Flying TreeHouse Children's Theater Company ,  Ram's Head Theatrical Society ,  Stanford Improvisers ,  Leland Stanford Junior University Marching Band ,  Stanford Sierra Camp St. Ignatius College Preparatory High School Degree 2007  – 2011 Stanford University BA Candidate,  Political Science and Government 2011  – 2015 Activities and Societies:  Flying TreeHouse Children's Theater Company ,  Ram's Head Theatrical Society ,  Stanford Improvisers ,  Leland Stanford Junior University Marching Band ,  Stanford Sierra Camp Stanford University BA Candidate,  Political Science and Government 2011  – 2015 Activities and Societies:  Flying TreeHouse Children's Theater Company ,  Ram's Head Theatrical Society ,  Stanford Improvisers ,  Leland Stanford Junior University Marching Band ,  Stanford Sierra Camp Stanford University BA Candidate,  Political Science and Government 2011  – 2015 Activities and Societies:  Flying TreeHouse Children's Theater Company ,  Ram's Head Theatrical Society ,  Stanford Improvisers ,  Leland Stanford Junior University Marching Band ,  Stanford Sierra Camp St. Ignatius College Preparatory High School Degree 2007  – 2011 St. Ignatius College Preparatory High School Degree 2007  – 2011 St. Ignatius College Preparatory High School Degree 2007  – 2011 ", "Experience Resident Physician, Internal Medicine University of Pennsylvania Health System June 2013  – Present (2 years 3 months) Philadelphia, PA Organization of Student Representatives Association of American Medical Colleges September 2008  –  June 2013  (4 years 10 months) Chair Western Region Organization of Student Representatives (OSR) Association of American Medical Colleges April 2009  –  October 2010  (1 year 7 months) Board of Directors Stanford Student Enterprises June 2007  –  May 2008  (1 year) Student Body President Associated Students of Stanford University March 2007  –  May 2008  (1 year 3 months) Resident Assistant Stanford University Residential Education August 2006  –  June 2007  (11 months) Chair, 8th Undergraduate Senate Associated Students of Stanford University May 2006  –  April 2007  (1 year) Resident Physician, Internal Medicine University of Pennsylvania Health System June 2013  – Present (2 years 3 months) Philadelphia, PA Resident Physician, Internal Medicine University of Pennsylvania Health System June 2013  – Present (2 years 3 months) Philadelphia, PA Organization of Student Representatives Association of American Medical Colleges September 2008  –  June 2013  (4 years 10 months) Organization of Student Representatives Association of American Medical Colleges September 2008  –  June 2013  (4 years 10 months) Chair Western Region Organization of Student Representatives (OSR) Association of American Medical Colleges April 2009  –  October 2010  (1 year 7 months) Chair Western Region Organization of Student Representatives (OSR) Association of American Medical Colleges April 2009  –  October 2010  (1 year 7 months) Board of Directors Stanford Student Enterprises June 2007  –  May 2008  (1 year) Board of Directors Stanford Student Enterprises June 2007  –  May 2008  (1 year) Student Body President Associated Students of Stanford University March 2007  –  May 2008  (1 year 3 months) Student Body President Associated Students of Stanford University March 2007  –  May 2008  (1 year 3 months) Resident Assistant Stanford University Residential Education August 2006  –  June 2007  (11 months) Resident Assistant Stanford University Residential Education August 2006  –  June 2007  (11 months) Chair, 8th Undergraduate Senate Associated Students of Stanford University May 2006  –  April 2007  (1 year) Chair, 8th Undergraduate Senate Associated Students of Stanford University May 2006  –  April 2007  (1 year) Languages Telugu Spanish Telugu Spanish Telugu Spanish Skills Research Public Health Healthcare Data Analysis Clinical Research Public Speaking Community Outreach Lifesciences Science Medical Education Epidemiology Healthcare Management Neuroscience Skills  Research Public Health Healthcare Data Analysis Clinical Research Public Speaking Community Outreach Lifesciences Science Medical Education Epidemiology Healthcare Management Neuroscience Research Public Health Healthcare Data Analysis Clinical Research Public Speaking Community Outreach Lifesciences Science Medical Education Epidemiology Healthcare Management Neuroscience Research Public Health Healthcare Data Analysis Clinical Research Public Speaking Community Outreach Lifesciences Science Medical Education Epidemiology Healthcare Management Neuroscience Education University of California, San Diego - School of Medicine MD,  Medicine 2008  – 2013 Master's Degree year is factored into graduation date. Activities and Societies:  PRIME-HEq ,  OSR ,  UCSD Free Clinics: Cardiology Specialty Clinic Co-Manager University of California, Berkeley School of Public Health MPH,  Health Policy and Management 2011  – 2012 Stanford University B.A.,  Political Science 2004  – 2008 University of California, San Diego - School of Medicine MD,  Medicine 2008  – 2013 Master's Degree year is factored into graduation date. Activities and Societies:  PRIME-HEq ,  OSR ,  UCSD Free Clinics: Cardiology Specialty Clinic Co-Manager University of California, San Diego - School of Medicine MD,  Medicine 2008  – 2013 Master's Degree year is factored into graduation date. Activities and Societies:  PRIME-HEq ,  OSR ,  UCSD Free Clinics: Cardiology Specialty Clinic Co-Manager University of California, San Diego - School of Medicine MD,  Medicine 2008  – 2013 Master's Degree year is factored into graduation date. Activities and Societies:  PRIME-HEq ,  OSR ,  UCSD Free Clinics: Cardiology Specialty Clinic Co-Manager University of California, Berkeley School of Public Health MPH,  Health Policy and Management 2011  – 2012 University of California, Berkeley School of Public Health MPH,  Health Policy and Management 2011  – 2012 University of California, Berkeley School of Public Health MPH,  Health Policy and Management 2011  – 2012 Stanford University B.A.,  Political Science 2004  – 2008 Stanford University B.A.,  Political Science 2004  – 2008 Stanford University B.A.,  Political Science 2004  – 2008 ", "Experience Research Associate Phosplatin Therapeutics June 2015  – Present (3 months) Greater New York City Area Women in STEM Coordinator Stanford University June 2015  – Present (3 months) Women's Community Center Resident Assistant Stanford University June 2015  – Present (3 months) Kairos Resident Assistant Stanford University June 2014  –  June 2015  (1 year 1 month) Junipero Freshmen Dorm Research Assistant Stanford University June 2014  –  September 2014  (4 months) Andrew Endy Lab Research Associate Phosplatin Therapeutics June 2015  – Present (3 months) Greater New York City Area Research Associate Phosplatin Therapeutics June 2015  – Present (3 months) Greater New York City Area Women in STEM Coordinator Stanford University June 2015  – Present (3 months) Women's Community Center Women in STEM Coordinator Stanford University June 2015  – Present (3 months) Women's Community Center Resident Assistant Stanford University June 2015  – Present (3 months) Kairos Resident Assistant Stanford University June 2015  – Present (3 months) Kairos Resident Assistant Stanford University June 2014  –  June 2015  (1 year 1 month) Junipero Freshmen Dorm Resident Assistant Stanford University June 2014  –  June 2015  (1 year 1 month) Junipero Freshmen Dorm Research Assistant Stanford University June 2014  –  September 2014  (4 months) Andrew Endy Lab Research Assistant Stanford University June 2014  –  September 2014  (4 months) Andrew Endy Lab Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Leadership Communication Public Speaking Research PCR Molecular Biology Cell Culture Matlab PowerPoint Skills  Leadership Communication Public Speaking Research PCR Molecular Biology Cell Culture Matlab PowerPoint Leadership Communication Public Speaking Research PCR Molecular Biology Cell Culture Matlab PowerPoint Leadership Communication Public Speaking Research PCR Molecular Biology Cell Culture Matlab PowerPoint Education Stanford University Bachelor’s Degree 2012  – 2016 A&M Consolidated High School 2008  – 2012 Stanford University Bachelor’s Degree 2012  – 2016 Stanford University Bachelor’s Degree 2012  – 2016 Stanford University Bachelor’s Degree 2012  – 2016 A&M Consolidated High School 2008  – 2012 A&M Consolidated High School 2008  – 2012 A&M Consolidated High School 2008  – 2012 ", "Languages Mandarin Spanish Mandarin Spanish Mandarin Spanish Skills Research Mandarin Chinese Entrepreneurship Public Speaking Marketing Marketing Strategy Strategic Planning Public Relations Social Media Marketing Social Networking Market Research Product Marketing Marketing Management Business Strategy Market Analysis Business Development See 2+     See less Skills  Research Mandarin Chinese Entrepreneurship Public Speaking Marketing Marketing Strategy Strategic Planning Public Relations Social Media Marketing Social Networking Market Research Product Marketing Marketing Management Business Strategy Market Analysis Business Development See 2+     See less Research Mandarin Chinese Entrepreneurship Public Speaking Marketing Marketing Strategy Strategic Planning Public Relations Social Media Marketing Social Networking Market Research Product Marketing Marketing Management Business Strategy Market Analysis Business Development See 2+     See less Research Mandarin Chinese Entrepreneurship Public Speaking Marketing Marketing Strategy Strategic Planning Public Relations Social Media Marketing Social Networking Market Research Product Marketing Marketing Management Business Strategy Market Analysis Business Development See 2+     See less Education Wharton School of Business Master of Business Administration (MBA) 2013  – 2015 The Lauder Institute – University of Pennsylvania MA in International Studies 2013  – 2015 Stanford University Bachelor of Arts (B.A.) 2004  – 2008 Peking University Study abroad quarter 2006  – 2006 Wharton School of Business Master of Business Administration (MBA) 2013  – 2015 Wharton School of Business Master of Business Administration (MBA) 2013  – 2015 Wharton School of Business Master of Business Administration (MBA) 2013  – 2015 The Lauder Institute – University of Pennsylvania MA in International Studies 2013  – 2015 The Lauder Institute – University of Pennsylvania MA in International Studies 2013  – 2015 The Lauder Institute – University of Pennsylvania MA in International Studies 2013  – 2015 Stanford University Bachelor of Arts (B.A.) 2004  – 2008 Stanford University Bachelor of Arts (B.A.) 2004  – 2008 Stanford University Bachelor of Arts (B.A.) 2004  – 2008 Peking University Study abroad quarter 2006  – 2006 Peking University Study abroad quarter 2006  – 2006 Peking University Study abroad quarter 2006  – 2006 ", "Experience Program Director, Partnerships and Public Engagement The Fund for Public Schools January 2015  – Present (8 months) Greater New York City Area Teacher KIPP South Fulton Academy June 2012  –  June 2014  (2 years 1 month) Greater Atlanta Area Responsible for breaking down Common Core curriculum in 7th grade English Language Arts and Reading into daily objectives and lesson plans. Differentiated curriculum to grow students at all levels. Carried out school-wide literacy vision for grade level. Communicated with parents on behalf of grade level team and independently for students' academic and character progress on a weekly basis. \n \nAchieved highest student growth rates in 7th grade Reading and Language Arts (based on MAP assessment) out of 80 KIPP middle schools nationwide (2013-2014). Director of Programs Camp BizSmart April 2008  –  April 2012  (4 years 1 month) San Francisco Bay Area Led development and expansion of entrepreneurship program for teens that brings theory to practice through case studies, project-based learning, and mentorship from top company executives and venture capitalists throughout Silicon Valley. \n \nManaged projects related to program development: \n- Logistics for faculty, staff, and partner companies such as Google, Apple, WAGIC, Microsoft, and Cisco in each camp session from 2008 - 2011 (summers) \n- Developed curriculum and training program to onboard camp counselors/student mentors (2009) \n- Streamlined full-cycle recruitment of undergraduate and graduate students for intern positions \n- Expanded camp offerings through partnerships with Silicon Valley Community Foundation and JFK University Teaching Apprentice The American School in London August 2008  –  June 2009  (11 months) Developed and taught mathematics, literacy and social studies curriculum alongside mentor teacher and oversaw after-school homework programs for 50+ Lower School students. Stanford Undergraduate Resident Assistant Stanford University September 2007  –  June 2008  (10 months) Stanford, CA Collaborated with staff leadership team to foster a cooperative and respectful residential community for 50 Stanford freshmen. Managed conflict resolution, diverse views, and personal needs of residents while coordinating educational and cultural programming for the dorm. Program Director, Partnerships and Public Engagement The Fund for Public Schools January 2015  – Present (8 months) Greater New York City Area Program Director, Partnerships and Public Engagement The Fund for Public Schools January 2015  – Present (8 months) Greater New York City Area Teacher KIPP South Fulton Academy June 2012  –  June 2014  (2 years 1 month) Greater Atlanta Area Responsible for breaking down Common Core curriculum in 7th grade English Language Arts and Reading into daily objectives and lesson plans. Differentiated curriculum to grow students at all levels. Carried out school-wide literacy vision for grade level. Communicated with parents on behalf of grade level team and independently for students' academic and character progress on a weekly basis. \n \nAchieved highest student growth rates in 7th grade Reading and Language Arts (based on MAP assessment) out of 80 KIPP middle schools nationwide (2013-2014). Teacher KIPP South Fulton Academy June 2012  –  June 2014  (2 years 1 month) Greater Atlanta Area Responsible for breaking down Common Core curriculum in 7th grade English Language Arts and Reading into daily objectives and lesson plans. Differentiated curriculum to grow students at all levels. Carried out school-wide literacy vision for grade level. Communicated with parents on behalf of grade level team and independently for students' academic and character progress on a weekly basis. \n \nAchieved highest student growth rates in 7th grade Reading and Language Arts (based on MAP assessment) out of 80 KIPP middle schools nationwide (2013-2014). Director of Programs Camp BizSmart April 2008  –  April 2012  (4 years 1 month) San Francisco Bay Area Led development and expansion of entrepreneurship program for teens that brings theory to practice through case studies, project-based learning, and mentorship from top company executives and venture capitalists throughout Silicon Valley. \n \nManaged projects related to program development: \n- Logistics for faculty, staff, and partner companies such as Google, Apple, WAGIC, Microsoft, and Cisco in each camp session from 2008 - 2011 (summers) \n- Developed curriculum and training program to onboard camp counselors/student mentors (2009) \n- Streamlined full-cycle recruitment of undergraduate and graduate students for intern positions \n- Expanded camp offerings through partnerships with Silicon Valley Community Foundation and JFK University Director of Programs Camp BizSmart April 2008  –  April 2012  (4 years 1 month) San Francisco Bay Area Led development and expansion of entrepreneurship program for teens that brings theory to practice through case studies, project-based learning, and mentorship from top company executives and venture capitalists throughout Silicon Valley. \n \nManaged projects related to program development: \n- Logistics for faculty, staff, and partner companies such as Google, Apple, WAGIC, Microsoft, and Cisco in each camp session from 2008 - 2011 (summers) \n- Developed curriculum and training program to onboard camp counselors/student mentors (2009) \n- Streamlined full-cycle recruitment of undergraduate and graduate students for intern positions \n- Expanded camp offerings through partnerships with Silicon Valley Community Foundation and JFK University Teaching Apprentice The American School in London August 2008  –  June 2009  (11 months) Developed and taught mathematics, literacy and social studies curriculum alongside mentor teacher and oversaw after-school homework programs for 50+ Lower School students. Teaching Apprentice The American School in London August 2008  –  June 2009  (11 months) Developed and taught mathematics, literacy and social studies curriculum alongside mentor teacher and oversaw after-school homework programs for 50+ Lower School students. Stanford Undergraduate Resident Assistant Stanford University September 2007  –  June 2008  (10 months) Stanford, CA Collaborated with staff leadership team to foster a cooperative and respectful residential community for 50 Stanford freshmen. Managed conflict resolution, diverse views, and personal needs of residents while coordinating educational and cultural programming for the dorm. Stanford Undergraduate Resident Assistant Stanford University September 2007  –  June 2008  (10 months) Stanford, CA Collaborated with staff leadership team to foster a cooperative and respectful residential community for 50 Stanford freshmen. Managed conflict resolution, diverse views, and personal needs of residents while coordinating educational and cultural programming for the dorm. Languages Chinese Spanish Chinese Spanish Chinese Spanish Skills Leadership Curriculum Design Public Speaking Research Teaching Event Management PowerPoint Event Planning Curriculum Development Staff Development Microsoft Word Tutoring Nonprofits Management Program Management Skills  Leadership Curriculum Design Public Speaking Research Teaching Event Management PowerPoint Event Planning Curriculum Development Staff Development Microsoft Word Tutoring Nonprofits Management Program Management Leadership Curriculum Design Public Speaking Research Teaching Event Management PowerPoint Event Planning Curriculum Development Staff Development Microsoft Word Tutoring Nonprofits Management Program Management Leadership Curriculum Design Public Speaking Research Teaching Event Management PowerPoint Event Planning Curriculum Development Staff Development Microsoft Word Tutoring Nonprofits Management Program Management Education Stanford University B.A.,  International Relations 2004  – 2008 - Oxford University - Intensive tutorial on British educational system \n- Peking University - Studied impact of urbanization on China's education, culture and identity \n- Asia Pacific Student Entrepreneurship Society (ASES) - Organized entrepreneurship panels and international conferences for college students across Asia Pacific region \n- Escondido Elementary School classroom assistant Zhejiang University M.A.,  Comparative Education 2009  – 2011 - Academic focus: Education policy effects in the context of US and China  \n- Completed coursework, publications and thesis in Mandarin Chinese \n- Hosted orientations for incoming international students \n- Coordinated logistics 400+ speakers, exhibitors and attendees of an international conference hosted by School of Public Health Stanford University B.A.,  International Relations 2004  – 2008 - Oxford University - Intensive tutorial on British educational system \n- Peking University - Studied impact of urbanization on China's education, culture and identity \n- Asia Pacific Student Entrepreneurship Society (ASES) - Organized entrepreneurship panels and international conferences for college students across Asia Pacific region \n- Escondido Elementary School classroom assistant Stanford University B.A.,  International Relations 2004  – 2008 - Oxford University - Intensive tutorial on British educational system \n- Peking University - Studied impact of urbanization on China's education, culture and identity \n- Asia Pacific Student Entrepreneurship Society (ASES) - Organized entrepreneurship panels and international conferences for college students across Asia Pacific region \n- Escondido Elementary School classroom assistant Stanford University B.A.,  International Relations 2004  – 2008 - Oxford University - Intensive tutorial on British educational system \n- Peking University - Studied impact of urbanization on China's education, culture and identity \n- Asia Pacific Student Entrepreneurship Society (ASES) - Organized entrepreneurship panels and international conferences for college students across Asia Pacific region \n- Escondido Elementary School classroom assistant Zhejiang University M.A.,  Comparative Education 2009  – 2011 - Academic focus: Education policy effects in the context of US and China  \n- Completed coursework, publications and thesis in Mandarin Chinese \n- Hosted orientations for incoming international students \n- Coordinated logistics 400+ speakers, exhibitors and attendees of an international conference hosted by School of Public Health Zhejiang University M.A.,  Comparative Education 2009  – 2011 - Academic focus: Education policy effects in the context of US and China  \n- Completed coursework, publications and thesis in Mandarin Chinese \n- Hosted orientations for incoming international students \n- Coordinated logistics 400+ speakers, exhibitors and attendees of an international conference hosted by School of Public Health Zhejiang University M.A.,  Comparative Education 2009  – 2011 - Academic focus: Education policy effects in the context of US and China  \n- Completed coursework, publications and thesis in Mandarin Chinese \n- Hosted orientations for incoming international students \n- Coordinated logistics 400+ speakers, exhibitors and attendees of an international conference hosted by School of Public Health ", "Skills Editing Fundraising Newsletters Recruiting Nonprofits Public Speaking Skills  Editing Fundraising Newsletters Recruiting Nonprofits Public Speaking Editing Fundraising Newsletters Recruiting Nonprofits Public Speaking Editing Fundraising Newsletters Recruiting Nonprofits Public Speaking ", "Experience Resident Assistant Stanford University September 2014  – Present (1 year) Palo Alto •Created a positive living environment designed to link community, faculty, and residents  \n•Designed dorm programs to address student needs and promote the social, academic, mental, and  \nemotional well-being of residents  \n•Received certificate for completion of QPR Suicide Prevention Gatekeeper Program  \n•Budgeted and allocated money for dorm-wide activities  \n•Negotiated compromise and cooperation between residents to encourage conflict management Student Worker Stanford Graduate School of Business April 2013  – Present (2 years 5 months) Stanford, CA • Provided event support and coordination, monitored database management, provided customer service, handled office project management, and offered Graduate Career services Intern Centers for Disease Control and Prevention May 2014  –  August 2014  (4 months) Greater Atlanta Area • Evaluated 2014 National Science Olympiad Disease Detectives Competition to pinpoint education gaps in epidemiology for elementary and high school students by skill, content, and question type Intern US Department of Health and Human Services January 2014  –  March 2014  (3 months) Baltimore, Maryland Area •Developed performance measures to track the effectiveness of initiatives implemented under the OAH strategic plan  \n•Advised team members on health issues relevant to adolescents to engage the online community in a Twitter chat  \n•Project: Examined racial, geographic, and educational disparities in current trends in smoking rates among pregnant teens General Medical Disciplines Research Assistant Stanford University School of Medicine October 2013  –  March 2014  (6 months) Stanford, CA •Conducted research examining the role of communication in doctor and patient relationships and expanded literature reviews for future medical research Teachers Aide Stanford University Bing Nursery School October 2012  –  April 2013  (7 months) Stanford, CA •Worked alongside teachers to facilitate classroom discussions, read stories, and coordinate class activities to create an intellectually stimulating and enriched environment for children  \n•Guided children through various studies and activities with Stanford researchers Stanford Student Caller RuffaloCODY February 2012  –  December 2012  (11 months) Stanford, CA •Participated in a team that raised over 2 million dollars for various schools and departments across Stanford University Resident Assistant Stanford University September 2014  – Present (1 year) Palo Alto •Created a positive living environment designed to link community, faculty, and residents  \n•Designed dorm programs to address student needs and promote the social, academic, mental, and  \nemotional well-being of residents  \n•Received certificate for completion of QPR Suicide Prevention Gatekeeper Program  \n•Budgeted and allocated money for dorm-wide activities  \n•Negotiated compromise and cooperation between residents to encourage conflict management Resident Assistant Stanford University September 2014  – Present (1 year) Palo Alto •Created a positive living environment designed to link community, faculty, and residents  \n•Designed dorm programs to address student needs and promote the social, academic, mental, and  \nemotional well-being of residents  \n•Received certificate for completion of QPR Suicide Prevention Gatekeeper Program  \n•Budgeted and allocated money for dorm-wide activities  \n•Negotiated compromise and cooperation between residents to encourage conflict management Student Worker Stanford Graduate School of Business April 2013  – Present (2 years 5 months) Stanford, CA • Provided event support and coordination, monitored database management, provided customer service, handled office project management, and offered Graduate Career services Student Worker Stanford Graduate School of Business April 2013  – Present (2 years 5 months) Stanford, CA • Provided event support and coordination, monitored database management, provided customer service, handled office project management, and offered Graduate Career services Intern Centers for Disease Control and Prevention May 2014  –  August 2014  (4 months) Greater Atlanta Area • Evaluated 2014 National Science Olympiad Disease Detectives Competition to pinpoint education gaps in epidemiology for elementary and high school students by skill, content, and question type Intern Centers for Disease Control and Prevention May 2014  –  August 2014  (4 months) Greater Atlanta Area • Evaluated 2014 National Science Olympiad Disease Detectives Competition to pinpoint education gaps in epidemiology for elementary and high school students by skill, content, and question type Intern US Department of Health and Human Services January 2014  –  March 2014  (3 months) Baltimore, Maryland Area •Developed performance measures to track the effectiveness of initiatives implemented under the OAH strategic plan  \n•Advised team members on health issues relevant to adolescents to engage the online community in a Twitter chat  \n•Project: Examined racial, geographic, and educational disparities in current trends in smoking rates among pregnant teens Intern US Department of Health and Human Services January 2014  –  March 2014  (3 months) Baltimore, Maryland Area •Developed performance measures to track the effectiveness of initiatives implemented under the OAH strategic plan  \n•Advised team members on health issues relevant to adolescents to engage the online community in a Twitter chat  \n•Project: Examined racial, geographic, and educational disparities in current trends in smoking rates among pregnant teens General Medical Disciplines Research Assistant Stanford University School of Medicine October 2013  –  March 2014  (6 months) Stanford, CA •Conducted research examining the role of communication in doctor and patient relationships and expanded literature reviews for future medical research General Medical Disciplines Research Assistant Stanford University School of Medicine October 2013  –  March 2014  (6 months) Stanford, CA •Conducted research examining the role of communication in doctor and patient relationships and expanded literature reviews for future medical research Teachers Aide Stanford University Bing Nursery School October 2012  –  April 2013  (7 months) Stanford, CA •Worked alongside teachers to facilitate classroom discussions, read stories, and coordinate class activities to create an intellectually stimulating and enriched environment for children  \n•Guided children through various studies and activities with Stanford researchers Teachers Aide Stanford University Bing Nursery School October 2012  –  April 2013  (7 months) Stanford, CA •Worked alongside teachers to facilitate classroom discussions, read stories, and coordinate class activities to create an intellectually stimulating and enriched environment for children  \n•Guided children through various studies and activities with Stanford researchers Stanford Student Caller RuffaloCODY February 2012  –  December 2012  (11 months) Stanford, CA •Participated in a team that raised over 2 million dollars for various schools and departments across Stanford University Stanford Student Caller RuffaloCODY February 2012  –  December 2012  (11 months) Stanford, CA •Participated in a team that raised over 2 million dollars for various schools and departments across Stanford University Languages English Spanish English Spanish English Spanish Skills Public Speaking Data Analysis Research Fundraising Community Outreach Skills  Public Speaking Data Analysis Research Fundraising Community Outreach Public Speaking Data Analysis Research Fundraising Community Outreach Public Speaking Data Analysis Research Fundraising Community Outreach Education Stanford University Bachelor's Degree,  Human Biology- Minority Health and Policy in Underserved Communities 2011  – 2015 Morgan Park High School High School 2005  – 2011 Stanford University Bachelor's Degree,  Human Biology- Minority Health and Policy in Underserved Communities 2011  – 2015 Stanford University Bachelor's Degree,  Human Biology- Minority Health and Policy in Underserved Communities 2011  – 2015 Stanford University Bachelor's Degree,  Human Biology- Minority Health and Policy in Underserved Communities 2011  – 2015 Morgan Park High School High School 2005  – 2011 Morgan Park High School High School 2005  – 2011 Morgan Park High School High School 2005  – 2011 ", "Experience Founder Loom January 2015  – Present (8 months) San Francisco Bay Area Founder Loom January 2015  – Present (8 months) San Francisco Bay Area Founder Loom January 2015  – Present (8 months) San Francisco Bay Area Skills Mobile Applications User Experience Entrepreneurship Enterprise Software Enterprise Technology... Venture Capital JavaScript Analytics Java Mobile Internet SQL XPath C++ Discrete Mathematics HTML Start-ups Experimental Design Visual Perception Social Media Marketing HTML + CSS Electrophysiology Matlab See 7+     See less Skills  Mobile Applications User Experience Entrepreneurship Enterprise Software Enterprise Technology... Venture Capital JavaScript Analytics Java Mobile Internet SQL XPath C++ Discrete Mathematics HTML Start-ups Experimental Design Visual Perception Social Media Marketing HTML + CSS Electrophysiology Matlab See 7+     See less Mobile Applications User Experience Entrepreneurship Enterprise Software Enterprise Technology... Venture Capital JavaScript Analytics Java Mobile Internet SQL XPath C++ Discrete Mathematics HTML Start-ups Experimental Design Visual Perception Social Media Marketing HTML + CSS Electrophysiology Matlab See 7+     See less Mobile Applications User Experience Entrepreneurship Enterprise Software Enterprise Technology... Venture Capital JavaScript Analytics Java Mobile Internet SQL XPath C++ Discrete Mathematics HTML Start-ups Experimental Design Visual Perception Social Media Marketing HTML + CSS Electrophysiology Matlab See 7+     See less Education Stanford University BS 2004  – 2008 University of Oxford 2007  – 2007 Stanford University BS 2004  – 2008 Stanford University BS 2004  – 2008 Stanford University BS 2004  – 2008 University of Oxford 2007  – 2007 University of Oxford 2007  – 2007 University of Oxford 2007  – 2007 Honors & Awards ", "Experience Summer Resident Assistant Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Worked with 7 co-workers to build a welcoming community for 220 Stanford and visiting undergraduates. Planned 10 in-house events for groups of 6-12 residents and 3 off-campus excursions for groups of 20-25 residents. \n Resident Assistant Stanford University September 2014  –  June 2015  (10 months) Stanford, CA Collaborated with 8 student staff members to form a strong and healthy residential learning community for 115 undergraduate residents, which complements as well as extends classroom learning. Challenged my comfort zone through interactions with residents of different backgrounds and beliefs. \n Mentor The Phoenix Scholars May 2012  –  June 2015  (3 years 2 months) Stanford, CA Guided first-generation, minority, and/or low-income high school seniors through every facet of the college application process. Set objectives and held weekly meetings to guarantee goals were being met. Refined students’ personal statements and applications prior to submission. Schools mentees now attend: Harvard, UCLA, UC Davis. \n Residential Counselor Stanford Pre-Collegiate Summer Institutes June 2013  –  August 2013  (3 months) Stanford, CA Tutored 200 high school students in the engineering program and provided support to instructional staff. Created an atmosphere that fostered social growth as well as tolerance, cultural sensitivity, and understanding of individual differences. \n Summer Resident Assistant Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Worked with 7 co-workers to build a welcoming community for 220 Stanford and visiting undergraduates. Planned 10 in-house events for groups of 6-12 residents and 3 off-campus excursions for groups of 20-25 residents. \n Summer Resident Assistant Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Worked with 7 co-workers to build a welcoming community for 220 Stanford and visiting undergraduates. Planned 10 in-house events for groups of 6-12 residents and 3 off-campus excursions for groups of 20-25 residents. \n Resident Assistant Stanford University September 2014  –  June 2015  (10 months) Stanford, CA Collaborated with 8 student staff members to form a strong and healthy residential learning community for 115 undergraduate residents, which complements as well as extends classroom learning. Challenged my comfort zone through interactions with residents of different backgrounds and beliefs. \n Resident Assistant Stanford University September 2014  –  June 2015  (10 months) Stanford, CA Collaborated with 8 student staff members to form a strong and healthy residential learning community for 115 undergraduate residents, which complements as well as extends classroom learning. Challenged my comfort zone through interactions with residents of different backgrounds and beliefs. \n Mentor The Phoenix Scholars May 2012  –  June 2015  (3 years 2 months) Stanford, CA Guided first-generation, minority, and/or low-income high school seniors through every facet of the college application process. Set objectives and held weekly meetings to guarantee goals were being met. Refined students’ personal statements and applications prior to submission. Schools mentees now attend: Harvard, UCLA, UC Davis. \n Mentor The Phoenix Scholars May 2012  –  June 2015  (3 years 2 months) Stanford, CA Guided first-generation, minority, and/or low-income high school seniors through every facet of the college application process. Set objectives and held weekly meetings to guarantee goals were being met. Refined students’ personal statements and applications prior to submission. Schools mentees now attend: Harvard, UCLA, UC Davis. \n Residential Counselor Stanford Pre-Collegiate Summer Institutes June 2013  –  August 2013  (3 months) Stanford, CA Tutored 200 high school students in the engineering program and provided support to instructional staff. Created an atmosphere that fostered social growth as well as tolerance, cultural sensitivity, and understanding of individual differences. \n Residential Counselor Stanford Pre-Collegiate Summer Institutes June 2013  –  August 2013  (3 months) Stanford, CA Tutored 200 high school students in the engineering program and provided support to instructional staff. Created an atmosphere that fostered social growth as well as tolerance, cultural sensitivity, and understanding of individual differences. \n Languages English Native or bilingual proficiency Spanish Limited working proficiency Tagalog Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Tagalog Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Tagalog Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Leadership Youth Mentoring Machining Matlab SolidWorks Peer Mentoring Lathe Milling Project Management Customer Service Management Microsoft Office Microsoft Excel Microsoft Word PowerPoint Skills  Leadership Youth Mentoring Machining Matlab SolidWorks Peer Mentoring Lathe Milling Project Management Customer Service Management Microsoft Office Microsoft Excel Microsoft Word PowerPoint Leadership Youth Mentoring Machining Matlab SolidWorks Peer Mentoring Lathe Milling Project Management Customer Service Management Microsoft Office Microsoft Excel Microsoft Word PowerPoint Leadership Youth Mentoring Machining Matlab SolidWorks Peer Mentoring Lathe Milling Project Management Customer Service Management Microsoft Office Microsoft Excel Microsoft Word PowerPoint Education Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Women's Club Volleyball ,  Residential Education ,  The Phoenix Scholars ,  Black Student Union Flintridge Sacred Heart Academy High School 2007  – 2011 Activities and Societies:  Senior Class President ,  Kairos Retreat Leader ,  Ambassadors Club ,  Amnesty International ,  California Scholarship Federation ,  National Honors Society ,  Mu Alpha Theta Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Women's Club Volleyball ,  Residential Education ,  The Phoenix Scholars ,  Black Student Union Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Women's Club Volleyball ,  Residential Education ,  The Phoenix Scholars ,  Black Student Union Stanford University Bachelor of Science (B.S.),  Mechanical Engineering 2011  – 2015 Activities and Societies:  Women's Club Volleyball ,  Residential Education ,  The Phoenix Scholars ,  Black Student Union Flintridge Sacred Heart Academy High School 2007  – 2011 Activities and Societies:  Senior Class President ,  Kairos Retreat Leader ,  Ambassadors Club ,  Amnesty International ,  California Scholarship Federation ,  National Honors Society ,  Mu Alpha Theta Flintridge Sacred Heart Academy High School 2007  – 2011 Activities and Societies:  Senior Class President ,  Kairos Retreat Leader ,  Ambassadors Club ,  Amnesty International ,  California Scholarship Federation ,  National Honors Society ,  Mu Alpha Theta Flintridge Sacred Heart Academy High School 2007  – 2011 Activities and Societies:  Senior Class President ,  Kairos Retreat Leader ,  Ambassadors Club ,  Amnesty International ,  California Scholarship Federation ,  National Honors Society ,  Mu Alpha Theta Honors & Awards ", "Experience Workday Consultant CPSG Partners July 2014  – Present (1 year 2 months) Workday Consultant CPSG Partners July 2014  – Present (1 year 2 months) Workday Consultant CPSG Partners July 2014  – Present (1 year 2 months) Skills Program Development Research Training Spanish Workshop Facilitation Budgets Non-profits Nonprofits Program Management Higher Education Community Outreach Public Speaking Conflict Resolution Project Management Data Analysis Skills  Program Development Research Training Spanish Workshop Facilitation Budgets Non-profits Nonprofits Program Management Higher Education Community Outreach Public Speaking Conflict Resolution Project Management Data Analysis Program Development Research Training Spanish Workshop Facilitation Budgets Non-profits Nonprofits Program Management Higher Education Community Outreach Public Speaking Conflict Resolution Project Management Data Analysis Program Development Research Training Spanish Workshop Facilitation Budgets Non-profits Nonprofits Program Management Higher Education Community Outreach Public Speaking Conflict Resolution Project Management Data Analysis Education Stanford University BS 2005  – 2010 Stanford University BS 2005  – 2010 Stanford University BS 2005  – 2010 Stanford University BS 2005  – 2010 "]}