{"position": "Scientist", "company": "Stanford University", "profiles": ["Experience Staff Scientist Stanford University School of Medicine 2004  – Present (11 years) Developing advanced microscopes for non-invasive multispectral 3-D imaging of cells in living subjects to further the understanding of cancer biology. Staff Scientist Stanford University School of Medicine 2004  – Present (11 years) Developing advanced microscopes for non-invasive multispectral 3-D imaging of cells in living subjects to further the understanding of cancer biology. Staff Scientist Stanford University School of Medicine 2004  – Present (11 years) Developing advanced microscopes for non-invasive multispectral 3-D imaging of cells in living subjects to further the understanding of cancer biology. Skills Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Skills  Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Education Stanford University PhD,  Applied Physics 1980  – 1987 UCSC BA,  Physics 1977  – 1980 Stanford University PhD,  Applied Physics 1980  – 1987 Stanford University PhD,  Applied Physics 1980  – 1987 Stanford University PhD,  Applied Physics 1980  – 1987 UCSC BA,  Physics 1977  – 1980 UCSC BA,  Physics 1977  – 1980 UCSC BA,  Physics 1977  – 1980 ", "Experience Senior Scientist Stanford University January 2014  – Present (1 year 8 months) Research Scientist Stanford University February 2010  –  December 2013  (3 years 11 months) Postdoctoral Fellow Stanford University February 2004  –  January 2010  (6 years) Senior Scientist Stanford University January 2014  – Present (1 year 8 months) Senior Scientist Stanford University January 2014  – Present (1 year 8 months) Research Scientist Stanford University February 2010  –  December 2013  (3 years 11 months) Research Scientist Stanford University February 2010  –  December 2013  (3 years 11 months) Postdoctoral Fellow Stanford University February 2004  –  January 2010  (6 years) Postdoctoral Fellow Stanford University February 2004  –  January 2010  (6 years) Skills Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Skills  Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Education Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 ", "Summary It's all about the thrill of the chase, but also coupled with an important impact on eventual diagnosis/treatment of narcolepsy and Kleine Levin syndromes. I am happy collaborating or taking lead in important research projects. My work has been cited in nearly 2000 peer-reviewed publications as of 2011. My background is incredibly diverse, and I thrive on exploring new ventures. Summary It's all about the thrill of the chase, but also coupled with an important impact on eventual diagnosis/treatment of narcolepsy and Kleine Levin syndromes. I am happy collaborating or taking lead in important research projects. My work has been cited in nearly 2000 peer-reviewed publications as of 2011. My background is incredibly diverse, and I thrive on exploring new ventures. It's all about the thrill of the chase, but also coupled with an important impact on eventual diagnosis/treatment of narcolepsy and Kleine Levin syndromes. I am happy collaborating or taking lead in important research projects. My work has been cited in nearly 2000 peer-reviewed publications as of 2011. My background is incredibly diverse, and I thrive on exploring new ventures. It's all about the thrill of the chase, but also coupled with an important impact on eventual diagnosis/treatment of narcolepsy and Kleine Levin syndromes. I am happy collaborating or taking lead in important research projects. My work has been cited in nearly 2000 peer-reviewed publications as of 2011. My background is incredibly diverse, and I thrive on exploring new ventures. Experience Senior Research Scientist Stanford University School of Medicine January 2005  – Present (10 years 8 months) Senior Reserach Scientist Stanford University 2005  – Present (10 years) Genome Wide association studies for loci involved in Narcolepsy and Kleine Levin Syndrome disease susceptibility, and sleep traits. Including data prep/curation, imputation, statistical analysis. Platforms: Affymetrix 500K set, Affy 6.0, Illumina ImmunoChip. \n \nHeavy participation in preparation of manuscripts and grant submissions from our lab. Notable expertise in scientific writing. \n \nGeneral Expert-Doc-Friday help when a good brain and very little direction are required in a hurry. Post Doctoral Fellow/ Research Associate Stanford Center for Narcolepsy January 1996  –  2005  (9 years) Palo Alto California In my initial postdoc project, I used a novel genome-jumping strategy based on conserved synteny to identify new BAC clone seeds to cover the emerging critical region in canine narcolepsy. Methods included pre-genome era bioinformatics to identify human clones for use in cross species hybridization of a canine genome library. This was followed by cytogenetic analysis to determine whether the identified clones were in the critical region, as well is interphase FISH to determine relative position. BAC clones were then turned into plasmid libraries to develop genetic markers for linkage/finemapping, chromosome walking to extend and merge contigs, and serve as sources for other potential human-canine seed development.  \n \nSecond Post doc project focused on mutational analysis of hypocretin related genes in typical/ sporadic and unusual cases of narcolepsy which would more likely harbor mutations. Identified the only hypocretin mutation known, causing onset at 6 months. Functional analysis of identified mutation, showing abnormal trafficking/ impact on cells.  \n \nFollowing these, I participated in the development of our zebrafish research projects, primarily focusing on identification, cloning and expression characterization of known sleep-related genes in the zebrafish. Creation of transgenic GFP fish lines. Promoter analysis of zebrafish hypocretin gene. Graduate Student Dept. Genetics Stanford University/ Francke laboratory 1990  –  1996  (6 years) Thesis research in human genetics focused on extracellular matrix abnormalities and the Marfan Syndrome. Additional studies screening candidate genes for familial hypogonadotropic hypogonadism. Research associate California Biotechnology 1986  –  1988  (2 years) Early RFLP genetic marker development focused on candidate cardiovascular disease and osteoporosis loci. Bone formation model work in rodents. Senior Research Scientist Stanford University School of Medicine January 2005  – Present (10 years 8 months) Senior Research Scientist Stanford University School of Medicine January 2005  – Present (10 years 8 months) Senior Reserach Scientist Stanford University 2005  – Present (10 years) Genome Wide association studies for loci involved in Narcolepsy and Kleine Levin Syndrome disease susceptibility, and sleep traits. Including data prep/curation, imputation, statistical analysis. Platforms: Affymetrix 500K set, Affy 6.0, Illumina ImmunoChip. \n \nHeavy participation in preparation of manuscripts and grant submissions from our lab. Notable expertise in scientific writing. \n \nGeneral Expert-Doc-Friday help when a good brain and very little direction are required in a hurry. Senior Reserach Scientist Stanford University 2005  – Present (10 years) Genome Wide association studies for loci involved in Narcolepsy and Kleine Levin Syndrome disease susceptibility, and sleep traits. Including data prep/curation, imputation, statistical analysis. Platforms: Affymetrix 500K set, Affy 6.0, Illumina ImmunoChip. \n \nHeavy participation in preparation of manuscripts and grant submissions from our lab. Notable expertise in scientific writing. \n \nGeneral Expert-Doc-Friday help when a good brain and very little direction are required in a hurry. Post Doctoral Fellow/ Research Associate Stanford Center for Narcolepsy January 1996  –  2005  (9 years) Palo Alto California In my initial postdoc project, I used a novel genome-jumping strategy based on conserved synteny to identify new BAC clone seeds to cover the emerging critical region in canine narcolepsy. Methods included pre-genome era bioinformatics to identify human clones for use in cross species hybridization of a canine genome library. This was followed by cytogenetic analysis to determine whether the identified clones were in the critical region, as well is interphase FISH to determine relative position. BAC clones were then turned into plasmid libraries to develop genetic markers for linkage/finemapping, chromosome walking to extend and merge contigs, and serve as sources for other potential human-canine seed development.  \n \nSecond Post doc project focused on mutational analysis of hypocretin related genes in typical/ sporadic and unusual cases of narcolepsy which would more likely harbor mutations. Identified the only hypocretin mutation known, causing onset at 6 months. Functional analysis of identified mutation, showing abnormal trafficking/ impact on cells.  \n \nFollowing these, I participated in the development of our zebrafish research projects, primarily focusing on identification, cloning and expression characterization of known sleep-related genes in the zebrafish. Creation of transgenic GFP fish lines. Promoter analysis of zebrafish hypocretin gene. Post Doctoral Fellow/ Research Associate Stanford Center for Narcolepsy January 1996  –  2005  (9 years) Palo Alto California In my initial postdoc project, I used a novel genome-jumping strategy based on conserved synteny to identify new BAC clone seeds to cover the emerging critical region in canine narcolepsy. Methods included pre-genome era bioinformatics to identify human clones for use in cross species hybridization of a canine genome library. This was followed by cytogenetic analysis to determine whether the identified clones were in the critical region, as well is interphase FISH to determine relative position. BAC clones were then turned into plasmid libraries to develop genetic markers for linkage/finemapping, chromosome walking to extend and merge contigs, and serve as sources for other potential human-canine seed development.  \n \nSecond Post doc project focused on mutational analysis of hypocretin related genes in typical/ sporadic and unusual cases of narcolepsy which would more likely harbor mutations. Identified the only hypocretin mutation known, causing onset at 6 months. Functional analysis of identified mutation, showing abnormal trafficking/ impact on cells.  \n \nFollowing these, I participated in the development of our zebrafish research projects, primarily focusing on identification, cloning and expression characterization of known sleep-related genes in the zebrafish. Creation of transgenic GFP fish lines. Promoter analysis of zebrafish hypocretin gene. Graduate Student Dept. Genetics Stanford University/ Francke laboratory 1990  –  1996  (6 years) Thesis research in human genetics focused on extracellular matrix abnormalities and the Marfan Syndrome. Additional studies screening candidate genes for familial hypogonadotropic hypogonadism. Graduate Student Dept. Genetics Stanford University/ Francke laboratory 1990  –  1996  (6 years) Thesis research in human genetics focused on extracellular matrix abnormalities and the Marfan Syndrome. Additional studies screening candidate genes for familial hypogonadotropic hypogonadism. Research associate California Biotechnology 1986  –  1988  (2 years) Early RFLP genetic marker development focused on candidate cardiovascular disease and osteoporosis loci. Bone formation model work in rodents. Research associate California Biotechnology 1986  –  1988  (2 years) Early RFLP genetic marker development focused on candidate cardiovascular disease and osteoporosis loci. Bone formation model work in rodents. Skills Genetics of Sleep... Molecular genetics Early music... Statistical Genetics cross-species... Sleep Disorders Skills  Genetics of Sleep... Molecular genetics Early music... Statistical Genetics cross-species... Sleep Disorders Genetics of Sleep... Molecular genetics Early music... Statistical Genetics cross-species... Sleep Disorders Genetics of Sleep... Molecular genetics Early music... Statistical Genetics cross-species... Sleep Disorders Education Stanford University School of Medicine PhD,  Genetics 1990  – 1996 University of California, Berkeley BA,  Molecular Biology 1981  – 1986 Stanford University School of Medicine PhD,  Genetics 1990  – 1996 Stanford University School of Medicine PhD,  Genetics 1990  – 1996 Stanford University School of Medicine PhD,  Genetics 1990  – 1996 University of California, Berkeley BA,  Molecular Biology 1981  – 1986 University of California, Berkeley BA,  Molecular Biology 1981  – 1986 University of California, Berkeley BA,  Molecular Biology 1981  – 1986 Honors & Awards Additional Honors & Awards Researcher of the Year, 2010 Narcolepsy Network Additional Honors & Awards Researcher of the Year, 2010 Narcolepsy Network Additional Honors & Awards Researcher of the Year, 2010 Narcolepsy Network Additional Honors & Awards Researcher of the Year, 2010 Narcolepsy Network ", "Summary Innovator in technologies that extend human intelligence, individually and collectively. Co-founder, CTO, and VP Design for Siri, which created the Virtual Personal Assistant on iPhone. Co-founder and CTO of RealTravel.com, where the world of travelers share their advice and experiences. Co-founder and CTO of Intraspect Software, a leader in collaboration and knowledge management solutions for the enterprise. Research scientist at the Stanford University Knowledge Systems Laboratory, where he was known for work in ontology and intelligent human-computer interaction. Specialties:Entrepreneur, CTO, product strategist, experience designer. Experience in designing products and building companies in consumer and enterprise that combine high tech software and innovative user experience. Known for published research in Artificial Intelligence, Ontology Engineering, and Human-Computer Interaction. Special expertise in collective intelligence, collaborative knowledge management, ontology design, and user adoption of innovative services. Summary Innovator in technologies that extend human intelligence, individually and collectively. Co-founder, CTO, and VP Design for Siri, which created the Virtual Personal Assistant on iPhone. Co-founder and CTO of RealTravel.com, where the world of travelers share their advice and experiences. Co-founder and CTO of Intraspect Software, a leader in collaboration and knowledge management solutions for the enterprise. Research scientist at the Stanford University Knowledge Systems Laboratory, where he was known for work in ontology and intelligent human-computer interaction. Specialties:Entrepreneur, CTO, product strategist, experience designer. Experience in designing products and building companies in consumer and enterprise that combine high tech software and innovative user experience. Known for published research in Artificial Intelligence, Ontology Engineering, and Human-Computer Interaction. Special expertise in collective intelligence, collaborative knowledge management, ontology design, and user adoption of innovative services. Innovator in technologies that extend human intelligence, individually and collectively. Co-founder, CTO, and VP Design for Siri, which created the Virtual Personal Assistant on iPhone. Co-founder and CTO of RealTravel.com, where the world of travelers share their advice and experiences. Co-founder and CTO of Intraspect Software, a leader in collaboration and knowledge management solutions for the enterprise. Research scientist at the Stanford University Knowledge Systems Laboratory, where he was known for work in ontology and intelligent human-computer interaction. Specialties:Entrepreneur, CTO, product strategist, experience designer. Experience in designing products and building companies in consumer and enterprise that combine high tech software and innovative user experience. Known for published research in Artificial Intelligence, Ontology Engineering, and Human-Computer Interaction. Special expertise in collective intelligence, collaborative knowledge management, ontology design, and user adoption of innovative services. Innovator in technologies that extend human intelligence, individually and collectively. Co-founder, CTO, and VP Design for Siri, which created the Virtual Personal Assistant on iPhone. Co-founder and CTO of RealTravel.com, where the world of travelers share their advice and experiences. Co-founder and CTO of Intraspect Software, a leader in collaboration and knowledge management solutions for the enterprise. Research scientist at the Stanford University Knowledge Systems Laboratory, where he was known for work in ontology and intelligent human-computer interaction. Specialties:Entrepreneur, CTO, product strategist, experience designer. Experience in designing products and building companies in consumer and enterprise that combine high tech software and innovative user experience. Known for published research in Artificial Intelligence, Ontology Engineering, and Human-Computer Interaction. Special expertise in collective intelligence, collaborative knowledge management, ontology design, and user adoption of innovative services. Skills Distributed Systems Product Management Cloud Computing Scalability Strategy SaaS Information Architecture User Experience Entrepreneurship Start-ups Agile Methodologies Innovation Semantic Web Skills  Distributed Systems Product Management Cloud Computing Scalability Strategy SaaS Information Architecture User Experience Entrepreneurship Start-ups Agile Methodologies Innovation Semantic Web Distributed Systems Product Management Cloud Computing Scalability Strategy SaaS Information Architecture User Experience Entrepreneurship Start-ups Agile Methodologies Innovation Semantic Web Distributed Systems Product Management Cloud Computing Scalability Strategy SaaS Information Architecture User Experience Entrepreneurship Start-ups Agile Methodologies Innovation Semantic Web Honors & Awards ", "Experience Senior Research Scientist Stanford University School of Medicine Senior Scientist Stanford University 2008  – Present (7 years) Postdoctoral Researcher Lawrence Berkeley National Laboratory 1999  –  2005  (6 years) Senior Research Scientist Stanford University School of Medicine Senior Research Scientist Stanford University School of Medicine Senior Scientist Stanford University 2008  – Present (7 years) Senior Scientist Stanford University 2008  – Present (7 years) Postdoctoral Researcher Lawrence Berkeley National Laboratory 1999  –  2005  (6 years) Postdoctoral Researcher Lawrence Berkeley National Laboratory 1999  –  2005  (6 years) Skills Cell Biology Molecular Biology Cell Culture Western Blotting Biochemistry epigenetics Cell Epigenetics Protein Purification Protein Expression Flow Cytometry Skills  Cell Biology Molecular Biology Cell Culture Western Blotting Biochemistry epigenetics Cell Epigenetics Protein Purification Protein Expression Flow Cytometry Cell Biology Molecular Biology Cell Culture Western Blotting Biochemistry epigenetics Cell Epigenetics Protein Purification Protein Expression Flow Cytometry Cell Biology Molecular Biology Cell Culture Western Blotting Biochemistry epigenetics Cell Epigenetics Protein Purification Protein Expression Flow Cytometry ", "Experience Senior Research Scientist Stanford University 2012  – Present (3 years) Stanford University Medical School \"Comparative\" ChIP-Seq to determine transcription factor binding site profiles in yeast strains isolated from different environments; laboratory of Dr. Michael Snyder, Dept of Genetics Senior Research Scientist Stanford University January 1997  – Present (18 years 8 months) Research on genomics and evolution of industrial yeasts (wine, beer, bio-fuel) in laboratory of Dr. Gavin Sherlock, Dept of Genetics (since 2004); and in laboratories of Dr. David Botstein and Dr. Pat Brown (1997-2004). Scientific Curator Saccharomyces Genome Database February 1995  –  December 1996  (1 year 11 months) Stanford University Medical School Scientist II GenPharm International, Inc January 1993  –  January 1995  (2 years 1 month) Developing techniques to recombine Yeast Artificial Chromosomes (using yeast cell mating) to create very large artificial chromosomes carrying human genome regions. Post-doctoral Fellow Stanford University Medical Center October 1990  –  January 1993  (2 years 4 months) Post-doctoral Fellow in laboratory of Dr. David Botstein, Dept of Genetics Post-doctoral Fellow Memorial Sloan-Kettering Cancer Center January 1989  –  October 1990  (1 year 10 months) Post-doctoral fellow in laboratory of Dr. Mary Ann Osley, Dept. of Molecular Biology Senior Research Scientist Stanford University 2012  – Present (3 years) Stanford University Medical School \"Comparative\" ChIP-Seq to determine transcription factor binding site profiles in yeast strains isolated from different environments; laboratory of Dr. Michael Snyder, Dept of Genetics Senior Research Scientist Stanford University 2012  – Present (3 years) Stanford University Medical School \"Comparative\" ChIP-Seq to determine transcription factor binding site profiles in yeast strains isolated from different environments; laboratory of Dr. Michael Snyder, Dept of Genetics Senior Research Scientist Stanford University January 1997  – Present (18 years 8 months) Research on genomics and evolution of industrial yeasts (wine, beer, bio-fuel) in laboratory of Dr. Gavin Sherlock, Dept of Genetics (since 2004); and in laboratories of Dr. David Botstein and Dr. Pat Brown (1997-2004). Senior Research Scientist Stanford University January 1997  – Present (18 years 8 months) Research on genomics and evolution of industrial yeasts (wine, beer, bio-fuel) in laboratory of Dr. Gavin Sherlock, Dept of Genetics (since 2004); and in laboratories of Dr. David Botstein and Dr. Pat Brown (1997-2004). Scientific Curator Saccharomyces Genome Database February 1995  –  December 1996  (1 year 11 months) Stanford University Medical School Scientific Curator Saccharomyces Genome Database February 1995  –  December 1996  (1 year 11 months) Stanford University Medical School Scientist II GenPharm International, Inc January 1993  –  January 1995  (2 years 1 month) Developing techniques to recombine Yeast Artificial Chromosomes (using yeast cell mating) to create very large artificial chromosomes carrying human genome regions. Scientist II GenPharm International, Inc January 1993  –  January 1995  (2 years 1 month) Developing techniques to recombine Yeast Artificial Chromosomes (using yeast cell mating) to create very large artificial chromosomes carrying human genome regions. Post-doctoral Fellow Stanford University Medical Center October 1990  –  January 1993  (2 years 4 months) Post-doctoral Fellow in laboratory of Dr. David Botstein, Dept of Genetics Post-doctoral Fellow Stanford University Medical Center October 1990  –  January 1993  (2 years 4 months) Post-doctoral Fellow in laboratory of Dr. David Botstein, Dept of Genetics Post-doctoral Fellow Memorial Sloan-Kettering Cancer Center January 1989  –  October 1990  (1 year 10 months) Post-doctoral fellow in laboratory of Dr. Mary Ann Osley, Dept. of Molecular Biology Post-doctoral Fellow Memorial Sloan-Kettering Cancer Center January 1989  –  October 1990  (1 year 10 months) Post-doctoral fellow in laboratory of Dr. Mary Ann Osley, Dept. of Molecular Biology Skills Molecular Biology Genomics Genetics Cell Biology Biochemistry Bioinformatics PCR Microscopy Lifesciences Sequencing Computational Biology Science Cell Cell Culture Yeast Signal Transduction See 1+     See less Skills  Molecular Biology Genomics Genetics Cell Biology Biochemistry Bioinformatics PCR Microscopy Lifesciences Sequencing Computational Biology Science Cell Cell Culture Yeast Signal Transduction See 1+     See less Molecular Biology Genomics Genetics Cell Biology Biochemistry Bioinformatics PCR Microscopy Lifesciences Sequencing Computational Biology Science Cell Cell Culture Yeast Signal Transduction See 1+     See less Molecular Biology Genomics Genetics Cell Biology Biochemistry Bioinformatics PCR Microscopy Lifesciences Sequencing Computational Biology Science Cell Cell Culture Yeast Signal Transduction See 1+     See less Education Harvard University Ph.D.,  Molecular Biology/Biochemistry 1981  – 1988 University of California, Berkeley A.B.,  Botany 1973  – 1978 Harvard University Ph.D.,  Molecular Biology/Biochemistry 1981  – 1988 Harvard University Ph.D.,  Molecular Biology/Biochemistry 1981  – 1988 Harvard University Ph.D.,  Molecular Biology/Biochemistry 1981  – 1988 University of California, Berkeley A.B.,  Botany 1973  – 1978 University of California, Berkeley A.B.,  Botany 1973  – 1978 University of California, Berkeley A.B.,  Botany 1973  – 1978 ", "Summary Stephen Richardson is a research scientist in Stanford's Electrical Engineering department. He has authored or co-authored several papers and patents, mostly dealing with various aspects of computer architecture. Among other industry and research positions, Dr. Richardson was a co-founder of Micro Magic, Inc. and later became acting head of a computer hardware research group in HP Labs. Summary Stephen Richardson is a research scientist in Stanford's Electrical Engineering department. He has authored or co-authored several papers and patents, mostly dealing with various aspects of computer architecture. Among other industry and research positions, Dr. Richardson was a co-founder of Micro Magic, Inc. and later became acting head of a computer hardware research group in HP Labs. Stephen Richardson is a research scientist in Stanford's Electrical Engineering department. He has authored or co-authored several papers and patents, mostly dealing with various aspects of computer architecture. Among other industry and research positions, Dr. Richardson was a co-founder of Micro Magic, Inc. and later became acting head of a computer hardware research group in HP Labs. Stephen Richardson is a research scientist in Stanford's Electrical Engineering department. He has authored or co-authored several papers and patents, mostly dealing with various aspects of computer architecture. Among other industry and research positions, Dr. Richardson was a co-founder of Micro Magic, Inc. and later became acting head of a computer hardware research group in HP Labs. Languages French French French Skills Computer Architecture Algorithms C Research Simulations Software Engineering Computer Hardware Electrical Engineering Perl Verilog Matlab Python High Performance... Computer Science C++ Distributed Systems Signal Processing Teaching Parallel Computing See 4+     See less Skills  Computer Architecture Algorithms C Research Simulations Software Engineering Computer Hardware Electrical Engineering Perl Verilog Matlab Python High Performance... Computer Science C++ Distributed Systems Signal Processing Teaching Parallel Computing See 4+     See less Computer Architecture Algorithms C Research Simulations Software Engineering Computer Hardware Electrical Engineering Perl Verilog Matlab Python High Performance... Computer Science C++ Distributed Systems Signal Processing Teaching Parallel Computing See 4+     See less Computer Architecture Algorithms C Research Simulations Software Engineering Computer Hardware Electrical Engineering Perl Verilog Matlab Python High Performance... Computer Science C++ Distributed Systems Signal Processing Teaching Parallel Computing See 4+     See less ", "Languages   Skills qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less Skills  qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less Honors & Awards Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 ", "Summary Hands-on expertise in in-vivo and in-vitro pharmacology, toxicology and molecular biology of painkillers with multiple approaches in acute, chronic pain and inflammatory models. Develop new pain model, pain behavorial testing and animal surgery. Great experience of consulting service in development and evaluation of new compounts. Specialties:Pain and inflammatory models, pain behavorial assay, animal surgery, drug administration, Inflammatory mediators including cytokines, statistical analysis. Summary Hands-on expertise in in-vivo and in-vitro pharmacology, toxicology and molecular biology of painkillers with multiple approaches in acute, chronic pain and inflammatory models. Develop new pain model, pain behavorial testing and animal surgery. Great experience of consulting service in development and evaluation of new compounts. Specialties:Pain and inflammatory models, pain behavorial assay, animal surgery, drug administration, Inflammatory mediators including cytokines, statistical analysis. Hands-on expertise in in-vivo and in-vitro pharmacology, toxicology and molecular biology of painkillers with multiple approaches in acute, chronic pain and inflammatory models. Develop new pain model, pain behavorial testing and animal surgery. Great experience of consulting service in development and evaluation of new compounts. Specialties:Pain and inflammatory models, pain behavorial assay, animal surgery, drug administration, Inflammatory mediators including cytokines, statistical analysis. Hands-on expertise in in-vivo and in-vitro pharmacology, toxicology and molecular biology of painkillers with multiple approaches in acute, chronic pain and inflammatory models. Develop new pain model, pain behavorial testing and animal surgery. Great experience of consulting service in development and evaluation of new compounts. Specialties:Pain and inflammatory models, pain behavorial assay, animal surgery, drug administration, Inflammatory mediators including cytokines, statistical analysis. Experience Sr. Scientist Stanford University July 2010  – Present (5 years 2 months) Lead projects related to inflammatory pain, surgical pain and opioid tolerance in pain status.  \nConduct evaluation of new compound in animal model. Scientist Stanford University July 2008  –  June 2010  (2 years) 1. Lead pain projects \n2. Pain sensitivity assessment \n3. Development of new pain model and testing method \n4. Training new team member. Scientist Anesiva Inc August 2006  –  June 2008  (1 year 11 months) Pain models and pharmacology: \nDeveloped research projects and set up pain study Lab. \nEstablished acute and chronic pain models relevant to disease. \nResponsible for all in vivo related activities including team building and training. \nEvaluated and screened drug candidate efficacy by multiple animal behavioural measurements. \nPain related nervous biomarker development: \nSet up Immunohistology Lab and Molecular Biology Lab. \nDeveloped and executed the project to analyze the nervous markers by immunohistochemistry and Western blot. \nToxicology: \nScreened the local skin stimulation of drug candidates. \nReview papers for scientific journals. Research Associate Stanford University February 2002  –  July 2006  (4 years 6 months) Developement of pain models and evaluation of analgesic efficacy with multiple behavorial approaches. \n \nIdtentification of molecular targets related to pain, tolerance and addiction from different mouse strains. \n \nSignal transduction in pain processing. \n \nPublished 12 peer reviewd papers in international scientific journals. \nReview papers for scientific journals. Sr. Scientist Stanford University July 2010  – Present (5 years 2 months) Lead projects related to inflammatory pain, surgical pain and opioid tolerance in pain status.  \nConduct evaluation of new compound in animal model. Sr. Scientist Stanford University July 2010  – Present (5 years 2 months) Lead projects related to inflammatory pain, surgical pain and opioid tolerance in pain status.  \nConduct evaluation of new compound in animal model. Scientist Stanford University July 2008  –  June 2010  (2 years) 1. Lead pain projects \n2. Pain sensitivity assessment \n3. Development of new pain model and testing method \n4. Training new team member. Scientist Stanford University July 2008  –  June 2010  (2 years) 1. Lead pain projects \n2. Pain sensitivity assessment \n3. Development of new pain model and testing method \n4. Training new team member. Scientist Anesiva Inc August 2006  –  June 2008  (1 year 11 months) Pain models and pharmacology: \nDeveloped research projects and set up pain study Lab. \nEstablished acute and chronic pain models relevant to disease. \nResponsible for all in vivo related activities including team building and training. \nEvaluated and screened drug candidate efficacy by multiple animal behavioural measurements. \nPain related nervous biomarker development: \nSet up Immunohistology Lab and Molecular Biology Lab. \nDeveloped and executed the project to analyze the nervous markers by immunohistochemistry and Western blot. \nToxicology: \nScreened the local skin stimulation of drug candidates. \nReview papers for scientific journals. Scientist Anesiva Inc August 2006  –  June 2008  (1 year 11 months) Pain models and pharmacology: \nDeveloped research projects and set up pain study Lab. \nEstablished acute and chronic pain models relevant to disease. \nResponsible for all in vivo related activities including team building and training. \nEvaluated and screened drug candidate efficacy by multiple animal behavioural measurements. \nPain related nervous biomarker development: \nSet up Immunohistology Lab and Molecular Biology Lab. \nDeveloped and executed the project to analyze the nervous markers by immunohistochemistry and Western blot. \nToxicology: \nScreened the local skin stimulation of drug candidates. \nReview papers for scientific journals. Research Associate Stanford University February 2002  –  July 2006  (4 years 6 months) Developement of pain models and evaluation of analgesic efficacy with multiple behavorial approaches. \n \nIdtentification of molecular targets related to pain, tolerance and addiction from different mouse strains. \n \nSignal transduction in pain processing. \n \nPublished 12 peer reviewd papers in international scientific journals. \nReview papers for scientific journals. Research Associate Stanford University February 2002  –  July 2006  (4 years 6 months) Developement of pain models and evaluation of analgesic efficacy with multiple behavorial approaches. \n \nIdtentification of molecular targets related to pain, tolerance and addiction from different mouse strains. \n \nSignal transduction in pain processing. \n \nPublished 12 peer reviewd papers in international scientific journals. \nReview papers for scientific journals. Education China Academy of Traditional Chinese Medicine Science Ph. D.,  Neurobiology 1996  – 1999 China Academy of Traditional Chinese Medicine Science Ph. D.,  Neurobiology 1996  – 1999 China Academy of Traditional Chinese Medicine Science Ph. D.,  Neurobiology 1996  – 1999 China Academy of Traditional Chinese Medicine Science Ph. D.,  Neurobiology 1996  – 1999 Honors & Awards Additional Honors & Awards Anesthesia Department Research Award, Stanford University School of Medicine, 2010 \nAnesthesia Department Research Award, Stanford University School of Medicine, 2004.  \nAward of Excellent Thesis, Chinese Journal of Pain Medicine, 2002 Additional Honors & Awards Anesthesia Department Research Award, Stanford University School of Medicine, 2010 \nAnesthesia Department Research Award, Stanford University School of Medicine, 2004.  \nAward of Excellent Thesis, Chinese Journal of Pain Medicine, 2002 Additional Honors & Awards Anesthesia Department Research Award, Stanford University School of Medicine, 2010 \nAnesthesia Department Research Award, Stanford University School of Medicine, 2004.  \nAward of Excellent Thesis, Chinese Journal of Pain Medicine, 2002 Additional Honors & Awards Anesthesia Department Research Award, Stanford University School of Medicine, 2010 \nAnesthesia Department Research Award, Stanford University School of Medicine, 2004.  \nAward of Excellent Thesis, Chinese Journal of Pain Medicine, 2002 ", "Summary Multidisciplinary scientist with expertise in all aspects of radiotracer development, including radiochemistry, in vitro evaluation, small animal imaging and regulatory requirements for clinical translation. Summary Multidisciplinary scientist with expertise in all aspects of radiotracer development, including radiochemistry, in vitro evaluation, small animal imaging and regulatory requirements for clinical translation. Multidisciplinary scientist with expertise in all aspects of radiotracer development, including radiochemistry, in vitro evaluation, small animal imaging and regulatory requirements for clinical translation. Multidisciplinary scientist with expertise in all aspects of radiotracer development, including radiochemistry, in vitro evaluation, small animal imaging and regulatory requirements for clinical translation. Experience Staff Research Scientist Stanford University April 2014  – Present (1 year 5 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nSynthesis and in vitro / in vivo evaluation of radiotracers for applications in oncology, neurology and immunology with focus on tumor apoptosis and multiple sclerosis imaging. \nEstablishment of 15O-water synthesis and IND application for clinical PET/MRI applications. \nProject lead of multiple academic / industrial collaborations. Research Scientist Stanford University September 2011  –  March 2014  (2 years 7 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nDesigned, synthesized, and evaluated novel radiotracers for applications in oncology and neurology with focus on tumor apoptosis and pain imaging. \nDirected substantial industrial collaboration contract in the areas of tumor apoptosis imaging and biomarker discovery. \nMentored several medical and undergraduate students by designing and overseeing their individual molecular imaging-focused research projects. Taught and trained them in various laboratory techniques and data interpretation. \nLecturer for Bioengineering course E222 for graduate students in the Medical School and from Bioengineering and Engineering. Designed and taught lecture entitled “Radiolabeled peptides and proteins – valuable tools for molecular imaging”. Postdoctoral Research Scholar Stanford University April 2009  –  August 2011  (2 years 5 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nDesigned, synthesized, and evaluated novel radiotracers for tumor metabolism and apoptosis imaging. \nImplemented radiosynthesis of novel 18F-labeled tumor metabolism imaging agent under GMP conditions and provided CMC support for eIND application. \nManaged collaboration projects with industry. Quality Control Auditor MDS Pharma Services April 2008  –  December 2008  (9 months) Fehraltorf, Switzerland Reviewed QA/QC documentation and assessed data validity and compliance with internal procedures and regulatory agencies. Graduate Student Research Assistant Eidgenössische Technische Hochschule Zürich October 2004  –  March 2008  (3 years 6 months) Zurich, Switzerland PhD thesis in radiopharmacy with P. A. Schubiger and S. Ametamey \nDeveloped novel 18F-radiolabeling method for biomolecules using silicon-based building blocks for PET imaging. \nTaught Pharmaceutical Chemistry lab courses for Pharmacy students. Undergraduate Student Research Assistant Forschungszentrum Dresden-Rossendorf September 2003  –  June 2004  (10 months) Dresden, Germany Master thesis in radiochemistry with F. Wuest \nDeveloped a radiosynthetic strategy for labeling cyclooxygenase-2-inhibitors with 18F for PET imaging. Staff Research Scientist Stanford University April 2014  – Present (1 year 5 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nSynthesis and in vitro / in vivo evaluation of radiotracers for applications in oncology, neurology and immunology with focus on tumor apoptosis and multiple sclerosis imaging. \nEstablishment of 15O-water synthesis and IND application for clinical PET/MRI applications. \nProject lead of multiple academic / industrial collaborations. Staff Research Scientist Stanford University April 2014  – Present (1 year 5 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nSynthesis and in vitro / in vivo evaluation of radiotracers for applications in oncology, neurology and immunology with focus on tumor apoptosis and multiple sclerosis imaging. \nEstablishment of 15O-water synthesis and IND application for clinical PET/MRI applications. \nProject lead of multiple academic / industrial collaborations. Research Scientist Stanford University September 2011  –  March 2014  (2 years 7 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nDesigned, synthesized, and evaluated novel radiotracers for applications in oncology and neurology with focus on tumor apoptosis and pain imaging. \nDirected substantial industrial collaboration contract in the areas of tumor apoptosis imaging and biomarker discovery. \nMentored several medical and undergraduate students by designing and overseeing their individual molecular imaging-focused research projects. Taught and trained them in various laboratory techniques and data interpretation. \nLecturer for Bioengineering course E222 for graduate students in the Medical School and from Bioengineering and Engineering. Designed and taught lecture entitled “Radiolabeled peptides and proteins – valuable tools for molecular imaging”. Research Scientist Stanford University September 2011  –  March 2014  (2 years 7 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nDesigned, synthesized, and evaluated novel radiotracers for applications in oncology and neurology with focus on tumor apoptosis and pain imaging. \nDirected substantial industrial collaboration contract in the areas of tumor apoptosis imaging and biomarker discovery. \nMentored several medical and undergraduate students by designing and overseeing their individual molecular imaging-focused research projects. Taught and trained them in various laboratory techniques and data interpretation. \nLecturer for Bioengineering course E222 for graduate students in the Medical School and from Bioengineering and Engineering. Designed and taught lecture entitled “Radiolabeled peptides and proteins – valuable tools for molecular imaging”. Postdoctoral Research Scholar Stanford University April 2009  –  August 2011  (2 years 5 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nDesigned, synthesized, and evaluated novel radiotracers for tumor metabolism and apoptosis imaging. \nImplemented radiosynthesis of novel 18F-labeled tumor metabolism imaging agent under GMP conditions and provided CMC support for eIND application. \nManaged collaboration projects with industry. Postdoctoral Research Scholar Stanford University April 2009  –  August 2011  (2 years 5 months) Stanford, CA, USA Multimodality Imaging Lab (S. S. Gambhir) \nDesigned, synthesized, and evaluated novel radiotracers for tumor metabolism and apoptosis imaging. \nImplemented radiosynthesis of novel 18F-labeled tumor metabolism imaging agent under GMP conditions and provided CMC support for eIND application. \nManaged collaboration projects with industry. Quality Control Auditor MDS Pharma Services April 2008  –  December 2008  (9 months) Fehraltorf, Switzerland Reviewed QA/QC documentation and assessed data validity and compliance with internal procedures and regulatory agencies. Quality Control Auditor MDS Pharma Services April 2008  –  December 2008  (9 months) Fehraltorf, Switzerland Reviewed QA/QC documentation and assessed data validity and compliance with internal procedures and regulatory agencies. Graduate Student Research Assistant Eidgenössische Technische Hochschule Zürich October 2004  –  March 2008  (3 years 6 months) Zurich, Switzerland PhD thesis in radiopharmacy with P. A. Schubiger and S. Ametamey \nDeveloped novel 18F-radiolabeling method for biomolecules using silicon-based building blocks for PET imaging. \nTaught Pharmaceutical Chemistry lab courses for Pharmacy students. Graduate Student Research Assistant Eidgenössische Technische Hochschule Zürich October 2004  –  March 2008  (3 years 6 months) Zurich, Switzerland PhD thesis in radiopharmacy with P. A. Schubiger and S. Ametamey \nDeveloped novel 18F-radiolabeling method for biomolecules using silicon-based building blocks for PET imaging. \nTaught Pharmaceutical Chemistry lab courses for Pharmacy students. Undergraduate Student Research Assistant Forschungszentrum Dresden-Rossendorf September 2003  –  June 2004  (10 months) Dresden, Germany Master thesis in radiochemistry with F. Wuest \nDeveloped a radiosynthetic strategy for labeling cyclooxygenase-2-inhibitors with 18F for PET imaging. Undergraduate Student Research Assistant Forschungszentrum Dresden-Rossendorf September 2003  –  June 2004  (10 months) Dresden, Germany Master thesis in radiochemistry with F. Wuest \nDeveloped a radiosynthetic strategy for labeling cyclooxygenase-2-inhibitors with 18F for PET imaging. Languages English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Russian Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Russian Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Russian Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Cell Culture In Vitro In Vivo Organic Chemistry Chemistry Assay Development Small Animal Imaging Radiochemistry GMP Project Management Collaboration Management Radiosynthesis... Peptide Synthesis NMR Spectroscopy HPLC Mass Spectrometry Radiotracer Uptake Flow Cytometry Western Blotting Small Animal Models Animal Handling Positron Emission... SPECT Image Analysis Dissection Autoradiography Immunohistochemistry Fluorescence Microscopy Optical Imaging MRI PCR Drug Discovery Cell Biology Laboratory Cancer Molecular Biology Protein Expression Organic Synthesis Biochemistry Molecular Imaging Medicinal Chemistry See 26+     See less Skills  Cell Culture In Vitro In Vivo Organic Chemistry Chemistry Assay Development Small Animal Imaging Radiochemistry GMP Project Management Collaboration Management Radiosynthesis... Peptide Synthesis NMR Spectroscopy HPLC Mass Spectrometry Radiotracer Uptake Flow Cytometry Western Blotting Small Animal Models Animal Handling Positron Emission... SPECT Image Analysis Dissection Autoradiography Immunohistochemistry Fluorescence Microscopy Optical Imaging MRI PCR Drug Discovery Cell Biology Laboratory Cancer Molecular Biology Protein Expression Organic Synthesis Biochemistry Molecular Imaging Medicinal Chemistry See 26+     See less Cell Culture In Vitro In Vivo Organic Chemistry Chemistry Assay Development Small Animal Imaging Radiochemistry GMP Project Management Collaboration Management Radiosynthesis... Peptide Synthesis NMR Spectroscopy HPLC Mass Spectrometry Radiotracer Uptake Flow Cytometry Western Blotting Small Animal Models Animal Handling Positron Emission... SPECT Image Analysis Dissection Autoradiography Immunohistochemistry Fluorescence Microscopy Optical Imaging MRI PCR Drug Discovery Cell Biology Laboratory Cancer Molecular Biology Protein Expression Organic Synthesis Biochemistry Molecular Imaging Medicinal Chemistry See 26+     See less Cell Culture In Vitro In Vivo Organic Chemistry Chemistry Assay Development Small Animal Imaging Radiochemistry GMP Project Management Collaboration Management Radiosynthesis... Peptide Synthesis NMR Spectroscopy HPLC Mass Spectrometry Radiotracer Uptake Flow Cytometry Western Blotting Small Animal Models Animal Handling Positron Emission... SPECT Image Analysis Dissection Autoradiography Immunohistochemistry Fluorescence Microscopy Optical Imaging MRI PCR Drug Discovery Cell Biology Laboratory Cancer Molecular Biology Protein Expression Organic Synthesis Biochemistry Molecular Imaging Medicinal Chemistry See 26+     See less Education PhD,  Radiopharmacy 2004  – 2008 Technische Universität Dresden Diploma,  Chemistry 1998  – 2004 PhD,  Radiopharmacy 2004  – 2008 PhD,  Radiopharmacy 2004  – 2008 PhD,  Radiopharmacy 2004  – 2008 Technische Universität Dresden Diploma,  Chemistry 1998  – 2004 Technische Universität Dresden Diploma,  Chemistry 1998  – 2004 Technische Universität Dresden Diploma,  Chemistry 1998  – 2004 Honors & Awards Travel grant World Molecular Imaging Congress, Savannah, GA, USA 2013 Young Scientist Award 19th International Symposium on Radiopharmaceutical Sciences, Amsterdam, Netherlands 2011 Travel grant 17th International Symposium on Radiopharmaceutical Sciences, Aachen, Germany 2007 High School Graduate Award German Chemical Society (GDCh) 1998 Travel grant World Molecular Imaging Congress, Savannah, GA, USA 2013 Travel grant World Molecular Imaging Congress, Savannah, GA, USA 2013 Travel grant World Molecular Imaging Congress, Savannah, GA, USA 2013 Young Scientist Award 19th International Symposium on Radiopharmaceutical Sciences, Amsterdam, Netherlands 2011 Young Scientist Award 19th International Symposium on Radiopharmaceutical Sciences, Amsterdam, Netherlands 2011 Young Scientist Award 19th International Symposium on Radiopharmaceutical Sciences, Amsterdam, Netherlands 2011 Travel grant 17th International Symposium on Radiopharmaceutical Sciences, Aachen, Germany 2007 Travel grant 17th International Symposium on Radiopharmaceutical Sciences, Aachen, Germany 2007 Travel grant 17th International Symposium on Radiopharmaceutical Sciences, Aachen, Germany 2007 High School Graduate Award German Chemical Society (GDCh) 1998 High School Graduate Award German Chemical Society (GDCh) 1998 High School Graduate Award German Chemical Society (GDCh) 1998 ", "Summary Programmer, designer, author, and manager in high tech R&D. Specialties:internet search, artificial intelligence, natural language processing, machine learning, programming, education Summary Programmer, designer, author, and manager in high tech R&D. Specialties:internet search, artificial intelligence, natural language processing, machine learning, programming, education Programmer, designer, author, and manager in high tech R&D. Specialties:internet search, artificial intelligence, natural language processing, machine learning, programming, education Programmer, designer, author, and manager in high tech R&D. Specialties:internet search, artificial intelligence, natural language processing, machine learning, programming, education Experience Engineering Director Google May 2001  – Present (14 years 4 months) R&D for improvements in search technology. Visiting Lecturer Stanford University 2010  –  2012  (2 years) Stanford, CA Head, Computational Sciences Division NASA Ames 1998  –  2001  (3 years) Division Chief, Computational Sciences NASA 1998  –  2001  (3 years) Chief Scientist Junglee 1996  –  1998  (2 years) Chief Designer Harlequin Software 1994  –  1996  (2 years) Senior Research Scientist Sun Microsystems 1991  –  1994  (3 years) Research Scientist Stanford University 1991  –  1991  (less than a year) Engineering Director Google May 2001  – Present (14 years 4 months) R&D for improvements in search technology. Engineering Director Google May 2001  – Present (14 years 4 months) R&D for improvements in search technology. Visiting Lecturer Stanford University 2010  –  2012  (2 years) Stanford, CA Visiting Lecturer Stanford University 2010  –  2012  (2 years) Stanford, CA Head, Computational Sciences Division NASA Ames 1998  –  2001  (3 years) Head, Computational Sciences Division NASA Ames 1998  –  2001  (3 years) Division Chief, Computational Sciences NASA 1998  –  2001  (3 years) Division Chief, Computational Sciences NASA 1998  –  2001  (3 years) Chief Scientist Junglee 1996  –  1998  (2 years) Chief Scientist Junglee 1996  –  1998  (2 years) Chief Designer Harlequin Software 1994  –  1996  (2 years) Chief Designer Harlequin Software 1994  –  1996  (2 years) Senior Research Scientist Sun Microsystems 1991  –  1994  (3 years) Senior Research Scientist Sun Microsystems 1991  –  1994  (3 years) Research Scientist Stanford University 1991  –  1991  (less than a year) Research Scientist Stanford University 1991  –  1991  (less than a year) Skills Amazon EC2 Machine Learning Artificial Intelligence Linux Programming Text Mining Object Oriented Design Big Data Natural Language... Pattern Recognition Information Extraction Lisp Data Mining Open Source Information Retrieval System Architecture Software Development OOP Unix High Performance... Computer Science Scalability Neural Networks Cloud Computing Algorithm Design Python MapReduce Semantic Web C++ Recommender Systems Distributed Systems Text Analytics Software Engineering Computational... Software Design Algorithms Knowledge Representation Orbital Dynamics Parallel Computing LaTeX Artificial Neural... Perl Git Human Computer... Research Common Lisp Computer Vision Optimization Image Processing Hadoop See 35+     See less Skills  Amazon EC2 Machine Learning Artificial Intelligence Linux Programming Text Mining Object Oriented Design Big Data Natural Language... Pattern Recognition Information Extraction Lisp Data Mining Open Source Information Retrieval System Architecture Software Development OOP Unix High Performance... Computer Science Scalability Neural Networks Cloud Computing Algorithm Design Python MapReduce Semantic Web C++ Recommender Systems Distributed Systems Text Analytics Software Engineering Computational... Software Design Algorithms Knowledge Representation Orbital Dynamics Parallel Computing LaTeX Artificial Neural... Perl Git Human Computer... Research Common Lisp Computer Vision Optimization Image Processing Hadoop See 35+     See less Amazon EC2 Machine Learning Artificial Intelligence Linux Programming Text Mining Object Oriented Design Big Data Natural Language... Pattern Recognition Information Extraction Lisp Data Mining Open Source Information Retrieval System Architecture Software Development OOP Unix High Performance... Computer Science Scalability Neural Networks Cloud Computing Algorithm Design Python MapReduce Semantic Web C++ Recommender Systems Distributed Systems Text Analytics Software Engineering Computational... Software Design Algorithms Knowledge Representation Orbital Dynamics Parallel Computing LaTeX Artificial Neural... Perl Git Human Computer... Research Common Lisp Computer Vision Optimization Image Processing Hadoop See 35+     See less Amazon EC2 Machine Learning Artificial Intelligence Linux Programming Text Mining Object Oriented Design Big Data Natural Language... Pattern Recognition Information Extraction Lisp Data Mining Open Source Information Retrieval System Architecture Software Development OOP Unix High Performance... Computer Science Scalability Neural Networks Cloud Computing Algorithm Design Python MapReduce Semantic Web C++ Recommender Systems Distributed Systems Text Analytics Software Engineering Computational... Software Design Algorithms Knowledge Representation Orbital Dynamics Parallel Computing LaTeX Artificial Neural... Perl Git Human Computer... Research Common Lisp Computer Vision Optimization Image Processing Hadoop See 35+     See less Education University of California, Berkeley Ph.D.,  Computer Science 1980  – 1985 Brown University B.S.,  Applied Mathematics 1974  – 1978 University of California, Berkeley Ph.D.,  Computer Science 1980  – 1985 University of California, Berkeley Ph.D.,  Computer Science 1980  – 1985 University of California, Berkeley Ph.D.,  Computer Science 1980  – 1985 Brown University B.S.,  Applied Mathematics 1974  – 1978 Brown University B.S.,  Applied Mathematics 1974  – 1978 Brown University B.S.,  Applied Mathematics 1974  – 1978 Honors & Awards Additional Honors & Awards ACM Fellow; AAAI Fellow; Berkeley CS Distinguished Alum; NASA Exceptional Achievement Medal Additional Honors & Awards ACM Fellow; AAAI Fellow; Berkeley CS Distinguished Alum; NASA Exceptional Achievement Medal Additional Honors & Awards ACM Fellow; AAAI Fellow; Berkeley CS Distinguished Alum; NASA Exceptional Achievement Medal Additional Honors & Awards ACM Fellow; AAAI Fellow; Berkeley CS Distinguished Alum; NASA Exceptional Achievement Medal ", "Summary Imaging science professional with medical industry experience managing cross-functional teams and 8 years R&D experience in medical applications including leading edge machine learning, imaging, and failure analysis Summary Imaging science professional with medical industry experience managing cross-functional teams and 8 years R&D experience in medical applications including leading edge machine learning, imaging, and failure analysis Imaging science professional with medical industry experience managing cross-functional teams and 8 years R&D experience in medical applications including leading edge machine learning, imaging, and failure analysis Imaging science professional with medical industry experience managing cross-functional teams and 8 years R&D experience in medical applications including leading edge machine learning, imaging, and failure analysis Languages English Native or bilingual proficiency Cantonese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Cantonese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Cantonese Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Skills     Honors & Awards Diabetic Retinopathy Challenge, 15th place Kaggle, California Healthcare Foundation July 2015 The goal of the Diabetic Retinopathy Challenge was to classify high resolution fundus images from a scale of 0-4. Our team of 3, including 2 graduate students, use an ensemble of convolutional neural networks to place 15th out of 673 teams (top 3%).  Additional Honors & Awards Magna Cum Laude Oral Presentation Merit Award, ISMRM 22nd Meeting, Milan, Italy\t2014 \nPeer Reviewer, Magnetic Resonance in Medicine\t2011-2014 \nNSF American Society for Engineering Innovation Fellow\t2012 \nPeer Reviewer, IEEE Transactions in Medical Imaging\t2012 \nNSF Graduate Research Fellowship\t2009-2012 \nISMRM Travel Stipend Award\t2009-2012 \nYale Advanced Graduate Leadership Fellowship\t2011 \nSilver Medal Poster Award in Physics, ISMRM 18th Meeting, Stockholm, Sweden\t2010 \nMildred T. Widgoff Honors Thesis Physics Prize\t2007\t \nDavid Winton Bell Undergraduate Science Scholarship\t2005-2007 Diabetic Retinopathy Challenge, 15th place Kaggle, California Healthcare Foundation July 2015 The goal of the Diabetic Retinopathy Challenge was to classify high resolution fundus images from a scale of 0-4. Our team of 3, including 2 graduate students, use an ensemble of convolutional neural networks to place 15th out of 673 teams (top 3%).  Diabetic Retinopathy Challenge, 15th place Kaggle, California Healthcare Foundation July 2015 The goal of the Diabetic Retinopathy Challenge was to classify high resolution fundus images from a scale of 0-4. Our team of 3, including 2 graduate students, use an ensemble of convolutional neural networks to place 15th out of 673 teams (top 3%).  Diabetic Retinopathy Challenge, 15th place Kaggle, California Healthcare Foundation July 2015 The goal of the Diabetic Retinopathy Challenge was to classify high resolution fundus images from a scale of 0-4. Our team of 3, including 2 graduate students, use an ensemble of convolutional neural networks to place 15th out of 673 teams (top 3%).  Additional Honors & Awards Magna Cum Laude Oral Presentation Merit Award, ISMRM 22nd Meeting, Milan, Italy\t2014 \nPeer Reviewer, Magnetic Resonance in Medicine\t2011-2014 \nNSF American Society for Engineering Innovation Fellow\t2012 \nPeer Reviewer, IEEE Transactions in Medical Imaging\t2012 \nNSF Graduate Research Fellowship\t2009-2012 \nISMRM Travel Stipend Award\t2009-2012 \nYale Advanced Graduate Leadership Fellowship\t2011 \nSilver Medal Poster Award in Physics, ISMRM 18th Meeting, Stockholm, Sweden\t2010 \nMildred T. Widgoff Honors Thesis Physics Prize\t2007\t \nDavid Winton Bell Undergraduate Science Scholarship\t2005-2007 Additional Honors & Awards Magna Cum Laude Oral Presentation Merit Award, ISMRM 22nd Meeting, Milan, Italy\t2014 \nPeer Reviewer, Magnetic Resonance in Medicine\t2011-2014 \nNSF American Society for Engineering Innovation Fellow\t2012 \nPeer Reviewer, IEEE Transactions in Medical Imaging\t2012 \nNSF Graduate Research Fellowship\t2009-2012 \nISMRM Travel Stipend Award\t2009-2012 \nYale Advanced Graduate Leadership Fellowship\t2011 \nSilver Medal Poster Award in Physics, ISMRM 18th Meeting, Stockholm, Sweden\t2010 \nMildred T. Widgoff Honors Thesis Physics Prize\t2007\t \nDavid Winton Bell Undergraduate Science Scholarship\t2005-2007 Additional Honors & Awards Magna Cum Laude Oral Presentation Merit Award, ISMRM 22nd Meeting, Milan, Italy\t2014 \nPeer Reviewer, Magnetic Resonance in Medicine\t2011-2014 \nNSF American Society for Engineering Innovation Fellow\t2012 \nPeer Reviewer, IEEE Transactions in Medical Imaging\t2012 \nNSF Graduate Research Fellowship\t2009-2012 \nISMRM Travel Stipend Award\t2009-2012 \nYale Advanced Graduate Leadership Fellowship\t2011 \nSilver Medal Poster Award in Physics, ISMRM 18th Meeting, Stockholm, Sweden\t2010 \nMildred T. Widgoff Honors Thesis Physics Prize\t2007\t \nDavid Winton Bell Undergraduate Science Scholarship\t2005-2007 "]}