{"position": "Senior Associate Director", "company": "Stanford University", "profiles": ["Experience Senior Associate Director, Class Giving Stanford University November 2013  – Present (1 year 10 months) Associate Director, Class Giving Stanford University April 2011  –  November 2013  (2 years 8 months) Director, Annual Fund and Donor Stewardship Stanford Graduate School of Education January 2009  –  April 2011  (2 years 4 months) Stanford University Director of Marketing and Admissions Stanbridge Academy 2005  –  2008  (3 years) Teacher Pinewood School 2003  –  2005  (2 years) Senior Associate Director, Class Giving Stanford University November 2013  – Present (1 year 10 months) Senior Associate Director, Class Giving Stanford University November 2013  – Present (1 year 10 months) Associate Director, Class Giving Stanford University April 2011  –  November 2013  (2 years 8 months) Associate Director, Class Giving Stanford University April 2011  –  November 2013  (2 years 8 months) Director, Annual Fund and Donor Stewardship Stanford Graduate School of Education January 2009  –  April 2011  (2 years 4 months) Stanford University Director, Annual Fund and Donor Stewardship Stanford Graduate School of Education January 2009  –  April 2011  (2 years 4 months) Stanford University Director of Marketing and Admissions Stanbridge Academy 2005  –  2008  (3 years) Director of Marketing and Admissions Stanbridge Academy 2005  –  2008  (3 years) Teacher Pinewood School 2003  –  2005  (2 years) Teacher Pinewood School 2003  –  2005  (2 years) Skills Marketing Nonprofits Stewardship Volunteer Management Alumni Relations Annual Giving Strategic Communications Fundraising Non-profits Editing Philanthropy Community Outreach Program Development Grants Higher Education Event Planning Planned Giving Grant Writing Community Development Public Speaking See 5+     See less Skills  Marketing Nonprofits Stewardship Volunteer Management Alumni Relations Annual Giving Strategic Communications Fundraising Non-profits Editing Philanthropy Community Outreach Program Development Grants Higher Education Event Planning Planned Giving Grant Writing Community Development Public Speaking See 5+     See less Marketing Nonprofits Stewardship Volunteer Management Alumni Relations Annual Giving Strategic Communications Fundraising Non-profits Editing Philanthropy Community Outreach Program Development Grants Higher Education Event Planning Planned Giving Grant Writing Community Development Public Speaking See 5+     See less Marketing Nonprofits Stewardship Volunteer Management Alumni Relations Annual Giving Strategic Communications Fundraising Non-profits Editing Philanthropy Community Outreach Program Development Grants Higher Education Event Planning Planned Giving Grant Writing Community Development Public Speaking See 5+     See less Education Stanford University MA, English 2002  – 2003 Duke University BA,  English 1998  – 2002 Stanford University MA, English 2002  – 2003 Stanford University MA, English 2002  – 2003 Stanford University MA, English 2002  – 2003 Duke University BA,  English 1998  – 2002 Duke University BA,  English 1998  – 2002 Duke University BA,  English 1998  – 2002 ", "Experience Senior Associate Director Stanford University November 2010  – Present (4 years 10 months) Stanford University Associate Director of Development Stanford University June 2008  –  November 2010  (2 years 6 months) Committee Chair Bing Nursery School, Harvest Moon Auction 2006  –  2010  (4 years) Agent Endeavor 1998  –  2001  (3 years) Senior Associate Director Stanford University November 2010  – Present (4 years 10 months) Stanford University Senior Associate Director Stanford University November 2010  – Present (4 years 10 months) Stanford University Associate Director of Development Stanford University June 2008  –  November 2010  (2 years 6 months) Associate Director of Development Stanford University June 2008  –  November 2010  (2 years 6 months) Committee Chair Bing Nursery School, Harvest Moon Auction 2006  –  2010  (4 years) Committee Chair Bing Nursery School, Harvest Moon Auction 2006  –  2010  (4 years) Agent Endeavor 1998  –  2001  (3 years) Agent Endeavor 1998  –  2001  (3 years) ", "Experience Senior Associate Director Stanford University School of Medicine 2013  – Present (2 years) Director, Major Gifts Cambridge in America 2011  –  2013  (2 years) Senior Associate Director of Major Gifts Yale University 2005  –  March 2011  (6 years) Director of Development Harvard Medical School 2000  –  2005  (5 years) Senior Associate Director Stanford University School of Medicine 2013  – Present (2 years) Senior Associate Director Stanford University School of Medicine 2013  – Present (2 years) Director, Major Gifts Cambridge in America 2011  –  2013  (2 years) Director, Major Gifts Cambridge in America 2011  –  2013  (2 years) Senior Associate Director of Major Gifts Yale University 2005  –  March 2011  (6 years) Senior Associate Director of Major Gifts Yale University 2005  –  March 2011  (6 years) Director of Development Harvard Medical School 2000  –  2005  (5 years) Director of Development Harvard Medical School 2000  –  2005  (5 years) Skills Fundraising Event Planning Stewardship Managing Volunteers Volunteer Recruiting Alumni Relations Philanthropy Fundraisers Volunteer Management Nonprofits Annual Giving Prospect Research Planned Giving Grants Grant Writing Higher Education Community Outreach Program Development Major Gift Development Raiser's Edge See 5+     See less Skills  Fundraising Event Planning Stewardship Managing Volunteers Volunteer Recruiting Alumni Relations Philanthropy Fundraisers Volunteer Management Nonprofits Annual Giving Prospect Research Planned Giving Grants Grant Writing Higher Education Community Outreach Program Development Major Gift Development Raiser's Edge See 5+     See less Fundraising Event Planning Stewardship Managing Volunteers Volunteer Recruiting Alumni Relations Philanthropy Fundraisers Volunteer Management Nonprofits Annual Giving Prospect Research Planned Giving Grants Grant Writing Higher Education Community Outreach Program Development Major Gift Development Raiser's Edge See 5+     See less Fundraising Event Planning Stewardship Managing Volunteers Volunteer Recruiting Alumni Relations Philanthropy Fundraisers Volunteer Management Nonprofits Annual Giving Prospect Research Planned Giving Grants Grant Writing Higher Education Community Outreach Program Development Major Gift Development Raiser's Edge See 5+     See less Education Indiana University Bloomington BA University of Wisconsin-Madison MS Indiana University Bloomington BA Indiana University Bloomington BA Indiana University Bloomington BA University of Wisconsin-Madison MS University of Wisconsin-Madison MS University of Wisconsin-Madison MS ", "Experience Senior Associate Director Stanford University December 2013  – Present (1 year 9 months) Associate Director of Gift Planning Cedars-Sinai Medical Center November 2010  – Present (4 years 10 months) Managed CSMC's planned giving program. Assistant Director of Gift Planning Cedars-Sinai Medical Center April 2009  –  November 2010  (1 year 8 months) Served as second gift planning officer for the program. Principal Gifts Officer Cedars-Sinai Medical Center October 2008  –  April 2009  (7 months) Closed 6-, 7-, and 8-figure endowment and current use gifts Senior Development Officer Cedars-Sinai Medical Center March 2006  –  October 2008  (2 years 8 months) Closed 6-, 7-, and 8-figure endowment and current use gifts Major Gifts Officer - Biomedical Fundraising American Red Cross February 2005  –  March 2006  (1 year 2 months) Worked extensively with Board of Directors and leadership volunteers to cultivate, solicit, and steward 7-figure gifts.  \n \nRevised and executed campaign strategy for $150M capital campaign; directed and supervised prospect research staff. Senior Grantwriter LACMA 2003  –  2005  (2 years) Identified and successfully solicited 6- and 7-figure government and private foundation prospects, including the National Endowment for the Humanities and the William Randolph Hearst Foundation. Associate Attorney Glaser, Weil, Fink, Jacobs, Howard and Shapiro, LLP June 2001  –  September 2002  (1 year 4 months) Los Angeles, CA Drafted pleadings, motions, and legal memoranda in complex commercial lawsuits. Research Intern Center for Auto Safety May 1996  –  August 1996  (4 months) Washingon, D.C. Research internship during first summer of law school. campus organizer FFPIR 1992  –  1995  (3 years) Senior Associate Director Stanford University December 2013  – Present (1 year 9 months) Senior Associate Director Stanford University December 2013  – Present (1 year 9 months) Associate Director of Gift Planning Cedars-Sinai Medical Center November 2010  – Present (4 years 10 months) Managed CSMC's planned giving program. Associate Director of Gift Planning Cedars-Sinai Medical Center November 2010  – Present (4 years 10 months) Managed CSMC's planned giving program. Assistant Director of Gift Planning Cedars-Sinai Medical Center April 2009  –  November 2010  (1 year 8 months) Served as second gift planning officer for the program. Assistant Director of Gift Planning Cedars-Sinai Medical Center April 2009  –  November 2010  (1 year 8 months) Served as second gift planning officer for the program. Principal Gifts Officer Cedars-Sinai Medical Center October 2008  –  April 2009  (7 months) Closed 6-, 7-, and 8-figure endowment and current use gifts Principal Gifts Officer Cedars-Sinai Medical Center October 2008  –  April 2009  (7 months) Closed 6-, 7-, and 8-figure endowment and current use gifts Senior Development Officer Cedars-Sinai Medical Center March 2006  –  October 2008  (2 years 8 months) Closed 6-, 7-, and 8-figure endowment and current use gifts Senior Development Officer Cedars-Sinai Medical Center March 2006  –  October 2008  (2 years 8 months) Closed 6-, 7-, and 8-figure endowment and current use gifts Major Gifts Officer - Biomedical Fundraising American Red Cross February 2005  –  March 2006  (1 year 2 months) Worked extensively with Board of Directors and leadership volunteers to cultivate, solicit, and steward 7-figure gifts.  \n \nRevised and executed campaign strategy for $150M capital campaign; directed and supervised prospect research staff. Major Gifts Officer - Biomedical Fundraising American Red Cross February 2005  –  March 2006  (1 year 2 months) Worked extensively with Board of Directors and leadership volunteers to cultivate, solicit, and steward 7-figure gifts.  \n \nRevised and executed campaign strategy for $150M capital campaign; directed and supervised prospect research staff. Senior Grantwriter LACMA 2003  –  2005  (2 years) Identified and successfully solicited 6- and 7-figure government and private foundation prospects, including the National Endowment for the Humanities and the William Randolph Hearst Foundation. Senior Grantwriter LACMA 2003  –  2005  (2 years) Identified and successfully solicited 6- and 7-figure government and private foundation prospects, including the National Endowment for the Humanities and the William Randolph Hearst Foundation. Associate Attorney Glaser, Weil, Fink, Jacobs, Howard and Shapiro, LLP June 2001  –  September 2002  (1 year 4 months) Los Angeles, CA Drafted pleadings, motions, and legal memoranda in complex commercial lawsuits. Associate Attorney Glaser, Weil, Fink, Jacobs, Howard and Shapiro, LLP June 2001  –  September 2002  (1 year 4 months) Los Angeles, CA Drafted pleadings, motions, and legal memoranda in complex commercial lawsuits. Research Intern Center for Auto Safety May 1996  –  August 1996  (4 months) Washingon, D.C. Research internship during first summer of law school. Research Intern Center for Auto Safety May 1996  –  August 1996  (4 months) Washingon, D.C. Research internship during first summer of law school. campus organizer FFPIR 1992  –  1995  (3 years) campus organizer FFPIR 1992  –  1995  (3 years) Languages English English English Skills Fundraising Grant Writing Philanthropy Nonprofits Volunteer Management Program Development Legal Research Legal Writing Civil Litigation Planned Giving Strategic Planning Academic Medicine Academic Medical Centers Board of Directors Board Relations Art Fine Art Fine Art Photography Board Development Endowments Research Capital Campaign... Grants Raiser's Edge Major Gift Development Prospect Research Annual Giving Non-profit... Stewardship Community Outreach See 15+     See less Skills  Fundraising Grant Writing Philanthropy Nonprofits Volunteer Management Program Development Legal Research Legal Writing Civil Litigation Planned Giving Strategic Planning Academic Medicine Academic Medical Centers Board of Directors Board Relations Art Fine Art Fine Art Photography Board Development Endowments Research Capital Campaign... Grants Raiser's Edge Major Gift Development Prospect Research Annual Giving Non-profit... Stewardship Community Outreach See 15+     See less Fundraising Grant Writing Philanthropy Nonprofits Volunteer Management Program Development Legal Research Legal Writing Civil Litigation Planned Giving Strategic Planning Academic Medicine Academic Medical Centers Board of Directors Board Relations Art Fine Art Fine Art Photography Board Development Endowments Research Capital Campaign... Grants Raiser's Edge Major Gift Development Prospect Research Annual Giving Non-profit... Stewardship Community Outreach See 15+     See less Fundraising Grant Writing Philanthropy Nonprofits Volunteer Management Program Development Legal Research Legal Writing Civil Litigation Planned Giving Strategic Planning Academic Medicine Academic Medical Centers Board of Directors Board Relations Art Fine Art Fine Art Photography Board Development Endowments Research Capital Campaign... Grants Raiser's Edge Major Gift Development Prospect Research Annual Giving Non-profit... Stewardship Community Outreach See 15+     See less Education The George Washington University Law School Juris Doctor (J.D.) 1995  – 1998 Rutgers, The State University of New Jersey-New Brunswick Bachelor of Science (B.S.),  major: political science; minor biology 1988  – 1992 Activities and Societies:  Phi Delta Theta fraternity\nPresident - Rutgers Fraternity Council\nRCGA\nCap & Skull Caddo Magnet High 1984  – 1986 Activities and Societies:  Debate team The George Washington University Law School Juris Doctor (J.D.) 1995  – 1998 The George Washington University Law School Juris Doctor (J.D.) 1995  – 1998 The George Washington University Law School Juris Doctor (J.D.) 1995  – 1998 Rutgers, The State University of New Jersey-New Brunswick Bachelor of Science (B.S.),  major: political science; minor biology 1988  – 1992 Activities and Societies:  Phi Delta Theta fraternity\nPresident - Rutgers Fraternity Council\nRCGA\nCap & Skull Rutgers, The State University of New Jersey-New Brunswick Bachelor of Science (B.S.),  major: political science; minor biology 1988  – 1992 Activities and Societies:  Phi Delta Theta fraternity\nPresident - Rutgers Fraternity Council\nRCGA\nCap & Skull Rutgers, The State University of New Jersey-New Brunswick Bachelor of Science (B.S.),  major: political science; minor biology 1988  – 1992 Activities and Societies:  Phi Delta Theta fraternity\nPresident - Rutgers Fraternity Council\nRCGA\nCap & Skull Caddo Magnet High 1984  – 1986 Activities and Societies:  Debate team Caddo Magnet High 1984  – 1986 Activities and Societies:  Debate team Caddo Magnet High 1984  – 1986 Activities and Societies:  Debate team ", "Skills Urban Planning Land Use Planning Land Use Zoning Environmental Planning Sustainability Skills  Urban Planning Land Use Planning Land Use Zoning Environmental Planning Sustainability Urban Planning Land Use Planning Land Use Zoning Environmental Planning Sustainability Urban Planning Land Use Planning Land Use Zoning Environmental Planning Sustainability ", "Languages Spanish Spanish Spanish Skills Research International Relations Program Development Community Outreach Fundraising Philanthropy Public Policy Volunteer Management Public Speaking Event Planning Editing Strategy Social Media Alumni Relations Blogging Grants Management International... See 3+     See less Skills  Research International Relations Program Development Community Outreach Fundraising Philanthropy Public Policy Volunteer Management Public Speaking Event Planning Editing Strategy Social Media Alumni Relations Blogging Grants Management International... See 3+     See less Research International Relations Program Development Community Outreach Fundraising Philanthropy Public Policy Volunteer Management Public Speaking Event Planning Editing Strategy Social Media Alumni Relations Blogging Grants Management International... See 3+     See less Research International Relations Program Development Community Outreach Fundraising Philanthropy Public Policy Volunteer Management Public Speaking Event Planning Editing Strategy Social Media Alumni Relations Blogging Grants Management International... See 3+     See less ", "Experience Senior associate Director Stanford University Senior associate Director Stanford University Senior associate Director Stanford University Education Stanford University Doctor of Philosophy (Ph.D.),  Economics Stanford University Doctor of Philosophy (Ph.D.),  Economics Stanford University Doctor of Philosophy (Ph.D.),  Economics Stanford University Doctor of Philosophy (Ph.D.),  Economics ", "Summary •\tManagement Consultant with C-Level Customers  \n•\tWell-rounded management professional with 15+ years experience in Manufacturing, Distribution  \n•\tS&OP, Demand and Supply Chain expertise \n•\tVertical industry experience in Consumer Electronics, Software as well as Food & Beverage \n \nWide-ranging international background with business experience living/working in S. Korea, Japan, Holland and Mexico \n \nParticular interest in utilizing latest information technology to manage state-of-the-art global businesses Summary •\tManagement Consultant with C-Level Customers  \n•\tWell-rounded management professional with 15+ years experience in Manufacturing, Distribution  \n•\tS&OP, Demand and Supply Chain expertise \n•\tVertical industry experience in Consumer Electronics, Software as well as Food & Beverage \n \nWide-ranging international background with business experience living/working in S. Korea, Japan, Holland and Mexico \n \nParticular interest in utilizing latest information technology to manage state-of-the-art global businesses •\tManagement Consultant with C-Level Customers  \n•\tWell-rounded management professional with 15+ years experience in Manufacturing, Distribution  \n•\tS&OP, Demand and Supply Chain expertise \n•\tVertical industry experience in Consumer Electronics, Software as well as Food & Beverage \n \nWide-ranging international background with business experience living/working in S. Korea, Japan, Holland and Mexico \n \nParticular interest in utilizing latest information technology to manage state-of-the-art global businesses •\tManagement Consultant with C-Level Customers  \n•\tWell-rounded management professional with 15+ years experience in Manufacturing, Distribution  \n•\tS&OP, Demand and Supply Chain expertise \n•\tVertical industry experience in Consumer Electronics, Software as well as Food & Beverage \n \nWide-ranging international background with business experience living/working in S. Korea, Japan, Holland and Mexico \n \nParticular interest in utilizing latest information technology to manage state-of-the-art global businesses Experience Senior Associate Director Stanford University September 2014  – Present (1 year) Integrated Marketing Services in the Office of Development at Stanford \n \nWe support all of Stanford's Graduate Schools and The Stanford Fund with central marketing and donor intelligence services.  \n \nLed project to build and release a Donor Behavior Analytics engine, the first of its kind for the Office of Development at Stanford Management Consultant RJMC August 2011  –  August 2014  (3 years 1 month) Responsibility: Lead companies through \nERP software evaluation and vendor selection process \nBusiness process improvement \nAcquisition of strategic information technology for the enterprise Director, Worldwide Sales Operations SONOS, INC January 2008  –  April 2011  (3 years 4 months) Responsibility: Directed Global Team (U.S., the Netherlands, Malaysia) \nManaged global sales operations team for Sonos (125% YoY Growth in 2010) \nResponsibility for forecasting all channels worldwide \nDirected Sonos worldwide supply chain; managed all 3rd party logistics partners  \nCalibrated inventory levels/fulfillment worldwide, including both B2C and B2B fulfillment \nManaged global E-commerce/payment for 4 currencies \nCreated WW reverse logistics process for Sonos RMA processing  \nNegotiated 1st purchase of retail POS market data for Sonos \nSelected as ERP vendor selection team leader  \nCreated WW dashboard For E-Team members highlighting real-time status of key business metrics and variance analysis for each metric Director, Business Planning and Operations SONY ELECTRONICS, INC January 1998  –  January 2007  (9 years 1 month) Home Products Division, TV Marketing; Display Marketing  \nResponsibility: North America profit & loss ($4 Billion Net Sales) \nIncluded pricing strategy, demand forecasting, supply-chain planning \nPerformed business planning & operations For nine (9) TV Technology Categories \nLaunched BRAVIA (5X Y/Y $Rev Growth) & SXRD sub-brands in the U.S. in Aug/Sep 2005 \nCreated business dashboard to perform variance analysis for all key business metrics \nManaged SAP/Business Warehouse implementation for TV business unit at Sony Electronics Business Development Manager OTTEX CORPORATION January 1996  –  January 1998  (2 years 1 month) Launched a line of instant noodles to all major retail chains in Mexico; Cifra; Soriana, Gigante \nPerformed label translation  \nSecured NOM-51 certification \nNegotiated ad campaign purchase from McCann-Erickson \nPurchased TV time from TV Azteca \nPlanned and managed company branding/presence at international food trade shows (Mexico City; Guadalajara) \nManaged training and promotion programs with local business partner in Mexico International Business Analyst IBJ LEASING CO., LTD January 1994  –  January 1995  (1 year 1 month) Business Analyst Senior Associate Director Stanford University September 2014  – Present (1 year) Integrated Marketing Services in the Office of Development at Stanford \n \nWe support all of Stanford's Graduate Schools and The Stanford Fund with central marketing and donor intelligence services.  \n \nLed project to build and release a Donor Behavior Analytics engine, the first of its kind for the Office of Development at Stanford Senior Associate Director Stanford University September 2014  – Present (1 year) Integrated Marketing Services in the Office of Development at Stanford \n \nWe support all of Stanford's Graduate Schools and The Stanford Fund with central marketing and donor intelligence services.  \n \nLed project to build and release a Donor Behavior Analytics engine, the first of its kind for the Office of Development at Stanford Management Consultant RJMC August 2011  –  August 2014  (3 years 1 month) Responsibility: Lead companies through \nERP software evaluation and vendor selection process \nBusiness process improvement \nAcquisition of strategic information technology for the enterprise Management Consultant RJMC August 2011  –  August 2014  (3 years 1 month) Responsibility: Lead companies through \nERP software evaluation and vendor selection process \nBusiness process improvement \nAcquisition of strategic information technology for the enterprise Director, Worldwide Sales Operations SONOS, INC January 2008  –  April 2011  (3 years 4 months) Responsibility: Directed Global Team (U.S., the Netherlands, Malaysia) \nManaged global sales operations team for Sonos (125% YoY Growth in 2010) \nResponsibility for forecasting all channels worldwide \nDirected Sonos worldwide supply chain; managed all 3rd party logistics partners  \nCalibrated inventory levels/fulfillment worldwide, including both B2C and B2B fulfillment \nManaged global E-commerce/payment for 4 currencies \nCreated WW reverse logistics process for Sonos RMA processing  \nNegotiated 1st purchase of retail POS market data for Sonos \nSelected as ERP vendor selection team leader  \nCreated WW dashboard For E-Team members highlighting real-time status of key business metrics and variance analysis for each metric Director, Worldwide Sales Operations SONOS, INC January 2008  –  April 2011  (3 years 4 months) Responsibility: Directed Global Team (U.S., the Netherlands, Malaysia) \nManaged global sales operations team for Sonos (125% YoY Growth in 2010) \nResponsibility for forecasting all channels worldwide \nDirected Sonos worldwide supply chain; managed all 3rd party logistics partners  \nCalibrated inventory levels/fulfillment worldwide, including both B2C and B2B fulfillment \nManaged global E-commerce/payment for 4 currencies \nCreated WW reverse logistics process for Sonos RMA processing  \nNegotiated 1st purchase of retail POS market data for Sonos \nSelected as ERP vendor selection team leader  \nCreated WW dashboard For E-Team members highlighting real-time status of key business metrics and variance analysis for each metric Director, Business Planning and Operations SONY ELECTRONICS, INC January 1998  –  January 2007  (9 years 1 month) Home Products Division, TV Marketing; Display Marketing  \nResponsibility: North America profit & loss ($4 Billion Net Sales) \nIncluded pricing strategy, demand forecasting, supply-chain planning \nPerformed business planning & operations For nine (9) TV Technology Categories \nLaunched BRAVIA (5X Y/Y $Rev Growth) & SXRD sub-brands in the U.S. in Aug/Sep 2005 \nCreated business dashboard to perform variance analysis for all key business metrics \nManaged SAP/Business Warehouse implementation for TV business unit at Sony Electronics Director, Business Planning and Operations SONY ELECTRONICS, INC January 1998  –  January 2007  (9 years 1 month) Home Products Division, TV Marketing; Display Marketing  \nResponsibility: North America profit & loss ($4 Billion Net Sales) \nIncluded pricing strategy, demand forecasting, supply-chain planning \nPerformed business planning & operations For nine (9) TV Technology Categories \nLaunched BRAVIA (5X Y/Y $Rev Growth) & SXRD sub-brands in the U.S. in Aug/Sep 2005 \nCreated business dashboard to perform variance analysis for all key business metrics \nManaged SAP/Business Warehouse implementation for TV business unit at Sony Electronics Business Development Manager OTTEX CORPORATION January 1996  –  January 1998  (2 years 1 month) Launched a line of instant noodles to all major retail chains in Mexico; Cifra; Soriana, Gigante \nPerformed label translation  \nSecured NOM-51 certification \nNegotiated ad campaign purchase from McCann-Erickson \nPurchased TV time from TV Azteca \nPlanned and managed company branding/presence at international food trade shows (Mexico City; Guadalajara) \nManaged training and promotion programs with local business partner in Mexico Business Development Manager OTTEX CORPORATION January 1996  –  January 1998  (2 years 1 month) Launched a line of instant noodles to all major retail chains in Mexico; Cifra; Soriana, Gigante \nPerformed label translation  \nSecured NOM-51 certification \nNegotiated ad campaign purchase from McCann-Erickson \nPurchased TV time from TV Azteca \nPlanned and managed company branding/presence at international food trade shows (Mexico City; Guadalajara) \nManaged training and promotion programs with local business partner in Mexico International Business Analyst IBJ LEASING CO., LTD January 1994  –  January 1995  (1 year 1 month) Business Analyst International Business Analyst IBJ LEASING CO., LTD January 1994  –  January 1995  (1 year 1 month) Business Analyst Skills Forecasting Consumer Electronics Program Management Competitive Analysis Management Business Planning Business Development Strategic Planning Supply Chain Leadership Enterprise Software Business Process... Marketing Product Marketing Product Management B2B Strategic Partnerships Cross-functional Team... See 3+     See less Skills  Forecasting Consumer Electronics Program Management Competitive Analysis Management Business Planning Business Development Strategic Planning Supply Chain Leadership Enterprise Software Business Process... Marketing Product Marketing Product Management B2B Strategic Partnerships Cross-functional Team... See 3+     See less Forecasting Consumer Electronics Program Management Competitive Analysis Management Business Planning Business Development Strategic Planning Supply Chain Leadership Enterprise Software Business Process... Marketing Product Marketing Product Management B2B Strategic Partnerships Cross-functional Team... See 3+     See less Forecasting Consumer Electronics Program Management Competitive Analysis Management Business Planning Business Development Strategic Planning Supply Chain Leadership Enterprise Software Business Process... Marketing Product Marketing Product Management B2B Strategic Partnerships Cross-functional Team... See 3+     See less Education University of California, San Diego The Graduate School,  International Relations and Pacific Studies 1993  – 1996 Attended the Global Policy and Strategy school at UC, San Diego  \n \nSpecialized in International Management & East Asia, specifically Korea and Japan University of California at Santa Barbara Bachelor of Arts,  Political Science - International Relations 1987  – 1992 Studied International Relations and Mathematics Yonsei University International Business/Trade/Commerce 1990  – 1991 Studied International Politics as an exchange student with the UC Santa Barbara EAP Program University of California, San Diego The Graduate School,  International Relations and Pacific Studies 1993  – 1996 Attended the Global Policy and Strategy school at UC, San Diego  \n \nSpecialized in International Management & East Asia, specifically Korea and Japan University of California, San Diego The Graduate School,  International Relations and Pacific Studies 1993  – 1996 Attended the Global Policy and Strategy school at UC, San Diego  \n \nSpecialized in International Management & East Asia, specifically Korea and Japan University of California, San Diego The Graduate School,  International Relations and Pacific Studies 1993  – 1996 Attended the Global Policy and Strategy school at UC, San Diego  \n \nSpecialized in International Management & East Asia, specifically Korea and Japan University of California at Santa Barbara Bachelor of Arts,  Political Science - International Relations 1987  – 1992 Studied International Relations and Mathematics University of California at Santa Barbara Bachelor of Arts,  Political Science - International Relations 1987  – 1992 Studied International Relations and Mathematics University of California at Santa Barbara Bachelor of Arts,  Political Science - International Relations 1987  – 1992 Studied International Relations and Mathematics Yonsei University International Business/Trade/Commerce 1990  – 1991 Studied International Politics as an exchange student with the UC Santa Barbara EAP Program Yonsei University International Business/Trade/Commerce 1990  – 1991 Studied International Politics as an exchange student with the UC Santa Barbara EAP Program Yonsei University International Business/Trade/Commerce 1990  – 1991 Studied International Politics as an exchange student with the UC Santa Barbara EAP Program ", "Experience Senior Associate Director Stanford University Senior Associate Director Stanford University Senior Associate Director Stanford University ", "Experience Development Liaison, Bing Overseas Studies Program Stanford University July 2012  – Present (3 years 2 months) Stanford University Senior Associate Director Stanford University, Office of Development December 2000  – Present (14 years 9 months) Development Liaison, Bing Overseas Studies Program Stanford University July 2012  – Present (3 years 2 months) Stanford University Development Liaison, Bing Overseas Studies Program Stanford University July 2012  – Present (3 years 2 months) Stanford University Senior Associate Director Stanford University, Office of Development December 2000  – Present (14 years 9 months) Senior Associate Director Stanford University, Office of Development December 2000  – Present (14 years 9 months) ", "Experience Senior Associate Director Stanford University December 2014  – Present (9 months) The Stanford Fund in the Office of Development Associate Director Stanford University October 2012  –  December 2014  (2 years 3 months) The Stanford Fund in the Office of Development Associate Director of Capital Gifts for the Arts & Sciences Foundation University of North Carolina at Chapel Hill October 2009  –  August 2012  (2 years 11 months) Alumni Coordinator for the School of Law University of North Carolina at Chapel Hill July 2008  –  November 2009  (1 year 5 months) Media Intern McKinney September 2007  –  May 2008  (9 months) Sales/Marketing Intern Blackbaud May 2007  –  August 2007  (4 months) PR Intern Koroberi, Inc. January 2007  –  May 2007  (5 months) Intern WCTI TV 12 May 2006  –  August 2006  (4 months) Senior Associate Director Stanford University December 2014  – Present (9 months) The Stanford Fund in the Office of Development Senior Associate Director Stanford University December 2014  – Present (9 months) The Stanford Fund in the Office of Development Associate Director Stanford University October 2012  –  December 2014  (2 years 3 months) The Stanford Fund in the Office of Development Associate Director Stanford University October 2012  –  December 2014  (2 years 3 months) The Stanford Fund in the Office of Development Associate Director of Capital Gifts for the Arts & Sciences Foundation University of North Carolina at Chapel Hill October 2009  –  August 2012  (2 years 11 months) Associate Director of Capital Gifts for the Arts & Sciences Foundation University of North Carolina at Chapel Hill October 2009  –  August 2012  (2 years 11 months) Alumni Coordinator for the School of Law University of North Carolina at Chapel Hill July 2008  –  November 2009  (1 year 5 months) Alumni Coordinator for the School of Law University of North Carolina at Chapel Hill July 2008  –  November 2009  (1 year 5 months) Media Intern McKinney September 2007  –  May 2008  (9 months) Media Intern McKinney September 2007  –  May 2008  (9 months) Sales/Marketing Intern Blackbaud May 2007  –  August 2007  (4 months) Sales/Marketing Intern Blackbaud May 2007  –  August 2007  (4 months) PR Intern Koroberi, Inc. January 2007  –  May 2007  (5 months) PR Intern Koroberi, Inc. January 2007  –  May 2007  (5 months) Intern WCTI TV 12 May 2006  –  August 2006  (4 months) Intern WCTI TV 12 May 2006  –  August 2006  (4 months) Skills Running Tennis Creative Writing Fundraising Volunteer Management Individual Donor... Donor Solicitation Writing Painting Reading Alumni Relations Annual Giving Blogging Skills  Running Tennis Creative Writing Fundraising Volunteer Management Individual Donor... Donor Solicitation Writing Painting Reading Alumni Relations Annual Giving Blogging Running Tennis Creative Writing Fundraising Volunteer Management Individual Donor... Donor Solicitation Writing Painting Reading Alumni Relations Annual Giving Blogging Running Tennis Creative Writing Fundraising Volunteer Management Individual Donor... Donor Solicitation Writing Painting Reading Alumni Relations Annual Giving Blogging Education University of North Carolina at Chapel Hill BA 2004  – 2008 The Hotchkiss School 2001  – 2004 University of North Carolina at Chapel Hill BA 2004  – 2008 University of North Carolina at Chapel Hill BA 2004  – 2008 University of North Carolina at Chapel Hill BA 2004  – 2008 The Hotchkiss School 2001  – 2004 The Hotchkiss School 2001  – 2004 The Hotchkiss School 2001  – 2004 ", "Skills HTML Management Program Management Public Speaking Strategy Nonprofits Social Media Community Outreach Event Planning Adode Creative Suite Mac OS X Strategic Planning Public Relations cross Marketing Strategy Marketing Higher Education See 2+     See less Skills  HTML Management Program Management Public Speaking Strategy Nonprofits Social Media Community Outreach Event Planning Adode Creative Suite Mac OS X Strategic Planning Public Relations cross Marketing Strategy Marketing Higher Education See 2+     See less HTML Management Program Management Public Speaking Strategy Nonprofits Social Media Community Outreach Event Planning Adode Creative Suite Mac OS X Strategic Planning Public Relations cross Marketing Strategy Marketing Higher Education See 2+     See less HTML Management Program Management Public Speaking Strategy Nonprofits Social Media Community Outreach Event Planning Adode Creative Suite Mac OS X Strategic Planning Public Relations cross Marketing Strategy Marketing Higher Education See 2+     See less "]}