{"position": "Senior Research Associate", "company": "Stanford University", "profiles": ["Experience Owner OmniPro Business and Marketing Consulting Ltd. March 1992  – Present (23 years 6 months) Matsuva Marketing Management, Marketing Strategy development, Entrepreneurship, General Management General Manager OmniPro Business and Marketing Consulting Ltd. March 1992  – Present (23 years 6 months) General Management, Business Development Senior Lecturer Tel Aviv University 1991  –  1996  (5 years) Taught \"Business Plan Development and Implementation\". Senior Research Associate Stanford University 1983  –  1984  (1 year) Worked on \"Adaptive control for flexible arms\" related researches. Owner OmniPro Business and Marketing Consulting Ltd. March 1992  – Present (23 years 6 months) Matsuva Marketing Management, Marketing Strategy development, Entrepreneurship, General Management Owner OmniPro Business and Marketing Consulting Ltd. March 1992  – Present (23 years 6 months) Matsuva Marketing Management, Marketing Strategy development, Entrepreneurship, General Management General Manager OmniPro Business and Marketing Consulting Ltd. March 1992  – Present (23 years 6 months) General Management, Business Development General Manager OmniPro Business and Marketing Consulting Ltd. March 1992  – Present (23 years 6 months) General Management, Business Development Senior Lecturer Tel Aviv University 1991  –  1996  (5 years) Taught \"Business Plan Development and Implementation\". Senior Lecturer Tel Aviv University 1991  –  1996  (5 years) Taught \"Business Plan Development and Implementation\". Senior Research Associate Stanford University 1983  –  1984  (1 year) Worked on \"Adaptive control for flexible arms\" related researches. Senior Research Associate Stanford University 1983  –  1984  (1 year) Worked on \"Adaptive control for flexible arms\" related researches. Languages French Professional working proficiency Russian Limited working proficiency Hebrew Native or bilingual proficiency Romanian Native or bilingual proficiency Hungarian Native or bilingual proficiency Italian Elementary proficiency English Full professional proficiency French Professional working proficiency Russian Limited working proficiency Hebrew Native or bilingual proficiency Romanian Native or bilingual proficiency Hungarian Native or bilingual proficiency Italian Elementary proficiency English Full professional proficiency French Professional working proficiency Russian Limited working proficiency Hebrew Native or bilingual proficiency Romanian Native or bilingual proficiency Hungarian Native or bilingual proficiency Italian Elementary proficiency English Full professional proficiency Professional working proficiency Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Full professional proficiency Skills Marketing Strategy Public Relations Advertising Social Media Marketing Online Advertising Marketing Communications Marketing New Business Development SEO Digital Marketing Tourism Heritage Tourism Entrepreneurship Skills  Marketing Strategy Public Relations Advertising Social Media Marketing Online Advertising Marketing Communications Marketing New Business Development SEO Digital Marketing Tourism Heritage Tourism Entrepreneurship Marketing Strategy Public Relations Advertising Social Media Marketing Online Advertising Marketing Communications Marketing New Business Development SEO Digital Marketing Tourism Heritage Tourism Entrepreneurship Marketing Strategy Public Relations Advertising Social Media Marketing Online Advertising Marketing Communications Marketing New Business Development SEO Digital Marketing Tourism Heritage Tourism Entrepreneurship Education Tel Aviv University Master of Business Administration (M.B.A.),  Marketing/Marketing Management , General 1986  – 1991 Technion - Israel Institute of Technology Engineer’s Degree,  Electrical and Electronics Engineering 1966  – 1970 Tel Aviv University Master of Business Administration (M.B.A.),  Marketing/Marketing Management , General 1986  – 1991 Tel Aviv University Master of Business Administration (M.B.A.),  Marketing/Marketing Management , General 1986  – 1991 Tel Aviv University Master of Business Administration (M.B.A.),  Marketing/Marketing Management , General 1986  – 1991 Technion - Israel Institute of Technology Engineer’s Degree,  Electrical and Electronics Engineering 1966  – 1970 Technion - Israel Institute of Technology Engineer’s Degree,  Electrical and Electronics Engineering 1966  – 1970 Technion - Israel Institute of Technology Engineer’s Degree,  Electrical and Electronics Engineering 1966  – 1970 ", "Summary Accomplished life sciences professional with over 15 years of experience within the pharmaceutical industry. Skilled in business analytics, competitive intelligence, market research, strategic planning and executive consulting. Recognized for an ability to lead project teams that drive results. Summary Accomplished life sciences professional with over 15 years of experience within the pharmaceutical industry. Skilled in business analytics, competitive intelligence, market research, strategic planning and executive consulting. Recognized for an ability to lead project teams that drive results. Accomplished life sciences professional with over 15 years of experience within the pharmaceutical industry. Skilled in business analytics, competitive intelligence, market research, strategic planning and executive consulting. Recognized for an ability to lead project teams that drive results. Accomplished life sciences professional with over 15 years of experience within the pharmaceutical industry. Skilled in business analytics, competitive intelligence, market research, strategic planning and executive consulting. Recognized for an ability to lead project teams that drive results. Experience Cambridge Site Head of Novartis Knowledge Center Novartis October 2012  – Present (2 years 11 months) Cambridge, MA Competitive Intelligence Associate Director Novartis October 2012  –  January 2015  (2 years 4 months) Cambridge, MA Associate Director, Program Office Novartis 2006  –  October 2012  (6 years) Program Team Head Novartis 2002  –  2006  (4 years) Lab Head Novartis 1999  –  2002  (3 years) Senior Research Associate Stanford University 1996  –  1999  (3 years) Cambridge Site Head of Novartis Knowledge Center Novartis October 2012  – Present (2 years 11 months) Cambridge, MA Cambridge Site Head of Novartis Knowledge Center Novartis October 2012  – Present (2 years 11 months) Cambridge, MA Competitive Intelligence Associate Director Novartis October 2012  –  January 2015  (2 years 4 months) Cambridge, MA Competitive Intelligence Associate Director Novartis October 2012  –  January 2015  (2 years 4 months) Cambridge, MA Associate Director, Program Office Novartis 2006  –  October 2012  (6 years) Associate Director, Program Office Novartis 2006  –  October 2012  (6 years) Program Team Head Novartis 2002  –  2006  (4 years) Program Team Head Novartis 2002  –  2006  (4 years) Lab Head Novartis 1999  –  2002  (3 years) Lab Head Novartis 1999  –  2002  (3 years) Senior Research Associate Stanford University 1996  –  1999  (3 years) Senior Research Associate Stanford University 1996  –  1999  (3 years) Skills Drug Development Competitive Intelligence Lifesciences Pharmaceutical Industry Drug Discovery Market Research Biotechnology Skills  Drug Development Competitive Intelligence Lifesciences Pharmaceutical Industry Drug Discovery Market Research Biotechnology Drug Development Competitive Intelligence Lifesciences Pharmaceutical Industry Drug Discovery Market Research Biotechnology Drug Development Competitive Intelligence Lifesciences Pharmaceutical Industry Drug Discovery Market Research Biotechnology Education Babson College - Franklin W. Olin Graduate School of Business Chinese Academy of Sciences M.S. Study Stanford University Jane Coffin Childs Postdoctoral Fellow Stony Brook University Ph.D University of Science and Technology of China B.S. Babson College - Franklin W. Olin Graduate School of Business Babson College - Franklin W. Olin Graduate School of Business Babson College - Franklin W. Olin Graduate School of Business Chinese Academy of Sciences M.S. Study Chinese Academy of Sciences M.S. Study Chinese Academy of Sciences M.S. Study Stanford University Jane Coffin Childs Postdoctoral Fellow Stanford University Jane Coffin Childs Postdoctoral Fellow Stanford University Jane Coffin Childs Postdoctoral Fellow Stony Brook University Ph.D Stony Brook University Ph.D Stony Brook University Ph.D University of Science and Technology of China B.S. University of Science and Technology of China B.S. University of Science and Technology of China B.S. ", "Summary Expert in MEMS (MicroElectroMechanical Systems), microfluidics, silicon sensors and actuators for biomedical use and severe environments. Experience in instrument development for analytical chemistry including gas chromatography and liquid chromatography, with familiarity-by-exposure to mass spectrography, DNA sequencing, microfluidics, and medtech. Broad knowledge of materials and packaging techniques for circuits and sensors, including silicon fusion bonding and transient liquid phase bonding. Broad knowledge of different sensing techniques for various applications. Hands-on experience with MS Project, MS Office, SolidWorks, ACD Canvas, ANSYS, COMSOL, TK Solver, dw2000. Nodding acquaintance with Creo Elements. \n \nInventor or co-inventor on 54 US patents. See http://tinyurl.com/m66x8ew for a list. \n \nAuthor or co-author on about 40 distinct publications. See http://tinyurl.com/pn4bx3o for a list. Summary Expert in MEMS (MicroElectroMechanical Systems), microfluidics, silicon sensors and actuators for biomedical use and severe environments. Experience in instrument development for analytical chemistry including gas chromatography and liquid chromatography, with familiarity-by-exposure to mass spectrography, DNA sequencing, microfluidics, and medtech. Broad knowledge of materials and packaging techniques for circuits and sensors, including silicon fusion bonding and transient liquid phase bonding. Broad knowledge of different sensing techniques for various applications. Hands-on experience with MS Project, MS Office, SolidWorks, ACD Canvas, ANSYS, COMSOL, TK Solver, dw2000. Nodding acquaintance with Creo Elements. \n \nInventor or co-inventor on 54 US patents. See http://tinyurl.com/m66x8ew for a list. \n \nAuthor or co-author on about 40 distinct publications. See http://tinyurl.com/pn4bx3o for a list. Expert in MEMS (MicroElectroMechanical Systems), microfluidics, silicon sensors and actuators for biomedical use and severe environments. Experience in instrument development for analytical chemistry including gas chromatography and liquid chromatography, with familiarity-by-exposure to mass spectrography, DNA sequencing, microfluidics, and medtech. Broad knowledge of materials and packaging techniques for circuits and sensors, including silicon fusion bonding and transient liquid phase bonding. Broad knowledge of different sensing techniques for various applications. Hands-on experience with MS Project, MS Office, SolidWorks, ACD Canvas, ANSYS, COMSOL, TK Solver, dw2000. Nodding acquaintance with Creo Elements. \n \nInventor or co-inventor on 54 US patents. See http://tinyurl.com/m66x8ew for a list. \n \nAuthor or co-author on about 40 distinct publications. See http://tinyurl.com/pn4bx3o for a list. Expert in MEMS (MicroElectroMechanical Systems), microfluidics, silicon sensors and actuators for biomedical use and severe environments. Experience in instrument development for analytical chemistry including gas chromatography and liquid chromatography, with familiarity-by-exposure to mass spectrography, DNA sequencing, microfluidics, and medtech. Broad knowledge of materials and packaging techniques for circuits and sensors, including silicon fusion bonding and transient liquid phase bonding. Broad knowledge of different sensing techniques for various applications. Hands-on experience with MS Project, MS Office, SolidWorks, ACD Canvas, ANSYS, COMSOL, TK Solver, dw2000. Nodding acquaintance with Creo Elements. \n \nInventor or co-inventor on 54 US patents. See http://tinyurl.com/m66x8ew for a list. \n \nAuthor or co-author on about 40 distinct publications. See http://tinyurl.com/pn4bx3o for a list. Experience Member, Extended Team Small Tech Consulting, LLC January 2015  – Present (8 months) Menlo Park, CA The company specializes in MEMS and Nanotechnology, Materials Characterization and Photonics. Project scope includes detailed technical and prototype services, IP, due diligence and strategy. Master Research Scientist, Agilent Labs Agilent Technologies November 1999  –  January 2015  (15 years 3 months) Santa Clara, California (Agilent Labs began as a part of HP Labs and became a separate lab as Agilent spun out from Hewlett-Packard in 1999.) \n \n● Developed detectors for gas chromatography systems. \n● Developed microfluidic switching systems for optical crosspoint switching. \n● Fabricated and tested synthetic nanopores for long-strand DNA translocation aimed at the \"thousand-dollar-genome\" sequencing effort. \n● Worked on ultra-high-pressure microfluidics for liquid chromatography. Master Research Scientist, HP Labs Hewlett-Packard November 1989  –  November 1999  (10 years 1 month) Palo Alto, California ● Designed and built silicon microvalves for gas chromatography systems. \n● Improved air management for inkjet deposition systems. \n● Developed massively parallel ink jet deposition systems for cDNA deposition. \n● With Kaigham Gabriel (at that time at DARPA), briefed Secretary of Defense William Perry on MEMS (MicroElectricoMechanical Systems) at Perry's Pentagon office. May 1995. Vice President/Chief Scientist NovaSensor (now part of Amphenol Advanced Sensors) January 1986  –  November 1989  (3 years 11 months) Fremont, CA Semiconductor sensor and actuator design, layout, fabrication, and packaging in a startup environment. \n \n● Developed piezoresistive pressure sensors and accelerometers, silicon microvalves. Approximately 31 designs were put into production over 4 years.  \n● Pioneered silicon fusion bonding for sensors. \n● Pioneered ion implanted resistors for pressure sensors. \n● Developed a general-purpose instant-on-stability design and process for piezoresistive pressure sensors.  \n● Developed dielectrically isolated high-temperature pressure sensors.  \n● Developed high-dynamic range ultrasonic pressure sensors.  \n● Developed ultra-high-pressure piezoresistive pressure sensors for blast measurement. \n● Developed a piezoresistive accelerometer with bi-directional mechanical over-range stops. Senior Research Associate Stanford University January 1980  –  January 1986  (6 years 1 month) Developed silicon sensors for biomedical and robotics applications \n \n● Developed piezoresistive pressure sensors packaged for in-vivo use. \n● Used piezoresistive pressure sensors to measure in-tissue pressures in a pig model to characterize pressures characteristic of bedsore development in humans. \n● Developed linear thermometer arrays on flexible polyimide ribbons for measurement of temperature profiles during hyperthermia treament of cancor tumors. \n● Developed an early attempt at \"robot skin\": Flexible polyimide sheets with embedded force sensors. \n● Co-authored a 1984 Scientific American article on silicon micromachining technology for sensors and analytical instruments. Member, Extended Team Small Tech Consulting, LLC January 2015  – Present (8 months) Menlo Park, CA The company specializes in MEMS and Nanotechnology, Materials Characterization and Photonics. Project scope includes detailed technical and prototype services, IP, due diligence and strategy. Member, Extended Team Small Tech Consulting, LLC January 2015  – Present (8 months) Menlo Park, CA The company specializes in MEMS and Nanotechnology, Materials Characterization and Photonics. Project scope includes detailed technical and prototype services, IP, due diligence and strategy. Master Research Scientist, Agilent Labs Agilent Technologies November 1999  –  January 2015  (15 years 3 months) Santa Clara, California (Agilent Labs began as a part of HP Labs and became a separate lab as Agilent spun out from Hewlett-Packard in 1999.) \n \n● Developed detectors for gas chromatography systems. \n● Developed microfluidic switching systems for optical crosspoint switching. \n● Fabricated and tested synthetic nanopores for long-strand DNA translocation aimed at the \"thousand-dollar-genome\" sequencing effort. \n● Worked on ultra-high-pressure microfluidics for liquid chromatography. Master Research Scientist, Agilent Labs Agilent Technologies November 1999  –  January 2015  (15 years 3 months) Santa Clara, California (Agilent Labs began as a part of HP Labs and became a separate lab as Agilent spun out from Hewlett-Packard in 1999.) \n \n● Developed detectors for gas chromatography systems. \n● Developed microfluidic switching systems for optical crosspoint switching. \n● Fabricated and tested synthetic nanopores for long-strand DNA translocation aimed at the \"thousand-dollar-genome\" sequencing effort. \n● Worked on ultra-high-pressure microfluidics for liquid chromatography. Master Research Scientist, HP Labs Hewlett-Packard November 1989  –  November 1999  (10 years 1 month) Palo Alto, California ● Designed and built silicon microvalves for gas chromatography systems. \n● Improved air management for inkjet deposition systems. \n● Developed massively parallel ink jet deposition systems for cDNA deposition. \n● With Kaigham Gabriel (at that time at DARPA), briefed Secretary of Defense William Perry on MEMS (MicroElectricoMechanical Systems) at Perry's Pentagon office. May 1995. Master Research Scientist, HP Labs Hewlett-Packard November 1989  –  November 1999  (10 years 1 month) Palo Alto, California ● Designed and built silicon microvalves for gas chromatography systems. \n● Improved air management for inkjet deposition systems. \n● Developed massively parallel ink jet deposition systems for cDNA deposition. \n● With Kaigham Gabriel (at that time at DARPA), briefed Secretary of Defense William Perry on MEMS (MicroElectricoMechanical Systems) at Perry's Pentagon office. May 1995. Vice President/Chief Scientist NovaSensor (now part of Amphenol Advanced Sensors) January 1986  –  November 1989  (3 years 11 months) Fremont, CA Semiconductor sensor and actuator design, layout, fabrication, and packaging in a startup environment. \n \n● Developed piezoresistive pressure sensors and accelerometers, silicon microvalves. Approximately 31 designs were put into production over 4 years.  \n● Pioneered silicon fusion bonding for sensors. \n● Pioneered ion implanted resistors for pressure sensors. \n● Developed a general-purpose instant-on-stability design and process for piezoresistive pressure sensors.  \n● Developed dielectrically isolated high-temperature pressure sensors.  \n● Developed high-dynamic range ultrasonic pressure sensors.  \n● Developed ultra-high-pressure piezoresistive pressure sensors for blast measurement. \n● Developed a piezoresistive accelerometer with bi-directional mechanical over-range stops. Vice President/Chief Scientist NovaSensor (now part of Amphenol Advanced Sensors) January 1986  –  November 1989  (3 years 11 months) Fremont, CA Semiconductor sensor and actuator design, layout, fabrication, and packaging in a startup environment. \n \n● Developed piezoresistive pressure sensors and accelerometers, silicon microvalves. Approximately 31 designs were put into production over 4 years.  \n● Pioneered silicon fusion bonding for sensors. \n● Pioneered ion implanted resistors for pressure sensors. \n● Developed a general-purpose instant-on-stability design and process for piezoresistive pressure sensors.  \n● Developed dielectrically isolated high-temperature pressure sensors.  \n● Developed high-dynamic range ultrasonic pressure sensors.  \n● Developed ultra-high-pressure piezoresistive pressure sensors for blast measurement. \n● Developed a piezoresistive accelerometer with bi-directional mechanical over-range stops. Senior Research Associate Stanford University January 1980  –  January 1986  (6 years 1 month) Developed silicon sensors for biomedical and robotics applications \n \n● Developed piezoresistive pressure sensors packaged for in-vivo use. \n● Used piezoresistive pressure sensors to measure in-tissue pressures in a pig model to characterize pressures characteristic of bedsore development in humans. \n● Developed linear thermometer arrays on flexible polyimide ribbons for measurement of temperature profiles during hyperthermia treament of cancor tumors. \n● Developed an early attempt at \"robot skin\": Flexible polyimide sheets with embedded force sensors. \n● Co-authored a 1984 Scientific American article on silicon micromachining technology for sensors and analytical instruments. Senior Research Associate Stanford University January 1980  –  January 1986  (6 years 1 month) Developed silicon sensors for biomedical and robotics applications \n \n● Developed piezoresistive pressure sensors packaged for in-vivo use. \n● Used piezoresistive pressure sensors to measure in-tissue pressures in a pig model to characterize pressures characteristic of bedsore development in humans. \n● Developed linear thermometer arrays on flexible polyimide ribbons for measurement of temperature profiles during hyperthermia treament of cancor tumors. \n● Developed an early attempt at \"robot skin\": Flexible polyimide sheets with embedded force sensors. \n● Co-authored a 1984 Scientific American article on silicon micromachining technology for sensors and analytical instruments. Skills Sensors Semiconductors R&D MEMS Nanotechnology Start-ups Testing Patents Characterization Silicon Analytical Chemistry Medical Devices Systems Engineering Electronics Microfluidics Inkjet Electrical Engineering Packaging See 3+     See less Skills  Sensors Semiconductors R&D MEMS Nanotechnology Start-ups Testing Patents Characterization Silicon Analytical Chemistry Medical Devices Systems Engineering Electronics Microfluidics Inkjet Electrical Engineering Packaging See 3+     See less Sensors Semiconductors R&D MEMS Nanotechnology Start-ups Testing Patents Characterization Silicon Analytical Chemistry Medical Devices Systems Engineering Electronics Microfluidics Inkjet Electrical Engineering Packaging See 3+     See less Sensors Semiconductors R&D MEMS Nanotechnology Start-ups Testing Patents Characterization Silicon Analytical Chemistry Medical Devices Systems Engineering Electronics Microfluidics Inkjet Electrical Engineering Packaging See 3+     See less Education Stanford University Ph.D.,  Electrical Engineering 1974  – 1980 Activities and Societies:  Member of Stanford Savoyards Stanford University M.S.,  Electrical Engineering 1973  – 1974 NSF Fellowship; \nCourse sequence specialized towards integrated circuit technology. University of Notre Dame B.S.,  Electrical Engineering 1969  – 1973 National Merit Scholar \nJos. E. Seagram & Sons scholarship Stanford University Ph.D.,  Electrical Engineering 1974  – 1980 Activities and Societies:  Member of Stanford Savoyards Stanford University Ph.D.,  Electrical Engineering 1974  – 1980 Activities and Societies:  Member of Stanford Savoyards Stanford University Ph.D.,  Electrical Engineering 1974  – 1980 Activities and Societies:  Member of Stanford Savoyards Stanford University M.S.,  Electrical Engineering 1973  – 1974 NSF Fellowship; \nCourse sequence specialized towards integrated circuit technology. Stanford University M.S.,  Electrical Engineering 1973  – 1974 NSF Fellowship; \nCourse sequence specialized towards integrated circuit technology. Stanford University M.S.,  Electrical Engineering 1973  – 1974 NSF Fellowship; \nCourse sequence specialized towards integrated circuit technology. University of Notre Dame B.S.,  Electrical Engineering 1969  – 1973 National Merit Scholar \nJos. E. Seagram & Sons scholarship University of Notre Dame B.S.,  Electrical Engineering 1969  – 1973 National Merit Scholar \nJos. E. Seagram & Sons scholarship University of Notre Dame B.S.,  Electrical Engineering 1969  – 1973 National Merit Scholar \nJos. E. Seagram & Sons scholarship Honors & Awards Additional Honors & Awards Member, Eta Kappa Nu electrical engineering honor fraternity. Additional Honors & Awards Member, Eta Kappa Nu electrical engineering honor fraternity. Additional Honors & Awards Member, Eta Kappa Nu electrical engineering honor fraternity. Additional Honors & Awards Member, Eta Kappa Nu electrical engineering honor fraternity. ", "Experience Chief Executive Officer and CTO Mycell Technologies LLC / Oceans Omega LLC July 2014  – Present (1 year 2 months) New Jersey, USA Oceans Omega, a subsidiary of Mycell Technologies, is a specialty ingredients company, providing Omega-3 ingredient solutions for the food and beverage industries, Oceans Omega's innovative products, development services and unique know-how, offer exceptional advancements for easy incorporation and stabilization of Omega-3s in many food and beverage products. This enables fortification with Omega-3 nutrition without impact on taste, odor, appearance or texture. Visit us at www.oceansomega.com Member of the Board of Directors Gaussin S.A. January 2007  – Present (8 years 8 months) Belfort Area, France Working to meet the worldwide need to optimise the movement of heavy, difficult or bulky goods, GAUSSIN Manugistique is an engineering company offering innovative and specialised products and services in wheeled handling systems. Chief Financial Officer SyncEvolution S.à.r.L. July 2006  – Present (9 years 2 months) Strasbourg Area, France SyncEvolution is a software development company, that creates collaborative document management solutions for small and mid-size companies. Its flagship product eDocSync provides a fully secured and stand-alone documentary network for your company. I creates a serverless document infrastructure: the eDocSync suite is the only full P2P document management, synchronization and collaboration system in the market. It enables you to fully protect the confidentiality of your business, by keeping full control of your business documents and contacts: no documents stored in the cloud. Chief Operating Officer & CTO Mycell Technologies LLC June 2009  –  June 2014  (5 years 1 month) Greater New York City Area Member of the Board of Directors Navigate AG June 2007  –  January 2010  (2 years 8 months) Karlsruhe Area, Germany Chief Technology Officer Zymes, LLC January 2008  –  June 2009  (1 year 6 months) Greater New York City Area Vice President Global Business and Technology Development Zymes LLC November 2006  –  December 2007  (1 year 2 months) Greater New York City Area Vice President Equity Research Deutsche Bank AG July 2006  –  October 2006  (4 months) Frankfurt Am Main Area, Germany Global New Business Development Manager BASF AG July 2005  –  June 2006  (1 year) Mannheim Area, Germany Head of Research Laboratory BASF-AG March 2002  –  June 2005  (3 years 4 months) Mannheim Area, Germany Senior Research Associate Stanford University February 2001  –  March 2002  (1 year 2 months) San Francisco Bay Area Invited Research Associate Forschungszentrum Karlsruhe GmbH, Institute of Nanotechnology December 2000  –  February 2001  (3 months) Karlsruhe Area, Germany Chief Executive Officer and CTO Mycell Technologies LLC / Oceans Omega LLC July 2014  – Present (1 year 2 months) New Jersey, USA Oceans Omega, a subsidiary of Mycell Technologies, is a specialty ingredients company, providing Omega-3 ingredient solutions for the food and beverage industries, Oceans Omega's innovative products, development services and unique know-how, offer exceptional advancements for easy incorporation and stabilization of Omega-3s in many food and beverage products. This enables fortification with Omega-3 nutrition without impact on taste, odor, appearance or texture. Visit us at www.oceansomega.com Chief Executive Officer and CTO Mycell Technologies LLC / Oceans Omega LLC July 2014  – Present (1 year 2 months) New Jersey, USA Oceans Omega, a subsidiary of Mycell Technologies, is a specialty ingredients company, providing Omega-3 ingredient solutions for the food and beverage industries, Oceans Omega's innovative products, development services and unique know-how, offer exceptional advancements for easy incorporation and stabilization of Omega-3s in many food and beverage products. This enables fortification with Omega-3 nutrition without impact on taste, odor, appearance or texture. Visit us at www.oceansomega.com Member of the Board of Directors Gaussin S.A. January 2007  – Present (8 years 8 months) Belfort Area, France Working to meet the worldwide need to optimise the movement of heavy, difficult or bulky goods, GAUSSIN Manugistique is an engineering company offering innovative and specialised products and services in wheeled handling systems. Member of the Board of Directors Gaussin S.A. January 2007  – Present (8 years 8 months) Belfort Area, France Working to meet the worldwide need to optimise the movement of heavy, difficult or bulky goods, GAUSSIN Manugistique is an engineering company offering innovative and specialised products and services in wheeled handling systems. Chief Financial Officer SyncEvolution S.à.r.L. July 2006  – Present (9 years 2 months) Strasbourg Area, France SyncEvolution is a software development company, that creates collaborative document management solutions for small and mid-size companies. Its flagship product eDocSync provides a fully secured and stand-alone documentary network for your company. I creates a serverless document infrastructure: the eDocSync suite is the only full P2P document management, synchronization and collaboration system in the market. It enables you to fully protect the confidentiality of your business, by keeping full control of your business documents and contacts: no documents stored in the cloud. Chief Financial Officer SyncEvolution S.à.r.L. July 2006  – Present (9 years 2 months) Strasbourg Area, France SyncEvolution is a software development company, that creates collaborative document management solutions for small and mid-size companies. Its flagship product eDocSync provides a fully secured and stand-alone documentary network for your company. I creates a serverless document infrastructure: the eDocSync suite is the only full P2P document management, synchronization and collaboration system in the market. It enables you to fully protect the confidentiality of your business, by keeping full control of your business documents and contacts: no documents stored in the cloud. Chief Operating Officer & CTO Mycell Technologies LLC June 2009  –  June 2014  (5 years 1 month) Greater New York City Area Chief Operating Officer & CTO Mycell Technologies LLC June 2009  –  June 2014  (5 years 1 month) Greater New York City Area Member of the Board of Directors Navigate AG June 2007  –  January 2010  (2 years 8 months) Karlsruhe Area, Germany Member of the Board of Directors Navigate AG June 2007  –  January 2010  (2 years 8 months) Karlsruhe Area, Germany Chief Technology Officer Zymes, LLC January 2008  –  June 2009  (1 year 6 months) Greater New York City Area Chief Technology Officer Zymes, LLC January 2008  –  June 2009  (1 year 6 months) Greater New York City Area Vice President Global Business and Technology Development Zymes LLC November 2006  –  December 2007  (1 year 2 months) Greater New York City Area Vice President Global Business and Technology Development Zymes LLC November 2006  –  December 2007  (1 year 2 months) Greater New York City Area Vice President Equity Research Deutsche Bank AG July 2006  –  October 2006  (4 months) Frankfurt Am Main Area, Germany Vice President Equity Research Deutsche Bank AG July 2006  –  October 2006  (4 months) Frankfurt Am Main Area, Germany Global New Business Development Manager BASF AG July 2005  –  June 2006  (1 year) Mannheim Area, Germany Global New Business Development Manager BASF AG July 2005  –  June 2006  (1 year) Mannheim Area, Germany Head of Research Laboratory BASF-AG March 2002  –  June 2005  (3 years 4 months) Mannheim Area, Germany Head of Research Laboratory BASF-AG March 2002  –  June 2005  (3 years 4 months) Mannheim Area, Germany Senior Research Associate Stanford University February 2001  –  March 2002  (1 year 2 months) San Francisco Bay Area Senior Research Associate Stanford University February 2001  –  March 2002  (1 year 2 months) San Francisco Bay Area Invited Research Associate Forschungszentrum Karlsruhe GmbH, Institute of Nanotechnology December 2000  –  February 2001  (3 months) Karlsruhe Area, Germany Invited Research Associate Forschungszentrum Karlsruhe GmbH, Institute of Nanotechnology December 2000  –  February 2001  (3 months) Karlsruhe Area, Germany Languages German Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency German Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency German Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Entrepreneurship General Management Business Strategy Operations Management Strategic Planning Supply Chain Management Intellectual Property... Technology... Cross-functional Team... Strategic Partnership... Investment Banking Fundraising Deal Making Cross-Cultural... Team Building International Project... Production Management Technology Development... Chemistry Fine Chemical Process... Formulation Development Chemical Engineering Consumer Product... Chemical and... Angel Investing Chemical Production Managment Partnerships New Business Development Formulation International Business Commercialization Mergers & Acquisitions Product Development Cross-cultural Teams International Sales Start-ups Executive Management Strategy R&D See 25+     See less Skills  Entrepreneurship General Management Business Strategy Operations Management Strategic Planning Supply Chain Management Intellectual Property... Technology... Cross-functional Team... Strategic Partnership... Investment Banking Fundraising Deal Making Cross-Cultural... Team Building International Project... Production Management Technology Development... Chemistry Fine Chemical Process... Formulation Development Chemical Engineering Consumer Product... Chemical and... Angel Investing Chemical Production Managment Partnerships New Business Development Formulation International Business Commercialization Mergers & Acquisitions Product Development Cross-cultural Teams International Sales Start-ups Executive Management Strategy R&D See 25+     See less Entrepreneurship General Management Business Strategy Operations Management Strategic Planning Supply Chain Management Intellectual Property... Technology... Cross-functional Team... Strategic Partnership... Investment Banking Fundraising Deal Making Cross-Cultural... Team Building International Project... Production Management Technology Development... Chemistry Fine Chemical Process... Formulation Development Chemical Engineering Consumer Product... Chemical and... Angel Investing Chemical Production Managment Partnerships New Business Development Formulation International Business Commercialization Mergers & Acquisitions Product Development Cross-cultural Teams International Sales Start-ups Executive Management Strategy R&D See 25+     See less Entrepreneurship General Management Business Strategy Operations Management Strategic Planning Supply Chain Management Intellectual Property... Technology... Cross-functional Team... Strategic Partnership... Investment Banking Fundraising Deal Making Cross-Cultural... Team Building International Project... Production Management Technology Development... Chemistry Fine Chemical Process... Formulation Development Chemical Engineering Consumer Product... Chemical and... Angel Investing Chemical Production Managment Partnerships New Business Development Formulation International Business Commercialization Mergers & Acquisitions Product Development Cross-cultural Teams International Sales Start-ups Executive Management Strategy R&D See 25+     See less Education Concordia University, John Molson School of Business, Montréal, Canada M.B.A. (Executive) April 2003  – October 2004 Stanford University, School of Humanities & Sciences, USA Post-Doc 2001  – 2002 University Louis Pasteur, ISIS - Institut de Science et d'Ingénierie Supramoléculaires, Strasbourg, France Ph.D. 1996  – 2000 EHICS (European Higher Institute of Chemistry and Chemical Engineering), Strasbourg, France Ingénieur September 1993  – March 1996 ETH (Swiss Federal Institute of Technology), Zurich, Switzerland M.Sc. 1996  – 1996 Technical University of Karlsruhe, Germany B.Sc. October 1991  – September 1993 Concordia University, John Molson School of Business, Montréal, Canada M.B.A. (Executive) April 2003  – October 2004 Concordia University, John Molson School of Business, Montréal, Canada M.B.A. (Executive) April 2003  – October 2004 Concordia University, John Molson School of Business, Montréal, Canada M.B.A. (Executive) April 2003  – October 2004 Stanford University, School of Humanities & Sciences, USA Post-Doc 2001  – 2002 Stanford University, School of Humanities & Sciences, USA Post-Doc 2001  – 2002 Stanford University, School of Humanities & Sciences, USA Post-Doc 2001  – 2002 University Louis Pasteur, ISIS - Institut de Science et d'Ingénierie Supramoléculaires, Strasbourg, France Ph.D. 1996  – 2000 University Louis Pasteur, ISIS - Institut de Science et d'Ingénierie Supramoléculaires, Strasbourg, France Ph.D. 1996  – 2000 University Louis Pasteur, ISIS - Institut de Science et d'Ingénierie Supramoléculaires, Strasbourg, France Ph.D. 1996  – 2000 EHICS (European Higher Institute of Chemistry and Chemical Engineering), Strasbourg, France Ingénieur September 1993  – March 1996 EHICS (European Higher Institute of Chemistry and Chemical Engineering), Strasbourg, France Ingénieur September 1993  – March 1996 EHICS (European Higher Institute of Chemistry and Chemical Engineering), Strasbourg, France Ingénieur September 1993  – March 1996 ETH (Swiss Federal Institute of Technology), Zurich, Switzerland M.Sc. 1996  – 1996 ETH (Swiss Federal Institute of Technology), Zurich, Switzerland M.Sc. 1996  – 1996 ETH (Swiss Federal Institute of Technology), Zurich, Switzerland M.Sc. 1996  – 1996 Technical University of Karlsruhe, Germany B.Sc. October 1991  – September 1993 Technical University of Karlsruhe, Germany B.Sc. October 1991  – September 1993 Technical University of Karlsruhe, Germany B.Sc. October 1991  – September 1993 Honors & Awards ", "Experience Professor University of Hawaii March 2003  – Present (12 years 6 months) School of Nursing and Dental Hygiene Research Professor University of Hawaii March 2003  – Present (12 years 6 months) School of Nursing and Dental Hygiene Research Professor University of Hawaii March 2003  – Present (12 years 6 months) School of Nursing and Dental Hygiene Research Skills Public Health Program Evaluation Epidemiology Grant Writing Research Design Program Development Psychology Grants Health Education Skills  Public Health Program Evaluation Epidemiology Grant Writing Research Design Program Development Psychology Grants Health Education Public Health Program Evaluation Epidemiology Grant Writing Research Design Program Development Psychology Grants Health Education Public Health Program Evaluation Epidemiology Grant Writing Research Design Program Development Psychology Grants Health Education ", "Experience Senior Research Associate Stanford University August 2003  – Present (12 years 1 month) Postdoctoral Research Fellow UCSF July 1995  –  March 2000  (4 years 9 months) San Francisco, CA Conducted research on the mechanism of telomerase activity and the contribution of telomerase RNA towards catalytic activity. Senior Research Associate Stanford University August 2003  – Present (12 years 1 month) Senior Research Associate Stanford University August 2003  – Present (12 years 1 month) Postdoctoral Research Fellow UCSF July 1995  –  March 2000  (4 years 9 months) San Francisco, CA Conducted research on the mechanism of telomerase activity and the contribution of telomerase RNA towards catalytic activity. Postdoctoral Research Fellow UCSF July 1995  –  March 2000  (4 years 9 months) San Francisco, CA Conducted research on the mechanism of telomerase activity and the contribution of telomerase RNA towards catalytic activity. Skills Molecular Biology Skills  Molecular Biology Molecular Biology Molecular Biology Education Carnegie-Mellon University Doctor of Philosophy,  Biological Sciences 1988  – 1995 St. Xavier's College Bachelor of Science,  Chemistry ,  Biochemistry , A 1983  – 1988 Carnegie-Mellon University Doctor of Philosophy,  Biological Sciences 1988  – 1995 Carnegie-Mellon University Doctor of Philosophy,  Biological Sciences 1988  – 1995 Carnegie-Mellon University Doctor of Philosophy,  Biological Sciences 1988  – 1995 St. Xavier's College Bachelor of Science,  Chemistry ,  Biochemistry , A 1983  – 1988 St. Xavier's College Bachelor of Science,  Chemistry ,  Biochemistry , A 1983  – 1988 St. Xavier's College Bachelor of Science,  Chemistry ,  Biochemistry , A 1983  – 1988 ", "Experience PI KBSI Senior Research Associate Stanford University School of Medicine September 1999  –  June 2006  (6 years 10 months) Working at the Department of Biochemistry PI KBSI PI KBSI Senior Research Associate Stanford University School of Medicine September 1999  –  June 2006  (6 years 10 months) Working at the Department of Biochemistry Senior Research Associate Stanford University School of Medicine September 1999  –  June 2006  (6 years 10 months) Working at the Department of Biochemistry Education Yonsei University Ph.D.,  Microbiology Yonsei University Ph.D.,  Microbiology Yonsei University Ph.D.,  Microbiology Yonsei University Ph.D.,  Microbiology ", "Summary While most people can claim depth to their experience and education within their discipline, I am better characterized by breadth across disciplines as well as depth within. I am truly transdiciplinary with an undergraduate degree in Computer Science and doctoral degree in Genetics, 6 years of professional programming experience accumulated between these degrees and significant coursework and experience in statistics throughout my career.  \n \nMy strongest skill and experience is high performance computing and novel algorithm development working with massive datasets that pose many technical challenges in addition to just their sheer size. Strong programming skills in C, multithreaded parallelizaton, MPI, and more recently developing skills in GP-GPU programming, has enabled a great deal of my Ph.D. work in genomics to be successful as well as that following as a Research Associate at Cornell University.  \n \nI am often the problem solver in a group environment as a direct result of having a broad educational background and work experience to draw on, but also from having many ideas to offer. The best way to stumble on a great idea is to have a lot of them. I also often function as a \"translator\" between different disciplines as much of the current projects I work on employ people highly specialized in one of molecular biology, quantitative genetics, population genetics, statistics, computer science (programming), information technology (infrastructure), and information management (database administration) and I have some experience in all of these areas, and significant experience in programming, statistics, population genetics, quantitative genetics, and information technology infrastructure. Summary While most people can claim depth to their experience and education within their discipline, I am better characterized by breadth across disciplines as well as depth within. I am truly transdiciplinary with an undergraduate degree in Computer Science and doctoral degree in Genetics, 6 years of professional programming experience accumulated between these degrees and significant coursework and experience in statistics throughout my career.  \n \nMy strongest skill and experience is high performance computing and novel algorithm development working with massive datasets that pose many technical challenges in addition to just their sheer size. Strong programming skills in C, multithreaded parallelizaton, MPI, and more recently developing skills in GP-GPU programming, has enabled a great deal of my Ph.D. work in genomics to be successful as well as that following as a Research Associate at Cornell University.  \n \nI am often the problem solver in a group environment as a direct result of having a broad educational background and work experience to draw on, but also from having many ideas to offer. The best way to stumble on a great idea is to have a lot of them. I also often function as a \"translator\" between different disciplines as much of the current projects I work on employ people highly specialized in one of molecular biology, quantitative genetics, population genetics, statistics, computer science (programming), information technology (infrastructure), and information management (database administration) and I have some experience in all of these areas, and significant experience in programming, statistics, population genetics, quantitative genetics, and information technology infrastructure. While most people can claim depth to their experience and education within their discipline, I am better characterized by breadth across disciplines as well as depth within. I am truly transdiciplinary with an undergraduate degree in Computer Science and doctoral degree in Genetics, 6 years of professional programming experience accumulated between these degrees and significant coursework and experience in statistics throughout my career.  \n \nMy strongest skill and experience is high performance computing and novel algorithm development working with massive datasets that pose many technical challenges in addition to just their sheer size. Strong programming skills in C, multithreaded parallelizaton, MPI, and more recently developing skills in GP-GPU programming, has enabled a great deal of my Ph.D. work in genomics to be successful as well as that following as a Research Associate at Cornell University.  \n \nI am often the problem solver in a group environment as a direct result of having a broad educational background and work experience to draw on, but also from having many ideas to offer. The best way to stumble on a great idea is to have a lot of them. I also often function as a \"translator\" between different disciplines as much of the current projects I work on employ people highly specialized in one of molecular biology, quantitative genetics, population genetics, statistics, computer science (programming), information technology (infrastructure), and information management (database administration) and I have some experience in all of these areas, and significant experience in programming, statistics, population genetics, quantitative genetics, and information technology infrastructure. While most people can claim depth to their experience and education within their discipline, I am better characterized by breadth across disciplines as well as depth within. I am truly transdiciplinary with an undergraduate degree in Computer Science and doctoral degree in Genetics, 6 years of professional programming experience accumulated between these degrees and significant coursework and experience in statistics throughout my career.  \n \nMy strongest skill and experience is high performance computing and novel algorithm development working with massive datasets that pose many technical challenges in addition to just their sheer size. Strong programming skills in C, multithreaded parallelizaton, MPI, and more recently developing skills in GP-GPU programming, has enabled a great deal of my Ph.D. work in genomics to be successful as well as that following as a Research Associate at Cornell University.  \n \nI am often the problem solver in a group environment as a direct result of having a broad educational background and work experience to draw on, but also from having many ideas to offer. The best way to stumble on a great idea is to have a lot of them. I also often function as a \"translator\" between different disciplines as much of the current projects I work on employ people highly specialized in one of molecular biology, quantitative genetics, population genetics, statistics, computer science (programming), information technology (infrastructure), and information management (database administration) and I have some experience in all of these areas, and significant experience in programming, statistics, population genetics, quantitative genetics, and information technology infrastructure. Experience Senior Research Associate Stanford University School of Medicine August 2014  – Present (1 year 1 month) Stanford, California I am currently working on developing further computational methods for resolving local ancestry in admixed populations, building on methods previously developed in Carlos Bustamante's group at Stanford. The methodology is based on machine learning techniques, specifically a random forest classifier combined with maximizing the conditional random field over the random forest classification probabilities for discrete windows across the genome of fixed genetic size. Primary goals are to improve scalability of the method to very large datasets in terms of both markers and individuals, and to improve usability for both users at large and users internal to our group. Secondary goals, being pursued in tandem, are to refine accuracy and sensitivity and perform extensive validation of the program. \n \nI am also interested in recently developed long read high throughput sequencing and exploring pilot datasets as they become available to the lab. The pros and cons of different approaches coming to market are not clear and depend on the use case. My work currently involves data from an early, low coverage variant of the moleculo synthetic long read technology but is expanding in the near future to newer technologies and higher sequencing depths as costs continue to decrease. Research Associate (Academic) Cornell University May 2010  –  July 2014  (4 years 3 months) Ithaca, New York Area Supervisor: Susan R. McCouch \n \n* Development of novel algorithms, methods, programs, pipelines, and statistical models to solve the unique challenges of several projects in this position, some of which listed below \n* Development of a High Density Rice Array (HDRA) targeting over 1 million SNPs segregating in cultivated and wild Asian and African rice populations, featuring a novel internal control mechanism for accuracy estimation & sample QC, methylation targets, and invariant probes for normalization and copy number variation detection.  \n* SNP discovery through pooled data generation from an ad hoc consortium backing the development of the HDRA described above. Challenges posed by unexpected very high diversity levels and subpopulation divergence forced development of more sensitive next generation sequencing analysis tools than available at the time \n* Development of smaller, \"breeder's chips\" - 384 Illumina BeadExpress arrays and more recently a 6K bead chip replacing legacy chips and providing expanded mapping resolution to a broader range of germplasm \n* Analysis of rice subpopulation structure, evolution, and domestication \n* Integration of genome local subpopulation information into genotyping calling methods and GWAS analyses \n* Broad support of the group's Genome Wide Association Mapping analyses through development of the genotyping technologies, primary genomics analysis methods (genotype calling), dataset management, and support of personnel long term responsible for data versioning, archiving, and distribution. \n* Concept development for grants and publications \n* General troubleshooting efforts and problem solving across many projects throughout the broader research group \n* Genotype-by-sequencing analysis methodology and development \n* Extensive IT duties to support all of this work Graduate Student Cornell University 2004  –  2010  (6 years) Ithaca, New York Area Adviser & Committee Chair: Carlos D. Bustamante \n \nAs a graduate student I did much the same type of research that I am now doing as a research associate, but in addition I also worked with several systems other than rice including human, cattle, dogs, and drosophila (fruit flies). In the first few years I spent some time at the lab bench learning molecular biology techniques. Gaining a background in this area has served me well in working together with experimentalists and molecular biologists while myself being primarily a computational biologist and high performance programmer handling very large genomic datasets. Often the people specializing in each of these fields can not communicate effectively between disciplines because neither side understands the complexity of the other. A primary goal for me in going to graduate school in genetics while coming from a computer science and professional programming background was to gain the ability to bridge this gap. This goal was certainly achieved as it is now one of my primary functions in my current position as a researcher at Cornell. Programmer/Analyst researcher Cornell University 2001  –  2004  (3 years) Ithaca, New York Area Supervisor: Steven D. Tanksley \n \nI was first exposed to Biology and Bioinformatics in this position, previously having no knowledge or experience whatsoever. My interest in genetics and genomics developed here and motivated me to go to graduate school to build a broader background and to explore my own research interests more deeply. Work for this position fell largely into two categories: (1) website and database programming, development, and integration, and (2) development of continually improving methods for assemblies of EST sequences into unigene (contig) sequences. The database I developed, and its web interface, tracked all data from physical location of a cDNA clone in a freezer to every chromatogram generated, base calling sequence of that chromatogram, and every version of a unigene build as well as annotations of that sequence which followed. This became the basis of the SOL genomics network (http://solgenomics.net/) and much of what I developed is still present and functional on the present day site. Additional duties involved all system and network administration for both the bioinformatics group and the computer needs of the larger wet lab researchers. Programmer Strategic Forecasting May 1998  –  January 2001  (2 years 9 months) Ithaca, New York Area • Development, optimization, and maintenance of CORSIM, a dynamic microsimulation of the United States population for policy research. Model written in C with speed and memory efficiency a primary goal as hardware limitations largely dictated the size and complexity of the simulations we could run \n• Developed programs and tools for the automated analysis of the extensive output produced \nby the simulation - 50-100 GB, a lot of data for the time especially for PC class hardware \n• Worked extensively with other programmers and analysts on the development of modules in \naddition to the core demographic model such as the modeling of family itemized wealth \naccumulation and inheritance, US Social Security Law, and proposed reform policies. \n• Worked with the Canadian Government on the adoption of the core model and its \nadaptation to Canadian populations and utility in simulating the Canadian Pension Plan \n(Canadian equivalent of US Social Security). \n• Main communications person between programmers and code developers and data analysts, \nhaving worked on both sides of the project extensively. \n• Frequently called upon to solve crises or time critical items arising on either analysis or \nprogramming/debugging sides of the project \n• Network and computer systems administrator Senior Research Associate Stanford University School of Medicine August 2014  – Present (1 year 1 month) Stanford, California I am currently working on developing further computational methods for resolving local ancestry in admixed populations, building on methods previously developed in Carlos Bustamante's group at Stanford. The methodology is based on machine learning techniques, specifically a random forest classifier combined with maximizing the conditional random field over the random forest classification probabilities for discrete windows across the genome of fixed genetic size. Primary goals are to improve scalability of the method to very large datasets in terms of both markers and individuals, and to improve usability for both users at large and users internal to our group. Secondary goals, being pursued in tandem, are to refine accuracy and sensitivity and perform extensive validation of the program. \n \nI am also interested in recently developed long read high throughput sequencing and exploring pilot datasets as they become available to the lab. The pros and cons of different approaches coming to market are not clear and depend on the use case. My work currently involves data from an early, low coverage variant of the moleculo synthetic long read technology but is expanding in the near future to newer technologies and higher sequencing depths as costs continue to decrease. Senior Research Associate Stanford University School of Medicine August 2014  – Present (1 year 1 month) Stanford, California I am currently working on developing further computational methods for resolving local ancestry in admixed populations, building on methods previously developed in Carlos Bustamante's group at Stanford. The methodology is based on machine learning techniques, specifically a random forest classifier combined with maximizing the conditional random field over the random forest classification probabilities for discrete windows across the genome of fixed genetic size. Primary goals are to improve scalability of the method to very large datasets in terms of both markers and individuals, and to improve usability for both users at large and users internal to our group. Secondary goals, being pursued in tandem, are to refine accuracy and sensitivity and perform extensive validation of the program. \n \nI am also interested in recently developed long read high throughput sequencing and exploring pilot datasets as they become available to the lab. The pros and cons of different approaches coming to market are not clear and depend on the use case. My work currently involves data from an early, low coverage variant of the moleculo synthetic long read technology but is expanding in the near future to newer technologies and higher sequencing depths as costs continue to decrease. Research Associate (Academic) Cornell University May 2010  –  July 2014  (4 years 3 months) Ithaca, New York Area Supervisor: Susan R. McCouch \n \n* Development of novel algorithms, methods, programs, pipelines, and statistical models to solve the unique challenges of several projects in this position, some of which listed below \n* Development of a High Density Rice Array (HDRA) targeting over 1 million SNPs segregating in cultivated and wild Asian and African rice populations, featuring a novel internal control mechanism for accuracy estimation & sample QC, methylation targets, and invariant probes for normalization and copy number variation detection.  \n* SNP discovery through pooled data generation from an ad hoc consortium backing the development of the HDRA described above. Challenges posed by unexpected very high diversity levels and subpopulation divergence forced development of more sensitive next generation sequencing analysis tools than available at the time \n* Development of smaller, \"breeder's chips\" - 384 Illumina BeadExpress arrays and more recently a 6K bead chip replacing legacy chips and providing expanded mapping resolution to a broader range of germplasm \n* Analysis of rice subpopulation structure, evolution, and domestication \n* Integration of genome local subpopulation information into genotyping calling methods and GWAS analyses \n* Broad support of the group's Genome Wide Association Mapping analyses through development of the genotyping technologies, primary genomics analysis methods (genotype calling), dataset management, and support of personnel long term responsible for data versioning, archiving, and distribution. \n* Concept development for grants and publications \n* General troubleshooting efforts and problem solving across many projects throughout the broader research group \n* Genotype-by-sequencing analysis methodology and development \n* Extensive IT duties to support all of this work Research Associate (Academic) Cornell University May 2010  –  July 2014  (4 years 3 months) Ithaca, New York Area Supervisor: Susan R. McCouch \n \n* Development of novel algorithms, methods, programs, pipelines, and statistical models to solve the unique challenges of several projects in this position, some of which listed below \n* Development of a High Density Rice Array (HDRA) targeting over 1 million SNPs segregating in cultivated and wild Asian and African rice populations, featuring a novel internal control mechanism for accuracy estimation & sample QC, methylation targets, and invariant probes for normalization and copy number variation detection.  \n* SNP discovery through pooled data generation from an ad hoc consortium backing the development of the HDRA described above. Challenges posed by unexpected very high diversity levels and subpopulation divergence forced development of more sensitive next generation sequencing analysis tools than available at the time \n* Development of smaller, \"breeder's chips\" - 384 Illumina BeadExpress arrays and more recently a 6K bead chip replacing legacy chips and providing expanded mapping resolution to a broader range of germplasm \n* Analysis of rice subpopulation structure, evolution, and domestication \n* Integration of genome local subpopulation information into genotyping calling methods and GWAS analyses \n* Broad support of the group's Genome Wide Association Mapping analyses through development of the genotyping technologies, primary genomics analysis methods (genotype calling), dataset management, and support of personnel long term responsible for data versioning, archiving, and distribution. \n* Concept development for grants and publications \n* General troubleshooting efforts and problem solving across many projects throughout the broader research group \n* Genotype-by-sequencing analysis methodology and development \n* Extensive IT duties to support all of this work Graduate Student Cornell University 2004  –  2010  (6 years) Ithaca, New York Area Adviser & Committee Chair: Carlos D. Bustamante \n \nAs a graduate student I did much the same type of research that I am now doing as a research associate, but in addition I also worked with several systems other than rice including human, cattle, dogs, and drosophila (fruit flies). In the first few years I spent some time at the lab bench learning molecular biology techniques. Gaining a background in this area has served me well in working together with experimentalists and molecular biologists while myself being primarily a computational biologist and high performance programmer handling very large genomic datasets. Often the people specializing in each of these fields can not communicate effectively between disciplines because neither side understands the complexity of the other. A primary goal for me in going to graduate school in genetics while coming from a computer science and professional programming background was to gain the ability to bridge this gap. This goal was certainly achieved as it is now one of my primary functions in my current position as a researcher at Cornell. Graduate Student Cornell University 2004  –  2010  (6 years) Ithaca, New York Area Adviser & Committee Chair: Carlos D. Bustamante \n \nAs a graduate student I did much the same type of research that I am now doing as a research associate, but in addition I also worked with several systems other than rice including human, cattle, dogs, and drosophila (fruit flies). In the first few years I spent some time at the lab bench learning molecular biology techniques. Gaining a background in this area has served me well in working together with experimentalists and molecular biologists while myself being primarily a computational biologist and high performance programmer handling very large genomic datasets. Often the people specializing in each of these fields can not communicate effectively between disciplines because neither side understands the complexity of the other. A primary goal for me in going to graduate school in genetics while coming from a computer science and professional programming background was to gain the ability to bridge this gap. This goal was certainly achieved as it is now one of my primary functions in my current position as a researcher at Cornell. Programmer/Analyst researcher Cornell University 2001  –  2004  (3 years) Ithaca, New York Area Supervisor: Steven D. Tanksley \n \nI was first exposed to Biology and Bioinformatics in this position, previously having no knowledge or experience whatsoever. My interest in genetics and genomics developed here and motivated me to go to graduate school to build a broader background and to explore my own research interests more deeply. Work for this position fell largely into two categories: (1) website and database programming, development, and integration, and (2) development of continually improving methods for assemblies of EST sequences into unigene (contig) sequences. The database I developed, and its web interface, tracked all data from physical location of a cDNA clone in a freezer to every chromatogram generated, base calling sequence of that chromatogram, and every version of a unigene build as well as annotations of that sequence which followed. This became the basis of the SOL genomics network (http://solgenomics.net/) and much of what I developed is still present and functional on the present day site. Additional duties involved all system and network administration for both the bioinformatics group and the computer needs of the larger wet lab researchers. Programmer/Analyst researcher Cornell University 2001  –  2004  (3 years) Ithaca, New York Area Supervisor: Steven D. Tanksley \n \nI was first exposed to Biology and Bioinformatics in this position, previously having no knowledge or experience whatsoever. My interest in genetics and genomics developed here and motivated me to go to graduate school to build a broader background and to explore my own research interests more deeply. Work for this position fell largely into two categories: (1) website and database programming, development, and integration, and (2) development of continually improving methods for assemblies of EST sequences into unigene (contig) sequences. The database I developed, and its web interface, tracked all data from physical location of a cDNA clone in a freezer to every chromatogram generated, base calling sequence of that chromatogram, and every version of a unigene build as well as annotations of that sequence which followed. This became the basis of the SOL genomics network (http://solgenomics.net/) and much of what I developed is still present and functional on the present day site. Additional duties involved all system and network administration for both the bioinformatics group and the computer needs of the larger wet lab researchers. Programmer Strategic Forecasting May 1998  –  January 2001  (2 years 9 months) Ithaca, New York Area • Development, optimization, and maintenance of CORSIM, a dynamic microsimulation of the United States population for policy research. Model written in C with speed and memory efficiency a primary goal as hardware limitations largely dictated the size and complexity of the simulations we could run \n• Developed programs and tools for the automated analysis of the extensive output produced \nby the simulation - 50-100 GB, a lot of data for the time especially for PC class hardware \n• Worked extensively with other programmers and analysts on the development of modules in \naddition to the core demographic model such as the modeling of family itemized wealth \naccumulation and inheritance, US Social Security Law, and proposed reform policies. \n• Worked with the Canadian Government on the adoption of the core model and its \nadaptation to Canadian populations and utility in simulating the Canadian Pension Plan \n(Canadian equivalent of US Social Security). \n• Main communications person between programmers and code developers and data analysts, \nhaving worked on both sides of the project extensively. \n• Frequently called upon to solve crises or time critical items arising on either analysis or \nprogramming/debugging sides of the project \n• Network and computer systems administrator Programmer Strategic Forecasting May 1998  –  January 2001  (2 years 9 months) Ithaca, New York Area • Development, optimization, and maintenance of CORSIM, a dynamic microsimulation of the United States population for policy research. Model written in C with speed and memory efficiency a primary goal as hardware limitations largely dictated the size and complexity of the simulations we could run \n• Developed programs and tools for the automated analysis of the extensive output produced \nby the simulation - 50-100 GB, a lot of data for the time especially for PC class hardware \n• Worked extensively with other programmers and analysts on the development of modules in \naddition to the core demographic model such as the modeling of family itemized wealth \naccumulation and inheritance, US Social Security Law, and proposed reform policies. \n• Worked with the Canadian Government on the adoption of the core model and its \nadaptation to Canadian populations and utility in simulating the Canadian Pension Plan \n(Canadian equivalent of US Social Security). \n• Main communications person between programmers and code developers and data analysts, \nhaving worked on both sides of the project extensively. \n• Frequently called upon to solve crises or time critical items arising on either analysis or \nprogramming/debugging sides of the project \n• Network and computer systems administrator Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Genomics Computational Biology Population Genetics Quantitative Genetics Algorithms Programming C Statistics Bioinformatics DNA sequencing Molecular Biology R Data Analysis Linux Perl Unix Shell Scripting Linux server... Parallel Computing Scientific Computing Software Development Relational Databases High Performance... Optimization Unix Bash TCP/IP Linux System... Lifesciences Sequencing Distributed Systems Monte Carlo Simulation Software Engineering Mathematics Computer Science Research Cryptography LaTeX MySQL Databases SQL Network Security Experimental Design Systems Biology CUDA MPI Life Sciences Simulation Science Data Management Database Design See 35+     See less Skills  Genomics Computational Biology Population Genetics Quantitative Genetics Algorithms Programming C Statistics Bioinformatics DNA sequencing Molecular Biology R Data Analysis Linux Perl Unix Shell Scripting Linux server... Parallel Computing Scientific Computing Software Development Relational Databases High Performance... Optimization Unix Bash TCP/IP Linux System... Lifesciences Sequencing Distributed Systems Monte Carlo Simulation Software Engineering Mathematics Computer Science Research Cryptography LaTeX MySQL Databases SQL Network Security Experimental Design Systems Biology CUDA MPI Life Sciences Simulation Science Data Management Database Design See 35+     See less Genomics Computational Biology Population Genetics Quantitative Genetics Algorithms Programming C Statistics Bioinformatics DNA sequencing Molecular Biology R Data Analysis Linux Perl Unix Shell Scripting Linux server... Parallel Computing Scientific Computing Software Development Relational Databases High Performance... Optimization Unix Bash TCP/IP Linux System... Lifesciences Sequencing Distributed Systems Monte Carlo Simulation Software Engineering Mathematics Computer Science Research Cryptography LaTeX MySQL Databases SQL Network Security Experimental Design Systems Biology CUDA MPI Life Sciences Simulation Science Data Management Database Design See 35+     See less Genomics Computational Biology Population Genetics Quantitative Genetics Algorithms Programming C Statistics Bioinformatics DNA sequencing Molecular Biology R Data Analysis Linux Perl Unix Shell Scripting Linux server... Parallel Computing Scientific Computing Software Development Relational Databases High Performance... Optimization Unix Bash TCP/IP Linux System... Lifesciences Sequencing Distributed Systems Monte Carlo Simulation Software Engineering Mathematics Computer Science Research Cryptography LaTeX MySQL Databases SQL Network Security Experimental Design Systems Biology CUDA MPI Life Sciences Simulation Science Data Management Database Design See 35+     See less Education Cornell University Ph.D.,  Genetics and Development 2004  – 2010 Adviser and Committee Chair: Carlos D. Bustamante (now at Stanford medical) \n \nCommittee: Edward Bucker, Charles Aquadro \n \nDissertation Title: Population Genetic Analysis of Entire Genomes, From SNP Discovery to Genome-Wide Scans for Selection Cornell University BA,  Computer Science 1994  – 1998 Areas of focus within computer science: Distributed Systems, Network Security, Cryptography, Parallel Computation Cornell University Ph.D.,  Genetics and Development 2004  – 2010 Adviser and Committee Chair: Carlos D. Bustamante (now at Stanford medical) \n \nCommittee: Edward Bucker, Charles Aquadro \n \nDissertation Title: Population Genetic Analysis of Entire Genomes, From SNP Discovery to Genome-Wide Scans for Selection Cornell University Ph.D.,  Genetics and Development 2004  – 2010 Adviser and Committee Chair: Carlos D. Bustamante (now at Stanford medical) \n \nCommittee: Edward Bucker, Charles Aquadro \n \nDissertation Title: Population Genetic Analysis of Entire Genomes, From SNP Discovery to Genome-Wide Scans for Selection Cornell University Ph.D.,  Genetics and Development 2004  – 2010 Adviser and Committee Chair: Carlos D. Bustamante (now at Stanford medical) \n \nCommittee: Edward Bucker, Charles Aquadro \n \nDissertation Title: Population Genetic Analysis of Entire Genomes, From SNP Discovery to Genome-Wide Scans for Selection Cornell University BA,  Computer Science 1994  – 1998 Areas of focus within computer science: Distributed Systems, Network Security, Cryptography, Parallel Computation Cornell University BA,  Computer Science 1994  – 1998 Areas of focus within computer science: Distributed Systems, Network Security, Cryptography, Parallel Computation Cornell University BA,  Computer Science 1994  – 1998 Areas of focus within computer science: Distributed Systems, Network Security, Cryptography, Parallel Computation Honors & Awards Additional Honors & Awards Cornell Presidential Genomics Graduate Fellowship 2004-2005 \n \nGraduate Field of Genetics and Development Excellence in Teaching Award, 2006 Additional Honors & Awards Cornell Presidential Genomics Graduate Fellowship 2004-2005 \n \nGraduate Field of Genetics and Development Excellence in Teaching Award, 2006 Additional Honors & Awards Cornell Presidential Genomics Graduate Fellowship 2004-2005 \n \nGraduate Field of Genetics and Development Excellence in Teaching Award, 2006 Additional Honors & Awards Cornell Presidential Genomics Graduate Fellowship 2004-2005 \n \nGraduate Field of Genetics and Development Excellence in Teaching Award, 2006 ", "Summary My current position is Senior Research Associate in the Radiological Sciences Laboratory in the Department of Radiology at Stanford School of Medicine. I provide hardware, systems, and general technical support for a group of 11 Faculty members and many students and post docs in the development of advanced medical imaging and image guided interventions. My training background is primarily in RF and electrical engineering and I spent more than 25 years in the commercial diagnostic imaging industry. Most of the projects I am currently working on involve high field MRI (3 Tesla and above), Magnetic Resonance Guided Focused Ultrasound, and other hybrid systems involving ultrasound imaging, therapeutic ultrasound combined with MRI. I have ongoing collaborations with many other medical research institutes and Universities around the world. I currently have 39 issued US patents \n \nSpecialties:RF Engineering, MRgFUS, Analog circuit design, Transducer Design, Positron Emission Tomography, RF antennas, MRI Systems, MRI Coils, RF Transmission Lines, Low Noise Receivers, Ultrasound Therapeutics and Imaging, IVUS, Gradient Coils and Drivers, Very High Field MR Imaging, Power electronics, Safety of Medical Devices and Systems, Medical Regulatory Compliance. EMI/RFI, High resolution animal imaging coils. Summary My current position is Senior Research Associate in the Radiological Sciences Laboratory in the Department of Radiology at Stanford School of Medicine. I provide hardware, systems, and general technical support for a group of 11 Faculty members and many students and post docs in the development of advanced medical imaging and image guided interventions. My training background is primarily in RF and electrical engineering and I spent more than 25 years in the commercial diagnostic imaging industry. Most of the projects I am currently working on involve high field MRI (3 Tesla and above), Magnetic Resonance Guided Focused Ultrasound, and other hybrid systems involving ultrasound imaging, therapeutic ultrasound combined with MRI. I have ongoing collaborations with many other medical research institutes and Universities around the world. I currently have 39 issued US patents \n \nSpecialties:RF Engineering, MRgFUS, Analog circuit design, Transducer Design, Positron Emission Tomography, RF antennas, MRI Systems, MRI Coils, RF Transmission Lines, Low Noise Receivers, Ultrasound Therapeutics and Imaging, IVUS, Gradient Coils and Drivers, Very High Field MR Imaging, Power electronics, Safety of Medical Devices and Systems, Medical Regulatory Compliance. EMI/RFI, High resolution animal imaging coils. My current position is Senior Research Associate in the Radiological Sciences Laboratory in the Department of Radiology at Stanford School of Medicine. I provide hardware, systems, and general technical support for a group of 11 Faculty members and many students and post docs in the development of advanced medical imaging and image guided interventions. My training background is primarily in RF and electrical engineering and I spent more than 25 years in the commercial diagnostic imaging industry. Most of the projects I am currently working on involve high field MRI (3 Tesla and above), Magnetic Resonance Guided Focused Ultrasound, and other hybrid systems involving ultrasound imaging, therapeutic ultrasound combined with MRI. I have ongoing collaborations with many other medical research institutes and Universities around the world. I currently have 39 issued US patents \n \nSpecialties:RF Engineering, MRgFUS, Analog circuit design, Transducer Design, Positron Emission Tomography, RF antennas, MRI Systems, MRI Coils, RF Transmission Lines, Low Noise Receivers, Ultrasound Therapeutics and Imaging, IVUS, Gradient Coils and Drivers, Very High Field MR Imaging, Power electronics, Safety of Medical Devices and Systems, Medical Regulatory Compliance. EMI/RFI, High resolution animal imaging coils. My current position is Senior Research Associate in the Radiological Sciences Laboratory in the Department of Radiology at Stanford School of Medicine. I provide hardware, systems, and general technical support for a group of 11 Faculty members and many students and post docs in the development of advanced medical imaging and image guided interventions. My training background is primarily in RF and electrical engineering and I spent more than 25 years in the commercial diagnostic imaging industry. Most of the projects I am currently working on involve high field MRI (3 Tesla and above), Magnetic Resonance Guided Focused Ultrasound, and other hybrid systems involving ultrasound imaging, therapeutic ultrasound combined with MRI. I have ongoing collaborations with many other medical research institutes and Universities around the world. I currently have 39 issued US patents \n \nSpecialties:RF Engineering, MRgFUS, Analog circuit design, Transducer Design, Positron Emission Tomography, RF antennas, MRI Systems, MRI Coils, RF Transmission Lines, Low Noise Receivers, Ultrasound Therapeutics and Imaging, IVUS, Gradient Coils and Drivers, Very High Field MR Imaging, Power electronics, Safety of Medical Devices and Systems, Medical Regulatory Compliance. EMI/RFI, High resolution animal imaging coils. Experience Senior Research Associate Stanford University School of Medicine January 2007  – Present (8 years 8 months) Stanford (Palo Alto) California Department of Radiology \nRichard M. Lucas Radiological Sciences Lab \nEdward L. Ginzton Lab for Applied Physics \nVery High Field Magnetic Resonance Imaging 7Tesla \nMR Guided Focused Ultrasound Surgery \nParallel RF Transmit Systems \nCapacitive Micro machined Ultrasound Transducers CMUT \nMultinuclear RF coils \nMedical Device Consultant \nUltrasound Imaging \nElectromagnetic Compatibility of Devices and Equipment in MRI Electrical Engineer GE Global Research April 1991  –  January 2007  (15 years 10 months) Magnetic Resonance Imaging Lab \nAnalog, digital and RF circuit design \nMR Guided Focused Ultrasound MRgFUS \nUltrasound transducer design \nBody Coil Design, Coil array design \nGradient Systems, coils and Drivers \nSix Sigma Master Black Belt Engineer CardioVascular Imaging Systems (Boston Scientific) CVIS September 1989  –  April 1991  (1 year 8 months) Sunnyvale California Development of Intra Vascular Ultrasound Imaging Systems and Catheters, Analog and digital circuit design, safety and regulatory compliance. EMI/RFI/IEC/TUV Compliance,Clinical systems evaluation. Transducer design. Senior Engineering Specialist GE Medical Systems Rancho Cordova December 1980  –  July 1989  (8 years 8 months) Development of electronics systems for digital flouroscopy, computed tomography, magnetic resonance imaging and cardiac ultrasound imaging. Supervised a large team of hardware engineering technicians. Hardware and systems engineering, software and systems integration. Electronic Engineering Technician PCE Systems July 1977  –  December 1980  (3 years 6 months) Design and development of Z80 microprocessor S100 bus based industrial and business computer systems. Large volume wholesale repair of Communications and consumer electronics. Senior Research Associate Stanford University School of Medicine January 2007  – Present (8 years 8 months) Stanford (Palo Alto) California Department of Radiology \nRichard M. Lucas Radiological Sciences Lab \nEdward L. Ginzton Lab for Applied Physics \nVery High Field Magnetic Resonance Imaging 7Tesla \nMR Guided Focused Ultrasound Surgery \nParallel RF Transmit Systems \nCapacitive Micro machined Ultrasound Transducers CMUT \nMultinuclear RF coils \nMedical Device Consultant \nUltrasound Imaging \nElectromagnetic Compatibility of Devices and Equipment in MRI Senior Research Associate Stanford University School of Medicine January 2007  – Present (8 years 8 months) Stanford (Palo Alto) California Department of Radiology \nRichard M. Lucas Radiological Sciences Lab \nEdward L. Ginzton Lab for Applied Physics \nVery High Field Magnetic Resonance Imaging 7Tesla \nMR Guided Focused Ultrasound Surgery \nParallel RF Transmit Systems \nCapacitive Micro machined Ultrasound Transducers CMUT \nMultinuclear RF coils \nMedical Device Consultant \nUltrasound Imaging \nElectromagnetic Compatibility of Devices and Equipment in MRI Electrical Engineer GE Global Research April 1991  –  January 2007  (15 years 10 months) Magnetic Resonance Imaging Lab \nAnalog, digital and RF circuit design \nMR Guided Focused Ultrasound MRgFUS \nUltrasound transducer design \nBody Coil Design, Coil array design \nGradient Systems, coils and Drivers \nSix Sigma Master Black Belt Electrical Engineer GE Global Research April 1991  –  January 2007  (15 years 10 months) Magnetic Resonance Imaging Lab \nAnalog, digital and RF circuit design \nMR Guided Focused Ultrasound MRgFUS \nUltrasound transducer design \nBody Coil Design, Coil array design \nGradient Systems, coils and Drivers \nSix Sigma Master Black Belt Engineer CardioVascular Imaging Systems (Boston Scientific) CVIS September 1989  –  April 1991  (1 year 8 months) Sunnyvale California Development of Intra Vascular Ultrasound Imaging Systems and Catheters, Analog and digital circuit design, safety and regulatory compliance. EMI/RFI/IEC/TUV Compliance,Clinical systems evaluation. Transducer design. Engineer CardioVascular Imaging Systems (Boston Scientific) CVIS September 1989  –  April 1991  (1 year 8 months) Sunnyvale California Development of Intra Vascular Ultrasound Imaging Systems and Catheters, Analog and digital circuit design, safety and regulatory compliance. EMI/RFI/IEC/TUV Compliance,Clinical systems evaluation. Transducer design. Senior Engineering Specialist GE Medical Systems Rancho Cordova December 1980  –  July 1989  (8 years 8 months) Development of electronics systems for digital flouroscopy, computed tomography, magnetic resonance imaging and cardiac ultrasound imaging. Supervised a large team of hardware engineering technicians. Hardware and systems engineering, software and systems integration. Senior Engineering Specialist GE Medical Systems Rancho Cordova December 1980  –  July 1989  (8 years 8 months) Development of electronics systems for digital flouroscopy, computed tomography, magnetic resonance imaging and cardiac ultrasound imaging. Supervised a large team of hardware engineering technicians. Hardware and systems engineering, software and systems integration. Electronic Engineering Technician PCE Systems July 1977  –  December 1980  (3 years 6 months) Design and development of Z80 microprocessor S100 bus based industrial and business computer systems. Large volume wholesale repair of Communications and consumer electronics. Electronic Engineering Technician PCE Systems July 1977  –  December 1980  (3 years 6 months) Design and development of Z80 microprocessor S100 bus based industrial and business computer systems. Large volume wholesale repair of Communications and consumer electronics. Skills Analog Circuit Design MRI Ultrasound Medical Imaging Medical Devices RF Biomedical Engineering Physics R&D Electronics Engineering 3D Printing Power Electronics Sensors Solidworks MRI RF Coils Solid Modeling Rapid Prototyping medical regulatory medical device safety Signal Processing Image Processing Radiology Science LabVIEW See 10+     See less Skills  Analog Circuit Design MRI Ultrasound Medical Imaging Medical Devices RF Biomedical Engineering Physics R&D Electronics Engineering 3D Printing Power Electronics Sensors Solidworks MRI RF Coils Solid Modeling Rapid Prototyping medical regulatory medical device safety Signal Processing Image Processing Radiology Science LabVIEW See 10+     See less Analog Circuit Design MRI Ultrasound Medical Imaging Medical Devices RF Biomedical Engineering Physics R&D Electronics Engineering 3D Printing Power Electronics Sensors Solidworks MRI RF Coils Solid Modeling Rapid Prototyping medical regulatory medical device safety Signal Processing Image Processing Radiology Science LabVIEW See 10+     See less Analog Circuit Design MRI Ultrasound Medical Imaging Medical Devices RF Biomedical Engineering Physics R&D Electronics Engineering 3D Printing Power Electronics Sensors Solidworks MRI RF Coils Solid Modeling Rapid Prototyping medical regulatory medical device safety Signal Processing Image Processing Radiology Science LabVIEW See 10+     See less Education Schenectady College AOS,  Culinary Arts Hospitality Hotel and Restaurant Management 1996  – 2001 Classical Cuisine, Banquet Management, Garde Manger, \nFood Procurement, Menu Planning, Business development and Marketing, Bar Service, California and International Wines, Baking, Nutrition, Hotel Management Activities and Societies:  American Culinary Federation American River College Associate of Arts (AA),  Electronics 1977  – 1981 Analog, Digital and RF circuit design, microprocessor systems, \nAC-DC Circuit analysis, power electronics, state machine sequencer design, OP amp circuit design, analog and digital filter design, power supply design, electromechanical, thermal and interconnect systems, drafting, troubleshooting methods. Schenectady College AOS,  Culinary Arts Hospitality Hotel and Restaurant Management 1996  – 2001 Classical Cuisine, Banquet Management, Garde Manger, \nFood Procurement, Menu Planning, Business development and Marketing, Bar Service, California and International Wines, Baking, Nutrition, Hotel Management Activities and Societies:  American Culinary Federation Schenectady College AOS,  Culinary Arts Hospitality Hotel and Restaurant Management 1996  – 2001 Classical Cuisine, Banquet Management, Garde Manger, \nFood Procurement, Menu Planning, Business development and Marketing, Bar Service, California and International Wines, Baking, Nutrition, Hotel Management Activities and Societies:  American Culinary Federation Schenectady College AOS,  Culinary Arts Hospitality Hotel and Restaurant Management 1996  – 2001 Classical Cuisine, Banquet Management, Garde Manger, \nFood Procurement, Menu Planning, Business development and Marketing, Bar Service, California and International Wines, Baking, Nutrition, Hotel Management Activities and Societies:  American Culinary Federation American River College Associate of Arts (AA),  Electronics 1977  – 1981 Analog, Digital and RF circuit design, microprocessor systems, \nAC-DC Circuit analysis, power electronics, state machine sequencer design, OP amp circuit design, analog and digital filter design, power supply design, electromechanical, thermal and interconnect systems, drafting, troubleshooting methods. American River College Associate of Arts (AA),  Electronics 1977  – 1981 Analog, Digital and RF circuit design, microprocessor systems, \nAC-DC Circuit analysis, power electronics, state machine sequencer design, OP amp circuit design, analog and digital filter design, power supply design, electromechanical, thermal and interconnect systems, drafting, troubleshooting methods. American River College Associate of Arts (AA),  Electronics 1977  – 1981 Analog, Digital and RF circuit design, microprocessor systems, \nAC-DC Circuit analysis, power electronics, state machine sequencer design, OP amp circuit design, analog and digital filter design, power supply design, electromechanical, thermal and interconnect systems, drafting, troubleshooting methods. Honors & Awards Magna Cum Laude Radiological Society of North America November 1994 A clinical, noninvasive, MR imaging-monitored ultrasound surgery method. Cum Laude Award Society of Computed Body Tomography Early Detection of Osteoarthritis in Patients with ACL Injury Using Sodium MRI. Magna Cum Laude Radiological Society of North America November 1994 A clinical, noninvasive, MR imaging-monitored ultrasound surgery method. Magna Cum Laude Radiological Society of North America November 1994 A clinical, noninvasive, MR imaging-monitored ultrasound surgery method. Magna Cum Laude Radiological Society of North America November 1994 A clinical, noninvasive, MR imaging-monitored ultrasound surgery method. Cum Laude Award Society of Computed Body Tomography Early Detection of Osteoarthritis in Patients with ACL Injury Using Sodium MRI. Cum Laude Award Society of Computed Body Tomography Early Detection of Osteoarthritis in Patients with ACL Injury Using Sodium MRI. Cum Laude Award Society of Computed Body Tomography Early Detection of Osteoarthritis in Patients with ACL Injury Using Sodium MRI. ", "Skills Cancer Research Biophysics Structural Biology Protein Chemistry Protein Purification Molecular Biology Drug Discovery Biochemistry Biotechnology Lifesciences Purification Protein Expression X-ray crystallography Proteomics Skills  Cancer Research Biophysics Structural Biology Protein Chemistry Protein Purification Molecular Biology Drug Discovery Biochemistry Biotechnology Lifesciences Purification Protein Expression X-ray crystallography Proteomics Cancer Research Biophysics Structural Biology Protein Chemistry Protein Purification Molecular Biology Drug Discovery Biochemistry Biotechnology Lifesciences Purification Protein Expression X-ray crystallography Proteomics Cancer Research Biophysics Structural Biology Protein Chemistry Protein Purification Molecular Biology Drug Discovery Biochemistry Biotechnology Lifesciences Purification Protein Expression X-ray crystallography Proteomics ", "Summary Specialties:Physics of the upper atmosphere (mesosphere, ionosphere), ultra-high energy cosmic rays Summary Specialties:Physics of the upper atmosphere (mesosphere, ionosphere), ultra-high energy cosmic rays Specialties:Physics of the upper atmosphere (mesosphere, ionosphere), ultra-high energy cosmic rays Specialties:Physics of the upper atmosphere (mesosphere, ionosphere), ultra-high energy cosmic rays Experience Senior Research Associate Stanford University April 2009  – Present (6 years 5 months) Research Associate, Electrical Engineering Stanford University December 2004  –  April 2009  (4 years 5 months) Associate Researcher, Physics and Astronomy University of Hawaii January 2002  –  November 2004  (2 years 11 months) Postdoctoral Researcher, Physics Stanford University February 2000  –  December 2001  (1 year 11 months) Senior Research Associate Stanford University April 2009  – Present (6 years 5 months) Senior Research Associate Stanford University April 2009  – Present (6 years 5 months) Research Associate, Electrical Engineering Stanford University December 2004  –  April 2009  (4 years 5 months) Research Associate, Electrical Engineering Stanford University December 2004  –  April 2009  (4 years 5 months) Associate Researcher, Physics and Astronomy University of Hawaii January 2002  –  November 2004  (2 years 11 months) Associate Researcher, Physics and Astronomy University of Hawaii January 2002  –  November 2004  (2 years 11 months) Postdoctoral Researcher, Physics Stanford University February 2000  –  December 2001  (1 year 11 months) Postdoctoral Researcher, Physics Stanford University February 2000  –  December 2001  (1 year 11 months) Skills Physics Skills  Physics Physics Physics Education Stanford University Ph. D.,  Physics 1994  – 2000 State University of Nizhni Novgorod named after N.I. Lobachevsky (UNN) Specialist,  Radiophysics and Electronics 1989  – 1994 University of Bridgeport B.S,  Physics ,  Economics 1993  – 1993 Stanford University Ph. D.,  Physics 1994  – 2000 Stanford University Ph. D.,  Physics 1994  – 2000 Stanford University Ph. D.,  Physics 1994  – 2000 State University of Nizhni Novgorod named after N.I. Lobachevsky (UNN) Specialist,  Radiophysics and Electronics 1989  – 1994 State University of Nizhni Novgorod named after N.I. Lobachevsky (UNN) Specialist,  Radiophysics and Electronics 1989  – 1994 State University of Nizhni Novgorod named after N.I. Lobachevsky (UNN) Specialist,  Radiophysics and Electronics 1989  – 1994 University of Bridgeport B.S,  Physics ,  Economics 1993  – 1993 University of Bridgeport B.S,  Physics ,  Economics 1993  – 1993 University of Bridgeport B.S,  Physics ,  Economics 1993  – 1993 ", "Summary I am a self-motivated, hard-working person with strong research and laboratory management skills. I've worked in many different sectors, including academia, government labs, and industry. I also love to teach, specifically at the community college level. \n \nMy extensive laboratory experience includes knowledge of molecular and cell biology, live virus work, immunohistochemistry, synthetic biology, cell and tissue culture, microscopy, sequencing, and basic bioinformatics. I also have experience in setting up new and transitioning labs. \n \nSpecialties: Specialization in Cell & Molecular Biology, Synthetic Biology, Cell Culture and Infectious Disease. Strong knowledge in virology, parasitology, pathogenesis, epidemiology, life support systems for long duration space exploration, resource recovery, sustainable and closed-loop technologies, and public health. Summary I am a self-motivated, hard-working person with strong research and laboratory management skills. I've worked in many different sectors, including academia, government labs, and industry. I also love to teach, specifically at the community college level. \n \nMy extensive laboratory experience includes knowledge of molecular and cell biology, live virus work, immunohistochemistry, synthetic biology, cell and tissue culture, microscopy, sequencing, and basic bioinformatics. I also have experience in setting up new and transitioning labs. \n \nSpecialties: Specialization in Cell & Molecular Biology, Synthetic Biology, Cell Culture and Infectious Disease. Strong knowledge in virology, parasitology, pathogenesis, epidemiology, life support systems for long duration space exploration, resource recovery, sustainable and closed-loop technologies, and public health. I am a self-motivated, hard-working person with strong research and laboratory management skills. I've worked in many different sectors, including academia, government labs, and industry. I also love to teach, specifically at the community college level. \n \nMy extensive laboratory experience includes knowledge of molecular and cell biology, live virus work, immunohistochemistry, synthetic biology, cell and tissue culture, microscopy, sequencing, and basic bioinformatics. I also have experience in setting up new and transitioning labs. \n \nSpecialties: Specialization in Cell & Molecular Biology, Synthetic Biology, Cell Culture and Infectious Disease. Strong knowledge in virology, parasitology, pathogenesis, epidemiology, life support systems for long duration space exploration, resource recovery, sustainable and closed-loop technologies, and public health. I am a self-motivated, hard-working person with strong research and laboratory management skills. I've worked in many different sectors, including academia, government labs, and industry. I also love to teach, specifically at the community college level. \n \nMy extensive laboratory experience includes knowledge of molecular and cell biology, live virus work, immunohistochemistry, synthetic biology, cell and tissue culture, microscopy, sequencing, and basic bioinformatics. I also have experience in setting up new and transitioning labs. \n \nSpecialties: Specialization in Cell & Molecular Biology, Synthetic Biology, Cell Culture and Infectious Disease. Strong knowledge in virology, parasitology, pathogenesis, epidemiology, life support systems for long duration space exploration, resource recovery, sustainable and closed-loop technologies, and public health. Experience Content Creator Khan Academy April 2015  – Present (5 months) I am working with the Health, Medicine, and Nursing Content Team to create articles and videos about life sciences, disease, and medicine, and to support development of free, online MCAT prep materials. Senior Research Associate Stanford University School of Medicine October 2014  – Present (11 months) Stanford/Palo Alto, CA Department of Pediatrics, Division of Infectious Disease \n \nWorking with arboviruses, flaviviruses and alphaviruses (currently Dengue Fever, Chikungunya, and Rift Valley Fever Virus) to study incidence in various regions of Kenya with Dr. Desiree LaBeaud. Faculty Merritt College January 2014  – Present (1 year 8 months) Oakland, CA I teach classes and labs for the Biology Department, the Merritt Microscopy Program, and the Merritt Histotech Training Program.  Synthetic Biology Development Engineer UC Santa Cruz September 2013  – Present (2 years) NASA Ames Research Center, Moffett Field, CA Contracted through the University Affiliated Research Center (UARC). As of October 2014, I am working as a consultant for current and future synthetic biology projects at NASA Ames Research Center. \n \nI am working to integrate biological processes into current and advanced life support systems for deep space missions at NASA Ames Research Center. My main focus is resource recovery from various unavoidable wastes produced during manned missions, which involves collaborating with the air, water, and solid waste groups. Senior Research Associate NASA Ames Research Center October 2011  –  September 2013  (2 years) Mountain View, CA Contracted through the University Space Research Association (USRA)/ Education Associates Program (EAP). \n \nAs a part of the Bioengineering and Space Biosciences Program at NASA Ames Research Center, I worked to use synthetic biology to advance current life support systems for long-duration space exploration. \n \nI worked directly for Dr. John Hogan and Dr. Michael Flynn on projects in collaboration with J. Craig Venture Institute (La Jolla, CA) and Stanford University (Palo Alto, CA). Graduate Researcher California State University, East Bay August 2008  –  May 2012  (3 years 10 months) Hayward, CA Developed, performed and evaluated HIV-1 research protocol and projects. Presented data and wrote scientific documents regarding project progress effectively.  \n \nUtilized cell culture techniques in an aseptic environment. Actively used molecular biology techniques and procedures, such as PCR, FACS, Northern and Western Blots, Sequencing and Bioinformatics.  \n \nBlood Borne Pathogen Certified. Research Intern J. Craig Venter Institute 2012  –  2012  (less than a year) La Jolla, CA Worked with Dr. Orianna Bretschger on a project in collaboration with NASA Ames Research Center. \nMaintained cultures, prepared media, and assembled bioelectrochemical reactors.  \nPerformed DNA extractions, microscopic analysis, and prepared libraries. \n \nWhile my time with Dr. Bretschger's team was short, we established the initial experimentation for the collaborative project between JCVI and NASA Ames Research Center. To this day, this experimentation has grown into larger projects, which are still being conducted at both JCVI and NASA Ames. Outreach Coordinator & Health Education Assistant California State University, East Bay March 2009  –  August 2011  (2 years 6 months) Coordinated and staffed health education programs, outreach and events.  \n \nCollaborated with on campus and off campus organizations for event logistics and assistance. \n \nManaged interns by providing direction and training for specific events, clinic requirements and general tasks.  \n \nOversaw all marketing efforts and resources for services and events. Works directly with clients and patients for clinic services and health education sessions.  \n \nWrote proposals for health-related campaigns to encourage administrative commitment and change. HIV Testing Counselor California State University, East Bay August 2007  –  August 2008  (1 year 1 month) Hayward, CA Performed HIV tests and delivers results to clients in person. Performed evaluation of the HIV clinic services and client data. \nManaged clinics and worked directly with students and patients of the California State University, East Bay Student Health Center. \nCreated informational media to increase testing rates and return rates among clients. Content Creator Khan Academy April 2015  – Present (5 months) I am working with the Health, Medicine, and Nursing Content Team to create articles and videos about life sciences, disease, and medicine, and to support development of free, online MCAT prep materials. Content Creator Khan Academy April 2015  – Present (5 months) I am working with the Health, Medicine, and Nursing Content Team to create articles and videos about life sciences, disease, and medicine, and to support development of free, online MCAT prep materials. Senior Research Associate Stanford University School of Medicine October 2014  – Present (11 months) Stanford/Palo Alto, CA Department of Pediatrics, Division of Infectious Disease \n \nWorking with arboviruses, flaviviruses and alphaviruses (currently Dengue Fever, Chikungunya, and Rift Valley Fever Virus) to study incidence in various regions of Kenya with Dr. Desiree LaBeaud. Senior Research Associate Stanford University School of Medicine October 2014  – Present (11 months) Stanford/Palo Alto, CA Department of Pediatrics, Division of Infectious Disease \n \nWorking with arboviruses, flaviviruses and alphaviruses (currently Dengue Fever, Chikungunya, and Rift Valley Fever Virus) to study incidence in various regions of Kenya with Dr. Desiree LaBeaud. Faculty Merritt College January 2014  – Present (1 year 8 months) Oakland, CA I teach classes and labs for the Biology Department, the Merritt Microscopy Program, and the Merritt Histotech Training Program.  Faculty Merritt College January 2014  – Present (1 year 8 months) Oakland, CA I teach classes and labs for the Biology Department, the Merritt Microscopy Program, and the Merritt Histotech Training Program.  Synthetic Biology Development Engineer UC Santa Cruz September 2013  – Present (2 years) NASA Ames Research Center, Moffett Field, CA Contracted through the University Affiliated Research Center (UARC). As of October 2014, I am working as a consultant for current and future synthetic biology projects at NASA Ames Research Center. \n \nI am working to integrate biological processes into current and advanced life support systems for deep space missions at NASA Ames Research Center. My main focus is resource recovery from various unavoidable wastes produced during manned missions, which involves collaborating with the air, water, and solid waste groups. Synthetic Biology Development Engineer UC Santa Cruz September 2013  – Present (2 years) NASA Ames Research Center, Moffett Field, CA Contracted through the University Affiliated Research Center (UARC). As of October 2014, I am working as a consultant for current and future synthetic biology projects at NASA Ames Research Center. \n \nI am working to integrate biological processes into current and advanced life support systems for deep space missions at NASA Ames Research Center. My main focus is resource recovery from various unavoidable wastes produced during manned missions, which involves collaborating with the air, water, and solid waste groups. Senior Research Associate NASA Ames Research Center October 2011  –  September 2013  (2 years) Mountain View, CA Contracted through the University Space Research Association (USRA)/ Education Associates Program (EAP). \n \nAs a part of the Bioengineering and Space Biosciences Program at NASA Ames Research Center, I worked to use synthetic biology to advance current life support systems for long-duration space exploration. \n \nI worked directly for Dr. John Hogan and Dr. Michael Flynn on projects in collaboration with J. Craig Venture Institute (La Jolla, CA) and Stanford University (Palo Alto, CA). Senior Research Associate NASA Ames Research Center October 2011  –  September 2013  (2 years) Mountain View, CA Contracted through the University Space Research Association (USRA)/ Education Associates Program (EAP). \n \nAs a part of the Bioengineering and Space Biosciences Program at NASA Ames Research Center, I worked to use synthetic biology to advance current life support systems for long-duration space exploration. \n \nI worked directly for Dr. John Hogan and Dr. Michael Flynn on projects in collaboration with J. Craig Venture Institute (La Jolla, CA) and Stanford University (Palo Alto, CA). Graduate Researcher California State University, East Bay August 2008  –  May 2012  (3 years 10 months) Hayward, CA Developed, performed and evaluated HIV-1 research protocol and projects. Presented data and wrote scientific documents regarding project progress effectively.  \n \nUtilized cell culture techniques in an aseptic environment. Actively used molecular biology techniques and procedures, such as PCR, FACS, Northern and Western Blots, Sequencing and Bioinformatics.  \n \nBlood Borne Pathogen Certified. Graduate Researcher California State University, East Bay August 2008  –  May 2012  (3 years 10 months) Hayward, CA Developed, performed and evaluated HIV-1 research protocol and projects. Presented data and wrote scientific documents regarding project progress effectively.  \n \nUtilized cell culture techniques in an aseptic environment. Actively used molecular biology techniques and procedures, such as PCR, FACS, Northern and Western Blots, Sequencing and Bioinformatics.  \n \nBlood Borne Pathogen Certified. Research Intern J. Craig Venter Institute 2012  –  2012  (less than a year) La Jolla, CA Worked with Dr. Orianna Bretschger on a project in collaboration with NASA Ames Research Center. \nMaintained cultures, prepared media, and assembled bioelectrochemical reactors.  \nPerformed DNA extractions, microscopic analysis, and prepared libraries. \n \nWhile my time with Dr. Bretschger's team was short, we established the initial experimentation for the collaborative project between JCVI and NASA Ames Research Center. To this day, this experimentation has grown into larger projects, which are still being conducted at both JCVI and NASA Ames. Research Intern J. Craig Venter Institute 2012  –  2012  (less than a year) La Jolla, CA Worked with Dr. Orianna Bretschger on a project in collaboration with NASA Ames Research Center. \nMaintained cultures, prepared media, and assembled bioelectrochemical reactors.  \nPerformed DNA extractions, microscopic analysis, and prepared libraries. \n \nWhile my time with Dr. Bretschger's team was short, we established the initial experimentation for the collaborative project between JCVI and NASA Ames Research Center. To this day, this experimentation has grown into larger projects, which are still being conducted at both JCVI and NASA Ames. Outreach Coordinator & Health Education Assistant California State University, East Bay March 2009  –  August 2011  (2 years 6 months) Coordinated and staffed health education programs, outreach and events.  \n \nCollaborated with on campus and off campus organizations for event logistics and assistance. \n \nManaged interns by providing direction and training for specific events, clinic requirements and general tasks.  \n \nOversaw all marketing efforts and resources for services and events. Works directly with clients and patients for clinic services and health education sessions.  \n \nWrote proposals for health-related campaigns to encourage administrative commitment and change. Outreach Coordinator & Health Education Assistant California State University, East Bay March 2009  –  August 2011  (2 years 6 months) Coordinated and staffed health education programs, outreach and events.  \n \nCollaborated with on campus and off campus organizations for event logistics and assistance. \n \nManaged interns by providing direction and training for specific events, clinic requirements and general tasks.  \n \nOversaw all marketing efforts and resources for services and events. Works directly with clients and patients for clinic services and health education sessions.  \n \nWrote proposals for health-related campaigns to encourage administrative commitment and change. HIV Testing Counselor California State University, East Bay August 2007  –  August 2008  (1 year 1 month) Hayward, CA Performed HIV tests and delivers results to clients in person. Performed evaluation of the HIV clinic services and client data. \nManaged clinics and worked directly with students and patients of the California State University, East Bay Student Health Center. \nCreated informational media to increase testing rates and return rates among clients. HIV Testing Counselor California State University, East Bay August 2007  –  August 2008  (1 year 1 month) Hayward, CA Performed HIV tests and delivers results to clients in person. Performed evaluation of the HIV clinic services and client data. \nManaged clinics and worked directly with students and patients of the California State University, East Bay Student Health Center. \nCreated informational media to increase testing rates and return rates among clients. Languages English Native or bilingual proficiency American Sign Language Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency American Sign Language Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency American Sign Language Professional working proficiency Spanish Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Molecular Biology Cell Culture Cell Biology PCR Infectious Diseases Bioinformatics Immunology DNA sequencing Tissue Culture Virology Biochemistry DNA SDS-PAGE DNA extraction Protein Purification RNA isolation RT-PCR Synthetic Biology Genetics Pathogenesis Fluorescence Microscopy Laboratory Management Proposal Writing Laboratory Research Confocal Microscopy Flow Cytometry Scanning Electron... Space Exploration Parasitology Resource Recovery Microbial Genetics Microbial Fuel Cells Cell Based Assays Aseptic Technique Public Speaking Public Health Organizational... Project Coordination Staff Training Grant Writing LGBT issues Educational Outreach Data Analysis Research Microscopy Anaerobic Microbiology Science Life Sciences Teaching Scientific Illustration See 35+     See less Skills  Molecular Biology Cell Culture Cell Biology PCR Infectious Diseases Bioinformatics Immunology DNA sequencing Tissue Culture Virology Biochemistry DNA SDS-PAGE DNA extraction Protein Purification RNA isolation RT-PCR Synthetic Biology Genetics Pathogenesis Fluorescence Microscopy Laboratory Management Proposal Writing Laboratory Research Confocal Microscopy Flow Cytometry Scanning Electron... Space Exploration Parasitology Resource Recovery Microbial Genetics Microbial Fuel Cells Cell Based Assays Aseptic Technique Public Speaking Public Health Organizational... Project Coordination Staff Training Grant Writing LGBT issues Educational Outreach Data Analysis Research Microscopy Anaerobic Microbiology Science Life Sciences Teaching Scientific Illustration See 35+     See less Molecular Biology Cell Culture Cell Biology PCR Infectious Diseases Bioinformatics Immunology DNA sequencing Tissue Culture Virology Biochemistry DNA SDS-PAGE DNA extraction Protein Purification RNA isolation RT-PCR Synthetic Biology Genetics Pathogenesis Fluorescence Microscopy Laboratory Management Proposal Writing Laboratory Research Confocal Microscopy Flow Cytometry Scanning Electron... Space Exploration Parasitology Resource Recovery Microbial Genetics Microbial Fuel Cells Cell Based Assays Aseptic Technique Public Speaking Public Health Organizational... Project Coordination Staff Training Grant Writing LGBT issues Educational Outreach Data Analysis Research Microscopy Anaerobic Microbiology Science Life Sciences Teaching Scientific Illustration See 35+     See less Molecular Biology Cell Culture Cell Biology PCR Infectious Diseases Bioinformatics Immunology DNA sequencing Tissue Culture Virology Biochemistry DNA SDS-PAGE DNA extraction Protein Purification RNA isolation RT-PCR Synthetic Biology Genetics Pathogenesis Fluorescence Microscopy Laboratory Management Proposal Writing Laboratory Research Confocal Microscopy Flow Cytometry Scanning Electron... Space Exploration Parasitology Resource Recovery Microbial Genetics Microbial Fuel Cells Cell Based Assays Aseptic Technique Public Speaking Public Health Organizational... Project Coordination Staff Training Grant Writing LGBT issues Educational Outreach Data Analysis Research Microscopy Anaerobic Microbiology Science Life Sciences Teaching Scientific Illustration See 35+     See less Education California State University-East Bay M.S.,  Cell & Molecular Biology - Infectious Disease Emphasis 2009  – 2011 California State University-East Bay BS,  Health Science ,  Pre-Medical Option 2005  – 2008 Minor in American Sign Language Studies. Activities and Societies:  Pre Health Professionals Association ,  Student Health Advisory Committee ,  Peer Advocates for Wellness ,  Queer-Straight Alliance ,  Alliance for Social Justice ,  The Feminist Majority Club Cañada College AS,  Biology 2002  – 2005 Cañada Middle College High School Diploma/IGETC,  Biology 2002  – 2004 Woodside High School 2000  – 2002 California State University-East Bay M.S.,  Cell & Molecular Biology - Infectious Disease Emphasis 2009  – 2011 California State University-East Bay M.S.,  Cell & Molecular Biology - Infectious Disease Emphasis 2009  – 2011 California State University-East Bay M.S.,  Cell & Molecular Biology - Infectious Disease Emphasis 2009  – 2011 California State University-East Bay BS,  Health Science ,  Pre-Medical Option 2005  – 2008 Minor in American Sign Language Studies. Activities and Societies:  Pre Health Professionals Association ,  Student Health Advisory Committee ,  Peer Advocates for Wellness ,  Queer-Straight Alliance ,  Alliance for Social Justice ,  The Feminist Majority Club California State University-East Bay BS,  Health Science ,  Pre-Medical Option 2005  – 2008 Minor in American Sign Language Studies. Activities and Societies:  Pre Health Professionals Association ,  Student Health Advisory Committee ,  Peer Advocates for Wellness ,  Queer-Straight Alliance ,  Alliance for Social Justice ,  The Feminist Majority Club California State University-East Bay BS,  Health Science ,  Pre-Medical Option 2005  – 2008 Minor in American Sign Language Studies. Activities and Societies:  Pre Health Professionals Association ,  Student Health Advisory Committee ,  Peer Advocates for Wellness ,  Queer-Straight Alliance ,  Alliance for Social Justice ,  The Feminist Majority Club Cañada College AS,  Biology 2002  – 2005 Cañada College AS,  Biology 2002  – 2005 Cañada College AS,  Biology 2002  – 2005 Cañada Middle College High School Diploma/IGETC,  Biology 2002  – 2004 Cañada Middle College High School Diploma/IGETC,  Biology 2002  – 2004 Cañada Middle College High School Diploma/IGETC,  Biology 2002  – 2004 Woodside High School 2000  – 2002 Woodside High School 2000  – 2002 Woodside High School 2000  – 2002 Honors & Awards President’s Student Service and Leadership Award for Outstanding Academic Achievement California State University, East Bay May 2008 President’s Student Service and Leadership Award for Outstanding Leadership California State University, East Bay May 2008 Graduate Student Research Award Grant California State University, East Bay January 2012 President’s Student Service and Leadership Award for Outstanding Academic Achievement California State University, East Bay May 2008 President’s Student Service and Leadership Award for Outstanding Academic Achievement California State University, East Bay May 2008 President’s Student Service and Leadership Award for Outstanding Academic Achievement California State University, East Bay May 2008 President’s Student Service and Leadership Award for Outstanding Leadership California State University, East Bay May 2008 President’s Student Service and Leadership Award for Outstanding Leadership California State University, East Bay May 2008 President’s Student Service and Leadership Award for Outstanding Leadership California State University, East Bay May 2008 Graduate Student Research Award Grant California State University, East Bay January 2012 Graduate Student Research Award Grant California State University, East Bay January 2012 Graduate Student Research Award Grant California State University, East Bay January 2012 ", "Summary 36 years of research experience, statistical consulting, and university/med school teaching at all levels. Specialties:Pharmacology, especially neuropharmacology and behavioral pharmacology. Neurophysiology. Sleep and circadian rhythms. Statistical analysis. Summary 36 years of research experience, statistical consulting, and university/med school teaching at all levels. Specialties:Pharmacology, especially neuropharmacology and behavioral pharmacology. Neurophysiology. Sleep and circadian rhythms. Statistical analysis. 36 years of research experience, statistical consulting, and university/med school teaching at all levels. Specialties:Pharmacology, especially neuropharmacology and behavioral pharmacology. Neurophysiology. Sleep and circadian rhythms. Statistical analysis. 36 years of research experience, statistical consulting, and university/med school teaching at all levels. Specialties:Pharmacology, especially neuropharmacology and behavioral pharmacology. Neurophysiology. Sleep and circadian rhythms. Statistical analysis. Experience Professor and Chair of Pharmacology American University of the Caribbean March 2013  – Present (2 years 6 months) associate professor USC Medical School 2000  –  March 2013  (13 years) Keck School of Medicine at USC I was the Director of Pharmacology, System Chair for the Medical Core curriculum and a member of the Department of Cell and Neurobiology at the Keck School of Medicine at USC. associate professor Texas Tech University Health Sciences Center 1994  –  2000  (6 years) Professor and Chair of Pharmacology American University of the Caribbean March 2013  – Present (2 years 6 months) Professor and Chair of Pharmacology American University of the Caribbean March 2013  – Present (2 years 6 months) associate professor USC Medical School 2000  –  March 2013  (13 years) Keck School of Medicine at USC I was the Director of Pharmacology, System Chair for the Medical Core curriculum and a member of the Department of Cell and Neurobiology at the Keck School of Medicine at USC. associate professor USC Medical School 2000  –  March 2013  (13 years) Keck School of Medicine at USC I was the Director of Pharmacology, System Chair for the Medical Core curriculum and a member of the Department of Cell and Neurobiology at the Keck School of Medicine at USC. associate professor Texas Tech University Health Sciences Center 1994  –  2000  (6 years) associate professor Texas Tech University Health Sciences Center 1994  –  2000  (6 years) Languages French French French Skills Physiology Higher Education Neuropharmacology Statistics Cell Teaching Neurobiology Alzheimer's disease Research Medicine Science Molecular Biology Student Affairs Clinical Research Cell Biology Immunology Public Speaking R&D Neurophysiology Biotechnology Pharmacology Lifesciences Neuroscience Microscopy Immunohistochemistry See 10+     See less Skills  Physiology Higher Education Neuropharmacology Statistics Cell Teaching Neurobiology Alzheimer's disease Research Medicine Science Molecular Biology Student Affairs Clinical Research Cell Biology Immunology Public Speaking R&D Neurophysiology Biotechnology Pharmacology Lifesciences Neuroscience Microscopy Immunohistochemistry See 10+     See less Physiology Higher Education Neuropharmacology Statistics Cell Teaching Neurobiology Alzheimer's disease Research Medicine Science Molecular Biology Student Affairs Clinical Research Cell Biology Immunology Public Speaking R&D Neurophysiology Biotechnology Pharmacology Lifesciences Neuroscience Microscopy Immunohistochemistry See 10+     See less Physiology Higher Education Neuropharmacology Statistics Cell Teaching Neurobiology Alzheimer's disease Research Medicine Science Molecular Biology Student Affairs Clinical Research Cell Biology Immunology Public Speaking R&D Neurophysiology Biotechnology Pharmacology Lifesciences Neuroscience Microscopy Immunohistochemistry See 10+     See less Education Yale University BA,  biology ,  psychology 1968  – 1971 Ph.D from University of Texas in physiological psychology, 1979. Postdoctoral fellowships in neurophysiology and neuropharmacology at Southwestern Medical School, Dept. of Physiology and UC Davis, Animal Physiology.Senior research associate Stanford University 1987-1994. NBHS high school diploma 1964  – 1967 Yale University BA,  biology ,  psychology 1968  – 1971 Ph.D from University of Texas in physiological psychology, 1979. Postdoctoral fellowships in neurophysiology and neuropharmacology at Southwestern Medical School, Dept. of Physiology and UC Davis, Animal Physiology.Senior research associate Stanford University 1987-1994. Yale University BA,  biology ,  psychology 1968  – 1971 Ph.D from University of Texas in physiological psychology, 1979. Postdoctoral fellowships in neurophysiology and neuropharmacology at Southwestern Medical School, Dept. of Physiology and UC Davis, Animal Physiology.Senior research associate Stanford University 1987-1994. Yale University BA,  biology ,  psychology 1968  – 1971 Ph.D from University of Texas in physiological psychology, 1979. Postdoctoral fellowships in neurophysiology and neuropharmacology at Southwestern Medical School, Dept. of Physiology and UC Davis, Animal Physiology.Senior research associate Stanford University 1987-1994. NBHS high school diploma 1964  – 1967 NBHS high school diploma 1964  – 1967 NBHS high school diploma 1964  – 1967 Honors & Awards ", "Experience Senior Research Associate Stanford University, Electrical Engineering Department April 2005  – Present (10 years 5 months) Senior Research Associate Stanford University, Electrical Engineering Department April 2005  – Present (10 years 5 months) Senior Research Associate Stanford University, Electrical Engineering Department April 2005  – Present (10 years 5 months) Skills Microscopy Nanomaterials Characterization Nanotechnology Physics R&D Materials Science Thin Films Spectroscopy Product Development Design of Experiments Optics Sensors Simulations Semiconductors Program Management See 1+     See less Skills  Microscopy Nanomaterials Characterization Nanotechnology Physics R&D Materials Science Thin Films Spectroscopy Product Development Design of Experiments Optics Sensors Simulations Semiconductors Program Management See 1+     See less Microscopy Nanomaterials Characterization Nanotechnology Physics R&D Materials Science Thin Films Spectroscopy Product Development Design of Experiments Optics Sensors Simulations Semiconductors Program Management See 1+     See less Microscopy Nanomaterials Characterization Nanotechnology Physics R&D Materials Science Thin Films Spectroscopy Product Development Design of Experiments Optics Sensors Simulations Semiconductors Program Management See 1+     See less Education University of Maryland, College Park, MD Doctor of Philosophy (PhD),  Experimental Solid State Physics 1963  – 1968 Activities and Societies:  Sigma Pi Sigma ,  Senior Life Member IEEE ,  APS(AIP) University of Maryland, College Park, MD PhD Experimental Solid State Physics Doctor of Philosophy (PhD),  Experimental Solid State Physics University of Maryland, College Park, MD Doctor of Philosophy (PhD),  Experimental Solid State Physics 1963  – 1968 Activities and Societies:  Sigma Pi Sigma ,  Senior Life Member IEEE ,  APS(AIP) University of Maryland, College Park, MD Doctor of Philosophy (PhD),  Experimental Solid State Physics 1963  – 1968 Activities and Societies:  Sigma Pi Sigma ,  Senior Life Member IEEE ,  APS(AIP) University of Maryland, College Park, MD Doctor of Philosophy (PhD),  Experimental Solid State Physics 1963  – 1968 Activities and Societies:  Sigma Pi Sigma ,  Senior Life Member IEEE ,  APS(AIP) University of Maryland, College Park, MD PhD Experimental Solid State Physics Doctor of Philosophy (PhD),  Experimental Solid State Physics University of Maryland, College Park, MD PhD Experimental Solid State Physics Doctor of Philosophy (PhD),  Experimental Solid State Physics University of Maryland, College Park, MD PhD Experimental Solid State Physics Doctor of Philosophy (PhD),  Experimental Solid State Physics ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Medical Imaging Imaging X-ray Diagnostics Physics Clinical Sensors Radiology MRI Image Processing Medical Physics Biomedical Engineering Matlab Medical Devices Clinical Research R&D Cancer See 2+     See less Skills  Medical Imaging Imaging X-ray Diagnostics Physics Clinical Sensors Radiology MRI Image Processing Medical Physics Biomedical Engineering Matlab Medical Devices Clinical Research R&D Cancer See 2+     See less Medical Imaging Imaging X-ray Diagnostics Physics Clinical Sensors Radiology MRI Image Processing Medical Physics Biomedical Engineering Matlab Medical Devices Clinical Research R&D Cancer See 2+     See less Medical Imaging Imaging X-ray Diagnostics Physics Clinical Sensors Radiology MRI Image Processing Medical Physics Biomedical Engineering Matlab Medical Devices Clinical Research R&D Cancer See 2+     See less ", "Skills Psychophysics Research Science Human Factors Image Processing Teaching Data Analysis Writing Computer Vision Psychology Mathematica Signal Processing Modeling Human-computer... Programming Simulation Statistics Matlab Human Computer... Scientific Writing Neuroscience Physics University Teaching Cognitive Science Simulations Experimentation Mathematical Modeling Artificial Intelligence Pattern Recognition Algorithms See 15+     See less Skills  Psychophysics Research Science Human Factors Image Processing Teaching Data Analysis Writing Computer Vision Psychology Mathematica Signal Processing Modeling Human-computer... Programming Simulation Statistics Matlab Human Computer... Scientific Writing Neuroscience Physics University Teaching Cognitive Science Simulations Experimentation Mathematical Modeling Artificial Intelligence Pattern Recognition Algorithms See 15+     See less Psychophysics Research Science Human Factors Image Processing Teaching Data Analysis Writing Computer Vision Psychology Mathematica Signal Processing Modeling Human-computer... Programming Simulation Statistics Matlab Human Computer... Scientific Writing Neuroscience Physics University Teaching Cognitive Science Simulations Experimentation Mathematical Modeling Artificial Intelligence Pattern Recognition Algorithms See 15+     See less Psychophysics Research Science Human Factors Image Processing Teaching Data Analysis Writing Computer Vision Psychology Mathematica Signal Processing Modeling Human-computer... Programming Simulation Statistics Matlab Human Computer... Scientific Writing Neuroscience Physics University Teaching Cognitive Science Simulations Experimentation Mathematical Modeling Artificial Intelligence Pattern Recognition Algorithms See 15+     See less Honors & Awards Presidential Rank Award President of the United States October 2011 Each year the President recognizes a small group of career Senior Executives and Senior Professionals with the Presidential Rank Award. Dr. Watson received the award for his leadership and distinguished contributions in the areas of vision science and human factors. ARVO Gold Fellow Association for Research in Vision and Ophthalmology January 2012 The title of ARVO Fellow is an honor established to recognize current ARVO members for their individual accomplishments, leadership and contributions to the Association. \n \nARVO Fellows serve as role models and mentors for individuals pursuing careers in vision and ophthalmology research and help further ARVO's vision ”… to facilitate the advancement of vision research and the prevention and cure of disorders of the visual system worldwide”, which includes advancing basic and clinical knowledge and serving as the leading international forum for vision research and the primary advocate for vision science worldwide. Otto Schade Prize Society for Information Display February 2007 The Otto Schade Prize in Display Performance and Image Quality is awarded for an outstanding scientific or technical achievement in, or contribution to, the advancement of functional performance and/or image quality of information displays. Dr. Watson's citation reads: \"For his many contributions to vision science and the computational modeling of the visual process, including applications to display and image quality metrics and image compression.\" Additional Honors & Awards Presidential Rank Award \nH. Julian Allen Award (NASA) \nOtto Schade Award (Society for Information Display) \nSpecial Recognition Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Society for Information Display) \nFellow Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Optical Society of America) Presidential Rank Award President of the United States October 2011 Each year the President recognizes a small group of career Senior Executives and Senior Professionals with the Presidential Rank Award. Dr. Watson received the award for his leadership and distinguished contributions in the areas of vision science and human factors. Presidential Rank Award President of the United States October 2011 Each year the President recognizes a small group of career Senior Executives and Senior Professionals with the Presidential Rank Award. Dr. Watson received the award for his leadership and distinguished contributions in the areas of vision science and human factors. Presidential Rank Award President of the United States October 2011 Each year the President recognizes a small group of career Senior Executives and Senior Professionals with the Presidential Rank Award. Dr. Watson received the award for his leadership and distinguished contributions in the areas of vision science and human factors. ARVO Gold Fellow Association for Research in Vision and Ophthalmology January 2012 The title of ARVO Fellow is an honor established to recognize current ARVO members for their individual accomplishments, leadership and contributions to the Association. \n \nARVO Fellows serve as role models and mentors for individuals pursuing careers in vision and ophthalmology research and help further ARVO's vision ”… to facilitate the advancement of vision research and the prevention and cure of disorders of the visual system worldwide”, which includes advancing basic and clinical knowledge and serving as the leading international forum for vision research and the primary advocate for vision science worldwide. ARVO Gold Fellow Association for Research in Vision and Ophthalmology January 2012 The title of ARVO Fellow is an honor established to recognize current ARVO members for their individual accomplishments, leadership and contributions to the Association. \n \nARVO Fellows serve as role models and mentors for individuals pursuing careers in vision and ophthalmology research and help further ARVO's vision ”… to facilitate the advancement of vision research and the prevention and cure of disorders of the visual system worldwide”, which includes advancing basic and clinical knowledge and serving as the leading international forum for vision research and the primary advocate for vision science worldwide. ARVO Gold Fellow Association for Research in Vision and Ophthalmology January 2012 The title of ARVO Fellow is an honor established to recognize current ARVO members for their individual accomplishments, leadership and contributions to the Association. \n \nARVO Fellows serve as role models and mentors for individuals pursuing careers in vision and ophthalmology research and help further ARVO's vision ”… to facilitate the advancement of vision research and the prevention and cure of disorders of the visual system worldwide”, which includes advancing basic and clinical knowledge and serving as the leading international forum for vision research and the primary advocate for vision science worldwide. Otto Schade Prize Society for Information Display February 2007 The Otto Schade Prize in Display Performance and Image Quality is awarded for an outstanding scientific or technical achievement in, or contribution to, the advancement of functional performance and/or image quality of information displays. Dr. Watson's citation reads: \"For his many contributions to vision science and the computational modeling of the visual process, including applications to display and image quality metrics and image compression.\" Otto Schade Prize Society for Information Display February 2007 The Otto Schade Prize in Display Performance and Image Quality is awarded for an outstanding scientific or technical achievement in, or contribution to, the advancement of functional performance and/or image quality of information displays. Dr. Watson's citation reads: \"For his many contributions to vision science and the computational modeling of the visual process, including applications to display and image quality metrics and image compression.\" Otto Schade Prize Society for Information Display February 2007 The Otto Schade Prize in Display Performance and Image Quality is awarded for an outstanding scientific or technical achievement in, or contribution to, the advancement of functional performance and/or image quality of information displays. Dr. Watson's citation reads: \"For his many contributions to vision science and the computational modeling of the visual process, including applications to display and image quality metrics and image compression.\" Additional Honors & Awards Presidential Rank Award \nH. Julian Allen Award (NASA) \nOtto Schade Award (Society for Information Display) \nSpecial Recognition Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Society for Information Display) \nFellow Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Optical Society of America) Additional Honors & Awards Presidential Rank Award \nH. Julian Allen Award (NASA) \nOtto Schade Award (Society for Information Display) \nSpecial Recognition Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Society for Information Display) \nFellow Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Optical Society of America) Additional Honors & Awards Presidential Rank Award \nH. Julian Allen Award (NASA) \nOtto Schade Award (Society for Information Display) \nSpecial Recognition Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Society for Information Display) \nFellow Award (Assoc. for Research in Vision and Ophthalmology) \nFellow Award (Optical Society of America) ", "Experience Senior Research Associate Stanford University August 2010  – Present (5 years 1 month) Senior Research Associate Stanford University August 2010  – Present (5 years 1 month) Senior Research Associate Stanford University August 2010  – Present (5 years 1 month) Languages English Spanish English Spanish English Spanish Education Stanford University Graduate School of Education PhD,  Child and Adolescent Development Stanford University Graduate School of Education PhD,  Child and Adolescent Development Stanford University Graduate School of Education PhD,  Child and Adolescent Development Stanford University Graduate School of Education PhD,  Child and Adolescent Development ", "Summary A performance-driven Research scientist with management skills and expertise in molecular virology including viral replication assays, genetic analysis of viral genomes and cell biology. Research focus on hepatitis viruses including HCV, HAV and HDV. Proven ability to work on multiple projects independently and in a team environment with understanding of the scientific field in a business environment. Desire a leading and challenging position to utilize my vast experience in molecular virology toward drug discovery effort in leading biopharmaceutical company. \n \nQualifications Summary: \n• Adopt new research concepts and ideas in a competitive \nresearch field and generate innovative findings in a short \nperiod of time. \n• Identify and validate new potential antiviral target and its  \npotential to serve as a target. \n• Manage collaborative projects in matrix environment between \nacademic labs and biotech companies while adhering to \nproject timelines. \n• Demonstrate ability to work individually and as part of a team \nin a constructive and productive manner and assume a  \nleading role when necessary. \n• Experienced in a range of molecular virology methodologies  \nusing various viral replication systems (HCV, HDV, HAV,  \nvaccinia). \n• Experienced in identifying viral-resistance development in  \nresponse to antiviral drug treatment in culture systems. \n• Experienced in cell culture methodologies and primary culture \nestablishment. \n• Establish and optimize a cell-based assay for drug discovery  \neffort in collaboration with Stanford’s high-throughput facility. Specialties:Molecular Virology  \nHCV, HAV, HDV and other viruses \nTranslational research Summary A performance-driven Research scientist with management skills and expertise in molecular virology including viral replication assays, genetic analysis of viral genomes and cell biology. Research focus on hepatitis viruses including HCV, HAV and HDV. Proven ability to work on multiple projects independently and in a team environment with understanding of the scientific field in a business environment. Desire a leading and challenging position to utilize my vast experience in molecular virology toward drug discovery effort in leading biopharmaceutical company. \n \nQualifications Summary: \n• Adopt new research concepts and ideas in a competitive \nresearch field and generate innovative findings in a short \nperiod of time. \n• Identify and validate new potential antiviral target and its  \npotential to serve as a target. \n• Manage collaborative projects in matrix environment between \nacademic labs and biotech companies while adhering to \nproject timelines. \n• Demonstrate ability to work individually and as part of a team \nin a constructive and productive manner and assume a  \nleading role when necessary. \n• Experienced in a range of molecular virology methodologies  \nusing various viral replication systems (HCV, HDV, HAV,  \nvaccinia). \n• Experienced in identifying viral-resistance development in  \nresponse to antiviral drug treatment in culture systems. \n• Experienced in cell culture methodologies and primary culture \nestablishment. \n• Establish and optimize a cell-based assay for drug discovery  \neffort in collaboration with Stanford’s high-throughput facility. Specialties:Molecular Virology  \nHCV, HAV, HDV and other viruses \nTranslational research A performance-driven Research scientist with management skills and expertise in molecular virology including viral replication assays, genetic analysis of viral genomes and cell biology. Research focus on hepatitis viruses including HCV, HAV and HDV. Proven ability to work on multiple projects independently and in a team environment with understanding of the scientific field in a business environment. Desire a leading and challenging position to utilize my vast experience in molecular virology toward drug discovery effort in leading biopharmaceutical company. \n \nQualifications Summary: \n• Adopt new research concepts and ideas in a competitive \nresearch field and generate innovative findings in a short \nperiod of time. \n• Identify and validate new potential antiviral target and its  \npotential to serve as a target. \n• Manage collaborative projects in matrix environment between \nacademic labs and biotech companies while adhering to \nproject timelines. \n• Demonstrate ability to work individually and as part of a team \nin a constructive and productive manner and assume a  \nleading role when necessary. \n• Experienced in a range of molecular virology methodologies  \nusing various viral replication systems (HCV, HDV, HAV,  \nvaccinia). \n• Experienced in identifying viral-resistance development in  \nresponse to antiviral drug treatment in culture systems. \n• Experienced in cell culture methodologies and primary culture \nestablishment. \n• Establish and optimize a cell-based assay for drug discovery  \neffort in collaboration with Stanford’s high-throughput facility. Specialties:Molecular Virology  \nHCV, HAV, HDV and other viruses \nTranslational research A performance-driven Research scientist with management skills and expertise in molecular virology including viral replication assays, genetic analysis of viral genomes and cell biology. Research focus on hepatitis viruses including HCV, HAV and HDV. Proven ability to work on multiple projects independently and in a team environment with understanding of the scientific field in a business environment. Desire a leading and challenging position to utilize my vast experience in molecular virology toward drug discovery effort in leading biopharmaceutical company. \n \nQualifications Summary: \n• Adopt new research concepts and ideas in a competitive \nresearch field and generate innovative findings in a short \nperiod of time. \n• Identify and validate new potential antiviral target and its  \npotential to serve as a target. \n• Manage collaborative projects in matrix environment between \nacademic labs and biotech companies while adhering to \nproject timelines. \n• Demonstrate ability to work individually and as part of a team \nin a constructive and productive manner and assume a  \nleading role when necessary. \n• Experienced in a range of molecular virology methodologies  \nusing various viral replication systems (HCV, HDV, HAV,  \nvaccinia). \n• Experienced in identifying viral-resistance development in  \nresponse to antiviral drug treatment in culture systems. \n• Experienced in cell culture methodologies and primary culture \nestablishment. \n• Establish and optimize a cell-based assay for drug discovery  \neffort in collaboration with Stanford’s high-throughput facility. Specialties:Molecular Virology  \nHCV, HAV, HDV and other viruses \nTranslational research Experience Senior Research associate Stanford University 2010  – Present (5 years) Mange multiple projects aimed at understanding various aspects of HCV life cycle.  \nDevelop new approaches for screening small molecule inhibitors of HCV replication. Research Associate Stanford University September 2003  –  September 2010  (7 years 1 month) Palo Alto CA Biochemist Compugen Ltd. January 1999  –  December 2000  (2 years) Express a variety of proteins using the baculovirus expression system for use in different assays. Senior Research associate Stanford University 2010  – Present (5 years) Mange multiple projects aimed at understanding various aspects of HCV life cycle.  \nDevelop new approaches for screening small molecule inhibitors of HCV replication. Senior Research associate Stanford University 2010  – Present (5 years) Mange multiple projects aimed at understanding various aspects of HCV life cycle.  \nDevelop new approaches for screening small molecule inhibitors of HCV replication. Research Associate Stanford University September 2003  –  September 2010  (7 years 1 month) Palo Alto CA Research Associate Stanford University September 2003  –  September 2010  (7 years 1 month) Palo Alto CA Biochemist Compugen Ltd. January 1999  –  December 2000  (2 years) Express a variety of proteins using the baculovirus expression system for use in different assays. Biochemist Compugen Ltd. January 1999  –  December 2000  (2 years) Express a variety of proteins using the baculovirus expression system for use in different assays. Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Cell Biology Molecular Biology Life Sciences Virology Immunoprecipitation viral replication assay Chemical probing of RNA... Genetic analysis of... Skills  Cell Biology Molecular Biology Life Sciences Virology Immunoprecipitation viral replication assay Chemical probing of RNA... Genetic analysis of... Cell Biology Molecular Biology Life Sciences Virology Immunoprecipitation viral replication assay Chemical probing of RNA... Genetic analysis of... Cell Biology Molecular Biology Life Sciences Virology Immunoprecipitation viral replication assay Chemical probing of RNA... Genetic analysis of... Education Stanford University Postdoctoral fellow,  Molecular virology - Hepatitis C Virus 2000  – 2003 The Hebrew University PhD,  Cell Biology 1994  – 2000 The Hebrew University MsC,  Life Sciences 1994  – 1995 The Hebrew University BsC,  Life Sciences 1990  – 1993 Stanford University Postdoctoral fellow,  Molecular virology - Hepatitis C Virus 2000  – 2003 Stanford University Postdoctoral fellow,  Molecular virology - Hepatitis C Virus 2000  – 2003 Stanford University Postdoctoral fellow,  Molecular virology - Hepatitis C Virus 2000  – 2003 The Hebrew University PhD,  Cell Biology 1994  – 2000 The Hebrew University PhD,  Cell Biology 1994  – 2000 The Hebrew University PhD,  Cell Biology 1994  – 2000 The Hebrew University MsC,  Life Sciences 1994  – 1995 The Hebrew University MsC,  Life Sciences 1994  – 1995 The Hebrew University MsC,  Life Sciences 1994  – 1995 The Hebrew University BsC,  Life Sciences 1990  – 1993 The Hebrew University BsC,  Life Sciences 1990  – 1993 The Hebrew University BsC,  Life Sciences 1990  – 1993 ", "Experience Senior Research Associate Stanford University Senior Research Associate Stanford University School of Medicine 2006  – Present (9 years) Senior Research Associate Stanford University Senior Research Associate Stanford University Senior Research Associate Stanford University School of Medicine 2006  – Present (9 years) Senior Research Associate Stanford University School of Medicine 2006  – Present (9 years) Skills Research Skills  Research Research Research ", "Experience Visiting Associate Professor Stanford University School of Medicine 2014  – Present (1 year) Dept. of Pediatrics, Div. of Neonatal and Developmental Medicine •\tSynthesis of iron oxide nanocrystals by thermal decomposition for use as MRI contrast agents, for tissue-specific release of therapeutic agents, hyperthermia, and controlled in vivo gene expression.  \n•\tDevelopment of target specific nanoparticles and liposomes using biodegradable polymers and lipids, for in vivo drug delivery and imaging. Affiliated Scientist Molecular Sciences Institute 2015  – Present (less than a year) Milpitas, CA The Molecular Sciences Institute (MSI) is an independent, non-profit research laboratory and a 501(c)(3) organization. \nOur mission is to integrate science across many disciplines in order to make radical leaps in knowledge that leads to real impact in the world.  \n \nWithin this grand challenge, we have two, intertwined goals.  \n•\tPerform cutting-edge science within our not-for-profit institute. \n•\tProvide a \"Proving Ground\" for the next generation of entrepreneurs and scientists to help them achieve their maximum potential. \n \nhttp://www.molsci.org Docent / Associate Professor Uppsala University 2014  – Present (1 year) Department of Chemistry - BMC Board Member The Swedish-American Chamber of Commerce - San Francisco/Silicon Valley March 2015  – Present (6 months) SACC-USA is the umbrella organization for 18 regional Swedish-American Chambers of Commerce across the United States. The organization serves more than 2,300 members in Sweden and the U.S., which makes SACC-USA the second largest European Chamber of Commerce in the United States. \n \nThe mission of SACC is to facilitate and support trade, commerce, and investment between the U.S. and Sweden. SACC help Swedish companies find the right partners in the USA – and vice versa. By using a wide network and contact generating tools and methods, the organization ensures that products, services and information are presented in the right way to the right people. Senior Scientist, International and Industry Relations, Karolinska Institutet August 2011  –  September 2013  (2 years 2 months) Swedish Medical Nanoscience Center, Karolinska Institutet Conducts research in the area of nanomedicine and nanotechnology. Specific interests in polymeric nanoparticle formation, target specific drug delivery, siRNA gene silencing, in vivo imaging, and supercritical fluid processing. \nAlso holds the title of International and Industry Relations for the Center, establishing global research collaborations with industry and investors. Scientific Coordinator for Japan Karolinska Institutet October 2012  –  July 2013  (10 months) Karolinska Institutet, Stockholm, Sweden To promote KIs education and research activities at universities and institutions in Japan through: \n-stimulating new networks and contacts within Japan \n-tracking ongoing partnerships and finding synergies between them, and maintaining contact with KI researchers active in the Japan \n-promoting the recruitment of students from Japan to KIs Masters and Doctoral programs. President, Silicon Vikings Stockholm Chapter Silicon Vikings January 2012  –  June 2013  (1 year 6 months) Stockholm, Sweden We are the Swedish Chapter to Silicon Vikings HQ, a collaborative non-profit member organization for networking and promotion of technologies and businesses intersecting Silicon Valley (San Francisco Bay Area, California, U.S.A.) and the Nordic region (Denmark, Estonia, Finland, Iceland, Norway, and Sweden). Silicon Vikings delivers value to its members through technology and business driven events, projects and social networking events. We connect the Nordic Region to Silicon Valley's networked business and educational ecosystems. Senior Research Associate Stanford University October 2004  –  July 2011  (6 years 10 months) • Nanoparticle formation and encapsulation of pharmaceuticals for in vivo target specific drug delivery. \n• Development of sustained released drug delivery systems using biodegradable polymers. \n• Development of siRNA encapsulated nanoparticles for in vivo gene silencing.  \n• In vivo drug distribution studies of targeted compounds using bioluminescence and fluorescence imaging. \n• Design and development of supercritical fluid systems used for nanoparticle formation, reactions, separations, and extraction. (SAS, SEDS, RESS, RESOLV, SFC, SFE etc.). Process Development Manager Tokyo Electron Ltd June 2002  –  October 2004  (2 years 5 months) •\tDeveloping an enabling technology using supercritical carbon dioxide to clean BEOL and FEOL semiconductor wafers. Working with the latest ultra low-k dielectrics and Cu technology. \n•\tResponsible for all process development on customer wafers. Customer support includes establishing SOW and planning demos, developing chemical processes, process updates, customer visits. \n•\tUp-to-date knowledge of current wafer integration schemes, latest ILD materials, and problems with current cleaning techniques.  \n•\tEstablished safety procedures and training for the process lab. The lab was ranked number 1 within TEL in effective EHS program development and implementation. \n•\tManager of eight research scientists, ranging from BS in Chemistry to PhD level. Technical Staff Member Los Alamos National Laboratory January 2000  –  May 2002  (2 years 5 months) Project Manager at the Supercritical Fluid Facility,  \nResearch areas include:  \n•\tBiphasic organometallic catalysis in dense phase CO2. \n•\tSelective extraction and crystallization of bio-products. \n•\tChemical deposition on membranes. \n•\tHigh pressure NMR of H2O/CO2 microemulsions and emulsions. \n•\tEnhanced Surveillance Project Polymer Aging: polymer swelling using supercritical CO2.  \n•\tPolymer and coatings removal. \n•\tSupercritical carbon dioxide/ modifiers characterization. \n•\tIonic fluid applications Research Engineer Uppsala Univ PET centre 1992  –  1996  (4 years) Uppsala, Sweden Synthesis of 11C-, 18F- and 15O-labelled radiopharmaceuticals for use in in vivo studies in man and animals using PET (Positron Emission Tomography) imaging. Developed new synthetic radiolabelling techniques (homogeneous organometallic catalysis, enzymatic reactions) and experimental PC-controlled apparatus. SOP documentation and controls regarding sterility and pyrogenicity. Visiting Associate Professor Stanford University School of Medicine 2014  – Present (1 year) Dept. of Pediatrics, Div. of Neonatal and Developmental Medicine •\tSynthesis of iron oxide nanocrystals by thermal decomposition for use as MRI contrast agents, for tissue-specific release of therapeutic agents, hyperthermia, and controlled in vivo gene expression.  \n•\tDevelopment of target specific nanoparticles and liposomes using biodegradable polymers and lipids, for in vivo drug delivery and imaging. Visiting Associate Professor Stanford University School of Medicine 2014  – Present (1 year) Dept. of Pediatrics, Div. of Neonatal and Developmental Medicine •\tSynthesis of iron oxide nanocrystals by thermal decomposition for use as MRI contrast agents, for tissue-specific release of therapeutic agents, hyperthermia, and controlled in vivo gene expression.  \n•\tDevelopment of target specific nanoparticles and liposomes using biodegradable polymers and lipids, for in vivo drug delivery and imaging. Affiliated Scientist Molecular Sciences Institute 2015  – Present (less than a year) Milpitas, CA The Molecular Sciences Institute (MSI) is an independent, non-profit research laboratory and a 501(c)(3) organization. \nOur mission is to integrate science across many disciplines in order to make radical leaps in knowledge that leads to real impact in the world.  \n \nWithin this grand challenge, we have two, intertwined goals.  \n•\tPerform cutting-edge science within our not-for-profit institute. \n•\tProvide a \"Proving Ground\" for the next generation of entrepreneurs and scientists to help them achieve their maximum potential. \n \nhttp://www.molsci.org Affiliated Scientist Molecular Sciences Institute 2015  – Present (less than a year) Milpitas, CA The Molecular Sciences Institute (MSI) is an independent, non-profit research laboratory and a 501(c)(3) organization. \nOur mission is to integrate science across many disciplines in order to make radical leaps in knowledge that leads to real impact in the world.  \n \nWithin this grand challenge, we have two, intertwined goals.  \n•\tPerform cutting-edge science within our not-for-profit institute. \n•\tProvide a \"Proving Ground\" for the next generation of entrepreneurs and scientists to help them achieve their maximum potential. \n \nhttp://www.molsci.org Docent / Associate Professor Uppsala University 2014  – Present (1 year) Department of Chemistry - BMC Docent / Associate Professor Uppsala University 2014  – Present (1 year) Department of Chemistry - BMC Board Member The Swedish-American Chamber of Commerce - San Francisco/Silicon Valley March 2015  – Present (6 months) SACC-USA is the umbrella organization for 18 regional Swedish-American Chambers of Commerce across the United States. The organization serves more than 2,300 members in Sweden and the U.S., which makes SACC-USA the second largest European Chamber of Commerce in the United States. \n \nThe mission of SACC is to facilitate and support trade, commerce, and investment between the U.S. and Sweden. SACC help Swedish companies find the right partners in the USA – and vice versa. By using a wide network and contact generating tools and methods, the organization ensures that products, services and information are presented in the right way to the right people. Board Member The Swedish-American Chamber of Commerce - San Francisco/Silicon Valley March 2015  – Present (6 months) SACC-USA is the umbrella organization for 18 regional Swedish-American Chambers of Commerce across the United States. The organization serves more than 2,300 members in Sweden and the U.S., which makes SACC-USA the second largest European Chamber of Commerce in the United States. \n \nThe mission of SACC is to facilitate and support trade, commerce, and investment between the U.S. and Sweden. SACC help Swedish companies find the right partners in the USA – and vice versa. By using a wide network and contact generating tools and methods, the organization ensures that products, services and information are presented in the right way to the right people. Senior Scientist, International and Industry Relations, Karolinska Institutet August 2011  –  September 2013  (2 years 2 months) Swedish Medical Nanoscience Center, Karolinska Institutet Conducts research in the area of nanomedicine and nanotechnology. Specific interests in polymeric nanoparticle formation, target specific drug delivery, siRNA gene silencing, in vivo imaging, and supercritical fluid processing. \nAlso holds the title of International and Industry Relations for the Center, establishing global research collaborations with industry and investors. Senior Scientist, International and Industry Relations, Karolinska Institutet August 2011  –  September 2013  (2 years 2 months) Swedish Medical Nanoscience Center, Karolinska Institutet Conducts research in the area of nanomedicine and nanotechnology. Specific interests in polymeric nanoparticle formation, target specific drug delivery, siRNA gene silencing, in vivo imaging, and supercritical fluid processing. \nAlso holds the title of International and Industry Relations for the Center, establishing global research collaborations with industry and investors. Scientific Coordinator for Japan Karolinska Institutet October 2012  –  July 2013  (10 months) Karolinska Institutet, Stockholm, Sweden To promote KIs education and research activities at universities and institutions in Japan through: \n-stimulating new networks and contacts within Japan \n-tracking ongoing partnerships and finding synergies between them, and maintaining contact with KI researchers active in the Japan \n-promoting the recruitment of students from Japan to KIs Masters and Doctoral programs. Scientific Coordinator for Japan Karolinska Institutet October 2012  –  July 2013  (10 months) Karolinska Institutet, Stockholm, Sweden To promote KIs education and research activities at universities and institutions in Japan through: \n-stimulating new networks and contacts within Japan \n-tracking ongoing partnerships and finding synergies between them, and maintaining contact with KI researchers active in the Japan \n-promoting the recruitment of students from Japan to KIs Masters and Doctoral programs. President, Silicon Vikings Stockholm Chapter Silicon Vikings January 2012  –  June 2013  (1 year 6 months) Stockholm, Sweden We are the Swedish Chapter to Silicon Vikings HQ, a collaborative non-profit member organization for networking and promotion of technologies and businesses intersecting Silicon Valley (San Francisco Bay Area, California, U.S.A.) and the Nordic region (Denmark, Estonia, Finland, Iceland, Norway, and Sweden). Silicon Vikings delivers value to its members through technology and business driven events, projects and social networking events. We connect the Nordic Region to Silicon Valley's networked business and educational ecosystems. President, Silicon Vikings Stockholm Chapter Silicon Vikings January 2012  –  June 2013  (1 year 6 months) Stockholm, Sweden We are the Swedish Chapter to Silicon Vikings HQ, a collaborative non-profit member organization for networking and promotion of technologies and businesses intersecting Silicon Valley (San Francisco Bay Area, California, U.S.A.) and the Nordic region (Denmark, Estonia, Finland, Iceland, Norway, and Sweden). Silicon Vikings delivers value to its members through technology and business driven events, projects and social networking events. We connect the Nordic Region to Silicon Valley's networked business and educational ecosystems. Senior Research Associate Stanford University October 2004  –  July 2011  (6 years 10 months) • Nanoparticle formation and encapsulation of pharmaceuticals for in vivo target specific drug delivery. \n• Development of sustained released drug delivery systems using biodegradable polymers. \n• Development of siRNA encapsulated nanoparticles for in vivo gene silencing.  \n• In vivo drug distribution studies of targeted compounds using bioluminescence and fluorescence imaging. \n• Design and development of supercritical fluid systems used for nanoparticle formation, reactions, separations, and extraction. (SAS, SEDS, RESS, RESOLV, SFC, SFE etc.). Senior Research Associate Stanford University October 2004  –  July 2011  (6 years 10 months) • Nanoparticle formation and encapsulation of pharmaceuticals for in vivo target specific drug delivery. \n• Development of sustained released drug delivery systems using biodegradable polymers. \n• Development of siRNA encapsulated nanoparticles for in vivo gene silencing.  \n• In vivo drug distribution studies of targeted compounds using bioluminescence and fluorescence imaging. \n• Design and development of supercritical fluid systems used for nanoparticle formation, reactions, separations, and extraction. (SAS, SEDS, RESS, RESOLV, SFC, SFE etc.). Process Development Manager Tokyo Electron Ltd June 2002  –  October 2004  (2 years 5 months) •\tDeveloping an enabling technology using supercritical carbon dioxide to clean BEOL and FEOL semiconductor wafers. Working with the latest ultra low-k dielectrics and Cu technology. \n•\tResponsible for all process development on customer wafers. Customer support includes establishing SOW and planning demos, developing chemical processes, process updates, customer visits. \n•\tUp-to-date knowledge of current wafer integration schemes, latest ILD materials, and problems with current cleaning techniques.  \n•\tEstablished safety procedures and training for the process lab. The lab was ranked number 1 within TEL in effective EHS program development and implementation. \n•\tManager of eight research scientists, ranging from BS in Chemistry to PhD level. Process Development Manager Tokyo Electron Ltd June 2002  –  October 2004  (2 years 5 months) •\tDeveloping an enabling technology using supercritical carbon dioxide to clean BEOL and FEOL semiconductor wafers. Working with the latest ultra low-k dielectrics and Cu technology. \n•\tResponsible for all process development on customer wafers. Customer support includes establishing SOW and planning demos, developing chemical processes, process updates, customer visits. \n•\tUp-to-date knowledge of current wafer integration schemes, latest ILD materials, and problems with current cleaning techniques.  \n•\tEstablished safety procedures and training for the process lab. The lab was ranked number 1 within TEL in effective EHS program development and implementation. \n•\tManager of eight research scientists, ranging from BS in Chemistry to PhD level. Technical Staff Member Los Alamos National Laboratory January 2000  –  May 2002  (2 years 5 months) Project Manager at the Supercritical Fluid Facility,  \nResearch areas include:  \n•\tBiphasic organometallic catalysis in dense phase CO2. \n•\tSelective extraction and crystallization of bio-products. \n•\tChemical deposition on membranes. \n•\tHigh pressure NMR of H2O/CO2 microemulsions and emulsions. \n•\tEnhanced Surveillance Project Polymer Aging: polymer swelling using supercritical CO2.  \n•\tPolymer and coatings removal. \n•\tSupercritical carbon dioxide/ modifiers characterization. \n•\tIonic fluid applications Technical Staff Member Los Alamos National Laboratory January 2000  –  May 2002  (2 years 5 months) Project Manager at the Supercritical Fluid Facility,  \nResearch areas include:  \n•\tBiphasic organometallic catalysis in dense phase CO2. \n•\tSelective extraction and crystallization of bio-products. \n•\tChemical deposition on membranes. \n•\tHigh pressure NMR of H2O/CO2 microemulsions and emulsions. \n•\tEnhanced Surveillance Project Polymer Aging: polymer swelling using supercritical CO2.  \n•\tPolymer and coatings removal. \n•\tSupercritical carbon dioxide/ modifiers characterization. \n•\tIonic fluid applications Research Engineer Uppsala Univ PET centre 1992  –  1996  (4 years) Uppsala, Sweden Synthesis of 11C-, 18F- and 15O-labelled radiopharmaceuticals for use in in vivo studies in man and animals using PET (Positron Emission Tomography) imaging. Developed new synthetic radiolabelling techniques (homogeneous organometallic catalysis, enzymatic reactions) and experimental PC-controlled apparatus. SOP documentation and controls regarding sterility and pyrogenicity. Research Engineer Uppsala Univ PET centre 1992  –  1996  (4 years) Uppsala, Sweden Synthesis of 11C-, 18F- and 15O-labelled radiopharmaceuticals for use in in vivo studies in man and animals using PET (Positron Emission Tomography) imaging. Developed new synthetic radiolabelling techniques (homogeneous organometallic catalysis, enzymatic reactions) and experimental PC-controlled apparatus. SOP documentation and controls regarding sterility and pyrogenicity. Languages English Native or bilingual proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency Swedish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Characterization Chemistry Analytical Chemistry Polymers Fluorescence Science Spectroscopy Nanoparticles Drug Delivery R&D Lifesciences Chemical Engineering Research Materials Science Biotechnology Biochemistry Nanomedicine Nanotechnology Organic Chemistry Supercritical Fluids conductive polymers SEM HPLC GC-MS DLS SFE SFC NMR MS Catalysis Chromatography Organic Synthesis In Vivo UV/Vis Fluorescence Microscopy In Vitro Gas Chromatography Scanning Electron... Life Sciences See 24+     See less Skills  Characterization Chemistry Analytical Chemistry Polymers Fluorescence Science Spectroscopy Nanoparticles Drug Delivery R&D Lifesciences Chemical Engineering Research Materials Science Biotechnology Biochemistry Nanomedicine Nanotechnology Organic Chemistry Supercritical Fluids conductive polymers SEM HPLC GC-MS DLS SFE SFC NMR MS Catalysis Chromatography Organic Synthesis In Vivo UV/Vis Fluorescence Microscopy In Vitro Gas Chromatography Scanning Electron... Life Sciences See 24+     See less Characterization Chemistry Analytical Chemistry Polymers Fluorescence Science Spectroscopy Nanoparticles Drug Delivery R&D Lifesciences Chemical Engineering Research Materials Science Biotechnology Biochemistry Nanomedicine Nanotechnology Organic Chemistry Supercritical Fluids conductive polymers SEM HPLC GC-MS DLS SFE SFC NMR MS Catalysis Chromatography Organic Synthesis In Vivo UV/Vis Fluorescence Microscopy In Vitro Gas Chromatography Scanning Electron... Life Sciences See 24+     See less Characterization Chemistry Analytical Chemistry Polymers Fluorescence Science Spectroscopy Nanoparticles Drug Delivery R&D Lifesciences Chemical Engineering Research Materials Science Biotechnology Biochemistry Nanomedicine Nanotechnology Organic Chemistry Supercritical Fluids conductive polymers SEM HPLC GC-MS DLS SFE SFC NMR MS Catalysis Chromatography Organic Synthesis In Vivo UV/Vis Fluorescence Microscopy In Vitro Gas Chromatography Scanning Electron... Life Sciences See 24+     See less Education Uppsala University PhD,  Organic Chemistry 1991  – 1996 Designed a Supercritical Fluid Synthesis (SFS) system for small-scale remote controlled synthesis and separation of compounds labelled with 11C. 11C-labelling of phenolates, sulfides, amines and carbanions, and synthesis of labelled urea, cyanamides and guanidines. Enzymatic multiposition labelling of endogenous C11-labelled carnitines for in vivo studies of the kinetics in the Krebs cycle. The University of Texas at Austin Post Doc,  Chemical Engineering 1997  – 1998 Advisor: Prof. Keith P. Johnston, Dept. of Chemical Engineering.  \nPhase behaviour and design of new surfactants for water/carbon dioxide microemulsions and emulsions. Demonstrated their use in a new route for synthetic organic chemistry as they facilitate reactions between organic substrates and hydrophilic nucleophiles to a much greater degree than conventional microemulsions in organic solvents. Lowered the surfactant concentration by an order of magnitude compared to the case of microemulsions in organic solvents and achieved comparable product yields. Los Alamos National Laboratory, Los Alamos, NM, USA Post Doc,  Chemsitry 1998  – 2000 Advisor: William Tumas, CST-18.  \nHomogeneous biphasic catalysis in water/carbon dioxide (c/w) microemulsions and emulsions. Design of water-soluble catalyst complexes for use in hydroformylation, hydrogenation, C-C bond forming reactions and oxidations reactions. Investigation of new surfactants and their phase behaviour. Demonstrated improved reaction rates, phase separation and reuse of catalyst and surfactant, and extended applications to non water-soluble substrates for homogeneous catalysis using the biphasic c/w systems as compared to conventional biphasic systems. Patent filed on these findings. Uppsala University PhD,  Organic Chemistry 1991  – 1996 Designed a Supercritical Fluid Synthesis (SFS) system for small-scale remote controlled synthesis and separation of compounds labelled with 11C. 11C-labelling of phenolates, sulfides, amines and carbanions, and synthesis of labelled urea, cyanamides and guanidines. Enzymatic multiposition labelling of endogenous C11-labelled carnitines for in vivo studies of the kinetics in the Krebs cycle. Uppsala University PhD,  Organic Chemistry 1991  – 1996 Designed a Supercritical Fluid Synthesis (SFS) system for small-scale remote controlled synthesis and separation of compounds labelled with 11C. 11C-labelling of phenolates, sulfides, amines and carbanions, and synthesis of labelled urea, cyanamides and guanidines. Enzymatic multiposition labelling of endogenous C11-labelled carnitines for in vivo studies of the kinetics in the Krebs cycle. Uppsala University PhD,  Organic Chemistry 1991  – 1996 Designed a Supercritical Fluid Synthesis (SFS) system for small-scale remote controlled synthesis and separation of compounds labelled with 11C. 11C-labelling of phenolates, sulfides, amines and carbanions, and synthesis of labelled urea, cyanamides and guanidines. Enzymatic multiposition labelling of endogenous C11-labelled carnitines for in vivo studies of the kinetics in the Krebs cycle. The University of Texas at Austin Post Doc,  Chemical Engineering 1997  – 1998 Advisor: Prof. Keith P. Johnston, Dept. of Chemical Engineering.  \nPhase behaviour and design of new surfactants for water/carbon dioxide microemulsions and emulsions. Demonstrated their use in a new route for synthetic organic chemistry as they facilitate reactions between organic substrates and hydrophilic nucleophiles to a much greater degree than conventional microemulsions in organic solvents. Lowered the surfactant concentration by an order of magnitude compared to the case of microemulsions in organic solvents and achieved comparable product yields. The University of Texas at Austin Post Doc,  Chemical Engineering 1997  – 1998 Advisor: Prof. Keith P. Johnston, Dept. of Chemical Engineering.  \nPhase behaviour and design of new surfactants for water/carbon dioxide microemulsions and emulsions. Demonstrated their use in a new route for synthetic organic chemistry as they facilitate reactions between organic substrates and hydrophilic nucleophiles to a much greater degree than conventional microemulsions in organic solvents. Lowered the surfactant concentration by an order of magnitude compared to the case of microemulsions in organic solvents and achieved comparable product yields. The University of Texas at Austin Post Doc,  Chemical Engineering 1997  – 1998 Advisor: Prof. Keith P. Johnston, Dept. of Chemical Engineering.  \nPhase behaviour and design of new surfactants for water/carbon dioxide microemulsions and emulsions. Demonstrated their use in a new route for synthetic organic chemistry as they facilitate reactions between organic substrates and hydrophilic nucleophiles to a much greater degree than conventional microemulsions in organic solvents. Lowered the surfactant concentration by an order of magnitude compared to the case of microemulsions in organic solvents and achieved comparable product yields. Los Alamos National Laboratory, Los Alamos, NM, USA Post Doc,  Chemsitry 1998  – 2000 Advisor: William Tumas, CST-18.  \nHomogeneous biphasic catalysis in water/carbon dioxide (c/w) microemulsions and emulsions. Design of water-soluble catalyst complexes for use in hydroformylation, hydrogenation, C-C bond forming reactions and oxidations reactions. Investigation of new surfactants and their phase behaviour. Demonstrated improved reaction rates, phase separation and reuse of catalyst and surfactant, and extended applications to non water-soluble substrates for homogeneous catalysis using the biphasic c/w systems as compared to conventional biphasic systems. Patent filed on these findings. Los Alamos National Laboratory, Los Alamos, NM, USA Post Doc,  Chemsitry 1998  – 2000 Advisor: William Tumas, CST-18.  \nHomogeneous biphasic catalysis in water/carbon dioxide (c/w) microemulsions and emulsions. Design of water-soluble catalyst complexes for use in hydroformylation, hydrogenation, C-C bond forming reactions and oxidations reactions. Investigation of new surfactants and their phase behaviour. Demonstrated improved reaction rates, phase separation and reuse of catalyst and surfactant, and extended applications to non water-soluble substrates for homogeneous catalysis using the biphasic c/w systems as compared to conventional biphasic systems. Patent filed on these findings. Los Alamos National Laboratory, Los Alamos, NM, USA Post Doc,  Chemsitry 1998  – 2000 Advisor: William Tumas, CST-18.  \nHomogeneous biphasic catalysis in water/carbon dioxide (c/w) microemulsions and emulsions. Design of water-soluble catalyst complexes for use in hydroformylation, hydrogenation, C-C bond forming reactions and oxidations reactions. Investigation of new surfactants and their phase behaviour. Demonstrated improved reaction rates, phase separation and reuse of catalyst and surfactant, and extended applications to non water-soluble substrates for homogeneous catalysis using the biphasic c/w systems as compared to conventional biphasic systems. Patent filed on these findings. Honors & Awards R&D 100 Award - SCORR: Supercritical CO2 Resist Removal R&D Magazine 2001 Outstanding Innovation Development Award Federal Laboratory Consortium for Technology Transfer 2002 The Presidential Green Chemistry Award US Environmental Protection Agency 2002 R&D 100 Award - SCORR: Supercritical CO2 Resist Removal R&D Magazine 2001 R&D 100 Award - SCORR: Supercritical CO2 Resist Removal R&D Magazine 2001 R&D 100 Award - SCORR: Supercritical CO2 Resist Removal R&D Magazine 2001 Outstanding Innovation Development Award Federal Laboratory Consortium for Technology Transfer 2002 Outstanding Innovation Development Award Federal Laboratory Consortium for Technology Transfer 2002 Outstanding Innovation Development Award Federal Laboratory Consortium for Technology Transfer 2002 The Presidential Green Chemistry Award US Environmental Protection Agency 2002 The Presidential Green Chemistry Award US Environmental Protection Agency 2002 The Presidential Green Chemistry Award US Environmental Protection Agency 2002 ", "Summary I co-founded and direct the digital arts minor at Dartmouth College. Our undergraduate program merges computer science, visual arts, animation and engineering. Students take computer modeling, computer animation, programming for interactive digital arts, projects in digital arts, motion studies courses and more. Our Digital Arts Creative Technology Studio is a vibrant place where students from all disciplines and backgrounds work together, using best practices in technology, art and science to solve complex problems, make interactive art, build tools and visualize data. You can see some of our work at www.cs.dartmouth.edu/digitalarts Summary I co-founded and direct the digital arts minor at Dartmouth College. Our undergraduate program merges computer science, visual arts, animation and engineering. Students take computer modeling, computer animation, programming for interactive digital arts, projects in digital arts, motion studies courses and more. Our Digital Arts Creative Technology Studio is a vibrant place where students from all disciplines and backgrounds work together, using best practices in technology, art and science to solve complex problems, make interactive art, build tools and visualize data. You can see some of our work at www.cs.dartmouth.edu/digitalarts I co-founded and direct the digital arts minor at Dartmouth College. Our undergraduate program merges computer science, visual arts, animation and engineering. Students take computer modeling, computer animation, programming for interactive digital arts, projects in digital arts, motion studies courses and more. Our Digital Arts Creative Technology Studio is a vibrant place where students from all disciplines and backgrounds work together, using best practices in technology, art and science to solve complex problems, make interactive art, build tools and visualize data. You can see some of our work at www.cs.dartmouth.edu/digitalarts I co-founded and direct the digital arts minor at Dartmouth College. Our undergraduate program merges computer science, visual arts, animation and engineering. Students take computer modeling, computer animation, programming for interactive digital arts, projects in digital arts, motion studies courses and more. Our Digital Arts Creative Technology Studio is a vibrant place where students from all disciplines and backgrounds work together, using best practices in technology, art and science to solve complex problems, make interactive art, build tools and visualize data. You can see some of our work at www.cs.dartmouth.edu/digitalarts Experience Research Professor, Computer Science and Executive Director of the DALI Lab Dartmouth College April 2013  – Present (2 years 5 months) Dartmouth College A research and development lab in the computer science department at Dartmouth College. Funded by the Neukom Institute, the DALI Lab brings student designers and developers together to visualize data. We work with non-profits, faculty, centers, start-ups and museums, to make complex information easy to understand, interactive and compelling. We practice creative communication. Member, Board of Trustees The Sharon Academy September 2012  – Present (3 years) Sharon, VT Serve on Board of Trustees for small Independent Middle and High School in Sharon, VT President, Founder tellEmotion, Inc. September 2008  – Present (7 years) Real-time energy feedback aimed at changing behavior and encouraging people to conserve resources. Donella Meadows Leadership Fellows Program Sustainability Institute April 2008  – Present (7 years 5 months) Director of Digital Arts, Research Professor Dartmouth College September 2003  – Present (12 years) Dartmouth College, Computer Science Department Director and Founder of the DALI Lab. The Neukom Digital Arts Leadership and Innovation Lab. Tim Tregubov is the Technical Director. Juror Global Social Venture Competition March 2014  –  March 2014  (1 month) Bangkok, Thailand Workshop Director, Visiting Scholar Ashoka Thailand 2013  –  2014  (1 year) fellow juror (Computer Animation) Prix Ars Electronica 2012  –  2012  (less than a year) Animator in Residence, Senior Research Associate Stanford University 1999  –  2002  (3 years) Worked in Computer Graphics area in the Computer Science Department Animation consultant Interval Research 1997  –  2000  (3 years) animator Story Animation 1996  –  1996  (less than a year) Assistant Professor New York University 1989  –  1995  (6 years) Animation Instructor Rhode Island School of Design September 1987  –  1989  (2 years) Research Professor, Computer Science and Executive Director of the DALI Lab Dartmouth College April 2013  – Present (2 years 5 months) Dartmouth College A research and development lab in the computer science department at Dartmouth College. Funded by the Neukom Institute, the DALI Lab brings student designers and developers together to visualize data. We work with non-profits, faculty, centers, start-ups and museums, to make complex information easy to understand, interactive and compelling. We practice creative communication. Research Professor, Computer Science and Executive Director of the DALI Lab Dartmouth College April 2013  – Present (2 years 5 months) Dartmouth College A research and development lab in the computer science department at Dartmouth College. Funded by the Neukom Institute, the DALI Lab brings student designers and developers together to visualize data. We work with non-profits, faculty, centers, start-ups and museums, to make complex information easy to understand, interactive and compelling. We practice creative communication. Member, Board of Trustees The Sharon Academy September 2012  – Present (3 years) Sharon, VT Serve on Board of Trustees for small Independent Middle and High School in Sharon, VT Member, Board of Trustees The Sharon Academy September 2012  – Present (3 years) Sharon, VT Serve on Board of Trustees for small Independent Middle and High School in Sharon, VT President, Founder tellEmotion, Inc. September 2008  – Present (7 years) Real-time energy feedback aimed at changing behavior and encouraging people to conserve resources. President, Founder tellEmotion, Inc. September 2008  – Present (7 years) Real-time energy feedback aimed at changing behavior and encouraging people to conserve resources. Donella Meadows Leadership Fellows Program Sustainability Institute April 2008  – Present (7 years 5 months) Donella Meadows Leadership Fellows Program Sustainability Institute April 2008  – Present (7 years 5 months) Director of Digital Arts, Research Professor Dartmouth College September 2003  – Present (12 years) Dartmouth College, Computer Science Department Director and Founder of the DALI Lab. The Neukom Digital Arts Leadership and Innovation Lab. Tim Tregubov is the Technical Director. Director of Digital Arts, Research Professor Dartmouth College September 2003  – Present (12 years) Dartmouth College, Computer Science Department Director and Founder of the DALI Lab. The Neukom Digital Arts Leadership and Innovation Lab. Tim Tregubov is the Technical Director. Juror Global Social Venture Competition March 2014  –  March 2014  (1 month) Bangkok, Thailand Juror Global Social Venture Competition March 2014  –  March 2014  (1 month) Bangkok, Thailand Workshop Director, Visiting Scholar Ashoka Thailand 2013  –  2014  (1 year) Workshop Director, Visiting Scholar Ashoka Thailand 2013  –  2014  (1 year) fellow juror (Computer Animation) Prix Ars Electronica 2012  –  2012  (less than a year) fellow juror (Computer Animation) Prix Ars Electronica 2012  –  2012  (less than a year) Animator in Residence, Senior Research Associate Stanford University 1999  –  2002  (3 years) Worked in Computer Graphics area in the Computer Science Department Animator in Residence, Senior Research Associate Stanford University 1999  –  2002  (3 years) Worked in Computer Graphics area in the Computer Science Department Animation consultant Interval Research 1997  –  2000  (3 years) Animation consultant Interval Research 1997  –  2000  (3 years) animator Story Animation 1996  –  1996  (less than a year) animator Story Animation 1996  –  1996  (less than a year) Assistant Professor New York University 1989  –  1995  (6 years) Assistant Professor New York University 1989  –  1995  (6 years) Animation Instructor Rhode Island School of Design September 1987  –  1989  (2 years) Animation Instructor Rhode Island School of Design September 1987  –  1989  (2 years) Skills University Teaching Computer Graphics Animation Computer Animation Computer Science Research Teaching Higher Education Machine Learning Public Speaking Editing Science Data Analysis Lecturing Film Art Programming See 2+     See less Skills  University Teaching Computer Graphics Animation Computer Animation Computer Science Research Teaching Higher Education Machine Learning Public Speaking Editing Science Data Analysis Lecturing Film Art Programming See 2+     See less University Teaching Computer Graphics Animation Computer Animation Computer Science Research Teaching Higher Education Machine Learning Public Speaking Editing Science Data Analysis Lecturing Film Art Programming See 2+     See less University Teaching Computer Graphics Animation Computer Animation Computer Science Research Teaching Higher Education Machine Learning Public Speaking Editing Science Data Analysis Lecturing Film Art Programming See 2+     See less Education New York University 1980  – 1982 New York University 1980  – 1982 New York University 1980  – 1982 New York University 1980  – 1982 Honors & Awards Fulbright Fellowship Award Fulbright Specialist Program May 2013 Whiting Fellowship Award Whiting Foundation June 2013 Fulbright Fellowship Award Fulbright Specialist Program May 2013 Fulbright Fellowship Award Fulbright Specialist Program May 2013 Fulbright Fellowship Award Fulbright Specialist Program May 2013 Whiting Fellowship Award Whiting Foundation June 2013 Whiting Fellowship Award Whiting Foundation June 2013 Whiting Fellowship Award Whiting Foundation June 2013 ", "Summary My 25 year career in policy development, idea generation and thought leadership is characterized by using well-grounded evidence and communication tools to drive impact. Through in-depth analysis, planning and team management, I advance strategic ideas while working collaboratively with key stakeholders. Areas of expertise include policy implementation and effectiveness, educational reform, and post-secondary attainment. Teaching and research associations over the past 20 years include Stanford University, University of Minnesota and University of Illinois at Urbana-Champaign. I hold a Ph. D. and M.A. from the University of Wisconsin-Madison, B.A. from Lawrence University, and a certificate from Harvard University's Kennedy School for Executive Education. \n \nSpecialties: Social science/education research, project management, idea generation of public value, public speaking, technical writing. Summary My 25 year career in policy development, idea generation and thought leadership is characterized by using well-grounded evidence and communication tools to drive impact. Through in-depth analysis, planning and team management, I advance strategic ideas while working collaboratively with key stakeholders. Areas of expertise include policy implementation and effectiveness, educational reform, and post-secondary attainment. Teaching and research associations over the past 20 years include Stanford University, University of Minnesota and University of Illinois at Urbana-Champaign. I hold a Ph. D. and M.A. from the University of Wisconsin-Madison, B.A. from Lawrence University, and a certificate from Harvard University's Kennedy School for Executive Education. \n \nSpecialties: Social science/education research, project management, idea generation of public value, public speaking, technical writing. My 25 year career in policy development, idea generation and thought leadership is characterized by using well-grounded evidence and communication tools to drive impact. Through in-depth analysis, planning and team management, I advance strategic ideas while working collaboratively with key stakeholders. Areas of expertise include policy implementation and effectiveness, educational reform, and post-secondary attainment. Teaching and research associations over the past 20 years include Stanford University, University of Minnesota and University of Illinois at Urbana-Champaign. I hold a Ph. D. and M.A. from the University of Wisconsin-Madison, B.A. from Lawrence University, and a certificate from Harvard University's Kennedy School for Executive Education. \n \nSpecialties: Social science/education research, project management, idea generation of public value, public speaking, technical writing. My 25 year career in policy development, idea generation and thought leadership is characterized by using well-grounded evidence and communication tools to drive impact. Through in-depth analysis, planning and team management, I advance strategic ideas while working collaboratively with key stakeholders. Areas of expertise include policy implementation and effectiveness, educational reform, and post-secondary attainment. Teaching and research associations over the past 20 years include Stanford University, University of Minnesota and University of Illinois at Urbana-Champaign. I hold a Ph. D. and M.A. from the University of Wisconsin-Madison, B.A. from Lawrence University, and a certificate from Harvard University's Kennedy School for Executive Education. \n \nSpecialties: Social science/education research, project management, idea generation of public value, public speaking, technical writing. Experience Director, Regional Outreach Federal Reserve Bank of Minneapolis June 2013  – Present (2 years 3 months) Minneapolis Liaison and consultant for business areas. Assist business areas in gathering/sharing market intelligence and educating the general public on topics and issues of interest to the Bank. Cultivate and build relationships with key constituents (e.g., business and community leaders, educators, policy and thought leaders, financial institutions) to stay abreast of emerging and timely issues related to the local economy. Analyze findings and prepare reports to share learning with Bank senior management. Board Member SciMathMN January 2008  –  June 2014  (6 years 6 months) Consultant Consultant May 2010  –  June 2013  (3 years 2 months) Minnesota Clients: \n* University of Minnesota Extension \n* Greater Twin Cities United Way \n* Public Strategies Group Vice President, Academic Outcomes Sophia Learning, LLC July 2010  –  January 2012  (1 year 7 months) Sophia Learning is a peer-to-peer social learning platform that delivers standards-aligned content to millions of learners. The Sophia Learning platform provides a free, easy-to-use web that provides teachers, tutors, parents and students to teach and learn outside the formal classroom. In my role as VP, Academic Outcomes, I provided the standards-aligned curriculum architecture on which Sophia content is applied and hired dozens of subject matter experts to develop and review high quality content for the Sophia Learning platform . Leadership Fellow Bush Foundation June 2008  –  June 2010  (2 years 1 month) * Obtained select Leadership Fellowship by the Archibald Bush Foundation \n* Conducted independent study on the extent to which state policymakers value and rely on research in the decision making process.  \n* Conducted case studies on Washington State Institute for Public Policy (Olympia, WA) and California Research Policy Institute as models of evidence-based state policy institutes. \n* Developed and advanced policy proposal for an online clearinghouse of evidence-based findings that matches public issues with proven solutions. Research and Policy director Growth & Justice September 2005  –  September 2009  (4 years 1 month) St. Paul MN As director of policy and research, I conducted research, analysis and advocacy of significant statewide initiatives: Invest for Real Prosperity and Smart Investments in Minnesota's Students. These two blueprints call for evidence-based investments in statewide obligations in education, health and transportation/infrastructure, and rely on cost effective analysis and progressive revenue analyses. Senior Research Associate Stanford University December 2002  –  November 2005  (3 years) Co-researcher on longitudinal district-wide reform study funded by MacArthur Foundation, known as The Learning Partnership. Collaborated with Annenberg Institute for School Reform, Center for Policy Research in Education, and University of Pittsburg. Documented two years of reform implementation in a large urban district central office and 10 case study schools. Published case study in Urban Education journal, presented findings to school board and MacArthur Foundation, as well as other interested stakeholders. Assistant Professor University of Illinois at Urbana-Champaign July 1999  –  July 2001  (2 years 1 month) Taught: Organizational Theory and Administrative Leadership, Social and Political Context of Schooling, and Teaching Diversity in High School Settings in the Departments of Curriculum and Instruction/Educational Organization and Leadership. Director, Regional Outreach Federal Reserve Bank of Minneapolis June 2013  – Present (2 years 3 months) Minneapolis Liaison and consultant for business areas. Assist business areas in gathering/sharing market intelligence and educating the general public on topics and issues of interest to the Bank. Cultivate and build relationships with key constituents (e.g., business and community leaders, educators, policy and thought leaders, financial institutions) to stay abreast of emerging and timely issues related to the local economy. Analyze findings and prepare reports to share learning with Bank senior management. Director, Regional Outreach Federal Reserve Bank of Minneapolis June 2013  – Present (2 years 3 months) Minneapolis Liaison and consultant for business areas. Assist business areas in gathering/sharing market intelligence and educating the general public on topics and issues of interest to the Bank. Cultivate and build relationships with key constituents (e.g., business and community leaders, educators, policy and thought leaders, financial institutions) to stay abreast of emerging and timely issues related to the local economy. Analyze findings and prepare reports to share learning with Bank senior management. Board Member SciMathMN January 2008  –  June 2014  (6 years 6 months) Board Member SciMathMN January 2008  –  June 2014  (6 years 6 months) Consultant Consultant May 2010  –  June 2013  (3 years 2 months) Minnesota Clients: \n* University of Minnesota Extension \n* Greater Twin Cities United Way \n* Public Strategies Group Consultant Consultant May 2010  –  June 2013  (3 years 2 months) Minnesota Clients: \n* University of Minnesota Extension \n* Greater Twin Cities United Way \n* Public Strategies Group Vice President, Academic Outcomes Sophia Learning, LLC July 2010  –  January 2012  (1 year 7 months) Sophia Learning is a peer-to-peer social learning platform that delivers standards-aligned content to millions of learners. The Sophia Learning platform provides a free, easy-to-use web that provides teachers, tutors, parents and students to teach and learn outside the formal classroom. In my role as VP, Academic Outcomes, I provided the standards-aligned curriculum architecture on which Sophia content is applied and hired dozens of subject matter experts to develop and review high quality content for the Sophia Learning platform . Vice President, Academic Outcomes Sophia Learning, LLC July 2010  –  January 2012  (1 year 7 months) Sophia Learning is a peer-to-peer social learning platform that delivers standards-aligned content to millions of learners. The Sophia Learning platform provides a free, easy-to-use web that provides teachers, tutors, parents and students to teach and learn outside the formal classroom. In my role as VP, Academic Outcomes, I provided the standards-aligned curriculum architecture on which Sophia content is applied and hired dozens of subject matter experts to develop and review high quality content for the Sophia Learning platform . Leadership Fellow Bush Foundation June 2008  –  June 2010  (2 years 1 month) * Obtained select Leadership Fellowship by the Archibald Bush Foundation \n* Conducted independent study on the extent to which state policymakers value and rely on research in the decision making process.  \n* Conducted case studies on Washington State Institute for Public Policy (Olympia, WA) and California Research Policy Institute as models of evidence-based state policy institutes. \n* Developed and advanced policy proposal for an online clearinghouse of evidence-based findings that matches public issues with proven solutions. Leadership Fellow Bush Foundation June 2008  –  June 2010  (2 years 1 month) * Obtained select Leadership Fellowship by the Archibald Bush Foundation \n* Conducted independent study on the extent to which state policymakers value and rely on research in the decision making process.  \n* Conducted case studies on Washington State Institute for Public Policy (Olympia, WA) and California Research Policy Institute as models of evidence-based state policy institutes. \n* Developed and advanced policy proposal for an online clearinghouse of evidence-based findings that matches public issues with proven solutions. Research and Policy director Growth & Justice September 2005  –  September 2009  (4 years 1 month) St. Paul MN As director of policy and research, I conducted research, analysis and advocacy of significant statewide initiatives: Invest for Real Prosperity and Smart Investments in Minnesota's Students. These two blueprints call for evidence-based investments in statewide obligations in education, health and transportation/infrastructure, and rely on cost effective analysis and progressive revenue analyses. Research and Policy director Growth & Justice September 2005  –  September 2009  (4 years 1 month) St. Paul MN As director of policy and research, I conducted research, analysis and advocacy of significant statewide initiatives: Invest for Real Prosperity and Smart Investments in Minnesota's Students. These two blueprints call for evidence-based investments in statewide obligations in education, health and transportation/infrastructure, and rely on cost effective analysis and progressive revenue analyses. Senior Research Associate Stanford University December 2002  –  November 2005  (3 years) Co-researcher on longitudinal district-wide reform study funded by MacArthur Foundation, known as The Learning Partnership. Collaborated with Annenberg Institute for School Reform, Center for Policy Research in Education, and University of Pittsburg. Documented two years of reform implementation in a large urban district central office and 10 case study schools. Published case study in Urban Education journal, presented findings to school board and MacArthur Foundation, as well as other interested stakeholders. Senior Research Associate Stanford University December 2002  –  November 2005  (3 years) Co-researcher on longitudinal district-wide reform study funded by MacArthur Foundation, known as The Learning Partnership. Collaborated with Annenberg Institute for School Reform, Center for Policy Research in Education, and University of Pittsburg. Documented two years of reform implementation in a large urban district central office and 10 case study schools. Published case study in Urban Education journal, presented findings to school board and MacArthur Foundation, as well as other interested stakeholders. Assistant Professor University of Illinois at Urbana-Champaign July 1999  –  July 2001  (2 years 1 month) Taught: Organizational Theory and Administrative Leadership, Social and Political Context of Schooling, and Teaching Diversity in High School Settings in the Departments of Curriculum and Instruction/Educational Organization and Leadership. Assistant Professor University of Illinois at Urbana-Champaign July 1999  –  July 2001  (2 years 1 month) Taught: Organizational Theory and Administrative Leadership, Social and Political Context of Schooling, and Teaching Diversity in High School Settings in the Departments of Curriculum and Instruction/Educational Organization and Leadership. Languages Spanish Spanish Spanish Skills Research Public Speaking Teaching Policy Non-profits Program Development Writing Analysis Community Outreach Planning Team Building Education Policy Strategic Planning Grant Writing Public Policy Technical Writing Higher Education Policy Analysis Fundraising Nonprofits Staff Development Strategy See 7+     See less Skills  Research Public Speaking Teaching Policy Non-profits Program Development Writing Analysis Community Outreach Planning Team Building Education Policy Strategic Planning Grant Writing Public Policy Technical Writing Higher Education Policy Analysis Fundraising Nonprofits Staff Development Strategy See 7+     See less Research Public Speaking Teaching Policy Non-profits Program Development Writing Analysis Community Outreach Planning Team Building Education Policy Strategic Planning Grant Writing Public Policy Technical Writing Higher Education Policy Analysis Fundraising Nonprofits Staff Development Strategy See 7+     See less Research Public Speaking Teaching Policy Non-profits Program Development Writing Analysis Community Outreach Planning Team Building Education Policy Strategic Planning Grant Writing Public Policy Technical Writing Higher Education Policy Analysis Fundraising Nonprofits Staff Development Strategy See 7+     See less Education Harvard University, John F. Kennedy School of Government Executive Education 2009  – 2009 University of Wisconsin-Madison PhD,  Education Policy and Administration 1995  – 1998 Lawrence University BA,  Government 1981  – 1985 Harvard University, John F. Kennedy School of Government Executive Education 2009  – 2009 Harvard University, John F. Kennedy School of Government Executive Education 2009  – 2009 Harvard University, John F. Kennedy School of Government Executive Education 2009  – 2009 University of Wisconsin-Madison PhD,  Education Policy and Administration 1995  – 1998 University of Wisconsin-Madison PhD,  Education Policy and Administration 1995  – 1998 University of Wisconsin-Madison PhD,  Education Policy and Administration 1995  – 1998 Lawrence University BA,  Government 1981  – 1985 Lawrence University BA,  Government 1981  – 1985 Lawrence University BA,  Government 1981  – 1985 "]}