{"position": "Senior Director", "company": "Stanford University", "profiles": ["Skills Process Improvement Management Business Process... Strategy Business Process Project Management Leadership CRM Program Management Product Management Analysis Skills  Process Improvement Management Business Process... Strategy Business Process Project Management Leadership CRM Program Management Product Management Analysis Process Improvement Management Business Process... Strategy Business Process Project Management Leadership CRM Program Management Product Management Analysis Process Improvement Management Business Process... Strategy Business Process Project Management Leadership CRM Program Management Product Management Analysis ", "Experience Senior Director Stanford University Senior Director Stanford University Senior Director Stanford University ", "Summary General Manager with extensive expertise in process improvement, HR, finance, business development, risk management and cost containment. Consistent track record of increasing sales, positive customer experiences, and operational efficiencies. Reached goals through others. Built trust with teams, peers, clients while also influencing top outcomes from peer organizations: Legal, Product Management, and IT/Systems. Self-motivated, innovative thinker. Bridged organizational boundaries to expand business outcomes for employers. Excellent strategist and communicator, relentless and rigorous in execution. Specialties:Setting direction, strategy, and priorities. Process design, market analysis, execution of business plans. Organization design & people development, establishing metrics and operating mechanisms. Talent acquisition, goal-setting and performance management expert. Summary General Manager with extensive expertise in process improvement, HR, finance, business development, risk management and cost containment. Consistent track record of increasing sales, positive customer experiences, and operational efficiencies. Reached goals through others. Built trust with teams, peers, clients while also influencing top outcomes from peer organizations: Legal, Product Management, and IT/Systems. Self-motivated, innovative thinker. Bridged organizational boundaries to expand business outcomes for employers. Excellent strategist and communicator, relentless and rigorous in execution. Specialties:Setting direction, strategy, and priorities. Process design, market analysis, execution of business plans. Organization design & people development, establishing metrics and operating mechanisms. Talent acquisition, goal-setting and performance management expert. General Manager with extensive expertise in process improvement, HR, finance, business development, risk management and cost containment. Consistent track record of increasing sales, positive customer experiences, and operational efficiencies. Reached goals through others. Built trust with teams, peers, clients while also influencing top outcomes from peer organizations: Legal, Product Management, and IT/Systems. Self-motivated, innovative thinker. Bridged organizational boundaries to expand business outcomes for employers. Excellent strategist and communicator, relentless and rigorous in execution. Specialties:Setting direction, strategy, and priorities. Process design, market analysis, execution of business plans. Organization design & people development, establishing metrics and operating mechanisms. Talent acquisition, goal-setting and performance management expert. General Manager with extensive expertise in process improvement, HR, finance, business development, risk management and cost containment. Consistent track record of increasing sales, positive customer experiences, and operational efficiencies. Reached goals through others. Built trust with teams, peers, clients while also influencing top outcomes from peer organizations: Legal, Product Management, and IT/Systems. Self-motivated, innovative thinker. Bridged organizational boundaries to expand business outcomes for employers. Excellent strategist and communicator, relentless and rigorous in execution. Specialties:Setting direction, strategy, and priorities. Process design, market analysis, execution of business plans. Organization design & people development, establishing metrics and operating mechanisms. Talent acquisition, goal-setting and performance management expert. Experience Senior Director of University HR Shared Services Stanford University December 2011  – Present (3 years 9 months) Palo Alto, CA Responsible for HR shared services: core HR transactions, background checks, new hire welcome, benefits contact center, leave support team, and tuition & training programs. Launched background checks university-wide; managed in-house team plus outside service provider to peak efficiency. Managed central HR data integrity operations to win an increasing share of university transactions. Started Stanford's first document imaging program for employee files. Created and implemented the new hire on-boarding center. Senior Business Leader Visa Inc. January 2010  –  December 2011  (2 years) Foster City, CA Strategic business manager of VISA's B2B support websites globally. Served bank and Visa internal clients with applications, processes, and information. Managed operational design for new global portal that consolidated five regional portals. Led operations team to highest employee survey results ever while managing business opereations of Visa Online VP, U.S. Financial Institutions and Western Office Leader FTRANS Corp. October 2008  –  January 2010  (1 year 4 months) Generated deals and partnerships with banks, distributors, venture capitalists and businesses. FTRANS professionally outsourced businesses' accounts receivable and collections processes to accelerate receipt of cash. FTRANS enabled banks to lend securely on enhanced AR collateral, with high visibility into their borrowers' accounts. Managed sales nationwide and opened up new distribution channel. Engaged with 250 banks. Established budget, sales compensation plans, and sales targets. Exceeded 2009 team quota in nine months. Wrote scripts for all selling situations. Fielded financial institution research study on commercial lending to open more executive doors. General Manager/VP Digital Insight, an Intuit Company February 2007  –  August 2008  (1 year 7 months) Led connectivity team to record results: $29m, +13% growth, 89% margin in weakening economy. Served on Intuit corporate strategy team that justified $1.33B Feb 2007 acquisition of Digital Insight (DI), a leading provider of online banking and bill payment services to financial institutions. Brought together Intuit FI Group and DI sales operations departments to blend two organizational cultures. Managed multi-function, multi-site organization of 53 people dedicated to increasing sales efficiency and throughput. Implemented Intuit management system and operating metrics within 60 days. Responsible for client strategy documents, RFP responses, sales engineers, inside sales support for the field reps, client billing, and data analysis for sales management and financial reporting. Trained DI managers on Intuit leadership practices and performance management tools while learning the DI product suite and sales methodology. Director and Business Leader Intuit May 1996  –  February 2007  (10 years 10 months) Led startup business within Intuit that grew from $0 to $29 million with 89% gross margin. Formed Intuit's financial institution industry group and led penetration of FI's as a channel. Senior leader, expanded connectivity to cover most financial institutions in the U.S. Grew base of connected FIs from 22 to over 6300 to supply customer data to Quicken and QuickBooks. Forged 120 technology alliances, negotiated complex third party deals. Defined, set up, and optimized team's business infrastructure and core processes from scratch. Signed over 1500 contracts, established high volume testing and launch process. Continuously improved FI customer support. Director of Operations Menlo Park Presbyterian Church 1999  –  2002  (3 years) Menlo Park, CA Managed child safety programs, facilities projects, and ministry logistics for large scale children's ministry. Weekend programs served over 900 attendees per week. Senior Vice President, Operations & Projects Wells Fargo Bank, Commercial Banking Group January 1993  –  February 1996  (3 years 2 months) Managed corporate banking services organiztion of 500+ employees, in customer service (call center), loan doc production, high volume electronic and paper transaction processing, system security and privacy control, check clearing analysis, customer research and case resolution, and cash vault services. Reduced expenses annually through automation and department consolidations. Reduced fraud losses and launched new products. Implemented Wells' first client/server based customer service platform. Automated cash counting, processed $2 trillion in wire transfers and served 500,000+ customer inquiries in 1995. Formed elite project team that handled largest cross-disciplinary initiatives: new product rollouts, automation, customer service and efficiency enhancements. Senior Vice President, Operations Wells Fargo Bank - Consumer Check Operations September 1984  –  January 1993  (8 years 5 months) Directed 3-shift, 4-site operating division of almost 900 employees with budget up to $34 million. Departments included customer statement production, check image production, balancing the bank’s daily posted transactions, deposit adjustments, and customer moments of truth: returned checks, overdrawn accounts, government levies. Formed the risk management group to reverse fraud loss trend. Automated returned check operations to use real-time balances and make customer-centric pay or return decisions. Strengthened forgery negotiations and set up check review criteria that far surpassed industry standards. Integrated operations for Crocker Bank plus 10 smaller bank acquisitions. Led productivity gains via system changes, work simplification, and staff restructurings to save millions of dollars per year and support retail branches' strategic shift to sales. Negotiated million dollar vendor contracts for statement-inserting machines, microfilm reader/printers, statement mail stuffer/sorters, and check repair machines. Process Engineer Hewlett Packard (HP) September 1981  –  September 1982  (1 year 1 month) Performed diverse engineering studies: financial justifications, work flow charting and redesign, space planning and facilities drawings, and energy efficiency studies. Redesigned layout of Sunnyvale data terminal manufacturing plant. Managed operational moves to consolidate two manufacturing divisions. Chaired task force to streamline data terminal manufacturing process and install state-of-the-art material handling equipment. Reduced operating costs, reduced warehouse space by 20%, and increased part retrieval productivity by 16%. Also a computer programmer in Marketing from 1978 to 1979. Assistant Treasurer Chase September 1979  –  September 1981  (2 years 1 month) At age 22, managed department of 40 employees who monitored Chase's worldwide foreign currency balances. Improved controls over foreign exchange trades; investigated and resolved transaction errors and balance discrepancies with fast turnaround. Eliminated reconcilement backlog and recovered errant transactions to prevent losses. Reduced overdraft interest expense from $5.6 million (1980) to $2.0 million (1981). Supervised largest Chase overseas trading account from 1979 to 1980 (Chase London). Senior Director of University HR Shared Services Stanford University December 2011  – Present (3 years 9 months) Palo Alto, CA Responsible for HR shared services: core HR transactions, background checks, new hire welcome, benefits contact center, leave support team, and tuition & training programs. Launched background checks university-wide; managed in-house team plus outside service provider to peak efficiency. Managed central HR data integrity operations to win an increasing share of university transactions. Started Stanford's first document imaging program for employee files. Created and implemented the new hire on-boarding center. Senior Director of University HR Shared Services Stanford University December 2011  – Present (3 years 9 months) Palo Alto, CA Responsible for HR shared services: core HR transactions, background checks, new hire welcome, benefits contact center, leave support team, and tuition & training programs. Launched background checks university-wide; managed in-house team plus outside service provider to peak efficiency. Managed central HR data integrity operations to win an increasing share of university transactions. Started Stanford's first document imaging program for employee files. Created and implemented the new hire on-boarding center. Senior Business Leader Visa Inc. January 2010  –  December 2011  (2 years) Foster City, CA Strategic business manager of VISA's B2B support websites globally. Served bank and Visa internal clients with applications, processes, and information. Managed operational design for new global portal that consolidated five regional portals. Led operations team to highest employee survey results ever while managing business opereations of Visa Online Senior Business Leader Visa Inc. January 2010  –  December 2011  (2 years) Foster City, CA Strategic business manager of VISA's B2B support websites globally. Served bank and Visa internal clients with applications, processes, and information. Managed operational design for new global portal that consolidated five regional portals. Led operations team to highest employee survey results ever while managing business opereations of Visa Online VP, U.S. Financial Institutions and Western Office Leader FTRANS Corp. October 2008  –  January 2010  (1 year 4 months) Generated deals and partnerships with banks, distributors, venture capitalists and businesses. FTRANS professionally outsourced businesses' accounts receivable and collections processes to accelerate receipt of cash. FTRANS enabled banks to lend securely on enhanced AR collateral, with high visibility into their borrowers' accounts. Managed sales nationwide and opened up new distribution channel. Engaged with 250 banks. Established budget, sales compensation plans, and sales targets. Exceeded 2009 team quota in nine months. Wrote scripts for all selling situations. Fielded financial institution research study on commercial lending to open more executive doors. VP, U.S. Financial Institutions and Western Office Leader FTRANS Corp. October 2008  –  January 2010  (1 year 4 months) Generated deals and partnerships with banks, distributors, venture capitalists and businesses. FTRANS professionally outsourced businesses' accounts receivable and collections processes to accelerate receipt of cash. FTRANS enabled banks to lend securely on enhanced AR collateral, with high visibility into their borrowers' accounts. Managed sales nationwide and opened up new distribution channel. Engaged with 250 banks. Established budget, sales compensation plans, and sales targets. Exceeded 2009 team quota in nine months. Wrote scripts for all selling situations. Fielded financial institution research study on commercial lending to open more executive doors. General Manager/VP Digital Insight, an Intuit Company February 2007  –  August 2008  (1 year 7 months) Led connectivity team to record results: $29m, +13% growth, 89% margin in weakening economy. Served on Intuit corporate strategy team that justified $1.33B Feb 2007 acquisition of Digital Insight (DI), a leading provider of online banking and bill payment services to financial institutions. Brought together Intuit FI Group and DI sales operations departments to blend two organizational cultures. Managed multi-function, multi-site organization of 53 people dedicated to increasing sales efficiency and throughput. Implemented Intuit management system and operating metrics within 60 days. Responsible for client strategy documents, RFP responses, sales engineers, inside sales support for the field reps, client billing, and data analysis for sales management and financial reporting. Trained DI managers on Intuit leadership practices and performance management tools while learning the DI product suite and sales methodology. General Manager/VP Digital Insight, an Intuit Company February 2007  –  August 2008  (1 year 7 months) Led connectivity team to record results: $29m, +13% growth, 89% margin in weakening economy. Served on Intuit corporate strategy team that justified $1.33B Feb 2007 acquisition of Digital Insight (DI), a leading provider of online banking and bill payment services to financial institutions. Brought together Intuit FI Group and DI sales operations departments to blend two organizational cultures. Managed multi-function, multi-site organization of 53 people dedicated to increasing sales efficiency and throughput. Implemented Intuit management system and operating metrics within 60 days. Responsible for client strategy documents, RFP responses, sales engineers, inside sales support for the field reps, client billing, and data analysis for sales management and financial reporting. Trained DI managers on Intuit leadership practices and performance management tools while learning the DI product suite and sales methodology. Director and Business Leader Intuit May 1996  –  February 2007  (10 years 10 months) Led startup business within Intuit that grew from $0 to $29 million with 89% gross margin. Formed Intuit's financial institution industry group and led penetration of FI's as a channel. Senior leader, expanded connectivity to cover most financial institutions in the U.S. Grew base of connected FIs from 22 to over 6300 to supply customer data to Quicken and QuickBooks. Forged 120 technology alliances, negotiated complex third party deals. Defined, set up, and optimized team's business infrastructure and core processes from scratch. Signed over 1500 contracts, established high volume testing and launch process. Continuously improved FI customer support. Director and Business Leader Intuit May 1996  –  February 2007  (10 years 10 months) Led startup business within Intuit that grew from $0 to $29 million with 89% gross margin. Formed Intuit's financial institution industry group and led penetration of FI's as a channel. Senior leader, expanded connectivity to cover most financial institutions in the U.S. Grew base of connected FIs from 22 to over 6300 to supply customer data to Quicken and QuickBooks. Forged 120 technology alliances, negotiated complex third party deals. Defined, set up, and optimized team's business infrastructure and core processes from scratch. Signed over 1500 contracts, established high volume testing and launch process. Continuously improved FI customer support. Director of Operations Menlo Park Presbyterian Church 1999  –  2002  (3 years) Menlo Park, CA Managed child safety programs, facilities projects, and ministry logistics for large scale children's ministry. Weekend programs served over 900 attendees per week. Director of Operations Menlo Park Presbyterian Church 1999  –  2002  (3 years) Menlo Park, CA Managed child safety programs, facilities projects, and ministry logistics for large scale children's ministry. Weekend programs served over 900 attendees per week. Senior Vice President, Operations & Projects Wells Fargo Bank, Commercial Banking Group January 1993  –  February 1996  (3 years 2 months) Managed corporate banking services organiztion of 500+ employees, in customer service (call center), loan doc production, high volume electronic and paper transaction processing, system security and privacy control, check clearing analysis, customer research and case resolution, and cash vault services. Reduced expenses annually through automation and department consolidations. Reduced fraud losses and launched new products. Implemented Wells' first client/server based customer service platform. Automated cash counting, processed $2 trillion in wire transfers and served 500,000+ customer inquiries in 1995. Formed elite project team that handled largest cross-disciplinary initiatives: new product rollouts, automation, customer service and efficiency enhancements. Senior Vice President, Operations & Projects Wells Fargo Bank, Commercial Banking Group January 1993  –  February 1996  (3 years 2 months) Managed corporate banking services organiztion of 500+ employees, in customer service (call center), loan doc production, high volume electronic and paper transaction processing, system security and privacy control, check clearing analysis, customer research and case resolution, and cash vault services. Reduced expenses annually through automation and department consolidations. Reduced fraud losses and launched new products. Implemented Wells' first client/server based customer service platform. Automated cash counting, processed $2 trillion in wire transfers and served 500,000+ customer inquiries in 1995. Formed elite project team that handled largest cross-disciplinary initiatives: new product rollouts, automation, customer service and efficiency enhancements. Senior Vice President, Operations Wells Fargo Bank - Consumer Check Operations September 1984  –  January 1993  (8 years 5 months) Directed 3-shift, 4-site operating division of almost 900 employees with budget up to $34 million. Departments included customer statement production, check image production, balancing the bank’s daily posted transactions, deposit adjustments, and customer moments of truth: returned checks, overdrawn accounts, government levies. Formed the risk management group to reverse fraud loss trend. Automated returned check operations to use real-time balances and make customer-centric pay or return decisions. Strengthened forgery negotiations and set up check review criteria that far surpassed industry standards. Integrated operations for Crocker Bank plus 10 smaller bank acquisitions. Led productivity gains via system changes, work simplification, and staff restructurings to save millions of dollars per year and support retail branches' strategic shift to sales. Negotiated million dollar vendor contracts for statement-inserting machines, microfilm reader/printers, statement mail stuffer/sorters, and check repair machines. Senior Vice President, Operations Wells Fargo Bank - Consumer Check Operations September 1984  –  January 1993  (8 years 5 months) Directed 3-shift, 4-site operating division of almost 900 employees with budget up to $34 million. Departments included customer statement production, check image production, balancing the bank’s daily posted transactions, deposit adjustments, and customer moments of truth: returned checks, overdrawn accounts, government levies. Formed the risk management group to reverse fraud loss trend. Automated returned check operations to use real-time balances and make customer-centric pay or return decisions. Strengthened forgery negotiations and set up check review criteria that far surpassed industry standards. Integrated operations for Crocker Bank plus 10 smaller bank acquisitions. Led productivity gains via system changes, work simplification, and staff restructurings to save millions of dollars per year and support retail branches' strategic shift to sales. Negotiated million dollar vendor contracts for statement-inserting machines, microfilm reader/printers, statement mail stuffer/sorters, and check repair machines. Process Engineer Hewlett Packard (HP) September 1981  –  September 1982  (1 year 1 month) Performed diverse engineering studies: financial justifications, work flow charting and redesign, space planning and facilities drawings, and energy efficiency studies. Redesigned layout of Sunnyvale data terminal manufacturing plant. Managed operational moves to consolidate two manufacturing divisions. Chaired task force to streamline data terminal manufacturing process and install state-of-the-art material handling equipment. Reduced operating costs, reduced warehouse space by 20%, and increased part retrieval productivity by 16%. Also a computer programmer in Marketing from 1978 to 1979. Process Engineer Hewlett Packard (HP) September 1981  –  September 1982  (1 year 1 month) Performed diverse engineering studies: financial justifications, work flow charting and redesign, space planning and facilities drawings, and energy efficiency studies. Redesigned layout of Sunnyvale data terminal manufacturing plant. Managed operational moves to consolidate two manufacturing divisions. Chaired task force to streamline data terminal manufacturing process and install state-of-the-art material handling equipment. Reduced operating costs, reduced warehouse space by 20%, and increased part retrieval productivity by 16%. Also a computer programmer in Marketing from 1978 to 1979. Assistant Treasurer Chase September 1979  –  September 1981  (2 years 1 month) At age 22, managed department of 40 employees who monitored Chase's worldwide foreign currency balances. Improved controls over foreign exchange trades; investigated and resolved transaction errors and balance discrepancies with fast turnaround. Eliminated reconcilement backlog and recovered errant transactions to prevent losses. Reduced overdraft interest expense from $5.6 million (1980) to $2.0 million (1981). Supervised largest Chase overseas trading account from 1979 to 1980 (Chase London). Assistant Treasurer Chase September 1979  –  September 1981  (2 years 1 month) At age 22, managed department of 40 employees who monitored Chase's worldwide foreign currency balances. Improved controls over foreign exchange trades; investigated and resolved transaction errors and balance discrepancies with fast turnaround. Eliminated reconcilement backlog and recovered errant transactions to prevent losses. Reduced overdraft interest expense from $5.6 million (1980) to $2.0 million (1981). Supervised largest Chase overseas trading account from 1979 to 1980 (Chase London). Languages French French French Skills Product Management Start-ups Strategy Program Management Business Development Leadership Business Strategy Risk Management Management Business Planning Banking Mergers Strategic Planning Product Development Mergers & Acquisitions Project Management Strategic Partnerships Business Intelligence Cross-functional Team... Enterprise Software Market Analysis Outsourcing Talent Acquisition Operations Management Analysis Process Improvement Budgets Sales Operations Marketing Payment Systems Sales Management Finance Executive Management Sales Analytics SaaS Performance Management Vendor Management See 23+     See less Skills  Product Management Start-ups Strategy Program Management Business Development Leadership Business Strategy Risk Management Management Business Planning Banking Mergers Strategic Planning Product Development Mergers & Acquisitions Project Management Strategic Partnerships Business Intelligence Cross-functional Team... Enterprise Software Market Analysis Outsourcing Talent Acquisition Operations Management Analysis Process Improvement Budgets Sales Operations Marketing Payment Systems Sales Management Finance Executive Management Sales Analytics SaaS Performance Management Vendor Management See 23+     See less Product Management Start-ups Strategy Program Management Business Development Leadership Business Strategy Risk Management Management Business Planning Banking Mergers Strategic Planning Product Development Mergers & Acquisitions Project Management Strategic Partnerships Business Intelligence Cross-functional Team... Enterprise Software Market Analysis Outsourcing Talent Acquisition Operations Management Analysis Process Improvement Budgets Sales Operations Marketing Payment Systems Sales Management Finance Executive Management Sales Analytics SaaS Performance Management Vendor Management See 23+     See less Product Management Start-ups Strategy Program Management Business Development Leadership Business Strategy Risk Management Management Business Planning Banking Mergers Strategic Planning Product Development Mergers & Acquisitions Project Management Strategic Partnerships Business Intelligence Cross-functional Team... Enterprise Software Market Analysis Outsourcing Talent Acquisition Operations Management Analysis Process Improvement Budgets Sales Operations Marketing Payment Systems Sales Management Finance Executive Management Sales Analytics SaaS Performance Management Vendor Management See 23+     See less Education Stanford University Graduate School of Business MBA,  General Management , Arjay Miller Scholar (top 10%). 1982  – 1984 Exempted 8 of 10 required core MBA classes. Stanford University B.S.,  Industrial Engineering , with Distinction 1975  – 1979 Dickman Prize for Writing (twice) \nH. Gardiner Symonds Award for Scholarship and Leadership Activities and Societies:  Kappa Sigma Fraternity (Treasurer)\nTau Beta Pi Engineering Honor Society (President) San Lorenzo Valley High School Felton, CA High School Diploma,  Physics ,  French ,  German ,  English Lit 1974  – 1975 Activities and Societies:  Valedictorian. 2-sport Varsity athlete. Stanford University Graduate School of Business MBA,  General Management , Arjay Miller Scholar (top 10%). 1982  – 1984 Exempted 8 of 10 required core MBA classes. Stanford University Graduate School of Business MBA,  General Management , Arjay Miller Scholar (top 10%). 1982  – 1984 Exempted 8 of 10 required core MBA classes. Stanford University Graduate School of Business MBA,  General Management , Arjay Miller Scholar (top 10%). 1982  – 1984 Exempted 8 of 10 required core MBA classes. Stanford University B.S.,  Industrial Engineering , with Distinction 1975  – 1979 Dickman Prize for Writing (twice) \nH. Gardiner Symonds Award for Scholarship and Leadership Activities and Societies:  Kappa Sigma Fraternity (Treasurer)\nTau Beta Pi Engineering Honor Society (President) Stanford University B.S.,  Industrial Engineering , with Distinction 1975  – 1979 Dickman Prize for Writing (twice) \nH. Gardiner Symonds Award for Scholarship and Leadership Activities and Societies:  Kappa Sigma Fraternity (Treasurer)\nTau Beta Pi Engineering Honor Society (President) Stanford University B.S.,  Industrial Engineering , with Distinction 1975  – 1979 Dickman Prize for Writing (twice) \nH. Gardiner Symonds Award for Scholarship and Leadership Activities and Societies:  Kappa Sigma Fraternity (Treasurer)\nTau Beta Pi Engineering Honor Society (President) San Lorenzo Valley High School Felton, CA High School Diploma,  Physics ,  French ,  German ,  English Lit 1974  – 1975 Activities and Societies:  Valedictorian. 2-sport Varsity athlete. San Lorenzo Valley High School Felton, CA High School Diploma,  Physics ,  French ,  German ,  English Lit 1974  – 1975 Activities and Societies:  Valedictorian. 2-sport Varsity athlete. San Lorenzo Valley High School Felton, CA High School Diploma,  Physics ,  French ,  German ,  English Lit 1974  – 1975 Activities and Societies:  Valedictorian. 2-sport Varsity athlete. Honors & Awards Additional Honors & Awards Writing Excellence; Scholarship; Leadership; Elder (Board Member) for MPPC, 2001-2004 Additional Honors & Awards Writing Excellence; Scholarship; Leadership; Elder (Board Member) for MPPC, 2001-2004 Additional Honors & Awards Writing Excellence; Scholarship; Leadership; Elder (Board Member) for MPPC, 2001-2004 Additional Honors & Awards Writing Excellence; Scholarship; Leadership; Elder (Board Member) for MPPC, 2001-2004 ", "Summary Mauricio Quijano specializes in directing and producing live TV events both coast-to-coast and abroad.  \n \nHis versatility as a live director and producer is reflected by impeccable management and production skills with clients, talent, and production teams in several fields for over 20 years. \n \nHis shows include award winning PBS Specials, TED shows, corporate events such as the World Premiere of Boeing 787 and Google marquee shows, and the broadcast of professional sports and Live Performing Arts.  \n \nSports networks use his services directing and producing national and regional major league sporting events (i.e. MLB, NBA, MLS, NCAA) and the world feed of international events and tournaments such as FIFA World Cups and the World Baseball Classic. \n \nHis skills in broadcast journalism are reflected by his work as a news producer for NBC Universal and CBS Network News.  \n \nMr. Quijano holds a BA in Journalism, an MA in TV Broadcasting, and speaks four languages fluently. Summary Mauricio Quijano specializes in directing and producing live TV events both coast-to-coast and abroad.  \n \nHis versatility as a live director and producer is reflected by impeccable management and production skills with clients, talent, and production teams in several fields for over 20 years. \n \nHis shows include award winning PBS Specials, TED shows, corporate events such as the World Premiere of Boeing 787 and Google marquee shows, and the broadcast of professional sports and Live Performing Arts.  \n \nSports networks use his services directing and producing national and regional major league sporting events (i.e. MLB, NBA, MLS, NCAA) and the world feed of international events and tournaments such as FIFA World Cups and the World Baseball Classic. \n \nHis skills in broadcast journalism are reflected by his work as a news producer for NBC Universal and CBS Network News.  \n \nMr. Quijano holds a BA in Journalism, an MA in TV Broadcasting, and speaks four languages fluently. Mauricio Quijano specializes in directing and producing live TV events both coast-to-coast and abroad.  \n \nHis versatility as a live director and producer is reflected by impeccable management and production skills with clients, talent, and production teams in several fields for over 20 years. \n \nHis shows include award winning PBS Specials, TED shows, corporate events such as the World Premiere of Boeing 787 and Google marquee shows, and the broadcast of professional sports and Live Performing Arts.  \n \nSports networks use his services directing and producing national and regional major league sporting events (i.e. MLB, NBA, MLS, NCAA) and the world feed of international events and tournaments such as FIFA World Cups and the World Baseball Classic. \n \nHis skills in broadcast journalism are reflected by his work as a news producer for NBC Universal and CBS Network News.  \n \nMr. Quijano holds a BA in Journalism, an MA in TV Broadcasting, and speaks four languages fluently. Mauricio Quijano specializes in directing and producing live TV events both coast-to-coast and abroad.  \n \nHis versatility as a live director and producer is reflected by impeccable management and production skills with clients, talent, and production teams in several fields for over 20 years. \n \nHis shows include award winning PBS Specials, TED shows, corporate events such as the World Premiere of Boeing 787 and Google marquee shows, and the broadcast of professional sports and Live Performing Arts.  \n \nSports networks use his services directing and producing national and regional major league sporting events (i.e. MLB, NBA, MLS, NCAA) and the world feed of international events and tournaments such as FIFA World Cups and the World Baseball Classic. \n \nHis skills in broadcast journalism are reflected by his work as a news producer for NBC Universal and CBS Network News.  \n \nMr. Quijano holds a BA in Journalism, an MA in TV Broadcasting, and speaks four languages fluently. Experience Director - Producer - International Football - Soccer 2001  – Present (14 years) USA and International Director and Producer of national and international soccer games and tournaments, including: Primary World Feed of World Cup Qualifiers; Olympic Qualifiers; Concacaf (US MNT); Brazil World Tour; FMF US Tour; Pre-Libertadores; Interliga; International Friendlies; MLS; WPS; USL; NCAA Broadcast Venue Manager HBS - FIFA World Cup June 2011  – Present (4 years 3 months) Freelance Broadcast Venue Manager for Host Broadcast Services, including: \nFIFA U-17 World Cup Costa Rica \nFIFA U-17 World Cup Mexico \nFIFA U 20 World Cup Colombia \nResponsible for all broadcast operations at the venue. Supervisor of production teams, world feed, multilateral operations, technical platform, consistency of match coverage and implementation of FIFA TV production guidelines. Director and Producer Fox Sports West 2010  – Present (5 years) Greater Los Angeles Area Freelance Director and Producer of Spanish language broadcasts of NBA and MLB seasons Director and Producer Pac-12 Networks September 2012  – Present (3 years) San Francisco Bay Area Freelance Director and Producer of Pac-12 Network shows and NCAA Sports Director Group X October 2012  – Present (2 years 11 months) San Francisco Bay Area Freelance Director at Group X, including Google's marquee shows: Google Zeitgeist, Google Engage, Google Chrome, Google Plus and Google Women. Senior Director Stanford University 2001  – Present (14 years) Stanford, California Freelance Director at Stanford Video of marquee Stanford University events, including:  \n- TEDx Stanford  \n- Inaugural Beethoven Concert Series at Bing Concert Hall \n- Award Winning PBS Television Series \"Stanford Roundtable\" with Tom Brokaw, Charlie Rose and Katie Curic \n- Steve Jobs' Commencement Address \n- Dalai Lama on Compassion and a Meaningful Life \n- High Tech Companies and Entrepreneur Forums \n- Surgical Training for School of Medicine Faculty Director Live Performing Arts 2002  – Present (13 years) Freelance Director of live performances for regional cable at the Gary Sorensen Smith Center including original stage dramas, classic theater, Broadway musicals, concerts and dance recitals. \n \nPart-time Faculty Instructor of Live Television Directing at Ohlone College Television Broadcasting Director - Producer - International Football - Soccer 2001  – Present (14 years) USA and International Director and Producer of national and international soccer games and tournaments, including: Primary World Feed of World Cup Qualifiers; Olympic Qualifiers; Concacaf (US MNT); Brazil World Tour; FMF US Tour; Pre-Libertadores; Interliga; International Friendlies; MLS; WPS; USL; NCAA Director - Producer - International Football - Soccer 2001  – Present (14 years) USA and International Director and Producer of national and international soccer games and tournaments, including: Primary World Feed of World Cup Qualifiers; Olympic Qualifiers; Concacaf (US MNT); Brazil World Tour; FMF US Tour; Pre-Libertadores; Interliga; International Friendlies; MLS; WPS; USL; NCAA Broadcast Venue Manager HBS - FIFA World Cup June 2011  – Present (4 years 3 months) Freelance Broadcast Venue Manager for Host Broadcast Services, including: \nFIFA U-17 World Cup Costa Rica \nFIFA U-17 World Cup Mexico \nFIFA U 20 World Cup Colombia \nResponsible for all broadcast operations at the venue. Supervisor of production teams, world feed, multilateral operations, technical platform, consistency of match coverage and implementation of FIFA TV production guidelines. Broadcast Venue Manager HBS - FIFA World Cup June 2011  – Present (4 years 3 months) Freelance Broadcast Venue Manager for Host Broadcast Services, including: \nFIFA U-17 World Cup Costa Rica \nFIFA U-17 World Cup Mexico \nFIFA U 20 World Cup Colombia \nResponsible for all broadcast operations at the venue. Supervisor of production teams, world feed, multilateral operations, technical platform, consistency of match coverage and implementation of FIFA TV production guidelines. Director and Producer Fox Sports West 2010  – Present (5 years) Greater Los Angeles Area Freelance Director and Producer of Spanish language broadcasts of NBA and MLB seasons Director and Producer Fox Sports West 2010  – Present (5 years) Greater Los Angeles Area Freelance Director and Producer of Spanish language broadcasts of NBA and MLB seasons Director and Producer Pac-12 Networks September 2012  – Present (3 years) San Francisco Bay Area Freelance Director and Producer of Pac-12 Network shows and NCAA Sports Director and Producer Pac-12 Networks September 2012  – Present (3 years) San Francisco Bay Area Freelance Director and Producer of Pac-12 Network shows and NCAA Sports Director Group X October 2012  – Present (2 years 11 months) San Francisco Bay Area Freelance Director at Group X, including Google's marquee shows: Google Zeitgeist, Google Engage, Google Chrome, Google Plus and Google Women. Director Group X October 2012  – Present (2 years 11 months) San Francisco Bay Area Freelance Director at Group X, including Google's marquee shows: Google Zeitgeist, Google Engage, Google Chrome, Google Plus and Google Women. Senior Director Stanford University 2001  – Present (14 years) Stanford, California Freelance Director at Stanford Video of marquee Stanford University events, including:  \n- TEDx Stanford  \n- Inaugural Beethoven Concert Series at Bing Concert Hall \n- Award Winning PBS Television Series \"Stanford Roundtable\" with Tom Brokaw, Charlie Rose and Katie Curic \n- Steve Jobs' Commencement Address \n- Dalai Lama on Compassion and a Meaningful Life \n- High Tech Companies and Entrepreneur Forums \n- Surgical Training for School of Medicine Faculty Senior Director Stanford University 2001  – Present (14 years) Stanford, California Freelance Director at Stanford Video of marquee Stanford University events, including:  \n- TEDx Stanford  \n- Inaugural Beethoven Concert Series at Bing Concert Hall \n- Award Winning PBS Television Series \"Stanford Roundtable\" with Tom Brokaw, Charlie Rose and Katie Curic \n- Steve Jobs' Commencement Address \n- Dalai Lama on Compassion and a Meaningful Life \n- High Tech Companies and Entrepreneur Forums \n- Surgical Training for School of Medicine Faculty Director Live Performing Arts 2002  – Present (13 years) Freelance Director of live performances for regional cable at the Gary Sorensen Smith Center including original stage dramas, classic theater, Broadway musicals, concerts and dance recitals. \n \nPart-time Faculty Instructor of Live Television Directing at Ohlone College Television Broadcasting Director Live Performing Arts 2002  – Present (13 years) Freelance Director of live performances for regional cable at the Gary Sorensen Smith Center including original stage dramas, classic theater, Broadway musicals, concerts and dance recitals. \n \nPart-time Faculty Instructor of Live Television Directing at Ohlone College Television Broadcasting Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Portuguese Professional working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Portuguese Professional working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Portuguese Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Video Production Sports Broadcast Video Producing Broadcast Journalism Television Video Editing Post Production Media Production Directing Broadcast Television Journalism Breaking News Camera Non-linear Editing Final Cut Pro New Media See 3+     See less Skills  Video Production Sports Broadcast Video Producing Broadcast Journalism Television Video Editing Post Production Media Production Directing Broadcast Television Journalism Breaking News Camera Non-linear Editing Final Cut Pro New Media See 3+     See less Video Production Sports Broadcast Video Producing Broadcast Journalism Television Video Editing Post Production Media Production Directing Broadcast Television Journalism Breaking News Camera Non-linear Editing Final Cut Pro New Media See 3+     See less Video Production Sports Broadcast Video Producing Broadcast Journalism Television Video Editing Post Production Media Production Directing Broadcast Television Journalism Breaking News Camera Non-linear Editing Final Cut Pro New Media See 3+     See less Education San Francisco State University MA, Television Production Pontificia Universidad Javeriana BA, Journalism and Communications San Francisco State University MA, Television Production San Francisco State University MA, Television Production San Francisco State University MA, Television Production Pontificia Universidad Javeriana BA, Journalism and Communications Pontificia Universidad Javeriana BA, Journalism and Communications Pontificia Universidad Javeriana BA, Journalism and Communications Honors & Awards Additional Honors & Awards - Telly Award - Director, 2012 \nStanford Roundtable  \nPBS Special \"Education Nation 2.0\" \nHosted by Charlie Rose \n \n- Telly Award - Director, 2011  \nStanford Roundtable \nPBS Special \"Generation Ageless\"  \nHosted by NBC's Tom Brokaw \n \n- Telly Award - Director, 2008  \nStanford Roundtable \nPBS Special \"The Fight for Oil, Water and a Healthy Planet\"  \nHosted by CNN's Carlos Watson \n \n- Sueños & Exitos Recognition, 1999 \nSan Francisco Hispanic Chamber of Commerce \nFor outstanding effort, on behalf of the Central American victims of Hurricane Mitch, in starting a media campaign that resulted in a massive collection of in-kind donations and cash for survivors \n \n- Emmy Awards, 1997 & 1998 \nBest Newscast, San Francisco, CA \nAssignment Editor for KPIX, CBS \n \n- ACE Award - Director, 1994 \nBest Sports Event Coverage \nStanford Women's Volleyball - NCAA 2nd Round \n \n- Commendation, 1993  \nCity of Los Altos, California \nCo-Producer / Director - Environmental Video Additional Honors & Awards - Telly Award - Director, 2012 \nStanford Roundtable  \nPBS Special \"Education Nation 2.0\" \nHosted by Charlie Rose \n \n- Telly Award - Director, 2011  \nStanford Roundtable \nPBS Special \"Generation Ageless\"  \nHosted by NBC's Tom Brokaw \n \n- Telly Award - Director, 2008  \nStanford Roundtable \nPBS Special \"The Fight for Oil, Water and a Healthy Planet\"  \nHosted by CNN's Carlos Watson \n \n- Sueños & Exitos Recognition, 1999 \nSan Francisco Hispanic Chamber of Commerce \nFor outstanding effort, on behalf of the Central American victims of Hurricane Mitch, in starting a media campaign that resulted in a massive collection of in-kind donations and cash for survivors \n \n- Emmy Awards, 1997 & 1998 \nBest Newscast, San Francisco, CA \nAssignment Editor for KPIX, CBS \n \n- ACE Award - Director, 1994 \nBest Sports Event Coverage \nStanford Women's Volleyball - NCAA 2nd Round \n \n- Commendation, 1993  \nCity of Los Altos, California \nCo-Producer / Director - Environmental Video Additional Honors & Awards - Telly Award - Director, 2012 \nStanford Roundtable  \nPBS Special \"Education Nation 2.0\" \nHosted by Charlie Rose \n \n- Telly Award - Director, 2011  \nStanford Roundtable \nPBS Special \"Generation Ageless\"  \nHosted by NBC's Tom Brokaw \n \n- Telly Award - Director, 2008  \nStanford Roundtable \nPBS Special \"The Fight for Oil, Water and a Healthy Planet\"  \nHosted by CNN's Carlos Watson \n \n- Sueños & Exitos Recognition, 1999 \nSan Francisco Hispanic Chamber of Commerce \nFor outstanding effort, on behalf of the Central American victims of Hurricane Mitch, in starting a media campaign that resulted in a massive collection of in-kind donations and cash for survivors \n \n- Emmy Awards, 1997 & 1998 \nBest Newscast, San Francisco, CA \nAssignment Editor for KPIX, CBS \n \n- ACE Award - Director, 1994 \nBest Sports Event Coverage \nStanford Women's Volleyball - NCAA 2nd Round \n \n- Commendation, 1993  \nCity of Los Altos, California \nCo-Producer / Director - Environmental Video Additional Honors & Awards - Telly Award - Director, 2012 \nStanford Roundtable  \nPBS Special \"Education Nation 2.0\" \nHosted by Charlie Rose \n \n- Telly Award - Director, 2011  \nStanford Roundtable \nPBS Special \"Generation Ageless\"  \nHosted by NBC's Tom Brokaw \n \n- Telly Award - Director, 2008  \nStanford Roundtable \nPBS Special \"The Fight for Oil, Water and a Healthy Planet\"  \nHosted by CNN's Carlos Watson \n \n- Sueños & Exitos Recognition, 1999 \nSan Francisco Hispanic Chamber of Commerce \nFor outstanding effort, on behalf of the Central American victims of Hurricane Mitch, in starting a media campaign that resulted in a massive collection of in-kind donations and cash for survivors \n \n- Emmy Awards, 1997 & 1998 \nBest Newscast, San Francisco, CA \nAssignment Editor for KPIX, CBS \n \n- ACE Award - Director, 1994 \nBest Sports Event Coverage \nStanford Women's Volleyball - NCAA 2nd Round \n \n- Commendation, 1993  \nCity of Los Altos, California \nCo-Producer / Director - Environmental Video "]}