{"position": "Senior Research Scholar", "company": "Stanford University", "profiles": ["Experience Senior Research Scholar Stanford University Senior Research Scholar Stanford University Senior Research Scholar Stanford University Languages   Skills Lifesciences Molecular Biology Entrepreneurship Research Science Bioinformatics Qualitative Research Public Health Teaching Genetics Skills  Lifesciences Molecular Biology Entrepreneurship Research Science Bioinformatics Qualitative Research Public Health Teaching Genetics Lifesciences Molecular Biology Entrepreneurship Research Science Bioinformatics Qualitative Research Public Health Teaching Genetics Lifesciences Molecular Biology Entrepreneurship Research Science Bioinformatics Qualitative Research Public Health Teaching Genetics Education Stanford University Stanford University Stanford University Stanford University Honors & Awards ", "Skills Program Management Perl Science Data Analysis Research Design Research Teaching Program Evaluation Grant Writing Statistics Project Management Start-ups Skills  Program Management Perl Science Data Analysis Research Design Research Teaching Program Evaluation Grant Writing Statistics Project Management Start-ups Program Management Perl Science Data Analysis Research Design Research Teaching Program Evaluation Grant Writing Statistics Project Management Start-ups Program Management Perl Science Data Analysis Research Design Research Teaching Program Evaluation Grant Writing Statistics Project Management Start-ups ", "Experience Co-Founder and Chief Medical Officer Lyra Health February 2015  – Present (7 months) Lyra Health’s mission is to transform behavioral health care through technology with a human touch — to get more patients the care they need when they need it. Board Member Sommetrics, Inc. 2014  – Present (1 year) Chief Medical Officer & Head of Products Castlight Health (formerly Ventana) 2009  –  December 2014  (5 years) 121 Spear St #300, San Francisco, CA 94105 Private Practice, Internal Medicine California Pacific Medical Center, San Francisco 2002  –  2010  (8 years) Senior Research Scholar Stanford University; Center for Primary Care and Outcomes Research June 1997  –  2009  (12 years) Co-Founder and Chief Medical Officer Lyra Health February 2015  – Present (7 months) Lyra Health’s mission is to transform behavioral health care through technology with a human touch — to get more patients the care they need when they need it. Co-Founder and Chief Medical Officer Lyra Health February 2015  – Present (7 months) Lyra Health’s mission is to transform behavioral health care through technology with a human touch — to get more patients the care they need when they need it. Board Member Sommetrics, Inc. 2014  – Present (1 year) Board Member Sommetrics, Inc. 2014  – Present (1 year) Chief Medical Officer & Head of Products Castlight Health (formerly Ventana) 2009  –  December 2014  (5 years) 121 Spear St #300, San Francisco, CA 94105 Chief Medical Officer & Head of Products Castlight Health (formerly Ventana) 2009  –  December 2014  (5 years) 121 Spear St #300, San Francisco, CA 94105 Private Practice, Internal Medicine California Pacific Medical Center, San Francisco 2002  –  2010  (8 years) Private Practice, Internal Medicine California Pacific Medical Center, San Francisco 2002  –  2010  (8 years) Senior Research Scholar Stanford University; Center for Primary Care and Outcomes Research June 1997  –  2009  (12 years) Senior Research Scholar Stanford University; Center for Primary Care and Outcomes Research June 1997  –  2009  (12 years) Languages German German German Skills Medicine Healthcare Clinical Research Public Health Healthcare Information... Data Analysis Research Internal Medicine Strategic Planning Policy Entrepreneurship Start-ups Hospitals Health Policy Healthcare Management Strategy Informatics Health Education Medical Education Health Services Research Lifesciences Health Economics Clinical Trials Managed Care Life Sciences See 10+     See less Skills  Medicine Healthcare Clinical Research Public Health Healthcare Information... Data Analysis Research Internal Medicine Strategic Planning Policy Entrepreneurship Start-ups Hospitals Health Policy Healthcare Management Strategy Informatics Health Education Medical Education Health Services Research Lifesciences Health Economics Clinical Trials Managed Care Life Sciences See 10+     See less Medicine Healthcare Clinical Research Public Health Healthcare Information... Data Analysis Research Internal Medicine Strategic Planning Policy Entrepreneurship Start-ups Hospitals Health Policy Healthcare Management Strategy Informatics Health Education Medical Education Health Services Research Lifesciences Health Economics Clinical Trials Managed Care Life Sciences See 10+     See less Medicine Healthcare Clinical Research Public Health Healthcare Information... Data Analysis Research Internal Medicine Strategic Planning Policy Entrepreneurship Start-ups Hospitals Health Policy Healthcare Management Strategy Informatics Health Education Medical Education Health Services Research Lifesciences Health Economics Clinical Trials Managed Care Life Sciences See 10+     See less Education Stanford University MS,  Health Research and Policy 1997  – 2000 Columbia University College of Physicians and Surgeons MD,  Medicine 1990  – 1994 Oxford University Zoology 1988  – 1989 Activities and Societies:  Rotary Fellow Yale University BS,  Biology 1985  – 1989 Stanford University MS,  Health Research and Policy 1997  – 2000 Stanford University MS,  Health Research and Policy 1997  – 2000 Stanford University MS,  Health Research and Policy 1997  – 2000 Columbia University College of Physicians and Surgeons MD,  Medicine 1990  – 1994 Columbia University College of Physicians and Surgeons MD,  Medicine 1990  – 1994 Columbia University College of Physicians and Surgeons MD,  Medicine 1990  – 1994 Oxford University Zoology 1988  – 1989 Activities and Societies:  Rotary Fellow Oxford University Zoology 1988  – 1989 Activities and Societies:  Rotary Fellow Oxford University Zoology 1988  – 1989 Activities and Societies:  Rotary Fellow Yale University BS,  Biology 1985  – 1989 Yale University BS,  Biology 1985  – 1989 Yale University BS,  Biology 1985  – 1989 ", "Experience Associate Professor School of Social Work, University at Buffalo, SUNY January 2009  – Present (6 years 8 months) Senior Research Scholar Stanford University School of Medicine March 2001  –  November 2007  (6 years 9 months) Associate Professor School of Social Work, University at Buffalo, SUNY January 2009  – Present (6 years 8 months) Associate Professor School of Social Work, University at Buffalo, SUNY January 2009  – Present (6 years 8 months) Senior Research Scholar Stanford University School of Medicine March 2001  –  November 2007  (6 years 9 months) Senior Research Scholar Stanford University School of Medicine March 2001  –  November 2007  (6 years 9 months) Skills Psychology Program Evaluation Community Outreach Clinical Research Teaching Higher Education Mental Health Psychological Assessment Psychotherapy Statistics Qualitative Research Program Development Grant Writing SPSS Psychiatry Student Development Clinical Supervision Treatment Group Therapy Research Design Public Speaking CBT University Teaching Neuroscience Cognition Research See 11+     See less Skills  Psychology Program Evaluation Community Outreach Clinical Research Teaching Higher Education Mental Health Psychological Assessment Psychotherapy Statistics Qualitative Research Program Development Grant Writing SPSS Psychiatry Student Development Clinical Supervision Treatment Group Therapy Research Design Public Speaking CBT University Teaching Neuroscience Cognition Research See 11+     See less Psychology Program Evaluation Community Outreach Clinical Research Teaching Higher Education Mental Health Psychological Assessment Psychotherapy Statistics Qualitative Research Program Development Grant Writing SPSS Psychiatry Student Development Clinical Supervision Treatment Group Therapy Research Design Public Speaking CBT University Teaching Neuroscience Cognition Research See 11+     See less Psychology Program Evaluation Community Outreach Clinical Research Teaching Higher Education Mental Health Psychological Assessment Psychotherapy Statistics Qualitative Research Program Development Grant Writing SPSS Psychiatry Student Development Clinical Supervision Treatment Group Therapy Research Design Public Speaking CBT University Teaching Neuroscience Cognition Research See 11+     See less Education Stanford University Ph.D.,  Psychology 1988  – 1993 Stanford University Ph.D.,  Psychology 1988  – 1993 Stanford University Ph.D.,  Psychology 1988  – 1993 Stanford University Ph.D.,  Psychology 1988  – 1993 ", "Summary Paul N. Stockton is Managing Director of Sonecon, LLC. \n \nBefore joining Sonecon, Dr. Stockton served as the Assistant Secretary of Defense for Homeland Defense and Americas’ Security Affairs from June, 2009 until January, 2013. In that position, helped lead the Department’s response to Superstorm Sandy and other disasters, guided Defense Critical Infrastructure Protection, and oversaw DOD continuity of operations programs and policies. Dr. Stockton was also responsible for DOD initiatives to strengthen security in the Western Hemisphere. In September, 2013, Secretary of Defense Chuck Hagel appointed Dr. Stockton to co-chair the Independent Review of the Washington Navy Yard Shootings, which recommended major changes to the Department’s security clearance system that are now being implemented.  \n \nPrior to his tenure as Assistant Secretary, Dr. Stockton served as Senior Research Scholar at Stanford University’s Center for International Security and Cooperation, Associate Provost of the Naval Postgraduate School, and Legislative Assistant for foreign and defense policy for Senator Daniel Patrick Moynihan. \n \nDr. Stockton holds a Ph.D. from Harvard University and a BA from Dartmouth College. His recent publications include articles on cyber security in the Yale Law and Policy Review, Stanford Law and Policy Review and other journals. Dr. Stockton was twice awarded the Department of Defense Medal for Distinguished Public Service, DOD’s highest civilian award. In addition, the Department of Homeland Security awarded Dr. Stockton its Distinguished Public Service Medal. Summary Paul N. Stockton is Managing Director of Sonecon, LLC. \n \nBefore joining Sonecon, Dr. Stockton served as the Assistant Secretary of Defense for Homeland Defense and Americas’ Security Affairs from June, 2009 until January, 2013. In that position, helped lead the Department’s response to Superstorm Sandy and other disasters, guided Defense Critical Infrastructure Protection, and oversaw DOD continuity of operations programs and policies. Dr. Stockton was also responsible for DOD initiatives to strengthen security in the Western Hemisphere. In September, 2013, Secretary of Defense Chuck Hagel appointed Dr. Stockton to co-chair the Independent Review of the Washington Navy Yard Shootings, which recommended major changes to the Department’s security clearance system that are now being implemented.  \n \nPrior to his tenure as Assistant Secretary, Dr. Stockton served as Senior Research Scholar at Stanford University’s Center for International Security and Cooperation, Associate Provost of the Naval Postgraduate School, and Legislative Assistant for foreign and defense policy for Senator Daniel Patrick Moynihan. \n \nDr. Stockton holds a Ph.D. from Harvard University and a BA from Dartmouth College. His recent publications include articles on cyber security in the Yale Law and Policy Review, Stanford Law and Policy Review and other journals. Dr. Stockton was twice awarded the Department of Defense Medal for Distinguished Public Service, DOD’s highest civilian award. In addition, the Department of Homeland Security awarded Dr. Stockton its Distinguished Public Service Medal. Paul N. Stockton is Managing Director of Sonecon, LLC. \n \nBefore joining Sonecon, Dr. Stockton served as the Assistant Secretary of Defense for Homeland Defense and Americas’ Security Affairs from June, 2009 until January, 2013. In that position, helped lead the Department’s response to Superstorm Sandy and other disasters, guided Defense Critical Infrastructure Protection, and oversaw DOD continuity of operations programs and policies. Dr. Stockton was also responsible for DOD initiatives to strengthen security in the Western Hemisphere. In September, 2013, Secretary of Defense Chuck Hagel appointed Dr. Stockton to co-chair the Independent Review of the Washington Navy Yard Shootings, which recommended major changes to the Department’s security clearance system that are now being implemented.  \n \nPrior to his tenure as Assistant Secretary, Dr. Stockton served as Senior Research Scholar at Stanford University’s Center for International Security and Cooperation, Associate Provost of the Naval Postgraduate School, and Legislative Assistant for foreign and defense policy for Senator Daniel Patrick Moynihan. \n \nDr. Stockton holds a Ph.D. from Harvard University and a BA from Dartmouth College. His recent publications include articles on cyber security in the Yale Law and Policy Review, Stanford Law and Policy Review and other journals. Dr. Stockton was twice awarded the Department of Defense Medal for Distinguished Public Service, DOD’s highest civilian award. In addition, the Department of Homeland Security awarded Dr. Stockton its Distinguished Public Service Medal. Paul N. Stockton is Managing Director of Sonecon, LLC. \n \nBefore joining Sonecon, Dr. Stockton served as the Assistant Secretary of Defense for Homeland Defense and Americas’ Security Affairs from June, 2009 until January, 2013. In that position, helped lead the Department’s response to Superstorm Sandy and other disasters, guided Defense Critical Infrastructure Protection, and oversaw DOD continuity of operations programs and policies. Dr. Stockton was also responsible for DOD initiatives to strengthen security in the Western Hemisphere. In September, 2013, Secretary of Defense Chuck Hagel appointed Dr. Stockton to co-chair the Independent Review of the Washington Navy Yard Shootings, which recommended major changes to the Department’s security clearance system that are now being implemented.  \n \nPrior to his tenure as Assistant Secretary, Dr. Stockton served as Senior Research Scholar at Stanford University’s Center for International Security and Cooperation, Associate Provost of the Naval Postgraduate School, and Legislative Assistant for foreign and defense policy for Senator Daniel Patrick Moynihan. \n \nDr. Stockton holds a Ph.D. from Harvard University and a BA from Dartmouth College. His recent publications include articles on cyber security in the Yale Law and Policy Review, Stanford Law and Policy Review and other journals. Dr. Stockton was twice awarded the Department of Defense Medal for Distinguished Public Service, DOD’s highest civilian award. In addition, the Department of Homeland Security awarded Dr. Stockton its Distinguished Public Service Medal. Experience Managing Director Sonecon LLC January 2013  – Present (2 years 8 months) Washington, DC Sonecon is an advisory firm that analyzes risks to the operations and investment strategies of large organizations and advises their executives on how to meet these challenges. The firm helps clients build resilience against emerging threats to their infrastructure and continuity of operations, and conduct effective crisis management and communications. Also provides rigorous analysis of opportunities and potential risks for corporations weighing major foreign direct investment in South America, Central America and the Caribbean. Each Sonecon client receives the personal attention and analysis of a custom team of experts assembled from the United States and across the Western Hemisphere. Assistant Secretary of Defense for Homeland Defense and Americas' Security Affairs United States Department of Defense May 2009  –  January 2013  (3 years 9 months) Responsible for Department of Defense initiatives to strengthen security in the Western Hemisphere and help partner nations build their capacities to meet emerging security challenges. Created the Department’s first-ever Mission Assurance Strategy, and launched a range of initiatives with the private sector, the Department of Energy, and the Department of Homeland Security to help ensure the availability of energy to DoD facilities. Guided the Defense Critical Infrastructure Protection program, served as DoD's Domestic Crisis Manager, and helped lead the Department's response to Superstorm Sandy, Deepwater Horizon and other disasters. In addition, was responsible for DoD policy on continuity of operations, domestic antiterrorism, maritime domain awareness, air sovereignty and preparedness for chemical, biological, radiological and nuclear events. Stanford University Senior Research Scholar Center for International Security and Cooperation 2006  –  2009  (3 years) Stanford University Associate Provost Naval Postgraduate School 2001  –  2005  (4 years) Monterey, CA Managing Director Sonecon LLC January 2013  – Present (2 years 8 months) Washington, DC Sonecon is an advisory firm that analyzes risks to the operations and investment strategies of large organizations and advises their executives on how to meet these challenges. The firm helps clients build resilience against emerging threats to their infrastructure and continuity of operations, and conduct effective crisis management and communications. Also provides rigorous analysis of opportunities and potential risks for corporations weighing major foreign direct investment in South America, Central America and the Caribbean. Each Sonecon client receives the personal attention and analysis of a custom team of experts assembled from the United States and across the Western Hemisphere. Managing Director Sonecon LLC January 2013  – Present (2 years 8 months) Washington, DC Sonecon is an advisory firm that analyzes risks to the operations and investment strategies of large organizations and advises their executives on how to meet these challenges. The firm helps clients build resilience against emerging threats to their infrastructure and continuity of operations, and conduct effective crisis management and communications. Also provides rigorous analysis of opportunities and potential risks for corporations weighing major foreign direct investment in South America, Central America and the Caribbean. Each Sonecon client receives the personal attention and analysis of a custom team of experts assembled from the United States and across the Western Hemisphere. Assistant Secretary of Defense for Homeland Defense and Americas' Security Affairs United States Department of Defense May 2009  –  January 2013  (3 years 9 months) Responsible for Department of Defense initiatives to strengthen security in the Western Hemisphere and help partner nations build their capacities to meet emerging security challenges. Created the Department’s first-ever Mission Assurance Strategy, and launched a range of initiatives with the private sector, the Department of Energy, and the Department of Homeland Security to help ensure the availability of energy to DoD facilities. Guided the Defense Critical Infrastructure Protection program, served as DoD's Domestic Crisis Manager, and helped lead the Department's response to Superstorm Sandy, Deepwater Horizon and other disasters. In addition, was responsible for DoD policy on continuity of operations, domestic antiterrorism, maritime domain awareness, air sovereignty and preparedness for chemical, biological, radiological and nuclear events. Assistant Secretary of Defense for Homeland Defense and Americas' Security Affairs United States Department of Defense May 2009  –  January 2013  (3 years 9 months) Responsible for Department of Defense initiatives to strengthen security in the Western Hemisphere and help partner nations build their capacities to meet emerging security challenges. Created the Department’s first-ever Mission Assurance Strategy, and launched a range of initiatives with the private sector, the Department of Energy, and the Department of Homeland Security to help ensure the availability of energy to DoD facilities. Guided the Defense Critical Infrastructure Protection program, served as DoD's Domestic Crisis Manager, and helped lead the Department's response to Superstorm Sandy, Deepwater Horizon and other disasters. In addition, was responsible for DoD policy on continuity of operations, domestic antiterrorism, maritime domain awareness, air sovereignty and preparedness for chemical, biological, radiological and nuclear events. Stanford University Senior Research Scholar Center for International Security and Cooperation 2006  –  2009  (3 years) Stanford University Stanford University Senior Research Scholar Center for International Security and Cooperation 2006  –  2009  (3 years) Stanford University Associate Provost Naval Postgraduate School 2001  –  2005  (4 years) Monterey, CA Associate Provost Naval Postgraduate School 2001  –  2005  (4 years) Monterey, CA Skills Security National Security Policy Analysis Defense Emergency Management Leadership Government Policy Program Management Preparedness DoD Crisis Management Security Clearance Analysis Homeland Security Strategic Communications Military Strategy Federal Government Management Foreign Policy International Relations Counterterrorism Intelligence Public Policy Government Contracting Command Operational Planning Army Diplomacy Special Operations Counterintelligence See 17+     See less Skills  Security National Security Policy Analysis Defense Emergency Management Leadership Government Policy Program Management Preparedness DoD Crisis Management Security Clearance Analysis Homeland Security Strategic Communications Military Strategy Federal Government Management Foreign Policy International Relations Counterterrorism Intelligence Public Policy Government Contracting Command Operational Planning Army Diplomacy Special Operations Counterintelligence See 17+     See less Security National Security Policy Analysis Defense Emergency Management Leadership Government Policy Program Management Preparedness DoD Crisis Management Security Clearance Analysis Homeland Security Strategic Communications Military Strategy Federal Government Management Foreign Policy International Relations Counterterrorism Intelligence Public Policy Government Contracting Command Operational Planning Army Diplomacy Special Operations Counterintelligence See 17+     See less Security National Security Policy Analysis Defense Emergency Management Leadership Government Policy Program Management Preparedness DoD Crisis Management Security Clearance Analysis Homeland Security Strategic Communications Military Strategy Federal Government Management Foreign Policy International Relations Counterterrorism Intelligence Public Policy Government Contracting Command Operational Planning Army Diplomacy Special Operations Counterintelligence See 17+     See less Education Harvard University Doctor of Philosophy (PhD) Dartmouth College Bachelor's degree Harvard University Doctor of Philosophy (PhD) Harvard University Doctor of Philosophy (PhD) Harvard University Doctor of Philosophy (PhD) Dartmouth College Bachelor's degree Dartmouth College Bachelor's degree Dartmouth College Bachelor's degree ", "Experience Senior Research Scholar Stanford University January 2007  – Present (8 years 8 months) Senior Research Scholar Stanford University January 2007  – Present (8 years 8 months) Senior Research Scholar Stanford University January 2007  – Present (8 years 8 months) ", "Skills Lecturing Organizational... Strategy Courses Research Management Consulting Theory Business Strategy Leadership Valuation Leadership Development Corporate Finance Teaching Entrepreneurship Change Management Organizational Behavior Higher Education Public Speaking Start-ups University Teaching Consulting E-Learning Qualitative Research See 8+     See less Skills  Lecturing Organizational... Strategy Courses Research Management Consulting Theory Business Strategy Leadership Valuation Leadership Development Corporate Finance Teaching Entrepreneurship Change Management Organizational Behavior Higher Education Public Speaking Start-ups University Teaching Consulting E-Learning Qualitative Research See 8+     See less Lecturing Organizational... Strategy Courses Research Management Consulting Theory Business Strategy Leadership Valuation Leadership Development Corporate Finance Teaching Entrepreneurship Change Management Organizational Behavior Higher Education Public Speaking Start-ups University Teaching Consulting E-Learning Qualitative Research See 8+     See less Lecturing Organizational... Strategy Courses Research Management Consulting Theory Business Strategy Leadership Valuation Leadership Development Corporate Finance Teaching Entrepreneurship Change Management Organizational Behavior Higher Education Public Speaking Start-ups University Teaching Consulting E-Learning Qualitative Research See 8+     See less Honors & Awards ", "Summary Academic Degrees: \n \nBsc Hons Molecular Biology. Ph.D. in Pathology \n \n \nExperience/positions \n \nCurrent: \n \nUCSF 2010-current \n \nInvestigating/leading a novel projects to reverse adverse affects of Myocardial Infarct at the UCSF translational cardiac stem cell research program. \n \n \nPast: \n \nWeatherall Institute of Molecular Medicine, Cancer Research UK, Oxford 1998-2003: \n \nDiscovered a new pathway of cellular oxygen sensing while at Weatherall Institute of Molecular Medicine, cancer Research UK, Oxford and University of Sheffield, UK.  \n \n \nStanford University 2005-2010: \n \nDiscovered additional new pathways of cellular oxygen sensing at Stanford University; Received the Stanford University Dean's Award; Demonstrated that the oxygen sensing pathways are altered in circulating tumor cells. \n \n \n \nGeneral:  \n \nAn avid martial artist for the past 25 years; registered black belt at Kukkiwon, Seoul Korea; still very active.  \n \nAn avid horseman. enjoy bareback riding; looking forward to take part in a major endurance race. \n \nOther interests include acting and film industry. \n \nSpecialties:  \n-Myocardial Infarct Microenvironment \n-Bio-medical technology \n-Cancer associated signaling pathways \n-Molecular and cellular oxygen sensing/signaling pathways  \n-Anoxia and ischemia pathways relevant to anti-angiogenesis therapies in cancer  \n-Writing, editing, presentation  \n-Communication, negotiation Summary Academic Degrees: \n \nBsc Hons Molecular Biology. Ph.D. in Pathology \n \n \nExperience/positions \n \nCurrent: \n \nUCSF 2010-current \n \nInvestigating/leading a novel projects to reverse adverse affects of Myocardial Infarct at the UCSF translational cardiac stem cell research program. \n \n \nPast: \n \nWeatherall Institute of Molecular Medicine, Cancer Research UK, Oxford 1998-2003: \n \nDiscovered a new pathway of cellular oxygen sensing while at Weatherall Institute of Molecular Medicine, cancer Research UK, Oxford and University of Sheffield, UK.  \n \n \nStanford University 2005-2010: \n \nDiscovered additional new pathways of cellular oxygen sensing at Stanford University; Received the Stanford University Dean's Award; Demonstrated that the oxygen sensing pathways are altered in circulating tumor cells. \n \n \n \nGeneral:  \n \nAn avid martial artist for the past 25 years; registered black belt at Kukkiwon, Seoul Korea; still very active.  \n \nAn avid horseman. enjoy bareback riding; looking forward to take part in a major endurance race. \n \nOther interests include acting and film industry. \n \nSpecialties:  \n-Myocardial Infarct Microenvironment \n-Bio-medical technology \n-Cancer associated signaling pathways \n-Molecular and cellular oxygen sensing/signaling pathways  \n-Anoxia and ischemia pathways relevant to anti-angiogenesis therapies in cancer  \n-Writing, editing, presentation  \n-Communication, negotiation Academic Degrees: \n \nBsc Hons Molecular Biology. Ph.D. in Pathology \n \n \nExperience/positions \n \nCurrent: \n \nUCSF 2010-current \n \nInvestigating/leading a novel projects to reverse adverse affects of Myocardial Infarct at the UCSF translational cardiac stem cell research program. \n \n \nPast: \n \nWeatherall Institute of Molecular Medicine, Cancer Research UK, Oxford 1998-2003: \n \nDiscovered a new pathway of cellular oxygen sensing while at Weatherall Institute of Molecular Medicine, cancer Research UK, Oxford and University of Sheffield, UK.  \n \n \nStanford University 2005-2010: \n \nDiscovered additional new pathways of cellular oxygen sensing at Stanford University; Received the Stanford University Dean's Award; Demonstrated that the oxygen sensing pathways are altered in circulating tumor cells. \n \n \n \nGeneral:  \n \nAn avid martial artist for the past 25 years; registered black belt at Kukkiwon, Seoul Korea; still very active.  \n \nAn avid horseman. enjoy bareback riding; looking forward to take part in a major endurance race. \n \nOther interests include acting and film industry. \n \nSpecialties:  \n-Myocardial Infarct Microenvironment \n-Bio-medical technology \n-Cancer associated signaling pathways \n-Molecular and cellular oxygen sensing/signaling pathways  \n-Anoxia and ischemia pathways relevant to anti-angiogenesis therapies in cancer  \n-Writing, editing, presentation  \n-Communication, negotiation Academic Degrees: \n \nBsc Hons Molecular Biology. Ph.D. in Pathology \n \n \nExperience/positions \n \nCurrent: \n \nUCSF 2010-current \n \nInvestigating/leading a novel projects to reverse adverse affects of Myocardial Infarct at the UCSF translational cardiac stem cell research program. \n \n \nPast: \n \nWeatherall Institute of Molecular Medicine, Cancer Research UK, Oxford 1998-2003: \n \nDiscovered a new pathway of cellular oxygen sensing while at Weatherall Institute of Molecular Medicine, cancer Research UK, Oxford and University of Sheffield, UK.  \n \n \nStanford University 2005-2010: \n \nDiscovered additional new pathways of cellular oxygen sensing at Stanford University; Received the Stanford University Dean's Award; Demonstrated that the oxygen sensing pathways are altered in circulating tumor cells. \n \n \n \nGeneral:  \n \nAn avid martial artist for the past 25 years; registered black belt at Kukkiwon, Seoul Korea; still very active.  \n \nAn avid horseman. enjoy bareback riding; looking forward to take part in a major endurance race. \n \nOther interests include acting and film industry. \n \nSpecialties:  \n-Myocardial Infarct Microenvironment \n-Bio-medical technology \n-Cancer associated signaling pathways \n-Molecular and cellular oxygen sensing/signaling pathways  \n-Anoxia and ischemia pathways relevant to anti-angiogenesis therapies in cancer  \n-Writing, editing, presentation  \n-Communication, negotiation Experience Senior Scientist Translational Cardiac Stem Cell Research Program (UCSF) November 2014  – Present (10 months) San Francisco Bay Area Associate Specialist Scientist UCSF January 2010  – Present (5 years 8 months) San Francisco Bay Area Senior Research Scholar Stanford University School of Medicine November 2005  –  February 2010  (4 years 4 months) Main area of research is on cancer therapeutics EU-young scientist Ludwig Maximillians University of Munich, Germany August 2003  –  August 2005  (2 years 1 month) Independent research on cancer therapeutics, gene therapy and oxygen sensing Post Graduate Staff Scientist University of Oxford, Cancer Research UK January 1998  –  January 2003  (5 years 1 month) Cancer therapy and oxygen sensing Senior Scientist Translational Cardiac Stem Cell Research Program (UCSF) November 2014  – Present (10 months) San Francisco Bay Area Senior Scientist Translational Cardiac Stem Cell Research Program (UCSF) November 2014  – Present (10 months) San Francisco Bay Area Associate Specialist Scientist UCSF January 2010  – Present (5 years 8 months) San Francisco Bay Area Associate Specialist Scientist UCSF January 2010  – Present (5 years 8 months) San Francisco Bay Area Senior Research Scholar Stanford University School of Medicine November 2005  –  February 2010  (4 years 4 months) Main area of research is on cancer therapeutics Senior Research Scholar Stanford University School of Medicine November 2005  –  February 2010  (4 years 4 months) Main area of research is on cancer therapeutics EU-young scientist Ludwig Maximillians University of Munich, Germany August 2003  –  August 2005  (2 years 1 month) Independent research on cancer therapeutics, gene therapy and oxygen sensing EU-young scientist Ludwig Maximillians University of Munich, Germany August 2003  –  August 2005  (2 years 1 month) Independent research on cancer therapeutics, gene therapy and oxygen sensing Post Graduate Staff Scientist University of Oxford, Cancer Research UK January 1998  –  January 2003  (5 years 1 month) Cancer therapy and oxygen sensing Post Graduate Staff Scientist University of Oxford, Cancer Research UK January 1998  –  January 2003  (5 years 1 month) Cancer therapy and oxygen sensing Skills Editing Cell Translational Research Drug Target Discovery Cellular Decision Making Biomarkers Cancer Cellular... Transdisciplinary... Modulation of Cell... Cell Signaling Scientific Writing Oncology Genetics Skills  Editing Cell Translational Research Drug Target Discovery Cellular Decision Making Biomarkers Cancer Cellular... Transdisciplinary... Modulation of Cell... Cell Signaling Scientific Writing Oncology Genetics Editing Cell Translational Research Drug Target Discovery Cellular Decision Making Biomarkers Cancer Cellular... Transdisciplinary... Modulation of Cell... Cell Signaling Scientific Writing Oncology Genetics Editing Cell Translational Research Drug Target Discovery Cellular Decision Making Biomarkers Cancer Cellular... Transdisciplinary... Modulation of Cell... Cell Signaling Scientific Writing Oncology Genetics Education University Oxford/University Sheffield Ph.D,  Pathology-Molecular Oncology 1998  – 2003 The University of Glasgow Bsc. Honors,  Molecular Biology 1992  – 1996 University Oxford/University Sheffield Ph.D,  Pathology-Molecular Oncology 1998  – 2003 University Oxford/University Sheffield Ph.D,  Pathology-Molecular Oncology 1998  – 2003 University Oxford/University Sheffield Ph.D,  Pathology-Molecular Oncology 1998  – 2003 The University of Glasgow Bsc. Honors,  Molecular Biology 1992  – 1996 The University of Glasgow Bsc. Honors,  Molecular Biology 1992  – 1996 The University of Glasgow Bsc. Honors,  Molecular Biology 1992  – 1996 ", "Experience Sr. Research Scholar Stanford University September 2012  – Present (3 years) Sr. Research Scholar Stanford University September 2012  – Present (3 years) Sr. Research Scholar Stanford University September 2012  – Present (3 years) Skills Statistics Stata Economics Research Quantitative Research Data Analysis Econometrics Health Policy Actuaries Actuarial Science Statistical Modeling Skills  Statistics Stata Economics Research Quantitative Research Data Analysis Econometrics Health Policy Actuaries Actuarial Science Statistical Modeling Statistics Stata Economics Research Quantitative Research Data Analysis Econometrics Health Policy Actuaries Actuarial Science Statistical Modeling Statistics Stata Economics Research Quantitative Research Data Analysis Econometrics Health Policy Actuaries Actuarial Science Statistical Modeling Education Stanford University Ph.D.,  Economics 2002  – 2007 University of Nebraska-Lincoln B.S.,  Math ,  Actuarial Science 1996  – 2000 Activities and Societies:  UNL Honors Program Millard South High School 1993  – 1996 Stanford University Ph.D.,  Economics 2002  – 2007 Stanford University Ph.D.,  Economics 2002  – 2007 Stanford University Ph.D.,  Economics 2002  – 2007 University of Nebraska-Lincoln B.S.,  Math ,  Actuarial Science 1996  – 2000 Activities and Societies:  UNL Honors Program University of Nebraska-Lincoln B.S.,  Math ,  Actuarial Science 1996  – 2000 Activities and Societies:  UNL Honors Program University of Nebraska-Lincoln B.S.,  Math ,  Actuarial Science 1996  – 2000 Activities and Societies:  UNL Honors Program Millard South High School 1993  – 1996 Millard South High School 1993  – 1996 Millard South High School 1993  – 1996 ", "Summary Research and outreach on Japanese security policy, encompassing both defense and diplomacy. I hope to help foster understanding of Japanese policies and promote appropriate responses to ease the integration of Japan as a dynamic agent of regional and global peace. Summary Research and outreach on Japanese security policy, encompassing both defense and diplomacy. I hope to help foster understanding of Japanese policies and promote appropriate responses to ease the integration of Japan as a dynamic agent of regional and global peace. Research and outreach on Japanese security policy, encompassing both defense and diplomacy. I hope to help foster understanding of Japanese policies and promote appropriate responses to ease the integration of Japan as a dynamic agent of regional and global peace. Research and outreach on Japanese security policy, encompassing both defense and diplomacy. I hope to help foster understanding of Japanese policies and promote appropriate responses to ease the integration of Japan as a dynamic agent of regional and global peace. Experience Vice President The Maureen and Mike Mansfield Foundation April 2015  – Present (5 months) Washington D.C. Metro Area Adjunct Fellow CSIS June 2012  – Present (3 years 3 months) Senior Research Scholar Stanford University September 2008  –  August 2011  (3 years) Takahashi Fellowship in Japanese Studies \nShorenstein Asis-Pacific Research Center \nFreeman-Spogli Institute for International Studies Senior Associate (non-resident) The Henry L. Stimson Center September 2003  –  August 2008  (5 years) Senior Associate The Henry L. Stimson Center September 1998  –  September 2003  (5 years 1 month) Graduate Research Fellow JUSEC Fulbright August 1996  –  February 1998  (1 year 7 months) Asia Program Associate Woodrow Wilson International Center for Scholars July 1993  –  July 1996  (3 years 1 month) Assistant Language Teacher Japan Exchange and Teaching Programme August 1989  –  July 1990  (1 year) Kanagawa-ken Board of Education Vice President The Maureen and Mike Mansfield Foundation April 2015  – Present (5 months) Washington D.C. Metro Area Vice President The Maureen and Mike Mansfield Foundation April 2015  – Present (5 months) Washington D.C. Metro Area Adjunct Fellow CSIS June 2012  – Present (3 years 3 months) Adjunct Fellow CSIS June 2012  – Present (3 years 3 months) Senior Research Scholar Stanford University September 2008  –  August 2011  (3 years) Takahashi Fellowship in Japanese Studies \nShorenstein Asis-Pacific Research Center \nFreeman-Spogli Institute for International Studies Senior Research Scholar Stanford University September 2008  –  August 2011  (3 years) Takahashi Fellowship in Japanese Studies \nShorenstein Asis-Pacific Research Center \nFreeman-Spogli Institute for International Studies Senior Associate (non-resident) The Henry L. Stimson Center September 2003  –  August 2008  (5 years) Senior Associate (non-resident) The Henry L. Stimson Center September 2003  –  August 2008  (5 years) Senior Associate The Henry L. Stimson Center September 1998  –  September 2003  (5 years 1 month) Senior Associate The Henry L. Stimson Center September 1998  –  September 2003  (5 years 1 month) Graduate Research Fellow JUSEC Fulbright August 1996  –  February 1998  (1 year 7 months) Graduate Research Fellow JUSEC Fulbright August 1996  –  February 1998  (1 year 7 months) Asia Program Associate Woodrow Wilson International Center for Scholars July 1993  –  July 1996  (3 years 1 month) Asia Program Associate Woodrow Wilson International Center for Scholars July 1993  –  July 1996  (3 years 1 month) Assistant Language Teacher Japan Exchange and Teaching Programme August 1989  –  July 1990  (1 year) Kanagawa-ken Board of Education Assistant Language Teacher Japan Exchange and Teaching Programme August 1989  –  July 1990  (1 year) Kanagawa-ken Board of Education Languages Japanese Mandarin Japanese Mandarin Japanese Mandarin Skills Policy Analysis Foreign Policy International Relations Politics Public Policy National Security International Security International... Political Science Qualitative Research Research Program Evaluation Non-profits Economics Human Rights Skills  Policy Analysis Foreign Policy International Relations Politics Public Policy National Security International Security International... Political Science Qualitative Research Research Program Evaluation Non-profits Economics Human Rights Policy Analysis Foreign Policy International Relations Politics Public Policy National Security International Security International... Political Science Qualitative Research Research Program Evaluation Non-profits Economics Human Rights Policy Analysis Foreign Policy International Relations Politics Public Policy National Security International Security International... Political Science Qualitative Research Research Program Evaluation Non-profits Economics Human Rights Education 慶応義塾大学 1996  – 1998 The Johns Hopkins University - Paul H. Nitze School of Advanced International Studies (SAIS) MA,  Japan Studies 1991  – 1993 Stanford University AB,  Political Science 1984  – 1988 Stuyvesant High School 1980  – 1984 慶応義塾大学 1996  – 1998 慶応義塾大学 1996  – 1998 慶応義塾大学 1996  – 1998 The Johns Hopkins University - Paul H. Nitze School of Advanced International Studies (SAIS) MA,  Japan Studies 1991  – 1993 The Johns Hopkins University - Paul H. Nitze School of Advanced International Studies (SAIS) MA,  Japan Studies 1991  – 1993 The Johns Hopkins University - Paul H. Nitze School of Advanced International Studies (SAIS) MA,  Japan Studies 1991  – 1993 Stanford University AB,  Political Science 1984  – 1988 Stanford University AB,  Political Science 1984  – 1988 Stanford University AB,  Political Science 1984  – 1988 Stuyvesant High School 1980  – 1984 Stuyvesant High School 1980  – 1984 Stuyvesant High School 1980  – 1984 ", "Summary My work examines \"sex testing\"​ policies for elite female athletes on ceiling on the amount of natural testosterone women can have (Olympic, IAAF, FIFA, etc.). My research on these policies has been published in Science, BMJ, and the American Journal of Bioethics, with commentaries in the New York Times, The Guardian, New Scientist, and Discover. \n \nI helped to mount Dutee Chand’s successful appeal against the IAAF’s hyperandrogenism regulation at the Court of Arbitration for Sport (Lausanne, Switzerland), and served as an expert witness in the hearing. I began my career looking at controversies over treatment for people with intersex traits, which resulted in my book Fixing Sex: Intersex, Medical Authority, and Lived Experience (Duke 2008).  \n \nMy work has been covered in the New York Times, Time, BuzzFeed, The Week, CNN, ESPN, The Daily Beast, The Los Angeles Times, Boston Globe, Jezebel, Slate, The Advocate, La Liberation, The Chronicle of Higher Education, San Jose Mercury News, and the Toronto Star. I’ve also appeared on The World, BBC, CBS News, NBC News, KCBS, CTV News, Q Radio, Al Jazeera, and the Australian Broadcasting Corporation, among others. \n \nI am an anthropologist and bioethicist at the Center for Biomedical Ethics at Stanford University and a faculty affiliate in the Program for Feminist, Gender, and Sexuality Studies, also at Stanford. \n \nYou can see more about my work here http://www.katrinakarkazis.com Summary My work examines \"sex testing\"​ policies for elite female athletes on ceiling on the amount of natural testosterone women can have (Olympic, IAAF, FIFA, etc.). My research on these policies has been published in Science, BMJ, and the American Journal of Bioethics, with commentaries in the New York Times, The Guardian, New Scientist, and Discover. \n \nI helped to mount Dutee Chand’s successful appeal against the IAAF’s hyperandrogenism regulation at the Court of Arbitration for Sport (Lausanne, Switzerland), and served as an expert witness in the hearing. I began my career looking at controversies over treatment for people with intersex traits, which resulted in my book Fixing Sex: Intersex, Medical Authority, and Lived Experience (Duke 2008).  \n \nMy work has been covered in the New York Times, Time, BuzzFeed, The Week, CNN, ESPN, The Daily Beast, The Los Angeles Times, Boston Globe, Jezebel, Slate, The Advocate, La Liberation, The Chronicle of Higher Education, San Jose Mercury News, and the Toronto Star. I’ve also appeared on The World, BBC, CBS News, NBC News, KCBS, CTV News, Q Radio, Al Jazeera, and the Australian Broadcasting Corporation, among others. \n \nI am an anthropologist and bioethicist at the Center for Biomedical Ethics at Stanford University and a faculty affiliate in the Program for Feminist, Gender, and Sexuality Studies, also at Stanford. \n \nYou can see more about my work here http://www.katrinakarkazis.com My work examines \"sex testing\"​ policies for elite female athletes on ceiling on the amount of natural testosterone women can have (Olympic, IAAF, FIFA, etc.). My research on these policies has been published in Science, BMJ, and the American Journal of Bioethics, with commentaries in the New York Times, The Guardian, New Scientist, and Discover. \n \nI helped to mount Dutee Chand’s successful appeal against the IAAF’s hyperandrogenism regulation at the Court of Arbitration for Sport (Lausanne, Switzerland), and served as an expert witness in the hearing. I began my career looking at controversies over treatment for people with intersex traits, which resulted in my book Fixing Sex: Intersex, Medical Authority, and Lived Experience (Duke 2008).  \n \nMy work has been covered in the New York Times, Time, BuzzFeed, The Week, CNN, ESPN, The Daily Beast, The Los Angeles Times, Boston Globe, Jezebel, Slate, The Advocate, La Liberation, The Chronicle of Higher Education, San Jose Mercury News, and the Toronto Star. I’ve also appeared on The World, BBC, CBS News, NBC News, KCBS, CTV News, Q Radio, Al Jazeera, and the Australian Broadcasting Corporation, among others. \n \nI am an anthropologist and bioethicist at the Center for Biomedical Ethics at Stanford University and a faculty affiliate in the Program for Feminist, Gender, and Sexuality Studies, also at Stanford. \n \nYou can see more about my work here http://www.katrinakarkazis.com My work examines \"sex testing\"​ policies for elite female athletes on ceiling on the amount of natural testosterone women can have (Olympic, IAAF, FIFA, etc.). My research on these policies has been published in Science, BMJ, and the American Journal of Bioethics, with commentaries in the New York Times, The Guardian, New Scientist, and Discover. \n \nI helped to mount Dutee Chand’s successful appeal against the IAAF’s hyperandrogenism regulation at the Court of Arbitration for Sport (Lausanne, Switzerland), and served as an expert witness in the hearing. I began my career looking at controversies over treatment for people with intersex traits, which resulted in my book Fixing Sex: Intersex, Medical Authority, and Lived Experience (Duke 2008).  \n \nMy work has been covered in the New York Times, Time, BuzzFeed, The Week, CNN, ESPN, The Daily Beast, The Los Angeles Times, Boston Globe, Jezebel, Slate, The Advocate, La Liberation, The Chronicle of Higher Education, San Jose Mercury News, and the Toronto Star. I’ve also appeared on The World, BBC, CBS News, NBC News, KCBS, CTV News, Q Radio, Al Jazeera, and the Australian Broadcasting Corporation, among others. \n \nI am an anthropologist and bioethicist at the Center for Biomedical Ethics at Stanford University and a faculty affiliate in the Program for Feminist, Gender, and Sexuality Studies, also at Stanford. \n \nYou can see more about my work here http://www.katrinakarkazis.com Experience Senior Research Scholar Stanford University March 2003  – Present (12 years 6 months) Critique Olympic and other eligibility/sex testing policies for elite female athletes \nResearch various topics in clinical ethics \nTeach research and clinical ethics Senior Research Scholar Stanford University March 2003  – Present (12 years 6 months) Critique Olympic and other eligibility/sex testing policies for elite female athletes \nResearch various topics in clinical ethics \nTeach research and clinical ethics Senior Research Scholar Stanford University March 2003  – Present (12 years 6 months) Critique Olympic and other eligibility/sex testing policies for elite female athletes \nResearch various topics in clinical ethics \nTeach research and clinical ethics Languages French French French Skills Research University Teaching Medical Ethics Sports Ethics Patient Advocacy Child Advocacy Women's Health Bioethics Gender Studies Teaching Qualitative Research Public Health SPSS Program Evaluation Social Media Public Speaking Higher Education Nonprofits Editing See 5+     See less Skills  Research University Teaching Medical Ethics Sports Ethics Patient Advocacy Child Advocacy Women's Health Bioethics Gender Studies Teaching Qualitative Research Public Health SPSS Program Evaluation Social Media Public Speaking Higher Education Nonprofits Editing See 5+     See less Research University Teaching Medical Ethics Sports Ethics Patient Advocacy Child Advocacy Women's Health Bioethics Gender Studies Teaching Qualitative Research Public Health SPSS Program Evaluation Social Media Public Speaking Higher Education Nonprofits Editing See 5+     See less Research University Teaching Medical Ethics Sports Ethics Patient Advocacy Child Advocacy Women's Health Bioethics Gender Studies Teaching Qualitative Research Public Health SPSS Program Evaluation Social Media Public Speaking Higher Education Nonprofits Editing See 5+     See less Education Columbia University in the City of New York Doctor of Philosophy (PhD),  Cultural Anthropology ,  Medical Anthropology 1995  – 2002 Columbia University Mailman School of Public Health Master of Public Health (MPH),  Maternal and Child Health 1993  – 1995 Occidental College Bachelor of Arts (BA),  Public Policy 1987  – 1991 Columbia University in the City of New York Doctor of Philosophy (PhD),  Cultural Anthropology ,  Medical Anthropology 1995  – 2002 Columbia University in the City of New York Doctor of Philosophy (PhD),  Cultural Anthropology ,  Medical Anthropology 1995  – 2002 Columbia University in the City of New York Doctor of Philosophy (PhD),  Cultural Anthropology ,  Medical Anthropology 1995  – 2002 Columbia University Mailman School of Public Health Master of Public Health (MPH),  Maternal and Child Health 1993  – 1995 Columbia University Mailman School of Public Health Master of Public Health (MPH),  Maternal and Child Health 1993  – 1995 Columbia University Mailman School of Public Health Master of Public Health (MPH),  Maternal and Child Health 1993  – 1995 Occidental College Bachelor of Arts (BA),  Public Policy 1987  – 1991 Occidental College Bachelor of Arts (BA),  Public Policy 1987  – 1991 Occidental College Bachelor of Arts (BA),  Public Policy 1987  – 1991 ", "Experience Associate Director for Research/Senior Research Scholar Stanford University Center for International Security & Cooperation (CISAC) 2002  – Present (13 years) Associate Director for Research/Senior Research Scholar Stanford University Center for International Security & Cooperation (CISAC) 2002  – Present (13 years) Acting Co-Director, 2008-2009 CISAC, Stanford University 2008  –  2009  (1 year) Associate Director for Research/Senior Research Scholar Stanford University Center for International Security & Cooperation (CISAC) 2002  – Present (13 years) Associate Director for Research/Senior Research Scholar Stanford University Center for International Security & Cooperation (CISAC) 2002  – Present (13 years) Associate Director for Research/Senior Research Scholar Stanford University Center for International Security & Cooperation (CISAC) 2002  – Present (13 years) Associate Director for Research/Senior Research Scholar Stanford University Center for International Security & Cooperation (CISAC) 2002  – Present (13 years) Acting Co-Director, 2008-2009 CISAC, Stanford University 2008  –  2009  (1 year) Acting Co-Director, 2008-2009 CISAC, Stanford University 2008  –  2009  (1 year) ", "Experience Senior Director, Clinical Publications Accuray Incorporated July 2011  – Present (4 years 2 months) Director, Clinical Publications Accuray January 2006  –  July 2011  (5 years 7 months) Senior Research Scholar Stanford University School of Medicine June 2002  –  January 2006  (3 years 8 months) Senior Research Scholar Stanford University 2002  –  2006  (4 years) Associate Professor West Virginia University June 1996  –  June 2002  (6 years 1 month) Assistant Professor West Virginia University September 1991  –  June 1996  (4 years 10 months) Senior Director, Clinical Publications Accuray Incorporated July 2011  – Present (4 years 2 months) Senior Director, Clinical Publications Accuray Incorporated July 2011  – Present (4 years 2 months) Director, Clinical Publications Accuray January 2006  –  July 2011  (5 years 7 months) Director, Clinical Publications Accuray January 2006  –  July 2011  (5 years 7 months) Senior Research Scholar Stanford University School of Medicine June 2002  –  January 2006  (3 years 8 months) Senior Research Scholar Stanford University School of Medicine June 2002  –  January 2006  (3 years 8 months) Senior Research Scholar Stanford University 2002  –  2006  (4 years) Senior Research Scholar Stanford University 2002  –  2006  (4 years) Associate Professor West Virginia University June 1996  –  June 2002  (6 years 1 month) Associate Professor West Virginia University June 1996  –  June 2002  (6 years 1 month) Assistant Professor West Virginia University September 1991  –  June 1996  (4 years 10 months) Assistant Professor West Virginia University September 1991  –  June 1996  (4 years 10 months) Skills Data Analysis Skills  Data Analysis Data Analysis Data Analysis Education University of Florida Ph.D.,  Experimental Psychology 1983  – 1988 St. Cloud State University BS,  Psychology University of Florida Ph.D.,  Experimental Psychology 1983  – 1988 University of Florida Ph.D.,  Experimental Psychology 1983  – 1988 University of Florida Ph.D.,  Experimental Psychology 1983  – 1988 St. Cloud State University BS,  Psychology St. Cloud State University BS,  Psychology St. Cloud State University BS,  Psychology ", "Experience Senior Research Scholar Stanford University September 2014  – Present (1 year) Research Associate, Stanford University School of Education Stanford University September 2009  –  September 2014  (5 years 1 month) Instructor, Child and Adolescent Development San Jose State University August 2006  –  June 2007  (11 months) Senior Research Scholar Stanford University September 2014  – Present (1 year) Senior Research Scholar Stanford University September 2014  – Present (1 year) Research Associate, Stanford University School of Education Stanford University September 2009  –  September 2014  (5 years 1 month) Research Associate, Stanford University School of Education Stanford University September 2009  –  September 2014  (5 years 1 month) Instructor, Child and Adolescent Development San Jose State University August 2006  –  June 2007  (11 months) Instructor, Child and Adolescent Development San Jose State University August 2006  –  June 2007  (11 months) Skills Educational Technology Curriculum Design Curriculum Development Mobile Learning Mathematics Education Objective-C Java Statistics Science Matlab Educational Assessment Data Analysis Experimental Design Research Higher Education University Teaching Grant Writing Qualitative Research Teaching Research Design See 5+     See less Skills  Educational Technology Curriculum Design Curriculum Development Mobile Learning Mathematics Education Objective-C Java Statistics Science Matlab Educational Assessment Data Analysis Experimental Design Research Higher Education University Teaching Grant Writing Qualitative Research Teaching Research Design See 5+     See less Educational Technology Curriculum Design Curriculum Development Mobile Learning Mathematics Education Objective-C Java Statistics Science Matlab Educational Assessment Data Analysis Experimental Design Research Higher Education University Teaching Grant Writing Qualitative Research Teaching Research Design See 5+     See less Educational Technology Curriculum Design Curriculum Development Mobile Learning Mathematics Education Objective-C Java Statistics Science Matlab Educational Assessment Data Analysis Experimental Design Research Higher Education University Teaching Grant Writing Qualitative Research Teaching Research Design See 5+     See less Education Stanford University Doctor of Philosophy (PhD),  Learning Sciences and Technology Design 2003  – 2009 Stanford University Bachelor of Science (BS),  Mathematical and Computational Science 1998  – 2002 Stanford University Doctor of Philosophy (PhD),  Learning Sciences and Technology Design 2003  – 2009 Stanford University Doctor of Philosophy (PhD),  Learning Sciences and Technology Design 2003  – 2009 Stanford University Doctor of Philosophy (PhD),  Learning Sciences and Technology Design 2003  – 2009 Stanford University Bachelor of Science (BS),  Mathematical and Computational Science 1998  – 2002 Stanford University Bachelor of Science (BS),  Mathematical and Computational Science 1998  – 2002 Stanford University Bachelor of Science (BS),  Mathematical and Computational Science 1998  – 2002 ", "Summary Research and Clinical Psychologist specializing in the assessment of emotional expression and its impact on business relationships, as well as psychological and physical health. Specialties:Assessing emotional expression in business relationships to impact hiring decisions, and increase effective communication. Summary Research and Clinical Psychologist specializing in the assessment of emotional expression and its impact on business relationships, as well as psychological and physical health. Specialties:Assessing emotional expression in business relationships to impact hiring decisions, and increase effective communication. Research and Clinical Psychologist specializing in the assessment of emotional expression and its impact on business relationships, as well as psychological and physical health. Specialties:Assessing emotional expression in business relationships to impact hiring decisions, and increase effective communication. Research and Clinical Psychologist specializing in the assessment of emotional expression and its impact on business relationships, as well as psychological and physical health. Specialties:Assessing emotional expression in business relationships to impact hiring decisions, and increase effective communication. Experience Associate Professor University of Calgary September 2008  – Present (7 years) Clinical Psychologist/Researcher. Tom Baker Cancer Centre. Focus on communication, emotional expression, and cancer survivorship Founder, President and CEO iEMPATH, LLC October 2007  – Present (7 years 11 months) Scientific assessment of emotional expression in business relationships. Based on our assessment, we have predicted  \n \n-The productivity and efficiency of teams \n-The success of salespeople; and \n-Effectiveness in hiring \n \nWe also provide expert training to increase effective communication. Clinical Psychologist: Senior Research Scholar Stanford University Department of Psychiatry and Behavioral Science 1994  –  2008  (14 years) Founded and directed The Emotion Coding Lab: Stanford. Conducted mind/body research on psychological interventions for people with cancer. \n \nAuthor of 50 peer-reviewed papers and chapters on mind/body medicine. Graduate Student University of Illinois 1983  –  1992  (9 years) Associate Professor University of Calgary September 2008  – Present (7 years) Clinical Psychologist/Researcher. Tom Baker Cancer Centre. Focus on communication, emotional expression, and cancer survivorship Associate Professor University of Calgary September 2008  – Present (7 years) Clinical Psychologist/Researcher. Tom Baker Cancer Centre. Focus on communication, emotional expression, and cancer survivorship Founder, President and CEO iEMPATH, LLC October 2007  – Present (7 years 11 months) Scientific assessment of emotional expression in business relationships. Based on our assessment, we have predicted  \n \n-The productivity and efficiency of teams \n-The success of salespeople; and \n-Effectiveness in hiring \n \nWe also provide expert training to increase effective communication. Founder, President and CEO iEMPATH, LLC October 2007  – Present (7 years 11 months) Scientific assessment of emotional expression in business relationships. Based on our assessment, we have predicted  \n \n-The productivity and efficiency of teams \n-The success of salespeople; and \n-Effectiveness in hiring \n \nWe also provide expert training to increase effective communication. Clinical Psychologist: Senior Research Scholar Stanford University Department of Psychiatry and Behavioral Science 1994  –  2008  (14 years) Founded and directed The Emotion Coding Lab: Stanford. Conducted mind/body research on psychological interventions for people with cancer. \n \nAuthor of 50 peer-reviewed papers and chapters on mind/body medicine. Clinical Psychologist: Senior Research Scholar Stanford University Department of Psychiatry and Behavioral Science 1994  –  2008  (14 years) Founded and directed The Emotion Coding Lab: Stanford. Conducted mind/body research on psychological interventions for people with cancer. \n \nAuthor of 50 peer-reviewed papers and chapters on mind/body medicine. Graduate Student University of Illinois 1983  –  1992  (9 years) Graduate Student University of Illinois 1983  –  1992  (9 years) Skills Psychology Statistics Teaching Qualitative Research Research Grant Writing Clinical Research Higher Education Skills  Psychology Statistics Teaching Qualitative Research Research Grant Writing Clinical Research Higher Education Psychology Statistics Teaching Qualitative Research Research Grant Writing Clinical Research Higher Education Psychology Statistics Teaching Qualitative Research Research Grant Writing Clinical Research Higher Education Education Stanford University School of Medicine Postdoc,  Psychology 1994  – 1997 University of Illinois at Urbana-Champaign Ph.D.,  Clinical Psychology 1983  – 1992 Colorado State University B.A./B.S.,  English Literature and Psychology 1974  – 1983 Bloomington High School 1970  – 1974 Stanford University School of Medicine Postdoc,  Psychology 1994  – 1997 Stanford University School of Medicine Postdoc,  Psychology 1994  – 1997 Stanford University School of Medicine Postdoc,  Psychology 1994  – 1997 University of Illinois at Urbana-Champaign Ph.D.,  Clinical Psychology 1983  – 1992 University of Illinois at Urbana-Champaign Ph.D.,  Clinical Psychology 1983  – 1992 University of Illinois at Urbana-Champaign Ph.D.,  Clinical Psychology 1983  – 1992 Colorado State University B.A./B.S.,  English Literature and Psychology 1974  – 1983 Colorado State University B.A./B.S.,  English Literature and Psychology 1974  – 1983 Colorado State University B.A./B.S.,  English Literature and Psychology 1974  – 1983 Bloomington High School 1970  – 1974 Bloomington High School 1970  – 1974 Bloomington High School 1970  – 1974 ", "Experience Senior Research Scholar Stanford University Senior Research Scholar Stanford University Senior Research Scholar Stanford University ", "Summary Nationally and internationally recognized energy expert with over 35 years' experience. Expertise covers energy efficiency, demand response, smart grid, renewable energy resources, transmission, and climate change. Extensive experience in all facets of energy policy and regulation, utilities, market development and innovation, and key factors driving U.S. and global energy investments. Summary Nationally and internationally recognized energy expert with over 35 years' experience. Expertise covers energy efficiency, demand response, smart grid, renewable energy resources, transmission, and climate change. Extensive experience in all facets of energy policy and regulation, utilities, market development and innovation, and key factors driving U.S. and global energy investments. Nationally and internationally recognized energy expert with over 35 years' experience. Expertise covers energy efficiency, demand response, smart grid, renewable energy resources, transmission, and climate change. Extensive experience in all facets of energy policy and regulation, utilities, market development and innovation, and key factors driving U.S. and global energy investments. Nationally and internationally recognized energy expert with over 35 years' experience. Expertise covers energy efficiency, demand response, smart grid, renewable energy resources, transmission, and climate change. Extensive experience in all facets of energy policy and regulation, utilities, market development and innovation, and key factors driving U.S. and global energy investments. Experience Senior Research Scholar Stanford University May 2014  – Present (1 year 4 months) Stanford, CA In May 2014, appointed with Stanford University as a Senior Research Scholar with the Precourt Energy Efficiency Center and the Shultz-Stephenson Energy Policy Task Force, to spearhead an increased focus of Stanford on state and regional energy issues, focusing in particular on regulatory policy governance and the next generation of energy efficiency. Founder and Principal Dian Grueneich Consulting, LLC March 2012  – Present (3 years 6 months) Assists clients on a full range of energy issues, focusing on U.S. and worldwide energy markets and the regulatory systems affecting sustainable energy investments. Partner Morrison & Foerster LLP March 2011  –  March 2012  (1 year 1 month) Advised clients on energy regulation, policy, and market opportunities, both in the U.S. and internationally. Represented clients in regulatory and transactional matters, and assisted in strategic business analysis. Commissioner California Public Utilities Commission 2005  –  2010  (5 years) Appointed in 2005 by Governor Schwarzenegger and confirmed unanimously by the California Senate. Lead Commissioner for: \n- Energy efficiency, including long-range market transformation \n- Demand response \n- Advanced metering infrastructure cases for 3 major CA utilities \n- Transmission planning and permitting \n- Western U.S. energy matters \n- Representation of CA Climate Action Plan Team \n- Low income energy issues Founder and Principal Grueneich Resource Advocates (GRA) 1985  –  2004  (19 years) San Francisco Bay Area Developed strategic energy plans for the County of Los Angeles and for the California State University. Designed a national regulatory program for the National Association of Energy Service Companies (NAESCO) to promote increased use of energy efficiency, initiated the California Conservation Collaborative, and helped the CA Legislature develop initiatives using energy policies to address environmental issues. Senior Associate Heller Ehrman 1982  –  1985  (3 years) San Francisco Bay Area Worked with the firm's Litigation Department, specializing in energy and environmental law. Deputy General Counsel California Energy Commission 1980  –  1982  (2 years) Sacramento, California Area Presented the first-ever proposal for energy efficiency decoupling. Helped draft the state's first building and appliance standards and the first statewide integrated energy policy plan. Staff Counsel California Energy Commission 1977  –  1980  (3 years) Sacramento, California Area Senior Research Scholar Stanford University May 2014  – Present (1 year 4 months) Stanford, CA In May 2014, appointed with Stanford University as a Senior Research Scholar with the Precourt Energy Efficiency Center and the Shultz-Stephenson Energy Policy Task Force, to spearhead an increased focus of Stanford on state and regional energy issues, focusing in particular on regulatory policy governance and the next generation of energy efficiency. Senior Research Scholar Stanford University May 2014  – Present (1 year 4 months) Stanford, CA In May 2014, appointed with Stanford University as a Senior Research Scholar with the Precourt Energy Efficiency Center and the Shultz-Stephenson Energy Policy Task Force, to spearhead an increased focus of Stanford on state and regional energy issues, focusing in particular on regulatory policy governance and the next generation of energy efficiency. Founder and Principal Dian Grueneich Consulting, LLC March 2012  – Present (3 years 6 months) Assists clients on a full range of energy issues, focusing on U.S. and worldwide energy markets and the regulatory systems affecting sustainable energy investments. Founder and Principal Dian Grueneich Consulting, LLC March 2012  – Present (3 years 6 months) Assists clients on a full range of energy issues, focusing on U.S. and worldwide energy markets and the regulatory systems affecting sustainable energy investments. Partner Morrison & Foerster LLP March 2011  –  March 2012  (1 year 1 month) Advised clients on energy regulation, policy, and market opportunities, both in the U.S. and internationally. Represented clients in regulatory and transactional matters, and assisted in strategic business analysis. Partner Morrison & Foerster LLP March 2011  –  March 2012  (1 year 1 month) Advised clients on energy regulation, policy, and market opportunities, both in the U.S. and internationally. Represented clients in regulatory and transactional matters, and assisted in strategic business analysis. Commissioner California Public Utilities Commission 2005  –  2010  (5 years) Appointed in 2005 by Governor Schwarzenegger and confirmed unanimously by the California Senate. Lead Commissioner for: \n- Energy efficiency, including long-range market transformation \n- Demand response \n- Advanced metering infrastructure cases for 3 major CA utilities \n- Transmission planning and permitting \n- Western U.S. energy matters \n- Representation of CA Climate Action Plan Team \n- Low income energy issues Commissioner California Public Utilities Commission 2005  –  2010  (5 years) Appointed in 2005 by Governor Schwarzenegger and confirmed unanimously by the California Senate. Lead Commissioner for: \n- Energy efficiency, including long-range market transformation \n- Demand response \n- Advanced metering infrastructure cases for 3 major CA utilities \n- Transmission planning and permitting \n- Western U.S. energy matters \n- Representation of CA Climate Action Plan Team \n- Low income energy issues Founder and Principal Grueneich Resource Advocates (GRA) 1985  –  2004  (19 years) San Francisco Bay Area Developed strategic energy plans for the County of Los Angeles and for the California State University. Designed a national regulatory program for the National Association of Energy Service Companies (NAESCO) to promote increased use of energy efficiency, initiated the California Conservation Collaborative, and helped the CA Legislature develop initiatives using energy policies to address environmental issues. Founder and Principal Grueneich Resource Advocates (GRA) 1985  –  2004  (19 years) San Francisco Bay Area Developed strategic energy plans for the County of Los Angeles and for the California State University. Designed a national regulatory program for the National Association of Energy Service Companies (NAESCO) to promote increased use of energy efficiency, initiated the California Conservation Collaborative, and helped the CA Legislature develop initiatives using energy policies to address environmental issues. Senior Associate Heller Ehrman 1982  –  1985  (3 years) San Francisco Bay Area Worked with the firm's Litigation Department, specializing in energy and environmental law. Senior Associate Heller Ehrman 1982  –  1985  (3 years) San Francisco Bay Area Worked with the firm's Litigation Department, specializing in energy and environmental law. Deputy General Counsel California Energy Commission 1980  –  1982  (2 years) Sacramento, California Area Presented the first-ever proposal for energy efficiency decoupling. Helped draft the state's first building and appliance standards and the first statewide integrated energy policy plan. Deputy General Counsel California Energy Commission 1980  –  1982  (2 years) Sacramento, California Area Presented the first-ever proposal for energy efficiency decoupling. Helped draft the state's first building and appliance standards and the first statewide integrated energy policy plan. Staff Counsel California Energy Commission 1977  –  1980  (3 years) Sacramento, California Area Staff Counsel California Energy Commission 1977  –  1980  (3 years) Sacramento, California Area Skills Energy Policy Renewable Energy Cleantech Energy Smart Grid Environmental Law Environmental Awareness Energy Management Legislative Relations Climate Change Sustainable Energy Energy Efficiency Policy Environmental Policy Demand Response Clean Technology Environmental Issues Solar Energy See 3+     See less Skills  Energy Policy Renewable Energy Cleantech Energy Smart Grid Environmental Law Environmental Awareness Energy Management Legislative Relations Climate Change Sustainable Energy Energy Efficiency Policy Environmental Policy Demand Response Clean Technology Environmental Issues Solar Energy See 3+     See less Energy Policy Renewable Energy Cleantech Energy Smart Grid Environmental Law Environmental Awareness Energy Management Legislative Relations Climate Change Sustainable Energy Energy Efficiency Policy Environmental Policy Demand Response Clean Technology Environmental Issues Solar Energy See 3+     See less Energy Policy Renewable Energy Cleantech Energy Smart Grid Environmental Law Environmental Awareness Energy Management Legislative Relations Climate Change Sustainable Energy Energy Efficiency Policy Environmental Policy Demand Response Clean Technology Environmental Issues Solar Energy See 3+     See less Education Georgetown University Law Center Doctor of Law (J.D.) 1974  – 1977 Stanford University Bachelor of Arts (B.A.),  Human Biology 1971  – 1974 Georgetown University Law Center Doctor of Law (J.D.) 1974  – 1977 Georgetown University Law Center Doctor of Law (J.D.) 1974  – 1977 Georgetown University Law Center Doctor of Law (J.D.) 1974  – 1977 Stanford University Bachelor of Arts (B.A.),  Human Biology 1971  – 1974 Stanford University Bachelor of Arts (B.A.),  Human Biology 1971  – 1974 Stanford University Bachelor of Arts (B.A.),  Human Biology 1971  – 1974 Honors & Awards Additional Honors & Awards - American Council for an Energy-Efficient Economy's 30th Anniversary Award for outstanding contribution in the field of energy efficiency (2010) \n- National Association of Regulatory Utility Commissioners Klimarx Clean Energy Award (2010) \n- eeGlobal Forum's first \"Visionary Award\" for leadership in developing the California Long-Term Energy Efficiency Strategic Plan (2009) \n- American Council for an Energy-Efficient Economy's \"National Champion of Energy Efficiency Award\" (2008) \n- Center for Energy Efficiency and Renewable Technologies’ (CEERT) Clean Power Champion Additional Honors & Awards - American Council for an Energy-Efficient Economy's 30th Anniversary Award for outstanding contribution in the field of energy efficiency (2010) \n- National Association of Regulatory Utility Commissioners Klimarx Clean Energy Award (2010) \n- eeGlobal Forum's first \"Visionary Award\" for leadership in developing the California Long-Term Energy Efficiency Strategic Plan (2009) \n- American Council for an Energy-Efficient Economy's \"National Champion of Energy Efficiency Award\" (2008) \n- Center for Energy Efficiency and Renewable Technologies’ (CEERT) Clean Power Champion Additional Honors & Awards - American Council for an Energy-Efficient Economy's 30th Anniversary Award for outstanding contribution in the field of energy efficiency (2010) \n- National Association of Regulatory Utility Commissioners Klimarx Clean Energy Award (2010) \n- eeGlobal Forum's first \"Visionary Award\" for leadership in developing the California Long-Term Energy Efficiency Strategic Plan (2009) \n- American Council for an Energy-Efficient Economy's \"National Champion of Energy Efficiency Award\" (2008) \n- Center for Energy Efficiency and Renewable Technologies’ (CEERT) Clean Power Champion Additional Honors & Awards - American Council for an Energy-Efficient Economy's 30th Anniversary Award for outstanding contribution in the field of energy efficiency (2010) \n- National Association of Regulatory Utility Commissioners Klimarx Clean Energy Award (2010) \n- eeGlobal Forum's first \"Visionary Award\" for leadership in developing the California Long-Term Energy Efficiency Strategic Plan (2009) \n- American Council for an Energy-Efficient Economy's \"National Champion of Energy Efficiency Award\" (2008) \n- Center for Energy Efficiency and Renewable Technologies’ (CEERT) Clean Power Champion ", "Experience Professor University of Toronto July 2015  – Present (2 months) Toronto, Canada Area Academic Leader, Trauma Therapy Program Women's College Hospital 2005  – Present (10 years) Director, Women's Mental Health Research Program Women's College Research Institute 2005  – Present (10 years) Associate Professor University of Toronto 2005  –  June 2015  (10 years) Senior Research Scientist Stanford University School of Medicine 2001  –  2005  (4 years) Senior Research Scholar Stanford University School of Medicine March 2000  –  August 2001  (1 year 6 months) Research Associate Stanford University School of Medicine September 1993  –  March 2000  (6 years 7 months) Professor University of Toronto July 2015  – Present (2 months) Toronto, Canada Area Professor University of Toronto July 2015  – Present (2 months) Toronto, Canada Area Academic Leader, Trauma Therapy Program Women's College Hospital 2005  – Present (10 years) Academic Leader, Trauma Therapy Program Women's College Hospital 2005  – Present (10 years) Director, Women's Mental Health Research Program Women's College Research Institute 2005  – Present (10 years) Director, Women's Mental Health Research Program Women's College Research Institute 2005  – Present (10 years) Associate Professor University of Toronto 2005  –  June 2015  (10 years) Associate Professor University of Toronto 2005  –  June 2015  (10 years) Senior Research Scientist Stanford University School of Medicine 2001  –  2005  (4 years) Senior Research Scientist Stanford University School of Medicine 2001  –  2005  (4 years) Senior Research Scholar Stanford University School of Medicine March 2000  –  August 2001  (1 year 6 months) Senior Research Scholar Stanford University School of Medicine March 2000  –  August 2001  (1 year 6 months) Research Associate Stanford University School of Medicine September 1993  –  March 2000  (6 years 7 months) Research Associate Stanford University School of Medicine September 1993  –  March 2000  (6 years 7 months) Skills Mental Health Research Treatment Healthcare Clinical Psychology Grant Writing Public Speaking Psychotherapy Post Traumatic Stress Adolescents Stress Life Transitions Clinical Research Neuroscience Public Health Community Outreach Crisis Intervention Clinical Supervision Family Therapy Case Managment Nonprofits Program Evaluation Group Therapy Psychiatry Therapists Behavioral Health Cognition Program Development Non-profits Social Services Teaching CBT Psychological Assessment Mindfulness Qualitative Research Stress Management Statistics Science Clinical Psychology Interventions Mental Health Counseling Motivational... Prevention Grief Counseling Counseling Psychology Self-esteem Child Development Psychological Testing Health Psychology See 35+     See less Skills  Mental Health Research Treatment Healthcare Clinical Psychology Grant Writing Public Speaking Psychotherapy Post Traumatic Stress Adolescents Stress Life Transitions Clinical Research Neuroscience Public Health Community Outreach Crisis Intervention Clinical Supervision Family Therapy Case Managment Nonprofits Program Evaluation Group Therapy Psychiatry Therapists Behavioral Health Cognition Program Development Non-profits Social Services Teaching CBT Psychological Assessment Mindfulness Qualitative Research Stress Management Statistics Science Clinical Psychology Interventions Mental Health Counseling Motivational... Prevention Grief Counseling Counseling Psychology Self-esteem Child Development Psychological Testing Health Psychology See 35+     See less Mental Health Research Treatment Healthcare Clinical Psychology Grant Writing Public Speaking Psychotherapy Post Traumatic Stress Adolescents Stress Life Transitions Clinical Research Neuroscience Public Health Community Outreach Crisis Intervention Clinical Supervision Family Therapy Case Managment Nonprofits Program Evaluation Group Therapy Psychiatry Therapists Behavioral Health Cognition Program Development Non-profits Social Services Teaching CBT Psychological Assessment Mindfulness Qualitative Research Stress Management Statistics Science Clinical Psychology Interventions Mental Health Counseling Motivational... Prevention Grief Counseling Counseling Psychology Self-esteem Child Development Psychological Testing Health Psychology See 35+     See less Mental Health Research Treatment Healthcare Clinical Psychology Grant Writing Public Speaking Psychotherapy Post Traumatic Stress Adolescents Stress Life Transitions Clinical Research Neuroscience Public Health Community Outreach Crisis Intervention Clinical Supervision Family Therapy Case Managment Nonprofits Program Evaluation Group Therapy Psychiatry Therapists Behavioral Health Cognition Program Development Non-profits Social Services Teaching CBT Psychological Assessment Mindfulness Qualitative Research Stress Management Statistics Science Clinical Psychology Interventions Mental Health Counseling Motivational... Prevention Grief Counseling Counseling Psychology Self-esteem Child Development Psychological Testing Health Psychology See 35+     See less Education University of Victoria BA,  Psychology York University MA, PhD,  Clinical Psychology University of Victoria BA,  Psychology University of Victoria BA,  Psychology University of Victoria BA,  Psychology York University MA, PhD,  Clinical Psychology York University MA, PhD,  Clinical Psychology York University MA, PhD,  Clinical Psychology Honors & Awards Fellow of the International Society for the Study of Trauma and Dissociation International Society for the Study of Trauma and Dissociation Fellow of the International Society for the Study of Trauma and Dissociation International Society for the Study of Trauma and Dissociation Fellow of the International Society for the Study of Trauma and Dissociation International Society for the Study of Trauma and Dissociation Fellow of the International Society for the Study of Trauma and Dissociation International Society for the Study of Trauma and Dissociation "]}