{"position": "Social Science Research Assistant", "company": "Stanford University", "profiles": ["Experience Social Science Research Assistant Stanford University January 2014  – Present (1 year 8 months) Social Science Research Assistant Stanford University January 2014  – Present (1 year 8 months) Social Science Research Assistant Stanford University January 2014  – Present (1 year 8 months) Skills Skills     Education UCSC Bachelor of Arts (B.A.),  Psychology 2011  – 2013 UCSC Bachelor of Arts (B.A.),  Psychology 2011  – 2013 UCSC Bachelor of Arts (B.A.),  Psychology 2011  – 2013 UCSC Bachelor of Arts (B.A.),  Psychology 2011  – 2013 ", "Experience Social Science Research Assistant Stanford University June 2004  –  July 2011  (7 years 2 months) Social Science Research Assistant Stanford University June 2004  –  July 2011  (7 years 2 months) Social Science Research Assistant Stanford University June 2004  –  July 2011  (7 years 2 months) Education MCP Hahnemann 2000  – 2002 MCP Hahnemann 2000  – 2002 MCP Hahnemann 2000  – 2002 MCP Hahnemann 2000  – 2002 ", "Experience Social Science Research Assistant Stanford University July 2013  – Present (2 years 2 months) Palo Alto, CA Server and Host 43 North February 2013  –  June 2013  (5 months) Madison, Wisconsin Manager Devine Prejudice and Intergroup Relations Lab January 2012  –  May 2013  (1 year 5 months) University of Wisconsin-Madison Research Assistant Culture and Cognition Lab September 2010  –  May 2013  (2 years 9 months) University of Wisconsin-Madison Server Sunroom Cafe April 2011  –  February 2013  (1 year 11 months) Madison, Wisconsin Research Assistant Devine Prejudice and Intergroup Relations Lab May 2012  –  December 2012  (8 months) University of Wisconsin-Madison Social Science Research Assistant Stanford University July 2013  – Present (2 years 2 months) Palo Alto, CA Social Science Research Assistant Stanford University July 2013  – Present (2 years 2 months) Palo Alto, CA Server and Host 43 North February 2013  –  June 2013  (5 months) Madison, Wisconsin Server and Host 43 North February 2013  –  June 2013  (5 months) Madison, Wisconsin Manager Devine Prejudice and Intergroup Relations Lab January 2012  –  May 2013  (1 year 5 months) University of Wisconsin-Madison Manager Devine Prejudice and Intergroup Relations Lab January 2012  –  May 2013  (1 year 5 months) University of Wisconsin-Madison Research Assistant Culture and Cognition Lab September 2010  –  May 2013  (2 years 9 months) University of Wisconsin-Madison Research Assistant Culture and Cognition Lab September 2010  –  May 2013  (2 years 9 months) University of Wisconsin-Madison Server Sunroom Cafe April 2011  –  February 2013  (1 year 11 months) Madison, Wisconsin Server Sunroom Cafe April 2011  –  February 2013  (1 year 11 months) Madison, Wisconsin Research Assistant Devine Prejudice and Intergroup Relations Lab May 2012  –  December 2012  (8 months) University of Wisconsin-Madison Research Assistant Devine Prejudice and Intergroup Relations Lab May 2012  –  December 2012  (8 months) University of Wisconsin-Madison Skills Experimental Design SPSS Statistics Psychology Research Design Qualitative Research Data Analysis Science Scientific Writing Literature Reviews Skills  Experimental Design SPSS Statistics Psychology Research Design Qualitative Research Data Analysis Science Scientific Writing Literature Reviews Experimental Design SPSS Statistics Psychology Research Design Qualitative Research Data Analysis Science Scientific Writing Literature Reviews Experimental Design SPSS Statistics Psychology Research Design Qualitative Research Data Analysis Science Scientific Writing Literature Reviews Education University of Wisconsin-Madison Bachelor of Science (B.S.),  Psychology 2009  – 2013 Activities and Societies:  Psi Chi University of Wisconsin-Madison Bachelor of Science (B.S.),  Psychology 2009  – 2013 Activities and Societies:  Psi Chi University of Wisconsin-Madison Bachelor of Science (B.S.),  Psychology 2009  – 2013 Activities and Societies:  Psi Chi University of Wisconsin-Madison Bachelor of Science (B.S.),  Psychology 2009  – 2013 Activities and Societies:  Psi Chi ", "Experience Social Science Research Assistant Stanford University June 2014  – Present (1 year 3 months) Peer Tutor for Physics Electricity and Magnetism Academic Resource Center January 2014  –  June 2014  (6 months) Williamstown, MA Met with students individually to explain concepts and help with homework, studying, and lab work. Honors Thesis Williams College Department of Neuroscience August 2013  –  June 2014  (11 months) Williamstown, MA Worked with Professor Noah Sandstrom to examine the protective effects of progesterone on repetitive Closed Head Injury in mice using a weight drop model. Tested spatial learning and memory using the Morris Water Maze, motor activity with the rotarod test, and depressive symptoms with the Sucrose Preference Test. Immunohistochemistry to stain for microglia with Iba1. Performed ovariectomy surgeries to remove endogenous circulating hormones and perfusions to fix the brain tissue prior to staining. Tutor for Inorganic and Physical Chemistry Math and Science Resource Center September 2011  –  June 2014  (2 years 10 months) Williamstown, MA Available for four hours each week to explain concepts and help with studying, homework, and lab work. Cellist Berkshire Symphony September 2010  –  June 2014  (3 years 10 months) Williamstown, MA 75 member orchestra comprised of students, Williams music faculty, and musicians from regional orchestras. Presents four concerts each season. Peer Tutor for Neuroscience Academic Resource Center September 2013  –  December 2013  (4 months) Williamstown, MA Met with students individually to explain concepts and help with studying, homework, and lab work. Physical Chemistry Laboratory Teacher's Assistant Williams College Department of Chemistry January 2013  –  June 2013  (6 months) Williamstown, MA Assisted in preparing, evaluating, and conducting the laboratory sessions. Met with students to answer questions about pre-laboratory assignments or reports. Intern Brien Center September 2012  –  June 2013  (10 months) Pittsfield, Massachusetts Area Interacted with patients recovering from Schizophrenia, Bipolar Disorder, Depression, and alcoholism. Led support groups, arts and craft groups, and poetry groups. Helped prepare and serve food to members. Summer Intern Stanford University Department of Neurology June 2011  –  August 2011  (3 months) Stanford, CA Examined the effect of Wii Fitness Training on Postural Imbalance in Parkinson's Disease. Trained a Parkinson's Disease patient on the Wii Fit twice a week to determine whether training had beneficial effects on his walking and postural stability. Computerized dynamic posturography was used to evaluate balance with the Sensory Organization test and Limits of Stability Test. Tracked patient's mood before and after the sessions over the ten weeks. Research Assistant Williams College Department of Chemistry January 2011  –  June 2011  (6 months) Williamstown, MA Analyzed the levels of polychlorinated biphenyls (PCBs) in the Hoosic river that leaked from the Sprague Electric Company between the 1950s and 1970s. Tested samples of crayfish and river sediment using gas chromatography/mass spectrometry in order to determine the extent to which the river is recovering from the contamination. Social Science Research Assistant Stanford University June 2014  – Present (1 year 3 months) Social Science Research Assistant Stanford University June 2014  – Present (1 year 3 months) Peer Tutor for Physics Electricity and Magnetism Academic Resource Center January 2014  –  June 2014  (6 months) Williamstown, MA Met with students individually to explain concepts and help with homework, studying, and lab work. Peer Tutor for Physics Electricity and Magnetism Academic Resource Center January 2014  –  June 2014  (6 months) Williamstown, MA Met with students individually to explain concepts and help with homework, studying, and lab work. Honors Thesis Williams College Department of Neuroscience August 2013  –  June 2014  (11 months) Williamstown, MA Worked with Professor Noah Sandstrom to examine the protective effects of progesterone on repetitive Closed Head Injury in mice using a weight drop model. Tested spatial learning and memory using the Morris Water Maze, motor activity with the rotarod test, and depressive symptoms with the Sucrose Preference Test. Immunohistochemistry to stain for microglia with Iba1. Performed ovariectomy surgeries to remove endogenous circulating hormones and perfusions to fix the brain tissue prior to staining. Honors Thesis Williams College Department of Neuroscience August 2013  –  June 2014  (11 months) Williamstown, MA Worked with Professor Noah Sandstrom to examine the protective effects of progesterone on repetitive Closed Head Injury in mice using a weight drop model. Tested spatial learning and memory using the Morris Water Maze, motor activity with the rotarod test, and depressive symptoms with the Sucrose Preference Test. Immunohistochemistry to stain for microglia with Iba1. Performed ovariectomy surgeries to remove endogenous circulating hormones and perfusions to fix the brain tissue prior to staining. Tutor for Inorganic and Physical Chemistry Math and Science Resource Center September 2011  –  June 2014  (2 years 10 months) Williamstown, MA Available for four hours each week to explain concepts and help with studying, homework, and lab work. Tutor for Inorganic and Physical Chemistry Math and Science Resource Center September 2011  –  June 2014  (2 years 10 months) Williamstown, MA Available for four hours each week to explain concepts and help with studying, homework, and lab work. Cellist Berkshire Symphony September 2010  –  June 2014  (3 years 10 months) Williamstown, MA 75 member orchestra comprised of students, Williams music faculty, and musicians from regional orchestras. Presents four concerts each season. Cellist Berkshire Symphony September 2010  –  June 2014  (3 years 10 months) Williamstown, MA 75 member orchestra comprised of students, Williams music faculty, and musicians from regional orchestras. Presents four concerts each season. Peer Tutor for Neuroscience Academic Resource Center September 2013  –  December 2013  (4 months) Williamstown, MA Met with students individually to explain concepts and help with studying, homework, and lab work. Peer Tutor for Neuroscience Academic Resource Center September 2013  –  December 2013  (4 months) Williamstown, MA Met with students individually to explain concepts and help with studying, homework, and lab work. Physical Chemistry Laboratory Teacher's Assistant Williams College Department of Chemistry January 2013  –  June 2013  (6 months) Williamstown, MA Assisted in preparing, evaluating, and conducting the laboratory sessions. Met with students to answer questions about pre-laboratory assignments or reports. Physical Chemistry Laboratory Teacher's Assistant Williams College Department of Chemistry January 2013  –  June 2013  (6 months) Williamstown, MA Assisted in preparing, evaluating, and conducting the laboratory sessions. Met with students to answer questions about pre-laboratory assignments or reports. Intern Brien Center September 2012  –  June 2013  (10 months) Pittsfield, Massachusetts Area Interacted with patients recovering from Schizophrenia, Bipolar Disorder, Depression, and alcoholism. Led support groups, arts and craft groups, and poetry groups. Helped prepare and serve food to members. Intern Brien Center September 2012  –  June 2013  (10 months) Pittsfield, Massachusetts Area Interacted with patients recovering from Schizophrenia, Bipolar Disorder, Depression, and alcoholism. Led support groups, arts and craft groups, and poetry groups. Helped prepare and serve food to members. Summer Intern Stanford University Department of Neurology June 2011  –  August 2011  (3 months) Stanford, CA Examined the effect of Wii Fitness Training on Postural Imbalance in Parkinson's Disease. Trained a Parkinson's Disease patient on the Wii Fit twice a week to determine whether training had beneficial effects on his walking and postural stability. Computerized dynamic posturography was used to evaluate balance with the Sensory Organization test and Limits of Stability Test. Tracked patient's mood before and after the sessions over the ten weeks. Summer Intern Stanford University Department of Neurology June 2011  –  August 2011  (3 months) Stanford, CA Examined the effect of Wii Fitness Training on Postural Imbalance in Parkinson's Disease. Trained a Parkinson's Disease patient on the Wii Fit twice a week to determine whether training had beneficial effects on his walking and postural stability. Computerized dynamic posturography was used to evaluate balance with the Sensory Organization test and Limits of Stability Test. Tracked patient's mood before and after the sessions over the ten weeks. Research Assistant Williams College Department of Chemistry January 2011  –  June 2011  (6 months) Williamstown, MA Analyzed the levels of polychlorinated biphenyls (PCBs) in the Hoosic river that leaked from the Sprague Electric Company between the 1950s and 1970s. Tested samples of crayfish and river sediment using gas chromatography/mass spectrometry in order to determine the extent to which the river is recovering from the contamination. Research Assistant Williams College Department of Chemistry January 2011  –  June 2011  (6 months) Williamstown, MA Analyzed the levels of polychlorinated biphenyls (PCBs) in the Hoosic river that leaked from the Sprague Electric Company between the 1950s and 1970s. Tested samples of crayfish and river sediment using gas chromatography/mass spectrometry in order to determine the extent to which the river is recovering from the contamination. Skills Laboratory Microsoft Word PowerPoint Research Microsoft Office Public Speaking Microsoft Excel Editing Data Analysis Community Outreach Skills  Laboratory Microsoft Word PowerPoint Research Microsoft Office Public Speaking Microsoft Excel Editing Data Analysis Community Outreach Laboratory Microsoft Word PowerPoint Research Microsoft Office Public Speaking Microsoft Excel Editing Data Analysis Community Outreach Laboratory Microsoft Word PowerPoint Research Microsoft Office Public Speaking Microsoft Excel Editing Data Analysis Community Outreach Education Williams College Bachelor's Degree,  Biology ,  Psychology ,  Highest Honors in Neuroscience 2010  – 2014 Magna Cum Laude Activities and Societies:  Phi Beta Kappa ,  Sigma Xi Castilleja School High School 2007  – 2010 San Francisco Conservatory of Music Preparatory Student, Cello 2007  – 2010 Williams College Bachelor's Degree,  Biology ,  Psychology ,  Highest Honors in Neuroscience 2010  – 2014 Magna Cum Laude Activities and Societies:  Phi Beta Kappa ,  Sigma Xi Williams College Bachelor's Degree,  Biology ,  Psychology ,  Highest Honors in Neuroscience 2010  – 2014 Magna Cum Laude Activities and Societies:  Phi Beta Kappa ,  Sigma Xi Williams College Bachelor's Degree,  Biology ,  Psychology ,  Highest Honors in Neuroscience 2010  – 2014 Magna Cum Laude Activities and Societies:  Phi Beta Kappa ,  Sigma Xi Castilleja School High School 2007  – 2010 Castilleja School High School 2007  – 2010 Castilleja School High School 2007  – 2010 San Francisco Conservatory of Music Preparatory Student, Cello 2007  – 2010 San Francisco Conservatory of Music Preparatory Student, Cello 2007  – 2010 San Francisco Conservatory of Music Preparatory Student, Cello 2007  – 2010 Honors & Awards Phi Beta Kappa June 2014 The Erastus C. Benedict, Class of 1821 Prize in Biology: First Prize Williams College Department of Biology June 2014 Endowed by a fund given by Erastus C. Benedict, Class of 1821, once an instructor at the College. Patricia Goldman-Rakic Prize in Neuroscience Williams College Department of Neuroscience June 2014 Member of the Class of 1960 Scholar program for Biochemistry and Molecular Biology Member of the Class of 1960 Scholar Program for Psychology Irene and Eric Brain Research Foundation Yin-Ming Huang and General Jian Gao Fellowship Irene and Eric Brain Research Foundation June 2014 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2011 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2013 Sigma Xi Grant-in -Aid of Research Sigma Xi, The Scientific Research Society June 2013 Phi Beta Kappa June 2014 Phi Beta Kappa June 2014 Phi Beta Kappa June 2014 The Erastus C. Benedict, Class of 1821 Prize in Biology: First Prize Williams College Department of Biology June 2014 Endowed by a fund given by Erastus C. Benedict, Class of 1821, once an instructor at the College. The Erastus C. Benedict, Class of 1821 Prize in Biology: First Prize Williams College Department of Biology June 2014 Endowed by a fund given by Erastus C. Benedict, Class of 1821, once an instructor at the College. The Erastus C. Benedict, Class of 1821 Prize in Biology: First Prize Williams College Department of Biology June 2014 Endowed by a fund given by Erastus C. Benedict, Class of 1821, once an instructor at the College. Patricia Goldman-Rakic Prize in Neuroscience Williams College Department of Neuroscience June 2014 Patricia Goldman-Rakic Prize in Neuroscience Williams College Department of Neuroscience June 2014 Patricia Goldman-Rakic Prize in Neuroscience Williams College Department of Neuroscience June 2014 Member of the Class of 1960 Scholar program for Biochemistry and Molecular Biology Member of the Class of 1960 Scholar program for Biochemistry and Molecular Biology Member of the Class of 1960 Scholar program for Biochemistry and Molecular Biology Member of the Class of 1960 Scholar Program for Psychology Member of the Class of 1960 Scholar Program for Psychology Member of the Class of 1960 Scholar Program for Psychology Irene and Eric Brain Research Foundation Yin-Ming Huang and General Jian Gao Fellowship Irene and Eric Brain Research Foundation June 2014 Irene and Eric Brain Research Foundation Yin-Ming Huang and General Jian Gao Fellowship Irene and Eric Brain Research Foundation June 2014 Irene and Eric Brain Research Foundation Yin-Ming Huang and General Jian Gao Fellowship Irene and Eric Brain Research Foundation June 2014 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2011 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2011 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2011 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2013 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2013 Parkinson's Disease Summer Student Fellowship Parkinson's Disease Foundation June 2013 Sigma Xi Grant-in -Aid of Research Sigma Xi, The Scientific Research Society June 2013 Sigma Xi Grant-in -Aid of Research Sigma Xi, The Scientific Research Society June 2013 Sigma Xi Grant-in -Aid of Research Sigma Xi, The Scientific Research Society June 2013 ", "Experience Internship: Social Science Research Assistant Stanford University October 2013  – Present (1 year 11 months) Technology and Branding Advisor Quickslide Ltd June 2009  – Present (6 years 3 months) Huddersfield, United Kingdom Founder Barob Creative Branding June 2011  –  June 2014  (3 years 1 month) York, United Kingdom Modern company branding and rebranding, from national companies to startups. Barob offers the full solution from design to host/print. Specialist Apple Retail September 2010  –  August 2011  (1 year) Internship: Social Science Research Assistant Stanford University October 2013  – Present (1 year 11 months) Internship: Social Science Research Assistant Stanford University October 2013  – Present (1 year 11 months) Technology and Branding Advisor Quickslide Ltd June 2009  – Present (6 years 3 months) Huddersfield, United Kingdom Technology and Branding Advisor Quickslide Ltd June 2009  – Present (6 years 3 months) Huddersfield, United Kingdom Founder Barob Creative Branding June 2011  –  June 2014  (3 years 1 month) York, United Kingdom Modern company branding and rebranding, from national companies to startups. Barob offers the full solution from design to host/print. Founder Barob Creative Branding June 2011  –  June 2014  (3 years 1 month) York, United Kingdom Modern company branding and rebranding, from national companies to startups. Barob offers the full solution from design to host/print. Specialist Apple Retail September 2010  –  August 2011  (1 year) Specialist Apple Retail September 2010  –  August 2011  (1 year) Skills Entrepreneurship Company Branding Computer Repair Mac OS Web Design Corporate Branding Web Development Skills  Entrepreneurship Company Branding Computer Repair Mac OS Web Design Corporate Branding Web Development Entrepreneurship Company Branding Computer Repair Mac OS Web Design Corporate Branding Web Development Entrepreneurship Company Branding Computer Repair Mac OS Web Design Corporate Branding Web Development Education Foothill College 2013  – 2015 Foothill College 2013  – 2015 Foothill College 2013  – 2015 Foothill College 2013  – 2015 ", "Experience Social Science Research Assistant Stanford University School of Medicine May 2014  – Present (1 year 4 months) Health Educator Nutrition Educator Samaritan House Free Clinic February 2014  – Present (1 year 7 months) Social Science Research Assistant Stanford University School of Medicine May 2014  – Present (1 year 4 months) Health Educator Social Science Research Assistant Stanford University School of Medicine May 2014  – Present (1 year 4 months) Health Educator Nutrition Educator Samaritan House Free Clinic February 2014  – Present (1 year 7 months) Nutrition Educator Samaritan House Free Clinic February 2014  – Present (1 year 7 months) Languages Spanish Spanish Spanish Skills Critical Thinking Microsoft Office Data Entry Outlook Access Spanish Creative Writing Community Outreach Fundraising InDesign Microsoft Excel PowerPoint Motivational... Nutrition Health Education Health Promotion Healthcare Program Development Clinical Research Program Evaluation See 5+     See less Skills  Critical Thinking Microsoft Office Data Entry Outlook Access Spanish Creative Writing Community Outreach Fundraising InDesign Microsoft Excel PowerPoint Motivational... Nutrition Health Education Health Promotion Healthcare Program Development Clinical Research Program Evaluation See 5+     See less Critical Thinking Microsoft Office Data Entry Outlook Access Spanish Creative Writing Community Outreach Fundraising InDesign Microsoft Excel PowerPoint Motivational... Nutrition Health Education Health Promotion Healthcare Program Development Clinical Research Program Evaluation See 5+     See less Critical Thinking Microsoft Office Data Entry Outlook Access Spanish Creative Writing Community Outreach Fundraising InDesign Microsoft Excel PowerPoint Motivational... Nutrition Health Education Health Promotion Healthcare Program Development Clinical Research Program Evaluation See 5+     See less Education San Jose State University Bachelor of Science (BS),  Nutritional Science 2011  – 2014 Los Angeles Mission College 2008  – 2010 CSUN 2005  – 2005 San Jose State University Bachelor of Science (BS),  Nutritional Science 2011  – 2014 San Jose State University Bachelor of Science (BS),  Nutritional Science 2011  – 2014 San Jose State University Bachelor of Science (BS),  Nutritional Science 2011  – 2014 Los Angeles Mission College 2008  – 2010 Los Angeles Mission College 2008  – 2010 Los Angeles Mission College 2008  – 2010 CSUN 2005  – 2005 CSUN 2005  – 2005 CSUN 2005  – 2005 ", "Experience Director, Corporate and Securities Palo Alto Networks, Inc. August 2015  – Present (1 month) Santa Clara, California Associate General Counsel, Finance & Governance Levi Strauss & Co. April 2013  –  July 2015  (2 years 4 months) San Francisco Bay Area Senior Corporate Associate Sidley Austin April 2010  –  April 2013  (3 years 1 month) Palo Alto and San Francisco, California As a senior associate in the Palo Alto and San Francisco offices, my practice focus was in the areas of corporate and securities law, with special emphasis on securities compliance and offerings, mergers and acquisitions, and corporate governance. Represented issuers and underwriters in a variety of securities offerings, including initial public offerings, and registered and 144A debt offerings. Advised public companies on corporate governance, disclosure and other SEC compliance issues, including those related to the Securities Act of 1933, the Securities Exchange Act of 1934, the Sarbanes-Oxley Act of 2002, Dodd-Frank Wall Street Reform and Consumer Protection Act, and NYSE and Nasdaq rules and regulations, as well as ISS and Glass Lewis proxy advisory firm matters, stockholder proposals and governance best practices. Advised companies in all stages of development in a number of sectors including, gaming, property information and analytics, healthcare, technology, ecommerce, mobile communications and media device, software, entertainment, and networking solutions. Corporate Associate Morrison & Foerster October 2006  –  April 2010  (3 years 7 months) Palo Alto and San Francisco, California As an associate in the Corporate Department of Morrison & Foerster's Palo Alto and San Francisco offices, practice focused on corporate transactions and securities law matters, including private financings, mergers and acquisitions, public debt and equity offerings, securities compliance, public company reporting, and corporate governance. Represented and counseled a broad range of public and emerging growth technology companies in various sectors, including optical networking, data storage, internet, semiconductor, biotechnology, clean technology, software and internet infrastructure. Also, represented venture capital firms. Summer Asssociate Morrison & Foerster LLP May 2005  –  August 2005  (4 months) Palo Alto, California Performed legal research and drafted legal memorandum on corporate and securities matters. Assisted attorneys with legal due diligence for mergers and acquisitions and venture capital financings. Public Interest Extern for Legal Office California Department of Education January 2005  –  May 2005  (5 months) Sacramento, California Area Drafted motions to quash, internal legal memoranda and Department of Education policy guidelines related to responding to requests for public records. Mooted and prepared staff attorneys for hearings. Judicial Extern for Chief Magistrate Maria Elena James U.S. District Court May 2004  –  August 2004  (4 months) Drafted judicial orders and internal legal memoranda.Performed research and provided legal analysis for preliminary hearings and settlement conferences.Shadowed judge during settlement conferences. Social Science Research Assistant Stanford University School of Education 2000  –  2003  (3 years) Principal research assistant for heritage language research funded by a Spencer Foundation Grant. Collected data through interviews, observations, mail surveys, and internet searches. Designed and maintained databases for statistical analysis of qualitative and quantitative data. Supervised/trained 6 undergraduate and 2 graduate research assistants. Co-wrote yearly reports, articles and book. Director, Corporate and Securities Palo Alto Networks, Inc. August 2015  – Present (1 month) Santa Clara, California Director, Corporate and Securities Palo Alto Networks, Inc. August 2015  – Present (1 month) Santa Clara, California Associate General Counsel, Finance & Governance Levi Strauss & Co. April 2013  –  July 2015  (2 years 4 months) San Francisco Bay Area Associate General Counsel, Finance & Governance Levi Strauss & Co. April 2013  –  July 2015  (2 years 4 months) San Francisco Bay Area Senior Corporate Associate Sidley Austin April 2010  –  April 2013  (3 years 1 month) Palo Alto and San Francisco, California As a senior associate in the Palo Alto and San Francisco offices, my practice focus was in the areas of corporate and securities law, with special emphasis on securities compliance and offerings, mergers and acquisitions, and corporate governance. Represented issuers and underwriters in a variety of securities offerings, including initial public offerings, and registered and 144A debt offerings. Advised public companies on corporate governance, disclosure and other SEC compliance issues, including those related to the Securities Act of 1933, the Securities Exchange Act of 1934, the Sarbanes-Oxley Act of 2002, Dodd-Frank Wall Street Reform and Consumer Protection Act, and NYSE and Nasdaq rules and regulations, as well as ISS and Glass Lewis proxy advisory firm matters, stockholder proposals and governance best practices. Advised companies in all stages of development in a number of sectors including, gaming, property information and analytics, healthcare, technology, ecommerce, mobile communications and media device, software, entertainment, and networking solutions. Senior Corporate Associate Sidley Austin April 2010  –  April 2013  (3 years 1 month) Palo Alto and San Francisco, California As a senior associate in the Palo Alto and San Francisco offices, my practice focus was in the areas of corporate and securities law, with special emphasis on securities compliance and offerings, mergers and acquisitions, and corporate governance. Represented issuers and underwriters in a variety of securities offerings, including initial public offerings, and registered and 144A debt offerings. Advised public companies on corporate governance, disclosure and other SEC compliance issues, including those related to the Securities Act of 1933, the Securities Exchange Act of 1934, the Sarbanes-Oxley Act of 2002, Dodd-Frank Wall Street Reform and Consumer Protection Act, and NYSE and Nasdaq rules and regulations, as well as ISS and Glass Lewis proxy advisory firm matters, stockholder proposals and governance best practices. Advised companies in all stages of development in a number of sectors including, gaming, property information and analytics, healthcare, technology, ecommerce, mobile communications and media device, software, entertainment, and networking solutions. Corporate Associate Morrison & Foerster October 2006  –  April 2010  (3 years 7 months) Palo Alto and San Francisco, California As an associate in the Corporate Department of Morrison & Foerster's Palo Alto and San Francisco offices, practice focused on corporate transactions and securities law matters, including private financings, mergers and acquisitions, public debt and equity offerings, securities compliance, public company reporting, and corporate governance. Represented and counseled a broad range of public and emerging growth technology companies in various sectors, including optical networking, data storage, internet, semiconductor, biotechnology, clean technology, software and internet infrastructure. Also, represented venture capital firms. Corporate Associate Morrison & Foerster October 2006  –  April 2010  (3 years 7 months) Palo Alto and San Francisco, California As an associate in the Corporate Department of Morrison & Foerster's Palo Alto and San Francisco offices, practice focused on corporate transactions and securities law matters, including private financings, mergers and acquisitions, public debt and equity offerings, securities compliance, public company reporting, and corporate governance. Represented and counseled a broad range of public and emerging growth technology companies in various sectors, including optical networking, data storage, internet, semiconductor, biotechnology, clean technology, software and internet infrastructure. Also, represented venture capital firms. Summer Asssociate Morrison & Foerster LLP May 2005  –  August 2005  (4 months) Palo Alto, California Performed legal research and drafted legal memorandum on corporate and securities matters. Assisted attorneys with legal due diligence for mergers and acquisitions and venture capital financings. Summer Asssociate Morrison & Foerster LLP May 2005  –  August 2005  (4 months) Palo Alto, California Performed legal research and drafted legal memorandum on corporate and securities matters. Assisted attorneys with legal due diligence for mergers and acquisitions and venture capital financings. Public Interest Extern for Legal Office California Department of Education January 2005  –  May 2005  (5 months) Sacramento, California Area Drafted motions to quash, internal legal memoranda and Department of Education policy guidelines related to responding to requests for public records. Mooted and prepared staff attorneys for hearings. Public Interest Extern for Legal Office California Department of Education January 2005  –  May 2005  (5 months) Sacramento, California Area Drafted motions to quash, internal legal memoranda and Department of Education policy guidelines related to responding to requests for public records. Mooted and prepared staff attorneys for hearings. Judicial Extern for Chief Magistrate Maria Elena James U.S. District Court May 2004  –  August 2004  (4 months) Drafted judicial orders and internal legal memoranda.Performed research and provided legal analysis for preliminary hearings and settlement conferences.Shadowed judge during settlement conferences. Judicial Extern for Chief Magistrate Maria Elena James U.S. District Court May 2004  –  August 2004  (4 months) Drafted judicial orders and internal legal memoranda.Performed research and provided legal analysis for preliminary hearings and settlement conferences.Shadowed judge during settlement conferences. Social Science Research Assistant Stanford University School of Education 2000  –  2003  (3 years) Principal research assistant for heritage language research funded by a Spencer Foundation Grant. Collected data through interviews, observations, mail surveys, and internet searches. Designed and maintained databases for statistical analysis of qualitative and quantitative data. Supervised/trained 6 undergraduate and 2 graduate research assistants. Co-wrote yearly reports, articles and book. Social Science Research Assistant Stanford University School of Education 2000  –  2003  (3 years) Principal research assistant for heritage language research funded by a Spencer Foundation Grant. Collected data through interviews, observations, mail surveys, and internet searches. Designed and maintained databases for statistical analysis of qualitative and quantitative data. Supervised/trained 6 undergraduate and 2 graduate research assistants. Co-wrote yearly reports, articles and book. Skills Intellectual Property Corporate Law Corporate Governance Venture Capital Mergers Securities Regulation Mergers & Acquisitions Licensing Legal Advice Legal Research Securities Legal Writing Due Diligence Joint Ventures Skills  Intellectual Property Corporate Law Corporate Governance Venture Capital Mergers Securities Regulation Mergers & Acquisitions Licensing Legal Advice Legal Research Securities Legal Writing Due Diligence Joint Ventures Intellectual Property Corporate Law Corporate Governance Venture Capital Mergers Securities Regulation Mergers & Acquisitions Licensing Legal Advice Legal Research Securities Legal Writing Due Diligence Joint Ventures Intellectual Property Corporate Law Corporate Governance Venture Capital Mergers Securities Regulation Mergers & Acquisitions Licensing Legal Advice Legal Research Securities Legal Writing Due Diligence Joint Ventures Education University of California, Davis - School of Law J.D.,  Law 2003  – 2006 Stanford University M.A.,  Education 1999  – 2000 Stanford University B.A.,  Latin American Studies ,  Spanish 1995  – 1999 University of California, Davis - School of Law J.D.,  Law 2003  – 2006 University of California, Davis - School of Law J.D.,  Law 2003  – 2006 University of California, Davis - School of Law J.D.,  Law 2003  – 2006 Stanford University M.A.,  Education 1999  – 2000 Stanford University M.A.,  Education 1999  – 2000 Stanford University M.A.,  Education 1999  – 2000 Stanford University B.A.,  Latin American Studies ,  Spanish 1995  – 1999 Stanford University B.A.,  Latin American Studies ,  Spanish 1995  – 1999 Stanford University B.A.,  Latin American Studies ,  Spanish 1995  – 1999 ", "", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Biopharmaceuticals Clinical Development Clinical Research Clinical Trials FDA Healthcare Infectious Diseases Neurology Oncology Pain Management Pharmaceutics Protocol Regulatory Requirements Medical Devices Drug Development Biotechnology SOP GCP Pharmaceutical Industry CRO Medical Writing See 6+     See less Skills  Biopharmaceuticals Clinical Development Clinical Research Clinical Trials FDA Healthcare Infectious Diseases Neurology Oncology Pain Management Pharmaceutics Protocol Regulatory Requirements Medical Devices Drug Development Biotechnology SOP GCP Pharmaceutical Industry CRO Medical Writing See 6+     See less Biopharmaceuticals Clinical Development Clinical Research Clinical Trials FDA Healthcare Infectious Diseases Neurology Oncology Pain Management Pharmaceutics Protocol Regulatory Requirements Medical Devices Drug Development Biotechnology SOP GCP Pharmaceutical Industry CRO Medical Writing See 6+     See less Biopharmaceuticals Clinical Development Clinical Research Clinical Trials FDA Healthcare Infectious Diseases Neurology Oncology Pain Management Pharmaceutics Protocol Regulatory Requirements Medical Devices Drug Development Biotechnology SOP GCP Pharmaceutical Industry CRO Medical Writing See 6+     See less Honors & Awards ", "Experience Social Science Research Assistant Stanford University August 2013  – Present (2 years 1 month) Stanford Hospital and Clinics Data analysis from intra-/post-operative research on Parkinsons' disease patients. Signal processing of local field potential and kinematic data using MATLAB and Spike. Writing research articles and grant proposals. Neurological Surgery Lab Assistant UC Davis December 2012  –  June 2013  (7 months) UC Davis School of Medicine Neurosciences Research on traumatic brain injury using rat model. Perform sectioning of rat brains and immunostaining of tissue for histological analysis. Psychology Research Assistant UC Davis January 2012  –  June 2013  (1 year 6 months) UC Davis Center for Mind and Brain Studied the anatomical regions that correlate with performance in different aspects of attention. Utilized voxel-based morphometry (VBM) to quantify gray matter volume from MRI scan images. Senior thesis project on pupil as indicator of activity in LC-NE system. Use IR eye tracking camera to measure pupil size. Designed experimental task using Presentation software. Analyze data using MATLAB. Summer Undergraduate Research Assistant Stanford University June 2011  –  December 2011  (7 months) Center for Interdisciplinary Brain Sciences Research Research concerned childhood developmental disorders. Administered psychometric examinations to child subjects. Analyzed fMRI data using statistical software (MATLAB, Image J). Managed database containing examinations and patient information. Interacted extensively with patients and parents during hospital visits. Plant Pathology Research Assistant UC Davis April 2011  –  December 2011  (9 months) UC Davis Department of Plant Pathology Aided in set-up of various resin experiments on Monterey pines: created spore dilutions for inoculating specimens. Performed gel electrophoresis, PCR, and DNA purification. Social Science Research Assistant Stanford University August 2013  – Present (2 years 1 month) Stanford Hospital and Clinics Data analysis from intra-/post-operative research on Parkinsons' disease patients. Signal processing of local field potential and kinematic data using MATLAB and Spike. Writing research articles and grant proposals. Social Science Research Assistant Stanford University August 2013  – Present (2 years 1 month) Stanford Hospital and Clinics Data analysis from intra-/post-operative research on Parkinsons' disease patients. Signal processing of local field potential and kinematic data using MATLAB and Spike. Writing research articles and grant proposals. Neurological Surgery Lab Assistant UC Davis December 2012  –  June 2013  (7 months) UC Davis School of Medicine Neurosciences Research on traumatic brain injury using rat model. Perform sectioning of rat brains and immunostaining of tissue for histological analysis. Neurological Surgery Lab Assistant UC Davis December 2012  –  June 2013  (7 months) UC Davis School of Medicine Neurosciences Research on traumatic brain injury using rat model. Perform sectioning of rat brains and immunostaining of tissue for histological analysis. Psychology Research Assistant UC Davis January 2012  –  June 2013  (1 year 6 months) UC Davis Center for Mind and Brain Studied the anatomical regions that correlate with performance in different aspects of attention. Utilized voxel-based morphometry (VBM) to quantify gray matter volume from MRI scan images. Senior thesis project on pupil as indicator of activity in LC-NE system. Use IR eye tracking camera to measure pupil size. Designed experimental task using Presentation software. Analyze data using MATLAB. Psychology Research Assistant UC Davis January 2012  –  June 2013  (1 year 6 months) UC Davis Center for Mind and Brain Studied the anatomical regions that correlate with performance in different aspects of attention. Utilized voxel-based morphometry (VBM) to quantify gray matter volume from MRI scan images. Senior thesis project on pupil as indicator of activity in LC-NE system. Use IR eye tracking camera to measure pupil size. Designed experimental task using Presentation software. Analyze data using MATLAB. Summer Undergraduate Research Assistant Stanford University June 2011  –  December 2011  (7 months) Center for Interdisciplinary Brain Sciences Research Research concerned childhood developmental disorders. Administered psychometric examinations to child subjects. Analyzed fMRI data using statistical software (MATLAB, Image J). Managed database containing examinations and patient information. Interacted extensively with patients and parents during hospital visits. Summer Undergraduate Research Assistant Stanford University June 2011  –  December 2011  (7 months) Center for Interdisciplinary Brain Sciences Research Research concerned childhood developmental disorders. Administered psychometric examinations to child subjects. Analyzed fMRI data using statistical software (MATLAB, Image J). Managed database containing examinations and patient information. Interacted extensively with patients and parents during hospital visits. Plant Pathology Research Assistant UC Davis April 2011  –  December 2011  (9 months) UC Davis Department of Plant Pathology Aided in set-up of various resin experiments on Monterey pines: created spore dilutions for inoculating specimens. Performed gel electrophoresis, PCR, and DNA purification. Plant Pathology Research Assistant UC Davis April 2011  –  December 2011  (9 months) UC Davis Department of Plant Pathology Aided in set-up of various resin experiments on Monterey pines: created spore dilutions for inoculating specimens. Performed gel electrophoresis, PCR, and DNA purification. Skills Experimental Design Microscopy Histology Immunostaining Scientific Writing Matlab Gel Electrophoresis PCR Laboratory Signal Processing Data Analysis Experimentation Skills  Experimental Design Microscopy Histology Immunostaining Scientific Writing Matlab Gel Electrophoresis PCR Laboratory Signal Processing Data Analysis Experimentation Experimental Design Microscopy Histology Immunostaining Scientific Writing Matlab Gel Electrophoresis PCR Laboratory Signal Processing Data Analysis Experimentation Experimental Design Microscopy Histology Immunostaining Scientific Writing Matlab Gel Electrophoresis PCR Laboratory Signal Processing Data Analysis Experimentation Education University of California, Davis Bachelor of Science (BS),  Neurobiology and Behavior 2009  – 2013 Activities and Societies:  Phi Beta Kappa ,  Davis Honors Challenge University of California, Davis Bachelor of Science (BS),  Neurobiology and Behavior 2009  – 2013 Activities and Societies:  Phi Beta Kappa ,  Davis Honors Challenge University of California, Davis Bachelor of Science (BS),  Neurobiology and Behavior 2009  – 2013 Activities and Societies:  Phi Beta Kappa ,  Davis Honors Challenge University of California, Davis Bachelor of Science (BS),  Neurobiology and Behavior 2009  – 2013 Activities and Societies:  Phi Beta Kappa ,  Davis Honors Challenge ", "Experience Social Science Research Assistant Stanford University April 2013  – Present (2 years 5 months) Çatalhöyük Research Project Coordinator and Administrator Research Assistant Baskent University February 2011  –  January 2013  (2 years) Translator and Coordinator of Foreign Affairs Turkish Fencing Federation September 2010  –  February 2011  (6 months) Site Assistant Catalhoyuk Research Project June 2010  –  September 2010  (4 months) Site Assistant Catalhoyuk Research Project June 2009  –  September 2009  (4 months) Catalhoyuk Research Project, Konya/TURKEY. Social Science Research Assistant Stanford University April 2013  – Present (2 years 5 months) Çatalhöyük Research Project Coordinator and Administrator Social Science Research Assistant Stanford University April 2013  – Present (2 years 5 months) Çatalhöyük Research Project Coordinator and Administrator Research Assistant Baskent University February 2011  –  January 2013  (2 years) Research Assistant Baskent University February 2011  –  January 2013  (2 years) Translator and Coordinator of Foreign Affairs Turkish Fencing Federation September 2010  –  February 2011  (6 months) Translator and Coordinator of Foreign Affairs Turkish Fencing Federation September 2010  –  February 2011  (6 months) Site Assistant Catalhoyuk Research Project June 2010  –  September 2010  (4 months) Site Assistant Catalhoyuk Research Project June 2010  –  September 2010  (4 months) Site Assistant Catalhoyuk Research Project June 2009  –  September 2009  (4 months) Catalhoyuk Research Project, Konya/TURKEY. Site Assistant Catalhoyuk Research Project June 2009  –  September 2009  (4 months) Catalhoyuk Research Project, Konya/TURKEY. Skills Higher Education Teaching Research Skills  Higher Education Teaching Research Higher Education Teaching Research Higher Education Teaching Research Education Orta Doğu Teknik Üniversitesi / Middle East Technical University Master of Arts (MA),  English Language and Literature/Letters 2010  – 2013 Orta Doğu Teknik Üniversitesi / Middle East Technical University Bachelor of Arts (BA),  Teaching English as a Second or Foreign Language/ESL Language Instructor 2005  – 2010 Pitzer College Exchange Student,  English and World Literatures 2008  – 2008 Orta Doğu Teknik Üniversitesi / Middle East Technical University Master of Arts (MA),  English Language and Literature/Letters 2010  – 2013 Orta Doğu Teknik Üniversitesi / Middle East Technical University Master of Arts (MA),  English Language and Literature/Letters 2010  – 2013 Orta Doğu Teknik Üniversitesi / Middle East Technical University Master of Arts (MA),  English Language and Literature/Letters 2010  – 2013 Orta Doğu Teknik Üniversitesi / Middle East Technical University Bachelor of Arts (BA),  Teaching English as a Second or Foreign Language/ESL Language Instructor 2005  – 2010 Orta Doğu Teknik Üniversitesi / Middle East Technical University Bachelor of Arts (BA),  Teaching English as a Second or Foreign Language/ESL Language Instructor 2005  – 2010 Orta Doğu Teknik Üniversitesi / Middle East Technical University Bachelor of Arts (BA),  Teaching English as a Second or Foreign Language/ESL Language Instructor 2005  – 2010 Pitzer College Exchange Student,  English and World Literatures 2008  – 2008 Pitzer College Exchange Student,  English and World Literatures 2008  – 2008 Pitzer College Exchange Student,  English and World Literatures 2008  – 2008 Honors & Awards Additional Honors & Awards 1st Place in the Nation-Wide University Entrance Exam in 2005, Foreign Languages. \n \nMiddle East Technical University Undergraduate Scholarship, including stipend, accommodation and \nbook allowance, 2005-2010. \n \nPitzer College Exchange Undergraduate Scholarship to Study in the Department of English and World \nLiteratures, covering travelling, accommodation and book allowance, January-May 2008. Additional Honors & Awards 1st Place in the Nation-Wide University Entrance Exam in 2005, Foreign Languages. \n \nMiddle East Technical University Undergraduate Scholarship, including stipend, accommodation and \nbook allowance, 2005-2010. \n \nPitzer College Exchange Undergraduate Scholarship to Study in the Department of English and World \nLiteratures, covering travelling, accommodation and book allowance, January-May 2008. Additional Honors & Awards 1st Place in the Nation-Wide University Entrance Exam in 2005, Foreign Languages. \n \nMiddle East Technical University Undergraduate Scholarship, including stipend, accommodation and \nbook allowance, 2005-2010. \n \nPitzer College Exchange Undergraduate Scholarship to Study in the Department of English and World \nLiteratures, covering travelling, accommodation and book allowance, January-May 2008. Additional Honors & Awards 1st Place in the Nation-Wide University Entrance Exam in 2005, Foreign Languages. \n \nMiddle East Technical University Undergraduate Scholarship, including stipend, accommodation and \nbook allowance, 2005-2010. \n \nPitzer College Exchange Undergraduate Scholarship to Study in the Department of English and World \nLiteratures, covering travelling, accommodation and book allowance, January-May 2008. ", "Summary Adventurous, TEFL-certified professional wanting to experience teaching English in South Korea! Summary Adventurous, TEFL-certified professional wanting to experience teaching English in South Korea! Adventurous, TEFL-certified professional wanting to experience teaching English in South Korea! Adventurous, TEFL-certified professional wanting to experience teaching English in South Korea! Experience Social Science Research Assistant Stanford University August 2013  –  April 2015  (1 year 9 months) Stanford Hospital •\tCoordinate clinical trials for Neuromuscular division with medical staff, pharmaceutical companies, surgical device manufacturers and collaborating academic institutions \n•\tPreparation of initial study documents for IRB submission (including amendments and renewals), completion of entire eProtocol application, regulatory documents, and planning for Site Initiation Visits \n•\tManage multiple studies simultaneously \n•\tRecruitment, screening and enrollment of subjects along with adverse events \n•\tCollection and maintenance of data files in accordance with HIPAA and good clinical practices, preparation of medical records for sponsor’s clinical report forms. Health Educator Stanford University February 2012  –  July 2013  (1 year 6 months) San Jose, CA •\tConduct cognitive-behavioral therapy interventions, administer pharmacotherapy  \n•\tAssist with management of data collection and data entry (adverse events, eligibility, maintenance of database), be flexible to prioritize tasks with uneven tempo of work \n•\tRecruitment of potential participants including screening, consenting and documentation  \n•\tAdherence to strict protocols regarding blood pressure and therapy to avoid data inconsistency as well as boost participant retention and success of intervention Lead Biometric Screener Stanford University February 2011  –  February 2012  (1 year 1 month) Stanford, CA •\tAdministering biometric assessments, documentation and interpretation of results \n•\tMaintain integrity of participant confidentiality in accordance HIPPA regulations \n•\tManaged work flow and grew accustomed to working as a multitasker by attending to participants and other screeners while also working on miscellaneous projects \n•\tMaintained data entry in a complete and thorough manner requiring strong attention to detail \n•\tAssisted in building the program from infancy into a fast-paced environment with an efficient process of procedures \n•\tAssisted with setup at different sites including: moving equipment, arraying supplies and checking for enough material to get through each day, making copies as needed and organizing handouts at workstation Social Science Research Assistant Stanford University October 2010  –  February 2012  (1 year 5 months) Stanford University •\tConducting exercise physiology intervention with elder adults \n•\tScreened and orientated for participant recruitment, directed follow-up assessments \n•\tCompleted data reconciliation project for previous study \n•\tTrained as substitute instructor when needed Social Science Research Assistant Stanford University August 2013  –  April 2015  (1 year 9 months) Stanford Hospital •\tCoordinate clinical trials for Neuromuscular division with medical staff, pharmaceutical companies, surgical device manufacturers and collaborating academic institutions \n•\tPreparation of initial study documents for IRB submission (including amendments and renewals), completion of entire eProtocol application, regulatory documents, and planning for Site Initiation Visits \n•\tManage multiple studies simultaneously \n•\tRecruitment, screening and enrollment of subjects along with adverse events \n•\tCollection and maintenance of data files in accordance with HIPAA and good clinical practices, preparation of medical records for sponsor’s clinical report forms. Social Science Research Assistant Stanford University August 2013  –  April 2015  (1 year 9 months) Stanford Hospital •\tCoordinate clinical trials for Neuromuscular division with medical staff, pharmaceutical companies, surgical device manufacturers and collaborating academic institutions \n•\tPreparation of initial study documents for IRB submission (including amendments and renewals), completion of entire eProtocol application, regulatory documents, and planning for Site Initiation Visits \n•\tManage multiple studies simultaneously \n•\tRecruitment, screening and enrollment of subjects along with adverse events \n•\tCollection and maintenance of data files in accordance with HIPAA and good clinical practices, preparation of medical records for sponsor’s clinical report forms. Health Educator Stanford University February 2012  –  July 2013  (1 year 6 months) San Jose, CA •\tConduct cognitive-behavioral therapy interventions, administer pharmacotherapy  \n•\tAssist with management of data collection and data entry (adverse events, eligibility, maintenance of database), be flexible to prioritize tasks with uneven tempo of work \n•\tRecruitment of potential participants including screening, consenting and documentation  \n•\tAdherence to strict protocols regarding blood pressure and therapy to avoid data inconsistency as well as boost participant retention and success of intervention Health Educator Stanford University February 2012  –  July 2013  (1 year 6 months) San Jose, CA •\tConduct cognitive-behavioral therapy interventions, administer pharmacotherapy  \n•\tAssist with management of data collection and data entry (adverse events, eligibility, maintenance of database), be flexible to prioritize tasks with uneven tempo of work \n•\tRecruitment of potential participants including screening, consenting and documentation  \n•\tAdherence to strict protocols regarding blood pressure and therapy to avoid data inconsistency as well as boost participant retention and success of intervention Lead Biometric Screener Stanford University February 2011  –  February 2012  (1 year 1 month) Stanford, CA •\tAdministering biometric assessments, documentation and interpretation of results \n•\tMaintain integrity of participant confidentiality in accordance HIPPA regulations \n•\tManaged work flow and grew accustomed to working as a multitasker by attending to participants and other screeners while also working on miscellaneous projects \n•\tMaintained data entry in a complete and thorough manner requiring strong attention to detail \n•\tAssisted in building the program from infancy into a fast-paced environment with an efficient process of procedures \n•\tAssisted with setup at different sites including: moving equipment, arraying supplies and checking for enough material to get through each day, making copies as needed and organizing handouts at workstation Lead Biometric Screener Stanford University February 2011  –  February 2012  (1 year 1 month) Stanford, CA •\tAdministering biometric assessments, documentation and interpretation of results \n•\tMaintain integrity of participant confidentiality in accordance HIPPA regulations \n•\tManaged work flow and grew accustomed to working as a multitasker by attending to participants and other screeners while also working on miscellaneous projects \n•\tMaintained data entry in a complete and thorough manner requiring strong attention to detail \n•\tAssisted in building the program from infancy into a fast-paced environment with an efficient process of procedures \n•\tAssisted with setup at different sites including: moving equipment, arraying supplies and checking for enough material to get through each day, making copies as needed and organizing handouts at workstation Social Science Research Assistant Stanford University October 2010  –  February 2012  (1 year 5 months) Stanford University •\tConducting exercise physiology intervention with elder adults \n•\tScreened and orientated for participant recruitment, directed follow-up assessments \n•\tCompleted data reconciliation project for previous study \n•\tTrained as substitute instructor when needed Social Science Research Assistant Stanford University October 2010  –  February 2012  (1 year 5 months) Stanford University •\tConducting exercise physiology intervention with elder adults \n•\tScreened and orientated for participant recruitment, directed follow-up assessments \n•\tCompleted data reconciliation project for previous study \n•\tTrained as substitute instructor when needed Skills Cognitive Behavioral... Research Projects Biometrics Protocol Experience Documentation Practices Health Education Public Health Program Evaluation Skills  Cognitive Behavioral... Research Projects Biometrics Protocol Experience Documentation Practices Health Education Public Health Program Evaluation Cognitive Behavioral... Research Projects Biometrics Protocol Experience Documentation Practices Health Education Public Health Program Evaluation Cognitive Behavioral... Research Projects Biometrics Protocol Experience Documentation Practices Health Education Public Health Program Evaluation Education UCSD Bachelor of Science (B.S.), Minor in Psychology,  Biology 2003  – 2007 Activities and Societies:  UCSD Women's Crew UCSD Bachelor of Science (B.S.), Minor in Psychology,  Biology 2003  – 2007 Activities and Societies:  UCSD Women's Crew UCSD Bachelor of Science (B.S.), Minor in Psychology,  Biology 2003  – 2007 Activities and Societies:  UCSD Women's Crew UCSD Bachelor of Science (B.S.), Minor in Psychology,  Biology 2003  – 2007 Activities and Societies:  UCSD Women's Crew ", "Summary Notes Editor, Journal of Law, Economics and Policy \nMember, Moot Court Board \nTreasurer, Environmental Law Society \nTreasurer, Black Law Students Association Summary Notes Editor, Journal of Law, Economics and Policy \nMember, Moot Court Board \nTreasurer, Environmental Law Society \nTreasurer, Black Law Students Association Notes Editor, Journal of Law, Economics and Policy \nMember, Moot Court Board \nTreasurer, Environmental Law Society \nTreasurer, Black Law Students Association Notes Editor, Journal of Law, Economics and Policy \nMember, Moot Court Board \nTreasurer, Environmental Law Society \nTreasurer, Black Law Students Association Experience Food Integrity Campaign Counsel Government Accountability Project April 2015  – Present (5 months) Washington D.C. Metro Area Represent food industry whistleblowers in both the public and private sectors, and practice before the federal courts and administrative agencies. In addition to work with whistleblowers, assist activists and nonprofit organizations to obtain government records under the Freedom of Information Act and other transparency laws.  Attorney Osborne Law Offices, P.C. July 2013  –  April 2015  (1 year 10 months) Washington, DC Labor Law litigation.  Law Fellow SEIU Local 32BJ August 2011  –  July 2013  (2 years) Greater New York City Area Participated in all stages of litigation, including complaint/answer, substantive motions and discovery. Participated in administrative proceedings, arbitrations and bargaining negotiations. Investigated and conducted interviews for employee grievances and unfair labor practice claims. Researched and provided recommendations on federal and local policies related to immigration reform, health and safety laws and anti-discrimination law. Represented Union in presidential, senatorial and local campaigning in Wisconsin, including direct voter contact, volunteer recruitment and poll monitoring. Co-authored ABA Conference paper on access rights for contractor employees. Judicial Intern Fourth Circuit Court of Appeals August 2010  –  December 2010  (5 months) Baltimore, Maryland Area Reviewed cases before the Fourth Circuit and provided recommendations on the state of the law. Drafted bench memoranda on criminal and civil issues. Law Clerk United Food and Commercial Workers International Union August 2009  –  August 2010  (1 year 1 month) Washington D.C. Metro Area Drafted and edited memoranda concerning relevant labor law, such as fiduciary duties and minimum wage requirements under the Fair Labor Standards Act. Evaluated rules and regulations pending before the National Labor Relations Board. Researched and drafted attorney conference papers on employee speech and organizer access rights. Provided legal assistance to organizers and drafted briefs and motions for litigation. Law Clerk Leiva and Marks, PLC May 2009  –  August 2009  (4 months) Fairfax, Virginia Researched and drafted various legal documents including demand letters and interrogatory responses. Prepared inter-office memoranda to summarize legal issues, including criminal law, wrongful death claims, and medical malpractice, for firm’s partners. Attended and participated in client interviews and criminal trial. Public Health Legal Intern Government Accountability Project May 2009  –  August 2009  (4 months) Washington D.C. Metro Area Researched federal and state law and policy relating to occupational safety and health. Created nationwide survey on whistleblower law and policy relating to public health. Research and Writing Assistant The Justice Project January 2008  –  August 2008  (8 months) Washington D.C. Metro Area Drafted advocacy report on bad lawyering in capital cases and policy reviews about post-conviction DNA and forensic testing. Social Science Research Assistant Stanford University April 2006  –  August 2007  (1 year 5 months) White House Correspondent U.S. Department of State June 2004  –  September 2004  (4 months) Food Integrity Campaign Counsel Government Accountability Project April 2015  – Present (5 months) Washington D.C. Metro Area Represent food industry whistleblowers in both the public and private sectors, and practice before the federal courts and administrative agencies. In addition to work with whistleblowers, assist activists and nonprofit organizations to obtain government records under the Freedom of Information Act and other transparency laws.  Food Integrity Campaign Counsel Government Accountability Project April 2015  – Present (5 months) Washington D.C. Metro Area Represent food industry whistleblowers in both the public and private sectors, and practice before the federal courts and administrative agencies. In addition to work with whistleblowers, assist activists and nonprofit organizations to obtain government records under the Freedom of Information Act and other transparency laws.  Attorney Osborne Law Offices, P.C. July 2013  –  April 2015  (1 year 10 months) Washington, DC Labor Law litigation.  Attorney Osborne Law Offices, P.C. July 2013  –  April 2015  (1 year 10 months) Washington, DC Labor Law litigation.  Law Fellow SEIU Local 32BJ August 2011  –  July 2013  (2 years) Greater New York City Area Participated in all stages of litigation, including complaint/answer, substantive motions and discovery. Participated in administrative proceedings, arbitrations and bargaining negotiations. Investigated and conducted interviews for employee grievances and unfair labor practice claims. Researched and provided recommendations on federal and local policies related to immigration reform, health and safety laws and anti-discrimination law. Represented Union in presidential, senatorial and local campaigning in Wisconsin, including direct voter contact, volunteer recruitment and poll monitoring. Co-authored ABA Conference paper on access rights for contractor employees. Law Fellow SEIU Local 32BJ August 2011  –  July 2013  (2 years) Greater New York City Area Participated in all stages of litigation, including complaint/answer, substantive motions and discovery. Participated in administrative proceedings, arbitrations and bargaining negotiations. Investigated and conducted interviews for employee grievances and unfair labor practice claims. Researched and provided recommendations on federal and local policies related to immigration reform, health and safety laws and anti-discrimination law. Represented Union in presidential, senatorial and local campaigning in Wisconsin, including direct voter contact, volunteer recruitment and poll monitoring. Co-authored ABA Conference paper on access rights for contractor employees. Judicial Intern Fourth Circuit Court of Appeals August 2010  –  December 2010  (5 months) Baltimore, Maryland Area Reviewed cases before the Fourth Circuit and provided recommendations on the state of the law. Drafted bench memoranda on criminal and civil issues. Judicial Intern Fourth Circuit Court of Appeals August 2010  –  December 2010  (5 months) Baltimore, Maryland Area Reviewed cases before the Fourth Circuit and provided recommendations on the state of the law. Drafted bench memoranda on criminal and civil issues. Law Clerk United Food and Commercial Workers International Union August 2009  –  August 2010  (1 year 1 month) Washington D.C. Metro Area Drafted and edited memoranda concerning relevant labor law, such as fiduciary duties and minimum wage requirements under the Fair Labor Standards Act. Evaluated rules and regulations pending before the National Labor Relations Board. Researched and drafted attorney conference papers on employee speech and organizer access rights. Provided legal assistance to organizers and drafted briefs and motions for litigation. Law Clerk United Food and Commercial Workers International Union August 2009  –  August 2010  (1 year 1 month) Washington D.C. Metro Area Drafted and edited memoranda concerning relevant labor law, such as fiduciary duties and minimum wage requirements under the Fair Labor Standards Act. Evaluated rules and regulations pending before the National Labor Relations Board. Researched and drafted attorney conference papers on employee speech and organizer access rights. Provided legal assistance to organizers and drafted briefs and motions for litigation. Law Clerk Leiva and Marks, PLC May 2009  –  August 2009  (4 months) Fairfax, Virginia Researched and drafted various legal documents including demand letters and interrogatory responses. Prepared inter-office memoranda to summarize legal issues, including criminal law, wrongful death claims, and medical malpractice, for firm’s partners. Attended and participated in client interviews and criminal trial. Law Clerk Leiva and Marks, PLC May 2009  –  August 2009  (4 months) Fairfax, Virginia Researched and drafted various legal documents including demand letters and interrogatory responses. Prepared inter-office memoranda to summarize legal issues, including criminal law, wrongful death claims, and medical malpractice, for firm’s partners. Attended and participated in client interviews and criminal trial. Public Health Legal Intern Government Accountability Project May 2009  –  August 2009  (4 months) Washington D.C. Metro Area Researched federal and state law and policy relating to occupational safety and health. Created nationwide survey on whistleblower law and policy relating to public health. Public Health Legal Intern Government Accountability Project May 2009  –  August 2009  (4 months) Washington D.C. Metro Area Researched federal and state law and policy relating to occupational safety and health. Created nationwide survey on whistleblower law and policy relating to public health. Research and Writing Assistant The Justice Project January 2008  –  August 2008  (8 months) Washington D.C. Metro Area Drafted advocacy report on bad lawyering in capital cases and policy reviews about post-conviction DNA and forensic testing. Research and Writing Assistant The Justice Project January 2008  –  August 2008  (8 months) Washington D.C. Metro Area Drafted advocacy report on bad lawyering in capital cases and policy reviews about post-conviction DNA and forensic testing. Social Science Research Assistant Stanford University April 2006  –  August 2007  (1 year 5 months) Social Science Research Assistant Stanford University April 2006  –  August 2007  (1 year 5 months) White House Correspondent U.S. Department of State June 2004  –  September 2004  (4 months) White House Correspondent U.S. Department of State June 2004  –  September 2004  (4 months) Languages   Skills Public Policy Legal Writing Research Westlaw Politics Legal Research Policy Analysis Policy International Relations Civil Litigation Litigation Legal Issues Employment Law Skills  Public Policy Legal Writing Research Westlaw Politics Legal Research Policy Analysis Policy International Relations Civil Litigation Litigation Legal Issues Employment Law Public Policy Legal Writing Research Westlaw Politics Legal Research Policy Analysis Policy International Relations Civil Litigation Litigation Legal Issues Employment Law Public Policy Legal Writing Research Westlaw Politics Legal Research Policy Analysis Policy International Relations Civil Litigation Litigation Legal Issues Employment Law Education George Mason University School of Law JD 2008  – 2011 Stanford University B.A.,  International Relations 2002  – 2006 George Mason University School of Law JD 2008  – 2011 George Mason University School of Law JD 2008  – 2011 George Mason University School of Law JD 2008  – 2011 Stanford University B.A.,  International Relations 2002  – 2006 Stanford University B.A.,  International Relations 2002  – 2006 Stanford University B.A.,  International Relations 2002  – 2006 Honors & Awards ", "Experience Social Science Research Assistant Stanford University School of Medicine June 2013  – Present (2 years 3 months) Research Assistant University of San Francisco August 2012  –  May 2013  (10 months) Data Entry Specialist Huckleberry Youth Programs November 2011  –  May 2013  (1 year 7 months) Social Science Research Assistant Stanford University School of Medicine June 2013  – Present (2 years 3 months) Social Science Research Assistant Stanford University School of Medicine June 2013  – Present (2 years 3 months) Research Assistant University of San Francisco August 2012  –  May 2013  (10 months) Research Assistant University of San Francisco August 2012  –  May 2013  (10 months) Data Entry Specialist Huckleberry Youth Programs November 2011  –  May 2013  (1 year 7 months) Data Entry Specialist Huckleberry Youth Programs November 2011  –  May 2013  (1 year 7 months) Education University of San Francisco Bachelor of Arts (B.A.),  Psychology 2009  – 2013 University of San Francisco Bachelor of Arts (B.A.),  Psychology 2009  – 2013 University of San Francisco Bachelor of Arts (B.A.),  Psychology 2009  – 2013 University of San Francisco Bachelor of Arts (B.A.),  Psychology 2009  – 2013 Honors & Awards Psi Chi Research Award April 2013 Psi Chi Research Award April 2013 Psi Chi Research Award April 2013 Psi Chi Research Award April 2013 ", "Experience Senior Research Coordinator Stanford University September 2011  – Present (4 years) Department of Dermatology/Oncology Senior Clinical Research Associate Stanford May 2009  –  September 2011  (2 years 5 months) Managing coordination of pediatric oncology & hematology studies within the Pediatric Hematology/Oncology Department (e.g., Children’s Oncology Group, Novartis Pharmaceuticals, St. Jude Children Hospital etc.) \n \nDetermining patient eligibility and registering patients on study. Submitting data, maintaining the protocol and submitting specimens for study purposes and ensuring timely and accurate completion of all Case Report Forms by protocol guidelines in a timely manner. \n \nPrepare patient records and ensure they are complete for audit purposes as well acting as liaison between clinical health care professionals, providing accurate and updated information regarding protocols and clinical research. \n \nMaintaining databases and research folders for all patients in study. This includes submittal of new IRB applications for new protocols and IRB renewal paperwork. Clinical Research Associate Stanford University September 2004  –  April 2009  (4 years 8 months) Social Science Research Assistant Stanford University April 2004  –  August 2004  (5 months) Clinical Data Manager Medical University of South Carolina September 2002  –  September 2003  (1 year 1 month) Performing complex data management activities involving protocol management and patient follow-up for oncology research studies for cooperative groups such as GOG, ECOG, and SWOG involving multiple disease sties.  \n \nAnalyzing and evaluating clinical patient data using various hospital databases and ensuring timely and accurate completion of all Case Report Forms (CRFs) by protocol guidelines. \n \nMonitoring studies of subjects for signs and symptoms of toxicity for drug studies, which involved obtaining informed consent from potential candidates by all applicable HIPPA regulations and working closely with principal investigators in determining patient eligibility, then educating patients regarding scientific aspects of study and maintaining accurate patient research charts and internal clinical trials database.  \n \nOther duties included: collecting and managing laboratory specimens according to protocol requirements; obtaining, processing and shipping serum and tissues to appropriate coordinating lab centers. Business Analyst Medical University of South Carolina 2001  –  2002  (1 year) Managing analysis and reporting of information to monitor business/referral activity, including those associated with the Safety Net Program.  \n \nCreating customized reports for marketing staff using advance features of MS Excel and MS Access.  \n \nAnalyzing and gathering data requirements according to user's need by Hospital Based Keane Database. Business Analyst / Report Writer (Contractor) Ness Motley Law Firm 2000  –  2001  (1 year) Creating customized reports for legal staff using Crystal Reports. Analyzing and gathering data requirements according to user's need by using Legal Edge Database. Utilizing advance features of Crystal Reports in creating Legal Reports Programmer Analyst Chevron December 1998  –  1999  (1 year) GUI developer using Power Builder 6.5 as a front-end tool and Oracle 7.0 as the back-end tool to create applications for Chevron's Marketing Department.  \n \nCreating customized reports for customers using Crystal Reports. Building complex SQL queries according to customer's data requirement needs and performing Y2K analysis using SP-2000 and PB-2000. Senior Research Coordinator Stanford University September 2011  – Present (4 years) Department of Dermatology/Oncology Senior Research Coordinator Stanford University September 2011  – Present (4 years) Department of Dermatology/Oncology Senior Clinical Research Associate Stanford May 2009  –  September 2011  (2 years 5 months) Managing coordination of pediatric oncology & hematology studies within the Pediatric Hematology/Oncology Department (e.g., Children’s Oncology Group, Novartis Pharmaceuticals, St. Jude Children Hospital etc.) \n \nDetermining patient eligibility and registering patients on study. Submitting data, maintaining the protocol and submitting specimens for study purposes and ensuring timely and accurate completion of all Case Report Forms by protocol guidelines in a timely manner. \n \nPrepare patient records and ensure they are complete for audit purposes as well acting as liaison between clinical health care professionals, providing accurate and updated information regarding protocols and clinical research. \n \nMaintaining databases and research folders for all patients in study. This includes submittal of new IRB applications for new protocols and IRB renewal paperwork. Senior Clinical Research Associate Stanford May 2009  –  September 2011  (2 years 5 months) Managing coordination of pediatric oncology & hematology studies within the Pediatric Hematology/Oncology Department (e.g., Children’s Oncology Group, Novartis Pharmaceuticals, St. Jude Children Hospital etc.) \n \nDetermining patient eligibility and registering patients on study. Submitting data, maintaining the protocol and submitting specimens for study purposes and ensuring timely and accurate completion of all Case Report Forms by protocol guidelines in a timely manner. \n \nPrepare patient records and ensure they are complete for audit purposes as well acting as liaison between clinical health care professionals, providing accurate and updated information regarding protocols and clinical research. \n \nMaintaining databases and research folders for all patients in study. This includes submittal of new IRB applications for new protocols and IRB renewal paperwork. Clinical Research Associate Stanford University September 2004  –  April 2009  (4 years 8 months) Clinical Research Associate Stanford University September 2004  –  April 2009  (4 years 8 months) Social Science Research Assistant Stanford University April 2004  –  August 2004  (5 months) Social Science Research Assistant Stanford University April 2004  –  August 2004  (5 months) Clinical Data Manager Medical University of South Carolina September 2002  –  September 2003  (1 year 1 month) Performing complex data management activities involving protocol management and patient follow-up for oncology research studies for cooperative groups such as GOG, ECOG, and SWOG involving multiple disease sties.  \n \nAnalyzing and evaluating clinical patient data using various hospital databases and ensuring timely and accurate completion of all Case Report Forms (CRFs) by protocol guidelines. \n \nMonitoring studies of subjects for signs and symptoms of toxicity for drug studies, which involved obtaining informed consent from potential candidates by all applicable HIPPA regulations and working closely with principal investigators in determining patient eligibility, then educating patients regarding scientific aspects of study and maintaining accurate patient research charts and internal clinical trials database.  \n \nOther duties included: collecting and managing laboratory specimens according to protocol requirements; obtaining, processing and shipping serum and tissues to appropriate coordinating lab centers. Clinical Data Manager Medical University of South Carolina September 2002  –  September 2003  (1 year 1 month) Performing complex data management activities involving protocol management and patient follow-up for oncology research studies for cooperative groups such as GOG, ECOG, and SWOG involving multiple disease sties.  \n \nAnalyzing and evaluating clinical patient data using various hospital databases and ensuring timely and accurate completion of all Case Report Forms (CRFs) by protocol guidelines. \n \nMonitoring studies of subjects for signs and symptoms of toxicity for drug studies, which involved obtaining informed consent from potential candidates by all applicable HIPPA regulations and working closely with principal investigators in determining patient eligibility, then educating patients regarding scientific aspects of study and maintaining accurate patient research charts and internal clinical trials database.  \n \nOther duties included: collecting and managing laboratory specimens according to protocol requirements; obtaining, processing and shipping serum and tissues to appropriate coordinating lab centers. Business Analyst Medical University of South Carolina 2001  –  2002  (1 year) Managing analysis and reporting of information to monitor business/referral activity, including those associated with the Safety Net Program.  \n \nCreating customized reports for marketing staff using advance features of MS Excel and MS Access.  \n \nAnalyzing and gathering data requirements according to user's need by Hospital Based Keane Database. Business Analyst Medical University of South Carolina 2001  –  2002  (1 year) Managing analysis and reporting of information to monitor business/referral activity, including those associated with the Safety Net Program.  \n \nCreating customized reports for marketing staff using advance features of MS Excel and MS Access.  \n \nAnalyzing and gathering data requirements according to user's need by Hospital Based Keane Database. Business Analyst / Report Writer (Contractor) Ness Motley Law Firm 2000  –  2001  (1 year) Creating customized reports for legal staff using Crystal Reports. Analyzing and gathering data requirements according to user's need by using Legal Edge Database. Utilizing advance features of Crystal Reports in creating Legal Reports Business Analyst / Report Writer (Contractor) Ness Motley Law Firm 2000  –  2001  (1 year) Creating customized reports for legal staff using Crystal Reports. Analyzing and gathering data requirements according to user's need by using Legal Edge Database. Utilizing advance features of Crystal Reports in creating Legal Reports Programmer Analyst Chevron December 1998  –  1999  (1 year) GUI developer using Power Builder 6.5 as a front-end tool and Oracle 7.0 as the back-end tool to create applications for Chevron's Marketing Department.  \n \nCreating customized reports for customers using Crystal Reports. Building complex SQL queries according to customer's data requirement needs and performing Y2K analysis using SP-2000 and PB-2000. Programmer Analyst Chevron December 1998  –  1999  (1 year) GUI developer using Power Builder 6.5 as a front-end tool and Oracle 7.0 as the back-end tool to create applications for Chevron's Marketing Department.  \n \nCreating customized reports for customers using Crystal Reports. Building complex SQL queries according to customer's data requirement needs and performing Y2K analysis using SP-2000 and PB-2000. Skills Clinical Trials Oncology Clinical Data Lifesciences Clinical Research CTMS Pediatric... GCP Skills  Clinical Trials Oncology Clinical Data Lifesciences Clinical Research CTMS Pediatric... GCP Clinical Trials Oncology Clinical Data Lifesciences Clinical Research CTMS Pediatric... GCP Clinical Trials Oncology Clinical Data Lifesciences Clinical Research CTMS Pediatric... GCP Education California State University-Hayward - School of Business and Economics MSBA,  Computer Information Systems and Quantative Business 1997  – 1998 University of California, Berkeley Psychology 1992  – 1995 High School University of California, Santa Cruz California State University-Hayward - School of Business and Economics MSBA,  Computer Information Systems and Quantative Business 1997  – 1998 California State University-Hayward - School of Business and Economics MSBA,  Computer Information Systems and Quantative Business 1997  – 1998 California State University-Hayward - School of Business and Economics MSBA,  Computer Information Systems and Quantative Business 1997  – 1998 University of California, Berkeley Psychology 1992  – 1995 University of California, Berkeley Psychology 1992  – 1995 University of California, Berkeley Psychology 1992  – 1995 High School High School High School University of California, Santa Cruz University of California, Santa Cruz University of California, Santa Cruz ", "Experience Social Science Research Assistant Stanford University April 2011  – Present (4 years 5 months) -Clinical Trial Research Coordinator \n-Lab Database and Web Manager \n-MRI tech and analyst Teaching Associate University of California at Los Angeles September 2008  –  March 2011  (2 years 7 months) -Assisted instruction of undergraduate education in foundations of physiological science Social Science Research Assistant Stanford University April 2011  – Present (4 years 5 months) -Clinical Trial Research Coordinator \n-Lab Database and Web Manager \n-MRI tech and analyst Social Science Research Assistant Stanford University April 2011  – Present (4 years 5 months) -Clinical Trial Research Coordinator \n-Lab Database and Web Manager \n-MRI tech and analyst Teaching Associate University of California at Los Angeles September 2008  –  March 2011  (2 years 7 months) -Assisted instruction of undergraduate education in foundations of physiological science Teaching Associate University of California at Los Angeles September 2008  –  March 2011  (2 years 7 months) -Assisted instruction of undergraduate education in foundations of physiological science Languages Spanish Spanish Spanish Skills MRI Software Matlab HTML SPSS Berkeley-Madonna Animal Behavior Singing Acting Microsoft Excel Clinical Research Skills  MRI Software Matlab HTML SPSS Berkeley-Madonna Animal Behavior Singing Acting Microsoft Excel Clinical Research MRI Software Matlab HTML SPSS Berkeley-Madonna Animal Behavior Singing Acting Microsoft Excel Clinical Research MRI Software Matlab HTML SPSS Berkeley-Madonna Animal Behavior Singing Acting Microsoft Excel Clinical Research Education University of California at Los Angeles MS (in progress),  Physiological Science 2008  – 2012 University of California at Los Angeles BS,  Physiological Science 2004  – 2008 Activities and Societies:  Zeta Psi ,  Shakespeare at UCLA ,  HOOLIGAN Theatre Company University of California at Los Angeles MS (in progress),  Physiological Science 2008  – 2012 University of California at Los Angeles MS (in progress),  Physiological Science 2008  – 2012 University of California at Los Angeles MS (in progress),  Physiological Science 2008  – 2012 University of California at Los Angeles BS,  Physiological Science 2004  – 2008 Activities and Societies:  Zeta Psi ,  Shakespeare at UCLA ,  HOOLIGAN Theatre Company University of California at Los Angeles BS,  Physiological Science 2004  – 2008 Activities and Societies:  Zeta Psi ,  Shakespeare at UCLA ,  HOOLIGAN Theatre Company University of California at Los Angeles BS,  Physiological Science 2004  – 2008 Activities and Societies:  Zeta Psi ,  Shakespeare at UCLA ,  HOOLIGAN Theatre Company ", "Experience Social Science Research Assistant Stanford University School of Medicine August 2014  – Present (1 year 1 month) Law Facilitator Fresh Lifelines for Youth (FLY) January 2014  – Present (1 year 8 months) San Mateo, California FLY is a non-profit striving to break the cycle of violence, crime and incarceration of youth in the Bay Area. My main duty as a facilitator is not only to help youth gain respect and a better understanding for the legal system but also help them build essential life skills and be a positive role model that they could trust. Administrative Assistant InnVision Shelter Network November 2012  –  May 2013  (7 months) San Mateo, California While a full time student, I interned at the InnVison Shelter Network. My duties included providing information and assistance to the residents; organizing, collecting, and screening donations; and additionally informing all residents of their responsibilities as clients in the shelter. Fluently bilingual, I also translated for Spanish speaking clients. On weekends I managed art and creative learning workshops for children of the shelter's clients. Academic Assistant The Boys and Girls Club of the Peninsula May 2011  –  September 2012  (1 year 5 months) Redwood City, California Stanford Campus Recreation Association (SCRA) Summer Camp Stanford University June 2009  –  June 2010  (1 year 1 month) Stanford, California As a summer camp counselor at this program, I worked with children from the ages of 5-10 yrs. My duties were to ensure that this was a safe learning and playing environment for the children at all times whether it was at the tennis court, pool or clubhouse. Our goal was to host informal recreational events fostering a fun atmosphere in compliment of the academic community at Stanford. Social Science Research Assistant Stanford University School of Medicine August 2014  – Present (1 year 1 month) Social Science Research Assistant Stanford University School of Medicine August 2014  – Present (1 year 1 month) Law Facilitator Fresh Lifelines for Youth (FLY) January 2014  – Present (1 year 8 months) San Mateo, California FLY is a non-profit striving to break the cycle of violence, crime and incarceration of youth in the Bay Area. My main duty as a facilitator is not only to help youth gain respect and a better understanding for the legal system but also help them build essential life skills and be a positive role model that they could trust. Law Facilitator Fresh Lifelines for Youth (FLY) January 2014  – Present (1 year 8 months) San Mateo, California FLY is a non-profit striving to break the cycle of violence, crime and incarceration of youth in the Bay Area. My main duty as a facilitator is not only to help youth gain respect and a better understanding for the legal system but also help them build essential life skills and be a positive role model that they could trust. Administrative Assistant InnVision Shelter Network November 2012  –  May 2013  (7 months) San Mateo, California While a full time student, I interned at the InnVison Shelter Network. My duties included providing information and assistance to the residents; organizing, collecting, and screening donations; and additionally informing all residents of their responsibilities as clients in the shelter. Fluently bilingual, I also translated for Spanish speaking clients. On weekends I managed art and creative learning workshops for children of the shelter's clients. Administrative Assistant InnVision Shelter Network November 2012  –  May 2013  (7 months) San Mateo, California While a full time student, I interned at the InnVison Shelter Network. My duties included providing information and assistance to the residents; organizing, collecting, and screening donations; and additionally informing all residents of their responsibilities as clients in the shelter. Fluently bilingual, I also translated for Spanish speaking clients. On weekends I managed art and creative learning workshops for children of the shelter's clients. Academic Assistant The Boys and Girls Club of the Peninsula May 2011  –  September 2012  (1 year 5 months) Redwood City, California Academic Assistant The Boys and Girls Club of the Peninsula May 2011  –  September 2012  (1 year 5 months) Redwood City, California Stanford Campus Recreation Association (SCRA) Summer Camp Stanford University June 2009  –  June 2010  (1 year 1 month) Stanford, California As a summer camp counselor at this program, I worked with children from the ages of 5-10 yrs. My duties were to ensure that this was a safe learning and playing environment for the children at all times whether it was at the tennis court, pool or clubhouse. Our goal was to host informal recreational events fostering a fun atmosphere in compliment of the academic community at Stanford. Stanford Campus Recreation Association (SCRA) Summer Camp Stanford University June 2009  –  June 2010  (1 year 1 month) Stanford, California As a summer camp counselor at this program, I worked with children from the ages of 5-10 yrs. My duties were to ensure that this was a safe learning and playing environment for the children at all times whether it was at the tennis court, pool or clubhouse. Our goal was to host informal recreational events fostering a fun atmosphere in compliment of the academic community at Stanford. Languages   Skills Public Speaking Community Outreach Nonprofits PowerPoint Research Microsoft Word Team Leadership Microsoft Office Spanish Social Networking Event Planning Fundraising Social Media Volunteer Management Customer Service Skills  Public Speaking Community Outreach Nonprofits PowerPoint Research Microsoft Word Team Leadership Microsoft Office Spanish Social Networking Event Planning Fundraising Social Media Volunteer Management Customer Service Public Speaking Community Outreach Nonprofits PowerPoint Research Microsoft Word Team Leadership Microsoft Office Spanish Social Networking Event Planning Fundraising Social Media Volunteer Management Customer Service Public Speaking Community Outreach Nonprofits PowerPoint Research Microsoft Word Team Leadership Microsoft Office Spanish Social Networking Event Planning Fundraising Social Media Volunteer Management Customer Service Education Notre Dame de Namur University Pursuing B.A.,  Sociology with an emphasis in Community and Criminal Justice/ Minor in Spanish 2011  – 2015 Excelled academically as a full time student while working as well Woodside High School High School Diploma 2008  – 2011 Activities and Societies:  BUILD - Entrepreneur and Academic Success Program ,  4 year commitment\nSoccer\nAVID/MESA Notre Dame de Namur University Pursuing B.A.,  Sociology with an emphasis in Community and Criminal Justice/ Minor in Spanish 2011  – 2015 Excelled academically as a full time student while working as well Notre Dame de Namur University Pursuing B.A.,  Sociology with an emphasis in Community and Criminal Justice/ Minor in Spanish 2011  – 2015 Excelled academically as a full time student while working as well Notre Dame de Namur University Pursuing B.A.,  Sociology with an emphasis in Community and Criminal Justice/ Minor in Spanish 2011  – 2015 Excelled academically as a full time student while working as well Woodside High School High School Diploma 2008  – 2011 Activities and Societies:  BUILD - Entrepreneur and Academic Success Program ,  4 year commitment\nSoccer\nAVID/MESA Woodside High School High School Diploma 2008  – 2011 Activities and Societies:  BUILD - Entrepreneur and Academic Success Program ,  4 year commitment\nSoccer\nAVID/MESA Woodside High School High School Diploma 2008  – 2011 Activities and Societies:  BUILD - Entrepreneur and Academic Success Program ,  4 year commitment\nSoccer\nAVID/MESA Honors & Awards Alpha Mu Gamma April 2015 Alpha Mu Gamma is a national collegiate foreign language honor society founded at Los Angeles City College in 1931.  Alpha Mu Gamma April 2015 Alpha Mu Gamma is a national collegiate foreign language honor society founded at Los Angeles City College in 1931.  Alpha Mu Gamma April 2015 Alpha Mu Gamma is a national collegiate foreign language honor society founded at Los Angeles City College in 1931.  Alpha Mu Gamma April 2015 Alpha Mu Gamma is a national collegiate foreign language honor society founded at Los Angeles City College in 1931.  ", "Experience Social Science Research Assistant Stanford University School of Education Social Science Research Assisant Stanford Center for Assessment, Learning, & Equity (SCALE) 2011  – Present (4 years) Social Science Research Assistant Stanford University School of Education Social Science Research Assistant Stanford University School of Education Social Science Research Assisant Stanford Center for Assessment, Learning, & Equity (SCALE) 2011  – Present (4 years) Social Science Research Assisant Stanford Center for Assessment, Learning, & Equity (SCALE) 2011  – Present (4 years) Education Stanford University MA,  Education 1999  – 2001 Stanford University MA,  Education 1999  – 2001 Stanford University MA,  Education 1999  – 2001 Stanford University MA,  Education 1999  – 2001 ", "Summary Inquisitive and passionate published wellness professional seeks fast-paced work environment for creating exceptional storytelling, generating innovative concepts, and promoting a supportive team dynamic. Summary Inquisitive and passionate published wellness professional seeks fast-paced work environment for creating exceptional storytelling, generating innovative concepts, and promoting a supportive team dynamic. Inquisitive and passionate published wellness professional seeks fast-paced work environment for creating exceptional storytelling, generating innovative concepts, and promoting a supportive team dynamic. Inquisitive and passionate published wellness professional seeks fast-paced work environment for creating exceptional storytelling, generating innovative concepts, and promoting a supportive team dynamic. Experience BeWell Health Advisor, Social Science Research Assistant Stanford University June 2011  – Present (4 years 3 months) Health Coach WellCall March 2009  –  December 2010  (1 year 10 months) BeWell Health Advisor, Social Science Research Assistant Stanford University June 2011  – Present (4 years 3 months) BeWell Health Advisor, Social Science Research Assistant Stanford University June 2011  – Present (4 years 3 months) Health Coach WellCall March 2009  –  December 2010  (1 year 10 months) Health Coach WellCall March 2009  –  December 2010  (1 year 10 months) Languages Spanish - Moderate Spanish - Moderate Spanish - Moderate Skills Health Education Nutrition Wellness Fitness Teaching Public Speaking Healthcare Social Media Microsoft Office PowerPoint Microsoft Excel Social Media Marketing Marketing Strategy Public Health Writing Health Writing See 1+     See less Skills  Health Education Nutrition Wellness Fitness Teaching Public Speaking Healthcare Social Media Microsoft Office PowerPoint Microsoft Excel Social Media Marketing Marketing Strategy Public Health Writing Health Writing See 1+     See less Health Education Nutrition Wellness Fitness Teaching Public Speaking Healthcare Social Media Microsoft Office PowerPoint Microsoft Excel Social Media Marketing Marketing Strategy Public Health Writing Health Writing See 1+     See less Health Education Nutrition Wellness Fitness Teaching Public Speaking Healthcare Social Media Microsoft Office PowerPoint Microsoft Excel Social Media Marketing Marketing Strategy Public Health Writing Health Writing See 1+     See less Education University of California, Santa Barbara B.A. 2003  – 2007 University of California, Santa Barbara B.A. 2003  – 2007 University of California, Santa Barbara B.A. 2003  – 2007 University of California, Santa Barbara B.A. 2003  – 2007 ", "Summary Seeking a position where I can utilize my skills, knowledge, and education to provide excellence in administrated positions. Summary Seeking a position where I can utilize my skills, knowledge, and education to provide excellence in administrated positions. Seeking a position where I can utilize my skills, knowledge, and education to provide excellence in administrated positions. Seeking a position where I can utilize my skills, knowledge, and education to provide excellence in administrated positions. Experience Social Science Research Assistant Stanford University School of Medicine March 2015  – Present (6 months) Palo Alto Contact people who may be interested in current studies and provide information about such studies. Proceed with screening for eligibility if necessary. Submit data into database such as REDcap and Filemaker. Assist in participants orientations and training. Revise materials that may be handed to participants. Assist in weekly staff meetings Front Desk Agent Hotel valley Park May 2013  –  June 2015  (2 years 2 months) San Jose, CA Check-in and checkout guest by providing excellent verbal and non-verbal communication. Create and cancel reservations through a database management. Verify automatic reservations. Provide guest with internal and external resources to increase customer satisfaction of the business. Order supplies online and close daily reports Medication Technician Corona Care Retirement June 2012  –  May 2013  (1 year) Corona, CA Review and update medical charts in order to provide residents with the proper medication. Refilled medication when needed. Supervised three caregivers and oversee 85 residents. Communicated and acted as the main point of contact between hospitals, pharmacies, physicians, administrator, residents and their families in order to provide optimal care, and keep up to date with any the resident’s care, medical chart, changes in the resident’s status and their privacy. Patient Care Technician Corona Care Retirement November 2010  –  June 2012  (1 year 8 months) Assisted residents with activities of daily living such as helping dress up, comb the hair, shave, shower, commode change, pull-up/ diaper change, feeding, etc. Pass water to their rooms, and maintain hallways clear of spills and other objects that could lead the resident to fall. Inform Medication Technician of any changes in the president’s health, bruises, or any other abnormalities. Social Science Research Assistant Stanford University School of Medicine March 2015  – Present (6 months) Palo Alto Contact people who may be interested in current studies and provide information about such studies. Proceed with screening for eligibility if necessary. Submit data into database such as REDcap and Filemaker. Assist in participants orientations and training. Revise materials that may be handed to participants. Assist in weekly staff meetings Social Science Research Assistant Stanford University School of Medicine March 2015  – Present (6 months) Palo Alto Contact people who may be interested in current studies and provide information about such studies. Proceed with screening for eligibility if necessary. Submit data into database such as REDcap and Filemaker. Assist in participants orientations and training. Revise materials that may be handed to participants. Assist in weekly staff meetings Front Desk Agent Hotel valley Park May 2013  –  June 2015  (2 years 2 months) San Jose, CA Check-in and checkout guest by providing excellent verbal and non-verbal communication. Create and cancel reservations through a database management. Verify automatic reservations. Provide guest with internal and external resources to increase customer satisfaction of the business. Order supplies online and close daily reports Front Desk Agent Hotel valley Park May 2013  –  June 2015  (2 years 2 months) San Jose, CA Check-in and checkout guest by providing excellent verbal and non-verbal communication. Create and cancel reservations through a database management. Verify automatic reservations. Provide guest with internal and external resources to increase customer satisfaction of the business. Order supplies online and close daily reports Medication Technician Corona Care Retirement June 2012  –  May 2013  (1 year) Corona, CA Review and update medical charts in order to provide residents with the proper medication. Refilled medication when needed. Supervised three caregivers and oversee 85 residents. Communicated and acted as the main point of contact between hospitals, pharmacies, physicians, administrator, residents and their families in order to provide optimal care, and keep up to date with any the resident’s care, medical chart, changes in the resident’s status and their privacy. Medication Technician Corona Care Retirement June 2012  –  May 2013  (1 year) Corona, CA Review and update medical charts in order to provide residents with the proper medication. Refilled medication when needed. Supervised three caregivers and oversee 85 residents. Communicated and acted as the main point of contact between hospitals, pharmacies, physicians, administrator, residents and their families in order to provide optimal care, and keep up to date with any the resident’s care, medical chart, changes in the resident’s status and their privacy. Patient Care Technician Corona Care Retirement November 2010  –  June 2012  (1 year 8 months) Assisted residents with activities of daily living such as helping dress up, comb the hair, shave, shower, commode change, pull-up/ diaper change, feeding, etc. Pass water to their rooms, and maintain hallways clear of spills and other objects that could lead the resident to fall. Inform Medication Technician of any changes in the president’s health, bruises, or any other abnormalities. Patient Care Technician Corona Care Retirement November 2010  –  June 2012  (1 year 8 months) Assisted residents with activities of daily living such as helping dress up, comb the hair, shave, shower, commode change, pull-up/ diaper change, feeding, etc. Pass water to their rooms, and maintain hallways clear of spills and other objects that could lead the resident to fall. Inform Medication Technician of any changes in the president’s health, bruises, or any other abnormalities. Languages Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Microsoft Office PowerPoint Microsoft Word Customer Service Microsoft Excel Public Speaking Outlook Teamwork Time Management Management Skills  Microsoft Office PowerPoint Microsoft Word Customer Service Microsoft Excel Public Speaking Outlook Teamwork Time Management Management Microsoft Office PowerPoint Microsoft Word Customer Service Microsoft Excel Public Speaking Outlook Teamwork Time Management Management Microsoft Office PowerPoint Microsoft Word Customer Service Microsoft Excel Public Speaking Outlook Teamwork Time Management Management Education San Jose State University Bachelor of Science (B.S.),  Psychology 2014  – 2017 San Jose State University Bachelor of Science (B.S.),  Psychology 2014  – 2017 San Jose State University Bachelor of Science (B.S.),  Psychology 2014  – 2017 San Jose State University Bachelor of Science (B.S.),  Psychology 2014  – 2017 Honors & Awards ", "Summary -Documentation Specialist, Data Coordinator in clinical research and the health sciences and Web Designer over a broad range of industries, both private and public enterprise. Expressed focus given to tracking and trending data in compliance with study guidelines pertaining to regulatory or study-participant aspects. Always interested in clinical study projects, as well as in start-up companies and organizations preferring not to divert their attention to website issues but rather on their core business. Specialties:-Coordinating reporting processes on assigned studies \n-Coordinating outreach events \n-Database tracking system \n-EDC tools \n-HTML, JavaScript, Java, WYSIWYG layout tools, e-commerce,blogs, forums \n-SMO (social media optimization) \n-SEO Summary -Documentation Specialist, Data Coordinator in clinical research and the health sciences and Web Designer over a broad range of industries, both private and public enterprise. Expressed focus given to tracking and trending data in compliance with study guidelines pertaining to regulatory or study-participant aspects. Always interested in clinical study projects, as well as in start-up companies and organizations preferring not to divert their attention to website issues but rather on their core business. Specialties:-Coordinating reporting processes on assigned studies \n-Coordinating outreach events \n-Database tracking system \n-EDC tools \n-HTML, JavaScript, Java, WYSIWYG layout tools, e-commerce,blogs, forums \n-SMO (social media optimization) \n-SEO -Documentation Specialist, Data Coordinator in clinical research and the health sciences and Web Designer over a broad range of industries, both private and public enterprise. Expressed focus given to tracking and trending data in compliance with study guidelines pertaining to regulatory or study-participant aspects. Always interested in clinical study projects, as well as in start-up companies and organizations preferring not to divert their attention to website issues but rather on their core business. Specialties:-Coordinating reporting processes on assigned studies \n-Coordinating outreach events \n-Database tracking system \n-EDC tools \n-HTML, JavaScript, Java, WYSIWYG layout tools, e-commerce,blogs, forums \n-SMO (social media optimization) \n-SEO -Documentation Specialist, Data Coordinator in clinical research and the health sciences and Web Designer over a broad range of industries, both private and public enterprise. Expressed focus given to tracking and trending data in compliance with study guidelines pertaining to regulatory or study-participant aspects. Always interested in clinical study projects, as well as in start-up companies and organizations preferring not to divert their attention to website issues but rather on their core business. Specialties:-Coordinating reporting processes on assigned studies \n-Coordinating outreach events \n-Database tracking system \n-EDC tools \n-HTML, JavaScript, Java, WYSIWYG layout tools, e-commerce,blogs, forums \n-SMO (social media optimization) \n-SEO Experience Web Designer & Online Publicist Oikoumene Online Marketing and Design January 2010  – Present (5 years 8 months) Simple, compelling web design and online marketing for small-business niche market by combining search engine optimization incorporating user generated content (UGC) or social media optimization and link marketing. Principle web designer. Sandy Jane Wong, has grown with the dynamics of Internet technology and e-commerce from having been an online publicist in the 90s from Day 1 of the web. Her name, current web design business, and associated law communications can be seen on the entire first page of a Google search. Website Coordinator Association of Clinical Research Professionals - Phoenix Chapter 2009  –  2012  (3 years) Interim Regulatory Coordinator Catholic Healthcare West-Mercy Gilbert Med.Ctr January 2009  –  October 2009  (10 months) Managing regulatory documentation for innovative pharmacological, NIH, device, cardiac regeneration, and genomic research studies conducted by the Division of Cardiovascular Research. As the division's liaison with the hospital's Institutional Review Board, facilitating the process towards investigational drugs becoming FDA-approved therapy. Onsite Data Coordinator--St. Joseph's Hospital and Med. Ctr. Delta Pharma September 2008  –  December 2008  (4 months) -Collected and transcribed data from source documents to paper and electronic case report forms (EDC) for Barrow Neurological Institute's clinical research division. \n-Ensured data validity with continued query resolution and attention to discrepancies. \n-Tracked regulatory issues for submission to the Investigational Review Board Social Science Research Assistant Stanford University August 2002  –  June 2006  (3 years 11 months) -Administering protocol specific questionnaires and other evaluation instruments per Principle Investigator. \n-Maintaining accurate data collection and tracking database, achieving 100% compliance on study documents transmitted to coordinating center for analysis. \n-Expediting correspondence to access medical records while maintaining patient confidentiality. \n-Assisting Site Study Coordinator with verification, review, and web editing of study documents before faxing to the Coordinating Center including report generation. Co-Captain Santa Clara County Republican Party Santa Clara County Republican Party 2003  –  2005  (2 years) Honored precinct walker (over 10) in local and presidential campaigns to turn out the vote. Recruited volunteers to work at GOP rallies. Web Designer & Online Publicist Oikoumene Online Marketing and Design January 2010  – Present (5 years 8 months) Simple, compelling web design and online marketing for small-business niche market by combining search engine optimization incorporating user generated content (UGC) or social media optimization and link marketing. Principle web designer. Sandy Jane Wong, has grown with the dynamics of Internet technology and e-commerce from having been an online publicist in the 90s from Day 1 of the web. Her name, current web design business, and associated law communications can be seen on the entire first page of a Google search. Web Designer & Online Publicist Oikoumene Online Marketing and Design January 2010  – Present (5 years 8 months) Simple, compelling web design and online marketing for small-business niche market by combining search engine optimization incorporating user generated content (UGC) or social media optimization and link marketing. Principle web designer. Sandy Jane Wong, has grown with the dynamics of Internet technology and e-commerce from having been an online publicist in the 90s from Day 1 of the web. Her name, current web design business, and associated law communications can be seen on the entire first page of a Google search. Website Coordinator Association of Clinical Research Professionals - Phoenix Chapter 2009  –  2012  (3 years) Website Coordinator Association of Clinical Research Professionals - Phoenix Chapter 2009  –  2012  (3 years) Interim Regulatory Coordinator Catholic Healthcare West-Mercy Gilbert Med.Ctr January 2009  –  October 2009  (10 months) Managing regulatory documentation for innovative pharmacological, NIH, device, cardiac regeneration, and genomic research studies conducted by the Division of Cardiovascular Research. As the division's liaison with the hospital's Institutional Review Board, facilitating the process towards investigational drugs becoming FDA-approved therapy. Interim Regulatory Coordinator Catholic Healthcare West-Mercy Gilbert Med.Ctr January 2009  –  October 2009  (10 months) Managing regulatory documentation for innovative pharmacological, NIH, device, cardiac regeneration, and genomic research studies conducted by the Division of Cardiovascular Research. As the division's liaison with the hospital's Institutional Review Board, facilitating the process towards investigational drugs becoming FDA-approved therapy. Onsite Data Coordinator--St. Joseph's Hospital and Med. Ctr. Delta Pharma September 2008  –  December 2008  (4 months) -Collected and transcribed data from source documents to paper and electronic case report forms (EDC) for Barrow Neurological Institute's clinical research division. \n-Ensured data validity with continued query resolution and attention to discrepancies. \n-Tracked regulatory issues for submission to the Investigational Review Board Onsite Data Coordinator--St. Joseph's Hospital and Med. Ctr. Delta Pharma September 2008  –  December 2008  (4 months) -Collected and transcribed data from source documents to paper and electronic case report forms (EDC) for Barrow Neurological Institute's clinical research division. \n-Ensured data validity with continued query resolution and attention to discrepancies. \n-Tracked regulatory issues for submission to the Investigational Review Board Social Science Research Assistant Stanford University August 2002  –  June 2006  (3 years 11 months) -Administering protocol specific questionnaires and other evaluation instruments per Principle Investigator. \n-Maintaining accurate data collection and tracking database, achieving 100% compliance on study documents transmitted to coordinating center for analysis. \n-Expediting correspondence to access medical records while maintaining patient confidentiality. \n-Assisting Site Study Coordinator with verification, review, and web editing of study documents before faxing to the Coordinating Center including report generation. Social Science Research Assistant Stanford University August 2002  –  June 2006  (3 years 11 months) -Administering protocol specific questionnaires and other evaluation instruments per Principle Investigator. \n-Maintaining accurate data collection and tracking database, achieving 100% compliance on study documents transmitted to coordinating center for analysis. \n-Expediting correspondence to access medical records while maintaining patient confidentiality. \n-Assisting Site Study Coordinator with verification, review, and web editing of study documents before faxing to the Coordinating Center including report generation. Co-Captain Santa Clara County Republican Party Santa Clara County Republican Party 2003  –  2005  (2 years) Honored precinct walker (over 10) in local and presidential campaigns to turn out the vote. Recruited volunteers to work at GOP rallies. Co-Captain Santa Clara County Republican Party Santa Clara County Republican Party 2003  –  2005  (2 years) Honored precinct walker (over 10) in local and presidential campaigns to turn out the vote. Recruited volunteers to work at GOP rallies. Skills E-commerce Java SEO WYSIWYG layout tools HTML Databases Blogging Start-ups Online Marketing Web Design Marketing Social Media Marketing SMO Social Media Skills  E-commerce Java SEO WYSIWYG layout tools HTML Databases Blogging Start-ups Online Marketing Web Design Marketing Social Media Marketing SMO Social Media E-commerce Java SEO WYSIWYG layout tools HTML Databases Blogging Start-ups Online Marketing Web Design Marketing Social Media Marketing SMO Social Media E-commerce Java SEO WYSIWYG layout tools HTML Databases Blogging Start-ups Online Marketing Web Design Marketing Social Media Marketing SMO Social Media Education Golden Gate University MPA,  Health Services Management Focus on the legal aspects of health care John Hancock Elementary University of California, Berkeley BA,  Linguistics Golden Gate University MPA,  Health Services Management Focus on the legal aspects of health care Golden Gate University MPA,  Health Services Management Focus on the legal aspects of health care Golden Gate University MPA,  Health Services Management Focus on the legal aspects of health care John Hancock Elementary John Hancock Elementary John Hancock Elementary University of California, Berkeley BA,  Linguistics University of California, Berkeley BA,  Linguistics University of California, Berkeley BA,  Linguistics Honors & Awards ", "Experience Social Science Research Assistant Stanford University Social Science Research Assistant Stanford University Social Science Research Assistant Stanford University "]}