{"position": "Staff Scientist", "company": "Stanford University", "profiles": ["Experience Staff Scientist Stanford University School of Medicine 2004  – Present (11 years) Developing advanced microscopes for non-invasive multispectral 3-D imaging of cells in living subjects to further the understanding of cancer biology. Staff Scientist Stanford University School of Medicine 2004  – Present (11 years) Developing advanced microscopes for non-invasive multispectral 3-D imaging of cells in living subjects to further the understanding of cancer biology. Staff Scientist Stanford University School of Medicine 2004  – Present (11 years) Developing advanced microscopes for non-invasive multispectral 3-D imaging of cells in living subjects to further the understanding of cancer biology. Skills Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Skills  Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Confocal Microscopy Physics Science Cell Spectroscopy Optics R&D Microscopy Nanotechnology Matlab Laser Research Digital Imaging Simulations Cancer Education Stanford University PhD,  Applied Physics 1980  – 1987 UCSC BA,  Physics 1977  – 1980 Stanford University PhD,  Applied Physics 1980  – 1987 Stanford University PhD,  Applied Physics 1980  – 1987 Stanford University PhD,  Applied Physics 1980  – 1987 UCSC BA,  Physics 1977  – 1980 UCSC BA,  Physics 1977  – 1980 UCSC BA,  Physics 1977  – 1980 ", "Experience Staff Scientist Stanford University March 2014  – Present (1 year 6 months) Mass Spectrometrist SRI International January 2011  –  March 2014  (3 years 3 months) Staff Scientist Stanford University March 2014  – Present (1 year 6 months) Staff Scientist Stanford University March 2014  – Present (1 year 6 months) Mass Spectrometrist SRI International January 2011  –  March 2014  (3 years 3 months) Mass Spectrometrist SRI International January 2011  –  March 2014  (3 years 3 months) Skills Mass Spectrometry R&D Analytical Chemistry Chemistry Biochemistry Spectroscopy Molecular Biology Chromatography Data Analysis Skills  Mass Spectrometry R&D Analytical Chemistry Chemistry Biochemistry Spectroscopy Molecular Biology Chromatography Data Analysis Mass Spectrometry R&D Analytical Chemistry Chemistry Biochemistry Spectroscopy Molecular Biology Chromatography Data Analysis Mass Spectrometry R&D Analytical Chemistry Chemistry Biochemistry Spectroscopy Molecular Biology Chromatography Data Analysis Education University of California, Berkeley Doctor of Philosophy (Ph.D.),  Chemistry 2004  – 2009 University of Tulsa B.S.,  Biochemistry 2000  – 2004 University of California, Berkeley Doctor of Philosophy (Ph.D.),  Chemistry 2004  – 2009 University of California, Berkeley Doctor of Philosophy (Ph.D.),  Chemistry 2004  – 2009 University of California, Berkeley Doctor of Philosophy (Ph.D.),  Chemistry 2004  – 2009 University of Tulsa B.S.,  Biochemistry 2000  – 2004 University of Tulsa B.S.,  Biochemistry 2000  – 2004 University of Tulsa B.S.,  Biochemistry 2000  – 2004 ", "Summary I am researcher interested in enzyme reaction mechanism, with an emphasis in structure-based drug design. Summary I am researcher interested in enzyme reaction mechanism, with an emphasis in structure-based drug design. I am researcher interested in enzyme reaction mechanism, with an emphasis in structure-based drug design. I am researcher interested in enzyme reaction mechanism, with an emphasis in structure-based drug design. Experience Staff Scientist Stanford University Staff Scientist Stanford University Staff Scientist Stanford University ", "Experience Staff Scientist Stanford University Mass Spectrometry December 2004  – Present (10 years 9 months) Mass Spectrometrist Sidney Kimmel Cancer Center June 2002  –  December 2004  (2 years 7 months) Staff Scientist Stanford University Mass Spectrometry December 2004  – Present (10 years 9 months) Staff Scientist Stanford University Mass Spectrometry December 2004  – Present (10 years 9 months) Mass Spectrometrist Sidney Kimmel Cancer Center June 2002  –  December 2004  (2 years 7 months) Mass Spectrometrist Sidney Kimmel Cancer Center June 2002  –  December 2004  (2 years 7 months) Languages English Full professional proficiency Polish Native or bilingual proficiency German Limited working proficiency English Full professional proficiency Polish Native or bilingual proficiency German Limited working proficiency English Full professional proficiency Polish Native or bilingual proficiency German Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Biochemistry LC-MS Proteomics Mass Spectrometry Analytical Chemistry Quantitative Analytics Laboratory Safety Skills  Biochemistry LC-MS Proteomics Mass Spectrometry Analytical Chemistry Quantitative Analytics Laboratory Safety Biochemistry LC-MS Proteomics Mass Spectrometry Analytical Chemistry Quantitative Analytics Laboratory Safety Biochemistry LC-MS Proteomics Mass Spectrometry Analytical Chemistry Quantitative Analytics Laboratory Safety Education University of Warsaw M. Sc.,  Analytical and Inorganic Chemistry 1993  – 1998 XLIX LO im. J.W. Goethego University of Warsaw M. Sc.,  Analytical and Inorganic Chemistry 1993  – 1998 University of Warsaw M. Sc.,  Analytical and Inorganic Chemistry 1993  – 1998 University of Warsaw M. Sc.,  Analytical and Inorganic Chemistry 1993  – 1998 XLIX LO im. J.W. Goethego XLIX LO im. J.W. Goethego XLIX LO im. J.W. Goethego ", "Skills Stem Cells Molecular Biology Flow Cytometry Cell Culture Cell Biology Biochemistry Genomics Clinical Development Tissue Culture Lifesciences Cell Animal Models Immunology Clinical Trials Immunohistochemistry Transfection Protein Expression Immunofluorescence Confocal Microscopy Bioinformatics Oncology Molecular Cloning Protein Chemistry Microscopy Biotechnology Fluorescence Microscopy Protein Engineering Assay Development In Vitro qPCR Biomarker Discovery Genetics Western Blotting Protein Purification Epigenetics In Vivo Cancer Drug Discovery Science Cancer Research Sequencing ELISA Immunoprecipitation Infectious Diseases Fluorescence See 30+     See less Skills  Stem Cells Molecular Biology Flow Cytometry Cell Culture Cell Biology Biochemistry Genomics Clinical Development Tissue Culture Lifesciences Cell Animal Models Immunology Clinical Trials Immunohistochemistry Transfection Protein Expression Immunofluorescence Confocal Microscopy Bioinformatics Oncology Molecular Cloning Protein Chemistry Microscopy Biotechnology Fluorescence Microscopy Protein Engineering Assay Development In Vitro qPCR Biomarker Discovery Genetics Western Blotting Protein Purification Epigenetics In Vivo Cancer Drug Discovery Science Cancer Research Sequencing ELISA Immunoprecipitation Infectious Diseases Fluorescence See 30+     See less Stem Cells Molecular Biology Flow Cytometry Cell Culture Cell Biology Biochemistry Genomics Clinical Development Tissue Culture Lifesciences Cell Animal Models Immunology Clinical Trials Immunohistochemistry Transfection Protein Expression Immunofluorescence Confocal Microscopy Bioinformatics Oncology Molecular Cloning Protein Chemistry Microscopy Biotechnology Fluorescence Microscopy Protein Engineering Assay Development In Vitro qPCR Biomarker Discovery Genetics Western Blotting Protein Purification Epigenetics In Vivo Cancer Drug Discovery Science Cancer Research Sequencing ELISA Immunoprecipitation Infectious Diseases Fluorescence See 30+     See less Stem Cells Molecular Biology Flow Cytometry Cell Culture Cell Biology Biochemistry Genomics Clinical Development Tissue Culture Lifesciences Cell Animal Models Immunology Clinical Trials Immunohistochemistry Transfection Protein Expression Immunofluorescence Confocal Microscopy Bioinformatics Oncology Molecular Cloning Protein Chemistry Microscopy Biotechnology Fluorescence Microscopy Protein Engineering Assay Development In Vitro qPCR Biomarker Discovery Genetics Western Blotting Protein Purification Epigenetics In Vivo Cancer Drug Discovery Science Cancer Research Sequencing ELISA Immunoprecipitation Infectious Diseases Fluorescence See 30+     See less ", "Experience Staff Scientist - Computational Biology Stanford Center for Genomics and Personalized Medicine May 2013  – Present (2 years 4 months) Palo Alto, California I am affiliated with Stanford Center for Genomics and Personalized Medicine (SCGPM) at the Stanford School of Medicine where my main theme of research is in the area of bioinformatics for translational precision medicine.  \n \nAs the principal bioinformatician for Stanford Clinical Genomics Service (SCGS) I have designed and implemented the SCGS's clinically optimized genome processing and variation discovery pipeline (MedGAP) where I am also collaborating with a team of software engineers to enable cloud-based clinical genome processing for Stanford Hospital and SCGS. I am also member of the team for quality-control and post-processing and curation of genomic variations. \n \nIn collaboration with Google Genomics and as part of Million Veteran Program (MVP) I am also leading projects to design cloud-based software systems to enable distributed genome processing and large-scale structural variation interpretation using statistical and machine learning methods.  \n \nWe have a rich research community at Stanford Dept. of Genetics. This has led me to collaborations with a number of other exciting projects on different topics such as statistical approaches to cancer evolution, cancer specific genomic assay design, family-based genomics, viral genomics, and epigenetics.  \n \nI am also leading a number of SCGPM's activities to promote industry collaboration. This includes our current collaboration with Spiral Genomics Inc., Genalice Inc., Real Time Genomics Inc. as well as our past work with Seven Bridges Genomics and DNANexus.  \n \nI am a mentor in recently established GeneCamp Outreach program at SCGPM where we work with summer high-school interns on real-life projects in personalized medicine.  Postdoctoral Research Fellow Ontario Institute for Cancer Research 2011  –  2013  (2 years) Toronto, Canada Area Worked on the application of next generation sequencing and SNP-array genotyping technologies in cancer biomarker detection. \n \nMy research focused on evaluation and design of algorithms and methods for discovery and evaluation of genomic variations including copy number and structural variations.  \n \nPart of results of these studies were used in an Internationally funded project, Canadian Prostate Cancer Genome, as part of International Cancer Genome Consortium (ICGC), to discover underlying genomic signature of medium risk prostate cancer and to verify prostate tumor heterogeneity for diagnostic and prognostic purposes. Postdoctoral Research Fellow University of Toronto 2009  –  2011  (2 years) Toronto, Ontario, Canada Worked on statistical approach to molecular evolution and evolutionary sequencing analysis in general. Also worked on the application of information theory in characterization of protein binding sites, statistical prediction of the effect of large scale genomic variations on protein function. PhD Student McMaster University 2001  –  2006  (5 years) Hamilton, Ontario, Canada Statistical signal processing, Bayesian tracking, filtering and prediction, interplay of statistics and information theory, distributed estimation and compression. Staff Scientist - Computational Biology Stanford Center for Genomics and Personalized Medicine May 2013  – Present (2 years 4 months) Palo Alto, California I am affiliated with Stanford Center for Genomics and Personalized Medicine (SCGPM) at the Stanford School of Medicine where my main theme of research is in the area of bioinformatics for translational precision medicine.  \n \nAs the principal bioinformatician for Stanford Clinical Genomics Service (SCGS) I have designed and implemented the SCGS's clinically optimized genome processing and variation discovery pipeline (MedGAP) where I am also collaborating with a team of software engineers to enable cloud-based clinical genome processing for Stanford Hospital and SCGS. I am also member of the team for quality-control and post-processing and curation of genomic variations. \n \nIn collaboration with Google Genomics and as part of Million Veteran Program (MVP) I am also leading projects to design cloud-based software systems to enable distributed genome processing and large-scale structural variation interpretation using statistical and machine learning methods.  \n \nWe have a rich research community at Stanford Dept. of Genetics. This has led me to collaborations with a number of other exciting projects on different topics such as statistical approaches to cancer evolution, cancer specific genomic assay design, family-based genomics, viral genomics, and epigenetics.  \n \nI am also leading a number of SCGPM's activities to promote industry collaboration. This includes our current collaboration with Spiral Genomics Inc., Genalice Inc., Real Time Genomics Inc. as well as our past work with Seven Bridges Genomics and DNANexus.  \n \nI am a mentor in recently established GeneCamp Outreach program at SCGPM where we work with summer high-school interns on real-life projects in personalized medicine.  Staff Scientist - Computational Biology Stanford Center for Genomics and Personalized Medicine May 2013  – Present (2 years 4 months) Palo Alto, California I am affiliated with Stanford Center for Genomics and Personalized Medicine (SCGPM) at the Stanford School of Medicine where my main theme of research is in the area of bioinformatics for translational precision medicine.  \n \nAs the principal bioinformatician for Stanford Clinical Genomics Service (SCGS) I have designed and implemented the SCGS's clinically optimized genome processing and variation discovery pipeline (MedGAP) where I am also collaborating with a team of software engineers to enable cloud-based clinical genome processing for Stanford Hospital and SCGS. I am also member of the team for quality-control and post-processing and curation of genomic variations. \n \nIn collaboration with Google Genomics and as part of Million Veteran Program (MVP) I am also leading projects to design cloud-based software systems to enable distributed genome processing and large-scale structural variation interpretation using statistical and machine learning methods.  \n \nWe have a rich research community at Stanford Dept. of Genetics. This has led me to collaborations with a number of other exciting projects on different topics such as statistical approaches to cancer evolution, cancer specific genomic assay design, family-based genomics, viral genomics, and epigenetics.  \n \nI am also leading a number of SCGPM's activities to promote industry collaboration. This includes our current collaboration with Spiral Genomics Inc., Genalice Inc., Real Time Genomics Inc. as well as our past work with Seven Bridges Genomics and DNANexus.  \n \nI am a mentor in recently established GeneCamp Outreach program at SCGPM where we work with summer high-school interns on real-life projects in personalized medicine.  Postdoctoral Research Fellow Ontario Institute for Cancer Research 2011  –  2013  (2 years) Toronto, Canada Area Worked on the application of next generation sequencing and SNP-array genotyping technologies in cancer biomarker detection. \n \nMy research focused on evaluation and design of algorithms and methods for discovery and evaluation of genomic variations including copy number and structural variations.  \n \nPart of results of these studies were used in an Internationally funded project, Canadian Prostate Cancer Genome, as part of International Cancer Genome Consortium (ICGC), to discover underlying genomic signature of medium risk prostate cancer and to verify prostate tumor heterogeneity for diagnostic and prognostic purposes. Postdoctoral Research Fellow Ontario Institute for Cancer Research 2011  –  2013  (2 years) Toronto, Canada Area Worked on the application of next generation sequencing and SNP-array genotyping technologies in cancer biomarker detection. \n \nMy research focused on evaluation and design of algorithms and methods for discovery and evaluation of genomic variations including copy number and structural variations.  \n \nPart of results of these studies were used in an Internationally funded project, Canadian Prostate Cancer Genome, as part of International Cancer Genome Consortium (ICGC), to discover underlying genomic signature of medium risk prostate cancer and to verify prostate tumor heterogeneity for diagnostic and prognostic purposes. Postdoctoral Research Fellow University of Toronto 2009  –  2011  (2 years) Toronto, Ontario, Canada Worked on statistical approach to molecular evolution and evolutionary sequencing analysis in general. Also worked on the application of information theory in characterization of protein binding sites, statistical prediction of the effect of large scale genomic variations on protein function. Postdoctoral Research Fellow University of Toronto 2009  –  2011  (2 years) Toronto, Ontario, Canada Worked on statistical approach to molecular evolution and evolutionary sequencing analysis in general. Also worked on the application of information theory in characterization of protein binding sites, statistical prediction of the effect of large scale genomic variations on protein function. PhD Student McMaster University 2001  –  2006  (5 years) Hamilton, Ontario, Canada Statistical signal processing, Bayesian tracking, filtering and prediction, interplay of statistics and information theory, distributed estimation and compression. PhD Student McMaster University 2001  –  2006  (5 years) Hamilton, Ontario, Canada Statistical signal processing, Bayesian tracking, filtering and prediction, interplay of statistics and information theory, distributed estimation and compression. Skills Bioinformatics Genomics Genetics Molecular Biology Biotechnology Image Processing Signal Processing Machine Learning Computational Biology R Systems Biology Data Mining Matlab Simulations Python Computer Science LaTeX Algorithms DNA sequencing Sequencing Pattern Recognition Biomarker Discovery Statistics Cancer Lifesciences Biomarkers Biostatistics Genotyping Personalized Medicine Sequence Analysis Protein Chemistry Scientific Computing Science Scientific Writing Mathematical Modeling Data Analysis Clinical Research Life Sciences Proteomics Microscopy DNA Sequencing See 26+     See less Skills  Bioinformatics Genomics Genetics Molecular Biology Biotechnology Image Processing Signal Processing Machine Learning Computational Biology R Systems Biology Data Mining Matlab Simulations Python Computer Science LaTeX Algorithms DNA sequencing Sequencing Pattern Recognition Biomarker Discovery Statistics Cancer Lifesciences Biomarkers Biostatistics Genotyping Personalized Medicine Sequence Analysis Protein Chemistry Scientific Computing Science Scientific Writing Mathematical Modeling Data Analysis Clinical Research Life Sciences Proteomics Microscopy DNA Sequencing See 26+     See less Bioinformatics Genomics Genetics Molecular Biology Biotechnology Image Processing Signal Processing Machine Learning Computational Biology R Systems Biology Data Mining Matlab Simulations Python Computer Science LaTeX Algorithms DNA sequencing Sequencing Pattern Recognition Biomarker Discovery Statistics Cancer Lifesciences Biomarkers Biostatistics Genotyping Personalized Medicine Sequence Analysis Protein Chemistry Scientific Computing Science Scientific Writing Mathematical Modeling Data Analysis Clinical Research Life Sciences Proteomics Microscopy DNA Sequencing See 26+     See less Bioinformatics Genomics Genetics Molecular Biology Biotechnology Image Processing Signal Processing Machine Learning Computational Biology R Systems Biology Data Mining Matlab Simulations Python Computer Science LaTeX Algorithms DNA sequencing Sequencing Pattern Recognition Biomarker Discovery Statistics Cancer Lifesciences Biomarkers Biostatistics Genotyping Personalized Medicine Sequence Analysis Protein Chemistry Scientific Computing Science Scientific Writing Mathematical Modeling Data Analysis Clinical Research Life Sciences Proteomics Microscopy DNA Sequencing See 26+     See less Education McMaster University PhD,  Electrical and Computer Engineering 2001  – 2007 Stanford University McMaster University PhD,  Electrical and Computer Engineering 2001  – 2007 McMaster University PhD,  Electrical and Computer Engineering 2001  – 2007 McMaster University PhD,  Electrical and Computer Engineering 2001  – 2007 Stanford University Stanford University Stanford University ", "Skills Structural Biology Cell Culture Protein Chemistry Biotechnology PCR Protein Crystallization X-ray crystallography Protein Purification Protein Expression Biophysics Science Biochemistry Western Blotting Lifesciences Molecular Biology Bioinformatics Protein Engineering Crystallography Scientific Writing Chemistry Chromatography Drug Design Spectroscopy Cell Biology High Throughput... Microscopy Drug Discovery Computational Biology Enzyme Kinetics Purification Life Sciences See 16+     See less Skills  Structural Biology Cell Culture Protein Chemistry Biotechnology PCR Protein Crystallization X-ray crystallography Protein Purification Protein Expression Biophysics Science Biochemistry Western Blotting Lifesciences Molecular Biology Bioinformatics Protein Engineering Crystallography Scientific Writing Chemistry Chromatography Drug Design Spectroscopy Cell Biology High Throughput... Microscopy Drug Discovery Computational Biology Enzyme Kinetics Purification Life Sciences See 16+     See less Structural Biology Cell Culture Protein Chemistry Biotechnology PCR Protein Crystallization X-ray crystallography Protein Purification Protein Expression Biophysics Science Biochemistry Western Blotting Lifesciences Molecular Biology Bioinformatics Protein Engineering Crystallography Scientific Writing Chemistry Chromatography Drug Design Spectroscopy Cell Biology High Throughput... Microscopy Drug Discovery Computational Biology Enzyme Kinetics Purification Life Sciences See 16+     See less Structural Biology Cell Culture Protein Chemistry Biotechnology PCR Protein Crystallization X-ray crystallography Protein Purification Protein Expression Biophysics Science Biochemistry Western Blotting Lifesciences Molecular Biology Bioinformatics Protein Engineering Crystallography Scientific Writing Chemistry Chromatography Drug Design Spectroscopy Cell Biology High Throughput... Microscopy Drug Discovery Computational Biology Enzyme Kinetics Purification Life Sciences See 16+     See less ", "Experience Staff Scientist Stanford University Staff Scientist Stanford University Staff Scientist Stanford University ", "Languages   Skills qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less Skills  qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less qPCR Western Blotting Molecular Biology SDS-PAGE Cell Biology Molecular Cloning Protein Expression Molecular Genetics DNA Biochemistry Genetics Protein Chemistry Mutagenesis Microbiology Microscopy PCR Genomics DNA sequencing Cell Bioinformatics High Throughput... Purification Synthetic Biology Systems Biology Bioengineering Genetic Engineering Strain Development Metabolic Engineering RNA isolation Assay Development Flow Cytometry Next Generation... Fluorescence Microscopy Confocal Microscopy Tissue Culture Cell Culture Fluorescence Life Sciences Biotechnology Recombinant DNA DNA Sequencing See 26+     See less Honors & Awards Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Conferences and Presentations Algae Biomass Organization; Algae Biomass Summit: San Diego, California  \nPlatform Presentation 2014 \n \nCold Spring Harbor Cell Cycle Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2008 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPlatform Presentation 2007 \n \nFASEB Meeting, Palm Desert, California: \nPoster Presentation 2006 \n \nCold Spring Harbor Yeast Meeting, Cold Spring Harbor, New York:  \nPoster Presentation 2005 \n \n \n \n \n Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 Additional Honors & Awards President of Cell, Molecular, and Developmental Biology GSA 2007-2008 \n \nSpring Symposium for Cell, Molecular, and Developmental Biology (UC Riverside): \nFirst place award: 2008 \n \nSecond place award and peer-reviewed award: 2009 ", "Summary Current research: Method development and application of SRM/AQUA/TMT/SILAC to peptide quantification  \n \nExpertise and Research Experience \n \n•\tExpertise on Protein Mass Spectrometry\t \n−\tLiquid chromatography coupled with tandem mass spectrometry \n−\tDigestion of protein in gel, on beads, in solution and on column  \n−\tConstruction of microcapillary nanoflow HPLC columns \n−\tOperation and maintenance of mass spectrometers (LTQ, LTQ-Orbitrap, LTQ-FT-ICR ) \n−\tManual annotation of ETD/CAD/HCD spectra \n−\tMass spectrometry software: XCalibur, OMSSA, Proteome Discoverer, Mascot, ProSightPC \n \n•\tGraduate Research Summary \n−\tProtein PTMs characterization using ETD and CAD \n−\tApplication of immobilized metal affinity chromatography (IMAC) and metal oxide affinity chromatography (MOAC) to enrich phosphopeptides \n−\tMiddle-down sequencing of monoclonal antibodies using immobilized protease for size-controlled proteolysis \n−\tEmployment of search algorithms and bioinformatics tools to facilitate mass spectral data analysis \n \n•\tIndustrial Experience on Monoclonal Antibody Characterization \n−\tIntact mass analysis \n−\tReduced peptide mapping \n−\tDisulfide bond linkage characterization \n−\tN-glycan analysis \n−\tMonoclonal antibody de novo sequencing \n−\tIND and BLA regulatory filings Summary Current research: Method development and application of SRM/AQUA/TMT/SILAC to peptide quantification  \n \nExpertise and Research Experience \n \n•\tExpertise on Protein Mass Spectrometry\t \n−\tLiquid chromatography coupled with tandem mass spectrometry \n−\tDigestion of protein in gel, on beads, in solution and on column  \n−\tConstruction of microcapillary nanoflow HPLC columns \n−\tOperation and maintenance of mass spectrometers (LTQ, LTQ-Orbitrap, LTQ-FT-ICR ) \n−\tManual annotation of ETD/CAD/HCD spectra \n−\tMass spectrometry software: XCalibur, OMSSA, Proteome Discoverer, Mascot, ProSightPC \n \n•\tGraduate Research Summary \n−\tProtein PTMs characterization using ETD and CAD \n−\tApplication of immobilized metal affinity chromatography (IMAC) and metal oxide affinity chromatography (MOAC) to enrich phosphopeptides \n−\tMiddle-down sequencing of monoclonal antibodies using immobilized protease for size-controlled proteolysis \n−\tEmployment of search algorithms and bioinformatics tools to facilitate mass spectral data analysis \n \n•\tIndustrial Experience on Monoclonal Antibody Characterization \n−\tIntact mass analysis \n−\tReduced peptide mapping \n−\tDisulfide bond linkage characterization \n−\tN-glycan analysis \n−\tMonoclonal antibody de novo sequencing \n−\tIND and BLA regulatory filings Current research: Method development and application of SRM/AQUA/TMT/SILAC to peptide quantification  \n \nExpertise and Research Experience \n \n•\tExpertise on Protein Mass Spectrometry\t \n−\tLiquid chromatography coupled with tandem mass spectrometry \n−\tDigestion of protein in gel, on beads, in solution and on column  \n−\tConstruction of microcapillary nanoflow HPLC columns \n−\tOperation and maintenance of mass spectrometers (LTQ, LTQ-Orbitrap, LTQ-FT-ICR ) \n−\tManual annotation of ETD/CAD/HCD spectra \n−\tMass spectrometry software: XCalibur, OMSSA, Proteome Discoverer, Mascot, ProSightPC \n \n•\tGraduate Research Summary \n−\tProtein PTMs characterization using ETD and CAD \n−\tApplication of immobilized metal affinity chromatography (IMAC) and metal oxide affinity chromatography (MOAC) to enrich phosphopeptides \n−\tMiddle-down sequencing of monoclonal antibodies using immobilized protease for size-controlled proteolysis \n−\tEmployment of search algorithms and bioinformatics tools to facilitate mass spectral data analysis \n \n•\tIndustrial Experience on Monoclonal Antibody Characterization \n−\tIntact mass analysis \n−\tReduced peptide mapping \n−\tDisulfide bond linkage characterization \n−\tN-glycan analysis \n−\tMonoclonal antibody de novo sequencing \n−\tIND and BLA regulatory filings Current research: Method development and application of SRM/AQUA/TMT/SILAC to peptide quantification  \n \nExpertise and Research Experience \n \n•\tExpertise on Protein Mass Spectrometry\t \n−\tLiquid chromatography coupled with tandem mass spectrometry \n−\tDigestion of protein in gel, on beads, in solution and on column  \n−\tConstruction of microcapillary nanoflow HPLC columns \n−\tOperation and maintenance of mass spectrometers (LTQ, LTQ-Orbitrap, LTQ-FT-ICR ) \n−\tManual annotation of ETD/CAD/HCD spectra \n−\tMass spectrometry software: XCalibur, OMSSA, Proteome Discoverer, Mascot, ProSightPC \n \n•\tGraduate Research Summary \n−\tProtein PTMs characterization using ETD and CAD \n−\tApplication of immobilized metal affinity chromatography (IMAC) and metal oxide affinity chromatography (MOAC) to enrich phosphopeptides \n−\tMiddle-down sequencing of monoclonal antibodies using immobilized protease for size-controlled proteolysis \n−\tEmployment of search algorithms and bioinformatics tools to facilitate mass spectral data analysis \n \n•\tIndustrial Experience on Monoclonal Antibody Characterization \n−\tIntact mass analysis \n−\tReduced peptide mapping \n−\tDisulfide bond linkage characterization \n−\tN-glycan analysis \n−\tMonoclonal antibody de novo sequencing \n−\tIND and BLA regulatory filings Experience Staff Scientist Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Elias Lab \nDepartment of Chemical & Systems Biology \nStanford University School of Medicine Research Assistant University of Virginia August 2009  –  May 2014  (4 years 10 months) Charlottesville, Virginia Area Advisor: Professor Donald F. Hunt Intern Regeneron Pharmaceuticals June 2012  –  August 2012  (3 months) Tarrytown, NY Responsibility: Coupling TriVersa NanoMate with LTQ-Orbitrap Velos to support monoclonal antibody characterization, including peptide mapping, disulfide bond analysis, and carbohydrate analysis. \nAdvisor: Dr. Qiangwei Xia Staff Scientist Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Elias Lab \nDepartment of Chemical & Systems Biology \nStanford University School of Medicine Staff Scientist Stanford University June 2014  – Present (1 year 3 months) Stanford, CA Elias Lab \nDepartment of Chemical & Systems Biology \nStanford University School of Medicine Research Assistant University of Virginia August 2009  –  May 2014  (4 years 10 months) Charlottesville, Virginia Area Advisor: Professor Donald F. Hunt Research Assistant University of Virginia August 2009  –  May 2014  (4 years 10 months) Charlottesville, Virginia Area Advisor: Professor Donald F. Hunt Intern Regeneron Pharmaceuticals June 2012  –  August 2012  (3 months) Tarrytown, NY Responsibility: Coupling TriVersa NanoMate with LTQ-Orbitrap Velos to support monoclonal antibody characterization, including peptide mapping, disulfide bond analysis, and carbohydrate analysis. \nAdvisor: Dr. Qiangwei Xia Intern Regeneron Pharmaceuticals June 2012  –  August 2012  (3 months) Tarrytown, NY Responsibility: Coupling TriVersa NanoMate with LTQ-Orbitrap Velos to support monoclonal antibody characterization, including peptide mapping, disulfide bond analysis, and carbohydrate analysis. \nAdvisor: Dr. Qiangwei Xia Skills Mass Spectrometry HPLC LC-MS Protein Chemistry Spectroscopy Chemistry Peptides Analytical Chemistry Organic Synthesis UV/Vis Characterization NMR Bioinformatics Monoclonal Antibodies Affinity Chromatography Biochemistry Data Analysis See 2+     See less Skills  Mass Spectrometry HPLC LC-MS Protein Chemistry Spectroscopy Chemistry Peptides Analytical Chemistry Organic Synthesis UV/Vis Characterization NMR Bioinformatics Monoclonal Antibodies Affinity Chromatography Biochemistry Data Analysis See 2+     See less Mass Spectrometry HPLC LC-MS Protein Chemistry Spectroscopy Chemistry Peptides Analytical Chemistry Organic Synthesis UV/Vis Characterization NMR Bioinformatics Monoclonal Antibodies Affinity Chromatography Biochemistry Data Analysis See 2+     See less Mass Spectrometry HPLC LC-MS Protein Chemistry Spectroscopy Chemistry Peptides Analytical Chemistry Organic Synthesis UV/Vis Characterization NMR Bioinformatics Monoclonal Antibodies Affinity Chromatography Biochemistry Data Analysis See 2+     See less Education University of Virginia PhD,  Chemistry 2009  – 2014 Advisor: Professor Donald Hunt Nankai University Bachelor of Science (BS),  Chemistry 2005  – 2009 University of Virginia PhD,  Chemistry 2009  – 2014 Advisor: Professor Donald Hunt University of Virginia PhD,  Chemistry 2009  – 2014 Advisor: Professor Donald Hunt University of Virginia PhD,  Chemistry 2009  – 2014 Advisor: Professor Donald Hunt Nankai University Bachelor of Science (BS),  Chemistry 2005  – 2009 Nankai University Bachelor of Science (BS),  Chemistry 2005  – 2009 Nankai University Bachelor of Science (BS),  Chemistry 2005  – 2009 ", "Summary Electron Microscopy \n3D (Serial) SEM \nVariable Pressure (VP) SEM application \nHydrogel and Biomaterial Imaging \nSynchrotron (XRF) application to Biology \nEM Technique Development (SEM and TEM) \nVisualization: Light and Electron Microscopy \nCorrelative Imaging \nMicrobial Biofilms \nBio-energy \nPlant and Microbial Sciences and Interfaces \nMonoterpene (Essential Oils) Metabolism \nGas chromography \nComplexity Theory and Fractal Analysis \nBiology Teaching in Higher Education \n \n \nSpecialties: Electron Microscopy \nImaging Techniques \nBiofilms \nBiofuels \nAssay and Protocol development Summary Electron Microscopy \n3D (Serial) SEM \nVariable Pressure (VP) SEM application \nHydrogel and Biomaterial Imaging \nSynchrotron (XRF) application to Biology \nEM Technique Development (SEM and TEM) \nVisualization: Light and Electron Microscopy \nCorrelative Imaging \nMicrobial Biofilms \nBio-energy \nPlant and Microbial Sciences and Interfaces \nMonoterpene (Essential Oils) Metabolism \nGas chromography \nComplexity Theory and Fractal Analysis \nBiology Teaching in Higher Education \n \n \nSpecialties: Electron Microscopy \nImaging Techniques \nBiofilms \nBiofuels \nAssay and Protocol development Electron Microscopy \n3D (Serial) SEM \nVariable Pressure (VP) SEM application \nHydrogel and Biomaterial Imaging \nSynchrotron (XRF) application to Biology \nEM Technique Development (SEM and TEM) \nVisualization: Light and Electron Microscopy \nCorrelative Imaging \nMicrobial Biofilms \nBio-energy \nPlant and Microbial Sciences and Interfaces \nMonoterpene (Essential Oils) Metabolism \nGas chromography \nComplexity Theory and Fractal Analysis \nBiology Teaching in Higher Education \n \n \nSpecialties: Electron Microscopy \nImaging Techniques \nBiofilms \nBiofuels \nAssay and Protocol development Electron Microscopy \n3D (Serial) SEM \nVariable Pressure (VP) SEM application \nHydrogel and Biomaterial Imaging \nSynchrotron (XRF) application to Biology \nEM Technique Development (SEM and TEM) \nVisualization: Light and Electron Microscopy \nCorrelative Imaging \nMicrobial Biofilms \nBio-energy \nPlant and Microbial Sciences and Interfaces \nMonoterpene (Essential Oils) Metabolism \nGas chromography \nComplexity Theory and Fractal Analysis \nBiology Teaching in Higher Education \n \n \nSpecialties: Electron Microscopy \nImaging Techniques \nBiofilms \nBiofuels \nAssay and Protocol development Experience Senior Scientist Stanford University School of Medicine 2006  – Present (9 years) Electron Microscopist SEM Specialist Stanford University 2006  – Present (9 years) Research Scientist Project Manager and Lecturer University of Stellenbosch January 2001  –  December 2004  (4 years) Project Manager and Researcher U.Stellenbosch \nClaude Leon Foundation Fellow at U.Stellenbosch Post doc University of Pretoria 1986  –  1987  (1 year) TEM investigation of Cyanobacterial symbiosis in corolloid roots of Cycad species. Senior Scientist Stanford University School of Medicine 2006  – Present (9 years) Electron Microscopist Senior Scientist Stanford University School of Medicine 2006  – Present (9 years) Electron Microscopist SEM Specialist Stanford University 2006  – Present (9 years) Research Scientist SEM Specialist Stanford University 2006  – Present (9 years) Research Scientist Project Manager and Lecturer University of Stellenbosch January 2001  –  December 2004  (4 years) Project Manager and Researcher U.Stellenbosch \nClaude Leon Foundation Fellow at U.Stellenbosch Project Manager and Lecturer University of Stellenbosch January 2001  –  December 2004  (4 years) Project Manager and Researcher U.Stellenbosch \nClaude Leon Foundation Fellow at U.Stellenbosch Post doc University of Pretoria 1986  –  1987  (1 year) TEM investigation of Cyanobacterial symbiosis in corolloid roots of Cycad species. Post doc University of Pretoria 1986  –  1987  (1 year) TEM investigation of Cyanobacterial symbiosis in corolloid roots of Cycad species. Languages Afrikaans German Afrikaans German Afrikaans German Skills Electron Microscopy Biofilms Biofuels Digital Imaging Science TEM Cell Microbiology Molecular Biology Assay Development Biomaterials Skills  Electron Microscopy Biofilms Biofuels Digital Imaging Science TEM Cell Microbiology Molecular Biology Assay Development Biomaterials Electron Microscopy Biofilms Biofuels Digital Imaging Science TEM Cell Microbiology Molecular Biology Assay Development Biomaterials Electron Microscopy Biofilms Biofuels Digital Imaging Science TEM Cell Microbiology Molecular Biology Assay Development Biomaterials Education Stellenbosch University/Universiteit Stellenbosch Master of Philosophy (MPhil),  Higher Education/Higher Education Administration 2001  – 2002 University of Pretoria/Universiteit van Pretoria DSc,  Electron Microscopy and Plant Sciences 1983  – 1986 Indiana University Bloomington PhD,  Plant Sciences 1983  – 1984 Stellenbosch University/Universiteit Stellenbosch BSc, Hons BSc, MSc,  Botany ,  Mathematics 1977  – 1983 Stellenbosch University/Universiteit Stellenbosch Master of Philosophy (MPhil),  Higher Education/Higher Education Administration 2001  – 2002 Stellenbosch University/Universiteit Stellenbosch Master of Philosophy (MPhil),  Higher Education/Higher Education Administration 2001  – 2002 Stellenbosch University/Universiteit Stellenbosch Master of Philosophy (MPhil),  Higher Education/Higher Education Administration 2001  – 2002 University of Pretoria/Universiteit van Pretoria DSc,  Electron Microscopy and Plant Sciences 1983  – 1986 University of Pretoria/Universiteit van Pretoria DSc,  Electron Microscopy and Plant Sciences 1983  – 1986 University of Pretoria/Universiteit van Pretoria DSc,  Electron Microscopy and Plant Sciences 1983  – 1986 Indiana University Bloomington PhD,  Plant Sciences 1983  – 1984 Indiana University Bloomington PhD,  Plant Sciences 1983  – 1984 Indiana University Bloomington PhD,  Plant Sciences 1983  – 1984 Stellenbosch University/Universiteit Stellenbosch BSc, Hons BSc, MSc,  Botany ,  Mathematics 1977  – 1983 Stellenbosch University/Universiteit Stellenbosch BSc, Hons BSc, MSc,  Botany ,  Mathematics 1977  – 1983 Stellenbosch University/Universiteit Stellenbosch BSc, Hons BSc, MSc,  Botany ,  Mathematics 1977  – 1983 Honors & Awards Additional Honors & Awards Microscopy Society of America (MSA) Technology Development Award (2010) \nWeizmann Institute Internship (1981-1982) \nCSIR Merit Sholarship PhD (1983-1986) \nClaude Leon Foundation Fellowship (2002-2004) \nShell Scholarship (1978-1980) Additional Honors & Awards Microscopy Society of America (MSA) Technology Development Award (2010) \nWeizmann Institute Internship (1981-1982) \nCSIR Merit Sholarship PhD (1983-1986) \nClaude Leon Foundation Fellowship (2002-2004) \nShell Scholarship (1978-1980) Additional Honors & Awards Microscopy Society of America (MSA) Technology Development Award (2010) \nWeizmann Institute Internship (1981-1982) \nCSIR Merit Sholarship PhD (1983-1986) \nClaude Leon Foundation Fellowship (2002-2004) \nShell Scholarship (1978-1980) Additional Honors & Awards Microscopy Society of America (MSA) Technology Development Award (2010) \nWeizmann Institute Internship (1981-1982) \nCSIR Merit Sholarship PhD (1983-1986) \nClaude Leon Foundation Fellowship (2002-2004) \nShell Scholarship (1978-1980) ", "Summary I have found that effective communication, critical analysis, and collaboration are key for success in science. I am a team-oriented scientist who leads from the bench and has a passion for performing hypothesis-driven research. Summary I have found that effective communication, critical analysis, and collaboration are key for success in science. I am a team-oriented scientist who leads from the bench and has a passion for performing hypothesis-driven research. I have found that effective communication, critical analysis, and collaboration are key for success in science. I am a team-oriented scientist who leads from the bench and has a passion for performing hypothesis-driven research. I have found that effective communication, critical analysis, and collaboration are key for success in science. I am a team-oriented scientist who leads from the bench and has a passion for performing hypothesis-driven research. Experience Member of the Board of Directors Santa Clara Valley Science & Engineering Fair Association (SCVSEFA) July 2015  – Present (2 months) Silicon Valley The mission of SCVSEFA is: to awaken more students to the wonder and power of Science, Technology, Engineering, and Mathematics (STEM). This is accomplished by holding an annual, regional Science and Engineering Fair for 6th-12th grade students (usually 900 - 1000 participants). Staff Scientist Stanford University November 2014  – Present (10 months) San Francisco Bay Area Postdoctoral Researcher Stanford University September 2012  –  November 2014  (2 years 3 months) The proper folding of many newly-synthesized proteins requires the assistance of molecular chaperones because the crowded intracellular environment can promote protein misfolding and aggregation. TRiC is a molecular chaperone required for the proper production of tumor suppressor proteins as well as critical components of the cytoskeleton. I developed molecular sensors to monitor TRiC function in cells. These sensors can be employed to assay TRiC function in diverse conditions such as stress and models of human pathological states. Math & Science Tutor San Francisco State University September 2003  –  June 2004  (10 months) Learning Assistance Center I worked with the diverse population of SFSU including students of different backgrounds, religions, and ages. Prior to starting, I received over ten hours of workshops that taught me effective approaches to assist students develop effective problem solving strategies. \n Curriculum Designer UC Santa Barbara June 2002  –  June 2003  (1 year 1 month) Santa Barbara, California Area Created web-based learning modules to explore structure/function relationships of biological macromolecules (Computational Biochemistry Laboratory course) Member of the Board of Directors Santa Clara Valley Science & Engineering Fair Association (SCVSEFA) July 2015  – Present (2 months) Silicon Valley The mission of SCVSEFA is: to awaken more students to the wonder and power of Science, Technology, Engineering, and Mathematics (STEM). This is accomplished by holding an annual, regional Science and Engineering Fair for 6th-12th grade students (usually 900 - 1000 participants). Member of the Board of Directors Santa Clara Valley Science & Engineering Fair Association (SCVSEFA) July 2015  – Present (2 months) Silicon Valley The mission of SCVSEFA is: to awaken more students to the wonder and power of Science, Technology, Engineering, and Mathematics (STEM). This is accomplished by holding an annual, regional Science and Engineering Fair for 6th-12th grade students (usually 900 - 1000 participants). Staff Scientist Stanford University November 2014  – Present (10 months) San Francisco Bay Area Staff Scientist Stanford University November 2014  – Present (10 months) San Francisco Bay Area Postdoctoral Researcher Stanford University September 2012  –  November 2014  (2 years 3 months) The proper folding of many newly-synthesized proteins requires the assistance of molecular chaperones because the crowded intracellular environment can promote protein misfolding and aggregation. TRiC is a molecular chaperone required for the proper production of tumor suppressor proteins as well as critical components of the cytoskeleton. I developed molecular sensors to monitor TRiC function in cells. These sensors can be employed to assay TRiC function in diverse conditions such as stress and models of human pathological states. Postdoctoral Researcher Stanford University September 2012  –  November 2014  (2 years 3 months) The proper folding of many newly-synthesized proteins requires the assistance of molecular chaperones because the crowded intracellular environment can promote protein misfolding and aggregation. TRiC is a molecular chaperone required for the proper production of tumor suppressor proteins as well as critical components of the cytoskeleton. I developed molecular sensors to monitor TRiC function in cells. These sensors can be employed to assay TRiC function in diverse conditions such as stress and models of human pathological states. Math & Science Tutor San Francisco State University September 2003  –  June 2004  (10 months) Learning Assistance Center I worked with the diverse population of SFSU including students of different backgrounds, religions, and ages. Prior to starting, I received over ten hours of workshops that taught me effective approaches to assist students develop effective problem solving strategies. \n Math & Science Tutor San Francisco State University September 2003  –  June 2004  (10 months) Learning Assistance Center I worked with the diverse population of SFSU including students of different backgrounds, religions, and ages. Prior to starting, I received over ten hours of workshops that taught me effective approaches to assist students develop effective problem solving strategies. \n Curriculum Designer UC Santa Barbara June 2002  –  June 2003  (1 year 1 month) Santa Barbara, California Area Created web-based learning modules to explore structure/function relationships of biological macromolecules (Computational Biochemistry Laboratory course) Curriculum Designer UC Santa Barbara June 2002  –  June 2003  (1 year 1 month) Santa Barbara, California Area Created web-based learning modules to explore structure/function relationships of biological macromolecules (Computational Biochemistry Laboratory course) Languages   Skills Molecular Biology Cell Biology Cell Culture Biochemistry Western Blotting Microscopy PCR Science Fluorescence Microscopy Molecular Cloning Genetics Protein Purification Protein Expression Immunohistochemistry Cell Life Sciences Research See 2+     See less Skills  Molecular Biology Cell Biology Cell Culture Biochemistry Western Blotting Microscopy PCR Science Fluorescence Microscopy Molecular Cloning Genetics Protein Purification Protein Expression Immunohistochemistry Cell Life Sciences Research See 2+     See less Molecular Biology Cell Biology Cell Culture Biochemistry Western Blotting Microscopy PCR Science Fluorescence Microscopy Molecular Cloning Genetics Protein Purification Protein Expression Immunohistochemistry Cell Life Sciences Research See 2+     See less Molecular Biology Cell Biology Cell Culture Biochemistry Western Blotting Microscopy PCR Science Fluorescence Microscopy Molecular Cloning Genetics Protein Purification Protein Expression Immunohistochemistry Cell Life Sciences Research See 2+     See less Education Stanford University Doctor of Philosophy (Ph.D.),  Cell/Cellular and Molecular Biology 2006  – 2012 During my doctoral training in the Gozani lab I: \n1) Studied human protein modules that sense lysine methylation events which play a principal role in governing epigenetic processes. I, in collaboration with other members of the lab, screened through a library of putative methyl-lysine binding domains, which resulted in the identification of several new modification-dependent chromatin binders. \n \n2) Discovered a critical role for the phospholipid phosphatidylinositol-5-phosphate (PI5P) in the stress-induced gene expression program mediated by ING2, a member of the human Inhibitor of Growth family of tumor suppressors. I took a genomic approach to globally identify promoters bound by ING2 in the presence of DNA damage as well as the subsequent gene expression changes. My investigation uncovered that a node of the ING2 network is dysregulated when ING2 cannot associate with PtdIns(5)P. This work establishes a novel role for PtdIns(5)P as a cofactor that targets ING2 to gene promoters. San Francisco State University Master of Science (M.S.),  Microbiology , General 2004  – 2006 I was the recipient of the Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) scholarship from the National Institutes of Health (NIH). University of California, Santa Barbara Bachelor of Science (B.S.),  Microbiology , General 1999  – 2003 Minored in Chemistry Activities and Societies:  Resident Assistant ,  San Nicolas 2001-2002 Stanford University Doctor of Philosophy (Ph.D.),  Cell/Cellular and Molecular Biology 2006  – 2012 During my doctoral training in the Gozani lab I: \n1) Studied human protein modules that sense lysine methylation events which play a principal role in governing epigenetic processes. I, in collaboration with other members of the lab, screened through a library of putative methyl-lysine binding domains, which resulted in the identification of several new modification-dependent chromatin binders. \n \n2) Discovered a critical role for the phospholipid phosphatidylinositol-5-phosphate (PI5P) in the stress-induced gene expression program mediated by ING2, a member of the human Inhibitor of Growth family of tumor suppressors. I took a genomic approach to globally identify promoters bound by ING2 in the presence of DNA damage as well as the subsequent gene expression changes. My investigation uncovered that a node of the ING2 network is dysregulated when ING2 cannot associate with PtdIns(5)P. This work establishes a novel role for PtdIns(5)P as a cofactor that targets ING2 to gene promoters. Stanford University Doctor of Philosophy (Ph.D.),  Cell/Cellular and Molecular Biology 2006  – 2012 During my doctoral training in the Gozani lab I: \n1) Studied human protein modules that sense lysine methylation events which play a principal role in governing epigenetic processes. I, in collaboration with other members of the lab, screened through a library of putative methyl-lysine binding domains, which resulted in the identification of several new modification-dependent chromatin binders. \n \n2) Discovered a critical role for the phospholipid phosphatidylinositol-5-phosphate (PI5P) in the stress-induced gene expression program mediated by ING2, a member of the human Inhibitor of Growth family of tumor suppressors. I took a genomic approach to globally identify promoters bound by ING2 in the presence of DNA damage as well as the subsequent gene expression changes. My investigation uncovered that a node of the ING2 network is dysregulated when ING2 cannot associate with PtdIns(5)P. This work establishes a novel role for PtdIns(5)P as a cofactor that targets ING2 to gene promoters. Stanford University Doctor of Philosophy (Ph.D.),  Cell/Cellular and Molecular Biology 2006  – 2012 During my doctoral training in the Gozani lab I: \n1) Studied human protein modules that sense lysine methylation events which play a principal role in governing epigenetic processes. I, in collaboration with other members of the lab, screened through a library of putative methyl-lysine binding domains, which resulted in the identification of several new modification-dependent chromatin binders. \n \n2) Discovered a critical role for the phospholipid phosphatidylinositol-5-phosphate (PI5P) in the stress-induced gene expression program mediated by ING2, a member of the human Inhibitor of Growth family of tumor suppressors. I took a genomic approach to globally identify promoters bound by ING2 in the presence of DNA damage as well as the subsequent gene expression changes. My investigation uncovered that a node of the ING2 network is dysregulated when ING2 cannot associate with PtdIns(5)P. This work establishes a novel role for PtdIns(5)P as a cofactor that targets ING2 to gene promoters. San Francisco State University Master of Science (M.S.),  Microbiology , General 2004  – 2006 I was the recipient of the Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) scholarship from the National Institutes of Health (NIH). San Francisco State University Master of Science (M.S.),  Microbiology , General 2004  – 2006 I was the recipient of the Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) scholarship from the National Institutes of Health (NIH). San Francisco State University Master of Science (M.S.),  Microbiology , General 2004  – 2006 I was the recipient of the Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) scholarship from the National Institutes of Health (NIH). University of California, Santa Barbara Bachelor of Science (B.S.),  Microbiology , General 1999  – 2003 Minored in Chemistry Activities and Societies:  Resident Assistant ,  San Nicolas 2001-2002 University of California, Santa Barbara Bachelor of Science (B.S.),  Microbiology , General 1999  – 2003 Minored in Chemistry Activities and Societies:  Resident Assistant ,  San Nicolas 2001-2002 University of California, Santa Barbara Bachelor of Science (B.S.),  Microbiology , General 1999  – 2003 Minored in Chemistry Activities and Societies:  Resident Assistant ,  San Nicolas 2001-2002 Honors & Awards Diversifying Academia, Recruiting Excellence (DARE) Doctoral Fellowship Stanford University Office of the Vice Provost for Graduate Education August 2010 This Fellowship program is designed to prepare graduate students for future endeavors by providing: \n-Structured seminars \n-Professional development modules \n-Additional Mentorship \n-and more https://vpge.stanford.edu/fellowships-funding/dare Carl Storm Underrepresented Minority Fellowship Gordon Research Conferences March 2009 This fellowship program provided me with funding assistance to attend my first Gordon Research Conference. I was also selected to give a talk on my graduate research at the conference. \n \nhttp://www.grc.org/diversity.aspx Research Supplements to Promote Diversity in Health-Related Research (PA-05-025) National Institutes of Health (NIH) August 2007 Sally Casanova California Pre-doctoral Scholarship California State University (CSU) June 2005 www.calstate.edu/predoc/scholars Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) National Institutes of Health (NIH) August 2004 http://www.sfsu.edu/~seo/ Leadership Certificate University of California (UC) June 2003 http://leadership.sa.ucsb.edu/certification/ Enterprise Leadership Conference Rotary Club March 1997 Current conference http://bit.ly/1bOe3Ch Diversifying Academia, Recruiting Excellence (DARE) Doctoral Fellowship Stanford University Office of the Vice Provost for Graduate Education August 2010 This Fellowship program is designed to prepare graduate students for future endeavors by providing: \n-Structured seminars \n-Professional development modules \n-Additional Mentorship \n-and more https://vpge.stanford.edu/fellowships-funding/dare Diversifying Academia, Recruiting Excellence (DARE) Doctoral Fellowship Stanford University Office of the Vice Provost for Graduate Education August 2010 This Fellowship program is designed to prepare graduate students for future endeavors by providing: \n-Structured seminars \n-Professional development modules \n-Additional Mentorship \n-and more https://vpge.stanford.edu/fellowships-funding/dare Diversifying Academia, Recruiting Excellence (DARE) Doctoral Fellowship Stanford University Office of the Vice Provost for Graduate Education August 2010 This Fellowship program is designed to prepare graduate students for future endeavors by providing: \n-Structured seminars \n-Professional development modules \n-Additional Mentorship \n-and more https://vpge.stanford.edu/fellowships-funding/dare Carl Storm Underrepresented Minority Fellowship Gordon Research Conferences March 2009 This fellowship program provided me with funding assistance to attend my first Gordon Research Conference. I was also selected to give a talk on my graduate research at the conference. \n \nhttp://www.grc.org/diversity.aspx Carl Storm Underrepresented Minority Fellowship Gordon Research Conferences March 2009 This fellowship program provided me with funding assistance to attend my first Gordon Research Conference. I was also selected to give a talk on my graduate research at the conference. \n \nhttp://www.grc.org/diversity.aspx Carl Storm Underrepresented Minority Fellowship Gordon Research Conferences March 2009 This fellowship program provided me with funding assistance to attend my first Gordon Research Conference. I was also selected to give a talk on my graduate research at the conference. \n \nhttp://www.grc.org/diversity.aspx Research Supplements to Promote Diversity in Health-Related Research (PA-05-025) National Institutes of Health (NIH) August 2007 Research Supplements to Promote Diversity in Health-Related Research (PA-05-025) National Institutes of Health (NIH) August 2007 Research Supplements to Promote Diversity in Health-Related Research (PA-05-025) National Institutes of Health (NIH) August 2007 Sally Casanova California Pre-doctoral Scholarship California State University (CSU) June 2005 www.calstate.edu/predoc/scholars Sally Casanova California Pre-doctoral Scholarship California State University (CSU) June 2005 www.calstate.edu/predoc/scholars Sally Casanova California Pre-doctoral Scholarship California State University (CSU) June 2005 www.calstate.edu/predoc/scholars Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) National Institutes of Health (NIH) August 2004 http://www.sfsu.edu/~seo/ Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) National Institutes of Health (NIH) August 2004 http://www.sfsu.edu/~seo/ Minority Biomedical Research Support (MBRS) Research Initiative for Scientific Enhancement (RISE) National Institutes of Health (NIH) August 2004 http://www.sfsu.edu/~seo/ Leadership Certificate University of California (UC) June 2003 http://leadership.sa.ucsb.edu/certification/ Leadership Certificate University of California (UC) June 2003 http://leadership.sa.ucsb.edu/certification/ Leadership Certificate University of California (UC) June 2003 http://leadership.sa.ucsb.edu/certification/ Enterprise Leadership Conference Rotary Club March 1997 Current conference http://bit.ly/1bOe3Ch Enterprise Leadership Conference Rotary Club March 1997 Current conference http://bit.ly/1bOe3Ch Enterprise Leadership Conference Rotary Club March 1997 Current conference http://bit.ly/1bOe3Ch ", "Summary I am a student at the University of Colorado at Boulder, studying Molecular, Cellular, and Developmental Biology. I am currently taking a one year absence from school while I conduct biomedical research in the Glenn lab at Stanford University. My research focuses on the discovery of novel Hepatitis C Virus and Dengue Virus therapies. Summary I am a student at the University of Colorado at Boulder, studying Molecular, Cellular, and Developmental Biology. I am currently taking a one year absence from school while I conduct biomedical research in the Glenn lab at Stanford University. My research focuses on the discovery of novel Hepatitis C Virus and Dengue Virus therapies. I am a student at the University of Colorado at Boulder, studying Molecular, Cellular, and Developmental Biology. I am currently taking a one year absence from school while I conduct biomedical research in the Glenn lab at Stanford University. My research focuses on the discovery of novel Hepatitis C Virus and Dengue Virus therapies. I am a student at the University of Colorado at Boulder, studying Molecular, Cellular, and Developmental Biology. I am currently taking a one year absence from school while I conduct biomedical research in the Glenn lab at Stanford University. My research focuses on the discovery of novel Hepatitis C Virus and Dengue Virus therapies. Experience Research Associate Stanford University May 2013  –  August 2014  (1 year 4 months) Stanford, CA As a member of the Glenn lab at Stanford University I primarily research the molecular mechanisms of Hepatitis C Virus, Dengue Virus in an effort to discover novel molecular pathways that can be used as potential drug targets. My research also includes Influenza, Tuberculosis, and other viruses. Undergraduate Research Associate University of Colorado Boulder August 2012  –  May 2013  (10 months) Boulder, CO Conducted research on the molecular mechanisms behind the observed increase in longevity associated with caloric restriction. Undergraduate Research Assistant Stanford University May 2012  –  August 2012  (4 months) Palo Alto, CA During the summer of 2012 I assisted in virology research aimed at the development of novel molecular therapies for Hepatitis C. Research Associate Stanford University May 2013  –  August 2014  (1 year 4 months) Stanford, CA As a member of the Glenn lab at Stanford University I primarily research the molecular mechanisms of Hepatitis C Virus, Dengue Virus in an effort to discover novel molecular pathways that can be used as potential drug targets. My research also includes Influenza, Tuberculosis, and other viruses. Research Associate Stanford University May 2013  –  August 2014  (1 year 4 months) Stanford, CA As a member of the Glenn lab at Stanford University I primarily research the molecular mechanisms of Hepatitis C Virus, Dengue Virus in an effort to discover novel molecular pathways that can be used as potential drug targets. My research also includes Influenza, Tuberculosis, and other viruses. Undergraduate Research Associate University of Colorado Boulder August 2012  –  May 2013  (10 months) Boulder, CO Conducted research on the molecular mechanisms behind the observed increase in longevity associated with caloric restriction. Undergraduate Research Associate University of Colorado Boulder August 2012  –  May 2013  (10 months) Boulder, CO Conducted research on the molecular mechanisms behind the observed increase in longevity associated with caloric restriction. Undergraduate Research Assistant Stanford University May 2012  –  August 2012  (4 months) Palo Alto, CA During the summer of 2012 I assisted in virology research aimed at the development of novel molecular therapies for Hepatitis C. Undergraduate Research Assistant Stanford University May 2012  –  August 2012  (4 months) Palo Alto, CA During the summer of 2012 I assisted in virology research aimed at the development of novel molecular therapies for Hepatitis C. Skills Laboratory Biology Chemistry Research Gel Electrophoresis Biochemistry Cell Biology Microscopy Western Blotting Skills  Laboratory Biology Chemistry Research Gel Electrophoresis Biochemistry Cell Biology Microscopy Western Blotting Laboratory Biology Chemistry Research Gel Electrophoresis Biochemistry Cell Biology Microscopy Western Blotting Laboratory Biology Chemistry Research Gel Electrophoresis Biochemistry Cell Biology Microscopy Western Blotting Education University of Colorado at Boulder Molecular, Cellular, and Developmental Biology,  Biology 2010  – 2014 Activities and Societies:  AIESEC international internship club. University of Colorado at Boulder Molecular, Cellular, and Developmental Biology,  Biology 2010  – 2014 Activities and Societies:  AIESEC international internship club. University of Colorado at Boulder Molecular, Cellular, and Developmental Biology,  Biology 2010  – 2014 Activities and Societies:  AIESEC international internship club. University of Colorado at Boulder Molecular, Cellular, and Developmental Biology,  Biology 2010  – 2014 Activities and Societies:  AIESEC international internship club. Honors & Awards Eagle Scout Boy Scouts of America December 2009 Completed the requirements to earn the highest rank awarded by the Boy Scouts of America. These requirements included years of leadership, project management, and steadfast commitment.  Dean's List Honoree Dean of Arts and Sciences at the University of Colorado at Boulder December 2011 Honored by the Dean of Arts and Sciences at the University of Colorado at Boulder for exceptional GPA for entirety of college career (three semesters).  Eagle Scout Boy Scouts of America December 2009 Completed the requirements to earn the highest rank awarded by the Boy Scouts of America. These requirements included years of leadership, project management, and steadfast commitment.  Eagle Scout Boy Scouts of America December 2009 Completed the requirements to earn the highest rank awarded by the Boy Scouts of America. These requirements included years of leadership, project management, and steadfast commitment.  Eagle Scout Boy Scouts of America December 2009 Completed the requirements to earn the highest rank awarded by the Boy Scouts of America. These requirements included years of leadership, project management, and steadfast commitment.  Dean's List Honoree Dean of Arts and Sciences at the University of Colorado at Boulder December 2011 Honored by the Dean of Arts and Sciences at the University of Colorado at Boulder for exceptional GPA for entirety of college career (three semesters).  Dean's List Honoree Dean of Arts and Sciences at the University of Colorado at Boulder December 2011 Honored by the Dean of Arts and Sciences at the University of Colorado at Boulder for exceptional GPA for entirety of college career (three semesters).  Dean's List Honoree Dean of Arts and Sciences at the University of Colorado at Boulder December 2011 Honored by the Dean of Arts and Sciences at the University of Colorado at Boulder for exceptional GPA for entirety of college career (three semesters).  ", "Experience Senior Staff Scientist Stanford University Senior Staff Scientist Stanford University Senior Staff Scientist Stanford University ", "Skills Molecular Biology Biochemistry PCR Science Lifesciences Statistics Research Data Analysis Gel Electrophoresis Biotechnology Bioinformatics DNA sequencing Biology Genetics DNA Sequencing Molecular Cloning See 1+     See less Skills  Molecular Biology Biochemistry PCR Science Lifesciences Statistics Research Data Analysis Gel Electrophoresis Biotechnology Bioinformatics DNA sequencing Biology Genetics DNA Sequencing Molecular Cloning See 1+     See less Molecular Biology Biochemistry PCR Science Lifesciences Statistics Research Data Analysis Gel Electrophoresis Biotechnology Bioinformatics DNA sequencing Biology Genetics DNA Sequencing Molecular Cloning See 1+     See less Molecular Biology Biochemistry PCR Science Lifesciences Statistics Research Data Analysis Gel Electrophoresis Biotechnology Bioinformatics DNA sequencing Biology Genetics DNA Sequencing Molecular Cloning See 1+     See less "]}