{"position": "Web Developer", "company": "Stanford University", "profiles": ["Summary I am a web developer for Stanford University. Before becoming a web developer (for the second time) I was an operations manager of a department in the libraries. \n \nWhen I was in high school, I was also a web developer for a small company in Foster City, but had taken a several year hiatus from the profession until 2008 when I returned to the profession with my current position at Stanford. Specialties:(X)HTML, CSS, JavaScript, PHP, SQL, Drupal, DOM, Ruby Summary I am a web developer for Stanford University. Before becoming a web developer (for the second time) I was an operations manager of a department in the libraries. \n \nWhen I was in high school, I was also a web developer for a small company in Foster City, but had taken a several year hiatus from the profession until 2008 when I returned to the profession with my current position at Stanford. Specialties:(X)HTML, CSS, JavaScript, PHP, SQL, Drupal, DOM, Ruby I am a web developer for Stanford University. Before becoming a web developer (for the second time) I was an operations manager of a department in the libraries. \n \nWhen I was in high school, I was also a web developer for a small company in Foster City, but had taken a several year hiatus from the profession until 2008 when I returned to the profession with my current position at Stanford. Specialties:(X)HTML, CSS, JavaScript, PHP, SQL, Drupal, DOM, Ruby I am a web developer for Stanford University. Before becoming a web developer (for the second time) I was an operations manager of a department in the libraries. \n \nWhen I was in high school, I was also a web developer for a small company in Foster City, but had taken a several year hiatus from the profession until 2008 when I returned to the profession with my current position at Stanford. Specialties:(X)HTML, CSS, JavaScript, PHP, SQL, Drupal, DOM, Ruby Experience Web Developer Stanford University March 2008  – Present (7 years 6 months) Working on several projects relating to digital collections. \nMigrating Library web sites from static HTML to the Drupal content management system. \nWorking on the Universities Next Generation Discovery Environment (ie, Library Catalog). Scanning Operations Manager Stanford University August 2007  –  March 2008  (8 months) Managed the Stanford side of the Google book project. This project aims to digitize, index, and make searchable all the worlds books. Web Developer Automation Expertise January 2000  –  July 2002  (2 years 7 months) Created various testing websites. \nContracted out to engineer secure logins for other companies. \nAlso contracted to eBay for QA Web Developer Stanford University March 2008  – Present (7 years 6 months) Working on several projects relating to digital collections. \nMigrating Library web sites from static HTML to the Drupal content management system. \nWorking on the Universities Next Generation Discovery Environment (ie, Library Catalog). Web Developer Stanford University March 2008  – Present (7 years 6 months) Working on several projects relating to digital collections. \nMigrating Library web sites from static HTML to the Drupal content management system. \nWorking on the Universities Next Generation Discovery Environment (ie, Library Catalog). Scanning Operations Manager Stanford University August 2007  –  March 2008  (8 months) Managed the Stanford side of the Google book project. This project aims to digitize, index, and make searchable all the worlds books. Scanning Operations Manager Stanford University August 2007  –  March 2008  (8 months) Managed the Stanford side of the Google book project. This project aims to digitize, index, and make searchable all the worlds books. Web Developer Automation Expertise January 2000  –  July 2002  (2 years 7 months) Created various testing websites. \nContracted out to engineer secure logins for other companies. \nAlso contracted to eBay for QA Web Developer Automation Expertise January 2000  –  July 2002  (2 years 7 months) Created various testing websites. \nContracted out to engineer secure logins for other companies. \nAlso contracted to eBay for QA Skills JavaScript PHP Ruby HTML SQL CSS CMS Helicopter Operations Drupal Helicopters Testing Skills  JavaScript PHP Ruby HTML SQL CSS CMS Helicopter Operations Drupal Helicopters Testing JavaScript PHP Ruby HTML SQL CSS CMS Helicopter Operations Drupal Helicopters Testing JavaScript PHP Ruby HTML SQL CSS CMS Helicopter Operations Drupal Helicopters Testing Education West Bay Diploma 2000  – 2002 Graduated as Valedictorian West Bay Diploma 2000  – 2002 Graduated as Valedictorian West Bay Diploma 2000  – 2002 Graduated as Valedictorian West Bay Diploma 2000  – 2002 Graduated as Valedictorian ", "Experience Web Developer Stanford University February 2008  – Present (7 years 7 months) Primary web developer for the Offices of Undergraduate Admission, Financial Aid  and Visitor Information Services. Web Developer Emory University June 2005  –  February 2008  (2 years 9 months) Primary web developer for the College of Arts and Sciences. Application Developer Norfolk Southern July 2004  –  June 2005  (1 year) Provided Uniface programming and DB2 database support for the Strategic Intermodal Management System (SIMMS). Completed the NS management trainee program. Network Engineer Norfolk Southern January 2003  –  June 2004  (1 year 6 months) Supported LAN/WAN systems across the 22 state enterprise using primarily Cisco routers/swicthes. Worked in the college co-op program. Digital Imaging Coordinator Emory University School of Medicine January 2000  –  November 2002  (2 years 11 months) Led the transition from traditional photographic and printing methods to digital technologies for the Biomedical Media department. Medical Photographer Emory University School of Medicine February 1992  –  December 1999  (7 years 11 months) Photographed surgical procedures and medical treatments for teaching and research. Worked with the Public Affairs Office to provide editorial photos for university publications. Lab Technician Moakler Photographic April 1990  –  January 1992  (1 year 10 months) Specialized in E6 film processing for commercial advertising clients. Photojournalist United States Air Force 1986  –  1990  (4 years) Primary photographer for the \"Excalibur\" newspaper at Moody AFB. Other photographic duties included combat operations support for the 347th Tactical Fighter Wing. Web Developer Stanford University February 2008  – Present (7 years 7 months) Primary web developer for the Offices of Undergraduate Admission, Financial Aid  and Visitor Information Services. Web Developer Stanford University February 2008  – Present (7 years 7 months) Primary web developer for the Offices of Undergraduate Admission, Financial Aid  and Visitor Information Services. Web Developer Emory University June 2005  –  February 2008  (2 years 9 months) Primary web developer for the College of Arts and Sciences. Web Developer Emory University June 2005  –  February 2008  (2 years 9 months) Primary web developer for the College of Arts and Sciences. Application Developer Norfolk Southern July 2004  –  June 2005  (1 year) Provided Uniface programming and DB2 database support for the Strategic Intermodal Management System (SIMMS). Completed the NS management trainee program. Application Developer Norfolk Southern July 2004  –  June 2005  (1 year) Provided Uniface programming and DB2 database support for the Strategic Intermodal Management System (SIMMS). Completed the NS management trainee program. Network Engineer Norfolk Southern January 2003  –  June 2004  (1 year 6 months) Supported LAN/WAN systems across the 22 state enterprise using primarily Cisco routers/swicthes. Worked in the college co-op program. Network Engineer Norfolk Southern January 2003  –  June 2004  (1 year 6 months) Supported LAN/WAN systems across the 22 state enterprise using primarily Cisco routers/swicthes. Worked in the college co-op program. Digital Imaging Coordinator Emory University School of Medicine January 2000  –  November 2002  (2 years 11 months) Led the transition from traditional photographic and printing methods to digital technologies for the Biomedical Media department. Digital Imaging Coordinator Emory University School of Medicine January 2000  –  November 2002  (2 years 11 months) Led the transition from traditional photographic and printing methods to digital technologies for the Biomedical Media department. Medical Photographer Emory University School of Medicine February 1992  –  December 1999  (7 years 11 months) Photographed surgical procedures and medical treatments for teaching and research. Worked with the Public Affairs Office to provide editorial photos for university publications. Medical Photographer Emory University School of Medicine February 1992  –  December 1999  (7 years 11 months) Photographed surgical procedures and medical treatments for teaching and research. Worked with the Public Affairs Office to provide editorial photos for university publications. Lab Technician Moakler Photographic April 1990  –  January 1992  (1 year 10 months) Specialized in E6 film processing for commercial advertising clients. Lab Technician Moakler Photographic April 1990  –  January 1992  (1 year 10 months) Specialized in E6 film processing for commercial advertising clients. Photojournalist United States Air Force 1986  –  1990  (4 years) Primary photographer for the \"Excalibur\" newspaper at Moody AFB. Other photographic duties included combat operations support for the 347th Tactical Fighter Wing. Photojournalist United States Air Force 1986  –  1990  (4 years) Primary photographer for the \"Excalibur\" newspaper at Moody AFB. Other photographic duties included combat operations support for the 347th Tactical Fighter Wing. Skills Programming Information Technology Drupal CSS JavaScript HTML Mac OS X Information Architecture CMS Windows PHP Web Development MySQL XML SQL Web Design OS X XHTML HTML 5 User Experience jQuery WordPress Web Applications User Interface Accessibility User Interface Design Databases Usability Google Analytics Mobile Applications Dreamweaver Website Development Usability Testing Project Management See 19+     See less Skills  Programming Information Technology Drupal CSS JavaScript HTML Mac OS X Information Architecture CMS Windows PHP Web Development MySQL XML SQL Web Design OS X XHTML HTML 5 User Experience jQuery WordPress Web Applications User Interface Accessibility User Interface Design Databases Usability Google Analytics Mobile Applications Dreamweaver Website Development Usability Testing Project Management See 19+     See less Programming Information Technology Drupal CSS JavaScript HTML Mac OS X Information Architecture CMS Windows PHP Web Development MySQL XML SQL Web Design OS X XHTML HTML 5 User Experience jQuery WordPress Web Applications User Interface Accessibility User Interface Design Databases Usability Google Analytics Mobile Applications Dreamweaver Website Development Usability Testing Project Management See 19+     See less Programming Information Technology Drupal CSS JavaScript HTML Mac OS X Information Architecture CMS Windows PHP Web Development MySQL XML SQL Web Design OS X XHTML HTML 5 User Experience jQuery WordPress Web Applications User Interface Accessibility User Interface Design Databases Usability Google Analytics Mobile Applications Dreamweaver Website Development Usability Testing Project Management See 19+     See less Education Georgia State University - J. Mack Robinson College of Business Master of Science,  Computer Information Systems 2005  – 2007 Georgia State University - J. Mack Robinson College of Business Bachelor of Business Administration,  Computer Information Systems 1996  – 2002 Magna Cum Laude Activities and Societies:  Beta Gamma Sigma Art Institute of Atlanta Associate in Arts,  Photography 1983  – 1985 Honors and Most Outstanding Portfolio Award Georgia State University - J. Mack Robinson College of Business Master of Science,  Computer Information Systems 2005  – 2007 Georgia State University - J. Mack Robinson College of Business Master of Science,  Computer Information Systems 2005  – 2007 Georgia State University - J. Mack Robinson College of Business Master of Science,  Computer Information Systems 2005  – 2007 Georgia State University - J. Mack Robinson College of Business Bachelor of Business Administration,  Computer Information Systems 1996  – 2002 Magna Cum Laude Activities and Societies:  Beta Gamma Sigma Georgia State University - J. Mack Robinson College of Business Bachelor of Business Administration,  Computer Information Systems 1996  – 2002 Magna Cum Laude Activities and Societies:  Beta Gamma Sigma Georgia State University - J. Mack Robinson College of Business Bachelor of Business Administration,  Computer Information Systems 1996  – 2002 Magna Cum Laude Activities and Societies:  Beta Gamma Sigma Art Institute of Atlanta Associate in Arts,  Photography 1983  – 1985 Honors and Most Outstanding Portfolio Award Art Institute of Atlanta Associate in Arts,  Photography 1983  – 1985 Honors and Most Outstanding Portfolio Award Art Institute of Atlanta Associate in Arts,  Photography 1983  – 1985 Honors and Most Outstanding Portfolio Award ", "Summary I recently graduated with a Bachelor's Degree in Information Technology and now pursuing a career in Web Development. I have huge interest in Web Programming (PHP, HTML5, CSS3, JavaScript, jQuery). I am goal-oriented and eager to learn new things. I'm currently developing my skills with MongoDB, Node.js, Python, Angular.js for Web and Swift for iOS. Summary I recently graduated with a Bachelor's Degree in Information Technology and now pursuing a career in Web Development. I have huge interest in Web Programming (PHP, HTML5, CSS3, JavaScript, jQuery). I am goal-oriented and eager to learn new things. I'm currently developing my skills with MongoDB, Node.js, Python, Angular.js for Web and Swift for iOS. I recently graduated with a Bachelor's Degree in Information Technology and now pursuing a career in Web Development. I have huge interest in Web Programming (PHP, HTML5, CSS3, JavaScript, jQuery). I am goal-oriented and eager to learn new things. I'm currently developing my skills with MongoDB, Node.js, Python, Angular.js for Web and Swift for iOS. I recently graduated with a Bachelor's Degree in Information Technology and now pursuing a career in Web Development. I have huge interest in Web Programming (PHP, HTML5, CSS3, JavaScript, jQuery). I am goal-oriented and eager to learn new things. I'm currently developing my skills with MongoDB, Node.js, Python, Angular.js for Web and Swift for iOS. Experience Web Developer Stanford University May 2015  – Present (4 months) Stanford, CA · Build and maintain 5 websites of Stanford Health Care (Emergency Department) using Adobe Experience Manager (CMS) \n· Work on PHP scripts for internal systems used by the Physicians in the office. \n· Setup and troubleshoot the Mac Server and iPads in the Stanford Pediatric ED for the TeamScreen project. \n· Skills used: PHP, HTML5, CSS3, JavaScript, SQL queries, basic FTP and WebFTP operations. \n Lead QA Analyst RetailNext March 2015  –  May 2015  (3 months) San Jose, CA · Took full responsibility for data analysis and software adjustment of an international project and client. \n· Assist team to analyze various data sets and adjust the software's analytics to ensure high accuracy of data. \n· Coordinate with implementation engineers and project managers for proper execution of the project and make sure deadlines are on time. QA Analyst RetailNext September 2014  –  March 2015  (7 months) San Jose, CA · Analyze data sets and adjustments of the company's software for customers and partners. \n· Perform reports and identify errors and bugs to verify with the implementation team and assure the accuracy of the data produced by our software. Software Developer Intern Fujitsu Ten Solutions Philippines, Inc. April 2013  –  March 2014  (1 year) Pasig City, Manila · Build websites using PHP, Database, HTML, CSS3 and other frameworks. \n· Design graphics using Adobe Photoshop for web applications. \n· Help build softwares that can connect to hardware using C#. \n· Improved knowledge in C#, PHP (MVC Architecture), database administration and logical thinking. Web Developer Stanford University May 2015  – Present (4 months) Stanford, CA · Build and maintain 5 websites of Stanford Health Care (Emergency Department) using Adobe Experience Manager (CMS) \n· Work on PHP scripts for internal systems used by the Physicians in the office. \n· Setup and troubleshoot the Mac Server and iPads in the Stanford Pediatric ED for the TeamScreen project. \n· Skills used: PHP, HTML5, CSS3, JavaScript, SQL queries, basic FTP and WebFTP operations. \n Web Developer Stanford University May 2015  – Present (4 months) Stanford, CA · Build and maintain 5 websites of Stanford Health Care (Emergency Department) using Adobe Experience Manager (CMS) \n· Work on PHP scripts for internal systems used by the Physicians in the office. \n· Setup and troubleshoot the Mac Server and iPads in the Stanford Pediatric ED for the TeamScreen project. \n· Skills used: PHP, HTML5, CSS3, JavaScript, SQL queries, basic FTP and WebFTP operations. \n Lead QA Analyst RetailNext March 2015  –  May 2015  (3 months) San Jose, CA · Took full responsibility for data analysis and software adjustment of an international project and client. \n· Assist team to analyze various data sets and adjust the software's analytics to ensure high accuracy of data. \n· Coordinate with implementation engineers and project managers for proper execution of the project and make sure deadlines are on time. Lead QA Analyst RetailNext March 2015  –  May 2015  (3 months) San Jose, CA · Took full responsibility for data analysis and software adjustment of an international project and client. \n· Assist team to analyze various data sets and adjust the software's analytics to ensure high accuracy of data. \n· Coordinate with implementation engineers and project managers for proper execution of the project and make sure deadlines are on time. QA Analyst RetailNext September 2014  –  March 2015  (7 months) San Jose, CA · Analyze data sets and adjustments of the company's software for customers and partners. \n· Perform reports and identify errors and bugs to verify with the implementation team and assure the accuracy of the data produced by our software. QA Analyst RetailNext September 2014  –  March 2015  (7 months) San Jose, CA · Analyze data sets and adjustments of the company's software for customers and partners. \n· Perform reports and identify errors and bugs to verify with the implementation team and assure the accuracy of the data produced by our software. Software Developer Intern Fujitsu Ten Solutions Philippines, Inc. April 2013  –  March 2014  (1 year) Pasig City, Manila · Build websites using PHP, Database, HTML, CSS3 and other frameworks. \n· Design graphics using Adobe Photoshop for web applications. \n· Help build softwares that can connect to hardware using C#. \n· Improved knowledge in C#, PHP (MVC Architecture), database administration and logical thinking. Software Developer Intern Fujitsu Ten Solutions Philippines, Inc. April 2013  –  March 2014  (1 year) Pasig City, Manila · Build websites using PHP, Database, HTML, CSS3 and other frameworks. \n· Design graphics using Adobe Photoshop for web applications. \n· Help build softwares that can connect to hardware using C#. \n· Improved knowledge in C#, PHP (MVC Architecture), database administration and logical thinking. Languages English Full professional proficiency Tagalog Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Tagalog Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Tagalog Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills PHP CSS3 HTML5 MySQL CodeIgniter JavaScript Bootstrap Adobe Experience Manager PhpMyAdmin jQuery Subnetting Cisco Packet Tracer OSPF, RIP, EIGRP C# Routing and Switching C++ Java SQL SDLC MVC Architecture Project Management PowerPoint Microsoft Office Microsoft Excel Microsoft Word Database Design Windows Troubleshooting Photoshop See 14+     See less Skills  PHP CSS3 HTML5 MySQL CodeIgniter JavaScript Bootstrap Adobe Experience Manager PhpMyAdmin jQuery Subnetting Cisco Packet Tracer OSPF, RIP, EIGRP C# Routing and Switching C++ Java SQL SDLC MVC Architecture Project Management PowerPoint Microsoft Office Microsoft Excel Microsoft Word Database Design Windows Troubleshooting Photoshop See 14+     See less PHP CSS3 HTML5 MySQL CodeIgniter JavaScript Bootstrap Adobe Experience Manager PhpMyAdmin jQuery Subnetting Cisco Packet Tracer OSPF, RIP, EIGRP C# Routing and Switching C++ Java SQL SDLC MVC Architecture Project Management PowerPoint Microsoft Office Microsoft Excel Microsoft Word Database Design Windows Troubleshooting Photoshop See 14+     See less PHP CSS3 HTML5 MySQL CodeIgniter JavaScript Bootstrap Adobe Experience Manager PhpMyAdmin jQuery Subnetting Cisco Packet Tracer OSPF, RIP, EIGRP C# Routing and Switching C++ Java SQL SDLC MVC Architecture Project Management PowerPoint Microsoft Office Microsoft Excel Microsoft Word Database Design Windows Troubleshooting Photoshop See 14+     See less Education Don Bosco Technical College, Mandaluyong Bachelor's Degree,  Information Technology 2009  – 2014 Internal Vice President of DBITS (2013-2014) \n \nGained knowledge in: \n· C, C++, Java \n· PHP, HTML5, CSS3 \n· Database (MySQL, DB2) \n· Networking: Routing and Switching (Cisco Packet Tracer) \n· Linux Platform (Ubuntu, Mint) \n \nProjects: \nAn Inventory System for RENCOR, a Refrigeration Equipment company. \n· The automated project helped them to monitor their stock and equipment. \n· I used PHP, HTML and CSS.  \n \nBilling System for a Condominium Corporation in Makati for our Capstone Project. \n· A Project which helped the company to migrate their manually input data (Microsoft Excel) to an automated system (Web Application). \n· I'm the Software Developer in our group and the two are the Project Manager and QA/Tester. \n· The system was built using PHP, HTML5, CSS3 with CodeIgniter, a PHP Framework and Bootstrap, an HTML, CSS framework for designing & developing responsive features on the web. Activities and Societies:  Don Bosco Information Technology Society (DBITS) Don Bosco Technical College, Mandaluyong Bachelor's Degree,  Information Technology 2009  – 2014 Internal Vice President of DBITS (2013-2014) \n \nGained knowledge in: \n· C, C++, Java \n· PHP, HTML5, CSS3 \n· Database (MySQL, DB2) \n· Networking: Routing and Switching (Cisco Packet Tracer) \n· Linux Platform (Ubuntu, Mint) \n \nProjects: \nAn Inventory System for RENCOR, a Refrigeration Equipment company. \n· The automated project helped them to monitor their stock and equipment. \n· I used PHP, HTML and CSS.  \n \nBilling System for a Condominium Corporation in Makati for our Capstone Project. \n· A Project which helped the company to migrate their manually input data (Microsoft Excel) to an automated system (Web Application). \n· I'm the Software Developer in our group and the two are the Project Manager and QA/Tester. \n· The system was built using PHP, HTML5, CSS3 with CodeIgniter, a PHP Framework and Bootstrap, an HTML, CSS framework for designing & developing responsive features on the web. Activities and Societies:  Don Bosco Information Technology Society (DBITS) Don Bosco Technical College, Mandaluyong Bachelor's Degree,  Information Technology 2009  – 2014 Internal Vice President of DBITS (2013-2014) \n \nGained knowledge in: \n· C, C++, Java \n· PHP, HTML5, CSS3 \n· Database (MySQL, DB2) \n· Networking: Routing and Switching (Cisco Packet Tracer) \n· Linux Platform (Ubuntu, Mint) \n \nProjects: \nAn Inventory System for RENCOR, a Refrigeration Equipment company. \n· The automated project helped them to monitor their stock and equipment. \n· I used PHP, HTML and CSS.  \n \nBilling System for a Condominium Corporation in Makati for our Capstone Project. \n· A Project which helped the company to migrate their manually input data (Microsoft Excel) to an automated system (Web Application). \n· I'm the Software Developer in our group and the two are the Project Manager and QA/Tester. \n· The system was built using PHP, HTML5, CSS3 with CodeIgniter, a PHP Framework and Bootstrap, an HTML, CSS framework for designing & developing responsive features on the web. Activities and Societies:  Don Bosco Information Technology Society (DBITS) Don Bosco Technical College, Mandaluyong Bachelor's Degree,  Information Technology 2009  – 2014 Internal Vice President of DBITS (2013-2014) \n \nGained knowledge in: \n· C, C++, Java \n· PHP, HTML5, CSS3 \n· Database (MySQL, DB2) \n· Networking: Routing and Switching (Cisco Packet Tracer) \n· Linux Platform (Ubuntu, Mint) \n \nProjects: \nAn Inventory System for RENCOR, a Refrigeration Equipment company. \n· The automated project helped them to monitor their stock and equipment. \n· I used PHP, HTML and CSS.  \n \nBilling System for a Condominium Corporation in Makati for our Capstone Project. \n· A Project which helped the company to migrate their manually input data (Microsoft Excel) to an automated system (Web Application). \n· I'm the Software Developer in our group and the two are the Project Manager and QA/Tester. \n· The system was built using PHP, HTML5, CSS3 with CodeIgniter, a PHP Framework and Bootstrap, an HTML, CSS framework for designing & developing responsive features on the web. Activities and Societies:  Don Bosco Information Technology Society (DBITS) Honors & Awards ", "Skills HTML 5 CSS JavaScript SEO Web Design Mobile Applications PHP User Experience E-commerce Web Analytics HTML User Interface Design Photoshop Web Development WordPress Google Analytics jQuery Mobile Devices Software Development MySQL Media Production HTML5 See 7+     See less Skills  HTML 5 CSS JavaScript SEO Web Design Mobile Applications PHP User Experience E-commerce Web Analytics HTML User Interface Design Photoshop Web Development WordPress Google Analytics jQuery Mobile Devices Software Development MySQL Media Production HTML5 See 7+     See less HTML 5 CSS JavaScript SEO Web Design Mobile Applications PHP User Experience E-commerce Web Analytics HTML User Interface Design Photoshop Web Development WordPress Google Analytics jQuery Mobile Devices Software Development MySQL Media Production HTML5 See 7+     See less HTML 5 CSS JavaScript SEO Web Design Mobile Applications PHP User Experience E-commerce Web Analytics HTML User Interface Design Photoshop Web Development WordPress Google Analytics jQuery Mobile Devices Software Development MySQL Media Production HTML5 See 7+     See less ", "Summary Specialties:(X)HTML, CSS, Web Accessibility, Drupal, PHP, MySQL, *nix, jQuery, Apache, LAMP, Adobe CS, Flash, Final Cut, Mac OS, Windows OS, FOSS, unordered lists Summary Specialties:(X)HTML, CSS, Web Accessibility, Drupal, PHP, MySQL, *nix, jQuery, Apache, LAMP, Adobe CS, Flash, Final Cut, Mac OS, Windows OS, FOSS, unordered lists Specialties:(X)HTML, CSS, Web Accessibility, Drupal, PHP, MySQL, *nix, jQuery, Apache, LAMP, Adobe CS, Flash, Final Cut, Mac OS, Windows OS, FOSS, unordered lists Specialties:(X)HTML, CSS, Web Accessibility, Drupal, PHP, MySQL, *nix, jQuery, Apache, LAMP, Adobe CS, Flash, Final Cut, Mac OS, Windows OS, FOSS, unordered lists Experience Web Developer Stanford University September 2011  – Present (4 years) Design, develop, and manage web applications that provide automated integration with back-end academic and business systems. Lead Drupal developer for sites.stanford.edu web hosting service. User Services Technology Specialist Stanford University May 2007  –  September 2011  (4 years 5 months) Facilitated the thoughtful use of technology resources in support of the teaching, learning, and research needs of Stanford School of Education faculty, students, and staff, and of the greater Stanford community as a whole. Academic Technology Specialist for Students Colorado College August 2006  –  April 2007  (9 months) Developed student technology training initiatives; supervised student computing labs; managed student technology workforce Digital Technology Supervisor Colorado College November 2000  –  June 2005  (4 years 8 months) Provided technical and pedagogical support for faculty and students integrating digital video into the curriculum. Resident Athlete USA Shooting August 1999  –  June 2004  (4 years 11 months) Resident Athlete at the US Olympic Training Center. Drug Control Administration Associate USOC September 1999  –  September 2000  (1 year 1 month) Admin support for the No Advance Notice drug testing program Web Developer Stanford University September 2011  – Present (4 years) Design, develop, and manage web applications that provide automated integration with back-end academic and business systems. Lead Drupal developer for sites.stanford.edu web hosting service. Web Developer Stanford University September 2011  – Present (4 years) Design, develop, and manage web applications that provide automated integration with back-end academic and business systems. Lead Drupal developer for sites.stanford.edu web hosting service. User Services Technology Specialist Stanford University May 2007  –  September 2011  (4 years 5 months) Facilitated the thoughtful use of technology resources in support of the teaching, learning, and research needs of Stanford School of Education faculty, students, and staff, and of the greater Stanford community as a whole. User Services Technology Specialist Stanford University May 2007  –  September 2011  (4 years 5 months) Facilitated the thoughtful use of technology resources in support of the teaching, learning, and research needs of Stanford School of Education faculty, students, and staff, and of the greater Stanford community as a whole. Academic Technology Specialist for Students Colorado College August 2006  –  April 2007  (9 months) Developed student technology training initiatives; supervised student computing labs; managed student technology workforce Academic Technology Specialist for Students Colorado College August 2006  –  April 2007  (9 months) Developed student technology training initiatives; supervised student computing labs; managed student technology workforce Digital Technology Supervisor Colorado College November 2000  –  June 2005  (4 years 8 months) Provided technical and pedagogical support for faculty and students integrating digital video into the curriculum. Digital Technology Supervisor Colorado College November 2000  –  June 2005  (4 years 8 months) Provided technical and pedagogical support for faculty and students integrating digital video into the curriculum. Resident Athlete USA Shooting August 1999  –  June 2004  (4 years 11 months) Resident Athlete at the US Olympic Training Center. Resident Athlete USA Shooting August 1999  –  June 2004  (4 years 11 months) Resident Athlete at the US Olympic Training Center. Drug Control Administration Associate USOC September 1999  –  September 2000  (1 year 1 month) Admin support for the No Advance Notice drug testing program Drug Control Administration Associate USOC September 1999  –  September 2000  (1 year 1 month) Admin support for the No Advance Notice drug testing program Languages PHP Professional working proficiency Javascript Limited working proficiency CSS Professional working proficiency HTML Professional working proficiency PHP Professional working proficiency Javascript Limited working proficiency CSS Professional working proficiency HTML Professional working proficiency PHP Professional working proficiency Javascript Limited working proficiency CSS Professional working proficiency HTML Professional working proficiency Professional working proficiency Limited working proficiency Professional working proficiency Professional working proficiency Skills CSS Drupal Web Development MySQL HTML Accessibility jQuery Apache PHP LAMP Higher Education Web Applications Information Architecture Public Speaking Dreamweaver Mac OS X Linux Mac OS XHTML Photoshop User Experience Adobe Creative Suite SQL Windows HTML5 Changing Dirty Diapers See 11+     See less Skills  CSS Drupal Web Development MySQL HTML Accessibility jQuery Apache PHP LAMP Higher Education Web Applications Information Architecture Public Speaking Dreamweaver Mac OS X Linux Mac OS XHTML Photoshop User Experience Adobe Creative Suite SQL Windows HTML5 Changing Dirty Diapers See 11+     See less CSS Drupal Web Development MySQL HTML Accessibility jQuery Apache PHP LAMP Higher Education Web Applications Information Architecture Public Speaking Dreamweaver Mac OS X Linux Mac OS XHTML Photoshop User Experience Adobe Creative Suite SQL Windows HTML5 Changing Dirty Diapers See 11+     See less CSS Drupal Web Development MySQL HTML Accessibility jQuery Apache PHP LAMP Higher Education Web Applications Information Architecture Public Speaking Dreamweaver Mac OS X Linux Mac OS XHTML Photoshop User Experience Adobe Creative Suite SQL Windows HTML5 Changing Dirty Diapers See 11+     See less Education Harvard University Ed.M.,  Technology, Innovation, and Education University of Virginia B.S.,  Architecture Harvard University Ed.M.,  Technology, Innovation, and Education Harvard University Ed.M.,  Technology, Innovation, and Education Harvard University Ed.M.,  Technology, Innovation, and Education University of Virginia B.S.,  Architecture University of Virginia B.S.,  Architecture University of Virginia B.S.,  Architecture ", "Experience Web Developer Stanford University School of Medicine January 2013  – Present (2 years 8 months) Stanford, CA Business Operations 23andMe December 2010  –  November 2012  (2 years) Mountain View, CA Business Operations 23andMe January 2010  –  December 2010  (1 year) Mountain View, CA Owner Pink Walrus Media 2005  –  January 2010  (5 years) Honolulu, Hawai'i Producer Blood Colony September 2007  –  March 2008  (7 months) Honolulu, HI Web Developer Stanford University School of Medicine January 2013  – Present (2 years 8 months) Stanford, CA Web Developer Stanford University School of Medicine January 2013  – Present (2 years 8 months) Stanford, CA Business Operations 23andMe December 2010  –  November 2012  (2 years) Mountain View, CA Business Operations 23andMe December 2010  –  November 2012  (2 years) Mountain View, CA Business Operations 23andMe January 2010  –  December 2010  (1 year) Mountain View, CA Business Operations 23andMe January 2010  –  December 2010  (1 year) Mountain View, CA Owner Pink Walrus Media 2005  –  January 2010  (5 years) Honolulu, Hawai'i Owner Pink Walrus Media 2005  –  January 2010  (5 years) Honolulu, Hawai'i Producer Blood Colony September 2007  –  March 2008  (7 months) Honolulu, HI Producer Blood Colony September 2007  –  March 2008  (7 months) Honolulu, HI Languages   Skills Web Development Project Management CSS JavaScript HTML Java WordPress MySQL Management Software Documentation Git Databases Film Production Information Architecture Final Cut Pro Python Content Management Content Strategy Video Editing See 4+     See less Skills  Web Development Project Management CSS JavaScript HTML Java WordPress MySQL Management Software Documentation Git Databases Film Production Information Architecture Final Cut Pro Python Content Management Content Strategy Video Editing See 4+     See less Web Development Project Management CSS JavaScript HTML Java WordPress MySQL Management Software Documentation Git Databases Film Production Information Architecture Final Cut Pro Python Content Management Content Strategy Video Editing See 4+     See less Web Development Project Management CSS JavaScript HTML Java WordPress MySQL Management Software Documentation Git Databases Film Production Information Architecture Final Cut Pro Python Content Management Content Strategy Video Editing See 4+     See less Honors & Awards ", "Summary I am the Director of Web Development working on the online efforts for Desk.com. My professional interests are web project management, social media implementation, content strategy, information architecture, and facilitating communication between clients, end-users, web developers, and vendors. I am very experienced with visual and interface design, wireframing, rapid prototyping, and web usability. I'm also involved in front-end development, technical training, and web application development. Sometimes I even use Drupal or Wordpress to help maintain websites. \n \nSpecialties:  \n- web and social media strategy \n- content planning \n- information architecture \n- web design \n- graphic design \n- user experience \n- web architecture \n- photo editing/manipulation \n- project management  \n- video editing and filming \n- usability \n- database architecture/management \n- accessibility Summary I am the Director of Web Development working on the online efforts for Desk.com. My professional interests are web project management, social media implementation, content strategy, information architecture, and facilitating communication between clients, end-users, web developers, and vendors. I am very experienced with visual and interface design, wireframing, rapid prototyping, and web usability. I'm also involved in front-end development, technical training, and web application development. Sometimes I even use Drupal or Wordpress to help maintain websites. \n \nSpecialties:  \n- web and social media strategy \n- content planning \n- information architecture \n- web design \n- graphic design \n- user experience \n- web architecture \n- photo editing/manipulation \n- project management  \n- video editing and filming \n- usability \n- database architecture/management \n- accessibility I am the Director of Web Development working on the online efforts for Desk.com. My professional interests are web project management, social media implementation, content strategy, information architecture, and facilitating communication between clients, end-users, web developers, and vendors. I am very experienced with visual and interface design, wireframing, rapid prototyping, and web usability. I'm also involved in front-end development, technical training, and web application development. Sometimes I even use Drupal or Wordpress to help maintain websites. \n \nSpecialties:  \n- web and social media strategy \n- content planning \n- information architecture \n- web design \n- graphic design \n- user experience \n- web architecture \n- photo editing/manipulation \n- project management  \n- video editing and filming \n- usability \n- database architecture/management \n- accessibility I am the Director of Web Development working on the online efforts for Desk.com. My professional interests are web project management, social media implementation, content strategy, information architecture, and facilitating communication between clients, end-users, web developers, and vendors. I am very experienced with visual and interface design, wireframing, rapid prototyping, and web usability. I'm also involved in front-end development, technical training, and web application development. Sometimes I even use Drupal or Wordpress to help maintain websites. \n \nSpecialties:  \n- web and social media strategy \n- content planning \n- information architecture \n- web design \n- graphic design \n- user experience \n- web architecture \n- photo editing/manipulation \n- project management  \n- video editing and filming \n- usability \n- database architecture/management \n- accessibility Experience Director Of Web Development salesforce.com May 2014  – Present (1 year 4 months) san francisco, california Defining strategic direction and leading web projects for Desk.com public-facing web properties. Senior Web Manager Stanford University February 2013  –  May 2014  (1 year 4 months) Working to maintain online.stanford.edu and the associated social media for the Online Learning group at Stanford University Senior Web Producer Stanford University April 2010  –  February 2013  (2 years 11 months) Palo Alto, CA Web Developer Stanford University March 2008  –  April 2010  (2 years 2 months) Web Designer University of Nevada, Reno May 2004  –  March 2008  (3 years 11 months) Digital Media Developer Purdue University March 2002  –  May 2004  (2 years 3 months) Director Of Web Development salesforce.com May 2014  – Present (1 year 4 months) san francisco, california Defining strategic direction and leading web projects for Desk.com public-facing web properties. Director Of Web Development salesforce.com May 2014  – Present (1 year 4 months) san francisco, california Defining strategic direction and leading web projects for Desk.com public-facing web properties. Senior Web Manager Stanford University February 2013  –  May 2014  (1 year 4 months) Working to maintain online.stanford.edu and the associated social media for the Online Learning group at Stanford University Senior Web Manager Stanford University February 2013  –  May 2014  (1 year 4 months) Working to maintain online.stanford.edu and the associated social media for the Online Learning group at Stanford University Senior Web Producer Stanford University April 2010  –  February 2013  (2 years 11 months) Palo Alto, CA Senior Web Producer Stanford University April 2010  –  February 2013  (2 years 11 months) Palo Alto, CA Web Developer Stanford University March 2008  –  April 2010  (2 years 2 months) Web Developer Stanford University March 2008  –  April 2010  (2 years 2 months) Web Designer University of Nevada, Reno May 2004  –  March 2008  (3 years 11 months) Web Designer University of Nevada, Reno May 2004  –  March 2008  (3 years 11 months) Digital Media Developer Purdue University March 2002  –  May 2004  (2 years 3 months) Digital Media Developer Purdue University March 2002  –  May 2004  (2 years 3 months) Skills Information Architecture User Interface Design User Experience Usability Web Design WordPress Drupal Accessibility Content Strategy Front-end Web Project Management Digital Media Wireframes Social Media Marketing Social Media CMS Rapid Prototyping Graphic Design Web Marketing Strategy Web Marketing See 5+     See less Skills  Information Architecture User Interface Design User Experience Usability Web Design WordPress Drupal Accessibility Content Strategy Front-end Web Project Management Digital Media Wireframes Social Media Marketing Social Media CMS Rapid Prototyping Graphic Design Web Marketing Strategy Web Marketing See 5+     See less Information Architecture User Interface Design User Experience Usability Web Design WordPress Drupal Accessibility Content Strategy Front-end Web Project Management Digital Media Wireframes Social Media Marketing Social Media CMS Rapid Prototyping Graphic Design Web Marketing Strategy Web Marketing See 5+     See less Information Architecture User Interface Design User Experience Usability Web Design WordPress Drupal Accessibility Content Strategy Front-end Web Project Management Digital Media Wireframes Social Media Marketing Social Media CMS Rapid Prototyping Graphic Design Web Marketing Strategy Web Marketing See 5+     See less Education Purdue University Psychology / Computer Technology 1997  – 2002 Purdue University Psychology / Computer Technology 1997  – 2002 Purdue University Psychology / Computer Technology 1997  – 2002 Purdue University Psychology / Computer Technology 1997  – 2002 ", "Experience Web Developer Stanford University August 2013  – Present (2 years 1 month) Stanford, CA Senior Software Engineer BabyCenter October 2011  –  July 2013  (1 year 10 months) San Francisco Bay Area Consultant - Web Engineer BabyCenter August 2010  –  October 2011  (1 year 3 months) San Francisco Bay Area Independent Consultant DHAP Digital July 2008  –  October 2008  (4 months) Developed Drupal modules and themes \nInstructed permanent staff in Drupal best practices Consultant / Web Developer OurChart 2007  –  2008  (1 year) Product Manager NetGenesis June 1999  –  December 2001  (2 years 7 months) Cambridge, Massachusetts Manager, Quality Assurance Object Design 1994  –  1995  (1 year) QA Engineer ONTOS 1991  –  1993  (2 years) Systems Programmer University of Chicago 1982  –  1989  (7 years) Web Developer Stanford University August 2013  – Present (2 years 1 month) Stanford, CA Web Developer Stanford University August 2013  – Present (2 years 1 month) Stanford, CA Senior Software Engineer BabyCenter October 2011  –  July 2013  (1 year 10 months) San Francisco Bay Area Senior Software Engineer BabyCenter October 2011  –  July 2013  (1 year 10 months) San Francisco Bay Area Consultant - Web Engineer BabyCenter August 2010  –  October 2011  (1 year 3 months) San Francisco Bay Area Consultant - Web Engineer BabyCenter August 2010  –  October 2011  (1 year 3 months) San Francisco Bay Area Independent Consultant DHAP Digital July 2008  –  October 2008  (4 months) Developed Drupal modules and themes \nInstructed permanent staff in Drupal best practices Independent Consultant DHAP Digital July 2008  –  October 2008  (4 months) Developed Drupal modules and themes \nInstructed permanent staff in Drupal best practices Consultant / Web Developer OurChart 2007  –  2008  (1 year) Consultant / Web Developer OurChart 2007  –  2008  (1 year) Product Manager NetGenesis June 1999  –  December 2001  (2 years 7 months) Cambridge, Massachusetts Product Manager NetGenesis June 1999  –  December 2001  (2 years 7 months) Cambridge, Massachusetts Manager, Quality Assurance Object Design 1994  –  1995  (1 year) Manager, Quality Assurance Object Design 1994  –  1995  (1 year) QA Engineer ONTOS 1991  –  1993  (2 years) QA Engineer ONTOS 1991  –  1993  (2 years) Systems Programmer University of Chicago 1982  –  1989  (7 years) Systems Programmer University of Chicago 1982  –  1989  (7 years) Skills Web Applications Agile Methodologies Web Development Scrum MySQL HTML CSS PHP Object Oriented Design REST WordPress Git Responsive Design jQuery Bootstrap 3 Server Side Foundation 4 GruntJS W3C Accessibility JavaScript See 5+     See less Skills  Web Applications Agile Methodologies Web Development Scrum MySQL HTML CSS PHP Object Oriented Design REST WordPress Git Responsive Design jQuery Bootstrap 3 Server Side Foundation 4 GruntJS W3C Accessibility JavaScript See 5+     See less Web Applications Agile Methodologies Web Development Scrum MySQL HTML CSS PHP Object Oriented Design REST WordPress Git Responsive Design jQuery Bootstrap 3 Server Side Foundation 4 GruntJS W3C Accessibility JavaScript See 5+     See less Web Applications Agile Methodologies Web Development Scrum MySQL HTML CSS PHP Object Oriented Design REST WordPress Git Responsive Design jQuery Bootstrap 3 Server Side Foundation 4 GruntJS W3C Accessibility JavaScript See 5+     See less Education University of Wisconsin-Madison M.S.,  Computer Science 1981  – 1982 Ohio University B.S. Summa Cum Laude,  Mathematics , Computer Science 1977  – 1981 University of Wisconsin-Madison M.S.,  Computer Science 1981  – 1982 University of Wisconsin-Madison M.S.,  Computer Science 1981  – 1982 University of Wisconsin-Madison M.S.,  Computer Science 1981  – 1982 Ohio University B.S. Summa Cum Laude,  Mathematics , Computer Science 1977  – 1981 Ohio University B.S. Summa Cum Laude,  Mathematics , Computer Science 1977  – 1981 Ohio University B.S. Summa Cum Laude,  Mathematics , Computer Science 1977  – 1981 ", "Summary Highly experienced software engineer with proven real-world experience building and scaling high-volume multi-tier SaaS platforms. An engineer with passion for solving problems of scale and building high-impact features and infrastructure services. \n \n Summary Highly experienced software engineer with proven real-world experience building and scaling high-volume multi-tier SaaS platforms. An engineer with passion for solving problems of scale and building high-impact features and infrastructure services. \n \n Highly experienced software engineer with proven real-world experience building and scaling high-volume multi-tier SaaS platforms. An engineer with passion for solving problems of scale and building high-impact features and infrastructure services. \n \n Highly experienced software engineer with proven real-world experience building and scaling high-volume multi-tier SaaS platforms. An engineer with passion for solving problems of scale and building high-impact features and infrastructure services. \n \n Experience Lead Member of Technical Staff salesforce.com November 2012  –  May 2015  (2 years 7 months) San Francisco Platform Architect - Web Content Mangement Group Limelight Networks August 2011  –  June 2012  (11 months) San Francisco During my 5 years at Clickability/Limelight Networks I played a key technical leadership and hands-on role spanning the Engineering and Operation teams, including providing architectural direction, leading performance engineering initiatives and coding key platform components and features. \n \nKey accomplishments include: \n \n•\tEnsured the platform continued to scale with increasing demand by spearheading and implementing platform architectural changes, conceiving and driving DevOps initiatives and working closely with Technical Operations \n•\tHelped grow the Engineering team 3x, mentored new team members, managed team deliverables, oversaw design reviews, and shaped the Clickability Agile software development to successfully and consistently deliver a new platform release every 7-8 weeks over 4 years with zero downtime. \n \n Principal Software Engineer and Architect Clickability (acquired by Limelight Networks in May 2011) August 2009  –  August 2011  (2 years 1 month) San Francisco Bay Area Principal Software Engineer Clickability January 2009  –  August 2009  (8 months) San Francisco Senior Software Engineer Clickability September 2007  –  January 2009  (1 year 5 months) San Francisco Senior Software Engineer Market Insight July 2003  –  September 2007  (4 years 3 months) Senior Software Engineer on a small team with responsibility for all aspects of the development, deployment and maintenance of Market Insight’s web-based software including the flagship site MyProductAdvisor.com.  Web Developer Stanford University Alumni Association November 2001  –  July 2003  (1 year 9 months) Led technical design and development of several key external and internal facing web applications using a variety of technologies. Software Engineer Standard Media International November 2000  –  August 2001  (10 months) Web Developer eHow.com, Inc. February 2000  –  November 2000  (10 months) Consultant Andersen Consulting January 1996  –  July 1997  (1 year 7 months) Performed business analyst role for clients undertaking large-scale enterprise software application development projects and carried out key projects tasks for all stages of the system development lifecycle Lead Member of Technical Staff salesforce.com November 2012  –  May 2015  (2 years 7 months) San Francisco Lead Member of Technical Staff salesforce.com November 2012  –  May 2015  (2 years 7 months) San Francisco Platform Architect - Web Content Mangement Group Limelight Networks August 2011  –  June 2012  (11 months) San Francisco During my 5 years at Clickability/Limelight Networks I played a key technical leadership and hands-on role spanning the Engineering and Operation teams, including providing architectural direction, leading performance engineering initiatives and coding key platform components and features. \n \nKey accomplishments include: \n \n•\tEnsured the platform continued to scale with increasing demand by spearheading and implementing platform architectural changes, conceiving and driving DevOps initiatives and working closely with Technical Operations \n•\tHelped grow the Engineering team 3x, mentored new team members, managed team deliverables, oversaw design reviews, and shaped the Clickability Agile software development to successfully and consistently deliver a new platform release every 7-8 weeks over 4 years with zero downtime. \n \n Platform Architect - Web Content Mangement Group Limelight Networks August 2011  –  June 2012  (11 months) San Francisco During my 5 years at Clickability/Limelight Networks I played a key technical leadership and hands-on role spanning the Engineering and Operation teams, including providing architectural direction, leading performance engineering initiatives and coding key platform components and features. \n \nKey accomplishments include: \n \n•\tEnsured the platform continued to scale with increasing demand by spearheading and implementing platform architectural changes, conceiving and driving DevOps initiatives and working closely with Technical Operations \n•\tHelped grow the Engineering team 3x, mentored new team members, managed team deliverables, oversaw design reviews, and shaped the Clickability Agile software development to successfully and consistently deliver a new platform release every 7-8 weeks over 4 years with zero downtime. \n \n Principal Software Engineer and Architect Clickability (acquired by Limelight Networks in May 2011) August 2009  –  August 2011  (2 years 1 month) San Francisco Bay Area Principal Software Engineer and Architect Clickability (acquired by Limelight Networks in May 2011) August 2009  –  August 2011  (2 years 1 month) San Francisco Bay Area Principal Software Engineer Clickability January 2009  –  August 2009  (8 months) San Francisco Principal Software Engineer Clickability January 2009  –  August 2009  (8 months) San Francisco Senior Software Engineer Clickability September 2007  –  January 2009  (1 year 5 months) San Francisco Senior Software Engineer Clickability September 2007  –  January 2009  (1 year 5 months) San Francisco Senior Software Engineer Market Insight July 2003  –  September 2007  (4 years 3 months) Senior Software Engineer on a small team with responsibility for all aspects of the development, deployment and maintenance of Market Insight’s web-based software including the flagship site MyProductAdvisor.com.  Senior Software Engineer Market Insight July 2003  –  September 2007  (4 years 3 months) Senior Software Engineer on a small team with responsibility for all aspects of the development, deployment and maintenance of Market Insight’s web-based software including the flagship site MyProductAdvisor.com.  Web Developer Stanford University Alumni Association November 2001  –  July 2003  (1 year 9 months) Led technical design and development of several key external and internal facing web applications using a variety of technologies. Web Developer Stanford University Alumni Association November 2001  –  July 2003  (1 year 9 months) Led technical design and development of several key external and internal facing web applications using a variety of technologies. Software Engineer Standard Media International November 2000  –  August 2001  (10 months) Software Engineer Standard Media International November 2000  –  August 2001  (10 months) Web Developer eHow.com, Inc. February 2000  –  November 2000  (10 months) Web Developer eHow.com, Inc. February 2000  –  November 2000  (10 months) Consultant Andersen Consulting January 1996  –  July 1997  (1 year 7 months) Performed business analyst role for clients undertaking large-scale enterprise software application development projects and carried out key projects tasks for all stages of the system development lifecycle Consultant Andersen Consulting January 1996  –  July 1997  (1 year 7 months) Performed business analyst role for clients undertaking large-scale enterprise software application development projects and carried out key projects tasks for all stages of the system development lifecycle Skills SaaS Agile Methodologies Java MySQL Lucene Linux Web Applications Team Leadership DevOps Java Enterprise Edition XML Apache SOAP CSS Cloud Computing Software Development JavaScript SQL Mobile Devices Enterprise Software Perl REST jQuery Scalability See 9+     See less Skills  SaaS Agile Methodologies Java MySQL Lucene Linux Web Applications Team Leadership DevOps Java Enterprise Edition XML Apache SOAP CSS Cloud Computing Software Development JavaScript SQL Mobile Devices Enterprise Software Perl REST jQuery Scalability See 9+     See less SaaS Agile Methodologies Java MySQL Lucene Linux Web Applications Team Leadership DevOps Java Enterprise Edition XML Apache SOAP CSS Cloud Computing Software Development JavaScript SQL Mobile Devices Enterprise Software Perl REST jQuery Scalability See 9+     See less SaaS Agile Methodologies Java MySQL Lucene Linux Web Applications Team Leadership DevOps Java Enterprise Edition XML Apache SOAP CSS Cloud Computing Software Development JavaScript SQL Mobile Devices Enterprise Software Perl REST jQuery Scalability See 9+     See less Education Victoria University of Wellington BA,  History 1993  – 1996 Wanganui Collegiate School Victoria University of Wellington BA,  History 1993  – 1996 Victoria University of Wellington BA,  History 1993  – 1996 Victoria University of Wellington BA,  History 1993  – 1996 Wanganui Collegiate School Wanganui Collegiate School Wanganui Collegiate School ", "Experience Web Developer Stanford University Linguistics Department June 2013  – Present (2 years 3 months) Stanford, CA I combine Alex Djalali's insights from set theory and the linguistic framework of Optimality Theory (OT) to produce a web application designed for OT learners and researchers to test hypotheses and see new implications and understand their collected data. \n \nMy direct responsibilities include: \n- communicating with end users to understand their needs for the application, then integrating those needs into the design \n- developing and maintaining the Python/Flask server-side web application \n- developing, maintaining, and testing the Python back-end data analysis software \n- front-end development (using HTML, Jinja2, jQuery/JavaScript, Handlebars, and CSS) \n- maintaining and administrating an AWS EC2 Linux server running Nginx and uWSGI \n- administrating a MongoDB database, hosted on the AWS server Resident Assistant Stanford Residential Education September 2013  –  July 2014  (11 months) Stanford, CA Help build strong and healthy residential learning communities which complement as well as extend classroom learning. Coordinate efforts in organizing dorm events and managing student concerns with a team of 14 dorm staff members. Maintain relationships with students living on my hall, in order to help them stay connected and have a safe, healthy, and enjoyable residential experience. Research Assistant Center for the Study of Language and Information November 2011  –  June 2013  (1 year 8 months) Stanford, CA Transcribing and annotating recorded conversation to be used in developing an artificially intelligent tutoring system. I also used R scripts to statistically analyze the annotated information. Editor of Departmental Newsletter Stanford University Linguistics Department November 2011  –  June 2013  (1 year 8 months) Stanford, CA Collecting the week's events and news for the Linguistics Department, then compiling them into a coherent and condensed form for publication. Writing and publishing as posts on Wordpress, maintaining a web calendar of department events. Research Assistant Stanford University Linguistics Department June 2012  –  September 2012  (4 months) Stanford, CA Listening to recorded conversations and coding for particular speech features. Web Developer Stanford University Linguistics Department June 2013  – Present (2 years 3 months) Stanford, CA I combine Alex Djalali's insights from set theory and the linguistic framework of Optimality Theory (OT) to produce a web application designed for OT learners and researchers to test hypotheses and see new implications and understand their collected data. \n \nMy direct responsibilities include: \n- communicating with end users to understand their needs for the application, then integrating those needs into the design \n- developing and maintaining the Python/Flask server-side web application \n- developing, maintaining, and testing the Python back-end data analysis software \n- front-end development (using HTML, Jinja2, jQuery/JavaScript, Handlebars, and CSS) \n- maintaining and administrating an AWS EC2 Linux server running Nginx and uWSGI \n- administrating a MongoDB database, hosted on the AWS server Web Developer Stanford University Linguistics Department June 2013  – Present (2 years 3 months) Stanford, CA I combine Alex Djalali's insights from set theory and the linguistic framework of Optimality Theory (OT) to produce a web application designed for OT learners and researchers to test hypotheses and see new implications and understand their collected data. \n \nMy direct responsibilities include: \n- communicating with end users to understand their needs for the application, then integrating those needs into the design \n- developing and maintaining the Python/Flask server-side web application \n- developing, maintaining, and testing the Python back-end data analysis software \n- front-end development (using HTML, Jinja2, jQuery/JavaScript, Handlebars, and CSS) \n- maintaining and administrating an AWS EC2 Linux server running Nginx and uWSGI \n- administrating a MongoDB database, hosted on the AWS server Resident Assistant Stanford Residential Education September 2013  –  July 2014  (11 months) Stanford, CA Help build strong and healthy residential learning communities which complement as well as extend classroom learning. Coordinate efforts in organizing dorm events and managing student concerns with a team of 14 dorm staff members. Maintain relationships with students living on my hall, in order to help them stay connected and have a safe, healthy, and enjoyable residential experience. Resident Assistant Stanford Residential Education September 2013  –  July 2014  (11 months) Stanford, CA Help build strong and healthy residential learning communities which complement as well as extend classroom learning. Coordinate efforts in organizing dorm events and managing student concerns with a team of 14 dorm staff members. Maintain relationships with students living on my hall, in order to help them stay connected and have a safe, healthy, and enjoyable residential experience. Research Assistant Center for the Study of Language and Information November 2011  –  June 2013  (1 year 8 months) Stanford, CA Transcribing and annotating recorded conversation to be used in developing an artificially intelligent tutoring system. I also used R scripts to statistically analyze the annotated information. Research Assistant Center for the Study of Language and Information November 2011  –  June 2013  (1 year 8 months) Stanford, CA Transcribing and annotating recorded conversation to be used in developing an artificially intelligent tutoring system. I also used R scripts to statistically analyze the annotated information. Editor of Departmental Newsletter Stanford University Linguistics Department November 2011  –  June 2013  (1 year 8 months) Stanford, CA Collecting the week's events and news for the Linguistics Department, then compiling them into a coherent and condensed form for publication. Writing and publishing as posts on Wordpress, maintaining a web calendar of department events. Editor of Departmental Newsletter Stanford University Linguistics Department November 2011  –  June 2013  (1 year 8 months) Stanford, CA Collecting the week's events and news for the Linguistics Department, then compiling them into a coherent and condensed form for publication. Writing and publishing as posts on Wordpress, maintaining a web calendar of department events. Research Assistant Stanford University Linguistics Department June 2012  –  September 2012  (4 months) Stanford, CA Listening to recorded conversations and coding for particular speech features. Research Assistant Stanford University Linguistics Department June 2012  –  September 2012  (4 months) Stanford, CA Listening to recorded conversations and coding for particular speech features. Languages Bengali Spanish Hindi Bengali Spanish Hindi Bengali Spanish Hindi Skills Python Linux Flask MongoDB JavaScript Linguistics Teaching Leadership Skills  Python Linux Flask MongoDB JavaScript Linguistics Teaching Leadership Python Linux Flask MongoDB JavaScript Linguistics Teaching Leadership Python Linux Flask MongoDB JavaScript Linguistics Teaching Leadership Education Stanford University Bachelor of Arts (B.A.),  Linguistics 2010  – 2014 Major in Linguistics, minor in Computer Science, Research Assistant for various linguistics labs, small group leader for InterVarsity Christian Fellowship, Resident Assistant for senior year Activities and Societies:  Ski Team ,  Intervarsity Christian Fellowship Greeley West High School Stanford University Bachelor of Arts (B.A.),  Linguistics 2010  – 2014 Major in Linguistics, minor in Computer Science, Research Assistant for various linguistics labs, small group leader for InterVarsity Christian Fellowship, Resident Assistant for senior year Activities and Societies:  Ski Team ,  Intervarsity Christian Fellowship Stanford University Bachelor of Arts (B.A.),  Linguistics 2010  – 2014 Major in Linguistics, minor in Computer Science, Research Assistant for various linguistics labs, small group leader for InterVarsity Christian Fellowship, Resident Assistant for senior year Activities and Societies:  Ski Team ,  Intervarsity Christian Fellowship Stanford University Bachelor of Arts (B.A.),  Linguistics 2010  – 2014 Major in Linguistics, minor in Computer Science, Research Assistant for various linguistics labs, small group leader for InterVarsity Christian Fellowship, Resident Assistant for senior year Activities and Societies:  Ski Team ,  Intervarsity Christian Fellowship Greeley West High School Greeley West High School Greeley West High School ", "Experience Software Engineer Google June 2015  – Present (3 months) Mountain View Software Engineer Stanford University April 2015  –  June 2015  (3 months) Built a rank retrieval search engine using Java on Eclipse and used the tf-idf score, BM25F and smallest window as ranking criterions and NDCG (Normalized Discounted Cumulative Gain) score as performance metric \nApplied machine learning to train the search engine, including pointwise learning (linear regression) and pairwise learning (SVM) and the NDCG score achieved is 0.87 \nImplemented stemming and word vector model to further improve the search engine \nBuilt a boolean retrieval search engine and used compressed inverted index to return search results \nImplemented spell correction based on bigram language model and spell corrector model with empirical edit cost iOS Developer Stanford University January 2015  –  March 2015  (3 months) Designed an iOS app using Swift on Xcode, which supports user registration, adding friends and playing a gravity-controlled game \nIncorporated a lot of iOS APIs such as taking pictures, sending emails, apple map and core data \nUtilized animator, core motion and timer APIs to build a gravity-controlled game \nApplied different iOS views to the UI, such as table view, popover view, navigation view and modal view Web Developer Stanford University January 2015  –  March 2015  (3 months) Built a photo-based social application using Ruby on Rails, which supports user registration, uploading and searching for photos, comments and tagging \nManaged user's data using migrations provided by Ruby on Rails and implemented real-time photo matching using AJAX \nDesigned a decent UI based on HTML and CSS and generated dynamic webpages using Javascript Web Developer Stanford University October 2014  –  December 2014  (3 months) Constructed an online auction system based on web.py and Jinja2, supporting advanced searching and bidding \nParsed the original semi-structured data (JSON files provided by eBay) into relational database using Python and maintained it using SQL Data Analyst Stanford University October 2014  –  December 2014  (3 months) Used SVM, Naive Bayes, Logistic Regression and Neural Network to predict influencers in social networks \nApplied cross validation and feature selection to different models based on Matlab \nImplemented K-means clustering algorithm to discretize data and proposed a coordinate ascent algorithm to improve performance of the multinomial Naive Bayes model Web Developer Shanghai Jiao Tong University March 2012  –  October 2012  (8 months) Constructed a clouding computing network service and application platform based on node.js and HTML \nUtilized Git to maintain and contribute to the system repositor Software Engineer Google June 2015  – Present (3 months) Mountain View Software Engineer Google June 2015  – Present (3 months) Mountain View Software Engineer Stanford University April 2015  –  June 2015  (3 months) Built a rank retrieval search engine using Java on Eclipse and used the tf-idf score, BM25F and smallest window as ranking criterions and NDCG (Normalized Discounted Cumulative Gain) score as performance metric \nApplied machine learning to train the search engine, including pointwise learning (linear regression) and pairwise learning (SVM) and the NDCG score achieved is 0.87 \nImplemented stemming and word vector model to further improve the search engine \nBuilt a boolean retrieval search engine and used compressed inverted index to return search results \nImplemented spell correction based on bigram language model and spell corrector model with empirical edit cost Software Engineer Stanford University April 2015  –  June 2015  (3 months) Built a rank retrieval search engine using Java on Eclipse and used the tf-idf score, BM25F and smallest window as ranking criterions and NDCG (Normalized Discounted Cumulative Gain) score as performance metric \nApplied machine learning to train the search engine, including pointwise learning (linear regression) and pairwise learning (SVM) and the NDCG score achieved is 0.87 \nImplemented stemming and word vector model to further improve the search engine \nBuilt a boolean retrieval search engine and used compressed inverted index to return search results \nImplemented spell correction based on bigram language model and spell corrector model with empirical edit cost iOS Developer Stanford University January 2015  –  March 2015  (3 months) Designed an iOS app using Swift on Xcode, which supports user registration, adding friends and playing a gravity-controlled game \nIncorporated a lot of iOS APIs such as taking pictures, sending emails, apple map and core data \nUtilized animator, core motion and timer APIs to build a gravity-controlled game \nApplied different iOS views to the UI, such as table view, popover view, navigation view and modal view iOS Developer Stanford University January 2015  –  March 2015  (3 months) Designed an iOS app using Swift on Xcode, which supports user registration, adding friends and playing a gravity-controlled game \nIncorporated a lot of iOS APIs such as taking pictures, sending emails, apple map and core data \nUtilized animator, core motion and timer APIs to build a gravity-controlled game \nApplied different iOS views to the UI, such as table view, popover view, navigation view and modal view Web Developer Stanford University January 2015  –  March 2015  (3 months) Built a photo-based social application using Ruby on Rails, which supports user registration, uploading and searching for photos, comments and tagging \nManaged user's data using migrations provided by Ruby on Rails and implemented real-time photo matching using AJAX \nDesigned a decent UI based on HTML and CSS and generated dynamic webpages using Javascript Web Developer Stanford University January 2015  –  March 2015  (3 months) Built a photo-based social application using Ruby on Rails, which supports user registration, uploading and searching for photos, comments and tagging \nManaged user's data using migrations provided by Ruby on Rails and implemented real-time photo matching using AJAX \nDesigned a decent UI based on HTML and CSS and generated dynamic webpages using Javascript Web Developer Stanford University October 2014  –  December 2014  (3 months) Constructed an online auction system based on web.py and Jinja2, supporting advanced searching and bidding \nParsed the original semi-structured data (JSON files provided by eBay) into relational database using Python and maintained it using SQL Web Developer Stanford University October 2014  –  December 2014  (3 months) Constructed an online auction system based on web.py and Jinja2, supporting advanced searching and bidding \nParsed the original semi-structured data (JSON files provided by eBay) into relational database using Python and maintained it using SQL Data Analyst Stanford University October 2014  –  December 2014  (3 months) Used SVM, Naive Bayes, Logistic Regression and Neural Network to predict influencers in social networks \nApplied cross validation and feature selection to different models based on Matlab \nImplemented K-means clustering algorithm to discretize data and proposed a coordinate ascent algorithm to improve performance of the multinomial Naive Bayes model Data Analyst Stanford University October 2014  –  December 2014  (3 months) Used SVM, Naive Bayes, Logistic Regression and Neural Network to predict influencers in social networks \nApplied cross validation and feature selection to different models based on Matlab \nImplemented K-means clustering algorithm to discretize data and proposed a coordinate ascent algorithm to improve performance of the multinomial Naive Bayes model Web Developer Shanghai Jiao Tong University March 2012  –  October 2012  (8 months) Constructed a clouding computing network service and application platform based on node.js and HTML \nUtilized Git to maintain and contribute to the system repositor Web Developer Shanghai Jiao Tong University March 2012  –  October 2012  (8 months) Constructed a clouding computing network service and application platform based on node.js and HTML \nUtilized Git to maintain and contribute to the system repositor Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills C++ Matlab C SQL Python Swift HTML Java Bash Linux Unix Windows LaTeX Visual Studio PostgreSQL Xcode Eclipse VHDL Labview CSS Ruby on Rails Hadoop AJAX See 8+     See less Skills  C++ Matlab C SQL Python Swift HTML Java Bash Linux Unix Windows LaTeX Visual Studio PostgreSQL Xcode Eclipse VHDL Labview CSS Ruby on Rails Hadoop AJAX See 8+     See less C++ Matlab C SQL Python Swift HTML Java Bash Linux Unix Windows LaTeX Visual Studio PostgreSQL Xcode Eclipse VHDL Labview CSS Ruby on Rails Hadoop AJAX See 8+     See less C++ Matlab C SQL Python Swift HTML Java Bash Linux Unix Windows LaTeX Visual Studio PostgreSQL Xcode Eclipse VHDL Labview CSS Ruby on Rails Hadoop AJAX See 8+     See less Education Stanford University Master's Degree,  Electrical Engineering , 4.0/4.0 2014  – 2016 Shanghai Jiao Tong University Bachelor’s Degree,  Information Engineering , 3.8/4.3 2010  – 2014 Stanford University Master's Degree,  Electrical Engineering , 4.0/4.0 2014  – 2016 Stanford University Master's Degree,  Electrical Engineering , 4.0/4.0 2014  – 2016 Stanford University Master's Degree,  Electrical Engineering , 4.0/4.0 2014  – 2016 Shanghai Jiao Tong University Bachelor’s Degree,  Information Engineering , 3.8/4.3 2010  – 2014 Shanghai Jiao Tong University Bachelor’s Degree,  Information Engineering , 3.8/4.3 2010  – 2014 Shanghai Jiao Tong University Bachelor’s Degree,  Information Engineering , 3.8/4.3 2010  – 2014 Honors & Awards First-class Prize in National High School Mathematics Competition November 2009 National Scholarship September 2011 First-class Academic Excellence Scholarship September 2011 First-class Prize in TI Cup Electronic Design Contest April 2013 First-class Prize in National High School Mathematics Competition November 2009 First-class Prize in National High School Mathematics Competition November 2009 First-class Prize in National High School Mathematics Competition November 2009 National Scholarship September 2011 National Scholarship September 2011 National Scholarship September 2011 First-class Academic Excellence Scholarship September 2011 First-class Academic Excellence Scholarship September 2011 First-class Academic Excellence Scholarship September 2011 First-class Prize in TI Cup Electronic Design Contest April 2013 First-class Prize in TI Cup Electronic Design Contest April 2013 First-class Prize in TI Cup Electronic Design Contest April 2013 ", "Skills Drupal jQuery CSS Web Development HTML5 XHTML HTML JavaScript XML PHP MySQL Social Media Awesomeness CSS3 HTML 5 CMS Front-end Graphic Design Photoshop Web Standards Git Website Development Web Design User Interface Design Interaction Design User Experience Information Architecture WordPress Web Applications Mobile Applications Web Analytics SEO See 17+     See less Skills  Drupal jQuery CSS Web Development HTML5 XHTML HTML JavaScript XML PHP MySQL Social Media Awesomeness CSS3 HTML 5 CMS Front-end Graphic Design Photoshop Web Standards Git Website Development Web Design User Interface Design Interaction Design User Experience Information Architecture WordPress Web Applications Mobile Applications Web Analytics SEO See 17+     See less Drupal jQuery CSS Web Development HTML5 XHTML HTML JavaScript XML PHP MySQL Social Media Awesomeness CSS3 HTML 5 CMS Front-end Graphic Design Photoshop Web Standards Git Website Development Web Design User Interface Design Interaction Design User Experience Information Architecture WordPress Web Applications Mobile Applications Web Analytics SEO See 17+     See less Drupal jQuery CSS Web Development HTML5 XHTML HTML JavaScript XML PHP MySQL Social Media Awesomeness CSS3 HTML 5 CMS Front-end Graphic Design Photoshop Web Standards Git Website Development Web Design User Interface Design Interaction Design User Experience Information Architecture WordPress Web Applications Mobile Applications Web Analytics SEO See 17+     See less ", "Experience Technical Lead / Senior Web Developer Stanford University August 2005  – Present (10 years 1 month) Senior Web Developer / Principal Inxite, LLC May 1998  – Present (17 years 4 months) Technical Lead / Software Developer / Teaching Assistant University of Texas at Austin 1994  –  1999  (5 years) Technical Lead / Senior Web Developer Stanford University August 2005  – Present (10 years 1 month) Technical Lead / Senior Web Developer Stanford University August 2005  – Present (10 years 1 month) Senior Web Developer / Principal Inxite, LLC May 1998  – Present (17 years 4 months) Senior Web Developer / Principal Inxite, LLC May 1998  – Present (17 years 4 months) Technical Lead / Software Developer / Teaching Assistant University of Texas at Austin 1994  –  1999  (5 years) Technical Lead / Software Developer / Teaching Assistant University of Texas at Austin 1994  –  1999  (5 years) Skills Drupal MySQL PHP Information Architecture OOP Web Services Perl HTML 5 CSS JavaScript Web Applications Web Design User Experience Linux User Interface Design Web Development jQuery SQL AJAX LAMP XHTML OS X Open Source Apache Database Design Python HTML Bash WordPress Integration User Interface CMS XML Git Mobile Applications Databases Project Management Unix Shell Scripting Java Accessibility Software Development Ruby on Rails Programming Software Engineering Usability HTML5 See 32+     See less Skills  Drupal MySQL PHP Information Architecture OOP Web Services Perl HTML 5 CSS JavaScript Web Applications Web Design User Experience Linux User Interface Design Web Development jQuery SQL AJAX LAMP XHTML OS X Open Source Apache Database Design Python HTML Bash WordPress Integration User Interface CMS XML Git Mobile Applications Databases Project Management Unix Shell Scripting Java Accessibility Software Development Ruby on Rails Programming Software Engineering Usability HTML5 See 32+     See less Drupal MySQL PHP Information Architecture OOP Web Services Perl HTML 5 CSS JavaScript Web Applications Web Design User Experience Linux User Interface Design Web Development jQuery SQL AJAX LAMP XHTML OS X Open Source Apache Database Design Python HTML Bash WordPress Integration User Interface CMS XML Git Mobile Applications Databases Project Management Unix Shell Scripting Java Accessibility Software Development Ruby on Rails Programming Software Engineering Usability HTML5 See 32+     See less Drupal MySQL PHP Information Architecture OOP Web Services Perl HTML 5 CSS JavaScript Web Applications Web Design User Experience Linux User Interface Design Web Development jQuery SQL AJAX LAMP XHTML OS X Open Source Apache Database Design Python HTML Bash WordPress Integration User Interface CMS XML Git Mobile Applications Databases Project Management Unix Shell Scripting Java Accessibility Software Development Ruby on Rails Programming Software Engineering Usability HTML5 See 32+     See less Education University of Texas at Austin May 1999 University of California, Los Angeles B.A. 1990  – 1993 University of Texas at Austin May 1999 University of Texas at Austin May 1999 University of Texas at Austin May 1999 University of California, Los Angeles B.A. 1990  – 1993 University of California, Los Angeles B.A. 1990  – 1993 University of California, Los Angeles B.A. 1990  – 1993 ", "Experience Web Design Engineer Amazon January 2015  – Present (8 months) Web Developer, Contractor ADP October 2014  –  January 2015  (4 months) Alpharetta, GA - Developed new AngularJS features for the Red Box application, a complete redesign of ADP’s client-facing site \n- Wired up data with $http get and post calls using a RESTful web API \n- Wrote Jasmine tests to automate code testing \n- Technologies: HTML5, CSS3, Less, JavaScript, JSON, AngularJS, jQuery, Jasmine, Git, Stash, Photoshop Software Engineer, Contractor The Weather Channel August 2014  –  October 2014  (3 months) Greater Atlanta Area - Developed new features for the weather.com redesign \n- Integrated modules consisting of HTML, Sass, JavaScript and AngularJS into Drupal content management system \n- Managed each module as its own branch in git, submitting pull requests through Stash to merge into master Information Engineer SolTech Inc April 2013  –  August 2014  (1 year 5 months) Greater Atlanta Area - Built the responsive UI for Fusionetics, a medical web app used by the San Antonio Spurs and Phoenix Suns \n- Developed interactive experience design documentation for consistent use of color, fonts, images and functionality \n- Developed the front end for insurance group Code SixFour using DotNetNuke Web Developer Stanford University July 2010  –  March 2013  (2 years 9 months) Stanford - Implement new features for existing sites such as stanford.edu, Stanford News and Stanford Events \n- Develop new top-level sites including Stanford Identity, Home of Champions, STAN 2011, Loma Prieta and StanfordNYC \n- Redesign content management systems such as the Stanford CMS and WordPress theme \n- Build mobile-friendly and responsive sites including Stanford News, Commencement, Parents, The Dish and Stanford Mobile (featured on jquerymobile.com) Web Marketing Specialist Stanford Hospital December 2008  –  July 2010  (1 year 8 months) - Designed organic inpatient program Farm Fresh site that captured 4,500 visitors in its first month \n- Developed Bariatric Surgery site that exceeded benchmarks by 300% \n- Managed Microsoft SharePoint Intranet site, providing ongoing training, support and problem resolution Marketing & Communications Assistant Stanford University Medical Center January 2008  –  December 2008  (1 year) - Utilized Google Analytics user data for an improved UI resulting in an 18% conversion increase \n- Created Medical Center's first blog, recruitment Web site redesigns and bi-weekly eNewsletter \n- Saved Stanford $30,000 and 141,000 sheets of paper annually through new hire communications redesign Web Developer Involution Studios June 2007  –  December 2007  (7 months) - Implemented enterprise-level Web sites with a creative team of designers, developers and programmers \n- Created sales prototype Web site for startup Bright Minds Software \n- Developed instructional design e-learning Web site for Faculte President Burnett Communications January 2006  –  May 2007  (1 year 5 months) - Started communications firm handling all aspects including business development, sales and marketing \n- Established sales application that generated online business leads through Google, Yahoo and MSN \n- Designed and developed award-winning Web sites for Yahoo, ANB Insurance & The University of Alabama Web Design Engineer Amazon January 2015  – Present (8 months) Web Design Engineer Amazon January 2015  – Present (8 months) Web Developer, Contractor ADP October 2014  –  January 2015  (4 months) Alpharetta, GA - Developed new AngularJS features for the Red Box application, a complete redesign of ADP’s client-facing site \n- Wired up data with $http get and post calls using a RESTful web API \n- Wrote Jasmine tests to automate code testing \n- Technologies: HTML5, CSS3, Less, JavaScript, JSON, AngularJS, jQuery, Jasmine, Git, Stash, Photoshop Web Developer, Contractor ADP October 2014  –  January 2015  (4 months) Alpharetta, GA - Developed new AngularJS features for the Red Box application, a complete redesign of ADP’s client-facing site \n- Wired up data with $http get and post calls using a RESTful web API \n- Wrote Jasmine tests to automate code testing \n- Technologies: HTML5, CSS3, Less, JavaScript, JSON, AngularJS, jQuery, Jasmine, Git, Stash, Photoshop Software Engineer, Contractor The Weather Channel August 2014  –  October 2014  (3 months) Greater Atlanta Area - Developed new features for the weather.com redesign \n- Integrated modules consisting of HTML, Sass, JavaScript and AngularJS into Drupal content management system \n- Managed each module as its own branch in git, submitting pull requests through Stash to merge into master Software Engineer, Contractor The Weather Channel August 2014  –  October 2014  (3 months) Greater Atlanta Area - Developed new features for the weather.com redesign \n- Integrated modules consisting of HTML, Sass, JavaScript and AngularJS into Drupal content management system \n- Managed each module as its own branch in git, submitting pull requests through Stash to merge into master Information Engineer SolTech Inc April 2013  –  August 2014  (1 year 5 months) Greater Atlanta Area - Built the responsive UI for Fusionetics, a medical web app used by the San Antonio Spurs and Phoenix Suns \n- Developed interactive experience design documentation for consistent use of color, fonts, images and functionality \n- Developed the front end for insurance group Code SixFour using DotNetNuke Information Engineer SolTech Inc April 2013  –  August 2014  (1 year 5 months) Greater Atlanta Area - Built the responsive UI for Fusionetics, a medical web app used by the San Antonio Spurs and Phoenix Suns \n- Developed interactive experience design documentation for consistent use of color, fonts, images and functionality \n- Developed the front end for insurance group Code SixFour using DotNetNuke Web Developer Stanford University July 2010  –  March 2013  (2 years 9 months) Stanford - Implement new features for existing sites such as stanford.edu, Stanford News and Stanford Events \n- Develop new top-level sites including Stanford Identity, Home of Champions, STAN 2011, Loma Prieta and StanfordNYC \n- Redesign content management systems such as the Stanford CMS and WordPress theme \n- Build mobile-friendly and responsive sites including Stanford News, Commencement, Parents, The Dish and Stanford Mobile (featured on jquerymobile.com) Web Developer Stanford University July 2010  –  March 2013  (2 years 9 months) Stanford - Implement new features for existing sites such as stanford.edu, Stanford News and Stanford Events \n- Develop new top-level sites including Stanford Identity, Home of Champions, STAN 2011, Loma Prieta and StanfordNYC \n- Redesign content management systems such as the Stanford CMS and WordPress theme \n- Build mobile-friendly and responsive sites including Stanford News, Commencement, Parents, The Dish and Stanford Mobile (featured on jquerymobile.com) Web Marketing Specialist Stanford Hospital December 2008  –  July 2010  (1 year 8 months) - Designed organic inpatient program Farm Fresh site that captured 4,500 visitors in its first month \n- Developed Bariatric Surgery site that exceeded benchmarks by 300% \n- Managed Microsoft SharePoint Intranet site, providing ongoing training, support and problem resolution Web Marketing Specialist Stanford Hospital December 2008  –  July 2010  (1 year 8 months) - Designed organic inpatient program Farm Fresh site that captured 4,500 visitors in its first month \n- Developed Bariatric Surgery site that exceeded benchmarks by 300% \n- Managed Microsoft SharePoint Intranet site, providing ongoing training, support and problem resolution Marketing & Communications Assistant Stanford University Medical Center January 2008  –  December 2008  (1 year) - Utilized Google Analytics user data for an improved UI resulting in an 18% conversion increase \n- Created Medical Center's first blog, recruitment Web site redesigns and bi-weekly eNewsletter \n- Saved Stanford $30,000 and 141,000 sheets of paper annually through new hire communications redesign Marketing & Communications Assistant Stanford University Medical Center January 2008  –  December 2008  (1 year) - Utilized Google Analytics user data for an improved UI resulting in an 18% conversion increase \n- Created Medical Center's first blog, recruitment Web site redesigns and bi-weekly eNewsletter \n- Saved Stanford $30,000 and 141,000 sheets of paper annually through new hire communications redesign Web Developer Involution Studios June 2007  –  December 2007  (7 months) - Implemented enterprise-level Web sites with a creative team of designers, developers and programmers \n- Created sales prototype Web site for startup Bright Minds Software \n- Developed instructional design e-learning Web site for Faculte Web Developer Involution Studios June 2007  –  December 2007  (7 months) - Implemented enterprise-level Web sites with a creative team of designers, developers and programmers \n- Created sales prototype Web site for startup Bright Minds Software \n- Developed instructional design e-learning Web site for Faculte President Burnett Communications January 2006  –  May 2007  (1 year 5 months) - Started communications firm handling all aspects including business development, sales and marketing \n- Established sales application that generated online business leads through Google, Yahoo and MSN \n- Designed and developed award-winning Web sites for Yahoo, ANB Insurance & The University of Alabama President Burnett Communications January 2006  –  May 2007  (1 year 5 months) - Started communications firm handling all aspects including business development, sales and marketing \n- Established sales application that generated online business leads through Google, Yahoo and MSN \n- Designed and developed award-winning Web sites for Yahoo, ANB Insurance & The University of Alabama Skills CSS JavaScript AngularJS jQuery jQuery Mobile HTML5 WordPress Information Architecture Responsive Web Design User Interface Bower Grunt Yeoman XHTML MySQL Dreamweaver PHP Accessibility Google Analytics HTML 5 Graphic Design Mobile Devices CMS InDesign Mobile Internet Bootstrap Git Web Design See 13+     See less Skills  CSS JavaScript AngularJS jQuery jQuery Mobile HTML5 WordPress Information Architecture Responsive Web Design User Interface Bower Grunt Yeoman XHTML MySQL Dreamweaver PHP Accessibility Google Analytics HTML 5 Graphic Design Mobile Devices CMS InDesign Mobile Internet Bootstrap Git Web Design See 13+     See less CSS JavaScript AngularJS jQuery jQuery Mobile HTML5 WordPress Information Architecture Responsive Web Design User Interface Bower Grunt Yeoman XHTML MySQL Dreamweaver PHP Accessibility Google Analytics HTML 5 Graphic Design Mobile Devices CMS InDesign Mobile Internet Bootstrap Git Web Design See 13+     See less CSS JavaScript AngularJS jQuery jQuery Mobile HTML5 WordPress Information Architecture Responsive Web Design User Interface Bower Grunt Yeoman XHTML MySQL Dreamweaver PHP Accessibility Google Analytics HTML 5 Graphic Design Mobile Devices CMS InDesign Mobile Internet Bootstrap Git Web Design See 13+     See less Education University of Alabama MA,  Advertising and Public Relations 2004  – 2005 - Selected as one of 30 students nationally to attend the Direct Marketing Educational Foundation seminar in New York. \n- Created social action campaign press kit featuring a news release, ad, speech, brochure and 30-second spot. \n- Produced initial communication materials and logo designs for The Plank Center, the third University-based Public Relations Center nationally. Activities and Societies:  Graduate Assistant in Student Financial Aid University of North Carolina at Greensboro BFA,  Education 1999  – 2002 - Studied abroad in Finland, Estonia and Sweden before graduating magna cum laude. \n- Worked part time during school and full time during summer to pay for my education. Activities and Societies:  Resident Assistant University of Alabama MA,  Advertising and Public Relations 2004  – 2005 - Selected as one of 30 students nationally to attend the Direct Marketing Educational Foundation seminar in New York. \n- Created social action campaign press kit featuring a news release, ad, speech, brochure and 30-second spot. \n- Produced initial communication materials and logo designs for The Plank Center, the third University-based Public Relations Center nationally. Activities and Societies:  Graduate Assistant in Student Financial Aid University of Alabama MA,  Advertising and Public Relations 2004  – 2005 - Selected as one of 30 students nationally to attend the Direct Marketing Educational Foundation seminar in New York. \n- Created social action campaign press kit featuring a news release, ad, speech, brochure and 30-second spot. \n- Produced initial communication materials and logo designs for The Plank Center, the third University-based Public Relations Center nationally. Activities and Societies:  Graduate Assistant in Student Financial Aid University of Alabama MA,  Advertising and Public Relations 2004  – 2005 - Selected as one of 30 students nationally to attend the Direct Marketing Educational Foundation seminar in New York. \n- Created social action campaign press kit featuring a news release, ad, speech, brochure and 30-second spot. \n- Produced initial communication materials and logo designs for The Plank Center, the third University-based Public Relations Center nationally. Activities and Societies:  Graduate Assistant in Student Financial Aid University of North Carolina at Greensboro BFA,  Education 1999  – 2002 - Studied abroad in Finland, Estonia and Sweden before graduating magna cum laude. \n- Worked part time during school and full time during summer to pay for my education. Activities and Societies:  Resident Assistant University of North Carolina at Greensboro BFA,  Education 1999  – 2002 - Studied abroad in Finland, Estonia and Sweden before graduating magna cum laude. \n- Worked part time during school and full time during summer to pay for my education. Activities and Societies:  Resident Assistant University of North Carolina at Greensboro BFA,  Education 1999  – 2002 - Studied abroad in Finland, Estonia and Sweden before graduating magna cum laude. \n- Worked part time during school and full time during summer to pay for my education. Activities and Societies:  Resident Assistant Honors & Awards ", "Summary Accomplished Software Engineer with over 12 years of experience designing and implementing innovative solutions to challenging technical problems. \n \nExtensive experience throughout the entire development lifecycle: analysis, design, implementation, testing, and post-production support. \n \nProven expertise in delivering high-quality production level software. \n \nExcellent technical management and leadership skills: proactive, results-oriented, and motivated to succeed. Summary Accomplished Software Engineer with over 12 years of experience designing and implementing innovative solutions to challenging technical problems. \n \nExtensive experience throughout the entire development lifecycle: analysis, design, implementation, testing, and post-production support. \n \nProven expertise in delivering high-quality production level software. \n \nExcellent technical management and leadership skills: proactive, results-oriented, and motivated to succeed. Accomplished Software Engineer with over 12 years of experience designing and implementing innovative solutions to challenging technical problems. \n \nExtensive experience throughout the entire development lifecycle: analysis, design, implementation, testing, and post-production support. \n \nProven expertise in delivering high-quality production level software. \n \nExcellent technical management and leadership skills: proactive, results-oriented, and motivated to succeed. Accomplished Software Engineer with over 12 years of experience designing and implementing innovative solutions to challenging technical problems. \n \nExtensive experience throughout the entire development lifecycle: analysis, design, implementation, testing, and post-production support. \n \nProven expertise in delivering high-quality production level software. \n \nExcellent technical management and leadership skills: proactive, results-oriented, and motivated to succeed. Skills Software Project... SDLC Agile Methodologies Software Design Software Development Mobile Applications Web Development User Interface Software Engineering Unit Testing Database Design Skills  Software Project... SDLC Agile Methodologies Software Design Software Development Mobile Applications Web Development User Interface Software Engineering Unit Testing Database Design Software Project... SDLC Agile Methodologies Software Design Software Development Mobile Applications Web Development User Interface Software Engineering Unit Testing Database Design Software Project... SDLC Agile Methodologies Software Design Software Development Mobile Applications Web Development User Interface Software Engineering Unit Testing Database Design Education University of California, Davis BS,  Computer Science and Engineering 1996  – 2001 BS, Computer Science & Engineering University of California, Davis BS,  Computer Science and Engineering 1996  – 2001 BS, Computer Science & Engineering University of California, Davis BS,  Computer Science and Engineering 1996  – 2001 BS, Computer Science & Engineering University of California, Davis BS,  Computer Science and Engineering 1996  – 2001 BS, Computer Science & Engineering ", "Skills Web Development User Experience PHP JavaScript Apache CSS HTML Graphic Design MySQL Linux Microsoft SQL Server jQuery Mobile Internet YUI CakePHP CodeIgniter MVC Architecture Dreamweaver HTML 5 Web Design Accessibility User Interface Design WordPress User Interface E-commerce Mobile Applications Web 2.0 CMS Information Architecture SEO Web Applications Project Management Software Development SQL XML See 20+     See less Skills  Web Development User Experience PHP JavaScript Apache CSS HTML Graphic Design MySQL Linux Microsoft SQL Server jQuery Mobile Internet YUI CakePHP CodeIgniter MVC Architecture Dreamweaver HTML 5 Web Design Accessibility User Interface Design WordPress User Interface E-commerce Mobile Applications Web 2.0 CMS Information Architecture SEO Web Applications Project Management Software Development SQL XML See 20+     See less Web Development User Experience PHP JavaScript Apache CSS HTML Graphic Design MySQL Linux Microsoft SQL Server jQuery Mobile Internet YUI CakePHP CodeIgniter MVC Architecture Dreamweaver HTML 5 Web Design Accessibility User Interface Design WordPress User Interface E-commerce Mobile Applications Web 2.0 CMS Information Architecture SEO Web Applications Project Management Software Development SQL XML See 20+     See less Web Development User Experience PHP JavaScript Apache CSS HTML Graphic Design MySQL Linux Microsoft SQL Server jQuery Mobile Internet YUI CakePHP CodeIgniter MVC Architecture Dreamweaver HTML 5 Web Design Accessibility User Interface Design WordPress User Interface E-commerce Mobile Applications Web 2.0 CMS Information Architecture SEO Web Applications Project Management Software Development SQL XML See 20+     See less ", "Summary Managing a highly successful engineering team. In-depth knowledge and hands-on development experience with Web and API best practices, performance optimization, security, versioning, monitoring and scaling.  \n \nSpecialties:  \nObject-oriented programming experience with PHP, Python and Java. \nExtensive database experience with Redis and MySQL. \nHands-on experience with Node.js, iOS and mobile web development. \nProven success at a startup environment. Summary Managing a highly successful engineering team. In-depth knowledge and hands-on development experience with Web and API best practices, performance optimization, security, versioning, monitoring and scaling.  \n \nSpecialties:  \nObject-oriented programming experience with PHP, Python and Java. \nExtensive database experience with Redis and MySQL. \nHands-on experience with Node.js, iOS and mobile web development. \nProven success at a startup environment. Managing a highly successful engineering team. In-depth knowledge and hands-on development experience with Web and API best practices, performance optimization, security, versioning, monitoring and scaling.  \n \nSpecialties:  \nObject-oriented programming experience with PHP, Python and Java. \nExtensive database experience with Redis and MySQL. \nHands-on experience with Node.js, iOS and mobile web development. \nProven success at a startup environment. Managing a highly successful engineering team. In-depth knowledge and hands-on development experience with Web and API best practices, performance optimization, security, versioning, monitoring and scaling.  \n \nSpecialties:  \nObject-oriented programming experience with PHP, Python and Java. \nExtensive database experience with Redis and MySQL. \nHands-on experience with Node.js, iOS and mobile web development. \nProven success at a startup environment. Experience Senior Software Engineer Trulia April 2014  – Present (1 year 5 months) San Francisco, CA Manager, Web and API Services StumbleUpon April 2013  –  April 2014  (1 year 1 month) san francisco, ca Director of Engineering Red Bricks Media October 2012  –  April 2013  (7 months) San Francisco, CA Senior Manager, API and Web Services Blackboard Mobile October 2011  –  October 2012  (1 year 1 month) San Francisco, CA Manager, Web Application Development Blackboard Mobile July 2010  –  October 2011  (1 year 4 months) San Francisco, CA Web Application Engineer Blackboard Mobile September 2009  –  July 2010  (11 months) San Francisco, CA Lead Web Developer Stanford University November 2006  –  August 2009  (2 years 10 months) Web and Data Services Coordinator San Francisco State University July 2006  –  November 2006  (5 months) Web Specialist San Francisco State University February 2004  –  July 2006  (2 years 6 months) Senior Software Engineer Trulia April 2014  – Present (1 year 5 months) San Francisco, CA Senior Software Engineer Trulia April 2014  – Present (1 year 5 months) San Francisco, CA Manager, Web and API Services StumbleUpon April 2013  –  April 2014  (1 year 1 month) san francisco, ca Manager, Web and API Services StumbleUpon April 2013  –  April 2014  (1 year 1 month) san francisco, ca Director of Engineering Red Bricks Media October 2012  –  April 2013  (7 months) San Francisco, CA Director of Engineering Red Bricks Media October 2012  –  April 2013  (7 months) San Francisco, CA Senior Manager, API and Web Services Blackboard Mobile October 2011  –  October 2012  (1 year 1 month) San Francisco, CA Senior Manager, API and Web Services Blackboard Mobile October 2011  –  October 2012  (1 year 1 month) San Francisco, CA Manager, Web Application Development Blackboard Mobile July 2010  –  October 2011  (1 year 4 months) San Francisco, CA Manager, Web Application Development Blackboard Mobile July 2010  –  October 2011  (1 year 4 months) San Francisco, CA Web Application Engineer Blackboard Mobile September 2009  –  July 2010  (11 months) San Francisco, CA Web Application Engineer Blackboard Mobile September 2009  –  July 2010  (11 months) San Francisco, CA Lead Web Developer Stanford University November 2006  –  August 2009  (2 years 10 months) Lead Web Developer Stanford University November 2006  –  August 2009  (2 years 10 months) Web and Data Services Coordinator San Francisco State University July 2006  –  November 2006  (5 months) Web and Data Services Coordinator San Francisco State University July 2006  –  November 2006  (5 months) Web Specialist San Francisco State University February 2004  –  July 2006  (2 years 6 months) Web Specialist San Francisco State University February 2004  –  July 2006  (2 years 6 months) Languages   Skills PHP Python Java Agile Project Management Mobile Applications MySQL XML JSON MongoDB iOS HTML5 CSS Product Development HTML 5 jQuery Wordpress Drupal Git Subversion JIRA Confluence OAuth Lean Software... Scrum Linux Agile Methodologies JavaScript Android Apache OOP iOS development Web Services API Technical Leadership Team Building Node.js Amazon Web Services... Databases User Experience LAMP Scalability Scala REST Web Applications Web Services See 29+     See less Skills  PHP Python Java Agile Project Management Mobile Applications MySQL XML JSON MongoDB iOS HTML5 CSS Product Development HTML 5 jQuery Wordpress Drupal Git Subversion JIRA Confluence OAuth Lean Software... Scrum Linux Agile Methodologies JavaScript Android Apache OOP iOS development Web Services API Technical Leadership Team Building Node.js Amazon Web Services... Databases User Experience LAMP Scalability Scala REST Web Applications Web Services See 29+     See less PHP Python Java Agile Project Management Mobile Applications MySQL XML JSON MongoDB iOS HTML5 CSS Product Development HTML 5 jQuery Wordpress Drupal Git Subversion JIRA Confluence OAuth Lean Software... Scrum Linux Agile Methodologies JavaScript Android Apache OOP iOS development Web Services API Technical Leadership Team Building Node.js Amazon Web Services... Databases User Experience LAMP Scalability Scala REST Web Applications Web Services See 29+     See less PHP Python Java Agile Project Management Mobile Applications MySQL XML JSON MongoDB iOS HTML5 CSS Product Development HTML 5 jQuery Wordpress Drupal Git Subversion JIRA Confluence OAuth Lean Software... Scrum Linux Agile Methodologies JavaScript Android Apache OOP iOS development Web Services API Technical Leadership Team Building Node.js Amazon Web Services... Databases User Experience LAMP Scalability Scala REST Web Applications Web Services See 29+     See less Education Santa Clara University Entrepreneurship (CAPE program) 2012  – 2012 Santa Clara University M.S.,  Computer Science and Engineering 2009  – 2012 San Francisco State University B.S.,  Business Administration ,  Information Systems 1998  – 2003 Santa Clara University Entrepreneurship (CAPE program) 2012  – 2012 Santa Clara University Entrepreneurship (CAPE program) 2012  – 2012 Santa Clara University Entrepreneurship (CAPE program) 2012  – 2012 Santa Clara University M.S.,  Computer Science and Engineering 2009  – 2012 Santa Clara University M.S.,  Computer Science and Engineering 2009  – 2012 Santa Clara University M.S.,  Computer Science and Engineering 2009  – 2012 San Francisco State University B.S.,  Business Administration ,  Information Systems 1998  – 2003 San Francisco State University B.S.,  Business Administration ,  Information Systems 1998  – 2003 San Francisco State University B.S.,  Business Administration ,  Information Systems 1998  – 2003 ", "Experience Web Developer Stanford Law School February 2009  –  January 2014  (5 years) Webmaster Hiphop Archive @ Stanford University 2005  –  2008  (3 years) Product Manager Symphony Systems 2000  –  2002  (2 years) Program Manager/Coordinator Space Systems Loral 1995  –  1999  (4 years) Web Developer Stanford Law School February 2009  –  January 2014  (5 years) Web Developer Stanford Law School February 2009  –  January 2014  (5 years) Webmaster Hiphop Archive @ Stanford University 2005  –  2008  (3 years) Webmaster Hiphop Archive @ Stanford University 2005  –  2008  (3 years) Product Manager Symphony Systems 2000  –  2002  (2 years) Product Manager Symphony Systems 2000  –  2002  (2 years) Program Manager/Coordinator Space Systems Loral 1995  –  1999  (4 years) Program Manager/Coordinator Space Systems Loral 1995  –  1999  (4 years) Skills Web Development Web Applications Information Architecture User Experience User Interface Design Drupal WordPress HTML HTML 5 CSS PHP SQL JavaScript JSON jQuery XML Unix Linux LAMP Git SOAP Agile Methodologies SEO Photoshop Dreamweaver REST CMS Open Source Perl Python Software Development MySQL See 17+     See less Skills  Web Development Web Applications Information Architecture User Experience User Interface Design Drupal WordPress HTML HTML 5 CSS PHP SQL JavaScript JSON jQuery XML Unix Linux LAMP Git SOAP Agile Methodologies SEO Photoshop Dreamweaver REST CMS Open Source Perl Python Software Development MySQL See 17+     See less Web Development Web Applications Information Architecture User Experience User Interface Design Drupal WordPress HTML HTML 5 CSS PHP SQL JavaScript JSON jQuery XML Unix Linux LAMP Git SOAP Agile Methodologies SEO Photoshop Dreamweaver REST CMS Open Source Perl Python Software Development MySQL See 17+     See less Web Development Web Applications Information Architecture User Experience User Interface Design Drupal WordPress HTML HTML 5 CSS PHP SQL JavaScript JSON jQuery XML Unix Linux LAMP Git SOAP Agile Methodologies SEO Photoshop Dreamweaver REST CMS Open Source Perl Python Software Development MySQL See 17+     See less Education University of California, Berkeley Telecommunications 1996  – 1997 Latvijas Universitate MS,  Physics 1982  – 1988 University of California, Berkeley Telecommunications 1996  – 1997 University of California, Berkeley Telecommunications 1996  – 1997 University of California, Berkeley Telecommunications 1996  – 1997 Latvijas Universitate MS,  Physics 1982  – 1988 Latvijas Universitate MS,  Physics 1982  – 1988 Latvijas Universitate MS,  Physics 1982  – 1988 ", "Summary Specialties:HTML, CSS, JavaScript, Jquery, Drupal, Wordpress, Mediawiki, theming, WYSIWYG layout tools, mobile web development, usability, qualitative analysis, instructional training Summary Specialties:HTML, CSS, JavaScript, Jquery, Drupal, Wordpress, Mediawiki, theming, WYSIWYG layout tools, mobile web development, usability, qualitative analysis, instructional training Specialties:HTML, CSS, JavaScript, Jquery, Drupal, Wordpress, Mediawiki, theming, WYSIWYG layout tools, mobile web development, usability, qualitative analysis, instructional training Specialties:HTML, CSS, JavaScript, Jquery, Drupal, Wordpress, Mediawiki, theming, WYSIWYG layout tools, mobile web development, usability, qualitative analysis, instructional training Experience Interface Designer & Web Developer Stanford University July 2000  – Present (15 years 2 months) Stanford, CA • Provided web design consulting services to various campus departments \n• Designed and implemented user friendly, web-based application interfaces, including: \n \n• IT Services web site [itservices.stanford.edu] \n• Stanford Modern web templates and CSS guidelines [webdesign.stanford.edu] \n• Custom Stanford themes for Drupal, Wordpress, Mediawiki, Open Journal Systems, Right Answers, Remedy, and Zimbra web applications Web Developer WriteGreen January 2010  –  December 2010  (1 year) Stanford, CA • Designed the user interface and tools for the environmental advocacy online platform \n• Designed and developed the company web site IT Consultant & Educator ThinkTank Learning, Inc November 2002  –  November 2008  (6 years 1 month) Cupertino, CA • Expanded the private company from inception to five bay area offices \n• Developed and managed the company's online presence, including the web site and ecommerce products \n• Managed the company IT purchases, installation, and troubleshooting \n• Developed curriculum for SAT math course \n• Taught SAT classes and provided academic tutoring services Interface Designer Tenant Host September 2007  –  September 2008  (1 year 1 month) • Developed the company product and growth strategies \n• Designed the user interface of the property management web application Database Analyst Asta Systems November 1998  –  August 1999  (10 months) San Mateo, CA • Designed and developed the company web site \n• Developed a Microsoft Access database to manage machine inventory data Interface Designer & Web Developer Stanford University July 2000  – Present (15 years 2 months) Stanford, CA • Provided web design consulting services to various campus departments \n• Designed and implemented user friendly, web-based application interfaces, including: \n \n• IT Services web site [itservices.stanford.edu] \n• Stanford Modern web templates and CSS guidelines [webdesign.stanford.edu] \n• Custom Stanford themes for Drupal, Wordpress, Mediawiki, Open Journal Systems, Right Answers, Remedy, and Zimbra web applications Interface Designer & Web Developer Stanford University July 2000  – Present (15 years 2 months) Stanford, CA • Provided web design consulting services to various campus departments \n• Designed and implemented user friendly, web-based application interfaces, including: \n \n• IT Services web site [itservices.stanford.edu] \n• Stanford Modern web templates and CSS guidelines [webdesign.stanford.edu] \n• Custom Stanford themes for Drupal, Wordpress, Mediawiki, Open Journal Systems, Right Answers, Remedy, and Zimbra web applications Web Developer WriteGreen January 2010  –  December 2010  (1 year) Stanford, CA • Designed the user interface and tools for the environmental advocacy online platform \n• Designed and developed the company web site Web Developer WriteGreen January 2010  –  December 2010  (1 year) Stanford, CA • Designed the user interface and tools for the environmental advocacy online platform \n• Designed and developed the company web site IT Consultant & Educator ThinkTank Learning, Inc November 2002  –  November 2008  (6 years 1 month) Cupertino, CA • Expanded the private company from inception to five bay area offices \n• Developed and managed the company's online presence, including the web site and ecommerce products \n• Managed the company IT purchases, installation, and troubleshooting \n• Developed curriculum for SAT math course \n• Taught SAT classes and provided academic tutoring services IT Consultant & Educator ThinkTank Learning, Inc November 2002  –  November 2008  (6 years 1 month) Cupertino, CA • Expanded the private company from inception to five bay area offices \n• Developed and managed the company's online presence, including the web site and ecommerce products \n• Managed the company IT purchases, installation, and troubleshooting \n• Developed curriculum for SAT math course \n• Taught SAT classes and provided academic tutoring services Interface Designer Tenant Host September 2007  –  September 2008  (1 year 1 month) • Developed the company product and growth strategies \n• Designed the user interface of the property management web application Interface Designer Tenant Host September 2007  –  September 2008  (1 year 1 month) • Developed the company product and growth strategies \n• Designed the user interface of the property management web application Database Analyst Asta Systems November 1998  –  August 1999  (10 months) San Mateo, CA • Designed and developed the company web site \n• Developed a Microsoft Access database to manage machine inventory data Database Analyst Asta Systems November 1998  –  August 1999  (10 months) San Mateo, CA • Designed and developed the company web site \n• Developed a Microsoft Access database to manage machine inventory data Skills HTML CSS Drupal Theming jQuery Mobile Web Usability Accessibility Wordpress JavaScript WYSIWYG layout tools XHTML HTML5 Web Development Web Design User Interface Design Cross-browser... Instructional Design WordPress OS X Mobile Internet HTML 5 PHP User Experience LAMP User Experience Design E-commerce CMS Web Applications Mobile Applications User Interface Web 2.0 Interaction Design Information Architecture User-centered Design Human Computer... CSS3 Wireframes SEO Usability Testing User Research Dreamweaver Web Analytics Rapid Prototyping Website Development Web Project Management Front-end See 32+     See less Skills  HTML CSS Drupal Theming jQuery Mobile Web Usability Accessibility Wordpress JavaScript WYSIWYG layout tools XHTML HTML5 Web Development Web Design User Interface Design Cross-browser... Instructional Design WordPress OS X Mobile Internet HTML 5 PHP User Experience LAMP User Experience Design E-commerce CMS Web Applications Mobile Applications User Interface Web 2.0 Interaction Design Information Architecture User-centered Design Human Computer... CSS3 Wireframes SEO Usability Testing User Research Dreamweaver Web Analytics Rapid Prototyping Website Development Web Project Management Front-end See 32+     See less HTML CSS Drupal Theming jQuery Mobile Web Usability Accessibility Wordpress JavaScript WYSIWYG layout tools XHTML HTML5 Web Development Web Design User Interface Design Cross-browser... Instructional Design WordPress OS X Mobile Internet HTML 5 PHP User Experience LAMP User Experience Design E-commerce CMS Web Applications Mobile Applications User Interface Web 2.0 Interaction Design Information Architecture User-centered Design Human Computer... CSS3 Wireframes SEO Usability Testing User Research Dreamweaver Web Analytics Rapid Prototyping Website Development Web Project Management Front-end See 32+     See less HTML CSS Drupal Theming jQuery Mobile Web Usability Accessibility Wordpress JavaScript WYSIWYG layout tools XHTML HTML5 Web Development Web Design User Interface Design Cross-browser... Instructional Design WordPress OS X Mobile Internet HTML 5 PHP User Experience LAMP User Experience Design E-commerce CMS Web Applications Mobile Applications User Interface Web 2.0 Interaction Design Information Architecture User-centered Design Human Computer... CSS3 Wireframes SEO Usability Testing User Research Dreamweaver Web Analytics Rapid Prototyping Website Development Web Project Management Front-end See 32+     See less Education Stanford University M.A.,  Education 2008  – 2010 Learning, Design, and Technology University of California, Berkeley B.A.,  Economics 1996  – 2000 Activities and Societies:  Cal Connoisseur Club Stanford University M.A.,  Education 2008  – 2010 Learning, Design, and Technology Stanford University M.A.,  Education 2008  – 2010 Learning, Design, and Technology Stanford University M.A.,  Education 2008  – 2010 Learning, Design, and Technology University of California, Berkeley B.A.,  Economics 1996  – 2000 Activities and Societies:  Cal Connoisseur Club University of California, Berkeley B.A.,  Economics 1996  – 2000 Activities and Societies:  Cal Connoisseur Club University of California, Berkeley B.A.,  Economics 1996  – 2000 Activities and Societies:  Cal Connoisseur Club ", "Summary Over fifteen years of professional experience as a designer, front-end engineer, and technology manager working in high-volume corporate and consumer-facing environments. My goal is to achieve world-class status as a front-end architect and consummate integrator. \n \nSpecialties: OO JavaScript, YUI, HTML5, XHTML, CSS, XML; JSP, PHP, Perl, Lingo; branding, interface design, animation, and presentations; Photoshop and Flash. Special interest in project management software design and implementation. Reporting, metrics, A/B testing, multivariate testing, SEO. Team management, hiring, contract negotiation. Certified Scrum Master Summary Over fifteen years of professional experience as a designer, front-end engineer, and technology manager working in high-volume corporate and consumer-facing environments. My goal is to achieve world-class status as a front-end architect and consummate integrator. \n \nSpecialties: OO JavaScript, YUI, HTML5, XHTML, CSS, XML; JSP, PHP, Perl, Lingo; branding, interface design, animation, and presentations; Photoshop and Flash. Special interest in project management software design and implementation. Reporting, metrics, A/B testing, multivariate testing, SEO. Team management, hiring, contract negotiation. Certified Scrum Master Over fifteen years of professional experience as a designer, front-end engineer, and technology manager working in high-volume corporate and consumer-facing environments. My goal is to achieve world-class status as a front-end architect and consummate integrator. \n \nSpecialties: OO JavaScript, YUI, HTML5, XHTML, CSS, XML; JSP, PHP, Perl, Lingo; branding, interface design, animation, and presentations; Photoshop and Flash. Special interest in project management software design and implementation. Reporting, metrics, A/B testing, multivariate testing, SEO. Team management, hiring, contract negotiation. Certified Scrum Master Over fifteen years of professional experience as a designer, front-end engineer, and technology manager working in high-volume corporate and consumer-facing environments. My goal is to achieve world-class status as a front-end architect and consummate integrator. \n \nSpecialties: OO JavaScript, YUI, HTML5, XHTML, CSS, XML; JSP, PHP, Perl, Lingo; branding, interface design, animation, and presentations; Photoshop and Flash. Special interest in project management software design and implementation. Reporting, metrics, A/B testing, multivariate testing, SEO. Team management, hiring, contract negotiation. Certified Scrum Master Experience Mobile Software Engineer Yahoo! September 2010  – Present (5 years) HTML5/CSS3/JavaScript web app development for Mobile, including touch devices such as the iPhone, iPad, and iPod Touch; Android devices; Nokia smartphones; and any other device featuring a WebKit browser. Web Developer Stanford University April 2008  –  September 2010  (2 years 6 months) Web design and development for Stanford Medicine and beyond. Web Development Manager/Senior Interaction Designer Experian Inc March 2004  –  March 2008  (4 years 1 month) Core individual contributor responsible for design, development, and templating of key technologies. Responsible for hiring and leading the web development team. JSP, JavaScript, XHTML, and CSS development and accompanying graphic design. Creation and management of groupware and reporting. Design of new brands and sites. Web Development Manager Metareward, Inc., an Experian company 2004  –  2006  (2 years) Created an MVC framework for lead generation, directly contributing to over $1m profit per month. \n \nDesigned and created project management tools to assign and to track tasks, LOE, hours, and requirements, and to run reports for senior management. Owner Manalagi Group November 1996  –  March 2004  (7 years 5 months) Web design and development, branding, presentations, multimedia projects, video production, application design and development. Lecturer, Web Design Academy of Art University 1998  –  1999  (1 year) Taught HTML, JavaScript, CSS to aspiring developers. Lecturer, English Volunteers in Asia (VIA) 1992  –  1997  (5 years) Taught ESL at two universities, in Bali and Timor, in Indonesia. Lecturer: Language and Art Volunteers in Asia (VIA) 1992  –  1997  (5 years) Taught ESL at two universities, in Bali and Timor, in Indonesia. Mobile Software Engineer Yahoo! September 2010  – Present (5 years) HTML5/CSS3/JavaScript web app development for Mobile, including touch devices such as the iPhone, iPad, and iPod Touch; Android devices; Nokia smartphones; and any other device featuring a WebKit browser. Mobile Software Engineer Yahoo! September 2010  – Present (5 years) HTML5/CSS3/JavaScript web app development for Mobile, including touch devices such as the iPhone, iPad, and iPod Touch; Android devices; Nokia smartphones; and any other device featuring a WebKit browser. Web Developer Stanford University April 2008  –  September 2010  (2 years 6 months) Web design and development for Stanford Medicine and beyond. Web Developer Stanford University April 2008  –  September 2010  (2 years 6 months) Web design and development for Stanford Medicine and beyond. Web Development Manager/Senior Interaction Designer Experian Inc March 2004  –  March 2008  (4 years 1 month) Core individual contributor responsible for design, development, and templating of key technologies. Responsible for hiring and leading the web development team. JSP, JavaScript, XHTML, and CSS development and accompanying graphic design. Creation and management of groupware and reporting. Design of new brands and sites. Web Development Manager/Senior Interaction Designer Experian Inc March 2004  –  March 2008  (4 years 1 month) Core individual contributor responsible for design, development, and templating of key technologies. Responsible for hiring and leading the web development team. JSP, JavaScript, XHTML, and CSS development and accompanying graphic design. Creation and management of groupware and reporting. Design of new brands and sites. Web Development Manager Metareward, Inc., an Experian company 2004  –  2006  (2 years) Created an MVC framework for lead generation, directly contributing to over $1m profit per month. \n \nDesigned and created project management tools to assign and to track tasks, LOE, hours, and requirements, and to run reports for senior management. Web Development Manager Metareward, Inc., an Experian company 2004  –  2006  (2 years) Created an MVC framework for lead generation, directly contributing to over $1m profit per month. \n \nDesigned and created project management tools to assign and to track tasks, LOE, hours, and requirements, and to run reports for senior management. Owner Manalagi Group November 1996  –  March 2004  (7 years 5 months) Web design and development, branding, presentations, multimedia projects, video production, application design and development. Owner Manalagi Group November 1996  –  March 2004  (7 years 5 months) Web design and development, branding, presentations, multimedia projects, video production, application design and development. Lecturer, Web Design Academy of Art University 1998  –  1999  (1 year) Taught HTML, JavaScript, CSS to aspiring developers. Lecturer, Web Design Academy of Art University 1998  –  1999  (1 year) Taught HTML, JavaScript, CSS to aspiring developers. Lecturer, English Volunteers in Asia (VIA) 1992  –  1997  (5 years) Taught ESL at two universities, in Bali and Timor, in Indonesia. Lecturer, English Volunteers in Asia (VIA) 1992  –  1997  (5 years) Taught ESL at two universities, in Bali and Timor, in Indonesia. Lecturer: Language and Art Volunteers in Asia (VIA) 1992  –  1997  (5 years) Taught ESL at two universities, in Bali and Timor, in Indonesia. Lecturer: Language and Art Volunteers in Asia (VIA) 1992  –  1997  (5 years) Taught ESL at two universities, in Bali and Timor, in Indonesia. Languages Indonesian Native or bilingual proficiency Italian Elementary proficiency French Limited working proficiency Indonesian Native or bilingual proficiency Italian Elementary proficiency French Limited working proficiency Indonesian Native or bilingual proficiency Italian Elementary proficiency French Limited working proficiency Native or bilingual proficiency Elementary proficiency Limited working proficiency Skills JavaScript YUI CSS3 HTML 5 WebKit JSON JSONP PHP XML JSP XHTML OOP Perl User Interface Design Multivariate Testing A/B testing Animation Photoshop jQuery HTML CSS YQL Cocktails Mojito Web Design Web Development Mobile Devices Linux Subversion CVS Git Github YSlow Apache Node.js Flash Web Applications User Interface Scrum Mobile Applications iOS development Front-end AJAX User Experience SEO Information Architecture See 31+     See less Skills  JavaScript YUI CSS3 HTML 5 WebKit JSON JSONP PHP XML JSP XHTML OOP Perl User Interface Design Multivariate Testing A/B testing Animation Photoshop jQuery HTML CSS YQL Cocktails Mojito Web Design Web Development Mobile Devices Linux Subversion CVS Git Github YSlow Apache Node.js Flash Web Applications User Interface Scrum Mobile Applications iOS development Front-end AJAX User Experience SEO Information Architecture See 31+     See less JavaScript YUI CSS3 HTML 5 WebKit JSON JSONP PHP XML JSP XHTML OOP Perl User Interface Design Multivariate Testing A/B testing Animation Photoshop jQuery HTML CSS YQL Cocktails Mojito Web Design Web Development Mobile Devices Linux Subversion CVS Git Github YSlow Apache Node.js Flash Web Applications User Interface Scrum Mobile Applications iOS development Front-end AJAX User Experience SEO Information Architecture See 31+     See less JavaScript YUI CSS3 HTML 5 WebKit JSON JSONP PHP XML JSP XHTML OOP Perl User Interface Design Multivariate Testing A/B testing Animation Photoshop jQuery HTML CSS YQL Cocktails Mojito Web Design Web Development Mobile Devices Linux Subversion CVS Git Github YSlow Apache Node.js Flash Web Applications User Interface Scrum Mobile Applications iOS development Front-end AJAX User Experience SEO Information Architecture See 31+     See less Education University of California, Santa Cruz Post Graduate Certificate,  Art 1991  – 1992 University of California, Santa Cruz B.A.,  Art 1987  – 1990 Palos Verdes High School 1986  – 1987 East Greenwich High School 1983  – 1986 Activities and Societies:  Varsity Hockey University of California, Santa Cruz Post Graduate Certificate,  Art 1991  – 1992 University of California, Santa Cruz Post Graduate Certificate,  Art 1991  – 1992 University of California, Santa Cruz Post Graduate Certificate,  Art 1991  – 1992 University of California, Santa Cruz B.A.,  Art 1987  – 1990 University of California, Santa Cruz B.A.,  Art 1987  – 1990 University of California, Santa Cruz B.A.,  Art 1987  – 1990 Palos Verdes High School 1986  – 1987 Palos Verdes High School 1986  – 1987 Palos Verdes High School 1986  – 1987 East Greenwich High School 1983  – 1986 Activities and Societies:  Varsity Hockey East Greenwich High School 1983  – 1986 Activities and Societies:  Varsity Hockey East Greenwich High School 1983  – 1986 Activities and Societies:  Varsity Hockey ", "Skills Stress Management Hypnosis Meditation Healing Public Speaking Teaching Web Development Skills  Stress Management Hypnosis Meditation Healing Public Speaking Teaching Web Development Stress Management Hypnosis Meditation Healing Public Speaking Teaching Web Development Stress Management Hypnosis Meditation Healing Public Speaking Teaching Web Development "]}