{"position": "Account Manager (Sales Engineer)", "company": "Google", "profiles": ["Summary I started my career as an analyst developer at U.S. Steel. Although several programs I came across were written before I was born, I quickly found a way to integrate the mainframe data into a Cognos reporting engine and drive value out of the data. I learned about cross-platform integration and large corporate financials along the way. \n \nIn my next position at Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application.  \n \nAt Accenture, I joined the consulting workforce first spending 3 years integrating SmartMeter systems for a major utility before moving to cloud computing related work. My work with cloud technologies at Accenture was primarily with Google technologies which allowed me to develop expertise in Google Apps and Google Enterprise products. \n \nIn my current role, I am an Enterprise Sales Engineer for Google Apps. I spend my time with Google Apps partners and customers helping them evaluate the product, map technical/business requirements and design solutions. Summary I started my career as an analyst developer at U.S. Steel. Although several programs I came across were written before I was born, I quickly found a way to integrate the mainframe data into a Cognos reporting engine and drive value out of the data. I learned about cross-platform integration and large corporate financials along the way. \n \nIn my next position at Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application.  \n \nAt Accenture, I joined the consulting workforce first spending 3 years integrating SmartMeter systems for a major utility before moving to cloud computing related work. My work with cloud technologies at Accenture was primarily with Google technologies which allowed me to develop expertise in Google Apps and Google Enterprise products. \n \nIn my current role, I am an Enterprise Sales Engineer for Google Apps. I spend my time with Google Apps partners and customers helping them evaluate the product, map technical/business requirements and design solutions. I started my career as an analyst developer at U.S. Steel. Although several programs I came across were written before I was born, I quickly found a way to integrate the mainframe data into a Cognos reporting engine and drive value out of the data. I learned about cross-platform integration and large corporate financials along the way. \n \nIn my next position at Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application.  \n \nAt Accenture, I joined the consulting workforce first spending 3 years integrating SmartMeter systems for a major utility before moving to cloud computing related work. My work with cloud technologies at Accenture was primarily with Google technologies which allowed me to develop expertise in Google Apps and Google Enterprise products. \n \nIn my current role, I am an Enterprise Sales Engineer for Google Apps. I spend my time with Google Apps partners and customers helping them evaluate the product, map technical/business requirements and design solutions. I started my career as an analyst developer at U.S. Steel. Although several programs I came across were written before I was born, I quickly found a way to integrate the mainframe data into a Cognos reporting engine and drive value out of the data. I learned about cross-platform integration and large corporate financials along the way. \n \nIn my next position at Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application.  \n \nAt Accenture, I joined the consulting workforce first spending 3 years integrating SmartMeter systems for a major utility before moving to cloud computing related work. My work with cloud technologies at Accenture was primarily with Google technologies which allowed me to develop expertise in Google Apps and Google Enterprise products. \n \nIn my current role, I am an Enterprise Sales Engineer for Google Apps. I spend my time with Google Apps partners and customers helping them evaluate the product, map technical/business requirements and design solutions. Experience Sales Engineer, Google for Work Google January 2011  – Present (4 years 8 months) I am an Sales Engineer for Google for Work. I spend my time with Google Apps partners and customers helping them understand security of the product, to conduct evaluations, map technical/business requirements and design solutions.  Consultant Accenture August 2006  –  January 2011  (4 years 6 months) At Accenture, I joined the consulting workforce spending 3 years integrating SmartMeter systems before moving to cloud computing related work. My work with cloud technologies was primarily with Google Apps, App Engine and Maps. Google Apps Consultant Major Animation Studio July 2010  –  November 2010  (5 months) Working with a major animation studio in the L.A. metro area to plan and deploy Google Apps as an innovation to their current multiple existing on-premise mail and calendaring systems. Enterprise Deployment :: Partner Program Google 2009  –  2009  (less than a year) Enterprise Integration Consultant PG&E 2006  –  2009  (3 years) Distributed Developer II Mellon Financial 2005  –  2006  (1 year) At Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application. Systems Programmer US Steel Corp May 1999  –  May 2005  (6 years 1 month) I held several positions at USS first integrating mainframe reporting and processing to various reporting tools including Cognos before moving to custom J2EE development and integration work on Oracle's platform. Sales Engineer, Google for Work Google January 2011  – Present (4 years 8 months) I am an Sales Engineer for Google for Work. I spend my time with Google Apps partners and customers helping them understand security of the product, to conduct evaluations, map technical/business requirements and design solutions.  Sales Engineer, Google for Work Google January 2011  – Present (4 years 8 months) I am an Sales Engineer for Google for Work. I spend my time with Google Apps partners and customers helping them understand security of the product, to conduct evaluations, map technical/business requirements and design solutions.  Consultant Accenture August 2006  –  January 2011  (4 years 6 months) At Accenture, I joined the consulting workforce spending 3 years integrating SmartMeter systems before moving to cloud computing related work. My work with cloud technologies was primarily with Google Apps, App Engine and Maps. Consultant Accenture August 2006  –  January 2011  (4 years 6 months) At Accenture, I joined the consulting workforce spending 3 years integrating SmartMeter systems before moving to cloud computing related work. My work with cloud technologies was primarily with Google Apps, App Engine and Maps. Google Apps Consultant Major Animation Studio July 2010  –  November 2010  (5 months) Working with a major animation studio in the L.A. metro area to plan and deploy Google Apps as an innovation to their current multiple existing on-premise mail and calendaring systems. Google Apps Consultant Major Animation Studio July 2010  –  November 2010  (5 months) Working with a major animation studio in the L.A. metro area to plan and deploy Google Apps as an innovation to their current multiple existing on-premise mail and calendaring systems. Enterprise Deployment :: Partner Program Google 2009  –  2009  (less than a year) Enterprise Deployment :: Partner Program Google 2009  –  2009  (less than a year) Enterprise Integration Consultant PG&E 2006  –  2009  (3 years) Enterprise Integration Consultant PG&E 2006  –  2009  (3 years) Distributed Developer II Mellon Financial 2005  –  2006  (1 year) At Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application. Distributed Developer II Mellon Financial 2005  –  2006  (1 year) At Mellon Financial, I wrote applications to automate manual tasks for a custom-developed financial application. Systems Programmer US Steel Corp May 1999  –  May 2005  (6 years 1 month) I held several positions at USS first integrating mainframe reporting and processing to various reporting tools including Cognos before moving to custom J2EE development and integration work on Oracle's platform. Systems Programmer US Steel Corp May 1999  –  May 2005  (6 years 1 month) I held several positions at USS first integrating mainframe reporting and processing to various reporting tools including Cognos before moving to custom J2EE development and integration work on Oracle's platform. Skills Google Apps Consulting SaaS Cloud Computing Integration Architecture Sales Engineering Channel Partner... Strategy Enterprise Software Program Management PaaS Google API Management IT Strategy Cloud Computing IaaS Solution Selling Pre-sales Solution Architecture Enterprise Architecture Integration Professional Services Customer Satisfaction Customer Success Data Center See 9+     See less Skills  Google Apps Consulting SaaS Cloud Computing Integration Architecture Sales Engineering Channel Partner... Strategy Enterprise Software Program Management PaaS Google API Management IT Strategy Cloud Computing IaaS Solution Selling Pre-sales Solution Architecture Enterprise Architecture Integration Professional Services Customer Satisfaction Customer Success Data Center See 9+     See less Google Apps Consulting SaaS Cloud Computing Integration Architecture Sales Engineering Channel Partner... Strategy Enterprise Software Program Management PaaS Google API Management IT Strategy Cloud Computing IaaS Solution Selling Pre-sales Solution Architecture Enterprise Architecture Integration Professional Services Customer Satisfaction Customer Success Data Center See 9+     See less Google Apps Consulting SaaS Cloud Computing Integration Architecture Sales Engineering Channel Partner... Strategy Enterprise Software Program Management PaaS Google API Management IT Strategy Cloud Computing IaaS Solution Selling Pre-sales Solution Architecture Enterprise Architecture Integration Professional Services Customer Satisfaction Customer Success Data Center See 9+     See less Education University of Pittsburgh MST,  Telecommunications 2002  – 2004 University of Pittsburgh BSIS,  Information Science 1999  – 2001 La Roche College CIS,  Information Science 1997  – 1999 University of Pittsburgh MST,  Telecommunications 2002  – 2004 University of Pittsburgh MST,  Telecommunications 2002  – 2004 University of Pittsburgh MST,  Telecommunications 2002  – 2004 University of Pittsburgh BSIS,  Information Science 1999  – 2001 University of Pittsburgh BSIS,  Information Science 1999  – 2001 University of Pittsburgh BSIS,  Information Science 1999  – 2001 La Roche College CIS,  Information Science 1997  – 1999 La Roche College CIS,  Information Science 1997  – 1999 La Roche College CIS,  Information Science 1997  – 1999 ", "Summary \nI am enthusiastic Gen Yer on an a unique journey as a Google Sales Engineer working along side large enterprise Clients.  \n \nBeginning in a selective Google advertising program, followed by an sales internship which lead to my role as a Sales Engineer in the Google For Work Team.  \n \nI pride my self on being a hard and fast learner, a curve ball thinker and tech tinker. \n \nMost importantly, I like to be challenged.  \n \nHappy viewing. Summary \nI am enthusiastic Gen Yer on an a unique journey as a Google Sales Engineer working along side large enterprise Clients.  \n \nBeginning in a selective Google advertising program, followed by an sales internship which lead to my role as a Sales Engineer in the Google For Work Team.  \n \nI pride my self on being a hard and fast learner, a curve ball thinker and tech tinker. \n \nMost importantly, I like to be challenged.  \n \nHappy viewing. \nI am enthusiastic Gen Yer on an a unique journey as a Google Sales Engineer working along side large enterprise Clients.  \n \nBeginning in a selective Google advertising program, followed by an sales internship which lead to my role as a Sales Engineer in the Google For Work Team.  \n \nI pride my self on being a hard and fast learner, a curve ball thinker and tech tinker. \n \nMost importantly, I like to be challenged.  \n \nHappy viewing. \nI am enthusiastic Gen Yer on an a unique journey as a Google Sales Engineer working along side large enterprise Clients.  \n \nBeginning in a selective Google advertising program, followed by an sales internship which lead to my role as a Sales Engineer in the Google For Work Team.  \n \nI pride my self on being a hard and fast learner, a curve ball thinker and tech tinker. \n \nMost importantly, I like to be challenged.  \n \nHappy viewing. Experience Google For Work Sales Engineer Google September 2014  – Present (1 year) Sydney Area, Australia Analyse Business Challenges of the Customer, and clarify how our Solutions can solve them \n \nProactively lead Technical activities throughout the Sales Cycle, including Demos, Immersive Experiences, Customer interactions, Security.  \n \nWork closely with our Sales Team, to provide guidance on technical aspects of our solutions \n \nSustain our Partners with constant enablement to make them efficient in presales activities and knowledgeable on Google’s solutions \n \nPromote and explain Google culture of Innovation  \n Internship - Google For Work Sales Engineer Google March 2014  –  September 2014  (7 months) Sydney Area, Australia Marketing and Student Recruitment - Faculty of Social Sciences University of Wollongong August 2013  –  March 2014  (8 months) University of Wollongong Supported the domestic and international marketing activities in the Faculty of Social Sciences. Wollongong university is ranked in the top 2% of university world wide.  \n \nAssistant Roles include:  \n* Analysing large student excel data bases and working closely to recruitment targets (e.g enrollment)  \n* Assisting in a large website re code project using CMS editing systems \n* Stake Holder Liaison and engagement (UnivAdvice and Strategic Marketing & Communications) \n* Designing marketing collateral (Discipline Booklets, Faculty intranet, brochures, flyers, posters) \n* Media buying and planning including core online/print, University publications and SEO.  \n* Working closely with the UOW Media Office and local media on positive exposure for the Faculty \n* Conducting competitor analysis and market research \n* Measuring return-on-investment (ROI) through media and recruitment monitoring on online/offline  \n* Strategy develop for Social media \n* Participating in recruitment and marketing events involving public speaking and presentation at Discovery Days, Partnership Conferences, Career Markets, Orientation,school link visits. Google Student Ambassador Google February 2013  –  February 2014  (1 year 1 month) Sydney Area, Australia The Google Student Ambassador Program (GSA) is a selective opportunity for students to act as a liaison between Google and their universities. As an Ambassador I am thrilled about new technology and enthusiastic about sharing Google products and culture on campus!  \n \nAmbassador Roles include:  \n* Learning about innovative Google products and programs \n* Planing and hosting fun events on campus with various student bodies and clubs \n* Maintaining and updating the GSA Google+ and Facebook accounts \n* Assisting UOW Information Technology Services (ITS) with implementing Google learning tools \n \nACHIEVEMENTS: Presented Google Docs and Drive to a lecture theatre of over 300 staff and students at UOW. Commerce Student Representative University of Wollongong January 2012  –  December 2013  (2 years) Wollongong Area, Australia -\tAssisted in the organisation and preparation of Commerce Academic Preparation Days (2013) \n-\tPresented a formal speech at the Year 12 Taster Day (2013) in front of over 300 students \n- International computer Lab enrollment assistant, O-Week (2012/2013) \n-\tContributed to the development of the University’s International advertising campaign  \n \nAchievements: Selected to present a 15 minute formal speech at Orientation Day Autumn and spring 2013 in front of up to 300 hundred prospective business students, teachers and staff about my experiences as a university student. Senior Retail Assistant Billabong July 2009  –  November 2013  (4 years 5 months) Wollongong Area, Australia -\tReached and exceeding large KPI’S and sales targets \n-\tHandled large large product data bases  \n-\tRecruited and trained new staff  \n-\tTackled daily business challenges including customer complaints, returns and exchanges \n-\tDeveloped staff training solutions and store management processes \n-\tAttended nationally recognised sales and customer training programs  \n \nAchievements: Named Billabongs Lead Sales Persons 2012 for providing excellent customer service having accomplished large KPI’s, package selling and budgets. Student Tutor and Mentor - IN2UNI Program University of Wollongong March 2013  –  October 2013  (8 months) Wollongong Area, Australia In2Uni is a mentor support and outreach program developed by the Department of Education (DEC NSW) and the University of Wollongong (UOW) to enable students in low socio economic schools to participate and succeed in higher education. The university provides student mentors from Batmen's Bay to southern Sydney with the goal of increasing low SES university intake.  \n \nMentor Roles included:  \n* Facilitating weekly 1 Hour lessons with up to 30 high school students from years 7-12  \n* Implementing large-scale on campus events for high school students \n* Maintained partnerships and relationships with schools, community groups, parents, and sponsors \n* Assisted in administrative matters involved in the program including student databases  \n* Delivered student experience speeches to participating IN2UNI schools \n \nACHIEVEMENTS: Marketing and Communications Intern - Careers Central University of Wollongong February 2013  –  June 2013  (5 months) Wollongong Area, Australia -\tSupported the Marketing and Programs Coordinator for 3 months \n-\tComfortably worked on creating, merging and updating large employee databases  \n-\tAssisted with challenging projects including three large careers fairs with over 60 employers \n-\tImplemented social media strategy’s including developing a media schedule  \n-\tDeveloped a range of media (web copy writing, media release, print, and advertising)  \n-\tHandled student career enquires including appointments and providing customer service  \n \nAchievements: Implemented ‘Google Analytics’ which is now used to research online trends and to tailor various media platforms, including those pages which received the most student traffic. Google AdCamp Google January 2013  –  January 2013  (1 month) Sydney Area, Australia Selected as one of 22 students nationally to participate in a four day introduction to Google's Advertising and Sales techniques. Among sessions taught by inspiring Googlers, I worked on a team challenge to develop a digital strategy for Target which was pitched to established Google leaders.  \n \nSession topics included: \n* Googles 7 Point Sales Frame Work \n* Google Display Network (GDN), Audience Targeting & YouTube Advertising \n* Google Search, Clicks and AdWords, online restate \n* Analytics, measuring ROI and Ad Ranks \n* Advanced training in public speaking and sales pitching  \n \nACHIEVEMENTS: Received two Highly Commended awards winning 2/3 individual challenges which included a Google Plus Tech task and a Google Review blogging challenge. Public Relations Internship - Pulse & Howorth Ogilvy Public Relations Worldwide January 2012  –  March 2012  (3 months) Sydney Area, Australia Completed an internship with Ogilvy Public Relations working in the Public Relations sector across two divisions, Pulse (Consumer) and Howorth (B2B). I worked closely clients such as Microsoft, LG, Canon, Intel, Tremble. \n \n-\tMonitored coverage using Google,Facebook and Twitter for LG’s Technology Conference  \n-\tReported results by populating extensive spreadsheet with media trends and circulation  \n-\tCreated the international Ogilvy events calendar combing large sets of data and events  \n-\tResearched online trends using ‘Google trends’ to generate topics for client bloggers \n-\tWorked on creating an online advertising solution for Telstra's movie downloading function. \n- Assisting in events (Malaysian Kitchen food festival)  \n \nAchievements: Supported the Haworth B2B Team on implementing all stages of an online digital media strategy for Tremble, a large GPS company. Key milestones included coverage reports, developing a new business proposal, conducting media analysis and developing the final pitch. Lead Marketing and Communication Volunteer The Cancer Council NSW April 2011  –  September 2011  (6 months) Wollongong Area, Australia For 6 months I volunteered with the Community Relations Manager at the Illawarra Cancer Council and supported the Marketing and Communications Department. \n \nAssistant Role: \n*Provided public relations, marketing and communications support for Relay for Life, The Biggest Morning Tea and Daffodil Day \n* Analysed and populated large volunteer data bases  \n* Media relations and stakeholder engagement (i98FM, Win News and The Mercury) \n* Updated and created content for social media \n* Producing and published web copy write and press releases \n \nACHIEVEMENTS: Implemented a creative strategy to create awareness towards Daffodil Day. Cemented a deal with Lightsounds Wollongong to donate three days of lighting to turn the Breakwater Lighthouse, in Wollongong, yellow. Organised a media launch and invited the local community to view the first illumination. Google For Work Sales Engineer Google September 2014  – Present (1 year) Sydney Area, Australia Analyse Business Challenges of the Customer, and clarify how our Solutions can solve them \n \nProactively lead Technical activities throughout the Sales Cycle, including Demos, Immersive Experiences, Customer interactions, Security.  \n \nWork closely with our Sales Team, to provide guidance on technical aspects of our solutions \n \nSustain our Partners with constant enablement to make them efficient in presales activities and knowledgeable on Google’s solutions \n \nPromote and explain Google culture of Innovation  \n Google For Work Sales Engineer Google September 2014  – Present (1 year) Sydney Area, Australia Analyse Business Challenges of the Customer, and clarify how our Solutions can solve them \n \nProactively lead Technical activities throughout the Sales Cycle, including Demos, Immersive Experiences, Customer interactions, Security.  \n \nWork closely with our Sales Team, to provide guidance on technical aspects of our solutions \n \nSustain our Partners with constant enablement to make them efficient in presales activities and knowledgeable on Google’s solutions \n \nPromote and explain Google culture of Innovation  \n Internship - Google For Work Sales Engineer Google March 2014  –  September 2014  (7 months) Sydney Area, Australia Internship - Google For Work Sales Engineer Google March 2014  –  September 2014  (7 months) Sydney Area, Australia Marketing and Student Recruitment - Faculty of Social Sciences University of Wollongong August 2013  –  March 2014  (8 months) University of Wollongong Supported the domestic and international marketing activities in the Faculty of Social Sciences. Wollongong university is ranked in the top 2% of university world wide.  \n \nAssistant Roles include:  \n* Analysing large student excel data bases and working closely to recruitment targets (e.g enrollment)  \n* Assisting in a large website re code project using CMS editing systems \n* Stake Holder Liaison and engagement (UnivAdvice and Strategic Marketing & Communications) \n* Designing marketing collateral (Discipline Booklets, Faculty intranet, brochures, flyers, posters) \n* Media buying and planning including core online/print, University publications and SEO.  \n* Working closely with the UOW Media Office and local media on positive exposure for the Faculty \n* Conducting competitor analysis and market research \n* Measuring return-on-investment (ROI) through media and recruitment monitoring on online/offline  \n* Strategy develop for Social media \n* Participating in recruitment and marketing events involving public speaking and presentation at Discovery Days, Partnership Conferences, Career Markets, Orientation,school link visits. Marketing and Student Recruitment - Faculty of Social Sciences University of Wollongong August 2013  –  March 2014  (8 months) University of Wollongong Supported the domestic and international marketing activities in the Faculty of Social Sciences. Wollongong university is ranked in the top 2% of university world wide.  \n \nAssistant Roles include:  \n* Analysing large student excel data bases and working closely to recruitment targets (e.g enrollment)  \n* Assisting in a large website re code project using CMS editing systems \n* Stake Holder Liaison and engagement (UnivAdvice and Strategic Marketing & Communications) \n* Designing marketing collateral (Discipline Booklets, Faculty intranet, brochures, flyers, posters) \n* Media buying and planning including core online/print, University publications and SEO.  \n* Working closely with the UOW Media Office and local media on positive exposure for the Faculty \n* Conducting competitor analysis and market research \n* Measuring return-on-investment (ROI) through media and recruitment monitoring on online/offline  \n* Strategy develop for Social media \n* Participating in recruitment and marketing events involving public speaking and presentation at Discovery Days, Partnership Conferences, Career Markets, Orientation,school link visits. Google Student Ambassador Google February 2013  –  February 2014  (1 year 1 month) Sydney Area, Australia The Google Student Ambassador Program (GSA) is a selective opportunity for students to act as a liaison between Google and their universities. As an Ambassador I am thrilled about new technology and enthusiastic about sharing Google products and culture on campus!  \n \nAmbassador Roles include:  \n* Learning about innovative Google products and programs \n* Planing and hosting fun events on campus with various student bodies and clubs \n* Maintaining and updating the GSA Google+ and Facebook accounts \n* Assisting UOW Information Technology Services (ITS) with implementing Google learning tools \n \nACHIEVEMENTS: Presented Google Docs and Drive to a lecture theatre of over 300 staff and students at UOW. Google Student Ambassador Google February 2013  –  February 2014  (1 year 1 month) Sydney Area, Australia The Google Student Ambassador Program (GSA) is a selective opportunity for students to act as a liaison between Google and their universities. As an Ambassador I am thrilled about new technology and enthusiastic about sharing Google products and culture on campus!  \n \nAmbassador Roles include:  \n* Learning about innovative Google products and programs \n* Planing and hosting fun events on campus with various student bodies and clubs \n* Maintaining and updating the GSA Google+ and Facebook accounts \n* Assisting UOW Information Technology Services (ITS) with implementing Google learning tools \n \nACHIEVEMENTS: Presented Google Docs and Drive to a lecture theatre of over 300 staff and students at UOW. Commerce Student Representative University of Wollongong January 2012  –  December 2013  (2 years) Wollongong Area, Australia -\tAssisted in the organisation and preparation of Commerce Academic Preparation Days (2013) \n-\tPresented a formal speech at the Year 12 Taster Day (2013) in front of over 300 students \n- International computer Lab enrollment assistant, O-Week (2012/2013) \n-\tContributed to the development of the University’s International advertising campaign  \n \nAchievements: Selected to present a 15 minute formal speech at Orientation Day Autumn and spring 2013 in front of up to 300 hundred prospective business students, teachers and staff about my experiences as a university student. Commerce Student Representative University of Wollongong January 2012  –  December 2013  (2 years) Wollongong Area, Australia -\tAssisted in the organisation and preparation of Commerce Academic Preparation Days (2013) \n-\tPresented a formal speech at the Year 12 Taster Day (2013) in front of over 300 students \n- International computer Lab enrollment assistant, O-Week (2012/2013) \n-\tContributed to the development of the University’s International advertising campaign  \n \nAchievements: Selected to present a 15 minute formal speech at Orientation Day Autumn and spring 2013 in front of up to 300 hundred prospective business students, teachers and staff about my experiences as a university student. Senior Retail Assistant Billabong July 2009  –  November 2013  (4 years 5 months) Wollongong Area, Australia -\tReached and exceeding large KPI’S and sales targets \n-\tHandled large large product data bases  \n-\tRecruited and trained new staff  \n-\tTackled daily business challenges including customer complaints, returns and exchanges \n-\tDeveloped staff training solutions and store management processes \n-\tAttended nationally recognised sales and customer training programs  \n \nAchievements: Named Billabongs Lead Sales Persons 2012 for providing excellent customer service having accomplished large KPI’s, package selling and budgets. Senior Retail Assistant Billabong July 2009  –  November 2013  (4 years 5 months) Wollongong Area, Australia -\tReached and exceeding large KPI’S and sales targets \n-\tHandled large large product data bases  \n-\tRecruited and trained new staff  \n-\tTackled daily business challenges including customer complaints, returns and exchanges \n-\tDeveloped staff training solutions and store management processes \n-\tAttended nationally recognised sales and customer training programs  \n \nAchievements: Named Billabongs Lead Sales Persons 2012 for providing excellent customer service having accomplished large KPI’s, package selling and budgets. Student Tutor and Mentor - IN2UNI Program University of Wollongong March 2013  –  October 2013  (8 months) Wollongong Area, Australia In2Uni is a mentor support and outreach program developed by the Department of Education (DEC NSW) and the University of Wollongong (UOW) to enable students in low socio economic schools to participate and succeed in higher education. The university provides student mentors from Batmen's Bay to southern Sydney with the goal of increasing low SES university intake.  \n \nMentor Roles included:  \n* Facilitating weekly 1 Hour lessons with up to 30 high school students from years 7-12  \n* Implementing large-scale on campus events for high school students \n* Maintained partnerships and relationships with schools, community groups, parents, and sponsors \n* Assisted in administrative matters involved in the program including student databases  \n* Delivered student experience speeches to participating IN2UNI schools \n \nACHIEVEMENTS: Student Tutor and Mentor - IN2UNI Program University of Wollongong March 2013  –  October 2013  (8 months) Wollongong Area, Australia In2Uni is a mentor support and outreach program developed by the Department of Education (DEC NSW) and the University of Wollongong (UOW) to enable students in low socio economic schools to participate and succeed in higher education. The university provides student mentors from Batmen's Bay to southern Sydney with the goal of increasing low SES university intake.  \n \nMentor Roles included:  \n* Facilitating weekly 1 Hour lessons with up to 30 high school students from years 7-12  \n* Implementing large-scale on campus events for high school students \n* Maintained partnerships and relationships with schools, community groups, parents, and sponsors \n* Assisted in administrative matters involved in the program including student databases  \n* Delivered student experience speeches to participating IN2UNI schools \n \nACHIEVEMENTS: Marketing and Communications Intern - Careers Central University of Wollongong February 2013  –  June 2013  (5 months) Wollongong Area, Australia -\tSupported the Marketing and Programs Coordinator for 3 months \n-\tComfortably worked on creating, merging and updating large employee databases  \n-\tAssisted with challenging projects including three large careers fairs with over 60 employers \n-\tImplemented social media strategy’s including developing a media schedule  \n-\tDeveloped a range of media (web copy writing, media release, print, and advertising)  \n-\tHandled student career enquires including appointments and providing customer service  \n \nAchievements: Implemented ‘Google Analytics’ which is now used to research online trends and to tailor various media platforms, including those pages which received the most student traffic. Marketing and Communications Intern - Careers Central University of Wollongong February 2013  –  June 2013  (5 months) Wollongong Area, Australia -\tSupported the Marketing and Programs Coordinator for 3 months \n-\tComfortably worked on creating, merging and updating large employee databases  \n-\tAssisted with challenging projects including three large careers fairs with over 60 employers \n-\tImplemented social media strategy’s including developing a media schedule  \n-\tDeveloped a range of media (web copy writing, media release, print, and advertising)  \n-\tHandled student career enquires including appointments and providing customer service  \n \nAchievements: Implemented ‘Google Analytics’ which is now used to research online trends and to tailor various media platforms, including those pages which received the most student traffic. Google AdCamp Google January 2013  –  January 2013  (1 month) Sydney Area, Australia Selected as one of 22 students nationally to participate in a four day introduction to Google's Advertising and Sales techniques. Among sessions taught by inspiring Googlers, I worked on a team challenge to develop a digital strategy for Target which was pitched to established Google leaders.  \n \nSession topics included: \n* Googles 7 Point Sales Frame Work \n* Google Display Network (GDN), Audience Targeting & YouTube Advertising \n* Google Search, Clicks and AdWords, online restate \n* Analytics, measuring ROI and Ad Ranks \n* Advanced training in public speaking and sales pitching  \n \nACHIEVEMENTS: Received two Highly Commended awards winning 2/3 individual challenges which included a Google Plus Tech task and a Google Review blogging challenge. Google AdCamp Google January 2013  –  January 2013  (1 month) Sydney Area, Australia Selected as one of 22 students nationally to participate in a four day introduction to Google's Advertising and Sales techniques. Among sessions taught by inspiring Googlers, I worked on a team challenge to develop a digital strategy for Target which was pitched to established Google leaders.  \n \nSession topics included: \n* Googles 7 Point Sales Frame Work \n* Google Display Network (GDN), Audience Targeting & YouTube Advertising \n* Google Search, Clicks and AdWords, online restate \n* Analytics, measuring ROI and Ad Ranks \n* Advanced training in public speaking and sales pitching  \n \nACHIEVEMENTS: Received two Highly Commended awards winning 2/3 individual challenges which included a Google Plus Tech task and a Google Review blogging challenge. Public Relations Internship - Pulse & Howorth Ogilvy Public Relations Worldwide January 2012  –  March 2012  (3 months) Sydney Area, Australia Completed an internship with Ogilvy Public Relations working in the Public Relations sector across two divisions, Pulse (Consumer) and Howorth (B2B). I worked closely clients such as Microsoft, LG, Canon, Intel, Tremble. \n \n-\tMonitored coverage using Google,Facebook and Twitter for LG’s Technology Conference  \n-\tReported results by populating extensive spreadsheet with media trends and circulation  \n-\tCreated the international Ogilvy events calendar combing large sets of data and events  \n-\tResearched online trends using ‘Google trends’ to generate topics for client bloggers \n-\tWorked on creating an online advertising solution for Telstra's movie downloading function. \n- Assisting in events (Malaysian Kitchen food festival)  \n \nAchievements: Supported the Haworth B2B Team on implementing all stages of an online digital media strategy for Tremble, a large GPS company. Key milestones included coverage reports, developing a new business proposal, conducting media analysis and developing the final pitch. Public Relations Internship - Pulse & Howorth Ogilvy Public Relations Worldwide January 2012  –  March 2012  (3 months) Sydney Area, Australia Completed an internship with Ogilvy Public Relations working in the Public Relations sector across two divisions, Pulse (Consumer) and Howorth (B2B). I worked closely clients such as Microsoft, LG, Canon, Intel, Tremble. \n \n-\tMonitored coverage using Google,Facebook and Twitter for LG’s Technology Conference  \n-\tReported results by populating extensive spreadsheet with media trends and circulation  \n-\tCreated the international Ogilvy events calendar combing large sets of data and events  \n-\tResearched online trends using ‘Google trends’ to generate topics for client bloggers \n-\tWorked on creating an online advertising solution for Telstra's movie downloading function. \n- Assisting in events (Malaysian Kitchen food festival)  \n \nAchievements: Supported the Haworth B2B Team on implementing all stages of an online digital media strategy for Tremble, a large GPS company. Key milestones included coverage reports, developing a new business proposal, conducting media analysis and developing the final pitch. Lead Marketing and Communication Volunteer The Cancer Council NSW April 2011  –  September 2011  (6 months) Wollongong Area, Australia For 6 months I volunteered with the Community Relations Manager at the Illawarra Cancer Council and supported the Marketing and Communications Department. \n \nAssistant Role: \n*Provided public relations, marketing and communications support for Relay for Life, The Biggest Morning Tea and Daffodil Day \n* Analysed and populated large volunteer data bases  \n* Media relations and stakeholder engagement (i98FM, Win News and The Mercury) \n* Updated and created content for social media \n* Producing and published web copy write and press releases \n \nACHIEVEMENTS: Implemented a creative strategy to create awareness towards Daffodil Day. Cemented a deal with Lightsounds Wollongong to donate three days of lighting to turn the Breakwater Lighthouse, in Wollongong, yellow. Organised a media launch and invited the local community to view the first illumination. Lead Marketing and Communication Volunteer The Cancer Council NSW April 2011  –  September 2011  (6 months) Wollongong Area, Australia For 6 months I volunteered with the Community Relations Manager at the Illawarra Cancer Council and supported the Marketing and Communications Department. \n \nAssistant Role: \n*Provided public relations, marketing and communications support for Relay for Life, The Biggest Morning Tea and Daffodil Day \n* Analysed and populated large volunteer data bases  \n* Media relations and stakeholder engagement (i98FM, Win News and The Mercury) \n* Updated and created content for social media \n* Producing and published web copy write and press releases \n \nACHIEVEMENTS: Implemented a creative strategy to create awareness towards Daffodil Day. Cemented a deal with Lightsounds Wollongong to donate three days of lighting to turn the Breakwater Lighthouse, in Wollongong, yellow. Organised a media launch and invited the local community to view the first illumination. Skills Social Media IT Solutions Pre-sales Salesforce.com Public Relations Marketing Communications Customer Service Marketing Photoshop Public Speaking Press Releases Blogging Event Management Leadership Advertising Oracle Enterprise... Custom CMS Development CSS Corporate Communications Adobe Creative Suite Sales Presentations See 6+     See less Skills  Social Media IT Solutions Pre-sales Salesforce.com Public Relations Marketing Communications Customer Service Marketing Photoshop Public Speaking Press Releases Blogging Event Management Leadership Advertising Oracle Enterprise... Custom CMS Development CSS Corporate Communications Adobe Creative Suite Sales Presentations See 6+     See less Social Media IT Solutions Pre-sales Salesforce.com Public Relations Marketing Communications Customer Service Marketing Photoshop Public Speaking Press Releases Blogging Event Management Leadership Advertising Oracle Enterprise... Custom CMS Development CSS Corporate Communications Adobe Creative Suite Sales Presentations See 6+     See less Social Media IT Solutions Pre-sales Salesforce.com Public Relations Marketing Communications Customer Service Marketing Photoshop Public Speaking Press Releases Blogging Event Management Leadership Advertising Oracle Enterprise... Custom CMS Development CSS Corporate Communications Adobe Creative Suite Sales Presentations See 6+     See less Education University of Wollongong Dean Scholar - Commerce,  Marketing & Public Relations , High Distinction Average 2010  – 2013 St Mary's Ladies College HSC 2004  – 2009 2009 HSC Results: \n \n1st - Information Processing Technology  \n1st - Textiles and Design  \n1st - Dance  \nTop 5% - English & Studies of Religion Activities and Societies:  School Captain University of Wollongong Dean Scholar - Commerce,  Marketing & Public Relations , High Distinction Average 2010  – 2013 University of Wollongong Dean Scholar - Commerce,  Marketing & Public Relations , High Distinction Average 2010  – 2013 University of Wollongong Dean Scholar - Commerce,  Marketing & Public Relations , High Distinction Average 2010  – 2013 St Mary's Ladies College HSC 2004  – 2009 2009 HSC Results: \n \n1st - Information Processing Technology  \n1st - Textiles and Design  \n1st - Dance  \nTop 5% - English & Studies of Religion Activities and Societies:  School Captain St Mary's Ladies College HSC 2004  – 2009 2009 HSC Results: \n \n1st - Information Processing Technology  \n1st - Textiles and Design  \n1st - Dance  \nTop 5% - English & Studies of Religion Activities and Societies:  School Captain St Mary's Ladies College HSC 2004  – 2009 2009 HSC Results: \n \n1st - Information Processing Technology  \n1st - Textiles and Design  \n1st - Dance  \nTop 5% - English & Studies of Religion Activities and Societies:  School Captain Honors & Awards Chancellor Robert Hope Memorial Nominee University of Wollongong November 2013 The Robert Hope Memorial Prize is the most prestigious award presented at the University of Wollongong to a select student who has demonstrates exceptional academic performance, outstanding leadership, and a significant contribution to both the University and the wider community. International Honour Society Golden Key October 2012 Golden key is a non-profit, invitation organisation which recognises the top 15% of students in their University.  \n Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2013 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2012 University of Wollongong 2012 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2011 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Rookie Of The year Award University of Wollongong October 2013 At the completion of my position as student mentor in the IN2UNI program in December 2013 I was nominated by my peers for the \"Rookie of The Award\".  Additional Honors & Awards Commerce Faulty Award for Academic Excellence (2013) \n \nAcademic Day - Commerce Student Mentor (2013) \n \nInternational Student Representative for the Faculty of Commerce UOW (2013) Chancellor Robert Hope Memorial Nominee University of Wollongong November 2013 The Robert Hope Memorial Prize is the most prestigious award presented at the University of Wollongong to a select student who has demonstrates exceptional academic performance, outstanding leadership, and a significant contribution to both the University and the wider community. Chancellor Robert Hope Memorial Nominee University of Wollongong November 2013 The Robert Hope Memorial Prize is the most prestigious award presented at the University of Wollongong to a select student who has demonstrates exceptional academic performance, outstanding leadership, and a significant contribution to both the University and the wider community. Chancellor Robert Hope Memorial Nominee University of Wollongong November 2013 The Robert Hope Memorial Prize is the most prestigious award presented at the University of Wollongong to a select student who has demonstrates exceptional academic performance, outstanding leadership, and a significant contribution to both the University and the wider community. International Honour Society Golden Key October 2012 Golden key is a non-profit, invitation organisation which recognises the top 15% of students in their University.  \n International Honour Society Golden Key October 2012 Golden key is a non-profit, invitation organisation which recognises the top 15% of students in their University.  \n International Honour Society Golden Key October 2012 Golden key is a non-profit, invitation organisation which recognises the top 15% of students in their University.  \n Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2013 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2013 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2013 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2012 University of Wollongong 2012 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2012 University of Wollongong 2012 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2012 University of Wollongong 2012 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2011 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2011 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Faculty of Commerce Dean's Merit List 2013 University of Wollongong January 2011 Students whose academic results are in the top 5% of the Faculty of Commerce at the University of Wollongong are placed on the Dean's Merit List for that year. Rookie Of The year Award University of Wollongong October 2013 At the completion of my position as student mentor in the IN2UNI program in December 2013 I was nominated by my peers for the \"Rookie of The Award\".  Rookie Of The year Award University of Wollongong October 2013 At the completion of my position as student mentor in the IN2UNI program in December 2013 I was nominated by my peers for the \"Rookie of The Award\".  Rookie Of The year Award University of Wollongong October 2013 At the completion of my position as student mentor in the IN2UNI program in December 2013 I was nominated by my peers for the \"Rookie of The Award\".  Additional Honors & Awards Commerce Faulty Award for Academic Excellence (2013) \n \nAcademic Day - Commerce Student Mentor (2013) \n \nInternational Student Representative for the Faculty of Commerce UOW (2013) Additional Honors & Awards Commerce Faulty Award for Academic Excellence (2013) \n \nAcademic Day - Commerce Student Mentor (2013) \n \nInternational Student Representative for the Faculty of Commerce UOW (2013) Additional Honors & Awards Commerce Faulty Award for Academic Excellence (2013) \n \nAcademic Day - Commerce Student Mentor (2013) \n \nInternational Student Representative for the Faculty of Commerce UOW (2013) ", "Skills SPIN Selling Solution Selling Negotiation Cloud Computing Email Encryption SaaS Skills  SPIN Selling Solution Selling Negotiation Cloud Computing Email Encryption SaaS SPIN Selling Solution Selling Negotiation Cloud Computing Email Encryption SaaS SPIN Selling Solution Selling Negotiation Cloud Computing Email Encryption SaaS Honors & Awards ", "Summary I work at Google serving large organizations as a Sales Engineer, Google for Work. \n \nMy role involves working with CIOs and top business leaders to help them reduce operational complexities, supercharge productivity, and encourage innovation in their teams with Google Apps for Work, Cloud Platform, and Chromebooks. Summary I work at Google serving large organizations as a Sales Engineer, Google for Work. \n \nMy role involves working with CIOs and top business leaders to help them reduce operational complexities, supercharge productivity, and encourage innovation in their teams with Google Apps for Work, Cloud Platform, and Chromebooks. I work at Google serving large organizations as a Sales Engineer, Google for Work. \n \nMy role involves working with CIOs and top business leaders to help them reduce operational complexities, supercharge productivity, and encourage innovation in their teams with Google Apps for Work, Cloud Platform, and Chromebooks. I work at Google serving large organizations as a Sales Engineer, Google for Work. \n \nMy role involves working with CIOs and top business leaders to help them reduce operational complexities, supercharge productivity, and encourage innovation in their teams with Google Apps for Work, Cloud Platform, and Chromebooks. Experience Sales Engineer, Google for Work Google April 2009  – Present (6 years 5 months) Greater Atlanta Area Technical salesman, product expert, and cloud technology evangelist. I help CIOs and business leadership with IT transformation, innovation, cloud messaging, collaboration, social networking, IT strategy, security, and adoption of Google Apps for Work, Cloud Platform, Chromebooks, and Chromebox for Meetings. I work closely with VARs and implementation partners, and mentor teammates to better serve customers and expand relationships. I speak and demo products at customer, industry, and community events. Sales Engineer, Google for Work Google April 2009  – Present (6 years 5 months) Greater Atlanta Area Technical salesman, product expert, and cloud technology evangelist. I help CIOs and business leadership with IT transformation, innovation, cloud messaging, collaboration, social networking, IT strategy, security, and adoption of Google Apps for Work, Cloud Platform, Chromebooks, and Chromebox for Meetings. I work closely with VARs and implementation partners, and mentor teammates to better serve customers and expand relationships. I speak and demo products at customer, industry, and community events. Sales Engineer, Google for Work Google April 2009  – Present (6 years 5 months) Greater Atlanta Area Technical salesman, product expert, and cloud technology evangelist. I help CIOs and business leadership with IT transformation, innovation, cloud messaging, collaboration, social networking, IT strategy, security, and adoption of Google Apps for Work, Cloud Platform, Chromebooks, and Chromebox for Meetings. I work closely with VARs and implementation partners, and mentor teammates to better serve customers and expand relationships. I speak and demo products at customer, industry, and community events. Skills Cloud Computing Enterprise Software SaaS Enterprise Architecture IT Strategy Business Intelligence Product Management Pre-sales Leadership Management Solution Selling Sales CRM Strategic Partnerships Salesforce.com Analytics Professional Services E-commerce Mobile Devices Identity Management Big Data Start-ups PaaS Cupcakes Business Alliances Go-to-market Strategy Information Security Security Consulting Strategy Integration See 16+     See less Skills  Cloud Computing Enterprise Software SaaS Enterprise Architecture IT Strategy Business Intelligence Product Management Pre-sales Leadership Management Solution Selling Sales CRM Strategic Partnerships Salesforce.com Analytics Professional Services E-commerce Mobile Devices Identity Management Big Data Start-ups PaaS Cupcakes Business Alliances Go-to-market Strategy Information Security Security Consulting Strategy Integration See 16+     See less Cloud Computing Enterprise Software SaaS Enterprise Architecture IT Strategy Business Intelligence Product Management Pre-sales Leadership Management Solution Selling Sales CRM Strategic Partnerships Salesforce.com Analytics Professional Services E-commerce Mobile Devices Identity Management Big Data Start-ups PaaS Cupcakes Business Alliances Go-to-market Strategy Information Security Security Consulting Strategy Integration See 16+     See less Cloud Computing Enterprise Software SaaS Enterprise Architecture IT Strategy Business Intelligence Product Management Pre-sales Leadership Management Solution Selling Sales CRM Strategic Partnerships Salesforce.com Analytics Professional Services E-commerce Mobile Devices Identity Management Big Data Start-ups PaaS Cupcakes Business Alliances Go-to-market Strategy Information Security Security Consulting Strategy Integration See 16+     See less Education University of Michigan B.S.E.,  Computer Engineering 1996  – 2000 Graduated Cum Laude University of Michigan B.S.E.,  Computer Engineering 1996  – 2000 Graduated Cum Laude University of Michigan B.S.E.,  Computer Engineering 1996  – 2000 Graduated Cum Laude University of Michigan B.S.E.,  Computer Engineering 1996  – 2000 Graduated Cum Laude Honors & Awards 2011 Top Enterprise Sales Engineer Award Google Eagle Scout Boy Scouts of America 2011 Top Enterprise Sales Engineer Award Google 2011 Top Enterprise Sales Engineer Award Google 2011 Top Enterprise Sales Engineer Award Google Eagle Scout Boy Scouts of America Eagle Scout Boy Scouts of America Eagle Scout Boy Scouts of America ", "Experience Google for Work, Sales Engineer Google 2007  – Present (8 years) I am a Sales Engineer with Google for Work. My team and I engage and consult with Global 2000 organizations on how they can take advantage of the innovative and cost effective cloud computing services Google provides to businesses. Prior to Google, I held similar senior positions at Postini and Adobe Systems Inc. Senior Sales Engineer Postini/Google 2005  –  2007  (2 years) Senior Solutions Engineer Adobe Systems, Inc. 2004  –  2006  (2 years) Sales Engineer CipherTrust 2003  –  2004  (1 year) Greater Chicago Area Sales Engineer webMethods 2002  –  2003  (1 year) Greater Chicago Area Sales Engineer SilverStream Software 1999  –  2001  (2 years) Google for Work, Sales Engineer Google 2007  – Present (8 years) I am a Sales Engineer with Google for Work. My team and I engage and consult with Global 2000 organizations on how they can take advantage of the innovative and cost effective cloud computing services Google provides to businesses. Prior to Google, I held similar senior positions at Postini and Adobe Systems Inc. Google for Work, Sales Engineer Google 2007  – Present (8 years) I am a Sales Engineer with Google for Work. My team and I engage and consult with Global 2000 organizations on how they can take advantage of the innovative and cost effective cloud computing services Google provides to businesses. Prior to Google, I held similar senior positions at Postini and Adobe Systems Inc. Senior Sales Engineer Postini/Google 2005  –  2007  (2 years) Senior Sales Engineer Postini/Google 2005  –  2007  (2 years) Senior Solutions Engineer Adobe Systems, Inc. 2004  –  2006  (2 years) Senior Solutions Engineer Adobe Systems, Inc. 2004  –  2006  (2 years) Sales Engineer CipherTrust 2003  –  2004  (1 year) Greater Chicago Area Sales Engineer CipherTrust 2003  –  2004  (1 year) Greater Chicago Area Sales Engineer webMethods 2002  –  2003  (1 year) Greater Chicago Area Sales Engineer webMethods 2002  –  2003  (1 year) Greater Chicago Area Sales Engineer SilverStream Software 1999  –  2001  (2 years) Sales Engineer SilverStream Software 1999  –  2001  (2 years) Skills Cloud Computing Sales SaaS Enterprise Software Salesforce.com Solution Selling Google Apps Strategic Partnerships Product Management Mobile Devices PaaS CRM Start-ups Lead Generation Go-to-market Strategy Cloud Storage Cloud Security Complex Sales Account Management E-commerce Data Center Channel Partners Enterprise Architecture See 8+     See less Skills  Cloud Computing Sales SaaS Enterprise Software Salesforce.com Solution Selling Google Apps Strategic Partnerships Product Management Mobile Devices PaaS CRM Start-ups Lead Generation Go-to-market Strategy Cloud Storage Cloud Security Complex Sales Account Management E-commerce Data Center Channel Partners Enterprise Architecture See 8+     See less Cloud Computing Sales SaaS Enterprise Software Salesforce.com Solution Selling Google Apps Strategic Partnerships Product Management Mobile Devices PaaS CRM Start-ups Lead Generation Go-to-market Strategy Cloud Storage Cloud Security Complex Sales Account Management E-commerce Data Center Channel Partners Enterprise Architecture See 8+     See less Cloud Computing Sales SaaS Enterprise Software Salesforce.com Solution Selling Google Apps Strategic Partnerships Product Management Mobile Devices PaaS CRM Start-ups Lead Generation Go-to-market Strategy Cloud Storage Cloud Security Complex Sales Account Management E-commerce Data Center Channel Partners Enterprise Architecture See 8+     See less Education University of Toledo Bachelor of Science (B.S.) 1998  – 2004 University of Toledo Bachelor of Science (B.S.) 1998  – 2004 University of Toledo Bachelor of Science (B.S.) 1998  – 2004 University of Toledo Bachelor of Science (B.S.) 1998  – 2004 ", "Experience Sales Engineer, Google for Work Google November 2013  – Present (1 year 10 months) New York City Systems Engineer Cisco October 2010  –  November 2013  (3 years 2 months) Boston, MA At Cisco, “Tomorrow Starts Here.” As a Sales Engineer, I lead technical engagement in strategic accounts in the New England region, covering numerous vertical, including: Retail, Manufacturing, Tech, and Insurance. I covered the full Cisco portfolio, including collaboration, enterprise networks, and data center/virtualization. My role included pre-sales qualification, solution architecture and design, executive presentations, and post-sales support.  \n \nMy focus technology was Collaboration. This included unified communications, contact center, WebEx, and video conferencing. In this speciality, I would engage on strategic opportunities with a need for collaboration. I lead the regional SE team in collaborative events for knowledge-sharing, discussing sales best-practices and reviewing upcoming roadmap items. \n \nOutside of my core role, I also worked to engage with the global team. This included leading the SE community in using our internal social tool and developing easy-to-use apps to find content important to SEs in their roles. Telecom & Networking Supervisor The Golub Corpration / Price Chopper Supermarkets January 2005  –  September 2010  (5 years 9 months) As the IT supervisor responsible for telecommunications, I lead the team that managed all voice, video, and data networks for Price Chopper. Operationally we supported 130+ remote sites, 3 corporate locations, and 2 data centers. On the development side, the had several accomplishments: \n \n-Built a next-generation MPLS WAN, managed in-house \n-Planned and implemented a data center migration, ensuring seamless application migration \n-Designed and implemented a 500+ user new corporate facility. Implemented Cisco Collaboration, including conferencing, telephony, and IM. The network was built on Juniper EX-series \n-Implemented a homegrown service monitoring solution built on Nagios & Cacti \n-Managed all network-based security, including Cisco ASAs, Cisco MARS, Cisco ACS, & Cisco Security Agent Sales Engineer, Google for Work Google November 2013  – Present (1 year 10 months) New York City Sales Engineer, Google for Work Google November 2013  – Present (1 year 10 months) New York City Systems Engineer Cisco October 2010  –  November 2013  (3 years 2 months) Boston, MA At Cisco, “Tomorrow Starts Here.” As a Sales Engineer, I lead technical engagement in strategic accounts in the New England region, covering numerous vertical, including: Retail, Manufacturing, Tech, and Insurance. I covered the full Cisco portfolio, including collaboration, enterprise networks, and data center/virtualization. My role included pre-sales qualification, solution architecture and design, executive presentations, and post-sales support.  \n \nMy focus technology was Collaboration. This included unified communications, contact center, WebEx, and video conferencing. In this speciality, I would engage on strategic opportunities with a need for collaboration. I lead the regional SE team in collaborative events for knowledge-sharing, discussing sales best-practices and reviewing upcoming roadmap items. \n \nOutside of my core role, I also worked to engage with the global team. This included leading the SE community in using our internal social tool and developing easy-to-use apps to find content important to SEs in their roles. Systems Engineer Cisco October 2010  –  November 2013  (3 years 2 months) Boston, MA At Cisco, “Tomorrow Starts Here.” As a Sales Engineer, I lead technical engagement in strategic accounts in the New England region, covering numerous vertical, including: Retail, Manufacturing, Tech, and Insurance. I covered the full Cisco portfolio, including collaboration, enterprise networks, and data center/virtualization. My role included pre-sales qualification, solution architecture and design, executive presentations, and post-sales support.  \n \nMy focus technology was Collaboration. This included unified communications, contact center, WebEx, and video conferencing. In this speciality, I would engage on strategic opportunities with a need for collaboration. I lead the regional SE team in collaborative events for knowledge-sharing, discussing sales best-practices and reviewing upcoming roadmap items. \n \nOutside of my core role, I also worked to engage with the global team. This included leading the SE community in using our internal social tool and developing easy-to-use apps to find content important to SEs in their roles. Telecom & Networking Supervisor The Golub Corpration / Price Chopper Supermarkets January 2005  –  September 2010  (5 years 9 months) As the IT supervisor responsible for telecommunications, I lead the team that managed all voice, video, and data networks for Price Chopper. Operationally we supported 130+ remote sites, 3 corporate locations, and 2 data centers. On the development side, the had several accomplishments: \n \n-Built a next-generation MPLS WAN, managed in-house \n-Planned and implemented a data center migration, ensuring seamless application migration \n-Designed and implemented a 500+ user new corporate facility. Implemented Cisco Collaboration, including conferencing, telephony, and IM. The network was built on Juniper EX-series \n-Implemented a homegrown service monitoring solution built on Nagios & Cacti \n-Managed all network-based security, including Cisco ASAs, Cisco MARS, Cisco ACS, & Cisco Security Agent Telecom & Networking Supervisor The Golub Corpration / Price Chopper Supermarkets January 2005  –  September 2010  (5 years 9 months) As the IT supervisor responsible for telecommunications, I lead the team that managed all voice, video, and data networks for Price Chopper. Operationally we supported 130+ remote sites, 3 corporate locations, and 2 data centers. On the development side, the had several accomplishments: \n \n-Built a next-generation MPLS WAN, managed in-house \n-Planned and implemented a data center migration, ensuring seamless application migration \n-Designed and implemented a 500+ user new corporate facility. Implemented Cisco Collaboration, including conferencing, telephony, and IM. The network was built on Juniper EX-series \n-Implemented a homegrown service monitoring solution built on Nagios & Cacti \n-Managed all network-based security, including Cisco ASAs, Cisco MARS, Cisco ACS, & Cisco Security Agent Skills Cisco Unified Communications Routing Network Architecture Data Center Cisco Technologies Network Security Virtualization Cisco IOS VMware CCNP Network Design Disaster Recovery Cisco Nexus Ethernet Switches VoIP Cisco Call Manager Cloud Computing Storage Area Networks WAN Juniper Security MPLS Telecommunications Video Conferencing Networking Telephony VPN VMware ESX QoS Network Engineering CCNA IP TCP/IP Cisco UCS BGP Network Administration Routers Wireless Networking SIP LAN-WAN Cisco Certified Firewalls Servers CCIE Cisco Routers OSPF Load Balancing Managed Services See 35+     See less Skills  Cisco Unified Communications Routing Network Architecture Data Center Cisco Technologies Network Security Virtualization Cisco IOS VMware CCNP Network Design Disaster Recovery Cisco Nexus Ethernet Switches VoIP Cisco Call Manager Cloud Computing Storage Area Networks WAN Juniper Security MPLS Telecommunications Video Conferencing Networking Telephony VPN VMware ESX QoS Network Engineering CCNA IP TCP/IP Cisco UCS BGP Network Administration Routers Wireless Networking SIP LAN-WAN Cisco Certified Firewalls Servers CCIE Cisco Routers OSPF Load Balancing Managed Services See 35+     See less Cisco Unified Communications Routing Network Architecture Data Center Cisco Technologies Network Security Virtualization Cisco IOS VMware CCNP Network Design Disaster Recovery Cisco Nexus Ethernet Switches VoIP Cisco Call Manager Cloud Computing Storage Area Networks WAN Juniper Security MPLS Telecommunications Video Conferencing Networking Telephony VPN VMware ESX QoS Network Engineering CCNA IP TCP/IP Cisco UCS BGP Network Administration Routers Wireless Networking SIP LAN-WAN Cisco Certified Firewalls Servers CCIE Cisco Routers OSPF Load Balancing Managed Services See 35+     See less Cisco Unified Communications Routing Network Architecture Data Center Cisco Technologies Network Security Virtualization Cisco IOS VMware CCNP Network Design Disaster Recovery Cisco Nexus Ethernet Switches VoIP Cisco Call Manager Cloud Computing Storage Area Networks WAN Juniper Security MPLS Telecommunications Video Conferencing Networking Telephony VPN VMware ESX QoS Network Engineering CCNA IP TCP/IP Cisco UCS BGP Network Administration Routers Wireless Networking SIP LAN-WAN Cisco Certified Firewalls Servers CCIE Cisco Routers OSPF Load Balancing Managed Services See 35+     See less Honors & Awards Q3FY11 - SE of the Quarter - NE South Select Sales Cisco May 2011 Q2FY12 - SE of the Quarter - NE South Select Sales Cisco February 2012 Q2FY12 - SE Leadership in Core Award - Commercial East Area Sales Cisco February 2012 Systems Engineer of the Year - Colonial Select Operation Cisco August 2012 FY12 Sales Champion Cisco August 2012 Q2FY13 - Global SE Excellence Award Cisco March 2013 The FY13 Global SE Excellence Award is given to a SE that demonstrates leadership in enterprise social networking. This includes using social tools to communicate with the community, manage teams, build momentum, and drive adoption with peers. Q3FY13 - SE of the Quarter - Commercial East Area Sales Cisco May 2013 Q3FY11 - SE of the Quarter - NE South Select Sales Cisco May 2011 Q3FY11 - SE of the Quarter - NE South Select Sales Cisco May 2011 Q3FY11 - SE of the Quarter - NE South Select Sales Cisco May 2011 Q2FY12 - SE of the Quarter - NE South Select Sales Cisco February 2012 Q2FY12 - SE of the Quarter - NE South Select Sales Cisco February 2012 Q2FY12 - SE of the Quarter - NE South Select Sales Cisco February 2012 Q2FY12 - SE Leadership in Core Award - Commercial East Area Sales Cisco February 2012 Q2FY12 - SE Leadership in Core Award - Commercial East Area Sales Cisco February 2012 Q2FY12 - SE Leadership in Core Award - Commercial East Area Sales Cisco February 2012 Systems Engineer of the Year - Colonial Select Operation Cisco August 2012 Systems Engineer of the Year - Colonial Select Operation Cisco August 2012 Systems Engineer of the Year - Colonial Select Operation Cisco August 2012 FY12 Sales Champion Cisco August 2012 FY12 Sales Champion Cisco August 2012 FY12 Sales Champion Cisco August 2012 Q2FY13 - Global SE Excellence Award Cisco March 2013 The FY13 Global SE Excellence Award is given to a SE that demonstrates leadership in enterprise social networking. This includes using social tools to communicate with the community, manage teams, build momentum, and drive adoption with peers. Q2FY13 - Global SE Excellence Award Cisco March 2013 The FY13 Global SE Excellence Award is given to a SE that demonstrates leadership in enterprise social networking. This includes using social tools to communicate with the community, manage teams, build momentum, and drive adoption with peers. Q2FY13 - Global SE Excellence Award Cisco March 2013 The FY13 Global SE Excellence Award is given to a SE that demonstrates leadership in enterprise social networking. This includes using social tools to communicate with the community, manage teams, build momentum, and drive adoption with peers. Q3FY13 - SE of the Quarter - Commercial East Area Sales Cisco May 2013 Q3FY13 - SE of the Quarter - Commercial East Area Sales Cisco May 2013 Q3FY13 - SE of the Quarter - Commercial East Area Sales Cisco May 2013 ", "Summary David is a solutions architect for the Google Maps team and advises Google's top global partners and large customers on the adoption of new technologies for mobile, web and the cloud.  \n \nDavid works with Google's global top partners to craft scalable solutions for a wide range of complex geospatial applications such as -- location intelligence, indoor mapping & navigation, telematics, mobile apps, big data analytics and imagery.  \n \nBefore joining Google, David spent 10 years in the aerospace industry as a program manager developing advanced imaging satellites, remote sensing systems, sensors and data fusion systems. \n \nDavid has spoken on the topics of cloud computing, the use of mapping data for crisis response, and the use of imagery to collect analytics and activity-based intelligence. David has also previously been involved in a variety of web startup activities, such as founding LiveLocker.com which was featured on TechCrunch in in 2006. \n \nSpecialties: cloud, big data, mobile, location services, mapping and local, satellite images and remote sensing, navigation, App Engine, Cloud SQL, BigQuery, imagery, computer vision algorithms, full motion video processing, Android, HTML/CSS, JavaScript, jQuery, AngularJS Summary David is a solutions architect for the Google Maps team and advises Google's top global partners and large customers on the adoption of new technologies for mobile, web and the cloud.  \n \nDavid works with Google's global top partners to craft scalable solutions for a wide range of complex geospatial applications such as -- location intelligence, indoor mapping & navigation, telematics, mobile apps, big data analytics and imagery.  \n \nBefore joining Google, David spent 10 years in the aerospace industry as a program manager developing advanced imaging satellites, remote sensing systems, sensors and data fusion systems. \n \nDavid has spoken on the topics of cloud computing, the use of mapping data for crisis response, and the use of imagery to collect analytics and activity-based intelligence. David has also previously been involved in a variety of web startup activities, such as founding LiveLocker.com which was featured on TechCrunch in in 2006. \n \nSpecialties: cloud, big data, mobile, location services, mapping and local, satellite images and remote sensing, navigation, App Engine, Cloud SQL, BigQuery, imagery, computer vision algorithms, full motion video processing, Android, HTML/CSS, JavaScript, jQuery, AngularJS David is a solutions architect for the Google Maps team and advises Google's top global partners and large customers on the adoption of new technologies for mobile, web and the cloud.  \n \nDavid works with Google's global top partners to craft scalable solutions for a wide range of complex geospatial applications such as -- location intelligence, indoor mapping & navigation, telematics, mobile apps, big data analytics and imagery.  \n \nBefore joining Google, David spent 10 years in the aerospace industry as a program manager developing advanced imaging satellites, remote sensing systems, sensors and data fusion systems. \n \nDavid has spoken on the topics of cloud computing, the use of mapping data for crisis response, and the use of imagery to collect analytics and activity-based intelligence. David has also previously been involved in a variety of web startup activities, such as founding LiveLocker.com which was featured on TechCrunch in in 2006. \n \nSpecialties: cloud, big data, mobile, location services, mapping and local, satellite images and remote sensing, navigation, App Engine, Cloud SQL, BigQuery, imagery, computer vision algorithms, full motion video processing, Android, HTML/CSS, JavaScript, jQuery, AngularJS David is a solutions architect for the Google Maps team and advises Google's top global partners and large customers on the adoption of new technologies for mobile, web and the cloud.  \n \nDavid works with Google's global top partners to craft scalable solutions for a wide range of complex geospatial applications such as -- location intelligence, indoor mapping & navigation, telematics, mobile apps, big data analytics and imagery.  \n \nBefore joining Google, David spent 10 years in the aerospace industry as a program manager developing advanced imaging satellites, remote sensing systems, sensors and data fusion systems. \n \nDavid has spoken on the topics of cloud computing, the use of mapping data for crisis response, and the use of imagery to collect analytics and activity-based intelligence. David has also previously been involved in a variety of web startup activities, such as founding LiveLocker.com which was featured on TechCrunch in in 2006. \n \nSpecialties: cloud, big data, mobile, location services, mapping and local, satellite images and remote sensing, navigation, App Engine, Cloud SQL, BigQuery, imagery, computer vision algorithms, full motion video processing, Android, HTML/CSS, JavaScript, jQuery, AngularJS Experience Sales Engineer, Google Maps for Work Google June 2012  – Present (3 years 3 months) New York, NY As part of the Google Maps team, David advises Google's global top partners, large commercial customers, and the Federal government on the adoption of new technologies for mobile, web and the cloud. Sales Engineer, Google Maps for Work Google June 2012  – Present (3 years 3 months) New York, NY As part of the Google Maps team, David advises Google's global top partners, large commercial customers, and the Federal government on the adoption of new technologies for mobile, web and the cloud. Sales Engineer, Google Maps for Work Google June 2012  – Present (3 years 3 months) New York, NY As part of the Google Maps team, David advises Google's global top partners, large commercial customers, and the Federal government on the adoption of new technologies for mobile, web and the cloud. Languages   Skills Skills     Honors & Awards ", "Summary Extensive consulting experience and deep understanding of Geographical Information Systems (GIS). I strength sales teams with valuable sales-oriented technical support that identifies customers’ needs and implements successful enterprise solutions. Summary Extensive consulting experience and deep understanding of Geographical Information Systems (GIS). I strength sales teams with valuable sales-oriented technical support that identifies customers’ needs and implements successful enterprise solutions. Extensive consulting experience and deep understanding of Geographical Information Systems (GIS). I strength sales teams with valuable sales-oriented technical support that identifies customers’ needs and implements successful enterprise solutions. Extensive consulting experience and deep understanding of Geographical Information Systems (GIS). I strength sales teams with valuable sales-oriented technical support that identifies customers’ needs and implements successful enterprise solutions. Experience EMEA Sales Engineer Google for Work Google October 2012  – Present (2 years 11 months) Stockholm, Sweden Product Specialist ESRI Sverige October 2008  –  October 2012  (4 years 1 month) Stockholm, Sweden WebGIS Specialist, Information Management Group Golder Associates AB June 2007  –  August 2008  (1 year 3 months) Stockholm, Sweden GIS Solutions Analyst, Information Management Division Golder Associates Ltd. January 2004  –  May 2007  (3 years 5 months) Calgary, Canada Area Database Administrator – Information Technology Department Banco de la Republica - Central Bank Colombia 1999  –  April 2001  (2 years) Bogota, Colombia Support Engineer – Information Technology Center University of Los Andes August 1996  –  1999  (3 years) Bogota, Colombia Internship: Intern Developer Engineer IBM Colombia January 1994  –  July 1994  (7 months) Bogota, Colombia EMEA Sales Engineer Google for Work Google October 2012  – Present (2 years 11 months) Stockholm, Sweden EMEA Sales Engineer Google for Work Google October 2012  – Present (2 years 11 months) Stockholm, Sweden Product Specialist ESRI Sverige October 2008  –  October 2012  (4 years 1 month) Stockholm, Sweden Product Specialist ESRI Sverige October 2008  –  October 2012  (4 years 1 month) Stockholm, Sweden WebGIS Specialist, Information Management Group Golder Associates AB June 2007  –  August 2008  (1 year 3 months) Stockholm, Sweden WebGIS Specialist, Information Management Group Golder Associates AB June 2007  –  August 2008  (1 year 3 months) Stockholm, Sweden GIS Solutions Analyst, Information Management Division Golder Associates Ltd. January 2004  –  May 2007  (3 years 5 months) Calgary, Canada Area GIS Solutions Analyst, Information Management Division Golder Associates Ltd. January 2004  –  May 2007  (3 years 5 months) Calgary, Canada Area Database Administrator – Information Technology Department Banco de la Republica - Central Bank Colombia 1999  –  April 2001  (2 years) Bogota, Colombia Database Administrator – Information Technology Department Banco de la Republica - Central Bank Colombia 1999  –  April 2001  (2 years) Bogota, Colombia Support Engineer – Information Technology Center University of Los Andes August 1996  –  1999  (3 years) Bogota, Colombia Support Engineer – Information Technology Center University of Los Andes August 1996  –  1999  (3 years) Bogota, Colombia Internship: Intern Developer Engineer IBM Colombia January 1994  –  July 1994  (7 months) Bogota, Colombia Internship: Intern Developer Engineer IBM Colombia January 1994  –  July 1994  (7 months) Bogota, Colombia Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Swedish Full professional proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Swedish Full professional proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Swedish Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills ESRI ArcGIS Server Cloud Computing Spatial Databases ArcGIS Geomatics ArcMap SharePoint Cartography Product Marketing Technical Support Mobile Applications Project Management Microsoft SQL Server Technical Presentations Customer Support Problem Solving Programming IT Solutions Web Services Amazon Cloud OGC Web Applications ArcGIS Online Solution Implementation Customization Hands-on Training Instructor-led Training Portal for ArcGIS Pre-Sale Support Google Apps Google Maps Google Earth Systems Engineering See 19+     See less Skills  ESRI ArcGIS Server Cloud Computing Spatial Databases ArcGIS Geomatics ArcMap SharePoint Cartography Product Marketing Technical Support Mobile Applications Project Management Microsoft SQL Server Technical Presentations Customer Support Problem Solving Programming IT Solutions Web Services Amazon Cloud OGC Web Applications ArcGIS Online Solution Implementation Customization Hands-on Training Instructor-led Training Portal for ArcGIS Pre-Sale Support Google Apps Google Maps Google Earth Systems Engineering See 19+     See less ESRI ArcGIS Server Cloud Computing Spatial Databases ArcGIS Geomatics ArcMap SharePoint Cartography Product Marketing Technical Support Mobile Applications Project Management Microsoft SQL Server Technical Presentations Customer Support Problem Solving Programming IT Solutions Web Services Amazon Cloud OGC Web Applications ArcGIS Online Solution Implementation Customization Hands-on Training Instructor-led Training Portal for ArcGIS Pre-Sale Support Google Apps Google Maps Google Earth Systems Engineering See 19+     See less ESRI ArcGIS Server Cloud Computing Spatial Databases ArcGIS Geomatics ArcMap SharePoint Cartography Product Marketing Technical Support Mobile Applications Project Management Microsoft SQL Server Technical Presentations Customer Support Problem Solving Programming IT Solutions Web Services Amazon Cloud OGC Web Applications ArcGIS Online Solution Implementation Customization Hands-on Training Instructor-led Training Portal for ArcGIS Pre-Sale Support Google Apps Google Maps Google Earth Systems Engineering See 19+     See less Honors & Awards ", "Experience Sales Engineer, Google Apps for Work Google November 2013  – Present (1 year 10 months) Amsterdam Area, Netherlands Sales Engineer, Google Apps for Work Google November 2013  – Present (1 year 10 months) Amsterdam Area, Netherlands Sales Engineer, Google Apps for Work Google November 2013  – Present (1 year 10 months) Amsterdam Area, Netherlands Languages Dutch English Dutch English Dutch English Skills Cloud Computing Solution Selling SaaS CRM Enterprise Software Business Intelligence Siebel Web Development Solution Architecture Oracle Account Management Oracle Applications Pre-sales SOA ERP Enterprise Architecture Mobile Devices Strategic Partnerships See 3+     See less Skills  Cloud Computing Solution Selling SaaS CRM Enterprise Software Business Intelligence Siebel Web Development Solution Architecture Oracle Account Management Oracle Applications Pre-sales SOA ERP Enterprise Architecture Mobile Devices Strategic Partnerships See 3+     See less Cloud Computing Solution Selling SaaS CRM Enterprise Software Business Intelligence Siebel Web Development Solution Architecture Oracle Account Management Oracle Applications Pre-sales SOA ERP Enterprise Architecture Mobile Devices Strategic Partnerships See 3+     See less Cloud Computing Solution Selling SaaS CRM Enterprise Software Business Intelligence Siebel Web Development Solution Architecture Oracle Account Management Oracle Applications Pre-sales SOA ERP Enterprise Architecture Mobile Devices Strategic Partnerships See 3+     See less ", "Summary Rich experience of 15 years working in IT organizations including more than 10 years spent as Pre-Sales engineer and other customer facing roles at American and European Software companies. \n \nProficient with technically selling IT solutions in areas such as Cloud Computing, Identity Management, IT Service Management and Application Performance Management. I have a very good knowledge of Internet technologies, and a strong background as enterprise web applications architect. \n \nI’m currently working as Sales Engineer in Google for Work organisation at Google. Summary Rich experience of 15 years working in IT organizations including more than 10 years spent as Pre-Sales engineer and other customer facing roles at American and European Software companies. \n \nProficient with technically selling IT solutions in areas such as Cloud Computing, Identity Management, IT Service Management and Application Performance Management. I have a very good knowledge of Internet technologies, and a strong background as enterprise web applications architect. \n \nI’m currently working as Sales Engineer in Google for Work organisation at Google. Rich experience of 15 years working in IT organizations including more than 10 years spent as Pre-Sales engineer and other customer facing roles at American and European Software companies. \n \nProficient with technically selling IT solutions in areas such as Cloud Computing, Identity Management, IT Service Management and Application Performance Management. I have a very good knowledge of Internet technologies, and a strong background as enterprise web applications architect. \n \nI’m currently working as Sales Engineer in Google for Work organisation at Google. Rich experience of 15 years working in IT organizations including more than 10 years spent as Pre-Sales engineer and other customer facing roles at American and European Software companies. \n \nProficient with technically selling IT solutions in areas such as Cloud Computing, Identity Management, IT Service Management and Application Performance Management. I have a very good knowledge of Internet technologies, and a strong background as enterprise web applications architect. \n \nI’m currently working as Sales Engineer in Google for Work organisation at Google. Experience Sales Engineer, Google for Work Google April 2014  – Present (1 year 5 months) Paris Area, France - Take responsibility for technical aspects of solutions to include such activities as supporting bid responses, product and solution briefings, proof-of-concept work, and the co-ordination of supporting technical resources.  \n- Work hands-on with Google Apps fro Work products to demonstrate and prototype integrations in customer / partner environments. \n- Work closely with product, support, engineering, and sales teams to stay on top of industry trends and devise enhancements to Google for Work products. Partner Technology Manager Google October 2011  –  March 2014  (2 years 6 months) Paris Area, France As a Partner Technology Manager within Google Play Books organisation, I work closely with Business development team in order to drive new business opportunities and manage the overall technical aspects to build strong, successful and long-term partnerships. I also lead new product launches in my region and help strategic partners to optimize their integrations leveraging Google technologies. \n \nI participated to the launch of Google Play Books store in France, Netherlands, Sweden and 13 other countries where I was involved in all the stages of the relationship with book publishers in these countries, from contract negotiation to partner on-boarding and store launch. Senior Technical Sales CA Technologies August 2007  –  October 2011  (4 years 3 months) Paris Area, France As a Technical Sales engineer, I was in charge of technically selling CA Service Assurance solution, this includes areas such as Application Performance Management, Infrastructure Management and Network Management. \n \nI promoted CA Service Assurance solution in presentations to prospects, customers, analysts and specialized journalists during face-to-face meetings and seminars. And I participated to bid responses writing answers to RFIs and RFPs. \n \nI did live demos and installed the solution for Proof Of Concepts, I also supported account managers in order to meet the needs expressed by prospects or customers. \n \nI contributed to the success of major deals with CAC 40 companies such as France Telecom, EDF, AXA or BNP PARIBAS. Pre-Sales Consultant BMC Software January 2005  –  August 2007  (2 years 8 months) Paris Area, France My role as a pre-sales consultant was to understand and meet prospects and customers requirements in Identity Management field through responses to RFPs and face-to-face in meetings and workshops. \n \nI Created proposals based on the technologies developed by BMC Software in order to meet customer’s needs and solve their business issues. \n \nI Contributed to the improvement of technologies of Identity Management by sharing “Best Practices” and other resources when it is necessary. \n \nI was involved in successful deals with major companies like AXA, Total and France Telecom. Technical Consultant Calendra April 2004  –  December 2004  (9 months) Paris Area, France As a consultant in the Professional Services BU, I was in charge of the implementation of Calendra Directory Manager software (CDM) at customers site. \n \nCDM is a J2EE application generator that allows customers to create rapidly LDAP enabled applications like White Pages or Organizational Charts. It also provides advanced features like the workflow engine. \n \nAfter Calendra acquisition by BMC Software, I was in charge of training BMC Software consultants, I animated training sessions in Europe and Americas (US, Brazil, Spain, Switzerland, Italy etc.) Java EE Architect NET2S June 2000  –  April 2004  (3 years 11 months) Paris Area, France As a contractor, I worked as Java / JEE developer and JEE applications architect for Net2s customers: \n \n● January'02 To April'04, as JEE Architect for BNP PARIBAS, I participated to the design and the implementation of a trading application using SWIFT network. Used technologies: JEE, EJB, Struts, XML, Silverstream AS, MQ-Series, Sybase \n \n● January'01 To December'01, as JEE Consultant at Société Générale, I took part in the development of a trading application for Société Générale’s partners. Used technologies: JEE, EJB, XML, BEA Weblogic, Oracle \n \n● June'00 To December'00, As Java developer at Interépargne (Natixis), I developed a web based banking application for Interépargne’s customers (http://www.interepargne.natixis.fr) Sales Engineer, Google for Work Google April 2014  – Present (1 year 5 months) Paris Area, France - Take responsibility for technical aspects of solutions to include such activities as supporting bid responses, product and solution briefings, proof-of-concept work, and the co-ordination of supporting technical resources.  \n- Work hands-on with Google Apps fro Work products to demonstrate and prototype integrations in customer / partner environments. \n- Work closely with product, support, engineering, and sales teams to stay on top of industry trends and devise enhancements to Google for Work products. Sales Engineer, Google for Work Google April 2014  – Present (1 year 5 months) Paris Area, France - Take responsibility for technical aspects of solutions to include such activities as supporting bid responses, product and solution briefings, proof-of-concept work, and the co-ordination of supporting technical resources.  \n- Work hands-on with Google Apps fro Work products to demonstrate and prototype integrations in customer / partner environments. \n- Work closely with product, support, engineering, and sales teams to stay on top of industry trends and devise enhancements to Google for Work products. Partner Technology Manager Google October 2011  –  March 2014  (2 years 6 months) Paris Area, France As a Partner Technology Manager within Google Play Books organisation, I work closely with Business development team in order to drive new business opportunities and manage the overall technical aspects to build strong, successful and long-term partnerships. I also lead new product launches in my region and help strategic partners to optimize their integrations leveraging Google technologies. \n \nI participated to the launch of Google Play Books store in France, Netherlands, Sweden and 13 other countries where I was involved in all the stages of the relationship with book publishers in these countries, from contract negotiation to partner on-boarding and store launch. Partner Technology Manager Google October 2011  –  March 2014  (2 years 6 months) Paris Area, France As a Partner Technology Manager within Google Play Books organisation, I work closely with Business development team in order to drive new business opportunities and manage the overall technical aspects to build strong, successful and long-term partnerships. I also lead new product launches in my region and help strategic partners to optimize their integrations leveraging Google technologies. \n \nI participated to the launch of Google Play Books store in France, Netherlands, Sweden and 13 other countries where I was involved in all the stages of the relationship with book publishers in these countries, from contract negotiation to partner on-boarding and store launch. Senior Technical Sales CA Technologies August 2007  –  October 2011  (4 years 3 months) Paris Area, France As a Technical Sales engineer, I was in charge of technically selling CA Service Assurance solution, this includes areas such as Application Performance Management, Infrastructure Management and Network Management. \n \nI promoted CA Service Assurance solution in presentations to prospects, customers, analysts and specialized journalists during face-to-face meetings and seminars. And I participated to bid responses writing answers to RFIs and RFPs. \n \nI did live demos and installed the solution for Proof Of Concepts, I also supported account managers in order to meet the needs expressed by prospects or customers. \n \nI contributed to the success of major deals with CAC 40 companies such as France Telecom, EDF, AXA or BNP PARIBAS. Senior Technical Sales CA Technologies August 2007  –  October 2011  (4 years 3 months) Paris Area, France As a Technical Sales engineer, I was in charge of technically selling CA Service Assurance solution, this includes areas such as Application Performance Management, Infrastructure Management and Network Management. \n \nI promoted CA Service Assurance solution in presentations to prospects, customers, analysts and specialized journalists during face-to-face meetings and seminars. And I participated to bid responses writing answers to RFIs and RFPs. \n \nI did live demos and installed the solution for Proof Of Concepts, I also supported account managers in order to meet the needs expressed by prospects or customers. \n \nI contributed to the success of major deals with CAC 40 companies such as France Telecom, EDF, AXA or BNP PARIBAS. Pre-Sales Consultant BMC Software January 2005  –  August 2007  (2 years 8 months) Paris Area, France My role as a pre-sales consultant was to understand and meet prospects and customers requirements in Identity Management field through responses to RFPs and face-to-face in meetings and workshops. \n \nI Created proposals based on the technologies developed by BMC Software in order to meet customer’s needs and solve their business issues. \n \nI Contributed to the improvement of technologies of Identity Management by sharing “Best Practices” and other resources when it is necessary. \n \nI was involved in successful deals with major companies like AXA, Total and France Telecom. Pre-Sales Consultant BMC Software January 2005  –  August 2007  (2 years 8 months) Paris Area, France My role as a pre-sales consultant was to understand and meet prospects and customers requirements in Identity Management field through responses to RFPs and face-to-face in meetings and workshops. \n \nI Created proposals based on the technologies developed by BMC Software in order to meet customer’s needs and solve their business issues. \n \nI Contributed to the improvement of technologies of Identity Management by sharing “Best Practices” and other resources when it is necessary. \n \nI was involved in successful deals with major companies like AXA, Total and France Telecom. Technical Consultant Calendra April 2004  –  December 2004  (9 months) Paris Area, France As a consultant in the Professional Services BU, I was in charge of the implementation of Calendra Directory Manager software (CDM) at customers site. \n \nCDM is a J2EE application generator that allows customers to create rapidly LDAP enabled applications like White Pages or Organizational Charts. It also provides advanced features like the workflow engine. \n \nAfter Calendra acquisition by BMC Software, I was in charge of training BMC Software consultants, I animated training sessions in Europe and Americas (US, Brazil, Spain, Switzerland, Italy etc.) Technical Consultant Calendra April 2004  –  December 2004  (9 months) Paris Area, France As a consultant in the Professional Services BU, I was in charge of the implementation of Calendra Directory Manager software (CDM) at customers site. \n \nCDM is a J2EE application generator that allows customers to create rapidly LDAP enabled applications like White Pages or Organizational Charts. It also provides advanced features like the workflow engine. \n \nAfter Calendra acquisition by BMC Software, I was in charge of training BMC Software consultants, I animated training sessions in Europe and Americas (US, Brazil, Spain, Switzerland, Italy etc.) Java EE Architect NET2S June 2000  –  April 2004  (3 years 11 months) Paris Area, France As a contractor, I worked as Java / JEE developer and JEE applications architect for Net2s customers: \n \n● January'02 To April'04, as JEE Architect for BNP PARIBAS, I participated to the design and the implementation of a trading application using SWIFT network. Used technologies: JEE, EJB, Struts, XML, Silverstream AS, MQ-Series, Sybase \n \n● January'01 To December'01, as JEE Consultant at Société Générale, I took part in the development of a trading application for Société Générale’s partners. Used technologies: JEE, EJB, XML, BEA Weblogic, Oracle \n \n● June'00 To December'00, As Java developer at Interépargne (Natixis), I developed a web based banking application for Interépargne’s customers (http://www.interepargne.natixis.fr) Java EE Architect NET2S June 2000  –  April 2004  (3 years 11 months) Paris Area, France As a contractor, I worked as Java / JEE developer and JEE applications architect for Net2s customers: \n \n● January'02 To April'04, as JEE Architect for BNP PARIBAS, I participated to the design and the implementation of a trading application using SWIFT network. Used technologies: JEE, EJB, Struts, XML, Silverstream AS, MQ-Series, Sybase \n \n● January'01 To December'01, as JEE Consultant at Société Générale, I took part in the development of a trading application for Société Générale’s partners. Used technologies: JEE, EJB, XML, BEA Weblogic, Oracle \n \n● June'00 To December'00, As Java developer at Interépargne (Natixis), I developed a web based banking application for Interépargne’s customers (http://www.interepargne.natixis.fr) Languages French English Arabic French English Arabic French English Arabic Skills Cloud Computing SOA Application Servers Java Enterprise Edition Pre-sales Enterprise Architecture SaaS Enterprise Software Solution Architecture Virtualization Middleware Application Performance... Identity Management Java XML Weblogic Sales Enablement .NET Integration See 4+     See less Skills  Cloud Computing SOA Application Servers Java Enterprise Edition Pre-sales Enterprise Architecture SaaS Enterprise Software Solution Architecture Virtualization Middleware Application Performance... Identity Management Java XML Weblogic Sales Enablement .NET Integration See 4+     See less Cloud Computing SOA Application Servers Java Enterprise Edition Pre-sales Enterprise Architecture SaaS Enterprise Software Solution Architecture Virtualization Middleware Application Performance... Identity Management Java XML Weblogic Sales Enablement .NET Integration See 4+     See less Cloud Computing SOA Application Servers Java Enterprise Edition Pre-sales Enterprise Architecture SaaS Enterprise Software Solution Architecture Virtualization Middleware Application Performance... Identity Management Java XML Weblogic Sales Enablement .NET Integration See 4+     See less ", "Experience Sales Engineer, Google for Work Google August 2014  – Present (1 year 1 month) Owner Perpetual IT Consulting June 2013  – Present (2 years 3 months) Makati City, Philippines Sales Engineer, Google for Work Google August 2014  – Present (1 year 1 month) Sales Engineer, Google for Work Google August 2014  – Present (1 year 1 month) Owner Perpetual IT Consulting June 2013  – Present (2 years 3 months) Makati City, Philippines Owner Perpetual IT Consulting June 2013  – Present (2 years 3 months) Makati City, Philippines Skills Solution Architecture Enterprise Architecture SharePoint Cloud Computing Enterprise Search SOA Software Project... Pre-sales SDLC Enterprise Software Agile Methodologies Microsoft Office... .NET IIS Web Services IT Strategy Business Intelligence WCF ASP.NET Business Analysis Microsoft SQL Server Software Development Microsoft Technologies Office 365 Yammer Lync Oracle PL/SQL... SSRS C# Integration Agile Project Management SaaS TFS See 18+     See less Skills  Solution Architecture Enterprise Architecture SharePoint Cloud Computing Enterprise Search SOA Software Project... Pre-sales SDLC Enterprise Software Agile Methodologies Microsoft Office... .NET IIS Web Services IT Strategy Business Intelligence WCF ASP.NET Business Analysis Microsoft SQL Server Software Development Microsoft Technologies Office 365 Yammer Lync Oracle PL/SQL... SSRS C# Integration Agile Project Management SaaS TFS See 18+     See less Solution Architecture Enterprise Architecture SharePoint Cloud Computing Enterprise Search SOA Software Project... Pre-sales SDLC Enterprise Software Agile Methodologies Microsoft Office... .NET IIS Web Services IT Strategy Business Intelligence WCF ASP.NET Business Analysis Microsoft SQL Server Software Development Microsoft Technologies Office 365 Yammer Lync Oracle PL/SQL... SSRS C# Integration Agile Project Management SaaS TFS See 18+     See less Solution Architecture Enterprise Architecture SharePoint Cloud Computing Enterprise Search SOA Software Project... Pre-sales SDLC Enterprise Software Agile Methodologies Microsoft Office... .NET IIS Web Services IT Strategy Business Intelligence WCF ASP.NET Business Analysis Microsoft SQL Server Software Development Microsoft Technologies Office 365 Yammer Lync Oracle PL/SQL... SSRS C# Integration Agile Project Management SaaS TFS See 18+     See less Education DLSU MBA January 2001  – September 2006 DLSU CS-IT June 1995  – September 1999 De La Salle University BSCS 1995  – 1999 Southridge 1995 1991  – 1995 DLSU MBA January 2001  – September 2006 DLSU MBA January 2001  – September 2006 DLSU MBA January 2001  – September 2006 DLSU CS-IT June 1995  – September 1999 DLSU CS-IT June 1995  – September 1999 DLSU CS-IT June 1995  – September 1999 De La Salle University BSCS 1995  – 1999 De La Salle University BSCS 1995  – 1999 De La Salle University BSCS 1995  – 1999 Southridge 1995 1991  – 1995 Southridge 1995 1991  – 1995 Southridge 1995 1991  – 1995 ", "Languages English Full professional proficiency German Native or bilingual proficiency French Limited working proficiency Dutch Limited working proficiency English Full professional proficiency German Native or bilingual proficiency French Limited working proficiency Dutch Limited working proficiency English Full professional proficiency German Native or bilingual proficiency French Limited working proficiency Dutch Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills GIS Data Analysis Quality Assurance Product Management Data Quality Urban Economics Agile Project Management Digital Mapping SQL Network Analysis Spatial Analysis Geomatics Databases Location Based Services Geography Software Development Circuit Analysis Cloud Computing SaaS Enterprise Software See 5+     See less Skills  GIS Data Analysis Quality Assurance Product Management Data Quality Urban Economics Agile Project Management Digital Mapping SQL Network Analysis Spatial Analysis Geomatics Databases Location Based Services Geography Software Development Circuit Analysis Cloud Computing SaaS Enterprise Software See 5+     See less GIS Data Analysis Quality Assurance Product Management Data Quality Urban Economics Agile Project Management Digital Mapping SQL Network Analysis Spatial Analysis Geomatics Databases Location Based Services Geography Software Development Circuit Analysis Cloud Computing SaaS Enterprise Software See 5+     See less GIS Data Analysis Quality Assurance Product Management Data Quality Urban Economics Agile Project Management Digital Mapping SQL Network Analysis Spatial Analysis Geomatics Databases Location Based Services Geography Software Development Circuit Analysis Cloud Computing SaaS Enterprise Software See 5+     See less Honors & Awards ", "Summary Before jumping into the world of SAS technical sales I was an engineer with IBM and a sales specialist with EMC. Today, I am a Sales Engineer with Google helping customers work the way they live with Google's innovative Google for Work products. I have spent the last 10 years in IT either designing or selling today’s data demands, working with companies from 10 employees to 10,000+. Through consultative efforts I help my customers reduce their IT expenditures, increase performance levels and lower overall risk of data loss. Summary Before jumping into the world of SAS technical sales I was an engineer with IBM and a sales specialist with EMC. Today, I am a Sales Engineer with Google helping customers work the way they live with Google's innovative Google for Work products. I have spent the last 10 years in IT either designing or selling today’s data demands, working with companies from 10 employees to 10,000+. Through consultative efforts I help my customers reduce their IT expenditures, increase performance levels and lower overall risk of data loss. Before jumping into the world of SAS technical sales I was an engineer with IBM and a sales specialist with EMC. Today, I am a Sales Engineer with Google helping customers work the way they live with Google's innovative Google for Work products. I have spent the last 10 years in IT either designing or selling today’s data demands, working with companies from 10 employees to 10,000+. Through consultative efforts I help my customers reduce their IT expenditures, increase performance levels and lower overall risk of data loss. Before jumping into the world of SAS technical sales I was an engineer with IBM and a sales specialist with EMC. Today, I am a Sales Engineer with Google helping customers work the way they live with Google's innovative Google for Work products. I have spent the last 10 years in IT either designing or selling today’s data demands, working with companies from 10 employees to 10,000+. Through consultative efforts I help my customers reduce their IT expenditures, increase performance levels and lower overall risk of data loss. Experience Sales Engineer, Google for Work Google October 2014  – Present (11 months) Cambridge, MA Sales Specialist, Web Inbound Social Media EMC January 2013  –  October 2014  (1 year 10 months) Franklin, MA Corporate Account Manager, North Carolina EMC October 2011  –  January 2013  (1 year 4 months) Greater Boston Area Partner Specialized Account Manager EMC April 2011  –  September 2011  (6 months) Tempe Sole EMC employee located at direct reseller’s facility as the dedicated resource and subject matter expert on entire EMC product line supporting all North American sales operations. Sales Associate EMC August 2010  –  April 2011  (9 months) Greater Boston Area Software Engineer IBM May 2005  –  March 2010  (4 years 11 months) Tucson, Arizona Area Sales Engineer, Google for Work Google October 2014  – Present (11 months) Cambridge, MA Sales Engineer, Google for Work Google October 2014  – Present (11 months) Cambridge, MA Sales Specialist, Web Inbound Social Media EMC January 2013  –  October 2014  (1 year 10 months) Franklin, MA Sales Specialist, Web Inbound Social Media EMC January 2013  –  October 2014  (1 year 10 months) Franklin, MA Corporate Account Manager, North Carolina EMC October 2011  –  January 2013  (1 year 4 months) Greater Boston Area Corporate Account Manager, North Carolina EMC October 2011  –  January 2013  (1 year 4 months) Greater Boston Area Partner Specialized Account Manager EMC April 2011  –  September 2011  (6 months) Tempe Sole EMC employee located at direct reseller’s facility as the dedicated resource and subject matter expert on entire EMC product line supporting all North American sales operations. Partner Specialized Account Manager EMC April 2011  –  September 2011  (6 months) Tempe Sole EMC employee located at direct reseller’s facility as the dedicated resource and subject matter expert on entire EMC product line supporting all North American sales operations. Sales Associate EMC August 2010  –  April 2011  (9 months) Greater Boston Area Sales Associate EMC August 2010  –  April 2011  (9 months) Greater Boston Area Software Engineer IBM May 2005  –  March 2010  (4 years 11 months) Tucson, Arizona Area Software Engineer IBM May 2005  –  March 2010  (4 years 11 months) Tucson, Arizona Area Skills Management Leadership Sales Social Media Sales Operations Storage Virtualization Information Technology EMC Storage Partnering Enterprise Software Salesforce.com Solution Selling Data Center SaaS Professional Services Cloud Computing Storage Area Networks Selling Channel Partners Storage Solutions Pre-sales See 7+     See less Skills  Management Leadership Sales Social Media Sales Operations Storage Virtualization Information Technology EMC Storage Partnering Enterprise Software Salesforce.com Solution Selling Data Center SaaS Professional Services Cloud Computing Storage Area Networks Selling Channel Partners Storage Solutions Pre-sales See 7+     See less Management Leadership Sales Social Media Sales Operations Storage Virtualization Information Technology EMC Storage Partnering Enterprise Software Salesforce.com Solution Selling Data Center SaaS Professional Services Cloud Computing Storage Area Networks Selling Channel Partners Storage Solutions Pre-sales See 7+     See less Management Leadership Sales Social Media Sales Operations Storage Virtualization Information Technology EMC Storage Partnering Enterprise Software Salesforce.com Solution Selling Data Center SaaS Professional Services Cloud Computing Storage Area Networks Selling Channel Partners Storage Solutions Pre-sales See 7+     See less Education University of Arizona, Eller College of Management MBA,  MBA 2010 University of Arizona B.S.,  Computer Engineering Activities and Societies:  Sigma Kappa\nEngineering Ambassadors University of Arizona, Eller College of Management MBA,  MBA 2010 University of Arizona, Eller College of Management MBA,  MBA 2010 University of Arizona, Eller College of Management MBA,  MBA 2010 University of Arizona B.S.,  Computer Engineering Activities and Societies:  Sigma Kappa\nEngineering Ambassadors University of Arizona B.S.,  Computer Engineering Activities and Societies:  Sigma Kappa\nEngineering Ambassadors University of Arizona B.S.,  Computer Engineering Activities and Societies:  Sigma Kappa\nEngineering Ambassadors ", "Experience Sales Engineer, Google for Work Google October 2014  – Present (11 months) Sales Engineer, Google for Work Google October 2014  – Present (11 months) Sales Engineer, Google for Work Google October 2014  – Present (11 months) Skills Telecommunications Wireless Wireline Project Management Program Management Business Planning Contract Management Contract Negotiation Mobile Commerce Mobile Advertising Mobile Applications Fixed Mobile Convergence Team Management Business Development Pre-sales Strategy Leadership UMTS PMO Cloud Computing SaaS See 6+     See less Skills  Telecommunications Wireless Wireline Project Management Program Management Business Planning Contract Management Contract Negotiation Mobile Commerce Mobile Advertising Mobile Applications Fixed Mobile Convergence Team Management Business Development Pre-sales Strategy Leadership UMTS PMO Cloud Computing SaaS See 6+     See less Telecommunications Wireless Wireline Project Management Program Management Business Planning Contract Management Contract Negotiation Mobile Commerce Mobile Advertising Mobile Applications Fixed Mobile Convergence Team Management Business Development Pre-sales Strategy Leadership UMTS PMO Cloud Computing SaaS See 6+     See less Telecommunications Wireless Wireline Project Management Program Management Business Planning Contract Management Contract Negotiation Mobile Commerce Mobile Advertising Mobile Applications Fixed Mobile Convergence Team Management Business Development Pre-sales Strategy Leadership UMTS PMO Cloud Computing SaaS See 6+     See less ", "Experience Google for Work :: Sales Engineer Google January 2013  – Present (2 years 8 months) Melbourne Area, Australia Senior WebCenter Sales Consultant Oracle September 2010  –  January 2013  (2 years 5 months) Melbourne Area, Australia WebCenter Content, Portal, Sites, Social Network Senior WebCenter Consultant Oracle January 2008  –  October 2010  (2 years 10 months) Australia OCS Technology - ECM Specialist \nURM, CS, WCM, IBR, ODC, AutoVue Managed Service Support Officer TSA Software Solutions Pty Ltd. April 2007  –  December 2007  (9 months) CAAB Call Accounting hosted application management \nMS SQL Server 2005 DBA Google for Work :: Sales Engineer Google January 2013  – Present (2 years 8 months) Melbourne Area, Australia Google for Work :: Sales Engineer Google January 2013  – Present (2 years 8 months) Melbourne Area, Australia Senior WebCenter Sales Consultant Oracle September 2010  –  January 2013  (2 years 5 months) Melbourne Area, Australia WebCenter Content, Portal, Sites, Social Network Senior WebCenter Sales Consultant Oracle September 2010  –  January 2013  (2 years 5 months) Melbourne Area, Australia WebCenter Content, Portal, Sites, Social Network Senior WebCenter Consultant Oracle January 2008  –  October 2010  (2 years 10 months) Australia OCS Technology - ECM Specialist \nURM, CS, WCM, IBR, ODC, AutoVue Senior WebCenter Consultant Oracle January 2008  –  October 2010  (2 years 10 months) Australia OCS Technology - ECM Specialist \nURM, CS, WCM, IBR, ODC, AutoVue Managed Service Support Officer TSA Software Solutions Pty Ltd. April 2007  –  December 2007  (9 months) CAAB Call Accounting hosted application management \nMS SQL Server 2005 DBA Managed Service Support Officer TSA Software Solutions Pty Ltd. April 2007  –  December 2007  (9 months) CAAB Call Accounting hosted application management \nMS SQL Server 2005 DBA Languages English Native or bilingual proficiency Hungarian Native or bilingual proficiency English Native or bilingual proficiency Hungarian Native or bilingual proficiency English Native or bilingual proficiency Hungarian Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Solution Architecture Pre-sales Business Analysis Enterprise Architecture SOA Requirements Analysis Business Intelligence Integration IT Strategy Oracle Weblogic Content Management Web Content Online Social Networking Consulting Accounts Payable Mashups ADF Technical Architecture See 4+     See less Skills  Solution Architecture Pre-sales Business Analysis Enterprise Architecture SOA Requirements Analysis Business Intelligence Integration IT Strategy Oracle Weblogic Content Management Web Content Online Social Networking Consulting Accounts Payable Mashups ADF Technical Architecture See 4+     See less Solution Architecture Pre-sales Business Analysis Enterprise Architecture SOA Requirements Analysis Business Intelligence Integration IT Strategy Oracle Weblogic Content Management Web Content Online Social Networking Consulting Accounts Payable Mashups ADF Technical Architecture See 4+     See less Solution Architecture Pre-sales Business Analysis Enterprise Architecture SOA Requirements Analysis Business Intelligence Integration IT Strategy Oracle Weblogic Content Management Web Content Online Social Networking Consulting Accounts Payable Mashups ADF Technical Architecture See 4+     See less Education The University of Queensland Bachelor of Business Management,  eBusiness , IT 2003  – 2006 Activities and Societies:  Active in UQ/College Sporting Clubs (swim ,  polo ,  rowing ,  running) Australian College of Information Technology Cert IV in IT,  Network Management 2005  – 2006 Microsoft Certified System Administrator course (Windows 2003 infrastructure) The University of Queensland Bachelor of Business Management,  eBusiness , IT 2003  – 2006 Activities and Societies:  Active in UQ/College Sporting Clubs (swim ,  polo ,  rowing ,  running) The University of Queensland Bachelor of Business Management,  eBusiness , IT 2003  – 2006 Activities and Societies:  Active in UQ/College Sporting Clubs (swim ,  polo ,  rowing ,  running) The University of Queensland Bachelor of Business Management,  eBusiness , IT 2003  – 2006 Activities and Societies:  Active in UQ/College Sporting Clubs (swim ,  polo ,  rowing ,  running) Australian College of Information Technology Cert IV in IT,  Network Management 2005  – 2006 Microsoft Certified System Administrator course (Windows 2003 infrastructure) Australian College of Information Technology Cert IV in IT,  Network Management 2005  – 2006 Microsoft Certified System Administrator course (Windows 2003 infrastructure) Australian College of Information Technology Cert IV in IT,  Network Management 2005  – 2006 Microsoft Certified System Administrator course (Windows 2003 infrastructure) Honors & Awards Oracle FY12 Product Specialist Solution Consultant Oracle ANZ June 2012 Awarded by Oracle Senior Vice President & ANZ General Manager, Ian White Oracle FY12 Product Specialist Solution Consultant Oracle APAC Solution Consulting June 2012 Awarded by Oracle Senior Vice President, OFM, APAC, Steve Ng Oracle Quarterly Product Specialist Solution Consultant Oracle ANZ OFM FY11 Q3, Q4 \nFY12 Q1, Q2 Oracle FY12 Product Specialist Solution Consultant Oracle ANZ June 2012 Awarded by Oracle Senior Vice President & ANZ General Manager, Ian White Oracle FY12 Product Specialist Solution Consultant Oracle ANZ June 2012 Awarded by Oracle Senior Vice President & ANZ General Manager, Ian White Oracle FY12 Product Specialist Solution Consultant Oracle ANZ June 2012 Awarded by Oracle Senior Vice President & ANZ General Manager, Ian White Oracle FY12 Product Specialist Solution Consultant Oracle APAC Solution Consulting June 2012 Awarded by Oracle Senior Vice President, OFM, APAC, Steve Ng Oracle FY12 Product Specialist Solution Consultant Oracle APAC Solution Consulting June 2012 Awarded by Oracle Senior Vice President, OFM, APAC, Steve Ng Oracle FY12 Product Specialist Solution Consultant Oracle APAC Solution Consulting June 2012 Awarded by Oracle Senior Vice President, OFM, APAC, Steve Ng Oracle Quarterly Product Specialist Solution Consultant Oracle ANZ OFM FY11 Q3, Q4 \nFY12 Q1, Q2 Oracle Quarterly Product Specialist Solution Consultant Oracle ANZ OFM FY11 Q3, Q4 \nFY12 Q1, Q2 Oracle Quarterly Product Specialist Solution Consultant Oracle ANZ OFM FY11 Q3, Q4 \nFY12 Q1, Q2 ", "Experience Google for Work Google January 2007  – Present (8 years 8 months) Roppongi Hills Enterprise Sales Engineer Google January 2007  – Present (8 years 8 months) Sales Engineer BEA Systems January 2001  –  November 2006  (5 years 11 months) Google for Work Google January 2007  – Present (8 years 8 months) Roppongi Hills Google for Work Google January 2007  – Present (8 years 8 months) Roppongi Hills Enterprise Sales Engineer Google January 2007  – Present (8 years 8 months) Enterprise Sales Engineer Google January 2007  – Present (8 years 8 months) Sales Engineer BEA Systems January 2001  –  November 2006  (5 years 11 months) Sales Engineer BEA Systems January 2001  –  November 2006  (5 years 11 months) Skills Salesforce.com Enterprise Software Product Management Mobile Devices Web Analytics Solution Selling Google Apps Digital Marketing Strategic Partnerships Online Advertising Product Marketing Data Center Analytics Digital Media Account Management Skills  Salesforce.com Enterprise Software Product Management Mobile Devices Web Analytics Solution Selling Google Apps Digital Marketing Strategic Partnerships Online Advertising Product Marketing Data Center Analytics Digital Media Account Management Salesforce.com Enterprise Software Product Management Mobile Devices Web Analytics Solution Selling Google Apps Digital Marketing Strategic Partnerships Online Advertising Product Marketing Data Center Analytics Digital Media Account Management Salesforce.com Enterprise Software Product Management Mobile Devices Web Analytics Solution Selling Google Apps Digital Marketing Strategic Partnerships Online Advertising Product Marketing Data Center Analytics Digital Media Account Management Education 明治大学 政治学科,  政経学部 1993  – 1996 明治大学 政治学科,  政経学部 1993  – 1996 明治大学 政治学科,  政経学部 1993  – 1996 明治大学 政治学科,  政経学部 1993  – 1996 ", "Summary In my 5th year in the Sales Engineering team of Japan's Google Enterprise (now called \"Google for Work\") organization, with a strong belief that public cloud computing stack with devices and services that just works, well known, and used in everybody's personal life is what should be the core for people's work life too. \n Summary In my 5th year in the Sales Engineering team of Japan's Google Enterprise (now called \"Google for Work\") organization, with a strong belief that public cloud computing stack with devices and services that just works, well known, and used in everybody's personal life is what should be the core for people's work life too. \n In my 5th year in the Sales Engineering team of Japan's Google Enterprise (now called \"Google for Work\") organization, with a strong belief that public cloud computing stack with devices and services that just works, well known, and used in everybody's personal life is what should be the core for people's work life too. \n In my 5th year in the Sales Engineering team of Japan's Google Enterprise (now called \"Google for Work\") organization, with a strong belief that public cloud computing stack with devices and services that just works, well known, and used in everybody's personal life is what should be the core for people's work life too. \n Experience Sales Engineer, Google Cloud Platform Google April 2015  – Present (5 months) Within 23 wards, Tokyo, Japan Sales Engineer (pre-sales) dedicated to \"Google Cloud Platform\", which is a suite of Google's technologies including products such as \"Google App Engine\", \"Google Compute Engine\", \"Google Cloud Storage\", \"Google BigQuery\", etc. \n Head of Sales Engineering - Japan, Google for Work (Enterprise) Google October 2012  –  March 2015  (2 years 6 months) Within 23 wards, Tokyo, Japan Sales Engineer, Google for Work (Enterprise) Google March 2011  –  March 2015  (4 years 1 month) Within 23 wards, Tokyo, Japan Collaboration Evangelist IBM September 2007  –  March 2011  (3 years 7 months) Within 23 wards, Tokyo, Japan Technical Sales for Lotus Software IBM April 2006  –  March 2011  (5 years) Within 23 wards, Tokyo, Japan Technical Sales for WebSphere software IBM April 2003  –  March 2006  (3 years) Within 23 wards, Tokyo, Japan Technical Sales for Voice IBM April 2001  –  March 2003  (2 years) Within 23 wards, Tokyo, Japan Sales Engineer, Google Cloud Platform Google April 2015  – Present (5 months) Within 23 wards, Tokyo, Japan Sales Engineer (pre-sales) dedicated to \"Google Cloud Platform\", which is a suite of Google's technologies including products such as \"Google App Engine\", \"Google Compute Engine\", \"Google Cloud Storage\", \"Google BigQuery\", etc. \n Sales Engineer, Google Cloud Platform Google April 2015  – Present (5 months) Within 23 wards, Tokyo, Japan Sales Engineer (pre-sales) dedicated to \"Google Cloud Platform\", which is a suite of Google's technologies including products such as \"Google App Engine\", \"Google Compute Engine\", \"Google Cloud Storage\", \"Google BigQuery\", etc. \n Head of Sales Engineering - Japan, Google for Work (Enterprise) Google October 2012  –  March 2015  (2 years 6 months) Within 23 wards, Tokyo, Japan Head of Sales Engineering - Japan, Google for Work (Enterprise) Google October 2012  –  March 2015  (2 years 6 months) Within 23 wards, Tokyo, Japan Sales Engineer, Google for Work (Enterprise) Google March 2011  –  March 2015  (4 years 1 month) Within 23 wards, Tokyo, Japan Sales Engineer, Google for Work (Enterprise) Google March 2011  –  March 2015  (4 years 1 month) Within 23 wards, Tokyo, Japan Collaboration Evangelist IBM September 2007  –  March 2011  (3 years 7 months) Within 23 wards, Tokyo, Japan Collaboration Evangelist IBM September 2007  –  March 2011  (3 years 7 months) Within 23 wards, Tokyo, Japan Technical Sales for Lotus Software IBM April 2006  –  March 2011  (5 years) Within 23 wards, Tokyo, Japan Technical Sales for Lotus Software IBM April 2006  –  March 2011  (5 years) Within 23 wards, Tokyo, Japan Technical Sales for WebSphere software IBM April 2003  –  March 2006  (3 years) Within 23 wards, Tokyo, Japan Technical Sales for WebSphere software IBM April 2003  –  March 2006  (3 years) Within 23 wards, Tokyo, Japan Technical Sales for Voice IBM April 2001  –  March 2003  (2 years) Within 23 wards, Tokyo, Japan Technical Sales for Voice IBM April 2001  –  March 2003  (2 years) Within 23 wards, Tokyo, Japan Languages English Full professional proficiency Japanese Native or bilingual proficiency English Full professional proficiency Japanese Native or bilingual proficiency English Full professional proficiency Japanese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Cloud Computing Pre-sales Eclipse Social Software Java XML SaaS OSGi Mashups J2EE Enterprise Software Java Enterprise Edition Google Apps Google App Engine Google Maps Google Docs Google Earth Web 2.0 Enterprise Architecture CRM WebSphere Application... See 6+     See less Skills  Cloud Computing Pre-sales Eclipse Social Software Java XML SaaS OSGi Mashups J2EE Enterprise Software Java Enterprise Edition Google Apps Google App Engine Google Maps Google Docs Google Earth Web 2.0 Enterprise Architecture CRM WebSphere Application... See 6+     See less Cloud Computing Pre-sales Eclipse Social Software Java XML SaaS OSGi Mashups J2EE Enterprise Software Java Enterprise Edition Google Apps Google App Engine Google Maps Google Docs Google Earth Web 2.0 Enterprise Architecture CRM WebSphere Application... See 6+     See less Cloud Computing Pre-sales Eclipse Social Software Java XML SaaS OSGi Mashups J2EE Enterprise Software Java Enterprise Edition Google Apps Google App Engine Google Maps Google Docs Google Earth Web 2.0 Enterprise Architecture CRM WebSphere Application... See 6+     See less Education Tokyo Institute of Technology Master 1999  – 2001 Tokyo Institute of Technology Bachelor 1995  – 1999 Tokyo Institute of Technology Master 1999  – 2001 Tokyo Institute of Technology Master 1999  – 2001 Tokyo Institute of Technology Master 1999  – 2001 Tokyo Institute of Technology Bachelor 1995  – 1999 Tokyo Institute of Technology Bachelor 1995  – 1999 Tokyo Institute of Technology Bachelor 1995  – 1999 ", "Experience Google Apps for Work Sales Engineer Google January 2013  – Present (2 years 8 months) Mountain View, CA Google Apps for Work Sales Engineer Google January 2013  – Present (2 years 8 months) Mountain View, CA Google Apps for Work Sales Engineer Google January 2013  – Present (2 years 8 months) Mountain View, CA Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Honors & Awards ", "Experience Google for Work - Sales Engineer Google October 2012  – Present (2 years 11 months) Greater Boston Area Google for Work - Sales Engineer Google October 2012  – Present (2 years 11 months) Greater Boston Area Google for Work - Sales Engineer Google October 2012  – Present (2 years 11 months) Greater Boston Area Skills SaaS Microsoft Technologies Solution Selling Channel Cloud Computing Collaboration Solutions Enterprise Software Professional Services Sales Enablement Unified Communications Skills  SaaS Microsoft Technologies Solution Selling Channel Cloud Computing Collaboration Solutions Enterprise Software Professional Services Sales Enablement Unified Communications SaaS Microsoft Technologies Solution Selling Channel Cloud Computing Collaboration Solutions Enterprise Software Professional Services Sales Enablement Unified Communications SaaS Microsoft Technologies Solution Selling Channel Cloud Computing Collaboration Solutions Enterprise Software Professional Services Sales Enablement Unified Communications ", "Experience Google for Work Sales Engineer Google May 2013  – Present (2 years 4 months) Help customers realize business value, enhanced productivity and reduced costs through the use of enterprise grade cloud-based solutions Lync Technology Specialist Microsoft July 2011  –  May 2013  (1 year 11 months) Mapped Microsoft products (particularly Lync) to customer business requirements. Increased product revenue and expanded the Microsoft customer base by providing optimal value to customers \n \nAnalyzed customer data to develop optimal sales strategies. Consistently delivered sales results and attained over 110% of revenue quota in four of five years. Achieved membership in the 125% club for revenue attainment in Fiscal Years 2008 and 2009 while working in Incubation Sales \n \nConducted executive briefings, customer presentations and product demonstrations to promote the Microsoft Unified Communications vision. Alleviated technical sales obstacles and demonstrated the ability of Microsoft products to enhance business value for the customer \n \nLed Architectural Design Sessions and Proof of Concept engagements covering Instant Messaging, Audio/Video/Web conferencing, Enterprise Voice and Exchange Unified Messaging designed to educate customers and identify customer requirements, technical constraints and workarounds. These sessions also served to introduce partner resources and to accelerate customer deployments \n \nProvided training, demonstrations and expertise to Microsoft professionals. Chosen to present communications-enabled business process strategies at five successive bi-annual Microsoft employee conferences. Selected to become a member of the UC/Lync Insiders group comprised of handpicked Microsoft subject matter experts from around the globe \n \nEngaged with customers to discuss the business value and agility gained through use of Unified Communications technologies in the new paradigm of blended Contact Centers UC Technology Specialist Microsoft August 2009  –  June 2011  (1 year 11 months) See above Voice Technology Specialist Microsoft Corporation November 2007  –  July 2009  (1 year 9 months) See above Engineering Manager, Commercial Service Delivery Apptis April 2006  –  October 2007  (1 year 7 months) Managed and developed a highly successful team of high-end Cisco IP Telephony engineers used to deploy the solutions sold by the Apptis sales organization. Improved profitability and customer satisfaction through standardized usage of a project delivery methodology and operating procedures. Provided quality control and guidance by directing executive-level customer meetings to sign off on project deliverables and success criteria \n \nEnhanced staff retention rates significantly by emphasizing staff development through personalized training plans, LAB development, teaming approach and mentoring Consultant Naval Research Laboratory April 2002  –  March 2006  (4 years) On behalf of the Force Protection Emergency Response Test Lab combined existing technologies across NRL to improve operations of public safety organizations (such as Department of Homeland Security & Fire Department of New York). Published technology reports to educate NRL staff, external agencies and members of the Public Safety user community \n \nLed the Test & Validation team as part of an 18 month program to design and test all of the communications components between a helicopter, armored vehicle and Humvee using a converged IP backbone. This culminated in a highly successful Limited User Evaluation (LUE) at New River Air Station, North Carolina \n \nLed a year-long project to outfit a mobile command center vehicle with wireless, networking, satellite, video streaming and VoIP capabilities for the Office of Emergency Management and Communications (OEMC) in Chicago. This vehicle as well as others were put into operation and improved the OEMC’s response capabilities significantly EVP Technology BurningTree Technologies Inc. June 1999  –  March 2002  (2 years 10 months) Partnered with the executive team to create the company business plan, secure funding, negotiate contacts and develop sales and marketing. Played a key role in cash flow and staffing decisions  \n \nProvided project oversight and contributed as Principal Engineer in support of BurningTree engagements. Created and staffed the technical department, established in-house training, created a certification lab and led the creation and management of multiple service offerings subscribed to by customers Senior Network Engineer & Team Lead Gray Peak Technologies July 1997  –  June 1999  (2 years) Acted as the design authority for the network portion of the Concert Retail VoIP service and led the study, analysis, design, deployment and management of Concert Dialup services  \nPerformed a Capabilities Maturity Model assessment for Digital Ink (Washingtonpost.com) Deputy Director of Technical Services U.S. Holocaust Memorial Museum 1994  –  1997  (3 years) Customer Systems Representative Olivetti Africa September 1990  –  December 1993  (3 years 4 months) Johannesburg Area, South Africa Sales Manager Hypercomputers Cc. August 1990  –  August 1991  (1 year 1 month) Johannesburg Area, South Africa Technical Specialist Allied Building Society June 1984  –  July 1986  (2 years 2 months) Johannesburg Area, South Africa Google for Work Sales Engineer Google May 2013  – Present (2 years 4 months) Help customers realize business value, enhanced productivity and reduced costs through the use of enterprise grade cloud-based solutions Google for Work Sales Engineer Google May 2013  – Present (2 years 4 months) Help customers realize business value, enhanced productivity and reduced costs through the use of enterprise grade cloud-based solutions Lync Technology Specialist Microsoft July 2011  –  May 2013  (1 year 11 months) Mapped Microsoft products (particularly Lync) to customer business requirements. Increased product revenue and expanded the Microsoft customer base by providing optimal value to customers \n \nAnalyzed customer data to develop optimal sales strategies. Consistently delivered sales results and attained over 110% of revenue quota in four of five years. Achieved membership in the 125% club for revenue attainment in Fiscal Years 2008 and 2009 while working in Incubation Sales \n \nConducted executive briefings, customer presentations and product demonstrations to promote the Microsoft Unified Communications vision. Alleviated technical sales obstacles and demonstrated the ability of Microsoft products to enhance business value for the customer \n \nLed Architectural Design Sessions and Proof of Concept engagements covering Instant Messaging, Audio/Video/Web conferencing, Enterprise Voice and Exchange Unified Messaging designed to educate customers and identify customer requirements, technical constraints and workarounds. These sessions also served to introduce partner resources and to accelerate customer deployments \n \nProvided training, demonstrations and expertise to Microsoft professionals. Chosen to present communications-enabled business process strategies at five successive bi-annual Microsoft employee conferences. Selected to become a member of the UC/Lync Insiders group comprised of handpicked Microsoft subject matter experts from around the globe \n \nEngaged with customers to discuss the business value and agility gained through use of Unified Communications technologies in the new paradigm of blended Contact Centers Lync Technology Specialist Microsoft July 2011  –  May 2013  (1 year 11 months) Mapped Microsoft products (particularly Lync) to customer business requirements. Increased product revenue and expanded the Microsoft customer base by providing optimal value to customers \n \nAnalyzed customer data to develop optimal sales strategies. Consistently delivered sales results and attained over 110% of revenue quota in four of five years. Achieved membership in the 125% club for revenue attainment in Fiscal Years 2008 and 2009 while working in Incubation Sales \n \nConducted executive briefings, customer presentations and product demonstrations to promote the Microsoft Unified Communications vision. Alleviated technical sales obstacles and demonstrated the ability of Microsoft products to enhance business value for the customer \n \nLed Architectural Design Sessions and Proof of Concept engagements covering Instant Messaging, Audio/Video/Web conferencing, Enterprise Voice and Exchange Unified Messaging designed to educate customers and identify customer requirements, technical constraints and workarounds. These sessions also served to introduce partner resources and to accelerate customer deployments \n \nProvided training, demonstrations and expertise to Microsoft professionals. Chosen to present communications-enabled business process strategies at five successive bi-annual Microsoft employee conferences. Selected to become a member of the UC/Lync Insiders group comprised of handpicked Microsoft subject matter experts from around the globe \n \nEngaged with customers to discuss the business value and agility gained through use of Unified Communications technologies in the new paradigm of blended Contact Centers UC Technology Specialist Microsoft August 2009  –  June 2011  (1 year 11 months) See above UC Technology Specialist Microsoft August 2009  –  June 2011  (1 year 11 months) See above Voice Technology Specialist Microsoft Corporation November 2007  –  July 2009  (1 year 9 months) See above Voice Technology Specialist Microsoft Corporation November 2007  –  July 2009  (1 year 9 months) See above Engineering Manager, Commercial Service Delivery Apptis April 2006  –  October 2007  (1 year 7 months) Managed and developed a highly successful team of high-end Cisco IP Telephony engineers used to deploy the solutions sold by the Apptis sales organization. Improved profitability and customer satisfaction through standardized usage of a project delivery methodology and operating procedures. Provided quality control and guidance by directing executive-level customer meetings to sign off on project deliverables and success criteria \n \nEnhanced staff retention rates significantly by emphasizing staff development through personalized training plans, LAB development, teaming approach and mentoring Engineering Manager, Commercial Service Delivery Apptis April 2006  –  October 2007  (1 year 7 months) Managed and developed a highly successful team of high-end Cisco IP Telephony engineers used to deploy the solutions sold by the Apptis sales organization. Improved profitability and customer satisfaction through standardized usage of a project delivery methodology and operating procedures. Provided quality control and guidance by directing executive-level customer meetings to sign off on project deliverables and success criteria \n \nEnhanced staff retention rates significantly by emphasizing staff development through personalized training plans, LAB development, teaming approach and mentoring Consultant Naval Research Laboratory April 2002  –  March 2006  (4 years) On behalf of the Force Protection Emergency Response Test Lab combined existing technologies across NRL to improve operations of public safety organizations (such as Department of Homeland Security & Fire Department of New York). Published technology reports to educate NRL staff, external agencies and members of the Public Safety user community \n \nLed the Test & Validation team as part of an 18 month program to design and test all of the communications components between a helicopter, armored vehicle and Humvee using a converged IP backbone. This culminated in a highly successful Limited User Evaluation (LUE) at New River Air Station, North Carolina \n \nLed a year-long project to outfit a mobile command center vehicle with wireless, networking, satellite, video streaming and VoIP capabilities for the Office of Emergency Management and Communications (OEMC) in Chicago. This vehicle as well as others were put into operation and improved the OEMC’s response capabilities significantly Consultant Naval Research Laboratory April 2002  –  March 2006  (4 years) On behalf of the Force Protection Emergency Response Test Lab combined existing technologies across NRL to improve operations of public safety organizations (such as Department of Homeland Security & Fire Department of New York). Published technology reports to educate NRL staff, external agencies and members of the Public Safety user community \n \nLed the Test & Validation team as part of an 18 month program to design and test all of the communications components between a helicopter, armored vehicle and Humvee using a converged IP backbone. This culminated in a highly successful Limited User Evaluation (LUE) at New River Air Station, North Carolina \n \nLed a year-long project to outfit a mobile command center vehicle with wireless, networking, satellite, video streaming and VoIP capabilities for the Office of Emergency Management and Communications (OEMC) in Chicago. This vehicle as well as others were put into operation and improved the OEMC’s response capabilities significantly EVP Technology BurningTree Technologies Inc. June 1999  –  March 2002  (2 years 10 months) Partnered with the executive team to create the company business plan, secure funding, negotiate contacts and develop sales and marketing. Played a key role in cash flow and staffing decisions  \n \nProvided project oversight and contributed as Principal Engineer in support of BurningTree engagements. Created and staffed the technical department, established in-house training, created a certification lab and led the creation and management of multiple service offerings subscribed to by customers EVP Technology BurningTree Technologies Inc. June 1999  –  March 2002  (2 years 10 months) Partnered with the executive team to create the company business plan, secure funding, negotiate contacts and develop sales and marketing. Played a key role in cash flow and staffing decisions  \n \nProvided project oversight and contributed as Principal Engineer in support of BurningTree engagements. Created and staffed the technical department, established in-house training, created a certification lab and led the creation and management of multiple service offerings subscribed to by customers Senior Network Engineer & Team Lead Gray Peak Technologies July 1997  –  June 1999  (2 years) Acted as the design authority for the network portion of the Concert Retail VoIP service and led the study, analysis, design, deployment and management of Concert Dialup services  \nPerformed a Capabilities Maturity Model assessment for Digital Ink (Washingtonpost.com) Senior Network Engineer & Team Lead Gray Peak Technologies July 1997  –  June 1999  (2 years) Acted as the design authority for the network portion of the Concert Retail VoIP service and led the study, analysis, design, deployment and management of Concert Dialup services  \nPerformed a Capabilities Maturity Model assessment for Digital Ink (Washingtonpost.com) Deputy Director of Technical Services U.S. Holocaust Memorial Museum 1994  –  1997  (3 years) Deputy Director of Technical Services U.S. Holocaust Memorial Museum 1994  –  1997  (3 years) Customer Systems Representative Olivetti Africa September 1990  –  December 1993  (3 years 4 months) Johannesburg Area, South Africa Customer Systems Representative Olivetti Africa September 1990  –  December 1993  (3 years 4 months) Johannesburg Area, South Africa Sales Manager Hypercomputers Cc. August 1990  –  August 1991  (1 year 1 month) Johannesburg Area, South Africa Sales Manager Hypercomputers Cc. August 1990  –  August 1991  (1 year 1 month) Johannesburg Area, South Africa Technical Specialist Allied Building Society June 1984  –  July 1986  (2 years 2 months) Johannesburg Area, South Africa Technical Specialist Allied Building Society June 1984  –  July 1986  (2 years 2 months) Johannesburg Area, South Africa Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Unified Communications Communications Enabled... Lync Server 2010 Exchange Server 2010 IP Telephony VoIP Mobility UCMA Cisco Networking Lync Server 2013 Office Communications... Windows 8 System Administration Cloud Computing IT Operations Windows Azure Cluster Microsoft Technologies Unified Messaging Microsoft Exchange Telephony SharePoint Exchange 2010/2007/2003 Active Directory SIP Video Conferencing Media Gateways Messaging TR/87 CTI Workflow IP Cisco Technologies SaaS Professional Services Enterprise Software TCP/IP Mobile Computing Network Security Mobile Devices System Deployment Virtualization Hyper-V Networking Lync Data Center Network Architecture Powershell Pre-sales See 34+     See less Skills  Unified Communications Communications Enabled... Lync Server 2010 Exchange Server 2010 IP Telephony VoIP Mobility UCMA Cisco Networking Lync Server 2013 Office Communications... Windows 8 System Administration Cloud Computing IT Operations Windows Azure Cluster Microsoft Technologies Unified Messaging Microsoft Exchange Telephony SharePoint Exchange 2010/2007/2003 Active Directory SIP Video Conferencing Media Gateways Messaging TR/87 CTI Workflow IP Cisco Technologies SaaS Professional Services Enterprise Software TCP/IP Mobile Computing Network Security Mobile Devices System Deployment Virtualization Hyper-V Networking Lync Data Center Network Architecture Powershell Pre-sales See 34+     See less Unified Communications Communications Enabled... Lync Server 2010 Exchange Server 2010 IP Telephony VoIP Mobility UCMA Cisco Networking Lync Server 2013 Office Communications... Windows 8 System Administration Cloud Computing IT Operations Windows Azure Cluster Microsoft Technologies Unified Messaging Microsoft Exchange Telephony SharePoint Exchange 2010/2007/2003 Active Directory SIP Video Conferencing Media Gateways Messaging TR/87 CTI Workflow IP Cisco Technologies SaaS Professional Services Enterprise Software TCP/IP Mobile Computing Network Security Mobile Devices System Deployment Virtualization Hyper-V Networking Lync Data Center Network Architecture Powershell Pre-sales See 34+     See less Unified Communications Communications Enabled... Lync Server 2010 Exchange Server 2010 IP Telephony VoIP Mobility UCMA Cisco Networking Lync Server 2013 Office Communications... Windows 8 System Administration Cloud Computing IT Operations Windows Azure Cluster Microsoft Technologies Unified Messaging Microsoft Exchange Telephony SharePoint Exchange 2010/2007/2003 Active Directory SIP Video Conferencing Media Gateways Messaging TR/87 CTI Workflow IP Cisco Technologies SaaS Professional Services Enterprise Software TCP/IP Mobile Computing Network Security Mobile Devices System Deployment Virtualization Hyper-V Networking Lync Data Center Network Architecture Powershell Pre-sales See 34+     See less Education Univeristy of South Africa (UNISA) BS,  Computer Science & Statistics 1984  – 1988 Control Data Institute Diploma,  Computer Programming 1984  – 1984 Univeristy of South Africa (UNISA) BS,  Computer Science & Statistics 1984  – 1988 Univeristy of South Africa (UNISA) BS,  Computer Science & Statistics 1984  – 1988 Univeristy of South Africa (UNISA) BS,  Computer Science & Statistics 1984  – 1988 Control Data Institute Diploma,  Computer Programming 1984  – 1984 Control Data Institute Diploma,  Computer Programming 1984  – 1984 Control Data Institute Diploma,  Computer Programming 1984  – 1984 ", "Summary Senior Pre Sales Storage Architect HP, Storage Works division. Covering Washington, Oregon, Idaho, Alaska and Hawaii \n \nDirect focus on pre-sales emerging growth accounts. My many years of expertise in the ISP/Web Hosting business with vast experience/expertise in servers, storage, networking, and virtualization concepts allow me to be a broad ranged subject matter expert and consultant in my pre-sales engagements. \n \nI am consistently mentoring and on-boarding new engineers and partners while going beyond customer expectations in each new customer engagement. Specialties:Expertise in SAN Technology, NAS, Disk to Disk Backup, Tape Archive, Servers (Blade and Rackmount), Networking, Unix, and VMware certified professional.  \n \nHP Storage Architect and HP Storage Ambassador providing pre-sales solutions expertise, demonstrations, proof of concept and customer presentations on HP SAN technology, server, and data center virtualiaztion. \n \nHigh closing percentage of account opportunities that I am involved in. Summary Senior Pre Sales Storage Architect HP, Storage Works division. Covering Washington, Oregon, Idaho, Alaska and Hawaii \n \nDirect focus on pre-sales emerging growth accounts. My many years of expertise in the ISP/Web Hosting business with vast experience/expertise in servers, storage, networking, and virtualization concepts allow me to be a broad ranged subject matter expert and consultant in my pre-sales engagements. \n \nI am consistently mentoring and on-boarding new engineers and partners while going beyond customer expectations in each new customer engagement. Specialties:Expertise in SAN Technology, NAS, Disk to Disk Backup, Tape Archive, Servers (Blade and Rackmount), Networking, Unix, and VMware certified professional.  \n \nHP Storage Architect and HP Storage Ambassador providing pre-sales solutions expertise, demonstrations, proof of concept and customer presentations on HP SAN technology, server, and data center virtualiaztion. \n \nHigh closing percentage of account opportunities that I am involved in. Senior Pre Sales Storage Architect HP, Storage Works division. Covering Washington, Oregon, Idaho, Alaska and Hawaii \n \nDirect focus on pre-sales emerging growth accounts. My many years of expertise in the ISP/Web Hosting business with vast experience/expertise in servers, storage, networking, and virtualization concepts allow me to be a broad ranged subject matter expert and consultant in my pre-sales engagements. \n \nI am consistently mentoring and on-boarding new engineers and partners while going beyond customer expectations in each new customer engagement. Specialties:Expertise in SAN Technology, NAS, Disk to Disk Backup, Tape Archive, Servers (Blade and Rackmount), Networking, Unix, and VMware certified professional.  \n \nHP Storage Architect and HP Storage Ambassador providing pre-sales solutions expertise, demonstrations, proof of concept and customer presentations on HP SAN technology, server, and data center virtualiaztion. \n \nHigh closing percentage of account opportunities that I am involved in. Senior Pre Sales Storage Architect HP, Storage Works division. Covering Washington, Oregon, Idaho, Alaska and Hawaii \n \nDirect focus on pre-sales emerging growth accounts. My many years of expertise in the ISP/Web Hosting business with vast experience/expertise in servers, storage, networking, and virtualization concepts allow me to be a broad ranged subject matter expert and consultant in my pre-sales engagements. \n \nI am consistently mentoring and on-boarding new engineers and partners while going beyond customer expectations in each new customer engagement. Specialties:Expertise in SAN Technology, NAS, Disk to Disk Backup, Tape Archive, Servers (Blade and Rackmount), Networking, Unix, and VMware certified professional.  \n \nHP Storage Architect and HP Storage Ambassador providing pre-sales solutions expertise, demonstrations, proof of concept and customer presentations on HP SAN technology, server, and data center virtualiaztion. \n \nHigh closing percentage of account opportunities that I am involved in. Experience Sales Engineer - Google Cloud Platform Google May 2015  – Present (4 months) Mountainview, CA President / Founder B12 Trader Inc November 2014  – Present (10 months) Founder of the B12 Trader Inc. at www.b12trader.com \n \nThe B12 Trader is an educational website teaching working individuals how to beat the market in just 15 minute per day. I teach individuals how to trade after work hours, emotion free, utilizing technical analysis.  \n \nThe site offers an all inclusive training series to teach an investor with any experience level to trade like I do with the goal of 5-15% MONTHLY returns. Also available is a daily stock recommendation service in which I detail every trade I make with in-depth analysis educating my students on how to adapt to the frequent market changes \n \nhttp://www.youtube.com/watch?v=-NdYhUoPmMM Sales Engineer Druva June 2014  –  April 2015  (11 months) Greater Seattle Area Enterprise Sales Engineer covering the Northwest region. My role is to build relationships with prospects, customers and channel partners, delivering presentations and demonstrations to articulate features and differentiators of all Druva Solutions/products, understanding a prospect’s needs and architecting solutions for them, writing proposals and responses to RFP/RFI documents, strategizing with Account Executives to drive sales, configuring/customizing demo solutions at customer locations.  \n \nI also produce video trainings and webinars conducting deep-dive introductions into Druva's Insync Endpoint Backup Solutions and Cloud based backup based on Phoenix. Solutions Architect, HP Storage HP December 2008  –  June 2014  (5 years 7 months) Solutions Architect,HP Storage covering the Northwest and Hawaii. Sales Engineer LeftHand Networks August 2006  –  December 2008  (2 years 5 months) Regional Sales Engineer for the Northwest and Bay Area territories. Technical Operations Manager Nike 2004  –  2006  (2 years) Senior Systems Engineer Infinity Internet January 2002  –  November 2004  (2 years 11 months) Senior Project Engineer Millennium Digital Media January 2001  –  January 2002  (1 year 1 month) Lead project engineer in charge of ISP server consolidation for West Coast operations. Company incorporated as US.net was owned by MDM and purchased in 2002 by Infinity Internet Senior Systems Engineer HiSpeed Technologies 1997  –  2001  (4 years) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Sales Engineer - Google Cloud Platform Google May 2015  – Present (4 months) Mountainview, CA Sales Engineer - Google Cloud Platform Google May 2015  – Present (4 months) Mountainview, CA President / Founder B12 Trader Inc November 2014  – Present (10 months) Founder of the B12 Trader Inc. at www.b12trader.com \n \nThe B12 Trader is an educational website teaching working individuals how to beat the market in just 15 minute per day. I teach individuals how to trade after work hours, emotion free, utilizing technical analysis.  \n \nThe site offers an all inclusive training series to teach an investor with any experience level to trade like I do with the goal of 5-15% MONTHLY returns. Also available is a daily stock recommendation service in which I detail every trade I make with in-depth analysis educating my students on how to adapt to the frequent market changes \n \nhttp://www.youtube.com/watch?v=-NdYhUoPmMM President / Founder B12 Trader Inc November 2014  – Present (10 months) Founder of the B12 Trader Inc. at www.b12trader.com \n \nThe B12 Trader is an educational website teaching working individuals how to beat the market in just 15 minute per day. I teach individuals how to trade after work hours, emotion free, utilizing technical analysis.  \n \nThe site offers an all inclusive training series to teach an investor with any experience level to trade like I do with the goal of 5-15% MONTHLY returns. Also available is a daily stock recommendation service in which I detail every trade I make with in-depth analysis educating my students on how to adapt to the frequent market changes \n \nhttp://www.youtube.com/watch?v=-NdYhUoPmMM Sales Engineer Druva June 2014  –  April 2015  (11 months) Greater Seattle Area Enterprise Sales Engineer covering the Northwest region. My role is to build relationships with prospects, customers and channel partners, delivering presentations and demonstrations to articulate features and differentiators of all Druva Solutions/products, understanding a prospect’s needs and architecting solutions for them, writing proposals and responses to RFP/RFI documents, strategizing with Account Executives to drive sales, configuring/customizing demo solutions at customer locations.  \n \nI also produce video trainings and webinars conducting deep-dive introductions into Druva's Insync Endpoint Backup Solutions and Cloud based backup based on Phoenix. Sales Engineer Druva June 2014  –  April 2015  (11 months) Greater Seattle Area Enterprise Sales Engineer covering the Northwest region. My role is to build relationships with prospects, customers and channel partners, delivering presentations and demonstrations to articulate features and differentiators of all Druva Solutions/products, understanding a prospect’s needs and architecting solutions for them, writing proposals and responses to RFP/RFI documents, strategizing with Account Executives to drive sales, configuring/customizing demo solutions at customer locations.  \n \nI also produce video trainings and webinars conducting deep-dive introductions into Druva's Insync Endpoint Backup Solutions and Cloud based backup based on Phoenix. Solutions Architect, HP Storage HP December 2008  –  June 2014  (5 years 7 months) Solutions Architect,HP Storage covering the Northwest and Hawaii. Solutions Architect, HP Storage HP December 2008  –  June 2014  (5 years 7 months) Solutions Architect,HP Storage covering the Northwest and Hawaii. Sales Engineer LeftHand Networks August 2006  –  December 2008  (2 years 5 months) Regional Sales Engineer for the Northwest and Bay Area territories. Sales Engineer LeftHand Networks August 2006  –  December 2008  (2 years 5 months) Regional Sales Engineer for the Northwest and Bay Area territories. Technical Operations Manager Nike 2004  –  2006  (2 years) Technical Operations Manager Nike 2004  –  2006  (2 years) Senior Systems Engineer Infinity Internet January 2002  –  November 2004  (2 years 11 months) Senior Systems Engineer Infinity Internet January 2002  –  November 2004  (2 years 11 months) Senior Project Engineer Millennium Digital Media January 2001  –  January 2002  (1 year 1 month) Lead project engineer in charge of ISP server consolidation for West Coast operations. Company incorporated as US.net was owned by MDM and purchased in 2002 by Infinity Internet Senior Project Engineer Millennium Digital Media January 2001  –  January 2002  (1 year 1 month) Lead project engineer in charge of ISP server consolidation for West Coast operations. Company incorporated as US.net was owned by MDM and purchased in 2002 by Infinity Internet Senior Systems Engineer HiSpeed Technologies 1997  –  2001  (4 years) Senior Systems Engineer HiSpeed Technologies 1997  –  2001  (4 years) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Web Researcher Aldea Communications 1994  –  1994  (less than a year) Skills Servers Unix NAS Storage Virtualization Cloud Computing SAN Sales Engineering VMware Infrastructure HP IP Networking HP Master ASE Storage VCP VCSP IP SaaS Storage Solutions Storage Area Networks VMware Solution Selling Data Center Disaster Recovery Storage Virtualization Enterprise Software Pre-sales HP Master ASE Networking Windows Server High Availability NetApp VDI Managed Services Channel Partners Enterprise Storage Deduplication iSCSI See 21+     See less Skills  Servers Unix NAS Storage Virtualization Cloud Computing SAN Sales Engineering VMware Infrastructure HP IP Networking HP Master ASE Storage VCP VCSP IP SaaS Storage Solutions Storage Area Networks VMware Solution Selling Data Center Disaster Recovery Storage Virtualization Enterprise Software Pre-sales HP Master ASE Networking Windows Server High Availability NetApp VDI Managed Services Channel Partners Enterprise Storage Deduplication iSCSI See 21+     See less Servers Unix NAS Storage Virtualization Cloud Computing SAN Sales Engineering VMware Infrastructure HP IP Networking HP Master ASE Storage VCP VCSP IP SaaS Storage Solutions Storage Area Networks VMware Solution Selling Data Center Disaster Recovery Storage Virtualization Enterprise Software Pre-sales HP Master ASE Networking Windows Server High Availability NetApp VDI Managed Services Channel Partners Enterprise Storage Deduplication iSCSI See 21+     See less Servers Unix NAS Storage Virtualization Cloud Computing SAN Sales Engineering VMware Infrastructure HP IP Networking HP Master ASE Storage VCP VCSP IP SaaS Storage Solutions Storage Area Networks VMware Solution Selling Data Center Disaster Recovery Storage Virtualization Enterprise Software Pre-sales HP Master ASE Networking Windows Server High Availability NetApp VDI Managed Services Channel Partners Enterprise Storage Deduplication iSCSI See 21+     See less Education Palomar College 1995  – 1997 Palomar College 1995  – 1997 Palomar College 1995  – 1997 Palomar College 1995  – 1997 Honors & Awards Additional Honors & Awards iSCSI SAN expert. Red Hat certified. VMware certified engineer. Additional Honors & Awards iSCSI SAN expert. Red Hat certified. VMware certified engineer. Additional Honors & Awards iSCSI SAN expert. Red Hat certified. VMware certified engineer. Additional Honors & Awards iSCSI SAN expert. Red Hat certified. VMware certified engineer. ", "Languages English Native or bilingual proficiency German Professional working proficiency French Elementary proficiency English Native or bilingual proficiency German Professional working proficiency French Elementary proficiency English Native or bilingual proficiency German Professional working proficiency French Elementary proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Skills     ", "Summary Highly enthusiastic, motivated, and SSCA certified Sales Engineering Professional with a Computer Science degree who thrives in demanding environments. I have over 10 years of experience in I.T. sales and software sales engineering, working at the value-added reseller, and vendor level. I am currently with Google helping them change the world. I have strong people skills, exercise careful planning, and effective communication. \nSome of my extracurriculars include PHP scripting, HTML, API's and Drupal Core. Summary Highly enthusiastic, motivated, and SSCA certified Sales Engineering Professional with a Computer Science degree who thrives in demanding environments. I have over 10 years of experience in I.T. sales and software sales engineering, working at the value-added reseller, and vendor level. I am currently with Google helping them change the world. I have strong people skills, exercise careful planning, and effective communication. \nSome of my extracurriculars include PHP scripting, HTML, API's and Drupal Core. Highly enthusiastic, motivated, and SSCA certified Sales Engineering Professional with a Computer Science degree who thrives in demanding environments. I have over 10 years of experience in I.T. sales and software sales engineering, working at the value-added reseller, and vendor level. I am currently with Google helping them change the world. I have strong people skills, exercise careful planning, and effective communication. \nSome of my extracurriculars include PHP scripting, HTML, API's and Drupal Core. Highly enthusiastic, motivated, and SSCA certified Sales Engineering Professional with a Computer Science degree who thrives in demanding environments. I have over 10 years of experience in I.T. sales and software sales engineering, working at the value-added reseller, and vendor level. I am currently with Google helping them change the world. I have strong people skills, exercise careful planning, and effective communication. \nSome of my extracurriculars include PHP scripting, HTML, API's and Drupal Core. Experience Sales Engineer - Canada, Google Apps Google July 2015  – Present (2 months) Toronto, Canada Area Sales Engineer Google October 2014  –  July 2015  (10 months) Mountain View, California USA Sales Engineer - Canada PGi September 2011  –  October 2014  (3 years 2 months) Toronto, Canada Area Field Sales, Account Manager PGi June 2010  –  September 2011  (1 year 4 months) Toronto, Canada Area Account Manager Symantec Corp April 2006  –  June 2010  (4 years 3 months) Toronto, Canada Area Corporate Account Manager CDW Canada, Inc. August 2004  –  April 2006  (1 year 9 months) Toronto, Canada Area Sales Engineer - Canada, Google Apps Google July 2015  – Present (2 months) Toronto, Canada Area Sales Engineer - Canada, Google Apps Google July 2015  – Present (2 months) Toronto, Canada Area Sales Engineer Google October 2014  –  July 2015  (10 months) Mountain View, California USA Sales Engineer Google October 2014  –  July 2015  (10 months) Mountain View, California USA Sales Engineer - Canada PGi September 2011  –  October 2014  (3 years 2 months) Toronto, Canada Area Sales Engineer - Canada PGi September 2011  –  October 2014  (3 years 2 months) Toronto, Canada Area Field Sales, Account Manager PGi June 2010  –  September 2011  (1 year 4 months) Toronto, Canada Area Field Sales, Account Manager PGi June 2010  –  September 2011  (1 year 4 months) Toronto, Canada Area Account Manager Symantec Corp April 2006  –  June 2010  (4 years 3 months) Toronto, Canada Area Account Manager Symantec Corp April 2006  –  June 2010  (4 years 3 months) Toronto, Canada Area Corporate Account Manager CDW Canada, Inc. August 2004  –  April 2006  (1 year 9 months) Toronto, Canada Area Corporate Account Manager CDW Canada, Inc. August 2004  –  April 2006  (1 year 9 months) Toronto, Canada Area Skills Solution Selling Sales Process SaaS Selling Account Management Sales Presentations Sales Cold Calling Sales Operations Pre-sales Cloud Computing Management Sales Management Unified Communications Channel Partners Partner Management Sales Engineering Enterprise Software Web Conferences Disaster Recovery See 5+     See less Skills  Solution Selling Sales Process SaaS Selling Account Management Sales Presentations Sales Cold Calling Sales Operations Pre-sales Cloud Computing Management Sales Management Unified Communications Channel Partners Partner Management Sales Engineering Enterprise Software Web Conferences Disaster Recovery See 5+     See less Solution Selling Sales Process SaaS Selling Account Management Sales Presentations Sales Cold Calling Sales Operations Pre-sales Cloud Computing Management Sales Management Unified Communications Channel Partners Partner Management Sales Engineering Enterprise Software Web Conferences Disaster Recovery See 5+     See less Solution Selling Sales Process SaaS Selling Account Management Sales Presentations Sales Cold Calling Sales Operations Pre-sales Cloud Computing Management Sales Management Unified Communications Channel Partners Partner Management Sales Engineering Enterprise Software Web Conferences Disaster Recovery See 5+     See less Education Eastern Kentucky University Bachelor of Science (BSc),  Computer Science 2000  – 2004 Activities and Societies:  Eastern Kentucky Track / XCountry\nEvent Times:\n400m: 47.8s (relay split) ,  48.7 (open time)\n800m: 1:50.1 (open event)\n1500m: 3:50.5 (open event)\n1 mile: 4:04.3 (indoor open)\n8k: 24:57 (cross country)\n10k: 31:30 (cross country) Eastern Kentucky University Bachelor of Science (BSc),  Computer Science 2000  – 2004 Activities and Societies:  Eastern Kentucky Track / XCountry\nEvent Times:\n400m: 47.8s (relay split) ,  48.7 (open time)\n800m: 1:50.1 (open event)\n1500m: 3:50.5 (open event)\n1 mile: 4:04.3 (indoor open)\n8k: 24:57 (cross country)\n10k: 31:30 (cross country) Eastern Kentucky University Bachelor of Science (BSc),  Computer Science 2000  – 2004 Activities and Societies:  Eastern Kentucky Track / XCountry\nEvent Times:\n400m: 47.8s (relay split) ,  48.7 (open time)\n800m: 1:50.1 (open event)\n1500m: 3:50.5 (open event)\n1 mile: 4:04.3 (indoor open)\n8k: 24:57 (cross country)\n10k: 31:30 (cross country) Eastern Kentucky University Bachelor of Science (BSc),  Computer Science 2000  – 2004 Activities and Societies:  Eastern Kentucky Track / XCountry\nEvent Times:\n400m: 47.8s (relay split) ,  48.7 (open time)\n800m: 1:50.1 (open event)\n1500m: 3:50.5 (open event)\n1 mile: 4:04.3 (indoor open)\n8k: 24:57 (cross country)\n10k: 31:30 (cross country) Honors & Awards ", "Experience Sales Engineer - Google for Work Google April 2015  – Present (5 months) Tokyo Renewal Account Manager - Japan region Google August 2014  –  March 2015  (8 months) Tokyo Solution Specialist for Windows Device \"Microsoft Surface\" Microsoft July 2012  –  July 2014  (2 years 1 month) Tokyo Sr Technology Specialist for Windows Client Microsoft September 2008  –  June 2012  (3 years 10 months) Tokyo Partner Presales Consultant for Large System Integrators Hewlett-Packard August 2006  –  August 2008  (2 years 1 month) Tokyo Presales Consultant Hewlett-Packard April 2003  –  July 2006  (3 years 4 months) Tokyo Sales Engineer - Google for Work Google April 2015  – Present (5 months) Tokyo Sales Engineer - Google for Work Google April 2015  – Present (5 months) Tokyo Renewal Account Manager - Japan region Google August 2014  –  March 2015  (8 months) Tokyo Renewal Account Manager - Japan region Google August 2014  –  March 2015  (8 months) Tokyo Solution Specialist for Windows Device \"Microsoft Surface\" Microsoft July 2012  –  July 2014  (2 years 1 month) Tokyo Solution Specialist for Windows Device \"Microsoft Surface\" Microsoft July 2012  –  July 2014  (2 years 1 month) Tokyo Sr Technology Specialist for Windows Client Microsoft September 2008  –  June 2012  (3 years 10 months) Tokyo Sr Technology Specialist for Windows Client Microsoft September 2008  –  June 2012  (3 years 10 months) Tokyo Partner Presales Consultant for Large System Integrators Hewlett-Packard August 2006  –  August 2008  (2 years 1 month) Tokyo Partner Presales Consultant for Large System Integrators Hewlett-Packard August 2006  –  August 2008  (2 years 1 month) Tokyo Presales Consultant Hewlett-Packard April 2003  –  July 2006  (3 years 4 months) Tokyo Presales Consultant Hewlett-Packard April 2003  –  July 2006  (3 years 4 months) Tokyo Languages Japanese English Japanese English Japanese English Skills Windows Tablet PC Mobile Devices Solution Selling VDI Virtualization Partnering Citrix Pre-sales IA Server Storage Virtualization Cloud Computing Database Design Chrome OS Mobile Device Management Digital Signage Signage Systems Interactive Kiosks See 3+     See less Skills  Windows Tablet PC Mobile Devices Solution Selling VDI Virtualization Partnering Citrix Pre-sales IA Server Storage Virtualization Cloud Computing Database Design Chrome OS Mobile Device Management Digital Signage Signage Systems Interactive Kiosks See 3+     See less Windows Tablet PC Mobile Devices Solution Selling VDI Virtualization Partnering Citrix Pre-sales IA Server Storage Virtualization Cloud Computing Database Design Chrome OS Mobile Device Management Digital Signage Signage Systems Interactive Kiosks See 3+     See less Windows Tablet PC Mobile Devices Solution Selling VDI Virtualization Partnering Citrix Pre-sales IA Server Storage Virtualization Cloud Computing Database Design Chrome OS Mobile Device Management Digital Signage Signage Systems Interactive Kiosks See 3+     See less Honors & Awards ", "Summary 20+ years experience with Solution Architecture and Pre-Sales Engineering of Search, Business Analytics, Content Management, Portal and Integration solutions for large Financial, Telco and Services clients supporting Google, Oracle, BEA, Microsoft and Sun solutions.  \n \nCurrently supporting sales of Google enterprise solutions to various NY/NJ/East Coast customers. \n \nSpecialties: - 20 years Software Industry Sales and Project Management experience \n- Microsoft VB,.NET & SQL Server experience \n- Oracle DB and Fusion Middleware/Web Logic Application Server experience \n- Search engine, Collaboration, Portal, Content Management, Integration software expertise Summary 20+ years experience with Solution Architecture and Pre-Sales Engineering of Search, Business Analytics, Content Management, Portal and Integration solutions for large Financial, Telco and Services clients supporting Google, Oracle, BEA, Microsoft and Sun solutions.  \n \nCurrently supporting sales of Google enterprise solutions to various NY/NJ/East Coast customers. \n \nSpecialties: - 20 years Software Industry Sales and Project Management experience \n- Microsoft VB,.NET & SQL Server experience \n- Oracle DB and Fusion Middleware/Web Logic Application Server experience \n- Search engine, Collaboration, Portal, Content Management, Integration software expertise 20+ years experience with Solution Architecture and Pre-Sales Engineering of Search, Business Analytics, Content Management, Portal and Integration solutions for large Financial, Telco and Services clients supporting Google, Oracle, BEA, Microsoft and Sun solutions.  \n \nCurrently supporting sales of Google enterprise solutions to various NY/NJ/East Coast customers. \n \nSpecialties: - 20 years Software Industry Sales and Project Management experience \n- Microsoft VB,.NET & SQL Server experience \n- Oracle DB and Fusion Middleware/Web Logic Application Server experience \n- Search engine, Collaboration, Portal, Content Management, Integration software expertise 20+ years experience with Solution Architecture and Pre-Sales Engineering of Search, Business Analytics, Content Management, Portal and Integration solutions for large Financial, Telco and Services clients supporting Google, Oracle, BEA, Microsoft and Sun solutions.  \n \nCurrently supporting sales of Google enterprise solutions to various NY/NJ/East Coast customers. \n \nSpecialties: - 20 years Software Industry Sales and Project Management experience \n- Microsoft VB,.NET & SQL Server experience \n- Oracle DB and Fusion Middleware/Web Logic Application Server experience \n- Search engine, Collaboration, Portal, Content Management, Integration software expertise Experience Sales Engineer - Google for Work Google November 2012  – Present (2 years 10 months) Greater New York City Area As a technical solutions and sales engineer for Google For Work, I have provided Google Apps, Google Chrome, Search, Cloud-based and Collaborative corporate software solutions for some of the world’s best known companies. Realtor ERA June 2006  –  2015  (9 years) Clark, NJ Principal Sales Consultant Oracle Corporation November 2004  –  November 2012  (8 years 1 month) Pre-Sales role including selling and solutioning of architecture, supporting technologies, and applications suites to Mid-size and Fortune 500 companies. This includes Cloud-based Oracle software and services as well as On-Premise Application & Technology solutions. Principal Sales Engineer Vignette June 2000  –  November 2004  (4 years 6 months) - Technical sales to large Financial and Insurance clients through custom creation & delivery of web, portal, content management and integration application demos, videos, training and presentations. \n- Helped management train and define goals for other Sales Engineer’s in the regions Principal Systems Engineer Fujitsu/Amdahl March 1991  –  June 2000  (9 years 4 months) - Supported pre-sales of various Database, Application Development (Object Star), and System reporting software (EnView) for large Fortune 200 clients \n- Project manager & technical architect for various client projects including Allmerica Financial, Ernst & Young, Wakefern, D&B, AT&T, & Lucent Technologies. \n- Developed training programs and marketing materials \n- Web developer of internal Amdahl support Web-site. Systems Administrator Hoechst Roussel Pharmaceuticals (currently part of Sanofi-Aventis) November 1987  –  February 1991  (3 years 4 months) Somerville, NJ - Formally trained users on various mainframe and PC topics. \n- Helped establish and provide support of a help-desk facility. \n- Wrote technical documentation and training guides \n- Helped manage and train co-op students on various projects. \n- Database and system administrator for HP3000-HPDesk electronic mail system. \n- Wrote A.I. learning system in LISP for classifying medical data. \n- Wrote updating and configuration software for PC updates in Pascal \n- Supported HP3000-MPE mainframe, HP9000-UNIX and Windows & MSDOS systems. Sales Engineer - Google for Work Google November 2012  – Present (2 years 10 months) Greater New York City Area As a technical solutions and sales engineer for Google For Work, I have provided Google Apps, Google Chrome, Search, Cloud-based and Collaborative corporate software solutions for some of the world’s best known companies. Sales Engineer - Google for Work Google November 2012  – Present (2 years 10 months) Greater New York City Area As a technical solutions and sales engineer for Google For Work, I have provided Google Apps, Google Chrome, Search, Cloud-based and Collaborative corporate software solutions for some of the world’s best known companies. Realtor ERA June 2006  –  2015  (9 years) Clark, NJ Realtor ERA June 2006  –  2015  (9 years) Clark, NJ Principal Sales Consultant Oracle Corporation November 2004  –  November 2012  (8 years 1 month) Pre-Sales role including selling and solutioning of architecture, supporting technologies, and applications suites to Mid-size and Fortune 500 companies. This includes Cloud-based Oracle software and services as well as On-Premise Application & Technology solutions. Principal Sales Consultant Oracle Corporation November 2004  –  November 2012  (8 years 1 month) Pre-Sales role including selling and solutioning of architecture, supporting technologies, and applications suites to Mid-size and Fortune 500 companies. This includes Cloud-based Oracle software and services as well as On-Premise Application & Technology solutions. Principal Sales Engineer Vignette June 2000  –  November 2004  (4 years 6 months) - Technical sales to large Financial and Insurance clients through custom creation & delivery of web, portal, content management and integration application demos, videos, training and presentations. \n- Helped management train and define goals for other Sales Engineer’s in the regions Principal Sales Engineer Vignette June 2000  –  November 2004  (4 years 6 months) - Technical sales to large Financial and Insurance clients through custom creation & delivery of web, portal, content management and integration application demos, videos, training and presentations. \n- Helped management train and define goals for other Sales Engineer’s in the regions Principal Systems Engineer Fujitsu/Amdahl March 1991  –  June 2000  (9 years 4 months) - Supported pre-sales of various Database, Application Development (Object Star), and System reporting software (EnView) for large Fortune 200 clients \n- Project manager & technical architect for various client projects including Allmerica Financial, Ernst & Young, Wakefern, D&B, AT&T, & Lucent Technologies. \n- Developed training programs and marketing materials \n- Web developer of internal Amdahl support Web-site. Principal Systems Engineer Fujitsu/Amdahl March 1991  –  June 2000  (9 years 4 months) - Supported pre-sales of various Database, Application Development (Object Star), and System reporting software (EnView) for large Fortune 200 clients \n- Project manager & technical architect for various client projects including Allmerica Financial, Ernst & Young, Wakefern, D&B, AT&T, & Lucent Technologies. \n- Developed training programs and marketing materials \n- Web developer of internal Amdahl support Web-site. Systems Administrator Hoechst Roussel Pharmaceuticals (currently part of Sanofi-Aventis) November 1987  –  February 1991  (3 years 4 months) Somerville, NJ - Formally trained users on various mainframe and PC topics. \n- Helped establish and provide support of a help-desk facility. \n- Wrote technical documentation and training guides \n- Helped manage and train co-op students on various projects. \n- Database and system administrator for HP3000-HPDesk electronic mail system. \n- Wrote A.I. learning system in LISP for classifying medical data. \n- Wrote updating and configuration software for PC updates in Pascal \n- Supported HP3000-MPE mainframe, HP9000-UNIX and Windows & MSDOS systems. Systems Administrator Hoechst Roussel Pharmaceuticals (currently part of Sanofi-Aventis) November 1987  –  February 1991  (3 years 4 months) Somerville, NJ - Formally trained users on various mainframe and PC topics. \n- Helped establish and provide support of a help-desk facility. \n- Wrote technical documentation and training guides \n- Helped manage and train co-op students on various projects. \n- Database and system administrator for HP3000-HPDesk electronic mail system. \n- Wrote A.I. learning system in LISP for classifying medical data. \n- Wrote updating and configuration software for PC updates in Pascal \n- Supported HP3000-MPE mainframe, HP9000-UNIX and Windows & MSDOS systems. Languages English Native or bilingual proficiency Italian Full professional proficiency English Native or bilingual proficiency Italian Full professional proficiency English Native or bilingual proficiency Italian Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Integration Oracle SOA Oracle Applications Cloud Computing Portals Business Intelligence Content Management Enterprise Software Oracle E-Business Suite Databases Master Data Management Solution Architecture Enterprise Search Microsoft Android Italian Exadata/Exalogic CRM Pre-sales Professional Services SaaS Solution Selling Software Industry See 9+     See less Skills  Integration Oracle SOA Oracle Applications Cloud Computing Portals Business Intelligence Content Management Enterprise Software Oracle E-Business Suite Databases Master Data Management Solution Architecture Enterprise Search Microsoft Android Italian Exadata/Exalogic CRM Pre-sales Professional Services SaaS Solution Selling Software Industry See 9+     See less Integration Oracle SOA Oracle Applications Cloud Computing Portals Business Intelligence Content Management Enterprise Software Oracle E-Business Suite Databases Master Data Management Solution Architecture Enterprise Search Microsoft Android Italian Exadata/Exalogic CRM Pre-sales Professional Services SaaS Solution Selling Software Industry See 9+     See less Integration Oracle SOA Oracle Applications Cloud Computing Portals Business Intelligence Content Management Enterprise Software Oracle E-Business Suite Databases Master Data Management Solution Architecture Enterprise Search Microsoft Android Italian Exadata/Exalogic CRM Pre-sales Professional Services SaaS Solution Selling Software Industry See 9+     See less Honors & Awards "]}