{"position": "Accountant", "company": "Google", "profiles": ["Skills PPC Online Advertising Digital Marketing Advertising Sales Google Analytics Google Adwords SEM Mobile Marketing Sales Integrated Marketing Digital Strategy Digital Media Web Analytics Online Marketing Lead Generation Skills  PPC Online Advertising Digital Marketing Advertising Sales Google Analytics Google Adwords SEM Mobile Marketing Sales Integrated Marketing Digital Strategy Digital Media Web Analytics Online Marketing Lead Generation PPC Online Advertising Digital Marketing Advertising Sales Google Analytics Google Adwords SEM Mobile Marketing Sales Integrated Marketing Digital Strategy Digital Media Web Analytics Online Marketing Lead Generation PPC Online Advertising Digital Marketing Advertising Sales Google Analytics Google Adwords SEM Mobile Marketing Sales Integrated Marketing Digital Strategy Digital Media Web Analytics Online Marketing Lead Generation ", "Experience Entity Lead/ Financial Accountant APAC Google August 2014  – Present (1 year 1 month) Sydney Area, Australia Entity Lead/Financial Accountant EMEA Google September 2013  –  August 2014  (1 year) Dublin Entity Lead/ Financial Accountant Berkley Recruitmeny on assignment with Google December 2012  –  September 2013  (10 months) Financial Accounting - Regulatory Reporting Credit Suisse January 2011  –  October 2012  (1 year 10 months) Financial Accountant - Group Finance, Statutory Reporting Westpac September 2010  –  December 2010  (4 months) Accountant, Wealth Management Finance Commonwealth Bank of Australia April 2010  –  August 2010  (5 months) Capital management, budgeting and analysis for 52 wealth management subsidiaries. MacCap Funds, Finance Macquarie Bank December 2009  –  March 2010  (4 months) I was responsible for the Finance Function of an ASX listed Property Trust Audit Senior E & Y September 2005  –  April 2009  (3 years 8 months) I performed Financial Statement Audits for Financial Services Clients, in particular listed funds who held a variety of financial instruments. Entity Lead/ Financial Accountant APAC Google August 2014  – Present (1 year 1 month) Sydney Area, Australia Entity Lead/ Financial Accountant APAC Google August 2014  – Present (1 year 1 month) Sydney Area, Australia Entity Lead/Financial Accountant EMEA Google September 2013  –  August 2014  (1 year) Dublin Entity Lead/Financial Accountant EMEA Google September 2013  –  August 2014  (1 year) Dublin Entity Lead/ Financial Accountant Berkley Recruitmeny on assignment with Google December 2012  –  September 2013  (10 months) Entity Lead/ Financial Accountant Berkley Recruitmeny on assignment with Google December 2012  –  September 2013  (10 months) Financial Accounting - Regulatory Reporting Credit Suisse January 2011  –  October 2012  (1 year 10 months) Financial Accounting - Regulatory Reporting Credit Suisse January 2011  –  October 2012  (1 year 10 months) Financial Accountant - Group Finance, Statutory Reporting Westpac September 2010  –  December 2010  (4 months) Financial Accountant - Group Finance, Statutory Reporting Westpac September 2010  –  December 2010  (4 months) Accountant, Wealth Management Finance Commonwealth Bank of Australia April 2010  –  August 2010  (5 months) Capital management, budgeting and analysis for 52 wealth management subsidiaries. Accountant, Wealth Management Finance Commonwealth Bank of Australia April 2010  –  August 2010  (5 months) Capital management, budgeting and analysis for 52 wealth management subsidiaries. MacCap Funds, Finance Macquarie Bank December 2009  –  March 2010  (4 months) I was responsible for the Finance Function of an ASX listed Property Trust MacCap Funds, Finance Macquarie Bank December 2009  –  March 2010  (4 months) I was responsible for the Finance Function of an ASX listed Property Trust Audit Senior E & Y September 2005  –  April 2009  (3 years 8 months) I performed Financial Statement Audits for Financial Services Clients, in particular listed funds who held a variety of financial instruments. Audit Senior E & Y September 2005  –  April 2009  (3 years 8 months) I performed Financial Statement Audits for Financial Services Clients, in particular listed funds who held a variety of financial instruments. Skills Financial Analysis Financial Accounting Financial Audits Analysis Internal Controls Skills  Financial Analysis Financial Accounting Financial Audits Analysis Internal Controls Financial Analysis Financial Accounting Financial Audits Analysis Internal Controls Financial Analysis Financial Accounting Financial Audits Analysis Internal Controls Education Institute of Chartered Accountants of Ireland ACA,  Chartered Accountant 2005  – 2009 All subjects passed on first sitting University College Dublin Bachelor of Business & Legal Studies International,  Law and Business 2000  – 2005 The International portion of my degree was obtained through a year studying law at The University of New South Wales, Sydney, Australia. Activities and Societies:  UCD Ladies Boat Club Institute of Chartered Accountants of Ireland ACA,  Chartered Accountant 2005  – 2009 All subjects passed on first sitting Institute of Chartered Accountants of Ireland ACA,  Chartered Accountant 2005  – 2009 All subjects passed on first sitting Institute of Chartered Accountants of Ireland ACA,  Chartered Accountant 2005  – 2009 All subjects passed on first sitting University College Dublin Bachelor of Business & Legal Studies International,  Law and Business 2000  – 2005 The International portion of my degree was obtained through a year studying law at The University of New South Wales, Sydney, Australia. Activities and Societies:  UCD Ladies Boat Club University College Dublin Bachelor of Business & Legal Studies International,  Law and Business 2000  – 2005 The International portion of my degree was obtained through a year studying law at The University of New South Wales, Sydney, Australia. Activities and Societies:  UCD Ladies Boat Club University College Dublin Bachelor of Business & Legal Studies International,  Law and Business 2000  – 2005 The International portion of my degree was obtained through a year studying law at The University of New South Wales, Sydney, Australia. Activities and Societies:  UCD Ladies Boat Club ", "Experience Senior Financial Accountant Google September 2013  – Present (2 years) Sydney, Australia Commercial Technical Lead (Accounting) BHP Billiton June 2011  –  August 2013  (2 years 3 months) Management Accountant - Wagering/Lotteries Tatts Group April 2008  –  February 2011  (2 years 11 months) Accountant (Contract) People in Plastic August 2007  –  January 2008  (6 months) Management Accountant / Systems Accountant Golden Casket February 2005  –  July 2007  (2 years 6 months) Senior Financial Accountant Google September 2013  – Present (2 years) Sydney, Australia Senior Financial Accountant Google September 2013  – Present (2 years) Sydney, Australia Commercial Technical Lead (Accounting) BHP Billiton June 2011  –  August 2013  (2 years 3 months) Commercial Technical Lead (Accounting) BHP Billiton June 2011  –  August 2013  (2 years 3 months) Management Accountant - Wagering/Lotteries Tatts Group April 2008  –  February 2011  (2 years 11 months) Management Accountant - Wagering/Lotteries Tatts Group April 2008  –  February 2011  (2 years 11 months) Accountant (Contract) People in Plastic August 2007  –  January 2008  (6 months) Accountant (Contract) People in Plastic August 2007  –  January 2008  (6 months) Management Accountant / Systems Accountant Golden Casket February 2005  –  July 2007  (2 years 6 months) Management Accountant / Systems Accountant Golden Casket February 2005  –  July 2007  (2 years 6 months) Skills Financial Reporting Financial Accounting Accounting Account Reconciliation Cash Flow Financial Analysis Forecasting Budgets Statutory Accounting Analysis Management Accounting Fixed Assets Microsoft Excel Accruals Auditing IFRS See 1+     See less Skills  Financial Reporting Financial Accounting Accounting Account Reconciliation Cash Flow Financial Analysis Forecasting Budgets Statutory Accounting Analysis Management Accounting Fixed Assets Microsoft Excel Accruals Auditing IFRS See 1+     See less Financial Reporting Financial Accounting Accounting Account Reconciliation Cash Flow Financial Analysis Forecasting Budgets Statutory Accounting Analysis Management Accounting Fixed Assets Microsoft Excel Accruals Auditing IFRS See 1+     See less Financial Reporting Financial Accounting Accounting Account Reconciliation Cash Flow Financial Analysis Forecasting Budgets Statutory Accounting Analysis Management Accounting Fixed Assets Microsoft Excel Accruals Auditing IFRS See 1+     See less Education The University of Queensland Bachelor of Laws,  Law 1997  – 2003 Included an exchange year at the University of British Columbia (1999) The University of Queensland Bachelor of Commerce,  Accounting 1997  – 2000 The University of Queensland Bachelor of Laws,  Law 1997  – 2003 Included an exchange year at the University of British Columbia (1999) The University of Queensland Bachelor of Laws,  Law 1997  – 2003 Included an exchange year at the University of British Columbia (1999) The University of Queensland Bachelor of Laws,  Law 1997  – 2003 Included an exchange year at the University of British Columbia (1999) The University of Queensland Bachelor of Commerce,  Accounting 1997  – 2000 The University of Queensland Bachelor of Commerce,  Accounting 1997  – 2000 The University of Queensland Bachelor of Commerce,  Accounting 1997  – 2000 ", "Summary An innovative, energetic marketer with 6.5 years of experience in B2B, B2C and product marketing, with an EMEA and international focus. Passionate about the startup and developer community, serving as a an advisor to numerous start-ups.  \n \nA creative storyteller with strong record of managing brands, creating impact and inspiring others. Self-starter with hands-on mentality. Highly analytical problem-solver thriving in international, challenging environments. \n \nRepresenting Google at external events; held a talk at the Bloomberg Innovation Summit about innovation at Google, spoke at the London School of Economics Career Fair about working at Google. \n \nSpecialties: Product Marketing, Brand Management & Communications, Content Creation, Curation & Marketing, Strategic Planning, Events, Video Advertising, Mobile Advertising, SEM, Social Media, Partner Management, Strategic Partnerships. \n \nThings I am most proud of: \n- Leading the YouTube B2B marketing activity across the EMEA region \n- Being the global Marketing Lead for the Consumer Barometer in 2014. The Consumer Barometer was shortlisted in the Webby’s awards, IAB Europe Research Awards, Mediatel’s Connected Consumer Awards \n- Overseeing the Marketing & Comms of Google’s presence in 2014 Cannes Lions Festival \n- Volunteering for SEWA Bharat as part of the Google Reach Leadership Program \n- Being involved  Summary An innovative, energetic marketer with 6.5 years of experience in B2B, B2C and product marketing, with an EMEA and international focus. Passionate about the startup and developer community, serving as a an advisor to numerous start-ups.  \n \nA creative storyteller with strong record of managing brands, creating impact and inspiring others. Self-starter with hands-on mentality. Highly analytical problem-solver thriving in international, challenging environments. \n \nRepresenting Google at external events; held a talk at the Bloomberg Innovation Summit about innovation at Google, spoke at the London School of Economics Career Fair about working at Google. \n \nSpecialties: Product Marketing, Brand Management & Communications, Content Creation, Curation & Marketing, Strategic Planning, Events, Video Advertising, Mobile Advertising, SEM, Social Media, Partner Management, Strategic Partnerships. \n \nThings I am most proud of: \n- Leading the YouTube B2B marketing activity across the EMEA region \n- Being the global Marketing Lead for the Consumer Barometer in 2014. The Consumer Barometer was shortlisted in the Webby’s awards, IAB Europe Research Awards, Mediatel’s Connected Consumer Awards \n- Overseeing the Marketing & Comms of Google’s presence in 2014 Cannes Lions Festival \n- Volunteering for SEWA Bharat as part of the Google Reach Leadership Program \n- Being involved  An innovative, energetic marketer with 6.5 years of experience in B2B, B2C and product marketing, with an EMEA and international focus. Passionate about the startup and developer community, serving as a an advisor to numerous start-ups.  \n \nA creative storyteller with strong record of managing brands, creating impact and inspiring others. Self-starter with hands-on mentality. Highly analytical problem-solver thriving in international, challenging environments. \n \nRepresenting Google at external events; held a talk at the Bloomberg Innovation Summit about innovation at Google, spoke at the London School of Economics Career Fair about working at Google. \n \nSpecialties: Product Marketing, Brand Management & Communications, Content Creation, Curation & Marketing, Strategic Planning, Events, Video Advertising, Mobile Advertising, SEM, Social Media, Partner Management, Strategic Partnerships. \n \nThings I am most proud of: \n- Leading the YouTube B2B marketing activity across the EMEA region \n- Being the global Marketing Lead for the Consumer Barometer in 2014. The Consumer Barometer was shortlisted in the Webby’s awards, IAB Europe Research Awards, Mediatel’s Connected Consumer Awards \n- Overseeing the Marketing & Comms of Google’s presence in 2014 Cannes Lions Festival \n- Volunteering for SEWA Bharat as part of the Google Reach Leadership Program \n- Being involved  An innovative, energetic marketer with 6.5 years of experience in B2B, B2C and product marketing, with an EMEA and international focus. Passionate about the startup and developer community, serving as a an advisor to numerous start-ups.  \n \nA creative storyteller with strong record of managing brands, creating impact and inspiring others. Self-starter with hands-on mentality. Highly analytical problem-solver thriving in international, challenging environments. \n \nRepresenting Google at external events; held a talk at the Bloomberg Innovation Summit about innovation at Google, spoke at the London School of Economics Career Fair about working at Google. \n \nSpecialties: Product Marketing, Brand Management & Communications, Content Creation, Curation & Marketing, Strategic Planning, Events, Video Advertising, Mobile Advertising, SEM, Social Media, Partner Management, Strategic Partnerships. \n \nThings I am most proud of: \n- Leading the YouTube B2B marketing activity across the EMEA region \n- Being the global Marketing Lead for the Consumer Barometer in 2014. The Consumer Barometer was shortlisted in the Webby’s awards, IAB Europe Research Awards, Mediatel’s Connected Consumer Awards \n- Overseeing the Marketing & Comms of Google’s presence in 2014 Cannes Lions Festival \n- Volunteering for SEWA Bharat as part of the Google Reach Leadership Program \n- Being involved  Experience Product Marketing Manager, YouTube Ads & Research Communications Google October 2013  – Present (1 year 11 months) London, United Kingdom EMEA Programme Lead - YouTube Ads  \nCurrently leading all YouTube Ads programmes in EMEA working cross-functionally across 17 markets, PR and LCS.  \nCreating the central marketing strategy, from key objectives and mission, to customer touchpoints, product launches and resource planning \nDeveloping & implementing the YouTube business comms and presence at major industry EMEA events (eg. Cannes Lions, Eurobest, Dubai Lynx, Kristal Elma) \n \nGlobal Product Marketing Lead - Consumer Barometer  \nLed the global launch of Google's Consumer Barometer, a free tool that delivers consumer insights to support media planning and decision-making. Created go-to-market strategy and led its implementation managing stakeholders among the Market Insights, PR and country marketing teams  \nOne of the most successful research-related launches with record number of visitors, time-on-site and PR coverage \n \nProject Co-Lead - Google Executive Summit \nOrganised an exclusive event for the CEOs of the top 45 EMEA clients ($1bn+ revenue) in partnership with Singularity University. Co-led every every aspect of the project from strategy and content curation to invitations and logistics. \n \nProject Co-Lead - WellVersed (20% role) \nDeveloped the concept, creatives and promotional strategy for UK’s first internet teen safety campaign featuring a YouTube creator. Worked closely with Policy and PR team, reached 60% of schools and engaged with MPs & ministers. Nationwide PR coverage \n Volunteer Consultant SEWA Bharat May 2014  –  May 2014  (1 month) New Delhi Area, India Selected in the 2014 Google Reach Leadership Program (16 members globally), in partnership with the Grameen Foundation, to address social impact projects at SEWA Bharat, NGO supporting Indian women \n \nCreated internet literacy programs for the SEWA members and their families. Developed the roll-out plan to the SEWA information centres and stablished partnership with Google India for implementation and ongoing support \n \nDeveloped SEWA’s brand identity and strategy targeted to funders, government bodies and general public \n \nCreated and implemented the e-commerce strategy for LoomMool, SEWA’s artisan cooperative. \n Product Marketing Manager, Large Advertiser & Agency Marketing Google October 2012  –  October 2013  (1 year 1 month) London, United Kingdom EMEA Programme Lead - Learn with Google  \nLed the EMEA strategy & managed 7 cross-functional teams to build and deliver the online learning and event curriculum for Google’s professional education programme \nEngaged with 50% of the assigned customer base with Learn with Google activities, resulting in 23% revenue uplift due to increased product adoption  \n \nCannes Lions Festival of Creativity - Ext. Communications Lead  \nManaged the external communication strategy of Google's presence through online & offline media and 1:1 comms to guests. 100% increase in visitors compared to 2012 \n \nEMEA Project Co-Lead - Think Performance Roadshow \nLed the events measurement efforts, introduced an innovative measurement method. Created custom video content and keynote speeches presented to 1,000 attendees in 6 events in 6 countries,  \n \n Associate Product Marketing Manager, Large Advertiser & Agency Marketing Google July 2011  –  September 2012  (1 year 3 months) London, United Kingdom EMEA Program Lead - Think with Google  \nLaunched Think Insights, Google’s first content hub for marketers in EMEA; led the central marketing strategy, content curation and resource planning \n \nGlobal Project Lead - Global Advertiser  \nHeaded the marketing strategy for Google’s export initiative; crafted the global export narrative designed marketing materials and launched google.com/ads/global. The program helped unlock mutli-million export deals across North America, EMEA, APAC and LATAM \n Associate Industry Manager, Large Customer Sales Google October 2009  –  July 2011  (1 year 10 months) Dublin, Ireland Drove revenue & growth by managing a multi-million portfolio, negotiating deals with clients and playing a leading role in business development. Consistently exceeded sales targets, delivering a growth rate of ~40% YoY \n \nBuilt the Greek Large Customer Sales team in Dublin; hired and mentored 3 people Product Trainer - 20% role Google October 2009  –  July 2011  (1 year 10 months) Dublin, Ireland Trained over 350 ‘Nooglers’ on AdWords & advertising products. Designed the curriculum and learning experience based on business needs and trainees' feedback. Consistently received 90% positive feedback \n Online Media Associate Google October 2008  –  October 2009  (1 year 1 month) Dublin, Ireland Launched the first reseller deal in Greece with significant impact on country revenue. Liaised with reseller and established strong partnership that is still successful up to date. \n \nLed the implementation of the pan-European pilot of the Account Development at Scale program in Greece. Advised on the roll-out to other Emerging markets (Romania, Hungary, Slovenia, Croatia) \n \nEstablished and grew the first Google AdWords online community in Greece  \n \n Consultancy Project Santander April 2008  –  September 2008  (6 months) Milton Keynes, United Kingdom Consultancy project: Marketing & engagement plan for under 18s. Junior Accountant Pin Communication October 2006  –  September 2007  (1 year) Athens, Greece - Participated in pricing of services, presented sales and expenses to top management. Responsible for the payroll and budget management and allocation \n- Liaised and negotiated with suppliers and customers, often under pressure Intern at the Business Development division Hellenic Children's Museum June 2006  –  October 2006  (5 months) Athens, Greece - Developed the museum’s marketing plan for 2006-7 (Sept.-Aug.) \n- Analysed consumers’ trends and conducted a feasibility study Intern Hellenic Postbank September 2005  –  November 2005  (3 months) Athens, Greece Product Marketing Manager, YouTube Ads & Research Communications Google October 2013  – Present (1 year 11 months) London, United Kingdom EMEA Programme Lead - YouTube Ads  \nCurrently leading all YouTube Ads programmes in EMEA working cross-functionally across 17 markets, PR and LCS.  \nCreating the central marketing strategy, from key objectives and mission, to customer touchpoints, product launches and resource planning \nDeveloping & implementing the YouTube business comms and presence at major industry EMEA events (eg. Cannes Lions, Eurobest, Dubai Lynx, Kristal Elma) \n \nGlobal Product Marketing Lead - Consumer Barometer  \nLed the global launch of Google's Consumer Barometer, a free tool that delivers consumer insights to support media planning and decision-making. Created go-to-market strategy and led its implementation managing stakeholders among the Market Insights, PR and country marketing teams  \nOne of the most successful research-related launches with record number of visitors, time-on-site and PR coverage \n \nProject Co-Lead - Google Executive Summit \nOrganised an exclusive event for the CEOs of the top 45 EMEA clients ($1bn+ revenue) in partnership with Singularity University. Co-led every every aspect of the project from strategy and content curation to invitations and logistics. \n \nProject Co-Lead - WellVersed (20% role) \nDeveloped the concept, creatives and promotional strategy for UK’s first internet teen safety campaign featuring a YouTube creator. Worked closely with Policy and PR team, reached 60% of schools and engaged with MPs & ministers. Nationwide PR coverage \n Product Marketing Manager, YouTube Ads & Research Communications Google October 2013  – Present (1 year 11 months) London, United Kingdom EMEA Programme Lead - YouTube Ads  \nCurrently leading all YouTube Ads programmes in EMEA working cross-functionally across 17 markets, PR and LCS.  \nCreating the central marketing strategy, from key objectives and mission, to customer touchpoints, product launches and resource planning \nDeveloping & implementing the YouTube business comms and presence at major industry EMEA events (eg. Cannes Lions, Eurobest, Dubai Lynx, Kristal Elma) \n \nGlobal Product Marketing Lead - Consumer Barometer  \nLed the global launch of Google's Consumer Barometer, a free tool that delivers consumer insights to support media planning and decision-making. Created go-to-market strategy and led its implementation managing stakeholders among the Market Insights, PR and country marketing teams  \nOne of the most successful research-related launches with record number of visitors, time-on-site and PR coverage \n \nProject Co-Lead - Google Executive Summit \nOrganised an exclusive event for the CEOs of the top 45 EMEA clients ($1bn+ revenue) in partnership with Singularity University. Co-led every every aspect of the project from strategy and content curation to invitations and logistics. \n \nProject Co-Lead - WellVersed (20% role) \nDeveloped the concept, creatives and promotional strategy for UK’s first internet teen safety campaign featuring a YouTube creator. Worked closely with Policy and PR team, reached 60% of schools and engaged with MPs & ministers. Nationwide PR coverage \n Volunteer Consultant SEWA Bharat May 2014  –  May 2014  (1 month) New Delhi Area, India Selected in the 2014 Google Reach Leadership Program (16 members globally), in partnership with the Grameen Foundation, to address social impact projects at SEWA Bharat, NGO supporting Indian women \n \nCreated internet literacy programs for the SEWA members and their families. Developed the roll-out plan to the SEWA information centres and stablished partnership with Google India for implementation and ongoing support \n \nDeveloped SEWA’s brand identity and strategy targeted to funders, government bodies and general public \n \nCreated and implemented the e-commerce strategy for LoomMool, SEWA’s artisan cooperative. \n Volunteer Consultant SEWA Bharat May 2014  –  May 2014  (1 month) New Delhi Area, India Selected in the 2014 Google Reach Leadership Program (16 members globally), in partnership with the Grameen Foundation, to address social impact projects at SEWA Bharat, NGO supporting Indian women \n \nCreated internet literacy programs for the SEWA members and their families. Developed the roll-out plan to the SEWA information centres and stablished partnership with Google India for implementation and ongoing support \n \nDeveloped SEWA’s brand identity and strategy targeted to funders, government bodies and general public \n \nCreated and implemented the e-commerce strategy for LoomMool, SEWA’s artisan cooperative. \n Product Marketing Manager, Large Advertiser & Agency Marketing Google October 2012  –  October 2013  (1 year 1 month) London, United Kingdom EMEA Programme Lead - Learn with Google  \nLed the EMEA strategy & managed 7 cross-functional teams to build and deliver the online learning and event curriculum for Google’s professional education programme \nEngaged with 50% of the assigned customer base with Learn with Google activities, resulting in 23% revenue uplift due to increased product adoption  \n \nCannes Lions Festival of Creativity - Ext. Communications Lead  \nManaged the external communication strategy of Google's presence through online & offline media and 1:1 comms to guests. 100% increase in visitors compared to 2012 \n \nEMEA Project Co-Lead - Think Performance Roadshow \nLed the events measurement efforts, introduced an innovative measurement method. Created custom video content and keynote speeches presented to 1,000 attendees in 6 events in 6 countries,  \n \n Product Marketing Manager, Large Advertiser & Agency Marketing Google October 2012  –  October 2013  (1 year 1 month) London, United Kingdom EMEA Programme Lead - Learn with Google  \nLed the EMEA strategy & managed 7 cross-functional teams to build and deliver the online learning and event curriculum for Google’s professional education programme \nEngaged with 50% of the assigned customer base with Learn with Google activities, resulting in 23% revenue uplift due to increased product adoption  \n \nCannes Lions Festival of Creativity - Ext. Communications Lead  \nManaged the external communication strategy of Google's presence through online & offline media and 1:1 comms to guests. 100% increase in visitors compared to 2012 \n \nEMEA Project Co-Lead - Think Performance Roadshow \nLed the events measurement efforts, introduced an innovative measurement method. Created custom video content and keynote speeches presented to 1,000 attendees in 6 events in 6 countries,  \n \n Associate Product Marketing Manager, Large Advertiser & Agency Marketing Google July 2011  –  September 2012  (1 year 3 months) London, United Kingdom EMEA Program Lead - Think with Google  \nLaunched Think Insights, Google’s first content hub for marketers in EMEA; led the central marketing strategy, content curation and resource planning \n \nGlobal Project Lead - Global Advertiser  \nHeaded the marketing strategy for Google’s export initiative; crafted the global export narrative designed marketing materials and launched google.com/ads/global. The program helped unlock mutli-million export deals across North America, EMEA, APAC and LATAM \n Associate Product Marketing Manager, Large Advertiser & Agency Marketing Google July 2011  –  September 2012  (1 year 3 months) London, United Kingdom EMEA Program Lead - Think with Google  \nLaunched Think Insights, Google’s first content hub for marketers in EMEA; led the central marketing strategy, content curation and resource planning \n \nGlobal Project Lead - Global Advertiser  \nHeaded the marketing strategy for Google’s export initiative; crafted the global export narrative designed marketing materials and launched google.com/ads/global. The program helped unlock mutli-million export deals across North America, EMEA, APAC and LATAM \n Associate Industry Manager, Large Customer Sales Google October 2009  –  July 2011  (1 year 10 months) Dublin, Ireland Drove revenue & growth by managing a multi-million portfolio, negotiating deals with clients and playing a leading role in business development. Consistently exceeded sales targets, delivering a growth rate of ~40% YoY \n \nBuilt the Greek Large Customer Sales team in Dublin; hired and mentored 3 people Associate Industry Manager, Large Customer Sales Google October 2009  –  July 2011  (1 year 10 months) Dublin, Ireland Drove revenue & growth by managing a multi-million portfolio, negotiating deals with clients and playing a leading role in business development. Consistently exceeded sales targets, delivering a growth rate of ~40% YoY \n \nBuilt the Greek Large Customer Sales team in Dublin; hired and mentored 3 people Product Trainer - 20% role Google October 2009  –  July 2011  (1 year 10 months) Dublin, Ireland Trained over 350 ‘Nooglers’ on AdWords & advertising products. Designed the curriculum and learning experience based on business needs and trainees' feedback. Consistently received 90% positive feedback \n Product Trainer - 20% role Google October 2009  –  July 2011  (1 year 10 months) Dublin, Ireland Trained over 350 ‘Nooglers’ on AdWords & advertising products. Designed the curriculum and learning experience based on business needs and trainees' feedback. Consistently received 90% positive feedback \n Online Media Associate Google October 2008  –  October 2009  (1 year 1 month) Dublin, Ireland Launched the first reseller deal in Greece with significant impact on country revenue. Liaised with reseller and established strong partnership that is still successful up to date. \n \nLed the implementation of the pan-European pilot of the Account Development at Scale program in Greece. Advised on the roll-out to other Emerging markets (Romania, Hungary, Slovenia, Croatia) \n \nEstablished and grew the first Google AdWords online community in Greece  \n \n Online Media Associate Google October 2008  –  October 2009  (1 year 1 month) Dublin, Ireland Launched the first reseller deal in Greece with significant impact on country revenue. Liaised with reseller and established strong partnership that is still successful up to date. \n \nLed the implementation of the pan-European pilot of the Account Development at Scale program in Greece. Advised on the roll-out to other Emerging markets (Romania, Hungary, Slovenia, Croatia) \n \nEstablished and grew the first Google AdWords online community in Greece  \n \n Consultancy Project Santander April 2008  –  September 2008  (6 months) Milton Keynes, United Kingdom Consultancy project: Marketing & engagement plan for under 18s. Consultancy Project Santander April 2008  –  September 2008  (6 months) Milton Keynes, United Kingdom Consultancy project: Marketing & engagement plan for under 18s. Junior Accountant Pin Communication October 2006  –  September 2007  (1 year) Athens, Greece - Participated in pricing of services, presented sales and expenses to top management. Responsible for the payroll and budget management and allocation \n- Liaised and negotiated with suppliers and customers, often under pressure Junior Accountant Pin Communication October 2006  –  September 2007  (1 year) Athens, Greece - Participated in pricing of services, presented sales and expenses to top management. Responsible for the payroll and budget management and allocation \n- Liaised and negotiated with suppliers and customers, often under pressure Intern at the Business Development division Hellenic Children's Museum June 2006  –  October 2006  (5 months) Athens, Greece - Developed the museum’s marketing plan for 2006-7 (Sept.-Aug.) \n- Analysed consumers’ trends and conducted a feasibility study Intern at the Business Development division Hellenic Children's Museum June 2006  –  October 2006  (5 months) Athens, Greece - Developed the museum’s marketing plan for 2006-7 (Sept.-Aug.) \n- Analysed consumers’ trends and conducted a feasibility study Intern Hellenic Postbank September 2005  –  November 2005  (3 months) Athens, Greece Intern Hellenic Postbank September 2005  –  November 2005  (3 months) Athens, Greece Languages English Native or bilingual proficiency Greek Native or bilingual proficiency German Full professional proficiency Italian Professional working proficiency Sign Languages (Irish) Elementary proficiency Turkish Elementary proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency German Full professional proficiency Italian Professional working proficiency Sign Languages (Irish) Elementary proficiency Turkish Elementary proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency German Full professional proficiency Italian Professional working proficiency Sign Languages (Irish) Elementary proficiency Turkish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Elementary proficiency Elementary proficiency Skills Google Adwords E-commerce Marketing Strategy Strategy Online Marketing Product Management Product Marketing Digital Marketing Marketing Team Management Web Analytics Project Management Sales SEM Cross-functional Team... Business Development Google Analytics Online Advertising New Media SEO Event Management Search Advertising See 7+     See less Skills  Google Adwords E-commerce Marketing Strategy Strategy Online Marketing Product Management Product Marketing Digital Marketing Marketing Team Management Web Analytics Project Management Sales SEM Cross-functional Team... Business Development Google Analytics Online Advertising New Media SEO Event Management Search Advertising See 7+     See less Google Adwords E-commerce Marketing Strategy Strategy Online Marketing Product Management Product Marketing Digital Marketing Marketing Team Management Web Analytics Project Management Sales SEM Cross-functional Team... Business Development Google Analytics Online Advertising New Media SEO Event Management Search Advertising See 7+     See less Google Adwords E-commerce Marketing Strategy Strategy Online Marketing Product Management Product Marketing Digital Marketing Marketing Team Management Web Analytics Project Management Sales SEM Cross-functional Team... Business Development Google Analytics Online Advertising New Media SEO Event Management Search Advertising See 7+     See less Education University of Pennsylvania - The Wharton School Google Marketing Academy,  Marketing/Marketing Management 2014  – 2014 Google's executive education programme in partnership with the Wharton School. Participation in the programme is limited and based on manager nomination for exceptional performers. \n \nModules included: \nContent: \n- Analysing Markets & Customers \n- Smart Pricing Strategies \n- Corporate Finance for Marketers \n- New Product Research & Development \n- Consumer Psychology  \n- Marketing Metrics \n \n University of Warwick - Warwick Business School MSc Marketing & Strategy 2007  – 2008 Dissertation: “Co-creation of value and its implications for the book publishing industry” (Distinction – 75%) Athens University of Economics and Business Business Administration , 8.28/10 2002  – 2006 Università degli Studi di Siena Erasmus semester 2004  – 2005 Awarded an EU scholarship for exceptional academic performance in the Erasmus Programme (Socrates Program funds) University of Pennsylvania - The Wharton School Google Marketing Academy,  Marketing/Marketing Management 2014  – 2014 Google's executive education programme in partnership with the Wharton School. Participation in the programme is limited and based on manager nomination for exceptional performers. \n \nModules included: \nContent: \n- Analysing Markets & Customers \n- Smart Pricing Strategies \n- Corporate Finance for Marketers \n- New Product Research & Development \n- Consumer Psychology  \n- Marketing Metrics \n \n University of Pennsylvania - The Wharton School Google Marketing Academy,  Marketing/Marketing Management 2014  – 2014 Google's executive education programme in partnership with the Wharton School. Participation in the programme is limited and based on manager nomination for exceptional performers. \n \nModules included: \nContent: \n- Analysing Markets & Customers \n- Smart Pricing Strategies \n- Corporate Finance for Marketers \n- New Product Research & Development \n- Consumer Psychology  \n- Marketing Metrics \n \n University of Pennsylvania - The Wharton School Google Marketing Academy,  Marketing/Marketing Management 2014  – 2014 Google's executive education programme in partnership with the Wharton School. Participation in the programme is limited and based on manager nomination for exceptional performers. \n \nModules included: \nContent: \n- Analysing Markets & Customers \n- Smart Pricing Strategies \n- Corporate Finance for Marketers \n- New Product Research & Development \n- Consumer Psychology  \n- Marketing Metrics \n \n University of Warwick - Warwick Business School MSc Marketing & Strategy 2007  – 2008 Dissertation: “Co-creation of value and its implications for the book publishing industry” (Distinction – 75%) University of Warwick - Warwick Business School MSc Marketing & Strategy 2007  – 2008 Dissertation: “Co-creation of value and its implications for the book publishing industry” (Distinction – 75%) University of Warwick - Warwick Business School MSc Marketing & Strategy 2007  – 2008 Dissertation: “Co-creation of value and its implications for the book publishing industry” (Distinction – 75%) Athens University of Economics and Business Business Administration , 8.28/10 2002  – 2006 Athens University of Economics and Business Business Administration , 8.28/10 2002  – 2006 Athens University of Economics and Business Business Administration , 8.28/10 2002  – 2006 Università degli Studi di Siena Erasmus semester 2004  – 2005 Awarded an EU scholarship for exceptional academic performance in the Erasmus Programme (Socrates Program funds) Università degli Studi di Siena Erasmus semester 2004  – 2005 Awarded an EU scholarship for exceptional academic performance in the Erasmus Programme (Socrates Program funds) Università degli Studi di Siena Erasmus semester 2004  – 2005 Awarded an EU scholarship for exceptional academic performance in the Erasmus Programme (Socrates Program funds) ", "Experience Accounting Manager Google April 2015  – Present (5 months) Global Process Manager - Payroll Accounting Google October 2012  – Present (2 years 11 months) Dublin Senior Financial Accountant Google June 2010  –  September 2012  (2 years 4 months) Dublin Management Accountant Google April 2007  –  May 2010  (3 years 2 months) Dublin Intercompany Accountant Merrill Lynch September 2004  –  March 2007  (2 years 7 months) Accounting Manager Google April 2015  – Present (5 months) Accounting Manager Google April 2015  – Present (5 months) Global Process Manager - Payroll Accounting Google October 2012  – Present (2 years 11 months) Dublin Global Process Manager - Payroll Accounting Google October 2012  – Present (2 years 11 months) Dublin Senior Financial Accountant Google June 2010  –  September 2012  (2 years 4 months) Dublin Senior Financial Accountant Google June 2010  –  September 2012  (2 years 4 months) Dublin Management Accountant Google April 2007  –  May 2010  (3 years 2 months) Dublin Management Accountant Google April 2007  –  May 2010  (3 years 2 months) Dublin Intercompany Accountant Merrill Lynch September 2004  –  March 2007  (2 years 7 months) Intercompany Accountant Merrill Lynch September 2004  –  March 2007  (2 years 7 months) Skills Financial Reporting Financial Analysis Skills  Financial Reporting Financial Analysis Financial Reporting Financial Analysis Financial Reporting Financial Analysis Education University College Dublin BComm 2001  – 2004 University College Dublin BComm 2001  – 2004 University College Dublin BComm 2001  – 2004 University College Dublin BComm 2001  – 2004 ", "Experience EMEA Compliance Accounting Manager Google March 2014  – Present (1 year 6 months) Dublin - Responsible for managing the financial and tax reporting of 14 EMEA legal entities \n EMEA Facilities & Fixed Assets Accountant Google January 2011  –  February 2014  (3 years 2 months) Dublin, Ireland Senior Financial Accountant - US GAAP & Compliance Google June 2008  –  December 2010  (2 years 7 months) Dublin, Ireland Financial Accountant - US GAAP & Compliance Google January 2008  –  May 2008  (5 months) Dublin, Ireland Assistant Financial Accountant - US GAAP & Compliance Google September 2006  –  December 2007  (1 year 4 months) Dublin, Ireland Portfolio Analyst JPMorgan Chase November 2005  –  February 2006  (4 months) Sydney, Australia Project Accountant Arab Bank Australia August 2005  –  November 2005  (4 months) Sydney, Australia Assistant Financial Accountant (Reinsurance) Rabobank March 2004  –  May 2005  (1 year 3 months) Dublin, Ireland Senior Fund Accountant PNC Financial Services Group October 2001  –  February 2004  (2 years 5 months) Dublin, Ireland EMEA Compliance Accounting Manager Google March 2014  – Present (1 year 6 months) Dublin - Responsible for managing the financial and tax reporting of 14 EMEA legal entities \n EMEA Compliance Accounting Manager Google March 2014  – Present (1 year 6 months) Dublin - Responsible for managing the financial and tax reporting of 14 EMEA legal entities \n EMEA Facilities & Fixed Assets Accountant Google January 2011  –  February 2014  (3 years 2 months) Dublin, Ireland EMEA Facilities & Fixed Assets Accountant Google January 2011  –  February 2014  (3 years 2 months) Dublin, Ireland Senior Financial Accountant - US GAAP & Compliance Google June 2008  –  December 2010  (2 years 7 months) Dublin, Ireland Senior Financial Accountant - US GAAP & Compliance Google June 2008  –  December 2010  (2 years 7 months) Dublin, Ireland Financial Accountant - US GAAP & Compliance Google January 2008  –  May 2008  (5 months) Dublin, Ireland Financial Accountant - US GAAP & Compliance Google January 2008  –  May 2008  (5 months) Dublin, Ireland Assistant Financial Accountant - US GAAP & Compliance Google September 2006  –  December 2007  (1 year 4 months) Dublin, Ireland Assistant Financial Accountant - US GAAP & Compliance Google September 2006  –  December 2007  (1 year 4 months) Dublin, Ireland Portfolio Analyst JPMorgan Chase November 2005  –  February 2006  (4 months) Sydney, Australia Portfolio Analyst JPMorgan Chase November 2005  –  February 2006  (4 months) Sydney, Australia Project Accountant Arab Bank Australia August 2005  –  November 2005  (4 months) Sydney, Australia Project Accountant Arab Bank Australia August 2005  –  November 2005  (4 months) Sydney, Australia Assistant Financial Accountant (Reinsurance) Rabobank March 2004  –  May 2005  (1 year 3 months) Dublin, Ireland Assistant Financial Accountant (Reinsurance) Rabobank March 2004  –  May 2005  (1 year 3 months) Dublin, Ireland Senior Fund Accountant PNC Financial Services Group October 2001  –  February 2004  (2 years 5 months) Dublin, Ireland Senior Fund Accountant PNC Financial Services Group October 2001  –  February 2004  (2 years 5 months) Dublin, Ireland Skills Financial Reporting Financial Analysis Accounting Financial Accounting Finance Managerial Finance Cash Management Cash Flow Mergers Compliance Risk Management Business Strategy Budgets Payroll Financial Audits Auditing Internal Controls Hyperion Enterprise US GAAP People Management People Development Lean Management Financial Risk IFRS Oracle Applications Corporate Tax VAT Capital Allowances See 13+     See less Skills  Financial Reporting Financial Analysis Accounting Financial Accounting Finance Managerial Finance Cash Management Cash Flow Mergers Compliance Risk Management Business Strategy Budgets Payroll Financial Audits Auditing Internal Controls Hyperion Enterprise US GAAP People Management People Development Lean Management Financial Risk IFRS Oracle Applications Corporate Tax VAT Capital Allowances See 13+     See less Financial Reporting Financial Analysis Accounting Financial Accounting Finance Managerial Finance Cash Management Cash Flow Mergers Compliance Risk Management Business Strategy Budgets Payroll Financial Audits Auditing Internal Controls Hyperion Enterprise US GAAP People Management People Development Lean Management Financial Risk IFRS Oracle Applications Corporate Tax VAT Capital Allowances See 13+     See less Financial Reporting Financial Analysis Accounting Financial Accounting Finance Managerial Finance Cash Management Cash Flow Mergers Compliance Risk Management Business Strategy Budgets Payroll Financial Audits Auditing Internal Controls Hyperion Enterprise US GAAP People Management People Development Lean Management Financial Risk IFRS Oracle Applications Corporate Tax VAT Capital Allowances See 13+     See less Education Association of Chartered Certified Accountants Accounting Qualification 2007 Dublin City University International Business and French , 2.1 Honours 1997  – 2001 Reims Management School Business & French 1999  – 2000 ERASMUS year in Reims, France as part of DCU degree. St Muredach's College, Ballina, Co. Mayo Leaving Cert , 555 points achieved 1991  – 1997 Association of Chartered Certified Accountants Accounting Qualification 2007 Association of Chartered Certified Accountants Accounting Qualification 2007 Association of Chartered Certified Accountants Accounting Qualification 2007 Dublin City University International Business and French , 2.1 Honours 1997  – 2001 Dublin City University International Business and French , 2.1 Honours 1997  – 2001 Dublin City University International Business and French , 2.1 Honours 1997  – 2001 Reims Management School Business & French 1999  – 2000 ERASMUS year in Reims, France as part of DCU degree. Reims Management School Business & French 1999  – 2000 ERASMUS year in Reims, France as part of DCU degree. Reims Management School Business & French 1999  – 2000 ERASMUS year in Reims, France as part of DCU degree. St Muredach's College, Ballina, Co. Mayo Leaving Cert , 555 points achieved 1991  – 1997 St Muredach's College, Ballina, Co. Mayo Leaving Cert , 555 points achieved 1991  – 1997 St Muredach's College, Ballina, Co. Mayo Leaving Cert , 555 points achieved 1991  – 1997 ", "Experience Accounting and Controls IRUs Global Operations & Business Controller Google August 2015  – Present (1 month) Global Hardware & Infrastructure Accounting Manager - APAC - US GAAP & Local Compliance Google Australia Pty Ltd June 2013  –  August 2015  (2 years 3 months) Senior Accountant II - A&C - APAC US GAAP interim Regional Lead of Fixed Assets Google Australia Pty Ltd January 2013  –  June 2013  (6 months) Senior Accountant II - A&C - US GAAP - APAC RL of Reporting, BS recs, Eng, Legal & Temp Servs Google Australia Pty Ltd May 2012  –  December 2012  (8 months) Sydney - AU Working on the following tasks: \n- Managing global processes (accounting accruals system design & implementation) across NORTAM, EMEA, APAC and LATAM; \n- Consolidation of APAC figures and report to US headquarter (month end presentations to US team); \n- Implementation and monitoring of Global processes throughout APAC region, involving more than 40 entities; \n- Implementation and monitoring of Global tools on A&C controls throughout APAC region, involving more than 40 entities; \n- Improving communications between headquarters and local accounting teams throughout APAC (Japan, Australia, Singapore, Malaysia, New Zealand, China, India, Taiwan, Korea, Thailand); \n- Responsible for providing training on internal systems; \n- Implementation and systems administrator for APAC (reconciliations, metrics); \n- Regional Lead of USGAAP team for Engineering, Legal, Temporary Services, BS & Reporting. Senior Accountant I for APAC - USGAAP Google Australia Pty Ltd November 2009  –  May 2012  (2 years 7 months) Australia Working on the following tasks: \n- Managing global processes (accounting accruals system design & implementation) across NORTAM, EMEA, APAC and LATAM; \n- Consolidation of APAC figures and report to US headquarter (month end presentations to US team); \n- Implementation and monitoring of Global processes throughout APAC region, involving more than 30 entities; \n- Implementation and monitoring of Global tools on A&C controls throughout APAC region, involving more than 30 entities; \n- Improving communications between headquarters and local accounting teams throughout APAC (Japan, Australia, Singapore, Malaysia, New Zealand, China, India, Taiwan, Korea); \n- Responsible for providing training on internal systems; \n- Implementation and systems administrator for APAC (reconciliations, metrics); \n- Regional Lead of USGAAP team for Engineering, Legal, Temporary Services, BS & Reporting. Accountant II for SEAPAC Google Australia Pty Ltd April 2008  –  October 2009  (1 year 7 months) Australia •\tMonth-end close entries and additional reconciliations as necessary, for entities in Australia, Singapore, New Zealand, Thailand and Malaysia; \n•\tThe preparation of financial statements for Australian subsidiaries; \n•\tReporting in compliance with USGAAP; \n•\tSupport of quarterly reviews and annual audit requirements; \n•\tDocumenting policies and procedures for areas of responsibility; \n•\tAssisting in the Finance Operations functions as necessary; \n•\tIdentifying opportunities for process improvements or automation and then driving the formulation and implamantation of the solution; \n•\tSupport on GST return calculation for Australian subsidiaries. Sr Accountant Google Brasil January 2007  –  April 2008  (1 year 4 months) Brazil •\tCoordinate Accounts Payable; \n•\tSupport Accounts Receivable (local billing implementation); \n•\tTreasury routine – cash flow planning, inter company wires (Import/Export); \n•\tFinance x Accountant reconciliation; \n•\tLogistics control and support to importation processes; \n•\tImplementation of Oracle 11i (Single Instance) – AP, RI (local), PO and Treasury modules; \n•\tSupport any other Finance project. Sr Treasury Analyst EMC 2004  –  2006  (2 years) •\tCoordinate Accounts Payable and Receivable; \n•\tTreasury routine – financial planning, cash flow, swap, inter company wires (Import/Export); \n•\tFinance x Account reconciliation; \n•\tBudget/Forecast x YTD control; \n•\tTreasury , Processes and Control reports to Corp; \n•\tCredit Analysis of Latin America customers; \n•\tPartner commission calculation and control; \n• Oracle implementation (upgrade) Finance Assistant Microsoft 2002  –  2004  (2 years) Assistant IBGC 2002  –  2002  (less than a year) Accounting and Controls IRUs Global Operations & Business Controller Google August 2015  – Present (1 month) Accounting and Controls IRUs Global Operations & Business Controller Google August 2015  – Present (1 month) Global Hardware & Infrastructure Accounting Manager - APAC - US GAAP & Local Compliance Google Australia Pty Ltd June 2013  –  August 2015  (2 years 3 months) Global Hardware & Infrastructure Accounting Manager - APAC - US GAAP & Local Compliance Google Australia Pty Ltd June 2013  –  August 2015  (2 years 3 months) Senior Accountant II - A&C - APAC US GAAP interim Regional Lead of Fixed Assets Google Australia Pty Ltd January 2013  –  June 2013  (6 months) Senior Accountant II - A&C - APAC US GAAP interim Regional Lead of Fixed Assets Google Australia Pty Ltd January 2013  –  June 2013  (6 months) Senior Accountant II - A&C - US GAAP - APAC RL of Reporting, BS recs, Eng, Legal & Temp Servs Google Australia Pty Ltd May 2012  –  December 2012  (8 months) Sydney - AU Working on the following tasks: \n- Managing global processes (accounting accruals system design & implementation) across NORTAM, EMEA, APAC and LATAM; \n- Consolidation of APAC figures and report to US headquarter (month end presentations to US team); \n- Implementation and monitoring of Global processes throughout APAC region, involving more than 40 entities; \n- Implementation and monitoring of Global tools on A&C controls throughout APAC region, involving more than 40 entities; \n- Improving communications between headquarters and local accounting teams throughout APAC (Japan, Australia, Singapore, Malaysia, New Zealand, China, India, Taiwan, Korea, Thailand); \n- Responsible for providing training on internal systems; \n- Implementation and systems administrator for APAC (reconciliations, metrics); \n- Regional Lead of USGAAP team for Engineering, Legal, Temporary Services, BS & Reporting. Senior Accountant II - A&C - US GAAP - APAC RL of Reporting, BS recs, Eng, Legal & Temp Servs Google Australia Pty Ltd May 2012  –  December 2012  (8 months) Sydney - AU Working on the following tasks: \n- Managing global processes (accounting accruals system design & implementation) across NORTAM, EMEA, APAC and LATAM; \n- Consolidation of APAC figures and report to US headquarter (month end presentations to US team); \n- Implementation and monitoring of Global processes throughout APAC region, involving more than 40 entities; \n- Implementation and monitoring of Global tools on A&C controls throughout APAC region, involving more than 40 entities; \n- Improving communications between headquarters and local accounting teams throughout APAC (Japan, Australia, Singapore, Malaysia, New Zealand, China, India, Taiwan, Korea, Thailand); \n- Responsible for providing training on internal systems; \n- Implementation and systems administrator for APAC (reconciliations, metrics); \n- Regional Lead of USGAAP team for Engineering, Legal, Temporary Services, BS & Reporting. Senior Accountant I for APAC - USGAAP Google Australia Pty Ltd November 2009  –  May 2012  (2 years 7 months) Australia Working on the following tasks: \n- Managing global processes (accounting accruals system design & implementation) across NORTAM, EMEA, APAC and LATAM; \n- Consolidation of APAC figures and report to US headquarter (month end presentations to US team); \n- Implementation and monitoring of Global processes throughout APAC region, involving more than 30 entities; \n- Implementation and monitoring of Global tools on A&C controls throughout APAC region, involving more than 30 entities; \n- Improving communications between headquarters and local accounting teams throughout APAC (Japan, Australia, Singapore, Malaysia, New Zealand, China, India, Taiwan, Korea); \n- Responsible for providing training on internal systems; \n- Implementation and systems administrator for APAC (reconciliations, metrics); \n- Regional Lead of USGAAP team for Engineering, Legal, Temporary Services, BS & Reporting. Senior Accountant I for APAC - USGAAP Google Australia Pty Ltd November 2009  –  May 2012  (2 years 7 months) Australia Working on the following tasks: \n- Managing global processes (accounting accruals system design & implementation) across NORTAM, EMEA, APAC and LATAM; \n- Consolidation of APAC figures and report to US headquarter (month end presentations to US team); \n- Implementation and monitoring of Global processes throughout APAC region, involving more than 30 entities; \n- Implementation and monitoring of Global tools on A&C controls throughout APAC region, involving more than 30 entities; \n- Improving communications between headquarters and local accounting teams throughout APAC (Japan, Australia, Singapore, Malaysia, New Zealand, China, India, Taiwan, Korea); \n- Responsible for providing training on internal systems; \n- Implementation and systems administrator for APAC (reconciliations, metrics); \n- Regional Lead of USGAAP team for Engineering, Legal, Temporary Services, BS & Reporting. Accountant II for SEAPAC Google Australia Pty Ltd April 2008  –  October 2009  (1 year 7 months) Australia •\tMonth-end close entries and additional reconciliations as necessary, for entities in Australia, Singapore, New Zealand, Thailand and Malaysia; \n•\tThe preparation of financial statements for Australian subsidiaries; \n•\tReporting in compliance with USGAAP; \n•\tSupport of quarterly reviews and annual audit requirements; \n•\tDocumenting policies and procedures for areas of responsibility; \n•\tAssisting in the Finance Operations functions as necessary; \n•\tIdentifying opportunities for process improvements or automation and then driving the formulation and implamantation of the solution; \n•\tSupport on GST return calculation for Australian subsidiaries. Accountant II for SEAPAC Google Australia Pty Ltd April 2008  –  October 2009  (1 year 7 months) Australia •\tMonth-end close entries and additional reconciliations as necessary, for entities in Australia, Singapore, New Zealand, Thailand and Malaysia; \n•\tThe preparation of financial statements for Australian subsidiaries; \n•\tReporting in compliance with USGAAP; \n•\tSupport of quarterly reviews and annual audit requirements; \n•\tDocumenting policies and procedures for areas of responsibility; \n•\tAssisting in the Finance Operations functions as necessary; \n•\tIdentifying opportunities for process improvements or automation and then driving the formulation and implamantation of the solution; \n•\tSupport on GST return calculation for Australian subsidiaries. Sr Accountant Google Brasil January 2007  –  April 2008  (1 year 4 months) Brazil •\tCoordinate Accounts Payable; \n•\tSupport Accounts Receivable (local billing implementation); \n•\tTreasury routine – cash flow planning, inter company wires (Import/Export); \n•\tFinance x Accountant reconciliation; \n•\tLogistics control and support to importation processes; \n•\tImplementation of Oracle 11i (Single Instance) – AP, RI (local), PO and Treasury modules; \n•\tSupport any other Finance project. Sr Accountant Google Brasil January 2007  –  April 2008  (1 year 4 months) Brazil •\tCoordinate Accounts Payable; \n•\tSupport Accounts Receivable (local billing implementation); \n•\tTreasury routine – cash flow planning, inter company wires (Import/Export); \n•\tFinance x Accountant reconciliation; \n•\tLogistics control and support to importation processes; \n•\tImplementation of Oracle 11i (Single Instance) – AP, RI (local), PO and Treasury modules; \n•\tSupport any other Finance project. Sr Treasury Analyst EMC 2004  –  2006  (2 years) •\tCoordinate Accounts Payable and Receivable; \n•\tTreasury routine – financial planning, cash flow, swap, inter company wires (Import/Export); \n•\tFinance x Account reconciliation; \n•\tBudget/Forecast x YTD control; \n•\tTreasury , Processes and Control reports to Corp; \n•\tCredit Analysis of Latin America customers; \n•\tPartner commission calculation and control; \n• Oracle implementation (upgrade) Sr Treasury Analyst EMC 2004  –  2006  (2 years) •\tCoordinate Accounts Payable and Receivable; \n•\tTreasury routine – financial planning, cash flow, swap, inter company wires (Import/Export); \n•\tFinance x Account reconciliation; \n•\tBudget/Forecast x YTD control; \n•\tTreasury , Processes and Control reports to Corp; \n•\tCredit Analysis of Latin America customers; \n•\tPartner commission calculation and control; \n• Oracle implementation (upgrade) Finance Assistant Microsoft 2002  –  2004  (2 years) Finance Assistant Microsoft 2002  –  2004  (2 years) Assistant IBGC 2002  –  2002  (less than a year) Assistant IBGC 2002  –  2002  (less than a year) Skills Accounting Consolidation US GAAP Accounts Receivable Accounts Payable Financial Analysis Financial Reporting Financial Accounting SOX Cash Flow Analysis Excel Balance Compliance Internal Controls Process Engineering MIS Problem Solving SAP Process Improvement Business Analysis ERP Team Leadership Microsoft Office Negotiation Audit Account Management Training Essbase Project Management Oracle Leadership Vendor Management Auditing Management Forecasting Strategic Financial... Hyperion Enterprise Financial Modeling Internal Audit Managerial Finance Finance Account Reconciliation Business Process... Financial Audits Oracle Applications General Ledger GAAP Tax Treasury See 35+     See less Skills  Accounting Consolidation US GAAP Accounts Receivable Accounts Payable Financial Analysis Financial Reporting Financial Accounting SOX Cash Flow Analysis Excel Balance Compliance Internal Controls Process Engineering MIS Problem Solving SAP Process Improvement Business Analysis ERP Team Leadership Microsoft Office Negotiation Audit Account Management Training Essbase Project Management Oracle Leadership Vendor Management Auditing Management Forecasting Strategic Financial... Hyperion Enterprise Financial Modeling Internal Audit Managerial Finance Finance Account Reconciliation Business Process... Financial Audits Oracle Applications General Ledger GAAP Tax Treasury See 35+     See less Accounting Consolidation US GAAP Accounts Receivable Accounts Payable Financial Analysis Financial Reporting Financial Accounting SOX Cash Flow Analysis Excel Balance Compliance Internal Controls Process Engineering MIS Problem Solving SAP Process Improvement Business Analysis ERP Team Leadership Microsoft Office Negotiation Audit Account Management Training Essbase Project Management Oracle Leadership Vendor Management Auditing Management Forecasting Strategic Financial... Hyperion Enterprise Financial Modeling Internal Audit Managerial Finance Finance Account Reconciliation Business Process... Financial Audits Oracle Applications General Ledger GAAP Tax Treasury See 35+     See less Accounting Consolidation US GAAP Accounts Receivable Accounts Payable Financial Analysis Financial Reporting Financial Accounting SOX Cash Flow Analysis Excel Balance Compliance Internal Controls Process Engineering MIS Problem Solving SAP Process Improvement Business Analysis ERP Team Leadership Microsoft Office Negotiation Audit Account Management Training Essbase Project Management Oracle Leadership Vendor Management Auditing Management Forecasting Strategic Financial... Hyperion Enterprise Financial Modeling Internal Audit Managerial Finance Finance Account Reconciliation Business Process... Financial Audits Oracle Applications General Ledger GAAP Tax Treasury See 35+     See less Education CPA Australia CPA Program - Professional Level 2012  – 2015 Activities and Societies:  Contemporary Business Issues; Advanced Audit & Assurance ,  Ethics & Governance CPA Australia CPA Foundation Level 2009  – 2011 Activities and Societies:  Accounting Principles;\nAccounting Management;\nBusiness Law. Fundação Getulio Vargas International Controllership 2006  – 2006 Universidade Presbiteriana Mackenzie Master,  Controllership 2002  – 2003 Universidade Presbiteriana Mackenzie Bachelor,  Business Administration 1993  – 1997 Leonardo da Vinci CPA Australia CPA Program - Professional Level 2012  – 2015 Activities and Societies:  Contemporary Business Issues; Advanced Audit & Assurance ,  Ethics & Governance CPA Australia CPA Program - Professional Level 2012  – 2015 Activities and Societies:  Contemporary Business Issues; Advanced Audit & Assurance ,  Ethics & Governance CPA Australia CPA Program - Professional Level 2012  – 2015 Activities and Societies:  Contemporary Business Issues; Advanced Audit & Assurance ,  Ethics & Governance CPA Australia CPA Foundation Level 2009  – 2011 Activities and Societies:  Accounting Principles;\nAccounting Management;\nBusiness Law. CPA Australia CPA Foundation Level 2009  – 2011 Activities and Societies:  Accounting Principles;\nAccounting Management;\nBusiness Law. CPA Australia CPA Foundation Level 2009  – 2011 Activities and Societies:  Accounting Principles;\nAccounting Management;\nBusiness Law. Fundação Getulio Vargas International Controllership 2006  – 2006 Fundação Getulio Vargas International Controllership 2006  – 2006 Fundação Getulio Vargas International Controllership 2006  – 2006 Universidade Presbiteriana Mackenzie Master,  Controllership 2002  – 2003 Universidade Presbiteriana Mackenzie Master,  Controllership 2002  – 2003 Universidade Presbiteriana Mackenzie Master,  Controllership 2002  – 2003 Universidade Presbiteriana Mackenzie Bachelor,  Business Administration 1993  – 1997 Universidade Presbiteriana Mackenzie Bachelor,  Business Administration 1993  – 1997 Universidade Presbiteriana Mackenzie Bachelor,  Business Administration 1993  – 1997 Leonardo da Vinci Leonardo da Vinci Leonardo da Vinci ", "Experience Senior Financial Accountant – Global Infrastructure & Hardware Team – APAC Google June 2014  – Present (1 year 3 months) As part of my role on the Global Infrastructure & Hardware Team, I have been responsible for completing the monthly financial accounting activites for capital expenditure and equipment and related operating expenses for the APAC entity portfolio. \n \nThese duties include: \n \n- Taking ownership of day-to-day financial accounting duties (e.g.preparing, reviewing and/or approving monthly capitalisations, retirements, cost adjustments and intercompany entries coming from the business, depreciation expense analysis, preparation of accruals, prepayments, amortisations, adjustments and reclass entries); \n \n- Participating in systems and process improvements projects to ensure that our systems continue to be robust enough to manage the changing environment in which we operate; \n \n- The performance of monthly and quarterly variance analysis and reporting to the US based consolidations team; \n \n- Managing information requests and organising communications to and from the local compliance teams, other finance functional teams and internal and external audit; \n \n- Playing a key role in maintaining the integrity of internal controls around such areas as the preparation and independent review of balance sheet account reconciliations; and \n \n- Participating in the joint management of relationships and deliverables from our global shared services vendors. Financial Accountant – US GAAP – APAC Google November 2012  –  June 2014  (1 year 8 months) During my my time with Google, working as a Financial Accountant on the US GAAP team, I have performed the financial accounting function for facilities, travel and entertainment, legal and finance related operating expenses for the APAC entity portfolio. \n \nAs part of this role, I have been responsible for: \n \n- Taking ownership of day-to-day financial accounting duties (e.g. Preparation of accruals, prepayments, amortisations, lease straight lines, adjustments and reclass entries); \n \n- The performance of monthly and quarterly variance analysis and reporting to the US based consolidations team; \n \n- Managing information requests and organising communications to and from the local compliance teams, other finance functional teams and internal and external audit; \n \n- Playing a key role in maintaining the integrity of internal controls around such areas as the preparation and independent review of balance sheet account reconciliations; and \n \n- Participating in the joint management of relationships and deliverables from our global shared services vendors. \n \nOutside the scope of my ordinary responsibilities, I have also been involved with: \n \n- Becoming the Finance Disaster Recovery Communications Project Manager for APAC; and \n \n- Co-presenting on an Accounting Concepts and Applications course for our Finance Operations functional team. Assistant Manager - Audit & Advisory KPMG Australia June 2008  –  October 2012  (4 years 5 months) • Nov-11 – Oct-12 – Assistant Manager \n• Jan-10 – Oct-11 – Senior Accountant \n• Jun-08 – Dec-09 – Accountant \n \nDuring my four and a half years with KPMG, I worked in the Audit and Advisory business of the Private Enterprise Division. Working predominantly on external statutory financial statement and prudential compliance audits, I have been involved in all aspects of the audit process, from initial risk assessment and planning, to controls and substantive audit testing, through to completion, financial statements and board reporting. \n \nI have also had exposure to a number of internal audit and other assurance engagements, working closely with client business partners and management to help better understand the existing control environment and deficiencies, and to identify areas to mitigate control and business risk. \n \nAdditionally, I spent a three month period in KPMG’s business advisory and tax division, working predominantly on the provision of account maintenance and financial statement preparation services for a number of our self managed superannuation fund clients. \n \nMy industry experience includes clients operating in the following sectors: \n- Financial Services (Building Societies/Credit Unions); \n- Manufacturing;  \n- Local Government; \n- Mining and Mineral Exploration; and \n- Not-For-Profit Sector (Aged Care and Education). Barman Antill Park Country Golf Club February 2005  –  April 2008  (3 years 3 months) Senior Financial Accountant – Global Infrastructure & Hardware Team – APAC Google June 2014  – Present (1 year 3 months) As part of my role on the Global Infrastructure & Hardware Team, I have been responsible for completing the monthly financial accounting activites for capital expenditure and equipment and related operating expenses for the APAC entity portfolio. \n \nThese duties include: \n \n- Taking ownership of day-to-day financial accounting duties (e.g.preparing, reviewing and/or approving monthly capitalisations, retirements, cost adjustments and intercompany entries coming from the business, depreciation expense analysis, preparation of accruals, prepayments, amortisations, adjustments and reclass entries); \n \n- Participating in systems and process improvements projects to ensure that our systems continue to be robust enough to manage the changing environment in which we operate; \n \n- The performance of monthly and quarterly variance analysis and reporting to the US based consolidations team; \n \n- Managing information requests and organising communications to and from the local compliance teams, other finance functional teams and internal and external audit; \n \n- Playing a key role in maintaining the integrity of internal controls around such areas as the preparation and independent review of balance sheet account reconciliations; and \n \n- Participating in the joint management of relationships and deliverables from our global shared services vendors. Senior Financial Accountant – Global Infrastructure & Hardware Team – APAC Google June 2014  – Present (1 year 3 months) As part of my role on the Global Infrastructure & Hardware Team, I have been responsible for completing the monthly financial accounting activites for capital expenditure and equipment and related operating expenses for the APAC entity portfolio. \n \nThese duties include: \n \n- Taking ownership of day-to-day financial accounting duties (e.g.preparing, reviewing and/or approving monthly capitalisations, retirements, cost adjustments and intercompany entries coming from the business, depreciation expense analysis, preparation of accruals, prepayments, amortisations, adjustments and reclass entries); \n \n- Participating in systems and process improvements projects to ensure that our systems continue to be robust enough to manage the changing environment in which we operate; \n \n- The performance of monthly and quarterly variance analysis and reporting to the US based consolidations team; \n \n- Managing information requests and organising communications to and from the local compliance teams, other finance functional teams and internal and external audit; \n \n- Playing a key role in maintaining the integrity of internal controls around such areas as the preparation and independent review of balance sheet account reconciliations; and \n \n- Participating in the joint management of relationships and deliverables from our global shared services vendors. Financial Accountant – US GAAP – APAC Google November 2012  –  June 2014  (1 year 8 months) During my my time with Google, working as a Financial Accountant on the US GAAP team, I have performed the financial accounting function for facilities, travel and entertainment, legal and finance related operating expenses for the APAC entity portfolio. \n \nAs part of this role, I have been responsible for: \n \n- Taking ownership of day-to-day financial accounting duties (e.g. Preparation of accruals, prepayments, amortisations, lease straight lines, adjustments and reclass entries); \n \n- The performance of monthly and quarterly variance analysis and reporting to the US based consolidations team; \n \n- Managing information requests and organising communications to and from the local compliance teams, other finance functional teams and internal and external audit; \n \n- Playing a key role in maintaining the integrity of internal controls around such areas as the preparation and independent review of balance sheet account reconciliations; and \n \n- Participating in the joint management of relationships and deliverables from our global shared services vendors. \n \nOutside the scope of my ordinary responsibilities, I have also been involved with: \n \n- Becoming the Finance Disaster Recovery Communications Project Manager for APAC; and \n \n- Co-presenting on an Accounting Concepts and Applications course for our Finance Operations functional team. Financial Accountant – US GAAP – APAC Google November 2012  –  June 2014  (1 year 8 months) During my my time with Google, working as a Financial Accountant on the US GAAP team, I have performed the financial accounting function for facilities, travel and entertainment, legal and finance related operating expenses for the APAC entity portfolio. \n \nAs part of this role, I have been responsible for: \n \n- Taking ownership of day-to-day financial accounting duties (e.g. Preparation of accruals, prepayments, amortisations, lease straight lines, adjustments and reclass entries); \n \n- The performance of monthly and quarterly variance analysis and reporting to the US based consolidations team; \n \n- Managing information requests and organising communications to and from the local compliance teams, other finance functional teams and internal and external audit; \n \n- Playing a key role in maintaining the integrity of internal controls around such areas as the preparation and independent review of balance sheet account reconciliations; and \n \n- Participating in the joint management of relationships and deliverables from our global shared services vendors. \n \nOutside the scope of my ordinary responsibilities, I have also been involved with: \n \n- Becoming the Finance Disaster Recovery Communications Project Manager for APAC; and \n \n- Co-presenting on an Accounting Concepts and Applications course for our Finance Operations functional team. Assistant Manager - Audit & Advisory KPMG Australia June 2008  –  October 2012  (4 years 5 months) • Nov-11 – Oct-12 – Assistant Manager \n• Jan-10 – Oct-11 – Senior Accountant \n• Jun-08 – Dec-09 – Accountant \n \nDuring my four and a half years with KPMG, I worked in the Audit and Advisory business of the Private Enterprise Division. Working predominantly on external statutory financial statement and prudential compliance audits, I have been involved in all aspects of the audit process, from initial risk assessment and planning, to controls and substantive audit testing, through to completion, financial statements and board reporting. \n \nI have also had exposure to a number of internal audit and other assurance engagements, working closely with client business partners and management to help better understand the existing control environment and deficiencies, and to identify areas to mitigate control and business risk. \n \nAdditionally, I spent a three month period in KPMG’s business advisory and tax division, working predominantly on the provision of account maintenance and financial statement preparation services for a number of our self managed superannuation fund clients. \n \nMy industry experience includes clients operating in the following sectors: \n- Financial Services (Building Societies/Credit Unions); \n- Manufacturing;  \n- Local Government; \n- Mining and Mineral Exploration; and \n- Not-For-Profit Sector (Aged Care and Education). Assistant Manager - Audit & Advisory KPMG Australia June 2008  –  October 2012  (4 years 5 months) • Nov-11 – Oct-12 – Assistant Manager \n• Jan-10 – Oct-11 – Senior Accountant \n• Jun-08 – Dec-09 – Accountant \n \nDuring my four and a half years with KPMG, I worked in the Audit and Advisory business of the Private Enterprise Division. Working predominantly on external statutory financial statement and prudential compliance audits, I have been involved in all aspects of the audit process, from initial risk assessment and planning, to controls and substantive audit testing, through to completion, financial statements and board reporting. \n \nI have also had exposure to a number of internal audit and other assurance engagements, working closely with client business partners and management to help better understand the existing control environment and deficiencies, and to identify areas to mitigate control and business risk. \n \nAdditionally, I spent a three month period in KPMG’s business advisory and tax division, working predominantly on the provision of account maintenance and financial statement preparation services for a number of our self managed superannuation fund clients. \n \nMy industry experience includes clients operating in the following sectors: \n- Financial Services (Building Societies/Credit Unions); \n- Manufacturing;  \n- Local Government; \n- Mining and Mineral Exploration; and \n- Not-For-Profit Sector (Aged Care and Education). Barman Antill Park Country Golf Club February 2005  –  April 2008  (3 years 3 months) Barman Antill Park Country Golf Club February 2005  –  April 2008  (3 years 3 months) Languages English Full professional proficiency Dutch Elementary proficiency English Full professional proficiency Dutch Elementary proficiency English Full professional proficiency Dutch Elementary proficiency Full professional proficiency Elementary proficiency Skills External Audit Internal Controls IFRS Financial Accounting Internal Audit Financial Reporting Management Accounting Hyperion Enterprise General Ledger Statutory Accounting Financial Analysis Oracle Skills  External Audit Internal Controls IFRS Financial Accounting Internal Audit Financial Reporting Management Accounting Hyperion Enterprise General Ledger Statutory Accounting Financial Analysis Oracle External Audit Internal Controls IFRS Financial Accounting Internal Audit Financial Reporting Management Accounting Hyperion Enterprise General Ledger Statutory Accounting Financial Analysis Oracle External Audit Internal Controls IFRS Financial Accounting Internal Audit Financial Reporting Management Accounting Hyperion Enterprise General Ledger Statutory Accounting Financial Analysis Oracle Education Institute of Chartered Accountants in Australia Graduate Diploma (ICAA) 2008  – 2011 University of Wollongong Bachelor of Commerce (Deans Scholars), BCom(Dean's Schol),  Accounting 2005  – 2008 Camden High School 1999  – 2004 Institute of Chartered Accountants in Australia Graduate Diploma (ICAA) 2008  – 2011 Institute of Chartered Accountants in Australia Graduate Diploma (ICAA) 2008  – 2011 Institute of Chartered Accountants in Australia Graduate Diploma (ICAA) 2008  – 2011 University of Wollongong Bachelor of Commerce (Deans Scholars), BCom(Dean's Schol),  Accounting 2005  – 2008 University of Wollongong Bachelor of Commerce (Deans Scholars), BCom(Dean's Schol),  Accounting 2005  – 2008 University of Wollongong Bachelor of Commerce (Deans Scholars), BCom(Dean's Schol),  Accounting 2005  – 2008 Camden High School 1999  – 2004 Camden High School 1999  – 2004 Camden High School 1999  – 2004 ", "Experience Finance Team Appurify, Inc. (acquired by Google) October 2012  – Present (2 years 11 months) San Francisco Accountant Blackbox Accelerator, LLC May 2012  – Present (3 years 4 months) Palo Alto Accountant Refresh, Inc. (acquired by LinkedIn) April 2012  – Present (3 years 5 months) Palo Alto Finance Team dotCloud August 2011  – Present (4 years 1 month) San Francisco Bay Area Finance Team TechCrunch November 2009  – Present (5 years 10 months) Bookkeeper PhotoWings May 2008  – Present (7 years 4 months) Operations Manager AddGlobe, LLC March 2008  – Present (7 years 6 months) Accountant Redwood Services, Inc. July 1998  – Present (17 years 2 months) Spending Warden Sipree February 2011  –  December 2014  (3 years 11 months) San Francisco Bay Area Dollar Watcher AccelusHealth Consulting Partners February 2011  –  April 2014  (3 years 3 months) www.accelushealth.com Accountant NextAxiom January 2011  –  July 2013  (2 years 7 months) Bookkeeper Advantage Aviation Charter January 2010  –  July 2013  (3 years 7 months) intern Merrill Lynch August 1998  –  December 1998  (5 months) Finance Team Appurify, Inc. (acquired by Google) October 2012  – Present (2 years 11 months) San Francisco Finance Team Appurify, Inc. (acquired by Google) October 2012  – Present (2 years 11 months) San Francisco Accountant Blackbox Accelerator, LLC May 2012  – Present (3 years 4 months) Palo Alto Accountant Blackbox Accelerator, LLC May 2012  – Present (3 years 4 months) Palo Alto Accountant Refresh, Inc. (acquired by LinkedIn) April 2012  – Present (3 years 5 months) Palo Alto Accountant Refresh, Inc. (acquired by LinkedIn) April 2012  – Present (3 years 5 months) Palo Alto Finance Team dotCloud August 2011  – Present (4 years 1 month) San Francisco Bay Area Finance Team dotCloud August 2011  – Present (4 years 1 month) San Francisco Bay Area Finance Team TechCrunch November 2009  – Present (5 years 10 months) Finance Team TechCrunch November 2009  – Present (5 years 10 months) Bookkeeper PhotoWings May 2008  – Present (7 years 4 months) Bookkeeper PhotoWings May 2008  – Present (7 years 4 months) Operations Manager AddGlobe, LLC March 2008  – Present (7 years 6 months) Operations Manager AddGlobe, LLC March 2008  – Present (7 years 6 months) Accountant Redwood Services, Inc. July 1998  – Present (17 years 2 months) Accountant Redwood Services, Inc. July 1998  – Present (17 years 2 months) Spending Warden Sipree February 2011  –  December 2014  (3 years 11 months) San Francisco Bay Area Spending Warden Sipree February 2011  –  December 2014  (3 years 11 months) San Francisco Bay Area Dollar Watcher AccelusHealth Consulting Partners February 2011  –  April 2014  (3 years 3 months) www.accelushealth.com Dollar Watcher AccelusHealth Consulting Partners February 2011  –  April 2014  (3 years 3 months) www.accelushealth.com Accountant NextAxiom January 2011  –  July 2013  (2 years 7 months) Accountant NextAxiom January 2011  –  July 2013  (2 years 7 months) Bookkeeper Advantage Aviation Charter January 2010  –  July 2013  (3 years 7 months) Bookkeeper Advantage Aviation Charter January 2010  –  July 2013  (3 years 7 months) intern Merrill Lynch August 1998  –  December 1998  (5 months) intern Merrill Lynch August 1998  –  December 1998  (5 months) Skills Management Start-ups Finance Entrepreneurship Financial Modeling Skills  Management Start-ups Finance Entrepreneurship Financial Modeling Management Start-ups Finance Entrepreneurship Financial Modeling Management Start-ups Finance Entrepreneurship Financial Modeling Education San Francisco State University BS,  Financial Services 2001  – 2004 Hillsdale High School 1998 College of San Mateo San Francisco State University Bachelor Degree; Bachelor Degree,  Accounting; Corporate Finance San Francisco State University BS,  Financial Services 2001  – 2004 San Francisco State University BS,  Financial Services 2001  – 2004 San Francisco State University BS,  Financial Services 2001  – 2004 Hillsdale High School 1998 Hillsdale High School 1998 Hillsdale High School 1998 College of San Mateo College of San Mateo College of San Mateo San Francisco State University Bachelor Degree; Bachelor Degree,  Accounting; Corporate Finance San Francisco State University Bachelor Degree; Bachelor Degree,  Accounting; Corporate Finance San Francisco State University Bachelor Degree; Bachelor Degree,  Accounting; Corporate Finance ", "Summary • 10+ years of experience in Accounting and Financial Analysis \n• 6+ years of ERP implementation experience \n• CPA \n• Google CFO Award for Excellence: Fast Close \n• Fundamental knowledge of GAAP and IFRS \n• Solid experience in full cycle accounting and financial statements preparation \n• Working knowledge of Oracle 11i/12r, Workday, MyMicros, Fishbowl Inventory, QuickBooks Pro, MS Office (Excel, Word, PowerPoint), Payroll (ADP, Intuit, WF) \n• Strong analytical and problem solving skills \n• Motivated, efficient, accurate and detail-oriented \n \nSpecialties: Accounting Summary • 10+ years of experience in Accounting and Financial Analysis \n• 6+ years of ERP implementation experience \n• CPA \n• Google CFO Award for Excellence: Fast Close \n• Fundamental knowledge of GAAP and IFRS \n• Solid experience in full cycle accounting and financial statements preparation \n• Working knowledge of Oracle 11i/12r, Workday, MyMicros, Fishbowl Inventory, QuickBooks Pro, MS Office (Excel, Word, PowerPoint), Payroll (ADP, Intuit, WF) \n• Strong analytical and problem solving skills \n• Motivated, efficient, accurate and detail-oriented \n \nSpecialties: Accounting • 10+ years of experience in Accounting and Financial Analysis \n• 6+ years of ERP implementation experience \n• CPA \n• Google CFO Award for Excellence: Fast Close \n• Fundamental knowledge of GAAP and IFRS \n• Solid experience in full cycle accounting and financial statements preparation \n• Working knowledge of Oracle 11i/12r, Workday, MyMicros, Fishbowl Inventory, QuickBooks Pro, MS Office (Excel, Word, PowerPoint), Payroll (ADP, Intuit, WF) \n• Strong analytical and problem solving skills \n• Motivated, efficient, accurate and detail-oriented \n \nSpecialties: Accounting • 10+ years of experience in Accounting and Financial Analysis \n• 6+ years of ERP implementation experience \n• CPA \n• Google CFO Award for Excellence: Fast Close \n• Fundamental knowledge of GAAP and IFRS \n• Solid experience in full cycle accounting and financial statements preparation \n• Working knowledge of Oracle 11i/12r, Workday, MyMicros, Fishbowl Inventory, QuickBooks Pro, MS Office (Excel, Word, PowerPoint), Payroll (ADP, Intuit, WF) \n• Strong analytical and problem solving skills \n• Motivated, efficient, accurate and detail-oriented \n \nSpecialties: Accounting Experience Senior Revenue Accountant Netflix May 2014  – Present (1 year 4 months) Senior Accountant Seagate Technology July 2012  –  May 2014  (1 year 11 months) • Revenue recognition, contra revenue, reserves and accruals \n• Inventory reserves (LCM, PPV, LOH, etc) \n• Royalties \n• Review sales programs \n \n• Special projects:  \n~ SOX - Electronic Audit Evidence \n~ Unified Balance Sheet Recons \n~ Participate in various IT automation and implementation projects Senior Accountant NetLogic Microsystems June 2010  –  May 2012  (2 years) • Comprehensive Revenue Accounting (direct, distributor, deferred, etc.) \n• Cost Accounting \n• Royalties \n• Commissions \n• Capital/Operating Leases \n• Transfer Pricing \n• Analysis: LCM, GM, Disti Revenue Dashboard, Quarterly analytics and ad-hoc projects. \n \n• Special project: Oralce module implementation and support (CRM: Trade Management) Financial Analyst AFS - Google Inc. August 2009  –  June 2010  (11 months) • Revenue reporting at Google, Inc. Senior Accountant Miyabi Foods, Inc. November 2008  –  August 2009  (10 months) •\tDaily operations – AP, AR, journal entries for Retail transactions for 6 locations based on MyMicros reporting system, daily bank transactions for multiple accounts \n•\tRevenue recognition for multiple customers (over 200 accounts) \n•\tMonthly GET filing (Hawaii), Quarterly Sales Tax filing (California) \n•\tFixed assets, intangible assets, amortization, depreciation \n•\tLoan Management for 7 agreements \n•\tInventory control within QuickBooks (creating a step-by-step system including ordering, receiving, daily usage for production, daily sales, end of month count, adjustments FIFO/weighted average method) \n•\tPayroll entries through ADP and Intuit \n•\tSpecial project – Cleaning up messy QuickBooks for entire 2008FY, recreation of missing entries, correcting mis-categorizations, cash accounts reconciliations, asset accounts coordination (prepaid expenses distribution throughout the year, deferred revenue entries and revenue recognition, etc.), AP/AR balances research and adjustment, etc. \n•\tPreparation and monthly analysis of financial statements, detailed analysis of P&L by location and by month, variances review and research \n•\tQuickBooks customization to accommodate needs of sales staff and management (Invoices, Estimates, Statements, Various reports, etc.) Senior Accountant Netsan Technologies August 2007  –  November 2008  (1 year 4 months) •\tAccounts Payable/Receivable, monthly reconciliations, import/export operations, COGS coordination (FIFO/weighted average method), daily operations \n•\tPreparation, review and analysis of financial statements (P&L, Balance Sheet, Cash Flow review, etc.)  \n•\tQuarterly Sales Tax filing \n•\tAssisting auditors in year-end, income tax filing, etc.  \n•\tInventory management using Fishbowl Inventory software – full cycle, FIFO \n•\tPayroll: Timecard reports using Advantek Solutions time track system; payroll processing (ADP, Wells Fargo Business Payroll Services); commissions; garnishments, etc. \n•\tInsurance management: Worker's comp, General Liability, Professional Liability, BA, CP, etc. Senior Accountant Polymer-Svarka April 2006  –  June 2007  (1 year 3 months) •\tManaging daily operations – AP, AR, journal entries, daily bank transactions, etc. \n•\tCalculating costs of manufacturing for proprietary polymer products, analysis of month-to-month variances, processing adjustments \n•\tControlling inventory, work orders, RMA \n•\tFixed assets, depreciation, retirement of FA \n•\tProcessing payroll, managing employees’ benefits \n•\tPreparing quarterly Balance Sheet and P&L statements  \n•\tSelected, implemented and coordinated accounting software for the company Accountant Profit Pol-Bel May 2004  –  May 2006  (2 years 1 month) •\tAccounts Payable/Receivable, journal entries and bank reconciliations \n•\tInventory management, coordinating costs of food products manufactured using sub-contractor’s equipment and facilities \n•\tOrganizing the price formation according to governmental requirements and laws  \n•\tPayroll processing, child support garnishments \n•\tForeign-economic activity, logistic, forecasting costs for customs duties \n•\tOptimization for system “costs- revenues” Senior Revenue Accountant Netflix May 2014  – Present (1 year 4 months) Senior Revenue Accountant Netflix May 2014  – Present (1 year 4 months) Senior Accountant Seagate Technology July 2012  –  May 2014  (1 year 11 months) • Revenue recognition, contra revenue, reserves and accruals \n• Inventory reserves (LCM, PPV, LOH, etc) \n• Royalties \n• Review sales programs \n \n• Special projects:  \n~ SOX - Electronic Audit Evidence \n~ Unified Balance Sheet Recons \n~ Participate in various IT automation and implementation projects Senior Accountant Seagate Technology July 2012  –  May 2014  (1 year 11 months) • Revenue recognition, contra revenue, reserves and accruals \n• Inventory reserves (LCM, PPV, LOH, etc) \n• Royalties \n• Review sales programs \n \n• Special projects:  \n~ SOX - Electronic Audit Evidence \n~ Unified Balance Sheet Recons \n~ Participate in various IT automation and implementation projects Senior Accountant NetLogic Microsystems June 2010  –  May 2012  (2 years) • Comprehensive Revenue Accounting (direct, distributor, deferred, etc.) \n• Cost Accounting \n• Royalties \n• Commissions \n• Capital/Operating Leases \n• Transfer Pricing \n• Analysis: LCM, GM, Disti Revenue Dashboard, Quarterly analytics and ad-hoc projects. \n \n• Special project: Oralce module implementation and support (CRM: Trade Management) Senior Accountant NetLogic Microsystems June 2010  –  May 2012  (2 years) • Comprehensive Revenue Accounting (direct, distributor, deferred, etc.) \n• Cost Accounting \n• Royalties \n• Commissions \n• Capital/Operating Leases \n• Transfer Pricing \n• Analysis: LCM, GM, Disti Revenue Dashboard, Quarterly analytics and ad-hoc projects. \n \n• Special project: Oralce module implementation and support (CRM: Trade Management) Financial Analyst AFS - Google Inc. August 2009  –  June 2010  (11 months) • Revenue reporting at Google, Inc. Financial Analyst AFS - Google Inc. August 2009  –  June 2010  (11 months) • Revenue reporting at Google, Inc. Senior Accountant Miyabi Foods, Inc. November 2008  –  August 2009  (10 months) •\tDaily operations – AP, AR, journal entries for Retail transactions for 6 locations based on MyMicros reporting system, daily bank transactions for multiple accounts \n•\tRevenue recognition for multiple customers (over 200 accounts) \n•\tMonthly GET filing (Hawaii), Quarterly Sales Tax filing (California) \n•\tFixed assets, intangible assets, amortization, depreciation \n•\tLoan Management for 7 agreements \n•\tInventory control within QuickBooks (creating a step-by-step system including ordering, receiving, daily usage for production, daily sales, end of month count, adjustments FIFO/weighted average method) \n•\tPayroll entries through ADP and Intuit \n•\tSpecial project – Cleaning up messy QuickBooks for entire 2008FY, recreation of missing entries, correcting mis-categorizations, cash accounts reconciliations, asset accounts coordination (prepaid expenses distribution throughout the year, deferred revenue entries and revenue recognition, etc.), AP/AR balances research and adjustment, etc. \n•\tPreparation and monthly analysis of financial statements, detailed analysis of P&L by location and by month, variances review and research \n•\tQuickBooks customization to accommodate needs of sales staff and management (Invoices, Estimates, Statements, Various reports, etc.) Senior Accountant Miyabi Foods, Inc. November 2008  –  August 2009  (10 months) •\tDaily operations – AP, AR, journal entries for Retail transactions for 6 locations based on MyMicros reporting system, daily bank transactions for multiple accounts \n•\tRevenue recognition for multiple customers (over 200 accounts) \n•\tMonthly GET filing (Hawaii), Quarterly Sales Tax filing (California) \n•\tFixed assets, intangible assets, amortization, depreciation \n•\tLoan Management for 7 agreements \n•\tInventory control within QuickBooks (creating a step-by-step system including ordering, receiving, daily usage for production, daily sales, end of month count, adjustments FIFO/weighted average method) \n•\tPayroll entries through ADP and Intuit \n•\tSpecial project – Cleaning up messy QuickBooks for entire 2008FY, recreation of missing entries, correcting mis-categorizations, cash accounts reconciliations, asset accounts coordination (prepaid expenses distribution throughout the year, deferred revenue entries and revenue recognition, etc.), AP/AR balances research and adjustment, etc. \n•\tPreparation and monthly analysis of financial statements, detailed analysis of P&L by location and by month, variances review and research \n•\tQuickBooks customization to accommodate needs of sales staff and management (Invoices, Estimates, Statements, Various reports, etc.) Senior Accountant Netsan Technologies August 2007  –  November 2008  (1 year 4 months) •\tAccounts Payable/Receivable, monthly reconciliations, import/export operations, COGS coordination (FIFO/weighted average method), daily operations \n•\tPreparation, review and analysis of financial statements (P&L, Balance Sheet, Cash Flow review, etc.)  \n•\tQuarterly Sales Tax filing \n•\tAssisting auditors in year-end, income tax filing, etc.  \n•\tInventory management using Fishbowl Inventory software – full cycle, FIFO \n•\tPayroll: Timecard reports using Advantek Solutions time track system; payroll processing (ADP, Wells Fargo Business Payroll Services); commissions; garnishments, etc. \n•\tInsurance management: Worker's comp, General Liability, Professional Liability, BA, CP, etc. Senior Accountant Netsan Technologies August 2007  –  November 2008  (1 year 4 months) •\tAccounts Payable/Receivable, monthly reconciliations, import/export operations, COGS coordination (FIFO/weighted average method), daily operations \n•\tPreparation, review and analysis of financial statements (P&L, Balance Sheet, Cash Flow review, etc.)  \n•\tQuarterly Sales Tax filing \n•\tAssisting auditors in year-end, income tax filing, etc.  \n•\tInventory management using Fishbowl Inventory software – full cycle, FIFO \n•\tPayroll: Timecard reports using Advantek Solutions time track system; payroll processing (ADP, Wells Fargo Business Payroll Services); commissions; garnishments, etc. \n•\tInsurance management: Worker's comp, General Liability, Professional Liability, BA, CP, etc. Senior Accountant Polymer-Svarka April 2006  –  June 2007  (1 year 3 months) •\tManaging daily operations – AP, AR, journal entries, daily bank transactions, etc. \n•\tCalculating costs of manufacturing for proprietary polymer products, analysis of month-to-month variances, processing adjustments \n•\tControlling inventory, work orders, RMA \n•\tFixed assets, depreciation, retirement of FA \n•\tProcessing payroll, managing employees’ benefits \n•\tPreparing quarterly Balance Sheet and P&L statements  \n•\tSelected, implemented and coordinated accounting software for the company Senior Accountant Polymer-Svarka April 2006  –  June 2007  (1 year 3 months) •\tManaging daily operations – AP, AR, journal entries, daily bank transactions, etc. \n•\tCalculating costs of manufacturing for proprietary polymer products, analysis of month-to-month variances, processing adjustments \n•\tControlling inventory, work orders, RMA \n•\tFixed assets, depreciation, retirement of FA \n•\tProcessing payroll, managing employees’ benefits \n•\tPreparing quarterly Balance Sheet and P&L statements  \n•\tSelected, implemented and coordinated accounting software for the company Accountant Profit Pol-Bel May 2004  –  May 2006  (2 years 1 month) •\tAccounts Payable/Receivable, journal entries and bank reconciliations \n•\tInventory management, coordinating costs of food products manufactured using sub-contractor’s equipment and facilities \n•\tOrganizing the price formation according to governmental requirements and laws  \n•\tPayroll processing, child support garnishments \n•\tForeign-economic activity, logistic, forecasting costs for customs duties \n•\tOptimization for system “costs- revenues” Accountant Profit Pol-Bel May 2004  –  May 2006  (2 years 1 month) •\tAccounts Payable/Receivable, journal entries and bank reconciliations \n•\tInventory management, coordinating costs of food products manufactured using sub-contractor’s equipment and facilities \n•\tOrganizing the price formation according to governmental requirements and laws  \n•\tPayroll processing, child support garnishments \n•\tForeign-economic activity, logistic, forecasting costs for customs duties \n•\tOptimization for system “costs- revenues” Skills Accounting Financial Reporting Account Reconciliation Forecasting Accounts Payable Variance Analysis Accounts Receivable Auditing GAAP Cost Accounting Financial Analysis Revenue Recognition Internal Controls Inventory Control Skills  Accounting Financial Reporting Account Reconciliation Forecasting Accounts Payable Variance Analysis Accounts Receivable Auditing GAAP Cost Accounting Financial Analysis Revenue Recognition Internal Controls Inventory Control Accounting Financial Reporting Account Reconciliation Forecasting Accounts Payable Variance Analysis Accounts Receivable Auditing GAAP Cost Accounting Financial Analysis Revenue Recognition Internal Controls Inventory Control Accounting Financial Reporting Account Reconciliation Forecasting Accounts Payable Variance Analysis Accounts Receivable Auditing GAAP Cost Accounting Financial Analysis Revenue Recognition Internal Controls Inventory Control Education Academy of Management, Belarus International Accounting Systems and Standarts 2006  – 2007 State University of Economics Master of Science,  Accounting 2000  – 2005 State University of Economics BA,  Business Administration Academy of Management, Belarus International Accounting Systems and Standarts 2006  – 2007 Academy of Management, Belarus International Accounting Systems and Standarts 2006  – 2007 Academy of Management, Belarus International Accounting Systems and Standarts 2006  – 2007 State University of Economics Master of Science,  Accounting 2000  – 2005 State University of Economics Master of Science,  Accounting 2000  – 2005 State University of Economics Master of Science,  Accounting 2000  – 2005 State University of Economics BA,  Business Administration State University of Economics BA,  Business Administration State University of Economics BA,  Business Administration ", "Experience G&A Financial Accountant Google September 2014  – Present (1 year) Senior Financial Accountant (Contract) AMP Capital July 2014  –  September 2014  (3 months) sydney, australia Senior Accountant York Capital Management August 2011  –  May 2014  (2 years 10 months) new york Senior Accountant Ernst & Young October 2010  –  August 2011  (11 months) Manhattan, New York Senior Accountant Ernst & Young February 2006  –  September 2010  (4 years 8 months) Sydney, Australia Financial Accountant Goodman October 2003  –  November 2005  (2 years 2 months) sydney, australia G&A Financial Accountant Google September 2014  – Present (1 year) G&A Financial Accountant Google September 2014  – Present (1 year) Senior Financial Accountant (Contract) AMP Capital July 2014  –  September 2014  (3 months) sydney, australia Senior Financial Accountant (Contract) AMP Capital July 2014  –  September 2014  (3 months) sydney, australia Senior Accountant York Capital Management August 2011  –  May 2014  (2 years 10 months) new york Senior Accountant York Capital Management August 2011  –  May 2014  (2 years 10 months) new york Senior Accountant Ernst & Young October 2010  –  August 2011  (11 months) Manhattan, New York Senior Accountant Ernst & Young October 2010  –  August 2011  (11 months) Manhattan, New York Senior Accountant Ernst & Young February 2006  –  September 2010  (4 years 8 months) Sydney, Australia Senior Accountant Ernst & Young February 2006  –  September 2010  (4 years 8 months) Sydney, Australia Financial Accountant Goodman October 2003  –  November 2005  (2 years 2 months) sydney, australia Financial Accountant Goodman October 2003  –  November 2005  (2 years 2 months) sydney, australia Skills Financial Analysis Financial Reporting Auditing Accounting Valuation Bloomberg Hedge Funds Due Diligence Internal Controls Financial Accounting IFRS Skills  Financial Analysis Financial Reporting Auditing Accounting Valuation Bloomberg Hedge Funds Due Diligence Internal Controls Financial Accounting IFRS Financial Analysis Financial Reporting Auditing Accounting Valuation Bloomberg Hedge Funds Due Diligence Internal Controls Financial Accounting IFRS Financial Analysis Financial Reporting Auditing Accounting Valuation Bloomberg Hedge Funds Due Diligence Internal Controls Financial Accounting IFRS Education Institute of Chartered Accountant Association (ICAA) Chartered Accountant 2006  – 2008 University of New South Wales Commerce,  Accounting , Finance 2003  – 2005 Tsinghua University Chinese Studies 2010  – 2011 Institute of Chartered Accountant Association (ICAA) Chartered Accountant 2006  – 2008 Institute of Chartered Accountant Association (ICAA) Chartered Accountant 2006  – 2008 Institute of Chartered Accountant Association (ICAA) Chartered Accountant 2006  – 2008 University of New South Wales Commerce,  Accounting , Finance 2003  – 2005 University of New South Wales Commerce,  Accounting , Finance 2003  – 2005 University of New South Wales Commerce,  Accounting , Finance 2003  – 2005 Tsinghua University Chinese Studies 2010  – 2011 Tsinghua University Chinese Studies 2010  – 2011 Tsinghua University Chinese Studies 2010  – 2011 ", "Experience Senior Accountant LinkedIn August 2009  – Present (6 years 1 month) Senior Accountant-Consultant Linkedin May 2009  –  August 2009  (4 months) Senior Accountant-Consultant Google Inc May 2008  –  October 2008  (6 months) Senior Accountant-Consultant Marvell July 2007  –  November 2007  (5 months) Senior Accountant Tessera August 2004  –  June 2007  (2 years 11 months) Senior Accountant-Consultant Ross Stores Inc. April 2002  –  August 2004  (2 years 5 months) Senior Accountant RedCreek Communication Inc 2000  –  2002  (2 years) Accountant iLogistix 1999  –  2000  (1 year) Senior Accountant LinkedIn August 2009  – Present (6 years 1 month) Senior Accountant LinkedIn August 2009  – Present (6 years 1 month) Senior Accountant-Consultant Linkedin May 2009  –  August 2009  (4 months) Senior Accountant-Consultant Linkedin May 2009  –  August 2009  (4 months) Senior Accountant-Consultant Google Inc May 2008  –  October 2008  (6 months) Senior Accountant-Consultant Google Inc May 2008  –  October 2008  (6 months) Senior Accountant-Consultant Marvell July 2007  –  November 2007  (5 months) Senior Accountant-Consultant Marvell July 2007  –  November 2007  (5 months) Senior Accountant Tessera August 2004  –  June 2007  (2 years 11 months) Senior Accountant Tessera August 2004  –  June 2007  (2 years 11 months) Senior Accountant-Consultant Ross Stores Inc. April 2002  –  August 2004  (2 years 5 months) Senior Accountant-Consultant Ross Stores Inc. April 2002  –  August 2004  (2 years 5 months) Senior Accountant RedCreek Communication Inc 2000  –  2002  (2 years) Senior Accountant RedCreek Communication Inc 2000  –  2002  (2 years) Accountant iLogistix 1999  –  2000  (1 year) Accountant iLogistix 1999  –  2000  (1 year) Education MD,  Engineering 1985  – 1990 Highschool Suceava University of California, Santa Cruz Accounting MD,  Engineering 1985  – 1990 MD,  Engineering 1985  – 1990 MD,  Engineering 1985  – 1990 Highschool Suceava Highschool Suceava Highschool Suceava University of California, Santa Cruz Accounting University of California, Santa Cruz Accounting University of California, Santa Cruz Accounting ", "Summary Senior online marketing professional working in Google Ireland since 2006. Currently managing a team of 13 Account Managers responsible for Google's largest UK Gambling & B2B clients. \n \nHonours graduate in Management & Marketing. Summary Senior online marketing professional working in Google Ireland since 2006. Currently managing a team of 13 Account Managers responsible for Google's largest UK Gambling & B2B clients. \n \nHonours graduate in Management & Marketing. Senior online marketing professional working in Google Ireland since 2006. Currently managing a team of 13 Account Managers responsible for Google's largest UK Gambling & B2B clients. \n \nHonours graduate in Management & Marketing. Senior online marketing professional working in Google Ireland since 2006. Currently managing a team of 13 Account Managers responsible for Google's largest UK Gambling & B2B clients. \n \nHonours graduate in Management & Marketing. Experience Manager, Large Customer Sales (Consumer Services & Classifieds) Google 2015  – Present (less than a year) Ireland Responsible for a team of 11 Account Managers with annual targets in excess of $350m and growth of over 15% YoY. Manager, Large Customer Sales (Gambling & B2B) Google November 2012  – Present (2 years 10 months) Dublin, Ireland * People Management: Solely responsible for a team of 13 people managing a portfolio of clients spending over $250m/year with YoY growth of nearly 20%. \n* Manage a small number of Google's largest clients across two main sectors - B2B & eGaming/Gambling. \n* UK & Ireland Hiring Manager: Responsible for recruitment for Google UK & Ireland team of 150 people. \n* Client Relations: Experienced relationship manager to B & C-Level contacts in major brands. \n* Online advertising expert. \n* Strategic Consulting: Consultant on brand development and growth. \n* Project managing team wide Six Sigma business critical projects for senior management. Team Lead, B2C Consumer Services, Large Customer Sales Google October 2010  –  November 2012  (2 years 2 months) Google European HQ, Dublin, Ireland * People Management: Responsible for a team of 5 people managing a portfolio of clients spending $100m/year. \n* Responsible for Google's largest UK clients in the Home Services, Logistics & Storage sectors. Senior Account Manager - Google AdWords Google April 2009  –  October 2010  (1 year 7 months) Google European HQ, Dublin, Ireland * Account/Relationship Manager to a portfolio of B2C service based clients. \n* Responsibile for multi-million dollar annual online spend with clients ranging from large multinationals to Internet start-ups. \n* Worked with many of the UK's major advertising agencies. \n* Expected to meet aggressive quarterly growth targets. \n* Solely own consultancy based relationship with major clients. \n* Drive overall portfolio growth strategy. \n* Regular internal and external presentations. Account Manager - Google AdWords Google January 2008  –  April 2009  (1 year 4 months) Google European HQ, Dublin, Ireland AdWords Coordinator Google August 2006  –  January 2008  (1 year 6 months) Google European HQ, Dublin, Ireland Hedge Fund Accountant PFPC International October 2005  –  August 2006  (11 months) Dublin, Ireland * Responsible for the accounting of a $2 billion hedge fund. \n* Expected to meet strict weekly deadlines for market pricing. Intern SEI Investments May 2003  –  August 2003  (4 months) Dublin, Ireland * Self sourced University Internship. \n* Responsible for management and completion of a large AML (Anti-Money Laundering) project as part of wider hedge fund compliance measures. \n* Worked in conjunction with fund accounting and middle office teams. Manager, Large Customer Sales (Consumer Services & Classifieds) Google 2015  – Present (less than a year) Ireland Responsible for a team of 11 Account Managers with annual targets in excess of $350m and growth of over 15% YoY. Manager, Large Customer Sales (Consumer Services & Classifieds) Google 2015  – Present (less than a year) Ireland Responsible for a team of 11 Account Managers with annual targets in excess of $350m and growth of over 15% YoY. Manager, Large Customer Sales (Gambling & B2B) Google November 2012  – Present (2 years 10 months) Dublin, Ireland * People Management: Solely responsible for a team of 13 people managing a portfolio of clients spending over $250m/year with YoY growth of nearly 20%. \n* Manage a small number of Google's largest clients across two main sectors - B2B & eGaming/Gambling. \n* UK & Ireland Hiring Manager: Responsible for recruitment for Google UK & Ireland team of 150 people. \n* Client Relations: Experienced relationship manager to B & C-Level contacts in major brands. \n* Online advertising expert. \n* Strategic Consulting: Consultant on brand development and growth. \n* Project managing team wide Six Sigma business critical projects for senior management. Manager, Large Customer Sales (Gambling & B2B) Google November 2012  – Present (2 years 10 months) Dublin, Ireland * People Management: Solely responsible for a team of 13 people managing a portfolio of clients spending over $250m/year with YoY growth of nearly 20%. \n* Manage a small number of Google's largest clients across two main sectors - B2B & eGaming/Gambling. \n* UK & Ireland Hiring Manager: Responsible for recruitment for Google UK & Ireland team of 150 people. \n* Client Relations: Experienced relationship manager to B & C-Level contacts in major brands. \n* Online advertising expert. \n* Strategic Consulting: Consultant on brand development and growth. \n* Project managing team wide Six Sigma business critical projects for senior management. Team Lead, B2C Consumer Services, Large Customer Sales Google October 2010  –  November 2012  (2 years 2 months) Google European HQ, Dublin, Ireland * People Management: Responsible for a team of 5 people managing a portfolio of clients spending $100m/year. \n* Responsible for Google's largest UK clients in the Home Services, Logistics & Storage sectors. Team Lead, B2C Consumer Services, Large Customer Sales Google October 2010  –  November 2012  (2 years 2 months) Google European HQ, Dublin, Ireland * People Management: Responsible for a team of 5 people managing a portfolio of clients spending $100m/year. \n* Responsible for Google's largest UK clients in the Home Services, Logistics & Storage sectors. Senior Account Manager - Google AdWords Google April 2009  –  October 2010  (1 year 7 months) Google European HQ, Dublin, Ireland * Account/Relationship Manager to a portfolio of B2C service based clients. \n* Responsibile for multi-million dollar annual online spend with clients ranging from large multinationals to Internet start-ups. \n* Worked with many of the UK's major advertising agencies. \n* Expected to meet aggressive quarterly growth targets. \n* Solely own consultancy based relationship with major clients. \n* Drive overall portfolio growth strategy. \n* Regular internal and external presentations. Senior Account Manager - Google AdWords Google April 2009  –  October 2010  (1 year 7 months) Google European HQ, Dublin, Ireland * Account/Relationship Manager to a portfolio of B2C service based clients. \n* Responsibile for multi-million dollar annual online spend with clients ranging from large multinationals to Internet start-ups. \n* Worked with many of the UK's major advertising agencies. \n* Expected to meet aggressive quarterly growth targets. \n* Solely own consultancy based relationship with major clients. \n* Drive overall portfolio growth strategy. \n* Regular internal and external presentations. Account Manager - Google AdWords Google January 2008  –  April 2009  (1 year 4 months) Google European HQ, Dublin, Ireland Account Manager - Google AdWords Google January 2008  –  April 2009  (1 year 4 months) Google European HQ, Dublin, Ireland AdWords Coordinator Google August 2006  –  January 2008  (1 year 6 months) Google European HQ, Dublin, Ireland AdWords Coordinator Google August 2006  –  January 2008  (1 year 6 months) Google European HQ, Dublin, Ireland Hedge Fund Accountant PFPC International October 2005  –  August 2006  (11 months) Dublin, Ireland * Responsible for the accounting of a $2 billion hedge fund. \n* Expected to meet strict weekly deadlines for market pricing. Hedge Fund Accountant PFPC International October 2005  –  August 2006  (11 months) Dublin, Ireland * Responsible for the accounting of a $2 billion hedge fund. \n* Expected to meet strict weekly deadlines for market pricing. Intern SEI Investments May 2003  –  August 2003  (4 months) Dublin, Ireland * Self sourced University Internship. \n* Responsible for management and completion of a large AML (Anti-Money Laundering) project as part of wider hedge fund compliance measures. \n* Worked in conjunction with fund accounting and middle office teams. Intern SEI Investments May 2003  –  August 2003  (4 months) Dublin, Ireland * Self sourced University Internship. \n* Responsible for management and completion of a large AML (Anti-Money Laundering) project as part of wider hedge fund compliance measures. \n* Worked in conjunction with fund accounting and middle office teams. Skills Online Advertising Google Adwords Online Marketing PPC Google Analytics Digital Marketing Digital Media Advertising Social Media Marketing Mobile Marketing Google Adwords... Sales Management Project Management Internet PPC Bid Management Corporate Branding Marketing Research Hedge Funds Team Management Presentations Google Maps Google Ad Planner Management Marketing Management Advertising Management SEM Web Analytics Strategy Search Advertising Digital Strategy Six Sigma See 16+     See less Skills  Online Advertising Google Adwords Online Marketing PPC Google Analytics Digital Marketing Digital Media Advertising Social Media Marketing Mobile Marketing Google Adwords... Sales Management Project Management Internet PPC Bid Management Corporate Branding Marketing Research Hedge Funds Team Management Presentations Google Maps Google Ad Planner Management Marketing Management Advertising Management SEM Web Analytics Strategy Search Advertising Digital Strategy Six Sigma See 16+     See less Online Advertising Google Adwords Online Marketing PPC Google Analytics Digital Marketing Digital Media Advertising Social Media Marketing Mobile Marketing Google Adwords... Sales Management Project Management Internet PPC Bid Management Corporate Branding Marketing Research Hedge Funds Team Management Presentations Google Maps Google Ad Planner Management Marketing Management Advertising Management SEM Web Analytics Strategy Search Advertising Digital Strategy Six Sigma See 16+     See less Online Advertising Google Adwords Online Marketing PPC Google Analytics Digital Marketing Digital Media Advertising Social Media Marketing Mobile Marketing Google Adwords... Sales Management Project Management Internet PPC Bid Management Corporate Branding Marketing Research Hedge Funds Team Management Presentations Google Maps Google Ad Planner Management Marketing Management Advertising Management SEM Web Analytics Strategy Search Advertising Digital Strategy Six Sigma See 16+     See less Education Dublin Institute of Technology B.Sc. (Hons),  Management & Marketing 2000  – 2004 Dublin Institute of Technology B.Sc. (Hons),  Management & Marketing 2000  – 2004 Dublin Institute of Technology B.Sc. (Hons),  Management & Marketing 2000  – 2004 Dublin Institute of Technology B.Sc. (Hons),  Management & Marketing 2000  – 2004 ", "Experience Senior Accountant NCC Group October 2014  – Present (11 months) San Francisco, CA Senior Financial Analyst Dow Jones June 2013  –  June 2014  (1 year 1 month) South Brunswick, NJ Senior Accountant, Global Business Organization salesforce.com July 2012  –  April 2013  (10 months) San Francisco, CA Accountant, Controllership Integration and Management Office Google May 2012  –  July 2012  (3 months) Mountain View, CA Senior Accountant, Finance Research Genentech November 2011  –  February 2012  (4 months) South San Francisco, CA Senior Accountant, Corporate Global Consolidations Oracle August 2011  –  September 2011  (2 months) Redwood City, CA Senior Accountant Kaiser Permanente January 2011  –  April 2011  (4 months) Oakland, CA Accounting Supervisor Delta Dental of California June 2005  –  June 2010  (5 years 1 month) San Francisco, CA Accountant Alloy Media + Marketing August 2004  –  March 2005  (8 months) New York, NY Senior Accountant NCC Group October 2014  – Present (11 months) San Francisco, CA Senior Accountant NCC Group October 2014  – Present (11 months) San Francisco, CA Senior Financial Analyst Dow Jones June 2013  –  June 2014  (1 year 1 month) South Brunswick, NJ Senior Financial Analyst Dow Jones June 2013  –  June 2014  (1 year 1 month) South Brunswick, NJ Senior Accountant, Global Business Organization salesforce.com July 2012  –  April 2013  (10 months) San Francisco, CA Senior Accountant, Global Business Organization salesforce.com July 2012  –  April 2013  (10 months) San Francisco, CA Accountant, Controllership Integration and Management Office Google May 2012  –  July 2012  (3 months) Mountain View, CA Accountant, Controllership Integration and Management Office Google May 2012  –  July 2012  (3 months) Mountain View, CA Senior Accountant, Finance Research Genentech November 2011  –  February 2012  (4 months) South San Francisco, CA Senior Accountant, Finance Research Genentech November 2011  –  February 2012  (4 months) South San Francisco, CA Senior Accountant, Corporate Global Consolidations Oracle August 2011  –  September 2011  (2 months) Redwood City, CA Senior Accountant, Corporate Global Consolidations Oracle August 2011  –  September 2011  (2 months) Redwood City, CA Senior Accountant Kaiser Permanente January 2011  –  April 2011  (4 months) Oakland, CA Senior Accountant Kaiser Permanente January 2011  –  April 2011  (4 months) Oakland, CA Accounting Supervisor Delta Dental of California June 2005  –  June 2010  (5 years 1 month) San Francisco, CA Accounting Supervisor Delta Dental of California June 2005  –  June 2010  (5 years 1 month) San Francisco, CA Accountant Alloy Media + Marketing August 2004  –  March 2005  (8 months) New York, NY Accountant Alloy Media + Marketing August 2004  –  March 2005  (8 months) New York, NY Skills PeopleSoft Account Reconciliation Variance Analysis Invoicing Microsoft Excel Oracle E-Business Suite Microsoft Office Oracle Financials Excel Report Generation Intercompany Transfer Pricing General Ledger Financial Reporting Accounts Payable Accounting Financial Statements Journal Entries Budgets Cash Flow See 5+     See less Skills  PeopleSoft Account Reconciliation Variance Analysis Invoicing Microsoft Excel Oracle E-Business Suite Microsoft Office Oracle Financials Excel Report Generation Intercompany Transfer Pricing General Ledger Financial Reporting Accounts Payable Accounting Financial Statements Journal Entries Budgets Cash Flow See 5+     See less PeopleSoft Account Reconciliation Variance Analysis Invoicing Microsoft Excel Oracle E-Business Suite Microsoft Office Oracle Financials Excel Report Generation Intercompany Transfer Pricing General Ledger Financial Reporting Accounts Payable Accounting Financial Statements Journal Entries Budgets Cash Flow See 5+     See less PeopleSoft Account Reconciliation Variance Analysis Invoicing Microsoft Excel Oracle E-Business Suite Microsoft Office Oracle Financials Excel Report Generation Intercompany Transfer Pricing General Ledger Financial Reporting Accounts Payable Accounting Financial Statements Journal Entries Budgets Cash Flow See 5+     See less ", "Summary Intuitive and energetic Certified Public Accountant with extensive knowledge in financial reporting for public and private companies and reports on internal controls for public companies.  \n \nExtensive Gaming industry knowledge including regulatory compliance. Specialist in revenue recognition for multiple-element arrangements and software revenue recognition. Specialties:- ASC 605, Revenue Recognition: Multiple-Element Arrangements;  \n- ASC 985-605, Software: Revenue Recognition;  \n- ASC 830, Functional Currency; \n- Earnings per share calculations and disclosure; \n- Share-based compensation;  \n- Industry treatment for gaming wide area progressives; and \n- Inventory cost accounting and inventory testing. Summary Intuitive and energetic Certified Public Accountant with extensive knowledge in financial reporting for public and private companies and reports on internal controls for public companies.  \n \nExtensive Gaming industry knowledge including regulatory compliance. Specialist in revenue recognition for multiple-element arrangements and software revenue recognition. Specialties:- ASC 605, Revenue Recognition: Multiple-Element Arrangements;  \n- ASC 985-605, Software: Revenue Recognition;  \n- ASC 830, Functional Currency; \n- Earnings per share calculations and disclosure; \n- Share-based compensation;  \n- Industry treatment for gaming wide area progressives; and \n- Inventory cost accounting and inventory testing. Intuitive and energetic Certified Public Accountant with extensive knowledge in financial reporting for public and private companies and reports on internal controls for public companies.  \n \nExtensive Gaming industry knowledge including regulatory compliance. Specialist in revenue recognition for multiple-element arrangements and software revenue recognition. Specialties:- ASC 605, Revenue Recognition: Multiple-Element Arrangements;  \n- ASC 985-605, Software: Revenue Recognition;  \n- ASC 830, Functional Currency; \n- Earnings per share calculations and disclosure; \n- Share-based compensation;  \n- Industry treatment for gaming wide area progressives; and \n- Inventory cost accounting and inventory testing. Intuitive and energetic Certified Public Accountant with extensive knowledge in financial reporting for public and private companies and reports on internal controls for public companies.  \n \nExtensive Gaming industry knowledge including regulatory compliance. Specialist in revenue recognition for multiple-element arrangements and software revenue recognition. Specialties:- ASC 605, Revenue Recognition: Multiple-Element Arrangements;  \n- ASC 985-605, Software: Revenue Recognition;  \n- ASC 830, Functional Currency; \n- Earnings per share calculations and disclosure; \n- Share-based compensation;  \n- Industry treatment for gaming wide area progressives; and \n- Inventory cost accounting and inventory testing. Experience Emerging Products Senior Accountant Google June 2015  – Present (3 months) Mountain View, California Accountant Google July 2013  –  June 2015  (2 years) mountain view, california Senior Associate PricewaterhouseCoopers September 2009  –  July 2013  (3 years 11 months) las vegas, nevada area Audit Experience \n- Planned, directed, and executed year-end audits and quarterly reviews of financial statements for both public and private companies in various industries including the technology, gaming, and manufacturing industries, with annual revenues ranging from $300 million to $2.0 billion. \n- Assessed audit risks, developed testing plans, applied analytical procedures, and drafted audit reports. \n- Presented audit findings to management and directors including suggested resolution and best practices. \n- Identified, researched and resolved technical issues to determine proper accounting, reporting and disclosure requirements. \n- Performed risk assessment, scoping, walkthroughs, and testing of internal controls for publicly traded companies in accordance with the Sarbanes-Oxley Act and Audit Standard No.5 requirements. \n- Evaluated internal control systems and processes that resulted in client recommendations for improved profitability, critical processes, control structure and efficiency. \n- Reviewed and provided formal comments for client external financial reporting for form10-K, 10-Q, 8-K and S-3. \n \nManagement Experience \n- Collaborated with other lines of service to enhance value, including work with tax teams, IT assurance teams, valuation experts, and international PwC teams. \n- Assisted with both in-office and off-site recruiting events, new hire orientation and staff mentoring. \n- Completed expectation setting discussions and documented performance reviews of team members to identify strengths and areas for improvement. \n \nGaming Industry \n- Completed internal audits for compliance with Nevada Gaming Regulations and Internal Control Standards. \n- Performed drop and count observations and cage counts to evaluate compliance with Nevada Gaming Regulations, Internal Control Standards and to audit existence assertion for financial statement audits. Associate Diesel April 2006  –  January 2009  (2 years 10 months) Associate Nordstrom December 2005  –  April 2006  (5 months) Emerging Products Senior Accountant Google June 2015  – Present (3 months) Mountain View, California Emerging Products Senior Accountant Google June 2015  – Present (3 months) Mountain View, California Accountant Google July 2013  –  June 2015  (2 years) mountain view, california Accountant Google July 2013  –  June 2015  (2 years) mountain view, california Senior Associate PricewaterhouseCoopers September 2009  –  July 2013  (3 years 11 months) las vegas, nevada area Audit Experience \n- Planned, directed, and executed year-end audits and quarterly reviews of financial statements for both public and private companies in various industries including the technology, gaming, and manufacturing industries, with annual revenues ranging from $300 million to $2.0 billion. \n- Assessed audit risks, developed testing plans, applied analytical procedures, and drafted audit reports. \n- Presented audit findings to management and directors including suggested resolution and best practices. \n- Identified, researched and resolved technical issues to determine proper accounting, reporting and disclosure requirements. \n- Performed risk assessment, scoping, walkthroughs, and testing of internal controls for publicly traded companies in accordance with the Sarbanes-Oxley Act and Audit Standard No.5 requirements. \n- Evaluated internal control systems and processes that resulted in client recommendations for improved profitability, critical processes, control structure and efficiency. \n- Reviewed and provided formal comments for client external financial reporting for form10-K, 10-Q, 8-K and S-3. \n \nManagement Experience \n- Collaborated with other lines of service to enhance value, including work with tax teams, IT assurance teams, valuation experts, and international PwC teams. \n- Assisted with both in-office and off-site recruiting events, new hire orientation and staff mentoring. \n- Completed expectation setting discussions and documented performance reviews of team members to identify strengths and areas for improvement. \n \nGaming Industry \n- Completed internal audits for compliance with Nevada Gaming Regulations and Internal Control Standards. \n- Performed drop and count observations and cage counts to evaluate compliance with Nevada Gaming Regulations, Internal Control Standards and to audit existence assertion for financial statement audits. Senior Associate PricewaterhouseCoopers September 2009  –  July 2013  (3 years 11 months) las vegas, nevada area Audit Experience \n- Planned, directed, and executed year-end audits and quarterly reviews of financial statements for both public and private companies in various industries including the technology, gaming, and manufacturing industries, with annual revenues ranging from $300 million to $2.0 billion. \n- Assessed audit risks, developed testing plans, applied analytical procedures, and drafted audit reports. \n- Presented audit findings to management and directors including suggested resolution and best practices. \n- Identified, researched and resolved technical issues to determine proper accounting, reporting and disclosure requirements. \n- Performed risk assessment, scoping, walkthroughs, and testing of internal controls for publicly traded companies in accordance with the Sarbanes-Oxley Act and Audit Standard No.5 requirements. \n- Evaluated internal control systems and processes that resulted in client recommendations for improved profitability, critical processes, control structure and efficiency. \n- Reviewed and provided formal comments for client external financial reporting for form10-K, 10-Q, 8-K and S-3. \n \nManagement Experience \n- Collaborated with other lines of service to enhance value, including work with tax teams, IT assurance teams, valuation experts, and international PwC teams. \n- Assisted with both in-office and off-site recruiting events, new hire orientation and staff mentoring. \n- Completed expectation setting discussions and documented performance reviews of team members to identify strengths and areas for improvement. \n \nGaming Industry \n- Completed internal audits for compliance with Nevada Gaming Regulations and Internal Control Standards. \n- Performed drop and count observations and cage counts to evaluate compliance with Nevada Gaming Regulations, Internal Control Standards and to audit existence assertion for financial statement audits. Associate Diesel April 2006  –  January 2009  (2 years 10 months) Associate Diesel April 2006  –  January 2009  (2 years 10 months) Associate Nordstrom December 2005  –  April 2006  (5 months) Associate Nordstrom December 2005  –  April 2006  (5 months) Education University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Accounting ,  International Business ,  Spanish 2005  – 2009 University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Accounting ,  International Business ,  Spanish 2005  – 2009 University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Accounting ,  International Business ,  Spanish 2005  – 2009 University of Washington, Michael G. Foster School of Business Bachelor of Arts,  Accounting ,  International Business ,  Spanish 2005  – 2009 ", "Summary Accounting professional with 14 years of increasing responsibility, experience in manufacturing, telecommunications, high-tech industries and retail.  \nSuccessfully managed crucial areas in accounting ranging from General Ledger accounting, monthly close process, assistance with audit, managing fixed asset activities, reconciliation  \nof balance sheet accounts, and preparation of financial statements in accordance with GAAP.  \nStrong analytical, problem solving & inter-personal communication skills; successful in streamlining various accounting processes. Summary Accounting professional with 14 years of increasing responsibility, experience in manufacturing, telecommunications, high-tech industries and retail.  \nSuccessfully managed crucial areas in accounting ranging from General Ledger accounting, monthly close process, assistance with audit, managing fixed asset activities, reconciliation  \nof balance sheet accounts, and preparation of financial statements in accordance with GAAP.  \nStrong analytical, problem solving & inter-personal communication skills; successful in streamlining various accounting processes. Accounting professional with 14 years of increasing responsibility, experience in manufacturing, telecommunications, high-tech industries and retail.  \nSuccessfully managed crucial areas in accounting ranging from General Ledger accounting, monthly close process, assistance with audit, managing fixed asset activities, reconciliation  \nof balance sheet accounts, and preparation of financial statements in accordance with GAAP.  \nStrong analytical, problem solving & inter-personal communication skills; successful in streamlining various accounting processes. Accounting professional with 14 years of increasing responsibility, experience in manufacturing, telecommunications, high-tech industries and retail.  \nSuccessfully managed crucial areas in accounting ranging from General Ledger accounting, monthly close process, assistance with audit, managing fixed asset activities, reconciliation  \nof balance sheet accounts, and preparation of financial statements in accordance with GAAP.  \nStrong analytical, problem solving & inter-personal communication skills; successful in streamlining various accounting processes. Experience Sr.GL Accountant Vocera Communications August 2014  – Present (1 year 1 month) Senior Accountant - Consulting Google October 2012  –  July 2014  (1 year 10 months) GL Accountant SVTC April 2009  –  September 2012  (3 years 6 months) San Jose, CA Sr.Cash Accountant - Consulting Google Inc February 2008  –  January 2009  (1 year) Sr.GL Accountant Napster July 2007  –  January 2008  (7 months) Sr. GL Accountant Finisar January 2005  –  June 2007  (2 years 6 months) Sr. Fixed Assets Accountant Covad Communications December 2001  –  January 2005  (3 years 2 months) Sr.GL Accountant Vocera Communications August 2014  – Present (1 year 1 month) Sr.GL Accountant Vocera Communications August 2014  – Present (1 year 1 month) Senior Accountant - Consulting Google October 2012  –  July 2014  (1 year 10 months) Senior Accountant - Consulting Google October 2012  –  July 2014  (1 year 10 months) GL Accountant SVTC April 2009  –  September 2012  (3 years 6 months) San Jose, CA GL Accountant SVTC April 2009  –  September 2012  (3 years 6 months) San Jose, CA Sr.Cash Accountant - Consulting Google Inc February 2008  –  January 2009  (1 year) Sr.Cash Accountant - Consulting Google Inc February 2008  –  January 2009  (1 year) Sr.GL Accountant Napster July 2007  –  January 2008  (7 months) Sr.GL Accountant Napster July 2007  –  January 2008  (7 months) Sr. GL Accountant Finisar January 2005  –  June 2007  (2 years 6 months) Sr. GL Accountant Finisar January 2005  –  June 2007  (2 years 6 months) Sr. Fixed Assets Accountant Covad Communications December 2001  –  January 2005  (3 years 2 months) Sr. Fixed Assets Accountant Covad Communications December 2001  –  January 2005  (3 years 2 months) Languages Kannada Kannada Kannada Skills Sarbanes-Oxley General Ledger Accounting Financial Reporting Account Reconciliation GAAP Accounts Payable Consolidation Quarterly audit review... PBC schedules Oracle Financial SAP Monarch Pro Month End Close Cash Flow Allocations Fixed Assets Sales and use tax filing Internal Controls Finance Sarbanes-Oxley Act Auditing Internal Audit See 8+     See less Skills  Sarbanes-Oxley General Ledger Accounting Financial Reporting Account Reconciliation GAAP Accounts Payable Consolidation Quarterly audit review... PBC schedules Oracle Financial SAP Monarch Pro Month End Close Cash Flow Allocations Fixed Assets Sales and use tax filing Internal Controls Finance Sarbanes-Oxley Act Auditing Internal Audit See 8+     See less Sarbanes-Oxley General Ledger Accounting Financial Reporting Account Reconciliation GAAP Accounts Payable Consolidation Quarterly audit review... PBC schedules Oracle Financial SAP Monarch Pro Month End Close Cash Flow Allocations Fixed Assets Sales and use tax filing Internal Controls Finance Sarbanes-Oxley Act Auditing Internal Audit See 8+     See less Sarbanes-Oxley General Ledger Accounting Financial Reporting Account Reconciliation GAAP Accounts Payable Consolidation Quarterly audit review... PBC schedules Oracle Financial SAP Monarch Pro Month End Close Cash Flow Allocations Fixed Assets Sales and use tax filing Internal Controls Finance Sarbanes-Oxley Act Auditing Internal Audit See 8+     See less Education Bangalore University Bachelor of Science UCSC Extension, Santa Cruz Certificate program in Accounting Bangalore University Bachelor of Science Bangalore University Bachelor of Science Bangalore University Bachelor of Science UCSC Extension, Santa Cruz Certificate program in Accounting UCSC Extension, Santa Cruz Certificate program in Accounting UCSC Extension, Santa Cruz Certificate program in Accounting ", "Experience Fixed Assets and Manufacturing Controller Google February 2015  – Present (7 months) Mountain View, United States Finance Controller for Motorola - Spanish Speaking Latin America Google December 2013  –  February 2015  (1 year 3 months) Buenos Aires, Argentina Regional head for all finance functions for Latin America countries (Mexico, Argentina, Chile, Colombia, Peru and Venezuela). The region combined is the 3rd largest market in the world for Motorola business. Manage 3 direct reports and more than 15 people working for different outsourcing providers. Main responsibilities for the team are coordinate AP, AR and payroll functions, prepare financial statements based on local GAAP, manage audits of financial statements, file tax returns timely and accurately and support local business on finance needs. Received highest award in Google Finance worldwide (Titan award) for work performed for Motorola 2013 compliance season and for completing the divestiture of the business to Lenovo successfully.  Fixed Assets and Manufacturing Controller Google October 2012  –  December 2013  (1 year 3 months) Mountain View, California Responsible for accounting function for all fixed assets and manufacturing activity including servers, networking equipment, data center construction, office buildings construction and remodel, consumer hardware for sale, Google Fiber project and Google X projects such as Google Glass. Manage a global Google team of 16 people (9 direct reports) plus a team of more than 20 people through an outsourcing business partner. Manage $3 billion in quarterly Capex in all these areas. Key accomplishments: \n•\tDefine long and short term objectives for the Global team \n•\tDesign and implement systems strategy to manage the increasing complexity in accounting for fixed assets and manufacturing activity \n•\tEstablish excellent working relationships with business partners in manufacturing, facilities and planning departments \n•\tBuild team responsible for accounting for Google’s new consumer hardware business \n•\tObtain 99% favorable feedback on annual manager survey \n•\tImplement continuous process improvements through managing outsourcing business partner and redesigning internal processes.  \n Global Process Manager, Accounting for Manufacturing and Supply Chain Google August 2011  –  October 2012  (1 year 3 months) Mountain View, California Global Finance Lead for Servers Manufacturing and deployment activity (Annual Capex $1.2B; Opex $200M). Key accomplishments:  \n•\tPartnered with Google Logistics and Operations teams to redesign processes and implement long term solution after identifying incorrect transactions related to spares what would have resulted in a loss of $10M a quarter.  \n•\tWorked with Planning department to provide better information to the business partners for decision making (E.g. provide insights on cost of different machine configurations, used machines with upgrades, etc).  \n•\tFinance lead on cross-functional project to re-design the system architecture to drive financial transactions related with material physical movements around the world. The tool we developed gave the company scalability and flexibility to growth its global infrastructure for the years to come.  \n Global Proces Manager, Accounting for Facilities and Real Estate Google February 2010  –  July 2011  (1 year 6 months) Mountain View, California Global lead for accounting processes related with facilities Opex and Capex including and Real Estate portfolio (Annual Capex $800M; Opex $800M). Key accomplishments: \n•\tDesign and implement new processes for building acquisitions; responsible of accounting for the purchase of a $1.8B building in New York.  \n•\tProvide technical guidance on accounting for leases and real estate purchases \n Senior Accountant Google August 2008  –  February 2010  (1 year 7 months) Buenos Aires - Work from Argentina for the US Accounting team responsible for the Operating Expenses for Google Inc. (Headquarters).  \n- Responsible for outsourcing worldwide accounting processes for facilities expenses to BPO partner in a short period of time. This task required first standardizing process with all regions and then train the BPO resources and travel to their delivery centers in India and Argentina.  Accounting Manager American Express 2002  –  2008  (6 years) Buenos Aires, Argentina •\tResponsible for the accounting of all lines of businesses and delivering monthly results. \n•\tPrepare and deliver presentations to senior management about company’s financial performance. \n•\tAttract, develop and retain talent within the organization. \n•\tPartnered with Internal Audit team to do risks assessment on different focus areas (E.g. aging of account receivables and bad debt calculation).  \n•\tPrepare annual and quarterly budget for G&A areas (Finance, Legal, HR, Security and Facilities). \n Fixed Assets and Manufacturing Controller Google February 2015  – Present (7 months) Mountain View, United States Fixed Assets and Manufacturing Controller Google February 2015  – Present (7 months) Mountain View, United States Finance Controller for Motorola - Spanish Speaking Latin America Google December 2013  –  February 2015  (1 year 3 months) Buenos Aires, Argentina Regional head for all finance functions for Latin America countries (Mexico, Argentina, Chile, Colombia, Peru and Venezuela). The region combined is the 3rd largest market in the world for Motorola business. Manage 3 direct reports and more than 15 people working for different outsourcing providers. Main responsibilities for the team are coordinate AP, AR and payroll functions, prepare financial statements based on local GAAP, manage audits of financial statements, file tax returns timely and accurately and support local business on finance needs. Received highest award in Google Finance worldwide (Titan award) for work performed for Motorola 2013 compliance season and for completing the divestiture of the business to Lenovo successfully.  Finance Controller for Motorola - Spanish Speaking Latin America Google December 2013  –  February 2015  (1 year 3 months) Buenos Aires, Argentina Regional head for all finance functions for Latin America countries (Mexico, Argentina, Chile, Colombia, Peru and Venezuela). The region combined is the 3rd largest market in the world for Motorola business. Manage 3 direct reports and more than 15 people working for different outsourcing providers. Main responsibilities for the team are coordinate AP, AR and payroll functions, prepare financial statements based on local GAAP, manage audits of financial statements, file tax returns timely and accurately and support local business on finance needs. Received highest award in Google Finance worldwide (Titan award) for work performed for Motorola 2013 compliance season and for completing the divestiture of the business to Lenovo successfully.  Fixed Assets and Manufacturing Controller Google October 2012  –  December 2013  (1 year 3 months) Mountain View, California Responsible for accounting function for all fixed assets and manufacturing activity including servers, networking equipment, data center construction, office buildings construction and remodel, consumer hardware for sale, Google Fiber project and Google X projects such as Google Glass. Manage a global Google team of 16 people (9 direct reports) plus a team of more than 20 people through an outsourcing business partner. Manage $3 billion in quarterly Capex in all these areas. Key accomplishments: \n•\tDefine long and short term objectives for the Global team \n•\tDesign and implement systems strategy to manage the increasing complexity in accounting for fixed assets and manufacturing activity \n•\tEstablish excellent working relationships with business partners in manufacturing, facilities and planning departments \n•\tBuild team responsible for accounting for Google’s new consumer hardware business \n•\tObtain 99% favorable feedback on annual manager survey \n•\tImplement continuous process improvements through managing outsourcing business partner and redesigning internal processes.  \n Fixed Assets and Manufacturing Controller Google October 2012  –  December 2013  (1 year 3 months) Mountain View, California Responsible for accounting function for all fixed assets and manufacturing activity including servers, networking equipment, data center construction, office buildings construction and remodel, consumer hardware for sale, Google Fiber project and Google X projects such as Google Glass. Manage a global Google team of 16 people (9 direct reports) plus a team of more than 20 people through an outsourcing business partner. Manage $3 billion in quarterly Capex in all these areas. Key accomplishments: \n•\tDefine long and short term objectives for the Global team \n•\tDesign and implement systems strategy to manage the increasing complexity in accounting for fixed assets and manufacturing activity \n•\tEstablish excellent working relationships with business partners in manufacturing, facilities and planning departments \n•\tBuild team responsible for accounting for Google’s new consumer hardware business \n•\tObtain 99% favorable feedback on annual manager survey \n•\tImplement continuous process improvements through managing outsourcing business partner and redesigning internal processes.  \n Global Process Manager, Accounting for Manufacturing and Supply Chain Google August 2011  –  October 2012  (1 year 3 months) Mountain View, California Global Finance Lead for Servers Manufacturing and deployment activity (Annual Capex $1.2B; Opex $200M). Key accomplishments:  \n•\tPartnered with Google Logistics and Operations teams to redesign processes and implement long term solution after identifying incorrect transactions related to spares what would have resulted in a loss of $10M a quarter.  \n•\tWorked with Planning department to provide better information to the business partners for decision making (E.g. provide insights on cost of different machine configurations, used machines with upgrades, etc).  \n•\tFinance lead on cross-functional project to re-design the system architecture to drive financial transactions related with material physical movements around the world. The tool we developed gave the company scalability and flexibility to growth its global infrastructure for the years to come.  \n Global Process Manager, Accounting for Manufacturing and Supply Chain Google August 2011  –  October 2012  (1 year 3 months) Mountain View, California Global Finance Lead for Servers Manufacturing and deployment activity (Annual Capex $1.2B; Opex $200M). Key accomplishments:  \n•\tPartnered with Google Logistics and Operations teams to redesign processes and implement long term solution after identifying incorrect transactions related to spares what would have resulted in a loss of $10M a quarter.  \n•\tWorked with Planning department to provide better information to the business partners for decision making (E.g. provide insights on cost of different machine configurations, used machines with upgrades, etc).  \n•\tFinance lead on cross-functional project to re-design the system architecture to drive financial transactions related with material physical movements around the world. The tool we developed gave the company scalability and flexibility to growth its global infrastructure for the years to come.  \n Global Proces Manager, Accounting for Facilities and Real Estate Google February 2010  –  July 2011  (1 year 6 months) Mountain View, California Global lead for accounting processes related with facilities Opex and Capex including and Real Estate portfolio (Annual Capex $800M; Opex $800M). Key accomplishments: \n•\tDesign and implement new processes for building acquisitions; responsible of accounting for the purchase of a $1.8B building in New York.  \n•\tProvide technical guidance on accounting for leases and real estate purchases \n Global Proces Manager, Accounting for Facilities and Real Estate Google February 2010  –  July 2011  (1 year 6 months) Mountain View, California Global lead for accounting processes related with facilities Opex and Capex including and Real Estate portfolio (Annual Capex $800M; Opex $800M). Key accomplishments: \n•\tDesign and implement new processes for building acquisitions; responsible of accounting for the purchase of a $1.8B building in New York.  \n•\tProvide technical guidance on accounting for leases and real estate purchases \n Senior Accountant Google August 2008  –  February 2010  (1 year 7 months) Buenos Aires - Work from Argentina for the US Accounting team responsible for the Operating Expenses for Google Inc. (Headquarters).  \n- Responsible for outsourcing worldwide accounting processes for facilities expenses to BPO partner in a short period of time. This task required first standardizing process with all regions and then train the BPO resources and travel to their delivery centers in India and Argentina.  Senior Accountant Google August 2008  –  February 2010  (1 year 7 months) Buenos Aires - Work from Argentina for the US Accounting team responsible for the Operating Expenses for Google Inc. (Headquarters).  \n- Responsible for outsourcing worldwide accounting processes for facilities expenses to BPO partner in a short period of time. This task required first standardizing process with all regions and then train the BPO resources and travel to their delivery centers in India and Argentina.  Accounting Manager American Express 2002  –  2008  (6 years) Buenos Aires, Argentina •\tResponsible for the accounting of all lines of businesses and delivering monthly results. \n•\tPrepare and deliver presentations to senior management about company’s financial performance. \n•\tAttract, develop and retain talent within the organization. \n•\tPartnered with Internal Audit team to do risks assessment on different focus areas (E.g. aging of account receivables and bad debt calculation).  \n•\tPrepare annual and quarterly budget for G&A areas (Finance, Legal, HR, Security and Facilities). \n Accounting Manager American Express 2002  –  2008  (6 years) Buenos Aires, Argentina •\tResponsible for the accounting of all lines of businesses and delivering monthly results. \n•\tPrepare and deliver presentations to senior management about company’s financial performance. \n•\tAttract, develop and retain talent within the organization. \n•\tPartnered with Internal Audit team to do risks assessment on different focus areas (E.g. aging of account receivables and bad debt calculation).  \n•\tPrepare annual and quarterly budget for G&A areas (Finance, Legal, HR, Security and Facilities). \n Skills Essbase Financial Reporting Financial Analysis Process Improvement Forecasting Accounting Project Management Hyperion Enterprise Business Process... Team Management Team Leadership Skills  Essbase Financial Reporting Financial Analysis Process Improvement Forecasting Accounting Project Management Hyperion Enterprise Business Process... Team Management Team Leadership Essbase Financial Reporting Financial Analysis Process Improvement Forecasting Accounting Project Management Hyperion Enterprise Business Process... Team Management Team Leadership Essbase Financial Reporting Financial Analysis Process Improvement Forecasting Accounting Project Management Hyperion Enterprise Business Process... Team Management Team Leadership Education Universidad de Buenos Aires Public Accountant,  Accounting and Finance 2000  – 2006 Universidad de Buenos Aires Public Accountant,  Accounting and Finance 2000  – 2006 Universidad de Buenos Aires Public Accountant,  Accounting and Finance 2000  – 2006 Universidad de Buenos Aires Public Accountant,  Accounting and Finance 2000  – 2006 ", "Summary ACCOUNTING SPECIALIST: Detail-focused accounting professional with experience managing diverse projects for multiple corporate players in the oil and gas industry. Subject Matter Expert (SME) skilled in resolving issues concerning accounts payable, post-production costs, competitive pricing, gas balancing, formula correction, reconciliations, and tax accounting. Talent for monitoring accounting data and projections using General Accepted Accounting Principles (GAAP). Track record of success as a leader and trainer involving accounting specialties intrinsic to oil and gas recovery systems. Value-added background in intercompany and cost-plus finance operations as they pertain to Spanish-speaking U.S. trading partners. Technology: Proficient in PC-based Windows using Microsoft Office (Excel, Word, PowerPoint, Outlook), SAP, and Oracle Summary ACCOUNTING SPECIALIST: Detail-focused accounting professional with experience managing diverse projects for multiple corporate players in the oil and gas industry. Subject Matter Expert (SME) skilled in resolving issues concerning accounts payable, post-production costs, competitive pricing, gas balancing, formula correction, reconciliations, and tax accounting. Talent for monitoring accounting data and projections using General Accepted Accounting Principles (GAAP). Track record of success as a leader and trainer involving accounting specialties intrinsic to oil and gas recovery systems. Value-added background in intercompany and cost-plus finance operations as they pertain to Spanish-speaking U.S. trading partners. Technology: Proficient in PC-based Windows using Microsoft Office (Excel, Word, PowerPoint, Outlook), SAP, and Oracle ACCOUNTING SPECIALIST: Detail-focused accounting professional with experience managing diverse projects for multiple corporate players in the oil and gas industry. Subject Matter Expert (SME) skilled in resolving issues concerning accounts payable, post-production costs, competitive pricing, gas balancing, formula correction, reconciliations, and tax accounting. Talent for monitoring accounting data and projections using General Accepted Accounting Principles (GAAP). Track record of success as a leader and trainer involving accounting specialties intrinsic to oil and gas recovery systems. Value-added background in intercompany and cost-plus finance operations as they pertain to Spanish-speaking U.S. trading partners. Technology: Proficient in PC-based Windows using Microsoft Office (Excel, Word, PowerPoint, Outlook), SAP, and Oracle ACCOUNTING SPECIALIST: Detail-focused accounting professional with experience managing diverse projects for multiple corporate players in the oil and gas industry. Subject Matter Expert (SME) skilled in resolving issues concerning accounts payable, post-production costs, competitive pricing, gas balancing, formula correction, reconciliations, and tax accounting. Talent for monitoring accounting data and projections using General Accepted Accounting Principles (GAAP). Track record of success as a leader and trainer involving accounting specialties intrinsic to oil and gas recovery systems. Value-added background in intercompany and cost-plus finance operations as they pertain to Spanish-speaking U.S. trading partners. Technology: Proficient in PC-based Windows using Microsoft Office (Excel, Word, PowerPoint, Outlook), SAP, and Oracle Experience Sr Revenue Accountant Statoil June 2014  – Present (1 year 3 months) Houston, Texas Area •\tResponsible for monthly financial and revenue closing processes in FI/SAP for Marcellus area \n•\tRecord/calculate oil & gas revenue, remit royalties and pay taxes for oil/gas sales associated with properties in the Marcellus area.  \n•\tReview and process division of interest changes received from Land Administration. \n•\tRecord monthly transactions in general ledger and perform account reconciliations related to assigned properties.  \n•\tAnalyze and reconcile general ledger accounts, prepare accounting entries and invoice marketing division for gas/ngl sales. \n•\tRecord oil, gas and ngl volumes in PRA on a monthly basis for all Marcellus non-operated properties. \n•\tRun, verify, and analyze monthly allocations; create Well IDs, completions, well ties and accounting setups from inception of well thru the valuation process. \n•\tDevelop and maintain a good understanding and overview of the financials, ensuring accuracy  \n•\tComplete controls for SOX compliance  \n•\tResolve Owner Relations related questions. Work closely with Legal department answering litigation letters. \n Revenue Accountant Hess Corporation September 2013  –  May 2014  (9 months) Houston, Texas Area •Records oil and gas revenue transactions to ensure owner distributions are timely, accurate, and compliant with all appropriate sales contracts and lease agreements. \n•Prepares and analyzes all pricing and production information used in monthly oil and gas revenue accruals. \n•Prepares and maintains balance sheet account reconciliation documentation and trend analysis. \n•Maintains adequate documentation for all appropriate variance and analysis reporting. \n•Timely and efficiently resolve all disputes regarding oil and gas revenue transactions \n•Assisted on a project that consisted in the implementation of a new version of SAP PRA for the Revenue Department. BRITISH PETROLEUM (THROUGH ACCENTURE ARGENTINA AND IBM ARGENTINA) Accenture February 2012  –  July 2013  (1 year 6 months) Argentina •Provided accounting analysis and project support to clients of a leading, global management-consulting firm with 260,000 employees in more than 120 countries and U.S. $28B in annual revenues.  \n•Worked directly as an SME for British Petroleum. Interacted cross-departmentally to instruct staff and managers from Revenue, Production, Tax Accounting, and Gas Balancing in various accounting requirements, compliances, processes, and methods.  \n•Worked closely with 600+ property owners to assess and amend post-production marketing costs and baseline team from Revenue to reconcile booking irregularities.  \n•Reviewed and corrected pricing formulas for different sectors and timeframes. Report directly to Revenue Management. \n•Regarded as an expert in oil and gas revenue accounting in both practice and as a trainer. \n•Considered the first point of reference for recognizing and resolving day-to-day accounting issues. \n•Capably provided comprehensive training to department team members to ensure full understanding of accounting specifics for each geographical area. \n•Served as an SME (Subject Matter Expert) for production and revenue accounting at British Petroleum through the multinational information technology company and IT service provider, IBM.  \n•Performed basically the same assignments as with Accenture Argentina and served as accounting project coordinator and trainer of Revenue Department personnel. Accountant – Chile, Colombia and Peru Google Argentina SRL August 2009  –  February 2011  (1 year 7 months) •Responsible for managing core finance and accounting procedures for Chile and Colombia. \n•Responsible for managing PricewaterhouseCoopers operations controlling that they comply with the contract signed between PWC and Google Chile and Colombia. PWC is responsible for managing the Local Balance Sheet. \n•Responsible for managing the Account Payables team outsourced in IBM for Brazil, Argentina, Chile, Colombia and Mexico. \n•Responsible for creating and controlling the application of the US GAAP over Monthly Finance Reports delivered to headquarters for Colombia and Chile Entities. \n•Responsible for controlling variations over budget and forecast monthly for Colombia and Chile Entities. \n•Participate in the Annual Budget Revision for Colombia and Chile Entities. \n•Responsible for calculating Cost Plus and Reseller for Colombia and Chile. \n•Responsible for reconciling Intercompany accounts between Latam entities and Google Inc. \n•Skillfully liaised between IBM AP team and Google LATAM to resolve issues and implement cost-saving AP changes. \n•Effectively launched electronic payroll payment program for Argentina using a CitiDirect platform, avoiding the less-secure, less-efficient manual process. \n•Commended for ability to close accounts and balance all end-of-month intercompany accounts with no major issues. Finance Operations Specialist - Google Inc Google June 2008  –  July 2009  (1 year 2 months) Mountain View - California Held key roles involving intercompany and Cost Plus global operations.  \n•Performed multiple intercompany assignments including but not limited to reviewing loan activities, handling AP reports and bank statements, researching and answering cross-charging inquiries, reconciling identified abnormalities, and finding and resolving causes of discrepancies.  \n•Concerning Cost Plus, reviewed all system calculations and bookings including special cases, prepared and delivered reports to subsidiaries and pertinent departments, reviewed and reconciled Transfer Pricing accounts, and researched and answered all Cost Plus-related questions. \n•Participated in a successful five-month project to totally remove global intercompany currency differences of U.S. $2M, averting costly revaluations. \n•Served as the go-to person for everything related to intercompany global transactions and Cost Plus. Accounts Payable Specialist Google Argentina June 2007  –  June 2008  (1 year 1 month) •Responsible for managing and implementing the Accounts Payable department for Argentina, Mexico and Chile operations for vendor invoices and expense reports \n•Responsible for managing and implementing the Payroll Process for Argentina, Mexico and Chile  \n•Match vendor invoices to existing purchase orders or route to appropriate manager for approval, if necessary.  \n•Accurately code and process the invoices using Oracle 11i.  \n•Responsible for the proper scheduling and processing of unique and recurring payments.  \n•Support tax reporting needs for the payables process.  \n•Assist in resolving all accounts on hold.  \n•Assist in the payment processing runs and monthly system close processes.  \n•Responsible for AP and vendor account reconciliations. Crude Accountant ExxonMobil October 2004  –  May 2007  (2 years 8 months) Argentina Provided accounting support to the Supply section and settled all contract activity, transportation and storage costs, and miscellaneous charges with trading partners, entirely in English. Analyzed and reconciled shipper book inventory balances and customer / vendor balance-sheet accounts. Estimated financials and reported directly to the Financial Accounting Department. \nKey Contributions: \n•\tPersonally reduced critical-aged open items by 60%. \n•\tSpent six months in Dallas as a Trainee. Sales Administrative HEWLETT PACKARD ARGENTINA September 1999  –  December 2003  (4 years 4 months) Responsible for providing support to several major corporations in Argentina, such us Techint, YPF, Procter and Gamble, Unilever \nResponsible for entering purchase order in SAP \nResponsible for the analysis of customer/vendor accounts \nResponsible for pricing and stock control \nWorked very closely with Sales and planning department and product managers in order to achieve customer satisfaction \n \n \nAchievements \n \nImproved sales procedure by implementing a new process adapted to meet both company and client needs \nReduced costs to minimize client returns and rebillings Sr Revenue Accountant Statoil June 2014  – Present (1 year 3 months) Houston, Texas Area •\tResponsible for monthly financial and revenue closing processes in FI/SAP for Marcellus area \n•\tRecord/calculate oil & gas revenue, remit royalties and pay taxes for oil/gas sales associated with properties in the Marcellus area.  \n•\tReview and process division of interest changes received from Land Administration. \n•\tRecord monthly transactions in general ledger and perform account reconciliations related to assigned properties.  \n•\tAnalyze and reconcile general ledger accounts, prepare accounting entries and invoice marketing division for gas/ngl sales. \n•\tRecord oil, gas and ngl volumes in PRA on a monthly basis for all Marcellus non-operated properties. \n•\tRun, verify, and analyze monthly allocations; create Well IDs, completions, well ties and accounting setups from inception of well thru the valuation process. \n•\tDevelop and maintain a good understanding and overview of the financials, ensuring accuracy  \n•\tComplete controls for SOX compliance  \n•\tResolve Owner Relations related questions. Work closely with Legal department answering litigation letters. \n Sr Revenue Accountant Statoil June 2014  – Present (1 year 3 months) Houston, Texas Area •\tResponsible for monthly financial and revenue closing processes in FI/SAP for Marcellus area \n•\tRecord/calculate oil & gas revenue, remit royalties and pay taxes for oil/gas sales associated with properties in the Marcellus area.  \n•\tReview and process division of interest changes received from Land Administration. \n•\tRecord monthly transactions in general ledger and perform account reconciliations related to assigned properties.  \n•\tAnalyze and reconcile general ledger accounts, prepare accounting entries and invoice marketing division for gas/ngl sales. \n•\tRecord oil, gas and ngl volumes in PRA on a monthly basis for all Marcellus non-operated properties. \n•\tRun, verify, and analyze monthly allocations; create Well IDs, completions, well ties and accounting setups from inception of well thru the valuation process. \n•\tDevelop and maintain a good understanding and overview of the financials, ensuring accuracy  \n•\tComplete controls for SOX compliance  \n•\tResolve Owner Relations related questions. Work closely with Legal department answering litigation letters. \n Revenue Accountant Hess Corporation September 2013  –  May 2014  (9 months) Houston, Texas Area •Records oil and gas revenue transactions to ensure owner distributions are timely, accurate, and compliant with all appropriate sales contracts and lease agreements. \n•Prepares and analyzes all pricing and production information used in monthly oil and gas revenue accruals. \n•Prepares and maintains balance sheet account reconciliation documentation and trend analysis. \n•Maintains adequate documentation for all appropriate variance and analysis reporting. \n•Timely and efficiently resolve all disputes regarding oil and gas revenue transactions \n•Assisted on a project that consisted in the implementation of a new version of SAP PRA for the Revenue Department. Revenue Accountant Hess Corporation September 2013  –  May 2014  (9 months) Houston, Texas Area •Records oil and gas revenue transactions to ensure owner distributions are timely, accurate, and compliant with all appropriate sales contracts and lease agreements. \n•Prepares and analyzes all pricing and production information used in monthly oil and gas revenue accruals. \n•Prepares and maintains balance sheet account reconciliation documentation and trend analysis. \n•Maintains adequate documentation for all appropriate variance and analysis reporting. \n•Timely and efficiently resolve all disputes regarding oil and gas revenue transactions \n•Assisted on a project that consisted in the implementation of a new version of SAP PRA for the Revenue Department. BRITISH PETROLEUM (THROUGH ACCENTURE ARGENTINA AND IBM ARGENTINA) Accenture February 2012  –  July 2013  (1 year 6 months) Argentina •Provided accounting analysis and project support to clients of a leading, global management-consulting firm with 260,000 employees in more than 120 countries and U.S. $28B in annual revenues.  \n•Worked directly as an SME for British Petroleum. Interacted cross-departmentally to instruct staff and managers from Revenue, Production, Tax Accounting, and Gas Balancing in various accounting requirements, compliances, processes, and methods.  \n•Worked closely with 600+ property owners to assess and amend post-production marketing costs and baseline team from Revenue to reconcile booking irregularities.  \n•Reviewed and corrected pricing formulas for different sectors and timeframes. Report directly to Revenue Management. \n•Regarded as an expert in oil and gas revenue accounting in both practice and as a trainer. \n•Considered the first point of reference for recognizing and resolving day-to-day accounting issues. \n•Capably provided comprehensive training to department team members to ensure full understanding of accounting specifics for each geographical area. \n•Served as an SME (Subject Matter Expert) for production and revenue accounting at British Petroleum through the multinational information technology company and IT service provider, IBM.  \n•Performed basically the same assignments as with Accenture Argentina and served as accounting project coordinator and trainer of Revenue Department personnel. BRITISH PETROLEUM (THROUGH ACCENTURE ARGENTINA AND IBM ARGENTINA) Accenture February 2012  –  July 2013  (1 year 6 months) Argentina •Provided accounting analysis and project support to clients of a leading, global management-consulting firm with 260,000 employees in more than 120 countries and U.S. $28B in annual revenues.  \n•Worked directly as an SME for British Petroleum. Interacted cross-departmentally to instruct staff and managers from Revenue, Production, Tax Accounting, and Gas Balancing in various accounting requirements, compliances, processes, and methods.  \n•Worked closely with 600+ property owners to assess and amend post-production marketing costs and baseline team from Revenue to reconcile booking irregularities.  \n•Reviewed and corrected pricing formulas for different sectors and timeframes. Report directly to Revenue Management. \n•Regarded as an expert in oil and gas revenue accounting in both practice and as a trainer. \n•Considered the first point of reference for recognizing and resolving day-to-day accounting issues. \n•Capably provided comprehensive training to department team members to ensure full understanding of accounting specifics for each geographical area. \n•Served as an SME (Subject Matter Expert) for production and revenue accounting at British Petroleum through the multinational information technology company and IT service provider, IBM.  \n•Performed basically the same assignments as with Accenture Argentina and served as accounting project coordinator and trainer of Revenue Department personnel. Accountant – Chile, Colombia and Peru Google Argentina SRL August 2009  –  February 2011  (1 year 7 months) •Responsible for managing core finance and accounting procedures for Chile and Colombia. \n•Responsible for managing PricewaterhouseCoopers operations controlling that they comply with the contract signed between PWC and Google Chile and Colombia. PWC is responsible for managing the Local Balance Sheet. \n•Responsible for managing the Account Payables team outsourced in IBM for Brazil, Argentina, Chile, Colombia and Mexico. \n•Responsible for creating and controlling the application of the US GAAP over Monthly Finance Reports delivered to headquarters for Colombia and Chile Entities. \n•Responsible for controlling variations over budget and forecast monthly for Colombia and Chile Entities. \n•Participate in the Annual Budget Revision for Colombia and Chile Entities. \n•Responsible for calculating Cost Plus and Reseller for Colombia and Chile. \n•Responsible for reconciling Intercompany accounts between Latam entities and Google Inc. \n•Skillfully liaised between IBM AP team and Google LATAM to resolve issues and implement cost-saving AP changes. \n•Effectively launched electronic payroll payment program for Argentina using a CitiDirect platform, avoiding the less-secure, less-efficient manual process. \n•Commended for ability to close accounts and balance all end-of-month intercompany accounts with no major issues. Accountant – Chile, Colombia and Peru Google Argentina SRL August 2009  –  February 2011  (1 year 7 months) •Responsible for managing core finance and accounting procedures for Chile and Colombia. \n•Responsible for managing PricewaterhouseCoopers operations controlling that they comply with the contract signed between PWC and Google Chile and Colombia. PWC is responsible for managing the Local Balance Sheet. \n•Responsible for managing the Account Payables team outsourced in IBM for Brazil, Argentina, Chile, Colombia and Mexico. \n•Responsible for creating and controlling the application of the US GAAP over Monthly Finance Reports delivered to headquarters for Colombia and Chile Entities. \n•Responsible for controlling variations over budget and forecast monthly for Colombia and Chile Entities. \n•Participate in the Annual Budget Revision for Colombia and Chile Entities. \n•Responsible for calculating Cost Plus and Reseller for Colombia and Chile. \n•Responsible for reconciling Intercompany accounts between Latam entities and Google Inc. \n•Skillfully liaised between IBM AP team and Google LATAM to resolve issues and implement cost-saving AP changes. \n•Effectively launched electronic payroll payment program for Argentina using a CitiDirect platform, avoiding the less-secure, less-efficient manual process. \n•Commended for ability to close accounts and balance all end-of-month intercompany accounts with no major issues. Finance Operations Specialist - Google Inc Google June 2008  –  July 2009  (1 year 2 months) Mountain View - California Held key roles involving intercompany and Cost Plus global operations.  \n•Performed multiple intercompany assignments including but not limited to reviewing loan activities, handling AP reports and bank statements, researching and answering cross-charging inquiries, reconciling identified abnormalities, and finding and resolving causes of discrepancies.  \n•Concerning Cost Plus, reviewed all system calculations and bookings including special cases, prepared and delivered reports to subsidiaries and pertinent departments, reviewed and reconciled Transfer Pricing accounts, and researched and answered all Cost Plus-related questions. \n•Participated in a successful five-month project to totally remove global intercompany currency differences of U.S. $2M, averting costly revaluations. \n•Served as the go-to person for everything related to intercompany global transactions and Cost Plus. Finance Operations Specialist - Google Inc Google June 2008  –  July 2009  (1 year 2 months) Mountain View - California Held key roles involving intercompany and Cost Plus global operations.  \n•Performed multiple intercompany assignments including but not limited to reviewing loan activities, handling AP reports and bank statements, researching and answering cross-charging inquiries, reconciling identified abnormalities, and finding and resolving causes of discrepancies.  \n•Concerning Cost Plus, reviewed all system calculations and bookings including special cases, prepared and delivered reports to subsidiaries and pertinent departments, reviewed and reconciled Transfer Pricing accounts, and researched and answered all Cost Plus-related questions. \n•Participated in a successful five-month project to totally remove global intercompany currency differences of U.S. $2M, averting costly revaluations. \n•Served as the go-to person for everything related to intercompany global transactions and Cost Plus. Accounts Payable Specialist Google Argentina June 2007  –  June 2008  (1 year 1 month) •Responsible for managing and implementing the Accounts Payable department for Argentina, Mexico and Chile operations for vendor invoices and expense reports \n•Responsible for managing and implementing the Payroll Process for Argentina, Mexico and Chile  \n•Match vendor invoices to existing purchase orders or route to appropriate manager for approval, if necessary.  \n•Accurately code and process the invoices using Oracle 11i.  \n•Responsible for the proper scheduling and processing of unique and recurring payments.  \n•Support tax reporting needs for the payables process.  \n•Assist in resolving all accounts on hold.  \n•Assist in the payment processing runs and monthly system close processes.  \n•Responsible for AP and vendor account reconciliations. Accounts Payable Specialist Google Argentina June 2007  –  June 2008  (1 year 1 month) •Responsible for managing and implementing the Accounts Payable department for Argentina, Mexico and Chile operations for vendor invoices and expense reports \n•Responsible for managing and implementing the Payroll Process for Argentina, Mexico and Chile  \n•Match vendor invoices to existing purchase orders or route to appropriate manager for approval, if necessary.  \n•Accurately code and process the invoices using Oracle 11i.  \n•Responsible for the proper scheduling and processing of unique and recurring payments.  \n•Support tax reporting needs for the payables process.  \n•Assist in resolving all accounts on hold.  \n•Assist in the payment processing runs and monthly system close processes.  \n•Responsible for AP and vendor account reconciliations. Crude Accountant ExxonMobil October 2004  –  May 2007  (2 years 8 months) Argentina Provided accounting support to the Supply section and settled all contract activity, transportation and storage costs, and miscellaneous charges with trading partners, entirely in English. Analyzed and reconciled shipper book inventory balances and customer / vendor balance-sheet accounts. Estimated financials and reported directly to the Financial Accounting Department. \nKey Contributions: \n•\tPersonally reduced critical-aged open items by 60%. \n•\tSpent six months in Dallas as a Trainee. Crude Accountant ExxonMobil October 2004  –  May 2007  (2 years 8 months) Argentina Provided accounting support to the Supply section and settled all contract activity, transportation and storage costs, and miscellaneous charges with trading partners, entirely in English. Analyzed and reconciled shipper book inventory balances and customer / vendor balance-sheet accounts. Estimated financials and reported directly to the Financial Accounting Department. \nKey Contributions: \n•\tPersonally reduced critical-aged open items by 60%. \n•\tSpent six months in Dallas as a Trainee. Sales Administrative HEWLETT PACKARD ARGENTINA September 1999  –  December 2003  (4 years 4 months) Responsible for providing support to several major corporations in Argentina, such us Techint, YPF, Procter and Gamble, Unilever \nResponsible for entering purchase order in SAP \nResponsible for the analysis of customer/vendor accounts \nResponsible for pricing and stock control \nWorked very closely with Sales and planning department and product managers in order to achieve customer satisfaction \n \n \nAchievements \n \nImproved sales procedure by implementing a new process adapted to meet both company and client needs \nReduced costs to minimize client returns and rebillings Sales Administrative HEWLETT PACKARD ARGENTINA September 1999  –  December 2003  (4 years 4 months) Responsible for providing support to several major corporations in Argentina, such us Techint, YPF, Procter and Gamble, Unilever \nResponsible for entering purchase order in SAP \nResponsible for the analysis of customer/vendor accounts \nResponsible for pricing and stock control \nWorked very closely with Sales and planning department and product managers in order to achieve customer satisfaction \n \n \nAchievements \n \nImproved sales procedure by implementing a new process adapted to meet both company and client needs \nReduced costs to minimize client returns and rebillings Languages English Spanish English Spanish English Spanish Skills Accounts Payable Accounting Payroll Processing Accruals Balance Reconciling English Spanish Microsoft Office Year End Accounts Oracle Applications General Ledger Excel Word Supervisory Skills Purchasing Reconciliation SAP Financial Accounting Customer Relations Invoice Processing Monthly Closing General Ledger... Monthly Reporting Year End Close Intercompany Multi-currency Microsoft Excel Account Reconciliation Management Financial Analysis Payroll Customer Service Finance Forecasting Training Leadership Project Planning Human Resources Microsoft Word Bank Reconciliation Financial Reporting See 27+     See less Skills  Accounts Payable Accounting Payroll Processing Accruals Balance Reconciling English Spanish Microsoft Office Year End Accounts Oracle Applications General Ledger Excel Word Supervisory Skills Purchasing Reconciliation SAP Financial Accounting Customer Relations Invoice Processing Monthly Closing General Ledger... Monthly Reporting Year End Close Intercompany Multi-currency Microsoft Excel Account Reconciliation Management Financial Analysis Payroll Customer Service Finance Forecasting Training Leadership Project Planning Human Resources Microsoft Word Bank Reconciliation Financial Reporting See 27+     See less Accounts Payable Accounting Payroll Processing Accruals Balance Reconciling English Spanish Microsoft Office Year End Accounts Oracle Applications General Ledger Excel Word Supervisory Skills Purchasing Reconciliation SAP Financial Accounting Customer Relations Invoice Processing Monthly Closing General Ledger... Monthly Reporting Year End Close Intercompany Multi-currency Microsoft Excel Account Reconciliation Management Financial Analysis Payroll Customer Service Finance Forecasting Training Leadership Project Planning Human Resources Microsoft Word Bank Reconciliation Financial Reporting See 27+     See less Accounts Payable Accounting Payroll Processing Accruals Balance Reconciling English Spanish Microsoft Office Year End Accounts Oracle Applications General Ledger Excel Word Supervisory Skills Purchasing Reconciliation SAP Financial Accounting Customer Relations Invoice Processing Monthly Closing General Ledger... Monthly Reporting Year End Close Intercompany Multi-currency Microsoft Excel Account Reconciliation Management Financial Analysis Payroll Customer Service Finance Forecasting Training Leadership Project Planning Human Resources Microsoft Word Bank Reconciliation Financial Reporting See 27+     See less Education University of Salvador Bachelor of Science, Business Administration,  Business Administration 1998  – 2005 Carlos Pellegrini AS Business Administration 1993  – 1997 University of Salvador Bachelor of Science, Business Administration,  Business Administration 1998  – 2005 University of Salvador Bachelor of Science, Business Administration,  Business Administration 1998  – 2005 University of Salvador Bachelor of Science, Business Administration,  Business Administration 1998  – 2005 Carlos Pellegrini AS Business Administration 1993  – 1997 Carlos Pellegrini AS Business Administration 1993  – 1997 Carlos Pellegrini AS Business Administration 1993  – 1997 ", "Experience Industry Manager, Retail Google February 2014  – Present (1 year 7 months) Sydney Industry Manager, Retail Google February 2014  – Present (1 year 7 months) Sydney Industry Manager, Retail Google February 2014  – Present (1 year 7 months) Sydney Skills Online Advertising Digital Marketing SEM Digital Strategy Search Advertising Google Adwords Mobile Marketing Online Marketing E-commerce Analytics Business Strategy Web Analytics Digital Media Project Management Mobile Advertising Google Analytics New Business Development Team Management Strategic Planning SEO Conversion Optimization Display Advertising Social Media PPC Stakeholder Management See 10+     See less Skills  Online Advertising Digital Marketing SEM Digital Strategy Search Advertising Google Adwords Mobile Marketing Online Marketing E-commerce Analytics Business Strategy Web Analytics Digital Media Project Management Mobile Advertising Google Analytics New Business Development Team Management Strategic Planning SEO Conversion Optimization Display Advertising Social Media PPC Stakeholder Management See 10+     See less Online Advertising Digital Marketing SEM Digital Strategy Search Advertising Google Adwords Mobile Marketing Online Marketing E-commerce Analytics Business Strategy Web Analytics Digital Media Project Management Mobile Advertising Google Analytics New Business Development Team Management Strategic Planning SEO Conversion Optimization Display Advertising Social Media PPC Stakeholder Management See 10+     See less Online Advertising Digital Marketing SEM Digital Strategy Search Advertising Google Adwords Mobile Marketing Online Marketing E-commerce Analytics Business Strategy Web Analytics Digital Media Project Management Mobile Advertising Google Analytics New Business Development Team Management Strategic Planning SEO Conversion Optimization Display Advertising Social Media PPC Stakeholder Management See 10+     See less ", "Summary More than 10 years of Senior Accountant experience. My focus and skills are in GL, month end/year end close, and balance sheet reconciliations. CPA - inactive \n \nPertinent Software Proficiencies  \nAdvanced Excel – Oracle 11 and 12 – Outlook – Quickbooks – SAP – MS Word \n \nI wish to make a long term commitment to a company with people who are enjoyable to work with; in a position that highlight's my skills. Summary More than 10 years of Senior Accountant experience. My focus and skills are in GL, month end/year end close, and balance sheet reconciliations. CPA - inactive \n \nPertinent Software Proficiencies  \nAdvanced Excel – Oracle 11 and 12 – Outlook – Quickbooks – SAP – MS Word \n \nI wish to make a long term commitment to a company with people who are enjoyable to work with; in a position that highlight's my skills. More than 10 years of Senior Accountant experience. My focus and skills are in GL, month end/year end close, and balance sheet reconciliations. CPA - inactive \n \nPertinent Software Proficiencies  \nAdvanced Excel – Oracle 11 and 12 – Outlook – Quickbooks – SAP – MS Word \n \nI wish to make a long term commitment to a company with people who are enjoyable to work with; in a position that highlight's my skills. More than 10 years of Senior Accountant experience. My focus and skills are in GL, month end/year end close, and balance sheet reconciliations. CPA - inactive \n \nPertinent Software Proficiencies  \nAdvanced Excel – Oracle 11 and 12 – Outlook – Quickbooks – SAP – MS Word \n \nI wish to make a long term commitment to a company with people who are enjoyable to work with; in a position that highlight's my skills. Experience Senior Accountant Concentrix March 2015  – Present (6 months) Senior Accountant Boston Scientific - Structural Heart March 2014  –  February 2015  (1 year) Los Gatos •\tSupports the site Financial Analysts in preparation of monthly Financial Packages, headcount and capital reporting. \n•\tParticipates in month end close and maintains month end close binders. \n•\tPrepares monthly account reconciliations. \n•\tMaintains and updates the fixed asset system, including capital in progress.  \n•\tBooks monthly depreciation and performs fixed asset audits, as needed. \n•\tWorks with other related BSC entities to prepare and post intercompany entries. \n•\tPrepares property tax returns and monthly sales tax payments. \n•\tPrepares and posts payroll related accounting entries. \n•\tPartner with Purchasing Department for Accounts Payable / Purchasing continuous improvement activities. \n•\tProvides backup for A/P as needed to ensure timely payment of vendor invoices. \n•\tAssist finance team members and nearby staff as time allows.  Senior Accountant CRC Health Group November 2013  –  December 2013  (2 months) San Jose Fixed Asset; reconciliation to inventory counts,  \nPrepared and posted adjusted journal entries to tie physical count to book \nResearched and prepared list of disposed items to write off. Senior Accountant 10 Gen July 2013  –  August 2013  (2 months) Palo Alto Researched and reconciled multiple asset and liability accounts Senior Accountant Odwalla September 2011  –  May 2013  (1 year 9 months) Half Moon Bay •\tMultiple bank accounts; reconciliation, research, JE. \n•\tClose month in 3 business days. \n•\tAll prepaid accounts; reconciliation, research, monthly and adjusting JE. \n•\tAnnual charity donation reconciliation, 1099 reports, and marketing reversal/current FY accrual. \n•\tSales and use tax reconciliation and audit.  \n•\tCRV reconciliation and audit. \n•\tTrack $500M of accrued marketing expenses. \n•\tAll intercompany transactions including Minute Maid Canada, Coca-Cola, and others. \n•\tTransition all accounting functions to CCR in Georgia and Florida. Senior Accountant Google February 2011  –  June 2011  (5 months) Mountain View Daily reviewed 40 international bank accounts and log all transactions.  \nReconciled daily transactions with auto loads in Oracle. \nResearched discrepancies and review with other accounting staff. \nReconciled and researched Payroll related questions for employees. \nOther Oracle account reports, research, and reconciliation. Senior Accountant Report to CFO Zola October 2010  –  January 2011  (4 months) San Francisco Bay Area Reconciled multiple bank statements - caught up 6 months. This included reconciling the accounting software bank reconciliation module with the software's GL for those accounts. \nWrote up instructions on bank statement reconciliation process including tricks for finding discrepancies. \nReconciled remaining balance sheet accounts. Started with documenting and reconciling prior year beginning balances. Accounts included Prepaid, Short Term Liabilities, Accruals, Payroll Taxes and Petty Cash. \nResearched discrepancies and booked adjustments for both prior and current year. \nDocumented back up for reconciled current balances.  \nDocumented, reconciled and booked fixed asset including new/disposed assets and depreciation. \nReconciled GL expense accounts with current and prior invoices. Worked with vendors to clear any discrepancies. Including medical billing, insurance payments, and broker commissions. \nResearched and documented all vendor data - submitted 1099 data. \nReconciled payroll balances with: GL, State/Fed reports, and PR software. Included sick leave, PTO, employee portion of benefits, taxes and different state requirements. Refunded EE portion if necessary. \nResearched City of SF tax requirements and saved company $10k, \nResearched HR docs to hand off to Emplicity: PTO, medical benefits, H.S.A., deposits, and bonuses. \nResponsible for HR and payroll functions for staff of 16 in 5 different states. \nInternational bank transfers. Senior Accountant Report to Controller Mid Peninsula Housing December 2008  –  January 2010  (1 year 2 months) Foster City CA Researched and prepared consolidated financial statements for over 100 LP's and Corps.  \nRevised and restated 3 years of financial statements bringing them into compliance with consolidated financial requirements. \nReviewed and ensured compliance with regulatory, partnership, and loan agreements. \nMonthly close of 15 properties with tight deadlines. \nBooked month and quarter end allocations and adjustments. \nCoordinated and prepared fiscal budgets. \nReconciled balance sheet accounts, prepared and updated schedules monthly. \nReconciled bank and loan statements - tracked replacement and operating reserve accounts. \nFixed asset schedules including new/disposed assets and depreciation allocations. \nResearched discrepancies and booked adjustments. \nPrepared and presented monthly/quarterly/annual financial and variance analysis to Controller. \nPrepared ad hoc schedules and Excel summaries. Senior Accountant\tReport to CFO Mandarin Oriental Hotel Group November 2007  –  June 2008  (8 months) Financial District San Francisco Researched and prepared domestic consolidations and assisted with IFRS consolidations. \nCurrency exchange and related adjustments. \nLarge international fund transfers and CD's renewals on rotating maturity schedule. \nSupervised Accounts Payable staff. \nMonthly close of US hotels in three days. \nBook month end and year end allocations and adjustments. \nCreated and maintained monthly cash projections. \nPrepared and managed fiscal and mid-year budgets. \nPrimary contact for tax firm requests and research. \nPrepared and submitted quarterly sales tax calculations to multiple state tax boards. \nPrepared and mailed government forms. \nReconciled balance sheet accounts, including inter-company transfers and recharges. \nReconciled bank, credit card, and expense reports. \nReconciled and maintained back up data for fixed asset schedules. \nResearched discrepancies and booked adjustments. \nPrepared and presented monthly/quarterly/annual financial and variance analysis to CFO - US. \nPrepared ad hoc schedules and Excel summaries. Manager Finance Inventory\tReport to CFO Second Harvest Food Bank May 2005  –  October 2007  (2 years 6 months) Reconciled inventory and booked cost of goods sold. \nReviewed and input receiving documents \nBooked distributions daily. \nDetermined quantities available for distribution. \nCreated process for kitting individual products into \"lunch boxes\". \nPrepared and managed fiscal and mid-year budget. \nPrimary contact for all inventory audit needs \nPrepared and mailed government forms. \nResearched discrepancies and booked adjustments. \nPrepared and presented variance analysis to CFO and warehouse manager. \nResearched, implemented and debugged new computerized inventory tracking system \nPrepared ad hoc schedules, and Excel summaries. \nManaged staff in Inventory. Senior Accountant\tReport to CFO Humane Society Silicon Valley November 2001  –  May 2005  (3 years 7 months) Tracked and paid employee payroll deductions. (Medical, retirement, union dues, etc). \nImplemented transition to QuickBooks and QuickBooks Point of Sale software. \nReviewed and backed up for accounts payable and payroll staff. \nManaged staff in Payroll, A/P, Development Reconciliation, and Inventory/Purchasing. \nPrepared deposits and allocated daily revenue. \nBooked month end and year end allocations and adjustments. \nCreated and maintained monthly cash projections. \nCoordinated, prepared, and managed fiscal and mid-year budgets. \nPrimary contact for all audit and tax requests and research. \nPrepared and submitted quarterly sales tax calculations. \nPrepared and mail government forms. \nReconciled balance sheet accounts. \nReconciliations bank, credit card, and expense reports. \nMaintained fixed asset schedules including new/disposed assets, and depreciation allocations. \nResearched discrepancies and booked adjustments. \nPrepared and presented variance analysis to CFO and Senior Staff. \nPrepared monthly, quarterly, and yearly financial analysis. \nPrepared ad hoc schedules, and Excel summaries. Industrial Engineer Web Van January 1999  –  January 2001  (2 years 1 month) Scheduling and optimization Systems Planner FedEx 1997  –  1999  (2 years) Optimized flight and truck scheduling Maintenance Planner United Airlines 1989  –  1997  (8 years) Optimized aircraft maintenance schedules Senior Accountant Concentrix March 2015  – Present (6 months) Senior Accountant Concentrix March 2015  – Present (6 months) Senior Accountant Boston Scientific - Structural Heart March 2014  –  February 2015  (1 year) Los Gatos •\tSupports the site Financial Analysts in preparation of monthly Financial Packages, headcount and capital reporting. \n•\tParticipates in month end close and maintains month end close binders. \n•\tPrepares monthly account reconciliations. \n•\tMaintains and updates the fixed asset system, including capital in progress.  \n•\tBooks monthly depreciation and performs fixed asset audits, as needed. \n•\tWorks with other related BSC entities to prepare and post intercompany entries. \n•\tPrepares property tax returns and monthly sales tax payments. \n•\tPrepares and posts payroll related accounting entries. \n•\tPartner with Purchasing Department for Accounts Payable / Purchasing continuous improvement activities. \n•\tProvides backup for A/P as needed to ensure timely payment of vendor invoices. \n•\tAssist finance team members and nearby staff as time allows.  Senior Accountant Boston Scientific - Structural Heart March 2014  –  February 2015  (1 year) Los Gatos •\tSupports the site Financial Analysts in preparation of monthly Financial Packages, headcount and capital reporting. \n•\tParticipates in month end close and maintains month end close binders. \n•\tPrepares monthly account reconciliations. \n•\tMaintains and updates the fixed asset system, including capital in progress.  \n•\tBooks monthly depreciation and performs fixed asset audits, as needed. \n•\tWorks with other related BSC entities to prepare and post intercompany entries. \n•\tPrepares property tax returns and monthly sales tax payments. \n•\tPrepares and posts payroll related accounting entries. \n•\tPartner with Purchasing Department for Accounts Payable / Purchasing continuous improvement activities. \n•\tProvides backup for A/P as needed to ensure timely payment of vendor invoices. \n•\tAssist finance team members and nearby staff as time allows.  Senior Accountant CRC Health Group November 2013  –  December 2013  (2 months) San Jose Fixed Asset; reconciliation to inventory counts,  \nPrepared and posted adjusted journal entries to tie physical count to book \nResearched and prepared list of disposed items to write off. Senior Accountant CRC Health Group November 2013  –  December 2013  (2 months) San Jose Fixed Asset; reconciliation to inventory counts,  \nPrepared and posted adjusted journal entries to tie physical count to book \nResearched and prepared list of disposed items to write off. Senior Accountant 10 Gen July 2013  –  August 2013  (2 months) Palo Alto Researched and reconciled multiple asset and liability accounts Senior Accountant 10 Gen July 2013  –  August 2013  (2 months) Palo Alto Researched and reconciled multiple asset and liability accounts Senior Accountant Odwalla September 2011  –  May 2013  (1 year 9 months) Half Moon Bay •\tMultiple bank accounts; reconciliation, research, JE. \n•\tClose month in 3 business days. \n•\tAll prepaid accounts; reconciliation, research, monthly and adjusting JE. \n•\tAnnual charity donation reconciliation, 1099 reports, and marketing reversal/current FY accrual. \n•\tSales and use tax reconciliation and audit.  \n•\tCRV reconciliation and audit. \n•\tTrack $500M of accrued marketing expenses. \n•\tAll intercompany transactions including Minute Maid Canada, Coca-Cola, and others. \n•\tTransition all accounting functions to CCR in Georgia and Florida. Senior Accountant Odwalla September 2011  –  May 2013  (1 year 9 months) Half Moon Bay •\tMultiple bank accounts; reconciliation, research, JE. \n•\tClose month in 3 business days. \n•\tAll prepaid accounts; reconciliation, research, monthly and adjusting JE. \n•\tAnnual charity donation reconciliation, 1099 reports, and marketing reversal/current FY accrual. \n•\tSales and use tax reconciliation and audit.  \n•\tCRV reconciliation and audit. \n•\tTrack $500M of accrued marketing expenses. \n•\tAll intercompany transactions including Minute Maid Canada, Coca-Cola, and others. \n•\tTransition all accounting functions to CCR in Georgia and Florida. Senior Accountant Google February 2011  –  June 2011  (5 months) Mountain View Daily reviewed 40 international bank accounts and log all transactions.  \nReconciled daily transactions with auto loads in Oracle. \nResearched discrepancies and review with other accounting staff. \nReconciled and researched Payroll related questions for employees. \nOther Oracle account reports, research, and reconciliation. Senior Accountant Google February 2011  –  June 2011  (5 months) Mountain View Daily reviewed 40 international bank accounts and log all transactions.  \nReconciled daily transactions with auto loads in Oracle. \nResearched discrepancies and review with other accounting staff. \nReconciled and researched Payroll related questions for employees. \nOther Oracle account reports, research, and reconciliation. Senior Accountant Report to CFO Zola October 2010  –  January 2011  (4 months) San Francisco Bay Area Reconciled multiple bank statements - caught up 6 months. This included reconciling the accounting software bank reconciliation module with the software's GL for those accounts. \nWrote up instructions on bank statement reconciliation process including tricks for finding discrepancies. \nReconciled remaining balance sheet accounts. Started with documenting and reconciling prior year beginning balances. Accounts included Prepaid, Short Term Liabilities, Accruals, Payroll Taxes and Petty Cash. \nResearched discrepancies and booked adjustments for both prior and current year. \nDocumented back up for reconciled current balances.  \nDocumented, reconciled and booked fixed asset including new/disposed assets and depreciation. \nReconciled GL expense accounts with current and prior invoices. Worked with vendors to clear any discrepancies. Including medical billing, insurance payments, and broker commissions. \nResearched and documented all vendor data - submitted 1099 data. \nReconciled payroll balances with: GL, State/Fed reports, and PR software. Included sick leave, PTO, employee portion of benefits, taxes and different state requirements. Refunded EE portion if necessary. \nResearched City of SF tax requirements and saved company $10k, \nResearched HR docs to hand off to Emplicity: PTO, medical benefits, H.S.A., deposits, and bonuses. \nResponsible for HR and payroll functions for staff of 16 in 5 different states. \nInternational bank transfers. Senior Accountant Report to CFO Zola October 2010  –  January 2011  (4 months) San Francisco Bay Area Reconciled multiple bank statements - caught up 6 months. This included reconciling the accounting software bank reconciliation module with the software's GL for those accounts. \nWrote up instructions on bank statement reconciliation process including tricks for finding discrepancies. \nReconciled remaining balance sheet accounts. Started with documenting and reconciling prior year beginning balances. Accounts included Prepaid, Short Term Liabilities, Accruals, Payroll Taxes and Petty Cash. \nResearched discrepancies and booked adjustments for both prior and current year. \nDocumented back up for reconciled current balances.  \nDocumented, reconciled and booked fixed asset including new/disposed assets and depreciation. \nReconciled GL expense accounts with current and prior invoices. Worked with vendors to clear any discrepancies. Including medical billing, insurance payments, and broker commissions. \nResearched and documented all vendor data - submitted 1099 data. \nReconciled payroll balances with: GL, State/Fed reports, and PR software. Included sick leave, PTO, employee portion of benefits, taxes and different state requirements. Refunded EE portion if necessary. \nResearched City of SF tax requirements and saved company $10k, \nResearched HR docs to hand off to Emplicity: PTO, medical benefits, H.S.A., deposits, and bonuses. \nResponsible for HR and payroll functions for staff of 16 in 5 different states. \nInternational bank transfers. Senior Accountant Report to Controller Mid Peninsula Housing December 2008  –  January 2010  (1 year 2 months) Foster City CA Researched and prepared consolidated financial statements for over 100 LP's and Corps.  \nRevised and restated 3 years of financial statements bringing them into compliance with consolidated financial requirements. \nReviewed and ensured compliance with regulatory, partnership, and loan agreements. \nMonthly close of 15 properties with tight deadlines. \nBooked month and quarter end allocations and adjustments. \nCoordinated and prepared fiscal budgets. \nReconciled balance sheet accounts, prepared and updated schedules monthly. \nReconciled bank and loan statements - tracked replacement and operating reserve accounts. \nFixed asset schedules including new/disposed assets and depreciation allocations. \nResearched discrepancies and booked adjustments. \nPrepared and presented monthly/quarterly/annual financial and variance analysis to Controller. \nPrepared ad hoc schedules and Excel summaries. Senior Accountant Report to Controller Mid Peninsula Housing December 2008  –  January 2010  (1 year 2 months) Foster City CA Researched and prepared consolidated financial statements for over 100 LP's and Corps.  \nRevised and restated 3 years of financial statements bringing them into compliance with consolidated financial requirements. \nReviewed and ensured compliance with regulatory, partnership, and loan agreements. \nMonthly close of 15 properties with tight deadlines. \nBooked month and quarter end allocations and adjustments. \nCoordinated and prepared fiscal budgets. \nReconciled balance sheet accounts, prepared and updated schedules monthly. \nReconciled bank and loan statements - tracked replacement and operating reserve accounts. \nFixed asset schedules including new/disposed assets and depreciation allocations. \nResearched discrepancies and booked adjustments. \nPrepared and presented monthly/quarterly/annual financial and variance analysis to Controller. \nPrepared ad hoc schedules and Excel summaries. Senior Accountant\tReport to CFO Mandarin Oriental Hotel Group November 2007  –  June 2008  (8 months) Financial District San Francisco Researched and prepared domestic consolidations and assisted with IFRS consolidations. \nCurrency exchange and related adjustments. \nLarge international fund transfers and CD's renewals on rotating maturity schedule. \nSupervised Accounts Payable staff. \nMonthly close of US hotels in three days. \nBook month end and year end allocations and adjustments. \nCreated and maintained monthly cash projections. \nPrepared and managed fiscal and mid-year budgets. \nPrimary contact for tax firm requests and research. \nPrepared and submitted quarterly sales tax calculations to multiple state tax boards. \nPrepared and mailed government forms. \nReconciled balance sheet accounts, including inter-company transfers and recharges. \nReconciled bank, credit card, and expense reports. \nReconciled and maintained back up data for fixed asset schedules. \nResearched discrepancies and booked adjustments. \nPrepared and presented monthly/quarterly/annual financial and variance analysis to CFO - US. \nPrepared ad hoc schedules and Excel summaries. Senior Accountant\tReport to CFO Mandarin Oriental Hotel Group November 2007  –  June 2008  (8 months) Financial District San Francisco Researched and prepared domestic consolidations and assisted with IFRS consolidations. \nCurrency exchange and related adjustments. \nLarge international fund transfers and CD's renewals on rotating maturity schedule. \nSupervised Accounts Payable staff. \nMonthly close of US hotels in three days. \nBook month end and year end allocations and adjustments. \nCreated and maintained monthly cash projections. \nPrepared and managed fiscal and mid-year budgets. \nPrimary contact for tax firm requests and research. \nPrepared and submitted quarterly sales tax calculations to multiple state tax boards. \nPrepared and mailed government forms. \nReconciled balance sheet accounts, including inter-company transfers and recharges. \nReconciled bank, credit card, and expense reports. \nReconciled and maintained back up data for fixed asset schedules. \nResearched discrepancies and booked adjustments. \nPrepared and presented monthly/quarterly/annual financial and variance analysis to CFO - US. \nPrepared ad hoc schedules and Excel summaries. Manager Finance Inventory\tReport to CFO Second Harvest Food Bank May 2005  –  October 2007  (2 years 6 months) Reconciled inventory and booked cost of goods sold. \nReviewed and input receiving documents \nBooked distributions daily. \nDetermined quantities available for distribution. \nCreated process for kitting individual products into \"lunch boxes\". \nPrepared and managed fiscal and mid-year budget. \nPrimary contact for all inventory audit needs \nPrepared and mailed government forms. \nResearched discrepancies and booked adjustments. \nPrepared and presented variance analysis to CFO and warehouse manager. \nResearched, implemented and debugged new computerized inventory tracking system \nPrepared ad hoc schedules, and Excel summaries. \nManaged staff in Inventory. Manager Finance Inventory\tReport to CFO Second Harvest Food Bank May 2005  –  October 2007  (2 years 6 months) Reconciled inventory and booked cost of goods sold. \nReviewed and input receiving documents \nBooked distributions daily. \nDetermined quantities available for distribution. \nCreated process for kitting individual products into \"lunch boxes\". \nPrepared and managed fiscal and mid-year budget. \nPrimary contact for all inventory audit needs \nPrepared and mailed government forms. \nResearched discrepancies and booked adjustments. \nPrepared and presented variance analysis to CFO and warehouse manager. \nResearched, implemented and debugged new computerized inventory tracking system \nPrepared ad hoc schedules, and Excel summaries. \nManaged staff in Inventory. Senior Accountant\tReport to CFO Humane Society Silicon Valley November 2001  –  May 2005  (3 years 7 months) Tracked and paid employee payroll deductions. (Medical, retirement, union dues, etc). \nImplemented transition to QuickBooks and QuickBooks Point of Sale software. \nReviewed and backed up for accounts payable and payroll staff. \nManaged staff in Payroll, A/P, Development Reconciliation, and Inventory/Purchasing. \nPrepared deposits and allocated daily revenue. \nBooked month end and year end allocations and adjustments. \nCreated and maintained monthly cash projections. \nCoordinated, prepared, and managed fiscal and mid-year budgets. \nPrimary contact for all audit and tax requests and research. \nPrepared and submitted quarterly sales tax calculations. \nPrepared and mail government forms. \nReconciled balance sheet accounts. \nReconciliations bank, credit card, and expense reports. \nMaintained fixed asset schedules including new/disposed assets, and depreciation allocations. \nResearched discrepancies and booked adjustments. \nPrepared and presented variance analysis to CFO and Senior Staff. \nPrepared monthly, quarterly, and yearly financial analysis. \nPrepared ad hoc schedules, and Excel summaries. Senior Accountant\tReport to CFO Humane Society Silicon Valley November 2001  –  May 2005  (3 years 7 months) Tracked and paid employee payroll deductions. (Medical, retirement, union dues, etc). \nImplemented transition to QuickBooks and QuickBooks Point of Sale software. \nReviewed and backed up for accounts payable and payroll staff. \nManaged staff in Payroll, A/P, Development Reconciliation, and Inventory/Purchasing. \nPrepared deposits and allocated daily revenue. \nBooked month end and year end allocations and adjustments. \nCreated and maintained monthly cash projections. \nCoordinated, prepared, and managed fiscal and mid-year budgets. \nPrimary contact for all audit and tax requests and research. \nPrepared and submitted quarterly sales tax calculations. \nPrepared and mail government forms. \nReconciled balance sheet accounts. \nReconciliations bank, credit card, and expense reports. \nMaintained fixed asset schedules including new/disposed assets, and depreciation allocations. \nResearched discrepancies and booked adjustments. \nPrepared and presented variance analysis to CFO and Senior Staff. \nPrepared monthly, quarterly, and yearly financial analysis. \nPrepared ad hoc schedules, and Excel summaries. Industrial Engineer Web Van January 1999  –  January 2001  (2 years 1 month) Scheduling and optimization Industrial Engineer Web Van January 1999  –  January 2001  (2 years 1 month) Scheduling and optimization Systems Planner FedEx 1997  –  1999  (2 years) Optimized flight and truck scheduling Systems Planner FedEx 1997  –  1999  (2 years) Optimized flight and truck scheduling Maintenance Planner United Airlines 1989  –  1997  (8 years) Optimized aircraft maintenance schedules Maintenance Planner United Airlines 1989  –  1997  (8 years) Optimized aircraft maintenance schedules Skills Accounting Accruals General Ledger Microsoft Office Financial Reporting Accounts Payable Payroll Variance Analysis Fixed Assets Consolidation Bank Reconciliation CPA Month End Close Balance Sheet Reconciliations Year End Accounts Budgeting GAAP Excel Oracle Outlook Quickbooks PowerPoint SAP Word Non-profits Budgets Microsoft Excel Nonprofits QuickBooks Account Reconciliation Financial Analysis Financial Statements Auditing See 19+     See less Skills  Accounting Accruals General Ledger Microsoft Office Financial Reporting Accounts Payable Payroll Variance Analysis Fixed Assets Consolidation Bank Reconciliation CPA Month End Close Balance Sheet Reconciliations Year End Accounts Budgeting GAAP Excel Oracle Outlook Quickbooks PowerPoint SAP Word Non-profits Budgets Microsoft Excel Nonprofits QuickBooks Account Reconciliation Financial Analysis Financial Statements Auditing See 19+     See less Accounting Accruals General Ledger Microsoft Office Financial Reporting Accounts Payable Payroll Variance Analysis Fixed Assets Consolidation Bank Reconciliation CPA Month End Close Balance Sheet Reconciliations Year End Accounts Budgeting GAAP Excel Oracle Outlook Quickbooks PowerPoint SAP Word Non-profits Budgets Microsoft Excel Nonprofits QuickBooks Account Reconciliation Financial Analysis Financial Statements Auditing See 19+     See less Accounting Accruals General Ledger Microsoft Office Financial Reporting Accounts Payable Payroll Variance Analysis Fixed Assets Consolidation Bank Reconciliation CPA Month End Close Balance Sheet Reconciliations Year End Accounts Budgeting GAAP Excel Oracle Outlook Quickbooks PowerPoint SAP Word Non-profits Budgets Microsoft Excel Nonprofits QuickBooks Account Reconciliation Financial Analysis Financial Statements Auditing See 19+     See less Education University of California, Berkeley Bachelors,  Science Industrial Engineering San Francisco State University Accounting; Consolidated Financial Statements ,  International Accounting/IFRS 2008  – 2009 University of California, Berkeley Bachelors,  Science Industrial Engineering University of California, Berkeley Bachelors,  Science Industrial Engineering University of California, Berkeley Bachelors,  Science Industrial Engineering San Francisco State University Accounting; Consolidated Financial Statements ,  International Accounting/IFRS 2008  – 2009 San Francisco State University Accounting; Consolidated Financial Statements ,  International Accounting/IFRS 2008  – 2009 San Francisco State University Accounting; Consolidated Financial Statements ,  International Accounting/IFRS 2008  – 2009 ", "Experience Brand Marketing Lead Google June 2013  – Present (2 years 3 months) San Francisco Media Solutions Lead Google May 2011  –  June 2013  (2 years 2 months) Paris Area, France Online Media Consultant and Mobile Specialist - AdWords Google January 2010  –  May 2011  (1 year 5 months) Online Media Associate and Project lead - AdWords Google April 2008  –  December 2009  (1 year 9 months) Fixed Asset Financial Accountant for Google EMEA (Internship) Google March 2008  –  October 2008  (8 months) AdWords Associate (Internship) Google June 2007  –  September 2007  (4 months) Internal Auditor Etat-Major - French Chief of Defence Staff, Lille (France) July 2006  –  August 2006  (2 months) Freelance Journalist La Voix du Nord July 2005  –  August 2005  (2 months) Brand Marketing Lead Google June 2013  – Present (2 years 3 months) San Francisco Brand Marketing Lead Google June 2013  – Present (2 years 3 months) San Francisco Media Solutions Lead Google May 2011  –  June 2013  (2 years 2 months) Paris Area, France Media Solutions Lead Google May 2011  –  June 2013  (2 years 2 months) Paris Area, France Online Media Consultant and Mobile Specialist - AdWords Google January 2010  –  May 2011  (1 year 5 months) Online Media Consultant and Mobile Specialist - AdWords Google January 2010  –  May 2011  (1 year 5 months) Online Media Associate and Project lead - AdWords Google April 2008  –  December 2009  (1 year 9 months) Online Media Associate and Project lead - AdWords Google April 2008  –  December 2009  (1 year 9 months) Fixed Asset Financial Accountant for Google EMEA (Internship) Google March 2008  –  October 2008  (8 months) Fixed Asset Financial Accountant for Google EMEA (Internship) Google March 2008  –  October 2008  (8 months) AdWords Associate (Internship) Google June 2007  –  September 2007  (4 months) AdWords Associate (Internship) Google June 2007  –  September 2007  (4 months) Internal Auditor Etat-Major - French Chief of Defence Staff, Lille (France) July 2006  –  August 2006  (2 months) Internal Auditor Etat-Major - French Chief of Defence Staff, Lille (France) July 2006  –  August 2006  (2 months) Freelance Journalist La Voix du Nord July 2005  –  August 2005  (2 months) Freelance Journalist La Voix du Nord July 2005  –  August 2005  (2 months) Skills Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Skills  Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Education University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux University of Warwick International Relations 2006  – 2007 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux University of Warwick International Relations 2006  – 2007 University of Warwick International Relations 2006  – 2007 University of Warwick International Relations 2006  – 2007 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 ", "Experience EMEA Finance Manager - New Busineess Google May 2013  – Present (2 years 4 months) Ireland Senior M&A Integration Accountant Google Inc August 2012  – Present (3 years 1 month) Mountain View, CA M&A Entity Integration Accountant Google Ireland Limited September 2010  –  August 2012  (2 years) Entity Integration Accountant in Mergers & Acquisitions department at Google Ireland Limited Assistant Manager - Industrial, Commercial and Technology Audit Ernst & Young September 2005  –  December 2010  (5 years 4 months) Audit assistant manager on a wide variety of industries; airline, car rental, construction, distribution, engineering, equipment hire, fast food, manufacturing, fuel oil distribution, software and telecommunications. Telemarketing sales officer Xentel MD Inc, Vancouver, B.C., Canada May 2004  –  September 2004  (5 months) Accounts payable assistant accountant Symantec Limited January 2003  –  September 2003  (9 months) Accounts payable assistant accountant for Symantec's EMEA headquarters Restaurant Manageress La Cornemuse Restaurant, Grenoble, France January 2002  –  September 2002  (9 months) Restaurant Manageress Production line assistant Run Zeitarbeit GmbH, Konigstrasse 87, NCmberg, Germany May 2001  –  September 2001  (5 months) Production line assistant Administration officer Letterkenny Institute of Technology (LYIT), Co. Donegal September 1999  –  September 2000  (1 year 1 month) Administration officer in the Letterkenny Institute of Technology (LYIT) EMEA Finance Manager - New Busineess Google May 2013  – Present (2 years 4 months) Ireland EMEA Finance Manager - New Busineess Google May 2013  – Present (2 years 4 months) Ireland Senior M&A Integration Accountant Google Inc August 2012  – Present (3 years 1 month) Mountain View, CA Senior M&A Integration Accountant Google Inc August 2012  – Present (3 years 1 month) Mountain View, CA M&A Entity Integration Accountant Google Ireland Limited September 2010  –  August 2012  (2 years) Entity Integration Accountant in Mergers & Acquisitions department at Google Ireland Limited M&A Entity Integration Accountant Google Ireland Limited September 2010  –  August 2012  (2 years) Entity Integration Accountant in Mergers & Acquisitions department at Google Ireland Limited Assistant Manager - Industrial, Commercial and Technology Audit Ernst & Young September 2005  –  December 2010  (5 years 4 months) Audit assistant manager on a wide variety of industries; airline, car rental, construction, distribution, engineering, equipment hire, fast food, manufacturing, fuel oil distribution, software and telecommunications. Assistant Manager - Industrial, Commercial and Technology Audit Ernst & Young September 2005  –  December 2010  (5 years 4 months) Audit assistant manager on a wide variety of industries; airline, car rental, construction, distribution, engineering, equipment hire, fast food, manufacturing, fuel oil distribution, software and telecommunications. Telemarketing sales officer Xentel MD Inc, Vancouver, B.C., Canada May 2004  –  September 2004  (5 months) Telemarketing sales officer Xentel MD Inc, Vancouver, B.C., Canada May 2004  –  September 2004  (5 months) Accounts payable assistant accountant Symantec Limited January 2003  –  September 2003  (9 months) Accounts payable assistant accountant for Symantec's EMEA headquarters Accounts payable assistant accountant Symantec Limited January 2003  –  September 2003  (9 months) Accounts payable assistant accountant for Symantec's EMEA headquarters Restaurant Manageress La Cornemuse Restaurant, Grenoble, France January 2002  –  September 2002  (9 months) Restaurant Manageress Restaurant Manageress La Cornemuse Restaurant, Grenoble, France January 2002  –  September 2002  (9 months) Restaurant Manageress Production line assistant Run Zeitarbeit GmbH, Konigstrasse 87, NCmberg, Germany May 2001  –  September 2001  (5 months) Production line assistant Production line assistant Run Zeitarbeit GmbH, Konigstrasse 87, NCmberg, Germany May 2001  –  September 2001  (5 months) Production line assistant Administration officer Letterkenny Institute of Technology (LYIT), Co. Donegal September 1999  –  September 2000  (1 year 1 month) Administration officer in the Letterkenny Institute of Technology (LYIT) Administration officer Letterkenny Institute of Technology (LYIT), Co. Donegal September 1999  –  September 2000  (1 year 1 month) Administration officer in the Letterkenny Institute of Technology (LYIT) Languages French French French Skills IFRS Mergers External Audit Auditing US GAAP Financial Reporting Internal Controls Big 4 Financial Accounting Accounting Assurance Sarbanes-Oxley Act Financial Analysis Financial Audits UK GAAP Skills  IFRS Mergers External Audit Auditing US GAAP Financial Reporting Internal Controls Big 4 Financial Accounting Accounting Assurance Sarbanes-Oxley Act Financial Analysis Financial Audits UK GAAP IFRS Mergers External Audit Auditing US GAAP Financial Reporting Internal Controls Big 4 Financial Accounting Accounting Assurance Sarbanes-Oxley Act Financial Analysis Financial Audits UK GAAP IFRS Mergers External Audit Auditing US GAAP Financial Reporting Internal Controls Big 4 Financial Accounting Accounting Assurance Sarbanes-Oxley Act Financial Analysis Financial Audits UK GAAP Education AITI Irish Tax Institute Chartered Tax Adviser (CTA) 2006  – 2009 Institute of Chartered Accountants Ireland Chartered Accountancy Qualification (ACA) 2005  – 2008 Smurfit Business School, University College Dublin Masters of Accounting MAcc 2004  – 2005 University of Limerick Bachelor of Business Studies and French,  Accounting and Finance 2000  – 2004 Université Pierre Mendès-France (Grenoble II) Bachelor of Business and French,  Accounting and Finance 2001  – 2002 Letterkenny Vocational School Languages and European Studies , Distinction 1999  – 2000 AITI Irish Tax Institute Chartered Tax Adviser (CTA) 2006  – 2009 AITI Irish Tax Institute Chartered Tax Adviser (CTA) 2006  – 2009 AITI Irish Tax Institute Chartered Tax Adviser (CTA) 2006  – 2009 Institute of Chartered Accountants Ireland Chartered Accountancy Qualification (ACA) 2005  – 2008 Institute of Chartered Accountants Ireland Chartered Accountancy Qualification (ACA) 2005  – 2008 Institute of Chartered Accountants Ireland Chartered Accountancy Qualification (ACA) 2005  – 2008 Smurfit Business School, University College Dublin Masters of Accounting MAcc 2004  – 2005 Smurfit Business School, University College Dublin Masters of Accounting MAcc 2004  – 2005 Smurfit Business School, University College Dublin Masters of Accounting MAcc 2004  – 2005 University of Limerick Bachelor of Business Studies and French,  Accounting and Finance 2000  – 2004 University of Limerick Bachelor of Business Studies and French,  Accounting and Finance 2000  – 2004 University of Limerick Bachelor of Business Studies and French,  Accounting and Finance 2000  – 2004 Université Pierre Mendès-France (Grenoble II) Bachelor of Business and French,  Accounting and Finance 2001  – 2002 Université Pierre Mendès-France (Grenoble II) Bachelor of Business and French,  Accounting and Finance 2001  – 2002 Université Pierre Mendès-France (Grenoble II) Bachelor of Business and French,  Accounting and Finance 2001  – 2002 Letterkenny Vocational School Languages and European Studies , Distinction 1999  – 2000 Letterkenny Vocational School Languages and European Studies , Distinction 1999  – 2000 Letterkenny Vocational School Languages and European Studies , Distinction 1999  – 2000 "]}