{"position": "Account Associate", "company": "Google", "profiles": ["Experience Site Lead, Third Party Operations Google November 2013  – Present (1 year 10 months) Gurgaon, India Manager, Third Party Operations Google August 2012  –  November 2013  (1 year 4 months) Gurgaon, India - Manage relationships with vendors who engage with Google's Global Business Organization. \n- Responsible for vendor strategy and infrastructure at Google Manager, Ad Review Operations Google November 2010  –  July 2012  (1 year 9 months) Gurgaon, India Team Lead, Ad Review Operations Google July 2009  –  November 2010  (1 year 5 months) Gurgaon, India Team Lead, AdWords/Email Quality Lead Google November 2008  –  June 2009  (8 months) Gurgaon, India Account Strategist, AdWords/Email Quality Lead Google January 2008  –  November 2008  (11 months) Gurgaon, India Account Associate, AdWords/Email Quality Lead Google January 2007  –  December 2007  (1 year) Gurgaon, India Sr. Representative, AdWords Google January 2006  –  December 2006  (1 year) Hyderabad Area, India Representative, AdWords Google May 2005  –  January 2006  (9 months) Hyderabad Area, India Technical Support Officer Convergys August 2003  –  April 2005  (1 year 9 months) Gurgaon, India Site Lead, Third Party Operations Google November 2013  – Present (1 year 10 months) Gurgaon, India Site Lead, Third Party Operations Google November 2013  – Present (1 year 10 months) Gurgaon, India Manager, Third Party Operations Google August 2012  –  November 2013  (1 year 4 months) Gurgaon, India - Manage relationships with vendors who engage with Google's Global Business Organization. \n- Responsible for vendor strategy and infrastructure at Google Manager, Third Party Operations Google August 2012  –  November 2013  (1 year 4 months) Gurgaon, India - Manage relationships with vendors who engage with Google's Global Business Organization. \n- Responsible for vendor strategy and infrastructure at Google Manager, Ad Review Operations Google November 2010  –  July 2012  (1 year 9 months) Gurgaon, India Manager, Ad Review Operations Google November 2010  –  July 2012  (1 year 9 months) Gurgaon, India Team Lead, Ad Review Operations Google July 2009  –  November 2010  (1 year 5 months) Gurgaon, India Team Lead, Ad Review Operations Google July 2009  –  November 2010  (1 year 5 months) Gurgaon, India Team Lead, AdWords/Email Quality Lead Google November 2008  –  June 2009  (8 months) Gurgaon, India Team Lead, AdWords/Email Quality Lead Google November 2008  –  June 2009  (8 months) Gurgaon, India Account Strategist, AdWords/Email Quality Lead Google January 2008  –  November 2008  (11 months) Gurgaon, India Account Strategist, AdWords/Email Quality Lead Google January 2008  –  November 2008  (11 months) Gurgaon, India Account Associate, AdWords/Email Quality Lead Google January 2007  –  December 2007  (1 year) Gurgaon, India Account Associate, AdWords/Email Quality Lead Google January 2007  –  December 2007  (1 year) Gurgaon, India Sr. Representative, AdWords Google January 2006  –  December 2006  (1 year) Hyderabad Area, India Sr. Representative, AdWords Google January 2006  –  December 2006  (1 year) Hyderabad Area, India Representative, AdWords Google May 2005  –  January 2006  (9 months) Hyderabad Area, India Representative, AdWords Google May 2005  –  January 2006  (9 months) Hyderabad Area, India Technical Support Officer Convergys August 2003  –  April 2005  (1 year 9 months) Gurgaon, India Technical Support Officer Convergys August 2003  –  April 2005  (1 year 9 months) Gurgaon, India Skills SEM Online Advertising Web Analytics PPC Google Adwords Google Analytics Strategy Advertising Search Advertising Skills  SEM Online Advertising Web Analytics PPC Google Adwords Google Analytics Strategy Advertising Search Advertising SEM Online Advertising Web Analytics PPC Google Adwords Google Analytics Strategy Advertising Search Advertising SEM Online Advertising Web Analytics PPC Google Adwords Google Analytics Strategy Advertising Search Advertising Education Doctor Bhim Rao Ambedkar University Bacheclor of Engineering,  Computer Science 1999  – 2003 Engineering, Computer Science Doctor Bhim Rao Ambedkar University Bacheclor of Engineering,  Computer Science 1999  – 2003 Engineering, Computer Science Doctor Bhim Rao Ambedkar University Bacheclor of Engineering,  Computer Science 1999  – 2003 Engineering, Computer Science Doctor Bhim Rao Ambedkar University Bacheclor of Engineering,  Computer Science 1999  – 2003 Engineering, Computer Science ", "Experience Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 5 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 10 months) San Francisco Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 11 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Vertical Sales Manager Google April 2008  – Present (7 years 5 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Representative Google October 2003  –  February 2004  (5 months) Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 5 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 5 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 10 months) San Francisco Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 10 months) San Francisco Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 11 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 11 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Vertical Sales Manager Google April 2008  – Present (7 years 5 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. Vertical Sales Manager Google April 2008  – Present (7 years 5 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Representative Google October 2003  –  February 2004  (5 months) AdWords Representative Google October 2003  –  February 2004  (5 months) Skills Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Skills  Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Education Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team ", "Summary Specialties:Online Marketing Strategy & Implementation Summary Specialties:Online Marketing Strategy & Implementation Specialties:Online Marketing Strategy & Implementation Specialties:Online Marketing Strategy & Implementation Experience Agency Lead Google July 2015  – Present (2 months) Agency Development Manager Google July 2014  – Present (1 year 2 months) Senior Account Manager - Large Client Services - Performance Markets & eGaming Google June 2013  –  June 2014  (1 year 1 month) Dublin Senior Account Manager - Large Client Services - Travel Industry Google May 2012  –  June 2013  (1 year 2 months) Dublin Account Manager - Travel Industry Google October 2010  –  May 2012  (1 year 8 months) Agency Relationship Manager (Strategist) Google April 2009  –  August 2011  (2 years 5 months) Agency Relationship Manager Google September 2007  –  May 2009  (1 year 9 months) Account Associate Google April 2006  –  August 2007  (1 year 5 months) Responsible for the creation, implementation and support of online advertising campaigns for UK & Irish clients as part of an overall advertising strategy. Key Account Manager Future Print April 2002  –  March 2006  (4 years) Agency Lead Google July 2015  – Present (2 months) Agency Lead Google July 2015  – Present (2 months) Agency Development Manager Google July 2014  – Present (1 year 2 months) Agency Development Manager Google July 2014  – Present (1 year 2 months) Senior Account Manager - Large Client Services - Performance Markets & eGaming Google June 2013  –  June 2014  (1 year 1 month) Dublin Senior Account Manager - Large Client Services - Performance Markets & eGaming Google June 2013  –  June 2014  (1 year 1 month) Dublin Senior Account Manager - Large Client Services - Travel Industry Google May 2012  –  June 2013  (1 year 2 months) Dublin Senior Account Manager - Large Client Services - Travel Industry Google May 2012  –  June 2013  (1 year 2 months) Dublin Account Manager - Travel Industry Google October 2010  –  May 2012  (1 year 8 months) Account Manager - Travel Industry Google October 2010  –  May 2012  (1 year 8 months) Agency Relationship Manager (Strategist) Google April 2009  –  August 2011  (2 years 5 months) Agency Relationship Manager (Strategist) Google April 2009  –  August 2011  (2 years 5 months) Agency Relationship Manager Google September 2007  –  May 2009  (1 year 9 months) Agency Relationship Manager Google September 2007  –  May 2009  (1 year 9 months) Account Associate Google April 2006  –  August 2007  (1 year 5 months) Responsible for the creation, implementation and support of online advertising campaigns for UK & Irish clients as part of an overall advertising strategy. Account Associate Google April 2006  –  August 2007  (1 year 5 months) Responsible for the creation, implementation and support of online advertising campaigns for UK & Irish clients as part of an overall advertising strategy. Key Account Manager Future Print April 2002  –  March 2006  (4 years) Key Account Manager Future Print April 2002  –  March 2006  (4 years) Skills PPC Google Adwords Google Analytics Mobile Marketing Digital Marketing Online Advertising SEM Digital Strategy Mobile Advertising Online Marketing Printers Web Analytics Web Marketing Skills  PPC Google Adwords Google Analytics Mobile Marketing Digital Marketing Online Advertising SEM Digital Strategy Mobile Advertising Online Marketing Printers Web Analytics Web Marketing PPC Google Adwords Google Analytics Mobile Marketing Digital Marketing Online Advertising SEM Digital Strategy Mobile Advertising Online Marketing Printers Web Analytics Web Marketing PPC Google Adwords Google Analytics Mobile Marketing Digital Marketing Online Advertising SEM Digital Strategy Mobile Advertising Online Marketing Printers Web Analytics Web Marketing Education Dublin Institute of Technology Bachelor of Science (BSc),  Printing Management 1999  – 2003 Dublin Institute of Technology Bachelor of Science (BSc),  Printing Management 1999  – 2003 Dublin Institute of Technology Bachelor of Science (BSc),  Printing Management 1999  – 2003 Dublin Institute of Technology Bachelor of Science (BSc),  Printing Management 1999  – 2003 ", "Experience Senior Account Manager, Team Toyota Google April 2014  – Present (1 year 5 months) Venice, CA Senior Account Manager, Retail PurePlay Google June 2012  – Present (3 years 3 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 15 large online retail companies across multiple retail sub-sectors (Greeting Cards, Apparel, Costumes, etc). \n Account Manager, Google Montreal Google January 2012  –  June 2012  (6 months) Ann Arbor, MI Launch team member for new Montreal sales team. \n \nMentored team members by providing organizational techniques for the team, account planning suggestions, and trainings (all members of pod are new) \n \nDeveloped the sales handbook in conjunction with Montreal Country Manager, Sales Operations, and HR to help guide new Canadian teams in their day to day functions.  \n \nSupported the team remotely with account management, account strategy and optimization work. Account Strategist, Google Team Canada Google June 2010  –  January 2012  (1 year 8 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 50+ midmarket Canadian companies across multiple sectors (Healthcare, CPG, Education, Entertainment & Media, Government). \n \nLed a project to capture missed advertising opportunities in French speaking Quebec; will use skills in business French to penetrate Quebec market, previously untapped due to language competencies and cultural barriers. Account Strategist, Google Automotive Team Google October 2009  –  June 2010  (9 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 40+ automotive companies. \n \nPersonally created and delivered audience based advertising training to new employees after recognizing deficiency in existing training materials; Trained over 70 new employees in four months. \n \nLed initiative to improve global partnership with India; promoted transparent client communication, shared work, streamlined cross-continental communication, resulting in high quality global support for clients. Account Optimizer, Small Business Solutions, Google Google October 2008  –  2009  (1 year) Ann Arbor, MI Planned and executed online advertising campaigns for high potential North American companies across all sectors; resulted in the growth of client businesses and increased advertising investment with Google. \n \nExceeded revenue targets every quarter. \n \nPromoted professional development of 5+ teammates in India by consistently providing constructive feedback to newly trained teammates, ultimately aiding them in being promoted to the Direct Customer Service team. Account Associate, Small Business Solutions, Google AdWords Google May 2008  –  October 2008  (6 months) Ann Arbor, MI Built AdWords product knowledge by providing high quality technical support for the 866 Customer Support line, while exceeding expectations in efficiency and quality guidelines. Senior Account Manager, Team Toyota Google April 2014  – Present (1 year 5 months) Venice, CA Senior Account Manager, Team Toyota Google April 2014  – Present (1 year 5 months) Venice, CA Senior Account Manager, Retail PurePlay Google June 2012  – Present (3 years 3 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 15 large online retail companies across multiple retail sub-sectors (Greeting Cards, Apparel, Costumes, etc). \n Senior Account Manager, Retail PurePlay Google June 2012  – Present (3 years 3 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 15 large online retail companies across multiple retail sub-sectors (Greeting Cards, Apparel, Costumes, etc). \n Account Manager, Google Montreal Google January 2012  –  June 2012  (6 months) Ann Arbor, MI Launch team member for new Montreal sales team. \n \nMentored team members by providing organizational techniques for the team, account planning suggestions, and trainings (all members of pod are new) \n \nDeveloped the sales handbook in conjunction with Montreal Country Manager, Sales Operations, and HR to help guide new Canadian teams in their day to day functions.  \n \nSupported the team remotely with account management, account strategy and optimization work. Account Manager, Google Montreal Google January 2012  –  June 2012  (6 months) Ann Arbor, MI Launch team member for new Montreal sales team. \n \nMentored team members by providing organizational techniques for the team, account planning suggestions, and trainings (all members of pod are new) \n \nDeveloped the sales handbook in conjunction with Montreal Country Manager, Sales Operations, and HR to help guide new Canadian teams in their day to day functions.  \n \nSupported the team remotely with account management, account strategy and optimization work. Account Strategist, Google Team Canada Google June 2010  –  January 2012  (1 year 8 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 50+ midmarket Canadian companies across multiple sectors (Healthcare, CPG, Education, Entertainment & Media, Government). \n \nLed a project to capture missed advertising opportunities in French speaking Quebec; will use skills in business French to penetrate Quebec market, previously untapped due to language competencies and cultural barriers. Account Strategist, Google Team Canada Google June 2010  –  January 2012  (1 year 8 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 50+ midmarket Canadian companies across multiple sectors (Healthcare, CPG, Education, Entertainment & Media, Government). \n \nLed a project to capture missed advertising opportunities in French speaking Quebec; will use skills in business French to penetrate Quebec market, previously untapped due to language competencies and cultural barriers. Account Strategist, Google Automotive Team Google October 2009  –  June 2010  (9 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 40+ automotive companies. \n \nPersonally created and delivered audience based advertising training to new employees after recognizing deficiency in existing training materials; Trained over 70 new employees in four months. \n \nLed initiative to improve global partnership with India; promoted transparent client communication, shared work, streamlined cross-continental communication, resulting in high quality global support for clients. Account Strategist, Google Automotive Team Google October 2009  –  June 2010  (9 months) Ann Arbor, MI Collaborated with teammates and clients to develop and execute an online advertising strategy to grow 40+ automotive companies. \n \nPersonally created and delivered audience based advertising training to new employees after recognizing deficiency in existing training materials; Trained over 70 new employees in four months. \n \nLed initiative to improve global partnership with India; promoted transparent client communication, shared work, streamlined cross-continental communication, resulting in high quality global support for clients. Account Optimizer, Small Business Solutions, Google Google October 2008  –  2009  (1 year) Ann Arbor, MI Planned and executed online advertising campaigns for high potential North American companies across all sectors; resulted in the growth of client businesses and increased advertising investment with Google. \n \nExceeded revenue targets every quarter. \n \nPromoted professional development of 5+ teammates in India by consistently providing constructive feedback to newly trained teammates, ultimately aiding them in being promoted to the Direct Customer Service team. Account Optimizer, Small Business Solutions, Google Google October 2008  –  2009  (1 year) Ann Arbor, MI Planned and executed online advertising campaigns for high potential North American companies across all sectors; resulted in the growth of client businesses and increased advertising investment with Google. \n \nExceeded revenue targets every quarter. \n \nPromoted professional development of 5+ teammates in India by consistently providing constructive feedback to newly trained teammates, ultimately aiding them in being promoted to the Direct Customer Service team. Account Associate, Small Business Solutions, Google AdWords Google May 2008  –  October 2008  (6 months) Ann Arbor, MI Built AdWords product knowledge by providing high quality technical support for the 866 Customer Support line, while exceeding expectations in efficiency and quality guidelines. Account Associate, Small Business Solutions, Google AdWords Google May 2008  –  October 2008  (6 months) Ann Arbor, MI Built AdWords product knowledge by providing high quality technical support for the 866 Customer Support line, while exceeding expectations in efficiency and quality guidelines. Languages French French French Skills SEM PPC Google Analytics Online Advertising Mobile Advertising Web Analytics Digital Strategy Digital Marketing Analytics Mobile Marketing YouTube Digital Media Google Adwords Search Advertising Account Management Advertising Strategy See 2+     See less Skills  SEM PPC Google Analytics Online Advertising Mobile Advertising Web Analytics Digital Strategy Digital Marketing Analytics Mobile Marketing YouTube Digital Media Google Adwords Search Advertising Account Management Advertising Strategy See 2+     See less SEM PPC Google Analytics Online Advertising Mobile Advertising Web Analytics Digital Strategy Digital Marketing Analytics Mobile Marketing YouTube Digital Media Google Adwords Search Advertising Account Management Advertising Strategy See 2+     See less SEM PPC Google Analytics Online Advertising Mobile Advertising Web Analytics Digital Strategy Digital Marketing Analytics Mobile Marketing YouTube Digital Media Google Adwords Search Advertising Account Management Advertising Strategy See 2+     See less Education University of Michigan - Stephen M. Ross School of Business Master of Business Administration (M.B.A.) 2011  – 2014 University of Michigan Bachelor of Arts (B.A.),  Political Science and Government 2004  – 2008 Activities and Societies:  Circle K ,  University of Michigan Honors Program University of Michigan - Stephen M. Ross School of Business Master of Business Administration (M.B.A.) 2011  – 2014 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (M.B.A.) 2011  – 2014 University of Michigan - Stephen M. Ross School of Business Master of Business Administration (M.B.A.) 2011  – 2014 University of Michigan Bachelor of Arts (B.A.),  Political Science and Government 2004  – 2008 Activities and Societies:  Circle K ,  University of Michigan Honors Program University of Michigan Bachelor of Arts (B.A.),  Political Science and Government 2004  – 2008 Activities and Societies:  Circle K ,  University of Michigan Honors Program University of Michigan Bachelor of Arts (B.A.),  Political Science and Government 2004  – 2008 Activities and Societies:  Circle K ,  University of Michigan Honors Program Honors & Awards Additional Honors & Awards University Honors 2005 – 2008; Michigan Leadership Awards, Outstanding New Student Leader 2006 Additional Honors & Awards University Honors 2005 – 2008; Michigan Leadership Awards, Outstanding New Student Leader 2006 Additional Honors & Awards University Honors 2005 – 2008; Michigan Leadership Awards, Outstanding New Student Leader 2006 Additional Honors & Awards University Honors 2005 – 2008; Michigan Leadership Awards, Outstanding New Student Leader 2006 ", "Experience Account Associate Google October 2007  – Present (7 years 11 months) Account Associate Google India 2007  –  2014  (7 years) - Bank of America April 2003  –  September 2007  (4 years 6 months) Account Associate Google October 2007  – Present (7 years 11 months) Account Associate Google October 2007  – Present (7 years 11 months) Account Associate Google India 2007  –  2014  (7 years) Account Associate Google India 2007  –  2014  (7 years) - Bank of America April 2003  –  September 2007  (4 years 6 months) - Bank of America April 2003  –  September 2007  (4 years 6 months) Education St. Francis Womens Collage Begumpet Maters in International Marketing and Foreigh Trade St. Francis Womens Collage Begumpet Maters in International Marketing and Foreigh Trade St. Francis Womens Collage Begumpet Maters in International Marketing and Foreigh Trade St. Francis Womens Collage Begumpet Maters in International Marketing and Foreigh Trade ", "Experience Agency Head - Independent agencies Google September 2011  – Present (4 years) Paris Area, France Head of Independent agencies Google 2011  –  2014  (3 years) Head of Independent agencies Google 2011  –  2014  (3 years) Head of Agency Development Google 2011  –  December 2012  (1 year) AdWords Agency Team Lead Google 2009  –  2010  (1 year) AdSense Strategist Google 2007  –  2009  (2 years) Senior Account Associate AdSense Google 2006  –  2007  (1 year) AdSense Account Associate Google 2005  –  2006  (1 year) AdSense Trainee Coordinator Google 2005  –  2005  (less than a year) Agency Head - Independent agencies Google September 2011  – Present (4 years) Paris Area, France Agency Head - Independent agencies Google September 2011  – Present (4 years) Paris Area, France Head of Independent agencies Google 2011  –  2014  (3 years) Head of Independent agencies Google 2011  –  2014  (3 years) Head of Independent agencies Google 2011  –  2014  (3 years) Head of Independent agencies Google 2011  –  2014  (3 years) Head of Agency Development Google 2011  –  December 2012  (1 year) Head of Agency Development Google 2011  –  December 2012  (1 year) AdWords Agency Team Lead Google 2009  –  2010  (1 year) AdWords Agency Team Lead Google 2009  –  2010  (1 year) AdSense Strategist Google 2007  –  2009  (2 years) AdSense Strategist Google 2007  –  2009  (2 years) Senior Account Associate AdSense Google 2006  –  2007  (1 year) Senior Account Associate AdSense Google 2006  –  2007  (1 year) AdSense Account Associate Google 2005  –  2006  (1 year) AdSense Account Associate Google 2005  –  2006  (1 year) AdSense Trainee Coordinator Google 2005  –  2005  (less than a year) AdSense Trainee Coordinator Google 2005  –  2005  (less than a year) Languages German English French Turkish German English French Turkish German English French Turkish Skills Online Advertising Digital Marketing Google Adwords Online Marketing Digital Media Adsense SEM Skills  Online Advertising Digital Marketing Google Adwords Online Marketing Digital Media Adsense SEM Online Advertising Digital Marketing Google Adwords Online Marketing Digital Media Adsense SEM Online Advertising Digital Marketing Google Adwords Online Marketing Digital Media Adsense SEM Education Heinrich-Heine-Universität Düsseldorf Master's degree,  Marketing/Marketing Management , General 1998  – 2003 Grenoble Ecole de Management - Grenoble Graduate School of Business Master's degree,  International Business 2000  – 2002 Heinrich-Heine-Universität Düsseldorf Master's degree,  Marketing/Marketing Management , General 1998  – 2003 Heinrich-Heine-Universität Düsseldorf Master's degree,  Marketing/Marketing Management , General 1998  – 2003 Heinrich-Heine-Universität Düsseldorf Master's degree,  Marketing/Marketing Management , General 1998  – 2003 Grenoble Ecole de Management - Grenoble Graduate School of Business Master's degree,  International Business 2000  – 2002 Grenoble Ecole de Management - Grenoble Graduate School of Business Master's degree,  International Business 2000  – 2002 Grenoble Ecole de Management - Grenoble Graduate School of Business Master's degree,  International Business 2000  – 2002 ", "Summary Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Summary Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Experience Sales and Marketing Manager Google September 2013  – Present (2 years) Singapore I’m managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms.  \n \nI’m responsible to drive business growth through acquisition and engagement of new partners. I develop and implement data-driven strategies by analysing online and offline performance across multiple channels.  \nMy team has consistently exceeded its targets since creation, with a +50% YoY growth. My main responsibilities include Business Development, Marketing, and People Management. I work closely with the senior Google management team across our core APAC markets to plan and deliver on our sales forecast. I also work cross-functionally with our product and engineering teams to constantly improve our solutions by incorporating our partners’ feedback. Acquisition and Support Regional Manager Google April 2012  –  September 2013  (1 year 6 months) Singapore My mission is to enable the growth of online publishers in Asia-Pacific with Google advertising solutions. I manage a regional team of 20+ account managers and specialists based in Beijing, Tokyo, New Delhi, Singapore, Seoul, and Sydney. We are responsible for identifying, acquiring, supporting, and optimising online publishers that represent 70% of Google AdSense revenues in APAC.  \nI also work closely with regional leads in America and EMEA to formulate Google’s international strategy for publishers. \n \nMy achievements include: \n•\tManage 70% of Google AdSense revenues in APAC and enhanced sales processes resulting in 25% year over year growth \n•\tImproved effectiveness of operational team by leveraging online resources to reallocate 20% of our headcounts to revenue-generating activities \n•\tStreamlined workflow and reorganised functions in order to achieve significant gain in efficiency and strengthen our KPIs \n \nResponsibilities: \n•\tManage a growing team of Sales and Relationship Managers (20+ individuals) focused on driving new revenue in 12 markets \n•\tRecruit new team members and provide sales mentorship, performance reviews, and regular feedback \n•\tSupport my team with professional development opportunities and constantly build a talent pipeline \n•\tFormulate and implement the international strategy of Google AdSense \n•\tCollaborate with local marketing teams to budget and execute branding campaigns APAC Acquisition and Support regional lead Google July 2011  –  June 2012  (1 year) Singapore * Leading a team of 20+ people across Google's offices in China, Japan, Australia, India, South East Asia, and Korea ; \n* Defining long term sales strategy ; \n* Measuring and tracking ongoing performances of the business against KPIs. Online Sales & Operations Team Leader Google May 2010  –  July 2011  (1 year 3 months) • Set strategy and Key Performance Indicators (KPIs) for a 20+ person international team. \n• Directly manage people with respect to mentoring, individual KPI setting, feedback and personal and professional development. \n• Increase the effectiveness of staff and tools by recognising opportunities for development and proactively creating new systems and structures. \n• Develop operational metrics to measure the growth and performance of the department, and report on the achievements of my team. \n• Execute projects involving quantitative analysis, industry research and strategy development. \n• Collaborate with leads from other support teams to ensure a consistent support experience. \n• Conduct candidates’ interviews and provide feedback to recruitment teams. Strategist - Online Help Product Specialist Google November 2008  –  June 2010  (1 year 8 months) • Managing and Strategic planning of the implementation of a new Online Support platform. \n• Manager and Owner of worldwide Online Resources and Support Platforms. \n• Webmaster. Senior Associate Google May 2008  –  November 2008  (7 months) • Co-manager of worldwide Online Help Resources and Support Platforms. \n• Manage and grow relationships with Tier 2 publishers, and web site directors. AdSense Account Associate Google November 2006  –  May 2008  (1 year 7 months) • Manage and grow relationships with publishers, web site operators, and E-commerce merchants.  \n• Optimise client accounts in order to maximise their return on investment.  \n• Provide service to Google's clients via the AdSense’s Blog, Forum, Online Help Centre, and email.  \n• Identify innovative ways to improve user experience, and work with product management, marketing and engineering to implement new ideas.  \n• Localise products for the European, Middle Eastern and African markets.  \n• Monitor product performance and analyse feedback from clients and users.  \n• Execute special projects involving quantitative analysis, industry research and strategy development.  \n• Manage AdSense projects and communicate issues across teams and products.  \n• Support the launch of new AdSense product features.  \n• Employ creative solutions to improve workflow, customer support, policy and procedures.  \n• Back up the French YouTube team. Market Specialist Bank of New York 2006  –  2006  (less than a year) • Responsible for day-to-day executions and processes for the Trade Operations group. \n• Processing trades via Online systems. \n• Instructing payments and receipts. \n• Monitoring and resolving fails. \n• Managing claims and trade confirmations \n• Interacting with counterparties on trade inquiries and issues. \n• Maintaining systems with accurate data. Account Manager Peve (European Video Edition Perspective) 2004  –  2006  (2 years) • Organise the annual European Video Edition Conference. \n• Manage members’ relations and subscriptions. \n• Set up a communication strategy through online and off line media. \n• Take care of the smooth development of the Conference. Sales and Marketing Manager Google September 2013  – Present (2 years) Singapore I’m managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms.  \n \nI’m responsible to drive business growth through acquisition and engagement of new partners. I develop and implement data-driven strategies by analysing online and offline performance across multiple channels.  \nMy team has consistently exceeded its targets since creation, with a +50% YoY growth. My main responsibilities include Business Development, Marketing, and People Management. I work closely with the senior Google management team across our core APAC markets to plan and deliver on our sales forecast. I also work cross-functionally with our product and engineering teams to constantly improve our solutions by incorporating our partners’ feedback. Sales and Marketing Manager Google September 2013  – Present (2 years) Singapore I’m managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms.  \n \nI’m responsible to drive business growth through acquisition and engagement of new partners. I develop and implement data-driven strategies by analysing online and offline performance across multiple channels.  \nMy team has consistently exceeded its targets since creation, with a +50% YoY growth. My main responsibilities include Business Development, Marketing, and People Management. I work closely with the senior Google management team across our core APAC markets to plan and deliver on our sales forecast. I also work cross-functionally with our product and engineering teams to constantly improve our solutions by incorporating our partners’ feedback. Acquisition and Support Regional Manager Google April 2012  –  September 2013  (1 year 6 months) Singapore My mission is to enable the growth of online publishers in Asia-Pacific with Google advertising solutions. I manage a regional team of 20+ account managers and specialists based in Beijing, Tokyo, New Delhi, Singapore, Seoul, and Sydney. We are responsible for identifying, acquiring, supporting, and optimising online publishers that represent 70% of Google AdSense revenues in APAC.  \nI also work closely with regional leads in America and EMEA to formulate Google’s international strategy for publishers. \n \nMy achievements include: \n•\tManage 70% of Google AdSense revenues in APAC and enhanced sales processes resulting in 25% year over year growth \n•\tImproved effectiveness of operational team by leveraging online resources to reallocate 20% of our headcounts to revenue-generating activities \n•\tStreamlined workflow and reorganised functions in order to achieve significant gain in efficiency and strengthen our KPIs \n \nResponsibilities: \n•\tManage a growing team of Sales and Relationship Managers (20+ individuals) focused on driving new revenue in 12 markets \n•\tRecruit new team members and provide sales mentorship, performance reviews, and regular feedback \n•\tSupport my team with professional development opportunities and constantly build a talent pipeline \n•\tFormulate and implement the international strategy of Google AdSense \n•\tCollaborate with local marketing teams to budget and execute branding campaigns Acquisition and Support Regional Manager Google April 2012  –  September 2013  (1 year 6 months) Singapore My mission is to enable the growth of online publishers in Asia-Pacific with Google advertising solutions. I manage a regional team of 20+ account managers and specialists based in Beijing, Tokyo, New Delhi, Singapore, Seoul, and Sydney. We are responsible for identifying, acquiring, supporting, and optimising online publishers that represent 70% of Google AdSense revenues in APAC.  \nI also work closely with regional leads in America and EMEA to formulate Google’s international strategy for publishers. \n \nMy achievements include: \n•\tManage 70% of Google AdSense revenues in APAC and enhanced sales processes resulting in 25% year over year growth \n•\tImproved effectiveness of operational team by leveraging online resources to reallocate 20% of our headcounts to revenue-generating activities \n•\tStreamlined workflow and reorganised functions in order to achieve significant gain in efficiency and strengthen our KPIs \n \nResponsibilities: \n•\tManage a growing team of Sales and Relationship Managers (20+ individuals) focused on driving new revenue in 12 markets \n•\tRecruit new team members and provide sales mentorship, performance reviews, and regular feedback \n•\tSupport my team with professional development opportunities and constantly build a talent pipeline \n•\tFormulate and implement the international strategy of Google AdSense \n•\tCollaborate with local marketing teams to budget and execute branding campaigns APAC Acquisition and Support regional lead Google July 2011  –  June 2012  (1 year) Singapore * Leading a team of 20+ people across Google's offices in China, Japan, Australia, India, South East Asia, and Korea ; \n* Defining long term sales strategy ; \n* Measuring and tracking ongoing performances of the business against KPIs. APAC Acquisition and Support regional lead Google July 2011  –  June 2012  (1 year) Singapore * Leading a team of 20+ people across Google's offices in China, Japan, Australia, India, South East Asia, and Korea ; \n* Defining long term sales strategy ; \n* Measuring and tracking ongoing performances of the business against KPIs. Online Sales & Operations Team Leader Google May 2010  –  July 2011  (1 year 3 months) • Set strategy and Key Performance Indicators (KPIs) for a 20+ person international team. \n• Directly manage people with respect to mentoring, individual KPI setting, feedback and personal and professional development. \n• Increase the effectiveness of staff and tools by recognising opportunities for development and proactively creating new systems and structures. \n• Develop operational metrics to measure the growth and performance of the department, and report on the achievements of my team. \n• Execute projects involving quantitative analysis, industry research and strategy development. \n• Collaborate with leads from other support teams to ensure a consistent support experience. \n• Conduct candidates’ interviews and provide feedback to recruitment teams. Online Sales & Operations Team Leader Google May 2010  –  July 2011  (1 year 3 months) • Set strategy and Key Performance Indicators (KPIs) for a 20+ person international team. \n• Directly manage people with respect to mentoring, individual KPI setting, feedback and personal and professional development. \n• Increase the effectiveness of staff and tools by recognising opportunities for development and proactively creating new systems and structures. \n• Develop operational metrics to measure the growth and performance of the department, and report on the achievements of my team. \n• Execute projects involving quantitative analysis, industry research and strategy development. \n• Collaborate with leads from other support teams to ensure a consistent support experience. \n• Conduct candidates’ interviews and provide feedback to recruitment teams. Strategist - Online Help Product Specialist Google November 2008  –  June 2010  (1 year 8 months) • Managing and Strategic planning of the implementation of a new Online Support platform. \n• Manager and Owner of worldwide Online Resources and Support Platforms. \n• Webmaster. Strategist - Online Help Product Specialist Google November 2008  –  June 2010  (1 year 8 months) • Managing and Strategic planning of the implementation of a new Online Support platform. \n• Manager and Owner of worldwide Online Resources and Support Platforms. \n• Webmaster. Senior Associate Google May 2008  –  November 2008  (7 months) • Co-manager of worldwide Online Help Resources and Support Platforms. \n• Manage and grow relationships with Tier 2 publishers, and web site directors. Senior Associate Google May 2008  –  November 2008  (7 months) • Co-manager of worldwide Online Help Resources and Support Platforms. \n• Manage and grow relationships with Tier 2 publishers, and web site directors. AdSense Account Associate Google November 2006  –  May 2008  (1 year 7 months) • Manage and grow relationships with publishers, web site operators, and E-commerce merchants.  \n• Optimise client accounts in order to maximise their return on investment.  \n• Provide service to Google's clients via the AdSense’s Blog, Forum, Online Help Centre, and email.  \n• Identify innovative ways to improve user experience, and work with product management, marketing and engineering to implement new ideas.  \n• Localise products for the European, Middle Eastern and African markets.  \n• Monitor product performance and analyse feedback from clients and users.  \n• Execute special projects involving quantitative analysis, industry research and strategy development.  \n• Manage AdSense projects and communicate issues across teams and products.  \n• Support the launch of new AdSense product features.  \n• Employ creative solutions to improve workflow, customer support, policy and procedures.  \n• Back up the French YouTube team. AdSense Account Associate Google November 2006  –  May 2008  (1 year 7 months) • Manage and grow relationships with publishers, web site operators, and E-commerce merchants.  \n• Optimise client accounts in order to maximise their return on investment.  \n• Provide service to Google's clients via the AdSense’s Blog, Forum, Online Help Centre, and email.  \n• Identify innovative ways to improve user experience, and work with product management, marketing and engineering to implement new ideas.  \n• Localise products for the European, Middle Eastern and African markets.  \n• Monitor product performance and analyse feedback from clients and users.  \n• Execute special projects involving quantitative analysis, industry research and strategy development.  \n• Manage AdSense projects and communicate issues across teams and products.  \n• Support the launch of new AdSense product features.  \n• Employ creative solutions to improve workflow, customer support, policy and procedures.  \n• Back up the French YouTube team. Market Specialist Bank of New York 2006  –  2006  (less than a year) • Responsible for day-to-day executions and processes for the Trade Operations group. \n• Processing trades via Online systems. \n• Instructing payments and receipts. \n• Monitoring and resolving fails. \n• Managing claims and trade confirmations \n• Interacting with counterparties on trade inquiries and issues. \n• Maintaining systems with accurate data. Market Specialist Bank of New York 2006  –  2006  (less than a year) • Responsible for day-to-day executions and processes for the Trade Operations group. \n• Processing trades via Online systems. \n• Instructing payments and receipts. \n• Monitoring and resolving fails. \n• Managing claims and trade confirmations \n• Interacting with counterparties on trade inquiries and issues. \n• Maintaining systems with accurate data. Account Manager Peve (European Video Edition Perspective) 2004  –  2006  (2 years) • Organise the annual European Video Edition Conference. \n• Manage members’ relations and subscriptions. \n• Set up a communication strategy through online and off line media. \n• Take care of the smooth development of the Conference. Account Manager Peve (European Video Edition Perspective) 2004  –  2006  (2 years) • Organise the annual European Video Edition Conference. \n• Manage members’ relations and subscriptions. \n• Set up a communication strategy through online and off line media. \n• Take care of the smooth development of the Conference. Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Skills  Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Education Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Collège Saint-Hubert 1993  – 1999 Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Collège Saint-Hubert 1993  – 1999 Collège Saint-Hubert 1993  – 1999 Collège Saint-Hubert 1993  – 1999 Honors & Awards VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. ", "Experience HR Business Partner, Robotics Google February 2015  – Present (7 months) Leadership Programs Program Manager, People Development Google August 2014  –  February 2015  (7 months) Mountain View, CA 6-month work assignment TechHR Program Specialist, Global People Programs Google October 2013  –  July 2014  (10 months) Mountain View, CA • Manage critical HR programs for the Tech organization and work with complex project plans and time-sensitive deadlines to ensure success of key HR programs including promotion and performance management. \n• Routinely analyze data and conduct analyses to identify key trends and themes which inform business decisions. \n• Drive innovation and process improvement to anticipate needs, and use new technologies to improve client experience with HR processes. Work with key stakeholders to improve programs at the design level. Tech Intern Programs Specialist Google May 2010  –  October 2013  (3 years 6 months) Mountain View, CA Program Manager for Google's Engineering Practicum Internship (formerly known as BOLD Practicum): \n• Manage and oversee the recruiting, planning, and implementation of key internship program, which has led to 85+ full-time engineering hires to date. This internship program targets underrepresented students in computer science, and is crucial for Google's diversity hiring pipeline. \n• Grew internship program by 190% in North America and expanded the program to 4 international offices. \n• Lead team of 7 recruiters, 6 recruiting coordinators, and 4 program coordinators across distributed offices. \n• Partner closely with engineering executive stakeholders (5 Engineering Directors & 1 VP) on hiring committees, program strategy and vision. \n• Designed and managed curriculum for the program, encompassing both technical and non-technical courses. \n• Manage relationships with 110 engineering intern hosts across North America. Train and regularly advise hosts on project design, intern management, and intern performance. Serve as Human Resources point of contact for hosts. \n• Oversee 120 interns across 5 locations. Serve as main point of contact outside of the engineering organization. Work directly with interns on questions and situations related to the program, project, and human resources topics. \n• Manage intern performance review process and conversion. \n• Received several spot bonuses from management and multiple peer bonuses for quality of work and impact. \n \nUniversity Outreach and Recruiting: \n \n• Formerly, managed technical campus recruiting programs at nine universities. Worked closely with dozens of Google engineers, Computer Science faculty and staff to hire top technical talent for intern and full-time positions. \n• Planned and held 70+ recruiting events on-campus. Increased student application rate by 174% compared to team average of 105%. Learning and Development Specialist Google October 2008  –  April 2010  (1 year 7 months) Mountain View, CA • Trained 450+ clients in classroom, webinar, and onsite training with a 100% client satisfaction rate. Surpassed the team goal of 90% client satisfaction by 10%. Invited to deliver trainings to top agency clients across North America, including Ogilvy, Digitas, Publicis Groupe, and Carat. \n• Managed entire training curriculum for the DoubleClick Search product, including creating/updating online courses, videos, and presentations Account Strategist Google July 2007  –  September 2008  (1 year 3 months) Mountain View, CA • Managed 300+ accounts generating $13+ million in quarterly revenue. Strategized, consulted, and partnered with dedicated clients to grow their businesses and provide Google solutions. \n• Led account management team of 2 other members \n• Conceived and presented 2008 Google advertising strategy to 100+ employees of IAC/InterActiveCorp, a Fortune 500 Company, at the annual Google-InterActiveCorp Strategy Summit  \n• Mentored Account Coordinators to prepare them for the Account Manager role Q1 AdWords Ambassador to Google Beijing Google January 2008  –  March 2008  (3 months) Beijing, China • Selected from a competitive pool of applicants to serve as the Mountain View Ambassador to the Google Beijing AdWords Team. The position was created to reward high performers by sending them to an international host office to share best practices.  \n• Trained and mentored employees in the host office and worked on special projects. Account Associate Google June 2006  –  July 2007  (1 year 2 months) Mountain View, CA • Selected by management to help design, plan, and implement intensive one-month apprenticeship training program to ramp up 70 Account Associates into the Account Manager role \n• Strategized with management to determine program objectives, strategy, and execution \n• Selected for special assignment to the Google Ann Arbor Office to help form the AdWords Core Educators Team, conceiving and implementing guidelines and best practices for the team. Trained and mentored new teammates through coaching sessions. Orientation Advisor University of Southern California January 2004  –  January 2005  (1 year 1 month) Los Angeles, CA • Served as a paraprofessional counselor, advisor, tour guide, and mentor to the incoming freshmen of the Class of 2008 and their families.  \n• Represented the university by acting as key liaison between USC Administration, various departments, and students.  \n• Managed groups of up to 70 students and parents at a time. HR Business Partner, Robotics Google February 2015  – Present (7 months) HR Business Partner, Robotics Google February 2015  – Present (7 months) Leadership Programs Program Manager, People Development Google August 2014  –  February 2015  (7 months) Mountain View, CA 6-month work assignment Leadership Programs Program Manager, People Development Google August 2014  –  February 2015  (7 months) Mountain View, CA 6-month work assignment TechHR Program Specialist, Global People Programs Google October 2013  –  July 2014  (10 months) Mountain View, CA • Manage critical HR programs for the Tech organization and work with complex project plans and time-sensitive deadlines to ensure success of key HR programs including promotion and performance management. \n• Routinely analyze data and conduct analyses to identify key trends and themes which inform business decisions. \n• Drive innovation and process improvement to anticipate needs, and use new technologies to improve client experience with HR processes. Work with key stakeholders to improve programs at the design level. TechHR Program Specialist, Global People Programs Google October 2013  –  July 2014  (10 months) Mountain View, CA • Manage critical HR programs for the Tech organization and work with complex project plans and time-sensitive deadlines to ensure success of key HR programs including promotion and performance management. \n• Routinely analyze data and conduct analyses to identify key trends and themes which inform business decisions. \n• Drive innovation and process improvement to anticipate needs, and use new technologies to improve client experience with HR processes. Work with key stakeholders to improve programs at the design level. Tech Intern Programs Specialist Google May 2010  –  October 2013  (3 years 6 months) Mountain View, CA Program Manager for Google's Engineering Practicum Internship (formerly known as BOLD Practicum): \n• Manage and oversee the recruiting, planning, and implementation of key internship program, which has led to 85+ full-time engineering hires to date. This internship program targets underrepresented students in computer science, and is crucial for Google's diversity hiring pipeline. \n• Grew internship program by 190% in North America and expanded the program to 4 international offices. \n• Lead team of 7 recruiters, 6 recruiting coordinators, and 4 program coordinators across distributed offices. \n• Partner closely with engineering executive stakeholders (5 Engineering Directors & 1 VP) on hiring committees, program strategy and vision. \n• Designed and managed curriculum for the program, encompassing both technical and non-technical courses. \n• Manage relationships with 110 engineering intern hosts across North America. Train and regularly advise hosts on project design, intern management, and intern performance. Serve as Human Resources point of contact for hosts. \n• Oversee 120 interns across 5 locations. Serve as main point of contact outside of the engineering organization. Work directly with interns on questions and situations related to the program, project, and human resources topics. \n• Manage intern performance review process and conversion. \n• Received several spot bonuses from management and multiple peer bonuses for quality of work and impact. \n \nUniversity Outreach and Recruiting: \n \n• Formerly, managed technical campus recruiting programs at nine universities. Worked closely with dozens of Google engineers, Computer Science faculty and staff to hire top technical talent for intern and full-time positions. \n• Planned and held 70+ recruiting events on-campus. Increased student application rate by 174% compared to team average of 105%. Tech Intern Programs Specialist Google May 2010  –  October 2013  (3 years 6 months) Mountain View, CA Program Manager for Google's Engineering Practicum Internship (formerly known as BOLD Practicum): \n• Manage and oversee the recruiting, planning, and implementation of key internship program, which has led to 85+ full-time engineering hires to date. This internship program targets underrepresented students in computer science, and is crucial for Google's diversity hiring pipeline. \n• Grew internship program by 190% in North America and expanded the program to 4 international offices. \n• Lead team of 7 recruiters, 6 recruiting coordinators, and 4 program coordinators across distributed offices. \n• Partner closely with engineering executive stakeholders (5 Engineering Directors & 1 VP) on hiring committees, program strategy and vision. \n• Designed and managed curriculum for the program, encompassing both technical and non-technical courses. \n• Manage relationships with 110 engineering intern hosts across North America. Train and regularly advise hosts on project design, intern management, and intern performance. Serve as Human Resources point of contact for hosts. \n• Oversee 120 interns across 5 locations. Serve as main point of contact outside of the engineering organization. Work directly with interns on questions and situations related to the program, project, and human resources topics. \n• Manage intern performance review process and conversion. \n• Received several spot bonuses from management and multiple peer bonuses for quality of work and impact. \n \nUniversity Outreach and Recruiting: \n \n• Formerly, managed technical campus recruiting programs at nine universities. Worked closely with dozens of Google engineers, Computer Science faculty and staff to hire top technical talent for intern and full-time positions. \n• Planned and held 70+ recruiting events on-campus. Increased student application rate by 174% compared to team average of 105%. Learning and Development Specialist Google October 2008  –  April 2010  (1 year 7 months) Mountain View, CA • Trained 450+ clients in classroom, webinar, and onsite training with a 100% client satisfaction rate. Surpassed the team goal of 90% client satisfaction by 10%. Invited to deliver trainings to top agency clients across North America, including Ogilvy, Digitas, Publicis Groupe, and Carat. \n• Managed entire training curriculum for the DoubleClick Search product, including creating/updating online courses, videos, and presentations Learning and Development Specialist Google October 2008  –  April 2010  (1 year 7 months) Mountain View, CA • Trained 450+ clients in classroom, webinar, and onsite training with a 100% client satisfaction rate. Surpassed the team goal of 90% client satisfaction by 10%. Invited to deliver trainings to top agency clients across North America, including Ogilvy, Digitas, Publicis Groupe, and Carat. \n• Managed entire training curriculum for the DoubleClick Search product, including creating/updating online courses, videos, and presentations Account Strategist Google July 2007  –  September 2008  (1 year 3 months) Mountain View, CA • Managed 300+ accounts generating $13+ million in quarterly revenue. Strategized, consulted, and partnered with dedicated clients to grow their businesses and provide Google solutions. \n• Led account management team of 2 other members \n• Conceived and presented 2008 Google advertising strategy to 100+ employees of IAC/InterActiveCorp, a Fortune 500 Company, at the annual Google-InterActiveCorp Strategy Summit  \n• Mentored Account Coordinators to prepare them for the Account Manager role Account Strategist Google July 2007  –  September 2008  (1 year 3 months) Mountain View, CA • Managed 300+ accounts generating $13+ million in quarterly revenue. Strategized, consulted, and partnered with dedicated clients to grow their businesses and provide Google solutions. \n• Led account management team of 2 other members \n• Conceived and presented 2008 Google advertising strategy to 100+ employees of IAC/InterActiveCorp, a Fortune 500 Company, at the annual Google-InterActiveCorp Strategy Summit  \n• Mentored Account Coordinators to prepare them for the Account Manager role Q1 AdWords Ambassador to Google Beijing Google January 2008  –  March 2008  (3 months) Beijing, China • Selected from a competitive pool of applicants to serve as the Mountain View Ambassador to the Google Beijing AdWords Team. The position was created to reward high performers by sending them to an international host office to share best practices.  \n• Trained and mentored employees in the host office and worked on special projects. Q1 AdWords Ambassador to Google Beijing Google January 2008  –  March 2008  (3 months) Beijing, China • Selected from a competitive pool of applicants to serve as the Mountain View Ambassador to the Google Beijing AdWords Team. The position was created to reward high performers by sending them to an international host office to share best practices.  \n• Trained and mentored employees in the host office and worked on special projects. Account Associate Google June 2006  –  July 2007  (1 year 2 months) Mountain View, CA • Selected by management to help design, plan, and implement intensive one-month apprenticeship training program to ramp up 70 Account Associates into the Account Manager role \n• Strategized with management to determine program objectives, strategy, and execution \n• Selected for special assignment to the Google Ann Arbor Office to help form the AdWords Core Educators Team, conceiving and implementing guidelines and best practices for the team. Trained and mentored new teammates through coaching sessions. Account Associate Google June 2006  –  July 2007  (1 year 2 months) Mountain View, CA • Selected by management to help design, plan, and implement intensive one-month apprenticeship training program to ramp up 70 Account Associates into the Account Manager role \n• Strategized with management to determine program objectives, strategy, and execution \n• Selected for special assignment to the Google Ann Arbor Office to help form the AdWords Core Educators Team, conceiving and implementing guidelines and best practices for the team. Trained and mentored new teammates through coaching sessions. Orientation Advisor University of Southern California January 2004  –  January 2005  (1 year 1 month) Los Angeles, CA • Served as a paraprofessional counselor, advisor, tour guide, and mentor to the incoming freshmen of the Class of 2008 and their families.  \n• Represented the university by acting as key liaison between USC Administration, various departments, and students.  \n• Managed groups of up to 70 students and parents at a time. Orientation Advisor University of Southern California January 2004  –  January 2005  (1 year 1 month) Los Angeles, CA • Served as a paraprofessional counselor, advisor, tour guide, and mentor to the incoming freshmen of the Class of 2008 and their families.  \n• Represented the university by acting as key liaison between USC Administration, various departments, and students.  \n• Managed groups of up to 70 students and parents at a time. Skills Recruiting Training Program Management Online Advertising Student Recruiting Coordinating Events Project Management Project Planning Learning & Development Technical Recruiting College Recruiting CRM Account Management Google Adwords Event Management Event Planning Mentoring See 2+     See less Skills  Recruiting Training Program Management Online Advertising Student Recruiting Coordinating Events Project Management Project Planning Learning & Development Technical Recruiting College Recruiting CRM Account Management Google Adwords Event Management Event Planning Mentoring See 2+     See less Recruiting Training Program Management Online Advertising Student Recruiting Coordinating Events Project Management Project Planning Learning & Development Technical Recruiting College Recruiting CRM Account Management Google Adwords Event Management Event Planning Mentoring See 2+     See less Recruiting Training Program Management Online Advertising Student Recruiting Coordinating Events Project Management Project Planning Learning & Development Technical Recruiting College Recruiting CRM Account Management Google Adwords Event Management Event Planning Mentoring See 2+     See less Education University of Southern California BA,  Psychology 2002  – 2006 Activities and Societies:  USC Orientation Advisor ,  College Ambassador ,  Psi Chi ,  Study Abroad in England ,  WSA University of Sussex Life Sciences - Psychology 2005  – 2005 Study Abroad student at the University of Sussex in England Lowell High School 1998  – 2002 Magnet high school in San Francisco, CA University of Southern California BA,  Psychology 2002  – 2006 Activities and Societies:  USC Orientation Advisor ,  College Ambassador ,  Psi Chi ,  Study Abroad in England ,  WSA University of Southern California BA,  Psychology 2002  – 2006 Activities and Societies:  USC Orientation Advisor ,  College Ambassador ,  Psi Chi ,  Study Abroad in England ,  WSA University of Southern California BA,  Psychology 2002  – 2006 Activities and Societies:  USC Orientation Advisor ,  College Ambassador ,  Psi Chi ,  Study Abroad in England ,  WSA University of Sussex Life Sciences - Psychology 2005  – 2005 Study Abroad student at the University of Sussex in England University of Sussex Life Sciences - Psychology 2005  – 2005 Study Abroad student at the University of Sussex in England University of Sussex Life Sciences - Psychology 2005  – 2005 Study Abroad student at the University of Sussex in England Lowell High School 1998  – 2002 Magnet high school in San Francisco, CA Lowell High School 1998  – 2002 Magnet high school in San Francisco, CA Lowell High School 1998  – 2002 Magnet high school in San Francisco, CA ", "Summary Over 7.5 years of experience in Online Advertising & Marketing in Google India. Have been responsible for accounts with over $5 MN in revenue in a quarter. Starting at the basic level in Google has given me strong understanding of the SEM/PPC, Display Advertising and it's peripherals. \n \nOver the years I have managed and maintained clients relationships, worked effectively with overseas counterparts, managed and grown high-revenue client accounts in Search, Display and Mobile for markets spreading across US, and India. I have handled clients from various Industries - E-Comm, Entertainment, B2B, Local & Classifieds. \n \n \nPossess excellent interpersonal, communication and organizational skills with proven abilities in team, client relationship management. \n \nSpecialties: •\tEngaging High-Growth potential Clients \n•\tFormulating and executing Adwords Account strategies – PPC, SEM, Display Advertising Summary Over 7.5 years of experience in Online Advertising & Marketing in Google India. Have been responsible for accounts with over $5 MN in revenue in a quarter. Starting at the basic level in Google has given me strong understanding of the SEM/PPC, Display Advertising and it's peripherals. \n \nOver the years I have managed and maintained clients relationships, worked effectively with overseas counterparts, managed and grown high-revenue client accounts in Search, Display and Mobile for markets spreading across US, and India. I have handled clients from various Industries - E-Comm, Entertainment, B2B, Local & Classifieds. \n \n \nPossess excellent interpersonal, communication and organizational skills with proven abilities in team, client relationship management. \n \nSpecialties: •\tEngaging High-Growth potential Clients \n•\tFormulating and executing Adwords Account strategies – PPC, SEM, Display Advertising Over 7.5 years of experience in Online Advertising & Marketing in Google India. Have been responsible for accounts with over $5 MN in revenue in a quarter. Starting at the basic level in Google has given me strong understanding of the SEM/PPC, Display Advertising and it's peripherals. \n \nOver the years I have managed and maintained clients relationships, worked effectively with overseas counterparts, managed and grown high-revenue client accounts in Search, Display and Mobile for markets spreading across US, and India. I have handled clients from various Industries - E-Comm, Entertainment, B2B, Local & Classifieds. \n \n \nPossess excellent interpersonal, communication and organizational skills with proven abilities in team, client relationship management. \n \nSpecialties: •\tEngaging High-Growth potential Clients \n•\tFormulating and executing Adwords Account strategies – PPC, SEM, Display Advertising Over 7.5 years of experience in Online Advertising & Marketing in Google India. Have been responsible for accounts with over $5 MN in revenue in a quarter. Starting at the basic level in Google has given me strong understanding of the SEM/PPC, Display Advertising and it's peripherals. \n \nOver the years I have managed and maintained clients relationships, worked effectively with overseas counterparts, managed and grown high-revenue client accounts in Search, Display and Mobile for markets spreading across US, and India. I have handled clients from various Industries - E-Comm, Entertainment, B2B, Local & Classifieds. \n \n \nPossess excellent interpersonal, communication and organizational skills with proven abilities in team, client relationship management. \n \nSpecialties: •\tEngaging High-Growth potential Clients \n•\tFormulating and executing Adwords Account strategies – PPC, SEM, Display Advertising Experience Account Strategist- Large Customer Sales India - Local & Classifieds Google India October 2013  – Present (1 year 11 months) Gurgaon, India Account Strategist, Ecommerce, Classifieds and Media / Entertainment at Google India Google India July 2012  – Present (3 years 2 months) Gurgaon, India Account Strategist - Large Customer Sales, Media & Entertainment - North America Google India May 2011  –  September 2013  (2 years 5 months) Gurgaon, India •\tManage clients in the Media & Entertainment Industry such as Disney, Warner Bros, AOL to name a few and achieve Revenue and Sales Targets. \n•\tWorking on analyzing clients' Google Ad Words accounts and creating marketing plans and optimization proposals suitable for their business \n•\tCross Selling, up selling and coming up with long term strategies for a set of clients and taking care of their huge AdWords campaigns. \n•\tCreate online campaigns and ad creative by understanding online consumer behavioral pattern. \n•\tStudying the US Media & Entertainment market to understand the seasonality of the industry. \n•\tTroubleshooting and implementing complex Google Display Network & YouTube advertising campaigns. Conceive Campaign Strategy & Plan by identifying client conversion goals and analyzing target audience, geographies and Display Advertising Platforms. Account Planner - Client Services, Retail & Business Industrial Markets, North America Google February 2007  –  May 2011  (4 years 4 months) Gurgaon, India •\tConceive Campaign Strategy & Plan by identifying client conversion goals and analyzing target audience, geographies and networks. \n•\tCreate online campaigns and ad creatives by understanding online consumer behavioural pattern. \n•\tAssume front-end ownership of 100+ clients strategizing up-sell / cross-sell opportunities, hands-on account development, client ROI enhancement and Google revenue generation. \n•\tCreate new business opportunities through restructuring of dormant client accounts. \n \n \nProject Lead - Project Blitz \nKey Result Area: \n•\tHandpicked to lead the two India-wide projects due to a showcase of entrepreneurial skills. \n•\tCapture incremental annualized revenue opportunity from dormant accounts through restructuring. \n•\tStreamline project processes as per client’s requirements and conversion goals. \n \nAchievements: \n•\tPioneering achievement of $1m revenue; Client Response Rate increase of 266% vs 15% in previous projects - Rated “Super Successful” for Project Blitz as results were revolutionary for dormant accounts. \n•\tConducted 1:1 & shadow sessions resulting in marked productivity & comfort increase within teams. \n•\tMentored and trained 17 new members of the projects – got recognized in the peer bonus for this effort. AdWords Account Associate Google February 2007  –  February 2008  (1 year 1 month) - Worked on the development of accounts for long tail advertisers. \n- Client Support \n- Workflow Management. \n- Reviewed Google Adwords ads based on the policies. Subject Matter Expert American Express February 2003  –  December 2006  (3 years 11 months) •\tHandling Card member Disputes for Industries - Retail/Mail-Order & Services \n•\tAnalyzing the issue and providing judgment basis the proofs submitted by the Merchant Establishment and/or the Card Member \n•\tMoved on to becoming a Quality Coach/SME for the process and conducted coaching and feedback sessions for New Hires for 3 Industries Retail, Mail-order & Services.  \n•\tConducted New Hire Orientations for 2 batches with a total of 40 FTE’s Associate - Sales Hero ITES May 2002  –  February 2003  (10 months) I was into Telemarketing for clients - DishTV and DirectTV based in US. This involved calling clients and get buy-ins for Installing Dish TV cable systems for them Account Strategist- Large Customer Sales India - Local & Classifieds Google India October 2013  – Present (1 year 11 months) Gurgaon, India Account Strategist- Large Customer Sales India - Local & Classifieds Google India October 2013  – Present (1 year 11 months) Gurgaon, India Account Strategist, Ecommerce, Classifieds and Media / Entertainment at Google India Google India July 2012  – Present (3 years 2 months) Gurgaon, India Account Strategist, Ecommerce, Classifieds and Media / Entertainment at Google India Google India July 2012  – Present (3 years 2 months) Gurgaon, India Account Strategist - Large Customer Sales, Media & Entertainment - North America Google India May 2011  –  September 2013  (2 years 5 months) Gurgaon, India •\tManage clients in the Media & Entertainment Industry such as Disney, Warner Bros, AOL to name a few and achieve Revenue and Sales Targets. \n•\tWorking on analyzing clients' Google Ad Words accounts and creating marketing plans and optimization proposals suitable for their business \n•\tCross Selling, up selling and coming up with long term strategies for a set of clients and taking care of their huge AdWords campaigns. \n•\tCreate online campaigns and ad creative by understanding online consumer behavioral pattern. \n•\tStudying the US Media & Entertainment market to understand the seasonality of the industry. \n•\tTroubleshooting and implementing complex Google Display Network & YouTube advertising campaigns. Conceive Campaign Strategy & Plan by identifying client conversion goals and analyzing target audience, geographies and Display Advertising Platforms. Account Strategist - Large Customer Sales, Media & Entertainment - North America Google India May 2011  –  September 2013  (2 years 5 months) Gurgaon, India •\tManage clients in the Media & Entertainment Industry such as Disney, Warner Bros, AOL to name a few and achieve Revenue and Sales Targets. \n•\tWorking on analyzing clients' Google Ad Words accounts and creating marketing plans and optimization proposals suitable for their business \n•\tCross Selling, up selling and coming up with long term strategies for a set of clients and taking care of their huge AdWords campaigns. \n•\tCreate online campaigns and ad creative by understanding online consumer behavioral pattern. \n•\tStudying the US Media & Entertainment market to understand the seasonality of the industry. \n•\tTroubleshooting and implementing complex Google Display Network & YouTube advertising campaigns. Conceive Campaign Strategy & Plan by identifying client conversion goals and analyzing target audience, geographies and Display Advertising Platforms. Account Planner - Client Services, Retail & Business Industrial Markets, North America Google February 2007  –  May 2011  (4 years 4 months) Gurgaon, India •\tConceive Campaign Strategy & Plan by identifying client conversion goals and analyzing target audience, geographies and networks. \n•\tCreate online campaigns and ad creatives by understanding online consumer behavioural pattern. \n•\tAssume front-end ownership of 100+ clients strategizing up-sell / cross-sell opportunities, hands-on account development, client ROI enhancement and Google revenue generation. \n•\tCreate new business opportunities through restructuring of dormant client accounts. \n \n \nProject Lead - Project Blitz \nKey Result Area: \n•\tHandpicked to lead the two India-wide projects due to a showcase of entrepreneurial skills. \n•\tCapture incremental annualized revenue opportunity from dormant accounts through restructuring. \n•\tStreamline project processes as per client’s requirements and conversion goals. \n \nAchievements: \n•\tPioneering achievement of $1m revenue; Client Response Rate increase of 266% vs 15% in previous projects - Rated “Super Successful” for Project Blitz as results were revolutionary for dormant accounts. \n•\tConducted 1:1 & shadow sessions resulting in marked productivity & comfort increase within teams. \n•\tMentored and trained 17 new members of the projects – got recognized in the peer bonus for this effort. Account Planner - Client Services, Retail & Business Industrial Markets, North America Google February 2007  –  May 2011  (4 years 4 months) Gurgaon, India •\tConceive Campaign Strategy & Plan by identifying client conversion goals and analyzing target audience, geographies and networks. \n•\tCreate online campaigns and ad creatives by understanding online consumer behavioural pattern. \n•\tAssume front-end ownership of 100+ clients strategizing up-sell / cross-sell opportunities, hands-on account development, client ROI enhancement and Google revenue generation. \n•\tCreate new business opportunities through restructuring of dormant client accounts. \n \n \nProject Lead - Project Blitz \nKey Result Area: \n•\tHandpicked to lead the two India-wide projects due to a showcase of entrepreneurial skills. \n•\tCapture incremental annualized revenue opportunity from dormant accounts through restructuring. \n•\tStreamline project processes as per client’s requirements and conversion goals. \n \nAchievements: \n•\tPioneering achievement of $1m revenue; Client Response Rate increase of 266% vs 15% in previous projects - Rated “Super Successful” for Project Blitz as results were revolutionary for dormant accounts. \n•\tConducted 1:1 & shadow sessions resulting in marked productivity & comfort increase within teams. \n•\tMentored and trained 17 new members of the projects – got recognized in the peer bonus for this effort. AdWords Account Associate Google February 2007  –  February 2008  (1 year 1 month) - Worked on the development of accounts for long tail advertisers. \n- Client Support \n- Workflow Management. \n- Reviewed Google Adwords ads based on the policies. AdWords Account Associate Google February 2007  –  February 2008  (1 year 1 month) - Worked on the development of accounts for long tail advertisers. \n- Client Support \n- Workflow Management. \n- Reviewed Google Adwords ads based on the policies. Subject Matter Expert American Express February 2003  –  December 2006  (3 years 11 months) •\tHandling Card member Disputes for Industries - Retail/Mail-Order & Services \n•\tAnalyzing the issue and providing judgment basis the proofs submitted by the Merchant Establishment and/or the Card Member \n•\tMoved on to becoming a Quality Coach/SME for the process and conducted coaching and feedback sessions for New Hires for 3 Industries Retail, Mail-order & Services.  \n•\tConducted New Hire Orientations for 2 batches with a total of 40 FTE’s Subject Matter Expert American Express February 2003  –  December 2006  (3 years 11 months) •\tHandling Card member Disputes for Industries - Retail/Mail-Order & Services \n•\tAnalyzing the issue and providing judgment basis the proofs submitted by the Merchant Establishment and/or the Card Member \n•\tMoved on to becoming a Quality Coach/SME for the process and conducted coaching and feedback sessions for New Hires for 3 Industries Retail, Mail-order & Services.  \n•\tConducted New Hire Orientations for 2 batches with a total of 40 FTE’s Associate - Sales Hero ITES May 2002  –  February 2003  (10 months) I was into Telemarketing for clients - DishTV and DirectTV based in US. This involved calling clients and get buy-ins for Installing Dish TV cable systems for them Associate - Sales Hero ITES May 2002  –  February 2003  (10 months) I was into Telemarketing for clients - DishTV and DirectTV based in US. This involved calling clients and get buy-ins for Installing Dish TV cable systems for them Languages Hindi Punjabi Hindi Punjabi Hindi Punjabi Skills SEM Google Adwords SEO PPC Account Management Search Advertising Display Advertising Google Analytics Relationship Management Key Account Management Sales Coaching Mentoring Optimizations Strategy Advertising Marketing Strategy Online Advertising E-commerce B2B See 5+     See less Skills  SEM Google Adwords SEO PPC Account Management Search Advertising Display Advertising Google Analytics Relationship Management Key Account Management Sales Coaching Mentoring Optimizations Strategy Advertising Marketing Strategy Online Advertising E-commerce B2B See 5+     See less SEM Google Adwords SEO PPC Account Management Search Advertising Display Advertising Google Analytics Relationship Management Key Account Management Sales Coaching Mentoring Optimizations Strategy Advertising Marketing Strategy Online Advertising E-commerce B2B See 5+     See less SEM Google Adwords SEO PPC Account Management Search Advertising Display Advertising Google Analytics Relationship Management Key Account Management Sales Coaching Mentoring Optimizations Strategy Advertising Marketing Strategy Online Advertising E-commerce B2B See 5+     See less Education Panjab University BA,  Vocational English (Phonetics) 1999  – 2002 Modern School 1997  – 1999 Panjab University BA,  Vocational English (Phonetics) 1999  – 2002 Panjab University BA,  Vocational English (Phonetics) 1999  – 2002 Panjab University BA,  Vocational English (Phonetics) 1999  – 2002 Modern School 1997  – 1999 Modern School 1997  – 1999 Modern School 1997  – 1999 Honors & Awards Additional Honors & Awards * 3 Peer Awards: recommended by my peers and team members for exemplary mentorship, collaboration, teamwork and trainings for new hires.  \n \n* Sales Innovation Award for an annualized impact of 47K. \n \n* Awarded Quality and Productivity awards for consistent performance Additional Honors & Awards * 3 Peer Awards: recommended by my peers and team members for exemplary mentorship, collaboration, teamwork and trainings for new hires.  \n \n* Sales Innovation Award for an annualized impact of 47K. \n \n* Awarded Quality and Productivity awards for consistent performance Additional Honors & Awards * 3 Peer Awards: recommended by my peers and team members for exemplary mentorship, collaboration, teamwork and trainings for new hires.  \n \n* Sales Innovation Award for an annualized impact of 47K. \n \n* Awarded Quality and Productivity awards for consistent performance Additional Honors & Awards * 3 Peer Awards: recommended by my peers and team members for exemplary mentorship, collaboration, teamwork and trainings for new hires.  \n \n* Sales Innovation Award for an annualized impact of 47K. \n \n* Awarded Quality and Productivity awards for consistent performance ", "Experience Team Lead Google January 2014  – Present (1 year 8 months) Mountain View, CA - Lead the Platform Account Managers focussing on the development of the DoubleClick for Publishers (DFP) business, with an annual run rate of $30M.  \n- Define the Platform strategy and oversee execution of the platform business initiatives \n- Lead cross-functional, products as well as regional efforts managing expectations from stakeholders while delivering on key platform initiatives.  \n- Impact platform product development by launching and/or facilitating new and improved solutions for ad serving \n- Manage a portfolio of DFP Premium publishers focussed on building strong business relationships providing insights into holistic business needs. Provide Google solutions across DFP (Small Business and Premium), AdX for Sellers and Buyers, AdSense, Sales Manager, Audience, Video and Mobile. Sr. Account Manager and Product Specialist Google January 2012  –  December 2012  (1 year) Mountain View, California Product Specialist Lead:  \nPSL for core DFP, Audience, Audience Extension, Video and Mobile.  \n1. Collaborate with Product Managers, Engineers and regional Sales heads to expand features and publisher offerings for core DFP and the add-ons Video, Mobile, Audience, Sales Manager and emerging products/features.  \n2.Empower Sales team to sell innovative publisher solutions based on DFP via training on new and existing features, coaching of product use and collaborative partner selling3.  \n3. Collaborate with Product Managers and Engineers to develop the DFP product vision \n \nSr. Account Manager:  \nManaging a portfolio of North American DoubleClick for Publishers Premium accounts in a small, competitive and enthusiastic team within OPG, Google in Mountain View, CA.  \n- Building strong business relationships and advising on the partner's ad serving needs, and providing Google business solutions wherever needed.  \n- Provide consultation on Google Monetization opportunities and other competitive Yield Management solutions.  \n \nOther:  \n- Business Lead, DFP Audience and Audience Extension. Collaborating with Product Managers to expand DFP Audience features and client offerings. \n- Lead, Cross-functional Collaboration. Launch internal engagement model and ensuring that Account Managers are working together on joint accounts to ensure holistic business solutions for each client. Lead Account Manager, OPG Google June 2011  –  January 2012  (8 months) Gurgaon, India Apart from managing my portfolio of priority AdSense accounts in India, I am currently responsible for driving all Account Management activities in OPG India; contributing to over 65% of revenue. This involves preparing the framework for account management, facilitating and measuring progress against different projects that the Account Managers are leading. Account Manager, AdSense Google April 2010  –  May 2011  (1 year 2 months) Handle the AdSense account for 50 high-end publishers in India. The core responsibilities include: \n1. Managed support for all account-related issues. \n2. Identify opportunities in the account to improve monetization.  \n3. Identify and pitch other Google products like AdSense for Search, Games, Video etc, which will cater to all/any of the website requirements. \n \n \nAchievements: \nIndia:  \nManage an AdSense portfolio of over $20M annually consisting of India's largest AdSense and DFP SB publishers; consistently attaining over 150% of revenue and pod targets. \n \nRegional - APAC:  \nAPAC representative for the following global initiatives - Global Taskforce team and the Global CSAT team delivering projects and initiatives from the APAC region while working closely with the Account Managers from 6 APAC countries.  \n \nGlobal: \nIn Q2, 2011, planned and executed the Global Pitch Blast among global Account Managers of priority accounts with the objective to increase sales activity early on in a quarter. A unique method was used to track and rewards optimizations, and the annualized revenue impact has been hugely significant. Scalable Account Management Google January 2010  –  March 2010  (3 months) For one quarter, I handled the mixed responsibilities of a revenue sustaining Policy Specialist as well as a revenue generating SAM role. \nMy core projects included: \n1. Managed support for 10 accounts and provide account-related assistance. \n2. Monitor the performance of all the AdSense accounts, and reach out with one-on-one Optimization pitches to accounts with significant decrease in revenue week over week. \n3. Send out 3 different Optimization bulk email pitches to around 3000 publishers who were carefully selected based on account information. Policy Specialist, AdSense (India and Australia) Google April 2009  –  March 2010  (1 year) Core responsibilities included:  \n1. Ensure all accounts in the India and Australia content network are compliant according to Google policy guidelines.  \n2. Identify and execute scalable process to review websites for policy checks.  \n3. Liaison with the JAPAC Policy team and the Global AdSense Policy team. Execute jointly common objectives for faster turn around time. Account Associate, AdSense Scalable Operations Google December 2007  –  March 2009  (1 year 4 months) Hyderabad Area, India 1. Drove global automation initiative as India Project Lead to reduce manual publisher approval and customized email volume.  \n2. Designed and launched publisher troubleshooters within AdSense Help Center to decrease user dependency on human responses. \n3. Formed the Content Analyst group within AdSense India to collaborate with  \nthe AdWords North America team in Hyderabad to upsell content. Worked with the AdWords pods to develop core packs as an initiative to take advantage of seasonal spike in advertiser spend for top verticals. Account Representative, AdWords Google July 2006  –  November 2007  (1 year 5 months) Hyderabad Area, India Team Lead Google January 2014  – Present (1 year 8 months) Mountain View, CA - Lead the Platform Account Managers focussing on the development of the DoubleClick for Publishers (DFP) business, with an annual run rate of $30M.  \n- Define the Platform strategy and oversee execution of the platform business initiatives \n- Lead cross-functional, products as well as regional efforts managing expectations from stakeholders while delivering on key platform initiatives.  \n- Impact platform product development by launching and/or facilitating new and improved solutions for ad serving \n- Manage a portfolio of DFP Premium publishers focussed on building strong business relationships providing insights into holistic business needs. Provide Google solutions across DFP (Small Business and Premium), AdX for Sellers and Buyers, AdSense, Sales Manager, Audience, Video and Mobile. Team Lead Google January 2014  – Present (1 year 8 months) Mountain View, CA - Lead the Platform Account Managers focussing on the development of the DoubleClick for Publishers (DFP) business, with an annual run rate of $30M.  \n- Define the Platform strategy and oversee execution of the platform business initiatives \n- Lead cross-functional, products as well as regional efforts managing expectations from stakeholders while delivering on key platform initiatives.  \n- Impact platform product development by launching and/or facilitating new and improved solutions for ad serving \n- Manage a portfolio of DFP Premium publishers focussed on building strong business relationships providing insights into holistic business needs. Provide Google solutions across DFP (Small Business and Premium), AdX for Sellers and Buyers, AdSense, Sales Manager, Audience, Video and Mobile. Sr. Account Manager and Product Specialist Google January 2012  –  December 2012  (1 year) Mountain View, California Product Specialist Lead:  \nPSL for core DFP, Audience, Audience Extension, Video and Mobile.  \n1. Collaborate with Product Managers, Engineers and regional Sales heads to expand features and publisher offerings for core DFP and the add-ons Video, Mobile, Audience, Sales Manager and emerging products/features.  \n2.Empower Sales team to sell innovative publisher solutions based on DFP via training on new and existing features, coaching of product use and collaborative partner selling3.  \n3. Collaborate with Product Managers and Engineers to develop the DFP product vision \n \nSr. Account Manager:  \nManaging a portfolio of North American DoubleClick for Publishers Premium accounts in a small, competitive and enthusiastic team within OPG, Google in Mountain View, CA.  \n- Building strong business relationships and advising on the partner's ad serving needs, and providing Google business solutions wherever needed.  \n- Provide consultation on Google Monetization opportunities and other competitive Yield Management solutions.  \n \nOther:  \n- Business Lead, DFP Audience and Audience Extension. Collaborating with Product Managers to expand DFP Audience features and client offerings. \n- Lead, Cross-functional Collaboration. Launch internal engagement model and ensuring that Account Managers are working together on joint accounts to ensure holistic business solutions for each client. Sr. Account Manager and Product Specialist Google January 2012  –  December 2012  (1 year) Mountain View, California Product Specialist Lead:  \nPSL for core DFP, Audience, Audience Extension, Video and Mobile.  \n1. Collaborate with Product Managers, Engineers and regional Sales heads to expand features and publisher offerings for core DFP and the add-ons Video, Mobile, Audience, Sales Manager and emerging products/features.  \n2.Empower Sales team to sell innovative publisher solutions based on DFP via training on new and existing features, coaching of product use and collaborative partner selling3.  \n3. Collaborate with Product Managers and Engineers to develop the DFP product vision \n \nSr. Account Manager:  \nManaging a portfolio of North American DoubleClick for Publishers Premium accounts in a small, competitive and enthusiastic team within OPG, Google in Mountain View, CA.  \n- Building strong business relationships and advising on the partner's ad serving needs, and providing Google business solutions wherever needed.  \n- Provide consultation on Google Monetization opportunities and other competitive Yield Management solutions.  \n \nOther:  \n- Business Lead, DFP Audience and Audience Extension. Collaborating with Product Managers to expand DFP Audience features and client offerings. \n- Lead, Cross-functional Collaboration. Launch internal engagement model and ensuring that Account Managers are working together on joint accounts to ensure holistic business solutions for each client. Lead Account Manager, OPG Google June 2011  –  January 2012  (8 months) Gurgaon, India Apart from managing my portfolio of priority AdSense accounts in India, I am currently responsible for driving all Account Management activities in OPG India; contributing to over 65% of revenue. This involves preparing the framework for account management, facilitating and measuring progress against different projects that the Account Managers are leading. Lead Account Manager, OPG Google June 2011  –  January 2012  (8 months) Gurgaon, India Apart from managing my portfolio of priority AdSense accounts in India, I am currently responsible for driving all Account Management activities in OPG India; contributing to over 65% of revenue. This involves preparing the framework for account management, facilitating and measuring progress against different projects that the Account Managers are leading. Account Manager, AdSense Google April 2010  –  May 2011  (1 year 2 months) Handle the AdSense account for 50 high-end publishers in India. The core responsibilities include: \n1. Managed support for all account-related issues. \n2. Identify opportunities in the account to improve monetization.  \n3. Identify and pitch other Google products like AdSense for Search, Games, Video etc, which will cater to all/any of the website requirements. \n \n \nAchievements: \nIndia:  \nManage an AdSense portfolio of over $20M annually consisting of India's largest AdSense and DFP SB publishers; consistently attaining over 150% of revenue and pod targets. \n \nRegional - APAC:  \nAPAC representative for the following global initiatives - Global Taskforce team and the Global CSAT team delivering projects and initiatives from the APAC region while working closely with the Account Managers from 6 APAC countries.  \n \nGlobal: \nIn Q2, 2011, planned and executed the Global Pitch Blast among global Account Managers of priority accounts with the objective to increase sales activity early on in a quarter. A unique method was used to track and rewards optimizations, and the annualized revenue impact has been hugely significant. Account Manager, AdSense Google April 2010  –  May 2011  (1 year 2 months) Handle the AdSense account for 50 high-end publishers in India. The core responsibilities include: \n1. Managed support for all account-related issues. \n2. Identify opportunities in the account to improve monetization.  \n3. Identify and pitch other Google products like AdSense for Search, Games, Video etc, which will cater to all/any of the website requirements. \n \n \nAchievements: \nIndia:  \nManage an AdSense portfolio of over $20M annually consisting of India's largest AdSense and DFP SB publishers; consistently attaining over 150% of revenue and pod targets. \n \nRegional - APAC:  \nAPAC representative for the following global initiatives - Global Taskforce team and the Global CSAT team delivering projects and initiatives from the APAC region while working closely with the Account Managers from 6 APAC countries.  \n \nGlobal: \nIn Q2, 2011, planned and executed the Global Pitch Blast among global Account Managers of priority accounts with the objective to increase sales activity early on in a quarter. A unique method was used to track and rewards optimizations, and the annualized revenue impact has been hugely significant. Scalable Account Management Google January 2010  –  March 2010  (3 months) For one quarter, I handled the mixed responsibilities of a revenue sustaining Policy Specialist as well as a revenue generating SAM role. \nMy core projects included: \n1. Managed support for 10 accounts and provide account-related assistance. \n2. Monitor the performance of all the AdSense accounts, and reach out with one-on-one Optimization pitches to accounts with significant decrease in revenue week over week. \n3. Send out 3 different Optimization bulk email pitches to around 3000 publishers who were carefully selected based on account information. Scalable Account Management Google January 2010  –  March 2010  (3 months) For one quarter, I handled the mixed responsibilities of a revenue sustaining Policy Specialist as well as a revenue generating SAM role. \nMy core projects included: \n1. Managed support for 10 accounts and provide account-related assistance. \n2. Monitor the performance of all the AdSense accounts, and reach out with one-on-one Optimization pitches to accounts with significant decrease in revenue week over week. \n3. Send out 3 different Optimization bulk email pitches to around 3000 publishers who were carefully selected based on account information. Policy Specialist, AdSense (India and Australia) Google April 2009  –  March 2010  (1 year) Core responsibilities included:  \n1. Ensure all accounts in the India and Australia content network are compliant according to Google policy guidelines.  \n2. Identify and execute scalable process to review websites for policy checks.  \n3. Liaison with the JAPAC Policy team and the Global AdSense Policy team. Execute jointly common objectives for faster turn around time. Policy Specialist, AdSense (India and Australia) Google April 2009  –  March 2010  (1 year) Core responsibilities included:  \n1. Ensure all accounts in the India and Australia content network are compliant according to Google policy guidelines.  \n2. Identify and execute scalable process to review websites for policy checks.  \n3. Liaison with the JAPAC Policy team and the Global AdSense Policy team. Execute jointly common objectives for faster turn around time. Account Associate, AdSense Scalable Operations Google December 2007  –  March 2009  (1 year 4 months) Hyderabad Area, India 1. Drove global automation initiative as India Project Lead to reduce manual publisher approval and customized email volume.  \n2. Designed and launched publisher troubleshooters within AdSense Help Center to decrease user dependency on human responses. \n3. Formed the Content Analyst group within AdSense India to collaborate with  \nthe AdWords North America team in Hyderabad to upsell content. Worked with the AdWords pods to develop core packs as an initiative to take advantage of seasonal spike in advertiser spend for top verticals. Account Associate, AdSense Scalable Operations Google December 2007  –  March 2009  (1 year 4 months) Hyderabad Area, India 1. Drove global automation initiative as India Project Lead to reduce manual publisher approval and customized email volume.  \n2. Designed and launched publisher troubleshooters within AdSense Help Center to decrease user dependency on human responses. \n3. Formed the Content Analyst group within AdSense India to collaborate with  \nthe AdWords North America team in Hyderabad to upsell content. Worked with the AdWords pods to develop core packs as an initiative to take advantage of seasonal spike in advertiser spend for top verticals. Account Representative, AdWords Google July 2006  –  November 2007  (1 year 5 months) Hyderabad Area, India Account Representative, AdWords Google July 2006  –  November 2007  (1 year 5 months) Hyderabad Area, India Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Native or bilingual proficiency Bengali Native or bilingual proficiency Spanish Limited working proficiency Italian Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Native or bilingual proficiency Bengali Native or bilingual proficiency Spanish Limited working proficiency Italian Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Native or bilingual proficiency Bengali Native or bilingual proficiency Spanish Limited working proficiency Italian Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less Skills  International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less Education St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member Honors & Awards OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  ", "Summary An experienced Google AdWords SEM professional with deep product knowledge of Search Engine Marketing, well-tested automation solutions, creative analytical approaches and a strong track record of teamwork. \n \nSpecialties: Google AdWords, Google Analytics, Doubleclick Search. Summary An experienced Google AdWords SEM professional with deep product knowledge of Search Engine Marketing, well-tested automation solutions, creative analytical approaches and a strong track record of teamwork. \n \nSpecialties: Google AdWords, Google Analytics, Doubleclick Search. An experienced Google AdWords SEM professional with deep product knowledge of Search Engine Marketing, well-tested automation solutions, creative analytical approaches and a strong track record of teamwork. \n \nSpecialties: Google AdWords, Google Analytics, Doubleclick Search. An experienced Google AdWords SEM professional with deep product knowledge of Search Engine Marketing, well-tested automation solutions, creative analytical approaches and a strong track record of teamwork. \n \nSpecialties: Google AdWords, Google Analytics, Doubleclick Search. Experience Paid Search Ad Solutions Consultant Google August 2015  – Present (1 month) Singapore - Own technical relationship with selected advertisers portfolio \n- Work with clients, leveraging both search and display solutions, to solve business problems  \n- Design and implement complex and customized solutions for top tier clients Lead Technical Specialist - AdWords and Doubleclick Search Google May 2013  –  July 2015  (2 years 3 months) Singapore - Provide technical consulting and support on paid search products to top tier clients \n Senior Digital Marketing Strategist, South East Asia Google December 2011  –  April 2013  (1 year 5 months) Singapore - Consult and build relationships with some of the biggest Travel clients and their media agencies in South East Asia; understand their business goals and objectives and offer appropriate digital marketing solutions spanning SEM, Display, Remarketing and cost-per-view YouTube Video solutions.  \n- Provide deeper insights into the Travel industry trends in the APAC region and help clients in planning & forecasting. Model, propose, manage, optimize and monitor their digital budgets. \n \n SEM Strategist, Australia Google September 2010  –  November 2011  (1 year 3 months) - Monitor and analyse online marketing and campaign performance data in order to suggest structural and editorial improvements that optimise ad campaigns \n- Control editorial quality and consult with clients on campaigns \n- Understand client websites and products to develop creative content for their advertising needs \n- Encourage advertisers to incorporate Google's product suite of ROI oriented ad strategies Account Planner, US Market Google April 2010  –  August 2011  (1 year 5 months) - Planner for Motorola, Nokia, Dell, Sprint and AT&T \n- Provide intelligence, analysis and research on AdWords accounts to the Chicago team \n- Collaborate effectively with the team in Chicago in order to deliver strategic optimisation solutions  \n- Facilitate early intervention for negative trends such as declining conversion rates, market analysis and etc. \n- Review websites with Google Analytics data to understand user dropout stages and make appropriate suggestions to clients Account Optimiser, US Market Google May 2009  –  March 2010  (11 months) - Developing campaign recommendations that align with the client business objectives Account Associate, US Market Google July 2006  –  April 2009  (2 years 10 months) - Reviewing campaigns per Google policies Faculty Associate ICFAI Center for Management Research January 2006  –  April 2006  (4 months) - Build case studies on global politics and economy \n- Initiate and guide discussions with management students on case studies related to international affairs and incorporate feedback into these case studies Territory Manager Eli Lilly and Company December 2002  –  February 2005  (2 years 3 months) - Launched Warangal as a full-fledged headquarter for Eli Lilly \n- Penetrated Eli Lilly's Insulin Market into six new towns in the four districts of Warangal, Karimnagar, Medak and Adilabad Paid Search Ad Solutions Consultant Google August 2015  – Present (1 month) Singapore - Own technical relationship with selected advertisers portfolio \n- Work with clients, leveraging both search and display solutions, to solve business problems  \n- Design and implement complex and customized solutions for top tier clients Paid Search Ad Solutions Consultant Google August 2015  – Present (1 month) Singapore - Own technical relationship with selected advertisers portfolio \n- Work with clients, leveraging both search and display solutions, to solve business problems  \n- Design and implement complex and customized solutions for top tier clients Lead Technical Specialist - AdWords and Doubleclick Search Google May 2013  –  July 2015  (2 years 3 months) Singapore - Provide technical consulting and support on paid search products to top tier clients \n Lead Technical Specialist - AdWords and Doubleclick Search Google May 2013  –  July 2015  (2 years 3 months) Singapore - Provide technical consulting and support on paid search products to top tier clients \n Senior Digital Marketing Strategist, South East Asia Google December 2011  –  April 2013  (1 year 5 months) Singapore - Consult and build relationships with some of the biggest Travel clients and their media agencies in South East Asia; understand their business goals and objectives and offer appropriate digital marketing solutions spanning SEM, Display, Remarketing and cost-per-view YouTube Video solutions.  \n- Provide deeper insights into the Travel industry trends in the APAC region and help clients in planning & forecasting. Model, propose, manage, optimize and monitor their digital budgets. \n \n Senior Digital Marketing Strategist, South East Asia Google December 2011  –  April 2013  (1 year 5 months) Singapore - Consult and build relationships with some of the biggest Travel clients and their media agencies in South East Asia; understand their business goals and objectives and offer appropriate digital marketing solutions spanning SEM, Display, Remarketing and cost-per-view YouTube Video solutions.  \n- Provide deeper insights into the Travel industry trends in the APAC region and help clients in planning & forecasting. Model, propose, manage, optimize and monitor their digital budgets. \n \n SEM Strategist, Australia Google September 2010  –  November 2011  (1 year 3 months) - Monitor and analyse online marketing and campaign performance data in order to suggest structural and editorial improvements that optimise ad campaigns \n- Control editorial quality and consult with clients on campaigns \n- Understand client websites and products to develop creative content for their advertising needs \n- Encourage advertisers to incorporate Google's product suite of ROI oriented ad strategies SEM Strategist, Australia Google September 2010  –  November 2011  (1 year 3 months) - Monitor and analyse online marketing and campaign performance data in order to suggest structural and editorial improvements that optimise ad campaigns \n- Control editorial quality and consult with clients on campaigns \n- Understand client websites and products to develop creative content for their advertising needs \n- Encourage advertisers to incorporate Google's product suite of ROI oriented ad strategies Account Planner, US Market Google April 2010  –  August 2011  (1 year 5 months) - Planner for Motorola, Nokia, Dell, Sprint and AT&T \n- Provide intelligence, analysis and research on AdWords accounts to the Chicago team \n- Collaborate effectively with the team in Chicago in order to deliver strategic optimisation solutions  \n- Facilitate early intervention for negative trends such as declining conversion rates, market analysis and etc. \n- Review websites with Google Analytics data to understand user dropout stages and make appropriate suggestions to clients Account Planner, US Market Google April 2010  –  August 2011  (1 year 5 months) - Planner for Motorola, Nokia, Dell, Sprint and AT&T \n- Provide intelligence, analysis and research on AdWords accounts to the Chicago team \n- Collaborate effectively with the team in Chicago in order to deliver strategic optimisation solutions  \n- Facilitate early intervention for negative trends such as declining conversion rates, market analysis and etc. \n- Review websites with Google Analytics data to understand user dropout stages and make appropriate suggestions to clients Account Optimiser, US Market Google May 2009  –  March 2010  (11 months) - Developing campaign recommendations that align with the client business objectives Account Optimiser, US Market Google May 2009  –  March 2010  (11 months) - Developing campaign recommendations that align with the client business objectives Account Associate, US Market Google July 2006  –  April 2009  (2 years 10 months) - Reviewing campaigns per Google policies Account Associate, US Market Google July 2006  –  April 2009  (2 years 10 months) - Reviewing campaigns per Google policies Faculty Associate ICFAI Center for Management Research January 2006  –  April 2006  (4 months) - Build case studies on global politics and economy \n- Initiate and guide discussions with management students on case studies related to international affairs and incorporate feedback into these case studies Faculty Associate ICFAI Center for Management Research January 2006  –  April 2006  (4 months) - Build case studies on global politics and economy \n- Initiate and guide discussions with management students on case studies related to international affairs and incorporate feedback into these case studies Territory Manager Eli Lilly and Company December 2002  –  February 2005  (2 years 3 months) - Launched Warangal as a full-fledged headquarter for Eli Lilly \n- Penetrated Eli Lilly's Insulin Market into six new towns in the four districts of Warangal, Karimnagar, Medak and Adilabad Territory Manager Eli Lilly and Company December 2002  –  February 2005  (2 years 3 months) - Launched Warangal as a full-fledged headquarter for Eli Lilly \n- Penetrated Eli Lilly's Insulin Market into six new towns in the four districts of Warangal, Karimnagar, Medak and Adilabad Languages English Native or bilingual proficiency Hindi Professional working proficiency Telugu Professional working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Hindi Professional working proficiency Telugu Professional working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Hindi Professional working proficiency Telugu Professional working proficiency Spanish Elementary proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Elementary proficiency Skills Google Adwords Doubleclick Search Google Analytics Digital Marketing Display Advertising Digital Strategy Conversion Optimization Browser Automation Market Opportunity... ROI Strategies SEM Market Analysis Online Marketing Online Advertising PPC Skills  Google Adwords Doubleclick Search Google Analytics Digital Marketing Display Advertising Digital Strategy Conversion Optimization Browser Automation Market Opportunity... ROI Strategies SEM Market Analysis Online Marketing Online Advertising PPC Google Adwords Doubleclick Search Google Analytics Digital Marketing Display Advertising Digital Strategy Conversion Optimization Browser Automation Market Opportunity... ROI Strategies SEM Market Analysis Online Marketing Online Advertising PPC Google Adwords Doubleclick Search Google Analytics Digital Marketing Display Advertising Digital Strategy Conversion Optimization Browser Automation Market Opportunity... ROI Strategies SEM Market Analysis Online Marketing Online Advertising PPC Education Osmania University Doctor of Philosophy (Ph.D.),  International Relations 2002  – 2010 Doctoral Thesis: Indo - Israel Relations 1948-2005 \n \n Central Institute of English and Foreign Languages 2006 Diploma; M.A,  Spanish 2006  – 2006 Jawaharlal Nehru University M.A.,  International Relations 2000  – 2002 University Grant's Commission's Junior Research Fellowship Sri Sathya Sai Institute of Higher Learning B.A,  Political Science ,  History and Economics 1997  – 2000 Osmania University Doctor of Philosophy (Ph.D.),  International Relations 2002  – 2010 Doctoral Thesis: Indo - Israel Relations 1948-2005 \n \n Osmania University Doctor of Philosophy (Ph.D.),  International Relations 2002  – 2010 Doctoral Thesis: Indo - Israel Relations 1948-2005 \n \n Osmania University Doctor of Philosophy (Ph.D.),  International Relations 2002  – 2010 Doctoral Thesis: Indo - Israel Relations 1948-2005 \n \n Central Institute of English and Foreign Languages 2006 Diploma; M.A,  Spanish 2006  – 2006 Central Institute of English and Foreign Languages 2006 Diploma; M.A,  Spanish 2006  – 2006 Central Institute of English and Foreign Languages 2006 Diploma; M.A,  Spanish 2006  – 2006 Jawaharlal Nehru University M.A.,  International Relations 2000  – 2002 University Grant's Commission's Junior Research Fellowship Jawaharlal Nehru University M.A.,  International Relations 2000  – 2002 University Grant's Commission's Junior Research Fellowship Jawaharlal Nehru University M.A.,  International Relations 2000  – 2002 University Grant's Commission's Junior Research Fellowship Sri Sathya Sai Institute of Higher Learning B.A,  Political Science ,  History and Economics 1997  – 2000 Sri Sathya Sai Institute of Higher Learning B.A,  Political Science ,  History and Economics 1997  – 2000 Sri Sathya Sai Institute of Higher Learning B.A,  Political Science ,  History and Economics 1997  – 2000 Honors & Awards Additional Honors & Awards - UGC Junior Research Fellowship 2002 \n \nCERTIFICATIONS  \n \n1.\tGoogle AdWords Search Advertising \n2.\tGoogle AdWords Reporting and Analysis \n3.\tGoogle AdWords Display Advertising \n4.\tGoogle Analytics Individual Qualification Additional Honors & Awards - UGC Junior Research Fellowship 2002 \n \nCERTIFICATIONS  \n \n1.\tGoogle AdWords Search Advertising \n2.\tGoogle AdWords Reporting and Analysis \n3.\tGoogle AdWords Display Advertising \n4.\tGoogle Analytics Individual Qualification Additional Honors & Awards - UGC Junior Research Fellowship 2002 \n \nCERTIFICATIONS  \n \n1.\tGoogle AdWords Search Advertising \n2.\tGoogle AdWords Reporting and Analysis \n3.\tGoogle AdWords Display Advertising \n4.\tGoogle Analytics Individual Qualification Additional Honors & Awards - UGC Junior Research Fellowship 2002 \n \nCERTIFICATIONS  \n \n1.\tGoogle AdWords Search Advertising \n2.\tGoogle AdWords Reporting and Analysis \n3.\tGoogle AdWords Display Advertising \n4.\tGoogle Analytics Individual Qualification ", "Skills Google Adwords PPC Search Advertising SEM Display Advertising Google Analytics Online Marketing Mobile Advertising Mobile Marketing Digital Media Web Analytics Operational Excellence YouTube Online Advertising DoubleClick Conversion Optimization Digital Strategy Ad Serving Digital Marketing Adsense Web Marketing Landing Page... Ad Networks Google Adwords... Google Webmaster Tools Campaign Management See 11+     See less Skills  Google Adwords PPC Search Advertising SEM Display Advertising Google Analytics Online Marketing Mobile Advertising Mobile Marketing Digital Media Web Analytics Operational Excellence YouTube Online Advertising DoubleClick Conversion Optimization Digital Strategy Ad Serving Digital Marketing Adsense Web Marketing Landing Page... Ad Networks Google Adwords... Google Webmaster Tools Campaign Management See 11+     See less Google Adwords PPC Search Advertising SEM Display Advertising Google Analytics Online Marketing Mobile Advertising Mobile Marketing Digital Media Web Analytics Operational Excellence YouTube Online Advertising DoubleClick Conversion Optimization Digital Strategy Ad Serving Digital Marketing Adsense Web Marketing Landing Page... Ad Networks Google Adwords... Google Webmaster Tools Campaign Management See 11+     See less Google Adwords PPC Search Advertising SEM Display Advertising Google Analytics Online Marketing Mobile Advertising Mobile Marketing Digital Media Web Analytics Operational Excellence YouTube Online Advertising DoubleClick Conversion Optimization Digital Strategy Ad Serving Digital Marketing Adsense Web Marketing Landing Page... Ad Networks Google Adwords... Google Webmaster Tools Campaign Management See 11+     See less ", "Summary Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Summary Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Experience SMB Acquisition Manager Google May 2015  – Present (4 months) Kuala Lumpur, Malaysia Operations Lead - SMB Sales, SEA Google July 2014  – Present (1 year 2 months) Kuala Lumpur, Malaysia Driving SMB customer acquisitions through our outsourcing partners to exceed sales and customer satisfaction targets. I manage end to end sales operations and serve as Google representative for our vendor partner liaising with internal Google stakeholders. \n \nI own, drive and monitor our partner in the region on sales metrics and service level agreements. When I am not busy drilling data or trying to make it look beautiful, I spend time coaching the vendor sales team and working on strategic initiatives to drive growth. Operations Lead - SMB Sales, India Google August 2011  –  June 2014  (2 years 11 months) Hyderabad Area, India Drive small business acquisitions at scale for Google AdWords in India through outsourced operations.  \n \nI managed one of our two vendors in India, a team of ~40 sales representatives responsible for acquiring new advertisers and meeting revenue targets through various marketing and non-marketing channels.  \n \nWorked closely with our marketing team on Google Partners program, managing events, and monitoring several co-marketing partners on SLAs. Delivered sales coaching to the team on ground and lead the quarterly business reviews with our vendor in South India. Account Associate Google July 2009  –  July 2011  (2 years 1 month) Hyderabad Area, India Owned workflow management for the email support team with goals to meet service level agreements for 17 email queues. Lead daily planning around staffing and volumes, and weekly market reviews.  \n \nContributed 50% time on key initiative to increase CSAT and volunteered to be part of pilot team for phone follow-up to customer queries.  \n \nAlso worked on developing reporting for key stakeholders and strategic projects around \"sales as service\" Account Planner Google July 2008  –  June 2009  (1 year) Hyderabad Area, India As part of the large client services team I provided AdWords account intelligence, analysis, and research to clients in NA to meet and exceed revenue targets. \n \n- Worked on building overall SEM strategy for clients. \n- Recommend actionable next steps to advertisers based on analysis and reports. \n- Made early interventions for negative trends such as declining conversion rates and took corrective measures. \n- Provided consultation and advice to advertisers and marketing managers. \n- Investigated issues that are not obvious and designed possible solutions. AdWords Representative Google July 2007  –  June 2008  (1 year) Hyderabad Area, India Started my exciting journey at Google working on reviewing multiple ad formats to ensure adherence to AdWords policies. I then moved on to the customer support team, as a CSR I responded to advertiser queries over email.  \n \nContributed 20% time as part time optimizer working on advertiser accounts to improve performance. Associate GENPACT LLC July 2005  –  June 2007  (2 years) Hyderabad Area, India Worked as backend credit research executive for one of the largest logistics and truck leasing company in US. SMB Acquisition Manager Google May 2015  – Present (4 months) Kuala Lumpur, Malaysia SMB Acquisition Manager Google May 2015  – Present (4 months) Kuala Lumpur, Malaysia Operations Lead - SMB Sales, SEA Google July 2014  – Present (1 year 2 months) Kuala Lumpur, Malaysia Driving SMB customer acquisitions through our outsourcing partners to exceed sales and customer satisfaction targets. I manage end to end sales operations and serve as Google representative for our vendor partner liaising with internal Google stakeholders. \n \nI own, drive and monitor our partner in the region on sales metrics and service level agreements. When I am not busy drilling data or trying to make it look beautiful, I spend time coaching the vendor sales team and working on strategic initiatives to drive growth. Operations Lead - SMB Sales, SEA Google July 2014  – Present (1 year 2 months) Kuala Lumpur, Malaysia Driving SMB customer acquisitions through our outsourcing partners to exceed sales and customer satisfaction targets. I manage end to end sales operations and serve as Google representative for our vendor partner liaising with internal Google stakeholders. \n \nI own, drive and monitor our partner in the region on sales metrics and service level agreements. When I am not busy drilling data or trying to make it look beautiful, I spend time coaching the vendor sales team and working on strategic initiatives to drive growth. Operations Lead - SMB Sales, India Google August 2011  –  June 2014  (2 years 11 months) Hyderabad Area, India Drive small business acquisitions at scale for Google AdWords in India through outsourced operations.  \n \nI managed one of our two vendors in India, a team of ~40 sales representatives responsible for acquiring new advertisers and meeting revenue targets through various marketing and non-marketing channels.  \n \nWorked closely with our marketing team on Google Partners program, managing events, and monitoring several co-marketing partners on SLAs. Delivered sales coaching to the team on ground and lead the quarterly business reviews with our vendor in South India. Operations Lead - SMB Sales, India Google August 2011  –  June 2014  (2 years 11 months) Hyderabad Area, India Drive small business acquisitions at scale for Google AdWords in India through outsourced operations.  \n \nI managed one of our two vendors in India, a team of ~40 sales representatives responsible for acquiring new advertisers and meeting revenue targets through various marketing and non-marketing channels.  \n \nWorked closely with our marketing team on Google Partners program, managing events, and monitoring several co-marketing partners on SLAs. Delivered sales coaching to the team on ground and lead the quarterly business reviews with our vendor in South India. Account Associate Google July 2009  –  July 2011  (2 years 1 month) Hyderabad Area, India Owned workflow management for the email support team with goals to meet service level agreements for 17 email queues. Lead daily planning around staffing and volumes, and weekly market reviews.  \n \nContributed 50% time on key initiative to increase CSAT and volunteered to be part of pilot team for phone follow-up to customer queries.  \n \nAlso worked on developing reporting for key stakeholders and strategic projects around \"sales as service\" Account Associate Google July 2009  –  July 2011  (2 years 1 month) Hyderabad Area, India Owned workflow management for the email support team with goals to meet service level agreements for 17 email queues. Lead daily planning around staffing and volumes, and weekly market reviews.  \n \nContributed 50% time on key initiative to increase CSAT and volunteered to be part of pilot team for phone follow-up to customer queries.  \n \nAlso worked on developing reporting for key stakeholders and strategic projects around \"sales as service\" Account Planner Google July 2008  –  June 2009  (1 year) Hyderabad Area, India As part of the large client services team I provided AdWords account intelligence, analysis, and research to clients in NA to meet and exceed revenue targets. \n \n- Worked on building overall SEM strategy for clients. \n- Recommend actionable next steps to advertisers based on analysis and reports. \n- Made early interventions for negative trends such as declining conversion rates and took corrective measures. \n- Provided consultation and advice to advertisers and marketing managers. \n- Investigated issues that are not obvious and designed possible solutions. Account Planner Google July 2008  –  June 2009  (1 year) Hyderabad Area, India As part of the large client services team I provided AdWords account intelligence, analysis, and research to clients in NA to meet and exceed revenue targets. \n \n- Worked on building overall SEM strategy for clients. \n- Recommend actionable next steps to advertisers based on analysis and reports. \n- Made early interventions for negative trends such as declining conversion rates and took corrective measures. \n- Provided consultation and advice to advertisers and marketing managers. \n- Investigated issues that are not obvious and designed possible solutions. AdWords Representative Google July 2007  –  June 2008  (1 year) Hyderabad Area, India Started my exciting journey at Google working on reviewing multiple ad formats to ensure adherence to AdWords policies. I then moved on to the customer support team, as a CSR I responded to advertiser queries over email.  \n \nContributed 20% time as part time optimizer working on advertiser accounts to improve performance. AdWords Representative Google July 2007  –  June 2008  (1 year) Hyderabad Area, India Started my exciting journey at Google working on reviewing multiple ad formats to ensure adherence to AdWords policies. I then moved on to the customer support team, as a CSR I responded to advertiser queries over email.  \n \nContributed 20% time as part time optimizer working on advertiser accounts to improve performance. Associate GENPACT LLC July 2005  –  June 2007  (2 years) Hyderabad Area, India Worked as backend credit research executive for one of the largest logistics and truck leasing company in US. Associate GENPACT LLC July 2005  –  June 2007  (2 years) Hyderabad Area, India Worked as backend credit research executive for one of the largest logistics and truck leasing company in US. Languages English Full professional proficiency Hindi Full professional proficiency Telugu Elementary proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Elementary proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Elementary proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Google Adwords Online Advertising Account Management Team Management Sales Operations Management Vendor Management Outsourcing SEM Online Marketing E-commerce Google Analytics Advertising Skills  Google Adwords Online Advertising Account Management Team Management Sales Operations Management Vendor Management Outsourcing SEM Online Marketing E-commerce Google Analytics Advertising Google Adwords Online Advertising Account Management Team Management Sales Operations Management Vendor Management Outsourcing SEM Online Marketing E-commerce Google Analytics Advertising Google Adwords Online Advertising Account Management Team Management Sales Operations Management Vendor Management Outsourcing SEM Online Marketing E-commerce Google Analytics Advertising Education Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Honors & Awards Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Platinum Award As part of the APAC SMB sales team.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Platinum Award As part of the APAC SMB sales team.  Platinum Award As part of the APAC SMB sales team.  Platinum Award As part of the APAC SMB sales team.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  ", "Summary Dipanjan is a business leader with over a decade of diverse experience in Sales, Business Development, Marketing, and General Management across different APAC markets. \n \nIn recent years, Dipanjan has been focussed on enabling clients to build their businesses and brands online. He has led teams through hyper-growth situations, built business from the ground up and has a proven track record in achieving stretch targets. \n \nPassionate about coaching, nurturing talent, and building teams, Dipanjan is known for his collaborative work-style, innovative problem solving and team-first orientation. He drives with vision, develops people and has consistently delivered sustained business results. \n \nSpecialties: business development, general management, sales & marketing, ​coaching, talent retention. Summary Dipanjan is a business leader with over a decade of diverse experience in Sales, Business Development, Marketing, and General Management across different APAC markets. \n \nIn recent years, Dipanjan has been focussed on enabling clients to build their businesses and brands online. He has led teams through hyper-growth situations, built business from the ground up and has a proven track record in achieving stretch targets. \n \nPassionate about coaching, nurturing talent, and building teams, Dipanjan is known for his collaborative work-style, innovative problem solving and team-first orientation. He drives with vision, develops people and has consistently delivered sustained business results. \n \nSpecialties: business development, general management, sales & marketing, ​coaching, talent retention. Dipanjan is a business leader with over a decade of diverse experience in Sales, Business Development, Marketing, and General Management across different APAC markets. \n \nIn recent years, Dipanjan has been focussed on enabling clients to build their businesses and brands online. He has led teams through hyper-growth situations, built business from the ground up and has a proven track record in achieving stretch targets. \n \nPassionate about coaching, nurturing talent, and building teams, Dipanjan is known for his collaborative work-style, innovative problem solving and team-first orientation. He drives with vision, develops people and has consistently delivered sustained business results. \n \nSpecialties: business development, general management, sales & marketing, ​coaching, talent retention. Dipanjan is a business leader with over a decade of diverse experience in Sales, Business Development, Marketing, and General Management across different APAC markets. \n \nIn recent years, Dipanjan has been focussed on enabling clients to build their businesses and brands online. He has led teams through hyper-growth situations, built business from the ground up and has a proven track record in achieving stretch targets. \n \nPassionate about coaching, nurturing talent, and building teams, Dipanjan is known for his collaborative work-style, innovative problem solving and team-first orientation. He drives with vision, develops people and has consistently delivered sustained business results. \n \nSpecialties: business development, general management, sales & marketing, ​coaching, talent retention. Experience Regional Head - New Business Sales, Southeast Asia Google July 2014  – Present (1 year 2 months) Head of New Business Sales - Agency, Southeast Asia Google October 2012  – Present (2 years 11 months) Singapore Sr. Business Acquisition Manager - Southeast Asia Google May 2012  –  October 2012  (6 months) Singapore Business Acquisition Manager - Southeast Asia Google January 2010  –  May 2012  (2 years 5 months) Singapore • Established and launched the Inside Sales team to acquire strategic clients in the AUNZ market. \n•\tIdentify, structure, negotiate and close large, strategic relationships with prospective clients and their marketing services agencies. \n•\tRepresent the company at industry events, which includes describing the benefits of working with Google to advertisers. \n•\tLead research and conduct competitive analysis that helps to determine content categories and vertical strategies.  \n•\tAnalyze data trends and client performance, develop solid strategic sales plans, and prepare and conduct strategic pitches and sales presentations. \n•\tCollaborate and consult with major customers with the goal of extending relationships, increasing client and agency base and optimizing their advertising expenditures. \n•\tDevelop case studies of successful campaigns in order to share insights with customers and serve as an evangelist at targeted events and conferences. \n•\tChampion new product releases, internally and externally. Pod Lead & Senior Account Manager Google January 2009  –  December 2009  (1 year) •\tDeveloping and managing revenue and relationships with direct clients and agencies \n•\tEstablished & managed a 5 person team of Optimization Specialists (SEM) & Account Coordinators to oversee AUNZ’s top spending strategic clients \n•\tManage high-trusted relationships with clients and develop a thorough understanding of their business challenges \n•\tLeverage on this strategic partnership to add value to our advertisers' business and grow their accounts \n•\tOwned the upselling of strategic top accounts. \n•\tReport on sales figures internally and work closely with members of the team to find additional revenue driving opportunities. \n•\tServe as a liaison with clients regarding new product launches and advertising opportunities. \n•\tDrive revenue for Google and be accountable for your account team's quarterly revenue quota. \n•\tManage ongoing client training in all Google AdWords-related tools. Account Manager Google February 2008  –  January 2009  (1 year) •\tManage high-trusted relationships with clients and develop a thorough understanding of their business challenges \n•\tLeverage on this strategic partnership to add value to our advertisers' business and grow their accounts \n•\tOptimize client accounts by analyzing and managing their campaign strategy \n•\tImprove your clients' campaigns performance and return on investment \n•\tDrive revenue for Google and be accountable for your account team's quarterly revenue quota. Account Strategist Google December 2006  –  February 2008  (1 year 3 months) •\tMonitor and analyse online marketing and campaign performance data in order to suggest structural and editorial improvements that will optimise ad campaigns \n•\tControl editorial quality and consult with Clients on campaigns \n•\tLeverage your deep understanding of clients' websites and products to develop creative content for their text ads \n•\tEncourage advertisers to incorporate Google's variety of ROI-oriented ad strategies \n•\tProvide customer training and orientation on Google products such as Google Analytics Account Associate Google December 2005  –  November 2006  (1 year) •\tProvide outstanding client service and sales support to Google's advertisers. \n•\tBuild strong relationships with customers and educate them on new product features. \n•\tCollaborate with Specialists, Engineers and Product team members on new feature development. \n•\tImplement creative ways to improve our client relationships and increase revenue by upselling and promoting other Google products. \n•\tProvide strategic advice and help solve technical issues by working closely in a consultative role with key clients. Copywriter Rediffusion Y&R May 2005  –  November 2005  (7 months) •\tBrainstormed, developed, and implemented a series of creatives for Unilever’s Fair and Lovely brand, to effectively capture market research project results \n•\tCreated all product and brand strategy, creative artwork & advertising communications, to ensure consumer relevance with recommendations made directly to the marketing team \n•\tJointly worked with a production house (Illusion Films, Mumbai) in making of the TV commercial of HP Power petrol (Hindustan Petroleum) Regional Head - New Business Sales, Southeast Asia Google July 2014  – Present (1 year 2 months) Regional Head - New Business Sales, Southeast Asia Google July 2014  – Present (1 year 2 months) Head of New Business Sales - Agency, Southeast Asia Google October 2012  – Present (2 years 11 months) Singapore Head of New Business Sales - Agency, Southeast Asia Google October 2012  – Present (2 years 11 months) Singapore Sr. Business Acquisition Manager - Southeast Asia Google May 2012  –  October 2012  (6 months) Singapore Sr. Business Acquisition Manager - Southeast Asia Google May 2012  –  October 2012  (6 months) Singapore Business Acquisition Manager - Southeast Asia Google January 2010  –  May 2012  (2 years 5 months) Singapore • Established and launched the Inside Sales team to acquire strategic clients in the AUNZ market. \n•\tIdentify, structure, negotiate and close large, strategic relationships with prospective clients and their marketing services agencies. \n•\tRepresent the company at industry events, which includes describing the benefits of working with Google to advertisers. \n•\tLead research and conduct competitive analysis that helps to determine content categories and vertical strategies.  \n•\tAnalyze data trends and client performance, develop solid strategic sales plans, and prepare and conduct strategic pitches and sales presentations. \n•\tCollaborate and consult with major customers with the goal of extending relationships, increasing client and agency base and optimizing their advertising expenditures. \n•\tDevelop case studies of successful campaigns in order to share insights with customers and serve as an evangelist at targeted events and conferences. \n•\tChampion new product releases, internally and externally. Business Acquisition Manager - Southeast Asia Google January 2010  –  May 2012  (2 years 5 months) Singapore • Established and launched the Inside Sales team to acquire strategic clients in the AUNZ market. \n•\tIdentify, structure, negotiate and close large, strategic relationships with prospective clients and their marketing services agencies. \n•\tRepresent the company at industry events, which includes describing the benefits of working with Google to advertisers. \n•\tLead research and conduct competitive analysis that helps to determine content categories and vertical strategies.  \n•\tAnalyze data trends and client performance, develop solid strategic sales plans, and prepare and conduct strategic pitches and sales presentations. \n•\tCollaborate and consult with major customers with the goal of extending relationships, increasing client and agency base and optimizing their advertising expenditures. \n•\tDevelop case studies of successful campaigns in order to share insights with customers and serve as an evangelist at targeted events and conferences. \n•\tChampion new product releases, internally and externally. Pod Lead & Senior Account Manager Google January 2009  –  December 2009  (1 year) •\tDeveloping and managing revenue and relationships with direct clients and agencies \n•\tEstablished & managed a 5 person team of Optimization Specialists (SEM) & Account Coordinators to oversee AUNZ’s top spending strategic clients \n•\tManage high-trusted relationships with clients and develop a thorough understanding of their business challenges \n•\tLeverage on this strategic partnership to add value to our advertisers' business and grow their accounts \n•\tOwned the upselling of strategic top accounts. \n•\tReport on sales figures internally and work closely with members of the team to find additional revenue driving opportunities. \n•\tServe as a liaison with clients regarding new product launches and advertising opportunities. \n•\tDrive revenue for Google and be accountable for your account team's quarterly revenue quota. \n•\tManage ongoing client training in all Google AdWords-related tools. Pod Lead & Senior Account Manager Google January 2009  –  December 2009  (1 year) •\tDeveloping and managing revenue and relationships with direct clients and agencies \n•\tEstablished & managed a 5 person team of Optimization Specialists (SEM) & Account Coordinators to oversee AUNZ’s top spending strategic clients \n•\tManage high-trusted relationships with clients and develop a thorough understanding of their business challenges \n•\tLeverage on this strategic partnership to add value to our advertisers' business and grow their accounts \n•\tOwned the upselling of strategic top accounts. \n•\tReport on sales figures internally and work closely with members of the team to find additional revenue driving opportunities. \n•\tServe as a liaison with clients regarding new product launches and advertising opportunities. \n•\tDrive revenue for Google and be accountable for your account team's quarterly revenue quota. \n•\tManage ongoing client training in all Google AdWords-related tools. Account Manager Google February 2008  –  January 2009  (1 year) •\tManage high-trusted relationships with clients and develop a thorough understanding of their business challenges \n•\tLeverage on this strategic partnership to add value to our advertisers' business and grow their accounts \n•\tOptimize client accounts by analyzing and managing their campaign strategy \n•\tImprove your clients' campaigns performance and return on investment \n•\tDrive revenue for Google and be accountable for your account team's quarterly revenue quota. Account Manager Google February 2008  –  January 2009  (1 year) •\tManage high-trusted relationships with clients and develop a thorough understanding of their business challenges \n•\tLeverage on this strategic partnership to add value to our advertisers' business and grow their accounts \n•\tOptimize client accounts by analyzing and managing their campaign strategy \n•\tImprove your clients' campaigns performance and return on investment \n•\tDrive revenue for Google and be accountable for your account team's quarterly revenue quota. Account Strategist Google December 2006  –  February 2008  (1 year 3 months) •\tMonitor and analyse online marketing and campaign performance data in order to suggest structural and editorial improvements that will optimise ad campaigns \n•\tControl editorial quality and consult with Clients on campaigns \n•\tLeverage your deep understanding of clients' websites and products to develop creative content for their text ads \n•\tEncourage advertisers to incorporate Google's variety of ROI-oriented ad strategies \n•\tProvide customer training and orientation on Google products such as Google Analytics Account Strategist Google December 2006  –  February 2008  (1 year 3 months) •\tMonitor and analyse online marketing and campaign performance data in order to suggest structural and editorial improvements that will optimise ad campaigns \n•\tControl editorial quality and consult with Clients on campaigns \n•\tLeverage your deep understanding of clients' websites and products to develop creative content for their text ads \n•\tEncourage advertisers to incorporate Google's variety of ROI-oriented ad strategies \n•\tProvide customer training and orientation on Google products such as Google Analytics Account Associate Google December 2005  –  November 2006  (1 year) •\tProvide outstanding client service and sales support to Google's advertisers. \n•\tBuild strong relationships with customers and educate them on new product features. \n•\tCollaborate with Specialists, Engineers and Product team members on new feature development. \n•\tImplement creative ways to improve our client relationships and increase revenue by upselling and promoting other Google products. \n•\tProvide strategic advice and help solve technical issues by working closely in a consultative role with key clients. Account Associate Google December 2005  –  November 2006  (1 year) •\tProvide outstanding client service and sales support to Google's advertisers. \n•\tBuild strong relationships with customers and educate them on new product features. \n•\tCollaborate with Specialists, Engineers and Product team members on new feature development. \n•\tImplement creative ways to improve our client relationships and increase revenue by upselling and promoting other Google products. \n•\tProvide strategic advice and help solve technical issues by working closely in a consultative role with key clients. Copywriter Rediffusion Y&R May 2005  –  November 2005  (7 months) •\tBrainstormed, developed, and implemented a series of creatives for Unilever’s Fair and Lovely brand, to effectively capture market research project results \n•\tCreated all product and brand strategy, creative artwork & advertising communications, to ensure consumer relevance with recommendations made directly to the marketing team \n•\tJointly worked with a production house (Illusion Films, Mumbai) in making of the TV commercial of HP Power petrol (Hindustan Petroleum) Copywriter Rediffusion Y&R May 2005  –  November 2005  (7 months) •\tBrainstormed, developed, and implemented a series of creatives for Unilever’s Fair and Lovely brand, to effectively capture market research project results \n•\tCreated all product and brand strategy, creative artwork & advertising communications, to ensure consumer relevance with recommendations made directly to the marketing team \n•\tJointly worked with a production house (Illusion Films, Mumbai) in making of the TV commercial of HP Power petrol (Hindustan Petroleum) Languages English Hindi Bengali English Hindi Bengali English Hindi Bengali Skills SEM Internet Online Marketing Social Media Marketing Performance Display... New Business Development Digital Marketing Sales Online Advertising Advertising Integrated Marketing Strategic Partnerships Marketing Strategy Competitive Analysis Google Analytics Team Leadership Strategy See 2+     See less Skills  SEM Internet Online Marketing Social Media Marketing Performance Display... New Business Development Digital Marketing Sales Online Advertising Advertising Integrated Marketing Strategic Partnerships Marketing Strategy Competitive Analysis Google Analytics Team Leadership Strategy See 2+     See less SEM Internet Online Marketing Social Media Marketing Performance Display... New Business Development Digital Marketing Sales Online Advertising Advertising Integrated Marketing Strategic Partnerships Marketing Strategy Competitive Analysis Google Analytics Team Leadership Strategy See 2+     See less SEM Internet Online Marketing Social Media Marketing Performance Display... New Business Development Digital Marketing Sales Online Advertising Advertising Integrated Marketing Strategic Partnerships Marketing Strategy Competitive Analysis Google Analytics Team Leadership Strategy See 2+     See less Education INSEAD (SG) Executive Program,  Marketing 2011  – 2012 ST. XAVIER'S COLLEGE THE UNIVERSITY OF CALCUTTA Bachelor of Arts,  Mass Communication & Advertising 2002  – 2005 High School ST.XAVIER'S COLLEGIATE SCHOOL 1990  – 2002 INSEAD (SG) Executive Program,  Marketing 2011  – 2012 INSEAD (SG) Executive Program,  Marketing 2011  – 2012 INSEAD (SG) Executive Program,  Marketing 2011  – 2012 ST. XAVIER'S COLLEGE THE UNIVERSITY OF CALCUTTA Bachelor of Arts,  Mass Communication & Advertising 2002  – 2005 ST. XAVIER'S COLLEGE THE UNIVERSITY OF CALCUTTA Bachelor of Arts,  Mass Communication & Advertising 2002  – 2005 ST. XAVIER'S COLLEGE THE UNIVERSITY OF CALCUTTA Bachelor of Arts,  Mass Communication & Advertising 2002  – 2005 High School ST.XAVIER'S COLLEGIATE SCHOOL 1990  – 2002 High School ST.XAVIER'S COLLEGIATE SCHOOL 1990  – 2002 High School ST.XAVIER'S COLLEGIATE SCHOOL 1990  – 2002 Honors & Awards Additional Honors & Awards VP Award, Google Inc. \nGold Award, Google Inc. Additional Honors & Awards VP Award, Google Inc. \nGold Award, Google Inc. Additional Honors & Awards VP Award, Google Inc. \nGold Award, Google Inc. Additional Honors & Awards VP Award, Google Inc. \nGold Award, Google Inc. ", "Experience Finance Operations Analyst II Google October 2012  – Present (2 years 11 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. AdSense Team lead Google October 2010  – Present (4 years 11 months) Specializing in AdSense payments and platform operations AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Finance Operations Analyst II Google October 2012  – Present (2 years 11 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. Finance Operations Analyst II Google October 2012  – Present (2 years 11 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. AdSense Team lead Google October 2010  – Present (4 years 11 months) Specializing in AdSense payments and platform operations AdSense Team lead Google October 2010  – Present (4 years 11 months) Specializing in AdSense payments and platform operations AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Skills Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Skills  Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Education University College Cork MBS,  E-Business and Commerce 2003  – 2005 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 Honors & Awards ", "Summary After obtaining my Undergraduate and Graduate degrees in Advertising from the University of Illinois at Urbana Champaign, I went straight into the exciting world of Online Advertising. What's more exciting? Joining that world as a part of Google. After almost 5 years supporting AdWords, I moved into supporting Google Fiber customers. I am currently the Quality Assurance/Experience Lead for Google Fiber Customer Service. Summary After obtaining my Undergraduate and Graduate degrees in Advertising from the University of Illinois at Urbana Champaign, I went straight into the exciting world of Online Advertising. What's more exciting? Joining that world as a part of Google. After almost 5 years supporting AdWords, I moved into supporting Google Fiber customers. I am currently the Quality Assurance/Experience Lead for Google Fiber Customer Service. After obtaining my Undergraduate and Graduate degrees in Advertising from the University of Illinois at Urbana Champaign, I went straight into the exciting world of Online Advertising. What's more exciting? Joining that world as a part of Google. After almost 5 years supporting AdWords, I moved into supporting Google Fiber customers. I am currently the Quality Assurance/Experience Lead for Google Fiber Customer Service. After obtaining my Undergraduate and Graduate degrees in Advertising from the University of Illinois at Urbana Champaign, I went straight into the exciting world of Online Advertising. What's more exciting? Joining that world as a part of Google. After almost 5 years supporting AdWords, I moved into supporting Google Fiber customers. I am currently the Quality Assurance/Experience Lead for Google Fiber Customer Service. Experience Quality Assurance Manager Google Fiber June 2014  – Present (1 year 3 months) Quality Assurance Lead- Google Fiber Customer Support Google June 2014  – Present (1 year 3 months) - Manage the Quality Assurance and Customer Satisfaction team within the Google Fiber Customer Service Organization. \n- Work with internal and external (vendor) partners to create the best customer experience for our Fiber users across different markets \n- Effectively scale QA programs across multiple channels and markets: contact centers, service centers, installation operations Program Manager for NA Google Places (Google My Business) Support Google November 2013  –  June 2014  (8 months) - Launched and grew a vendor Google Places (Google My Business) Support operation across multiple locations. Team Lead- SMB Services Google June 2013  –  June 2014  (1 year 1 month) - Coach a high-performing team of 13-14 consultants serving Google's AdWords business customers while leading strategic initiatives to drive Global Customer Service forward \n- Quality Lead for North America: Responsible for the management of the NA Quality Team (16 QA agents) including execution of quality assurance process, calibration of assessed agents and coaches and implementation of a coaching process to ensure agent success Vendor Operations Lead Google April 2012  –  June 2013  (1 year 3 months) - Consultant for the vendor team that provides AdWords support to NA SMB AdWords advertisers. Worked on a small team to build strategies and drive initiatives to hit our KPIs (key performance indicators). \n- Launched two sub vendor teams to provide support on specialist projects. Spent 6 weeks in EMEA training and launching an NA support team- continued to support the project remotely for 14 weeks.  \n- Roles within the team: Training Lead, Subject Matter Expert project Coordinator, Chat channel POC, Product/Process Update Communications Lead, Billing Specialist. Account Strategist Google May 2011  –  May 2013  (2 years 1 month) - Continued to provide world class customer service/ technical troubleshooting for SMB AdWords advertisered \n- CSAT (Customer Satisfaction) Team Captain: Prepared weekly and monthly CSat Updates across all segments for the team and management. Global POC of NA CSat data and efforts. Led CSAT deep dive process to analyze pain points and increase CSAT for the NA market and globally. Account Associate Google November 2009  –  May 2011  (1 year 7 months) Ann Arbor, MI AdWords Support for SMB Advertisers \n- Provided customer support and technical troubleshooting via multiple channels for the small & medium business segment of AdWords advertisers. Investigated with specialist teams if necessary and maintained a high level of efficiency and customer satisfaction. Overall goal of helping SMBs increase their online presence and ROI via AdWords and additional products while providing world class customer service.  \n- Certified Google Trainer- Trained over 15 new hire classes on Google products and team workflow.  \n- Quality Team: Reviewed 200+ calls to ensure our team was delivering high quality customer service. Coached between 6 and 10 team members each quarter to meet quality goals and reach peak performance Quality Assurance Manager Google Fiber June 2014  – Present (1 year 3 months) Quality Assurance Manager Google Fiber June 2014  – Present (1 year 3 months) Quality Assurance Lead- Google Fiber Customer Support Google June 2014  – Present (1 year 3 months) - Manage the Quality Assurance and Customer Satisfaction team within the Google Fiber Customer Service Organization. \n- Work with internal and external (vendor) partners to create the best customer experience for our Fiber users across different markets \n- Effectively scale QA programs across multiple channels and markets: contact centers, service centers, installation operations Quality Assurance Lead- Google Fiber Customer Support Google June 2014  – Present (1 year 3 months) - Manage the Quality Assurance and Customer Satisfaction team within the Google Fiber Customer Service Organization. \n- Work with internal and external (vendor) partners to create the best customer experience for our Fiber users across different markets \n- Effectively scale QA programs across multiple channels and markets: contact centers, service centers, installation operations Program Manager for NA Google Places (Google My Business) Support Google November 2013  –  June 2014  (8 months) - Launched and grew a vendor Google Places (Google My Business) Support operation across multiple locations. Program Manager for NA Google Places (Google My Business) Support Google November 2013  –  June 2014  (8 months) - Launched and grew a vendor Google Places (Google My Business) Support operation across multiple locations. Team Lead- SMB Services Google June 2013  –  June 2014  (1 year 1 month) - Coach a high-performing team of 13-14 consultants serving Google's AdWords business customers while leading strategic initiatives to drive Global Customer Service forward \n- Quality Lead for North America: Responsible for the management of the NA Quality Team (16 QA agents) including execution of quality assurance process, calibration of assessed agents and coaches and implementation of a coaching process to ensure agent success Team Lead- SMB Services Google June 2013  –  June 2014  (1 year 1 month) - Coach a high-performing team of 13-14 consultants serving Google's AdWords business customers while leading strategic initiatives to drive Global Customer Service forward \n- Quality Lead for North America: Responsible for the management of the NA Quality Team (16 QA agents) including execution of quality assurance process, calibration of assessed agents and coaches and implementation of a coaching process to ensure agent success Vendor Operations Lead Google April 2012  –  June 2013  (1 year 3 months) - Consultant for the vendor team that provides AdWords support to NA SMB AdWords advertisers. Worked on a small team to build strategies and drive initiatives to hit our KPIs (key performance indicators). \n- Launched two sub vendor teams to provide support on specialist projects. Spent 6 weeks in EMEA training and launching an NA support team- continued to support the project remotely for 14 weeks.  \n- Roles within the team: Training Lead, Subject Matter Expert project Coordinator, Chat channel POC, Product/Process Update Communications Lead, Billing Specialist. Vendor Operations Lead Google April 2012  –  June 2013  (1 year 3 months) - Consultant for the vendor team that provides AdWords support to NA SMB AdWords advertisers. Worked on a small team to build strategies and drive initiatives to hit our KPIs (key performance indicators). \n- Launched two sub vendor teams to provide support on specialist projects. Spent 6 weeks in EMEA training and launching an NA support team- continued to support the project remotely for 14 weeks.  \n- Roles within the team: Training Lead, Subject Matter Expert project Coordinator, Chat channel POC, Product/Process Update Communications Lead, Billing Specialist. Account Strategist Google May 2011  –  May 2013  (2 years 1 month) - Continued to provide world class customer service/ technical troubleshooting for SMB AdWords advertisered \n- CSAT (Customer Satisfaction) Team Captain: Prepared weekly and monthly CSat Updates across all segments for the team and management. Global POC of NA CSat data and efforts. Led CSAT deep dive process to analyze pain points and increase CSAT for the NA market and globally. Account Strategist Google May 2011  –  May 2013  (2 years 1 month) - Continued to provide world class customer service/ technical troubleshooting for SMB AdWords advertisered \n- CSAT (Customer Satisfaction) Team Captain: Prepared weekly and monthly CSat Updates across all segments for the team and management. Global POC of NA CSat data and efforts. Led CSAT deep dive process to analyze pain points and increase CSAT for the NA market and globally. Account Associate Google November 2009  –  May 2011  (1 year 7 months) Ann Arbor, MI AdWords Support for SMB Advertisers \n- Provided customer support and technical troubleshooting via multiple channels for the small & medium business segment of AdWords advertisers. Investigated with specialist teams if necessary and maintained a high level of efficiency and customer satisfaction. Overall goal of helping SMBs increase their online presence and ROI via AdWords and additional products while providing world class customer service.  \n- Certified Google Trainer- Trained over 15 new hire classes on Google products and team workflow.  \n- Quality Team: Reviewed 200+ calls to ensure our team was delivering high quality customer service. Coached between 6 and 10 team members each quarter to meet quality goals and reach peak performance Account Associate Google November 2009  –  May 2011  (1 year 7 months) Ann Arbor, MI AdWords Support for SMB Advertisers \n- Provided customer support and technical troubleshooting via multiple channels for the small & medium business segment of AdWords advertisers. Investigated with specialist teams if necessary and maintained a high level of efficiency and customer satisfaction. Overall goal of helping SMBs increase their online presence and ROI via AdWords and additional products while providing world class customer service.  \n- Certified Google Trainer- Trained over 15 new hire classes on Google products and team workflow.  \n- Quality Team: Reviewed 200+ calls to ensure our team was delivering high quality customer service. Coached between 6 and 10 team members each quarter to meet quality goals and reach peak performance Languages   Skills PPC Google Analytics Google Adwords Online Advertising SEM Management Search Advertising Display Advertising Mobile Marketing Mobile Advertising Advertising Digital Marketing Digital Strategy Web Analytics DoubleClick Social Media Marketing Social Media See 2+     See less Skills  PPC Google Analytics Google Adwords Online Advertising SEM Management Search Advertising Display Advertising Mobile Marketing Mobile Advertising Advertising Digital Marketing Digital Strategy Web Analytics DoubleClick Social Media Marketing Social Media See 2+     See less PPC Google Analytics Google Adwords Online Advertising SEM Management Search Advertising Display Advertising Mobile Marketing Mobile Advertising Advertising Digital Marketing Digital Strategy Web Analytics DoubleClick Social Media Marketing Social Media See 2+     See less PPC Google Analytics Google Adwords Online Advertising SEM Management Search Advertising Display Advertising Mobile Marketing Mobile Advertising Advertising Digital Marketing Digital Strategy Web Analytics DoubleClick Social Media Marketing Social Media See 2+     See less Education University of Illinois at Urbana-Champaign Master's of Science,  Advertising 2008  – 2009 University of Illinois at Urbana-Champaign Bachelor's of Science,  Advertising 2004  – 2008 University of Illinois at Urbana-Champaign Master's of Science,  Advertising 2008  – 2009 University of Illinois at Urbana-Champaign Master's of Science,  Advertising 2008  – 2009 University of Illinois at Urbana-Champaign Master's of Science,  Advertising 2008  – 2009 University of Illinois at Urbana-Champaign Bachelor's of Science,  Advertising 2004  – 2008 University of Illinois at Urbana-Champaign Bachelor's of Science,  Advertising 2004  – 2008 University of Illinois at Urbana-Champaign Bachelor's of Science,  Advertising 2004  – 2008 Honors & Awards Additional Honors & Awards Kappa Tau Alpha- Recognizes academic excellence \nAlpha Delta Sigma- American Advertising Federation Honor Society \nUniversity of Illinois Undergraduate Dean's List: 5 semesters out of 8 \nIllinois State Scholar: Awarded to top 5% of high school students in the state Additional Honors & Awards Kappa Tau Alpha- Recognizes academic excellence \nAlpha Delta Sigma- American Advertising Federation Honor Society \nUniversity of Illinois Undergraduate Dean's List: 5 semesters out of 8 \nIllinois State Scholar: Awarded to top 5% of high school students in the state Additional Honors & Awards Kappa Tau Alpha- Recognizes academic excellence \nAlpha Delta Sigma- American Advertising Federation Honor Society \nUniversity of Illinois Undergraduate Dean's List: 5 semesters out of 8 \nIllinois State Scholar: Awarded to top 5% of high school students in the state Additional Honors & Awards Kappa Tau Alpha- Recognizes academic excellence \nAlpha Delta Sigma- American Advertising Federation Honor Society \nUniversity of Illinois Undergraduate Dean's List: 5 semesters out of 8 \nIllinois State Scholar: Awarded to top 5% of high school students in the state ", "Experience Strategy & Business Operations Manager for gTech Ads Google July 2014  – Present (1 year 2 months) Business Intelligence and Scaling Solutions, Google Technical Services Google June 2013  – Present (2 years 3 months) Greater New York City Area Program Manager - Media Services Google April 2011  – Present (4 years 5 months) Delivering management consulting solutions to senior management and 150+ members of global Media Services team; driving the vision, strategy, and execution (product, tools, processes) of a Rich Media Enterprise Architecture to transform and scale Rich Media operations. Flash Developer - DoubleClick Rich Media Google June 2009  –  March 2011  (1 year 10 months) Worked with top media agencies and creative shops to develop custom Rich Media creative creative executions; redefined developer role to provide scaled support for 2000+ client base. AdWords Account Associate Google December 2007  –  June 2009  (1 year 7 months) Recognized potential for and launched Display Ad Builder use for AdWords small business client segment. Volunteer Peace Corps 2005  –  2007  (2 years) Taught English at the Shota Rustaveli Secondary School in Rustavi, Georgia. Worked with three counterparts to promote new methods of teaching. Created after-school programs focusing on women's social and health issues.  \n \nAssociate director of ECO-Project, a Georgian national youth leadership and environmental awareness project. Created after-school ecology program for Rustavi youth. Organized 5 regional sleep-away camps for Georgian youths, age 11-17, to explore enjoy nature & ecology. Strategy & Business Operations Manager for gTech Ads Google July 2014  – Present (1 year 2 months) Strategy & Business Operations Manager for gTech Ads Google July 2014  – Present (1 year 2 months) Business Intelligence and Scaling Solutions, Google Technical Services Google June 2013  – Present (2 years 3 months) Greater New York City Area Business Intelligence and Scaling Solutions, Google Technical Services Google June 2013  – Present (2 years 3 months) Greater New York City Area Program Manager - Media Services Google April 2011  – Present (4 years 5 months) Delivering management consulting solutions to senior management and 150+ members of global Media Services team; driving the vision, strategy, and execution (product, tools, processes) of a Rich Media Enterprise Architecture to transform and scale Rich Media operations. Program Manager - Media Services Google April 2011  – Present (4 years 5 months) Delivering management consulting solutions to senior management and 150+ members of global Media Services team; driving the vision, strategy, and execution (product, tools, processes) of a Rich Media Enterprise Architecture to transform and scale Rich Media operations. Flash Developer - DoubleClick Rich Media Google June 2009  –  March 2011  (1 year 10 months) Worked with top media agencies and creative shops to develop custom Rich Media creative creative executions; redefined developer role to provide scaled support for 2000+ client base. Flash Developer - DoubleClick Rich Media Google June 2009  –  March 2011  (1 year 10 months) Worked with top media agencies and creative shops to develop custom Rich Media creative creative executions; redefined developer role to provide scaled support for 2000+ client base. AdWords Account Associate Google December 2007  –  June 2009  (1 year 7 months) Recognized potential for and launched Display Ad Builder use for AdWords small business client segment. AdWords Account Associate Google December 2007  –  June 2009  (1 year 7 months) Recognized potential for and launched Display Ad Builder use for AdWords small business client segment. Volunteer Peace Corps 2005  –  2007  (2 years) Taught English at the Shota Rustaveli Secondary School in Rustavi, Georgia. Worked with three counterparts to promote new methods of teaching. Created after-school programs focusing on women's social and health issues.  \n \nAssociate director of ECO-Project, a Georgian national youth leadership and environmental awareness project. Created after-school ecology program for Rustavi youth. Organized 5 regional sleep-away camps for Georgian youths, age 11-17, to explore enjoy nature & ecology. Volunteer Peace Corps 2005  –  2007  (2 years) Taught English at the Shota Rustaveli Secondary School in Rustavi, Georgia. Worked with three counterparts to promote new methods of teaching. Created after-school programs focusing on women's social and health issues.  \n \nAssociate director of ECO-Project, a Georgian national youth leadership and environmental awareness project. Created after-school ecology program for Rustavi youth. Organized 5 regional sleep-away camps for Georgian youths, age 11-17, to explore enjoy nature & ecology. Skills Google Adwords Project Management Advertising Strategy Display Advertising DoubleClick Online Advertising Vendor Management Rich Media Digital Marketing Product Development Management Consulting Sales Skills  Google Adwords Project Management Advertising Strategy Display Advertising DoubleClick Online Advertising Vendor Management Rich Media Digital Marketing Product Development Management Consulting Sales Google Adwords Project Management Advertising Strategy Display Advertising DoubleClick Online Advertising Vendor Management Rich Media Digital Marketing Product Development Management Consulting Sales Google Adwords Project Management Advertising Strategy Display Advertising DoubleClick Online Advertising Vendor Management Rich Media Digital Marketing Product Development Management Consulting Sales Education Columbia Business School Master of Business Administration (MBA) 2013  – 2014 Denison University BA,  History ,  Studio Art 2001  – 2005 Activities and Societies:  Magna Cum Laude Columbia Business School Master of Business Administration (MBA) 2013  – 2014 Columbia Business School Master of Business Administration (MBA) 2013  – 2014 Columbia Business School Master of Business Administration (MBA) 2013  – 2014 Denison University BA,  History ,  Studio Art 2001  – 2005 Activities and Societies:  Magna Cum Laude Denison University BA,  History ,  Studio Art 2001  – 2005 Activities and Societies:  Magna Cum Laude Denison University BA,  History ,  Studio Art 2001  – 2005 Activities and Societies:  Magna Cum Laude ", "Experience Product Specialist - Brand Measurement Google February 2015  – Present (7 months) San Francisco Bay Area New Product Specialist Google October 2012  – Present (2 years 11 months) San Francisco Bay Area Scoping and launching new products in North America.  \nProjects include: Enhanced Campaigns and Google Preferred launches Account Manager, Google TV Ads Google January 2012  –  October 2012  (10 months) San Francisco Bay Area -Account manager for Google TV Ads customers in the Education, Classifieds and Local Services & Government Verticals, representing ~18% of Google TV Ads revenue. Visiting Ads Program Manager- TangoZebra Creative Services Google April 2012  –  June 2012  (3 months) London, United Kingdom Project Manager for Google's Creative Team ('The Zoo'). Worked cross-functionally with Sales, Design & Brand Planners to deliver creative briefs showcasing Google & Youtube's creative capabilities. Account Executive YouTube January 2011  –  February 2012  (1 year 2 months) San Francisco Bay Area -Drove YouTube Sales Strategy for 3 Verticals: Local, Travel, and Financial Services, representing approx 20% of YouTube Revenue for Online Sales. Senior Account Strategist, AdWords, National Agency Team Google August 2008  –  December 2010  (2 years 5 months) Cambridge, MA Account Associate, AdWords Google August 2007  –  August 2008  (1 year 1 month) Cambridge, MA Product Specialist - Brand Measurement Google February 2015  – Present (7 months) San Francisco Bay Area Product Specialist - Brand Measurement Google February 2015  – Present (7 months) San Francisco Bay Area New Product Specialist Google October 2012  – Present (2 years 11 months) San Francisco Bay Area Scoping and launching new products in North America.  \nProjects include: Enhanced Campaigns and Google Preferred launches New Product Specialist Google October 2012  – Present (2 years 11 months) San Francisco Bay Area Scoping and launching new products in North America.  \nProjects include: Enhanced Campaigns and Google Preferred launches Account Manager, Google TV Ads Google January 2012  –  October 2012  (10 months) San Francisco Bay Area -Account manager for Google TV Ads customers in the Education, Classifieds and Local Services & Government Verticals, representing ~18% of Google TV Ads revenue. Account Manager, Google TV Ads Google January 2012  –  October 2012  (10 months) San Francisco Bay Area -Account manager for Google TV Ads customers in the Education, Classifieds and Local Services & Government Verticals, representing ~18% of Google TV Ads revenue. Visiting Ads Program Manager- TangoZebra Creative Services Google April 2012  –  June 2012  (3 months) London, United Kingdom Project Manager for Google's Creative Team ('The Zoo'). Worked cross-functionally with Sales, Design & Brand Planners to deliver creative briefs showcasing Google & Youtube's creative capabilities. Visiting Ads Program Manager- TangoZebra Creative Services Google April 2012  –  June 2012  (3 months) London, United Kingdom Project Manager for Google's Creative Team ('The Zoo'). Worked cross-functionally with Sales, Design & Brand Planners to deliver creative briefs showcasing Google & Youtube's creative capabilities. Account Executive YouTube January 2011  –  February 2012  (1 year 2 months) San Francisco Bay Area -Drove YouTube Sales Strategy for 3 Verticals: Local, Travel, and Financial Services, representing approx 20% of YouTube Revenue for Online Sales. Account Executive YouTube January 2011  –  February 2012  (1 year 2 months) San Francisco Bay Area -Drove YouTube Sales Strategy for 3 Verticals: Local, Travel, and Financial Services, representing approx 20% of YouTube Revenue for Online Sales. Senior Account Strategist, AdWords, National Agency Team Google August 2008  –  December 2010  (2 years 5 months) Cambridge, MA Senior Account Strategist, AdWords, National Agency Team Google August 2008  –  December 2010  (2 years 5 months) Cambridge, MA Account Associate, AdWords Google August 2007  –  August 2008  (1 year 1 month) Cambridge, MA Account Associate, AdWords Google August 2007  –  August 2008  (1 year 1 month) Cambridge, MA Skills Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Skills  Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Education Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 ", "Summary Quick-thinking and innovative, with an ability to learn on the fly, work with cross functional teams, and execute with speed, while delivering high quality outcomes.  \n \nNew ideas excite me, I'm passionate about the detail behind the execution, and ensuring highly durable results.  \n \nAt Google, I've proven abilities of demonstrating leadership by delivering on large projects when working with cross-functional and global teams.  \n \nExtremely interested in consumer technology and sports. Summary Quick-thinking and innovative, with an ability to learn on the fly, work with cross functional teams, and execute with speed, while delivering high quality outcomes.  \n \nNew ideas excite me, I'm passionate about the detail behind the execution, and ensuring highly durable results.  \n \nAt Google, I've proven abilities of demonstrating leadership by delivering on large projects when working with cross-functional and global teams.  \n \nExtremely interested in consumer technology and sports. Quick-thinking and innovative, with an ability to learn on the fly, work with cross functional teams, and execute with speed, while delivering high quality outcomes.  \n \nNew ideas excite me, I'm passionate about the detail behind the execution, and ensuring highly durable results.  \n \nAt Google, I've proven abilities of demonstrating leadership by delivering on large projects when working with cross-functional and global teams.  \n \nExtremely interested in consumer technology and sports. Quick-thinking and innovative, with an ability to learn on the fly, work with cross functional teams, and execute with speed, while delivering high quality outcomes.  \n \nNew ideas excite me, I'm passionate about the detail behind the execution, and ensuring highly durable results.  \n \nAt Google, I've proven abilities of demonstrating leadership by delivering on large projects when working with cross-functional and global teams.  \n \nExtremely interested in consumer technology and sports. Experience Account Associate Google November 2012  – Present (2 years 10 months) Gurgaon, India - Workflow Management - Setting and following through on Internal processes at Google \n- Designed and delivered training for internal and external tools at Google  \n- Worked on Business Intelligence Projects to set up new products and innovations \n- Lead Sales Support Across South East Asia Sales Teams Account Associate Google March 2013  –  July 2013  (5 months) Mountain View As the Ambassador to Mountain View, I helped expand the scope of our work by delivering consistently great performance and driving adoption in North America. Advertising Mogae Media October 2011  –  November 2012  (1 year 2 months) Gurgaon, India - Joined Mogae Media in its infancy and created a brand new advertising platform called the ‘Recharge Rewards Program’ for Airtel in its fresh approach to delights their customers through rewards and special offers  \n \n- Successfully initiated and closed special deals from national brands like PVR Cinemas, Domino’s Pizza and Café Coffee Day  \n \n-Developing new projects for Airtel that involve implementing pioneering technology in location based advertising that had never been achieved in India yet Analyst Standard Chartered Bank August 2010  –  October 2011  (1 year 3 months) Gurgaon, India - Managed portfolios of high net worth individuals by advising allocation of funds in mutual funds and bank deposits \n \n- Built long-term relationships with clients to strengthen partnerships with the Bank by providing a high level of service Account Associate Google November 2012  – Present (2 years 10 months) Gurgaon, India - Workflow Management - Setting and following through on Internal processes at Google \n- Designed and delivered training for internal and external tools at Google  \n- Worked on Business Intelligence Projects to set up new products and innovations \n- Lead Sales Support Across South East Asia Sales Teams Account Associate Google November 2012  – Present (2 years 10 months) Gurgaon, India - Workflow Management - Setting and following through on Internal processes at Google \n- Designed and delivered training for internal and external tools at Google  \n- Worked on Business Intelligence Projects to set up new products and innovations \n- Lead Sales Support Across South East Asia Sales Teams Account Associate Google March 2013  –  July 2013  (5 months) Mountain View As the Ambassador to Mountain View, I helped expand the scope of our work by delivering consistently great performance and driving adoption in North America. Account Associate Google March 2013  –  July 2013  (5 months) Mountain View As the Ambassador to Mountain View, I helped expand the scope of our work by delivering consistently great performance and driving adoption in North America. Advertising Mogae Media October 2011  –  November 2012  (1 year 2 months) Gurgaon, India - Joined Mogae Media in its infancy and created a brand new advertising platform called the ‘Recharge Rewards Program’ for Airtel in its fresh approach to delights their customers through rewards and special offers  \n \n- Successfully initiated and closed special deals from national brands like PVR Cinemas, Domino’s Pizza and Café Coffee Day  \n \n-Developing new projects for Airtel that involve implementing pioneering technology in location based advertising that had never been achieved in India yet Advertising Mogae Media October 2011  –  November 2012  (1 year 2 months) Gurgaon, India - Joined Mogae Media in its infancy and created a brand new advertising platform called the ‘Recharge Rewards Program’ for Airtel in its fresh approach to delights their customers through rewards and special offers  \n \n- Successfully initiated and closed special deals from national brands like PVR Cinemas, Domino’s Pizza and Café Coffee Day  \n \n-Developing new projects for Airtel that involve implementing pioneering technology in location based advertising that had never been achieved in India yet Analyst Standard Chartered Bank August 2010  –  October 2011  (1 year 3 months) Gurgaon, India - Managed portfolios of high net worth individuals by advising allocation of funds in mutual funds and bank deposits \n \n- Built long-term relationships with clients to strengthen partnerships with the Bank by providing a high level of service Analyst Standard Chartered Bank August 2010  –  October 2011  (1 year 3 months) Gurgaon, India - Managed portfolios of high net worth individuals by advising allocation of funds in mutual funds and bank deposits \n \n- Built long-term relationships with clients to strengthen partnerships with the Bank by providing a high level of service Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Online Advertising Digital Marketing Digital Media Strategy New Business Development Mobile Advertising Workflow Management Business Intelligence... Project Coordination Training & Development Sales Support Tools Google Adwords Team Leadership Media Sales Mobile Devices Competitive Analysis Mobile Marketing See 2+     See less Skills  Online Advertising Digital Marketing Digital Media Strategy New Business Development Mobile Advertising Workflow Management Business Intelligence... Project Coordination Training & Development Sales Support Tools Google Adwords Team Leadership Media Sales Mobile Devices Competitive Analysis Mobile Marketing See 2+     See less Online Advertising Digital Marketing Digital Media Strategy New Business Development Mobile Advertising Workflow Management Business Intelligence... Project Coordination Training & Development Sales Support Tools Google Adwords Team Leadership Media Sales Mobile Devices Competitive Analysis Mobile Marketing See 2+     See less Online Advertising Digital Marketing Digital Media Strategy New Business Development Mobile Advertising Workflow Management Business Intelligence... Project Coordination Training & Development Sales Support Tools Google Adwords Team Leadership Media Sales Mobile Devices Competitive Analysis Mobile Marketing See 2+     See less Education Lancaster University Bachelor of Engineering (B.Eng.),  Electronics and Communications 2006  – 2010 Activities and Societies:  Lancaster University International Investment Society ,  Lancaster University Table Tennis Club ,  Lancaster University Engineering Society ,  Lancaster University Cricket Club ,  Ballroom Dancing\nInternational Business Schools ,  Erasmus Club The Shri Ram School Indian School Certificate 1999  – 2006 Lancaster University Bachelor of Engineering (B.Eng.),  Electronics and Communications 2006  – 2010 Activities and Societies:  Lancaster University International Investment Society ,  Lancaster University Table Tennis Club ,  Lancaster University Engineering Society ,  Lancaster University Cricket Club ,  Ballroom Dancing\nInternational Business Schools ,  Erasmus Club Lancaster University Bachelor of Engineering (B.Eng.),  Electronics and Communications 2006  – 2010 Activities and Societies:  Lancaster University International Investment Society ,  Lancaster University Table Tennis Club ,  Lancaster University Engineering Society ,  Lancaster University Cricket Club ,  Ballroom Dancing\nInternational Business Schools ,  Erasmus Club Lancaster University Bachelor of Engineering (B.Eng.),  Electronics and Communications 2006  – 2010 Activities and Societies:  Lancaster University International Investment Society ,  Lancaster University Table Tennis Club ,  Lancaster University Engineering Society ,  Lancaster University Cricket Club ,  Ballroom Dancing\nInternational Business Schools ,  Erasmus Club The Shri Ram School Indian School Certificate 1999  – 2006 The Shri Ram School Indian School Certificate 1999  – 2006 The Shri Ram School Indian School Certificate 1999  – 2006 ", "Summary Brent Davis is a Senior SEM consultant at Google. He focuses on Online Sales & Marketing in the Life Sciences and Healthcare space. He has expertise in Mobile, Analytics and Search. He also advises Google Ventures portfolio companies. Brent is based out of Google Headquarters in Mountain View, CA. \n \nAt Google, he has helped hundreds of Life Science companies via building and launching sales/marketing initiatives that span Search, Mobile, Display, Video & Social Media. \n \nIn addition to serving as resident Life Science expert, Brent has led numerous workflow-system optimization efforts. He was chosen to travel to Hyderabad, India to revamp and train the India Healthcare Team. Brent also regularly liaises with engineers to increase the velocity of Online Marketing product development. \n \nPrior to joining Google, Brent earned a B.S. with honors in Molecular Biology and then went on to earn a M.S. in Biotechnology Enterprise from the Johns Hopkins University where he graduated with Highest Distinction Honors (GPA: 3.95). Specialties:Life Sciences, Mobile & SEM Analytics Summary Brent Davis is a Senior SEM consultant at Google. He focuses on Online Sales & Marketing in the Life Sciences and Healthcare space. He has expertise in Mobile, Analytics and Search. He also advises Google Ventures portfolio companies. Brent is based out of Google Headquarters in Mountain View, CA. \n \nAt Google, he has helped hundreds of Life Science companies via building and launching sales/marketing initiatives that span Search, Mobile, Display, Video & Social Media. \n \nIn addition to serving as resident Life Science expert, Brent has led numerous workflow-system optimization efforts. He was chosen to travel to Hyderabad, India to revamp and train the India Healthcare Team. Brent also regularly liaises with engineers to increase the velocity of Online Marketing product development. \n \nPrior to joining Google, Brent earned a B.S. with honors in Molecular Biology and then went on to earn a M.S. in Biotechnology Enterprise from the Johns Hopkins University where he graduated with Highest Distinction Honors (GPA: 3.95). Specialties:Life Sciences, Mobile & SEM Analytics Brent Davis is a Senior SEM consultant at Google. He focuses on Online Sales & Marketing in the Life Sciences and Healthcare space. He has expertise in Mobile, Analytics and Search. He also advises Google Ventures portfolio companies. Brent is based out of Google Headquarters in Mountain View, CA. \n \nAt Google, he has helped hundreds of Life Science companies via building and launching sales/marketing initiatives that span Search, Mobile, Display, Video & Social Media. \n \nIn addition to serving as resident Life Science expert, Brent has led numerous workflow-system optimization efforts. He was chosen to travel to Hyderabad, India to revamp and train the India Healthcare Team. Brent also regularly liaises with engineers to increase the velocity of Online Marketing product development. \n \nPrior to joining Google, Brent earned a B.S. with honors in Molecular Biology and then went on to earn a M.S. in Biotechnology Enterprise from the Johns Hopkins University where he graduated with Highest Distinction Honors (GPA: 3.95). Specialties:Life Sciences, Mobile & SEM Analytics Brent Davis is a Senior SEM consultant at Google. He focuses on Online Sales & Marketing in the Life Sciences and Healthcare space. He has expertise in Mobile, Analytics and Search. He also advises Google Ventures portfolio companies. Brent is based out of Google Headquarters in Mountain View, CA. \n \nAt Google, he has helped hundreds of Life Science companies via building and launching sales/marketing initiatives that span Search, Mobile, Display, Video & Social Media. \n \nIn addition to serving as resident Life Science expert, Brent has led numerous workflow-system optimization efforts. He was chosen to travel to Hyderabad, India to revamp and train the India Healthcare Team. Brent also regularly liaises with engineers to increase the velocity of Online Marketing product development. \n \nPrior to joining Google, Brent earned a B.S. with honors in Molecular Biology and then went on to earn a M.S. in Biotechnology Enterprise from the Johns Hopkins University where he graduated with Highest Distinction Honors (GPA: 3.95). Specialties:Life Sciences, Mobile & SEM Analytics Experience Account Executive Google October 2014  – Present (11 months) San Francisco Bay Area -Responsible for leading sales team across Health Services vertical in driving integrated, cross-platform sales & marketing campaigns for our customers \n-Primary role is to grow drive and grow new business with Google's top advertisers Senior SEM Consultant, Online Sales/Marketing - Life Sciences & Healthcare GOOGLE, INC January 2012  – Present (3 years 8 months) •\tSEM Consultant for Google Ventures portfolio companies \n•\tManaged online sales initiatives for key biotechnology clients: 23andMe, Life Technologies, Sigma-Aldrich, Millipore, BD BioSciences etc.  \n•\tLed 5-person team across US and India to manage $83 million portfolio of top tier health advertisers (e.g. WebMD, McKesson, 1-800 Contacts). Earned distinction of highest performing account team against revenue target. SEM Consultant Google 2011  –  2012  (1 year) SEM Consultant Google 2007  –  2012  (5 years) Senior AdWords Account Strategist - Life Sciences & Healthcare Google January 2010  –  December 2011  (2 years) •\tHandpicked to go to India to overhaul the team's workflow processes. Increased productivity output from 75% to >90%, enhanced communication, and gave quality reviews. \n•\tManaged global workflow across 8 teams as lead Strategist to coordinate integration of new India associates. \n•\tServed as Mobile expert within AdWords team to help clients understand and utilize mobile analytics data. AdWords Account Associate - Life Sciences & Healthcare Google July 2007  –  December 2009  (2 years 6 months) •\tCreated nascent and innovative method of lead-sourcing for Healthcare Sales Team. Resulted in over 600 new leads and rated best leads ever by sales team. \n•\tCreated and implemented custom marketing & optimization proposals to improve client performance for a $40 million portfolio. Resulted in annualized incremental revenue of $2.3 million. \n•\tVolunteered to individually train new hires and conduct formal quality reviews of 6 associates. \n•\tReceived Online Sales Operations Gold Award for winning a quarterly sales contest and quality of work rated ‘greatly exceeds expectations’. Research Assistant; Senior Laboratory Technician THE JOHNS HOPKINS MIND-BRAIN INSTITUTE May 2006  –  March 2007  (11 months) •\tAttained experimental results that elucidated effects of age on visual cortical plasticity development in mice. \n•\tInduced LTD & LTP in coronal visual cortical slices across layers II, III & IV in 1-8 week old male mice. \n• Findings were presented to an attendance of 29,500 at the 2006 Society for Neuroscience Meeting Account Executive Google October 2014  – Present (11 months) San Francisco Bay Area -Responsible for leading sales team across Health Services vertical in driving integrated, cross-platform sales & marketing campaigns for our customers \n-Primary role is to grow drive and grow new business with Google's top advertisers Account Executive Google October 2014  – Present (11 months) San Francisco Bay Area -Responsible for leading sales team across Health Services vertical in driving integrated, cross-platform sales & marketing campaigns for our customers \n-Primary role is to grow drive and grow new business with Google's top advertisers Senior SEM Consultant, Online Sales/Marketing - Life Sciences & Healthcare GOOGLE, INC January 2012  – Present (3 years 8 months) •\tSEM Consultant for Google Ventures portfolio companies \n•\tManaged online sales initiatives for key biotechnology clients: 23andMe, Life Technologies, Sigma-Aldrich, Millipore, BD BioSciences etc.  \n•\tLed 5-person team across US and India to manage $83 million portfolio of top tier health advertisers (e.g. WebMD, McKesson, 1-800 Contacts). Earned distinction of highest performing account team against revenue target. Senior SEM Consultant, Online Sales/Marketing - Life Sciences & Healthcare GOOGLE, INC January 2012  – Present (3 years 8 months) •\tSEM Consultant for Google Ventures portfolio companies \n•\tManaged online sales initiatives for key biotechnology clients: 23andMe, Life Technologies, Sigma-Aldrich, Millipore, BD BioSciences etc.  \n•\tLed 5-person team across US and India to manage $83 million portfolio of top tier health advertisers (e.g. WebMD, McKesson, 1-800 Contacts). Earned distinction of highest performing account team against revenue target. SEM Consultant Google 2011  –  2012  (1 year) SEM Consultant Google 2011  –  2012  (1 year) SEM Consultant Google 2007  –  2012  (5 years) SEM Consultant Google 2007  –  2012  (5 years) Senior AdWords Account Strategist - Life Sciences & Healthcare Google January 2010  –  December 2011  (2 years) •\tHandpicked to go to India to overhaul the team's workflow processes. Increased productivity output from 75% to >90%, enhanced communication, and gave quality reviews. \n•\tManaged global workflow across 8 teams as lead Strategist to coordinate integration of new India associates. \n•\tServed as Mobile expert within AdWords team to help clients understand and utilize mobile analytics data. Senior AdWords Account Strategist - Life Sciences & Healthcare Google January 2010  –  December 2011  (2 years) •\tHandpicked to go to India to overhaul the team's workflow processes. Increased productivity output from 75% to >90%, enhanced communication, and gave quality reviews. \n•\tManaged global workflow across 8 teams as lead Strategist to coordinate integration of new India associates. \n•\tServed as Mobile expert within AdWords team to help clients understand and utilize mobile analytics data. AdWords Account Associate - Life Sciences & Healthcare Google July 2007  –  December 2009  (2 years 6 months) •\tCreated nascent and innovative method of lead-sourcing for Healthcare Sales Team. Resulted in over 600 new leads and rated best leads ever by sales team. \n•\tCreated and implemented custom marketing & optimization proposals to improve client performance for a $40 million portfolio. Resulted in annualized incremental revenue of $2.3 million. \n•\tVolunteered to individually train new hires and conduct formal quality reviews of 6 associates. \n•\tReceived Online Sales Operations Gold Award for winning a quarterly sales contest and quality of work rated ‘greatly exceeds expectations’. AdWords Account Associate - Life Sciences & Healthcare Google July 2007  –  December 2009  (2 years 6 months) •\tCreated nascent and innovative method of lead-sourcing for Healthcare Sales Team. Resulted in over 600 new leads and rated best leads ever by sales team. \n•\tCreated and implemented custom marketing & optimization proposals to improve client performance for a $40 million portfolio. Resulted in annualized incremental revenue of $2.3 million. \n•\tVolunteered to individually train new hires and conduct formal quality reviews of 6 associates. \n•\tReceived Online Sales Operations Gold Award for winning a quarterly sales contest and quality of work rated ‘greatly exceeds expectations’. Research Assistant; Senior Laboratory Technician THE JOHNS HOPKINS MIND-BRAIN INSTITUTE May 2006  –  March 2007  (11 months) •\tAttained experimental results that elucidated effects of age on visual cortical plasticity development in mice. \n•\tInduced LTD & LTP in coronal visual cortical slices across layers II, III & IV in 1-8 week old male mice. \n• Findings were presented to an attendance of 29,500 at the 2006 Society for Neuroscience Meeting Research Assistant; Senior Laboratory Technician THE JOHNS HOPKINS MIND-BRAIN INSTITUTE May 2006  –  March 2007  (11 months) •\tAttained experimental results that elucidated effects of age on visual cortical plasticity development in mice. \n•\tInduced LTD & LTP in coronal visual cortical slices across layers II, III & IV in 1-8 week old male mice. \n• Findings were presented to an attendance of 29,500 at the 2006 Society for Neuroscience Meeting Skills Conversational Mandarin Online Marketing Product Marketing Marketing Lifesciences CRM Online Advertising Advertising Analytics SEM Google Adwords Mandarin Web Analytics Conversation PPC Google Analytics See 1+     See less Skills  Conversational Mandarin Online Marketing Product Marketing Marketing Lifesciences CRM Online Advertising Advertising Analytics SEM Google Adwords Mandarin Web Analytics Conversation PPC Google Analytics See 1+     See less Conversational Mandarin Online Marketing Product Marketing Marketing Lifesciences CRM Online Advertising Advertising Analytics SEM Google Adwords Mandarin Web Analytics Conversation PPC Google Analytics See 1+     See less Conversational Mandarin Online Marketing Product Marketing Marketing Lifesciences CRM Online Advertising Advertising Analytics SEM Google Adwords Mandarin Web Analytics Conversation PPC Google Analytics See 1+     See less Education The Johns Hopkins University Masters,  Biotechnology Enterprise 2005  – 2007 •\tGraduated with Highest Distinction, GPA: 3.95 \n•\tRelevant Business Coursework: Intellectual Property & Technology Transfer, Managing Biotechnology Professionals, Marketing and Economic Aspects of Biotechnology, Finance, Advanced Molecular Biology The Johns Hopkins University Masters,  Biotechnology Enterprise 2005  – 2007 •\tGraduated with Highest Distinction, GPA: 3.95 \n•\tRelevant Business Coursework: Intellectual Property & Technology Transfer, Managing Biotechnology Professionals, Marketing and Economic Aspects of Biotechnology, Finance, Advanced Molecular Biology The Johns Hopkins University Masters,  Biotechnology Enterprise 2005  – 2007 •\tGraduated with Highest Distinction, GPA: 3.95 \n•\tRelevant Business Coursework: Intellectual Property & Technology Transfer, Managing Biotechnology Professionals, Marketing and Economic Aspects of Biotechnology, Finance, Advanced Molecular Biology The Johns Hopkins University Masters,  Biotechnology Enterprise 2005  – 2007 •\tGraduated with Highest Distinction, GPA: 3.95 \n•\tRelevant Business Coursework: Intellectual Property & Technology Transfer, Managing Biotechnology Professionals, Marketing and Economic Aspects of Biotechnology, Finance, Advanced Molecular Biology ", "Summary Internet professional with over ten years experience in developing effective online branding, advertising and marketing strategies. \n \nProven track record in relationship management and online business development; extensive communication skills and excellent understanding of web based technology. \n \nExceptional leadership, influencing and change management skills. Experience in the management of multi-cultural teams for international sales organisations. \n \nFour years experience in broadcasting, both production and on air. \n \nSpecialties: Online-marketing, display advertising, branding and creative strategy, relationship management, team management, online business development, strategic thinking & planning, leadership, mentoring & team coordination, online industry expert, Google products & services, communications, audio & video production, broadcasting Summary Internet professional with over ten years experience in developing effective online branding, advertising and marketing strategies. \n \nProven track record in relationship management and online business development; extensive communication skills and excellent understanding of web based technology. \n \nExceptional leadership, influencing and change management skills. Experience in the management of multi-cultural teams for international sales organisations. \n \nFour years experience in broadcasting, both production and on air. \n \nSpecialties: Online-marketing, display advertising, branding and creative strategy, relationship management, team management, online business development, strategic thinking & planning, leadership, mentoring & team coordination, online industry expert, Google products & services, communications, audio & video production, broadcasting Internet professional with over ten years experience in developing effective online branding, advertising and marketing strategies. \n \nProven track record in relationship management and online business development; extensive communication skills and excellent understanding of web based technology. \n \nExceptional leadership, influencing and change management skills. Experience in the management of multi-cultural teams for international sales organisations. \n \nFour years experience in broadcasting, both production and on air. \n \nSpecialties: Online-marketing, display advertising, branding and creative strategy, relationship management, team management, online business development, strategic thinking & planning, leadership, mentoring & team coordination, online industry expert, Google products & services, communications, audio & video production, broadcasting Internet professional with over ten years experience in developing effective online branding, advertising and marketing strategies. \n \nProven track record in relationship management and online business development; extensive communication skills and excellent understanding of web based technology. \n \nExceptional leadership, influencing and change management skills. Experience in the management of multi-cultural teams for international sales organisations. \n \nFour years experience in broadcasting, both production and on air. \n \nSpecialties: Online-marketing, display advertising, branding and creative strategy, relationship management, team management, online business development, strategic thinking & planning, leadership, mentoring & team coordination, online industry expert, Google products & services, communications, audio & video production, broadcasting Experience EMEA Brand Operations Manager Google January 2013  – Present (2 years 8 months) Ireland Manages a team of 36 ad specialists, supporting 25+ markets for Google EMEA. Responsible for operations, sales development and performance. EMEA Regional Product Expert: Video Google March 2012  –  January 2013  (11 months) Dublin Video product expert specialising in YouTube ad product and platform solutions for large customers in EMEA YouTube Team Lead Google December 2010  –  March 2012  (1 year 4 months) Account Executive Google May 2010  –  December 2010  (8 months) Senior online advertising specialist with a specific focus on display & rich media ad strategy. Worked in a team lead capacity to acquire, develop and manage strategic partnerships within the UK and Irish Markets. Account Strategist Google May 2008  –  April 2010  (2 years) Online advertising specialist with a specific focus on display & rich media ad strategy. Worked in a team lead capacity to acquire, develop and manage strategic partnerships within the UK and Irish Markets. Senior Account Associate Google August 2007  –  April 2008  (9 months) Online ad campaign creation and management expert for Google Adwords/AdSense Sales. Provided in depth product support, market insight and best practice both internally and externally. AdSense Account Associate Google February 2006  –  July 2007  (1 year 6 months) Front line AdSense customer service and support for UK/IRL publishers, web site operators, and E-commerce merchants. Web Development Contractor Firecrest Clinical February 2005  –  July 2005  (6 months) Responsibilities included website & interface design, HTML development and CSS development. Also creation of flash content, audio content and some basic XML. Freelance Multimedia Specialist Thinwire Interactive October 2003  –  February 2005  (1 year 5 months) Established \"Thinwire Interactive\" and worked extensively in the area of Web and CD-ROM based design and development. Clients included: \nmixedbagmedia.com, cari.ie, learningcentre.ie, and bellissimoweddings.ie Professional Musician Dycus Music Ltd November 2002  –  September 2003  (11 months) I spent over a year working as a singer/guitarist in Denmark, Norway & Switzerland. I used this opportunity to travel and to develop excellent live presentation and audio production skills. Broadcast Assistant RTE Lyric FM June 1999  –  February 2003  (3 years 9 months) During this time I developed extensive research and production skills. I also gained valuable script writing experience through working on programmes such as Artszone and Lyric Notes. Radio Presenter Limericks Live 95 FM February 2002  –  July 2002  (6 months) Responsibilities included on air presentation & production as well as news & current affairs research and production for projects such as Live 95 FM's 2002 general election portfolio. EMEA Brand Operations Manager Google January 2013  – Present (2 years 8 months) Ireland Manages a team of 36 ad specialists, supporting 25+ markets for Google EMEA. Responsible for operations, sales development and performance. EMEA Brand Operations Manager Google January 2013  – Present (2 years 8 months) Ireland Manages a team of 36 ad specialists, supporting 25+ markets for Google EMEA. Responsible for operations, sales development and performance. EMEA Regional Product Expert: Video Google March 2012  –  January 2013  (11 months) Dublin Video product expert specialising in YouTube ad product and platform solutions for large customers in EMEA EMEA Regional Product Expert: Video Google March 2012  –  January 2013  (11 months) Dublin Video product expert specialising in YouTube ad product and platform solutions for large customers in EMEA YouTube Team Lead Google December 2010  –  March 2012  (1 year 4 months) YouTube Team Lead Google December 2010  –  March 2012  (1 year 4 months) Account Executive Google May 2010  –  December 2010  (8 months) Senior online advertising specialist with a specific focus on display & rich media ad strategy. Worked in a team lead capacity to acquire, develop and manage strategic partnerships within the UK and Irish Markets. Account Executive Google May 2010  –  December 2010  (8 months) Senior online advertising specialist with a specific focus on display & rich media ad strategy. Worked in a team lead capacity to acquire, develop and manage strategic partnerships within the UK and Irish Markets. Account Strategist Google May 2008  –  April 2010  (2 years) Online advertising specialist with a specific focus on display & rich media ad strategy. Worked in a team lead capacity to acquire, develop and manage strategic partnerships within the UK and Irish Markets. Account Strategist Google May 2008  –  April 2010  (2 years) Online advertising specialist with a specific focus on display & rich media ad strategy. Worked in a team lead capacity to acquire, develop and manage strategic partnerships within the UK and Irish Markets. Senior Account Associate Google August 2007  –  April 2008  (9 months) Online ad campaign creation and management expert for Google Adwords/AdSense Sales. Provided in depth product support, market insight and best practice both internally and externally. Senior Account Associate Google August 2007  –  April 2008  (9 months) Online ad campaign creation and management expert for Google Adwords/AdSense Sales. Provided in depth product support, market insight and best practice both internally and externally. AdSense Account Associate Google February 2006  –  July 2007  (1 year 6 months) Front line AdSense customer service and support for UK/IRL publishers, web site operators, and E-commerce merchants. AdSense Account Associate Google February 2006  –  July 2007  (1 year 6 months) Front line AdSense customer service and support for UK/IRL publishers, web site operators, and E-commerce merchants. Web Development Contractor Firecrest Clinical February 2005  –  July 2005  (6 months) Responsibilities included website & interface design, HTML development and CSS development. Also creation of flash content, audio content and some basic XML. Web Development Contractor Firecrest Clinical February 2005  –  July 2005  (6 months) Responsibilities included website & interface design, HTML development and CSS development. Also creation of flash content, audio content and some basic XML. Freelance Multimedia Specialist Thinwire Interactive October 2003  –  February 2005  (1 year 5 months) Established \"Thinwire Interactive\" and worked extensively in the area of Web and CD-ROM based design and development. Clients included: \nmixedbagmedia.com, cari.ie, learningcentre.ie, and bellissimoweddings.ie Freelance Multimedia Specialist Thinwire Interactive October 2003  –  February 2005  (1 year 5 months) Established \"Thinwire Interactive\" and worked extensively in the area of Web and CD-ROM based design and development. Clients included: \nmixedbagmedia.com, cari.ie, learningcentre.ie, and bellissimoweddings.ie Professional Musician Dycus Music Ltd November 2002  –  September 2003  (11 months) I spent over a year working as a singer/guitarist in Denmark, Norway & Switzerland. I used this opportunity to travel and to develop excellent live presentation and audio production skills. Professional Musician Dycus Music Ltd November 2002  –  September 2003  (11 months) I spent over a year working as a singer/guitarist in Denmark, Norway & Switzerland. I used this opportunity to travel and to develop excellent live presentation and audio production skills. Broadcast Assistant RTE Lyric FM June 1999  –  February 2003  (3 years 9 months) During this time I developed extensive research and production skills. I also gained valuable script writing experience through working on programmes such as Artszone and Lyric Notes. Broadcast Assistant RTE Lyric FM June 1999  –  February 2003  (3 years 9 months) During this time I developed extensive research and production skills. I also gained valuable script writing experience through working on programmes such as Artszone and Lyric Notes. Radio Presenter Limericks Live 95 FM February 2002  –  July 2002  (6 months) Responsibilities included on air presentation & production as well as news & current affairs research and production for projects such as Live 95 FM's 2002 general election portfolio. Radio Presenter Limericks Live 95 FM February 2002  –  July 2002  (6 months) Responsibilities included on air presentation & production as well as news & current affairs research and production for projects such as Live 95 FM's 2002 general election portfolio. Skills Display Advertising Web Marketing E-business Leadership Relationship Management Broadcast Google Adwords Digital Marketing PPC Online Advertising Social Media Marketing SEM Digital Media Social Media Video Editing Web Video Video E-commerce Consulting International Sales YouTube Communication Management Advertising Video Production Strategic Partnerships Google Analytics Google Apps Analytics E-commerce Marketing Strategy Online Marketing Web Development Adsense SEO See 19+     See less Skills  Display Advertising Web Marketing E-business Leadership Relationship Management Broadcast Google Adwords Digital Marketing PPC Online Advertising Social Media Marketing SEM Digital Media Social Media Video Editing Web Video Video E-commerce Consulting International Sales YouTube Communication Management Advertising Video Production Strategic Partnerships Google Analytics Google Apps Analytics E-commerce Marketing Strategy Online Marketing Web Development Adsense SEO See 19+     See less Display Advertising Web Marketing E-business Leadership Relationship Management Broadcast Google Adwords Digital Marketing PPC Online Advertising Social Media Marketing SEM Digital Media Social Media Video Editing Web Video Video E-commerce Consulting International Sales YouTube Communication Management Advertising Video Production Strategic Partnerships Google Analytics Google Apps Analytics E-commerce Marketing Strategy Online Marketing Web Development Adsense SEO See 19+     See less Display Advertising Web Marketing E-business Leadership Relationship Management Broadcast Google Adwords Digital Marketing PPC Online Advertising Social Media Marketing SEM Digital Media Social Media Video Editing Web Video Video E-commerce Consulting International Sales YouTube Communication Management Advertising Video Production Strategic Partnerships Google Analytics Google Apps Analytics E-commerce Marketing Strategy Online Marketing Web Development Adsense SEO See 19+     See less Education Dublin City University MSc,  Multimedia 2003  – 2004 1.1 Honours University of Limerick, Mary Immaculate College BA,  Liberal Art: English and Media & Communication Studies 1998  – 2002 2.1 Honours Activities and Societies:  Wired FM ,  MIC Film Society Dublin City University MSc,  Multimedia 2003  – 2004 1.1 Honours Dublin City University MSc,  Multimedia 2003  – 2004 1.1 Honours Dublin City University MSc,  Multimedia 2003  – 2004 1.1 Honours University of Limerick, Mary Immaculate College BA,  Liberal Art: English and Media & Communication Studies 1998  – 2002 2.1 Honours Activities and Societies:  Wired FM ,  MIC Film Society University of Limerick, Mary Immaculate College BA,  Liberal Art: English and Media & Communication Studies 1998  – 2002 2.1 Honours Activities and Societies:  Wired FM ,  MIC Film Society University of Limerick, Mary Immaculate College BA,  Liberal Art: English and Media & Communication Studies 1998  – 2002 2.1 Honours Activities and Societies:  Wired FM ,  MIC Film Society ", "Experience Operational Efficiency Manager, Americas Sales Operations Google October 2013  – Present (1 year 11 months) North America Lead, Display Ads Sales & Strategy Google September 2012  – Present (3 years) San Francisco Bay Area Media Solutions Lead, New Products & Solutions Google January 2012  –  September 2012  (9 months) Industry Focus: Business & Industrial Markets Display Account Executive, Online Media Sales: Finance Google November 2011  –  December 2011  (2 months) San Francisco Bay Area Display Specialist, Online Media Sales Google July 2010  –  October 2011  (1 year 4 months) From July 2010: Business & Industrial Markets \nFrom April 2011: Financial Services, Business & Industrial Markets Account Manager, Online Sales: Healthcare Google July 2007  –  July 2010  (3 years 1 month) Account Associate Google June 2006  –  June 2007  (1 year 1 month) San Francisco Bay Area Operational Efficiency Manager, Americas Sales Operations Google October 2013  – Present (1 year 11 months) Operational Efficiency Manager, Americas Sales Operations Google October 2013  – Present (1 year 11 months) North America Lead, Display Ads Sales & Strategy Google September 2012  – Present (3 years) San Francisco Bay Area North America Lead, Display Ads Sales & Strategy Google September 2012  – Present (3 years) San Francisco Bay Area Media Solutions Lead, New Products & Solutions Google January 2012  –  September 2012  (9 months) Industry Focus: Business & Industrial Markets Media Solutions Lead, New Products & Solutions Google January 2012  –  September 2012  (9 months) Industry Focus: Business & Industrial Markets Display Account Executive, Online Media Sales: Finance Google November 2011  –  December 2011  (2 months) San Francisco Bay Area Display Account Executive, Online Media Sales: Finance Google November 2011  –  December 2011  (2 months) San Francisco Bay Area Display Specialist, Online Media Sales Google July 2010  –  October 2011  (1 year 4 months) From July 2010: Business & Industrial Markets \nFrom April 2011: Financial Services, Business & Industrial Markets Display Specialist, Online Media Sales Google July 2010  –  October 2011  (1 year 4 months) From July 2010: Business & Industrial Markets \nFrom April 2011: Financial Services, Business & Industrial Markets Account Manager, Online Sales: Healthcare Google July 2007  –  July 2010  (3 years 1 month) Account Manager, Online Sales: Healthcare Google July 2007  –  July 2010  (3 years 1 month) Account Associate Google June 2006  –  June 2007  (1 year 1 month) San Francisco Bay Area Account Associate Google June 2006  –  June 2007  (1 year 1 month) San Francisco Bay Area Skills Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Skills  Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Education University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 ", "Summary Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Summary Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Experience Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (3 months) São Paulo Area, Brazil Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (3 months) São Paulo Area, Brazil Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (3 months) São Paulo Area, Brazil Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Skills Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Skills  Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Education Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Universidade de São Paulo Electric Engineering Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Universidade de São Paulo Electric Engineering Universidade de São Paulo Electric Engineering Universidade de São Paulo Electric Engineering ", "Skills Social Media Social Media Marketing Employer Branding Internet Recruiting Recruitment Advertising Facebook Community Management Google+ Social Recruiting Google Adwords Online Advertising Google Analytics PPC Digital Marketing Search Advertising Recruiting Management Product Management Team Management See 4+     See less Skills  Social Media Social Media Marketing Employer Branding Internet Recruiting Recruitment Advertising Facebook Community Management Google+ Social Recruiting Google Adwords Online Advertising Google Analytics PPC Digital Marketing Search Advertising Recruiting Management Product Management Team Management See 4+     See less Social Media Social Media Marketing Employer Branding Internet Recruiting Recruitment Advertising Facebook Community Management Google+ Social Recruiting Google Adwords Online Advertising Google Analytics PPC Digital Marketing Search Advertising Recruiting Management Product Management Team Management See 4+     See less Social Media Social Media Marketing Employer Branding Internet Recruiting Recruitment Advertising Facebook Community Management Google+ Social Recruiting Google Adwords Online Advertising Google Analytics PPC Digital Marketing Search Advertising Recruiting Management Product Management Team Management See 4+     See less "]}