{"position": "AdSense Associate", "company": "Google", "profiles": ["Summary I am graduate of the University of Michigan. I hold Bachelor of Business Administration from Michigan's Ross School of Business and a Bachelor of Arts in Economics from Michigan's College of Literature Science and the Arts. I love Entrepreneurship and Innovation. I am entering my first year at Google as an Associate Product Marketing Manager.  \n \nForever Go Blue! Summary I am graduate of the University of Michigan. I hold Bachelor of Business Administration from Michigan's Ross School of Business and a Bachelor of Arts in Economics from Michigan's College of Literature Science and the Arts. I love Entrepreneurship and Innovation. I am entering my first year at Google as an Associate Product Marketing Manager.  \n \nForever Go Blue! I am graduate of the University of Michigan. I hold Bachelor of Business Administration from Michigan's Ross School of Business and a Bachelor of Arts in Economics from Michigan's College of Literature Science and the Arts. I love Entrepreneurship and Innovation. I am entering my first year at Google as an Associate Product Marketing Manager.  \n \nForever Go Blue! I am graduate of the University of Michigan. I hold Bachelor of Business Administration from Michigan's Ross School of Business and a Bachelor of Arts in Economics from Michigan's College of Literature Science and the Arts. I love Entrepreneurship and Innovation. I am entering my first year at Google as an Associate Product Marketing Manager.  \n \nForever Go Blue! Experience Associate Product Marketing Manager: Google Partners Google September 2014  – Present (1 year) Mountain View, California Associate Product Marketing Manager Intern Google June 2013  –  August 2013  (3 months) Mountain View, California I worked on the go to market strategy on a yet to be announced Google product. This included drafting 50 in product emails while working with a legal team, an editing team and an engineering team to load into product. I interviewed and compiled customer stories for the new website while creating 10 uses cases for the site as well. Meanwhile, I helped devise a marketing strategy to cross promote the new product at launch. I also worked with the recruiting team to organize a mentor/intern field day. President MPowered Entrepreneurship June 2012  –  May 2013  (1 year) Ann Arbor, Michigan I served as the President of MPowered Entrepreneurship, an 100 person large organization dedicated to exposing students to entrepreneurship and supporting student entrepreneurs. I managed a $70,000 budget split between 13 projects. In my time as President, MPowered reached new heights by impacting over 6,000 students. (1 of 8 students at U of M, and 1 of 4 undergraduate students) We broke our previous world record for most student elevator pitches received in a student competition. Meanwhile, we set a new record for creating the largest student run Hackathon, MHacks, that 500 students from around the country attended. MPowered also organized a Startup Career Fair which connected 2000 students and 100 startups. Founding Chair University of Michigan Central Student Government Entrepreneurship Commission June 2012  –  May 2013  (1 year) Ann Arbor, Michigan I founded and chaired the first ever Entrepreneurship Commission through University of Michigan's Central Student Government. I recruited for the commission which was made up of the Presidents from the 15 entrepreneurship themed student organizations around campus. We supported each other's student organizations through funding and holding the first ever Month of Entrepreneurship at Michigan. Co-Founder Magnetic Hip Startup January 2012  –  September 2012  (9 months) Ann Arbor, Michigan I co-founded a magnetic hip startup with two other students at the University of Michigan. We were interested in alleviating pain caused by obstreperous in hips. We looked at implanting rare earth magnets in a compresable material that would be surgically implanted. I worked with laywers to go through the Provisional Patent process while researching the market size and opportunities. 1000 Pitches Director MPowered Entrepreneurship March 2011  –  March 2012  (1 year 1 month) Ann Arbor, MI I worked as the 1000 Pitches Director for MPowered Entrepreneurship at the University of Michigan. 1000 Pitches is the world's largest student-run elevator pitch competition. As the director, I fundraised $40,000 while managing a team of 30 members. I organized the logistics of the 8 week competition while overseeing the judging of the pitches. As director, 1000 Pitches broke the world record with 3,331 pitches. Associate Product Marketing Manager: Google Partners Google September 2014  – Present (1 year) Mountain View, California Associate Product Marketing Manager: Google Partners Google September 2014  – Present (1 year) Mountain View, California Associate Product Marketing Manager Intern Google June 2013  –  August 2013  (3 months) Mountain View, California I worked on the go to market strategy on a yet to be announced Google product. This included drafting 50 in product emails while working with a legal team, an editing team and an engineering team to load into product. I interviewed and compiled customer stories for the new website while creating 10 uses cases for the site as well. Meanwhile, I helped devise a marketing strategy to cross promote the new product at launch. I also worked with the recruiting team to organize a mentor/intern field day. Associate Product Marketing Manager Intern Google June 2013  –  August 2013  (3 months) Mountain View, California I worked on the go to market strategy on a yet to be announced Google product. This included drafting 50 in product emails while working with a legal team, an editing team and an engineering team to load into product. I interviewed and compiled customer stories for the new website while creating 10 uses cases for the site as well. Meanwhile, I helped devise a marketing strategy to cross promote the new product at launch. I also worked with the recruiting team to organize a mentor/intern field day. President MPowered Entrepreneurship June 2012  –  May 2013  (1 year) Ann Arbor, Michigan I served as the President of MPowered Entrepreneurship, an 100 person large organization dedicated to exposing students to entrepreneurship and supporting student entrepreneurs. I managed a $70,000 budget split between 13 projects. In my time as President, MPowered reached new heights by impacting over 6,000 students. (1 of 8 students at U of M, and 1 of 4 undergraduate students) We broke our previous world record for most student elevator pitches received in a student competition. Meanwhile, we set a new record for creating the largest student run Hackathon, MHacks, that 500 students from around the country attended. MPowered also organized a Startup Career Fair which connected 2000 students and 100 startups. President MPowered Entrepreneurship June 2012  –  May 2013  (1 year) Ann Arbor, Michigan I served as the President of MPowered Entrepreneurship, an 100 person large organization dedicated to exposing students to entrepreneurship and supporting student entrepreneurs. I managed a $70,000 budget split between 13 projects. In my time as President, MPowered reached new heights by impacting over 6,000 students. (1 of 8 students at U of M, and 1 of 4 undergraduate students) We broke our previous world record for most student elevator pitches received in a student competition. Meanwhile, we set a new record for creating the largest student run Hackathon, MHacks, that 500 students from around the country attended. MPowered also organized a Startup Career Fair which connected 2000 students and 100 startups. Founding Chair University of Michigan Central Student Government Entrepreneurship Commission June 2012  –  May 2013  (1 year) Ann Arbor, Michigan I founded and chaired the first ever Entrepreneurship Commission through University of Michigan's Central Student Government. I recruited for the commission which was made up of the Presidents from the 15 entrepreneurship themed student organizations around campus. We supported each other's student organizations through funding and holding the first ever Month of Entrepreneurship at Michigan. Founding Chair University of Michigan Central Student Government Entrepreneurship Commission June 2012  –  May 2013  (1 year) Ann Arbor, Michigan I founded and chaired the first ever Entrepreneurship Commission through University of Michigan's Central Student Government. I recruited for the commission which was made up of the Presidents from the 15 entrepreneurship themed student organizations around campus. We supported each other's student organizations through funding and holding the first ever Month of Entrepreneurship at Michigan. Co-Founder Magnetic Hip Startup January 2012  –  September 2012  (9 months) Ann Arbor, Michigan I co-founded a magnetic hip startup with two other students at the University of Michigan. We were interested in alleviating pain caused by obstreperous in hips. We looked at implanting rare earth magnets in a compresable material that would be surgically implanted. I worked with laywers to go through the Provisional Patent process while researching the market size and opportunities. Co-Founder Magnetic Hip Startup January 2012  –  September 2012  (9 months) Ann Arbor, Michigan I co-founded a magnetic hip startup with two other students at the University of Michigan. We were interested in alleviating pain caused by obstreperous in hips. We looked at implanting rare earth magnets in a compresable material that would be surgically implanted. I worked with laywers to go through the Provisional Patent process while researching the market size and opportunities. 1000 Pitches Director MPowered Entrepreneurship March 2011  –  March 2012  (1 year 1 month) Ann Arbor, MI I worked as the 1000 Pitches Director for MPowered Entrepreneurship at the University of Michigan. 1000 Pitches is the world's largest student-run elevator pitch competition. As the director, I fundraised $40,000 while managing a team of 30 members. I organized the logistics of the 8 week competition while overseeing the judging of the pitches. As director, 1000 Pitches broke the world record with 3,331 pitches. 1000 Pitches Director MPowered Entrepreneurship March 2011  –  March 2012  (1 year 1 month) Ann Arbor, MI I worked as the 1000 Pitches Director for MPowered Entrepreneurship at the University of Michigan. 1000 Pitches is the world's largest student-run elevator pitch competition. As the director, I fundraised $40,000 while managing a team of 30 members. I organized the logistics of the 8 week competition while overseeing the judging of the pitches. As director, 1000 Pitches broke the world record with 3,331 pitches. Languages Spanish Spanish Spanish Skills Microsoft Office Customer Service PowerPoint English Windows Outlook Public Speaking Strategic Planning Budgets Marketing Communications Marketing Research Start-ups Skills  Microsoft Office Customer Service PowerPoint English Windows Outlook Public Speaking Strategic Planning Budgets Marketing Communications Marketing Research Start-ups Microsoft Office Customer Service PowerPoint English Windows Outlook Public Speaking Strategic Planning Budgets Marketing Communications Marketing Research Start-ups Microsoft Office Customer Service PowerPoint English Windows Outlook Public Speaking Strategic Planning Budgets Marketing Communications Marketing Research Start-ups Education University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies , Senior 2010  – 2014 I have focused on entrepreneurship at the University of Michigan and greater Ann Arbor area. I was the President of MPowered Entrepreneurship, and Project Director of 1000 Pitches. During my junior year, I was the Founding Chair the Central Student Government Entrepreneurship Commission, and I was a Independent Candidate in the Central Student Government Presidential election. I finished in second place with 2,500 votes. I am currently working with a Vice President from University of Michigan on reforming the Mental Health Counseling Services. Activities and Societies:  MPowered Entrepreneurship ,  Magnetic Hip Startup ,  1000 Pitches ,  Central Student Government Entrepreneurship Commission ,  Central Student Government Independent Presidential ,  Advocates for Mental Health The University of Michigan Bachelor of Arts (B.A.),  Economics 2010  – 2014 West Catholic High School 2006  – 2010 University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies , Senior 2010  – 2014 I have focused on entrepreneurship at the University of Michigan and greater Ann Arbor area. I was the President of MPowered Entrepreneurship, and Project Director of 1000 Pitches. During my junior year, I was the Founding Chair the Central Student Government Entrepreneurship Commission, and I was a Independent Candidate in the Central Student Government Presidential election. I finished in second place with 2,500 votes. I am currently working with a Vice President from University of Michigan on reforming the Mental Health Counseling Services. Activities and Societies:  MPowered Entrepreneurship ,  Magnetic Hip Startup ,  1000 Pitches ,  Central Student Government Entrepreneurship Commission ,  Central Student Government Independent Presidential ,  Advocates for Mental Health University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies , Senior 2010  – 2014 I have focused on entrepreneurship at the University of Michigan and greater Ann Arbor area. I was the President of MPowered Entrepreneurship, and Project Director of 1000 Pitches. During my junior year, I was the Founding Chair the Central Student Government Entrepreneurship Commission, and I was a Independent Candidate in the Central Student Government Presidential election. I finished in second place with 2,500 votes. I am currently working with a Vice President from University of Michigan on reforming the Mental Health Counseling Services. Activities and Societies:  MPowered Entrepreneurship ,  Magnetic Hip Startup ,  1000 Pitches ,  Central Student Government Entrepreneurship Commission ,  Central Student Government Independent Presidential ,  Advocates for Mental Health University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies , Senior 2010  – 2014 I have focused on entrepreneurship at the University of Michigan and greater Ann Arbor area. I was the President of MPowered Entrepreneurship, and Project Director of 1000 Pitches. During my junior year, I was the Founding Chair the Central Student Government Entrepreneurship Commission, and I was a Independent Candidate in the Central Student Government Presidential election. I finished in second place with 2,500 votes. I am currently working with a Vice President from University of Michigan on reforming the Mental Health Counseling Services. Activities and Societies:  MPowered Entrepreneurship ,  Magnetic Hip Startup ,  1000 Pitches ,  Central Student Government Entrepreneurship Commission ,  Central Student Government Independent Presidential ,  Advocates for Mental Health The University of Michigan Bachelor of Arts (B.A.),  Economics 2010  – 2014 The University of Michigan Bachelor of Arts (B.A.),  Economics 2010  – 2014 The University of Michigan Bachelor of Arts (B.A.),  Economics 2010  – 2014 West Catholic High School 2006  – 2010 West Catholic High School 2006  – 2010 West Catholic High School 2006  – 2010 ", "Skills Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing Skills  Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing ", "Experience Google Financial Services - Business Development Associate Google October 2011  – Present (3 years 11 months) Mountain View One of the founding members and the execution lead of Google’s first Finance-led business that aims to help Google’s customers grow by providing access to capital, resulting in increased customer acquisition and loyalty for Google’s products and services. Corporate Finance Associate Google October 2010  –  June 2011  (9 months) Mountain View, CA Executed Google's inaugural bond offering. \nLed financial analysis for renewable energy investments and Google's capital structure optimization. Strategy and Corporate Development Associate Hewlett-Packard November 2009  –  October 2010  (1 year) Supported Business Unit Executives and Product Managers in strategy development and led execution of M&A transactions. Investment Banking Analyst - Global Technology Group Citigroup Global Markets July 2007  –  July 2009  (2 years 1 month) Executed M&A and equity market transactions for technology firms: performed valuation analysis, conducted deal due diligence and created investor and management presentations. Google Financial Services - Business Development Associate Google October 2011  – Present (3 years 11 months) Mountain View One of the founding members and the execution lead of Google’s first Finance-led business that aims to help Google’s customers grow by providing access to capital, resulting in increased customer acquisition and loyalty for Google’s products and services. Google Financial Services - Business Development Associate Google October 2011  – Present (3 years 11 months) Mountain View One of the founding members and the execution lead of Google’s first Finance-led business that aims to help Google’s customers grow by providing access to capital, resulting in increased customer acquisition and loyalty for Google’s products and services. Corporate Finance Associate Google October 2010  –  June 2011  (9 months) Mountain View, CA Executed Google's inaugural bond offering. \nLed financial analysis for renewable energy investments and Google's capital structure optimization. Corporate Finance Associate Google October 2010  –  June 2011  (9 months) Mountain View, CA Executed Google's inaugural bond offering. \nLed financial analysis for renewable energy investments and Google's capital structure optimization. Strategy and Corporate Development Associate Hewlett-Packard November 2009  –  October 2010  (1 year) Supported Business Unit Executives and Product Managers in strategy development and led execution of M&A transactions. Strategy and Corporate Development Associate Hewlett-Packard November 2009  –  October 2010  (1 year) Supported Business Unit Executives and Product Managers in strategy development and led execution of M&A transactions. Investment Banking Analyst - Global Technology Group Citigroup Global Markets July 2007  –  July 2009  (2 years 1 month) Executed M&A and equity market transactions for technology firms: performed valuation analysis, conducted deal due diligence and created investor and management presentations. Investment Banking Analyst - Global Technology Group Citigroup Global Markets July 2007  –  July 2009  (2 years 1 month) Executed M&A and equity market transactions for technology firms: performed valuation analysis, conducted deal due diligence and created investor and management presentations. Skills Investment Banking Financial Modeling Corporate Development Skills  Investment Banking Financial Modeling Corporate Development Investment Banking Financial Modeling Corporate Development Investment Banking Financial Modeling Corporate Development Education Bachelor of Science in Economics, The Wharton School, University of Pennsylvania Bachelor of Science in Economics,  Finance and Marketing 2003  – 2007 Activities and Societies:  AIESEC (International Work Exchange Program)\nVice President of Outgoing Exchange Committee Bachelor of Science in Economics, The Wharton School, University of Pennsylvania Bachelor of Science in Economics,  Finance and Marketing 2003  – 2007 Activities and Societies:  AIESEC (International Work Exchange Program)\nVice President of Outgoing Exchange Committee Bachelor of Science in Economics, The Wharton School, University of Pennsylvania Bachelor of Science in Economics,  Finance and Marketing 2003  – 2007 Activities and Societies:  AIESEC (International Work Exchange Program)\nVice President of Outgoing Exchange Committee Bachelor of Science in Economics, The Wharton School, University of Pennsylvania Bachelor of Science in Economics,  Finance and Marketing 2003  – 2007 Activities and Societies:  AIESEC (International Work Exchange Program)\nVice President of Outgoing Exchange Committee ", "Languages   Skills Skills     Honors & Awards ", "Experience Strategy and Operations Associate, Google Access Google September 2014  – Present (1 year) Mountain View, CA Consultant The Boston Consulting Group November 2013  –  July 2014  (9 months) Greater New York City Area Associate The Boston Consulting Group August 2011  –  October 2013  (2 years 3 months) Proposals Intern Rolls-Royce Marine June 2010  –  August 2010  (3 months) Annapolis, Maryland Designed over 35 shiplifts to customer specifications. Priced designs and wrote proposals submitted to customers. Research Analyst CB Information Services May 2009  –  August 2009  (4 months) Greater New York City Area Wrote quantitative, data-driven analyses of startups and venture capital firms using ChubbyBrain’s database of venture funding. Report topics included renewable energy, nanotechnology, and Twitter-based startups. \n \nAnalyses were featured in The Wall Street Journal, Wired, Reuters, and VentureBeat. Strategy and Operations Associate, Google Access Google September 2014  – Present (1 year) Mountain View, CA Strategy and Operations Associate, Google Access Google September 2014  – Present (1 year) Mountain View, CA Consultant The Boston Consulting Group November 2013  –  July 2014  (9 months) Greater New York City Area Consultant The Boston Consulting Group November 2013  –  July 2014  (9 months) Greater New York City Area Associate The Boston Consulting Group August 2011  –  October 2013  (2 years 3 months) Associate The Boston Consulting Group August 2011  –  October 2013  (2 years 3 months) Proposals Intern Rolls-Royce Marine June 2010  –  August 2010  (3 months) Annapolis, Maryland Designed over 35 shiplifts to customer specifications. Priced designs and wrote proposals submitted to customers. Proposals Intern Rolls-Royce Marine June 2010  –  August 2010  (3 months) Annapolis, Maryland Designed over 35 shiplifts to customer specifications. Priced designs and wrote proposals submitted to customers. Research Analyst CB Information Services May 2009  –  August 2009  (4 months) Greater New York City Area Wrote quantitative, data-driven analyses of startups and venture capital firms using ChubbyBrain’s database of venture funding. Report topics included renewable energy, nanotechnology, and Twitter-based startups. \n \nAnalyses were featured in The Wall Street Journal, Wired, Reuters, and VentureBeat. Research Analyst CB Information Services May 2009  –  August 2009  (4 months) Greater New York City Area Wrote quantitative, data-driven analyses of startups and venture capital firms using ChubbyBrain’s database of venture funding. Report topics included renewable energy, nanotechnology, and Twitter-based startups. \n \nAnalyses were featured in The Wall Street Journal, Wired, Reuters, and VentureBeat. Languages   Skills Strategy Venture Capital Start-ups Business Case Modelling Financial Modeling Management Consulting Entrepreneurship Information Technology Healthcare Benchmarking Retail Data Analysis Analysis Skills  Strategy Venture Capital Start-ups Business Case Modelling Financial Modeling Management Consulting Entrepreneurship Information Technology Healthcare Benchmarking Retail Data Analysis Analysis Strategy Venture Capital Start-ups Business Case Modelling Financial Modeling Management Consulting Entrepreneurship Information Technology Healthcare Benchmarking Retail Data Analysis Analysis Strategy Venture Capital Start-ups Business Case Modelling Financial Modeling Management Consulting Entrepreneurship Information Technology Healthcare Benchmarking Retail Data Analysis Analysis Education University of Pennsylvania BS and BSE,  Marketing , Material Science Engineering Jerome Fisher Program in Management & Technology (dual degree program in Wharton and the School of Engineering and Applied Science) Activities and Societies:  President/Coach - Swim Club ,  Senior President - Cohort Rand University of Pennsylvania BS and BSE,  Marketing , Material Science Engineering Jerome Fisher Program in Management & Technology (dual degree program in Wharton and the School of Engineering and Applied Science) Activities and Societies:  President/Coach - Swim Club ,  Senior President - Cohort Rand University of Pennsylvania BS and BSE,  Marketing , Material Science Engineering Jerome Fisher Program in Management & Technology (dual degree program in Wharton and the School of Engineering and Applied Science) Activities and Societies:  President/Coach - Swim Club ,  Senior President - Cohort Rand University of Pennsylvania BS and BSE,  Marketing , Material Science Engineering Jerome Fisher Program in Management & Technology (dual degree program in Wharton and the School of Engineering and Applied Science) Activities and Societies:  President/Coach - Swim Club ,  Senior President - Cohort Rand Honors & Awards Eagle Scout Boy Scouts of America 2006 National Merit Scholar 2006 Eagle Scout Boy Scouts of America 2006 Eagle Scout Boy Scouts of America 2006 Eagle Scout Boy Scouts of America 2006 National Merit Scholar 2006 National Merit Scholar 2006 National Merit Scholar 2006 ", "Experience Associate City Manager - Google Fiber Google December 2014  – Present (9 months) San Antonio, Texas Area Brand Strategist Google September 2012  –  November 2014  (2 years 3 months) Mountain View, CA Associate Consultant Bain & Company July 2010  –  July 2012  (2 years 1 month) Houston, Texas Area Analyst Austin Ventures February 2009  –  May 2010  (1 year 4 months) Austin, Texas Area Summer Analyst - Investment Banking Division Citi May 2008  –  August 2008  (4 months) Greater New York City Area Public Relations and Marketing Intern Cole Haan May 2006  –  July 2006  (3 months) Greater New York City Area Associate City Manager - Google Fiber Google December 2014  – Present (9 months) San Antonio, Texas Area Associate City Manager - Google Fiber Google December 2014  – Present (9 months) San Antonio, Texas Area Brand Strategist Google September 2012  –  November 2014  (2 years 3 months) Mountain View, CA Brand Strategist Google September 2012  –  November 2014  (2 years 3 months) Mountain View, CA Associate Consultant Bain & Company July 2010  –  July 2012  (2 years 1 month) Houston, Texas Area Associate Consultant Bain & Company July 2010  –  July 2012  (2 years 1 month) Houston, Texas Area Analyst Austin Ventures February 2009  –  May 2010  (1 year 4 months) Austin, Texas Area Analyst Austin Ventures February 2009  –  May 2010  (1 year 4 months) Austin, Texas Area Summer Analyst - Investment Banking Division Citi May 2008  –  August 2008  (4 months) Greater New York City Area Summer Analyst - Investment Banking Division Citi May 2008  –  August 2008  (4 months) Greater New York City Area Public Relations and Marketing Intern Cole Haan May 2006  –  July 2006  (3 months) Greater New York City Area Public Relations and Marketing Intern Cole Haan May 2006  –  July 2006  (3 months) Greater New York City Area Skills Business Strategy Branding & Identity Organizational Design Competitive Analysis Project Management Financial Analysis Financial Modeling Skills  Business Strategy Branding & Identity Organizational Design Competitive Analysis Project Management Financial Analysis Financial Modeling Business Strategy Branding & Identity Organizational Design Competitive Analysis Project Management Financial Analysis Financial Modeling Business Strategy Branding & Identity Organizational Design Competitive Analysis Project Management Financial Analysis Financial Modeling Education The University of Texas at Austin - Red McCombs School of Business BBA, BA,  Finance , Plan II 2005  – 2008 Activities and Societies:  Phi Beta Kappa ,  Delta Gamma The University of Texas at Austin - Red McCombs School of Business BBA, BA,  Finance , Plan II 2005  – 2008 Activities and Societies:  Phi Beta Kappa ,  Delta Gamma The University of Texas at Austin - Red McCombs School of Business BBA, BA,  Finance , Plan II 2005  – 2008 Activities and Societies:  Phi Beta Kappa ,  Delta Gamma The University of Texas at Austin - Red McCombs School of Business BBA, BA,  Finance , Plan II 2005  – 2008 Activities and Societies:  Phi Beta Kappa ,  Delta Gamma ", "Summary Product manager interested in defining and scaling the next generations of computing: from virtual reality, wearables and robotics, to cloud and high-performance computing. Currently focusing on a scrappy and ubiquitous VR via Google Cardboard. Summary Product manager interested in defining and scaling the next generations of computing: from virtual reality, wearables and robotics, to cloud and high-performance computing. Currently focusing on a scrappy and ubiquitous VR via Google Cardboard. Product manager interested in defining and scaling the next generations of computing: from virtual reality, wearables and robotics, to cloud and high-performance computing. Currently focusing on a scrappy and ubiquitous VR via Google Cardboard. Product manager interested in defining and scaling the next generations of computing: from virtual reality, wearables and robotics, to cloud and high-performance computing. Currently focusing on a scrappy and ubiquitous VR via Google Cardboard. Experience Associate Product Manager, Google Cardboard Google September 2014  – Present (1 year) San Francisco Bay Area Working on Google Cardboard: a fun, scrappy and ubiquitous virtual reality device (https://google.com/cardboard). Launched the new Google Cardboard at Google I/O 2015, started the \"Works with Google Cardboard\" certification program, launched the first brand campaign partnership with Volvo. Associate Product Manager, Google Cloud Developer Experiences Google October 2013  –  September 2014  (1 year) San Francisco Bay Area Set the vision and executed on delivery of Google Cloud SDK. Launched a unified command-line tool to manage Google Cloud Platform resources, called \"gcloud\", and grew it to a wide-spread adoption (https://cloud.google.com/sdk). Launched Cloud Tools in Android Studio (https://cloud.google.com/mobile) to improve cloud-connected mobile app development experiences. Supported Google Plugin for Eclipse (https://cloud.google.com/eclipse). Program Manager, Microsoft Office (internship) Microsoft June 2012  –  September 2012  (4 months) Redmond, WA Worked on a functional specification of a feature that is used for Microsoft Office sustained engineering content management. Evangelized new methods for UI prototype reusability to reduce the effort duplication between PMs and developers. Drove an end-to-end performance investigation, including building cross-division team relationships for DB performance analysis. Software Development Engineer in Test, Microsoft Office (internship) Microsoft June 2011  –  September 2011  (4 months) Designed and implemented (using C#) an automated performance testing suite for the feature that is used across Microsoft Office and Windows divisions for developing and constantly updating 50k+ pages of documentation on MSDN. Technology Analyst (internship) Morgan Stanley June 2010  –  September 2010  (4 months) Developed a new UI feature in repurchase agreement (“repo”) trading software (using C#) that allowed traders to compare interest rates between different financial securities as collaterals across various terms. Created an associated e-mail reporting subsystem (Java/Spring) and a website (ASP.NET) producing automated reports for traders and senior executives. Applications Sofware Engineer (internship) Wolfson Microelectronics May 2009  –  August 2009  (4 months) Designed and implemented (using C/C++) an audio driver framework for devices running on WinCE 6.0, which allowed company to reduce the basic new platform support time from one month to three to four days, increased code re-use and maintainability; ultimately resulting in a significant decrease in internal audio driver development costs. Associate Product Manager, Google Cardboard Google September 2014  – Present (1 year) San Francisco Bay Area Working on Google Cardboard: a fun, scrappy and ubiquitous virtual reality device (https://google.com/cardboard). Launched the new Google Cardboard at Google I/O 2015, started the \"Works with Google Cardboard\" certification program, launched the first brand campaign partnership with Volvo. Associate Product Manager, Google Cardboard Google September 2014  – Present (1 year) San Francisco Bay Area Working on Google Cardboard: a fun, scrappy and ubiquitous virtual reality device (https://google.com/cardboard). Launched the new Google Cardboard at Google I/O 2015, started the \"Works with Google Cardboard\" certification program, launched the first brand campaign partnership with Volvo. Associate Product Manager, Google Cloud Developer Experiences Google October 2013  –  September 2014  (1 year) San Francisco Bay Area Set the vision and executed on delivery of Google Cloud SDK. Launched a unified command-line tool to manage Google Cloud Platform resources, called \"gcloud\", and grew it to a wide-spread adoption (https://cloud.google.com/sdk). Launched Cloud Tools in Android Studio (https://cloud.google.com/mobile) to improve cloud-connected mobile app development experiences. Supported Google Plugin for Eclipse (https://cloud.google.com/eclipse). Associate Product Manager, Google Cloud Developer Experiences Google October 2013  –  September 2014  (1 year) San Francisco Bay Area Set the vision and executed on delivery of Google Cloud SDK. Launched a unified command-line tool to manage Google Cloud Platform resources, called \"gcloud\", and grew it to a wide-spread adoption (https://cloud.google.com/sdk). Launched Cloud Tools in Android Studio (https://cloud.google.com/mobile) to improve cloud-connected mobile app development experiences. Supported Google Plugin for Eclipse (https://cloud.google.com/eclipse). Program Manager, Microsoft Office (internship) Microsoft June 2012  –  September 2012  (4 months) Redmond, WA Worked on a functional specification of a feature that is used for Microsoft Office sustained engineering content management. Evangelized new methods for UI prototype reusability to reduce the effort duplication between PMs and developers. Drove an end-to-end performance investigation, including building cross-division team relationships for DB performance analysis. Program Manager, Microsoft Office (internship) Microsoft June 2012  –  September 2012  (4 months) Redmond, WA Worked on a functional specification of a feature that is used for Microsoft Office sustained engineering content management. Evangelized new methods for UI prototype reusability to reduce the effort duplication between PMs and developers. Drove an end-to-end performance investigation, including building cross-division team relationships for DB performance analysis. Software Development Engineer in Test, Microsoft Office (internship) Microsoft June 2011  –  September 2011  (4 months) Designed and implemented (using C#) an automated performance testing suite for the feature that is used across Microsoft Office and Windows divisions for developing and constantly updating 50k+ pages of documentation on MSDN. Software Development Engineer in Test, Microsoft Office (internship) Microsoft June 2011  –  September 2011  (4 months) Designed and implemented (using C#) an automated performance testing suite for the feature that is used across Microsoft Office and Windows divisions for developing and constantly updating 50k+ pages of documentation on MSDN. Technology Analyst (internship) Morgan Stanley June 2010  –  September 2010  (4 months) Developed a new UI feature in repurchase agreement (“repo”) trading software (using C#) that allowed traders to compare interest rates between different financial securities as collaterals across various terms. Created an associated e-mail reporting subsystem (Java/Spring) and a website (ASP.NET) producing automated reports for traders and senior executives. Technology Analyst (internship) Morgan Stanley June 2010  –  September 2010  (4 months) Developed a new UI feature in repurchase agreement (“repo”) trading software (using C#) that allowed traders to compare interest rates between different financial securities as collaterals across various terms. Created an associated e-mail reporting subsystem (Java/Spring) and a website (ASP.NET) producing automated reports for traders and senior executives. Applications Sofware Engineer (internship) Wolfson Microelectronics May 2009  –  August 2009  (4 months) Designed and implemented (using C/C++) an audio driver framework for devices running on WinCE 6.0, which allowed company to reduce the basic new platform support time from one month to three to four days, increased code re-use and maintainability; ultimately resulting in a significant decrease in internal audio driver development costs. Applications Sofware Engineer (internship) Wolfson Microelectronics May 2009  –  August 2009  (4 months) Designed and implemented (using C/C++) an audio driver framework for devices running on WinCE 6.0, which allowed company to reduce the basic new platform support time from one month to three to four days, increased code re-use and maintainability; ultimately resulting in a significant decrease in internal audio driver development costs. Languages   Skills C# Software Development Java C++ MySQL JavaScript C CSS Databases Skills  C# Software Development Java C++ MySQL JavaScript C CSS Databases C# Software Development Java C++ MySQL JavaScript C CSS Databases C# Software Development Java C++ MySQL JavaScript C CSS Databases Education University of Oxford Master of Science (MSc),  Computer Science , Distinction 2012  – 2013 Thesis: \"Improving Autonomous Robot Photography using RGB-D Sensors\" University of Cambridge Bachelor of Arts (BA),  Computer Science , Double First 2009  – 2012 Highly-commended final year thesis: \"3D Display Simulation using Head Tracking with RGB-D Sensors\" \n3 x Jennings Prize (in 2010, 2011, 2012), Wolfson College. Activities and Societies:  Cambridge University Basketball Club The University of Edinburgh Artificial Intelligence and Computer Science , GPA 94.25 (out of 100) 2008  – 2009 Academic results based industrial KAL scholarship, \nSimon Gray Prize, Department of Philosophy. Activities and Societies:  Edinburgh University Basketball Club University of Oxford Master of Science (MSc),  Computer Science , Distinction 2012  – 2013 Thesis: \"Improving Autonomous Robot Photography using RGB-D Sensors\" University of Oxford Master of Science (MSc),  Computer Science , Distinction 2012  – 2013 Thesis: \"Improving Autonomous Robot Photography using RGB-D Sensors\" University of Oxford Master of Science (MSc),  Computer Science , Distinction 2012  – 2013 Thesis: \"Improving Autonomous Robot Photography using RGB-D Sensors\" University of Cambridge Bachelor of Arts (BA),  Computer Science , Double First 2009  – 2012 Highly-commended final year thesis: \"3D Display Simulation using Head Tracking with RGB-D Sensors\" \n3 x Jennings Prize (in 2010, 2011, 2012), Wolfson College. Activities and Societies:  Cambridge University Basketball Club University of Cambridge Bachelor of Arts (BA),  Computer Science , Double First 2009  – 2012 Highly-commended final year thesis: \"3D Display Simulation using Head Tracking with RGB-D Sensors\" \n3 x Jennings Prize (in 2010, 2011, 2012), Wolfson College. Activities and Societies:  Cambridge University Basketball Club University of Cambridge Bachelor of Arts (BA),  Computer Science , Double First 2009  – 2012 Highly-commended final year thesis: \"3D Display Simulation using Head Tracking with RGB-D Sensors\" \n3 x Jennings Prize (in 2010, 2011, 2012), Wolfson College. Activities and Societies:  Cambridge University Basketball Club The University of Edinburgh Artificial Intelligence and Computer Science , GPA 94.25 (out of 100) 2008  – 2009 Academic results based industrial KAL scholarship, \nSimon Gray Prize, Department of Philosophy. Activities and Societies:  Edinburgh University Basketball Club The University of Edinburgh Artificial Intelligence and Computer Science , GPA 94.25 (out of 100) 2008  – 2009 Academic results based industrial KAL scholarship, \nSimon Gray Prize, Department of Philosophy. Activities and Societies:  Edinburgh University Basketball Club The University of Edinburgh Artificial Intelligence and Computer Science , GPA 94.25 (out of 100) 2008  – 2009 Academic results based industrial KAL scholarship, \nSimon Gray Prize, Department of Philosophy. Activities and Societies:  Edinburgh University Basketball Club Honors & Awards ", "Summary I am passionate about building products that help people live healthier, happy lives. I believe that good health is critical to an optimal state of well-being and society. I want my life work to promote the benefits of prioritizing one’s health, motivate others to make lasting, healthy changes in their lives and make those changes more accessible. Summary I am passionate about building products that help people live healthier, happy lives. I believe that good health is critical to an optimal state of well-being and society. I want my life work to promote the benefits of prioritizing one’s health, motivate others to make lasting, healthy changes in their lives and make those changes more accessible. I am passionate about building products that help people live healthier, happy lives. I believe that good health is critical to an optimal state of well-being and society. I want my life work to promote the benefits of prioritizing one’s health, motivate others to make lasting, healthy changes in their lives and make those changes more accessible. I am passionate about building products that help people live healthier, happy lives. I believe that good health is critical to an optimal state of well-being and society. I want my life work to promote the benefits of prioritizing one’s health, motivate others to make lasting, healthy changes in their lives and make those changes more accessible. Experience Associate Product Manager - Google Fit Google August 2014  – Present (1 year 1 month) Mountain View, California I am the product manager for the Google Fit app. \n \nMy recent responsibilities include: \n+ Leading the app through its initial launch, in the process defining our mission, strategy, minimum viable product and responding to internal feedback to get us to a launch-ready state.  \n+ Leading prioritization efforts, establishing product vision and roadmaps and driving decision-making across leadership, engineering, design, marketing, PR, legal and release teams through multiple product iterations on our mobile/tablet Android applications, Android Wear application and web offering.  \n+ Growing the app from initial launch to over 7 million users in 6 months. \n \nLatest official blog post for the app: http://officialandroid.blogspot.com/2015/05/google-fit-make-every-step-count.html Associate Product Manager - Google Flight Search Google September 2013  –  August 2014  (1 year) Zurich Product manager for the Google Flights frontend.  \n \nMy responsibilities included:  \n+ Leading prioritization efforts, establishing product vision and roadmaps and drove decision-making across leadership, engineering, design, marketing, PR, legal and release teams through multiple product iterations on google.com/flights. \n \nTop launches include the following: \n+ Providing users with tips on how to change their flight to get a lower price and/or better experience \n+ Allowing users to save flights and share them with their travel partners \n+ Putting flight prices right into our date selector so users can be price-conscious from the start \n+ Working through technical constraints to develop a travel exploration feature where a user can get flight prices from their origin to top cities around the world \n+ Grouping flights results in commuter markets (e.g. LA -> NYC) for easier viewing, similar to transit schedules (also received patent for the UI) \n+ Launching the product in 20+ new languages and introducing currency selection for international users \n+ Evangelizing and representing the product both within the company as well as outside conferences and events such as being a keynote speaking at the Travel Executive Forum \n+ Revamping our PR and marketing efforts \n+ Actively recruiting for the Google, participating as a panelist at several external events and giving presentations at universities \n Teaching Assistant - Introductory Computer Science University of Washington dept of Computer Science June 2010  –  July 2013  (3 years 2 months) Greater Seattle Area Responsibilities included:  \n+ Designing lectures for and teaching introductory computer science courses. \n+ Providing individual tutoring for students and lead group review sessions.  \n+ Developing, leading and maintaining electronic bulletin boards, e-mail lists and discussion sites to facilitate learning and provide helped \n+ Acting as a liaison between students and professor \n Associate Product Manager Intern - Google Hangouts Google June 2012  –  September 2012  (4 months) Mountain View, California Worked with design, engineering and leadership teams to launch the following features for Google Hangouts: \n+ Hangouts for user <18 years old on mobile devices \n+ Hangouts plugin page redesign \n+ Background replacement effect for video Hangouts \n+ Recording Hangouts abuse on mobile \n+ Hangouts low bandwidth optimization setting \n Software Engineering Intern - Google Search Google June 2011  –  August 2011  (3 months) Greater Seattle Area + Worked on the real-time analysis of queries (e.g. detecting when certain queries spike in popularity) \n+ Designed and implemented a MapReduce framework that enabled the evaluation and comparison of different model-building algorithms for real-time query detection, ultimately enabling the best model to be chosen to represent the frequency pattern for time series data. \n+ Using the above framework, reported which ideas for handling spike adjustment for specific data (e.g. queries) seem most promising to focus future model designs and implementations. \n+ Primary language used: c++ Research Assistant, Mobile ASL (American Sign Language) University of Washington dept of Electrical Eng. October 2009  –  August 2010  (11 months) Greater Seattle Area Associate Product Manager - Google Fit Google August 2014  – Present (1 year 1 month) Mountain View, California I am the product manager for the Google Fit app. \n \nMy recent responsibilities include: \n+ Leading the app through its initial launch, in the process defining our mission, strategy, minimum viable product and responding to internal feedback to get us to a launch-ready state.  \n+ Leading prioritization efforts, establishing product vision and roadmaps and driving decision-making across leadership, engineering, design, marketing, PR, legal and release teams through multiple product iterations on our mobile/tablet Android applications, Android Wear application and web offering.  \n+ Growing the app from initial launch to over 7 million users in 6 months. \n \nLatest official blog post for the app: http://officialandroid.blogspot.com/2015/05/google-fit-make-every-step-count.html Associate Product Manager - Google Fit Google August 2014  – Present (1 year 1 month) Mountain View, California I am the product manager for the Google Fit app. \n \nMy recent responsibilities include: \n+ Leading the app through its initial launch, in the process defining our mission, strategy, minimum viable product and responding to internal feedback to get us to a launch-ready state.  \n+ Leading prioritization efforts, establishing product vision and roadmaps and driving decision-making across leadership, engineering, design, marketing, PR, legal and release teams through multiple product iterations on our mobile/tablet Android applications, Android Wear application and web offering.  \n+ Growing the app from initial launch to over 7 million users in 6 months. \n \nLatest official blog post for the app: http://officialandroid.blogspot.com/2015/05/google-fit-make-every-step-count.html Associate Product Manager - Google Flight Search Google September 2013  –  August 2014  (1 year) Zurich Product manager for the Google Flights frontend.  \n \nMy responsibilities included:  \n+ Leading prioritization efforts, establishing product vision and roadmaps and drove decision-making across leadership, engineering, design, marketing, PR, legal and release teams through multiple product iterations on google.com/flights. \n \nTop launches include the following: \n+ Providing users with tips on how to change their flight to get a lower price and/or better experience \n+ Allowing users to save flights and share them with their travel partners \n+ Putting flight prices right into our date selector so users can be price-conscious from the start \n+ Working through technical constraints to develop a travel exploration feature where a user can get flight prices from their origin to top cities around the world \n+ Grouping flights results in commuter markets (e.g. LA -> NYC) for easier viewing, similar to transit schedules (also received patent for the UI) \n+ Launching the product in 20+ new languages and introducing currency selection for international users \n+ Evangelizing and representing the product both within the company as well as outside conferences and events such as being a keynote speaking at the Travel Executive Forum \n+ Revamping our PR and marketing efforts \n+ Actively recruiting for the Google, participating as a panelist at several external events and giving presentations at universities \n Associate Product Manager - Google Flight Search Google September 2013  –  August 2014  (1 year) Zurich Product manager for the Google Flights frontend.  \n \nMy responsibilities included:  \n+ Leading prioritization efforts, establishing product vision and roadmaps and drove decision-making across leadership, engineering, design, marketing, PR, legal and release teams through multiple product iterations on google.com/flights. \n \nTop launches include the following: \n+ Providing users with tips on how to change their flight to get a lower price and/or better experience \n+ Allowing users to save flights and share them with their travel partners \n+ Putting flight prices right into our date selector so users can be price-conscious from the start \n+ Working through technical constraints to develop a travel exploration feature where a user can get flight prices from their origin to top cities around the world \n+ Grouping flights results in commuter markets (e.g. LA -> NYC) for easier viewing, similar to transit schedules (also received patent for the UI) \n+ Launching the product in 20+ new languages and introducing currency selection for international users \n+ Evangelizing and representing the product both within the company as well as outside conferences and events such as being a keynote speaking at the Travel Executive Forum \n+ Revamping our PR and marketing efforts \n+ Actively recruiting for the Google, participating as a panelist at several external events and giving presentations at universities \n Teaching Assistant - Introductory Computer Science University of Washington dept of Computer Science June 2010  –  July 2013  (3 years 2 months) Greater Seattle Area Responsibilities included:  \n+ Designing lectures for and teaching introductory computer science courses. \n+ Providing individual tutoring for students and lead group review sessions.  \n+ Developing, leading and maintaining electronic bulletin boards, e-mail lists and discussion sites to facilitate learning and provide helped \n+ Acting as a liaison between students and professor \n Teaching Assistant - Introductory Computer Science University of Washington dept of Computer Science June 2010  –  July 2013  (3 years 2 months) Greater Seattle Area Responsibilities included:  \n+ Designing lectures for and teaching introductory computer science courses. \n+ Providing individual tutoring for students and lead group review sessions.  \n+ Developing, leading and maintaining electronic bulletin boards, e-mail lists and discussion sites to facilitate learning and provide helped \n+ Acting as a liaison between students and professor \n Associate Product Manager Intern - Google Hangouts Google June 2012  –  September 2012  (4 months) Mountain View, California Worked with design, engineering and leadership teams to launch the following features for Google Hangouts: \n+ Hangouts for user <18 years old on mobile devices \n+ Hangouts plugin page redesign \n+ Background replacement effect for video Hangouts \n+ Recording Hangouts abuse on mobile \n+ Hangouts low bandwidth optimization setting \n Associate Product Manager Intern - Google Hangouts Google June 2012  –  September 2012  (4 months) Mountain View, California Worked with design, engineering and leadership teams to launch the following features for Google Hangouts: \n+ Hangouts for user <18 years old on mobile devices \n+ Hangouts plugin page redesign \n+ Background replacement effect for video Hangouts \n+ Recording Hangouts abuse on mobile \n+ Hangouts low bandwidth optimization setting \n Software Engineering Intern - Google Search Google June 2011  –  August 2011  (3 months) Greater Seattle Area + Worked on the real-time analysis of queries (e.g. detecting when certain queries spike in popularity) \n+ Designed and implemented a MapReduce framework that enabled the evaluation and comparison of different model-building algorithms for real-time query detection, ultimately enabling the best model to be chosen to represent the frequency pattern for time series data. \n+ Using the above framework, reported which ideas for handling spike adjustment for specific data (e.g. queries) seem most promising to focus future model designs and implementations. \n+ Primary language used: c++ Software Engineering Intern - Google Search Google June 2011  –  August 2011  (3 months) Greater Seattle Area + Worked on the real-time analysis of queries (e.g. detecting when certain queries spike in popularity) \n+ Designed and implemented a MapReduce framework that enabled the evaluation and comparison of different model-building algorithms for real-time query detection, ultimately enabling the best model to be chosen to represent the frequency pattern for time series data. \n+ Using the above framework, reported which ideas for handling spike adjustment for specific data (e.g. queries) seem most promising to focus future model designs and implementations. \n+ Primary language used: c++ Research Assistant, Mobile ASL (American Sign Language) University of Washington dept of Electrical Eng. October 2009  –  August 2010  (11 months) Greater Seattle Area Research Assistant, Mobile ASL (American Sign Language) University of Washington dept of Electrical Eng. October 2009  –  August 2010  (11 months) Greater Seattle Area Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Java Computer Science JavaScript Human Computer... Algorithms C++ Machine Learning HTML CSS Software Engineering Research PHP User Experience User Interface Design Web Development Agile Methodologies See 1+     See less Skills  Java Computer Science JavaScript Human Computer... Algorithms C++ Machine Learning HTML CSS Software Engineering Research PHP User Experience User Interface Design Web Development Agile Methodologies See 1+     See less Java Computer Science JavaScript Human Computer... Algorithms C++ Machine Learning HTML CSS Software Engineering Research PHP User Experience User Interface Design Web Development Agile Methodologies See 1+     See less Java Computer Science JavaScript Human Computer... Algorithms C++ Machine Learning HTML CSS Software Engineering Research PHP User Experience User Interface Design Web Development Agile Methodologies See 1+     See less Education University of Washington Bachelor's degree,  Computer Engineering ,  Mathematics ,  Spanish , Senior 2009  – 2013 Activities and Societies:  Association for Computing Machinery ,  Swing Kids (Swing dancing focusing on Lindy Hop and Balboa) ,  UW CSE High School Outreach ,  UW Startup Weekend. Holy Names Academy High School,  Valedictorian 2005  – 2009 Activities and Societies:  National Honors Society ,  Knowledge Bowl Team ,  Spanish club (founder) ,  Physics club (founder) ,  Varsity Softball (4 years) ,  Basketball (3 years) ,  Crew (1 year). University of Washington Bachelor's degree,  Computer Engineering ,  Mathematics ,  Spanish , Senior 2009  – 2013 Activities and Societies:  Association for Computing Machinery ,  Swing Kids (Swing dancing focusing on Lindy Hop and Balboa) ,  UW CSE High School Outreach ,  UW Startup Weekend. University of Washington Bachelor's degree,  Computer Engineering ,  Mathematics ,  Spanish , Senior 2009  – 2013 Activities and Societies:  Association for Computing Machinery ,  Swing Kids (Swing dancing focusing on Lindy Hop and Balboa) ,  UW CSE High School Outreach ,  UW Startup Weekend. University of Washington Bachelor's degree,  Computer Engineering ,  Mathematics ,  Spanish , Senior 2009  – 2013 Activities and Societies:  Association for Computing Machinery ,  Swing Kids (Swing dancing focusing on Lindy Hop and Balboa) ,  UW CSE High School Outreach ,  UW Startup Weekend. Holy Names Academy High School,  Valedictorian 2005  – 2009 Activities and Societies:  National Honors Society ,  Knowledge Bowl Team ,  Spanish club (founder) ,  Physics club (founder) ,  Varsity Softball (4 years) ,  Basketball (3 years) ,  Crew (1 year). Holy Names Academy High School,  Valedictorian 2005  – 2009 Activities and Societies:  National Honors Society ,  Knowledge Bowl Team ,  Spanish club (founder) ,  Physics club (founder) ,  Varsity Softball (4 years) ,  Basketball (3 years) ,  Crew (1 year). Holy Names Academy High School,  Valedictorian 2005  – 2009 Activities and Societies:  National Honors Society ,  Knowledge Bowl Team ,  Spanish club (founder) ,  Physics club (founder) ,  Varsity Softball (4 years) ,  Basketball (3 years) ,  Crew (1 year). Honors & Awards Additional Honors & Awards Google Games 2013 - 1st Place Team \nTop 15% of class at University of Washington \nDean's List 9/10 quarters \nAnnual Dean's List 2010-2011, 2011-2012 \nSelected for the SEBA Mentorship Program \nOne of 20 students chosen from a class of 400+ for a Computer Science honors section \nGrace Hopper UW CSE Scholarship recipient \nValedictorian at Holy Names Academy \nNational Honors Society \nNational Merit Commended Scholar \nAP Scholar with Distinction \nVarsity Softball (4 years) Additional Honors & Awards Google Games 2013 - 1st Place Team \nTop 15% of class at University of Washington \nDean's List 9/10 quarters \nAnnual Dean's List 2010-2011, 2011-2012 \nSelected for the SEBA Mentorship Program \nOne of 20 students chosen from a class of 400+ for a Computer Science honors section \nGrace Hopper UW CSE Scholarship recipient \nValedictorian at Holy Names Academy \nNational Honors Society \nNational Merit Commended Scholar \nAP Scholar with Distinction \nVarsity Softball (4 years) Additional Honors & Awards Google Games 2013 - 1st Place Team \nTop 15% of class at University of Washington \nDean's List 9/10 quarters \nAnnual Dean's List 2010-2011, 2011-2012 \nSelected for the SEBA Mentorship Program \nOne of 20 students chosen from a class of 400+ for a Computer Science honors section \nGrace Hopper UW CSE Scholarship recipient \nValedictorian at Holy Names Academy \nNational Honors Society \nNational Merit Commended Scholar \nAP Scholar with Distinction \nVarsity Softball (4 years) Additional Honors & Awards Google Games 2013 - 1st Place Team \nTop 15% of class at University of Washington \nDean's List 9/10 quarters \nAnnual Dean's List 2010-2011, 2011-2012 \nSelected for the SEBA Mentorship Program \nOne of 20 students chosen from a class of 400+ for a Computer Science honors section \nGrace Hopper UW CSE Scholarship recipient \nValedictorian at Holy Names Academy \nNational Honors Society \nNational Merit Commended Scholar \nAP Scholar with Distinction \nVarsity Softball (4 years) ", "Experience Associate Marketing Manager, Google for Entrepreneurs Google June 2015  – Present (3 months) Community Manager, Glass Google January 2014  –  June 2015  (1 year 6 months) Social Media Strategist Google July 2012  –  December 2013  (1 year 6 months) Mountain View, CA One of first 100 employees dedicated to building profitable business, resulting in acquisition by Google \nDiligently manage, retain, and identify additional value for +30 accounts worth $1.6 million \nAnalyze strengths, weaknesses, opportunities, and threats of marketing calendarsto build social strategy \nGuide clients through suggested marketing plan to exceed overall business goals and objectives \nProactively identify areas of improvement and provide constructive feedback during live campaigns \nPrepare and distribute technical communication to strategists to provide essential updates to clients \nExecute quarterly projects to improve and develop internal and external relationships Client Experience Specialist Wildfire by Google October 2011  –  July 2012  (10 months) Redwood City, California Responsive first contact and consultant for social media campaigns in multitude of industries \nStrategically educated and engaged clients in discussion of the value in Wildfire’s platform \nConstructively edited and built client-facing tutorials to create better user process flow \nEducated direct team and new hires on industry trends and ability of platform \nAssigned additional responsibility to build and manage relationships with over 30 Custom clients Sales Associate Wildfire by Google March 2011  –  October 2011  (8 months) Productively generate and qualify new leads for Sales Executives to develop future business \nDiscover and understand the needs of potential clients to assist them in finding best solution using Wildfire's platform  \nEngage client's interest by demonstrating value and utility of social media marketing and product \nSuccessfully assisted in closing over $30,000 of new business in under four months Front Office Supervisor St. Regis Hotel August 2010  –  March 2011  (8 months) Professionally lead and manage 40 employees in daily operations five star, 260 room five star hotel \nServe as first and primary point of contact to resolve guest issues, concerns prior to and during stay \nFront office liaison in cross-departmental group that executes hotel promotions and serves both corporate and private events  \nSuccessfully promote hotel and amenities to potential guests through tours and meetings Account & Service Manager Starkey Productions & Pro Entertainment June 2009  –  August 2010  (1 year 3 months) Created event details, managed invoicing and billing, and reconciled payments of largest accounts \nOn-site producer overseeing successful production of events with from 70 to 5,000 guests in attendance \nLed brainstorming session and collaborated directly with customers and operations agents to produce events \nAttentive contact and operations agent in working with high-end clients to produce events \nEfficiently processed and managed data of entertainment bookings and master calendar Front of House Staff HRTM Educational Enterprise October 2007  –  January 2009  (1 year 4 months) Provided excellent customer service to guests attending events held in the HRTM building \nSet up and broke down for events such as faculty lunches, presentations, and weddings \nAsked to train new staff on serving procedures based on past outstanding performance Reservationist Hot Spots July 2007  –  September 2008  (1 year 3 months) Provided terrific customer service for clients seeking hotel rooms in the Santa Barbara area \nDeveloped strong phone skills by making hotel reservations for clients solely over the phone \nRan all areas of business successfully while manager was out of town and was asked to substitute for manager in her absence Associate Marketing Manager, Google for Entrepreneurs Google June 2015  – Present (3 months) Associate Marketing Manager, Google for Entrepreneurs Google June 2015  – Present (3 months) Community Manager, Glass Google January 2014  –  June 2015  (1 year 6 months) Community Manager, Glass Google January 2014  –  June 2015  (1 year 6 months) Social Media Strategist Google July 2012  –  December 2013  (1 year 6 months) Mountain View, CA One of first 100 employees dedicated to building profitable business, resulting in acquisition by Google \nDiligently manage, retain, and identify additional value for +30 accounts worth $1.6 million \nAnalyze strengths, weaknesses, opportunities, and threats of marketing calendarsto build social strategy \nGuide clients through suggested marketing plan to exceed overall business goals and objectives \nProactively identify areas of improvement and provide constructive feedback during live campaigns \nPrepare and distribute technical communication to strategists to provide essential updates to clients \nExecute quarterly projects to improve and develop internal and external relationships Social Media Strategist Google July 2012  –  December 2013  (1 year 6 months) Mountain View, CA One of first 100 employees dedicated to building profitable business, resulting in acquisition by Google \nDiligently manage, retain, and identify additional value for +30 accounts worth $1.6 million \nAnalyze strengths, weaknesses, opportunities, and threats of marketing calendarsto build social strategy \nGuide clients through suggested marketing plan to exceed overall business goals and objectives \nProactively identify areas of improvement and provide constructive feedback during live campaigns \nPrepare and distribute technical communication to strategists to provide essential updates to clients \nExecute quarterly projects to improve and develop internal and external relationships Client Experience Specialist Wildfire by Google October 2011  –  July 2012  (10 months) Redwood City, California Responsive first contact and consultant for social media campaigns in multitude of industries \nStrategically educated and engaged clients in discussion of the value in Wildfire’s platform \nConstructively edited and built client-facing tutorials to create better user process flow \nEducated direct team and new hires on industry trends and ability of platform \nAssigned additional responsibility to build and manage relationships with over 30 Custom clients Client Experience Specialist Wildfire by Google October 2011  –  July 2012  (10 months) Redwood City, California Responsive first contact and consultant for social media campaigns in multitude of industries \nStrategically educated and engaged clients in discussion of the value in Wildfire’s platform \nConstructively edited and built client-facing tutorials to create better user process flow \nEducated direct team and new hires on industry trends and ability of platform \nAssigned additional responsibility to build and manage relationships with over 30 Custom clients Sales Associate Wildfire by Google March 2011  –  October 2011  (8 months) Productively generate and qualify new leads for Sales Executives to develop future business \nDiscover and understand the needs of potential clients to assist them in finding best solution using Wildfire's platform  \nEngage client's interest by demonstrating value and utility of social media marketing and product \nSuccessfully assisted in closing over $30,000 of new business in under four months Sales Associate Wildfire by Google March 2011  –  October 2011  (8 months) Productively generate and qualify new leads for Sales Executives to develop future business \nDiscover and understand the needs of potential clients to assist them in finding best solution using Wildfire's platform  \nEngage client's interest by demonstrating value and utility of social media marketing and product \nSuccessfully assisted in closing over $30,000 of new business in under four months Front Office Supervisor St. Regis Hotel August 2010  –  March 2011  (8 months) Professionally lead and manage 40 employees in daily operations five star, 260 room five star hotel \nServe as first and primary point of contact to resolve guest issues, concerns prior to and during stay \nFront office liaison in cross-departmental group that executes hotel promotions and serves both corporate and private events  \nSuccessfully promote hotel and amenities to potential guests through tours and meetings Front Office Supervisor St. Regis Hotel August 2010  –  March 2011  (8 months) Professionally lead and manage 40 employees in daily operations five star, 260 room five star hotel \nServe as first and primary point of contact to resolve guest issues, concerns prior to and during stay \nFront office liaison in cross-departmental group that executes hotel promotions and serves both corporate and private events  \nSuccessfully promote hotel and amenities to potential guests through tours and meetings Account & Service Manager Starkey Productions & Pro Entertainment June 2009  –  August 2010  (1 year 3 months) Created event details, managed invoicing and billing, and reconciled payments of largest accounts \nOn-site producer overseeing successful production of events with from 70 to 5,000 guests in attendance \nLed brainstorming session and collaborated directly with customers and operations agents to produce events \nAttentive contact and operations agent in working with high-end clients to produce events \nEfficiently processed and managed data of entertainment bookings and master calendar Account & Service Manager Starkey Productions & Pro Entertainment June 2009  –  August 2010  (1 year 3 months) Created event details, managed invoicing and billing, and reconciled payments of largest accounts \nOn-site producer overseeing successful production of events with from 70 to 5,000 guests in attendance \nLed brainstorming session and collaborated directly with customers and operations agents to produce events \nAttentive contact and operations agent in working with high-end clients to produce events \nEfficiently processed and managed data of entertainment bookings and master calendar Front of House Staff HRTM Educational Enterprise October 2007  –  January 2009  (1 year 4 months) Provided excellent customer service to guests attending events held in the HRTM building \nSet up and broke down for events such as faculty lunches, presentations, and weddings \nAsked to train new staff on serving procedures based on past outstanding performance Front of House Staff HRTM Educational Enterprise October 2007  –  January 2009  (1 year 4 months) Provided excellent customer service to guests attending events held in the HRTM building \nSet up and broke down for events such as faculty lunches, presentations, and weddings \nAsked to train new staff on serving procedures based on past outstanding performance Reservationist Hot Spots July 2007  –  September 2008  (1 year 3 months) Provided terrific customer service for clients seeking hotel rooms in the Santa Barbara area \nDeveloped strong phone skills by making hotel reservations for clients solely over the phone \nRan all areas of business successfully while manager was out of town and was asked to substitute for manager in her absence Reservationist Hot Spots July 2007  –  September 2008  (1 year 3 months) Provided terrific customer service for clients seeking hotel rooms in the Santa Barbara area \nDeveloped strong phone skills by making hotel reservations for clients solely over the phone \nRan all areas of business successfully while manager was out of town and was asked to substitute for manager in her absence Languages Spanish Spanish Spanish Skills Hotels New Business Development Salesforce.com Facebook Customer Service Social Media Sales Outlook Event Planning Social Media Marketing PowerPoint Market Research Microsoft Office Teamwork Microsoft Excel Microsoft Word Marketing Social Networking Account Management Team Leadership Digital Marketing Online Marketing CRM Strategy Marketing Strategy Wearable Computing Web Community Management See 12+     See less Skills  Hotels New Business Development Salesforce.com Facebook Customer Service Social Media Sales Outlook Event Planning Social Media Marketing PowerPoint Market Research Microsoft Office Teamwork Microsoft Excel Microsoft Word Marketing Social Networking Account Management Team Leadership Digital Marketing Online Marketing CRM Strategy Marketing Strategy Wearable Computing Web Community Management See 12+     See less Hotels New Business Development Salesforce.com Facebook Customer Service Social Media Sales Outlook Event Planning Social Media Marketing PowerPoint Market Research Microsoft Office Teamwork Microsoft Excel Microsoft Word Marketing Social Networking Account Management Team Leadership Digital Marketing Online Marketing CRM Strategy Marketing Strategy Wearable Computing Web Community Management See 12+     See less Hotels New Business Development Salesforce.com Facebook Customer Service Social Media Sales Outlook Event Planning Social Media Marketing PowerPoint Market Research Microsoft Office Teamwork Microsoft Excel Microsoft Word Marketing Social Networking Account Management Team Leadership Digital Marketing Online Marketing CRM Strategy Marketing Strategy Wearable Computing Web Community Management See 12+     See less Education University of Denver (DU) Bachelor of Science,  Business Administration 2006  – 2010 Dos Pueblos 2002  – 2006 University of Denver (DU) Bachelor of Science,  Business Administration 2006  – 2010 University of Denver (DU) Bachelor of Science,  Business Administration 2006  – 2010 University of Denver (DU) Bachelor of Science,  Business Administration 2006  – 2010 Dos Pueblos 2002  – 2006 Dos Pueblos 2002  – 2006 Dos Pueblos 2002  – 2006 ", "Experience Associate Manager, Google Staffing Google May 2012  – Present (3 years 4 months) Staffing Team Lead Google March 2010  –  May 2012  (2 years 3 months) Recruiting Specialist Google March 2007  –  March 2010  (3 years 1 month) Recruitment Consultant Oracle Corporation, Ireland 2004  –  2007  (3 years) Trainee Recruitment Consultant Meghen Group 2003  –  2004  (1 year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Associate Manager, Google Staffing Google May 2012  – Present (3 years 4 months) Associate Manager, Google Staffing Google May 2012  – Present (3 years 4 months) Staffing Team Lead Google March 2010  –  May 2012  (2 years 3 months) Staffing Team Lead Google March 2010  –  May 2012  (2 years 3 months) Recruiting Specialist Google March 2007  –  March 2010  (3 years 1 month) Recruiting Specialist Google March 2007  –  March 2010  (3 years 1 month) Recruitment Consultant Oracle Corporation, Ireland 2004  –  2007  (3 years) Recruitment Consultant Oracle Corporation, Ireland 2004  –  2007  (3 years) Trainee Recruitment Consultant Meghen Group 2003  –  2004  (1 year) Trainee Recruitment Consultant Meghen Group 2003  –  2004  (1 year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Skills Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Skills  Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Education Dublin City University University of Vienna Universität des Saarlandes Dublin City University Dublin City University Dublin City University University of Vienna University of Vienna University of Vienna Universität des Saarlandes Universität des Saarlandes Universität des Saarlandes Honors & Awards Additional Honors & Awards DAAD Scholarship \nOAD Scholarship Additional Honors & Awards DAAD Scholarship \nOAD Scholarship Additional Honors & Awards DAAD Scholarship \nOAD Scholarship Additional Honors & Awards DAAD Scholarship \nOAD Scholarship ", "Experience Associate Manager, Google Staffing Google May 2012  – Present (3 years 4 months) Staffing Team Lead Google March 2010  –  May 2012  (2 years 3 months) Recruiting Specialist Google March 2007  –  March 2010  (3 years 1 month) Recruitment Consultant Oracle Corporation, Ireland 2004  –  2007  (3 years) Trainee Recruitment Consultant Meghen Group 2003  –  2004  (1 year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Associate Manager, Google Staffing Google May 2012  – Present (3 years 4 months) Associate Manager, Google Staffing Google May 2012  – Present (3 years 4 months) Staffing Team Lead Google March 2010  –  May 2012  (2 years 3 months) Staffing Team Lead Google March 2010  –  May 2012  (2 years 3 months) Recruiting Specialist Google March 2007  –  March 2010  (3 years 1 month) Recruiting Specialist Google March 2007  –  March 2010  (3 years 1 month) Recruitment Consultant Oracle Corporation, Ireland 2004  –  2007  (3 years) Recruitment Consultant Oracle Corporation, Ireland 2004  –  2007  (3 years) Trainee Recruitment Consultant Meghen Group 2003  –  2004  (1 year) Trainee Recruitment Consultant Meghen Group 2003  –  2004  (1 year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Intern IBM 1997  –  1997  (less than a year) Skills Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Skills  Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Technical Recruiting Recruiting Team Building Talent Acquisition Business Strategy Interviews Management Talent Management Temporary Placement Team Leadership Sourcing Executive Search Screening Resumes Graduate Recruitment Education Dublin City University University of Vienna Universität des Saarlandes Dublin City University Dublin City University Dublin City University University of Vienna University of Vienna University of Vienna Universität des Saarlandes Universität des Saarlandes Universität des Saarlandes Honors & Awards Additional Honors & Awards DAAD Scholarship \nOAD Scholarship Additional Honors & Awards DAAD Scholarship \nOAD Scholarship Additional Honors & Awards DAAD Scholarship \nOAD Scholarship Additional Honors & Awards DAAD Scholarship \nOAD Scholarship ", "Experience Manager, Google Grants Google October 2013  – Present (1 year 11 months) Associate Manager, Google Grants Google March 2011  – Present (4 years 6 months) Associate Manager AdSense Sales Google April 2010  –  2011  (1 year) AdSense Team Lead, Online Sales Google March 2009  –  April 2010  (1 year 2 months) AdSense Senior Strategist Google March 2008  –  March 2009  (1 year 1 month) AdSense Account Strategist Google February 2007  –  March 2008  (1 year 2 months) AdSense Account Coordinator Google July 2006  –  February 2007  (8 months) Intern Office of Senator Dianne Feinstein 2004  –  2004  (less than a year) Intern U.S. Senator Dianne Feinstein 2004  –  2004  (less than a year) Manager, Google Grants Google October 2013  – Present (1 year 11 months) Manager, Google Grants Google October 2013  – Present (1 year 11 months) Associate Manager, Google Grants Google March 2011  – Present (4 years 6 months) Associate Manager, Google Grants Google March 2011  – Present (4 years 6 months) Associate Manager AdSense Sales Google April 2010  –  2011  (1 year) Associate Manager AdSense Sales Google April 2010  –  2011  (1 year) AdSense Team Lead, Online Sales Google March 2009  –  April 2010  (1 year 2 months) AdSense Team Lead, Online Sales Google March 2009  –  April 2010  (1 year 2 months) AdSense Senior Strategist Google March 2008  –  March 2009  (1 year 1 month) AdSense Senior Strategist Google March 2008  –  March 2009  (1 year 1 month) AdSense Account Strategist Google February 2007  –  March 2008  (1 year 2 months) AdSense Account Strategist Google February 2007  –  March 2008  (1 year 2 months) AdSense Account Coordinator Google July 2006  –  February 2007  (8 months) AdSense Account Coordinator Google July 2006  –  February 2007  (8 months) Intern Office of Senator Dianne Feinstein 2004  –  2004  (less than a year) Intern Office of Senator Dianne Feinstein 2004  –  2004  (less than a year) Intern U.S. Senator Dianne Feinstein 2004  –  2004  (less than a year) Intern U.S. Senator Dianne Feinstein 2004  –  2004  (less than a year) Skills Online Advertising Adsense Skills  Online Advertising Adsense Online Advertising Adsense Online Advertising Adsense Education Stanford University 2004  – 2006 Duke University 2002  – 2004 Stanford University 2004  – 2006 Stanford University 2004  – 2006 Stanford University 2004  – 2006 Duke University 2002  – 2004 Duke University 2002  – 2004 Duke University 2002  – 2004 ", "Summary Politics and International Studies graduate, with solid public relations/corporate communications experience. I have assisted accounts from the energy, technology, healthcare, urban development, alcoholic beverages and gambling industries. Experience in media relations, stakeholder outreach and CSR strategies. \n \nCurrently working as an Online Specialist at Google's EU Headquarters in Dublin, helping to grow the SMB landscape in Greece and Cyprus through online advertising and presence with AdWords, Google Analytics and Google My Business. Summary Politics and International Studies graduate, with solid public relations/corporate communications experience. I have assisted accounts from the energy, technology, healthcare, urban development, alcoholic beverages and gambling industries. Experience in media relations, stakeholder outreach and CSR strategies. \n \nCurrently working as an Online Specialist at Google's EU Headquarters in Dublin, helping to grow the SMB landscape in Greece and Cyprus through online advertising and presence with AdWords, Google Analytics and Google My Business. Politics and International Studies graduate, with solid public relations/corporate communications experience. I have assisted accounts from the energy, technology, healthcare, urban development, alcoholic beverages and gambling industries. Experience in media relations, stakeholder outreach and CSR strategies. \n \nCurrently working as an Online Specialist at Google's EU Headquarters in Dublin, helping to grow the SMB landscape in Greece and Cyprus through online advertising and presence with AdWords, Google Analytics and Google My Business. Politics and International Studies graduate, with solid public relations/corporate communications experience. I have assisted accounts from the energy, technology, healthcare, urban development, alcoholic beverages and gambling industries. Experience in media relations, stakeholder outreach and CSR strategies. \n \nCurrently working as an Online Specialist at Google's EU Headquarters in Dublin, helping to grow the SMB landscape in Greece and Cyprus through online advertising and presence with AdWords, Google Analytics and Google My Business. Experience Google for Work Boomerang Rotation Google June 2015  – Present (3 months) United Arab Emirates - Led a government collaboration initiative for MENA & SSA \n- Offering a trilateral framework to digitalize government, EDUs, SMEs \n- Conducted research to identify opportunities in each market and map the SME landscape in each country \n- Created project plan, worked on communication and decks to tailor the offering. \n Associate Account Strategist Google January 2014  – Present (1 year 8 months) Ireland - Worked in the Global Customer Experience team assisting SMB advertisers operating in Emerging and Growing markets. \n- Led an initiative to educate online advertisers in Greece and Cyprus through the Google AdWords Online School, a series of YouTube tutorials on AdWords, Analytics and Google My Business. \n- Ran business development projects focused on growing the Travel industry in Greece. Team Lead - START Exhibitor Assistant Web Summit November 2014  –  November 2014  (1 month) Ireland Volunteered at the Web Summit 2014, where I assisted high potential start-ups from the Enterprise industry, leading a team of more than 15 volunteers. I was the first point of contact for the start-ups and helped them through the conference. Media Relations Assistant Drassi April 2012  –  July 2013  (1 year 4 months) Athens, Greece - Worked on the campaign and communication strategy for the May and June 2012 general election in Greece \n- Liaised with national/local media and achieved free coverage, on- and off-line \n- Drafted press releases and speeches \n- Assisted with organization and implementation of two party Conventions (December 2012 and May 2013) \n- Elected on the 100-member Central Committee of the party Intern Thomson Reuters February 2013  –  February 2013  (1 month) - Media monitoring for story ideas \n- Assisted correspondents with research for stories, translations and transcriptions, pitched story ideas. Corporate and Public Affairs Trainee Advocate/Burson-Marsteller March 2012  –  July 2012  (5 months) Greece - Government Relations for clients from the energy & industrials, gambling and alcoholic beverages industries \n- Co-authored the Greek section of the \"G20 Influencers\" study, launched by Burson-Marsteller (http://www.g20influencers.com/). Adviser, Permanent Mission of Greece United Nations July 2011  –  December 2011  (6 months) Greater New York City Area - Security Council: Middle East & Africa regions \n- United Nations General Assembly: First Committee (Disarmament Committee) Talks Organizer Warwick International Development Summit March 2010  –  March 2011  (1 year 1 month) Coventry, United Kingdom Worked with a team of 3 to decide on the theme of the Summit and relevant topics to address. Research to identify potential speakers from international organizations (World Bank, WTO), academic and third-sector institutions, as well as politicians, looking into areas of expertise. Liaising with these institutions taught me to communicate professionally with high-profile individuals. Always employing excellent organizational and project management skills, I was taught to see a project to an end. The team managed to collaborate in great harmony and, eventually, to plan and organize the single most successful and well-attended event at Warwick University. Industry and Public Affairs Intern V+O Communication July 2010  –  August 2010  (2 months) Greece - Traditional corporate affairs services: publicity monitoring and evaluation, activity reports based on objectives, targets and competition benchmark, updating of media lists. \n- Research for development of CSR campaigns and reputation building among local communities. Google for Work Boomerang Rotation Google June 2015  – Present (3 months) United Arab Emirates - Led a government collaboration initiative for MENA & SSA \n- Offering a trilateral framework to digitalize government, EDUs, SMEs \n- Conducted research to identify opportunities in each market and map the SME landscape in each country \n- Created project plan, worked on communication and decks to tailor the offering. \n Google for Work Boomerang Rotation Google June 2015  – Present (3 months) United Arab Emirates - Led a government collaboration initiative for MENA & SSA \n- Offering a trilateral framework to digitalize government, EDUs, SMEs \n- Conducted research to identify opportunities in each market and map the SME landscape in each country \n- Created project plan, worked on communication and decks to tailor the offering. \n Associate Account Strategist Google January 2014  – Present (1 year 8 months) Ireland - Worked in the Global Customer Experience team assisting SMB advertisers operating in Emerging and Growing markets. \n- Led an initiative to educate online advertisers in Greece and Cyprus through the Google AdWords Online School, a series of YouTube tutorials on AdWords, Analytics and Google My Business. \n- Ran business development projects focused on growing the Travel industry in Greece. Associate Account Strategist Google January 2014  – Present (1 year 8 months) Ireland - Worked in the Global Customer Experience team assisting SMB advertisers operating in Emerging and Growing markets. \n- Led an initiative to educate online advertisers in Greece and Cyprus through the Google AdWords Online School, a series of YouTube tutorials on AdWords, Analytics and Google My Business. \n- Ran business development projects focused on growing the Travel industry in Greece. Team Lead - START Exhibitor Assistant Web Summit November 2014  –  November 2014  (1 month) Ireland Volunteered at the Web Summit 2014, where I assisted high potential start-ups from the Enterprise industry, leading a team of more than 15 volunteers. I was the first point of contact for the start-ups and helped them through the conference. Team Lead - START Exhibitor Assistant Web Summit November 2014  –  November 2014  (1 month) Ireland Volunteered at the Web Summit 2014, where I assisted high potential start-ups from the Enterprise industry, leading a team of more than 15 volunteers. I was the first point of contact for the start-ups and helped them through the conference. Media Relations Assistant Drassi April 2012  –  July 2013  (1 year 4 months) Athens, Greece - Worked on the campaign and communication strategy for the May and June 2012 general election in Greece \n- Liaised with national/local media and achieved free coverage, on- and off-line \n- Drafted press releases and speeches \n- Assisted with organization and implementation of two party Conventions (December 2012 and May 2013) \n- Elected on the 100-member Central Committee of the party Media Relations Assistant Drassi April 2012  –  July 2013  (1 year 4 months) Athens, Greece - Worked on the campaign and communication strategy for the May and June 2012 general election in Greece \n- Liaised with national/local media and achieved free coverage, on- and off-line \n- Drafted press releases and speeches \n- Assisted with organization and implementation of two party Conventions (December 2012 and May 2013) \n- Elected on the 100-member Central Committee of the party Intern Thomson Reuters February 2013  –  February 2013  (1 month) - Media monitoring for story ideas \n- Assisted correspondents with research for stories, translations and transcriptions, pitched story ideas. Intern Thomson Reuters February 2013  –  February 2013  (1 month) - Media monitoring for story ideas \n- Assisted correspondents with research for stories, translations and transcriptions, pitched story ideas. Corporate and Public Affairs Trainee Advocate/Burson-Marsteller March 2012  –  July 2012  (5 months) Greece - Government Relations for clients from the energy & industrials, gambling and alcoholic beverages industries \n- Co-authored the Greek section of the \"G20 Influencers\" study, launched by Burson-Marsteller (http://www.g20influencers.com/). Corporate and Public Affairs Trainee Advocate/Burson-Marsteller March 2012  –  July 2012  (5 months) Greece - Government Relations for clients from the energy & industrials, gambling and alcoholic beverages industries \n- Co-authored the Greek section of the \"G20 Influencers\" study, launched by Burson-Marsteller (http://www.g20influencers.com/). Adviser, Permanent Mission of Greece United Nations July 2011  –  December 2011  (6 months) Greater New York City Area - Security Council: Middle East & Africa regions \n- United Nations General Assembly: First Committee (Disarmament Committee) Adviser, Permanent Mission of Greece United Nations July 2011  –  December 2011  (6 months) Greater New York City Area - Security Council: Middle East & Africa regions \n- United Nations General Assembly: First Committee (Disarmament Committee) Talks Organizer Warwick International Development Summit March 2010  –  March 2011  (1 year 1 month) Coventry, United Kingdom Worked with a team of 3 to decide on the theme of the Summit and relevant topics to address. Research to identify potential speakers from international organizations (World Bank, WTO), academic and third-sector institutions, as well as politicians, looking into areas of expertise. Liaising with these institutions taught me to communicate professionally with high-profile individuals. Always employing excellent organizational and project management skills, I was taught to see a project to an end. The team managed to collaborate in great harmony and, eventually, to plan and organize the single most successful and well-attended event at Warwick University. Talks Organizer Warwick International Development Summit March 2010  –  March 2011  (1 year 1 month) Coventry, United Kingdom Worked with a team of 3 to decide on the theme of the Summit and relevant topics to address. Research to identify potential speakers from international organizations (World Bank, WTO), academic and third-sector institutions, as well as politicians, looking into areas of expertise. Liaising with these institutions taught me to communicate professionally with high-profile individuals. Always employing excellent organizational and project management skills, I was taught to see a project to an end. The team managed to collaborate in great harmony and, eventually, to plan and organize the single most successful and well-attended event at Warwick University. Industry and Public Affairs Intern V+O Communication July 2010  –  August 2010  (2 months) Greece - Traditional corporate affairs services: publicity monitoring and evaluation, activity reports based on objectives, targets and competition benchmark, updating of media lists. \n- Research for development of CSR campaigns and reputation building among local communities. Industry and Public Affairs Intern V+O Communication July 2010  –  August 2010  (2 months) Greece - Traditional corporate affairs services: publicity monitoring and evaluation, activity reports based on objectives, targets and competition benchmark, updating of media lists. \n- Research for development of CSR campaigns and reputation building among local communities. Languages English Native or bilingual proficiency Greek Native or bilingual proficiency French Limited working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency French Limited working proficiency Spanish Elementary proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency French Limited working proficiency Spanish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Media Relations Public Affairs Political Communication Public Relations Foreign Policy Corporate Communications Google Adwords Google Analytics International Relations Social Media American Politics Google Apps Press Releases Government Relations Political Campaigns Public Speaking Online Advertising See 2+     See less Skills  Media Relations Public Affairs Political Communication Public Relations Foreign Policy Corporate Communications Google Adwords Google Analytics International Relations Social Media American Politics Google Apps Press Releases Government Relations Political Campaigns Public Speaking Online Advertising See 2+     See less Media Relations Public Affairs Political Communication Public Relations Foreign Policy Corporate Communications Google Adwords Google Analytics International Relations Social Media American Politics Google Apps Press Releases Government Relations Political Campaigns Public Speaking Online Advertising See 2+     See less Media Relations Public Affairs Political Communication Public Relations Foreign Policy Corporate Communications Google Adwords Google Analytics International Relations Social Media American Politics Google Apps Press Releases Government Relations Political Campaigns Public Speaking Online Advertising See 2+     See less Education New York University Non-degree coursework - School of Continuing and Professional Studies,  Public Relations Functions and Practices , A- 2011  – 2011 University of Warwick Bachelor of Arts (B.A.),  Politics and International Studies , Upper Second Class (2:1) 2008  – 2011 -Dissertation Title: 'Hollywood and the Iraq War: Screen Politics in the Post-9/11 Era\" Activities and Societies:  Vice President - Hellenic Society ,  Deputy Head of Talks Team - Warwick International Development Summit ,  Member - Model United Nations ,  Politics ,  International Current Affairs. London School of Economics and Political Science Summer School,  Understanding Foreign Policy: the diplomacy of war , profit and justice. 2009  – 2009 Hellenic American Educational Foundation International Baccalaureate,  English A2 ,  Business and Management ,  Social and Cultural Anthropology 2002  – 2008 Activities and Societies:  Model United Nations ,  Drama ,  UNESCO New York University Non-degree coursework - School of Continuing and Professional Studies,  Public Relations Functions and Practices , A- 2011  – 2011 New York University Non-degree coursework - School of Continuing and Professional Studies,  Public Relations Functions and Practices , A- 2011  – 2011 New York University Non-degree coursework - School of Continuing and Professional Studies,  Public Relations Functions and Practices , A- 2011  – 2011 University of Warwick Bachelor of Arts (B.A.),  Politics and International Studies , Upper Second Class (2:1) 2008  – 2011 -Dissertation Title: 'Hollywood and the Iraq War: Screen Politics in the Post-9/11 Era\" Activities and Societies:  Vice President - Hellenic Society ,  Deputy Head of Talks Team - Warwick International Development Summit ,  Member - Model United Nations ,  Politics ,  International Current Affairs. University of Warwick Bachelor of Arts (B.A.),  Politics and International Studies , Upper Second Class (2:1) 2008  – 2011 -Dissertation Title: 'Hollywood and the Iraq War: Screen Politics in the Post-9/11 Era\" Activities and Societies:  Vice President - Hellenic Society ,  Deputy Head of Talks Team - Warwick International Development Summit ,  Member - Model United Nations ,  Politics ,  International Current Affairs. University of Warwick Bachelor of Arts (B.A.),  Politics and International Studies , Upper Second Class (2:1) 2008  – 2011 -Dissertation Title: 'Hollywood and the Iraq War: Screen Politics in the Post-9/11 Era\" Activities and Societies:  Vice President - Hellenic Society ,  Deputy Head of Talks Team - Warwick International Development Summit ,  Member - Model United Nations ,  Politics ,  International Current Affairs. London School of Economics and Political Science Summer School,  Understanding Foreign Policy: the diplomacy of war , profit and justice. 2009  – 2009 London School of Economics and Political Science Summer School,  Understanding Foreign Policy: the diplomacy of war , profit and justice. 2009  – 2009 London School of Economics and Political Science Summer School,  Understanding Foreign Policy: the diplomacy of war , profit and justice. 2009  – 2009 Hellenic American Educational Foundation International Baccalaureate,  English A2 ,  Business and Management ,  Social and Cultural Anthropology 2002  – 2008 Activities and Societies:  Model United Nations ,  Drama ,  UNESCO Hellenic American Educational Foundation International Baccalaureate,  English A2 ,  Business and Management ,  Social and Cultural Anthropology 2002  – 2008 Activities and Societies:  Model United Nations ,  Drama ,  UNESCO Hellenic American Educational Foundation International Baccalaureate,  English A2 ,  Business and Management ,  Social and Cultural Anthropology 2002  – 2008 Activities and Societies:  Model United Nations ,  Drama ,  UNESCO ", "Experience Associate Product Marketing Manager, Google Cloud Platform Google January 2014  – Present (1 year 8 months) -Lead Google Cloud Platform growth metrics focused on online acquisition and new user engagement. Manage acquisition strategy for various launches and marketing campaigns \n-Launched GCP Free Trial program with performance tracking fully implemented. Led a cross functional product and engineering team in building an end-to-end performance data model for measuring user acquisition and early engagement \n-Led and maintained Google Analytics implementation across all Google for Work marketing properties \n Enterprise Technical Associate Google October 2011  –  January 2014  (2 years 4 months) Mountain View, California Enterprise Support Business Analyst \n- Member of small global business analyst team within Enterprise Operations \n- Build and maintain infrastructure for dashboards and reports based on high level operational metrics, mostly focused on Google Apps technical and customer support \n- Establish pipelines combining relevant cross-functional data from throughout Google \n- Generate analysis and insights based on available data using Dremel query engine (BigQuery) \n \nTechnical Support Specialist \n- Provided technical support to Google Apps enterprise and education customers \n- Scaled support through updating internal and external documentation, improving processes, and coordinating with product, security, legal and engineering teams to drive product changes. GIS Analyst EA Engineering, Science, and Technology, Inc. August 2010  –  October 2011  (1 year 3 months) Broadband Rhode Island Web Map - Gathered and processed broadband coverage data from all primary ISPs in Rhode Island to conform with national standards to display on a digital atlas powered by Silverlight and ArcGIS Server. Data processing was done via Python scripts. \nWeb-based Environmental Management Information Systems - Provided geographic data development support and maintained enterprise geo-databases for state and federal government entities. GIS Analyst The Response Group (BP Oil Spill Response Contractor) May 2010  –  July 2010  (3 months) — Sector Mobile area of responsibility includes Mississippi, Alabama, and Florida panhandle coast and barrier islands. Earliest responsibilities included tracking placement of containment and sorbent boom based on booming strategies intended to protect environmentally sensitive areas. Project later included instituting the use of Nomad Trimble GPS units with ArcMobile software to verify boom location information. Duties expanded to include disseminating geographic data to various federal, state, local, and private entities. Compiled daily flight plan map, a visual representation of all flight coverage plans from USCG, BP, Florida Fish and Wildlife, Mississippi Air National Guard, and other agencies. Lead in the creation of aerial oil observations dataset. Teamed with NOAA employees and USCG to create a standard form for aerial observers to be used in all other Incident Command Posts. Worked with ESRI consultants in the expedited creation of an SDE, ArcIMS, and internal Flex viewer for Incident Command meetings. GIS Intern Texas General Land Office January 2010  –  June 2010  (6 months) Texas Sediment Geodatabase– Populated the coastal sediments geo-database (“TxSed”) to help connect sediment sources with potential restoration by evaluating studies from USACE and various academic institutions (TAMUG, TAMUCC). Converted data from PDF and CAD files into feature classes. Collaborated with interdisciplinary team of engineers, geologists, and database administrators. Final result of database is an interactive web map viewer. \n \nFarm and Ranch Land Conservation Program— Evaluated and modified geographic analysis for Texas farm & ranch conservation priority land. Presented results at Texas Land Trust Council Conference on behalf of the GLO. \n \nCoastal Erosion Planning and Response Act— Used airborne LiDAR data to calculate mean sea level, mean high-high water, sand dune boundaries, and line of vegetation for Open Beaches Act enforcement. Also created maps to assist federal home buyouts post-Hurricane Ike. Mapping Technician Drillinginfo September 2009  –  December 2009  (4 months) LandTrac Unified Land and Exploration Suite— Interpreted metes and bounds on oil and gas leases in Texas and Louisiana dating back to 18th century to determine and plot the boundary locations. Barista Starbucks Coffee Company September 2007  –  December 2008  (1 year 4 months) Cornerstone Fellow, Counselor, Photography Specialist URJ Greene Family Camp June 2008  –  July 2008  (2 months) Associate Product Marketing Manager, Google Cloud Platform Google January 2014  – Present (1 year 8 months) -Lead Google Cloud Platform growth metrics focused on online acquisition and new user engagement. Manage acquisition strategy for various launches and marketing campaigns \n-Launched GCP Free Trial program with performance tracking fully implemented. Led a cross functional product and engineering team in building an end-to-end performance data model for measuring user acquisition and early engagement \n-Led and maintained Google Analytics implementation across all Google for Work marketing properties \n Associate Product Marketing Manager, Google Cloud Platform Google January 2014  – Present (1 year 8 months) -Lead Google Cloud Platform growth metrics focused on online acquisition and new user engagement. Manage acquisition strategy for various launches and marketing campaigns \n-Launched GCP Free Trial program with performance tracking fully implemented. Led a cross functional product and engineering team in building an end-to-end performance data model for measuring user acquisition and early engagement \n-Led and maintained Google Analytics implementation across all Google for Work marketing properties \n Enterprise Technical Associate Google October 2011  –  January 2014  (2 years 4 months) Mountain View, California Enterprise Support Business Analyst \n- Member of small global business analyst team within Enterprise Operations \n- Build and maintain infrastructure for dashboards and reports based on high level operational metrics, mostly focused on Google Apps technical and customer support \n- Establish pipelines combining relevant cross-functional data from throughout Google \n- Generate analysis and insights based on available data using Dremel query engine (BigQuery) \n \nTechnical Support Specialist \n- Provided technical support to Google Apps enterprise and education customers \n- Scaled support through updating internal and external documentation, improving processes, and coordinating with product, security, legal and engineering teams to drive product changes. Enterprise Technical Associate Google October 2011  –  January 2014  (2 years 4 months) Mountain View, California Enterprise Support Business Analyst \n- Member of small global business analyst team within Enterprise Operations \n- Build and maintain infrastructure for dashboards and reports based on high level operational metrics, mostly focused on Google Apps technical and customer support \n- Establish pipelines combining relevant cross-functional data from throughout Google \n- Generate analysis and insights based on available data using Dremel query engine (BigQuery) \n \nTechnical Support Specialist \n- Provided technical support to Google Apps enterprise and education customers \n- Scaled support through updating internal and external documentation, improving processes, and coordinating with product, security, legal and engineering teams to drive product changes. GIS Analyst EA Engineering, Science, and Technology, Inc. August 2010  –  October 2011  (1 year 3 months) Broadband Rhode Island Web Map - Gathered and processed broadband coverage data from all primary ISPs in Rhode Island to conform with national standards to display on a digital atlas powered by Silverlight and ArcGIS Server. Data processing was done via Python scripts. \nWeb-based Environmental Management Information Systems - Provided geographic data development support and maintained enterprise geo-databases for state and federal government entities. GIS Analyst EA Engineering, Science, and Technology, Inc. August 2010  –  October 2011  (1 year 3 months) Broadband Rhode Island Web Map - Gathered and processed broadband coverage data from all primary ISPs in Rhode Island to conform with national standards to display on a digital atlas powered by Silverlight and ArcGIS Server. Data processing was done via Python scripts. \nWeb-based Environmental Management Information Systems - Provided geographic data development support and maintained enterprise geo-databases for state and federal government entities. GIS Analyst The Response Group (BP Oil Spill Response Contractor) May 2010  –  July 2010  (3 months) — Sector Mobile area of responsibility includes Mississippi, Alabama, and Florida panhandle coast and barrier islands. Earliest responsibilities included tracking placement of containment and sorbent boom based on booming strategies intended to protect environmentally sensitive areas. Project later included instituting the use of Nomad Trimble GPS units with ArcMobile software to verify boom location information. Duties expanded to include disseminating geographic data to various federal, state, local, and private entities. Compiled daily flight plan map, a visual representation of all flight coverage plans from USCG, BP, Florida Fish and Wildlife, Mississippi Air National Guard, and other agencies. Lead in the creation of aerial oil observations dataset. Teamed with NOAA employees and USCG to create a standard form for aerial observers to be used in all other Incident Command Posts. Worked with ESRI consultants in the expedited creation of an SDE, ArcIMS, and internal Flex viewer for Incident Command meetings. GIS Analyst The Response Group (BP Oil Spill Response Contractor) May 2010  –  July 2010  (3 months) — Sector Mobile area of responsibility includes Mississippi, Alabama, and Florida panhandle coast and barrier islands. Earliest responsibilities included tracking placement of containment and sorbent boom based on booming strategies intended to protect environmentally sensitive areas. Project later included instituting the use of Nomad Trimble GPS units with ArcMobile software to verify boom location information. Duties expanded to include disseminating geographic data to various federal, state, local, and private entities. Compiled daily flight plan map, a visual representation of all flight coverage plans from USCG, BP, Florida Fish and Wildlife, Mississippi Air National Guard, and other agencies. Lead in the creation of aerial oil observations dataset. Teamed with NOAA employees and USCG to create a standard form for aerial observers to be used in all other Incident Command Posts. Worked with ESRI consultants in the expedited creation of an SDE, ArcIMS, and internal Flex viewer for Incident Command meetings. GIS Intern Texas General Land Office January 2010  –  June 2010  (6 months) Texas Sediment Geodatabase– Populated the coastal sediments geo-database (“TxSed”) to help connect sediment sources with potential restoration by evaluating studies from USACE and various academic institutions (TAMUG, TAMUCC). Converted data from PDF and CAD files into feature classes. Collaborated with interdisciplinary team of engineers, geologists, and database administrators. Final result of database is an interactive web map viewer. \n \nFarm and Ranch Land Conservation Program— Evaluated and modified geographic analysis for Texas farm & ranch conservation priority land. Presented results at Texas Land Trust Council Conference on behalf of the GLO. \n \nCoastal Erosion Planning and Response Act— Used airborne LiDAR data to calculate mean sea level, mean high-high water, sand dune boundaries, and line of vegetation for Open Beaches Act enforcement. Also created maps to assist federal home buyouts post-Hurricane Ike. GIS Intern Texas General Land Office January 2010  –  June 2010  (6 months) Texas Sediment Geodatabase– Populated the coastal sediments geo-database (“TxSed”) to help connect sediment sources with potential restoration by evaluating studies from USACE and various academic institutions (TAMUG, TAMUCC). Converted data from PDF and CAD files into feature classes. Collaborated with interdisciplinary team of engineers, geologists, and database administrators. Final result of database is an interactive web map viewer. \n \nFarm and Ranch Land Conservation Program— Evaluated and modified geographic analysis for Texas farm & ranch conservation priority land. Presented results at Texas Land Trust Council Conference on behalf of the GLO. \n \nCoastal Erosion Planning and Response Act— Used airborne LiDAR data to calculate mean sea level, mean high-high water, sand dune boundaries, and line of vegetation for Open Beaches Act enforcement. Also created maps to assist federal home buyouts post-Hurricane Ike. Mapping Technician Drillinginfo September 2009  –  December 2009  (4 months) LandTrac Unified Land and Exploration Suite— Interpreted metes and bounds on oil and gas leases in Texas and Louisiana dating back to 18th century to determine and plot the boundary locations. Mapping Technician Drillinginfo September 2009  –  December 2009  (4 months) LandTrac Unified Land and Exploration Suite— Interpreted metes and bounds on oil and gas leases in Texas and Louisiana dating back to 18th century to determine and plot the boundary locations. Barista Starbucks Coffee Company September 2007  –  December 2008  (1 year 4 months) Barista Starbucks Coffee Company September 2007  –  December 2008  (1 year 4 months) Cornerstone Fellow, Counselor, Photography Specialist URJ Greene Family Camp June 2008  –  July 2008  (2 months) Cornerstone Fellow, Counselor, Photography Specialist URJ Greene Family Camp June 2008  –  July 2008  (2 months) Languages Spanish Spanish Spanish Skills GIS Spatial Analysis Data Analysis ESRI Databases Research Geography Cartography ArcGIS Server Microsoft Office ArcGIS Microsoft Excel SQL PowerPoint Project Management Python GPS ArcMap Access Remote Sensing Database Admin R Google Analytics BigQuery See 9+     See less Skills  GIS Spatial Analysis Data Analysis ESRI Databases Research Geography Cartography ArcGIS Server Microsoft Office ArcGIS Microsoft Excel SQL PowerPoint Project Management Python GPS ArcMap Access Remote Sensing Database Admin R Google Analytics BigQuery See 9+     See less GIS Spatial Analysis Data Analysis ESRI Databases Research Geography Cartography ArcGIS Server Microsoft Office ArcGIS Microsoft Excel SQL PowerPoint Project Management Python GPS ArcMap Access Remote Sensing Database Admin R Google Analytics BigQuery See 9+     See less GIS Spatial Analysis Data Analysis ESRI Databases Research Geography Cartography ArcGIS Server Microsoft Office ArcGIS Microsoft Excel SQL PowerPoint Project Management Python GPS ArcMap Access Remote Sensing Database Admin R Google Analytics BigQuery See 9+     See less Education The University of Texas at Austin Bachelor of Arts,  Geography ,  Liberal Arts Honors ,  Minor in Mexican-American Studies 2006  – 2010 Graduated with Highest Honors Activities and Societies:  Alpha Epsilon Phi ,  Phi Beta Kappa Plano West Plano West The University of Texas at Austin Bachelor of Arts,  Geography ,  Liberal Arts Honors ,  Minor in Mexican-American Studies 2006  – 2010 Graduated with Highest Honors Activities and Societies:  Alpha Epsilon Phi ,  Phi Beta Kappa The University of Texas at Austin Bachelor of Arts,  Geography ,  Liberal Arts Honors ,  Minor in Mexican-American Studies 2006  – 2010 Graduated with Highest Honors Activities and Societies:  Alpha Epsilon Phi ,  Phi Beta Kappa The University of Texas at Austin Bachelor of Arts,  Geography ,  Liberal Arts Honors ,  Minor in Mexican-American Studies 2006  – 2010 Graduated with Highest Honors Activities and Societies:  Alpha Epsilon Phi ,  Phi Beta Kappa Plano West Plano West Plano West Plano West Plano West Plano West ", "Summary Do you have a vision? Let's follow it! Summary Do you have a vision? Let's follow it! Do you have a vision? Let's follow it! Do you have a vision? Let's follow it! Experience New Business Associate at Google/Zevas Google January 2015  – Present (8 months) Dublin CZ, SK, PL market. Associate Client Service Manager Facebook October 2014  –  November 2014  (2 months) Dublin Helping to onboard new social gaming and real money gaming partners.  CZ/SK SMB AdWords Associate Account Strategist Google Ireland Ltd. March 2013  –  February 2014  (1 year) Dublin Campaign strategy advisor, customer support. Orders fulfillment coordinator Oracle January 2007  –  April 2012  (5 years 4 months) Dublin Customer orders fulfilment and distribution. Process and quality check control in cleanroom Hewlett-Packard 2005  –  2006  (1 year) Leixlip, Co. Dublin Process and quality check control in cleanroom. Junior Project Manager INSEKO a.s. 2003  –  2005  (2 years) Žilina, Slovakia Information system implementation. New Business Associate at Google/Zevas Google January 2015  – Present (8 months) Dublin CZ, SK, PL market. New Business Associate at Google/Zevas Google January 2015  – Present (8 months) Dublin CZ, SK, PL market. Associate Client Service Manager Facebook October 2014  –  November 2014  (2 months) Dublin Helping to onboard new social gaming and real money gaming partners.  Associate Client Service Manager Facebook October 2014  –  November 2014  (2 months) Dublin Helping to onboard new social gaming and real money gaming partners.  CZ/SK SMB AdWords Associate Account Strategist Google Ireland Ltd. March 2013  –  February 2014  (1 year) Dublin Campaign strategy advisor, customer support. CZ/SK SMB AdWords Associate Account Strategist Google Ireland Ltd. March 2013  –  February 2014  (1 year) Dublin Campaign strategy advisor, customer support. Orders fulfillment coordinator Oracle January 2007  –  April 2012  (5 years 4 months) Dublin Customer orders fulfilment and distribution. Orders fulfillment coordinator Oracle January 2007  –  April 2012  (5 years 4 months) Dublin Customer orders fulfilment and distribution. Process and quality check control in cleanroom Hewlett-Packard 2005  –  2006  (1 year) Leixlip, Co. Dublin Process and quality check control in cleanroom. Process and quality check control in cleanroom Hewlett-Packard 2005  –  2006  (1 year) Leixlip, Co. Dublin Process and quality check control in cleanroom. Junior Project Manager INSEKO a.s. 2003  –  2005  (2 years) Žilina, Slovakia Information system implementation. Junior Project Manager INSEKO a.s. 2003  –  2005  (2 years) Žilina, Slovakia Information system implementation. Languages English Full professional proficiency Slovak Native or bilingual proficiency Czech Full professional proficiency Polish Professional working proficiency Russian Elementary proficiency English Full professional proficiency Slovak Native or bilingual proficiency Czech Full professional proficiency Polish Professional working proficiency Russian Elementary proficiency English Full professional proficiency Slovak Native or bilingual proficiency Czech Full professional proficiency Polish Professional working proficiency Russian Elementary proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Elementary proficiency Skills Google Adwords Online Marketing Customer Service Social Media Marketing Project Management Online Advertising Skills  Google Adwords Online Marketing Customer Service Social Media Marketing Project Management Online Advertising Google Adwords Online Marketing Customer Service Social Media Marketing Project Management Online Advertising Google Adwords Online Marketing Customer Service Social Media Marketing Project Management Online Advertising Education University of Zilina Master's degree,  Industrial Maintenance , Project Management 1996  – 2001 SPS Snina Leaving exam,  Economics and Operation of Road Transport 1992  – 1996 University of Zilina Master's degree,  Industrial Maintenance , Project Management 1996  – 2001 University of Zilina Master's degree,  Industrial Maintenance , Project Management 1996  – 2001 University of Zilina Master's degree,  Industrial Maintenance , Project Management 1996  – 2001 SPS Snina Leaving exam,  Economics and Operation of Road Transport 1992  – 1996 SPS Snina Leaving exam,  Economics and Operation of Road Transport 1992  – 1996 SPS Snina Leaving exam,  Economics and Operation of Road Transport 1992  – 1996 ", "Experience Merchandising Associate- Google Play Brazil (Contractor) Google March 2015  – Present (6 months) Mountain View Associate Product Marketing Manager PlayFirst, Inc. May 2012  –  December 2014  (2 years 8 months) San Francisco Bay Area Marketing Assistant Guided Imagery 2008  –  February 2012  (4 years) Palo Alto Project Assistant Novartis 2004  –  September 2007  (3 years) Sao Paulo, Brazil Merchandising Associate- Google Play Brazil (Contractor) Google March 2015  – Present (6 months) Mountain View Merchandising Associate- Google Play Brazil (Contractor) Google March 2015  – Present (6 months) Mountain View Associate Product Marketing Manager PlayFirst, Inc. May 2012  –  December 2014  (2 years 8 months) San Francisco Bay Area Associate Product Marketing Manager PlayFirst, Inc. May 2012  –  December 2014  (2 years 8 months) San Francisco Bay Area Marketing Assistant Guided Imagery 2008  –  February 2012  (4 years) Palo Alto Marketing Assistant Guided Imagery 2008  –  February 2012  (4 years) Palo Alto Project Assistant Novartis 2004  –  September 2007  (3 years) Sao Paulo, Brazil Project Assistant Novartis 2004  –  September 2007  (3 years) Sao Paulo, Brazil Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Digital Marketing Mobile Marketing Mobile Devices Product Marketing Brand Management Cross Promotions Digital Strategy Online Marketing Casual Games Brand Development Online Advertising Social Media Marketing User Research Competitive Analysis Market Research Microsoft Office Microsoft Word PowerPoint Customer Service Microsoft Excel Management Marketing Social Media See 8+     See less Skills  Digital Marketing Mobile Marketing Mobile Devices Product Marketing Brand Management Cross Promotions Digital Strategy Online Marketing Casual Games Brand Development Online Advertising Social Media Marketing User Research Competitive Analysis Market Research Microsoft Office Microsoft Word PowerPoint Customer Service Microsoft Excel Management Marketing Social Media See 8+     See less Digital Marketing Mobile Marketing Mobile Devices Product Marketing Brand Management Cross Promotions Digital Strategy Online Marketing Casual Games Brand Development Online Advertising Social Media Marketing User Research Competitive Analysis Market Research Microsoft Office Microsoft Word PowerPoint Customer Service Microsoft Excel Management Marketing Social Media See 8+     See less Digital Marketing Mobile Marketing Mobile Devices Product Marketing Brand Management Cross Promotions Digital Strategy Online Marketing Casual Games Brand Development Online Advertising Social Media Marketing User Research Competitive Analysis Market Research Microsoft Office Microsoft Word PowerPoint Customer Service Microsoft Excel Management Marketing Social Media See 8+     See less Education City College of San Francisco Associate's degree,  Graphic Design 2009  – 2012 School work: http://tatmaddy.carbonmade.com Universidade Anhembi Morumbi 2002  – 2006 City College of San Francisco Associate's degree,  Graphic Design 2009  – 2012 School work: http://tatmaddy.carbonmade.com City College of San Francisco Associate's degree,  Graphic Design 2009  – 2012 School work: http://tatmaddy.carbonmade.com City College of San Francisco Associate's degree,  Graphic Design 2009  – 2012 School work: http://tatmaddy.carbonmade.com Universidade Anhembi Morumbi 2002  – 2006 Universidade Anhembi Morumbi 2002  – 2006 Universidade Anhembi Morumbi 2002  – 2006 ", "Skills Skills     Education Columbia University - Fu Foundation School of Engineering and Applied Science Bachelor of Science,  Operations Research: Financial Engineering 2007  – 2011 Columbia University - Fu Foundation School of Engineering and Applied Science Bachelor of Science,  Operations Research: Financial Engineering 2007  – 2011 Columbia University - Fu Foundation School of Engineering and Applied Science Bachelor of Science,  Operations Research: Financial Engineering 2007  – 2011 Columbia University - Fu Foundation School of Engineering and Applied Science Bachelor of Science,  Operations Research: Financial Engineering 2007  – 2011 ", "Summary El mundo editorial, así como el de las relaciones públicas –y de la comunicación en general– es cambiante y veloz. Trabajar en diversos medios, puestos y tener distintas responsabilidades me ha permitido estar al día con nuevas tecnologías, tendencias y aprender la importancia de adaptarse para sobrevivir. Mi objetivo en concreto es desarrollar todo mi potencial con lo aprendido en el ámbito escolar y laboral. Summary El mundo editorial, así como el de las relaciones públicas –y de la comunicación en general– es cambiante y veloz. Trabajar en diversos medios, puestos y tener distintas responsabilidades me ha permitido estar al día con nuevas tecnologías, tendencias y aprender la importancia de adaptarse para sobrevivir. Mi objetivo en concreto es desarrollar todo mi potencial con lo aprendido en el ámbito escolar y laboral. El mundo editorial, así como el de las relaciones públicas –y de la comunicación en general– es cambiante y veloz. Trabajar en diversos medios, puestos y tener distintas responsabilidades me ha permitido estar al día con nuevas tecnologías, tendencias y aprender la importancia de adaptarse para sobrevivir. Mi objetivo en concreto es desarrollar todo mi potencial con lo aprendido en el ámbito escolar y laboral. El mundo editorial, así como el de las relaciones públicas –y de la comunicación en general– es cambiante y veloz. Trabajar en diversos medios, puestos y tener distintas responsabilidades me ha permitido estar al día con nuevas tecnologías, tendencias y aprender la importancia de adaptarse para sobrevivir. Mi objetivo en concreto es desarrollar todo mi potencial con lo aprendido en el ámbito escolar y laboral. Experience Gerente de comunicación de Producto para Google México, Centroamérica y Caribe Google September 2013  – Present (2 years) Mexico Relaciones públicas para Google México, Centroamérica y Caribe \n \nColocar historias estratégicas sobre los productos de Google en la prensa \nManejar solicitudes de periodistas \nGoogle en situación de crisis \nDesarrollar estrategias de RP \nEntrenar periodistas en los productos de Google \nCoordinar lanzamientos con los equipos de marketing y producto  Comunicación, RP y estrategias editoriales Visionaria Games December 2012  –  December 2013  (1 year 1 month) Elaboración de estrategia editorial para el portal KualiFamily \nEstategia de medios para Visionaria Games \nCommunity Manager de KualiFamily \nSoluciones de comunicación y RP Editora en Jefe de Cine PREMIERE Impresiones Aéreas December 2010  –  October 2013  (2 years 11 months) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nLíder de equipo editorial \nEntrevistas en video para online \nCrítica de cine escrita y en video  \nRelación interdepartamental (ventas, circulación, mercadotecnia, Dirección General) Subeditora de Cine PREMIERE Editorial Premiere December 2009  –  December 2010  (1 year 1 month) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nLíder de equipo editorial \nCoordinación de contenido online \nEntrevistas en video para online \nCrítica de cine escrita y en video Jefa de Redacción revista Cine PREMIERE Editorial Premiere July 2008  –  December 2009  (1 year 6 months) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nCrítica de cine Coordinadora Editorial en revista MAX Editorial Premiere March 2008  –  July 2008  (5 months) Redacción de contenido \nLogística de producciones fotográficas \nGestión de contenido editorial diverso (estilo de vida) \nRelaciones públicas Gerente de comunicación de Producto para Google México, Centroamérica y Caribe Google September 2013  – Present (2 years) Mexico Relaciones públicas para Google México, Centroamérica y Caribe \n \nColocar historias estratégicas sobre los productos de Google en la prensa \nManejar solicitudes de periodistas \nGoogle en situación de crisis \nDesarrollar estrategias de RP \nEntrenar periodistas en los productos de Google \nCoordinar lanzamientos con los equipos de marketing y producto  Gerente de comunicación de Producto para Google México, Centroamérica y Caribe Google September 2013  – Present (2 years) Mexico Relaciones públicas para Google México, Centroamérica y Caribe \n \nColocar historias estratégicas sobre los productos de Google en la prensa \nManejar solicitudes de periodistas \nGoogle en situación de crisis \nDesarrollar estrategias de RP \nEntrenar periodistas en los productos de Google \nCoordinar lanzamientos con los equipos de marketing y producto  Comunicación, RP y estrategias editoriales Visionaria Games December 2012  –  December 2013  (1 year 1 month) Elaboración de estrategia editorial para el portal KualiFamily \nEstategia de medios para Visionaria Games \nCommunity Manager de KualiFamily \nSoluciones de comunicación y RP Comunicación, RP y estrategias editoriales Visionaria Games December 2012  –  December 2013  (1 year 1 month) Elaboración de estrategia editorial para el portal KualiFamily \nEstategia de medios para Visionaria Games \nCommunity Manager de KualiFamily \nSoluciones de comunicación y RP Editora en Jefe de Cine PREMIERE Impresiones Aéreas December 2010  –  October 2013  (2 years 11 months) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nLíder de equipo editorial \nEntrevistas en video para online \nCrítica de cine escrita y en video  \nRelación interdepartamental (ventas, circulación, mercadotecnia, Dirección General) Editora en Jefe de Cine PREMIERE Impresiones Aéreas December 2010  –  October 2013  (2 years 11 months) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nLíder de equipo editorial \nEntrevistas en video para online \nCrítica de cine escrita y en video  \nRelación interdepartamental (ventas, circulación, mercadotecnia, Dirección General) Subeditora de Cine PREMIERE Editorial Premiere December 2009  –  December 2010  (1 year 1 month) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nLíder de equipo editorial \nCoordinación de contenido online \nEntrevistas en video para online \nCrítica de cine escrita y en video Subeditora de Cine PREMIERE Editorial Premiere December 2009  –  December 2010  (1 year 1 month) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nLíder de equipo editorial \nCoordinación de contenido online \nEntrevistas en video para online \nCrítica de cine escrita y en video Jefa de Redacción revista Cine PREMIERE Editorial Premiere July 2008  –  December 2009  (1 year 6 months) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nCrítica de cine Jefa de Redacción revista Cine PREMIERE Editorial Premiere July 2008  –  December 2009  (1 year 6 months) Redacción de contenido \nRevisión ortográfica y de redacción \nGestión de contenido y coordinación de procesos editoriales\t \nCrítica de cine Coordinadora Editorial en revista MAX Editorial Premiere March 2008  –  July 2008  (5 months) Redacción de contenido \nLogística de producciones fotográficas \nGestión de contenido editorial diverso (estilo de vida) \nRelaciones públicas Coordinadora Editorial en revista MAX Editorial Premiere March 2008  –  July 2008  (5 months) Redacción de contenido \nLogística de producciones fotográficas \nGestión de contenido editorial diverso (estilo de vida) \nRelaciones públicas Languages Inglés Native or bilingual proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Español Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Digital Media Editorial Corporate Communications Media Relations New Media Editing Blogging Social Media Public Relations Magazines Social Media Marketing Publishing Digital Marketing Advertising Creative Writing Project Management Marketing Strategy Marketing Communications Press Releases Strategic Communications Copy Editing Digital Strategy Copywriting Online Journalism Photography InDesign Content Strategy Photoshop Marketing Internal Communications Web Content Content Management News Writing Spanish Proofreading Social Networking Redes sociales Editorial periodístico Relaciones públicas Medios digitales Nuevos medios de... Estrategia de... Relaciones con los... Blogs Comunicaciones de... Comunicaciones... Edición Español Mercadotecnia en medios... Revistas See 35+     See less Skills  Digital Media Editorial Corporate Communications Media Relations New Media Editing Blogging Social Media Public Relations Magazines Social Media Marketing Publishing Digital Marketing Advertising Creative Writing Project Management Marketing Strategy Marketing Communications Press Releases Strategic Communications Copy Editing Digital Strategy Copywriting Online Journalism Photography InDesign Content Strategy Photoshop Marketing Internal Communications Web Content Content Management News Writing Spanish Proofreading Social Networking Redes sociales Editorial periodístico Relaciones públicas Medios digitales Nuevos medios de... Estrategia de... Relaciones con los... Blogs Comunicaciones de... Comunicaciones... Edición Español Mercadotecnia en medios... Revistas See 35+     See less Digital Media Editorial Corporate Communications Media Relations New Media Editing Blogging Social Media Public Relations Magazines Social Media Marketing Publishing Digital Marketing Advertising Creative Writing Project Management Marketing Strategy Marketing Communications Press Releases Strategic Communications Copy Editing Digital Strategy Copywriting Online Journalism Photography InDesign Content Strategy Photoshop Marketing Internal Communications Web Content Content Management News Writing Spanish Proofreading Social Networking Redes sociales Editorial periodístico Relaciones públicas Medios digitales Nuevos medios de... Estrategia de... Relaciones con los... Blogs Comunicaciones de... Comunicaciones... Edición Español Mercadotecnia en medios... Revistas See 35+     See less Digital Media Editorial Corporate Communications Media Relations New Media Editing Blogging Social Media Public Relations Magazines Social Media Marketing Publishing Digital Marketing Advertising Creative Writing Project Management Marketing Strategy Marketing Communications Press Releases Strategic Communications Copy Editing Digital Strategy Copywriting Online Journalism Photography InDesign Content Strategy Photoshop Marketing Internal Communications Web Content Content Management News Writing Spanish Proofreading Social Networking Redes sociales Editorial periodístico Relaciones públicas Medios digitales Nuevos medios de... Estrategia de... Relaciones con los... Blogs Comunicaciones de... Comunicaciones... Edición Español Mercadotecnia en medios... Revistas See 35+     See less Education Mediarte Curso de Community Management 2013  – 2013 Sexto piso y Casa Refugio Citlatépetl Diplomado,  Edición de libros 2013  – 2013 CANIEM Y UNAM Diplomado,  Creación de revistas 2010  – 2011 Universidad Intercontinental Licenciada,  Ciencias de la Comunicación 2003  – 2007 Activities and Societies:  Promedio final de 9.7.\nTitulada con Mención Honorífica Alexander Bain Bachillerato Internacional,  Preparatoria 1997  – 2003 Mediarte Curso de Community Management 2013  – 2013 Mediarte Curso de Community Management 2013  – 2013 Mediarte Curso de Community Management 2013  – 2013 Sexto piso y Casa Refugio Citlatépetl Diplomado,  Edición de libros 2013  – 2013 Sexto piso y Casa Refugio Citlatépetl Diplomado,  Edición de libros 2013  – 2013 Sexto piso y Casa Refugio Citlatépetl Diplomado,  Edición de libros 2013  – 2013 CANIEM Y UNAM Diplomado,  Creación de revistas 2010  – 2011 CANIEM Y UNAM Diplomado,  Creación de revistas 2010  – 2011 CANIEM Y UNAM Diplomado,  Creación de revistas 2010  – 2011 Universidad Intercontinental Licenciada,  Ciencias de la Comunicación 2003  – 2007 Activities and Societies:  Promedio final de 9.7.\nTitulada con Mención Honorífica Universidad Intercontinental Licenciada,  Ciencias de la Comunicación 2003  – 2007 Activities and Societies:  Promedio final de 9.7.\nTitulada con Mención Honorífica Universidad Intercontinental Licenciada,  Ciencias de la Comunicación 2003  – 2007 Activities and Societies:  Promedio final de 9.7.\nTitulada con Mención Honorífica Alexander Bain Bachillerato Internacional,  Preparatoria 1997  – 2003 Alexander Bain Bachillerato Internacional,  Preparatoria 1997  – 2003 Alexander Bain Bachillerato Internacional,  Preparatoria 1997  – 2003 ", "Experience Partner Development Executive Google May 2015  – Present (4 months) New York, New York I help owners of well-known websites maximize their revenues by enabling them to offer ad space on their website to a set of highly engaged, high paying advertisers who provide high quality ad creatives.  \n \nI specialize in The Google AdExchange, DoubleClick for Publishers: Small Business and AdSense. Partner Development Associate, Google Google July 2013  – Present (2 years 2 months) New York, NY I kickstart mutually beneficial partnerships by identifying viable partners, conducting needs assessment calls and introducing qualified app developers, online publishers and merchants to our Partner Development Executives. \n \nIn addition, I manage the Online Partnership Group's CRM on a technical and organization level for our North America team and global team. Online Partnerships Group, Sales Intern Google May 2012  –  August 2012  (4 months) Mountain View, California Dedicated Client Services, Sales Intern Google May 2011  –  August 2011  (4 months) San Francisco Bay Area Partner Development Executive Google May 2015  – Present (4 months) New York, New York I help owners of well-known websites maximize their revenues by enabling them to offer ad space on their website to a set of highly engaged, high paying advertisers who provide high quality ad creatives.  \n \nI specialize in The Google AdExchange, DoubleClick for Publishers: Small Business and AdSense. Partner Development Executive Google May 2015  – Present (4 months) New York, New York I help owners of well-known websites maximize their revenues by enabling them to offer ad space on their website to a set of highly engaged, high paying advertisers who provide high quality ad creatives.  \n \nI specialize in The Google AdExchange, DoubleClick for Publishers: Small Business and AdSense. Partner Development Associate, Google Google July 2013  – Present (2 years 2 months) New York, NY I kickstart mutually beneficial partnerships by identifying viable partners, conducting needs assessment calls and introducing qualified app developers, online publishers and merchants to our Partner Development Executives. \n \nIn addition, I manage the Online Partnership Group's CRM on a technical and organization level for our North America team and global team. Partner Development Associate, Google Google July 2013  – Present (2 years 2 months) New York, NY I kickstart mutually beneficial partnerships by identifying viable partners, conducting needs assessment calls and introducing qualified app developers, online publishers and merchants to our Partner Development Executives. \n \nIn addition, I manage the Online Partnership Group's CRM on a technical and organization level for our North America team and global team. Online Partnerships Group, Sales Intern Google May 2012  –  August 2012  (4 months) Mountain View, California Online Partnerships Group, Sales Intern Google May 2012  –  August 2012  (4 months) Mountain View, California Dedicated Client Services, Sales Intern Google May 2011  –  August 2011  (4 months) San Francisco Bay Area Dedicated Client Services, Sales Intern Google May 2011  –  August 2011  (4 months) San Francisco Bay Area Skills Advertising Sales Communication Marketing Social Media Start-ups Salesforce.com CRM Databases Strategic Partnerships Building Business... Establishing Strategic... Sales Operations Sales Process Pre-sales Idea Person Digital Marketing Email Marketing Online Marketing Marketing Strategy Business Growth... Growth Strategies Sales Growth Growth Hacking Team Building Business Development Microsoft Office Adsense Leadership Social Media Marketing See 14+     See less Skills  Advertising Sales Communication Marketing Social Media Start-ups Salesforce.com CRM Databases Strategic Partnerships Building Business... Establishing Strategic... Sales Operations Sales Process Pre-sales Idea Person Digital Marketing Email Marketing Online Marketing Marketing Strategy Business Growth... Growth Strategies Sales Growth Growth Hacking Team Building Business Development Microsoft Office Adsense Leadership Social Media Marketing See 14+     See less Advertising Sales Communication Marketing Social Media Start-ups Salesforce.com CRM Databases Strategic Partnerships Building Business... Establishing Strategic... Sales Operations Sales Process Pre-sales Idea Person Digital Marketing Email Marketing Online Marketing Marketing Strategy Business Growth... Growth Strategies Sales Growth Growth Hacking Team Building Business Development Microsoft Office Adsense Leadership Social Media Marketing See 14+     See less Advertising Sales Communication Marketing Social Media Start-ups Salesforce.com CRM Databases Strategic Partnerships Building Business... Establishing Strategic... Sales Operations Sales Process Pre-sales Idea Person Digital Marketing Email Marketing Online Marketing Marketing Strategy Business Growth... Growth Strategies Sales Growth Growth Hacking Team Building Business Development Microsoft Office Adsense Leadership Social Media Marketing See 14+     See less Education Morehouse College Bachelor of Arts (B.A.),  Political Science ,  Pre-Law 2009  – 2013 Activities and Societies:  Phi Beta Kappa Morehouse College Bachelor of Arts (B.A.),  Political Science ,  Pre-Law 2009  – 2013 Activities and Societies:  Phi Beta Kappa Morehouse College Bachelor of Arts (B.A.),  Political Science ,  Pre-Law 2009  – 2013 Activities and Societies:  Phi Beta Kappa Morehouse College Bachelor of Arts (B.A.),  Political Science ,  Pre-Law 2009  – 2013 Activities and Societies:  Phi Beta Kappa ", "Summary A strategy, sustainability, business operations, and economic development professional with several years of corporate and non-profit experience engaging multiple stakeholders in Ghana, Tanzania, The United States and The United Kingdom. \n \nA graduate of Columbia University's School of International and Public Affairs with a Master of International Affairs (MIA) degree with a focus on Economic and Political Development, and specializations in Management and Sub-Saharan Africa. Additionally, holds a Bachelor of Science (BSc) from the University of Virginia's McIntire School of Commerce with concentrations in Finance and International Business. \n \nExtensive hands-on experience administering, planning, and managing projects and events involving: \nProject Management - Business Development - Emerging Markets - Strategic Corporate Responsibility - Business Process Improvement - Stakeholder Management & Relationship Building - Economic Development - Strategy Formulation - Governance - Entrepreneurship - Private Sector Development - Sustainable Development Summary A strategy, sustainability, business operations, and economic development professional with several years of corporate and non-profit experience engaging multiple stakeholders in Ghana, Tanzania, The United States and The United Kingdom. \n \nA graduate of Columbia University's School of International and Public Affairs with a Master of International Affairs (MIA) degree with a focus on Economic and Political Development, and specializations in Management and Sub-Saharan Africa. Additionally, holds a Bachelor of Science (BSc) from the University of Virginia's McIntire School of Commerce with concentrations in Finance and International Business. \n \nExtensive hands-on experience administering, planning, and managing projects and events involving: \nProject Management - Business Development - Emerging Markets - Strategic Corporate Responsibility - Business Process Improvement - Stakeholder Management & Relationship Building - Economic Development - Strategy Formulation - Governance - Entrepreneurship - Private Sector Development - Sustainable Development A strategy, sustainability, business operations, and economic development professional with several years of corporate and non-profit experience engaging multiple stakeholders in Ghana, Tanzania, The United States and The United Kingdom. \n \nA graduate of Columbia University's School of International and Public Affairs with a Master of International Affairs (MIA) degree with a focus on Economic and Political Development, and specializations in Management and Sub-Saharan Africa. Additionally, holds a Bachelor of Science (BSc) from the University of Virginia's McIntire School of Commerce with concentrations in Finance and International Business. \n \nExtensive hands-on experience administering, planning, and managing projects and events involving: \nProject Management - Business Development - Emerging Markets - Strategic Corporate Responsibility - Business Process Improvement - Stakeholder Management & Relationship Building - Economic Development - Strategy Formulation - Governance - Entrepreneurship - Private Sector Development - Sustainable Development A strategy, sustainability, business operations, and economic development professional with several years of corporate and non-profit experience engaging multiple stakeholders in Ghana, Tanzania, The United States and The United Kingdom. \n \nA graduate of Columbia University's School of International and Public Affairs with a Master of International Affairs (MIA) degree with a focus on Economic and Political Development, and specializations in Management and Sub-Saharan Africa. Additionally, holds a Bachelor of Science (BSc) from the University of Virginia's McIntire School of Commerce with concentrations in Finance and International Business. \n \nExtensive hands-on experience administering, planning, and managing projects and events involving: \nProject Management - Business Development - Emerging Markets - Strategic Corporate Responsibility - Business Process Improvement - Stakeholder Management & Relationship Building - Economic Development - Strategy Formulation - Governance - Entrepreneurship - Private Sector Development - Sustainable Development Experience Associate Partner Manager, Google Access Google 2015  – Present (less than a year) Accra, Ghana Consultant Kina Advisory Limited 2014  – Present (1 year) New York, NY and Accra, Ghana Strategy Associate (Summer Intern) Mara Foundation 2013  –  2013  (less than a year) Dar es Salaam, Tanzania President, SIPA Pan-African Network (SPAN) Columbia University in the City of New York 2012  –  2013  (1 year) New York, New York ERP2 Business Improvement Analyst Rolls-Royce 2010  –  2012  (2 years) Indianapolis, Indiana Area Graduate Finance Leadership Development Program Rolls-Royce 2008  –  2010  (2 years) United States and United Kingdom Treasury & Business Assurance Intern Rolls-Royce 2007  –  2007  (less than a year) Chantilly, Virginia Program Assistant, UVA Conference Services University of Virginia 2006  –  2007  (1 year) Charlottesville, Virginia Area Associate Partner Manager, Google Access Google 2015  – Present (less than a year) Accra, Ghana Associate Partner Manager, Google Access Google 2015  – Present (less than a year) Accra, Ghana Consultant Kina Advisory Limited 2014  – Present (1 year) New York, NY and Accra, Ghana Consultant Kina Advisory Limited 2014  – Present (1 year) New York, NY and Accra, Ghana Strategy Associate (Summer Intern) Mara Foundation 2013  –  2013  (less than a year) Dar es Salaam, Tanzania Strategy Associate (Summer Intern) Mara Foundation 2013  –  2013  (less than a year) Dar es Salaam, Tanzania President, SIPA Pan-African Network (SPAN) Columbia University in the City of New York 2012  –  2013  (1 year) New York, New York President, SIPA Pan-African Network (SPAN) Columbia University in the City of New York 2012  –  2013  (1 year) New York, New York ERP2 Business Improvement Analyst Rolls-Royce 2010  –  2012  (2 years) Indianapolis, Indiana Area ERP2 Business Improvement Analyst Rolls-Royce 2010  –  2012  (2 years) Indianapolis, Indiana Area Graduate Finance Leadership Development Program Rolls-Royce 2008  –  2010  (2 years) United States and United Kingdom Graduate Finance Leadership Development Program Rolls-Royce 2008  –  2010  (2 years) United States and United Kingdom Treasury & Business Assurance Intern Rolls-Royce 2007  –  2007  (less than a year) Chantilly, Virginia Treasury & Business Assurance Intern Rolls-Royce 2007  –  2007  (less than a year) Chantilly, Virginia Program Assistant, UVA Conference Services University of Virginia 2006  –  2007  (1 year) Charlottesville, Virginia Area Program Assistant, UVA Conference Services University of Virginia 2006  –  2007  (1 year) Charlottesville, Virginia Area Languages English Native or bilingual proficiency Twi Native or bilingual proficiency Fanti Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Twi Native or bilingual proficiency Fanti Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Twi Native or bilingual proficiency Fanti Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Skills     Education Columbia University - School of International and Public Affairs Master of International Affairs (MIA) 2012  – 2014 University of Virginia - McIntire School of Commerce Bachelor of Science (BSc) Columbia University - School of International and Public Affairs Master of International Affairs (MIA) 2012  – 2014 Columbia University - School of International and Public Affairs Master of International Affairs (MIA) 2012  – 2014 Columbia University - School of International and Public Affairs Master of International Affairs (MIA) 2012  – 2014 University of Virginia - McIntire School of Commerce Bachelor of Science (BSc) University of Virginia - McIntire School of Commerce Bachelor of Science (BSc) University of Virginia - McIntire School of Commerce Bachelor of Science (BSc) Honors & Awards Additional Honors & Awards Dean's Fellow: 2012-2013; 2013-2014 \n \nWilliam M. Shermet Award Recipient: 2007-2008: awarded by faculty on the basis of academic performance, character and leadership Additional Honors & Awards Dean's Fellow: 2012-2013; 2013-2014 \n \nWilliam M. Shermet Award Recipient: 2007-2008: awarded by faculty on the basis of academic performance, character and leadership Additional Honors & Awards Dean's Fellow: 2012-2013; 2013-2014 \n \nWilliam M. Shermet Award Recipient: 2007-2008: awarded by faculty on the basis of academic performance, character and leadership Additional Honors & Awards Dean's Fellow: 2012-2013; 2013-2014 \n \nWilliam M. Shermet Award Recipient: 2007-2008: awarded by faculty on the basis of academic performance, character and leadership ", "Summary Leading DACH businesses to online success. Summary Leading DACH businesses to online success. Leading DACH businesses to online success. Leading DACH businesses to online success. Experience Associate Manager, Google Google May 2014  – Present (1 year 4 months) Dublin, Ireland Management, Google advertising solutions: new client / digital acceleration programs, people management, project management, key client relationships Team Lead, Google Google November 2011  –  May 2014  (2 years 7 months) Dublin, Ireland Google AdWords sales management, key client outreach, program management, people management Account Manager Google November 2008  –  November 2011  (3 years 1 month) Key account management, sales, portfolio management Account Associate Google July 2006  –  November 2008  (2 years 5 months) customer support, project execution, trainee ramp-up Liaison Officer Austrian Ministry of Foreign Affairs March 2006  –  May 2006  (3 months) Austria, various locations personal Laison Officer for visiting ministers and heads of state Programme Officer Indian Institute for Rural Development January 2005  –  September 2005  (9 months) Jaipur Area, India Project administration, programme development, project proposals, documentation, networking Intern UNIDO June 2004  –  December 2004  (7 months) Vienna Research, project coordination, work on project propsals, translations Social Worker / Teacher Obra Social Nossa Senhora das Gracas March 2003  –  August 2003  (6 months) Vitória Area, Brazil Teaching and general care for underpriviledged children aged 5 - 14 Tourism Promoter VisitBritain January 2001  –  January 2003  (2 years 1 month) Austria, various locations Tourism promotion for UK at trade fairs and other events Associate Manager, Google Google May 2014  – Present (1 year 4 months) Dublin, Ireland Management, Google advertising solutions: new client / digital acceleration programs, people management, project management, key client relationships Associate Manager, Google Google May 2014  – Present (1 year 4 months) Dublin, Ireland Management, Google advertising solutions: new client / digital acceleration programs, people management, project management, key client relationships Team Lead, Google Google November 2011  –  May 2014  (2 years 7 months) Dublin, Ireland Google AdWords sales management, key client outreach, program management, people management Team Lead, Google Google November 2011  –  May 2014  (2 years 7 months) Dublin, Ireland Google AdWords sales management, key client outreach, program management, people management Account Manager Google November 2008  –  November 2011  (3 years 1 month) Key account management, sales, portfolio management Account Manager Google November 2008  –  November 2011  (3 years 1 month) Key account management, sales, portfolio management Account Associate Google July 2006  –  November 2008  (2 years 5 months) customer support, project execution, trainee ramp-up Account Associate Google July 2006  –  November 2008  (2 years 5 months) customer support, project execution, trainee ramp-up Liaison Officer Austrian Ministry of Foreign Affairs March 2006  –  May 2006  (3 months) Austria, various locations personal Laison Officer for visiting ministers and heads of state Liaison Officer Austrian Ministry of Foreign Affairs March 2006  –  May 2006  (3 months) Austria, various locations personal Laison Officer for visiting ministers and heads of state Programme Officer Indian Institute for Rural Development January 2005  –  September 2005  (9 months) Jaipur Area, India Project administration, programme development, project proposals, documentation, networking Programme Officer Indian Institute for Rural Development January 2005  –  September 2005  (9 months) Jaipur Area, India Project administration, programme development, project proposals, documentation, networking Intern UNIDO June 2004  –  December 2004  (7 months) Vienna Research, project coordination, work on project propsals, translations Intern UNIDO June 2004  –  December 2004  (7 months) Vienna Research, project coordination, work on project propsals, translations Social Worker / Teacher Obra Social Nossa Senhora das Gracas March 2003  –  August 2003  (6 months) Vitória Area, Brazil Teaching and general care for underpriviledged children aged 5 - 14 Social Worker / Teacher Obra Social Nossa Senhora das Gracas March 2003  –  August 2003  (6 months) Vitória Area, Brazil Teaching and general care for underpriviledged children aged 5 - 14 Tourism Promoter VisitBritain January 2001  –  January 2003  (2 years 1 month) Austria, various locations Tourism promotion for UK at trade fairs and other events Tourism Promoter VisitBritain January 2001  –  January 2003  (2 years 1 month) Austria, various locations Tourism promotion for UK at trade fairs and other events Languages German English Spanish Portuguese French German English Spanish Portuguese French German English Spanish Portuguese French Skills Online Advertising Google Adwords SEM Advertising Sales People Management Hiring Project Coordination Marketing Search Advertising Mobile Advertising PPC Management Program Management Online Marketing Display Advertising Google Analytics Mobile Marketing Market Research Analytics Conversion Optimization Web Analytics E-commerce See 7+     See less Skills  Online Advertising Google Adwords SEM Advertising Sales People Management Hiring Project Coordination Marketing Search Advertising Mobile Advertising PPC Management Program Management Online Marketing Display Advertising Google Analytics Mobile Marketing Market Research Analytics Conversion Optimization Web Analytics E-commerce See 7+     See less Online Advertising Google Adwords SEM Advertising Sales People Management Hiring Project Coordination Marketing Search Advertising Mobile Advertising PPC Management Program Management Online Marketing Display Advertising Google Analytics Mobile Marketing Market Research Analytics Conversion Optimization Web Analytics E-commerce See 7+     See less Online Advertising Google Adwords SEM Advertising Sales People Management Hiring Project Coordination Marketing Search Advertising Mobile Advertising PPC Management Program Management Online Marketing Display Advertising Google Analytics Mobile Marketing Market Research Analytics Conversion Optimization Web Analytics E-commerce See 7+     See less Education Universität Wien / University of Vienna Master's degree,  International Business 1995  – 2003 Activities and Societies:  AIESEC Colegio Nazaret, Puerto Ordaz, Venezuela Ciencias 1993  – 1994 AFS intercultural exchange Universität Wien / University of Vienna Master's degree,  International Business 1995  – 2003 Activities and Societies:  AIESEC Universität Wien / University of Vienna Master's degree,  International Business 1995  – 2003 Activities and Societies:  AIESEC Universität Wien / University of Vienna Master's degree,  International Business 1995  – 2003 Activities and Societies:  AIESEC Colegio Nazaret, Puerto Ordaz, Venezuela Ciencias 1993  – 1994 AFS intercultural exchange Colegio Nazaret, Puerto Ordaz, Venezuela Ciencias 1993  – 1994 AFS intercultural exchange Colegio Nazaret, Puerto Ordaz, Venezuela Ciencias 1993  – 1994 AFS intercultural exchange ", "Summary PhD candidate in Electrical Engineering at Arizona state university.  \n8 Years of experience on implementing Image processing and computer vision applications,  \nsuch as image noise and blur detection and estimation, automated defect detection, image classification \nProficient in MATLAB, C/C++, OpenCV, Visual Studio, Python, Latex. \nIndustrial project or intern experience with Google, Intel, NSF, Sony and Seagate. \nStrong mathematical and analytical ability; Excellent communications skills. \nProfessional software development experience. Summary PhD candidate in Electrical Engineering at Arizona state university.  \n8 Years of experience on implementing Image processing and computer vision applications,  \nsuch as image noise and blur detection and estimation, automated defect detection, image classification \nProficient in MATLAB, C/C++, OpenCV, Visual Studio, Python, Latex. \nIndustrial project or intern experience with Google, Intel, NSF, Sony and Seagate. \nStrong mathematical and analytical ability; Excellent communications skills. \nProfessional software development experience. PhD candidate in Electrical Engineering at Arizona state university.  \n8 Years of experience on implementing Image processing and computer vision applications,  \nsuch as image noise and blur detection and estimation, automated defect detection, image classification \nProficient in MATLAB, C/C++, OpenCV, Visual Studio, Python, Latex. \nIndustrial project or intern experience with Google, Intel, NSF, Sony and Seagate. \nStrong mathematical and analytical ability; Excellent communications skills. \nProfessional software development experience. PhD candidate in Electrical Engineering at Arizona state university.  \n8 Years of experience on implementing Image processing and computer vision applications,  \nsuch as image noise and blur detection and estimation, automated defect detection, image classification \nProficient in MATLAB, C/C++, OpenCV, Visual Studio, Python, Latex. \nIndustrial project or intern experience with Google, Intel, NSF, Sony and Seagate. \nStrong mathematical and analytical ability; Excellent communications skills. \nProfessional software development experience. Experience Research Associate supported by Google Research Associate supported by Google August 2014  – Present (1 year 1 month) Grad Research/Teaching Associate at Image, Video and Usability Lab, PhD Candidate Arizona State University August 2010  – Present (5 years 1 month) Phoenix, Arizona Area Conducted multiple research project sponsored by Google, Intel, Qualcomm and NSF, in the area of Image/Video Processing, Computer Vision and Machine Learning, \nRecipient of ISS fellowship Software Engineering Intern on Computer Vision and Machine Learning Seagate Technology May 2014  –  August 2014  (4 months) Software development on automated defect detection, including segmentation, classification, etc Research Associate supported by Qualcomm Qualcomm January 2014  –  May 2014  (5 months) Project: Quality Labeled Faces in the Wild (QLFW): A Database for Studying Face Recognition in Real- World Environments，available at https:// ivulab.asu.edu/qlfw  \n Main Participant in NSF project National Science Foundation October 2012  –  May 2014  (1 year 8 months) Wavelet Analysis of High Spatial Resolution Imagery (NSF project) \n \nDeveloped remote sensing image classification algorithm using wavelet features \nAchieved an classification accuracy over 90% for remote sensing images Research Intern Sony Electronics May 2013  –  August 2013  (4 months) San Jose,CA Research Intern on Image/Video processing, Image quality assessment. Research Associate supported by Intel Intel Corporation August 2010  –  December 2012  (2 years 5 months) Chandler, Arizona State-of-the-Art Video Codecs Evaluation and Development (Sponsored by Intel, Chandler, AZ) \n \nInitiated 3D video coding formats evaluation and R-D performance comparison for video codecs  \nConducted subjective evaluation for compressed 3D video QoE  \nApplied objective quality metrics and analyzed the correlation with subjective scores Research Associate supported by Google Research Associate supported by Google August 2014  – Present (1 year 1 month) Research Associate supported by Google Research Associate supported by Google August 2014  – Present (1 year 1 month) Grad Research/Teaching Associate at Image, Video and Usability Lab, PhD Candidate Arizona State University August 2010  – Present (5 years 1 month) Phoenix, Arizona Area Conducted multiple research project sponsored by Google, Intel, Qualcomm and NSF, in the area of Image/Video Processing, Computer Vision and Machine Learning, \nRecipient of ISS fellowship Grad Research/Teaching Associate at Image, Video and Usability Lab, PhD Candidate Arizona State University August 2010  – Present (5 years 1 month) Phoenix, Arizona Area Conducted multiple research project sponsored by Google, Intel, Qualcomm and NSF, in the area of Image/Video Processing, Computer Vision and Machine Learning, \nRecipient of ISS fellowship Software Engineering Intern on Computer Vision and Machine Learning Seagate Technology May 2014  –  August 2014  (4 months) Software development on automated defect detection, including segmentation, classification, etc Software Engineering Intern on Computer Vision and Machine Learning Seagate Technology May 2014  –  August 2014  (4 months) Software development on automated defect detection, including segmentation, classification, etc Research Associate supported by Qualcomm Qualcomm January 2014  –  May 2014  (5 months) Project: Quality Labeled Faces in the Wild (QLFW): A Database for Studying Face Recognition in Real- World Environments，available at https:// ivulab.asu.edu/qlfw  \n Research Associate supported by Qualcomm Qualcomm January 2014  –  May 2014  (5 months) Project: Quality Labeled Faces in the Wild (QLFW): A Database for Studying Face Recognition in Real- World Environments，available at https:// ivulab.asu.edu/qlfw  \n Main Participant in NSF project National Science Foundation October 2012  –  May 2014  (1 year 8 months) Wavelet Analysis of High Spatial Resolution Imagery (NSF project) \n \nDeveloped remote sensing image classification algorithm using wavelet features \nAchieved an classification accuracy over 90% for remote sensing images Main Participant in NSF project National Science Foundation October 2012  –  May 2014  (1 year 8 months) Wavelet Analysis of High Spatial Resolution Imagery (NSF project) \n \nDeveloped remote sensing image classification algorithm using wavelet features \nAchieved an classification accuracy over 90% for remote sensing images Research Intern Sony Electronics May 2013  –  August 2013  (4 months) San Jose,CA Research Intern on Image/Video processing, Image quality assessment. Research Intern Sony Electronics May 2013  –  August 2013  (4 months) San Jose,CA Research Intern on Image/Video processing, Image quality assessment. Research Associate supported by Intel Intel Corporation August 2010  –  December 2012  (2 years 5 months) Chandler, Arizona State-of-the-Art Video Codecs Evaluation and Development (Sponsored by Intel, Chandler, AZ) \n \nInitiated 3D video coding formats evaluation and R-D performance comparison for video codecs  \nConducted subjective evaluation for compressed 3D video QoE  \nApplied objective quality metrics and analyzed the correlation with subjective scores Research Associate supported by Intel Intel Corporation August 2010  –  December 2012  (2 years 5 months) Chandler, Arizona State-of-the-Art Video Codecs Evaluation and Development (Sponsored by Intel, Chandler, AZ) \n \nInitiated 3D video coding formats evaluation and R-D performance comparison for video codecs  \nConducted subjective evaluation for compressed 3D video QoE  \nApplied objective quality metrics and analyzed the correlation with subjective scores Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Algorithms Image Processing Computer Vision Machine Learning Matlab C++ Mathematical Modeling Simulations Signal Processing Image Quality OpenCV Digital Signal... Pattern Recognition Video Compression Digital Signal... LaTeX See 1+     See less Skills  Algorithms Image Processing Computer Vision Machine Learning Matlab C++ Mathematical Modeling Simulations Signal Processing Image Quality OpenCV Digital Signal... Pattern Recognition Video Compression Digital Signal... LaTeX See 1+     See less Algorithms Image Processing Computer Vision Machine Learning Matlab C++ Mathematical Modeling Simulations Signal Processing Image Quality OpenCV Digital Signal... Pattern Recognition Video Compression Digital Signal... LaTeX See 1+     See less Algorithms Image Processing Computer Vision Machine Learning Matlab C++ Mathematical Modeling Simulations Signal Processing Image Quality OpenCV Digital Signal... Pattern Recognition Video Compression Digital Signal... LaTeX See 1+     See less Education Arizona State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering , 4.0 2010  – 2015 Beijing Normal University Master of Science (M.S.),  Electrical and Electronics Engineering , 4.0 2007  – 2010 Outstanding Graduate Honor \nHuawei Scholarship (selected 6 in 9000 graduate students) \nExcellent Academic Scholarship (1st in 60 graduate students) Beijing Normal University Bachelor's degree,  Electrical and Electronics Engineering , 3.7 2003  – 2007 Excellent Bachelor Thesis Award \nAcademic Scholarship (top 6 in 60 students) Arizona State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering , 4.0 2010  – 2015 Arizona State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering , 4.0 2010  – 2015 Arizona State University Doctor of Philosophy (PhD),  Electrical and Electronics Engineering , 4.0 2010  – 2015 Beijing Normal University Master of Science (M.S.),  Electrical and Electronics Engineering , 4.0 2007  – 2010 Outstanding Graduate Honor \nHuawei Scholarship (selected 6 in 9000 graduate students) \nExcellent Academic Scholarship (1st in 60 graduate students) Beijing Normal University Master of Science (M.S.),  Electrical and Electronics Engineering , 4.0 2007  – 2010 Outstanding Graduate Honor \nHuawei Scholarship (selected 6 in 9000 graduate students) \nExcellent Academic Scholarship (1st in 60 graduate students) Beijing Normal University Master of Science (M.S.),  Electrical and Electronics Engineering , 4.0 2007  – 2010 Outstanding Graduate Honor \nHuawei Scholarship (selected 6 in 9000 graduate students) \nExcellent Academic Scholarship (1st in 60 graduate students) Beijing Normal University Bachelor's degree,  Electrical and Electronics Engineering , 3.7 2003  – 2007 Excellent Bachelor Thesis Award \nAcademic Scholarship (top 6 in 60 students) Beijing Normal University Bachelor's degree,  Electrical and Electronics Engineering , 3.7 2003  – 2007 Excellent Bachelor Thesis Award \nAcademic Scholarship (top 6 in 60 students) Beijing Normal University Bachelor's degree,  Electrical and Electronics Engineering , 3.7 2003  – 2007 Excellent Bachelor Thesis Award \nAcademic Scholarship (top 6 in 60 students) Honors & Awards ISS fellowship Arizona State University September 2012 Huawei Scholarship Huawei September 2009 selected 6 in 9000 graduate students Additional Honors & Awards Outstanding Graduate Honor, 2010 \nExcellent Academic Scholarship (1st in 60 graduate students), 2008 \nAcademic Scholarship (top 6 in 60 students), 2006 ISS fellowship Arizona State University September 2012 ISS fellowship Arizona State University September 2012 ISS fellowship Arizona State University September 2012 Huawei Scholarship Huawei September 2009 selected 6 in 9000 graduate students Huawei Scholarship Huawei September 2009 selected 6 in 9000 graduate students Huawei Scholarship Huawei September 2009 selected 6 in 9000 graduate students Additional Honors & Awards Outstanding Graduate Honor, 2010 \nExcellent Academic Scholarship (1st in 60 graduate students), 2008 \nAcademic Scholarship (top 6 in 60 students), 2006 Additional Honors & Awards Outstanding Graduate Honor, 2010 \nExcellent Academic Scholarship (1st in 60 graduate students), 2008 \nAcademic Scholarship (top 6 in 60 students), 2006 Additional Honors & Awards Outstanding Graduate Honor, 2010 \nExcellent Academic Scholarship (1st in 60 graduate students), 2008 \nAcademic Scholarship (top 6 in 60 students), 2006 ", "Summary Emprendedor por naturaleza. Amante del diseño. Estratega con habilidad para centrarme en los resultados. Analítico y apasionado de lo que hago. Fascinado con crear nuevas herramientas que mejoren la web. Enfocado en resolver problemas a través de grandes ideas. Excelente comunicador (orador). Tratando de hacer de este mundo, un mejor lugar para vivir. Seguidor de Jesús. Summary Emprendedor por naturaleza. Amante del diseño. Estratega con habilidad para centrarme en los resultados. Analítico y apasionado de lo que hago. Fascinado con crear nuevas herramientas que mejoren la web. Enfocado en resolver problemas a través de grandes ideas. Excelente comunicador (orador). Tratando de hacer de este mundo, un mejor lugar para vivir. Seguidor de Jesús. Emprendedor por naturaleza. Amante del diseño. Estratega con habilidad para centrarme en los resultados. Analítico y apasionado de lo que hago. Fascinado con crear nuevas herramientas que mejoren la web. Enfocado en resolver problemas a través de grandes ideas. Excelente comunicador (orador). Tratando de hacer de este mundo, un mejor lugar para vivir. Seguidor de Jesús. Emprendedor por naturaleza. Amante del diseño. Estratega con habilidad para centrarme en los resultados. Analítico y apasionado de lo que hago. Fascinado con crear nuevas herramientas que mejoren la web. Enfocado en resolver problemas a través de grandes ideas. Excelente comunicador (orador). Tratando de hacer de este mundo, un mejor lugar para vivir. Seguidor de Jesús. Experience Partner de Google Adwords Google March 2014  – Present (1 year 6 months) Argentina Google Partner. Realizo taréas de análisis de mercado, planificación, desarrollo y seguimiento de campañas publicitarias de Google Adword para clientes de toda latinoamérica e internacionales (habla inglesa). Asesor de Marketing Digital Zaff - Distribuidora Ferretera Mayorista January 2014  – Present (1 year 8 months) Buenos Aires, Argentina Desarrollo de campañas publicitarias (Adwords, Facebook). Soporte para la plataforma de e-commerce de la empresa (estrategias de ventas). Investigador de Campo Universidad Nacional de La Matanza July 2013  –  June 2014  (1 year) Argentina Campo de Investigación: Realidad Aumentada - Aplicación Web - New technologies and interfaces application. \nGrupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Project Team Member Fundación Sadosky June 2013  –  December 2013  (7 months) Buenos Aires, Argentina Dictado de Clases de Programación (Proyecto Alice - avalado y fomentado por el Ministerio de Educación) Fundador & CEO Haedo Design - Soluciones Web February 2012  –  June 2013  (1 year 5 months) Buenos Aires Gestión de Campañas de Marketing Digital (SEM - Search Engine Marketing). Administración de cuentas Adwords. Asesoría para estratégias de venta online. Web Designer/ PHP Developer. Shopear July 2011  –  January 2012  (7 months) Desarrollo web (PHP) de la primera plataforma de Social Shopping en LATAM. Web Developer & Designer Freelance Web Designer & Developer August 2010  –  June 2011  (11 months) Desarrollo de sitios web y plataformas de e-commerce para clientes Partner de Google Adwords Google March 2014  – Present (1 year 6 months) Argentina Google Partner. Realizo taréas de análisis de mercado, planificación, desarrollo y seguimiento de campañas publicitarias de Google Adword para clientes de toda latinoamérica e internacionales (habla inglesa). Partner de Google Adwords Google March 2014  – Present (1 year 6 months) Argentina Google Partner. Realizo taréas de análisis de mercado, planificación, desarrollo y seguimiento de campañas publicitarias de Google Adword para clientes de toda latinoamérica e internacionales (habla inglesa). Asesor de Marketing Digital Zaff - Distribuidora Ferretera Mayorista January 2014  – Present (1 year 8 months) Buenos Aires, Argentina Desarrollo de campañas publicitarias (Adwords, Facebook). Soporte para la plataforma de e-commerce de la empresa (estrategias de ventas). Asesor de Marketing Digital Zaff - Distribuidora Ferretera Mayorista January 2014  – Present (1 year 8 months) Buenos Aires, Argentina Desarrollo de campañas publicitarias (Adwords, Facebook). Soporte para la plataforma de e-commerce de la empresa (estrategias de ventas). Investigador de Campo Universidad Nacional de La Matanza July 2013  –  June 2014  (1 year) Argentina Campo de Investigación: Realidad Aumentada - Aplicación Web - New technologies and interfaces application. \nGrupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Investigador de Campo Universidad Nacional de La Matanza July 2013  –  June 2014  (1 year) Argentina Campo de Investigación: Realidad Aumentada - Aplicación Web - New technologies and interfaces application. \nGrupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Project Team Member Fundación Sadosky June 2013  –  December 2013  (7 months) Buenos Aires, Argentina Dictado de Clases de Programación (Proyecto Alice - avalado y fomentado por el Ministerio de Educación) Project Team Member Fundación Sadosky June 2013  –  December 2013  (7 months) Buenos Aires, Argentina Dictado de Clases de Programación (Proyecto Alice - avalado y fomentado por el Ministerio de Educación) Fundador & CEO Haedo Design - Soluciones Web February 2012  –  June 2013  (1 year 5 months) Buenos Aires Gestión de Campañas de Marketing Digital (SEM - Search Engine Marketing). Administración de cuentas Adwords. Asesoría para estratégias de venta online. Fundador & CEO Haedo Design - Soluciones Web February 2012  –  June 2013  (1 year 5 months) Buenos Aires Gestión de Campañas de Marketing Digital (SEM - Search Engine Marketing). Administración de cuentas Adwords. Asesoría para estratégias de venta online. Web Designer/ PHP Developer. Shopear July 2011  –  January 2012  (7 months) Desarrollo web (PHP) de la primera plataforma de Social Shopping en LATAM. Web Designer/ PHP Developer. Shopear July 2011  –  January 2012  (7 months) Desarrollo web (PHP) de la primera plataforma de Social Shopping en LATAM. Web Developer & Designer Freelance Web Designer & Developer August 2010  –  June 2011  (11 months) Desarrollo de sitios web y plataformas de e-commerce para clientes Web Developer & Designer Freelance Web Designer & Developer August 2010  –  June 2011  (11 months) Desarrollo de sitios web y plataformas de e-commerce para clientes Languages Español Native or bilingual proficiency Inglés Native or bilingual proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Internet Advertising Google Adwords Oral & Written... Experienced Speaker Dynamic Speaker E-commerce SEM SEO Digital Marketing Facebook Marketing PHP HTML5 CSS3 JavaScript Facebook Fan Page... Google Analytics MySQL Facebook API C C++ HTML/XML CSS jQuery MCS Adsense WordPress Git Github AngularJS See 15+     See less Skills  Internet Advertising Google Adwords Oral & Written... Experienced Speaker Dynamic Speaker E-commerce SEM SEO Digital Marketing Facebook Marketing PHP HTML5 CSS3 JavaScript Facebook Fan Page... Google Analytics MySQL Facebook API C C++ HTML/XML CSS jQuery MCS Adsense WordPress Git Github AngularJS See 15+     See less Internet Advertising Google Adwords Oral & Written... Experienced Speaker Dynamic Speaker E-commerce SEM SEO Digital Marketing Facebook Marketing PHP HTML5 CSS3 JavaScript Facebook Fan Page... Google Analytics MySQL Facebook API C C++ HTML/XML CSS jQuery MCS Adsense WordPress Git Github AngularJS See 15+     See less Internet Advertising Google Adwords Oral & Written... Experienced Speaker Dynamic Speaker E-commerce SEM SEO Digital Marketing Facebook Marketing PHP HTML5 CSS3 JavaScript Facebook Fan Page... Google Analytics MySQL Facebook API C C++ HTML/XML CSS jQuery MCS Adsense WordPress Git Github AngularJS See 15+     See less Education Universidad Nacional de La Matanza Informatic Engineering,  Computer Engineering (in progress) Activities and Societies:  Grupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Universidad Nacional de La Matanza Informatic Engineering,  Computer Engineering (in progress) Activities and Societies:  Grupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Universidad Nacional de La Matanza Informatic Engineering,  Computer Engineering (in progress) Activities and Societies:  Grupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Universidad Nacional de La Matanza Informatic Engineering,  Computer Engineering (in progress) Activities and Societies:  Grupo de Investigación y Desarrollo de Realidad Aumentada para el Departamento de Ingeniería e Investigaciones Tecnológicas de la Universidad Nacional de La Matanza Honors & Awards Additional Honors & Awards FINALISTA en PROGRAMA DE ACELERACIÓN DE STARTUPs de TELEFÓNICA WAYRA 2011. Global-minded startups accelerate program. Additional Honors & Awards FINALISTA en PROGRAMA DE ACELERACIÓN DE STARTUPs de TELEFÓNICA WAYRA 2011. Global-minded startups accelerate program. Additional Honors & Awards FINALISTA en PROGRAMA DE ACELERACIÓN DE STARTUPs de TELEFÓNICA WAYRA 2011. Global-minded startups accelerate program. Additional Honors & Awards FINALISTA en PROGRAMA DE ACELERACIÓN DE STARTUPs de TELEFÓNICA WAYRA 2011. Global-minded startups accelerate program. "]}