{"position": "Adwords Associate Intern - Monthly", "company": "Google", "profiles": ["Summary I joined Google in September 2010 and am currently working as an Agency Account Strategist for small and medium business sales in the NA region. In my previous roles at Google, I have worked in SMB Sales for the AU/NZ region and have also worked in the Ad Review Operations function before moving in to sales. Prior to Google, I worked as a Relationship Manager in the Global Private Clients Group (Private Banking) with ICICI Bank Ltd. in Hyderabad, India between July 2008 to September 2010.  \n \nI hold an MBA from the ICFAI Business School, Hyderabad and a B.Com. (Hons.) degree from the Bhawanipur Education Society College, Calcutta University. I also hold a Diploma in Mass Communication from the Birla Institute of Liberal Arts & Management Sciences, Kolkata.  \n \nUsually like to describe myself as a jack of all trades, always looking to try my hand at different activities. I am a big time Bollywood movie buff, cricket enthusiast and my claim to fame is jumping off a plane from 18000 feet (the world's highest tandem jump). Summary I joined Google in September 2010 and am currently working as an Agency Account Strategist for small and medium business sales in the NA region. In my previous roles at Google, I have worked in SMB Sales for the AU/NZ region and have also worked in the Ad Review Operations function before moving in to sales. Prior to Google, I worked as a Relationship Manager in the Global Private Clients Group (Private Banking) with ICICI Bank Ltd. in Hyderabad, India between July 2008 to September 2010.  \n \nI hold an MBA from the ICFAI Business School, Hyderabad and a B.Com. (Hons.) degree from the Bhawanipur Education Society College, Calcutta University. I also hold a Diploma in Mass Communication from the Birla Institute of Liberal Arts & Management Sciences, Kolkata.  \n \nUsually like to describe myself as a jack of all trades, always looking to try my hand at different activities. I am a big time Bollywood movie buff, cricket enthusiast and my claim to fame is jumping off a plane from 18000 feet (the world's highest tandem jump). I joined Google in September 2010 and am currently working as an Agency Account Strategist for small and medium business sales in the NA region. In my previous roles at Google, I have worked in SMB Sales for the AU/NZ region and have also worked in the Ad Review Operations function before moving in to sales. Prior to Google, I worked as a Relationship Manager in the Global Private Clients Group (Private Banking) with ICICI Bank Ltd. in Hyderabad, India between July 2008 to September 2010.  \n \nI hold an MBA from the ICFAI Business School, Hyderabad and a B.Com. (Hons.) degree from the Bhawanipur Education Society College, Calcutta University. I also hold a Diploma in Mass Communication from the Birla Institute of Liberal Arts & Management Sciences, Kolkata.  \n \nUsually like to describe myself as a jack of all trades, always looking to try my hand at different activities. I am a big time Bollywood movie buff, cricket enthusiast and my claim to fame is jumping off a plane from 18000 feet (the world's highest tandem jump). I joined Google in September 2010 and am currently working as an Agency Account Strategist for small and medium business sales in the NA region. In my previous roles at Google, I have worked in SMB Sales for the AU/NZ region and have also worked in the Ad Review Operations function before moving in to sales. Prior to Google, I worked as a Relationship Manager in the Global Private Clients Group (Private Banking) with ICICI Bank Ltd. in Hyderabad, India between July 2008 to September 2010.  \n \nI hold an MBA from the ICFAI Business School, Hyderabad and a B.Com. (Hons.) degree from the Bhawanipur Education Society College, Calcutta University. I also hold a Diploma in Mass Communication from the Birla Institute of Liberal Arts & Management Sciences, Kolkata.  \n \nUsually like to describe myself as a jack of all trades, always looking to try my hand at different activities. I am a big time Bollywood movie buff, cricket enthusiast and my claim to fame is jumping off a plane from 18000 feet (the world's highest tandem jump). Experience Agency Account Strategist, NA SMB Sales Google April 2015  – Present (5 months) Mountain View, California Agency Account Strategist, AU/NZ SMB Sales Google January 2014  –  March 2015  (1 year 3 months) Hyderabad Area, India - Consistently deliver against assigned agency quota and product adoption metrics. \n- Identify key agency stakeholders (often Directors or C-level), and educate proactively on Google’s solutions to drive increase in annual digital marketing budgets. \n- Engagement on specific accounts to drive Google product adoption, understanding and usage.  \n- Develop creative ways to drive agency development, knowledge of Google products and implementation of plans across SMB client portfolio. \n- Through direct exposure with agency partners, share and collaborate with Specialists, Engineers, and Product team members on new feature development. \n- Proactively coach peers to create skill lift that drives agency and client growth and contributes to overall team success. \n- Partner with management to define program opportunities and challenges and drive change where needed. Account Manager, AU/NZ SMB Sales Google April 2013  –  December 2013  (9 months) Hyderabad Area, India AdWords Account Strategist, Ad Review Operations Google May 2012  –  March 2013  (11 months) Hyderabad Area, India AdWords Associate, Ad Review Operations Google September 2010  –  April 2012  (1 year 8 months) Hyderabad Area, India Relationship Manager - Global Private Clients ICICI Bank Limited July 2008  –  September 2010  (2 years 3 months) Hyderabad Area, India - One-point contact for all financial and banking needs of High Net-Worth Individuals (HNIs). \n- Interact with HNIs, understand their financial requirements and risk profile; and recommend appropriate financial assets spread across different investment categories like Mutual Funds, PMS products, Structured Products, Private Equity Funds, Venture Capital Funds, REIT Funds, Real Estate etc. \n- Manage the wealth and investment portfolio of HNIs. \n- Achieve revenue targets by adhering to product grid and investment profile of the client. \n- Acquire new clients for the bank. Summer Intern (Business Development) Business Standard February 2007  –  May 2007  (4 months) Hyderabad Area, India - Create market penetration strategies for business development. \n- Promoting and increasing the market share of Business Standard and identifying potential areas for the same. \n- CRM (Customer Relationship Management). Agency Account Strategist, NA SMB Sales Google April 2015  – Present (5 months) Mountain View, California Agency Account Strategist, NA SMB Sales Google April 2015  – Present (5 months) Mountain View, California Agency Account Strategist, AU/NZ SMB Sales Google January 2014  –  March 2015  (1 year 3 months) Hyderabad Area, India - Consistently deliver against assigned agency quota and product adoption metrics. \n- Identify key agency stakeholders (often Directors or C-level), and educate proactively on Google’s solutions to drive increase in annual digital marketing budgets. \n- Engagement on specific accounts to drive Google product adoption, understanding and usage.  \n- Develop creative ways to drive agency development, knowledge of Google products and implementation of plans across SMB client portfolio. \n- Through direct exposure with agency partners, share and collaborate with Specialists, Engineers, and Product team members on new feature development. \n- Proactively coach peers to create skill lift that drives agency and client growth and contributes to overall team success. \n- Partner with management to define program opportunities and challenges and drive change where needed. Agency Account Strategist, AU/NZ SMB Sales Google January 2014  –  March 2015  (1 year 3 months) Hyderabad Area, India - Consistently deliver against assigned agency quota and product adoption metrics. \n- Identify key agency stakeholders (often Directors or C-level), and educate proactively on Google’s solutions to drive increase in annual digital marketing budgets. \n- Engagement on specific accounts to drive Google product adoption, understanding and usage.  \n- Develop creative ways to drive agency development, knowledge of Google products and implementation of plans across SMB client portfolio. \n- Through direct exposure with agency partners, share and collaborate with Specialists, Engineers, and Product team members on new feature development. \n- Proactively coach peers to create skill lift that drives agency and client growth and contributes to overall team success. \n- Partner with management to define program opportunities and challenges and drive change where needed. Account Manager, AU/NZ SMB Sales Google April 2013  –  December 2013  (9 months) Hyderabad Area, India Account Manager, AU/NZ SMB Sales Google April 2013  –  December 2013  (9 months) Hyderabad Area, India AdWords Account Strategist, Ad Review Operations Google May 2012  –  March 2013  (11 months) Hyderabad Area, India AdWords Account Strategist, Ad Review Operations Google May 2012  –  March 2013  (11 months) Hyderabad Area, India AdWords Associate, Ad Review Operations Google September 2010  –  April 2012  (1 year 8 months) Hyderabad Area, India AdWords Associate, Ad Review Operations Google September 2010  –  April 2012  (1 year 8 months) Hyderabad Area, India Relationship Manager - Global Private Clients ICICI Bank Limited July 2008  –  September 2010  (2 years 3 months) Hyderabad Area, India - One-point contact for all financial and banking needs of High Net-Worth Individuals (HNIs). \n- Interact with HNIs, understand their financial requirements and risk profile; and recommend appropriate financial assets spread across different investment categories like Mutual Funds, PMS products, Structured Products, Private Equity Funds, Venture Capital Funds, REIT Funds, Real Estate etc. \n- Manage the wealth and investment portfolio of HNIs. \n- Achieve revenue targets by adhering to product grid and investment profile of the client. \n- Acquire new clients for the bank. Relationship Manager - Global Private Clients ICICI Bank Limited July 2008  –  September 2010  (2 years 3 months) Hyderabad Area, India - One-point contact for all financial and banking needs of High Net-Worth Individuals (HNIs). \n- Interact with HNIs, understand their financial requirements and risk profile; and recommend appropriate financial assets spread across different investment categories like Mutual Funds, PMS products, Structured Products, Private Equity Funds, Venture Capital Funds, REIT Funds, Real Estate etc. \n- Manage the wealth and investment portfolio of HNIs. \n- Achieve revenue targets by adhering to product grid and investment profile of the client. \n- Acquire new clients for the bank. Summer Intern (Business Development) Business Standard February 2007  –  May 2007  (4 months) Hyderabad Area, India - Create market penetration strategies for business development. \n- Promoting and increasing the market share of Business Standard and identifying potential areas for the same. \n- CRM (Customer Relationship Management). Summer Intern (Business Development) Business Standard February 2007  –  May 2007  (4 months) Hyderabad Area, India - Create market penetration strategies for business development. \n- Promoting and increasing the market share of Business Standard and identifying potential areas for the same. \n- CRM (Customer Relationship Management). Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Competitive Analysis Market Research Team Management Analytics Relationship Management Business Development Investments Online Advertising CRM Google Adwords PPC Search Advertising Display Advertising Public Speaking Customer Engagement Marketing Strategy Business Strategy Distribution Strategies Negotiation Business Analysis Partner Management Strategy Management See 8+     See less Skills  Competitive Analysis Market Research Team Management Analytics Relationship Management Business Development Investments Online Advertising CRM Google Adwords PPC Search Advertising Display Advertising Public Speaking Customer Engagement Marketing Strategy Business Strategy Distribution Strategies Negotiation Business Analysis Partner Management Strategy Management See 8+     See less Competitive Analysis Market Research Team Management Analytics Relationship Management Business Development Investments Online Advertising CRM Google Adwords PPC Search Advertising Display Advertising Public Speaking Customer Engagement Marketing Strategy Business Strategy Distribution Strategies Negotiation Business Analysis Partner Management Strategy Management See 8+     See less Competitive Analysis Market Research Team Management Analytics Relationship Management Business Development Investments Online Advertising CRM Google Adwords PPC Search Advertising Display Advertising Public Speaking Customer Engagement Marketing Strategy Business Strategy Distribution Strategies Negotiation Business Analysis Partner Management Strategy Management See 8+     See less Education IBS Hyderabad MBA,  Marketing 2006  – 2008 Bhawanipur Education Society College, Calcutta University Bachelor of Commerce (Hons.) 2002  – 2005 Birla Institute of Liberal Arts & Management Sciences, Kolkata Diploma in Mass Communication 2002  – 2003 Birla High School, Kolkata High School, CBSE,  Commerce 2000  – 2002 IBS Hyderabad MBA,  Marketing 2006  – 2008 IBS Hyderabad MBA,  Marketing 2006  – 2008 IBS Hyderabad MBA,  Marketing 2006  – 2008 Bhawanipur Education Society College, Calcutta University Bachelor of Commerce (Hons.) 2002  – 2005 Bhawanipur Education Society College, Calcutta University Bachelor of Commerce (Hons.) 2002  – 2005 Bhawanipur Education Society College, Calcutta University Bachelor of Commerce (Hons.) 2002  – 2005 Birla Institute of Liberal Arts & Management Sciences, Kolkata Diploma in Mass Communication 2002  – 2003 Birla Institute of Liberal Arts & Management Sciences, Kolkata Diploma in Mass Communication 2002  – 2003 Birla Institute of Liberal Arts & Management Sciences, Kolkata Diploma in Mass Communication 2002  – 2003 Birla High School, Kolkata High School, CBSE,  Commerce 2000  – 2002 Birla High School, Kolkata High School, CBSE,  Commerce 2000  – 2002 Birla High School, Kolkata High School, CBSE,  Commerce 2000  – 2002 ", "Summary I work as an Operations Specialist in a Central Team at Google India Pvt Ltd. We work with client facing teams across the globe & help them in defining the operations & processes to help Google AdWords users get the best out of their accounts.  \n \nSpecialties: Working with a global team on various projects which needs a lot of stakeholder management, strategic thinking & operational excellence.  \n \nExpertise in operations, project management, expertise in internal platforms, stakeholder management.  Summary I work as an Operations Specialist in a Central Team at Google India Pvt Ltd. We work with client facing teams across the globe & help them in defining the operations & processes to help Google AdWords users get the best out of their accounts.  \n \nSpecialties: Working with a global team on various projects which needs a lot of stakeholder management, strategic thinking & operational excellence.  \n \nExpertise in operations, project management, expertise in internal platforms, stakeholder management.  I work as an Operations Specialist in a Central Team at Google India Pvt Ltd. We work with client facing teams across the globe & help them in defining the operations & processes to help Google AdWords users get the best out of their accounts.  \n \nSpecialties: Working with a global team on various projects which needs a lot of stakeholder management, strategic thinking & operational excellence.  \n \nExpertise in operations, project management, expertise in internal platforms, stakeholder management.  I work as an Operations Specialist in a Central Team at Google India Pvt Ltd. We work with client facing teams across the globe & help them in defining the operations & processes to help Google AdWords users get the best out of their accounts.  \n \nSpecialties: Working with a global team on various projects which needs a lot of stakeholder management, strategic thinking & operational excellence.  \n \nExpertise in operations, project management, expertise in internal platforms, stakeholder management.  Experience Global Operations & Process Systems (GOPS) Specialist Google July 2014  – Present (1 year 2 months) Hyderabad Area, India Account Manager - India Channel Sales Google April 2014  –  June 2014  (3 months) New Delhi Area, India As an Account Manager in the Channel Sales Team, we work with our channel partners team to get more users to Google AdWords along with helping and guiding them in managing their existing accounts.  \n \nSpecialties: Worked with large businesses and agencies on various objectives, such as branding, direct response, website usability, profitability modeling, mobile app creative concepts and video & display strategy to get more users in AdWords. \n \nExpertise in digital marketing, advertising across platforms such as Search, Display, Mobile, YouTube and Social, as well as driving analytical performance management. \n \nA brief summary of my role is as below:  \n \n- The first point of contact for partners around all key areas and lead cross-functional effort (marketing, sales engineering, account management, training) to identify and solve roadblocks \n- Develop strategic account plans for partners with an eye toward identifying creative and revenue-generating initiatives \n- Define and drive implementation of performance improvement initiatives for specific partners based on detailed understanding of the partners’ business and available Google tools \n- Ensure that partners are fulfilling their contractual obligations and that Google is providing the required support for them to do so \n- Manage trusted relationships with partners and develop a thorough understanding of partners’ business challenges ​ \n- Lead ad hoc projects that focus on the strategic growth of the program AdWords Strategist Google May 2013  –  March 2014  (11 months) Hyderabad Area, India Once I got promoted, I got an opportunity to be in the shoes of some of the biggest opportunities in my function (India SMB Advertiser Services).  \n \n->India Site Workflow Lead (in SMB Advertiser Services function)  \n- Heading the workflow team for all the English speaking markets (with a function employee strength of 150) \n- Capacity Planning for the coming quarters \n- Handling stakeholder management  \n \n->India Site Vendor Operations Lead Role (in SMB Advertiser Services function)  \n- Being a Googler contact between our vendor partners and our management \n- Delivering outstanding results within the limited time  \n- Owning the metrics for the vendor teams and coming up with strategies in improving it Adwords Associate Strategist Google July 2011  –  April 2013  (1 year 10 months) Hyderabad Area, India In this role, I've got a chance to learn in depth about the Google AdWords product and understand the internet marketing space. During my tenure as AdWords Associate, I've excelled in the following roles in my function & has got promoted to the next level:  \n \n-> Team Level Workflow Lead Role  \n- Newbie team was handling AdWords Accounts for newly on-board AdWords advertisers  \n- Handled the operations and workflow for the team of 28 people  \n \n-> India site CSAT Lead (for SMB Advertiser Services function)  \n- Worked with my manager (Prafulla Rawal) for coming up with strategies in improving the CSAT for the overall function  \n- Got a hands on experience in working on projects to improve CSAT Marketing Internship Mindtree September 2010  –  November 2010  (3 months) Bangalore Done an in-­depth study about the set­-top box market around the world and to analyze the upcoming opportunities & changes in the industry. Idea Marketing Executive Idea Cellular Ltd July 2005  –  June 2009  (4 years) Pathanamthitta Area, India I've done this as a part-time job during my college days & I’m glad that I was able to raise a considerable amount of money for my studies and also as pocket-money for meeting my personal expenses. :) Global Operations & Process Systems (GOPS) Specialist Google July 2014  – Present (1 year 2 months) Hyderabad Area, India Global Operations & Process Systems (GOPS) Specialist Google July 2014  – Present (1 year 2 months) Hyderabad Area, India Account Manager - India Channel Sales Google April 2014  –  June 2014  (3 months) New Delhi Area, India As an Account Manager in the Channel Sales Team, we work with our channel partners team to get more users to Google AdWords along with helping and guiding them in managing their existing accounts.  \n \nSpecialties: Worked with large businesses and agencies on various objectives, such as branding, direct response, website usability, profitability modeling, mobile app creative concepts and video & display strategy to get more users in AdWords. \n \nExpertise in digital marketing, advertising across platforms such as Search, Display, Mobile, YouTube and Social, as well as driving analytical performance management. \n \nA brief summary of my role is as below:  \n \n- The first point of contact for partners around all key areas and lead cross-functional effort (marketing, sales engineering, account management, training) to identify and solve roadblocks \n- Develop strategic account plans for partners with an eye toward identifying creative and revenue-generating initiatives \n- Define and drive implementation of performance improvement initiatives for specific partners based on detailed understanding of the partners’ business and available Google tools \n- Ensure that partners are fulfilling their contractual obligations and that Google is providing the required support for them to do so \n- Manage trusted relationships with partners and develop a thorough understanding of partners’ business challenges ​ \n- Lead ad hoc projects that focus on the strategic growth of the program Account Manager - India Channel Sales Google April 2014  –  June 2014  (3 months) New Delhi Area, India As an Account Manager in the Channel Sales Team, we work with our channel partners team to get more users to Google AdWords along with helping and guiding them in managing their existing accounts.  \n \nSpecialties: Worked with large businesses and agencies on various objectives, such as branding, direct response, website usability, profitability modeling, mobile app creative concepts and video & display strategy to get more users in AdWords. \n \nExpertise in digital marketing, advertising across platforms such as Search, Display, Mobile, YouTube and Social, as well as driving analytical performance management. \n \nA brief summary of my role is as below:  \n \n- The first point of contact for partners around all key areas and lead cross-functional effort (marketing, sales engineering, account management, training) to identify and solve roadblocks \n- Develop strategic account plans for partners with an eye toward identifying creative and revenue-generating initiatives \n- Define and drive implementation of performance improvement initiatives for specific partners based on detailed understanding of the partners’ business and available Google tools \n- Ensure that partners are fulfilling their contractual obligations and that Google is providing the required support for them to do so \n- Manage trusted relationships with partners and develop a thorough understanding of partners’ business challenges ​ \n- Lead ad hoc projects that focus on the strategic growth of the program AdWords Strategist Google May 2013  –  March 2014  (11 months) Hyderabad Area, India Once I got promoted, I got an opportunity to be in the shoes of some of the biggest opportunities in my function (India SMB Advertiser Services).  \n \n->India Site Workflow Lead (in SMB Advertiser Services function)  \n- Heading the workflow team for all the English speaking markets (with a function employee strength of 150) \n- Capacity Planning for the coming quarters \n- Handling stakeholder management  \n \n->India Site Vendor Operations Lead Role (in SMB Advertiser Services function)  \n- Being a Googler contact between our vendor partners and our management \n- Delivering outstanding results within the limited time  \n- Owning the metrics for the vendor teams and coming up with strategies in improving it AdWords Strategist Google May 2013  –  March 2014  (11 months) Hyderabad Area, India Once I got promoted, I got an opportunity to be in the shoes of some of the biggest opportunities in my function (India SMB Advertiser Services).  \n \n->India Site Workflow Lead (in SMB Advertiser Services function)  \n- Heading the workflow team for all the English speaking markets (with a function employee strength of 150) \n- Capacity Planning for the coming quarters \n- Handling stakeholder management  \n \n->India Site Vendor Operations Lead Role (in SMB Advertiser Services function)  \n- Being a Googler contact between our vendor partners and our management \n- Delivering outstanding results within the limited time  \n- Owning the metrics for the vendor teams and coming up with strategies in improving it Adwords Associate Strategist Google July 2011  –  April 2013  (1 year 10 months) Hyderabad Area, India In this role, I've got a chance to learn in depth about the Google AdWords product and understand the internet marketing space. During my tenure as AdWords Associate, I've excelled in the following roles in my function & has got promoted to the next level:  \n \n-> Team Level Workflow Lead Role  \n- Newbie team was handling AdWords Accounts for newly on-board AdWords advertisers  \n- Handled the operations and workflow for the team of 28 people  \n \n-> India site CSAT Lead (for SMB Advertiser Services function)  \n- Worked with my manager (Prafulla Rawal) for coming up with strategies in improving the CSAT for the overall function  \n- Got a hands on experience in working on projects to improve CSAT Adwords Associate Strategist Google July 2011  –  April 2013  (1 year 10 months) Hyderabad Area, India In this role, I've got a chance to learn in depth about the Google AdWords product and understand the internet marketing space. During my tenure as AdWords Associate, I've excelled in the following roles in my function & has got promoted to the next level:  \n \n-> Team Level Workflow Lead Role  \n- Newbie team was handling AdWords Accounts for newly on-board AdWords advertisers  \n- Handled the operations and workflow for the team of 28 people  \n \n-> India site CSAT Lead (for SMB Advertiser Services function)  \n- Worked with my manager (Prafulla Rawal) for coming up with strategies in improving the CSAT for the overall function  \n- Got a hands on experience in working on projects to improve CSAT Marketing Internship Mindtree September 2010  –  November 2010  (3 months) Bangalore Done an in-­depth study about the set­-top box market around the world and to analyze the upcoming opportunities & changes in the industry. Marketing Internship Mindtree September 2010  –  November 2010  (3 months) Bangalore Done an in-­depth study about the set­-top box market around the world and to analyze the upcoming opportunities & changes in the industry. Idea Marketing Executive Idea Cellular Ltd July 2005  –  June 2009  (4 years) Pathanamthitta Area, India I've done this as a part-time job during my college days & I’m glad that I was able to raise a considerable amount of money for my studies and also as pocket-money for meeting my personal expenses. :) Idea Marketing Executive Idea Cellular Ltd July 2005  –  June 2009  (4 years) Pathanamthitta Area, India I've done this as a part-time job during my college days & I’m glad that I was able to raise a considerable amount of money for my studies and also as pocket-money for meeting my personal expenses. :) Languages Malayalam Full professional proficiency English Full professional proficiency Tamil Professional working proficiency Malayalam Full professional proficiency English Full professional proficiency Tamil Professional working proficiency Malayalam Full professional proficiency English Full professional proficiency Tamil Professional working proficiency Full professional proficiency Full professional proficiency Professional working proficiency Skills Market Research Google Adwords Advertising Web Analytics Marketing Management Mobile Marketing Brand Management Integrated Marketing PPC Microsoft Office Wireframes Google Analytics Mobile Advertising Analytics Online Advertising Digital Marketing Search Advertising Conversion Optimization digital Digital Strategy Display Advertising Lead Generation E-commerce Affiliate Marketing Web Marketing Online Marketing Campaign Management Strategy Account Management Marketing Mobile Devices Cross-functional Team... Ad Networks Media Planning Management Competitive Analysis Digital Media Ad Serving Marketing Strategy CRM Team Management Business Development Social Media Marketing Business Strategy SEM Mobile Applications Analysis Training SEO See 34+     See less Skills  Market Research Google Adwords Advertising Web Analytics Marketing Management Mobile Marketing Brand Management Integrated Marketing PPC Microsoft Office Wireframes Google Analytics Mobile Advertising Analytics Online Advertising Digital Marketing Search Advertising Conversion Optimization digital Digital Strategy Display Advertising Lead Generation E-commerce Affiliate Marketing Web Marketing Online Marketing Campaign Management Strategy Account Management Marketing Mobile Devices Cross-functional Team... Ad Networks Media Planning Management Competitive Analysis Digital Media Ad Serving Marketing Strategy CRM Team Management Business Development Social Media Marketing Business Strategy SEM Mobile Applications Analysis Training SEO See 34+     See less Market Research Google Adwords Advertising Web Analytics Marketing Management Mobile Marketing Brand Management Integrated Marketing PPC Microsoft Office Wireframes Google Analytics Mobile Advertising Analytics Online Advertising Digital Marketing Search Advertising Conversion Optimization digital Digital Strategy Display Advertising Lead Generation E-commerce Affiliate Marketing Web Marketing Online Marketing Campaign Management Strategy Account Management Marketing Mobile Devices Cross-functional Team... Ad Networks Media Planning Management Competitive Analysis Digital Media Ad Serving Marketing Strategy CRM Team Management Business Development Social Media Marketing Business Strategy SEM Mobile Applications Analysis Training SEO See 34+     See less Market Research Google Adwords Advertising Web Analytics Marketing Management Mobile Marketing Brand Management Integrated Marketing PPC Microsoft Office Wireframes Google Analytics Mobile Advertising Analytics Online Advertising Digital Marketing Search Advertising Conversion Optimization digital Digital Strategy Display Advertising Lead Generation E-commerce Affiliate Marketing Web Marketing Online Marketing Campaign Management Strategy Account Management Marketing Mobile Devices Cross-functional Team... Ad Networks Media Planning Management Competitive Analysis Digital Media Ad Serving Marketing Strategy CRM Team Management Business Development Social Media Marketing Business Strategy SEM Mobile Applications Analysis Training SEO See 34+     See less Education Alliance University, School of Business MBA,  Marketing & Operations 2010  – 2011 Activities and Societies:  Won 2nd Prize in a national level case study competition conducted by PSGIM ,  Coimbatore (Benchmark' 11) Musaliar College of Engineering & Technology B.Tech,  Electronics & Communication 2005  – 2009 Alliance University, School of Business MBA,  Marketing & Operations 2010  – 2011 Activities and Societies:  Won 2nd Prize in a national level case study competition conducted by PSGIM ,  Coimbatore (Benchmark' 11) Alliance University, School of Business MBA,  Marketing & Operations 2010  – 2011 Activities and Societies:  Won 2nd Prize in a national level case study competition conducted by PSGIM ,  Coimbatore (Benchmark' 11) Alliance University, School of Business MBA,  Marketing & Operations 2010  – 2011 Activities and Societies:  Won 2nd Prize in a national level case study competition conducted by PSGIM ,  Coimbatore (Benchmark' 11) Musaliar College of Engineering & Technology B.Tech,  Electronics & Communication 2005  – 2009 Musaliar College of Engineering & Technology B.Tech,  Electronics & Communication 2005  – 2009 Musaliar College of Engineering & Technology B.Tech,  Electronics & Communication 2005  – 2009 Honors & Awards Google Spot Bonus Google India Pvt Ltd August 2012 For being a part of the team which won the revenue competition in SMB Advertiser Services Google Spot Bonus Google India Pvt Ltd September 2012 For being a part of the team with the best CSAT for the quarter Google Spot Bonus Google India Pvt Ltd November 2012 I was one among the two CSR’s who were appreciated for having 100% CSAT for the month of November in our function. Google Spot Bonus Google India Pvt Ltd April 2013 We (India site workflow team) were nominated by Rishiraj Singh (SMB Workflow Manager) for delivering outstanding work and dedication shown during our Vegas trip Google Spot Bonus Google India Pvt Ltd October 2013 I was awarded the S2S award for being the S2S Champs (Revenue Program Initiative) for the month of October 2013. Google Spot Bonus Google India Pvt Ltd December 2013 I was one among the few CSR’s from India site who won the best CSAT award for the month of December Gold Award Google India Pvt Ltd January 2013 Our pod (6 members) was awarded the Gold Award for showing outstanding performance and overall achievement in delivering the best results in our function.  Platinum Award Google India Pvt Ltd June 2012 Our team was awarded a platinum award for having the highest impact in the revenue program initiative under the leadership of our manager Nousheen Ali.  2nd Prize in National level Case Study Competition PSG Institute of Management (PSGIM), Coimbatore 2011 Google Spot Bonus Google India Pvt Ltd August 2012 For being a part of the team which won the revenue competition in SMB Advertiser Services Google Spot Bonus Google India Pvt Ltd August 2012 For being a part of the team which won the revenue competition in SMB Advertiser Services Google Spot Bonus Google India Pvt Ltd August 2012 For being a part of the team which won the revenue competition in SMB Advertiser Services Google Spot Bonus Google India Pvt Ltd September 2012 For being a part of the team with the best CSAT for the quarter Google Spot Bonus Google India Pvt Ltd September 2012 For being a part of the team with the best CSAT for the quarter Google Spot Bonus Google India Pvt Ltd September 2012 For being a part of the team with the best CSAT for the quarter Google Spot Bonus Google India Pvt Ltd November 2012 I was one among the two CSR’s who were appreciated for having 100% CSAT for the month of November in our function. Google Spot Bonus Google India Pvt Ltd November 2012 I was one among the two CSR’s who were appreciated for having 100% CSAT for the month of November in our function. Google Spot Bonus Google India Pvt Ltd November 2012 I was one among the two CSR’s who were appreciated for having 100% CSAT for the month of November in our function. Google Spot Bonus Google India Pvt Ltd April 2013 We (India site workflow team) were nominated by Rishiraj Singh (SMB Workflow Manager) for delivering outstanding work and dedication shown during our Vegas trip Google Spot Bonus Google India Pvt Ltd April 2013 We (India site workflow team) were nominated by Rishiraj Singh (SMB Workflow Manager) for delivering outstanding work and dedication shown during our Vegas trip Google Spot Bonus Google India Pvt Ltd April 2013 We (India site workflow team) were nominated by Rishiraj Singh (SMB Workflow Manager) for delivering outstanding work and dedication shown during our Vegas trip Google Spot Bonus Google India Pvt Ltd October 2013 I was awarded the S2S award for being the S2S Champs (Revenue Program Initiative) for the month of October 2013. Google Spot Bonus Google India Pvt Ltd October 2013 I was awarded the S2S award for being the S2S Champs (Revenue Program Initiative) for the month of October 2013. Google Spot Bonus Google India Pvt Ltd October 2013 I was awarded the S2S award for being the S2S Champs (Revenue Program Initiative) for the month of October 2013. Google Spot Bonus Google India Pvt Ltd December 2013 I was one among the few CSR’s from India site who won the best CSAT award for the month of December Google Spot Bonus Google India Pvt Ltd December 2013 I was one among the few CSR’s from India site who won the best CSAT award for the month of December Google Spot Bonus Google India Pvt Ltd December 2013 I was one among the few CSR’s from India site who won the best CSAT award for the month of December Gold Award Google India Pvt Ltd January 2013 Our pod (6 members) was awarded the Gold Award for showing outstanding performance and overall achievement in delivering the best results in our function.  Gold Award Google India Pvt Ltd January 2013 Our pod (6 members) was awarded the Gold Award for showing outstanding performance and overall achievement in delivering the best results in our function.  Gold Award Google India Pvt Ltd January 2013 Our pod (6 members) was awarded the Gold Award for showing outstanding performance and overall achievement in delivering the best results in our function.  Platinum Award Google India Pvt Ltd June 2012 Our team was awarded a platinum award for having the highest impact in the revenue program initiative under the leadership of our manager Nousheen Ali.  Platinum Award Google India Pvt Ltd June 2012 Our team was awarded a platinum award for having the highest impact in the revenue program initiative under the leadership of our manager Nousheen Ali.  Platinum Award Google India Pvt Ltd June 2012 Our team was awarded a platinum award for having the highest impact in the revenue program initiative under the leadership of our manager Nousheen Ali.  2nd Prize in National level Case Study Competition PSG Institute of Management (PSGIM), Coimbatore 2011 2nd Prize in National level Case Study Competition PSG Institute of Management (PSGIM), Coimbatore 2011 2nd Prize in National level Case Study Competition PSG Institute of Management (PSGIM), Coimbatore 2011 ", "Experience Head of Agency Development, Global SMB Revenue Organization Google July 2014  – Present (1 year 2 months) Head of Channel Managed Agencies Google January 2013  –  June 2014  (1 year 6 months) New York, NY Business Development Manager Google June 2012  –  January 2013  (8 months) New York, NY Account Executive, Direct Sales Google January 2008  –  June 2012  (4 years 6 months) New York, NY F500 clients in Healthcare (Pfizer, Merck, Johnson & Johnson) and CPG (Coca-Cola, PepsiCo, Mars, Bacardi, Dannon) verticals Account Manager, Direct Sales Google January 2006  –  January 2008  (2 years 1 month) New York, NY AdWords Associate Google September 2003  –  December 2005  (2 years 4 months) Mountain View, CA AdWords Representative Google March 2003  –  September 2003  (7 months) Mountain View, CA Head of Agency Development, Global SMB Revenue Organization Google July 2014  – Present (1 year 2 months) Head of Agency Development, Global SMB Revenue Organization Google July 2014  – Present (1 year 2 months) Head of Channel Managed Agencies Google January 2013  –  June 2014  (1 year 6 months) New York, NY Head of Channel Managed Agencies Google January 2013  –  June 2014  (1 year 6 months) New York, NY Business Development Manager Google June 2012  –  January 2013  (8 months) New York, NY Business Development Manager Google June 2012  –  January 2013  (8 months) New York, NY Account Executive, Direct Sales Google January 2008  –  June 2012  (4 years 6 months) New York, NY F500 clients in Healthcare (Pfizer, Merck, Johnson & Johnson) and CPG (Coca-Cola, PepsiCo, Mars, Bacardi, Dannon) verticals Account Executive, Direct Sales Google January 2008  –  June 2012  (4 years 6 months) New York, NY F500 clients in Healthcare (Pfizer, Merck, Johnson & Johnson) and CPG (Coca-Cola, PepsiCo, Mars, Bacardi, Dannon) verticals Account Manager, Direct Sales Google January 2006  –  January 2008  (2 years 1 month) New York, NY Account Manager, Direct Sales Google January 2006  –  January 2008  (2 years 1 month) New York, NY AdWords Associate Google September 2003  –  December 2005  (2 years 4 months) Mountain View, CA AdWords Associate Google September 2003  –  December 2005  (2 years 4 months) Mountain View, CA AdWords Representative Google March 2003  –  September 2003  (7 months) Mountain View, CA AdWords Representative Google March 2003  –  September 2003  (7 months) Mountain View, CA Skills Mobile Advertising Display Advertising Mobile Marketing Search Advertising SEM Google Adwords Online Advertising DoubleClick Ad Networks Digital Strategy PPC Ad Serving Digital Marketing Digital Media Behavioral Targeting Rich Media Strategy Web Analytics See 3+     See less Skills  Mobile Advertising Display Advertising Mobile Marketing Search Advertising SEM Google Adwords Online Advertising DoubleClick Ad Networks Digital Strategy PPC Ad Serving Digital Marketing Digital Media Behavioral Targeting Rich Media Strategy Web Analytics See 3+     See less Mobile Advertising Display Advertising Mobile Marketing Search Advertising SEM Google Adwords Online Advertising DoubleClick Ad Networks Digital Strategy PPC Ad Serving Digital Marketing Digital Media Behavioral Targeting Rich Media Strategy Web Analytics See 3+     See less Mobile Advertising Display Advertising Mobile Marketing Search Advertising SEM Google Adwords Online Advertising DoubleClick Ad Networks Digital Strategy PPC Ad Serving Digital Marketing Digital Media Behavioral Targeting Rich Media Strategy Web Analytics See 3+     See less Education Santa Clara University BS,  Psychology Santa Clara University BS,  Psychology Santa Clara University BS,  Psychology Santa Clara University BS,  Psychology ", "Experience Senior Account Manager Google April 2013  – Present (2 years 5 months) Ann Arbor, Michigan AdWords Analytical Lead Google January 2012  – Present (3 years 8 months) Ann Arbor, MI Site Conversion Specialist Google April 2013  –  June 2013  (3 months) Sydney Area, Australia AdWords Account Manager Google January 2011  –  December 2011  (1 year) Ann Arbor, MI AdWords Associate - Account Strategist Google January 2010  –  December 2010  (1 year) Marketing Director Arts Enterprise 2008  –  2009  (1 year) Marketing Associate Intern American Express May 2008  –  August 2008  (4 months) Plum Card Team Senior Account Manager Google April 2013  – Present (2 years 5 months) Ann Arbor, Michigan Senior Account Manager Google April 2013  – Present (2 years 5 months) Ann Arbor, Michigan AdWords Analytical Lead Google January 2012  – Present (3 years 8 months) Ann Arbor, MI AdWords Analytical Lead Google January 2012  – Present (3 years 8 months) Ann Arbor, MI Site Conversion Specialist Google April 2013  –  June 2013  (3 months) Sydney Area, Australia Site Conversion Specialist Google April 2013  –  June 2013  (3 months) Sydney Area, Australia AdWords Account Manager Google January 2011  –  December 2011  (1 year) Ann Arbor, MI AdWords Account Manager Google January 2011  –  December 2011  (1 year) Ann Arbor, MI AdWords Associate - Account Strategist Google January 2010  –  December 2010  (1 year) AdWords Associate - Account Strategist Google January 2010  –  December 2010  (1 year) Marketing Director Arts Enterprise 2008  –  2009  (1 year) Marketing Director Arts Enterprise 2008  –  2009  (1 year) Marketing Associate Intern American Express May 2008  –  August 2008  (4 months) Plum Card Team Marketing Associate Intern American Express May 2008  –  August 2008  (4 months) Plum Card Team Languages Mandarin Chinese Mandarin Chinese Mandarin Chinese Skills PPC SEM Search Advertising Google Analytics Web Analytics Google Adwords Display Advertising Mobile Advertising Analytics Digital Marketing Online Advertising Mobile Marketing Online Marketing Digital Strategy Email Marketing Marketing SEO See 2+     See less Skills  PPC SEM Search Advertising Google Analytics Web Analytics Google Adwords Display Advertising Mobile Advertising Analytics Digital Marketing Online Advertising Mobile Marketing Online Marketing Digital Strategy Email Marketing Marketing SEO See 2+     See less PPC SEM Search Advertising Google Analytics Web Analytics Google Adwords Display Advertising Mobile Advertising Analytics Digital Marketing Online Advertising Mobile Marketing Online Marketing Digital Strategy Email Marketing Marketing SEO See 2+     See less PPC SEM Search Advertising Google Analytics Web Analytics Google Adwords Display Advertising Mobile Advertising Analytics Digital Marketing Online Advertising Mobile Marketing Online Marketing Digital Strategy Email Marketing Marketing SEO See 2+     See less Education Northwestern University - Kellogg School of Management Master of Business Administration (MBA),  Marketing and Management Strategy 2013  – 2015 University of Michigan - Stephen M. Ross School of Business BBA,  Business-Marketing and Strategy 2005  – 2009 Activities and Societies:  Arts Enterprise Northwestern University - Kellogg School of Management Master of Business Administration (MBA),  Marketing and Management Strategy 2013  – 2015 Northwestern University - Kellogg School of Management Master of Business Administration (MBA),  Marketing and Management Strategy 2013  – 2015 Northwestern University - Kellogg School of Management Master of Business Administration (MBA),  Marketing and Management Strategy 2013  – 2015 University of Michigan - Stephen M. Ross School of Business BBA,  Business-Marketing and Strategy 2005  – 2009 Activities and Societies:  Arts Enterprise University of Michigan - Stephen M. Ross School of Business BBA,  Business-Marketing and Strategy 2005  – 2009 Activities and Societies:  Arts Enterprise University of Michigan - Stephen M. Ross School of Business BBA,  Business-Marketing and Strategy 2005  – 2009 Activities and Societies:  Arts Enterprise ", "Languages English Full professional proficiency Swedish Native or bilingual proficiency Norwegian Limited working proficiency English Full professional proficiency Swedish Native or bilingual proficiency Norwegian Limited working proficiency English Full professional proficiency Swedish Native or bilingual proficiency Norwegian Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Strategic Planning Management Sales Operations CRM Google Adwords Product Development Leadership Online Marketing Program Planning Project Planning Project Coordination Program Management Lead Generation Google Analytics Account Management Online Advertising Digital Marketing CRM software Salesforce.com Program Design People Management Advertising Sales Business Planning See 8+     See less Skills  Strategic Planning Management Sales Operations CRM Google Adwords Product Development Leadership Online Marketing Program Planning Project Planning Project Coordination Program Management Lead Generation Google Analytics Account Management Online Advertising Digital Marketing CRM software Salesforce.com Program Design People Management Advertising Sales Business Planning See 8+     See less Strategic Planning Management Sales Operations CRM Google Adwords Product Development Leadership Online Marketing Program Planning Project Planning Project Coordination Program Management Lead Generation Google Analytics Account Management Online Advertising Digital Marketing CRM software Salesforce.com Program Design People Management Advertising Sales Business Planning See 8+     See less Strategic Planning Management Sales Operations CRM Google Adwords Product Development Leadership Online Marketing Program Planning Project Planning Project Coordination Program Management Lead Generation Google Analytics Account Management Online Advertising Digital Marketing CRM software Salesforce.com Program Design People Management Advertising Sales Business Planning See 8+     See less ", "Experience Head of Industry, Technology Google January 2013  – Present (2 years 8 months) Head of Industry, Technology Google January 2013  – Present (2 years 8 months) Head of Industry, Technology Google January 2013  – Present (2 years 8 months) Skills Skills     Honors & Awards ", "Experience Agency Account Strategist Google May 2015  – Present (4 months) Mexico Adwords Associate Google May 2012  – Present (3 years 4 months) Argentina Google Ad Specialist Google September 2011  –  December 2011  (4 months) Wrocław Area, Poland Youth Lider Refugio Apto Para Todos May 2006  –  June 2011  (5 years 2 months) Organization several camps, leadership programs for the youth, National conferences and all kind of social events. \nPresident of the sports committee, organization of 3 futsal tournaments and several friendly games. Research Assistant in Environmental Technology Instituto Zuliano de Investigaciones Tecnológicas October 2008  –  December 2009  (1 year 3 months) Designing an activated carbon plant at a pilot scale, Designing of a paper pulp plant at pilot scale, Installing a reactor at the plant, facilities maintenance Engineer Intern Wood Group May 2007  –  June 2007  (2 months) Supervising operational control of the turbines operating in the field, Performing Maintenance procedures and quality control of equipment at the workshop. Nondestructive testing, measurement and pieces designing. Designing and developing a new test bench for turbine oil pumps Agency Account Strategist Google May 2015  – Present (4 months) Mexico Agency Account Strategist Google May 2015  – Present (4 months) Mexico Adwords Associate Google May 2012  – Present (3 years 4 months) Argentina Adwords Associate Google May 2012  – Present (3 years 4 months) Argentina Google Ad Specialist Google September 2011  –  December 2011  (4 months) Wrocław Area, Poland Google Ad Specialist Google September 2011  –  December 2011  (4 months) Wrocław Area, Poland Youth Lider Refugio Apto Para Todos May 2006  –  June 2011  (5 years 2 months) Organization several camps, leadership programs for the youth, National conferences and all kind of social events. \nPresident of the sports committee, organization of 3 futsal tournaments and several friendly games. Youth Lider Refugio Apto Para Todos May 2006  –  June 2011  (5 years 2 months) Organization several camps, leadership programs for the youth, National conferences and all kind of social events. \nPresident of the sports committee, organization of 3 futsal tournaments and several friendly games. Research Assistant in Environmental Technology Instituto Zuliano de Investigaciones Tecnológicas October 2008  –  December 2009  (1 year 3 months) Designing an activated carbon plant at a pilot scale, Designing of a paper pulp plant at pilot scale, Installing a reactor at the plant, facilities maintenance Research Assistant in Environmental Technology Instituto Zuliano de Investigaciones Tecnológicas October 2008  –  December 2009  (1 year 3 months) Designing an activated carbon plant at a pilot scale, Designing of a paper pulp plant at pilot scale, Installing a reactor at the plant, facilities maintenance Engineer Intern Wood Group May 2007  –  June 2007  (2 months) Supervising operational control of the turbines operating in the field, Performing Maintenance procedures and quality control of equipment at the workshop. Nondestructive testing, measurement and pieces designing. Designing and developing a new test bench for turbine oil pumps Engineer Intern Wood Group May 2007  –  June 2007  (2 months) Supervising operational control of the turbines operating in the field, Performing Maintenance procedures and quality control of equipment at the workshop. Nondestructive testing, measurement and pieces designing. Designing and developing a new test bench for turbine oil pumps Skills SEM Google Adwords Google Analytics HTML5 AutoCAD Chrome Extensions Technical Support Online Marketing Advertising Business Strategy Skills  SEM Google Adwords Google Analytics HTML5 AutoCAD Chrome Extensions Technical Support Online Marketing Advertising Business Strategy SEM Google Adwords Google Analytics HTML5 AutoCAD Chrome Extensions Technical Support Online Marketing Advertising Business Strategy SEM Google Adwords Google Analytics HTML5 AutoCAD Chrome Extensions Technical Support Online Marketing Advertising Business Strategy Education La Universidad del Zulia Ing,  Mechanical Engineer 2002  – 2008 La Universidad del Zulia Ing,  Mechanical Engineer 2002  – 2008 La Universidad del Zulia Ing,  Mechanical Engineer 2002  – 2008 La Universidad del Zulia Ing,  Mechanical Engineer 2002  – 2008 ", "Experience Global Program Manager Google January 2015  – Present (8 months) Mountain view, California Strategic initiatives for online help and engagement (Google AdWords & related products) Program Manager Google January 2014  –  December 2014  (1 year) Gurgaon, India Partner Operations Team lead (Google My business) \n Global Rotation program - Mountain View Google January 2014  –  April 2014  (4 months) California Program manager for launching regional level Agency support channels for the Global customer experience team (NA market) \n Global Rotation - Singapore Google November 2013  –  December 2013  (2 months) Singapore 1. Launched Webinar program in India \n2. Worked with Engg and Product managers based in Singapore to launch product level ideas and changes within AdWords billing which resulted in positive and intrinsic impact with the Customer base within India. AdWords Associate Google November 2012  –  November 2013  (1 year 1 month) Gurgaon, India -Launched High Value phone support team Gurgaon \n-Launched regional level Agency support channels for the Global customer experience team (APAC market) \n \nRewards and Recognition  \nGold Awards \n-Received Gold Award in September 2013 for being the sole founding member of the English High Value phone support team and setting up of the team in terms of technicalities,training, mentoring and managing.  \n-Gold Award in August 2013 for outstanding contribution as an AdWords billing trainer. \n-Gold Award in July 2012 for outstanding contribution as portal tester.Performed Testing along with the engineering team for launch of a support level portal which is now being used by Google worldwide to support customer interactions. \nSpot bonuses  \n-Spot bonus - 100% Customer satisfaction Score in November 2014 \n-Spot bonus - 100% Customer satisfaction Score in December 2014 \n-Spot bonus - 95% Customer satisfaction Score in October 2014 \nOutstanding achievement in Customer Focus \n-Customer focus Award - August 2013 for Customer satisfaction Score of above 95% \n-Customer focus Award - July 2013 for consistent Customer satisfaction Score of 100% . \n-Customer focus Award - June 2013 for 100% Customer satisfaction Score \n-Customer focus Award - October 2012 for consistent and high Customer satisfaction Score in the last 3 months. \n-Face of Google Award - October 2011 for 100% Customer satisfaction Score. \n-Face of Google Award - December 2011 for 90+% Customer satisfaction Score. AdWords Representative Google July 2011  –  November 2012  (1 year 5 months) Gurgaon, India Was recruited with Google India Pvt Limited as an AdWords Representative under the Global customer experience team.This fast-paced Customer Services team quickly identifies and resolves customer concerns and contributes building loyalty amongst our customers.  \nProjects - \n \n1. AdMob  \nPlayed an important role of a product troubleshooting specialist for AdMob customer base. \n \n2. AdWords Billing trainer  \nWorked and continue to train new Google employees on AdWords Billing. \n \n3. UK & Ireland Point Of Contact(2012)  \nWorked as the UK & Ireland Point Of Contact which allowed me to own the metrics of a market supported by India region and work on related search string algorithms to pull data and work on achieving Service level metrics. I believe this prior experience of working with Google owned data tools has helped me tremendously by allowing me to support ongoing analyses of business drivers and ensure continued development of data reporting within the team.  \n \n4. Portal Tester \nPerformed Testing along with the engineering team for launch of a support level portal / tool which is now being used substantially by Google worldwide to support customer interactions.Filed and reported technical failures and conducted test procedures to pass the launch of the tool.  \n \n5. Workflow lead (2012) \nWorked as workflow lead directing and planning hour & day wise support to the right channels and ensuring that all customer level issues are resolved within estimated timeframe using multiple service level maintenance and adherence tools for all channels(phone, chat, email). Marketing Intern Unitech Limited April 2010  –  July 2010  (4 months) Gurgaon, India Interned with Unitech group(Gurgaon) in the Marketing & Sales department during the college semester of 2010. During the internship I was asked to lead a Project - Cost reduction and better methods of advertising in the company and 2 ideas were also selected for implementation within the organization. Factory Operations Intern Britannia Industries Limited April 2009  –  July 2009  (4 months) New Delhi Area, India Interned with Britannia Industries Ltd.(New Delhi) in the Factory Operations department during the first semester of Economics Honors 2009. During the internship I focussed on Direct Cost Analysis within the Factory running and operations department which was in direct correlation with my educational focus during the semester. Global Program Manager Google January 2015  – Present (8 months) Mountain view, California Strategic initiatives for online help and engagement (Google AdWords & related products) Global Program Manager Google January 2015  – Present (8 months) Mountain view, California Strategic initiatives for online help and engagement (Google AdWords & related products) Program Manager Google January 2014  –  December 2014  (1 year) Gurgaon, India Partner Operations Team lead (Google My business) \n Program Manager Google January 2014  –  December 2014  (1 year) Gurgaon, India Partner Operations Team lead (Google My business) \n Global Rotation program - Mountain View Google January 2014  –  April 2014  (4 months) California Program manager for launching regional level Agency support channels for the Global customer experience team (NA market) \n Global Rotation program - Mountain View Google January 2014  –  April 2014  (4 months) California Program manager for launching regional level Agency support channels for the Global customer experience team (NA market) \n Global Rotation - Singapore Google November 2013  –  December 2013  (2 months) Singapore 1. Launched Webinar program in India \n2. Worked with Engg and Product managers based in Singapore to launch product level ideas and changes within AdWords billing which resulted in positive and intrinsic impact with the Customer base within India. Global Rotation - Singapore Google November 2013  –  December 2013  (2 months) Singapore 1. Launched Webinar program in India \n2. Worked with Engg and Product managers based in Singapore to launch product level ideas and changes within AdWords billing which resulted in positive and intrinsic impact with the Customer base within India. AdWords Associate Google November 2012  –  November 2013  (1 year 1 month) Gurgaon, India -Launched High Value phone support team Gurgaon \n-Launched regional level Agency support channels for the Global customer experience team (APAC market) \n \nRewards and Recognition  \nGold Awards \n-Received Gold Award in September 2013 for being the sole founding member of the English High Value phone support team and setting up of the team in terms of technicalities,training, mentoring and managing.  \n-Gold Award in August 2013 for outstanding contribution as an AdWords billing trainer. \n-Gold Award in July 2012 for outstanding contribution as portal tester.Performed Testing along with the engineering team for launch of a support level portal which is now being used by Google worldwide to support customer interactions. \nSpot bonuses  \n-Spot bonus - 100% Customer satisfaction Score in November 2014 \n-Spot bonus - 100% Customer satisfaction Score in December 2014 \n-Spot bonus - 95% Customer satisfaction Score in October 2014 \nOutstanding achievement in Customer Focus \n-Customer focus Award - August 2013 for Customer satisfaction Score of above 95% \n-Customer focus Award - July 2013 for consistent Customer satisfaction Score of 100% . \n-Customer focus Award - June 2013 for 100% Customer satisfaction Score \n-Customer focus Award - October 2012 for consistent and high Customer satisfaction Score in the last 3 months. \n-Face of Google Award - October 2011 for 100% Customer satisfaction Score. \n-Face of Google Award - December 2011 for 90+% Customer satisfaction Score. AdWords Associate Google November 2012  –  November 2013  (1 year 1 month) Gurgaon, India -Launched High Value phone support team Gurgaon \n-Launched regional level Agency support channels for the Global customer experience team (APAC market) \n \nRewards and Recognition  \nGold Awards \n-Received Gold Award in September 2013 for being the sole founding member of the English High Value phone support team and setting up of the team in terms of technicalities,training, mentoring and managing.  \n-Gold Award in August 2013 for outstanding contribution as an AdWords billing trainer. \n-Gold Award in July 2012 for outstanding contribution as portal tester.Performed Testing along with the engineering team for launch of a support level portal which is now being used by Google worldwide to support customer interactions. \nSpot bonuses  \n-Spot bonus - 100% Customer satisfaction Score in November 2014 \n-Spot bonus - 100% Customer satisfaction Score in December 2014 \n-Spot bonus - 95% Customer satisfaction Score in October 2014 \nOutstanding achievement in Customer Focus \n-Customer focus Award - August 2013 for Customer satisfaction Score of above 95% \n-Customer focus Award - July 2013 for consistent Customer satisfaction Score of 100% . \n-Customer focus Award - June 2013 for 100% Customer satisfaction Score \n-Customer focus Award - October 2012 for consistent and high Customer satisfaction Score in the last 3 months. \n-Face of Google Award - October 2011 for 100% Customer satisfaction Score. \n-Face of Google Award - December 2011 for 90+% Customer satisfaction Score. AdWords Representative Google July 2011  –  November 2012  (1 year 5 months) Gurgaon, India Was recruited with Google India Pvt Limited as an AdWords Representative under the Global customer experience team.This fast-paced Customer Services team quickly identifies and resolves customer concerns and contributes building loyalty amongst our customers.  \nProjects - \n \n1. AdMob  \nPlayed an important role of a product troubleshooting specialist for AdMob customer base. \n \n2. AdWords Billing trainer  \nWorked and continue to train new Google employees on AdWords Billing. \n \n3. UK & Ireland Point Of Contact(2012)  \nWorked as the UK & Ireland Point Of Contact which allowed me to own the metrics of a market supported by India region and work on related search string algorithms to pull data and work on achieving Service level metrics. I believe this prior experience of working with Google owned data tools has helped me tremendously by allowing me to support ongoing analyses of business drivers and ensure continued development of data reporting within the team.  \n \n4. Portal Tester \nPerformed Testing along with the engineering team for launch of a support level portal / tool which is now being used substantially by Google worldwide to support customer interactions.Filed and reported technical failures and conducted test procedures to pass the launch of the tool.  \n \n5. Workflow lead (2012) \nWorked as workflow lead directing and planning hour & day wise support to the right channels and ensuring that all customer level issues are resolved within estimated timeframe using multiple service level maintenance and adherence tools for all channels(phone, chat, email). AdWords Representative Google July 2011  –  November 2012  (1 year 5 months) Gurgaon, India Was recruited with Google India Pvt Limited as an AdWords Representative under the Global customer experience team.This fast-paced Customer Services team quickly identifies and resolves customer concerns and contributes building loyalty amongst our customers.  \nProjects - \n \n1. AdMob  \nPlayed an important role of a product troubleshooting specialist for AdMob customer base. \n \n2. AdWords Billing trainer  \nWorked and continue to train new Google employees on AdWords Billing. \n \n3. UK & Ireland Point Of Contact(2012)  \nWorked as the UK & Ireland Point Of Contact which allowed me to own the metrics of a market supported by India region and work on related search string algorithms to pull data and work on achieving Service level metrics. I believe this prior experience of working with Google owned data tools has helped me tremendously by allowing me to support ongoing analyses of business drivers and ensure continued development of data reporting within the team.  \n \n4. Portal Tester \nPerformed Testing along with the engineering team for launch of a support level portal / tool which is now being used substantially by Google worldwide to support customer interactions.Filed and reported technical failures and conducted test procedures to pass the launch of the tool.  \n \n5. Workflow lead (2012) \nWorked as workflow lead directing and planning hour & day wise support to the right channels and ensuring that all customer level issues are resolved within estimated timeframe using multiple service level maintenance and adherence tools for all channels(phone, chat, email). Marketing Intern Unitech Limited April 2010  –  July 2010  (4 months) Gurgaon, India Interned with Unitech group(Gurgaon) in the Marketing & Sales department during the college semester of 2010. During the internship I was asked to lead a Project - Cost reduction and better methods of advertising in the company and 2 ideas were also selected for implementation within the organization. Marketing Intern Unitech Limited April 2010  –  July 2010  (4 months) Gurgaon, India Interned with Unitech group(Gurgaon) in the Marketing & Sales department during the college semester of 2010. During the internship I was asked to lead a Project - Cost reduction and better methods of advertising in the company and 2 ideas were also selected for implementation within the organization. Factory Operations Intern Britannia Industries Limited April 2009  –  July 2009  (4 months) New Delhi Area, India Interned with Britannia Industries Ltd.(New Delhi) in the Factory Operations department during the first semester of Economics Honors 2009. During the internship I focussed on Direct Cost Analysis within the Factory running and operations department which was in direct correlation with my educational focus during the semester. Factory Operations Intern Britannia Industries Limited April 2009  –  July 2009  (4 months) New Delhi Area, India Interned with Britannia Industries Ltd.(New Delhi) in the Factory Operations department during the first semester of Economics Honors 2009. During the internship I focussed on Direct Cost Analysis within the Factory running and operations department which was in direct correlation with my educational focus during the semester. Languages French  French  French  Skills Project Management People Skills Social Networking Management Leadership Sales Team Leadership Teamwork Customer Service Recruiting Time Management Team Management Training Customer Satisfaction Project Planning Project Coordination Project Delivery Digital Marketing Google Analytics Analytics Online Marketing SEM Online Advertising Google Adwords See 9+     See less Skills  Project Management People Skills Social Networking Management Leadership Sales Team Leadership Teamwork Customer Service Recruiting Time Management Team Management Training Customer Satisfaction Project Planning Project Coordination Project Delivery Digital Marketing Google Analytics Analytics Online Marketing SEM Online Advertising Google Adwords See 9+     See less Project Management People Skills Social Networking Management Leadership Sales Team Leadership Teamwork Customer Service Recruiting Time Management Team Management Training Customer Satisfaction Project Planning Project Coordination Project Delivery Digital Marketing Google Analytics Analytics Online Marketing SEM Online Advertising Google Adwords See 9+     See less Project Management People Skills Social Networking Management Leadership Sales Team Leadership Teamwork Customer Service Recruiting Time Management Team Management Training Customer Satisfaction Project Planning Project Coordination Project Delivery Digital Marketing Google Analytics Analytics Online Marketing SEM Online Advertising Google Adwords See 9+     See less Education Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. ", "Experience Manager, Enterprise Support Google February 2013  – Present (2 years 7 months) New York Manager, Enterprise Support Google October 2012  –  February 2013  (5 months) San Francisco Bay Area Manager, Enterprise Support Google November 2011  –  October 2012  (1 year) Dublin Enterprise Support Team Lead Google November 2009  –  November 2011  (2 years 1 month) Dublin Enterprise Strategist Google 2008  –  October 2009  (1 year) Dublin AdWords Relationship Manager Google 2007  –  2008  (1 year) Dublin AdWords Strategist Google 2005  –  2007  (2 years) Dublin AdWords Associate Google 2004  –  2005  (1 year) Dublin Adwords Representative Google 2004  –  2004  (less than a year) Dublin Manager, Enterprise Support Google February 2013  – Present (2 years 7 months) New York Manager, Enterprise Support Google February 2013  – Present (2 years 7 months) New York Manager, Enterprise Support Google October 2012  –  February 2013  (5 months) San Francisco Bay Area Manager, Enterprise Support Google October 2012  –  February 2013  (5 months) San Francisco Bay Area Manager, Enterprise Support Google November 2011  –  October 2012  (1 year) Dublin Manager, Enterprise Support Google November 2011  –  October 2012  (1 year) Dublin Enterprise Support Team Lead Google November 2009  –  November 2011  (2 years 1 month) Dublin Enterprise Support Team Lead Google November 2009  –  November 2011  (2 years 1 month) Dublin Enterprise Strategist Google 2008  –  October 2009  (1 year) Dublin Enterprise Strategist Google 2008  –  October 2009  (1 year) Dublin AdWords Relationship Manager Google 2007  –  2008  (1 year) Dublin AdWords Relationship Manager Google 2007  –  2008  (1 year) Dublin AdWords Strategist Google 2005  –  2007  (2 years) Dublin AdWords Strategist Google 2005  –  2007  (2 years) Dublin AdWords Associate Google 2004  –  2005  (1 year) Dublin AdWords Associate Google 2004  –  2005  (1 year) Dublin Adwords Representative Google 2004  –  2004  (less than a year) Dublin Adwords Representative Google 2004  –  2004  (less than a year) Dublin Skills Google Adwords Skills  Google Adwords Google Adwords Google Adwords ", "Languages English Native or bilingual proficiency German Limited working proficiency Portuguese Elementary proficiency English Native or bilingual proficiency German Limited working proficiency Portuguese Elementary proficiency English Native or bilingual proficiency German Limited working proficiency Portuguese Elementary proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Mobile Advertising Google Adwords SEM Mobile Marketing PPC Search Advertising Digital Strategy Display Advertising Online Advertising Digital Marketing Web Analytics DoubleClick Google Analytics Digital Media Online Marketing Advertising Sales Media Planning Marketing Integrated Marketing Advertising See 5+     See less Skills  Mobile Advertising Google Adwords SEM Mobile Marketing PPC Search Advertising Digital Strategy Display Advertising Online Advertising Digital Marketing Web Analytics DoubleClick Google Analytics Digital Media Online Marketing Advertising Sales Media Planning Marketing Integrated Marketing Advertising See 5+     See less Mobile Advertising Google Adwords SEM Mobile Marketing PPC Search Advertising Digital Strategy Display Advertising Online Advertising Digital Marketing Web Analytics DoubleClick Google Analytics Digital Media Online Marketing Advertising Sales Media Planning Marketing Integrated Marketing Advertising See 5+     See less Mobile Advertising Google Adwords SEM Mobile Marketing PPC Search Advertising Digital Strategy Display Advertising Online Advertising Digital Marketing Web Analytics DoubleClick Google Analytics Digital Media Online Marketing Advertising Sales Media Planning Marketing Integrated Marketing Advertising See 5+     See less ", "Experience Head of Canada Agency Development Google October 2014  – Present (11 months) Manager, Agency Development Google May 2014  –  September 2014  (5 months) Team Lead, Agency Development and Small Business Sales Google 2012  –  May 2014  (2 years) AdWords Account Executive Google 2011  –  2012  (1 year) Ann Arbor, Michigan -Drive high-level strategy development for advertisers using the entire suite of Google products in order to solve their marketing challenges and assist in the development and implementation of integrated marketing campaigns. \n-Participate in strategy planning and forecasting  \n-Co-chair of Women@Google Ann Arbor Community Outreach committe focused on representing Google within our local communities on matters devoted to the advancement of women and girls through volunteerism, donations, and sponsorships AdWords Account Manager Google November 2008  –  November 2011  (3 years 1 month) AdWords Associate Google August 2007  –  November 2008  (1 year 4 months) -Assisted users with AdWords and general Google questions via phone, chat, and email in order to provide superior customer service and ensure high customer satisfaction.  \n-Worked with small to medium sized businesses to optimize their AdWords accounts and create marketing strategies to achieve maximum return on invesmtnet. \n-Developed and organized annual Google Workshop for Student Groups in order to educate student leaders on how they can use Google products within their student organizations and in their everyday lives. Ford Racing - Marketing Ford Motor Company May 2006  –  August 2006  (4 months) -Created comprehensive plan to grow Ford Championship Weekend into marquis sporting event through term of sponsorship. \n-Executed benchmarking study spanning multiple industries to identify event norms and generate initial ideas for growth plan.  \n-Forecasted financial implications of growth plan including sales conversions and ROI. Event Marketing BBDO May 2005  –  August 2005  (4 months) -Coordinated project materials, messages, and meetings to ensure all parties knew their responsibilities and to guarantee timely completion of projects. \n-Developed inclusive marketing communications plan to improve sales of Dodge Dakota. Identified target consumers through research and developed $12 million dollar marketing plan including print and outdoor ads, television and radio spots, online, events, and direct mail. Head of Canada Agency Development Google October 2014  – Present (11 months) Head of Canada Agency Development Google October 2014  – Present (11 months) Manager, Agency Development Google May 2014  –  September 2014  (5 months) Manager, Agency Development Google May 2014  –  September 2014  (5 months) Team Lead, Agency Development and Small Business Sales Google 2012  –  May 2014  (2 years) Team Lead, Agency Development and Small Business Sales Google 2012  –  May 2014  (2 years) AdWords Account Executive Google 2011  –  2012  (1 year) Ann Arbor, Michigan -Drive high-level strategy development for advertisers using the entire suite of Google products in order to solve their marketing challenges and assist in the development and implementation of integrated marketing campaigns. \n-Participate in strategy planning and forecasting  \n-Co-chair of Women@Google Ann Arbor Community Outreach committe focused on representing Google within our local communities on matters devoted to the advancement of women and girls through volunteerism, donations, and sponsorships AdWords Account Executive Google 2011  –  2012  (1 year) Ann Arbor, Michigan -Drive high-level strategy development for advertisers using the entire suite of Google products in order to solve their marketing challenges and assist in the development and implementation of integrated marketing campaigns. \n-Participate in strategy planning and forecasting  \n-Co-chair of Women@Google Ann Arbor Community Outreach committe focused on representing Google within our local communities on matters devoted to the advancement of women and girls through volunteerism, donations, and sponsorships AdWords Account Manager Google November 2008  –  November 2011  (3 years 1 month) AdWords Account Manager Google November 2008  –  November 2011  (3 years 1 month) AdWords Associate Google August 2007  –  November 2008  (1 year 4 months) -Assisted users with AdWords and general Google questions via phone, chat, and email in order to provide superior customer service and ensure high customer satisfaction.  \n-Worked with small to medium sized businesses to optimize their AdWords accounts and create marketing strategies to achieve maximum return on invesmtnet. \n-Developed and organized annual Google Workshop for Student Groups in order to educate student leaders on how they can use Google products within their student organizations and in their everyday lives. AdWords Associate Google August 2007  –  November 2008  (1 year 4 months) -Assisted users with AdWords and general Google questions via phone, chat, and email in order to provide superior customer service and ensure high customer satisfaction.  \n-Worked with small to medium sized businesses to optimize their AdWords accounts and create marketing strategies to achieve maximum return on invesmtnet. \n-Developed and organized annual Google Workshop for Student Groups in order to educate student leaders on how they can use Google products within their student organizations and in their everyday lives. Ford Racing - Marketing Ford Motor Company May 2006  –  August 2006  (4 months) -Created comprehensive plan to grow Ford Championship Weekend into marquis sporting event through term of sponsorship. \n-Executed benchmarking study spanning multiple industries to identify event norms and generate initial ideas for growth plan.  \n-Forecasted financial implications of growth plan including sales conversions and ROI. Ford Racing - Marketing Ford Motor Company May 2006  –  August 2006  (4 months) -Created comprehensive plan to grow Ford Championship Weekend into marquis sporting event through term of sponsorship. \n-Executed benchmarking study spanning multiple industries to identify event norms and generate initial ideas for growth plan.  \n-Forecasted financial implications of growth plan including sales conversions and ROI. Event Marketing BBDO May 2005  –  August 2005  (4 months) -Coordinated project materials, messages, and meetings to ensure all parties knew their responsibilities and to guarantee timely completion of projects. \n-Developed inclusive marketing communications plan to improve sales of Dodge Dakota. Identified target consumers through research and developed $12 million dollar marketing plan including print and outdoor ads, television and radio spots, online, events, and direct mail. Event Marketing BBDO May 2005  –  August 2005  (4 months) -Coordinated project materials, messages, and meetings to ensure all parties knew their responsibilities and to guarantee timely completion of projects. \n-Developed inclusive marketing communications plan to improve sales of Dodge Dakota. Identified target consumers through research and developed $12 million dollar marketing plan including print and outdoor ads, television and radio spots, online, events, and direct mail. Skills Rich Media Google Adwords PPC SEM Online Advertising Integrated Marketing Advertising Marketing Strategy Strategy Marketing Communications Mobile Marketing Digital Marketing Web Analytics Google Analytics Marketing Online Marketing See 1+     See less Skills  Rich Media Google Adwords PPC SEM Online Advertising Integrated Marketing Advertising Marketing Strategy Strategy Marketing Communications Mobile Marketing Digital Marketing Web Analytics Google Analytics Marketing Online Marketing See 1+     See less Rich Media Google Adwords PPC SEM Online Advertising Integrated Marketing Advertising Marketing Strategy Strategy Marketing Communications Mobile Marketing Digital Marketing Web Analytics Google Analytics Marketing Online Marketing See 1+     See less Rich Media Google Adwords PPC SEM Online Advertising Integrated Marketing Advertising Marketing Strategy Strategy Marketing Communications Mobile Marketing Digital Marketing Web Analytics Google Analytics Marketing Online Marketing See 1+     See less Education University of Michigan - Stephen M. Ross School of Business MBA,  Management & Strategy 2011  – 2014 Activities and Societies:  Beta Gamma Sigma Honor Society University of Michigan - Stephen M. Ross School of Business BBA,  Marketing 2003  – 2007 Carson Scholar \nJames B. Angell Scholar Activities and Societies:  Michigan Business Women ,  National Society of Collegiate Scholars ,  Beta Gamma Sigma International Honor Society ,  Ballroom Dance Team University of Michigan - Stephen M. Ross School of Business MBA,  Management & Strategy 2011  – 2014 Activities and Societies:  Beta Gamma Sigma Honor Society University of Michigan - Stephen M. Ross School of Business MBA,  Management & Strategy 2011  – 2014 Activities and Societies:  Beta Gamma Sigma Honor Society University of Michigan - Stephen M. Ross School of Business MBA,  Management & Strategy 2011  – 2014 Activities and Societies:  Beta Gamma Sigma Honor Society University of Michigan - Stephen M. Ross School of Business BBA,  Marketing 2003  – 2007 Carson Scholar \nJames B. Angell Scholar Activities and Societies:  Michigan Business Women ,  National Society of Collegiate Scholars ,  Beta Gamma Sigma International Honor Society ,  Ballroom Dance Team University of Michigan - Stephen M. Ross School of Business BBA,  Marketing 2003  – 2007 Carson Scholar \nJames B. Angell Scholar Activities and Societies:  Michigan Business Women ,  National Society of Collegiate Scholars ,  Beta Gamma Sigma International Honor Society ,  Ballroom Dance Team University of Michigan - Stephen M. Ross School of Business BBA,  Marketing 2003  – 2007 Carson Scholar \nJames B. Angell Scholar Activities and Societies:  Michigan Business Women ,  National Society of Collegiate Scholars ,  Beta Gamma Sigma International Honor Society ,  Ballroom Dance Team ", "Summary Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Summary Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Experience Marketing Manager, Media Google July 2013  – Present (2 years 2 months) India AdWords Strategist, Online Sales Google November 2009  – Present (5 years 10 months) AdWords Associate Google July 2008  –  October 2009  (1 year 4 months) AdWords Senior Representative Google January 2008  –  July 2008  (7 months) AdWords Representative Google October 2006  –  December 2007  (1 year 3 months) Instructional Designer Brainvisa Technologies July 2004  –  March 2006  (1 year 9 months) Understand client requirements and accordingly script storyboards for online courses. Marketing Manager, Media Google July 2013  – Present (2 years 2 months) India Marketing Manager, Media Google July 2013  – Present (2 years 2 months) India AdWords Strategist, Online Sales Google November 2009  – Present (5 years 10 months) AdWords Strategist, Online Sales Google November 2009  – Present (5 years 10 months) AdWords Associate Google July 2008  –  October 2009  (1 year 4 months) AdWords Associate Google July 2008  –  October 2009  (1 year 4 months) AdWords Senior Representative Google January 2008  –  July 2008  (7 months) AdWords Senior Representative Google January 2008  –  July 2008  (7 months) AdWords Representative Google October 2006  –  December 2007  (1 year 3 months) AdWords Representative Google October 2006  –  December 2007  (1 year 3 months) Instructional Designer Brainvisa Technologies July 2004  –  March 2006  (1 year 9 months) Understand client requirements and accordingly script storyboards for online courses. Instructional Designer Brainvisa Technologies July 2004  –  March 2006  (1 year 9 months) Understand client requirements and accordingly script storyboards for online courses. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Google Adwords Google AdWords... Instructional Design Online Marketing Digital Marketing Microsoft Excel Excel Dashboards Analysis Search Advertising Account Management B2B PPC Skills  Google Adwords Google AdWords... Instructional Design Online Marketing Digital Marketing Microsoft Excel Excel Dashboards Analysis Search Advertising Account Management B2B PPC Google Adwords Google AdWords... Instructional Design Online Marketing Digital Marketing Microsoft Excel Excel Dashboards Analysis Search Advertising Account Management B2B PPC Google Adwords Google AdWords... Instructional Design Online Marketing Digital Marketing Microsoft Excel Excel Dashboards Analysis Search Advertising Account Management B2B PPC Education Delhi University MA,  English Literature 2002  – 2004 Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition Delhi University MA,  English Literature 2002  – 2004 Delhi University MA,  English Literature 2002  – 2004 Delhi University MA,  English Literature 2002  – 2004 Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition Honors & Awards Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 ", "Skills Digital Marketing Digital Media Demand Side Platform Branding & Identity Direct Response Brand Awareness Inspiring People Direct Sales Google Adwords Display Advertising B2B Management Sales Product Development Go-to-market Strategy SEM Online Advertising Digital Strategy See 3+     See less Skills  Digital Marketing Digital Media Demand Side Platform Branding & Identity Direct Response Brand Awareness Inspiring People Direct Sales Google Adwords Display Advertising B2B Management Sales Product Development Go-to-market Strategy SEM Online Advertising Digital Strategy See 3+     See less Digital Marketing Digital Media Demand Side Platform Branding & Identity Direct Response Brand Awareness Inspiring People Direct Sales Google Adwords Display Advertising B2B Management Sales Product Development Go-to-market Strategy SEM Online Advertising Digital Strategy See 3+     See less Digital Marketing Digital Media Demand Side Platform Branding & Identity Direct Response Brand Awareness Inspiring People Direct Sales Google Adwords Display Advertising B2B Management Sales Product Development Go-to-market Strategy SEM Online Advertising Digital Strategy See 3+     See less ", "Summary I have been working in Google for the last 5 years and have loads of experience on Adwords, Fraud and Risk Management and all account related access issues across Google products. Summary I have been working in Google for the last 5 years and have loads of experience on Adwords, Fraud and Risk Management and all account related access issues across Google products. I have been working in Google for the last 5 years and have loads of experience on Adwords, Fraud and Risk Management and all account related access issues across Google products. I have been working in Google for the last 5 years and have loads of experience on Adwords, Fraud and Risk Management and all account related access issues across Google products. Experience Account Recovery Specialist / Tech Specialist (Consumer Operations from April 2013 Present) Google April 2013  – Present (2 years 5 months) Hyderabad Area, India The Consumer Operations team is all about focusing on the user. You work on products like \nGoogle Accounts, Wallet, Offers, Gift Cards to actively support global users through high \ntouch support channels. \n● Worked with cross functional partners (counterparts at MTV, vendor ops and call \ncenter agents) in order to expand users to use Twostep \nverification across gaia \naccounts. \n● I am the currently the Techspecialist \nof the Global Account recovery team possessing \nforensic skills and attention to detail with the ability to effectively multitask and work in \ncollaboration with counterparts and the Engineering team. \n● Working with Vendors for Google from Accenture and Genpact and effectively \nmanaging Team Leads of the Vendor companies and reporting Vendors \nProgram \nManager. Risk Analyst Google India December 2010  –  April 2013  (2 years 5 months) Hyderabad Area, India Risk Analyst Risk \nOperations, AdWords (December 2010 March \n2013) \nThe Product Quality Operations (PQO) team defends the integrity and reputation of Google by \ndefining product policies and fighting fraud and abuse across Google products. \n● Responsible for detecting various forms of payment fraud and accountrelated \nabuse \nand preventing financial loss on AdWords. Identified problems and used strong \nanalytical and technical skills to innovate and optimise our processes and tools. \n● Collaborated extensively with the Global risk team in relation to writing bulk account \nsuspension/removal imacro scripts which helped in clearing volumes in the PF bin and \nwas the Global POC for these script writing for about 2 quarters. Youtube Homepage Specialist Google October 2012  –  March 2013  (6 months) Greater New York City Area • Worked with the Youtube homepage team on a rotation basis to track the different ad \n \nformats to provide a huge canvas to highlight company brands. \n \n• Worked on a detailed analysis to come up with the Advertisement spending on Youtube \n \nhomepage ads which helped Google in its Youtube Brand campaigns. Adwords Associate Analyst Google May 2010  –  December 2010  (8 months) Google Hyderabad ­Worked as an Ads Approval analyst​(Both US and UK) processes and all ad formats in the Google Adwords network. \n \nApprovals Ads team (May 2010 ­ Dec ­ 2010) \n \n­ Worked on an 80% role in the User Complaints Adwords team​(May 2010 ­ Dec ­ 2010). \n \n­ Worked on a ​20% Sensitive Ads approval Role​ for Q1 and Q2­ 2012. Corporate Finance Intern Ingersoll Rand International India Ltd. March 2009  –  June 2009  (4 months) Bengaluru Area, India - Intern in the Finance Department of the Engineering Centre. \n- Worked on preparing accounts for the financial year and managing the the preparation of Balance sheet. \n- Work on the payroll information systems of the company. \n- Helped the finance team with the preparation of Balance sheet for the financial year 2008 - 2009  \n- Was part of the Auditing team in preparing final accounts. \n Account Recovery Specialist / Tech Specialist (Consumer Operations from April 2013 Present) Google April 2013  – Present (2 years 5 months) Hyderabad Area, India The Consumer Operations team is all about focusing on the user. You work on products like \nGoogle Accounts, Wallet, Offers, Gift Cards to actively support global users through high \ntouch support channels. \n● Worked with cross functional partners (counterparts at MTV, vendor ops and call \ncenter agents) in order to expand users to use Twostep \nverification across gaia \naccounts. \n● I am the currently the Techspecialist \nof the Global Account recovery team possessing \nforensic skills and attention to detail with the ability to effectively multitask and work in \ncollaboration with counterparts and the Engineering team. \n● Working with Vendors for Google from Accenture and Genpact and effectively \nmanaging Team Leads of the Vendor companies and reporting Vendors \nProgram \nManager. Account Recovery Specialist / Tech Specialist (Consumer Operations from April 2013 Present) Google April 2013  – Present (2 years 5 months) Hyderabad Area, India The Consumer Operations team is all about focusing on the user. You work on products like \nGoogle Accounts, Wallet, Offers, Gift Cards to actively support global users through high \ntouch support channels. \n● Worked with cross functional partners (counterparts at MTV, vendor ops and call \ncenter agents) in order to expand users to use Twostep \nverification across gaia \naccounts. \n● I am the currently the Techspecialist \nof the Global Account recovery team possessing \nforensic skills and attention to detail with the ability to effectively multitask and work in \ncollaboration with counterparts and the Engineering team. \n● Working with Vendors for Google from Accenture and Genpact and effectively \nmanaging Team Leads of the Vendor companies and reporting Vendors \nProgram \nManager. Risk Analyst Google India December 2010  –  April 2013  (2 years 5 months) Hyderabad Area, India Risk Analyst Risk \nOperations, AdWords (December 2010 March \n2013) \nThe Product Quality Operations (PQO) team defends the integrity and reputation of Google by \ndefining product policies and fighting fraud and abuse across Google products. \n● Responsible for detecting various forms of payment fraud and accountrelated \nabuse \nand preventing financial loss on AdWords. Identified problems and used strong \nanalytical and technical skills to innovate and optimise our processes and tools. \n● Collaborated extensively with the Global risk team in relation to writing bulk account \nsuspension/removal imacro scripts which helped in clearing volumes in the PF bin and \nwas the Global POC for these script writing for about 2 quarters. Risk Analyst Google India December 2010  –  April 2013  (2 years 5 months) Hyderabad Area, India Risk Analyst Risk \nOperations, AdWords (December 2010 March \n2013) \nThe Product Quality Operations (PQO) team defends the integrity and reputation of Google by \ndefining product policies and fighting fraud and abuse across Google products. \n● Responsible for detecting various forms of payment fraud and accountrelated \nabuse \nand preventing financial loss on AdWords. Identified problems and used strong \nanalytical and technical skills to innovate and optimise our processes and tools. \n● Collaborated extensively with the Global risk team in relation to writing bulk account \nsuspension/removal imacro scripts which helped in clearing volumes in the PF bin and \nwas the Global POC for these script writing for about 2 quarters. Youtube Homepage Specialist Google October 2012  –  March 2013  (6 months) Greater New York City Area • Worked with the Youtube homepage team on a rotation basis to track the different ad \n \nformats to provide a huge canvas to highlight company brands. \n \n• Worked on a detailed analysis to come up with the Advertisement spending on Youtube \n \nhomepage ads which helped Google in its Youtube Brand campaigns. Youtube Homepage Specialist Google October 2012  –  March 2013  (6 months) Greater New York City Area • Worked with the Youtube homepage team on a rotation basis to track the different ad \n \nformats to provide a huge canvas to highlight company brands. \n \n• Worked on a detailed analysis to come up with the Advertisement spending on Youtube \n \nhomepage ads which helped Google in its Youtube Brand campaigns. Adwords Associate Analyst Google May 2010  –  December 2010  (8 months) Google Hyderabad ­Worked as an Ads Approval analyst​(Both US and UK) processes and all ad formats in the Google Adwords network. \n \nApprovals Ads team (May 2010 ­ Dec ­ 2010) \n \n­ Worked on an 80% role in the User Complaints Adwords team​(May 2010 ­ Dec ­ 2010). \n \n­ Worked on a ​20% Sensitive Ads approval Role​ for Q1 and Q2­ 2012. Adwords Associate Analyst Google May 2010  –  December 2010  (8 months) Google Hyderabad ­Worked as an Ads Approval analyst​(Both US and UK) processes and all ad formats in the Google Adwords network. \n \nApprovals Ads team (May 2010 ­ Dec ­ 2010) \n \n­ Worked on an 80% role in the User Complaints Adwords team​(May 2010 ­ Dec ­ 2010). \n \n­ Worked on a ​20% Sensitive Ads approval Role​ for Q1 and Q2­ 2012. Corporate Finance Intern Ingersoll Rand International India Ltd. March 2009  –  June 2009  (4 months) Bengaluru Area, India - Intern in the Finance Department of the Engineering Centre. \n- Worked on preparing accounts for the financial year and managing the the preparation of Balance sheet. \n- Work on the payroll information systems of the company. \n- Helped the finance team with the preparation of Balance sheet for the financial year 2008 - 2009  \n- Was part of the Auditing team in preparing final accounts. \n Corporate Finance Intern Ingersoll Rand International India Ltd. March 2009  –  June 2009  (4 months) Bengaluru Area, India - Intern in the Finance Department of the Engineering Centre. \n- Worked on preparing accounts for the financial year and managing the the preparation of Balance sheet. \n- Work on the payroll information systems of the company. \n- Helped the finance team with the preparation of Balance sheet for the financial year 2008 - 2009  \n- Was part of the Auditing team in preparing final accounts. \n Languages English Full professional proficiency Tamil Elementary proficiency Hindi Kannada Elementary proficiency English Full professional proficiency Tamil Elementary proficiency Hindi Kannada Elementary proficiency English Full professional proficiency Tamil Elementary proficiency Hindi Kannada Elementary proficiency Full professional proficiency Elementary proficiency Elementary proficiency Skills Data Analysis Microsoft Office Analytics Project Management Microsoft Excel Financial Analysis Online Advertising Business Analysis Financial Modeling Google Adwords Team Management Social Media Marketing Finance Vendor Management Risk Management Strategy Digital Marketing See 2+     See less Skills  Data Analysis Microsoft Office Analytics Project Management Microsoft Excel Financial Analysis Online Advertising Business Analysis Financial Modeling Google Adwords Team Management Social Media Marketing Finance Vendor Management Risk Management Strategy Digital Marketing See 2+     See less Data Analysis Microsoft Office Analytics Project Management Microsoft Excel Financial Analysis Online Advertising Business Analysis Financial Modeling Google Adwords Team Management Social Media Marketing Finance Vendor Management Risk Management Strategy Digital Marketing See 2+     See less Data Analysis Microsoft Office Analytics Project Management Microsoft Excel Financial Analysis Online Advertising Business Analysis Financial Modeling Google Adwords Team Management Social Media Marketing Finance Vendor Management Risk Management Strategy Digital Marketing See 2+     See less Education St. Joseph's College Of Business Administration Bachelor's degree,  Human Resources Management/Personnel Administration ans finance 2007  – 2010 St.Johns High School, Bangalore 2005  – 2007 St. Joseph's College Of Business Administration Bachelor's degree,  Human Resources Management/Personnel Administration ans finance 2007  – 2010 St. Joseph's College Of Business Administration Bachelor's degree,  Human Resources Management/Personnel Administration ans finance 2007  – 2010 St. Joseph's College Of Business Administration Bachelor's degree,  Human Resources Management/Personnel Administration ans finance 2007  – 2010 St.Johns High School, Bangalore 2005  – 2007 St.Johns High School, Bangalore 2005  – 2007 St.Johns High School, Bangalore 2005  – 2007 ", "Summary I have substantial experience in building and leading sales organizations across geographies, negotiating with partners/third parties, & managing high-performance teams. I began my career as a part of the Google India landing team, where I led the setup of the SMB sales channel. Later moved on to Singapore to grow the SMB advertiser base across South-east Asia and Australia, which was a $100M+ business when I left. Also, I was one of the youngest business leaders at Google Asia by virtue of 5 promotions in 6 years.  \n \nI'm currently leading the New Business Sales unit in NYC. We sell digital advertising solutions to high potential companies across the US.  \n \nI possess extensive knowledge of the digital ad space and a strong network of professionals across Americas and APAC. Former professional cricketer, badminton player and an avid traveler. Summary I have substantial experience in building and leading sales organizations across geographies, negotiating with partners/third parties, & managing high-performance teams. I began my career as a part of the Google India landing team, where I led the setup of the SMB sales channel. Later moved on to Singapore to grow the SMB advertiser base across South-east Asia and Australia, which was a $100M+ business when I left. Also, I was one of the youngest business leaders at Google Asia by virtue of 5 promotions in 6 years.  \n \nI'm currently leading the New Business Sales unit in NYC. We sell digital advertising solutions to high potential companies across the US.  \n \nI possess extensive knowledge of the digital ad space and a strong network of professionals across Americas and APAC. Former professional cricketer, badminton player and an avid traveler. I have substantial experience in building and leading sales organizations across geographies, negotiating with partners/third parties, & managing high-performance teams. I began my career as a part of the Google India landing team, where I led the setup of the SMB sales channel. Later moved on to Singapore to grow the SMB advertiser base across South-east Asia and Australia, which was a $100M+ business when I left. Also, I was one of the youngest business leaders at Google Asia by virtue of 5 promotions in 6 years.  \n \nI'm currently leading the New Business Sales unit in NYC. We sell digital advertising solutions to high potential companies across the US.  \n \nI possess extensive knowledge of the digital ad space and a strong network of professionals across Americas and APAC. Former professional cricketer, badminton player and an avid traveler. I have substantial experience in building and leading sales organizations across geographies, negotiating with partners/third parties, & managing high-performance teams. I began my career as a part of the Google India landing team, where I led the setup of the SMB sales channel. Later moved on to Singapore to grow the SMB advertiser base across South-east Asia and Australia, which was a $100M+ business when I left. Also, I was one of the youngest business leaders at Google Asia by virtue of 5 promotions in 6 years.  \n \nI'm currently leading the New Business Sales unit in NYC. We sell digital advertising solutions to high potential companies across the US.  \n \nI possess extensive knowledge of the digital ad space and a strong network of professionals across Americas and APAC. Former professional cricketer, badminton player and an avid traveler. Experience Regional Manager, New Business Sales Google August 2014  – Present (1 year 1 month) Greater New York City Area Leading a high performance digital ad sales team at Google. We acquire large mid-market advertisers across USA. Head of SMB Advertiser Acquisition - IN, SEA & ANZ Google August 2011  –  June 2013  (1 year 11 months) Singapore Led SMB advertiser acquisition for Google AdWords in India, South East Asia (Singapore, Malaysia, Philippines, Thailand, Indonesia & Vietnam), Australia and New Zealand. I managed sales teams across 5 locations in APAC with a team of ~180 vendor employees and 6 Googlers. Manager, SMB Advertiser Acquisitions, India Google August 2009  –  July 2011  (2 years) Gurgaon, India Managed vendor sales operations with a mandate of driving large-scale advertiser acquisition for Google India in the SMB sector. I was also a strategic advisor to the India leadership team on SMB strategy and growth plans. Sales Manager, Google Business Solutions Google January 2007  –  August 2009  (2 years 8 months) Responsible for acquiring high touch clients through strategic selling and managed key agency relationships that contributed heavily to Google India revenue. I was ranked among the top sales managers globally with an average quarterly target achievement of 189%. AdWords Associate Google May 2006  –  December 2006  (8 months) Regional Manager, New Business Sales Google August 2014  – Present (1 year 1 month) Greater New York City Area Leading a high performance digital ad sales team at Google. We acquire large mid-market advertisers across USA. Regional Manager, New Business Sales Google August 2014  – Present (1 year 1 month) Greater New York City Area Leading a high performance digital ad sales team at Google. We acquire large mid-market advertisers across USA. Head of SMB Advertiser Acquisition - IN, SEA & ANZ Google August 2011  –  June 2013  (1 year 11 months) Singapore Led SMB advertiser acquisition for Google AdWords in India, South East Asia (Singapore, Malaysia, Philippines, Thailand, Indonesia & Vietnam), Australia and New Zealand. I managed sales teams across 5 locations in APAC with a team of ~180 vendor employees and 6 Googlers. Head of SMB Advertiser Acquisition - IN, SEA & ANZ Google August 2011  –  June 2013  (1 year 11 months) Singapore Led SMB advertiser acquisition for Google AdWords in India, South East Asia (Singapore, Malaysia, Philippines, Thailand, Indonesia & Vietnam), Australia and New Zealand. I managed sales teams across 5 locations in APAC with a team of ~180 vendor employees and 6 Googlers. Manager, SMB Advertiser Acquisitions, India Google August 2009  –  July 2011  (2 years) Gurgaon, India Managed vendor sales operations with a mandate of driving large-scale advertiser acquisition for Google India in the SMB sector. I was also a strategic advisor to the India leadership team on SMB strategy and growth plans. Manager, SMB Advertiser Acquisitions, India Google August 2009  –  July 2011  (2 years) Gurgaon, India Managed vendor sales operations with a mandate of driving large-scale advertiser acquisition for Google India in the SMB sector. I was also a strategic advisor to the India leadership team on SMB strategy and growth plans. Sales Manager, Google Business Solutions Google January 2007  –  August 2009  (2 years 8 months) Responsible for acquiring high touch clients through strategic selling and managed key agency relationships that contributed heavily to Google India revenue. I was ranked among the top sales managers globally with an average quarterly target achievement of 189%. Sales Manager, Google Business Solutions Google January 2007  –  August 2009  (2 years 8 months) Responsible for acquiring high touch clients through strategic selling and managed key agency relationships that contributed heavily to Google India revenue. I was ranked among the top sales managers globally with an average quarterly target achievement of 189%. AdWords Associate Google May 2006  –  December 2006  (8 months) AdWords Associate Google May 2006  –  December 2006  (8 months) Languages Tamil Hindi English Tamil Hindi English Tamil Hindi English Skills Sales Management Advertising Sales Strategic Leadership Team Leadership Managing High... Business Strategy Strategic Partnerships Strategic Thinking Mobile Advertising Outsourcing Business Intelligence Management Strategy Digital Marketing Sales Operations Leadership Google Adwords Online Advertising See 3+     See less Skills  Sales Management Advertising Sales Strategic Leadership Team Leadership Managing High... Business Strategy Strategic Partnerships Strategic Thinking Mobile Advertising Outsourcing Business Intelligence Management Strategy Digital Marketing Sales Operations Leadership Google Adwords Online Advertising See 3+     See less Sales Management Advertising Sales Strategic Leadership Team Leadership Managing High... Business Strategy Strategic Partnerships Strategic Thinking Mobile Advertising Outsourcing Business Intelligence Management Strategy Digital Marketing Sales Operations Leadership Google Adwords Online Advertising See 3+     See less Sales Management Advertising Sales Strategic Leadership Team Leadership Managing High... Business Strategy Strategic Partnerships Strategic Thinking Mobile Advertising Outsourcing Business Intelligence Management Strategy Digital Marketing Sales Operations Leadership Google Adwords Online Advertising See 3+     See less Education Kellogg School of Management Master of Business Administration (MBA),  Entrepreneurship & Management Strategy 2013 INSEAD Business School Marketing Activities and Societies:  Google Marketing Academy PSG College for Arts and Science, Coimbatore B.Com,  Commerce ,  Business management Captain of the district cricket team, Represented the tamil nadu state junior cricket team and south zone junior cricket team (combination of the best players from the 6 states in south india) Stanford University Stanford Advanced Project Management Program (SAPM),  Project Management Kellogg School of Management Master of Business Administration (MBA),  Entrepreneurship & Management Strategy 2013 Kellogg School of Management Master of Business Administration (MBA),  Entrepreneurship & Management Strategy 2013 Kellogg School of Management Master of Business Administration (MBA),  Entrepreneurship & Management Strategy 2013 INSEAD Business School Marketing Activities and Societies:  Google Marketing Academy INSEAD Business School Marketing Activities and Societies:  Google Marketing Academy INSEAD Business School Marketing Activities and Societies:  Google Marketing Academy PSG College for Arts and Science, Coimbatore B.Com,  Commerce ,  Business management Captain of the district cricket team, Represented the tamil nadu state junior cricket team and south zone junior cricket team (combination of the best players from the 6 states in south india) PSG College for Arts and Science, Coimbatore B.Com,  Commerce ,  Business management Captain of the district cricket team, Represented the tamil nadu state junior cricket team and south zone junior cricket team (combination of the best players from the 6 states in south india) PSG College for Arts and Science, Coimbatore B.Com,  Commerce ,  Business management Captain of the district cricket team, Represented the tamil nadu state junior cricket team and south zone junior cricket team (combination of the best players from the 6 states in south india) Stanford University Stanford Advanced Project Management Program (SAPM),  Project Management Stanford University Stanford Advanced Project Management Program (SAPM),  Project Management Stanford University Stanford Advanced Project Management Program (SAPM),  Project Management Honors & Awards OC Award Larry Page's team Awarded as the primary contributor for setting up the vendor sales channel and for increasing SMB acquisitions by more than 100% in 1 year in India. Additional Honors & Awards OC Award winner for 'Smart Targeting' project in 2010 at Google OC Award Larry Page's team Awarded as the primary contributor for setting up the vendor sales channel and for increasing SMB acquisitions by more than 100% in 1 year in India. OC Award Larry Page's team Awarded as the primary contributor for setting up the vendor sales channel and for increasing SMB acquisitions by more than 100% in 1 year in India. OC Award Larry Page's team Awarded as the primary contributor for setting up the vendor sales channel and for increasing SMB acquisitions by more than 100% in 1 year in India. Additional Honors & Awards OC Award winner for 'Smart Targeting' project in 2010 at Google Additional Honors & Awards OC Award winner for 'Smart Targeting' project in 2010 at Google Additional Honors & Awards OC Award winner for 'Smart Targeting' project in 2010 at Google ", "Summary Specialties:Online media, SEM, search advertising, online strategy, digital media planning, business development, travel industry marketing Summary Specialties:Online media, SEM, search advertising, online strategy, digital media planning, business development, travel industry marketing Specialties:Online media, SEM, search advertising, online strategy, digital media planning, business development, travel industry marketing Specialties:Online media, SEM, search advertising, online strategy, digital media planning, business development, travel industry marketing Experience Principal Account Manager, Automotive Google July 2014  – Present (1 year 2 months) Sydney Area, Australia Industry Manager, Online Travel Google July 2012  –  June 2014  (2 years) Sydney Area, Australia Senior Account Manager, Online Travel Google May 2011  –  August 2012  (1 year 4 months) Account Manager, Online Travel Google December 2009  –  May 2011  (1 year 6 months) AdWords Associate, Travel Google December 2007  –  November 2009  (2 years) AdWords Coordinator Google March 2006  –  November 2007  (1 year 9 months) Consultant Flight Centre December 2003  –  February 2006  (2 years 3 months) Agency Account Coordinator Austereo February 2002  –  December 2003  (1 year 11 months) Principal Account Manager, Automotive Google July 2014  – Present (1 year 2 months) Sydney Area, Australia Principal Account Manager, Automotive Google July 2014  – Present (1 year 2 months) Sydney Area, Australia Industry Manager, Online Travel Google July 2012  –  June 2014  (2 years) Sydney Area, Australia Industry Manager, Online Travel Google July 2012  –  June 2014  (2 years) Sydney Area, Australia Senior Account Manager, Online Travel Google May 2011  –  August 2012  (1 year 4 months) Senior Account Manager, Online Travel Google May 2011  –  August 2012  (1 year 4 months) Account Manager, Online Travel Google December 2009  –  May 2011  (1 year 6 months) Account Manager, Online Travel Google December 2009  –  May 2011  (1 year 6 months) AdWords Associate, Travel Google December 2007  –  November 2009  (2 years) AdWords Associate, Travel Google December 2007  –  November 2009  (2 years) AdWords Coordinator Google March 2006  –  November 2007  (1 year 9 months) AdWords Coordinator Google March 2006  –  November 2007  (1 year 9 months) Consultant Flight Centre December 2003  –  February 2006  (2 years 3 months) Consultant Flight Centre December 2003  –  February 2006  (2 years 3 months) Agency Account Coordinator Austereo February 2002  –  December 2003  (1 year 11 months) Agency Account Coordinator Austereo February 2002  –  December 2003  (1 year 11 months) Skills Search Advertising SEM Media Planning New Media Interactive Advertising Online Advertising Google Adwords Mobile Advertising Digital Strategy Conversion Optimization Landing Page... Google Analytics Online Marketing Advertising Sales User Experience Online Travel Web Analytics E-commerce Consulting E-commerce See 4+     See less Skills  Search Advertising SEM Media Planning New Media Interactive Advertising Online Advertising Google Adwords Mobile Advertising Digital Strategy Conversion Optimization Landing Page... Google Analytics Online Marketing Advertising Sales User Experience Online Travel Web Analytics E-commerce Consulting E-commerce See 4+     See less Search Advertising SEM Media Planning New Media Interactive Advertising Online Advertising Google Adwords Mobile Advertising Digital Strategy Conversion Optimization Landing Page... Google Analytics Online Marketing Advertising Sales User Experience Online Travel Web Analytics E-commerce Consulting E-commerce See 4+     See less Search Advertising SEM Media Planning New Media Interactive Advertising Online Advertising Google Adwords Mobile Advertising Digital Strategy Conversion Optimization Landing Page... Google Analytics Online Marketing Advertising Sales User Experience Online Travel Web Analytics E-commerce Consulting E-commerce See 4+     See less Education University of Technology, Sydney BA,  Communication 1999  – 2001 University of Technology, Sydney BA,  Communication 1999  – 2001 University of Technology, Sydney BA,  Communication 1999  – 2001 University of Technology, Sydney BA,  Communication 1999  – 2001 ", "Experience Sales Development Manager, Government & Advocacy Google July 2015  – Present (2 months) Ann Arbor, MI Industry Analyst, Media & Entertainment Google January 2012  – Present (3 years 8 months) Ann Arbor, MI Responsibilities include conducting internal and third party research for clients, developing pitches and narratives around industry research and Google products, managing the @GoogleLiveEvent Twitter account to share relevant music/sports/ticketing/theater industry updates with followers, writing case studies for client success stories and working with PR to promote them externally, and coordinating industry conference attendance and presentations. Graduate Fellow, Global Information Engagement Program School of Information, University of Michigan November 2013  –  July 2014  (9 months) Thiruvananthapuram, India Created by the University of Michigan's School of Information, the Global Information Engagement Program (GIEP) is an innovative approach to learning which partners non-profit, research, and educational organizations in an international setting with carefully selected student teams. With a team, I'm developing a website for individuals with disabilities in India, as well as their advocates, policy experts, and service providers. In a one-stop, accessible web space, the site offers a localized disability services resource, a web forum where users can pose questions about disability topics and receive answers from experts, and a searchable Indian disability policy repository. AdWords Strategist Google July 2008  –  January 2012  (3 years 7 months) Managed AdWords clients in the Business & Industrial Markets, Publishing, and Ticketing industries. Planned and executed strategic client visits to build foundations for long-lasting relationships. Collaborated with team members on account strategy, account optimization and client communication. Developed automated business reports to make scaled recommendations for clients. Led trainings on optimization, mobile, and workflow for both India and North America teams. AdWords Associate Google February 2007  –  June 2008  (1 year 5 months) Assistant Account Executive PCGCampbell January 2006  –  February 2007  (1 year 2 months) Helped to maximize client’s public image through employment of grassroots marketing initiatives. Acted as project manager for four annual and ongoing programs. Wrote and copyedited speech material for client representatives, coordinated celebrity management and logistics, and worked on location at client events. Researched new business leads for the Account Director. Communication Studies Research Assistant University of Michigan April 2005  –  December 2005  (9 months) Translated early 20th century French newspaper articles into English and wrote abstracts for academic texts. Sales Development Manager, Government & Advocacy Google July 2015  – Present (2 months) Ann Arbor, MI Sales Development Manager, Government & Advocacy Google July 2015  – Present (2 months) Ann Arbor, MI Industry Analyst, Media & Entertainment Google January 2012  – Present (3 years 8 months) Ann Arbor, MI Responsibilities include conducting internal and third party research for clients, developing pitches and narratives around industry research and Google products, managing the @GoogleLiveEvent Twitter account to share relevant music/sports/ticketing/theater industry updates with followers, writing case studies for client success stories and working with PR to promote them externally, and coordinating industry conference attendance and presentations. Industry Analyst, Media & Entertainment Google January 2012  – Present (3 years 8 months) Ann Arbor, MI Responsibilities include conducting internal and third party research for clients, developing pitches and narratives around industry research and Google products, managing the @GoogleLiveEvent Twitter account to share relevant music/sports/ticketing/theater industry updates with followers, writing case studies for client success stories and working with PR to promote them externally, and coordinating industry conference attendance and presentations. Graduate Fellow, Global Information Engagement Program School of Information, University of Michigan November 2013  –  July 2014  (9 months) Thiruvananthapuram, India Created by the University of Michigan's School of Information, the Global Information Engagement Program (GIEP) is an innovative approach to learning which partners non-profit, research, and educational organizations in an international setting with carefully selected student teams. With a team, I'm developing a website for individuals with disabilities in India, as well as their advocates, policy experts, and service providers. In a one-stop, accessible web space, the site offers a localized disability services resource, a web forum where users can pose questions about disability topics and receive answers from experts, and a searchable Indian disability policy repository. Graduate Fellow, Global Information Engagement Program School of Information, University of Michigan November 2013  –  July 2014  (9 months) Thiruvananthapuram, India Created by the University of Michigan's School of Information, the Global Information Engagement Program (GIEP) is an innovative approach to learning which partners non-profit, research, and educational organizations in an international setting with carefully selected student teams. With a team, I'm developing a website for individuals with disabilities in India, as well as their advocates, policy experts, and service providers. In a one-stop, accessible web space, the site offers a localized disability services resource, a web forum where users can pose questions about disability topics and receive answers from experts, and a searchable Indian disability policy repository. AdWords Strategist Google July 2008  –  January 2012  (3 years 7 months) Managed AdWords clients in the Business & Industrial Markets, Publishing, and Ticketing industries. Planned and executed strategic client visits to build foundations for long-lasting relationships. Collaborated with team members on account strategy, account optimization and client communication. Developed automated business reports to make scaled recommendations for clients. Led trainings on optimization, mobile, and workflow for both India and North America teams. AdWords Strategist Google July 2008  –  January 2012  (3 years 7 months) Managed AdWords clients in the Business & Industrial Markets, Publishing, and Ticketing industries. Planned and executed strategic client visits to build foundations for long-lasting relationships. Collaborated with team members on account strategy, account optimization and client communication. Developed automated business reports to make scaled recommendations for clients. Led trainings on optimization, mobile, and workflow for both India and North America teams. AdWords Associate Google February 2007  –  June 2008  (1 year 5 months) AdWords Associate Google February 2007  –  June 2008  (1 year 5 months) Assistant Account Executive PCGCampbell January 2006  –  February 2007  (1 year 2 months) Helped to maximize client’s public image through employment of grassroots marketing initiatives. Acted as project manager for four annual and ongoing programs. Wrote and copyedited speech material for client representatives, coordinated celebrity management and logistics, and worked on location at client events. Researched new business leads for the Account Director. Assistant Account Executive PCGCampbell January 2006  –  February 2007  (1 year 2 months) Helped to maximize client’s public image through employment of grassroots marketing initiatives. Acted as project manager for four annual and ongoing programs. Wrote and copyedited speech material for client representatives, coordinated celebrity management and logistics, and worked on location at client events. Researched new business leads for the Account Director. Communication Studies Research Assistant University of Michigan April 2005  –  December 2005  (9 months) Translated early 20th century French newspaper articles into English and wrote abstracts for academic texts. Communication Studies Research Assistant University of Michigan April 2005  –  December 2005  (9 months) Translated early 20th century French newspaper articles into English and wrote abstracts for academic texts. Languages French French French Skills Python SQLite HTML CSS Google Adwords SEM Policy Writing Policy Analysis Privacy Issues Marketing Research Research Adobe Creative Suite Google Apps Google for Nonprofits Event Ticketing Music Industry Sports Industry Mobile Advertising Mobile Devices Google Analytics Web Analytics Digital Marketing Online Advertising PPC Online Marketing DoubleClick Public Relations Search Advertising Mobile Marketing Search Display Advertising YouTube Ad Networks See 18+     See less Skills  Python SQLite HTML CSS Google Adwords SEM Policy Writing Policy Analysis Privacy Issues Marketing Research Research Adobe Creative Suite Google Apps Google for Nonprofits Event Ticketing Music Industry Sports Industry Mobile Advertising Mobile Devices Google Analytics Web Analytics Digital Marketing Online Advertising PPC Online Marketing DoubleClick Public Relations Search Advertising Mobile Marketing Search Display Advertising YouTube Ad Networks See 18+     See less Python SQLite HTML CSS Google Adwords SEM Policy Writing Policy Analysis Privacy Issues Marketing Research Research Adobe Creative Suite Google Apps Google for Nonprofits Event Ticketing Music Industry Sports Industry Mobile Advertising Mobile Devices Google Analytics Web Analytics Digital Marketing Online Advertising PPC Online Marketing DoubleClick Public Relations Search Advertising Mobile Marketing Search Display Advertising YouTube Ad Networks See 18+     See less Python SQLite HTML CSS Google Adwords SEM Policy Writing Policy Analysis Privacy Issues Marketing Research Research Adobe Creative Suite Google Apps Google for Nonprofits Event Ticketing Music Industry Sports Industry Mobile Advertising Mobile Devices Google Analytics Web Analytics Digital Marketing Online Advertising PPC Online Marketing DoubleClick Public Relations Search Advertising Mobile Marketing Search Display Advertising YouTube Ad Networks See 18+     See less Education University of Michigan - School of Information MSI,  Information Policy 2010  – 2014 Activities and Societies:  The Honor Society of Phi Kappa Phi University of Michigan Bachelor of Arts,  English Language and Literature ,  Communication Studies 2002  – 2006 University of Michigan - School of Information MSI,  Information Policy 2010  – 2014 Activities and Societies:  The Honor Society of Phi Kappa Phi University of Michigan - School of Information MSI,  Information Policy 2010  – 2014 Activities and Societies:  The Honor Society of Phi Kappa Phi University of Michigan - School of Information MSI,  Information Policy 2010  – 2014 Activities and Societies:  The Honor Society of Phi Kappa Phi University of Michigan Bachelor of Arts,  English Language and Literature ,  Communication Studies 2002  – 2006 University of Michigan Bachelor of Arts,  English Language and Literature ,  Communication Studies 2002  – 2006 University of Michigan Bachelor of Arts,  English Language and Literature ,  Communication Studies 2002  – 2006 ", "Experience Head of Emerging & Growing markets, Customer Experience Google March 2013  – Present (2 years 6 months) Dublin, Ireland Head of Emerging & Growing markets, Customer Experience Google March 2013  – Present (2 years 6 months) Dublin, Ireland Head of Emerging & Growing markets, Customer Experience Google March 2013  – Present (2 years 6 months) Dublin, Ireland Skills Google Adwords Online Advertising Online Marketing Operations Management Sales Management People Management Management SEM Web Analytics Digital Marketing PPC Google Analytics Project Management Team Management Skills  Google Adwords Online Advertising Online Marketing Operations Management Sales Management People Management Management SEM Web Analytics Digital Marketing PPC Google Analytics Project Management Team Management Google Adwords Online Advertising Online Marketing Operations Management Sales Management People Management Management SEM Web Analytics Digital Marketing PPC Google Analytics Project Management Team Management Google Adwords Online Advertising Online Marketing Operations Management Sales Management People Management Management SEM Web Analytics Digital Marketing PPC Google Analytics Project Management Team Management Education Mississippi State University BS 1998  – 2002 Mississippi State University BA 1998  – 2002 Mississippi State University BS 1998  – 2002 Mississippi State University BS 1998  – 2002 Mississippi State University BS 1998  – 2002 Mississippi State University BA 1998  – 2002 Mississippi State University BA 1998  – 2002 Mississippi State University BA 1998  – 2002 ", "Experience Brand Marketing Lead Google June 2013  – Present (2 years 3 months) San Francisco Media Solutions Lead Google May 2011  –  June 2013  (2 years 2 months) Paris Area, France Online Media Consultant and Mobile Specialist - AdWords Google January 2010  –  May 2011  (1 year 5 months) Online Media Associate and Project lead - AdWords Google April 2008  –  December 2009  (1 year 9 months) Fixed Asset Financial Accountant for Google EMEA (Internship) Google March 2008  –  October 2008  (8 months) AdWords Associate (Internship) Google June 2007  –  September 2007  (4 months) Internal Auditor Etat-Major - French Chief of Defence Staff, Lille (France) July 2006  –  August 2006  (2 months) Freelance Journalist La Voix du Nord July 2005  –  August 2005  (2 months) Brand Marketing Lead Google June 2013  – Present (2 years 3 months) San Francisco Brand Marketing Lead Google June 2013  – Present (2 years 3 months) San Francisco Media Solutions Lead Google May 2011  –  June 2013  (2 years 2 months) Paris Area, France Media Solutions Lead Google May 2011  –  June 2013  (2 years 2 months) Paris Area, France Online Media Consultant and Mobile Specialist - AdWords Google January 2010  –  May 2011  (1 year 5 months) Online Media Consultant and Mobile Specialist - AdWords Google January 2010  –  May 2011  (1 year 5 months) Online Media Associate and Project lead - AdWords Google April 2008  –  December 2009  (1 year 9 months) Online Media Associate and Project lead - AdWords Google April 2008  –  December 2009  (1 year 9 months) Fixed Asset Financial Accountant for Google EMEA (Internship) Google March 2008  –  October 2008  (8 months) Fixed Asset Financial Accountant for Google EMEA (Internship) Google March 2008  –  October 2008  (8 months) AdWords Associate (Internship) Google June 2007  –  September 2007  (4 months) AdWords Associate (Internship) Google June 2007  –  September 2007  (4 months) Internal Auditor Etat-Major - French Chief of Defence Staff, Lille (France) July 2006  –  August 2006  (2 months) Internal Auditor Etat-Major - French Chief of Defence Staff, Lille (France) July 2006  –  August 2006  (2 months) Freelance Journalist La Voix du Nord July 2005  –  August 2005  (2 months) Freelance Journalist La Voix du Nord July 2005  –  August 2005  (2 months) Skills Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Skills  Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Google Adwords SEM PPC Google Analytics Search Advertising Online Advertising Display Advertising Mobile Devices Online Marketing Advertising Sales Mobile Advertising Competitive Analysis New Media Strategy Mobile Marketing Web Analytics YouTube Video Advertising Social Media Social Media Marketing Retail Branding Digital Strategy Advertising Digital Marketing Affiliate Marketing Digital Media Marketing Web Marketing Analytics Ad Networks SEO Ad Serving Behavioral Targeting Lead Generation E-business Omniture Branding & Identity See 22+     See less Education University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux University of Warwick International Relations 2006  – 2007 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program University of Pennsylvania - The Wharton School Marketing 2015 Executive Education Program Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Etudes politiques de Bordeaux Master's degree,  Politics & Economics 2004  – 2008 Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux Institut d'Administration des Entreprises Master's degree,  Financial Management 2007  – 2007 IAE Bordeaux University of Warwick International Relations 2006  – 2007 University of Warwick International Relations 2006  – 2007 University of Warwick International Relations 2006  – 2007 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 Classe préparatoire Watteau Intensive two-year university course preparing for the competitive entrance exam to Grandes Ecoles,  Literature & History 2002  – 2004 ", "Summary 11+ years of experience spanning operations, project management, training, website designing, new business development, etc. My interests lie in advocating for the customer, building great products, servicing customer requirements, developing new businesses, and building great teams to achieve these goals. Summary 11+ years of experience spanning operations, project management, training, website designing, new business development, etc. My interests lie in advocating for the customer, building great products, servicing customer requirements, developing new businesses, and building great teams to achieve these goals. 11+ years of experience spanning operations, project management, training, website designing, new business development, etc. My interests lie in advocating for the customer, building great products, servicing customer requirements, developing new businesses, and building great teams to achieve these goals. 11+ years of experience spanning operations, project management, training, website designing, new business development, etc. My interests lie in advocating for the customer, building great products, servicing customer requirements, developing new businesses, and building great teams to achieve these goals. Experience Strategic Partner Development (Google Cloud Platform) Google July 2015  – Present (2 months) Mountain View, California APAC, Sales Operations Manager Google February 2014  – Present (1 year 7 months) Hyderabad Strategic Partner Development Manager Google 2004  –  2015  (11 years) AdWords, Operations Manager Google December 2009  –  February 2014  (4 years 3 months) Hyderabad Area, India Team Lead, Traning & Development Google 2008  –  2009  (1 year) Hyderabad Area, India AdWords Strategist Google 2006  –  2008  (2 years) Hyderabad Area, India AdWords Associate Google July 2004  –  2006  (2 years) Hyderabad Area, India Strategic Partner Development (Google Cloud Platform) Google July 2015  – Present (2 months) Mountain View, California Strategic Partner Development (Google Cloud Platform) Google July 2015  – Present (2 months) Mountain View, California APAC, Sales Operations Manager Google February 2014  – Present (1 year 7 months) Hyderabad APAC, Sales Operations Manager Google February 2014  – Present (1 year 7 months) Hyderabad Strategic Partner Development Manager Google 2004  –  2015  (11 years) Strategic Partner Development Manager Google 2004  –  2015  (11 years) AdWords, Operations Manager Google December 2009  –  February 2014  (4 years 3 months) Hyderabad Area, India AdWords, Operations Manager Google December 2009  –  February 2014  (4 years 3 months) Hyderabad Area, India Team Lead, Traning & Development Google 2008  –  2009  (1 year) Hyderabad Area, India Team Lead, Traning & Development Google 2008  –  2009  (1 year) Hyderabad Area, India AdWords Strategist Google 2006  –  2008  (2 years) Hyderabad Area, India AdWords Strategist Google 2006  –  2008  (2 years) Hyderabad Area, India AdWords Associate Google July 2004  –  2006  (2 years) Hyderabad Area, India AdWords Associate Google July 2004  –  2006  (2 years) Hyderabad Area, India Languages   Skills Project Management Operations Management Training Strategy Strategy Execution Team Leadership Online Advertising Skills  Project Management Operations Management Training Strategy Strategy Execution Team Leadership Online Advertising Project Management Operations Management Training Strategy Strategy Execution Team Leadership Online Advertising Project Management Operations Management Training Strategy Strategy Execution Team Leadership Online Advertising Education INSEAD INSEAD Marketing Academy,  Marketing/Marketing Management , General 2012  – 2012 Stanford University Stanford Advanced Project Management Certification,  Project Management 2011  – 2011 Ethiraj College, Chennai Bachelor's degree,  Commerce 1996  – 1999 INSEAD INSEAD Marketing Academy,  Marketing/Marketing Management , General 2012  – 2012 INSEAD INSEAD Marketing Academy,  Marketing/Marketing Management , General 2012  – 2012 INSEAD INSEAD Marketing Academy,  Marketing/Marketing Management , General 2012  – 2012 Stanford University Stanford Advanced Project Management Certification,  Project Management 2011  – 2011 Stanford University Stanford Advanced Project Management Certification,  Project Management 2011  – 2011 Stanford University Stanford Advanced Project Management Certification,  Project Management 2011  – 2011 Ethiraj College, Chennai Bachelor's degree,  Commerce 1996  – 1999 Ethiraj College, Chennai Bachelor's degree,  Commerce 1996  – 1999 Ethiraj College, Chennai Bachelor's degree,  Commerce 1996  – 1999 Honors & Awards ", "Experience Head of Industry, Media & Entertainment Google, DoubleClick August 2014  – Present (1 year 1 month) San Francisco Oversee Media & Entertainment team in US to drive growth across all platform technologies for DoubleClick. DoubleClick Sales Manager at Google Google September 2012  –  August 2014  (2 years) San Francisco Manage a sales team dedicated to the growth of DoubleClick Digital Marketing with a specific focus on DoubleClick Bid Manager across key partners. New Business Lead, Invite Media Google July 2011  –  September 2012  (1 year 3 months) San Francisco Bay Area Driving new business for Invite Media, Google's DSP. \n \nGrew new business revenue contribution to the book of business managed revenue by 3x Account Executive, Google Consumer Packaged Goods Google December 2009  –  July 2011  (1 year 8 months) Greater Boston Area Creating compelling digital narratives for Consumer Packaged Goods companies using the Google suite of products.  \n \nFounded the CPG team in the Online Sales group at Google. Grew managed revenue to $100MM+ annually and grew the team from one person to 8 people. AdWords Account Strategist Google September 2007  –  January 2009  (1 year 5 months) Transferred to a new satellite office (Ann Arbor) to help start a training team and introductory account management team.  \n \nTransitioned to being the lead on an account management team focused on Retail advertisers.  \n \nTransferred again to Boston satellite office to start the training team in the office as the sales team was growing exponentially. AdWords Associate Google March 2006  –  September 2007  (1 year 7 months) Account management across Google's suite of advertising products for high potential advertisers. AdWords Representative Google 2005  –  2006  (1 year) Developed product and industry expertise Head of Industry, Media & Entertainment Google, DoubleClick August 2014  – Present (1 year 1 month) San Francisco Oversee Media & Entertainment team in US to drive growth across all platform technologies for DoubleClick. Head of Industry, Media & Entertainment Google, DoubleClick August 2014  – Present (1 year 1 month) San Francisco Oversee Media & Entertainment team in US to drive growth across all platform technologies for DoubleClick. DoubleClick Sales Manager at Google Google September 2012  –  August 2014  (2 years) San Francisco Manage a sales team dedicated to the growth of DoubleClick Digital Marketing with a specific focus on DoubleClick Bid Manager across key partners. DoubleClick Sales Manager at Google Google September 2012  –  August 2014  (2 years) San Francisco Manage a sales team dedicated to the growth of DoubleClick Digital Marketing with a specific focus on DoubleClick Bid Manager across key partners. New Business Lead, Invite Media Google July 2011  –  September 2012  (1 year 3 months) San Francisco Bay Area Driving new business for Invite Media, Google's DSP. \n \nGrew new business revenue contribution to the book of business managed revenue by 3x New Business Lead, Invite Media Google July 2011  –  September 2012  (1 year 3 months) San Francisco Bay Area Driving new business for Invite Media, Google's DSP. \n \nGrew new business revenue contribution to the book of business managed revenue by 3x Account Executive, Google Consumer Packaged Goods Google December 2009  –  July 2011  (1 year 8 months) Greater Boston Area Creating compelling digital narratives for Consumer Packaged Goods companies using the Google suite of products.  \n \nFounded the CPG team in the Online Sales group at Google. Grew managed revenue to $100MM+ annually and grew the team from one person to 8 people. Account Executive, Google Consumer Packaged Goods Google December 2009  –  July 2011  (1 year 8 months) Greater Boston Area Creating compelling digital narratives for Consumer Packaged Goods companies using the Google suite of products.  \n \nFounded the CPG team in the Online Sales group at Google. Grew managed revenue to $100MM+ annually and grew the team from one person to 8 people. AdWords Account Strategist Google September 2007  –  January 2009  (1 year 5 months) Transferred to a new satellite office (Ann Arbor) to help start a training team and introductory account management team.  \n \nTransitioned to being the lead on an account management team focused on Retail advertisers.  \n \nTransferred again to Boston satellite office to start the training team in the office as the sales team was growing exponentially. AdWords Account Strategist Google September 2007  –  January 2009  (1 year 5 months) Transferred to a new satellite office (Ann Arbor) to help start a training team and introductory account management team.  \n \nTransitioned to being the lead on an account management team focused on Retail advertisers.  \n \nTransferred again to Boston satellite office to start the training team in the office as the sales team was growing exponentially. AdWords Associate Google March 2006  –  September 2007  (1 year 7 months) Account management across Google's suite of advertising products for high potential advertisers. AdWords Associate Google March 2006  –  September 2007  (1 year 7 months) Account management across Google's suite of advertising products for high potential advertisers. AdWords Representative Google 2005  –  2006  (1 year) Developed product and industry expertise AdWords Representative Google 2005  –  2006  (1 year) Developed product and industry expertise Languages Korean Korean Korean Skills Google Adwords SEM Digital Marketing Display Advertising DoubleClick Ad Networks Search Advertising Online Advertising PPC Mobile Advertising Web Analytics Mobile Marketing Analytics Ad Serving Digital Media Digital Strategy Google Analytics Conversion Optimization Account Management See 4+     See less Skills  Google Adwords SEM Digital Marketing Display Advertising DoubleClick Ad Networks Search Advertising Online Advertising PPC Mobile Advertising Web Analytics Mobile Marketing Analytics Ad Serving Digital Media Digital Strategy Google Analytics Conversion Optimization Account Management See 4+     See less Google Adwords SEM Digital Marketing Display Advertising DoubleClick Ad Networks Search Advertising Online Advertising PPC Mobile Advertising Web Analytics Mobile Marketing Analytics Ad Serving Digital Media Digital Strategy Google Analytics Conversion Optimization Account Management See 4+     See less Google Adwords SEM Digital Marketing Display Advertising DoubleClick Ad Networks Search Advertising Online Advertising PPC Mobile Advertising Web Analytics Mobile Marketing Analytics Ad Serving Digital Media Digital Strategy Google Analytics Conversion Optimization Account Management See 4+     See less Education Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 ", "Summary A focused professional with over 4 years of experience in: \n \n• Project Management  \n• Lean Process Improvement  \n• Requirement Analysis \n• Resource Management  \n• Team Management  \n• Liaison & Coordination \n• Debugging MIS & Reporting SLA Management \n \n● Exposure of working on various projects across the tenure using Agile & Scrum Methodologies \n \n● Expertise in managing overall implementation projects encompassing planning, monitoring, controlling phases of project lifecycle, inter-discipline coordination, administration and \nresource planning \n \n● Achieved Platinum Award (Q2) Global Customer Services SMB for Global Ads Review \nQuality Tool from VP Google in 2012 and Gold Award (Q2)-iCS Awards for Vertical Trends \nTool from Director Google in 2014 \n \n● Collaborating with leadership teams to evaluate technology challenges, defining new \nstructures and creating a governance model of enterprise architecture for business, data, \napplications and technology within the organization \n \n● Certified Lean Six Sigma Green Belt, Lean Six Sigma White Belt and completed Google Six \nSigma Green Belt Project \n \n● Efficient organizer, motivator, team player and a decisive leader to motivate teams to excel \nand win \n Summary A focused professional with over 4 years of experience in: \n \n• Project Management  \n• Lean Process Improvement  \n• Requirement Analysis \n• Resource Management  \n• Team Management  \n• Liaison & Coordination \n• Debugging MIS & Reporting SLA Management \n \n● Exposure of working on various projects across the tenure using Agile & Scrum Methodologies \n \n● Expertise in managing overall implementation projects encompassing planning, monitoring, controlling phases of project lifecycle, inter-discipline coordination, administration and \nresource planning \n \n● Achieved Platinum Award (Q2) Global Customer Services SMB for Global Ads Review \nQuality Tool from VP Google in 2012 and Gold Award (Q2)-iCS Awards for Vertical Trends \nTool from Director Google in 2014 \n \n● Collaborating with leadership teams to evaluate technology challenges, defining new \nstructures and creating a governance model of enterprise architecture for business, data, \napplications and technology within the organization \n \n● Certified Lean Six Sigma Green Belt, Lean Six Sigma White Belt and completed Google Six \nSigma Green Belt Project \n \n● Efficient organizer, motivator, team player and a decisive leader to motivate teams to excel \nand win \n A focused professional with over 4 years of experience in: \n \n• Project Management  \n• Lean Process Improvement  \n• Requirement Analysis \n• Resource Management  \n• Team Management  \n• Liaison & Coordination \n• Debugging MIS & Reporting SLA Management \n \n● Exposure of working on various projects across the tenure using Agile & Scrum Methodologies \n \n● Expertise in managing overall implementation projects encompassing planning, monitoring, controlling phases of project lifecycle, inter-discipline coordination, administration and \nresource planning \n \n● Achieved Platinum Award (Q2) Global Customer Services SMB for Global Ads Review \nQuality Tool from VP Google in 2012 and Gold Award (Q2)-iCS Awards for Vertical Trends \nTool from Director Google in 2014 \n \n● Collaborating with leadership teams to evaluate technology challenges, defining new \nstructures and creating a governance model of enterprise architecture for business, data, \napplications and technology within the organization \n \n● Certified Lean Six Sigma Green Belt, Lean Six Sigma White Belt and completed Google Six \nSigma Green Belt Project \n \n● Efficient organizer, motivator, team player and a decisive leader to motivate teams to excel \nand win \n A focused professional with over 4 years of experience in: \n \n• Project Management  \n• Lean Process Improvement  \n• Requirement Analysis \n• Resource Management  \n• Team Management  \n• Liaison & Coordination \n• Debugging MIS & Reporting SLA Management \n \n● Exposure of working on various projects across the tenure using Agile & Scrum Methodologies \n \n● Expertise in managing overall implementation projects encompassing planning, monitoring, controlling phases of project lifecycle, inter-discipline coordination, administration and \nresource planning \n \n● Achieved Platinum Award (Q2) Global Customer Services SMB for Global Ads Review \nQuality Tool from VP Google in 2012 and Gold Award (Q2)-iCS Awards for Vertical Trends \nTool from Director Google in 2014 \n \n● Collaborating with leadership teams to evaluate technology challenges, defining new \nstructures and creating a governance model of enterprise architecture for business, data, \napplications and technology within the organization \n \n● Certified Lean Six Sigma Green Belt, Lean Six Sigma White Belt and completed Google Six \nSigma Green Belt Project \n \n● Efficient organizer, motivator, team player and a decisive leader to motivate teams to excel \nand win \n Experience Analytical Lead Google April 2015  – Present (5 months) Hyderabad Area, India \"Develop innovative, scalable sales tool prototypes\" Innovation Analyst Google April 2014  – Present (1 year 5 months) Hyderabad Area, India • Worked on developing Vertical trends project [Google Query Trend Search Insights Tool] \nused by around 3000+ external clients \n \nFTE Savings - ~350/year Tools Product Specialist Google October 2011  –  April 2014  (2 years 7 months) • Invented Parivartan [Ads Review Quality tool] \nReduced TAT of Ads quality review from 1.5 week to 2 days. \n \n• Acquired Technical Expertise[Python,Javscript,Mysql,PHP] \n• Managed Projects end to end from project proposal to development and support \n• Recieved Platinum award from VP for Project Parivartan \n• Project lead and Inventor of projects like  \n- Galaxy [Central system for automation tools] \n- PRISM [Project for reducing cycle time for review of translation failed Ads] \n- Juran [Audit Tool for Quality ] Adwords Associate Google May 2011  –  September 2011  (5 months) • Worked in Ads Review Team of Google \n• Ads Quality Critical Error Mitigation project which was one of the face changing project in AdsQuality world Analytical Lead Google April 2015  – Present (5 months) Hyderabad Area, India \"Develop innovative, scalable sales tool prototypes\" Analytical Lead Google April 2015  – Present (5 months) Hyderabad Area, India \"Develop innovative, scalable sales tool prototypes\" Innovation Analyst Google April 2014  – Present (1 year 5 months) Hyderabad Area, India • Worked on developing Vertical trends project [Google Query Trend Search Insights Tool] \nused by around 3000+ external clients \n \nFTE Savings - ~350/year Innovation Analyst Google April 2014  – Present (1 year 5 months) Hyderabad Area, India • Worked on developing Vertical trends project [Google Query Trend Search Insights Tool] \nused by around 3000+ external clients \n \nFTE Savings - ~350/year Tools Product Specialist Google October 2011  –  April 2014  (2 years 7 months) • Invented Parivartan [Ads Review Quality tool] \nReduced TAT of Ads quality review from 1.5 week to 2 days. \n \n• Acquired Technical Expertise[Python,Javscript,Mysql,PHP] \n• Managed Projects end to end from project proposal to development and support \n• Recieved Platinum award from VP for Project Parivartan \n• Project lead and Inventor of projects like  \n- Galaxy [Central system for automation tools] \n- PRISM [Project for reducing cycle time for review of translation failed Ads] \n- Juran [Audit Tool for Quality ] Tools Product Specialist Google October 2011  –  April 2014  (2 years 7 months) • Invented Parivartan [Ads Review Quality tool] \nReduced TAT of Ads quality review from 1.5 week to 2 days. \n \n• Acquired Technical Expertise[Python,Javscript,Mysql,PHP] \n• Managed Projects end to end from project proposal to development and support \n• Recieved Platinum award from VP for Project Parivartan \n• Project lead and Inventor of projects like  \n- Galaxy [Central system for automation tools] \n- PRISM [Project for reducing cycle time for review of translation failed Ads] \n- Juran [Audit Tool for Quality ] Adwords Associate Google May 2011  –  September 2011  (5 months) • Worked in Ads Review Team of Google \n• Ads Quality Critical Error Mitigation project which was one of the face changing project in AdsQuality world Adwords Associate Google May 2011  –  September 2011  (5 months) • Worked in Ads Review Team of Google \n• Ads Quality Critical Error Mitigation project which was one of the face changing project in AdsQuality world Languages English English English Skills Project Management Process Improvement Six Sigma Python JavaScript MySQL Sales Operations Quality System Quality Management Business Analysis Quality Control Customer Satisfaction Data Analysis FMEA Teamwork Microsoft Excel Analytics Team Management Business Development Management See 5+     See less Skills  Project Management Process Improvement Six Sigma Python JavaScript MySQL Sales Operations Quality System Quality Management Business Analysis Quality Control Customer Satisfaction Data Analysis FMEA Teamwork Microsoft Excel Analytics Team Management Business Development Management See 5+     See less Project Management Process Improvement Six Sigma Python JavaScript MySQL Sales Operations Quality System Quality Management Business Analysis Quality Control Customer Satisfaction Data Analysis FMEA Teamwork Microsoft Excel Analytics Team Management Business Development Management See 5+     See less Project Management Process Improvement Six Sigma Python JavaScript MySQL Sales Operations Quality System Quality Management Business Analysis Quality Control Customer Satisfaction Data Analysis FMEA Teamwork Microsoft Excel Analytics Team Management Business Development Management See 5+     See less Education CHRIST UNIVERSITY MBA,  OPERATIONS AND SYSTEMS , 73% 2009  – 2011 Amrita Institute Of Technology Science B,  TECH (Electronics and Instrumentation) , CGPA - 8.0 2005  – 2009 EASTHILL HIGHER SECONDARY PLUS TWO,  SCIENCE 2003  – 2005 81% SILVER HILLS HIGH SCHOOL HSC,  English 1995  – 2005 93% CHRIST UNIVERSITY MBA,  OPERATIONS AND SYSTEMS , 73% 2009  – 2011 CHRIST UNIVERSITY MBA,  OPERATIONS AND SYSTEMS , 73% 2009  – 2011 CHRIST UNIVERSITY MBA,  OPERATIONS AND SYSTEMS , 73% 2009  – 2011 Amrita Institute Of Technology Science B,  TECH (Electronics and Instrumentation) , CGPA - 8.0 2005  – 2009 Amrita Institute Of Technology Science B,  TECH (Electronics and Instrumentation) , CGPA - 8.0 2005  – 2009 Amrita Institute Of Technology Science B,  TECH (Electronics and Instrumentation) , CGPA - 8.0 2005  – 2009 EASTHILL HIGHER SECONDARY PLUS TWO,  SCIENCE 2003  – 2005 81% EASTHILL HIGHER SECONDARY PLUS TWO,  SCIENCE 2003  – 2005 81% EASTHILL HIGHER SECONDARY PLUS TWO,  SCIENCE 2003  – 2005 81% SILVER HILLS HIGH SCHOOL HSC,  English 1995  – 2005 93% SILVER HILLS HIGH SCHOOL HSC,  English 1995  – 2005 93% SILVER HILLS HIGH SCHOOL HSC,  English 1995  – 2005 93% ", "Languages English French English French English French Skills Operations Management Online Help Program Management Change Management E-commerce Google Adwords Web Analytics SEM Cloud Computing Google Analytics PPC Online Advertising Product Management Analytics Vendor Management Strategy Competitive Analysis Online Marketing Conversion Optimization Business Process Search Advertising Cross-functional Team... Mobile Advertising Digital Media Leadership Mobile Marketing CRM Strategic Partnerships Digital Marketing Mobile Applications Digital Strategy Product Marketing Start-ups Entrepreneurship Ad Networks Affiliate Marketing Ad Serving Display Advertising Content Management DoubleClick Email Marketing Mobile Internet Lead Generation Omniture See 29+     See less Skills  Operations Management Online Help Program Management Change Management E-commerce Google Adwords Web Analytics SEM Cloud Computing Google Analytics PPC Online Advertising Product Management Analytics Vendor Management Strategy Competitive Analysis Online Marketing Conversion Optimization Business Process Search Advertising Cross-functional Team... Mobile Advertising Digital Media Leadership Mobile Marketing CRM Strategic Partnerships Digital Marketing Mobile Applications Digital Strategy Product Marketing Start-ups Entrepreneurship Ad Networks Affiliate Marketing Ad Serving Display Advertising Content Management DoubleClick Email Marketing Mobile Internet Lead Generation Omniture See 29+     See less Operations Management Online Help Program Management Change Management E-commerce Google Adwords Web Analytics SEM Cloud Computing Google Analytics PPC Online Advertising Product Management Analytics Vendor Management Strategy Competitive Analysis Online Marketing Conversion Optimization Business Process Search Advertising Cross-functional Team... Mobile Advertising Digital Media Leadership Mobile Marketing CRM Strategic Partnerships Digital Marketing Mobile Applications Digital Strategy Product Marketing Start-ups Entrepreneurship Ad Networks Affiliate Marketing Ad Serving Display Advertising Content Management DoubleClick Email Marketing Mobile Internet Lead Generation Omniture See 29+     See less Operations Management Online Help Program Management Change Management E-commerce Google Adwords Web Analytics SEM Cloud Computing Google Analytics PPC Online Advertising Product Management Analytics Vendor Management Strategy Competitive Analysis Online Marketing Conversion Optimization Business Process Search Advertising Cross-functional Team... Mobile Advertising Digital Media Leadership Mobile Marketing CRM Strategic Partnerships Digital Marketing Mobile Applications Digital Strategy Product Marketing Start-ups Entrepreneurship Ad Networks Affiliate Marketing Ad Serving Display Advertising Content Management DoubleClick Email Marketing Mobile Internet Lead Generation Omniture See 29+     See less Honors & Awards "]}