{"position": "AdWords Representative - Hourly", "company": "Google", "profiles": ["Experience Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 9 months) San Francisco Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 10 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Vertical Sales Manager Google April 2008  – Present (7 years 4 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Representative Google October 2003  –  February 2004  (5 months) Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 9 months) San Francisco Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 9 months) San Francisco Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 10 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 10 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Vertical Sales Manager Google April 2008  – Present (7 years 4 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. Vertical Sales Manager Google April 2008  – Present (7 years 4 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Representative Google October 2003  –  February 2004  (5 months) AdWords Representative Google October 2003  –  February 2004  (5 months) Skills Top Skills 51 Google Adwords 18 Google Analytics 17 Advertising 16 SEM 15 Online Advertising 11 DoubleClick 10 Digital Marketing 6 PPC 4 Social Media Marketing 3 Web Analytics Cindy also knows about... 3 Digital Strategy Skills  Top Skills 51 Google Adwords 18 Google Analytics 17 Advertising 16 SEM 15 Online Advertising 11 DoubleClick 10 Digital Marketing 6 PPC 4 Social Media Marketing 3 Web Analytics Cindy also knows about... 3 Digital Strategy Top Skills 51 Google Adwords 18 Google Analytics 17 Advertising 16 SEM 15 Online Advertising 11 DoubleClick 10 Digital Marketing 6 PPC 4 Social Media Marketing 3 Web Analytics Cindy also knows about... 3 Digital Strategy Top Skills 51 Google Adwords 18 Google Analytics 17 Advertising 16 SEM 15 Online Advertising 11 DoubleClick 10 Digital Marketing 6 PPC 4 Social Media Marketing 3 Web Analytics Cindy also knows about... 3 Digital Strategy                     3 Digital Strategy Education Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team ", "Experience Head of Agency Development, Global SMB Revenue Organization Google July 2014  – Present (1 year 1 month) Head of Channel Managed Agencies Google January 2013  –  June 2014  (1 year 6 months) New York, NY Business Development Manager Google June 2012  –  January 2013  (8 months) New York, NY Account Executive, Direct Sales Google January 2008  –  June 2012  (4 years 6 months) New York, NY F500 clients in Healthcare (Pfizer, Merck, Johnson & Johnson) and CPG (Coca-Cola, PepsiCo, Mars, Bacardi, Dannon) verticals Account Manager, Direct Sales Google January 2006  –  January 2008  (2 years 1 month) New York, NY AdWords Associate Google September 2003  –  December 2005  (2 years 4 months) Mountain View, CA AdWords Representative Google March 2003  –  September 2003  (7 months) Mountain View, CA Head of Agency Development, Global SMB Revenue Organization Google July 2014  – Present (1 year 1 month) Head of Agency Development, Global SMB Revenue Organization Google July 2014  – Present (1 year 1 month) Head of Channel Managed Agencies Google January 2013  –  June 2014  (1 year 6 months) New York, NY Head of Channel Managed Agencies Google January 2013  –  June 2014  (1 year 6 months) New York, NY Business Development Manager Google June 2012  –  January 2013  (8 months) New York, NY Business Development Manager Google June 2012  –  January 2013  (8 months) New York, NY Account Executive, Direct Sales Google January 2008  –  June 2012  (4 years 6 months) New York, NY F500 clients in Healthcare (Pfizer, Merck, Johnson & Johnson) and CPG (Coca-Cola, PepsiCo, Mars, Bacardi, Dannon) verticals Account Executive, Direct Sales Google January 2008  –  June 2012  (4 years 6 months) New York, NY F500 clients in Healthcare (Pfizer, Merck, Johnson & Johnson) and CPG (Coca-Cola, PepsiCo, Mars, Bacardi, Dannon) verticals Account Manager, Direct Sales Google January 2006  –  January 2008  (2 years 1 month) New York, NY Account Manager, Direct Sales Google January 2006  –  January 2008  (2 years 1 month) New York, NY AdWords Associate Google September 2003  –  December 2005  (2 years 4 months) Mountain View, CA AdWords Associate Google September 2003  –  December 2005  (2 years 4 months) Mountain View, CA AdWords Representative Google March 2003  –  September 2003  (7 months) Mountain View, CA AdWords Representative Google March 2003  –  September 2003  (7 months) Mountain View, CA Skills Top Skills 16 Mobile Advertising 16 Online Advertising 13 Search Advertising 11 Google Adwords 10 SEM 9 Digital Marketing 7 Display Advertising 6 Digital Strategy 5 PPC 4 Strategy Chris also knows about... 2 Mobile Marketing 2 Digital Media 1 DoubleClick 1 Web Analytics 0 Ad Networks 0 Ad Serving 0 Behavioral Targeting 0 Rich Media Skills  Top Skills 16 Mobile Advertising 16 Online Advertising 13 Search Advertising 11 Google Adwords 10 SEM 9 Digital Marketing 7 Display Advertising 6 Digital Strategy 5 PPC 4 Strategy Chris also knows about... 2 Mobile Marketing 2 Digital Media 1 DoubleClick 1 Web Analytics 0 Ad Networks 0 Ad Serving 0 Behavioral Targeting 0 Rich Media Top Skills 16 Mobile Advertising 16 Online Advertising 13 Search Advertising 11 Google Adwords 10 SEM 9 Digital Marketing 7 Display Advertising 6 Digital Strategy 5 PPC 4 Strategy Chris also knows about... 2 Mobile Marketing 2 Digital Media 1 DoubleClick 1 Web Analytics 0 Ad Networks 0 Ad Serving 0 Behavioral Targeting 0 Rich Media Top Skills 16 Mobile Advertising 16 Online Advertising 13 Search Advertising 11 Google Adwords 10 SEM 9 Digital Marketing 7 Display Advertising 6 Digital Strategy 5 PPC 4 Strategy Chris also knows about... 2 Mobile Marketing 2 Digital Media 1 DoubleClick 1 Web Analytics 0 Ad Networks 0 Ad Serving 0 Behavioral Targeting 0 Rich Media                     2 Mobile Marketing 2 Digital Media 1 DoubleClick 1 Web Analytics 0 Ad Networks 0 Ad Serving 0 Behavioral Targeting 0 Rich Media Education Santa Clara University BS,  Psychology Santa Clara University BS,  Psychology Santa Clara University BS,  Psychology Santa Clara University BS,  Psychology ", "Experience Solutions Consultant Google Asia Pacific Pte. Ltd July 2015  – Present (1 month) Singapore Lead Technical Sales Specialist Google Asia Pacific Pte. Ltd January 2012  –  June 2015  (3 years 6 months) Singapore Technical Sales Specialist Google Asia Pacific Pte. Ltd February 2012  –  December 2012  (11 months) Singapore Technical Sales Specialist Google India Pvt Ltd April 2010  –  January 2012  (1 year 10 months) Gurgaon, India Account Associate Google India Pvt Ltd May 2009  –  March 2010  (11 months) Gurgaon, India Senior AdWords Representative Google India Pvt Ltd July 2008  –  April 2009  (10 months) Gurgaon, India AdWords Representative Google September 2007  –  June 2008  (10 months) Gurgaon, India Solutions Consultant Google Asia Pacific Pte. Ltd July 2015  – Present (1 month) Singapore Solutions Consultant Google Asia Pacific Pte. Ltd July 2015  – Present (1 month) Singapore Lead Technical Sales Specialist Google Asia Pacific Pte. Ltd January 2012  –  June 2015  (3 years 6 months) Singapore Lead Technical Sales Specialist Google Asia Pacific Pte. Ltd January 2012  –  June 2015  (3 years 6 months) Singapore Technical Sales Specialist Google Asia Pacific Pte. Ltd February 2012  –  December 2012  (11 months) Singapore Technical Sales Specialist Google Asia Pacific Pte. Ltd February 2012  –  December 2012  (11 months) Singapore Technical Sales Specialist Google India Pvt Ltd April 2010  –  January 2012  (1 year 10 months) Gurgaon, India Technical Sales Specialist Google India Pvt Ltd April 2010  –  January 2012  (1 year 10 months) Gurgaon, India Account Associate Google India Pvt Ltd May 2009  –  March 2010  (11 months) Gurgaon, India Account Associate Google India Pvt Ltd May 2009  –  March 2010  (11 months) Gurgaon, India Senior AdWords Representative Google India Pvt Ltd July 2008  –  April 2009  (10 months) Gurgaon, India Senior AdWords Representative Google India Pvt Ltd July 2008  –  April 2009  (10 months) Gurgaon, India AdWords Representative Google September 2007  –  June 2008  (10 months) Gurgaon, India AdWords Representative Google September 2007  –  June 2008  (10 months) Gurgaon, India Skills 6 Online Advertising 5 SEM 4 Analytics 3 Market Research 3 Business Development 3 Google Adwords 2 Business Strategy 1 Project Planning 1 Mobile Marketing Skills  6 Online Advertising 5 SEM 4 Analytics 3 Market Research 3 Business Development 3 Google Adwords 2 Business Strategy 1 Project Planning 1 Mobile Marketing 6 Online Advertising 5 SEM 4 Analytics 3 Market Research 3 Business Development 3 Google Adwords 2 Business Strategy 1 Project Planning 1 Mobile Marketing 6 Online Advertising 5 SEM 4 Analytics 3 Market Research 3 Business Development 3 Google Adwords 2 Business Strategy 1 Project Planning 1 Mobile Marketing                   Education Amity University B.Tech,  Biotechnology 2003  – 2007 Amity University B.Tech,  Biotechnology 2003  – 2007 Amity University B.Tech,  Biotechnology 2003  – 2007 Amity University B.Tech,  Biotechnology 2003  – 2007 ", "Experience Global Program Manager Google January 2015  – Present (7 months) Mountain view, California Strategic initiatives for online help and engagement (Google AdWords & related products) Program Manager Google January 2014  –  December 2014  (1 year) Gurgaon, India Partner Operations Team lead (Google My business) \n Global Rotation program - Mountain View Google January 2014  –  April 2014  (4 months) California Program manager for launching regional level Agency support channels for the Global customer experience team (NA market) \n Global Rotation - Singapore Google November 2013  –  December 2013  (2 months) Singapore 1. Launched Webinar program in India \n2. Worked with Engg and Product managers based in Singapore to launch product level ideas and changes within AdWords billing which resulted in positive and intrinsic impact with the Customer base within India. AdWords Associate Google November 2012  –  November 2013  (1 year 1 month) Gurgaon, India -Launched High Value phone support team Gurgaon \n-Launched regional level Agency support channels for the Global customer experience team (APAC market) \n \nRewards and Recognition  \nGold Awards \n-Received Gold Award in September 2013 for being the sole founding member of the English High Value phone support team and setting up of the team in terms of technicalities,training, mentoring and managing.  \n-Gold Award in August 2013 for outstanding contribution as an AdWords billing trainer. \n-Gold Award in July 2012 for outstanding contribution as portal tester.Performed Testing along with the engineering team for launch of a support level portal which is now being used by Google worldwide to support customer interactions. \nSpot bonuses  \n-Spot bonus - 100% Customer satisfaction Score in November 2014 \n-Spot bonus - 100% Customer satisfaction Score in December 2014 \n-Spot bonus - 95% Customer satisfaction Score in October 2014 \nOutstanding achievement in Customer Focus \n-Customer focus Award - August 2013 for Customer satisfaction Score of above 95% \n-Customer focus Award - July 2013 for consistent Customer satisfaction Score of 100% . \n-Customer focus Award - June 2013 for 100% Customer satisfaction Score \n-Customer focus Award - October 2012 for consistent and high Customer satisfaction Score in the last 3 months. \n-Face of Google Award - October 2011 for 100% Customer satisfaction Score. \n-Face of Google Award - December 2011 for 90+% Customer satisfaction Score. AdWords Representative Google July 2011  –  November 2012  (1 year 5 months) Gurgaon, India Was recruited with Google India Pvt Limited as an AdWords Representative under the Global customer experience team.This fast-paced Customer Services team quickly identifies and resolves customer concerns and contributes building loyalty amongst our customers.  \nProjects - \n \n1. AdMob  \nPlayed an important role of a product troubleshooting specialist for AdMob customer base. \n \n2. AdWords Billing trainer  \nWorked and continue to train new Google employees on AdWords Billing. \n \n3. UK & Ireland Point Of Contact(2012)  \nWorked as the UK & Ireland Point Of Contact which allowed me to own the metrics of a market supported by India region and work on related search string algorithms to pull data and work on achieving Service level metrics. I believe this prior experience of working with Google owned data tools has helped me tremendously by allowing me to support ongoing analyses of business drivers and ensure continued development of data reporting within the team.  \n \n4. Portal Tester \nPerformed Testing along with the engineering team for launch of a support level portal / tool which is now being used substantially by Google worldwide to support customer interactions.Filed and reported technical failures and conducted test procedures to pass the launch of the tool.  \n \n5. Workflow lead (2012) \nWorked as workflow lead directing and planning hour & day wise support to the right channels and ensuring that all customer level issues are resolved within estimated timeframe using multiple service level maintenance and adherence tools for all channels(phone, chat, email). Marketing Intern Unitech Limited April 2010  –  July 2010  (4 months) Gurgaon, India Interned with Unitech group(Gurgaon) in the Marketing & Sales department during the college semester of 2010. During the internship I was asked to lead a Project - Cost reduction and better methods of advertising in the company and 2 ideas were also selected for implementation within the organization. Factory Operations Intern Britannia Industries Limited April 2009  –  July 2009  (4 months) New Delhi Area, India Interned with Britannia Industries Ltd.(New Delhi) in the Factory Operations department during the first semester of Economics Honors 2009. During the internship I focussed on Direct Cost Analysis within the Factory running and operations department which was in direct correlation with my educational focus during the semester. Global Program Manager Google January 2015  – Present (7 months) Mountain view, California Strategic initiatives for online help and engagement (Google AdWords & related products) Global Program Manager Google January 2015  – Present (7 months) Mountain view, California Strategic initiatives for online help and engagement (Google AdWords & related products) Program Manager Google January 2014  –  December 2014  (1 year) Gurgaon, India Partner Operations Team lead (Google My business) \n Program Manager Google January 2014  –  December 2014  (1 year) Gurgaon, India Partner Operations Team lead (Google My business) \n Global Rotation program - Mountain View Google January 2014  –  April 2014  (4 months) California Program manager for launching regional level Agency support channels for the Global customer experience team (NA market) \n Global Rotation program - Mountain View Google January 2014  –  April 2014  (4 months) California Program manager for launching regional level Agency support channels for the Global customer experience team (NA market) \n Global Rotation - Singapore Google November 2013  –  December 2013  (2 months) Singapore 1. Launched Webinar program in India \n2. Worked with Engg and Product managers based in Singapore to launch product level ideas and changes within AdWords billing which resulted in positive and intrinsic impact with the Customer base within India. Global Rotation - Singapore Google November 2013  –  December 2013  (2 months) Singapore 1. Launched Webinar program in India \n2. Worked with Engg and Product managers based in Singapore to launch product level ideas and changes within AdWords billing which resulted in positive and intrinsic impact with the Customer base within India. AdWords Associate Google November 2012  –  November 2013  (1 year 1 month) Gurgaon, India -Launched High Value phone support team Gurgaon \n-Launched regional level Agency support channels for the Global customer experience team (APAC market) \n \nRewards and Recognition  \nGold Awards \n-Received Gold Award in September 2013 for being the sole founding member of the English High Value phone support team and setting up of the team in terms of technicalities,training, mentoring and managing.  \n-Gold Award in August 2013 for outstanding contribution as an AdWords billing trainer. \n-Gold Award in July 2012 for outstanding contribution as portal tester.Performed Testing along with the engineering team for launch of a support level portal which is now being used by Google worldwide to support customer interactions. \nSpot bonuses  \n-Spot bonus - 100% Customer satisfaction Score in November 2014 \n-Spot bonus - 100% Customer satisfaction Score in December 2014 \n-Spot bonus - 95% Customer satisfaction Score in October 2014 \nOutstanding achievement in Customer Focus \n-Customer focus Award - August 2013 for Customer satisfaction Score of above 95% \n-Customer focus Award - July 2013 for consistent Customer satisfaction Score of 100% . \n-Customer focus Award - June 2013 for 100% Customer satisfaction Score \n-Customer focus Award - October 2012 for consistent and high Customer satisfaction Score in the last 3 months. \n-Face of Google Award - October 2011 for 100% Customer satisfaction Score. \n-Face of Google Award - December 2011 for 90+% Customer satisfaction Score. AdWords Associate Google November 2012  –  November 2013  (1 year 1 month) Gurgaon, India -Launched High Value phone support team Gurgaon \n-Launched regional level Agency support channels for the Global customer experience team (APAC market) \n \nRewards and Recognition  \nGold Awards \n-Received Gold Award in September 2013 for being the sole founding member of the English High Value phone support team and setting up of the team in terms of technicalities,training, mentoring and managing.  \n-Gold Award in August 2013 for outstanding contribution as an AdWords billing trainer. \n-Gold Award in July 2012 for outstanding contribution as portal tester.Performed Testing along with the engineering team for launch of a support level portal which is now being used by Google worldwide to support customer interactions. \nSpot bonuses  \n-Spot bonus - 100% Customer satisfaction Score in November 2014 \n-Spot bonus - 100% Customer satisfaction Score in December 2014 \n-Spot bonus - 95% Customer satisfaction Score in October 2014 \nOutstanding achievement in Customer Focus \n-Customer focus Award - August 2013 for Customer satisfaction Score of above 95% \n-Customer focus Award - July 2013 for consistent Customer satisfaction Score of 100% . \n-Customer focus Award - June 2013 for 100% Customer satisfaction Score \n-Customer focus Award - October 2012 for consistent and high Customer satisfaction Score in the last 3 months. \n-Face of Google Award - October 2011 for 100% Customer satisfaction Score. \n-Face of Google Award - December 2011 for 90+% Customer satisfaction Score. AdWords Representative Google July 2011  –  November 2012  (1 year 5 months) Gurgaon, India Was recruited with Google India Pvt Limited as an AdWords Representative under the Global customer experience team.This fast-paced Customer Services team quickly identifies and resolves customer concerns and contributes building loyalty amongst our customers.  \nProjects - \n \n1. AdMob  \nPlayed an important role of a product troubleshooting specialist for AdMob customer base. \n \n2. AdWords Billing trainer  \nWorked and continue to train new Google employees on AdWords Billing. \n \n3. UK & Ireland Point Of Contact(2012)  \nWorked as the UK & Ireland Point Of Contact which allowed me to own the metrics of a market supported by India region and work on related search string algorithms to pull data and work on achieving Service level metrics. I believe this prior experience of working with Google owned data tools has helped me tremendously by allowing me to support ongoing analyses of business drivers and ensure continued development of data reporting within the team.  \n \n4. Portal Tester \nPerformed Testing along with the engineering team for launch of a support level portal / tool which is now being used substantially by Google worldwide to support customer interactions.Filed and reported technical failures and conducted test procedures to pass the launch of the tool.  \n \n5. Workflow lead (2012) \nWorked as workflow lead directing and planning hour & day wise support to the right channels and ensuring that all customer level issues are resolved within estimated timeframe using multiple service level maintenance and adherence tools for all channels(phone, chat, email). AdWords Representative Google July 2011  –  November 2012  (1 year 5 months) Gurgaon, India Was recruited with Google India Pvt Limited as an AdWords Representative under the Global customer experience team.This fast-paced Customer Services team quickly identifies and resolves customer concerns and contributes building loyalty amongst our customers.  \nProjects - \n \n1. AdMob  \nPlayed an important role of a product troubleshooting specialist for AdMob customer base. \n \n2. AdWords Billing trainer  \nWorked and continue to train new Google employees on AdWords Billing. \n \n3. UK & Ireland Point Of Contact(2012)  \nWorked as the UK & Ireland Point Of Contact which allowed me to own the metrics of a market supported by India region and work on related search string algorithms to pull data and work on achieving Service level metrics. I believe this prior experience of working with Google owned data tools has helped me tremendously by allowing me to support ongoing analyses of business drivers and ensure continued development of data reporting within the team.  \n \n4. Portal Tester \nPerformed Testing along with the engineering team for launch of a support level portal / tool which is now being used substantially by Google worldwide to support customer interactions.Filed and reported technical failures and conducted test procedures to pass the launch of the tool.  \n \n5. Workflow lead (2012) \nWorked as workflow lead directing and planning hour & day wise support to the right channels and ensuring that all customer level issues are resolved within estimated timeframe using multiple service level maintenance and adherence tools for all channels(phone, chat, email). Marketing Intern Unitech Limited April 2010  –  July 2010  (4 months) Gurgaon, India Interned with Unitech group(Gurgaon) in the Marketing & Sales department during the college semester of 2010. During the internship I was asked to lead a Project - Cost reduction and better methods of advertising in the company and 2 ideas were also selected for implementation within the organization. Marketing Intern Unitech Limited April 2010  –  July 2010  (4 months) Gurgaon, India Interned with Unitech group(Gurgaon) in the Marketing & Sales department during the college semester of 2010. During the internship I was asked to lead a Project - Cost reduction and better methods of advertising in the company and 2 ideas were also selected for implementation within the organization. Factory Operations Intern Britannia Industries Limited April 2009  –  July 2009  (4 months) New Delhi Area, India Interned with Britannia Industries Ltd.(New Delhi) in the Factory Operations department during the first semester of Economics Honors 2009. During the internship I focussed on Direct Cost Analysis within the Factory running and operations department which was in direct correlation with my educational focus during the semester. Factory Operations Intern Britannia Industries Limited April 2009  –  July 2009  (4 months) New Delhi Area, India Interned with Britannia Industries Ltd.(New Delhi) in the Factory Operations department during the first semester of Economics Honors 2009. During the internship I focussed on Direct Cost Analysis within the Factory running and operations department which was in direct correlation with my educational focus during the semester. Languages French  French  French  Skills Top Skills 7 Project Management 7 Team Management 5 Sales 4 Teamwork 4 Customer Service 3 Training 2 People Skills 2 Management 2 Customer Satisfaction 2 Online Advertising Sonali also knows about... 1 Leadership 1 Team Leadership 1 Time Management 1 Project Planning 1 Project Coordination 1 Project Delivery 1 Digital Marketing 1 Google Analytics 1 Analytics 1 Online Marketing 1 SEM 1 Google Adwords 0 Social Networking 0 Recruiting Skills  Top Skills 7 Project Management 7 Team Management 5 Sales 4 Teamwork 4 Customer Service 3 Training 2 People Skills 2 Management 2 Customer Satisfaction 2 Online Advertising Sonali also knows about... 1 Leadership 1 Team Leadership 1 Time Management 1 Project Planning 1 Project Coordination 1 Project Delivery 1 Digital Marketing 1 Google Analytics 1 Analytics 1 Online Marketing 1 SEM 1 Google Adwords 0 Social Networking 0 Recruiting Top Skills 7 Project Management 7 Team Management 5 Sales 4 Teamwork 4 Customer Service 3 Training 2 People Skills 2 Management 2 Customer Satisfaction 2 Online Advertising Sonali also knows about... 1 Leadership 1 Team Leadership 1 Time Management 1 Project Planning 1 Project Coordination 1 Project Delivery 1 Digital Marketing 1 Google Analytics 1 Analytics 1 Online Marketing 1 SEM 1 Google Adwords 0 Social Networking 0 Recruiting Top Skills 7 Project Management 7 Team Management 5 Sales 4 Teamwork 4 Customer Service 3 Training 2 People Skills 2 Management 2 Customer Satisfaction 2 Online Advertising Sonali also knows about... 1 Leadership 1 Team Leadership 1 Time Management 1 Project Planning 1 Project Coordination 1 Project Delivery 1 Digital Marketing 1 Google Analytics 1 Analytics 1 Online Marketing 1 SEM 1 Google Adwords 0 Social Networking 0 Recruiting                     1 Leadership 1 Team Leadership 1 Time Management 1 Project Planning 1 Project Coordination 1 Project Delivery 1 Digital Marketing 1 Google Analytics 1 Analytics 1 Online Marketing 1 SEM 1 Google Adwords 0 Social Networking 0 Recruiting Education Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Indian Institute of Management, Calcutta Associate/Diploma,  Executive Program In Sales And Marketing (EPSM) 2014  – 2015 The program has been specially designed to ensure that students : \n \nUnderstand & identify the challenges in today’s market place.Understanding the roles and responsibilities of a sales manager. \n \nUnderstand the Customer and Market Orientation for Business Success. \n \nUnderstand the Conceptual framework for sales and marketing. \n \nBe able to learn how to manage, motivate and lead sales team. \n \nUnderstand the fundamentals of channel design, development and management decisions. \n \nGain an appreciation of the sector specific issues in marketing of Pharmaceutical, Banking and  \nFinancial services, FMCG Industries and Industrial products. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Hindu College Bachelor's Degree,  B.A (Hons) Economics , First Division 2008  – 2011 Worked as the Google Campus Ambassador : The program is an opportunity for students to act as liaisons between Google and their universities and strengthen the relationship. \n \nPlacement Cell coordinator : Coordinated with companies visiting campus for recruitment purposes and guided students for placement in credible organization. \n \nModel United Nations committee : Won 3rd at the BITS Pilani Model United Nations, as Delegate of Somalia in Economic and Social council. Activities and Societies:  Worked as the Google Campus Ambassador ,  Placement Cell coordinator ,  Model United Nations committee (Member) ,  Western Music Society (Member) ,  Learnt Classical dance (Kathak) for 7 years ,  Design committee (Designing of Senior yearbook) & DU beat (Delhi university based newspaper) as a designer and website maintenance. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. Springdales School, Dhaula Kuan High School,  Economics ,  Mathematics ,  English ,  Sociology & Psychology , A1 1994  – 2008 Won the Vandana memorial award - for creativity and zeal for perfection in 12th standard. \n \nWon the Headmistress special award - for social values in the middle school \n \nWon certificates for academic excellence in the junior and senior school (marks above 75%) \n \nCompleted course in interior designing for 2 years as a part of the school curriculum Activities and Societies:  Annual Day School report committee ,  School Prefect junior school ,  School Prefect 12th std ,  House captain 12th std ,  Director of school affairs –interact club ,  Director of news and views –Palestine club ,  Director- environment club ,  Student council member senior school ,  Director- Maths club ,  Vice captain and Captain- Unity house. ", "Experience Manager, Enterprise Support Google February 2013  – Present (2 years 6 months) New York Manager, Enterprise Support Google October 2012  –  February 2013  (5 months) San Francisco Bay Area Manager, Enterprise Support Google November 2011  –  October 2012  (1 year) Dublin Enterprise Support Team Lead Google November 2009  –  November 2011  (2 years 1 month) Dublin Enterprise Strategist Google 2008  –  October 2009  (1 year) Dublin AdWords Relationship Manager Google 2007  –  2008  (1 year) Dublin AdWords Strategist Google 2005  –  2007  (2 years) Dublin AdWords Associate Google 2004  –  2005  (1 year) Dublin Adwords Representative Google 2004  –  2004  (less than a year) Dublin Manager, Enterprise Support Google February 2013  – Present (2 years 6 months) New York Manager, Enterprise Support Google February 2013  – Present (2 years 6 months) New York Manager, Enterprise Support Google October 2012  –  February 2013  (5 months) San Francisco Bay Area Manager, Enterprise Support Google October 2012  –  February 2013  (5 months) San Francisco Bay Area Manager, Enterprise Support Google November 2011  –  October 2012  (1 year) Dublin Manager, Enterprise Support Google November 2011  –  October 2012  (1 year) Dublin Enterprise Support Team Lead Google November 2009  –  November 2011  (2 years 1 month) Dublin Enterprise Support Team Lead Google November 2009  –  November 2011  (2 years 1 month) Dublin Enterprise Strategist Google 2008  –  October 2009  (1 year) Dublin Enterprise Strategist Google 2008  –  October 2009  (1 year) Dublin AdWords Relationship Manager Google 2007  –  2008  (1 year) Dublin AdWords Relationship Manager Google 2007  –  2008  (1 year) Dublin AdWords Strategist Google 2005  –  2007  (2 years) Dublin AdWords Strategist Google 2005  –  2007  (2 years) Dublin AdWords Associate Google 2004  –  2005  (1 year) Dublin AdWords Associate Google 2004  –  2005  (1 year) Dublin Adwords Representative Google 2004  –  2004  (less than a year) Dublin Adwords Representative Google 2004  –  2004  (less than a year) Dublin Skills 26 Google Adwords Skills  26 Google Adwords 26 Google Adwords 26 Google Adwords   ", "Summary Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Summary Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Over 6 years of experience in digital marketing strategies and optimizations. \n \nSpecialties: \nMedia Buying \nOnline Marketing: Entertainment & Media Industry (Publishing & Gaming, Ticketing), B2B, Finance \nOnline Marketing Campaign Optimizations (AdWords) \nAccount Management \nContent Development \nStoryboarding Experience Marketing Manager, Media Google July 2013  – Present (2 years 1 month) India AdWords Strategist, Online Sales Google November 2009  – Present (5 years 9 months) (Open) 2 recommendations Rohit kapoor Senior Account Manager at Google Excellent Vision, great analytical skills, detail oriented, wonderful to work with & extremely helpful. These are the few... View Megha Jha Senior Account Manager at LinkedIn I worked with Poonam in the Online Sales department of Google. Poonam is an excellent mentor. She is valued by all her team... View AdWords Associate Google July 2008  –  October 2009  (1 year 4 months) (Open) 2 recommendations Elyse Guilfoyle Sales Development Manager, Government & Advocacy Poonam and I worked together for over a year and a half on the same team at Google. I can easily say that she is one of the... View Mike Rooney Industry Manager, Travel, Global Marketing Solutions at Facebook I greatly enjoyed working with Poonam and I know our clients did, as well. She's always willing to stop whatever she's doing... View AdWords Senior Representative Google January 2008  –  July 2008  (7 months) AdWords Representative Google October 2006  –  December 2007  (1 year 3 months) Instructional Designer Brainvisa Technologies July 2004  –  March 2006  (1 year 9 months) Understand client requirements and accordingly script storyboards for online courses. Marketing Manager, Media Google July 2013  – Present (2 years 1 month) India Marketing Manager, Media Google July 2013  – Present (2 years 1 month) India AdWords Strategist, Online Sales Google November 2009  – Present (5 years 9 months) (Open) 2 recommendations Rohit kapoor Senior Account Manager at Google Excellent Vision, great analytical skills, detail oriented, wonderful to work with & extremely helpful. These are the few... View Megha Jha Senior Account Manager at LinkedIn I worked with Poonam in the Online Sales department of Google. Poonam is an excellent mentor. She is valued by all her team... View AdWords Strategist, Online Sales Google November 2009  – Present (5 years 9 months) (Open) 2 recommendations Rohit kapoor Senior Account Manager at Google Excellent Vision, great analytical skills, detail oriented, wonderful to work with & extremely helpful. These are the few... View Megha Jha Senior Account Manager at LinkedIn I worked with Poonam in the Online Sales department of Google. Poonam is an excellent mentor. She is valued by all her team... View AdWords Associate Google July 2008  –  October 2009  (1 year 4 months) (Open) 2 recommendations Elyse Guilfoyle Sales Development Manager, Government & Advocacy Poonam and I worked together for over a year and a half on the same team at Google. I can easily say that she is one of the... View Mike Rooney Industry Manager, Travel, Global Marketing Solutions at Facebook I greatly enjoyed working with Poonam and I know our clients did, as well. She's always willing to stop whatever she's doing... View AdWords Associate Google July 2008  –  October 2009  (1 year 4 months) (Open) 2 recommendations Elyse Guilfoyle Sales Development Manager, Government & Advocacy Poonam and I worked together for over a year and a half on the same team at Google. I can easily say that she is one of the... View Mike Rooney Industry Manager, Travel, Global Marketing Solutions at Facebook I greatly enjoyed working with Poonam and I know our clients did, as well. She's always willing to stop whatever she's doing... View AdWords Senior Representative Google January 2008  –  July 2008  (7 months) AdWords Senior Representative Google January 2008  –  July 2008  (7 months) AdWords Representative Google October 2006  –  December 2007  (1 year 3 months) AdWords Representative Google October 2006  –  December 2007  (1 year 3 months) Instructional Designer Brainvisa Technologies July 2004  –  March 2006  (1 year 9 months) Understand client requirements and accordingly script storyboards for online courses. Instructional Designer Brainvisa Technologies July 2004  –  March 2006  (1 year 9 months) Understand client requirements and accordingly script storyboards for online courses. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 17 Online Marketing 9 Google Adwords 8 Digital Marketing 4 Instructional Design 3 Account Management 2 Search Advertising 2 B2B 1 Google AdWords... 1 Analysis 1 PPC Poonam also knows about... 0 Microsoft Excel 0 Excel Dashboards Skills  Top Skills 17 Online Marketing 9 Google Adwords 8 Digital Marketing 4 Instructional Design 3 Account Management 2 Search Advertising 2 B2B 1 Google AdWords... 1 Analysis 1 PPC Poonam also knows about... 0 Microsoft Excel 0 Excel Dashboards Top Skills 17 Online Marketing 9 Google Adwords 8 Digital Marketing 4 Instructional Design 3 Account Management 2 Search Advertising 2 B2B 1 Google AdWords... 1 Analysis 1 PPC Poonam also knows about... 0 Microsoft Excel 0 Excel Dashboards Top Skills 17 Online Marketing 9 Google Adwords 8 Digital Marketing 4 Instructional Design 3 Account Management 2 Search Advertising 2 B2B 1 Google AdWords... 1 Analysis 1 PPC Poonam also knows about... 0 Microsoft Excel 0 Excel Dashboards                     0 Microsoft Excel 0 Excel Dashboards Education Delhi University MA,  English Literature 2002  – 2004 Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition (Open) 1 course Computer Course at NIFT See more Delhi University MA,  English Literature 2002  – 2004 Delhi University MA,  English Literature 2002  – 2004 Delhi University MA,  English Literature 2002  – 2004 Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Delhi University B.A. (Hons,  English Literature 1999  – 2002 Winner: The Anuradha Bhardwaj Memorial Award for consistently good performance ('99-'00 and ''00-'01) Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition (Open) 1 course Computer Course at NIFT See more Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition (Open) 1 course Computer Course at NIFT See more Mata Jai Kaur Public School S.S,  Commerce 1987  – 1999 '98-'99 - Head Prefect \n'97-'98 - School Prefect Activities and Societies:  Winner ,  Painting Competition (Open) 1 course Computer Course at NIFT See more Honors & Awards Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 Additional Honors & Awards Team Recognition Award For Teamwork, Google Inc, Sept 2008 ", "Summary Sean joined Google in 2003 as a member of the AdWords organization. Sean's sales experience ranged from local small businesses to top-tier agencies and SEMs. In 2006 he teamed up with Google's Dublin office to help build the European acquisitions team, and in 2007 he received Google's Luminary Award for his work with SEMs. In 2011, he became a founding member of Google's Creative Agency Team. Sean holds a bachelor's degree from the University of Notre Dame. He is an award-winning filmmaker and a published journalist. Summary Sean joined Google in 2003 as a member of the AdWords organization. Sean's sales experience ranged from local small businesses to top-tier agencies and SEMs. In 2006 he teamed up with Google's Dublin office to help build the European acquisitions team, and in 2007 he received Google's Luminary Award for his work with SEMs. In 2011, he became a founding member of Google's Creative Agency Team. Sean holds a bachelor's degree from the University of Notre Dame. He is an award-winning filmmaker and a published journalist. Sean joined Google in 2003 as a member of the AdWords organization. Sean's sales experience ranged from local small businesses to top-tier agencies and SEMs. In 2006 he teamed up with Google's Dublin office to help build the European acquisitions team, and in 2007 he received Google's Luminary Award for his work with SEMs. In 2011, he became a founding member of Google's Creative Agency Team. Sean holds a bachelor's degree from the University of Notre Dame. He is an award-winning filmmaker and a published journalist. Sean joined Google in 2003 as a member of the AdWords organization. Sean's sales experience ranged from local small businesses to top-tier agencies and SEMs. In 2006 he teamed up with Google's Dublin office to help build the European acquisitions team, and in 2007 he received Google's Luminary Award for his work with SEMs. In 2011, he became a founding member of Google's Creative Agency Team. Sean holds a bachelor's degree from the University of Notre Dame. He is an award-winning filmmaker and a published journalist. Experience Creative Agency Lead, Agency Business Development Google January 2011  – Present (4 years 7 months) San Francisco Bay Area As a founding member of the Creative Agency Team, my goal is to partner with creative agencies to craft innovative ideas and campaigns leveraging the Google and YouTube product portfolio to deliver business-building results for agencies and their clients \n \nBriefing Process: Review client briefs, recommend channel strategy, and brainstorm concepts in constant collaboration with agency creatives, strategists, and planners, providing Google product expertise and technical feedback throughout \n \nPartnerships: Manage day-to-day creative relationships, establish partnership plans, lead product trainings, and deliver business reviews to CEOs and Chief Creative Officers at digital and creative marketing agencies including AKQA, 72andSunny and Venables Bell \n \nProduct: Serve as Mobile and Google+ Product Solutions Specialist for Agency Team, work cross-functionally with Product and Marketing; speak at agencies and industry events Creative Agency Lead, Agency Business Development Google January 2011  – Present (4 years 7 months) San Francisco Bay Area As a founding member of the Creative Agency Team, my goal is to partner with creative agencies to craft innovative ideas and campaigns leveraging the Google and YouTube product portfolio to deliver business-building results for agencies and their clients \n \nBriefing Process: Review client briefs, recommend channel strategy, and brainstorm concepts in constant collaboration with agency creatives, strategists, and planners, providing Google product expertise and technical feedback throughout \n \nPartnerships: Manage day-to-day creative relationships, establish partnership plans, lead product trainings, and deliver business reviews to CEOs and Chief Creative Officers at digital and creative marketing agencies including AKQA, 72andSunny and Venables Bell \n \nProduct: Serve as Mobile and Google+ Product Solutions Specialist for Agency Team, work cross-functionally with Product and Marketing; speak at agencies and industry events Creative Agency Lead, Agency Business Development Google January 2011  – Present (4 years 7 months) San Francisco Bay Area As a founding member of the Creative Agency Team, my goal is to partner with creative agencies to craft innovative ideas and campaigns leveraging the Google and YouTube product portfolio to deliver business-building results for agencies and their clients \n \nBriefing Process: Review client briefs, recommend channel strategy, and brainstorm concepts in constant collaboration with agency creatives, strategists, and planners, providing Google product expertise and technical feedback throughout \n \nPartnerships: Manage day-to-day creative relationships, establish partnership plans, lead product trainings, and deliver business reviews to CEOs and Chief Creative Officers at digital and creative marketing agencies including AKQA, 72andSunny and Venables Bell \n \nProduct: Serve as Mobile and Google+ Product Solutions Specialist for Agency Team, work cross-functionally with Product and Marketing; speak at agencies and industry events Skills Skills     Education University of Notre Dame BA,  Communications 1996  – 2000 Activities and Societies:  Cum Laude Los Gatos High School Université catholique de l'Ouest University of Notre Dame BA,  Communications 1996  – 2000 Activities and Societies:  Cum Laude University of Notre Dame BA,  Communications 1996  – 2000 Activities and Societies:  Cum Laude University of Notre Dame BA,  Communications 1996  – 2000 Activities and Societies:  Cum Laude Los Gatos High School Los Gatos High School Los Gatos High School Université catholique de l'Ouest Université catholique de l'Ouest Université catholique de l'Ouest ", "Summary I'm an AdWords certified professional with a desire to help clients achieve their online marketing goals. Adept in Search, Display & Branding channels.  Specialties:adobe photoshop, corel draw, dreamweaver, flash, languages, leadership, microsoft office, photography, presentation skills, quick, sound forge, Summary I'm an AdWords certified professional with a desire to help clients achieve their online marketing goals. Adept in Search, Display & Branding channels.  Specialties:adobe photoshop, corel draw, dreamweaver, flash, languages, leadership, microsoft office, photography, presentation skills, quick, sound forge, I'm an AdWords certified professional with a desire to help clients achieve their online marketing goals. Adept in Search, Display & Branding channels.  Specialties:adobe photoshop, corel draw, dreamweaver, flash, languages, leadership, microsoft office, photography, presentation skills, quick, sound forge, I'm an AdWords certified professional with a desire to help clients achieve their online marketing goals. Adept in Search, Display & Branding channels.  Specialties:adobe photoshop, corel draw, dreamweaver, flash, languages, leadership, microsoft office, photography, presentation skills, quick, sound forge, Experience Sales Coach Google April 2015  – Present (4 months) Hyderabad Area, India As a trained & certified Sales coach for the Small & Medium Business (sales) team, my day to day responsibilities include help reps overcome their challenges and reach higher levels of performance by bringing out the best in them.  \n \nI currently coach 4 reps and am working towards certifying them as qualified Sales reps. Account Manager Google January 2014  – Present (1 year 7 months) Australia/NZ Managing Accounts for Small & Medium Business, AU/NZ. Associate Account Strategist Google November 2011  – Present (3 years 9 months) Hyderabad Area, India Working with America's Market Stakeholders to increase/improve Advertiser Experience (wrt Adwords & ad-approval process) - reduce time taken to approve ads and find automated solutions for the customers.  \n \nProduct Guru for Ad-Operations. \nMaintain & provide support for Ops to keep the Tools and the product in a healthy shape. Work with the engineering team in MountainView and provide key-inputs for product growth. Chief Photographer Shashank Kapur July 2010  – Present (5 years 1 month) Hyderabad Area, India You can contact me for Portfolio, Editorial, Fashion, Lifestyle, Live Music Events, Wedding Photography assignments. I offer quality work and have worked/freelanced for several magazines and newspapers including Folktronic (Sony Music Records).  \n \nYou can find me on FB as 'Shashank Kapur Clicks' \nTake a look at my 500px profile - 500px.com/shashankkapur \nWebsite is under construction: www.shashankkapur.com Adwords Representative Google July 2010  –  September 2011  (1 year 3 months) Sales Coach Google April 2015  – Present (4 months) Hyderabad Area, India As a trained & certified Sales coach for the Small & Medium Business (sales) team, my day to day responsibilities include help reps overcome their challenges and reach higher levels of performance by bringing out the best in them.  \n \nI currently coach 4 reps and am working towards certifying them as qualified Sales reps. Sales Coach Google April 2015  – Present (4 months) Hyderabad Area, India As a trained & certified Sales coach for the Small & Medium Business (sales) team, my day to day responsibilities include help reps overcome their challenges and reach higher levels of performance by bringing out the best in them.  \n \nI currently coach 4 reps and am working towards certifying them as qualified Sales reps. Account Manager Google January 2014  – Present (1 year 7 months) Australia/NZ Managing Accounts for Small & Medium Business, AU/NZ. Account Manager Google January 2014  – Present (1 year 7 months) Australia/NZ Managing Accounts for Small & Medium Business, AU/NZ. Associate Account Strategist Google November 2011  – Present (3 years 9 months) Hyderabad Area, India Working with America's Market Stakeholders to increase/improve Advertiser Experience (wrt Adwords & ad-approval process) - reduce time taken to approve ads and find automated solutions for the customers.  \n \nProduct Guru for Ad-Operations. \nMaintain & provide support for Ops to keep the Tools and the product in a healthy shape. Work with the engineering team in MountainView and provide key-inputs for product growth. Associate Account Strategist Google November 2011  – Present (3 years 9 months) Hyderabad Area, India Working with America's Market Stakeholders to increase/improve Advertiser Experience (wrt Adwords & ad-approval process) - reduce time taken to approve ads and find automated solutions for the customers.  \n \nProduct Guru for Ad-Operations. \nMaintain & provide support for Ops to keep the Tools and the product in a healthy shape. Work with the engineering team in MountainView and provide key-inputs for product growth. Chief Photographer Shashank Kapur July 2010  – Present (5 years 1 month) Hyderabad Area, India You can contact me for Portfolio, Editorial, Fashion, Lifestyle, Live Music Events, Wedding Photography assignments. I offer quality work and have worked/freelanced for several magazines and newspapers including Folktronic (Sony Music Records).  \n \nYou can find me on FB as 'Shashank Kapur Clicks' \nTake a look at my 500px profile - 500px.com/shashankkapur \nWebsite is under construction: www.shashankkapur.com Chief Photographer Shashank Kapur July 2010  – Present (5 years 1 month) Hyderabad Area, India You can contact me for Portfolio, Editorial, Fashion, Lifestyle, Live Music Events, Wedding Photography assignments. I offer quality work and have worked/freelanced for several magazines and newspapers including Folktronic (Sony Music Records).  \n \nYou can find me on FB as 'Shashank Kapur Clicks' \nTake a look at my 500px profile - 500px.com/shashankkapur \nWebsite is under construction: www.shashankkapur.com Adwords Representative Google July 2010  –  September 2011  (1 year 3 months) Adwords Representative Google July 2010  –  September 2011  (1 year 3 months) Languages English Hindi Bengali Punjabi English Hindi Bengali Punjabi English Hindi Bengali Punjabi Skills Top Skills 17 Google Adwords 17 Advertising 12 Online Advertising 9 Digital Marketing 4 Social Media Marketing 5 Online Marketing 14 Photography 5 Photoshop 1 Copywriting 3 Magazines Shashank also knows about... 4 Google Analytics 2 Digital Media 3 Editorial 1 Social Media 0 PPC 0 Web Analytics 0 Digital Strategy Skills  Top Skills 17 Google Adwords 17 Advertising 12 Online Advertising 9 Digital Marketing 4 Social Media Marketing 5 Online Marketing 14 Photography 5 Photoshop 1 Copywriting 3 Magazines Shashank also knows about... 4 Google Analytics 2 Digital Media 3 Editorial 1 Social Media 0 PPC 0 Web Analytics 0 Digital Strategy Top Skills 17 Google Adwords 17 Advertising 12 Online Advertising 9 Digital Marketing 4 Social Media Marketing 5 Online Marketing 14 Photography 5 Photoshop 1 Copywriting 3 Magazines Shashank also knows about... 4 Google Analytics 2 Digital Media 3 Editorial 1 Social Media 0 PPC 0 Web Analytics 0 Digital Strategy Top Skills 17 Google Adwords 17 Advertising 12 Online Advertising 9 Digital Marketing 4 Social Media Marketing 5 Online Marketing 14 Photography 5 Photoshop 1 Copywriting 3 Magazines Shashank also knows about... 4 Google Analytics 2 Digital Media 3 Editorial 1 Social Media 0 PPC 0 Web Analytics 0 Digital Strategy                     4 Google Analytics 2 Digital Media 3 Editorial 1 Social Media 0 PPC 0 Web Analytics 0 Digital Strategy Education Xavier Institute of Communication PG Diploma,  Advertising & Marketing , A 2009  – 2010 Christ University, Bangalore B.A,  Economics ,  Sociology ,  Psychology 2005  – 2009 St. James' School, Kolkata Science with computers 1991  – 2005 Activities and Societies:  Cricket ,  Football ,  Table tennis teams. Xavier Institute of Communication PG Diploma,  Advertising & Marketing , A 2009  – 2010 Xavier Institute of Communication PG Diploma,  Advertising & Marketing , A 2009  – 2010 Xavier Institute of Communication PG Diploma,  Advertising & Marketing , A 2009  – 2010 Christ University, Bangalore B.A,  Economics ,  Sociology ,  Psychology 2005  – 2009 Christ University, Bangalore B.A,  Economics ,  Sociology ,  Psychology 2005  – 2009 Christ University, Bangalore B.A,  Economics ,  Sociology ,  Psychology 2005  – 2009 St. James' School, Kolkata Science with computers 1991  – 2005 Activities and Societies:  Cricket ,  Football ,  Table tennis teams. St. James' School, Kolkata Science with computers 1991  – 2005 Activities and Societies:  Cricket ,  Football ,  Table tennis teams. St. James' School, Kolkata Science with computers 1991  – 2005 Activities and Societies:  Cricket ,  Football ,  Table tennis teams. Honors & Awards ", "Experience Account Manager, SMB Sales for AU/NZ Google April 2014  – Present (1 year 4 months) Sydney Area, Australia Handling the SMBs client portfolio. Consultative selling of Google AdWords. (Open) 1 honor or award Promotion View Financial Analyst 20% role Google January 2013  – Present (2 years 7 months) Hyderabad Area, India Alongside of working as an Associate Account Strategist I work with Financial Planning & Analysis department on 20% projects as I aspire to become a full time Financial Analyst (Open) 1 project Unit Cost Analysis Worked on unit cost analysis to understand the cost involved in the business operations as compared to the revenue impact it generates. Hence, understanding the revenue for every dollar spent on the business operations. View Associate Account Strategist Google May 2010  – Present (5 years 3 months) Hyderabad Area, India (Open) 4 projects Budget Forecasting Pitch The budget forecasting pitch for a small profit education institute resulted in a $11 million revenue in the year 2012 with... View Cost Per Lead Analysis Cost Per lead Analysis (CPL) for the Lead Aggregators in Education vertical helped the lead aggregators understand the... View Attribution Modeling Paused keyword Analysis of AdWords account helped clients understand the concept of assisted conversions either through... View Budget Utilization Worked on budget utilization and reallocation for the budget constrained clients. This project helped the clients reallocate... View (Open) 2 honors and awards Google Impact Award Won the Google Impact Award as a team for having exceeded the revenue targets. View Promotion I was promoted to an Associate Account Strategist in June 2012 View Account Manager, AUNZ Google 2013  –  2014  (1 year) Compliance Analyst Google July 2010  –  June 2011  (1 year) AdWords Representative Google May 2010  –  June 2010  (2 months) (Open) 1 honor or award Best Performance Award Won the Best Performance Award for consistency in quality of work and high productivity View Account Manager, SMB Sales for AU/NZ Google April 2014  – Present (1 year 4 months) Sydney Area, Australia Handling the SMBs client portfolio. Consultative selling of Google AdWords. (Open) 1 honor or award Promotion View Account Manager, SMB Sales for AU/NZ Google April 2014  – Present (1 year 4 months) Sydney Area, Australia Handling the SMBs client portfolio. Consultative selling of Google AdWords. (Open) 1 honor or award Promotion View Financial Analyst 20% role Google January 2013  – Present (2 years 7 months) Hyderabad Area, India Alongside of working as an Associate Account Strategist I work with Financial Planning & Analysis department on 20% projects as I aspire to become a full time Financial Analyst (Open) 1 project Unit Cost Analysis Worked on unit cost analysis to understand the cost involved in the business operations as compared to the revenue impact it generates. Hence, understanding the revenue for every dollar spent on the business operations. View Financial Analyst 20% role Google January 2013  – Present (2 years 7 months) Hyderabad Area, India Alongside of working as an Associate Account Strategist I work with Financial Planning & Analysis department on 20% projects as I aspire to become a full time Financial Analyst (Open) 1 project Unit Cost Analysis Worked on unit cost analysis to understand the cost involved in the business operations as compared to the revenue impact it generates. Hence, understanding the revenue for every dollar spent on the business operations. View Associate Account Strategist Google May 2010  – Present (5 years 3 months) Hyderabad Area, India (Open) 4 projects Budget Forecasting Pitch The budget forecasting pitch for a small profit education institute resulted in a $11 million revenue in the year 2012 with... View Cost Per Lead Analysis Cost Per lead Analysis (CPL) for the Lead Aggregators in Education vertical helped the lead aggregators understand the... View Attribution Modeling Paused keyword Analysis of AdWords account helped clients understand the concept of assisted conversions either through... View Budget Utilization Worked on budget utilization and reallocation for the budget constrained clients. This project helped the clients reallocate... View (Open) 2 honors and awards Google Impact Award Won the Google Impact Award as a team for having exceeded the revenue targets. View Promotion I was promoted to an Associate Account Strategist in June 2012 View Associate Account Strategist Google May 2010  – Present (5 years 3 months) Hyderabad Area, India (Open) 4 projects Budget Forecasting Pitch The budget forecasting pitch for a small profit education institute resulted in a $11 million revenue in the year 2012 with... View Cost Per Lead Analysis Cost Per lead Analysis (CPL) for the Lead Aggregators in Education vertical helped the lead aggregators understand the... View Attribution Modeling Paused keyword Analysis of AdWords account helped clients understand the concept of assisted conversions either through... View Budget Utilization Worked on budget utilization and reallocation for the budget constrained clients. This project helped the clients reallocate... View (Open) 2 honors and awards Google Impact Award Won the Google Impact Award as a team for having exceeded the revenue targets. View Promotion I was promoted to an Associate Account Strategist in June 2012 View Account Manager, AUNZ Google 2013  –  2014  (1 year) Account Manager, AUNZ Google 2013  –  2014  (1 year) Compliance Analyst Google July 2010  –  June 2011  (1 year) Compliance Analyst Google July 2010  –  June 2011  (1 year) AdWords Representative Google May 2010  –  June 2010  (2 months) (Open) 1 honor or award Best Performance Award Won the Best Performance Award for consistency in quality of work and high productivity View AdWords Representative Google May 2010  –  June 2010  (2 months) (Open) 1 honor or award Best Performance Award Won the Best Performance Award for consistency in quality of work and high productivity View Languages English Hindi Kannada English Hindi Kannada English Hindi Kannada Skills Top Skills 11 Google Adwords 8 Online Advertising 6 SEO 6 PPC 6 Display Advertising 4 Financial Analysis 3 Accounting 3 Account Management 2 Business Development 1 Dance Nisha also knows about... 1 Badminton 0 Landscape Painting 0 Guitar Skills  Top Skills 11 Google Adwords 8 Online Advertising 6 SEO 6 PPC 6 Display Advertising 4 Financial Analysis 3 Accounting 3 Account Management 2 Business Development 1 Dance Nisha also knows about... 1 Badminton 0 Landscape Painting 0 Guitar Top Skills 11 Google Adwords 8 Online Advertising 6 SEO 6 PPC 6 Display Advertising 4 Financial Analysis 3 Accounting 3 Account Management 2 Business Development 1 Dance Nisha also knows about... 1 Badminton 0 Landscape Painting 0 Guitar Top Skills 11 Google Adwords 8 Online Advertising 6 SEO 6 PPC 6 Display Advertising 4 Financial Analysis 3 Accounting 3 Account Management 2 Business Development 1 Dance Nisha also knows about... 1 Badminton 0 Landscape Painting 0 Guitar                     1 Badminton 0 Landscape Painting 0 Guitar Education Symbiosis International University Bachelor of Commerce (B.Com.),  Banking and Financial Support Services 2007  – 2010 Convent High School, Hubli 1999  – 2005 Symbiosis International University Bachelor of Commerce (B.Com.),  Banking and Financial Support Services 2007  – 2010 Symbiosis International University Bachelor of Commerce (B.Com.),  Banking and Financial Support Services 2007  – 2010 Symbiosis International University Bachelor of Commerce (B.Com.),  Banking and Financial Support Services 2007  – 2010 Convent High School, Hubli 1999  – 2005 Convent High School, Hubli 1999  – 2005 Convent High School, Hubli 1999  – 2005 Honors & Awards Google Impact Award Google July 2011 Won the Google Impact Award as a team for having exceeded the revenue targets. Best Performance Award Google June 2010 Won the Best Performance Award for consistency in quality of work and high productivity Promotion Google June 2012 I was promoted to an Associate Account Strategist in June 2012 Promotion Google May 2014 Google Impact Award Google July 2011 Won the Google Impact Award as a team for having exceeded the revenue targets. Google Impact Award Google July 2011 Won the Google Impact Award as a team for having exceeded the revenue targets. Google Impact Award Google July 2011 Won the Google Impact Award as a team for having exceeded the revenue targets. Best Performance Award Google June 2010 Won the Best Performance Award for consistency in quality of work and high productivity Best Performance Award Google June 2010 Won the Best Performance Award for consistency in quality of work and high productivity Best Performance Award Google June 2010 Won the Best Performance Award for consistency in quality of work and high productivity Promotion Google June 2012 I was promoted to an Associate Account Strategist in June 2012 Promotion Google June 2012 I was promoted to an Associate Account Strategist in June 2012 Promotion Google June 2012 I was promoted to an Associate Account Strategist in June 2012 Promotion Google May 2014 Promotion Google May 2014 Promotion Google May 2014 ", "Summary Goals: \nEvangelize Google's performance media solutions globally across product areas: \n- Search & Analytics (including mobile) \n- Display & Programmatic (Audience marketing) \n- Shopping & Commerce (including mobile) \n- Apps (network + owned & operated properties) \n \nExperience: \n- Marketing Solutions \n- Sales Strategy \n- Account Management \n- Ad Operations \n- Ad Sales Summary Goals: \nEvangelize Google's performance media solutions globally across product areas: \n- Search & Analytics (including mobile) \n- Display & Programmatic (Audience marketing) \n- Shopping & Commerce (including mobile) \n- Apps (network + owned & operated properties) \n \nExperience: \n- Marketing Solutions \n- Sales Strategy \n- Account Management \n- Ad Operations \n- Ad Sales Goals: \nEvangelize Google's performance media solutions globally across product areas: \n- Search & Analytics (including mobile) \n- Display & Programmatic (Audience marketing) \n- Shopping & Commerce (including mobile) \n- Apps (network + owned & operated properties) \n \nExperience: \n- Marketing Solutions \n- Sales Strategy \n- Account Management \n- Ad Operations \n- Ad Sales Goals: \nEvangelize Google's performance media solutions globally across product areas: \n- Search & Analytics (including mobile) \n- Display & Programmatic (Audience marketing) \n- Shopping & Commerce (including mobile) \n- Apps (network + owned & operated properties) \n \nExperience: \n- Marketing Solutions \n- Sales Strategy \n- Account Management \n- Ad Operations \n- Ad Sales Experience Global Activation Lead - Ad Solutions Google February 2014  – Present (1 year 6 months) United States 1) Be a consultant to C-level decision-makers at client and agency companies from around the world at Google's executive briefing center. Deliver keynote presentations on performance media & marketing. \n \n2) Travel globally to key markets (UK, Brazil, France, India, etc.) to activate performance media solutions such as 'Full Value of Mobile.' \n \n3) Commercialize new products by packaging them into themes that address broader client objectives (e.g., driving phone sales or app installs). Media Solutions Lead Google April 2012  –  January 2014  (1 year 10 months) Toronto, Canada Area Manager, Online Sales Google May 2011  –  April 2012  (1 year) (Open) 2 recommendations Mandar Dadegaonkar Head Of Performance and Attribution at DWA Vinay is a classic example of how far hard work, determination and intelligence can take a person. His meteoric rise in... View Zaeem Mirza Global ECommerce Channel Manager @Qatar Airways Vinay is a hands-on business manager. Though flexible in his approach to management, he will amaze you with his strong hold... View Associate Manager, Online Sales Google May 2009  –  May 2011  (2 years 1 month) Team Lead, Online Sales & Operations Google November 2007  –  May 2009  (1 year 7 months) Hyderabad Area, India Product Specialist Google January 2006  –  November 2007  (1 year 11 months) (Open) 1 recommendation Saamra Mekuria-Grillo Vice President of Strategy and Operations at Pahara Institute When we worked together at Google, Vinay was a rising star, one of the first people on our very large team to be recognized for his outstanding work and promoted to a position of more responsibility. He took on a role as Product Specialist that... View Online Operations Specialist Google August 2005  –  January 2006  (6 months) (Open) 1 recommendation Kirti Patel Co-founder, Learning Designer at Imagination Supply Co As an early member of the Google Hyderabad team, Vinay proved himself to be indispensable. I appreciated his ability to mentor new hires. He was a natural trainer and always up for a challenge. I can see him thriving in any role he pursues. View AdWords Representative Google October 2004  –  August 2005  (11 months) Global Activation Lead - Ad Solutions Google February 2014  – Present (1 year 6 months) United States 1) Be a consultant to C-level decision-makers at client and agency companies from around the world at Google's executive briefing center. Deliver keynote presentations on performance media & marketing. \n \n2) Travel globally to key markets (UK, Brazil, France, India, etc.) to activate performance media solutions such as 'Full Value of Mobile.' \n \n3) Commercialize new products by packaging them into themes that address broader client objectives (e.g., driving phone sales or app installs). Global Activation Lead - Ad Solutions Google February 2014  – Present (1 year 6 months) United States 1) Be a consultant to C-level decision-makers at client and agency companies from around the world at Google's executive briefing center. Deliver keynote presentations on performance media & marketing. \n \n2) Travel globally to key markets (UK, Brazil, France, India, etc.) to activate performance media solutions such as 'Full Value of Mobile.' \n \n3) Commercialize new products by packaging them into themes that address broader client objectives (e.g., driving phone sales or app installs). Media Solutions Lead Google April 2012  –  January 2014  (1 year 10 months) Toronto, Canada Area Media Solutions Lead Google April 2012  –  January 2014  (1 year 10 months) Toronto, Canada Area Manager, Online Sales Google May 2011  –  April 2012  (1 year) (Open) 2 recommendations Mandar Dadegaonkar Head Of Performance and Attribution at DWA Vinay is a classic example of how far hard work, determination and intelligence can take a person. His meteoric rise in... View Zaeem Mirza Global ECommerce Channel Manager @Qatar Airways Vinay is a hands-on business manager. Though flexible in his approach to management, he will amaze you with his strong hold... View Manager, Online Sales Google May 2011  –  April 2012  (1 year) (Open) 2 recommendations Mandar Dadegaonkar Head Of Performance and Attribution at DWA Vinay is a classic example of how far hard work, determination and intelligence can take a person. His meteoric rise in... View Zaeem Mirza Global ECommerce Channel Manager @Qatar Airways Vinay is a hands-on business manager. Though flexible in his approach to management, he will amaze you with his strong hold... View Associate Manager, Online Sales Google May 2009  –  May 2011  (2 years 1 month) Associate Manager, Online Sales Google May 2009  –  May 2011  (2 years 1 month) Team Lead, Online Sales & Operations Google November 2007  –  May 2009  (1 year 7 months) Hyderabad Area, India Team Lead, Online Sales & Operations Google November 2007  –  May 2009  (1 year 7 months) Hyderabad Area, India Product Specialist Google January 2006  –  November 2007  (1 year 11 months) (Open) 1 recommendation Saamra Mekuria-Grillo Vice President of Strategy and Operations at Pahara Institute When we worked together at Google, Vinay was a rising star, one of the first people on our very large team to be recognized for his outstanding work and promoted to a position of more responsibility. He took on a role as Product Specialist that... View Product Specialist Google January 2006  –  November 2007  (1 year 11 months) (Open) 1 recommendation Saamra Mekuria-Grillo Vice President of Strategy and Operations at Pahara Institute When we worked together at Google, Vinay was a rising star, one of the first people on our very large team to be recognized for his outstanding work and promoted to a position of more responsibility. He took on a role as Product Specialist that... View Online Operations Specialist Google August 2005  –  January 2006  (6 months) (Open) 1 recommendation Kirti Patel Co-founder, Learning Designer at Imagination Supply Co As an early member of the Google Hyderabad team, Vinay proved himself to be indispensable. I appreciated his ability to mentor new hires. He was a natural trainer and always up for a challenge. I can see him thriving in any role he pursues. View Online Operations Specialist Google August 2005  –  January 2006  (6 months) (Open) 1 recommendation Kirti Patel Co-founder, Learning Designer at Imagination Supply Co As an early member of the Google Hyderabad team, Vinay proved himself to be indispensable. I appreciated his ability to mentor new hires. He was a natural trainer and always up for a challenge. I can see him thriving in any role he pursues. View AdWords Representative Google October 2004  –  August 2005  (11 months) AdWords Representative Google October 2004  –  August 2005  (11 months) Skills Skills     Education University of London International Programmes PGDIM,  Int'l Management 2009  – 2011 A company-sponsored, masters-level, two-year management program from the University of London [external learning mode]. (Open) 2 recommendations Deljane Kum-Naksch Sr. HR Consultant, Europe at Levi Strauss & Co. I have worked closely with Vinay during a team project, which was part of our MBA program & my experience with him was very... View Victor Kafui Agbenu Sales Manager at PIL Ghana Vinay and i were in the same group during our 2nd plenary session. even though we met for only a week, prior to that, we... View Osmania University Bachelor of Commerce,  Accounting 2000  – 2003 Writers Bureau, UK Certificate in Creative Writing 1998  – 1999 University of London International Programmes PGDIM,  Int'l Management 2009  – 2011 A company-sponsored, masters-level, two-year management program from the University of London [external learning mode]. (Open) 2 recommendations Deljane Kum-Naksch Sr. HR Consultant, Europe at Levi Strauss & Co. I have worked closely with Vinay during a team project, which was part of our MBA program & my experience with him was very... View Victor Kafui Agbenu Sales Manager at PIL Ghana Vinay and i were in the same group during our 2nd plenary session. even though we met for only a week, prior to that, we... View University of London International Programmes PGDIM,  Int'l Management 2009  – 2011 A company-sponsored, masters-level, two-year management program from the University of London [external learning mode]. (Open) 2 recommendations Deljane Kum-Naksch Sr. HR Consultant, Europe at Levi Strauss & Co. I have worked closely with Vinay during a team project, which was part of our MBA program & my experience with him was very... View Victor Kafui Agbenu Sales Manager at PIL Ghana Vinay and i were in the same group during our 2nd plenary session. even though we met for only a week, prior to that, we... View University of London International Programmes PGDIM,  Int'l Management 2009  – 2011 A company-sponsored, masters-level, two-year management program from the University of London [external learning mode]. (Open) 2 recommendations Deljane Kum-Naksch Sr. HR Consultant, Europe at Levi Strauss & Co. I have worked closely with Vinay during a team project, which was part of our MBA program & my experience with him was very... View Victor Kafui Agbenu Sales Manager at PIL Ghana Vinay and i were in the same group during our 2nd plenary session. even though we met for only a week, prior to that, we... View Osmania University Bachelor of Commerce,  Accounting 2000  – 2003 Osmania University Bachelor of Commerce,  Accounting 2000  – 2003 Osmania University Bachelor of Commerce,  Accounting 2000  – 2003 Writers Bureau, UK Certificate in Creative Writing 1998  – 1999 Writers Bureau, UK Certificate in Creative Writing 1998  – 1999 Writers Bureau, UK Certificate in Creative Writing 1998  – 1999 Honors & Awards ", "Summary Specialties:  \n \n- Project Management, stakeholder management, negotiation, program management, vendor management \n- Strong business acumen, customer service, operational excellence, process excellence \n- Strong knowledge of online advertising laws/policies, implementation and enforcement with a focus on protecting users from fraud and abuse Summary Specialties:  \n \n- Project Management, stakeholder management, negotiation, program management, vendor management \n- Strong business acumen, customer service, operational excellence, process excellence \n- Strong knowledge of online advertising laws/policies, implementation and enforcement with a focus on protecting users from fraud and abuse Specialties:  \n \n- Project Management, stakeholder management, negotiation, program management, vendor management \n- Strong business acumen, customer service, operational excellence, process excellence \n- Strong knowledge of online advertising laws/policies, implementation and enforcement with a focus on protecting users from fraud and abuse Specialties:  \n \n- Project Management, stakeholder management, negotiation, program management, vendor management \n- Strong business acumen, customer service, operational excellence, process excellence \n- Strong knowledge of online advertising laws/policies, implementation and enforcement with a focus on protecting users from fraud and abuse Experience Program Manager, Feedback Engineering Google February 2014  – Present (1 year 6 months) - Managing Vendor Operations for the Feedback Engineering team (~300 member team) at Google. \n- Managing vendor relations with key Partners, driving policy/process improvements & automation by working with core engineering team. \n- Supporting a wide range of Product owners & PMs across 100+ Google products, being the voice to action user feedback for Google and driving to make magical moments for all Google products (small + the giants). Project Manager, Insights & Improvements, Global Customer Services Google December 2011  – Present (3 years 8 months) Hyderabad Area, India - Goal: Build a world class customer service organization by solving the toughest and most strategic business problems. \n- Key responsibilities include problem solving, providing strategic guidance, stakeholder management, process improvement, project management, execution & above all have a strong customer mindset. \n- Past projects include Marketing initiatives to drive channel awareness, External benchmarking, Customer Satisfaction initiatives like reducing dissatisfaction rate, Next generation service model, etc. \n- Experience in building vendor model to support operations and business structure \n- Experience in projects driving revenue for Small & Medium scale businesses of Google Ad Operations globally. (Open) 5 recommendations, including: Veena Valluri Technology Manager Ujjval and I worked together in AdWords SMB team. She's thoughtful in her approach, detail oriented and very passionate... View Karthik T K Project Manager (PMP) at Google I was Ujjval’s peer in the project management team at Google and have a firsthand knowledge of her skills & achievements.... View 3 more recommendations Policy Specialist, Global Advertising Operations Google January 2007  –  December 2011  (5 years) Hyderabad Area, India - Collaborate with cross-functional partners from legal, PR, engineering, product management, sales and operations to develop policies & enforce changes of global advertising policies for Google AdWords. \n- Develop internal and external policy related communications, announcements on blogposts, AdWords Help Center, email blast, etc. \n- Evangelised launch of TV, Display, Print & Mobile ad policies & review process in Google world-wide \n- Specialized in online pharma policies, landing page quality policies, gambling, etc.  \n- Train Operations teams on new policies, changes, etc. AdWords Representative, AdWords Google June 2006  –  December 2006  (7 months) Hyderabad Area, India - Review and approval of high-touch clients' ads  \n- Point of contact to review escalated ads that are border-line. \n- Assisted in the implementation of International Pharmacy Policy \n- Team Advisor - Mentored and trained new hires on Policy and Policy procedures Program Manager, Feedback Engineering Google February 2014  – Present (1 year 6 months) - Managing Vendor Operations for the Feedback Engineering team (~300 member team) at Google. \n- Managing vendor relations with key Partners, driving policy/process improvements & automation by working with core engineering team. \n- Supporting a wide range of Product owners & PMs across 100+ Google products, being the voice to action user feedback for Google and driving to make magical moments for all Google products (small + the giants). Program Manager, Feedback Engineering Google February 2014  – Present (1 year 6 months) - Managing Vendor Operations for the Feedback Engineering team (~300 member team) at Google. \n- Managing vendor relations with key Partners, driving policy/process improvements & automation by working with core engineering team. \n- Supporting a wide range of Product owners & PMs across 100+ Google products, being the voice to action user feedback for Google and driving to make magical moments for all Google products (small + the giants). Project Manager, Insights & Improvements, Global Customer Services Google December 2011  – Present (3 years 8 months) Hyderabad Area, India - Goal: Build a world class customer service organization by solving the toughest and most strategic business problems. \n- Key responsibilities include problem solving, providing strategic guidance, stakeholder management, process improvement, project management, execution & above all have a strong customer mindset. \n- Past projects include Marketing initiatives to drive channel awareness, External benchmarking, Customer Satisfaction initiatives like reducing dissatisfaction rate, Next generation service model, etc. \n- Experience in building vendor model to support operations and business structure \n- Experience in projects driving revenue for Small & Medium scale businesses of Google Ad Operations globally. (Open) 5 recommendations, including: Veena Valluri Technology Manager Ujjval and I worked together in AdWords SMB team. She's thoughtful in her approach, detail oriented and very passionate... View Karthik T K Project Manager (PMP) at Google I was Ujjval’s peer in the project management team at Google and have a firsthand knowledge of her skills & achievements.... View 3 more recommendations Project Manager, Insights & Improvements, Global Customer Services Google December 2011  – Present (3 years 8 months) Hyderabad Area, India - Goal: Build a world class customer service organization by solving the toughest and most strategic business problems. \n- Key responsibilities include problem solving, providing strategic guidance, stakeholder management, process improvement, project management, execution & above all have a strong customer mindset. \n- Past projects include Marketing initiatives to drive channel awareness, External benchmarking, Customer Satisfaction initiatives like reducing dissatisfaction rate, Next generation service model, etc. \n- Experience in building vendor model to support operations and business structure \n- Experience in projects driving revenue for Small & Medium scale businesses of Google Ad Operations globally. (Open) 5 recommendations, including: Veena Valluri Technology Manager Ujjval and I worked together in AdWords SMB team. She's thoughtful in her approach, detail oriented and very passionate... View Karthik T K Project Manager (PMP) at Google I was Ujjval’s peer in the project management team at Google and have a firsthand knowledge of her skills & achievements.... View 3 more recommendations Policy Specialist, Global Advertising Operations Google January 2007  –  December 2011  (5 years) Hyderabad Area, India - Collaborate with cross-functional partners from legal, PR, engineering, product management, sales and operations to develop policies & enforce changes of global advertising policies for Google AdWords. \n- Develop internal and external policy related communications, announcements on blogposts, AdWords Help Center, email blast, etc. \n- Evangelised launch of TV, Display, Print & Mobile ad policies & review process in Google world-wide \n- Specialized in online pharma policies, landing page quality policies, gambling, etc.  \n- Train Operations teams on new policies, changes, etc. Policy Specialist, Global Advertising Operations Google January 2007  –  December 2011  (5 years) Hyderabad Area, India - Collaborate with cross-functional partners from legal, PR, engineering, product management, sales and operations to develop policies & enforce changes of global advertising policies for Google AdWords. \n- Develop internal and external policy related communications, announcements on blogposts, AdWords Help Center, email blast, etc. \n- Evangelised launch of TV, Display, Print & Mobile ad policies & review process in Google world-wide \n- Specialized in online pharma policies, landing page quality policies, gambling, etc.  \n- Train Operations teams on new policies, changes, etc. AdWords Representative, AdWords Google June 2006  –  December 2006  (7 months) Hyderabad Area, India - Review and approval of high-touch clients' ads  \n- Point of contact to review escalated ads that are border-line. \n- Assisted in the implementation of International Pharmacy Policy \n- Team Advisor - Mentored and trained new hires on Policy and Policy procedures AdWords Representative, AdWords Google June 2006  –  December 2006  (7 months) Hyderabad Area, India - Review and approval of high-touch clients' ads  \n- Point of contact to review escalated ads that are border-line. \n- Assisted in the implementation of International Pharmacy Policy \n- Team Advisor - Mentored and trained new hires on Policy and Policy procedures Skills Top Skills 28 Online Advertising 24 Google Adwords 15 Project Management 14 Google Analytics 13 Product Management 9 Project Planning 5 Project Execution 5 Six Sigma 5 CRM 5 Advertising Ujjval also knows about... 4 HTML 3 Flash 3 PMP 3 Analytical Skills 3 Cross-functional Team... 2 Highly Analytical 1 Internet Law 1 Public Policy 1 Photoshop rendering 1 3D Studio Max 1 Rendering 0 Ad Campaign Optimization 0 Macromedia Flash 0 Adobe Premier Skills  Top Skills 28 Online Advertising 24 Google Adwords 15 Project Management 14 Google Analytics 13 Product Management 9 Project Planning 5 Project Execution 5 Six Sigma 5 CRM 5 Advertising Ujjval also knows about... 4 HTML 3 Flash 3 PMP 3 Analytical Skills 3 Cross-functional Team... 2 Highly Analytical 1 Internet Law 1 Public Policy 1 Photoshop rendering 1 3D Studio Max 1 Rendering 0 Ad Campaign Optimization 0 Macromedia Flash 0 Adobe Premier Top Skills 28 Online Advertising 24 Google Adwords 15 Project Management 14 Google Analytics 13 Product Management 9 Project Planning 5 Project Execution 5 Six Sigma 5 CRM 5 Advertising Ujjval also knows about... 4 HTML 3 Flash 3 PMP 3 Analytical Skills 3 Cross-functional Team... 2 Highly Analytical 1 Internet Law 1 Public Policy 1 Photoshop rendering 1 3D Studio Max 1 Rendering 0 Ad Campaign Optimization 0 Macromedia Flash 0 Adobe Premier Top Skills 28 Online Advertising 24 Google Adwords 15 Project Management 14 Google Analytics 13 Product Management 9 Project Planning 5 Project Execution 5 Six Sigma 5 CRM 5 Advertising Ujjval also knows about... 4 HTML 3 Flash 3 PMP 3 Analytical Skills 3 Cross-functional Team... 2 Highly Analytical 1 Internet Law 1 Public Policy 1 Photoshop rendering 1 3D Studio Max 1 Rendering 0 Ad Campaign Optimization 0 Macromedia Flash 0 Adobe Premier                     4 HTML 3 Flash 3 PMP 3 Analytical Skills 3 Cross-functional Team... 2 Highly Analytical 1 Internet Law 1 Public Policy 1 Photoshop rendering 1 3D Studio Max 1 Rendering 0 Ad Campaign Optimization 0 Macromedia Flash 0 Adobe Premier Education COPC COPC VMO , Certified 2014  – 2014 PMI PMP,  Project Management Professional PSG College, Bharatiar University Bachelor of Science (B.Sc.),  Visual Communication (Electronic Media) Activities and Societies:  Traveling ,  adventure ,  fitness ,  Rotary COPC COPC VMO , Certified 2014  – 2014 COPC COPC VMO , Certified 2014  – 2014 COPC COPC VMO , Certified 2014  – 2014 PMI PMP,  Project Management Professional PMI PMP,  Project Management Professional PMI PMP,  Project Management Professional PSG College, Bharatiar University Bachelor of Science (B.Sc.),  Visual Communication (Electronic Media) Activities and Societies:  Traveling ,  adventure ,  fitness ,  Rotary PSG College, Bharatiar University Bachelor of Science (B.Sc.),  Visual Communication (Electronic Media) Activities and Societies:  Traveling ,  adventure ,  fitness ,  Rotary PSG College, Bharatiar University Bachelor of Science (B.Sc.),  Visual Communication (Electronic Media) Activities and Societies:  Traveling ,  adventure ,  fitness ,  Rotary ", "Summary Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Summary Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Online sales and operations professional with over 8 years of experience in SMB sales, outsourcing, vendor management, account management, and customer support.  \n \nI started my career as an associate at Genpact and soon developed interest in the Internet industry. I joined Google in 2007 as Account Representative, moved on to customer support, managing large customer accounts, workflow, outsourcing phone support, managing our outsourced SMB sales partner in India, and now managing SMB acquisitions for all Southeast Asia countries. Its been an amazing journey in India and I am excited to be in SEA. \n \nI currently head a team that helps SMBs make the most of internet. The team acquires and supports new SMB advertisers across SEA.  \n \nA cricketer at heart and a passionate biker. I seriously believe, you can be serious without a suit. Experience SMB Acquisition Manager Google May 2015  – Present (3 months) Kuala Lumpur, Malaysia Operations Lead - SMB Sales, SEA Google July 2014  – Present (1 year 1 month) Kuala Lumpur, Malaysia Driving SMB customer acquisitions through our outsourcing partners to exceed sales and customer satisfaction targets. I manage end to end sales operations and serve as Google representative for our vendor partner liaising with internal Google stakeholders. \n \nI own, drive and monitor our partner in the region on sales metrics and service level agreements. When I am not busy drilling data or trying to make it look beautiful, I spend time coaching the vendor sales team and working on strategic initiatives to drive growth. Operations Lead - SMB Sales, India Google August 2011  –  June 2014  (2 years 11 months) Hyderabad Area, India Drive small business acquisitions at scale for Google AdWords in India through outsourced operations.  \n \nI managed one of our two vendors in India, a team of ~40 sales representatives responsible for acquiring new advertisers and meeting revenue targets through various marketing and non-marketing channels.  \n \nWorked closely with our marketing team on Google Partners program, managing events, and monitoring several co-marketing partners on SLAs. Delivered sales coaching to the team on ground and lead the quarterly business reviews with our vendor in South India. (Open) 2 honors and awards Platinum Award As part of the APAC SMB sales team.  View Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to... View Account Associate Google July 2009  –  July 2011  (2 years 1 month) Hyderabad Area, India Owned workflow management for the email support team with goals to meet service level agreements for 17 email queues. Lead daily planning around staffing and volumes, and weekly market reviews.  \n \nContributed 50% time on key initiative to increase CSAT and volunteered to be part of pilot team for phone follow-up to customer queries.  \n \nAlso worked on developing reporting for key stakeholders and strategic projects around \"sales as service\" (Open) 1 project Customer Support Outsourcing Served as SME for outsourcing customer support.\nMy Contribution:\n- Helped draft the initial SOW (Statement of Work)\n- Provided inputs on call volumes and workflow.\n- Drafted job description and requirements for agents, FLMs and QC candidates... View (Open) 1 honor or award Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. View (Open) 1 recommendation Soumyajit Dey Digital Lead Cloud Performance Marketing, India & South Asia Gopal has been a great asset to the team. He's got excellent understanding of the process and has always led by example. His team members look up to him as a leader. Other than core job, Gopal has always actively participated and showed interest in... View Account Planner Google July 2008  –  June 2009  (1 year) Hyderabad Area, India As part of the large client services team I provided AdWords account intelligence, analysis, and research to clients in NA to meet and exceed revenue targets. \n \n- Worked on building overall SEM strategy for clients. \n- Recommend actionable next steps to advertisers based on analysis and reports. \n- Made early interventions for negative trends such as declining conversion rates and took corrective measures. \n- Provided consultation and advice to advertisers and marketing managers. \n- Investigated issues that are not obvious and designed possible solutions. AdWords Representative Google July 2007  –  June 2008  (1 year) Hyderabad Area, India Started my exciting journey at Google working on reviewing multiple ad formats to ensure adherence to AdWords policies. I then moved on to the customer support team, as a CSR I responded to advertiser queries over email.  \n \nContributed 20% time as part time optimizer working on advertiser accounts to improve performance. Associate GENPACT LLC July 2005  –  June 2007  (2 years) Hyderabad Area, India Worked as backend credit research executive for one of the largest logistics and truck leasing company in US. SMB Acquisition Manager Google May 2015  – Present (3 months) Kuala Lumpur, Malaysia SMB Acquisition Manager Google May 2015  – Present (3 months) Kuala Lumpur, Malaysia Operations Lead - SMB Sales, SEA Google July 2014  – Present (1 year 1 month) Kuala Lumpur, Malaysia Driving SMB customer acquisitions through our outsourcing partners to exceed sales and customer satisfaction targets. I manage end to end sales operations and serve as Google representative for our vendor partner liaising with internal Google stakeholders. \n \nI own, drive and monitor our partner in the region on sales metrics and service level agreements. When I am not busy drilling data or trying to make it look beautiful, I spend time coaching the vendor sales team and working on strategic initiatives to drive growth. Operations Lead - SMB Sales, SEA Google July 2014  – Present (1 year 1 month) Kuala Lumpur, Malaysia Driving SMB customer acquisitions through our outsourcing partners to exceed sales and customer satisfaction targets. I manage end to end sales operations and serve as Google representative for our vendor partner liaising with internal Google stakeholders. \n \nI own, drive and monitor our partner in the region on sales metrics and service level agreements. When I am not busy drilling data or trying to make it look beautiful, I spend time coaching the vendor sales team and working on strategic initiatives to drive growth. Operations Lead - SMB Sales, India Google August 2011  –  June 2014  (2 years 11 months) Hyderabad Area, India Drive small business acquisitions at scale for Google AdWords in India through outsourced operations.  \n \nI managed one of our two vendors in India, a team of ~40 sales representatives responsible for acquiring new advertisers and meeting revenue targets through various marketing and non-marketing channels.  \n \nWorked closely with our marketing team on Google Partners program, managing events, and monitoring several co-marketing partners on SLAs. Delivered sales coaching to the team on ground and lead the quarterly business reviews with our vendor in South India. (Open) 2 honors and awards Platinum Award As part of the APAC SMB sales team.  View Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to... View Operations Lead - SMB Sales, India Google August 2011  –  June 2014  (2 years 11 months) Hyderabad Area, India Drive small business acquisitions at scale for Google AdWords in India through outsourced operations.  \n \nI managed one of our two vendors in India, a team of ~40 sales representatives responsible for acquiring new advertisers and meeting revenue targets through various marketing and non-marketing channels.  \n \nWorked closely with our marketing team on Google Partners program, managing events, and monitoring several co-marketing partners on SLAs. Delivered sales coaching to the team on ground and lead the quarterly business reviews with our vendor in South India. (Open) 2 honors and awards Platinum Award As part of the APAC SMB sales team.  View Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to... View Account Associate Google July 2009  –  July 2011  (2 years 1 month) Hyderabad Area, India Owned workflow management for the email support team with goals to meet service level agreements for 17 email queues. Lead daily planning around staffing and volumes, and weekly market reviews.  \n \nContributed 50% time on key initiative to increase CSAT and volunteered to be part of pilot team for phone follow-up to customer queries.  \n \nAlso worked on developing reporting for key stakeholders and strategic projects around \"sales as service\" (Open) 1 project Customer Support Outsourcing Served as SME for outsourcing customer support.\nMy Contribution:\n- Helped draft the initial SOW (Statement of Work)\n- Provided inputs on call volumes and workflow.\n- Drafted job description and requirements for agents, FLMs and QC candidates... View (Open) 1 honor or award Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. View (Open) 1 recommendation Soumyajit Dey Digital Lead Cloud Performance Marketing, India & South Asia Gopal has been a great asset to the team. He's got excellent understanding of the process and has always led by example. His team members look up to him as a leader. Other than core job, Gopal has always actively participated and showed interest in... View Account Associate Google July 2009  –  July 2011  (2 years 1 month) Hyderabad Area, India Owned workflow management for the email support team with goals to meet service level agreements for 17 email queues. Lead daily planning around staffing and volumes, and weekly market reviews.  \n \nContributed 50% time on key initiative to increase CSAT and volunteered to be part of pilot team for phone follow-up to customer queries.  \n \nAlso worked on developing reporting for key stakeholders and strategic projects around \"sales as service\" (Open) 1 project Customer Support Outsourcing Served as SME for outsourcing customer support.\nMy Contribution:\n- Helped draft the initial SOW (Statement of Work)\n- Provided inputs on call volumes and workflow.\n- Drafted job description and requirements for agents, FLMs and QC candidates... View (Open) 1 honor or award Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. View (Open) 1 recommendation Soumyajit Dey Digital Lead Cloud Performance Marketing, India & South Asia Gopal has been a great asset to the team. He's got excellent understanding of the process and has always led by example. His team members look up to him as a leader. Other than core job, Gopal has always actively participated and showed interest in... View Account Planner Google July 2008  –  June 2009  (1 year) Hyderabad Area, India As part of the large client services team I provided AdWords account intelligence, analysis, and research to clients in NA to meet and exceed revenue targets. \n \n- Worked on building overall SEM strategy for clients. \n- Recommend actionable next steps to advertisers based on analysis and reports. \n- Made early interventions for negative trends such as declining conversion rates and took corrective measures. \n- Provided consultation and advice to advertisers and marketing managers. \n- Investigated issues that are not obvious and designed possible solutions. Account Planner Google July 2008  –  June 2009  (1 year) Hyderabad Area, India As part of the large client services team I provided AdWords account intelligence, analysis, and research to clients in NA to meet and exceed revenue targets. \n \n- Worked on building overall SEM strategy for clients. \n- Recommend actionable next steps to advertisers based on analysis and reports. \n- Made early interventions for negative trends such as declining conversion rates and took corrective measures. \n- Provided consultation and advice to advertisers and marketing managers. \n- Investigated issues that are not obvious and designed possible solutions. AdWords Representative Google July 2007  –  June 2008  (1 year) Hyderabad Area, India Started my exciting journey at Google working on reviewing multiple ad formats to ensure adherence to AdWords policies. I then moved on to the customer support team, as a CSR I responded to advertiser queries over email.  \n \nContributed 20% time as part time optimizer working on advertiser accounts to improve performance. AdWords Representative Google July 2007  –  June 2008  (1 year) Hyderabad Area, India Started my exciting journey at Google working on reviewing multiple ad formats to ensure adherence to AdWords policies. I then moved on to the customer support team, as a CSR I responded to advertiser queries over email.  \n \nContributed 20% time as part time optimizer working on advertiser accounts to improve performance. Associate GENPACT LLC July 2005  –  June 2007  (2 years) Hyderabad Area, India Worked as backend credit research executive for one of the largest logistics and truck leasing company in US. Associate GENPACT LLC July 2005  –  June 2007  (2 years) Hyderabad Area, India Worked as backend credit research executive for one of the largest logistics and truck leasing company in US. Languages English Full professional proficiency Hindi Full professional proficiency Telugu Elementary proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Elementary proficiency English Full professional proficiency Hindi Full professional proficiency Telugu Elementary proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Top Skills 23 Google Adwords 16 Online Advertising 13 Team Management 12 Account Management 8 Sales 7 Vendor Management 7 SEM 4 Outsourcing 3 Operations Management 2 Online Marketing K Gopal also knows about... 2 E-commerce 2 Google Analytics 1 Advertising Skills  Top Skills 23 Google Adwords 16 Online Advertising 13 Team Management 12 Account Management 8 Sales 7 Vendor Management 7 SEM 4 Outsourcing 3 Operations Management 2 Online Marketing K Gopal also knows about... 2 E-commerce 2 Google Analytics 1 Advertising Top Skills 23 Google Adwords 16 Online Advertising 13 Team Management 12 Account Management 8 Sales 7 Vendor Management 7 SEM 4 Outsourcing 3 Operations Management 2 Online Marketing K Gopal also knows about... 2 E-commerce 2 Google Analytics 1 Advertising Top Skills 23 Google Adwords 16 Online Advertising 13 Team Management 12 Account Management 8 Sales 7 Vendor Management 7 SEM 4 Outsourcing 3 Operations Management 2 Online Marketing K Gopal also knows about... 2 E-commerce 2 Google Analytics 1 Advertising                     2 E-commerce 2 Google Analytics 1 Advertising Education Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Pandit Ravishankar Shukla University B.Com,  Accounting 2002  – 2005 Activities and Societies:  Cultural team ,  Cricket team Honors & Awards Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Platinum Award As part of the APAC SMB sales team.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Gold Award Received Google ORA (Online Recognition Award) Gold for outstanding performance managing workflow and CSAT. Platinum Award As part of the APAC SMB sales team.  Platinum Award As part of the APAC SMB sales team.  Platinum Award As part of the APAC SMB sales team.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  Peer Bonuses Received several peer bonuses, with the recent one for suggesting several ideas that are being considered in order to increase the inbound business globally.  ", "Summary Result oriented professional with expertise in the fields of Program Management, Project Management and Process Training across Online Sales and Maps Operations at Google. Proven leadership skills and problem resolution abilities. Keen on developing self into a multi skilled professional with strong ethics. \n \nSpecialties: \n- Program / Project Management \n- Operations Management \n- Vendor Management \n- Strategy \n- Analysis \n- Process Training \n- People Management Summary Result oriented professional with expertise in the fields of Program Management, Project Management and Process Training across Online Sales and Maps Operations at Google. Proven leadership skills and problem resolution abilities. Keen on developing self into a multi skilled professional with strong ethics. \n \nSpecialties: \n- Program / Project Management \n- Operations Management \n- Vendor Management \n- Strategy \n- Analysis \n- Process Training \n- People Management Result oriented professional with expertise in the fields of Program Management, Project Management and Process Training across Online Sales and Maps Operations at Google. Proven leadership skills and problem resolution abilities. Keen on developing self into a multi skilled professional with strong ethics. \n \nSpecialties: \n- Program / Project Management \n- Operations Management \n- Vendor Management \n- Strategy \n- Analysis \n- Process Training \n- People Management Result oriented professional with expertise in the fields of Program Management, Project Management and Process Training across Online Sales and Maps Operations at Google. Proven leadership skills and problem resolution abilities. Keen on developing self into a multi skilled professional with strong ethics. \n \nSpecialties: \n- Program / Project Management \n- Operations Management \n- Vendor Management \n- Strategy \n- Analysis \n- Process Training \n- People Management Experience Strategic Operations Program Manager, Geo Local Data Google February 2015  – Present (6 months) Ireland Working with senior leadership (cross functional team consisting of PgMs, PMs, Engg, Ops, Legal, Marketing, Finance etc), to improve coverage & accuracy of business listing information on Maps, operational performance, perform large scale data analysis & develop comprehensive business strategy to improve business data coverage in strategic countries & streamline operational workflows to lower cost, improve quality & TAT Program Manager, Geo Local Data Operations - APAC & EMEA Google May 2014  –  February 2015  (10 months) Singapore, Ireland -Successfully managed a field & in-house operations team of >100 in each country, to improve the coverage & accuracy of business data on Maps, in Thailand, Indonesia, Malaysia, Nepal (launched & transitioned), Saudi (pre launch scoping), Egypt (initial research) \n-As the Global Field Touch Operations Training & Policy Lead, I helped roll out standardized policies & training globally Program Manager, Emerging Markets (South East Asia) Google June 2013  –  April 2014  (11 months) Singapore Devised & implemented an elaborate & robust Customer Support Model for an Access Project in Indonesia; Provided strategic direction for Geo projects related to data acquisition & maps enhancement; Represented Geo at the user conference held in Indonesia Program Manager, Maps Operations Google June 2010  –  May 2013  (3 years) Hyderabad Area, India -Training & Quality: Improved team’s training skills & project managed the scaling of the operations team by 3 times; Put in place comprehensive quality check mechanisms & helped set up quality control operations in Seattle \n-Finance: Helped the Ops team to transition to a new operating model (saving Google millions of $), met variance targets & ran a zero escalation / invisible process \n-India Maps: Project managed the operations team to substantially improve India maps data quality Official Google India Blog: Navigation and traffic data come to Google Maps in India Edit Project Manager, Global Ad Ops Google March 2010  –  June 2010  (4 months) Gurgaon, India As the project lead, I successfully managed to provide proof of concept to outsource ad review operations by training, acculturating & mentoring the vendor team from IBM, to ensure the key project deliverables (productivity, quality, TAT) were met Process Trainer, Global Ad Ops Google March 2009  –  March 2010  (1 year 1 month) Hyderabad Area, India Created content & conducted new hire & poplicy trainings for ~150 Googlers, achieved the highest trainer satisfaction score & collaborated with the Global AdSense team & project managed the non-text ad pilot which I helped conceive, implement, launch & complete successfully Adwords Representative/Associate Google June 2008  –  February 2009  (9 months) Hyderabad Area, India As the Workflow Lead for High Touch Clients (eg:Ebay, Amazon etc), I ensured that the ads review turn-around-time & backlog targets were achieved 100% of the time Strategic Operations Program Manager, Geo Local Data Google February 2015  – Present (6 months) Ireland Working with senior leadership (cross functional team consisting of PgMs, PMs, Engg, Ops, Legal, Marketing, Finance etc), to improve coverage & accuracy of business listing information on Maps, operational performance, perform large scale data analysis & develop comprehensive business strategy to improve business data coverage in strategic countries & streamline operational workflows to lower cost, improve quality & TAT Strategic Operations Program Manager, Geo Local Data Google February 2015  – Present (6 months) Ireland Working with senior leadership (cross functional team consisting of PgMs, PMs, Engg, Ops, Legal, Marketing, Finance etc), to improve coverage & accuracy of business listing information on Maps, operational performance, perform large scale data analysis & develop comprehensive business strategy to improve business data coverage in strategic countries & streamline operational workflows to lower cost, improve quality & TAT Program Manager, Geo Local Data Operations - APAC & EMEA Google May 2014  –  February 2015  (10 months) Singapore, Ireland -Successfully managed a field & in-house operations team of >100 in each country, to improve the coverage & accuracy of business data on Maps, in Thailand, Indonesia, Malaysia, Nepal (launched & transitioned), Saudi (pre launch scoping), Egypt (initial research) \n-As the Global Field Touch Operations Training & Policy Lead, I helped roll out standardized policies & training globally Program Manager, Geo Local Data Operations - APAC & EMEA Google May 2014  –  February 2015  (10 months) Singapore, Ireland -Successfully managed a field & in-house operations team of >100 in each country, to improve the coverage & accuracy of business data on Maps, in Thailand, Indonesia, Malaysia, Nepal (launched & transitioned), Saudi (pre launch scoping), Egypt (initial research) \n-As the Global Field Touch Operations Training & Policy Lead, I helped roll out standardized policies & training globally Program Manager, Emerging Markets (South East Asia) Google June 2013  –  April 2014  (11 months) Singapore Devised & implemented an elaborate & robust Customer Support Model for an Access Project in Indonesia; Provided strategic direction for Geo projects related to data acquisition & maps enhancement; Represented Geo at the user conference held in Indonesia Program Manager, Emerging Markets (South East Asia) Google June 2013  –  April 2014  (11 months) Singapore Devised & implemented an elaborate & robust Customer Support Model for an Access Project in Indonesia; Provided strategic direction for Geo projects related to data acquisition & maps enhancement; Represented Geo at the user conference held in Indonesia Program Manager, Maps Operations Google June 2010  –  May 2013  (3 years) Hyderabad Area, India -Training & Quality: Improved team’s training skills & project managed the scaling of the operations team by 3 times; Put in place comprehensive quality check mechanisms & helped set up quality control operations in Seattle \n-Finance: Helped the Ops team to transition to a new operating model (saving Google millions of $), met variance targets & ran a zero escalation / invisible process \n-India Maps: Project managed the operations team to substantially improve India maps data quality Official Google India Blog: Navigation and traffic data come to Google Maps in India Edit Program Manager, Maps Operations Google June 2010  –  May 2013  (3 years) Hyderabad Area, India -Training & Quality: Improved team’s training skills & project managed the scaling of the operations team by 3 times; Put in place comprehensive quality check mechanisms & helped set up quality control operations in Seattle \n-Finance: Helped the Ops team to transition to a new operating model (saving Google millions of $), met variance targets & ran a zero escalation / invisible process \n-India Maps: Project managed the operations team to substantially improve India maps data quality Official Google India Blog: Navigation and traffic data come to Google Maps in India Edit Official Google India Blog: Navigation and traffic data come to Google Maps in India Edit Official Google India Blog: Navigation and traffic data come to Google Maps in India Edit Official Google India Blog: Navigation and traffic data come to Google Maps in India  Official Google India Blog: Navigation and traffic data come to Google Maps in India  Project Manager, Global Ad Ops Google March 2010  –  June 2010  (4 months) Gurgaon, India As the project lead, I successfully managed to provide proof of concept to outsource ad review operations by training, acculturating & mentoring the vendor team from IBM, to ensure the key project deliverables (productivity, quality, TAT) were met Project Manager, Global Ad Ops Google March 2010  –  June 2010  (4 months) Gurgaon, India As the project lead, I successfully managed to provide proof of concept to outsource ad review operations by training, acculturating & mentoring the vendor team from IBM, to ensure the key project deliverables (productivity, quality, TAT) were met Process Trainer, Global Ad Ops Google March 2009  –  March 2010  (1 year 1 month) Hyderabad Area, India Created content & conducted new hire & poplicy trainings for ~150 Googlers, achieved the highest trainer satisfaction score & collaborated with the Global AdSense team & project managed the non-text ad pilot which I helped conceive, implement, launch & complete successfully Process Trainer, Global Ad Ops Google March 2009  –  March 2010  (1 year 1 month) Hyderabad Area, India Created content & conducted new hire & poplicy trainings for ~150 Googlers, achieved the highest trainer satisfaction score & collaborated with the Global AdSense team & project managed the non-text ad pilot which I helped conceive, implement, launch & complete successfully Adwords Representative/Associate Google June 2008  –  February 2009  (9 months) Hyderabad Area, India As the Workflow Lead for High Touch Clients (eg:Ebay, Amazon etc), I ensured that the ads review turn-around-time & backlog targets were achieved 100% of the time Adwords Representative/Associate Google June 2008  –  February 2009  (9 months) Hyderabad Area, India As the Workflow Lead for High Touch Clients (eg:Ebay, Amazon etc), I ensured that the ads review turn-around-time & backlog targets were achieved 100% of the time Languages English Tamil Telugu Hindi Kannada English Tamil Telugu Hindi Kannada English Tamil Telugu Hindi Kannada Skills Top Skills 20 Management 15 Project Management 15 Strategy 10 Leadership 9 Program Management 6 Team Management 5 Training 4 Vendor Management 3 Google Adwords 3 Business Analysis Prem also knows about... 3 Operations Management 2 Outsourcing 2 Talent Management 2 Analysis 1 Data Analysis 1 Forecasting 1 Google Maps 1 Operational Excellence 1 Operational Planning 0 Maps 0 Process Excellence Skills  Top Skills 20 Management 15 Project Management 15 Strategy 10 Leadership 9 Program Management 6 Team Management 5 Training 4 Vendor Management 3 Google Adwords 3 Business Analysis Prem also knows about... 3 Operations Management 2 Outsourcing 2 Talent Management 2 Analysis 1 Data Analysis 1 Forecasting 1 Google Maps 1 Operational Excellence 1 Operational Planning 0 Maps 0 Process Excellence Top Skills 20 Management 15 Project Management 15 Strategy 10 Leadership 9 Program Management 6 Team Management 5 Training 4 Vendor Management 3 Google Adwords 3 Business Analysis Prem also knows about... 3 Operations Management 2 Outsourcing 2 Talent Management 2 Analysis 1 Data Analysis 1 Forecasting 1 Google Maps 1 Operational Excellence 1 Operational Planning 0 Maps 0 Process Excellence Top Skills 20 Management 15 Project Management 15 Strategy 10 Leadership 9 Program Management 6 Team Management 5 Training 4 Vendor Management 3 Google Adwords 3 Business Analysis Prem also knows about... 3 Operations Management 2 Outsourcing 2 Talent Management 2 Analysis 1 Data Analysis 1 Forecasting 1 Google Maps 1 Operational Excellence 1 Operational Planning 0 Maps 0 Process Excellence                     3 Operations Management 2 Outsourcing 2 Talent Management 2 Analysis 1 Data Analysis 1 Forecasting 1 Google Maps 1 Operational Excellence 1 Operational Planning 0 Maps 0 Process Excellence Education MICA - Ahmedabad Post Graduate Certificate in Advertising Management & Public Relations , O (Outstanding) 2008  – 2009 St. Joseph's College of Commerce - Bangalore B.Com,  Finance , 76% 2005  – 2008 Christ College - Bangalore P.U.C,  Business/Commerce ,  Statistics ,  Mathematics ,  Economics ,  Accounting , 91% 2003  – 2005 The Frank Anthony Public School - Bangalore I.C.S.E,  Science ,  Commerce ,  Languages , 73% 1991  – 2003 MICA - Ahmedabad Post Graduate Certificate in Advertising Management & Public Relations , O (Outstanding) 2008  – 2009 MICA - Ahmedabad Post Graduate Certificate in Advertising Management & Public Relations , O (Outstanding) 2008  – 2009 MICA - Ahmedabad Post Graduate Certificate in Advertising Management & Public Relations , O (Outstanding) 2008  – 2009 St. Joseph's College of Commerce - Bangalore B.Com,  Finance , 76% 2005  – 2008 St. Joseph's College of Commerce - Bangalore B.Com,  Finance , 76% 2005  – 2008 St. Joseph's College of Commerce - Bangalore B.Com,  Finance , 76% 2005  – 2008 Christ College - Bangalore P.U.C,  Business/Commerce ,  Statistics ,  Mathematics ,  Economics ,  Accounting , 91% 2003  – 2005 Christ College - Bangalore P.U.C,  Business/Commerce ,  Statistics ,  Mathematics ,  Economics ,  Accounting , 91% 2003  – 2005 Christ College - Bangalore P.U.C,  Business/Commerce ,  Statistics ,  Mathematics ,  Economics ,  Accounting , 91% 2003  – 2005 The Frank Anthony Public School - Bangalore I.C.S.E,  Science ,  Commerce ,  Languages , 73% 1991  – 2003 The Frank Anthony Public School - Bangalore I.C.S.E,  Science ,  Commerce ,  Languages , 73% 1991  – 2003 The Frank Anthony Public School - Bangalore I.C.S.E,  Science ,  Commerce ,  Languages , 73% 1991  – 2003 Honors & Awards Additional Honors & Awards - Received 6 Spot Awards (at Google) for project excellence and strong performance, during my tenure at Google. Nominations were by Managers, Sr. Program Manager, Directors.  \n \n- Received Merit award from ITI Officers’ Association &amp; ITI Employees’ Co-operative Credit Society Ltd. for securing 90.83% in P.U.C. \n \n- Selected as Best All-Rounder in the All India Cricket Tournament, B.P.C.A Pepsi Cup 2003. Additional Honors & Awards - Received 6 Spot Awards (at Google) for project excellence and strong performance, during my tenure at Google. Nominations were by Managers, Sr. Program Manager, Directors.  \n \n- Received Merit award from ITI Officers’ Association &amp; ITI Employees’ Co-operative Credit Society Ltd. for securing 90.83% in P.U.C. \n \n- Selected as Best All-Rounder in the All India Cricket Tournament, B.P.C.A Pepsi Cup 2003. Additional Honors & Awards - Received 6 Spot Awards (at Google) for project excellence and strong performance, during my tenure at Google. Nominations were by Managers, Sr. Program Manager, Directors.  \n \n- Received Merit award from ITI Officers’ Association &amp; ITI Employees’ Co-operative Credit Society Ltd. for securing 90.83% in P.U.C. \n \n- Selected as Best All-Rounder in the All India Cricket Tournament, B.P.C.A Pepsi Cup 2003. Additional Honors & Awards - Received 6 Spot Awards (at Google) for project excellence and strong performance, during my tenure at Google. Nominations were by Managers, Sr. Program Manager, Directors.  \n \n- Received Merit award from ITI Officers’ Association &amp; ITI Employees’ Co-operative Credit Society Ltd. for securing 90.83% in P.U.C. \n \n- Selected as Best All-Rounder in the All India Cricket Tournament, B.P.C.A Pepsi Cup 2003. ", "Experience Manager, Ads Policy Google September 2013  – Present (1 year 11 months) Hyderabad Area, India Core responsibilities: \n \n- Build strategy and vision for the team. \n- Identify policy improvement opportunities and streamline escalation workflows. \n- Negotiate with and manage stakeholders on key product and policy changes.  \n- Guide the team through several policy changes, many of which have revenue impact.  \n- Handle high level escalations. \n \n \nAdditional responsibilities: \n \n- Business partner for hiring. Handle all aspects of hiring including interviews, headcount planning, allocation, etc. Work with staffing teams to plan recruiting events. Manager, AdSpam Operations (Product Quality Operations) Google January 2013  –  August 2013  (8 months) Hyderabad Area, India Core responsibilities: \n \n- Build strategy and vision for the team, including finalization of metrics and core goals. \n \nAdditional responsibilities: \n \n- Business partner for hiring. Worked with staffing teams to plan headcount allocation and recruiting events.  \n- Part of the planning group that ran a global contest within the business unit to drive innovation. Team Lead, AdSpam Operations (Product Quality Operations) Google October 2010  –  December 2012  (2 years 3 months) Hyderabad Area, India Core responsibilities: \n \n- Functionally lead the AdSpam Operations team investigating click traffic for AdWords and AdSense accounts.  \n- Build strategy and vision including yearly planning, quarterly OKRs, and headcount planning.  \n \nAdditional responsibilities: \n \n- Handle several communication efforts including legal and PR escalations. \n- Conceptualize and execute techniques to grow publisher happiness and improve transparency in enforcement. \n- Setup processes to improve turn around time on alerts and engineering escalations. \n- Planned and executed privacy training for the org. AdSpam Sr. Analyst (Product Quality Operations) Google April 2010  –  September 2010  (6 months) Hyderabad Area, India Core responsibilities: \n \n- Continue to review click traffic for invalid click activity. \n- Implement structural changes to reduce Customer Wait Time for internal teams. \n- Streamline the process of escalations to improve over Turn Around Time. \n \nAdditional responsibilities: \n \n- Investigate traffic from very large scale bot attacks.  \n- Transition large aspects of the workflow to the team in Dublin, Ireland. \n- Experimented with a proactive workflow based on advertiser vertical. AdSpam Analyst (Product Quality Operations) Google January 2008  –  April 2010  (2 years 4 months) Hyderabad Area, India Core responsibilities: \n \n- Review click traffic for invalid click activity for AdWords advertisers \n- Investigate large scale botnets generating invalid click traffic on Google ad networks \n \nAdditional responsibilities: \n \n- Handle all one-off investigations and escalations, including alerts from external traffic click tracking companies. \n- Train and ramp up peers in Dublin, Ireland.  \n- Own a manual blacklisting process. AdWords Strategist Google August 2006  –  January 2008  (1 year 6 months) Hyderabad Area, India Core responsibilities: \n \n- Provide email based support for AdWords advertisers. \n- Spent two quarters as an Analytics Guru, offering Analytics support to top tier AdWords advertisers. \n \nAdditional responsibilities: \n- Introduced several procedural and structural improvements to the process. \n- Mentoring and ad hoc training support for newbies on the team. AdWords Representative Google March 2005  –  August 2006  (1 year 6 months) Review AdWords ads for compliance with AdWords policies. Supported Top Tier and Direct advertisers. Consultant Human Resource Specialists September 2004  –  February 2005  (6 months) Hyderabad Area, India Source and recruit candidates for ITES companies in Hyderabad, Gurgaon, and Bangalore. Manager, Ads Policy Google September 2013  – Present (1 year 11 months) Hyderabad Area, India Core responsibilities: \n \n- Build strategy and vision for the team. \n- Identify policy improvement opportunities and streamline escalation workflows. \n- Negotiate with and manage stakeholders on key product and policy changes.  \n- Guide the team through several policy changes, many of which have revenue impact.  \n- Handle high level escalations. \n \n \nAdditional responsibilities: \n \n- Business partner for hiring. Handle all aspects of hiring including interviews, headcount planning, allocation, etc. Work with staffing teams to plan recruiting events. Manager, Ads Policy Google September 2013  – Present (1 year 11 months) Hyderabad Area, India Core responsibilities: \n \n- Build strategy and vision for the team. \n- Identify policy improvement opportunities and streamline escalation workflows. \n- Negotiate with and manage stakeholders on key product and policy changes.  \n- Guide the team through several policy changes, many of which have revenue impact.  \n- Handle high level escalations. \n \n \nAdditional responsibilities: \n \n- Business partner for hiring. Handle all aspects of hiring including interviews, headcount planning, allocation, etc. Work with staffing teams to plan recruiting events. Manager, AdSpam Operations (Product Quality Operations) Google January 2013  –  August 2013  (8 months) Hyderabad Area, India Core responsibilities: \n \n- Build strategy and vision for the team, including finalization of metrics and core goals. \n \nAdditional responsibilities: \n \n- Business partner for hiring. Worked with staffing teams to plan headcount allocation and recruiting events.  \n- Part of the planning group that ran a global contest within the business unit to drive innovation. Manager, AdSpam Operations (Product Quality Operations) Google January 2013  –  August 2013  (8 months) Hyderabad Area, India Core responsibilities: \n \n- Build strategy and vision for the team, including finalization of metrics and core goals. \n \nAdditional responsibilities: \n \n- Business partner for hiring. Worked with staffing teams to plan headcount allocation and recruiting events.  \n- Part of the planning group that ran a global contest within the business unit to drive innovation. Team Lead, AdSpam Operations (Product Quality Operations) Google October 2010  –  December 2012  (2 years 3 months) Hyderabad Area, India Core responsibilities: \n \n- Functionally lead the AdSpam Operations team investigating click traffic for AdWords and AdSense accounts.  \n- Build strategy and vision including yearly planning, quarterly OKRs, and headcount planning.  \n \nAdditional responsibilities: \n \n- Handle several communication efforts including legal and PR escalations. \n- Conceptualize and execute techniques to grow publisher happiness and improve transparency in enforcement. \n- Setup processes to improve turn around time on alerts and engineering escalations. \n- Planned and executed privacy training for the org. Team Lead, AdSpam Operations (Product Quality Operations) Google October 2010  –  December 2012  (2 years 3 months) Hyderabad Area, India Core responsibilities: \n \n- Functionally lead the AdSpam Operations team investigating click traffic for AdWords and AdSense accounts.  \n- Build strategy and vision including yearly planning, quarterly OKRs, and headcount planning.  \n \nAdditional responsibilities: \n \n- Handle several communication efforts including legal and PR escalations. \n- Conceptualize and execute techniques to grow publisher happiness and improve transparency in enforcement. \n- Setup processes to improve turn around time on alerts and engineering escalations. \n- Planned and executed privacy training for the org. AdSpam Sr. Analyst (Product Quality Operations) Google April 2010  –  September 2010  (6 months) Hyderabad Area, India Core responsibilities: \n \n- Continue to review click traffic for invalid click activity. \n- Implement structural changes to reduce Customer Wait Time for internal teams. \n- Streamline the process of escalations to improve over Turn Around Time. \n \nAdditional responsibilities: \n \n- Investigate traffic from very large scale bot attacks.  \n- Transition large aspects of the workflow to the team in Dublin, Ireland. \n- Experimented with a proactive workflow based on advertiser vertical. AdSpam Sr. Analyst (Product Quality Operations) Google April 2010  –  September 2010  (6 months) Hyderabad Area, India Core responsibilities: \n \n- Continue to review click traffic for invalid click activity. \n- Implement structural changes to reduce Customer Wait Time for internal teams. \n- Streamline the process of escalations to improve over Turn Around Time. \n \nAdditional responsibilities: \n \n- Investigate traffic from very large scale bot attacks.  \n- Transition large aspects of the workflow to the team in Dublin, Ireland. \n- Experimented with a proactive workflow based on advertiser vertical. AdSpam Analyst (Product Quality Operations) Google January 2008  –  April 2010  (2 years 4 months) Hyderabad Area, India Core responsibilities: \n \n- Review click traffic for invalid click activity for AdWords advertisers \n- Investigate large scale botnets generating invalid click traffic on Google ad networks \n \nAdditional responsibilities: \n \n- Handle all one-off investigations and escalations, including alerts from external traffic click tracking companies. \n- Train and ramp up peers in Dublin, Ireland.  \n- Own a manual blacklisting process. AdSpam Analyst (Product Quality Operations) Google January 2008  –  April 2010  (2 years 4 months) Hyderabad Area, India Core responsibilities: \n \n- Review click traffic for invalid click activity for AdWords advertisers \n- Investigate large scale botnets generating invalid click traffic on Google ad networks \n \nAdditional responsibilities: \n \n- Handle all one-off investigations and escalations, including alerts from external traffic click tracking companies. \n- Train and ramp up peers in Dublin, Ireland.  \n- Own a manual blacklisting process. AdWords Strategist Google August 2006  –  January 2008  (1 year 6 months) Hyderabad Area, India Core responsibilities: \n \n- Provide email based support for AdWords advertisers. \n- Spent two quarters as an Analytics Guru, offering Analytics support to top tier AdWords advertisers. \n \nAdditional responsibilities: \n- Introduced several procedural and structural improvements to the process. \n- Mentoring and ad hoc training support for newbies on the team. AdWords Strategist Google August 2006  –  January 2008  (1 year 6 months) Hyderabad Area, India Core responsibilities: \n \n- Provide email based support for AdWords advertisers. \n- Spent two quarters as an Analytics Guru, offering Analytics support to top tier AdWords advertisers. \n \nAdditional responsibilities: \n- Introduced several procedural and structural improvements to the process. \n- Mentoring and ad hoc training support for newbies on the team. AdWords Representative Google March 2005  –  August 2006  (1 year 6 months) Review AdWords ads for compliance with AdWords policies. Supported Top Tier and Direct advertisers. AdWords Representative Google March 2005  –  August 2006  (1 year 6 months) Review AdWords ads for compliance with AdWords policies. Supported Top Tier and Direct advertisers. Consultant Human Resource Specialists September 2004  –  February 2005  (6 months) Hyderabad Area, India Source and recruit candidates for ITES companies in Hyderabad, Gurgaon, and Bangalore. Consultant Human Resource Specialists September 2004  –  February 2005  (6 months) Hyderabad Area, India Source and recruit candidates for ITES companies in Hyderabad, Gurgaon, and Bangalore. Skills 7 Google Adwords 6 Team Leadership 6 Analytics 4 Web Analytics 2 Google Analytics 2 PPC 2 Mobile Advertising 1 Online Advertising 1 E-commerce Skills  7 Google Adwords 6 Team Leadership 6 Analytics 4 Web Analytics 2 Google Analytics 2 PPC 2 Mobile Advertising 1 Online Advertising 1 E-commerce 7 Google Adwords 6 Team Leadership 6 Analytics 4 Web Analytics 2 Google Analytics 2 PPC 2 Mobile Advertising 1 Online Advertising 1 E-commerce 7 Google Adwords 6 Team Leadership 6 Analytics 4 Web Analytics 2 Google Analytics 2 PPC 2 Mobile Advertising 1 Online Advertising 1 E-commerce                   Education Osmania University Osmania University Osmania University Osmania University ", "Experience Search Expert Google January 2014  – Present (1 year 7 months) San Francisco Bay Area Product and Solution Specialist Google January 2012  –  December 2013  (2 years) São Paulo Area, Brazil Display Specialist Google July 2011  –  January 2012  (7 months) São Paulo Area, Brazil •\tProvide specialized consultancy to account managers, advertisers and industry partners, including troubleshooting customer problems and developing solutions. \n•\tImplement creative ways to improve the relationship with clients and the success of their Google AdWords campaigns \n•\tCreate and Optimize Text & Display campaigns for priority advertisers \n•\tTrain internal and external parties on industry best practices and products \n•\tCollaborate with Product and Engineer team members on new features and products development. Senior Account Strategist Google September 2009  –  July 2011  (1 year 11 months) •\tDeveloped expertise in Retail industry during three quarters of work as well as advanced knowledge of BIM and Entertainment industries \n•\tPromoted in Q211 \n•\tAs a Strategist, pitch, develop and optimize many of the biggest Google AdWords accounts in Brazil’s Portfolio \n•\tEvangelize the Google Display Network (GDN) internally as the Display Guru. Work with all teams developing GDN pitches, helped strategists creating and optimizing GDN campaigns. \n•\tTrain all new hires on Optimization, Campaign Strategies and tools. Give specific trainings for new Strategists. Account Associate Google October 2008  –  September 2009  (1 year) •\tDedicated support and consultancy of Google AdWords \n•\tResponsible for optimizing the accounts of top clients in portfolio \n•\tDeep knowledge of all Google Advertising products. AdWords Representative Google February 2008  –  October 2008  (9 months) •\tClient support over phone, email and chat.  \n•\tResponsible for a large portfolio of medium and small business. Freelancer photographer Freelancer May 2007  –  January 2008  (9 months) ●\tClient acquisition  \n●\tPhotography for advertising campaigns and editorial publications. Studio Coordinator Studio Marcio Scavone December 2005  –  May 2007  (1 year 6 months) ●\tCoordination and production of photo shoots for advertising campaings and editorial publications. \n●\tPlanning and management of the studio. \n●\tCustomer service. \n●\tPrice quoting and purchasing. Owner-Associate Olho de Peixe Photo Studio July 2003  –  December 2005  (2 years 6 months) ●\tStrategic planning of the studio. \n●\tNew clients prospection.  \n●\tCustomer service. \n●\tPhotography for advertising campaigns. Art Director Doisnovemeia Publicidade July 2002  –  July 2003  (1 year 1 month) ●\tDesign of advertising campaigns and graphic design pieces. \n●\tOrganization of marketing and advertising events. Search Expert Google January 2014  – Present (1 year 7 months) San Francisco Bay Area Search Expert Google January 2014  – Present (1 year 7 months) San Francisco Bay Area Product and Solution Specialist Google January 2012  –  December 2013  (2 years) São Paulo Area, Brazil Product and Solution Specialist Google January 2012  –  December 2013  (2 years) São Paulo Area, Brazil Display Specialist Google July 2011  –  January 2012  (7 months) São Paulo Area, Brazil •\tProvide specialized consultancy to account managers, advertisers and industry partners, including troubleshooting customer problems and developing solutions. \n•\tImplement creative ways to improve the relationship with clients and the success of their Google AdWords campaigns \n•\tCreate and Optimize Text & Display campaigns for priority advertisers \n•\tTrain internal and external parties on industry best practices and products \n•\tCollaborate with Product and Engineer team members on new features and products development. Display Specialist Google July 2011  –  January 2012  (7 months) São Paulo Area, Brazil •\tProvide specialized consultancy to account managers, advertisers and industry partners, including troubleshooting customer problems and developing solutions. \n•\tImplement creative ways to improve the relationship with clients and the success of their Google AdWords campaigns \n•\tCreate and Optimize Text & Display campaigns for priority advertisers \n•\tTrain internal and external parties on industry best practices and products \n•\tCollaborate with Product and Engineer team members on new features and products development. Senior Account Strategist Google September 2009  –  July 2011  (1 year 11 months) •\tDeveloped expertise in Retail industry during three quarters of work as well as advanced knowledge of BIM and Entertainment industries \n•\tPromoted in Q211 \n•\tAs a Strategist, pitch, develop and optimize many of the biggest Google AdWords accounts in Brazil’s Portfolio \n•\tEvangelize the Google Display Network (GDN) internally as the Display Guru. Work with all teams developing GDN pitches, helped strategists creating and optimizing GDN campaigns. \n•\tTrain all new hires on Optimization, Campaign Strategies and tools. Give specific trainings for new Strategists. Senior Account Strategist Google September 2009  –  July 2011  (1 year 11 months) •\tDeveloped expertise in Retail industry during three quarters of work as well as advanced knowledge of BIM and Entertainment industries \n•\tPromoted in Q211 \n•\tAs a Strategist, pitch, develop and optimize many of the biggest Google AdWords accounts in Brazil’s Portfolio \n•\tEvangelize the Google Display Network (GDN) internally as the Display Guru. Work with all teams developing GDN pitches, helped strategists creating and optimizing GDN campaigns. \n•\tTrain all new hires on Optimization, Campaign Strategies and tools. Give specific trainings for new Strategists. Account Associate Google October 2008  –  September 2009  (1 year) •\tDedicated support and consultancy of Google AdWords \n•\tResponsible for optimizing the accounts of top clients in portfolio \n•\tDeep knowledge of all Google Advertising products. Account Associate Google October 2008  –  September 2009  (1 year) •\tDedicated support and consultancy of Google AdWords \n•\tResponsible for optimizing the accounts of top clients in portfolio \n•\tDeep knowledge of all Google Advertising products. AdWords Representative Google February 2008  –  October 2008  (9 months) •\tClient support over phone, email and chat.  \n•\tResponsible for a large portfolio of medium and small business. AdWords Representative Google February 2008  –  October 2008  (9 months) •\tClient support over phone, email and chat.  \n•\tResponsible for a large portfolio of medium and small business. Freelancer photographer Freelancer May 2007  –  January 2008  (9 months) ●\tClient acquisition  \n●\tPhotography for advertising campaigns and editorial publications. Freelancer photographer Freelancer May 2007  –  January 2008  (9 months) ●\tClient acquisition  \n●\tPhotography for advertising campaigns and editorial publications. Studio Coordinator Studio Marcio Scavone December 2005  –  May 2007  (1 year 6 months) ●\tCoordination and production of photo shoots for advertising campaings and editorial publications. \n●\tPlanning and management of the studio. \n●\tCustomer service. \n●\tPrice quoting and purchasing. Studio Coordinator Studio Marcio Scavone December 2005  –  May 2007  (1 year 6 months) ●\tCoordination and production of photo shoots for advertising campaings and editorial publications. \n●\tPlanning and management of the studio. \n●\tCustomer service. \n●\tPrice quoting and purchasing. Owner-Associate Olho de Peixe Photo Studio July 2003  –  December 2005  (2 years 6 months) ●\tStrategic planning of the studio. \n●\tNew clients prospection.  \n●\tCustomer service. \n●\tPhotography for advertising campaigns. Owner-Associate Olho de Peixe Photo Studio July 2003  –  December 2005  (2 years 6 months) ●\tStrategic planning of the studio. \n●\tNew clients prospection.  \n●\tCustomer service. \n●\tPhotography for advertising campaigns. Art Director Doisnovemeia Publicidade July 2002  –  July 2003  (1 year 1 month) ●\tDesign of advertising campaigns and graphic design pieces. \n●\tOrganization of marketing and advertising events. Art Director Doisnovemeia Publicidade July 2002  –  July 2003  (1 year 1 month) ●\tDesign of advertising campaigns and graphic design pieces. \n●\tOrganization of marketing and advertising events. Skills Top Skills 61 Google Adwords 31 Advertising 31 Online Advertising 23 Google Analytics 21 SEM 17 Display Advertising 13 Online Marketing 12 Digital Marketing 11 Web Analytics 8 Digital Strategy Alexandre also knows about... 7 Social Media 7 Management 6 Mobile Marketing 5 Digital Media 4 Graphic Design 4 Analytics 4 SEO 4 Customer Acquisition 2 New Media 1 Project Management 1 Photography 0 Photoshop Skills  Top Skills 61 Google Adwords 31 Advertising 31 Online Advertising 23 Google Analytics 21 SEM 17 Display Advertising 13 Online Marketing 12 Digital Marketing 11 Web Analytics 8 Digital Strategy Alexandre also knows about... 7 Social Media 7 Management 6 Mobile Marketing 5 Digital Media 4 Graphic Design 4 Analytics 4 SEO 4 Customer Acquisition 2 New Media 1 Project Management 1 Photography 0 Photoshop Top Skills 61 Google Adwords 31 Advertising 31 Online Advertising 23 Google Analytics 21 SEM 17 Display Advertising 13 Online Marketing 12 Digital Marketing 11 Web Analytics 8 Digital Strategy Alexandre also knows about... 7 Social Media 7 Management 6 Mobile Marketing 5 Digital Media 4 Graphic Design 4 Analytics 4 SEO 4 Customer Acquisition 2 New Media 1 Project Management 1 Photography 0 Photoshop Top Skills 61 Google Adwords 31 Advertising 31 Online Advertising 23 Google Analytics 21 SEM 17 Display Advertising 13 Online Marketing 12 Digital Marketing 11 Web Analytics 8 Digital Strategy Alexandre also knows about... 7 Social Media 7 Management 6 Mobile Marketing 5 Digital Media 4 Graphic Design 4 Analytics 4 SEO 4 Customer Acquisition 2 New Media 1 Project Management 1 Photography 0 Photoshop                     7 Social Media 7 Management 6 Mobile Marketing 5 Digital Media 4 Graphic Design 4 Analytics 4 SEO 4 Customer Acquisition 2 New Media 1 Project Management 1 Photography 0 Photoshop Education Universidade de Brasília Bachelor,  Communications - Advertising 2001  – 2005 Universidade de Brasília Bachelor,  Communications - Advertising 2001  – 2005 Universidade de Brasília Bachelor,  Communications - Advertising 2001  – 2005 Universidade de Brasília Bachelor,  Communications - Advertising 2001  – 2005 ", "Experience Agency Development Manager Google July 2014  – Present (1 year 1 month) Sydney Area, Australia Agency Account Manager, AUNZ Google January 2014  –  June 2014  (6 months) Sydney Area, Australia Agency Account Manager, AUNZ Google April 2013  –  December 2013  (9 months) Hyderabad Area, India Account Manager Google September 2011  –  March 2013  (1 year 7 months) Account Planner Google April 2010  –  September 2011  (1 year 6 months) Recruiter Google July 2009  –  March 2010  (9 months) AdWords Representative Google June 2008  –  June 2009  (1 year 1 month) Agency Development Manager Google July 2014  – Present (1 year 1 month) Sydney Area, Australia Agency Development Manager Google July 2014  – Present (1 year 1 month) Sydney Area, Australia Agency Account Manager, AUNZ Google January 2014  –  June 2014  (6 months) Sydney Area, Australia Agency Account Manager, AUNZ Google January 2014  –  June 2014  (6 months) Sydney Area, Australia Agency Account Manager, AUNZ Google April 2013  –  December 2013  (9 months) Hyderabad Area, India Agency Account Manager, AUNZ Google April 2013  –  December 2013  (9 months) Hyderabad Area, India Account Manager Google September 2011  –  March 2013  (1 year 7 months) Account Manager Google September 2011  –  March 2013  (1 year 7 months) Account Planner Google April 2010  –  September 2011  (1 year 6 months) Account Planner Google April 2010  –  September 2011  (1 year 6 months) Recruiter Google July 2009  –  March 2010  (9 months) Recruiter Google July 2009  –  March 2010  (9 months) AdWords Representative Google June 2008  –  June 2009  (1 year 1 month) AdWords Representative Google June 2008  –  June 2009  (1 year 1 month) Skills Top Skills 27 Google Adwords 15 Online Advertising 11 Search Advertising 9 Google Analytics 8 Digital Marketing 7 Display Advertising 4 SEM 4 Mobile Advertising 4 Mobile Marketing 2 Online Marketing Arun also knows about... 1 PPC 1 Conversion Optimization 0 YouTube 0 E-commerce 0 SEO 0 Ad Networks Skills  Top Skills 27 Google Adwords 15 Online Advertising 11 Search Advertising 9 Google Analytics 8 Digital Marketing 7 Display Advertising 4 SEM 4 Mobile Advertising 4 Mobile Marketing 2 Online Marketing Arun also knows about... 1 PPC 1 Conversion Optimization 0 YouTube 0 E-commerce 0 SEO 0 Ad Networks Top Skills 27 Google Adwords 15 Online Advertising 11 Search Advertising 9 Google Analytics 8 Digital Marketing 7 Display Advertising 4 SEM 4 Mobile Advertising 4 Mobile Marketing 2 Online Marketing Arun also knows about... 1 PPC 1 Conversion Optimization 0 YouTube 0 E-commerce 0 SEO 0 Ad Networks Top Skills 27 Google Adwords 15 Online Advertising 11 Search Advertising 9 Google Analytics 8 Digital Marketing 7 Display Advertising 4 SEM 4 Mobile Advertising 4 Mobile Marketing 2 Online Marketing Arun also knows about... 1 PPC 1 Conversion Optimization 0 YouTube 0 E-commerce 0 SEO 0 Ad Networks                     1 PPC 1 Conversion Optimization 0 YouTube 0 E-commerce 0 SEO 0 Ad Networks Education Loyola College, Chennai Bachelor of Commerce (B.Com.) 2005  – 2008 St.John's, Chennai Loyola College, Chennai Bachelor of Commerce (B.Com.) 2005  – 2008 Loyola College, Chennai Bachelor of Commerce (B.Com.) 2005  – 2008 Loyola College, Chennai Bachelor of Commerce (B.Com.) 2005  – 2008 St.John's, Chennai St.John's, Chennai St.John's, Chennai ", "Experience Strategist, Product Quality Operations Google October 2011  – Present (3 years 10 months) Hyderabad Area, India Business Analyst Google January 2010  –  February 2012  (2 years 2 months) Support Engineer, Ad Traffic Quality Google October 2008  –  January 2010  (1 year 4 months) Develop algorithms and techniques to identify click fraud patterns. \n* Evolve and maintain Google's automated systems for invalid click detection and elimination. \n* Synthesize recommendations that maintain the high quality of Google's advertising network and products. \n* Provide technical support for internal and external clients. Ad Traffic Quality Specialist Google January 2008  –  September 2008  (9 months) Quality Analyst, Approval Bin Google January 2007  –  December 2007  (1 year) AdWords Representative Google July 2006  –  December 2006  (6 months) Strategist, Product Quality Operations Google October 2011  – Present (3 years 10 months) Hyderabad Area, India Strategist, Product Quality Operations Google October 2011  – Present (3 years 10 months) Hyderabad Area, India Business Analyst Google January 2010  –  February 2012  (2 years 2 months) Business Analyst Google January 2010  –  February 2012  (2 years 2 months) Support Engineer, Ad Traffic Quality Google October 2008  –  January 2010  (1 year 4 months) Develop algorithms and techniques to identify click fraud patterns. \n* Evolve and maintain Google's automated systems for invalid click detection and elimination. \n* Synthesize recommendations that maintain the high quality of Google's advertising network and products. \n* Provide technical support for internal and external clients. Support Engineer, Ad Traffic Quality Google October 2008  –  January 2010  (1 year 4 months) Develop algorithms and techniques to identify click fraud patterns. \n* Evolve and maintain Google's automated systems for invalid click detection and elimination. \n* Synthesize recommendations that maintain the high quality of Google's advertising network and products. \n* Provide technical support for internal and external clients. Ad Traffic Quality Specialist Google January 2008  –  September 2008  (9 months) Ad Traffic Quality Specialist Google January 2008  –  September 2008  (9 months) Quality Analyst, Approval Bin Google January 2007  –  December 2007  (1 year) Quality Analyst, Approval Bin Google January 2007  –  December 2007  (1 year) AdWords Representative Google July 2006  –  December 2006  (6 months) AdWords Representative Google July 2006  –  December 2006  (6 months) Skills Top Skills 10 Python 8 MySQL 8 Google Adwords 7 Web Analytics 6 Adsense 5 PPC 5 E-commerce 5 Analytics 4 SQL 4 Google Analytics Sundeep also knows about... 3 Google+ 3 Spamassassin 3 Search Advertising 2 Algorithms 2 Web Development 2 Scrum 2 SEO 2 User Experience 2 SEM 1 Online Fraud... 1 Agile Methodologies 1 Advertising 1 Web Applications 1 Mobile Applications 1 Mobile Advertising 1 Display Advertising 1 CMS 1 Mobile Marketing 1 Distributed Systems 1 Usability 1 Google Webmaster Tools 0 Google Adsense See 7+     See less Skills  Top Skills 10 Python 8 MySQL 8 Google Adwords 7 Web Analytics 6 Adsense 5 PPC 5 E-commerce 5 Analytics 4 SQL 4 Google Analytics Sundeep also knows about... 3 Google+ 3 Spamassassin 3 Search Advertising 2 Algorithms 2 Web Development 2 Scrum 2 SEO 2 User Experience 2 SEM 1 Online Fraud... 1 Agile Methodologies 1 Advertising 1 Web Applications 1 Mobile Applications 1 Mobile Advertising 1 Display Advertising 1 CMS 1 Mobile Marketing 1 Distributed Systems 1 Usability 1 Google Webmaster Tools 0 Google Adsense See 7+     See less Top Skills 10 Python 8 MySQL 8 Google Adwords 7 Web Analytics 6 Adsense 5 PPC 5 E-commerce 5 Analytics 4 SQL 4 Google Analytics Sundeep also knows about... 3 Google+ 3 Spamassassin 3 Search Advertising 2 Algorithms 2 Web Development 2 Scrum 2 SEO 2 User Experience 2 SEM 1 Online Fraud... 1 Agile Methodologies 1 Advertising 1 Web Applications 1 Mobile Applications 1 Mobile Advertising 1 Display Advertising 1 CMS 1 Mobile Marketing 1 Distributed Systems 1 Usability 1 Google Webmaster Tools 0 Google Adsense See 7+     See less Top Skills 10 Python 8 MySQL 8 Google Adwords 7 Web Analytics 6 Adsense 5 PPC 5 E-commerce 5 Analytics 4 SQL 4 Google Analytics Sundeep also knows about... 3 Google+ 3 Spamassassin 3 Search Advertising 2 Algorithms 2 Web Development 2 Scrum 2 SEO 2 User Experience 2 SEM 1 Online Fraud... 1 Agile Methodologies 1 Advertising 1 Web Applications 1 Mobile Applications 1 Mobile Advertising 1 Display Advertising 1 CMS 1 Mobile Marketing 1 Distributed Systems 1 Usability 1 Google Webmaster Tools 0 Google Adsense See 7+     See less                     3 Google+ 3 Spamassassin 3 Search Advertising 2 Algorithms 2 Web Development 2 Scrum 2 SEO 2 User Experience 2 SEM 1 Online Fraud... 1 Agile Methodologies 1 Advertising 1 Web Applications 1 Mobile Applications 1 Mobile Advertising 1 Display Advertising 1 CMS 1 Mobile Marketing 1 Distributed Systems 1 Usability 1 Google Webmaster Tools 0 Google Adsense Education Osmania University MBA,  Major: Finance ,  Minor: HR 2004  – 2006 Jawaharlal Nehru Technological University BTech,  Mechanical Engg 2000  – 2004 Osmania University MBA,  Major: Finance ,  Minor: HR 2004  – 2006 Osmania University MBA,  Major: Finance ,  Minor: HR 2004  – 2006 Osmania University MBA,  Major: Finance ,  Minor: HR 2004  – 2006 Jawaharlal Nehru Technological University BTech,  Mechanical Engg 2000  – 2004 Jawaharlal Nehru Technological University BTech,  Mechanical Engg 2000  – 2004 Jawaharlal Nehru Technological University BTech,  Mechanical Engg 2000  – 2004 ", "Experience Manager, Strategic Partnerships Business Development Google July 2012  – Present (3 years 1 month) Greater New York City Area Sr. Account Manager, Strategic Partnerships Business Development Google April 2011  – Present (4 years 4 months) Yield management and optimization via AdSense and Ad Exchange for the publishing vertical. Sr. Analytical Lead Google May 2010  –  April 2011  (1 year) Data analysis, account strategy and optimization for Entertainment and Media vertical. Account Strategist Google November 2007  –  May 2010  (2 years 7 months) Account strategy and optimization for Entertainment & Media clients. Associate Account Strategist Google April 2006  –  November 2007  (1 year 8 months) Account strategy and optimization for Entertainment & Media clients. AdWords Coordinator Google June 2004  –  April 2006  (1 year 11 months) Account Management and email and phone support for AdWords advertisers. AdWords Representative Google October 2003  –  June 2004  (9 months) Policy and editorial review for incoming AdWords advertisements. Manager, Strategic Partnerships Business Development Google July 2012  – Present (3 years 1 month) Greater New York City Area Manager, Strategic Partnerships Business Development Google July 2012  – Present (3 years 1 month) Greater New York City Area Sr. Account Manager, Strategic Partnerships Business Development Google April 2011  – Present (4 years 4 months) Yield management and optimization via AdSense and Ad Exchange for the publishing vertical. Sr. Account Manager, Strategic Partnerships Business Development Google April 2011  – Present (4 years 4 months) Yield management and optimization via AdSense and Ad Exchange for the publishing vertical. Sr. Analytical Lead Google May 2010  –  April 2011  (1 year) Data analysis, account strategy and optimization for Entertainment and Media vertical. Sr. Analytical Lead Google May 2010  –  April 2011  (1 year) Data analysis, account strategy and optimization for Entertainment and Media vertical. Account Strategist Google November 2007  –  May 2010  (2 years 7 months) Account strategy and optimization for Entertainment & Media clients. Account Strategist Google November 2007  –  May 2010  (2 years 7 months) Account strategy and optimization for Entertainment & Media clients. Associate Account Strategist Google April 2006  –  November 2007  (1 year 8 months) Account strategy and optimization for Entertainment & Media clients. Associate Account Strategist Google April 2006  –  November 2007  (1 year 8 months) Account strategy and optimization for Entertainment & Media clients. AdWords Coordinator Google June 2004  –  April 2006  (1 year 11 months) Account Management and email and phone support for AdWords advertisers. AdWords Coordinator Google June 2004  –  April 2006  (1 year 11 months) Account Management and email and phone support for AdWords advertisers. AdWords Representative Google October 2003  –  June 2004  (9 months) Policy and editorial review for incoming AdWords advertisements. AdWords Representative Google October 2003  –  June 2004  (9 months) Policy and editorial review for incoming AdWords advertisements. Skills Top Skills 10 Google Adwords 5 Online Advertising 4 Advertising 3 Web Analytics 2 Account Management 1 SEM 1 Strategy 0 AdSense 0 DoubleClick Ad Exchange 0 Excel Kate also knows about... 0 Google Analytics Skills  Top Skills 10 Google Adwords 5 Online Advertising 4 Advertising 3 Web Analytics 2 Account Management 1 SEM 1 Strategy 0 AdSense 0 DoubleClick Ad Exchange 0 Excel Kate also knows about... 0 Google Analytics Top Skills 10 Google Adwords 5 Online Advertising 4 Advertising 3 Web Analytics 2 Account Management 1 SEM 1 Strategy 0 AdSense 0 DoubleClick Ad Exchange 0 Excel Kate also knows about... 0 Google Analytics Top Skills 10 Google Adwords 5 Online Advertising 4 Advertising 3 Web Analytics 2 Account Management 1 SEM 1 Strategy 0 AdSense 0 DoubleClick Ad Exchange 0 Excel Kate also knows about... 0 Google Analytics                     0 Google Analytics Education University of Connecticut BA,  English 1999  – 2003 Activities and Societies:  Women's Rowing Team Liverpool High School 1995  – 1999 University of Connecticut BA,  English 1999  – 2003 Activities and Societies:  Women's Rowing Team University of Connecticut BA,  English 1999  – 2003 Activities and Societies:  Women's Rowing Team University of Connecticut BA,  English 1999  – 2003 Activities and Societies:  Women's Rowing Team Liverpool High School 1995  – 1999 Liverpool High School 1995  – 1999 Liverpool High School 1995  – 1999 ", "Summary PhD pursuing professional with 8+ years of varied experience across different industries and roles including Internet, academics, customer support, and business analysis. \n \nCareer Objective: To gain a wide range of experience in the field of Management-Science with innovative corporate houses which will help me use my expertise in the area of research that can help develop the learning methodology at Management/Business schools. Summary PhD pursuing professional with 8+ years of varied experience across different industries and roles including Internet, academics, customer support, and business analysis. \n \nCareer Objective: To gain a wide range of experience in the field of Management-Science with innovative corporate houses which will help me use my expertise in the area of research that can help develop the learning methodology at Management/Business schools. PhD pursuing professional with 8+ years of varied experience across different industries and roles including Internet, academics, customer support, and business analysis. \n \nCareer Objective: To gain a wide range of experience in the field of Management-Science with innovative corporate houses which will help me use my expertise in the area of research that can help develop the learning methodology at Management/Business schools. PhD pursuing professional with 8+ years of varied experience across different industries and roles including Internet, academics, customer support, and business analysis. \n \nCareer Objective: To gain a wide range of experience in the field of Management-Science with innovative corporate houses which will help me use my expertise in the area of research that can help develop the learning methodology at Management/Business schools. Experience Risk Operations Analyst Google August 2012  – Present (3 years) Hyderabad As a part of the Risk operations world, I play the role of a online fraud fighter. My job involves catching online fraudsters - buyers and merchants who use Google Checkout for carrying out fraudulent transactions. Detecting fraud signals and analyzing trends to reduce loss for Google and users is what my core job involves. User Operations Specialist Google January 2011  –  July 2012  (1 year 7 months) Hyderabad Under this role, I got the opportunity to work on end-user operations for 3 different products – Google Checkout, Google Offers, and Google Books. Supporting user queries, analyzing feedback statistics, and product improvisation were the main aspects of my role. For Google Offers I also worked on setting up policies and review process in place for the newly launched product. And most recently, with Google Books, I have been working on books quality improvement process. Training Specialist Google July 2009  –  December 2010  (1 year 6 months) Hyderabad I was the single point of contact for all training related activities for the online sales team for over a year. Delivering and managing training programs for new hires in sales and up-skilling of existing team members was my core responsibility. Training programs that I’ve handled include account optimization, account analysis, account management, new hire orientation, and MS Excel up-skilling. Account Manager Google January 2009  –  June 2009  (6 months) Hyderabad As an Account Manager, I handled a book of business of ~60 clients and was responsible for driving revenue of ~$5M every quarter. My main responsibility was driving revenue for my book of business; secondary goals that helped in driving it included account penetration, pitching optimizations, cross/up selling, answering reactive emails, and proactive opportunity identification. (Open) 1 recommendation Chetan Joshi Digital Nomad | Independent Consultant | Volunteer I have worked with Lalita as we were on the same team in the Online Sales organization at Google. Lalita was responsible for handling various advertiser accounts based in North America. As an account manager, she managed a huge portfolio of clients... View Account Analyst Google November 2007  –  December 2008  (1 year 2 months) Hyderabad As an Account Analyst, I was responsible for identifying growth potential in advertiser accounts, analyze account performance, and report statistics. I also handled other responsibilities like account analysis training and industry analysis. I was also the workflow lead and quality assessor for ~20 people. AdWords Representative Google August 2006  –  October 2007  (1 year 3 months) Hyderabad Primary responsibilities include ad approvals, advertiser support through emails, advertiser account analysis, quality reviews of CSRs. Secondary activities include conducting training sessions, mentoring programs, and inductions for new employees. Marketing Faculty & Personality Development Coach Al-Ameer College of Engineering & IT November 2005  –  July 2006  (9 months) Visakhapatnam Responsibilities include teaching Marketing subjects, developing and conducting management games and workshops, imparting soft skills training and coordinating placement activities. Business Planner TVS-Electronics July 2004  –  July 2005  (1 year 1 month) Chennai Responsibilities included data crunching, making analytical observations for marketing strategies, initiating innovative marketing practices, taking measures for repeat and referral sales, conducting sales training program schedules and providing data inputs to the Channels. Area Sales Manager TVS-Electronics April 2004  –  June 2004  (3 months) Pune Was responsible for sales quota deployment and target achievement at all three levels of the Channel architecture. Freelancer All India Radio 1997  –  2002  (5 years) Visakhapatnam Composed short stories and poems and voiced them for programmes on yuva-vani (youth channel). Risk Operations Analyst Google August 2012  – Present (3 years) Hyderabad As a part of the Risk operations world, I play the role of a online fraud fighter. My job involves catching online fraudsters - buyers and merchants who use Google Checkout for carrying out fraudulent transactions. Detecting fraud signals and analyzing trends to reduce loss for Google and users is what my core job involves. Risk Operations Analyst Google August 2012  – Present (3 years) Hyderabad As a part of the Risk operations world, I play the role of a online fraud fighter. My job involves catching online fraudsters - buyers and merchants who use Google Checkout for carrying out fraudulent transactions. Detecting fraud signals and analyzing trends to reduce loss for Google and users is what my core job involves. User Operations Specialist Google January 2011  –  July 2012  (1 year 7 months) Hyderabad Under this role, I got the opportunity to work on end-user operations for 3 different products – Google Checkout, Google Offers, and Google Books. Supporting user queries, analyzing feedback statistics, and product improvisation were the main aspects of my role. For Google Offers I also worked on setting up policies and review process in place for the newly launched product. And most recently, with Google Books, I have been working on books quality improvement process. User Operations Specialist Google January 2011  –  July 2012  (1 year 7 months) Hyderabad Under this role, I got the opportunity to work on end-user operations for 3 different products – Google Checkout, Google Offers, and Google Books. Supporting user queries, analyzing feedback statistics, and product improvisation were the main aspects of my role. For Google Offers I also worked on setting up policies and review process in place for the newly launched product. And most recently, with Google Books, I have been working on books quality improvement process. Training Specialist Google July 2009  –  December 2010  (1 year 6 months) Hyderabad I was the single point of contact for all training related activities for the online sales team for over a year. Delivering and managing training programs for new hires in sales and up-skilling of existing team members was my core responsibility. Training programs that I’ve handled include account optimization, account analysis, account management, new hire orientation, and MS Excel up-skilling. Training Specialist Google July 2009  –  December 2010  (1 year 6 months) Hyderabad I was the single point of contact for all training related activities for the online sales team for over a year. Delivering and managing training programs for new hires in sales and up-skilling of existing team members was my core responsibility. Training programs that I’ve handled include account optimization, account analysis, account management, new hire orientation, and MS Excel up-skilling. Account Manager Google January 2009  –  June 2009  (6 months) Hyderabad As an Account Manager, I handled a book of business of ~60 clients and was responsible for driving revenue of ~$5M every quarter. My main responsibility was driving revenue for my book of business; secondary goals that helped in driving it included account penetration, pitching optimizations, cross/up selling, answering reactive emails, and proactive opportunity identification. (Open) 1 recommendation Chetan Joshi Digital Nomad | Independent Consultant | Volunteer I have worked with Lalita as we were on the same team in the Online Sales organization at Google. Lalita was responsible for handling various advertiser accounts based in North America. As an account manager, she managed a huge portfolio of clients... View Account Manager Google January 2009  –  June 2009  (6 months) Hyderabad As an Account Manager, I handled a book of business of ~60 clients and was responsible for driving revenue of ~$5M every quarter. My main responsibility was driving revenue for my book of business; secondary goals that helped in driving it included account penetration, pitching optimizations, cross/up selling, answering reactive emails, and proactive opportunity identification. (Open) 1 recommendation Chetan Joshi Digital Nomad | Independent Consultant | Volunteer I have worked with Lalita as we were on the same team in the Online Sales organization at Google. Lalita was responsible for handling various advertiser accounts based in North America. As an account manager, she managed a huge portfolio of clients... View Account Analyst Google November 2007  –  December 2008  (1 year 2 months) Hyderabad As an Account Analyst, I was responsible for identifying growth potential in advertiser accounts, analyze account performance, and report statistics. I also handled other responsibilities like account analysis training and industry analysis. I was also the workflow lead and quality assessor for ~20 people. Account Analyst Google November 2007  –  December 2008  (1 year 2 months) Hyderabad As an Account Analyst, I was responsible for identifying growth potential in advertiser accounts, analyze account performance, and report statistics. I also handled other responsibilities like account analysis training and industry analysis. I was also the workflow lead and quality assessor for ~20 people. AdWords Representative Google August 2006  –  October 2007  (1 year 3 months) Hyderabad Primary responsibilities include ad approvals, advertiser support through emails, advertiser account analysis, quality reviews of CSRs. Secondary activities include conducting training sessions, mentoring programs, and inductions for new employees. AdWords Representative Google August 2006  –  October 2007  (1 year 3 months) Hyderabad Primary responsibilities include ad approvals, advertiser support through emails, advertiser account analysis, quality reviews of CSRs. Secondary activities include conducting training sessions, mentoring programs, and inductions for new employees. Marketing Faculty & Personality Development Coach Al-Ameer College of Engineering & IT November 2005  –  July 2006  (9 months) Visakhapatnam Responsibilities include teaching Marketing subjects, developing and conducting management games and workshops, imparting soft skills training and coordinating placement activities. Marketing Faculty & Personality Development Coach Al-Ameer College of Engineering & IT November 2005  –  July 2006  (9 months) Visakhapatnam Responsibilities include teaching Marketing subjects, developing and conducting management games and workshops, imparting soft skills training and coordinating placement activities. Business Planner TVS-Electronics July 2004  –  July 2005  (1 year 1 month) Chennai Responsibilities included data crunching, making analytical observations for marketing strategies, initiating innovative marketing practices, taking measures for repeat and referral sales, conducting sales training program schedules and providing data inputs to the Channels. Business Planner TVS-Electronics July 2004  –  July 2005  (1 year 1 month) Chennai Responsibilities included data crunching, making analytical observations for marketing strategies, initiating innovative marketing practices, taking measures for repeat and referral sales, conducting sales training program schedules and providing data inputs to the Channels. Area Sales Manager TVS-Electronics April 2004  –  June 2004  (3 months) Pune Was responsible for sales quota deployment and target achievement at all three levels of the Channel architecture. Area Sales Manager TVS-Electronics April 2004  –  June 2004  (3 months) Pune Was responsible for sales quota deployment and target achievement at all three levels of the Channel architecture. Freelancer All India Radio 1997  –  2002  (5 years) Visakhapatnam Composed short stories and poems and voiced them for programmes on yuva-vani (youth channel). Freelancer All India Radio 1997  –  2002  (5 years) Visakhapatnam Composed short stories and poems and voiced them for programmes on yuva-vani (youth channel). Languages English Full professional proficiency Hindi Native or bilingual proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Telugu Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 11 Training 9 Business Analysis 7 Project Management 7 Sales Management 6 Account Management 4 Business Planning 3 Marketing Strategy 3 Competitive Analysis 2 Quality Auditing 1 Internal Communications Lalita also knows about... 1 E-commerce 1 Google Adwords 0 Training Skills Skills  Top Skills 11 Training 9 Business Analysis 7 Project Management 7 Sales Management 6 Account Management 4 Business Planning 3 Marketing Strategy 3 Competitive Analysis 2 Quality Auditing 1 Internal Communications Lalita also knows about... 1 E-commerce 1 Google Adwords 0 Training Skills Top Skills 11 Training 9 Business Analysis 7 Project Management 7 Sales Management 6 Account Management 4 Business Planning 3 Marketing Strategy 3 Competitive Analysis 2 Quality Auditing 1 Internal Communications Lalita also knows about... 1 E-commerce 1 Google Adwords 0 Training Skills Top Skills 11 Training 9 Business Analysis 7 Project Management 7 Sales Management 6 Account Management 4 Business Planning 3 Marketing Strategy 3 Competitive Analysis 2 Quality Auditing 1 Internal Communications Lalita also knows about... 1 E-commerce 1 Google Adwords 0 Training Skills                     1 E-commerce 1 Google Adwords 0 Training Skills Education GITAM University Research Doctorate,  Advertising 2011  – 2014 (Topic – Elements of Advertising influencing children and influence of children on Decision Making) Amrita School of Business Master of Business Administration (MBA),  Marketing & HR , 7.37 CGPA 2002  – 2004 Internship with Media Analyst for Media-Arc Pvt. Ltd., New Delhi (April’03 to June’03) - Undertook media analysis of radio services during MBA internship, with live radio recording, scripting and voicing experience. (Open) 1 recommendation George Kuriakose Director at Samira Chemicals Pvt. Ltd. I studied with Lalita and worked with her (with 4 others) as part of the core group of the Marketing Forum during our 2 years at The Amrita School of Business.\nOur team worked more closely during the organising of ASB's B-school festival - Pragati.... View CMS-GITAM Bachelor of Business Management (BBM),  Business Administration and Management ,  General , 70.7% score 1999  – 2002 Won the Gold medal from Andhra University. (Open) 2 honors and awards Gold Medalist I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the... View Best All Rounder I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. View GITAM University Research Doctorate,  Advertising 2011  – 2014 (Topic – Elements of Advertising influencing children and influence of children on Decision Making) GITAM University Research Doctorate,  Advertising 2011  – 2014 (Topic – Elements of Advertising influencing children and influence of children on Decision Making) GITAM University Research Doctorate,  Advertising 2011  – 2014 (Topic – Elements of Advertising influencing children and influence of children on Decision Making) Amrita School of Business Master of Business Administration (MBA),  Marketing & HR , 7.37 CGPA 2002  – 2004 Internship with Media Analyst for Media-Arc Pvt. Ltd., New Delhi (April’03 to June’03) - Undertook media analysis of radio services during MBA internship, with live radio recording, scripting and voicing experience. (Open) 1 recommendation George Kuriakose Director at Samira Chemicals Pvt. Ltd. I studied with Lalita and worked with her (with 4 others) as part of the core group of the Marketing Forum during our 2 years at The Amrita School of Business.\nOur team worked more closely during the organising of ASB's B-school festival - Pragati.... View Amrita School of Business Master of Business Administration (MBA),  Marketing & HR , 7.37 CGPA 2002  – 2004 Internship with Media Analyst for Media-Arc Pvt. Ltd., New Delhi (April’03 to June’03) - Undertook media analysis of radio services during MBA internship, with live radio recording, scripting and voicing experience. (Open) 1 recommendation George Kuriakose Director at Samira Chemicals Pvt. Ltd. I studied with Lalita and worked with her (with 4 others) as part of the core group of the Marketing Forum during our 2 years at The Amrita School of Business.\nOur team worked more closely during the organising of ASB's B-school festival - Pragati.... View Amrita School of Business Master of Business Administration (MBA),  Marketing & HR , 7.37 CGPA 2002  – 2004 Internship with Media Analyst for Media-Arc Pvt. Ltd., New Delhi (April’03 to June’03) - Undertook media analysis of radio services during MBA internship, with live radio recording, scripting and voicing experience. (Open) 1 recommendation George Kuriakose Director at Samira Chemicals Pvt. Ltd. I studied with Lalita and worked with her (with 4 others) as part of the core group of the Marketing Forum during our 2 years at The Amrita School of Business.\nOur team worked more closely during the organising of ASB's B-school festival - Pragati.... View CMS-GITAM Bachelor of Business Management (BBM),  Business Administration and Management ,  General , 70.7% score 1999  – 2002 Won the Gold medal from Andhra University. (Open) 2 honors and awards Gold Medalist I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the... View Best All Rounder I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. View CMS-GITAM Bachelor of Business Management (BBM),  Business Administration and Management ,  General , 70.7% score 1999  – 2002 Won the Gold medal from Andhra University. (Open) 2 honors and awards Gold Medalist I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the... View Best All Rounder I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. View CMS-GITAM Bachelor of Business Management (BBM),  Business Administration and Management ,  General , 70.7% score 1999  – 2002 Won the Gold medal from Andhra University. (Open) 2 honors and awards Gold Medalist I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the... View Best All Rounder I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. View Honors & Awards Gold Medalist Andhra University March 2002 I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the academic year. Best All Rounder CMS-GITAM March 2002 I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. Gold Medalist Andhra University March 2002 I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the academic year. Gold Medalist Andhra University March 2002 I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the academic year. Gold Medalist Andhra University March 2002 I had the highest aggregate percentage during my graduation for which the University awarded me the gold medal for the academic year. Best All Rounder CMS-GITAM March 2002 I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. Best All Rounder CMS-GITAM March 2002 I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. Best All Rounder CMS-GITAM March 2002 I was recognized by the college as an all rounder in academic & extra curricular activities for the academic year. ", "Experience Senior Technical Writer Google December 2014  – Present (8 months) Technical Writer Google October 2010  –  November 2014  (4 years 2 months) Associate Editorial Manager Google October 2009  –  October 2010  (1 year 1 month) Senior Editor Google July 2007  –  October 2009  (2 years 4 months) Editor Google October 2004  –  July 2007  (2 years 10 months) AdWords Client Services Coordinator Google January 2004  –  October 2004  (10 months) AdWords Representative Google September 2003  –  January 2004  (5 months) Senior Technical Writer Google December 2014  – Present (8 months) Senior Technical Writer Google December 2014  – Present (8 months) Technical Writer Google October 2010  –  November 2014  (4 years 2 months) Technical Writer Google October 2010  –  November 2014  (4 years 2 months) Associate Editorial Manager Google October 2009  –  October 2010  (1 year 1 month) Associate Editorial Manager Google October 2009  –  October 2010  (1 year 1 month) Senior Editor Google July 2007  –  October 2009  (2 years 4 months) Senior Editor Google July 2007  –  October 2009  (2 years 4 months) Editor Google October 2004  –  July 2007  (2 years 10 months) Editor Google October 2004  –  July 2007  (2 years 10 months) AdWords Client Services Coordinator Google January 2004  –  October 2004  (10 months) AdWords Client Services Coordinator Google January 2004  –  October 2004  (10 months) AdWords Representative Google September 2003  –  January 2004  (5 months) AdWords Representative Google September 2003  –  January 2004  (5 months) Skills Skills     Education Stanford University BA,  Psychology 1999  – 2003 Stanford University BA,  Psychology 1999  – 2003 Stanford University BA,  Psychology 1999  – 2003 Stanford University BA,  Psychology 1999  – 2003 ", "Experience Head of Industry, Media & Entertainment Google, DoubleClick August 2014  – Present (1 year) San Francisco Oversee Media & Entertainment team in US to drive growth across all platform technologies for DoubleClick. DoubleClick Sales Manager at Google Google September 2012  –  August 2014  (2 years) San Francisco Manage a sales team dedicated to the growth of DoubleClick Digital Marketing with a specific focus on DoubleClick Bid Manager across key partners. New Business Lead, Invite Media Google July 2011  –  September 2012  (1 year 3 months) San Francisco Bay Area Driving new business for Invite Media, Google's DSP. \n \nGrew new business revenue contribution to the book of business managed revenue by 3x Account Executive, Google Consumer Packaged Goods Google December 2009  –  July 2011  (1 year 8 months) Greater Boston Area Creating compelling digital narratives for Consumer Packaged Goods companies using the Google suite of products.  \n \nFounded the CPG team in the Online Sales group at Google. Grew managed revenue to $100MM+ annually and grew the team from one person to 8 people. AdWords Account Strategist Google September 2007  –  January 2009  (1 year 5 months) Transferred to a new satellite office (Ann Arbor) to help start a training team and introductory account management team.  \n \nTransitioned to being the lead on an account management team focused on Retail advertisers.  \n \nTransferred again to Boston satellite office to start the training team in the office as the sales team was growing exponentially. AdWords Associate Google March 2006  –  September 2007  (1 year 7 months) Account management across Google's suite of advertising products for high potential advertisers. AdWords Representative Google 2005  –  2006  (1 year) Developed product and industry expertise Head of Industry, Media & Entertainment Google, DoubleClick August 2014  – Present (1 year) San Francisco Oversee Media & Entertainment team in US to drive growth across all platform technologies for DoubleClick. Head of Industry, Media & Entertainment Google, DoubleClick August 2014  – Present (1 year) San Francisco Oversee Media & Entertainment team in US to drive growth across all platform technologies for DoubleClick. DoubleClick Sales Manager at Google Google September 2012  –  August 2014  (2 years) San Francisco Manage a sales team dedicated to the growth of DoubleClick Digital Marketing with a specific focus on DoubleClick Bid Manager across key partners. DoubleClick Sales Manager at Google Google September 2012  –  August 2014  (2 years) San Francisco Manage a sales team dedicated to the growth of DoubleClick Digital Marketing with a specific focus on DoubleClick Bid Manager across key partners. New Business Lead, Invite Media Google July 2011  –  September 2012  (1 year 3 months) San Francisco Bay Area Driving new business for Invite Media, Google's DSP. \n \nGrew new business revenue contribution to the book of business managed revenue by 3x New Business Lead, Invite Media Google July 2011  –  September 2012  (1 year 3 months) San Francisco Bay Area Driving new business for Invite Media, Google's DSP. \n \nGrew new business revenue contribution to the book of business managed revenue by 3x Account Executive, Google Consumer Packaged Goods Google December 2009  –  July 2011  (1 year 8 months) Greater Boston Area Creating compelling digital narratives for Consumer Packaged Goods companies using the Google suite of products.  \n \nFounded the CPG team in the Online Sales group at Google. Grew managed revenue to $100MM+ annually and grew the team from one person to 8 people. Account Executive, Google Consumer Packaged Goods Google December 2009  –  July 2011  (1 year 8 months) Greater Boston Area Creating compelling digital narratives for Consumer Packaged Goods companies using the Google suite of products.  \n \nFounded the CPG team in the Online Sales group at Google. Grew managed revenue to $100MM+ annually and grew the team from one person to 8 people. AdWords Account Strategist Google September 2007  –  January 2009  (1 year 5 months) Transferred to a new satellite office (Ann Arbor) to help start a training team and introductory account management team.  \n \nTransitioned to being the lead on an account management team focused on Retail advertisers.  \n \nTransferred again to Boston satellite office to start the training team in the office as the sales team was growing exponentially. AdWords Account Strategist Google September 2007  –  January 2009  (1 year 5 months) Transferred to a new satellite office (Ann Arbor) to help start a training team and introductory account management team.  \n \nTransitioned to being the lead on an account management team focused on Retail advertisers.  \n \nTransferred again to Boston satellite office to start the training team in the office as the sales team was growing exponentially. AdWords Associate Google March 2006  –  September 2007  (1 year 7 months) Account management across Google's suite of advertising products for high potential advertisers. AdWords Associate Google March 2006  –  September 2007  (1 year 7 months) Account management across Google's suite of advertising products for high potential advertisers. AdWords Representative Google 2005  –  2006  (1 year) Developed product and industry expertise AdWords Representative Google 2005  –  2006  (1 year) Developed product and industry expertise Languages Korean Korean Korean Skills Top Skills 18 Google Adwords 17 Digital Marketing 7 DoubleClick 6 SEM 5 Display Advertising 4 Online Advertising 4 Mobile Advertising 4 Digital Strategy 3 Search Advertising 3 PPC Mo also knows about... 3 Conversion Optimization 2 Web Analytics 2 Mobile Marketing 2 Digital Media 2 Google Analytics 2 Account Management 1 Ad Networks 1 Analytics 1 Ad Serving Skills  Top Skills 18 Google Adwords 17 Digital Marketing 7 DoubleClick 6 SEM 5 Display Advertising 4 Online Advertising 4 Mobile Advertising 4 Digital Strategy 3 Search Advertising 3 PPC Mo also knows about... 3 Conversion Optimization 2 Web Analytics 2 Mobile Marketing 2 Digital Media 2 Google Analytics 2 Account Management 1 Ad Networks 1 Analytics 1 Ad Serving Top Skills 18 Google Adwords 17 Digital Marketing 7 DoubleClick 6 SEM 5 Display Advertising 4 Online Advertising 4 Mobile Advertising 4 Digital Strategy 3 Search Advertising 3 PPC Mo also knows about... 3 Conversion Optimization 2 Web Analytics 2 Mobile Marketing 2 Digital Media 2 Google Analytics 2 Account Management 1 Ad Networks 1 Analytics 1 Ad Serving Top Skills 18 Google Adwords 17 Digital Marketing 7 DoubleClick 6 SEM 5 Display Advertising 4 Online Advertising 4 Mobile Advertising 4 Digital Strategy 3 Search Advertising 3 PPC Mo also knows about... 3 Conversion Optimization 2 Web Analytics 2 Mobile Marketing 2 Digital Media 2 Google Analytics 2 Account Management 1 Ad Networks 1 Analytics 1 Ad Serving                     3 Conversion Optimization 2 Web Analytics 2 Mobile Marketing 2 Digital Media 2 Google Analytics 2 Account Management 1 Ad Networks 1 Analytics 1 Ad Serving Education Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 Bryn Mawr College Bachelor of Arts (B.A.),  English/Political Science 2002  – 2005 ", "Languages Portuguese Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Tamil Full professional proficiency Malayalam Native or bilingual proficiency Telugu Limited working proficiency Portuguese Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Tamil Full professional proficiency Malayalam Native or bilingual proficiency Telugu Limited working proficiency Portuguese Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Tamil Full professional proficiency Malayalam Native or bilingual proficiency Telugu Limited working proficiency Professional working proficiency Full professional proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Top Skills 20 SEM 15 Google Analytics 14 Online Advertising 13 Google Adwords 7 Advertising 5 PPC 4 Digital Marketing 4 Analytics 3 Social Media 3 Web Analytics Karthikeyan also knows about... 2 E-commerce 2 HTML 2 Marketing 1 Display Advertising 1 Mobile Marketing 1 Online Marketing 0 Search Advertising 0 Social Media Marketing 0 Account Management 0 Digital Strategy 0 DoubleClick 0 Conversion Optimization 0 Mobile Advertising Skills  Top Skills 20 SEM 15 Google Analytics 14 Online Advertising 13 Google Adwords 7 Advertising 5 PPC 4 Digital Marketing 4 Analytics 3 Social Media 3 Web Analytics Karthikeyan also knows about... 2 E-commerce 2 HTML 2 Marketing 1 Display Advertising 1 Mobile Marketing 1 Online Marketing 0 Search Advertising 0 Social Media Marketing 0 Account Management 0 Digital Strategy 0 DoubleClick 0 Conversion Optimization 0 Mobile Advertising Top Skills 20 SEM 15 Google Analytics 14 Online Advertising 13 Google Adwords 7 Advertising 5 PPC 4 Digital Marketing 4 Analytics 3 Social Media 3 Web Analytics Karthikeyan also knows about... 2 E-commerce 2 HTML 2 Marketing 1 Display Advertising 1 Mobile Marketing 1 Online Marketing 0 Search Advertising 0 Social Media Marketing 0 Account Management 0 Digital Strategy 0 DoubleClick 0 Conversion Optimization 0 Mobile Advertising Top Skills 20 SEM 15 Google Analytics 14 Online Advertising 13 Google Adwords 7 Advertising 5 PPC 4 Digital Marketing 4 Analytics 3 Social Media 3 Web Analytics Karthikeyan also knows about... 2 E-commerce 2 HTML 2 Marketing 1 Display Advertising 1 Mobile Marketing 1 Online Marketing 0 Search Advertising 0 Social Media Marketing 0 Account Management 0 Digital Strategy 0 DoubleClick 0 Conversion Optimization 0 Mobile Advertising                     2 E-commerce 2 HTML 2 Marketing 1 Display Advertising 1 Mobile Marketing 1 Online Marketing 0 Search Advertising 0 Social Media Marketing 0 Account Management 0 Digital Strategy 0 DoubleClick 0 Conversion Optimization 0 Mobile Advertising ", "Summary Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Summary Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Experience Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (2 months) São Paulo Area, Brazil Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. (Open) 1 recommendation Ingrid Abreu Account Manager at Twitter Carlos Araujo was my manager for 9 months on Google. During this period, he not only won a prize from the company as one of the best managers, and also won that title to all co-workers with whom he worked and didn't work with. He was an example of a... View Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. (Open) 2 recommendations Vitor de Mesquita Manager, Digital at Accenture Interactive They most impressive quality of Carlos is his hard-working soul: Carlos has won several internal Google Prizes, which are... View Denis Caldeira de Almeida Head of Client Services, Latin America at Facebook Carlos has a very strong experience with business analysis at Google and shares it with his peers and managers. He loves... View Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. (Open) 1 recommendation Alexandre Yokoyama Mentor at Startupbootcamp FinTech Carlos is one of my internal Google AdWords guru. His analytical capabilities combined with deep knowledge on AdWords features enable him to deploy several ways of account optimization and sales pitch creation, which helped me to perform most of my... View Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (2 months) São Paulo Area, Brazil Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (2 months) São Paulo Area, Brazil Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. (Open) 1 recommendation Ingrid Abreu Account Manager at Twitter Carlos Araujo was my manager for 9 months on Google. During this period, he not only won a prize from the company as one of the best managers, and also won that title to all co-workers with whom he worked and didn't work with. He was an example of a... View Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. (Open) 1 recommendation Ingrid Abreu Account Manager at Twitter Carlos Araujo was my manager for 9 months on Google. During this period, he not only won a prize from the company as one of the best managers, and also won that title to all co-workers with whom he worked and didn't work with. He was an example of a... View Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. (Open) 2 recommendations Vitor de Mesquita Manager, Digital at Accenture Interactive They most impressive quality of Carlos is his hard-working soul: Carlos has won several internal Google Prizes, which are... View Denis Caldeira de Almeida Head of Client Services, Latin America at Facebook Carlos has a very strong experience with business analysis at Google and shares it with his peers and managers. He loves... View Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. (Open) 2 recommendations Vitor de Mesquita Manager, Digital at Accenture Interactive They most impressive quality of Carlos is his hard-working soul: Carlos has won several internal Google Prizes, which are... View Denis Caldeira de Almeida Head of Client Services, Latin America at Facebook Carlos has a very strong experience with business analysis at Google and shares it with his peers and managers. He loves... View Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. (Open) 1 recommendation Alexandre Yokoyama Mentor at Startupbootcamp FinTech Carlos is one of my internal Google AdWords guru. His analytical capabilities combined with deep knowledge on AdWords features enable him to deploy several ways of account optimization and sales pitch creation, which helped me to perform most of my... View AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. (Open) 1 recommendation Alexandre Yokoyama Mentor at Startupbootcamp FinTech Carlos is one of my internal Google AdWords guru. His analytical capabilities combined with deep knowledge on AdWords features enable him to deploy several ways of account optimization and sales pitch creation, which helped me to perform most of my... View Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Skills Top Skills 78 Online Advertising 36 Marketing Strategy 31 CRM 31 Strategy 26 Business Development 25 Google Adwords 23 Business Strategy 21 Web Analytics 15 Sales 15 Digital Marketing Carlos G. C. also knows about... 11 Google Analytics 10 Leadership 8 Lead Generation 8 Management 7 Team Leadership 7 E-commerce 7 Start-ups 6 Sales Operations 6 Marketing 5 Project Management 5 Business Planning 5 Advertising 5 Analytics 5 Forecasting 4 Competitive Analysis 3 Training 2 Analysis 1 Business Analysis See 3+     See less Skills  Top Skills 78 Online Advertising 36 Marketing Strategy 31 CRM 31 Strategy 26 Business Development 25 Google Adwords 23 Business Strategy 21 Web Analytics 15 Sales 15 Digital Marketing Carlos G. C. also knows about... 11 Google Analytics 10 Leadership 8 Lead Generation 8 Management 7 Team Leadership 7 E-commerce 7 Start-ups 6 Sales Operations 6 Marketing 5 Project Management 5 Business Planning 5 Advertising 5 Analytics 5 Forecasting 4 Competitive Analysis 3 Training 2 Analysis 1 Business Analysis See 3+     See less Top Skills 78 Online Advertising 36 Marketing Strategy 31 CRM 31 Strategy 26 Business Development 25 Google Adwords 23 Business Strategy 21 Web Analytics 15 Sales 15 Digital Marketing Carlos G. C. also knows about... 11 Google Analytics 10 Leadership 8 Lead Generation 8 Management 7 Team Leadership 7 E-commerce 7 Start-ups 6 Sales Operations 6 Marketing 5 Project Management 5 Business Planning 5 Advertising 5 Analytics 5 Forecasting 4 Competitive Analysis 3 Training 2 Analysis 1 Business Analysis See 3+     See less Top Skills 78 Online Advertising 36 Marketing Strategy 31 CRM 31 Strategy 26 Business Development 25 Google Adwords 23 Business Strategy 21 Web Analytics 15 Sales 15 Digital Marketing Carlos G. C. also knows about... 11 Google Analytics 10 Leadership 8 Lead Generation 8 Management 7 Team Leadership 7 E-commerce 7 Start-ups 6 Sales Operations 6 Marketing 5 Project Management 5 Business Planning 5 Advertising 5 Analytics 5 Forecasting 4 Competitive Analysis 3 Training 2 Analysis 1 Business Analysis See 3+     See less                     11 Google Analytics 10 Leadership 8 Lead Generation 8 Management 7 Team Leadership 7 E-commerce 7 Start-ups 6 Sales Operations 6 Marketing 5 Project Management 5 Business Planning 5 Advertising 5 Analytics 5 Forecasting 4 Competitive Analysis 3 Training 2 Analysis 1 Business Analysis Education Duke University GBA - Google Business Academy,  Business Administration and Management ,  General 2011  – 2012 Cohort program created by Duke University and Google. Universidade de São Paulo Electric Engineering Duke University GBA - Google Business Academy,  Business Administration and Management ,  General 2011  – 2012 Cohort program created by Duke University and Google. Duke University GBA - Google Business Academy,  Business Administration and Management ,  General 2011  – 2012 Cohort program created by Duke University and Google. Duke University GBA - Google Business Academy,  Business Administration and Management ,  General 2011  – 2012 Cohort program created by Duke University and Google. Universidade de São Paulo Electric Engineering Universidade de São Paulo Electric Engineering Universidade de São Paulo Electric Engineering ", "Experience Senior Strategist Google India Pvt Ltd November 2014  – Present (9 months) Hyderabad Area, India Ensuring Quality of data on Google Shopping Strategist, Shopping Quality Operations Google India Pvt Ltd February 2013  –  October 2014  (1 year 9 months) Hyderabad Area, India Ensuring Quality of data on Google Shopping Strategist, Risk Operations Google India November 2012  –  February 2013  (4 months) Hyderabad Area, India Fight Fraud/Abuse on Google Commerce Risk Operations Associate Google India November 2011  –  November 2012  (1 year 1 month) Hyderabad Area, India Fight Fraud/Abuse on Google Commerce Risk Operations Analyst Google India November 2010  –  November 2011  (1 year 1 month) Hyderabad Area, India Fight Fraud/Abuse on Google Checkout Adwords Representative Google India May 2010  –  November 2010  (7 months) Hyderabad Area, India Google Ads Policies and Reviews Executive - Recruitment Calls Incorporated June 2008  –  January 2009  (8 months) Kolkata Area, India • Got new business for them \n• Over all management and coordination on behalf of the company with students, clients, etc \n• Scanning of candidates \n• Played an administrative role as well \n• Handling accounts of various companies like Genpact, EXL Services, First Source, Kankei Marketing Services, Wipro, IBM Daksh, IBM International etc. Senior Strategist Google India Pvt Ltd November 2014  – Present (9 months) Hyderabad Area, India Ensuring Quality of data on Google Shopping Senior Strategist Google India Pvt Ltd November 2014  – Present (9 months) Hyderabad Area, India Ensuring Quality of data on Google Shopping Strategist, Shopping Quality Operations Google India Pvt Ltd February 2013  –  October 2014  (1 year 9 months) Hyderabad Area, India Ensuring Quality of data on Google Shopping Strategist, Shopping Quality Operations Google India Pvt Ltd February 2013  –  October 2014  (1 year 9 months) Hyderabad Area, India Ensuring Quality of data on Google Shopping Strategist, Risk Operations Google India November 2012  –  February 2013  (4 months) Hyderabad Area, India Fight Fraud/Abuse on Google Commerce Strategist, Risk Operations Google India November 2012  –  February 2013  (4 months) Hyderabad Area, India Fight Fraud/Abuse on Google Commerce Risk Operations Associate Google India November 2011  –  November 2012  (1 year 1 month) Hyderabad Area, India Fight Fraud/Abuse on Google Commerce Risk Operations Associate Google India November 2011  –  November 2012  (1 year 1 month) Hyderabad Area, India Fight Fraud/Abuse on Google Commerce Risk Operations Analyst Google India November 2010  –  November 2011  (1 year 1 month) Hyderabad Area, India Fight Fraud/Abuse on Google Checkout Risk Operations Analyst Google India November 2010  –  November 2011  (1 year 1 month) Hyderabad Area, India Fight Fraud/Abuse on Google Checkout Adwords Representative Google India May 2010  –  November 2010  (7 months) Hyderabad Area, India Google Ads Policies and Reviews Adwords Representative Google India May 2010  –  November 2010  (7 months) Hyderabad Area, India Google Ads Policies and Reviews Executive - Recruitment Calls Incorporated June 2008  –  January 2009  (8 months) Kolkata Area, India • Got new business for them \n• Over all management and coordination on behalf of the company with students, clients, etc \n• Scanning of candidates \n• Played an administrative role as well \n• Handling accounts of various companies like Genpact, EXL Services, First Source, Kankei Marketing Services, Wipro, IBM Daksh, IBM International etc. Executive - Recruitment Calls Incorporated June 2008  –  January 2009  (8 months) Kolkata Area, India • Got new business for them \n• Over all management and coordination on behalf of the company with students, clients, etc \n• Scanning of candidates \n• Played an administrative role as well \n• Handling accounts of various companies like Genpact, EXL Services, First Source, Kankei Marketing Services, Wipro, IBM Daksh, IBM International etc. Languages English Hindi Gujarati English Hindi Gujarati English Hindi Gujarati Skills Top Skills 10 Analytics 10 E-commerce 7 Management 7 Marketing Strategy 5 Online Advertising 5 Marketing 4 Business Analysis 3 Microsoft Office 2 Account Management 2 Risk Management Devrath also knows about... 2 Digital Marketing 2 Microsoft Excel 2 New Business Development 1 Analysis 1 Customer Service 1 Risk Assessment 1 SQL 1 Advertising 1 Team Management 0 Social Media 0 Social Media Marketing Skills  Top Skills 10 Analytics 10 E-commerce 7 Management 7 Marketing Strategy 5 Online Advertising 5 Marketing 4 Business Analysis 3 Microsoft Office 2 Account Management 2 Risk Management Devrath also knows about... 2 Digital Marketing 2 Microsoft Excel 2 New Business Development 1 Analysis 1 Customer Service 1 Risk Assessment 1 SQL 1 Advertising 1 Team Management 0 Social Media 0 Social Media Marketing Top Skills 10 Analytics 10 E-commerce 7 Management 7 Marketing Strategy 5 Online Advertising 5 Marketing 4 Business Analysis 3 Microsoft Office 2 Account Management 2 Risk Management Devrath also knows about... 2 Digital Marketing 2 Microsoft Excel 2 New Business Development 1 Analysis 1 Customer Service 1 Risk Assessment 1 SQL 1 Advertising 1 Team Management 0 Social Media 0 Social Media Marketing Top Skills 10 Analytics 10 E-commerce 7 Management 7 Marketing Strategy 5 Online Advertising 5 Marketing 4 Business Analysis 3 Microsoft Office 2 Account Management 2 Risk Management Devrath also knows about... 2 Digital Marketing 2 Microsoft Excel 2 New Business Development 1 Analysis 1 Customer Service 1 Risk Assessment 1 SQL 1 Advertising 1 Team Management 0 Social Media 0 Social Media Marketing                     2 Digital Marketing 2 Microsoft Excel 2 New Business Development 1 Analysis 1 Customer Service 1 Risk Assessment 1 SQL 1 Advertising 1 Team Management 0 Social Media 0 Social Media Marketing Education St. Xavier's College Bachelor of Commerce (B.Com.),  Specialization in Marketing Management 2007  – 2010 M.P. Birla F.H.S.School Class X and XII,  Commerce 1995  – 2007 St. Xavier's College Bachelor of Commerce (B.Com.),  Specialization in Marketing Management 2007  – 2010 St. Xavier's College Bachelor of Commerce (B.Com.),  Specialization in Marketing Management 2007  – 2010 St. Xavier's College Bachelor of Commerce (B.Com.),  Specialization in Marketing Management 2007  – 2010 M.P. Birla F.H.S.School Class X and XII,  Commerce 1995  – 2007 M.P. Birla F.H.S.School Class X and XII,  Commerce 1995  – 2007 M.P. Birla F.H.S.School Class X and XII,  Commerce 1995  – 2007 "]}