{"position": "Associate Editor", "company": "Google", "profiles": ["Summary Discovering the passion for words and expression through writing early in my life, I pursued a career in journalism. As a college student, I interned at two prominent newspapers: The Wall Street Journal and The Wall Street Journal Europe. I've also freelanced for Newsday and The Associated Press, among others. In 2004, I landed a job as an associate editor at CMP Media’s InformationWeek magazine, where I wrote full time about mobile and wireless technology. Then I got the opportunity switch tracks, and join the world of advertising and marketing. I became the online editor of Brandweek, and later Adweek. I continue to blog daily and write for a variety of publications, most recently, Scientific American. \n \nSpecialties: I'm fluent in Russian, currently studying French, and brushing up on my Spanish. Summary Discovering the passion for words and expression through writing early in my life, I pursued a career in journalism. As a college student, I interned at two prominent newspapers: The Wall Street Journal and The Wall Street Journal Europe. I've also freelanced for Newsday and The Associated Press, among others. In 2004, I landed a job as an associate editor at CMP Media’s InformationWeek magazine, where I wrote full time about mobile and wireless technology. Then I got the opportunity switch tracks, and join the world of advertising and marketing. I became the online editor of Brandweek, and later Adweek. I continue to blog daily and write for a variety of publications, most recently, Scientific American. \n \nSpecialties: I'm fluent in Russian, currently studying French, and brushing up on my Spanish. Discovering the passion for words and expression through writing early in my life, I pursued a career in journalism. As a college student, I interned at two prominent newspapers: The Wall Street Journal and The Wall Street Journal Europe. I've also freelanced for Newsday and The Associated Press, among others. In 2004, I landed a job as an associate editor at CMP Media’s InformationWeek magazine, where I wrote full time about mobile and wireless technology. Then I got the opportunity switch tracks, and join the world of advertising and marketing. I became the online editor of Brandweek, and later Adweek. I continue to blog daily and write for a variety of publications, most recently, Scientific American. \n \nSpecialties: I'm fluent in Russian, currently studying French, and brushing up on my Spanish. Discovering the passion for words and expression through writing early in my life, I pursued a career in journalism. As a college student, I interned at two prominent newspapers: The Wall Street Journal and The Wall Street Journal Europe. I've also freelanced for Newsday and The Associated Press, among others. In 2004, I landed a job as an associate editor at CMP Media’s InformationWeek magazine, where I wrote full time about mobile and wireless technology. Then I got the opportunity switch tracks, and join the world of advertising and marketing. I became the online editor of Brandweek, and later Adweek. I continue to blog daily and write for a variety of publications, most recently, Scientific American. \n \nSpecialties: I'm fluent in Russian, currently studying French, and brushing up on my Spanish. Experience Freelance writer InformationWeek, Scientific American, Associated Press, other publications August 2008  – Present (7 years 1 month) Online editor, Adweek/Brandweek Prometheus Global Media February 2008  –  June 2011  (3 years 5 months) Initially started as an online editor and later took on multiple other roles, including reporting, writing, blogging, photo editing and promoting Brandweek stories on social media sites (Facebook and Twitter, among others). When Brandweek and Mediaweek folded into Adweek, I became Adweek's Web producer. Associate editor, InformationWeek CMP Media August 2004  –  February 2008  (3 years 7 months) Served as a mobile and wireless reporter for InformationWeek and sister brand TechWeb. Learned the ins and outs of the industry, which involved forming relationships with key players like RIM and Microsoft. Wrote up to four daily news stories and weekly analytical stories. Took on additional role as an anchor for The News Show, an online news report. Intern The Wall Street Journal May 2004  –  August 2004  (4 months) Intern The Wall Street Journal Europe June 2003  –  August 2003  (3 months) Freelance reporter Newsday September 2002  –  May 2003  (9 months) Freelanced as a general reporter for the New York metropolitan area. Freelance writer InformationWeek, Scientific American, Associated Press, other publications August 2008  – Present (7 years 1 month) Freelance writer InformationWeek, Scientific American, Associated Press, other publications August 2008  – Present (7 years 1 month) Online editor, Adweek/Brandweek Prometheus Global Media February 2008  –  June 2011  (3 years 5 months) Initially started as an online editor and later took on multiple other roles, including reporting, writing, blogging, photo editing and promoting Brandweek stories on social media sites (Facebook and Twitter, among others). When Brandweek and Mediaweek folded into Adweek, I became Adweek's Web producer. Online editor, Adweek/Brandweek Prometheus Global Media February 2008  –  June 2011  (3 years 5 months) Initially started as an online editor and later took on multiple other roles, including reporting, writing, blogging, photo editing and promoting Brandweek stories on social media sites (Facebook and Twitter, among others). When Brandweek and Mediaweek folded into Adweek, I became Adweek's Web producer. Associate editor, InformationWeek CMP Media August 2004  –  February 2008  (3 years 7 months) Served as a mobile and wireless reporter for InformationWeek and sister brand TechWeb. Learned the ins and outs of the industry, which involved forming relationships with key players like RIM and Microsoft. Wrote up to four daily news stories and weekly analytical stories. Took on additional role as an anchor for The News Show, an online news report. Associate editor, InformationWeek CMP Media August 2004  –  February 2008  (3 years 7 months) Served as a mobile and wireless reporter for InformationWeek and sister brand TechWeb. Learned the ins and outs of the industry, which involved forming relationships with key players like RIM and Microsoft. Wrote up to four daily news stories and weekly analytical stories. Took on additional role as an anchor for The News Show, an online news report. Intern The Wall Street Journal May 2004  –  August 2004  (4 months) Intern The Wall Street Journal May 2004  –  August 2004  (4 months) Intern The Wall Street Journal Europe June 2003  –  August 2003  (3 months) Intern The Wall Street Journal Europe June 2003  –  August 2003  (3 months) Freelance reporter Newsday September 2002  –  May 2003  (9 months) Freelanced as a general reporter for the New York metropolitan area. Freelance reporter Newsday September 2002  –  May 2003  (9 months) Freelanced as a general reporter for the New York metropolitan area. Languages   Skills Russian Writing Social Media Magazines Journalism Blogging Newspaper Stories Publications Copy Editing Editing Editorial Digital Media Copywriting Drupal Research Photoshop Social Networking Final Cut Pro Proofreading Video QuarkXPress Content Management Advertising New Media Adobe Creative Suite HTML InDesign Microsoft Office CMS Newspapers Storytelling Feature Articles Content Strategy Publishing Content Development AP Style News Writing Online Publishing Newsletters Online Journalism Press Releases See 27+     See less Skills  Russian Writing Social Media Magazines Journalism Blogging Newspaper Stories Publications Copy Editing Editing Editorial Digital Media Copywriting Drupal Research Photoshop Social Networking Final Cut Pro Proofreading Video QuarkXPress Content Management Advertising New Media Adobe Creative Suite HTML InDesign Microsoft Office CMS Newspapers Storytelling Feature Articles Content Strategy Publishing Content Development AP Style News Writing Online Publishing Newsletters Online Journalism Press Releases See 27+     See less Russian Writing Social Media Magazines Journalism Blogging Newspaper Stories Publications Copy Editing Editing Editorial Digital Media Copywriting Drupal Research Photoshop Social Networking Final Cut Pro Proofreading Video QuarkXPress Content Management Advertising New Media Adobe Creative Suite HTML InDesign Microsoft Office CMS Newspapers Storytelling Feature Articles Content Strategy Publishing Content Development AP Style News Writing Online Publishing Newsletters Online Journalism Press Releases See 27+     See less Russian Writing Social Media Magazines Journalism Blogging Newspaper Stories Publications Copy Editing Editing Editorial Digital Media Copywriting Drupal Research Photoshop Social Networking Final Cut Pro Proofreading Video QuarkXPress Content Management Advertising New Media Adobe Creative Suite HTML InDesign Microsoft Office CMS Newspapers Storytelling Feature Articles Content Strategy Publishing Content Development AP Style News Writing Online Publishing Newsletters Online Journalism Press Releases See 27+     See less Honors & Awards Additional Honors & Awards - CMP Media 2006 Excellence In Editorial Award  \n- Jeannette K. Watson Fellowship 2001 Additional Honors & Awards - CMP Media 2006 Excellence In Editorial Award  \n- Jeannette K. Watson Fellowship 2001 Additional Honors & Awards - CMP Media 2006 Excellence In Editorial Award  \n- Jeannette K. Watson Fellowship 2001 Additional Honors & Awards - CMP Media 2006 Excellence In Editorial Award  \n- Jeannette K. Watson Fellowship 2001 ", "Experience Marketing Content Manager Quantifind April 2015  – Present (5 months) Menlo Park, CA Technical Writer/ Web Content Manager (contract) Google (via Adecco) January 2015  –  April 2015  (4 months) Mountain View, CA Create documentation and instructional content to improve photographer and agency engagement with Google Maps Business View. Update and maintain existing Google Maps Business View websites, and create new site pages as content needs evolve and new markets/products launch.  \n \nPlan Google Maps Business View website redesign and create content for new sites. Manage assets across multiple languages, locales and regions. Collaborate with engineering, video and localization teams to meet the needs of site stakeholders. Associate Editor InformationWeek August 2012  –  January 2015  (2 years 6 months) San Francisco Bay Area Produced high-quality daily news articles, software guides, white papers and commentary about the IT industry. Recruited and managed contributing writers. Contributed to reader engagement, SEO, and social media initiatives. Provided photo and video coverage of events. Moderated user comments. Contributed to InformationWeek Radio. Tracked copy flow and contributed to QA testing. \n \nDevised editorial strategy for Microsoft, Dell, Cisco, PC and tablet reporting beats. Analyzed site traffic metrics to inform editorial strategies, including SEO and social campaigns.  \n \nSite leader in key editorial and reader engagement metrics (page views, unique visitors, bounce rate, user comments, etc.) from 07/2013 to 01/2015. \n \nAppeared on Marketplace as expert commentator on the Internet of Things. Reporting cited by publications and institutions that include The Guardian, ZDNet, The Huffington Post, the \nProgressive Policy Institute, and Stanford Law Review. Faculty, Faculty Manager, Business Developer Kaplan Test Prep and Admissions 2006  –  November 2013  (7 years) San Francisco Bay Area Faculty, 2006 - 2009; 2011 - 2013: Taught SAT, ACT, GRE, GMAT, and LSAT classes, both in traditional classrooms and online. Developed curriculum. Delivered marketing presentations and built relationships with local schools and libraries. Rated one of the top instructors and marketing presenters in the nation, as measured by both student satisfaction surveys and internal evaluations.  \n \nSilicon Valley-Area Faculty Manager, 2010-2011: Hired, trained, and mentored new faculty members. Managed teacher scheduling for Silicon Valley. Staffed all classes and improved customer satisfaction rate. Managing Editor (Contract) eBay December 2011  –  May 2012  (6 months) remote Remotely managed team of writers tasked with producing hundreds of comprehensive, 2,000 – 5,000-word Buyers’ Guides; Edited team’s work for quality, SEO value, and adherence to eBay Style Guidelines; Part of the original oDesk Enterprise pilot team that won the eBay contract. Copywriter (Contract) oDesk September 2011  –  December 2011  (4 months) remote Contributed advertising copy (including e-mail subject lines, Twitter posts, e-mail teaser paragraphs, and full deal summaries) for the launch of Google Offers in Oklahoma City; Wrote hundreds of query responses for Ask.com SEO project. Literary Coordinator/ Assistant Jim Preminger Agency September 2005  –  September 2007  (2 years 1 month) Greater Los Angeles Area Positioned clients for TV writing and directing jobs by identifying open assignments and maintaining relationships with studio contacts; Provided coverage of potential new clients’ material; Proofread and critiqued clients’ new scripts; Handled phones and schedule for Literary Agent Dean Schramm and coordinated his clients’ submissions. Editorial Intern Stanford Magazine September 2004  –  May 2005  (9 months) Stanford, CA Published numerous articles for monthly alumni magazine distributed throughout the world; Topics covered included sports, alumni philanthropy, technology, entertainment, digital media, and the arts; Fact-checked articles; Contributed to editorial meetings; Completed various office tasks. Development Intern Miramax June 2003  –  September 2003  (4 months) Greater Los Angeles Area Provided script coverage and completed various office tasks. Freelance Reporter The Fresno Bee November 2000  –  June 2002  (1 year 8 months) Fresno, CA Wrote numerous articles; Assignments included politics, high school sports, and college basketball. Marketing Content Manager Quantifind April 2015  – Present (5 months) Menlo Park, CA Marketing Content Manager Quantifind April 2015  – Present (5 months) Menlo Park, CA Technical Writer/ Web Content Manager (contract) Google (via Adecco) January 2015  –  April 2015  (4 months) Mountain View, CA Create documentation and instructional content to improve photographer and agency engagement with Google Maps Business View. Update and maintain existing Google Maps Business View websites, and create new site pages as content needs evolve and new markets/products launch.  \n \nPlan Google Maps Business View website redesign and create content for new sites. Manage assets across multiple languages, locales and regions. Collaborate with engineering, video and localization teams to meet the needs of site stakeholders. Technical Writer/ Web Content Manager (contract) Google (via Adecco) January 2015  –  April 2015  (4 months) Mountain View, CA Create documentation and instructional content to improve photographer and agency engagement with Google Maps Business View. Update and maintain existing Google Maps Business View websites, and create new site pages as content needs evolve and new markets/products launch.  \n \nPlan Google Maps Business View website redesign and create content for new sites. Manage assets across multiple languages, locales and regions. Collaborate with engineering, video and localization teams to meet the needs of site stakeholders. Associate Editor InformationWeek August 2012  –  January 2015  (2 years 6 months) San Francisco Bay Area Produced high-quality daily news articles, software guides, white papers and commentary about the IT industry. Recruited and managed contributing writers. Contributed to reader engagement, SEO, and social media initiatives. Provided photo and video coverage of events. Moderated user comments. Contributed to InformationWeek Radio. Tracked copy flow and contributed to QA testing. \n \nDevised editorial strategy for Microsoft, Dell, Cisco, PC and tablet reporting beats. Analyzed site traffic metrics to inform editorial strategies, including SEO and social campaigns.  \n \nSite leader in key editorial and reader engagement metrics (page views, unique visitors, bounce rate, user comments, etc.) from 07/2013 to 01/2015. \n \nAppeared on Marketplace as expert commentator on the Internet of Things. Reporting cited by publications and institutions that include The Guardian, ZDNet, The Huffington Post, the \nProgressive Policy Institute, and Stanford Law Review. Associate Editor InformationWeek August 2012  –  January 2015  (2 years 6 months) San Francisco Bay Area Produced high-quality daily news articles, software guides, white papers and commentary about the IT industry. Recruited and managed contributing writers. Contributed to reader engagement, SEO, and social media initiatives. Provided photo and video coverage of events. Moderated user comments. Contributed to InformationWeek Radio. Tracked copy flow and contributed to QA testing. \n \nDevised editorial strategy for Microsoft, Dell, Cisco, PC and tablet reporting beats. Analyzed site traffic metrics to inform editorial strategies, including SEO and social campaigns.  \n \nSite leader in key editorial and reader engagement metrics (page views, unique visitors, bounce rate, user comments, etc.) from 07/2013 to 01/2015. \n \nAppeared on Marketplace as expert commentator on the Internet of Things. Reporting cited by publications and institutions that include The Guardian, ZDNet, The Huffington Post, the \nProgressive Policy Institute, and Stanford Law Review. Faculty, Faculty Manager, Business Developer Kaplan Test Prep and Admissions 2006  –  November 2013  (7 years) San Francisco Bay Area Faculty, 2006 - 2009; 2011 - 2013: Taught SAT, ACT, GRE, GMAT, and LSAT classes, both in traditional classrooms and online. Developed curriculum. Delivered marketing presentations and built relationships with local schools and libraries. Rated one of the top instructors and marketing presenters in the nation, as measured by both student satisfaction surveys and internal evaluations.  \n \nSilicon Valley-Area Faculty Manager, 2010-2011: Hired, trained, and mentored new faculty members. Managed teacher scheduling for Silicon Valley. Staffed all classes and improved customer satisfaction rate. Faculty, Faculty Manager, Business Developer Kaplan Test Prep and Admissions 2006  –  November 2013  (7 years) San Francisco Bay Area Faculty, 2006 - 2009; 2011 - 2013: Taught SAT, ACT, GRE, GMAT, and LSAT classes, both in traditional classrooms and online. Developed curriculum. Delivered marketing presentations and built relationships with local schools and libraries. Rated one of the top instructors and marketing presenters in the nation, as measured by both student satisfaction surveys and internal evaluations.  \n \nSilicon Valley-Area Faculty Manager, 2010-2011: Hired, trained, and mentored new faculty members. Managed teacher scheduling for Silicon Valley. Staffed all classes and improved customer satisfaction rate. Managing Editor (Contract) eBay December 2011  –  May 2012  (6 months) remote Remotely managed team of writers tasked with producing hundreds of comprehensive, 2,000 – 5,000-word Buyers’ Guides; Edited team’s work for quality, SEO value, and adherence to eBay Style Guidelines; Part of the original oDesk Enterprise pilot team that won the eBay contract. Managing Editor (Contract) eBay December 2011  –  May 2012  (6 months) remote Remotely managed team of writers tasked with producing hundreds of comprehensive, 2,000 – 5,000-word Buyers’ Guides; Edited team’s work for quality, SEO value, and adherence to eBay Style Guidelines; Part of the original oDesk Enterprise pilot team that won the eBay contract. Copywriter (Contract) oDesk September 2011  –  December 2011  (4 months) remote Contributed advertising copy (including e-mail subject lines, Twitter posts, e-mail teaser paragraphs, and full deal summaries) for the launch of Google Offers in Oklahoma City; Wrote hundreds of query responses for Ask.com SEO project. Copywriter (Contract) oDesk September 2011  –  December 2011  (4 months) remote Contributed advertising copy (including e-mail subject lines, Twitter posts, e-mail teaser paragraphs, and full deal summaries) for the launch of Google Offers in Oklahoma City; Wrote hundreds of query responses for Ask.com SEO project. Literary Coordinator/ Assistant Jim Preminger Agency September 2005  –  September 2007  (2 years 1 month) Greater Los Angeles Area Positioned clients for TV writing and directing jobs by identifying open assignments and maintaining relationships with studio contacts; Provided coverage of potential new clients’ material; Proofread and critiqued clients’ new scripts; Handled phones and schedule for Literary Agent Dean Schramm and coordinated his clients’ submissions. Literary Coordinator/ Assistant Jim Preminger Agency September 2005  –  September 2007  (2 years 1 month) Greater Los Angeles Area Positioned clients for TV writing and directing jobs by identifying open assignments and maintaining relationships with studio contacts; Provided coverage of potential new clients’ material; Proofread and critiqued clients’ new scripts; Handled phones and schedule for Literary Agent Dean Schramm and coordinated his clients’ submissions. Editorial Intern Stanford Magazine September 2004  –  May 2005  (9 months) Stanford, CA Published numerous articles for monthly alumni magazine distributed throughout the world; Topics covered included sports, alumni philanthropy, technology, entertainment, digital media, and the arts; Fact-checked articles; Contributed to editorial meetings; Completed various office tasks. Editorial Intern Stanford Magazine September 2004  –  May 2005  (9 months) Stanford, CA Published numerous articles for monthly alumni magazine distributed throughout the world; Topics covered included sports, alumni philanthropy, technology, entertainment, digital media, and the arts; Fact-checked articles; Contributed to editorial meetings; Completed various office tasks. Development Intern Miramax June 2003  –  September 2003  (4 months) Greater Los Angeles Area Provided script coverage and completed various office tasks. Development Intern Miramax June 2003  –  September 2003  (4 months) Greater Los Angeles Area Provided script coverage and completed various office tasks. Freelance Reporter The Fresno Bee November 2000  –  June 2002  (1 year 8 months) Fresno, CA Wrote numerous articles; Assignments included politics, high school sports, and college basketball. Freelance Reporter The Fresno Bee November 2000  –  June 2002  (1 year 8 months) Fresno, CA Wrote numerous articles; Assignments included politics, high school sports, and college basketball. Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Editing Journalism Copywriting Social Media Digital Media Photoshop Video Editing Photography Research Public Speaking Higher Education Teaching SEO Editorial Publishing Blogging Proofreading Content Development Video Final Cut Pro Writing Social Networking Copy Editing Marketing Apple Aperture Motion Graphics After Effects Cinematography Technical Writing Educational Consulting Pedagogy Academic Writing SEO copywriting Photojournalism Screenwriting Content Strategy Web Content Online Journalism Storytelling Social Media Marketing Web Analytics HTML CMS JavaScript Branding & Identity Content Management Press Releases Strategy Creative Writing Creative Strategy See 35+     See less Skills  Editing Journalism Copywriting Social Media Digital Media Photoshop Video Editing Photography Research Public Speaking Higher Education Teaching SEO Editorial Publishing Blogging Proofreading Content Development Video Final Cut Pro Writing Social Networking Copy Editing Marketing Apple Aperture Motion Graphics After Effects Cinematography Technical Writing Educational Consulting Pedagogy Academic Writing SEO copywriting Photojournalism Screenwriting Content Strategy Web Content Online Journalism Storytelling Social Media Marketing Web Analytics HTML CMS JavaScript Branding & Identity Content Management Press Releases Strategy Creative Writing Creative Strategy See 35+     See less Editing Journalism Copywriting Social Media Digital Media Photoshop Video Editing Photography Research Public Speaking Higher Education Teaching SEO Editorial Publishing Blogging Proofreading Content Development Video Final Cut Pro Writing Social Networking Copy Editing Marketing Apple Aperture Motion Graphics After Effects Cinematography Technical Writing Educational Consulting Pedagogy Academic Writing SEO copywriting Photojournalism Screenwriting Content Strategy Web Content Online Journalism Storytelling Social Media Marketing Web Analytics HTML CMS JavaScript Branding & Identity Content Management Press Releases Strategy Creative Writing Creative Strategy See 35+     See less Editing Journalism Copywriting Social Media Digital Media Photoshop Video Editing Photography Research Public Speaking Higher Education Teaching SEO Editorial Publishing Blogging Proofreading Content Development Video Final Cut Pro Writing Social Networking Copy Editing Marketing Apple Aperture Motion Graphics After Effects Cinematography Technical Writing Educational Consulting Pedagogy Academic Writing SEO copywriting Photojournalism Screenwriting Content Strategy Web Content Online Journalism Storytelling Social Media Marketing Web Analytics HTML CMS JavaScript Branding & Identity Content Management Press Releases Strategy Creative Writing Creative Strategy See 35+     See less Education Stanford University Bachelor of Arts (B.A.),  English Language and Literature , General 2001  – 2005 San Francisco State University Master of Arts (M.A.),  Cinema Studies 2007  – 2012 Stanford University Bachelor of Arts (B.A.),  English Language and Literature , General 2001  – 2005 Stanford University Bachelor of Arts (B.A.),  English Language and Literature , General 2001  – 2005 Stanford University Bachelor of Arts (B.A.),  English Language and Literature , General 2001  – 2005 San Francisco State University Master of Arts (M.A.),  Cinema Studies 2007  – 2012 San Francisco State University Master of Arts (M.A.),  Cinema Studies 2007  – 2012 San Francisco State University Master of Arts (M.A.),  Cinema Studies 2007  – 2012 Honors & Awards 2008 Teacher of the Year January 2009 San Francisco and North Bay Areas 2011 Teacher of the Year February 2012 San Francisco and East Bay Areas 2008 Teacher of the Year January 2009 San Francisco and North Bay Areas 2008 Teacher of the Year January 2009 San Francisco and North Bay Areas 2008 Teacher of the Year January 2009 San Francisco and North Bay Areas 2011 Teacher of the Year February 2012 San Francisco and East Bay Areas 2011 Teacher of the Year February 2012 San Francisco and East Bay Areas 2011 Teacher of the Year February 2012 San Francisco and East Bay Areas ", "Summary I write regularly for InformationWeek.com, mostly about Internet companies, development, and security. I've been working in publishing since 1995 and worked in film and television before that. Summary I write regularly for InformationWeek.com, mostly about Internet companies, development, and security. I've been working in publishing since 1995 and worked in film and television before that. I write regularly for InformationWeek.com, mostly about Internet companies, development, and security. I've been working in publishing since 1995 and worked in film and television before that. I write regularly for InformationWeek.com, mostly about Internet companies, development, and security. I've been working in publishing since 1995 and worked in film and television before that. Experience Editor-at-Large InformationWeek December 2005  – Present (9 years 9 months) Write news reports. Editor-at-Large InformationWeek December 2005  – Present (9 years 9 months) Write news reports. Editor-at-Large InformationWeek December 2005  – Present (9 years 9 months) Write news reports. Languages English Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Programming Editorial Publishing Film Photography Editing Storytelling Social Media Marketing Content Development Video Games Blogging Web Content Journalism Content Strategy Copywriting Digital Media Writing Social Media See 3+     See less Skills  Programming Editorial Publishing Film Photography Editing Storytelling Social Media Marketing Content Development Video Games Blogging Web Content Journalism Content Strategy Copywriting Digital Media Writing Social Media See 3+     See less Programming Editorial Publishing Film Photography Editing Storytelling Social Media Marketing Content Development Video Games Blogging Web Content Journalism Content Strategy Copywriting Digital Media Writing Social Media See 3+     See less Programming Editorial Publishing Film Photography Editing Storytelling Social Media Marketing Content Development Video Games Blogging Web Content Journalism Content Strategy Copywriting Digital Media Writing Social Media See 3+     See less ", "Summary I am an experienced financial journalist, and am skilled at identifying critical business issues impacting capital markets, with a focus on regulations, risk management and technology. My objectives are to gain a deeper understanding of these issues by networking with industry experts, to broaden this network through personal interactions, and to sharing the expertise gained through my written (online and print) coverage. Summary I am an experienced financial journalist, and am skilled at identifying critical business issues impacting capital markets, with a focus on regulations, risk management and technology. My objectives are to gain a deeper understanding of these issues by networking with industry experts, to broaden this network through personal interactions, and to sharing the expertise gained through my written (online and print) coverage. I am an experienced financial journalist, and am skilled at identifying critical business issues impacting capital markets, with a focus on regulations, risk management and technology. My objectives are to gain a deeper understanding of these issues by networking with industry experts, to broaden this network through personal interactions, and to sharing the expertise gained through my written (online and print) coverage. I am an experienced financial journalist, and am skilled at identifying critical business issues impacting capital markets, with a focus on regulations, risk management and technology. My objectives are to gain a deeper understanding of these issues by networking with industry experts, to broaden this network through personal interactions, and to sharing the expertise gained through my written (online and print) coverage. Experience senior reporter Markets Media LLC 2009  – Present (6 years) Steven Marlin, Senior Reporter, covers a broad range of financial markets and market participants, including institutional investors, hedge funds, exchanges, broker-dealers, investment companies, advisers, and regulators. Prior to joining Markets Media in 2009, he spent 10 years at CMP, where he worked in a variety of editorial capacities for several brands including InformationWeek, Bank Systems & Technology, and Global Services. He can be reached at steve@marketsmediallc.com or 646.442.4648. Freelance Writer 2005-2009 2005  –  2009  (4 years) Managing Editor Treasury and Risk, 2007 2007  –  2008  (1 year) Produce print and electronic content for monthly publication targeting CFOs and treasurers at Fortune 1000 companies. Beats include treasury and risk management, governance and accounting, retirement and benefits, and technology. Senior Writer CMP Media 1997  –  2007  (10 years) Produce news, features, and other content for monthly publication, a joint venture of CMP and Indian publisher Cybermedia which covers outsourcing and/or offshoring of corporate services such as application development and maintenance, customer service, finance and accounting, and R&D. Meet with service providers based overseas. Associate Editor InformationWeek, 2003 2003  –  2006  (3 years) Primary beat reporter for financial-services industry; secondary beats include regulatory compliance and IT governance. Meet regularly with financial-industry execs to discuss trends in the payments industry, risk management, electronic trading and other topics of mutual interest. Executive Editor Bank Systems & Technology, 2000 1997  –  2003  (6 years) Provided editorial direction and content for monthly trade publication serving 24,000 executives. Assigned and edited stories for staff editors and freelancers. Moderated Financial Tech Expo and represented company at industry events. Senior Editor Bank Systems & Technology January 1997  –  January 2000  (3 years 1 month) Helped modernize 34-year-old trade publication with news and features covering all facets of $50 billion IT segment, including risk management, enterprise systems, business processes, outsourcing, e-commerce, e-payments, CRM, corporate banking, IT management, antitrust, privacy. Senior Research Analyst METROPOLITAN LIFE INSURANCE CO January 1988  –  January 1996  (8 years 1 month) Co-managed $500,000 per year technology research service for diverse population of knowledge workers. Oversaw paper-to-electronic conversion of research service delivery method, resulting in 1,000% subscriber increase (from 25 to 250+) over 2 years. Negotiated contracts with research suppliers (Gartner, Forrester, etc.) Senior Research Associate Gartner Group January 1986  –  January 1988  (2 years 1 month) Summer Intern Chemical Bank 1985  –  1985  (less than a year) Sales Representative Computer Factory January 1981  –  January 1984  (3 years 1 month) Systems Engineer Prime Computer January 1979  –  January 1981  (2 years 1 month) Rates Examiner NYS Dept. of Transp. January 1973  –  January 1976  (3 years 1 month) senior reporter Markets Media LLC 2009  – Present (6 years) Steven Marlin, Senior Reporter, covers a broad range of financial markets and market participants, including institutional investors, hedge funds, exchanges, broker-dealers, investment companies, advisers, and regulators. Prior to joining Markets Media in 2009, he spent 10 years at CMP, where he worked in a variety of editorial capacities for several brands including InformationWeek, Bank Systems & Technology, and Global Services. He can be reached at steve@marketsmediallc.com or 646.442.4648. senior reporter Markets Media LLC 2009  – Present (6 years) Steven Marlin, Senior Reporter, covers a broad range of financial markets and market participants, including institutional investors, hedge funds, exchanges, broker-dealers, investment companies, advisers, and regulators. Prior to joining Markets Media in 2009, he spent 10 years at CMP, where he worked in a variety of editorial capacities for several brands including InformationWeek, Bank Systems & Technology, and Global Services. He can be reached at steve@marketsmediallc.com or 646.442.4648. Freelance Writer 2005-2009 2005  –  2009  (4 years) Freelance Writer 2005-2009 2005  –  2009  (4 years) Managing Editor Treasury and Risk, 2007 2007  –  2008  (1 year) Produce print and electronic content for monthly publication targeting CFOs and treasurers at Fortune 1000 companies. Beats include treasury and risk management, governance and accounting, retirement and benefits, and technology. Managing Editor Treasury and Risk, 2007 2007  –  2008  (1 year) Produce print and electronic content for monthly publication targeting CFOs and treasurers at Fortune 1000 companies. Beats include treasury and risk management, governance and accounting, retirement and benefits, and technology. Senior Writer CMP Media 1997  –  2007  (10 years) Produce news, features, and other content for monthly publication, a joint venture of CMP and Indian publisher Cybermedia which covers outsourcing and/or offshoring of corporate services such as application development and maintenance, customer service, finance and accounting, and R&D. Meet with service providers based overseas. Senior Writer CMP Media 1997  –  2007  (10 years) Produce news, features, and other content for monthly publication, a joint venture of CMP and Indian publisher Cybermedia which covers outsourcing and/or offshoring of corporate services such as application development and maintenance, customer service, finance and accounting, and R&D. Meet with service providers based overseas. Associate Editor InformationWeek, 2003 2003  –  2006  (3 years) Primary beat reporter for financial-services industry; secondary beats include regulatory compliance and IT governance. Meet regularly with financial-industry execs to discuss trends in the payments industry, risk management, electronic trading and other topics of mutual interest. Associate Editor InformationWeek, 2003 2003  –  2006  (3 years) Primary beat reporter for financial-services industry; secondary beats include regulatory compliance and IT governance. Meet regularly with financial-industry execs to discuss trends in the payments industry, risk management, electronic trading and other topics of mutual interest. Executive Editor Bank Systems & Technology, 2000 1997  –  2003  (6 years) Provided editorial direction and content for monthly trade publication serving 24,000 executives. Assigned and edited stories for staff editors and freelancers. Moderated Financial Tech Expo and represented company at industry events. Executive Editor Bank Systems & Technology, 2000 1997  –  2003  (6 years) Provided editorial direction and content for monthly trade publication serving 24,000 executives. Assigned and edited stories for staff editors and freelancers. Moderated Financial Tech Expo and represented company at industry events. Senior Editor Bank Systems & Technology January 1997  –  January 2000  (3 years 1 month) Helped modernize 34-year-old trade publication with news and features covering all facets of $50 billion IT segment, including risk management, enterprise systems, business processes, outsourcing, e-commerce, e-payments, CRM, corporate banking, IT management, antitrust, privacy. Senior Editor Bank Systems & Technology January 1997  –  January 2000  (3 years 1 month) Helped modernize 34-year-old trade publication with news and features covering all facets of $50 billion IT segment, including risk management, enterprise systems, business processes, outsourcing, e-commerce, e-payments, CRM, corporate banking, IT management, antitrust, privacy. Senior Research Analyst METROPOLITAN LIFE INSURANCE CO January 1988  –  January 1996  (8 years 1 month) Co-managed $500,000 per year technology research service for diverse population of knowledge workers. Oversaw paper-to-electronic conversion of research service delivery method, resulting in 1,000% subscriber increase (from 25 to 250+) over 2 years. Negotiated contracts with research suppliers (Gartner, Forrester, etc.) Senior Research Analyst METROPOLITAN LIFE INSURANCE CO January 1988  –  January 1996  (8 years 1 month) Co-managed $500,000 per year technology research service for diverse population of knowledge workers. Oversaw paper-to-electronic conversion of research service delivery method, resulting in 1,000% subscriber increase (from 25 to 250+) over 2 years. Negotiated contracts with research suppliers (Gartner, Forrester, etc.) Senior Research Associate Gartner Group January 1986  –  January 1988  (2 years 1 month) Senior Research Associate Gartner Group January 1986  –  January 1988  (2 years 1 month) Summer Intern Chemical Bank 1985  –  1985  (less than a year) Summer Intern Chemical Bank 1985  –  1985  (less than a year) Sales Representative Computer Factory January 1981  –  January 1984  (3 years 1 month) Sales Representative Computer Factory January 1981  –  January 1984  (3 years 1 month) Systems Engineer Prime Computer January 1979  –  January 1981  (2 years 1 month) Systems Engineer Prime Computer January 1979  –  January 1981  (2 years 1 month) Rates Examiner NYS Dept. of Transp. January 1973  –  January 1976  (3 years 1 month) Rates Examiner NYS Dept. of Transp. January 1973  –  January 1976  (3 years 1 month) Skills Risk Management Editorial Publications Financial Markets Hedge Funds Storytelling E-commerce Publishing Finance Trading CRM Journalism Social Media New Media Skills  Risk Management Editorial Publications Financial Markets Hedge Funds Storytelling E-commerce Publishing Finance Trading CRM Journalism Social Media New Media Risk Management Editorial Publications Financial Markets Hedge Funds Storytelling E-commerce Publishing Finance Trading CRM Journalism Social Media New Media Risk Management Editorial Publications Financial Markets Hedge Funds Storytelling E-commerce Publishing Finance Trading CRM Journalism Social Media New Media Education Columbia University - Columbia Business School MBA,  finance 1984  – 1986 Columbia University Graduate School of Business MBA,  Finance/Marketing; Computer Science 1984  – 1986 State University of NY at Albany BS,  Physics 1969  – 1973 University at Albany, SUNY BS,  physics 1969  – 1973 Columbia University - Columbia Business School MBA,  finance 1984  – 1986 Columbia University - Columbia Business School MBA,  finance 1984  – 1986 Columbia University - Columbia Business School MBA,  finance 1984  – 1986 Columbia University Graduate School of Business MBA,  Finance/Marketing; Computer Science 1984  – 1986 Columbia University Graduate School of Business MBA,  Finance/Marketing; Computer Science 1984  – 1986 Columbia University Graduate School of Business MBA,  Finance/Marketing; Computer Science 1984  – 1986 State University of NY at Albany BS,  Physics 1969  – 1973 State University of NY at Albany BS,  Physics 1969  – 1973 State University of NY at Albany BS,  Physics 1969  – 1973 University at Albany, SUNY BS,  physics 1969  – 1973 University at Albany, SUNY BS,  physics 1969  – 1973 University at Albany, SUNY BS,  physics 1969  – 1973 ", "Summary Business development executive focused on developing partnerships and ecosystems that bring value to businesses, governments and non-profits. \n \nI've been an active member of the Silicon Valley & international startup communities for the past 14 years. In that time, I've worked on scouting new startups for Accenture's R&D & venture groups, serving as Program Chair of the SVASE Startup University, a non-profit program which has helped 10,000 entrepreneurs. Most recently, I was Director, High Tech & Clean Tech for Hubtech21, the San Francisco business accelerator for growth companies from the Paris Region and France. \nI hold a Masters of Science degree in Business & Broadcast Journalism from Columbia University and worked as a producer for CNN Financial News. \n \nCurrently, I am Senior Economic Officer with the Consulate General of the Netherlands in San Francisco and responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue  \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Summary Business development executive focused on developing partnerships and ecosystems that bring value to businesses, governments and non-profits. \n \nI've been an active member of the Silicon Valley & international startup communities for the past 14 years. In that time, I've worked on scouting new startups for Accenture's R&D & venture groups, serving as Program Chair of the SVASE Startup University, a non-profit program which has helped 10,000 entrepreneurs. Most recently, I was Director, High Tech & Clean Tech for Hubtech21, the San Francisco business accelerator for growth companies from the Paris Region and France. \nI hold a Masters of Science degree in Business & Broadcast Journalism from Columbia University and worked as a producer for CNN Financial News. \n \nCurrently, I am Senior Economic Officer with the Consulate General of the Netherlands in San Francisco and responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue  \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Business development executive focused on developing partnerships and ecosystems that bring value to businesses, governments and non-profits. \n \nI've been an active member of the Silicon Valley & international startup communities for the past 14 years. In that time, I've worked on scouting new startups for Accenture's R&D & venture groups, serving as Program Chair of the SVASE Startup University, a non-profit program which has helped 10,000 entrepreneurs. Most recently, I was Director, High Tech & Clean Tech for Hubtech21, the San Francisco business accelerator for growth companies from the Paris Region and France. \nI hold a Masters of Science degree in Business & Broadcast Journalism from Columbia University and worked as a producer for CNN Financial News. \n \nCurrently, I am Senior Economic Officer with the Consulate General of the Netherlands in San Francisco and responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue  \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Business development executive focused on developing partnerships and ecosystems that bring value to businesses, governments and non-profits. \n \nI've been an active member of the Silicon Valley & international startup communities for the past 14 years. In that time, I've worked on scouting new startups for Accenture's R&D & venture groups, serving as Program Chair of the SVASE Startup University, a non-profit program which has helped 10,000 entrepreneurs. Most recently, I was Director, High Tech & Clean Tech for Hubtech21, the San Francisco business accelerator for growth companies from the Paris Region and France. \nI hold a Masters of Science degree in Business & Broadcast Journalism from Columbia University and worked as a producer for CNN Financial News. \n \nCurrently, I am Senior Economic Officer with the Consulate General of the Netherlands in San Francisco and responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue  \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Experience Senior Economic Officer Consulate General of the Netherlands August 2011  – Present (4 years 1 month) San Francisco Responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Director, High Tech and Clean Tech Hubtech21 May 2009  –  August 2011  (2 years 4 months) San Francisco Bay Area Now French Tech Hub, Hubtech21, with HQ in Paris, France, is the San Francisco-based French accelerator specializing in helping European technology companies establish a presence in the United States market, providing a range of corporate development services including business development, marketing and funding development.  \n \nHired to build the Hubtech21 West Coast presence from the ground up.  \n \n \nAchievements include:  \n \n* Building and driving business development efforts for Hubtech21’s portfolio of European clients across a variety of industries including the technology and energy sectors.  \n* Developing and fostering relationships with over 50 electric utilities across the United States  \n* Leveraging relationships with over 60 investors in the green tech realm to help build interest in one of Hubtech21’s green energy portfolio clients \n* Advising European regional development agencies on U.S. developments in IT and green tech \n* Identifying key IT and green tech stakeholders and increasing their engagement with Hubtech's clients such as Systematic, the largest software cluster in France \n* Hosting delegations of European corporations and institutions to help develop their U.S. missions. Advisory Board Member and Program Chair, SVASE Startup-University SVASE, Silicon Valley Association for Startup Entrepreneurs April 2006  –  July 2011  (5 years 4 months) SVASE, now SVForum, was the Silicon Valley Association for Startup Entrepreneurs, the largest, fastest-growing non-profit dedicated to helping startup entrepreneurs build successful companies. \n \nI was responsible for overseeing its welcome mat program, the Startup University, a series of lunch meetings on critical startup issues for early stage venture companies. Working with a dedicated team, I've built out the program, increasing audience numbers 200%  \n \nResponsibilities include: \n* Managing & executing bi-monthly events, including recruiting speakers from the venture capital & startup community, frequently moderating panels as well as managing marketing & outreach of each event Funding and Marcom Development Advisor at MinuteFix MinuteFix April 2008  –  April 2009  (1 year 1 month) Columnist High Tech Analysis Magazine December 2006  –  April 2009  (2 years 5 months) High Tech Analysis is a Dutch business magazine focusing on key trends and developments in the technology realm for high-level executives MarCom & Business/Funding Development Advisor for Startups Various Startups 2005  –  2009  (4 years) Helping emerging growth companies build out their business in the Valley. From leading all aspects of fundraising efforts through the development and management of core initiatives such as MarCom development and execution to business model and positioning restructuring and pitch preparation to connecting the company with funding targets, leveraging my extensive network of investors and other experts in the Silicon Valley ecosystem. Associate Editor InformationWeek's Optimize Magazine 2004  –  2005  (1 year) Responsible for editing, assigning and writing stories on the current topics and trends facing CIOs in the areas of business strategy and execution, and emerging technologies for this spinoff of InformationWeek for high-level technology executives. Consultant, Center for Strategic Research Accenture 1999  –  2001  (2 years) Palo Alto, San FRANcisco Bay Area Researched, identified & communicated market & investment trends and opportunities in the technology sector for Accenture's global internal and external clientele. \n \nBuilt relationships with internal and external resources capable of meeting Accenture's and its clients' tech needs, and helped develop associated strategic visions. Managed a multi-location team of editors. Producer CNN Financial News 1997  –  1998  (1 year) Senior Economic Officer Consulate General of the Netherlands August 2011  – Present (4 years 1 month) San Francisco Responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Senior Economic Officer Consulate General of the Netherlands August 2011  – Present (4 years 1 month) San Francisco Responsible for: \n \n• Generation of seven-figure deal flows for European businesses in the technology, sustainability, clean tech and energy sectors \n• Building cross-industry partnerships to deliver new business and higher revenue \n• Mentoring technology startups & helping them navigate and connect with the Silicon Valley ecosystem \n• Developing and execution of targeted engagement experience programs for CXO’s of European Fortune 50s Director, High Tech and Clean Tech Hubtech21 May 2009  –  August 2011  (2 years 4 months) San Francisco Bay Area Now French Tech Hub, Hubtech21, with HQ in Paris, France, is the San Francisco-based French accelerator specializing in helping European technology companies establish a presence in the United States market, providing a range of corporate development services including business development, marketing and funding development.  \n \nHired to build the Hubtech21 West Coast presence from the ground up.  \n \n \nAchievements include:  \n \n* Building and driving business development efforts for Hubtech21’s portfolio of European clients across a variety of industries including the technology and energy sectors.  \n* Developing and fostering relationships with over 50 electric utilities across the United States  \n* Leveraging relationships with over 60 investors in the green tech realm to help build interest in one of Hubtech21’s green energy portfolio clients \n* Advising European regional development agencies on U.S. developments in IT and green tech \n* Identifying key IT and green tech stakeholders and increasing their engagement with Hubtech's clients such as Systematic, the largest software cluster in France \n* Hosting delegations of European corporations and institutions to help develop their U.S. missions. Director, High Tech and Clean Tech Hubtech21 May 2009  –  August 2011  (2 years 4 months) San Francisco Bay Area Now French Tech Hub, Hubtech21, with HQ in Paris, France, is the San Francisco-based French accelerator specializing in helping European technology companies establish a presence in the United States market, providing a range of corporate development services including business development, marketing and funding development.  \n \nHired to build the Hubtech21 West Coast presence from the ground up.  \n \n \nAchievements include:  \n \n* Building and driving business development efforts for Hubtech21’s portfolio of European clients across a variety of industries including the technology and energy sectors.  \n* Developing and fostering relationships with over 50 electric utilities across the United States  \n* Leveraging relationships with over 60 investors in the green tech realm to help build interest in one of Hubtech21’s green energy portfolio clients \n* Advising European regional development agencies on U.S. developments in IT and green tech \n* Identifying key IT and green tech stakeholders and increasing their engagement with Hubtech's clients such as Systematic, the largest software cluster in France \n* Hosting delegations of European corporations and institutions to help develop their U.S. missions. Advisory Board Member and Program Chair, SVASE Startup-University SVASE, Silicon Valley Association for Startup Entrepreneurs April 2006  –  July 2011  (5 years 4 months) SVASE, now SVForum, was the Silicon Valley Association for Startup Entrepreneurs, the largest, fastest-growing non-profit dedicated to helping startup entrepreneurs build successful companies. \n \nI was responsible for overseeing its welcome mat program, the Startup University, a series of lunch meetings on critical startup issues for early stage venture companies. Working with a dedicated team, I've built out the program, increasing audience numbers 200%  \n \nResponsibilities include: \n* Managing & executing bi-monthly events, including recruiting speakers from the venture capital & startup community, frequently moderating panels as well as managing marketing & outreach of each event Advisory Board Member and Program Chair, SVASE Startup-University SVASE, Silicon Valley Association for Startup Entrepreneurs April 2006  –  July 2011  (5 years 4 months) SVASE, now SVForum, was the Silicon Valley Association for Startup Entrepreneurs, the largest, fastest-growing non-profit dedicated to helping startup entrepreneurs build successful companies. \n \nI was responsible for overseeing its welcome mat program, the Startup University, a series of lunch meetings on critical startup issues for early stage venture companies. Working with a dedicated team, I've built out the program, increasing audience numbers 200%  \n \nResponsibilities include: \n* Managing & executing bi-monthly events, including recruiting speakers from the venture capital & startup community, frequently moderating panels as well as managing marketing & outreach of each event Funding and Marcom Development Advisor at MinuteFix MinuteFix April 2008  –  April 2009  (1 year 1 month) Funding and Marcom Development Advisor at MinuteFix MinuteFix April 2008  –  April 2009  (1 year 1 month) Columnist High Tech Analysis Magazine December 2006  –  April 2009  (2 years 5 months) High Tech Analysis is a Dutch business magazine focusing on key trends and developments in the technology realm for high-level executives Columnist High Tech Analysis Magazine December 2006  –  April 2009  (2 years 5 months) High Tech Analysis is a Dutch business magazine focusing on key trends and developments in the technology realm for high-level executives MarCom & Business/Funding Development Advisor for Startups Various Startups 2005  –  2009  (4 years) Helping emerging growth companies build out their business in the Valley. From leading all aspects of fundraising efforts through the development and management of core initiatives such as MarCom development and execution to business model and positioning restructuring and pitch preparation to connecting the company with funding targets, leveraging my extensive network of investors and other experts in the Silicon Valley ecosystem. MarCom & Business/Funding Development Advisor for Startups Various Startups 2005  –  2009  (4 years) Helping emerging growth companies build out their business in the Valley. From leading all aspects of fundraising efforts through the development and management of core initiatives such as MarCom development and execution to business model and positioning restructuring and pitch preparation to connecting the company with funding targets, leveraging my extensive network of investors and other experts in the Silicon Valley ecosystem. Associate Editor InformationWeek's Optimize Magazine 2004  –  2005  (1 year) Responsible for editing, assigning and writing stories on the current topics and trends facing CIOs in the areas of business strategy and execution, and emerging technologies for this spinoff of InformationWeek for high-level technology executives. Associate Editor InformationWeek's Optimize Magazine 2004  –  2005  (1 year) Responsible for editing, assigning and writing stories on the current topics and trends facing CIOs in the areas of business strategy and execution, and emerging technologies for this spinoff of InformationWeek for high-level technology executives. Consultant, Center for Strategic Research Accenture 1999  –  2001  (2 years) Palo Alto, San FRANcisco Bay Area Researched, identified & communicated market & investment trends and opportunities in the technology sector for Accenture's global internal and external clientele. \n \nBuilt relationships with internal and external resources capable of meeting Accenture's and its clients' tech needs, and helped develop associated strategic visions. Managed a multi-location team of editors. Consultant, Center for Strategic Research Accenture 1999  –  2001  (2 years) Palo Alto, San FRANcisco Bay Area Researched, identified & communicated market & investment trends and opportunities in the technology sector for Accenture's global internal and external clientele. \n \nBuilt relationships with internal and external resources capable of meeting Accenture's and its clients' tech needs, and helped develop associated strategic visions. Managed a multi-location team of editors. Producer CNN Financial News 1997  –  1998  (1 year) Producer CNN Financial News 1997  –  1998  (1 year) Languages English Native or bilingual proficiency Dutch Native or bilingual proficiency German Limited working proficiency French Limited working proficiency HTML Limited working proficiency English Native or bilingual proficiency Dutch Native or bilingual proficiency German Limited working proficiency French Limited working proficiency HTML Limited working proficiency English Native or bilingual proficiency Dutch Native or bilingual proficiency German Limited working proficiency French Limited working proficiency HTML Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Limited working proficiency Skills Business Development Start-ups Speech Public Speaking Entrepreneurship Market Research Strategy Competitive Analysis Marketing Business Strategy Product Management Venture Capital Go-to-market Strategy Social Media Business Planning Portfolio Management Networking Marketing Communications International Business Lead Generation E-commerce Market Analysis Team Management Public Relations Fundraising Corporate Development Nonprofits Strategic Partnerships Analysis Management Finance See 16+     See less Skills  Business Development Start-ups Speech Public Speaking Entrepreneurship Market Research Strategy Competitive Analysis Marketing Business Strategy Product Management Venture Capital Go-to-market Strategy Social Media Business Planning Portfolio Management Networking Marketing Communications International Business Lead Generation E-commerce Market Analysis Team Management Public Relations Fundraising Corporate Development Nonprofits Strategic Partnerships Analysis Management Finance See 16+     See less Business Development Start-ups Speech Public Speaking Entrepreneurship Market Research Strategy Competitive Analysis Marketing Business Strategy Product Management Venture Capital Go-to-market Strategy Social Media Business Planning Portfolio Management Networking Marketing Communications International Business Lead Generation E-commerce Market Analysis Team Management Public Relations Fundraising Corporate Development Nonprofits Strategic Partnerships Analysis Management Finance See 16+     See less Business Development Start-ups Speech Public Speaking Entrepreneurship Market Research Strategy Competitive Analysis Marketing Business Strategy Product Management Venture Capital Go-to-market Strategy Social Media Business Planning Portfolio Management Networking Marketing Communications International Business Lead Generation E-commerce Market Analysis Team Management Public Relations Fundraising Corporate Development Nonprofits Strategic Partnerships Analysis Management Finance See 16+     See less Education Columbia University MSc 1996  – 1997 Columbia University MSc 1996  – 1997 Columbia University MSc 1996  – 1997 Columbia University MSc 1996  – 1997 ", "Skills Lifestyle Magazines Publishing Editing Public Speaking Blogging Corporate Communications Books Consultants Green Green Building Holistic Health Health Home Home Staging Yoga Travel Writing Art Direction Spa Beauty Natural Foods Natural Products wabi-sabi Writing Sustainability Education Web Content Copy Editing Editorial Press Releases Content Development Copywriting Public Relations Beauty Industry Feature Articles Web Design Publications New Media Television Fact-checking Storytelling Newspapers Proofreading Web Content Management News Writing Content Management Online Publishing Publicity Radio Marketing Digital Media See 35+     See less Skills  Lifestyle Magazines Publishing Editing Public Speaking Blogging Corporate Communications Books Consultants Green Green Building Holistic Health Health Home Home Staging Yoga Travel Writing Art Direction Spa Beauty Natural Foods Natural Products wabi-sabi Writing Sustainability Education Web Content Copy Editing Editorial Press Releases Content Development Copywriting Public Relations Beauty Industry Feature Articles Web Design Publications New Media Television Fact-checking Storytelling Newspapers Proofreading Web Content Management News Writing Content Management Online Publishing Publicity Radio Marketing Digital Media See 35+     See less Lifestyle Magazines Publishing Editing Public Speaking Blogging Corporate Communications Books Consultants Green Green Building Holistic Health Health Home Home Staging Yoga Travel Writing Art Direction Spa Beauty Natural Foods Natural Products wabi-sabi Writing Sustainability Education Web Content Copy Editing Editorial Press Releases Content Development Copywriting Public Relations Beauty Industry Feature Articles Web Design Publications New Media Television Fact-checking Storytelling Newspapers Proofreading Web Content Management News Writing Content Management Online Publishing Publicity Radio Marketing Digital Media See 35+     See less Lifestyle Magazines Publishing Editing Public Speaking Blogging Corporate Communications Books Consultants Green Green Building Holistic Health Health Home Home Staging Yoga Travel Writing Art Direction Spa Beauty Natural Foods Natural Products wabi-sabi Writing Sustainability Education Web Content Copy Editing Editorial Press Releases Content Development Copywriting Public Relations Beauty Industry Feature Articles Web Design Publications New Media Television Fact-checking Storytelling Newspapers Proofreading Web Content Management News Writing Content Management Online Publishing Publicity Radio Marketing Digital Media See 35+     See less ", "Summary Experienced communications professional and former journalist who brings a unique combination of skills in brand positioning, corporate communications, media and social strategies, issues management, writing and content strategy. \n \nI am currently head of the global technology practice at APCO Worldwide, an independent, global communications, stakeholder engagement and business strategy firm. \n \nExcelling in managing large, complex clients with significant business and communications challenges, I lead teams on accounts in sectors spanning mobile/wireless, IT services, big data and more, driving corporate, product and stakeholder communications.  \n \nPrior to APCO, I led Text100 North America for five years, navigating the region through the global economic crisis, driving unprecedented stability that included the retention of all top clients and restoring growth each of the last three years, including a period of over 20% growth. \n \nI previously ran the agency's New York office, helping to greatly expand its client roster and establishing it as a flagship office. I joined Text100 to lead the IBM account, which I supervised in the US and globally, driving greater collaboration, creating and training teams on new methodologies and ensuring quality service across 15 markets. \n \nPrior to Text100, I led the NY technology practice for MSL, leading a high performance team on a large portfolio of tech clients, but also collaborating across the corporate, consumer and healthcare practices, as well as driving many of the agency's branding engagements. \n \nBefore joining the dark side I was a journalist at CMP Publications, where I wrote for InformationWeek and Open Systems Today. I started my career as a newspaper reporter covering politics, business and police beats for NY and NJ metro area dailies. \n \nSpecialties: Brand positioning, corporate communications, executive media training, writing, agency management and leadership, sales. Summary Experienced communications professional and former journalist who brings a unique combination of skills in brand positioning, corporate communications, media and social strategies, issues management, writing and content strategy. \n \nI am currently head of the global technology practice at APCO Worldwide, an independent, global communications, stakeholder engagement and business strategy firm. \n \nExcelling in managing large, complex clients with significant business and communications challenges, I lead teams on accounts in sectors spanning mobile/wireless, IT services, big data and more, driving corporate, product and stakeholder communications.  \n \nPrior to APCO, I led Text100 North America for five years, navigating the region through the global economic crisis, driving unprecedented stability that included the retention of all top clients and restoring growth each of the last three years, including a period of over 20% growth. \n \nI previously ran the agency's New York office, helping to greatly expand its client roster and establishing it as a flagship office. I joined Text100 to lead the IBM account, which I supervised in the US and globally, driving greater collaboration, creating and training teams on new methodologies and ensuring quality service across 15 markets. \n \nPrior to Text100, I led the NY technology practice for MSL, leading a high performance team on a large portfolio of tech clients, but also collaborating across the corporate, consumer and healthcare practices, as well as driving many of the agency's branding engagements. \n \nBefore joining the dark side I was a journalist at CMP Publications, where I wrote for InformationWeek and Open Systems Today. I started my career as a newspaper reporter covering politics, business and police beats for NY and NJ metro area dailies. \n \nSpecialties: Brand positioning, corporate communications, executive media training, writing, agency management and leadership, sales. Experienced communications professional and former journalist who brings a unique combination of skills in brand positioning, corporate communications, media and social strategies, issues management, writing and content strategy. \n \nI am currently head of the global technology practice at APCO Worldwide, an independent, global communications, stakeholder engagement and business strategy firm. \n \nExcelling in managing large, complex clients with significant business and communications challenges, I lead teams on accounts in sectors spanning mobile/wireless, IT services, big data and more, driving corporate, product and stakeholder communications.  \n \nPrior to APCO, I led Text100 North America for five years, navigating the region through the global economic crisis, driving unprecedented stability that included the retention of all top clients and restoring growth each of the last three years, including a period of over 20% growth. \n \nI previously ran the agency's New York office, helping to greatly expand its client roster and establishing it as a flagship office. I joined Text100 to lead the IBM account, which I supervised in the US and globally, driving greater collaboration, creating and training teams on new methodologies and ensuring quality service across 15 markets. \n \nPrior to Text100, I led the NY technology practice for MSL, leading a high performance team on a large portfolio of tech clients, but also collaborating across the corporate, consumer and healthcare practices, as well as driving many of the agency's branding engagements. \n \nBefore joining the dark side I was a journalist at CMP Publications, where I wrote for InformationWeek and Open Systems Today. I started my career as a newspaper reporter covering politics, business and police beats for NY and NJ metro area dailies. \n \nSpecialties: Brand positioning, corporate communications, executive media training, writing, agency management and leadership, sales. Experienced communications professional and former journalist who brings a unique combination of skills in brand positioning, corporate communications, media and social strategies, issues management, writing and content strategy. \n \nI am currently head of the global technology practice at APCO Worldwide, an independent, global communications, stakeholder engagement and business strategy firm. \n \nExcelling in managing large, complex clients with significant business and communications challenges, I lead teams on accounts in sectors spanning mobile/wireless, IT services, big data and more, driving corporate, product and stakeholder communications.  \n \nPrior to APCO, I led Text100 North America for five years, navigating the region through the global economic crisis, driving unprecedented stability that included the retention of all top clients and restoring growth each of the last three years, including a period of over 20% growth. \n \nI previously ran the agency's New York office, helping to greatly expand its client roster and establishing it as a flagship office. I joined Text100 to lead the IBM account, which I supervised in the US and globally, driving greater collaboration, creating and training teams on new methodologies and ensuring quality service across 15 markets. \n \nPrior to Text100, I led the NY technology practice for MSL, leading a high performance team on a large portfolio of tech clients, but also collaborating across the corporate, consumer and healthcare practices, as well as driving many of the agency's branding engagements. \n \nBefore joining the dark side I was a journalist at CMP Publications, where I wrote for InformationWeek and Open Systems Today. I started my career as a newspaper reporter covering politics, business and police beats for NY and NJ metro area dailies. \n \nSpecialties: Brand positioning, corporate communications, executive media training, writing, agency management and leadership, sales. Experience Global Technology Practice Chair APCO Worldwide May 2013  – Present (2 years 4 months) Leads the global technology practice, focusing on business strategy, brand positioning, corporate communications and stakeholder engagement for technology companies. Co-led the development of ATDigitalHealth, an innovative joint venture with my previous agency, Text100, to help organizations leverage communications to accelerate the understanding and adoption of digital health technologies. The practice also helps companies across all industries to navigate the business, policy and communications issues related to the implementation of technology, helping those companies maximize the opportunities and mitigate the risks associated with technologies ranging from big data to mobile to security. Regional Director Text 100 January 2003  –  September 2012  (9 years 9 months) As regional director for Text100 North America, managed four offices in the U.S. and partnerships in Canada and Latin America, successfully leading the region through significant challenges such as the global economic crisis, driving greater stability and ultimately delivering significant double-digit growth. Previously ran the New York office, leading the expansion and diversification of its client roster. Also led the IBM account globally, driving greater integration across 15 countries, while delivering new services across the account. VP Manning, Selvage & Lee 1995  –  2003  (8 years) Ran the NY technology practice, driving growth through greater collaboration with the corporate, healthcare and consumer practices, as well as partnering with other offices in the network. Led the creation of a life sciences sector and brought in the agency's first significant life sciences clients. Associate Editor InformationWeek 1994  –  1995  (1 year) Section editor for hardware and peripherals Associate Editor Open Systems Today 1992  –  1994  (2 years) Reporter Daily Record 1991  –  1992  (1 year) Parsippany, NJ General assignment reporter Assistant City Editor Herald News 1986  –  1991  (5 years) Passaic, NJ Held a number of positions, including Assistant City Editor, and covered beats ranging from State House to court house. Covered stories that included corruption investigations and arrests of two NJ mayors, the Baby M custody trial, the Ice Man murder trial, a high profile gubernatorial election and the funeral of mob boss Anthony 'Tony Pro' Provenzano. Global Technology Practice Chair APCO Worldwide May 2013  – Present (2 years 4 months) Leads the global technology practice, focusing on business strategy, brand positioning, corporate communications and stakeholder engagement for technology companies. Co-led the development of ATDigitalHealth, an innovative joint venture with my previous agency, Text100, to help organizations leverage communications to accelerate the understanding and adoption of digital health technologies. The practice also helps companies across all industries to navigate the business, policy and communications issues related to the implementation of technology, helping those companies maximize the opportunities and mitigate the risks associated with technologies ranging from big data to mobile to security. Global Technology Practice Chair APCO Worldwide May 2013  – Present (2 years 4 months) Leads the global technology practice, focusing on business strategy, brand positioning, corporate communications and stakeholder engagement for technology companies. Co-led the development of ATDigitalHealth, an innovative joint venture with my previous agency, Text100, to help organizations leverage communications to accelerate the understanding and adoption of digital health technologies. The practice also helps companies across all industries to navigate the business, policy and communications issues related to the implementation of technology, helping those companies maximize the opportunities and mitigate the risks associated with technologies ranging from big data to mobile to security. Regional Director Text 100 January 2003  –  September 2012  (9 years 9 months) As regional director for Text100 North America, managed four offices in the U.S. and partnerships in Canada and Latin America, successfully leading the region through significant challenges such as the global economic crisis, driving greater stability and ultimately delivering significant double-digit growth. Previously ran the New York office, leading the expansion and diversification of its client roster. Also led the IBM account globally, driving greater integration across 15 countries, while delivering new services across the account. Regional Director Text 100 January 2003  –  September 2012  (9 years 9 months) As regional director for Text100 North America, managed four offices in the U.S. and partnerships in Canada and Latin America, successfully leading the region through significant challenges such as the global economic crisis, driving greater stability and ultimately delivering significant double-digit growth. Previously ran the New York office, leading the expansion and diversification of its client roster. Also led the IBM account globally, driving greater integration across 15 countries, while delivering new services across the account. VP Manning, Selvage & Lee 1995  –  2003  (8 years) Ran the NY technology practice, driving growth through greater collaboration with the corporate, healthcare and consumer practices, as well as partnering with other offices in the network. Led the creation of a life sciences sector and brought in the agency's first significant life sciences clients. VP Manning, Selvage & Lee 1995  –  2003  (8 years) Ran the NY technology practice, driving growth through greater collaboration with the corporate, healthcare and consumer practices, as well as partnering with other offices in the network. Led the creation of a life sciences sector and brought in the agency's first significant life sciences clients. Associate Editor InformationWeek 1994  –  1995  (1 year) Section editor for hardware and peripherals Associate Editor InformationWeek 1994  –  1995  (1 year) Section editor for hardware and peripherals Associate Editor Open Systems Today 1992  –  1994  (2 years) Associate Editor Open Systems Today 1992  –  1994  (2 years) Reporter Daily Record 1991  –  1992  (1 year) Parsippany, NJ General assignment reporter Reporter Daily Record 1991  –  1992  (1 year) Parsippany, NJ General assignment reporter Assistant City Editor Herald News 1986  –  1991  (5 years) Passaic, NJ Held a number of positions, including Assistant City Editor, and covered beats ranging from State House to court house. Covered stories that included corruption investigations and arrests of two NJ mayors, the Baby M custody trial, the Ice Man murder trial, a high profile gubernatorial election and the funeral of mob boss Anthony 'Tony Pro' Provenzano. Assistant City Editor Herald News 1986  –  1991  (5 years) Passaic, NJ Held a number of positions, including Assistant City Editor, and covered beats ranging from State House to court house. Covered stories that included corruption investigations and arrests of two NJ mayors, the Baby M custody trial, the Ice Man murder trial, a high profile gubernatorial election and the funeral of mob boss Anthony 'Tony Pro' Provenzano. Skills Writing Corporate Communications Executive Media Training Public Relations Message Development Team Leadership Management Positioning Media Relations Messaging Strategic Communications Social Media Training Digital Marketing Integrated Marketing Strategic Planning Business Development Digital Strategy Brand Management Crisis Communications Marketing Strategy New Business Development Content Strategy Analyst Relations Business Strategy Communication Training Internal Communications Thought Leadership See 13+     See less Skills  Writing Corporate Communications Executive Media Training Public Relations Message Development Team Leadership Management Positioning Media Relations Messaging Strategic Communications Social Media Training Digital Marketing Integrated Marketing Strategic Planning Business Development Digital Strategy Brand Management Crisis Communications Marketing Strategy New Business Development Content Strategy Analyst Relations Business Strategy Communication Training Internal Communications Thought Leadership See 13+     See less Writing Corporate Communications Executive Media Training Public Relations Message Development Team Leadership Management Positioning Media Relations Messaging Strategic Communications Social Media Training Digital Marketing Integrated Marketing Strategic Planning Business Development Digital Strategy Brand Management Crisis Communications Marketing Strategy New Business Development Content Strategy Analyst Relations Business Strategy Communication Training Internal Communications Thought Leadership See 13+     See less Writing Corporate Communications Executive Media Training Public Relations Message Development Team Leadership Management Positioning Media Relations Messaging Strategic Communications Social Media Training Digital Marketing Integrated Marketing Strategic Planning Business Development Digital Strategy Brand Management Crisis Communications Marketing Strategy New Business Development Content Strategy Analyst Relations Business Strategy Communication Training Internal Communications Thought Leadership See 13+     See less Education State University of New York at New Paltz BA,  English ,  Journalism 1985  – 1986 Activities and Societies:  Fencing ,  racquetball ,  softball University of Delaware 1984  – 1985 Activities and Societies:  Fencing club founder and captain Penn State University Engineering 1983  – 1984 Activities and Societies:  Navy ROTC State University of New York at New Paltz BA,  English ,  Journalism 1985  – 1986 Activities and Societies:  Fencing ,  racquetball ,  softball State University of New York at New Paltz BA,  English ,  Journalism 1985  – 1986 Activities and Societies:  Fencing ,  racquetball ,  softball State University of New York at New Paltz BA,  English ,  Journalism 1985  – 1986 Activities and Societies:  Fencing ,  racquetball ,  softball University of Delaware 1984  – 1985 Activities and Societies:  Fencing club founder and captain University of Delaware 1984  – 1985 Activities and Societies:  Fencing club founder and captain University of Delaware 1984  – 1985 Activities and Societies:  Fencing club founder and captain Penn State University Engineering 1983  – 1984 Activities and Societies:  Navy ROTC Penn State University Engineering 1983  – 1984 Activities and Societies:  Navy ROTC Penn State University Engineering 1983  – 1984 Activities and Societies:  Navy ROTC ", "Experience Associate Editor InformationWeek January 2015  – Present (8 months) New York, NY Report on InformationWeek's key technology verticals (specifically Windows/operating systems) with focus on IT leadership audience; contribute news analysis, opinion pieces and image galleries; cultivate reader engagement and conversation through on-site commenting and social media promotions on Twitter, LinkedIn, Google+; help build website traffic with social outreach and SEO; assist in daily flow of copy and assignments; collaborate with editorial team to develop copy and story ideas; attend and cover industry events. Health Writer Feather Magazine August 2014  – Present (1 year 1 month) Pitch and write articles on news and trends in health, fitness, nutrition, mental wellness and lifestyle; adhere to deadlines and magazine's editorial guidelines.  Freelance Writer Bisk Education August 2013  – Present (2 years 1 month) Create educational content for college and university websites; adhere to style and publication guidelines for each institution. Associate Editor Insurance & Technology (UBM Tech) November 2013  –  January 2015  (1 year 3 months) New York, NY Pitched, researched, wrote and edited articles on news and trends in hardware, software, IT strategy, data analytics, customer experience, social media and mobile that affect the insurance industry; interviewed industry executives and technology professionals; managed and published contributed content; strategically promoted content via social media to drive web traffic; represented brand at industry events; assisted in migration to new community-focused online platform. Staff Writer InformationWeek, InformationWeek Education (UBM Tech) June 2013  –  November 2013  (6 months) New York, NY Researched, wrote and edited articles and slideshows on news and trends in technology and education technology; promoted content through social media; represented brand at industry events. Editorial Intern Promo Marketing (North American Publishing Company) September 2012  –  May 2013  (9 months) Philadelphia, PA Print: researched and wrote long-form articles on news and analysis in promotional products; interviewed industry professionals; selected products for recommendations page and wrote corresponding descriptions; reviewed page proofs; organized, verified and entered updated information into magazine database for 2013 Buyer's Guide issue. \nOnline: blogged about industry trends for \"Editor's Picks\" webpage. Athletic Ticket Office Student Worker Villanova University September 2009  –  May 2013  (3 years 9 months) Villanova, PA Editorial Intern Get Fit Get Life January 2012  –  January 2013  (1 year 1 month) Pitched, researched and wrote weekly blog posts on news and trends in health, fitness, nutrition and mental wellness; interviewed health and fitness professionals; regularly participated in group editorial meetings. Editorial Intern Lovelyish (Xanga.com) May 2012  –  August 2012  (4 months) New York, NY Researched and wrote weekly blog posts on news and trends in fashion, beauty, celebrities, entertainment, pop culture and lifestyle; edited and formatted guest posts; consistently ranked as \"Top 5\" contributor by generating thousands of views per post throughout duration of internship. Associate Editor Club Lighthouse Publishing April 2011  –  August 2012  (1 year 5 months) Reviewed YA and romance novels by international authors for errors in grammar, spelling, punctuation and syntax. Head Lifeguard American Canoe Association May 2009  –  August 2012  (3 years 4 months) Harriman State Park, NY Organized and managed lifeguard schedule; delegated tasks to guards; maintained safe waterfront environment. Marketing/Communications Intern Craft and Hobby Association May 2011  –  August 2011  (4 months) Elmwood Park, NJ Updated, edited and fact-checked directory for CHA 2011 Summer Trade Show; wrote speeches and newsletter articles; promoted content through Facebook and Twitter. Lifeguard Waldwick Municipal Pool June 2007  –  August 2010  (3 years 3 months) Waldwick, NJ Associate Editor InformationWeek January 2015  – Present (8 months) New York, NY Report on InformationWeek's key technology verticals (specifically Windows/operating systems) with focus on IT leadership audience; contribute news analysis, opinion pieces and image galleries; cultivate reader engagement and conversation through on-site commenting and social media promotions on Twitter, LinkedIn, Google+; help build website traffic with social outreach and SEO; assist in daily flow of copy and assignments; collaborate with editorial team to develop copy and story ideas; attend and cover industry events. Associate Editor InformationWeek January 2015  – Present (8 months) New York, NY Report on InformationWeek's key technology verticals (specifically Windows/operating systems) with focus on IT leadership audience; contribute news analysis, opinion pieces and image galleries; cultivate reader engagement and conversation through on-site commenting and social media promotions on Twitter, LinkedIn, Google+; help build website traffic with social outreach and SEO; assist in daily flow of copy and assignments; collaborate with editorial team to develop copy and story ideas; attend and cover industry events. Health Writer Feather Magazine August 2014  – Present (1 year 1 month) Pitch and write articles on news and trends in health, fitness, nutrition, mental wellness and lifestyle; adhere to deadlines and magazine's editorial guidelines.  Health Writer Feather Magazine August 2014  – Present (1 year 1 month) Pitch and write articles on news and trends in health, fitness, nutrition, mental wellness and lifestyle; adhere to deadlines and magazine's editorial guidelines.  Freelance Writer Bisk Education August 2013  – Present (2 years 1 month) Create educational content for college and university websites; adhere to style and publication guidelines for each institution. Freelance Writer Bisk Education August 2013  – Present (2 years 1 month) Create educational content for college and university websites; adhere to style and publication guidelines for each institution. Associate Editor Insurance & Technology (UBM Tech) November 2013  –  January 2015  (1 year 3 months) New York, NY Pitched, researched, wrote and edited articles on news and trends in hardware, software, IT strategy, data analytics, customer experience, social media and mobile that affect the insurance industry; interviewed industry executives and technology professionals; managed and published contributed content; strategically promoted content via social media to drive web traffic; represented brand at industry events; assisted in migration to new community-focused online platform. Associate Editor Insurance & Technology (UBM Tech) November 2013  –  January 2015  (1 year 3 months) New York, NY Pitched, researched, wrote and edited articles on news and trends in hardware, software, IT strategy, data analytics, customer experience, social media and mobile that affect the insurance industry; interviewed industry executives and technology professionals; managed and published contributed content; strategically promoted content via social media to drive web traffic; represented brand at industry events; assisted in migration to new community-focused online platform. Staff Writer InformationWeek, InformationWeek Education (UBM Tech) June 2013  –  November 2013  (6 months) New York, NY Researched, wrote and edited articles and slideshows on news and trends in technology and education technology; promoted content through social media; represented brand at industry events. Staff Writer InformationWeek, InformationWeek Education (UBM Tech) June 2013  –  November 2013  (6 months) New York, NY Researched, wrote and edited articles and slideshows on news and trends in technology and education technology; promoted content through social media; represented brand at industry events. Editorial Intern Promo Marketing (North American Publishing Company) September 2012  –  May 2013  (9 months) Philadelphia, PA Print: researched and wrote long-form articles on news and analysis in promotional products; interviewed industry professionals; selected products for recommendations page and wrote corresponding descriptions; reviewed page proofs; organized, verified and entered updated information into magazine database for 2013 Buyer's Guide issue. \nOnline: blogged about industry trends for \"Editor's Picks\" webpage. Editorial Intern Promo Marketing (North American Publishing Company) September 2012  –  May 2013  (9 months) Philadelphia, PA Print: researched and wrote long-form articles on news and analysis in promotional products; interviewed industry professionals; selected products for recommendations page and wrote corresponding descriptions; reviewed page proofs; organized, verified and entered updated information into magazine database for 2013 Buyer's Guide issue. \nOnline: blogged about industry trends for \"Editor's Picks\" webpage. Athletic Ticket Office Student Worker Villanova University September 2009  –  May 2013  (3 years 9 months) Villanova, PA Athletic Ticket Office Student Worker Villanova University September 2009  –  May 2013  (3 years 9 months) Villanova, PA Editorial Intern Get Fit Get Life January 2012  –  January 2013  (1 year 1 month) Pitched, researched and wrote weekly blog posts on news and trends in health, fitness, nutrition and mental wellness; interviewed health and fitness professionals; regularly participated in group editorial meetings. Editorial Intern Get Fit Get Life January 2012  –  January 2013  (1 year 1 month) Pitched, researched and wrote weekly blog posts on news and trends in health, fitness, nutrition and mental wellness; interviewed health and fitness professionals; regularly participated in group editorial meetings. Editorial Intern Lovelyish (Xanga.com) May 2012  –  August 2012  (4 months) New York, NY Researched and wrote weekly blog posts on news and trends in fashion, beauty, celebrities, entertainment, pop culture and lifestyle; edited and formatted guest posts; consistently ranked as \"Top 5\" contributor by generating thousands of views per post throughout duration of internship. Editorial Intern Lovelyish (Xanga.com) May 2012  –  August 2012  (4 months) New York, NY Researched and wrote weekly blog posts on news and trends in fashion, beauty, celebrities, entertainment, pop culture and lifestyle; edited and formatted guest posts; consistently ranked as \"Top 5\" contributor by generating thousands of views per post throughout duration of internship. Associate Editor Club Lighthouse Publishing April 2011  –  August 2012  (1 year 5 months) Reviewed YA and romance novels by international authors for errors in grammar, spelling, punctuation and syntax. Associate Editor Club Lighthouse Publishing April 2011  –  August 2012  (1 year 5 months) Reviewed YA and romance novels by international authors for errors in grammar, spelling, punctuation and syntax. Head Lifeguard American Canoe Association May 2009  –  August 2012  (3 years 4 months) Harriman State Park, NY Organized and managed lifeguard schedule; delegated tasks to guards; maintained safe waterfront environment. Head Lifeguard American Canoe Association May 2009  –  August 2012  (3 years 4 months) Harriman State Park, NY Organized and managed lifeguard schedule; delegated tasks to guards; maintained safe waterfront environment. Marketing/Communications Intern Craft and Hobby Association May 2011  –  August 2011  (4 months) Elmwood Park, NJ Updated, edited and fact-checked directory for CHA 2011 Summer Trade Show; wrote speeches and newsletter articles; promoted content through Facebook and Twitter. Marketing/Communications Intern Craft and Hobby Association May 2011  –  August 2011  (4 months) Elmwood Park, NJ Updated, edited and fact-checked directory for CHA 2011 Summer Trade Show; wrote speeches and newsletter articles; promoted content through Facebook and Twitter. Lifeguard Waldwick Municipal Pool June 2007  –  August 2010  (3 years 3 months) Waldwick, NJ Lifeguard Waldwick Municipal Pool June 2007  –  August 2010  (3 years 3 months) Waldwick, NJ Skills Blogging Feature Articles Editing Social Media Writing Magazines Facebook Journalism Proofreading Copy Editing WordPress SEO Press Releases Web Content Newsletters Ap Style Creative Writing Social Media Marketing Social Networking Research Publications AP Style See 7+     See less Skills  Blogging Feature Articles Editing Social Media Writing Magazines Facebook Journalism Proofreading Copy Editing WordPress SEO Press Releases Web Content Newsletters Ap Style Creative Writing Social Media Marketing Social Networking Research Publications AP Style See 7+     See less Blogging Feature Articles Editing Social Media Writing Magazines Facebook Journalism Proofreading Copy Editing WordPress SEO Press Releases Web Content Newsletters Ap Style Creative Writing Social Media Marketing Social Networking Research Publications AP Style See 7+     See less Blogging Feature Articles Editing Social Media Writing Magazines Facebook Journalism Proofreading Copy Editing WordPress SEO Press Releases Web Content Newsletters Ap Style Creative Writing Social Media Marketing Social Networking Research Publications AP Style See 7+     See less Education Villanova University BA,  English 2009  – 2013 Activities and Societies:  Irish Dance Team ,  Villanova Ambassadors ,  Kappa Delta Sorority Bergen County Academies 2005  – 2009 Villanova University BA,  English 2009  – 2013 Activities and Societies:  Irish Dance Team ,  Villanova Ambassadors ,  Kappa Delta Sorority Villanova University BA,  English 2009  – 2013 Activities and Societies:  Irish Dance Team ,  Villanova Ambassadors ,  Kappa Delta Sorority Villanova University BA,  English 2009  – 2013 Activities and Societies:  Irish Dance Team ,  Villanova Ambassadors ,  Kappa Delta Sorority Bergen County Academies 2005  – 2009 Bergen County Academies 2005  – 2009 Bergen County Academies 2005  – 2009 ", "Experience Research Manager Weill Cornell Medical College April 2015  – Present (5 months) greater new york city area Senior Manager, Prospect Research Wildlife Conservation Society December 2013  –  March 2015  (1 year 4 months) Bronx, New York Managed a team of two researchers servicing Major Gifts, Corporate, and Foundation teams; instituted a number of best practices which entailed: the implementation of proactive research; upgrading research document templates and formats; streamlining event bio production resulting in a more efficient process; expanding professional development opportunities for the team (APRA, MARC); implementing a rating tool which helped to minimize the volume of short form research requests. This also empowered fundraisers with the ability to more accurately prioritize prospect pools. Implemented a regular Prospect Review Meeting (PRM) to discuss capacity, connections, and prospect assignments from names identified in the weekly gift log. I acquired a database screening tool (Donorscape) which better empowered the team to proactively uncover prospects with high affinity; created a pipeline of high net worth individuals which helped to update prospect records more frequently than was previously practiced. Lastly, I trained my team on how to manage their relationships with fundraisers; providing better customer service; which helped to re-brand the research department within Global Resources (development). Research Analyst New York University May 2007  –  November 2013  (6 years 7 months) Greater New York City Area Produced proactive and reactive prospect research for various colleges at NYU (College of Dentistry, College of Nursing,Gallatin School of Individualized Study, Institute of Fine Arts,Liberal Studies, Silver School of Social Work, and Tisch School of the Arts). Delivered research for directors of development and managed working partnerships. Identified College of Dentistry's largest billionaire prospect to date. Provided proactive research in absence of development directors at College of Nursing for 1 year. Co-created and led an introductory Prospect Research workshop for 5 years. Created strategies for proactive identification within challenging prospect pools. Extensive experience with Advance and Excel, Lexis Nexis, iWave, Research Point, and WealthEngine. Prospect Research Analyst New York Medical College April 2006  –  April 2007  (1 year 1 month) Valhalla, New York Managed research requests from a team of four fundraisers; mainly performed reactive research while proactively identifying alumni with major gift capacity. Major Gift Coordinator/Prospect Researcher National Constitution Center 2003  –  2006  (3 years) Philadelphia, PA Research/Fact checker Entertainment Weekly, Martha Stewart Weddings, Vanity Fair 2001  –  2003  (2 years) New York, NY Provided research and fact checking services to entertainment and lifestyle publications in the print magazine industry (Vanity Fair, Entertainment Weekly, Martha Stewart Weddings) Research Editor Latina Media Ventures 2000  –  2001  (1 year) Greater New York City Area Managed team of fact checkers and hired freelancers. Vetted feature stories, and various sections. Trained interns and worked closely with managing editor. Research Editor Blaze Magazine 1999  –  2000  (1 year) Greater New York City Area Hired as Research Editor after one month. Managed team of fact checkers, vetting articles with record labels, publicists, music public relations firms, and retailers. Verified research with legal team once a month. Left publication one prior to it's shutdown. Associate Editor InformationWeek 1994  –  1998  (4 years) Manhassett, NY Began as an editorial intern, answering phones,sending faxes, and writing short blurbs. Promoted to assistant editor covering hardware peripherals for a year. Became associate editor covering applications development; web applications and solutions for the Y2K bug. Gained experience breaking exclusive news. Wrote feature stories and breaking IT news for email, online, and print publications. Research Manager Weill Cornell Medical College April 2015  – Present (5 months) greater new york city area Research Manager Weill Cornell Medical College April 2015  – Present (5 months) greater new york city area Senior Manager, Prospect Research Wildlife Conservation Society December 2013  –  March 2015  (1 year 4 months) Bronx, New York Managed a team of two researchers servicing Major Gifts, Corporate, and Foundation teams; instituted a number of best practices which entailed: the implementation of proactive research; upgrading research document templates and formats; streamlining event bio production resulting in a more efficient process; expanding professional development opportunities for the team (APRA, MARC); implementing a rating tool which helped to minimize the volume of short form research requests. This also empowered fundraisers with the ability to more accurately prioritize prospect pools. Implemented a regular Prospect Review Meeting (PRM) to discuss capacity, connections, and prospect assignments from names identified in the weekly gift log. I acquired a database screening tool (Donorscape) which better empowered the team to proactively uncover prospects with high affinity; created a pipeline of high net worth individuals which helped to update prospect records more frequently than was previously practiced. Lastly, I trained my team on how to manage their relationships with fundraisers; providing better customer service; which helped to re-brand the research department within Global Resources (development). Senior Manager, Prospect Research Wildlife Conservation Society December 2013  –  March 2015  (1 year 4 months) Bronx, New York Managed a team of two researchers servicing Major Gifts, Corporate, and Foundation teams; instituted a number of best practices which entailed: the implementation of proactive research; upgrading research document templates and formats; streamlining event bio production resulting in a more efficient process; expanding professional development opportunities for the team (APRA, MARC); implementing a rating tool which helped to minimize the volume of short form research requests. This also empowered fundraisers with the ability to more accurately prioritize prospect pools. Implemented a regular Prospect Review Meeting (PRM) to discuss capacity, connections, and prospect assignments from names identified in the weekly gift log. I acquired a database screening tool (Donorscape) which better empowered the team to proactively uncover prospects with high affinity; created a pipeline of high net worth individuals which helped to update prospect records more frequently than was previously practiced. Lastly, I trained my team on how to manage their relationships with fundraisers; providing better customer service; which helped to re-brand the research department within Global Resources (development). Research Analyst New York University May 2007  –  November 2013  (6 years 7 months) Greater New York City Area Produced proactive and reactive prospect research for various colleges at NYU (College of Dentistry, College of Nursing,Gallatin School of Individualized Study, Institute of Fine Arts,Liberal Studies, Silver School of Social Work, and Tisch School of the Arts). Delivered research for directors of development and managed working partnerships. Identified College of Dentistry's largest billionaire prospect to date. Provided proactive research in absence of development directors at College of Nursing for 1 year. Co-created and led an introductory Prospect Research workshop for 5 years. Created strategies for proactive identification within challenging prospect pools. Extensive experience with Advance and Excel, Lexis Nexis, iWave, Research Point, and WealthEngine. Research Analyst New York University May 2007  –  November 2013  (6 years 7 months) Greater New York City Area Produced proactive and reactive prospect research for various colleges at NYU (College of Dentistry, College of Nursing,Gallatin School of Individualized Study, Institute of Fine Arts,Liberal Studies, Silver School of Social Work, and Tisch School of the Arts). Delivered research for directors of development and managed working partnerships. Identified College of Dentistry's largest billionaire prospect to date. Provided proactive research in absence of development directors at College of Nursing for 1 year. Co-created and led an introductory Prospect Research workshop for 5 years. Created strategies for proactive identification within challenging prospect pools. Extensive experience with Advance and Excel, Lexis Nexis, iWave, Research Point, and WealthEngine. Prospect Research Analyst New York Medical College April 2006  –  April 2007  (1 year 1 month) Valhalla, New York Managed research requests from a team of four fundraisers; mainly performed reactive research while proactively identifying alumni with major gift capacity. Prospect Research Analyst New York Medical College April 2006  –  April 2007  (1 year 1 month) Valhalla, New York Managed research requests from a team of four fundraisers; mainly performed reactive research while proactively identifying alumni with major gift capacity. Major Gift Coordinator/Prospect Researcher National Constitution Center 2003  –  2006  (3 years) Philadelphia, PA Major Gift Coordinator/Prospect Researcher National Constitution Center 2003  –  2006  (3 years) Philadelphia, PA Research/Fact checker Entertainment Weekly, Martha Stewart Weddings, Vanity Fair 2001  –  2003  (2 years) New York, NY Provided research and fact checking services to entertainment and lifestyle publications in the print magazine industry (Vanity Fair, Entertainment Weekly, Martha Stewart Weddings) Research/Fact checker Entertainment Weekly, Martha Stewart Weddings, Vanity Fair 2001  –  2003  (2 years) New York, NY Provided research and fact checking services to entertainment and lifestyle publications in the print magazine industry (Vanity Fair, Entertainment Weekly, Martha Stewart Weddings) Research Editor Latina Media Ventures 2000  –  2001  (1 year) Greater New York City Area Managed team of fact checkers and hired freelancers. Vetted feature stories, and various sections. Trained interns and worked closely with managing editor. Research Editor Latina Media Ventures 2000  –  2001  (1 year) Greater New York City Area Managed team of fact checkers and hired freelancers. Vetted feature stories, and various sections. Trained interns and worked closely with managing editor. Research Editor Blaze Magazine 1999  –  2000  (1 year) Greater New York City Area Hired as Research Editor after one month. Managed team of fact checkers, vetting articles with record labels, publicists, music public relations firms, and retailers. Verified research with legal team once a month. Left publication one prior to it's shutdown. Research Editor Blaze Magazine 1999  –  2000  (1 year) Greater New York City Area Hired as Research Editor after one month. Managed team of fact checkers, vetting articles with record labels, publicists, music public relations firms, and retailers. Verified research with legal team once a month. Left publication one prior to it's shutdown. Associate Editor InformationWeek 1994  –  1998  (4 years) Manhassett, NY Began as an editorial intern, answering phones,sending faxes, and writing short blurbs. Promoted to assistant editor covering hardware peripherals for a year. Became associate editor covering applications development; web applications and solutions for the Y2K bug. Gained experience breaking exclusive news. Wrote feature stories and breaking IT news for email, online, and print publications. Associate Editor InformationWeek 1994  –  1998  (4 years) Manhassett, NY Began as an editorial intern, answering phones,sending faxes, and writing short blurbs. Promoted to assistant editor covering hardware peripherals for a year. Became associate editor covering applications development; web applications and solutions for the Y2K bug. Gained experience breaking exclusive news. Wrote feature stories and breaking IT news for email, online, and print publications. Skills Customer Service Fundraising Social Networking Magazines Research Public Speaking Nonprofits Leadership Higher Education Data Analysis Editing Blogging Community Outreach Social Media Skills  Customer Service Fundraising Social Networking Magazines Research Public Speaking Nonprofits Leadership Higher Education Data Analysis Editing Blogging Community Outreach Social Media Customer Service Fundraising Social Networking Magazines Research Public Speaking Nonprofits Leadership Higher Education Data Analysis Editing Blogging Community Outreach Social Media Customer Service Fundraising Social Networking Magazines Research Public Speaking Nonprofits Leadership Higher Education Data Analysis Editing Blogging Community Outreach Social Media Education Syracuse University Bachelor of Arts (B.A.),  Psychology Syracuse University Bachelor of Arts (B.A.),  Psychology Syracuse University Bachelor of Arts (B.A.),  Psychology Syracuse University Bachelor of Arts (B.A.),  Psychology ", "Experience Deputy Metro Editor The New York Times Metro News Editor The New York Times December 2013  – Present (1 year 9 months) Greater New York City Area Deputy Metro Editor The New York Times Deputy Metro Editor The New York Times Metro News Editor The New York Times December 2013  – Present (1 year 9 months) Greater New York City Area Metro News Editor The New York Times December 2013  – Present (1 year 9 months) Greater New York City Area Languages   Skills Journalism Digital Strategy Audience Development Blogging Editing Newspapers Newspaper Web Content Management Magazines CMS Web Content Copy Editing Web Editing Website Development Online Communities HTML + CSS Wordpress Content Writing SEO copywriting Magazine Writing Production Audio Editing Reporting See 8+     See less Skills  Journalism Digital Strategy Audience Development Blogging Editing Newspapers Newspaper Web Content Management Magazines CMS Web Content Copy Editing Web Editing Website Development Online Communities HTML + CSS Wordpress Content Writing SEO copywriting Magazine Writing Production Audio Editing Reporting See 8+     See less Journalism Digital Strategy Audience Development Blogging Editing Newspapers Newspaper Web Content Management Magazines CMS Web Content Copy Editing Web Editing Website Development Online Communities HTML + CSS Wordpress Content Writing SEO copywriting Magazine Writing Production Audio Editing Reporting See 8+     See less Journalism Digital Strategy Audience Development Blogging Editing Newspapers Newspaper Web Content Management Magazines CMS Web Content Copy Editing Web Editing Website Development Online Communities HTML + CSS Wordpress Content Writing SEO copywriting Magazine Writing Production Audio Editing Reporting See 8+     See less Education Northwestern University M.S. 2004  – 2005 Colgate University B.A. 1993  – 1997 Northwestern University M.S. 2004  – 2005 Northwestern University M.S. 2004  – 2005 Northwestern University M.S. 2004  – 2005 Colgate University B.A. 1993  – 1997 Colgate University B.A. 1993  – 1997 Colgate University B.A. 1993  – 1997 Honors & Awards ", "Summary I'm an award-winning journalist and an authority on the intersection of games and technology. I'm currently working on freelance projects and as a contributing editor to Forbes Magazine. \n \nI'm a digital media native, but equally at home in print: I've launched blogs, reported cover stories, produced streaming video and edited magazines. Amazon.com selected my first book, Of Dice and Men, as one of the best non-fiction books of 2013. \n \nI have a deep understanding of the technology business, and have appeared as an expert source on television programs including Good Morning America and Closing Bell, in newspapers including The New York Times and The Washington Post, and at conferences including Comic-Con and PAX. I've been invited to speak to organizations including Google, Microsoft and Sony. \n \nI'm a primate and a skeptic. I have root access and I'm not afraid to use it. I can make stone tools and arrowheads. I drop science like Galileo dropped the orange. I solemnly swear that I am up to no good. Summary I'm an award-winning journalist and an authority on the intersection of games and technology. I'm currently working on freelance projects and as a contributing editor to Forbes Magazine. \n \nI'm a digital media native, but equally at home in print: I've launched blogs, reported cover stories, produced streaming video and edited magazines. Amazon.com selected my first book, Of Dice and Men, as one of the best non-fiction books of 2013. \n \nI have a deep understanding of the technology business, and have appeared as an expert source on television programs including Good Morning America and Closing Bell, in newspapers including The New York Times and The Washington Post, and at conferences including Comic-Con and PAX. I've been invited to speak to organizations including Google, Microsoft and Sony. \n \nI'm a primate and a skeptic. I have root access and I'm not afraid to use it. I can make stone tools and arrowheads. I drop science like Galileo dropped the orange. I solemnly swear that I am up to no good. I'm an award-winning journalist and an authority on the intersection of games and technology. I'm currently working on freelance projects and as a contributing editor to Forbes Magazine. \n \nI'm a digital media native, but equally at home in print: I've launched blogs, reported cover stories, produced streaming video and edited magazines. Amazon.com selected my first book, Of Dice and Men, as one of the best non-fiction books of 2013. \n \nI have a deep understanding of the technology business, and have appeared as an expert source on television programs including Good Morning America and Closing Bell, in newspapers including The New York Times and The Washington Post, and at conferences including Comic-Con and PAX. I've been invited to speak to organizations including Google, Microsoft and Sony. \n \nI'm a primate and a skeptic. I have root access and I'm not afraid to use it. I can make stone tools and arrowheads. I drop science like Galileo dropped the orange. I solemnly swear that I am up to no good. I'm an award-winning journalist and an authority on the intersection of games and technology. I'm currently working on freelance projects and as a contributing editor to Forbes Magazine. \n \nI'm a digital media native, but equally at home in print: I've launched blogs, reported cover stories, produced streaming video and edited magazines. Amazon.com selected my first book, Of Dice and Men, as one of the best non-fiction books of 2013. \n \nI have a deep understanding of the technology business, and have appeared as an expert source on television programs including Good Morning America and Closing Bell, in newspapers including The New York Times and The Washington Post, and at conferences including Comic-Con and PAX. I've been invited to speak to organizations including Google, Microsoft and Sony. \n \nI'm a primate and a skeptic. I have root access and I'm not afraid to use it. I can make stone tools and arrowheads. I drop science like Galileo dropped the orange. I solemnly swear that I am up to no good. Experience Writer & Editor Freelance August 2013  – Present (2 years 1 month) I work on a variety of projects for print and online publications. Contributing Editor Forbes August 2013  – Present (2 years 1 month) I write deeply reported feature stories for Forbes Magazine and maintain a blog on Forbes.com. Senior Editor Forbes August 2004  –  July 2013  (9 years) I worked on web, print and video projects on a wide variety of topics, both as a reporter and an editor. Highlights of my tenure include serving as editor of Forbes' Lifestyle section, co-authoring the annual Fictional 15, and launching Forbes’ annual rankings of America’s Best Colleges and The World’s Most Powerful People. Associate Editor InformationWeek September 2000  –  August 2004  (4 years) Covered telecommunications and networking for leading information technology magazine. Researcher Newsday Media Group January 1998  –  January 2000  (2 years 1 month) Worked with Newsday's Investigations department on a series of long-term projects, including a groundbreaking computer-aided analysis of campaign finance data in state and national elections. Writer & Editor Freelance August 2013  – Present (2 years 1 month) I work on a variety of projects for print and online publications. Writer & Editor Freelance August 2013  – Present (2 years 1 month) I work on a variety of projects for print and online publications. Contributing Editor Forbes August 2013  – Present (2 years 1 month) I write deeply reported feature stories for Forbes Magazine and maintain a blog on Forbes.com. Contributing Editor Forbes August 2013  – Present (2 years 1 month) I write deeply reported feature stories for Forbes Magazine and maintain a blog on Forbes.com. Senior Editor Forbes August 2004  –  July 2013  (9 years) I worked on web, print and video projects on a wide variety of topics, both as a reporter and an editor. Highlights of my tenure include serving as editor of Forbes' Lifestyle section, co-authoring the annual Fictional 15, and launching Forbes’ annual rankings of America’s Best Colleges and The World’s Most Powerful People. Senior Editor Forbes August 2004  –  July 2013  (9 years) I worked on web, print and video projects on a wide variety of topics, both as a reporter and an editor. Highlights of my tenure include serving as editor of Forbes' Lifestyle section, co-authoring the annual Fictional 15, and launching Forbes’ annual rankings of America’s Best Colleges and The World’s Most Powerful People. Associate Editor InformationWeek September 2000  –  August 2004  (4 years) Covered telecommunications and networking for leading information technology magazine. Associate Editor InformationWeek September 2000  –  August 2004  (4 years) Covered telecommunications and networking for leading information technology magazine. Researcher Newsday Media Group January 1998  –  January 2000  (2 years 1 month) Worked with Newsday's Investigations department on a series of long-term projects, including a groundbreaking computer-aided analysis of campaign finance data in state and national elections. Researcher Newsday Media Group January 1998  –  January 2000  (2 years 1 month) Worked with Newsday's Investigations department on a series of long-term projects, including a groundbreaking computer-aided analysis of campaign finance data in state and national elections. Skills Editing Editorial Magazines Research Blogging Journalism Writing Video Publishing Content Strategy Web Content Social Networking Television Storytelling Social Media Creative Writing Copy Editing Content Development Digital Media Copywriting Feature Articles New Media Books Video Games Board Games See 10+     See less Skills  Editing Editorial Magazines Research Blogging Journalism Writing Video Publishing Content Strategy Web Content Social Networking Television Storytelling Social Media Creative Writing Copy Editing Content Development Digital Media Copywriting Feature Articles New Media Books Video Games Board Games See 10+     See less Editing Editorial Magazines Research Blogging Journalism Writing Video Publishing Content Strategy Web Content Social Networking Television Storytelling Social Media Creative Writing Copy Editing Content Development Digital Media Copywriting Feature Articles New Media Books Video Games Board Games See 10+     See less Editing Editorial Magazines Research Blogging Journalism Writing Video Publishing Content Strategy Web Content Social Networking Television Storytelling Social Media Creative Writing Copy Editing Content Development Digital Media Copywriting Feature Articles New Media Books Video Games Board Games See 10+     See less Honors & Awards Of Dice and Men: \"Best Books of the Year\" Lists Amazon.com, Hudson Booksellers, GeekDad 2013 Bronze Medal, Best Individual Profile American Society of Business Publication Editors 2004 Gold Medal, Best Web Feature American Society of Business Publication Editors 2001 Additional Honors & Awards • 2009 Military Reporters & Editors Journalism Contest winner, \"Special Report: Supply Lines\" \n• 2007 Forbes.com won the Jesse Neal award for Best Website.  \n• 2003 United Business Media Excellence In Editorial Award for Best General Feature \n• 2001 InformationWeek.com won the Jesse Neal award for Best Website Of Dice and Men: \"Best Books of the Year\" Lists Amazon.com, Hudson Booksellers, GeekDad 2013 Of Dice and Men: \"Best Books of the Year\" Lists Amazon.com, Hudson Booksellers, GeekDad 2013 Of Dice and Men: \"Best Books of the Year\" Lists Amazon.com, Hudson Booksellers, GeekDad 2013 Bronze Medal, Best Individual Profile American Society of Business Publication Editors 2004 Bronze Medal, Best Individual Profile American Society of Business Publication Editors 2004 Bronze Medal, Best Individual Profile American Society of Business Publication Editors 2004 Gold Medal, Best Web Feature American Society of Business Publication Editors 2001 Gold Medal, Best Web Feature American Society of Business Publication Editors 2001 Gold Medal, Best Web Feature American Society of Business Publication Editors 2001 Additional Honors & Awards • 2009 Military Reporters & Editors Journalism Contest winner, \"Special Report: Supply Lines\" \n• 2007 Forbes.com won the Jesse Neal award for Best Website.  \n• 2003 United Business Media Excellence In Editorial Award for Best General Feature \n• 2001 InformationWeek.com won the Jesse Neal award for Best Website Additional Honors & Awards • 2009 Military Reporters & Editors Journalism Contest winner, \"Special Report: Supply Lines\" \n• 2007 Forbes.com won the Jesse Neal award for Best Website.  \n• 2003 United Business Media Excellence In Editorial Award for Best General Feature \n• 2001 InformationWeek.com won the Jesse Neal award for Best Website Additional Honors & Awards • 2009 Military Reporters & Editors Journalism Contest winner, \"Special Report: Supply Lines\" \n• 2007 Forbes.com won the Jesse Neal award for Best Website.  \n• 2003 United Business Media Excellence In Editorial Award for Best General Feature \n• 2001 InformationWeek.com won the Jesse Neal award for Best Website ", "Skills Digital Media SEO Social Media Blogging Editorial Online Marketing Online Advertising Digital Marketing Copywriting Storytelling Feature Articles Social Media Marketing New Media Journalism Integrated Marketing Social Networking Marketing Communications Marketing Digital Strategy Magazines Email Marketing Editing Market Research SEM Content Strategy Content Development Publishing Advertising Newspapers Web Content Copy Editing Media Relations Newsletters Corporate Communications Facebook Analytics General Awesomeness Search Awesomeness Writing See 25+     See less Skills  Digital Media SEO Social Media Blogging Editorial Online Marketing Online Advertising Digital Marketing Copywriting Storytelling Feature Articles Social Media Marketing New Media Journalism Integrated Marketing Social Networking Marketing Communications Marketing Digital Strategy Magazines Email Marketing Editing Market Research SEM Content Strategy Content Development Publishing Advertising Newspapers Web Content Copy Editing Media Relations Newsletters Corporate Communications Facebook Analytics General Awesomeness Search Awesomeness Writing See 25+     See less Digital Media SEO Social Media Blogging Editorial Online Marketing Online Advertising Digital Marketing Copywriting Storytelling Feature Articles Social Media Marketing New Media Journalism Integrated Marketing Social Networking Marketing Communications Marketing Digital Strategy Magazines Email Marketing Editing Market Research SEM Content Strategy Content Development Publishing Advertising Newspapers Web Content Copy Editing Media Relations Newsletters Corporate Communications Facebook Analytics General Awesomeness Search Awesomeness Writing See 25+     See less Digital Media SEO Social Media Blogging Editorial Online Marketing Online Advertising Digital Marketing Copywriting Storytelling Feature Articles Social Media Marketing New Media Journalism Integrated Marketing Social Networking Marketing Communications Marketing Digital Strategy Magazines Email Marketing Editing Market Research SEM Content Strategy Content Development Publishing Advertising Newspapers Web Content Copy Editing Media Relations Newsletters Corporate Communications Facebook Analytics General Awesomeness Search Awesomeness Writing See 25+     See less Honors & Awards ", "Languages English Native or bilingual proficiency Finnish Professional working proficiency English Native or bilingual proficiency Finnish Professional working proficiency English Native or bilingual proficiency Finnish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Journalism Teaching Entrepreneurship Research Editing Science Internal Communications Translation Social Media Blogging Public Speaking Editorial Writing Digital Media Copy Editing New Media Content Management Publications Newspapers News Writing Feature Articles Online Journalism Content Strategy Creative Writing Storytelling Proofreading Web Content Content Development Publishing Media Relations Magazines See 16+     See less Skills  Journalism Teaching Entrepreneurship Research Editing Science Internal Communications Translation Social Media Blogging Public Speaking Editorial Writing Digital Media Copy Editing New Media Content Management Publications Newspapers News Writing Feature Articles Online Journalism Content Strategy Creative Writing Storytelling Proofreading Web Content Content Development Publishing Media Relations Magazines See 16+     See less Journalism Teaching Entrepreneurship Research Editing Science Internal Communications Translation Social Media Blogging Public Speaking Editorial Writing Digital Media Copy Editing New Media Content Management Publications Newspapers News Writing Feature Articles Online Journalism Content Strategy Creative Writing Storytelling Proofreading Web Content Content Development Publishing Media Relations Magazines See 16+     See less Journalism Teaching Entrepreneurship Research Editing Science Internal Communications Translation Social Media Blogging Public Speaking Editorial Writing Digital Media Copy Editing New Media Content Management Publications Newspapers News Writing Feature Articles Online Journalism Content Strategy Creative Writing Storytelling Proofreading Web Content Content Development Publishing Media Relations Magazines See 16+     See less Honors & Awards ", "Experience Content Editor, SeafoodSource.com Diversified Communications HQ November 2014  – Present (10 months) Portland, Maine Area Associate Site Editor, Networking Media Group TechTarget March 2013  –  October 2014  (1 year 8 months) Freelance Writer Various online and print publications May 2010  –  May 2013  (3 years 1 month) Associate Editor, InformationWeek UBM Tech September 2012  –  March 2013  (7 months) New Media Producer MedTech Media June 2012  –  August 2012  (3 months) Portland, Maine Area Web Content Producer MedTech Media August 2011  –  June 2012  (11 months) Spotlight Editor RedCoat Publishing October 2010  –  July 2011  (10 months) Copywriter Bridge Communications Inc. July 2010  –  October 2010  (4 months) Editorial Intern Performer Magazine January 2010  –  May 2010  (5 months) Editor-in-Chief The 1851 Chronicle September 2009  –  May 2010  (9 months) Content Editor, SeafoodSource.com Diversified Communications HQ November 2014  – Present (10 months) Portland, Maine Area Content Editor, SeafoodSource.com Diversified Communications HQ November 2014  – Present (10 months) Portland, Maine Area Associate Site Editor, Networking Media Group TechTarget March 2013  –  October 2014  (1 year 8 months) Associate Site Editor, Networking Media Group TechTarget March 2013  –  October 2014  (1 year 8 months) Freelance Writer Various online and print publications May 2010  –  May 2013  (3 years 1 month) Freelance Writer Various online and print publications May 2010  –  May 2013  (3 years 1 month) Associate Editor, InformationWeek UBM Tech September 2012  –  March 2013  (7 months) Associate Editor, InformationWeek UBM Tech September 2012  –  March 2013  (7 months) New Media Producer MedTech Media June 2012  –  August 2012  (3 months) Portland, Maine Area New Media Producer MedTech Media June 2012  –  August 2012  (3 months) Portland, Maine Area Web Content Producer MedTech Media August 2011  –  June 2012  (11 months) Web Content Producer MedTech Media August 2011  –  June 2012  (11 months) Spotlight Editor RedCoat Publishing October 2010  –  July 2011  (10 months) Spotlight Editor RedCoat Publishing October 2010  –  July 2011  (10 months) Copywriter Bridge Communications Inc. July 2010  –  October 2010  (4 months) Copywriter Bridge Communications Inc. July 2010  –  October 2010  (4 months) Editorial Intern Performer Magazine January 2010  –  May 2010  (5 months) Editorial Intern Performer Magazine January 2010  –  May 2010  (5 months) Editor-in-Chief The 1851 Chronicle September 2009  –  May 2010  (9 months) Editor-in-Chief The 1851 Chronicle September 2009  –  May 2010  (9 months) Languages   Skills Skills     Education Lasell College Bachelor of Arts Degree 2008  – 2010 Manchester Community College 2006  – 2008 Lasell College Bachelor of Arts Degree 2008  – 2010 Lasell College Bachelor of Arts Degree 2008  – 2010 Lasell College Bachelor of Arts Degree 2008  – 2010 Manchester Community College 2006  – 2008 Manchester Community College 2006  – 2008 Manchester Community College 2006  – 2008 Honors & Awards 2014 Regional Azbee Award: Best Use of Social Media ASPBE June 2014 Won Gold for social media use on the SearchSDN.com site 2014 Regional Azbee Award: Best Photo Gallery/Slideshow ASPBE June 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com. 2014 National Azbee Award: Best Photo Gallery/Slideshow ASPBE July 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com Star Award Diversified Communications May 2015 Additional Honors & Awards TechTarget 2013: \nQ3 All-Star award winner for TechTarget's Networking Media Group \nBull's Eye Award -- Best Community Engagement, SearchSDN.com \nBull's Eye Award -- Best Photo Story \n \nMedTech Media 2012: \nListed in the #HIT100, a crowd-sourced nomination of influential individuals or organizations in the #HealthIT and #HITsm communities. 2014 Regional Azbee Award: Best Use of Social Media ASPBE June 2014 Won Gold for social media use on the SearchSDN.com site 2014 Regional Azbee Award: Best Use of Social Media ASPBE June 2014 Won Gold for social media use on the SearchSDN.com site 2014 Regional Azbee Award: Best Use of Social Media ASPBE June 2014 Won Gold for social media use on the SearchSDN.com site 2014 Regional Azbee Award: Best Photo Gallery/Slideshow ASPBE June 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com. 2014 Regional Azbee Award: Best Photo Gallery/Slideshow ASPBE June 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com. 2014 Regional Azbee Award: Best Photo Gallery/Slideshow ASPBE June 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com. 2014 National Azbee Award: Best Photo Gallery/Slideshow ASPBE July 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com 2014 National Azbee Award: Best Photo Gallery/Slideshow ASPBE July 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com 2014 National Azbee Award: Best Photo Gallery/Slideshow ASPBE July 2014 Won Silver for the slideshow \"Meet Five SDN Research Rockstars\" on SearchSDN.com Star Award Diversified Communications May 2015 Star Award Diversified Communications May 2015 Star Award Diversified Communications May 2015 Additional Honors & Awards TechTarget 2013: \nQ3 All-Star award winner for TechTarget's Networking Media Group \nBull's Eye Award -- Best Community Engagement, SearchSDN.com \nBull's Eye Award -- Best Photo Story \n \nMedTech Media 2012: \nListed in the #HIT100, a crowd-sourced nomination of influential individuals or organizations in the #HealthIT and #HITsm communities. Additional Honors & Awards TechTarget 2013: \nQ3 All-Star award winner for TechTarget's Networking Media Group \nBull's Eye Award -- Best Community Engagement, SearchSDN.com \nBull's Eye Award -- Best Photo Story \n \nMedTech Media 2012: \nListed in the #HIT100, a crowd-sourced nomination of influential individuals or organizations in the #HealthIT and #HITsm communities. Additional Honors & Awards TechTarget 2013: \nQ3 All-Star award winner for TechTarget's Networking Media Group \nBull's Eye Award -- Best Community Engagement, SearchSDN.com \nBull's Eye Award -- Best Photo Story \n \nMedTech Media 2012: \nListed in the #HIT100, a crowd-sourced nomination of influential individuals or organizations in the #HealthIT and #HITsm communities. ", "Summary A writer, traveler, and humanitarian who runs a charity in his free time. \n15 years of writing experience as a copywriter, editor, and journalist.  \n7+ years of copywriting: creative concepting, content strategy, content development, and corporate communications (health care, consumer, shopper marketing) working in digital, print, TV, radio, direct marketing. \n7+ years of business journalism: reporting, writing, and editing. Fluent in AP style. \n \nChris has been the lead digital writer for the launch of an epilepsy brand, written TV and radio commercials, and been published in a wide range of media including SyFy.com, the Baltimore Sun and Evening Sun, and the Hungarian edition of Reader’s Digest. \n \nSpecialties: writing, copywriting, editing, content strategy, content development, CRM, shopper marketing, digital strategy, brand strategy, strategic concept development and execution, pharmaceutical copywriting, health care, technology, financial services, blogging, and making lists of buzzwords Summary A writer, traveler, and humanitarian who runs a charity in his free time. \n15 years of writing experience as a copywriter, editor, and journalist.  \n7+ years of copywriting: creative concepting, content strategy, content development, and corporate communications (health care, consumer, shopper marketing) working in digital, print, TV, radio, direct marketing. \n7+ years of business journalism: reporting, writing, and editing. Fluent in AP style. \n \nChris has been the lead digital writer for the launch of an epilepsy brand, written TV and radio commercials, and been published in a wide range of media including SyFy.com, the Baltimore Sun and Evening Sun, and the Hungarian edition of Reader’s Digest. \n \nSpecialties: writing, copywriting, editing, content strategy, content development, CRM, shopper marketing, digital strategy, brand strategy, strategic concept development and execution, pharmaceutical copywriting, health care, technology, financial services, blogging, and making lists of buzzwords A writer, traveler, and humanitarian who runs a charity in his free time. \n15 years of writing experience as a copywriter, editor, and journalist.  \n7+ years of copywriting: creative concepting, content strategy, content development, and corporate communications (health care, consumer, shopper marketing) working in digital, print, TV, radio, direct marketing. \n7+ years of business journalism: reporting, writing, and editing. Fluent in AP style. \n \nChris has been the lead digital writer for the launch of an epilepsy brand, written TV and radio commercials, and been published in a wide range of media including SyFy.com, the Baltimore Sun and Evening Sun, and the Hungarian edition of Reader’s Digest. \n \nSpecialties: writing, copywriting, editing, content strategy, content development, CRM, shopper marketing, digital strategy, brand strategy, strategic concept development and execution, pharmaceutical copywriting, health care, technology, financial services, blogging, and making lists of buzzwords A writer, traveler, and humanitarian who runs a charity in his free time. \n15 years of writing experience as a copywriter, editor, and journalist.  \n7+ years of copywriting: creative concepting, content strategy, content development, and corporate communications (health care, consumer, shopper marketing) working in digital, print, TV, radio, direct marketing. \n7+ years of business journalism: reporting, writing, and editing. Fluent in AP style. \n \nChris has been the lead digital writer for the launch of an epilepsy brand, written TV and radio commercials, and been published in a wide range of media including SyFy.com, the Baltimore Sun and Evening Sun, and the Hungarian edition of Reader’s Digest. \n \nSpecialties: writing, copywriting, editing, content strategy, content development, CRM, shopper marketing, digital strategy, brand strategy, strategic concept development and execution, pharmaceutical copywriting, health care, technology, financial services, blogging, and making lists of buzzwords Experience founder Santi School Project 2006  – Present (9 years) Nepal The Santi School Project promotes quality education in rural Nepal, especially for girls and ethnic minorities, who are often excluded from school. We build and repair primary schools as well as provide specialized early childhood education instruction for teachers because government-sponsored training is limited. Everyone involved in the project in the U.S. is a volunteer. copy supervisor Havas Worldwide - H4B Chelsea August 2012  –  July 2014  (2 years) New York, NY freelance copywriter Havas Worldwide - H4B Chelsea November 2011  –  August 2012  (10 months) freelance copywriter T. Rowe Price July 2011  –  September 2011  (3 months) senior copywriter Havas Worldwide - H4B Chelsea September 2010  –  June 2011  (10 months) freelance copywriter Harvey December 2009  –  September 2010  (10 months) senior copywriter Euro RSCG Life October 2006  –  February 2010  (3 years 5 months) freelancer writer BtoB, Folio, the SyFy network, InformationWeek, and other publications June 2005  –  September 2006  (1 year 4 months) associate editor InformationWeek July 2000  –  June 2002  (2 years) assistant managing editor, copyeditor Budapest Business Journal September 1997  –  May 1999  (1 year 9 months) founder Santi School Project 2006  – Present (9 years) Nepal The Santi School Project promotes quality education in rural Nepal, especially for girls and ethnic minorities, who are often excluded from school. We build and repair primary schools as well as provide specialized early childhood education instruction for teachers because government-sponsored training is limited. Everyone involved in the project in the U.S. is a volunteer. founder Santi School Project 2006  – Present (9 years) Nepal The Santi School Project promotes quality education in rural Nepal, especially for girls and ethnic minorities, who are often excluded from school. We build and repair primary schools as well as provide specialized early childhood education instruction for teachers because government-sponsored training is limited. Everyone involved in the project in the U.S. is a volunteer. copy supervisor Havas Worldwide - H4B Chelsea August 2012  –  July 2014  (2 years) New York, NY copy supervisor Havas Worldwide - H4B Chelsea August 2012  –  July 2014  (2 years) New York, NY freelance copywriter Havas Worldwide - H4B Chelsea November 2011  –  August 2012  (10 months) freelance copywriter Havas Worldwide - H4B Chelsea November 2011  –  August 2012  (10 months) freelance copywriter T. Rowe Price July 2011  –  September 2011  (3 months) freelance copywriter T. Rowe Price July 2011  –  September 2011  (3 months) senior copywriter Havas Worldwide - H4B Chelsea September 2010  –  June 2011  (10 months) senior copywriter Havas Worldwide - H4B Chelsea September 2010  –  June 2011  (10 months) freelance copywriter Harvey December 2009  –  September 2010  (10 months) freelance copywriter Harvey December 2009  –  September 2010  (10 months) senior copywriter Euro RSCG Life October 2006  –  February 2010  (3 years 5 months) senior copywriter Euro RSCG Life October 2006  –  February 2010  (3 years 5 months) freelancer writer BtoB, Folio, the SyFy network, InformationWeek, and other publications June 2005  –  September 2006  (1 year 4 months) freelancer writer BtoB, Folio, the SyFy network, InformationWeek, and other publications June 2005  –  September 2006  (1 year 4 months) associate editor InformationWeek July 2000  –  June 2002  (2 years) associate editor InformationWeek July 2000  –  June 2002  (2 years) assistant managing editor, copyeditor Budapest Business Journal September 1997  –  May 1999  (1 year 9 months) assistant managing editor, copyeditor Budapest Business Journal September 1997  –  May 1999  (1 year 9 months) Skills Copywriting Advertising Creative Direction Digital Marketing Direct Marketing Blogging Integrated Marketing Digital Strategy Creative Strategy Editing Skills  Copywriting Advertising Creative Direction Digital Marketing Direct Marketing Blogging Integrated Marketing Digital Strategy Creative Strategy Editing Copywriting Advertising Creative Direction Digital Marketing Direct Marketing Blogging Integrated Marketing Digital Strategy Creative Strategy Editing Copywriting Advertising Creative Direction Digital Marketing Direct Marketing Blogging Integrated Marketing Digital Strategy Creative Strategy Editing Education St. Mary's College of Maryland Bachelor of Arts,  English 1991  – 1995 Keble College, Oxford Centre for Medieval and Renaissance Studies 1993  – 1993 St. Mary's College of Maryland Bachelor of Arts,  English 1991  – 1995 St. Mary's College of Maryland Bachelor of Arts,  English 1991  – 1995 St. Mary's College of Maryland Bachelor of Arts,  English 1991  – 1995 Keble College, Oxford Centre for Medieval and Renaissance Studies 1993  – 1993 Keble College, Oxford Centre for Medieval and Renaissance Studies 1993  – 1993 Keble College, Oxford Centre for Medieval and Renaissance Studies 1993  – 1993 Honors & Awards Additional Honors & Awards 2010 Addy Additional Honors & Awards 2010 Addy Additional Honors & Awards 2010 Addy Additional Honors & Awards 2010 Addy ", "Summary I've been a beat reporter for a variety of technology publications, covering a wide range of fields, from semiconductors to the business end of the industry. I do my best to maintain solid relationships with vendors and sources alike, which keeps me on top of news and has helped me break significant stories as well. \n \nAfter nearly two decades as a reporter, I'm looking to move up into a more senior/managerial position. I'm currently freelancing to stay active in the industry but my main interest is in a full time position. I'm open to positions in the southern California area (San Diego to LA), the Bay Area and Seattle and will relocate. Specialties:Systems and datacenters, cloud computing and virtualization, HPC, software development, business and financial reporting. Summary I've been a beat reporter for a variety of technology publications, covering a wide range of fields, from semiconductors to the business end of the industry. I do my best to maintain solid relationships with vendors and sources alike, which keeps me on top of news and has helped me break significant stories as well. \n \nAfter nearly two decades as a reporter, I'm looking to move up into a more senior/managerial position. I'm currently freelancing to stay active in the industry but my main interest is in a full time position. I'm open to positions in the southern California area (San Diego to LA), the Bay Area and Seattle and will relocate. Specialties:Systems and datacenters, cloud computing and virtualization, HPC, software development, business and financial reporting. I've been a beat reporter for a variety of technology publications, covering a wide range of fields, from semiconductors to the business end of the industry. I do my best to maintain solid relationships with vendors and sources alike, which keeps me on top of news and has helped me break significant stories as well. \n \nAfter nearly two decades as a reporter, I'm looking to move up into a more senior/managerial position. I'm currently freelancing to stay active in the industry but my main interest is in a full time position. I'm open to positions in the southern California area (San Diego to LA), the Bay Area and Seattle and will relocate. Specialties:Systems and datacenters, cloud computing and virtualization, HPC, software development, business and financial reporting. I've been a beat reporter for a variety of technology publications, covering a wide range of fields, from semiconductors to the business end of the industry. I do my best to maintain solid relationships with vendors and sources alike, which keeps me on top of news and has helped me break significant stories as well. \n \nAfter nearly two decades as a reporter, I'm looking to move up into a more senior/managerial position. I'm currently freelancing to stay active in the industry but my main interest is in a full time position. I'm open to positions in the southern California area (San Diego to LA), the Bay Area and Seattle and will relocate. Specialties:Systems and datacenters, cloud computing and virtualization, HPC, software development, business and financial reporting. Experience Freelance Writer Freelancer August 2010  – Present (5 years 1 month) Currently working as a freelance contributor to a variety of print and online publications. I have done everything from trade show coverage in my area to daily news to features. \n \nCurrent freelance work includes: \n \n* Feature writer/blogger with ITworld \n* Microsoft blogger for Network World \n* Contributor to PC World \n* Contributor to Enterprise Efficiency \n* Contributor to Dell Tech Page One \n* Contributor to the Smartbear developer's blog Senior Editor, InternetNews.com QuinStreet April 2006  –  August 2010  (4 years 5 months) Was a reporter/editor for InternetNews.com, QuinStreet's flagship news site. My beats include semiconductors (Intel, AMD) and other components, clients and servers (Dell, HP, IBM), developer tools and languages (Java) and mobile devices (Apple, RIM, Google/Android). Freelance Writer Freelancer May 2005  –  April 2006  (1 year) Editor-in-Chief, IGN DVD IGN Entertainment July 2003  –  May 2005  (1 year 11 months) I was the site editor for IGN's DVD portal, which meant at least one new DVD review a day, 5 days a week, along with news, product releases and other DVD related news. Under my management the site grew from 300,000 monthly uniques to nearly 600,000 in two years. Freelancer Self-Employed June 1999  –  June 2003  (4 years 1 month) Associate Editor UBM TechWeb 1997  –  1999  (2 years) Staff writer covering the general software market, plus hardware reporting when needed. Associate Editor UBM TechWeb 1997  –  1999  (2 years) Los Angeles 1996-97 - Associate Editor with InformationWeek. \n1997-99 - Associate Editor with TechWeb. Associate Editor InformationWeek magazine (CMP/United Business Media) 1996  –  1997  (1 year) App dev reporter for InformationWeek. PR writer Quarterdeck 1995  –  1996  (1 year) Wrote all PR materials, from press releases to white papers. Staff Writer PC Week 1994  –  1995  (1 year) Beat reporter covering Unix, Linux and application development tools. Staff Writer eWEEK/Ziff Davis Enterprise 1994  –  1995  (1 year) Beat reporter, covered Unix, later developer tools. Freelance Writer Freelancer August 2010  – Present (5 years 1 month) Currently working as a freelance contributor to a variety of print and online publications. I have done everything from trade show coverage in my area to daily news to features. \n \nCurrent freelance work includes: \n \n* Feature writer/blogger with ITworld \n* Microsoft blogger for Network World \n* Contributor to PC World \n* Contributor to Enterprise Efficiency \n* Contributor to Dell Tech Page One \n* Contributor to the Smartbear developer's blog Freelance Writer Freelancer August 2010  – Present (5 years 1 month) Currently working as a freelance contributor to a variety of print and online publications. I have done everything from trade show coverage in my area to daily news to features. \n \nCurrent freelance work includes: \n \n* Feature writer/blogger with ITworld \n* Microsoft blogger for Network World \n* Contributor to PC World \n* Contributor to Enterprise Efficiency \n* Contributor to Dell Tech Page One \n* Contributor to the Smartbear developer's blog Senior Editor, InternetNews.com QuinStreet April 2006  –  August 2010  (4 years 5 months) Was a reporter/editor for InternetNews.com, QuinStreet's flagship news site. My beats include semiconductors (Intel, AMD) and other components, clients and servers (Dell, HP, IBM), developer tools and languages (Java) and mobile devices (Apple, RIM, Google/Android). Senior Editor, InternetNews.com QuinStreet April 2006  –  August 2010  (4 years 5 months) Was a reporter/editor for InternetNews.com, QuinStreet's flagship news site. My beats include semiconductors (Intel, AMD) and other components, clients and servers (Dell, HP, IBM), developer tools and languages (Java) and mobile devices (Apple, RIM, Google/Android). Freelance Writer Freelancer May 2005  –  April 2006  (1 year) Freelance Writer Freelancer May 2005  –  April 2006  (1 year) Editor-in-Chief, IGN DVD IGN Entertainment July 2003  –  May 2005  (1 year 11 months) I was the site editor for IGN's DVD portal, which meant at least one new DVD review a day, 5 days a week, along with news, product releases and other DVD related news. Under my management the site grew from 300,000 monthly uniques to nearly 600,000 in two years. Editor-in-Chief, IGN DVD IGN Entertainment July 2003  –  May 2005  (1 year 11 months) I was the site editor for IGN's DVD portal, which meant at least one new DVD review a day, 5 days a week, along with news, product releases and other DVD related news. Under my management the site grew from 300,000 monthly uniques to nearly 600,000 in two years. Freelancer Self-Employed June 1999  –  June 2003  (4 years 1 month) Freelancer Self-Employed June 1999  –  June 2003  (4 years 1 month) Associate Editor UBM TechWeb 1997  –  1999  (2 years) Staff writer covering the general software market, plus hardware reporting when needed. Associate Editor UBM TechWeb 1997  –  1999  (2 years) Staff writer covering the general software market, plus hardware reporting when needed. Associate Editor UBM TechWeb 1997  –  1999  (2 years) Los Angeles 1996-97 - Associate Editor with InformationWeek. \n1997-99 - Associate Editor with TechWeb. Associate Editor UBM TechWeb 1997  –  1999  (2 years) Los Angeles 1996-97 - Associate Editor with InformationWeek. \n1997-99 - Associate Editor with TechWeb. Associate Editor InformationWeek magazine (CMP/United Business Media) 1996  –  1997  (1 year) App dev reporter for InformationWeek. Associate Editor InformationWeek magazine (CMP/United Business Media) 1996  –  1997  (1 year) App dev reporter for InformationWeek. PR writer Quarterdeck 1995  –  1996  (1 year) Wrote all PR materials, from press releases to white papers. PR writer Quarterdeck 1995  –  1996  (1 year) Wrote all PR materials, from press releases to white papers. Staff Writer PC Week 1994  –  1995  (1 year) Beat reporter covering Unix, Linux and application development tools. Staff Writer PC Week 1994  –  1995  (1 year) Beat reporter covering Unix, Linux and application development tools. Staff Writer eWEEK/Ziff Davis Enterprise 1994  –  1995  (1 year) Beat reporter, covered Unix, later developer tools. Staff Writer eWEEK/Ziff Davis Enterprise 1994  –  1995  (1 year) Beat reporter, covered Unix, later developer tools. Skills Editing Storytelling Publications Freelance Writing Online Publishing Blogging Cloud Computing Journalism Copy Editing Editorial Content Development Web Content Feature Articles Social Media Skills  Editing Storytelling Publications Freelance Writing Online Publishing Blogging Cloud Computing Journalism Copy Editing Editorial Content Development Web Content Feature Articles Social Media Editing Storytelling Publications Freelance Writing Online Publishing Blogging Cloud Computing Journalism Copy Editing Editorial Content Development Web Content Feature Articles Social Media Editing Storytelling Publications Freelance Writing Online Publishing Blogging Cloud Computing Journalism Copy Editing Editorial Content Development Web Content Feature Articles Social Media Education University of Rhode Island BA,  Journalism 1985  – 1991 Cranston HS West High school diploma,  College prep 1982  – 1985 University of Rhode Island BA,  Journalism 1985  – 1991 University of Rhode Island BA,  Journalism 1985  – 1991 University of Rhode Island BA,  Journalism 1985  – 1991 Cranston HS West High school diploma,  College prep 1982  – 1985 Cranston HS West High school diploma,  College prep 1982  – 1985 Cranston HS West High school diploma,  College prep 1982  – 1985 "]}