{"position": "Associate Principal Consumer Operations", "company": "Google", "profiles": ["Skills Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing Skills  Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing Digital Marketing Google Analytics Online Advertising E-commerce Google Adwords Web Analytics Analytics SEM Digital Strategy Online Marketing PPC Mobile Marketing ", "Experience Associate Principal Strategist Google June 2014  – Present (1 year 3 months) San Francisco Bay Area Associate Principal Strategist Google June 2014  – Present (1 year 3 months) San Francisco Bay Area Associate Principal Strategist Google June 2014  – Present (1 year 3 months) San Francisco Bay Area Languages   Skills Cloud Computing Strategy Storage Area Networks Competitive Analysis Product Management Entrepreneurship Data Analysis Public Speaking Presentations Leadership Team Leadership Financial Modeling Cross-functional Team... Project Management Business Strategy Negotiation Economics Product Strategies Valuation Social Media Marketing Program Management Start-ups Market Research Consulting Enterprise Software Data Center Professional Services Financial Analysis Analytics See 14+     See less Skills  Cloud Computing Strategy Storage Area Networks Competitive Analysis Product Management Entrepreneurship Data Analysis Public Speaking Presentations Leadership Team Leadership Financial Modeling Cross-functional Team... Project Management Business Strategy Negotiation Economics Product Strategies Valuation Social Media Marketing Program Management Start-ups Market Research Consulting Enterprise Software Data Center Professional Services Financial Analysis Analytics See 14+     See less Cloud Computing Strategy Storage Area Networks Competitive Analysis Product Management Entrepreneurship Data Analysis Public Speaking Presentations Leadership Team Leadership Financial Modeling Cross-functional Team... Project Management Business Strategy Negotiation Economics Product Strategies Valuation Social Media Marketing Program Management Start-ups Market Research Consulting Enterprise Software Data Center Professional Services Financial Analysis Analytics See 14+     See less Cloud Computing Strategy Storage Area Networks Competitive Analysis Product Management Entrepreneurship Data Analysis Public Speaking Presentations Leadership Team Leadership Financial Modeling Cross-functional Team... Project Management Business Strategy Negotiation Economics Product Strategies Valuation Social Media Marketing Program Management Start-ups Market Research Consulting Enterprise Software Data Center Professional Services Financial Analysis Analytics See 14+     See less Honors & Awards ", "Experience Associate Principal - Business Strategy, Product Quality Operations Google June 2015  – Present (3 months) Mountain View, California Vice President, Credit & Banking Product Manager Bank of America Merrill Lynch September 2013  –  May 2015  (1 year 9 months) Charlotte, North Carolina Advisor, Co-founder Contratan.do March 2011  –  March 2014  (3 years 1 month) Charlotte, North Carolina Area Vice President, eCommerce Product Manager Bank of America June 2011  –  September 2013  (2 years 4 months) Charlotte, North Carolina Area Assistant Vice President, Strategy & Operations Manager Bank of America June 2010  –  June 2011  (1 year 1 month) Charlotte, North Carolina MBA Global Leadership Development Program Intern Eaton Aerospace May 2009  –  August 2009  (4 months) Orange County, California Area Associate Booz Allen Hamilton July 2006  –  August 2008  (2 years 2 months) Washington D.C. Metro Area Electronics Engineer, Project Manager US Army Night Vision & Electronic Sensors Directorate March 2003  –  June 2006  (3 years 4 months) Washington D.C. Metro Area Associate Principal - Business Strategy, Product Quality Operations Google June 2015  – Present (3 months) Mountain View, California Associate Principal - Business Strategy, Product Quality Operations Google June 2015  – Present (3 months) Mountain View, California Vice President, Credit & Banking Product Manager Bank of America Merrill Lynch September 2013  –  May 2015  (1 year 9 months) Charlotte, North Carolina Vice President, Credit & Banking Product Manager Bank of America Merrill Lynch September 2013  –  May 2015  (1 year 9 months) Charlotte, North Carolina Advisor, Co-founder Contratan.do March 2011  –  March 2014  (3 years 1 month) Charlotte, North Carolina Area Advisor, Co-founder Contratan.do March 2011  –  March 2014  (3 years 1 month) Charlotte, North Carolina Area Vice President, eCommerce Product Manager Bank of America June 2011  –  September 2013  (2 years 4 months) Charlotte, North Carolina Area Vice President, eCommerce Product Manager Bank of America June 2011  –  September 2013  (2 years 4 months) Charlotte, North Carolina Area Assistant Vice President, Strategy & Operations Manager Bank of America June 2010  –  June 2011  (1 year 1 month) Charlotte, North Carolina Assistant Vice President, Strategy & Operations Manager Bank of America June 2010  –  June 2011  (1 year 1 month) Charlotte, North Carolina MBA Global Leadership Development Program Intern Eaton Aerospace May 2009  –  August 2009  (4 months) Orange County, California Area MBA Global Leadership Development Program Intern Eaton Aerospace May 2009  –  August 2009  (4 months) Orange County, California Area Associate Booz Allen Hamilton July 2006  –  August 2008  (2 years 2 months) Washington D.C. Metro Area Associate Booz Allen Hamilton July 2006  –  August 2008  (2 years 2 months) Washington D.C. Metro Area Electronics Engineer, Project Manager US Army Night Vision & Electronic Sensors Directorate March 2003  –  June 2006  (3 years 4 months) Washington D.C. Metro Area Electronics Engineer, Project Manager US Army Night Vision & Electronic Sensors Directorate March 2003  –  June 2006  (3 years 4 months) Washington D.C. Metro Area Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Management Operations Management Technology Planning Business Strategy Process Improvement Metrics Process Engineering ATM Process Automation Strategy Product Innovation Quantitative Analytics Critical Thinking Change Management Project Management R&D Global E-commerce E-commerce Internet Strategy Mobile Communications Mobile Technology Information Technology IT Management IT Strategy Design Thinking Integration Program Management Analysis Financial Modeling Cross-functional Team... Leadership Risk Management Start-ups Management Analytics Entrepreneurship Software Development ITIL Mergers & Acquisitions Banking Business Process... Competitive Analysis Business Analysis Vendor Management Business Intelligence Management Consulting Project Portfolio... Strategic Planning Consulting Financial Analysis See 35+     See less Skills  Product Management Operations Management Technology Planning Business Strategy Process Improvement Metrics Process Engineering ATM Process Automation Strategy Product Innovation Quantitative Analytics Critical Thinking Change Management Project Management R&D Global E-commerce E-commerce Internet Strategy Mobile Communications Mobile Technology Information Technology IT Management IT Strategy Design Thinking Integration Program Management Analysis Financial Modeling Cross-functional Team... Leadership Risk Management Start-ups Management Analytics Entrepreneurship Software Development ITIL Mergers & Acquisitions Banking Business Process... Competitive Analysis Business Analysis Vendor Management Business Intelligence Management Consulting Project Portfolio... Strategic Planning Consulting Financial Analysis See 35+     See less Product Management Operations Management Technology Planning Business Strategy Process Improvement Metrics Process Engineering ATM Process Automation Strategy Product Innovation Quantitative Analytics Critical Thinking Change Management Project Management R&D Global E-commerce E-commerce Internet Strategy Mobile Communications Mobile Technology Information Technology IT Management IT Strategy Design Thinking Integration Program Management Analysis Financial Modeling Cross-functional Team... Leadership Risk Management Start-ups Management Analytics Entrepreneurship Software Development ITIL Mergers & Acquisitions Banking Business Process... Competitive Analysis Business Analysis Vendor Management Business Intelligence Management Consulting Project Portfolio... Strategic Planning Consulting Financial Analysis See 35+     See less Product Management Operations Management Technology Planning Business Strategy Process Improvement Metrics Process Engineering ATM Process Automation Strategy Product Innovation Quantitative Analytics Critical Thinking Change Management Project Management R&D Global E-commerce E-commerce Internet Strategy Mobile Communications Mobile Technology Information Technology IT Management IT Strategy Design Thinking Integration Program Management Analysis Financial Modeling Cross-functional Team... Leadership Risk Management Start-ups Management Analytics Entrepreneurship Software Development ITIL Mergers & Acquisitions Banking Business Process... Competitive Analysis Business Analysis Vendor Management Business Intelligence Management Consulting Project Portfolio... Strategic Planning Consulting Financial Analysis See 35+     See less Education Georgia Institute of Technology B.S. The George Washington University M.S. University of Virginia Darden School of Business MBA Georgia Institute of Technology B.S. Georgia Institute of Technology B.S. Georgia Institute of Technology B.S. The George Washington University M.S. The George Washington University M.S. The George Washington University M.S. University of Virginia Darden School of Business MBA University of Virginia Darden School of Business MBA University of Virginia Darden School of Business MBA Honors & Awards 2014 HACR Young Hispanic Corporate Achiever Hispanic Association on Corporate Responsibility April 2014 Launched in 2007, the HACR YHCA Program was developed as a way to recognize the outstanding achievements of young Latino professionals in Corporate America and further the organization’s vision to increase the number of Hispanics on corporate boards. HACR understands that in the war for talent, Hispanics will lead the charge and the program plays a pivotal role in identifying and recognizing the best and brightest young executives. To date, more than 500 candidates have been nominated and more than 200 have been selected as HACR YHCAers. 2013 President's Volunteer Service Award Corporation for National and Community Service The President’s Council on Service and Civic Participation (the Council) was established in 2003 to recognize the valuable contributions volunteers are making in our communities and encourage more people to serve. The Council created the President’s Volunteer Service Award program as a way to thank and honor Americans who, by their demonstrated commitment and example, inspire others to engage in volunteer service. The program continues as an initiative of the Corporation for National and Community Service (CNCS). 2012 Bank of America Retail Banking & Distribution Top Performer Bank of America December 2013 2008 Consortium for Graduate Studies in Management Fellow Consortium for Graduate Studies in Management June 2008 2014 HACR Young Hispanic Corporate Achiever Hispanic Association on Corporate Responsibility April 2014 Launched in 2007, the HACR YHCA Program was developed as a way to recognize the outstanding achievements of young Latino professionals in Corporate America and further the organization’s vision to increase the number of Hispanics on corporate boards. HACR understands that in the war for talent, Hispanics will lead the charge and the program plays a pivotal role in identifying and recognizing the best and brightest young executives. To date, more than 500 candidates have been nominated and more than 200 have been selected as HACR YHCAers. 2014 HACR Young Hispanic Corporate Achiever Hispanic Association on Corporate Responsibility April 2014 Launched in 2007, the HACR YHCA Program was developed as a way to recognize the outstanding achievements of young Latino professionals in Corporate America and further the organization’s vision to increase the number of Hispanics on corporate boards. HACR understands that in the war for talent, Hispanics will lead the charge and the program plays a pivotal role in identifying and recognizing the best and brightest young executives. To date, more than 500 candidates have been nominated and more than 200 have been selected as HACR YHCAers. 2014 HACR Young Hispanic Corporate Achiever Hispanic Association on Corporate Responsibility April 2014 Launched in 2007, the HACR YHCA Program was developed as a way to recognize the outstanding achievements of young Latino professionals in Corporate America and further the organization’s vision to increase the number of Hispanics on corporate boards. HACR understands that in the war for talent, Hispanics will lead the charge and the program plays a pivotal role in identifying and recognizing the best and brightest young executives. To date, more than 500 candidates have been nominated and more than 200 have been selected as HACR YHCAers. 2013 President's Volunteer Service Award Corporation for National and Community Service The President’s Council on Service and Civic Participation (the Council) was established in 2003 to recognize the valuable contributions volunteers are making in our communities and encourage more people to serve. The Council created the President’s Volunteer Service Award program as a way to thank and honor Americans who, by their demonstrated commitment and example, inspire others to engage in volunteer service. The program continues as an initiative of the Corporation for National and Community Service (CNCS). 2013 President's Volunteer Service Award Corporation for National and Community Service The President’s Council on Service and Civic Participation (the Council) was established in 2003 to recognize the valuable contributions volunteers are making in our communities and encourage more people to serve. The Council created the President’s Volunteer Service Award program as a way to thank and honor Americans who, by their demonstrated commitment and example, inspire others to engage in volunteer service. The program continues as an initiative of the Corporation for National and Community Service (CNCS). 2013 President's Volunteer Service Award Corporation for National and Community Service The President’s Council on Service and Civic Participation (the Council) was established in 2003 to recognize the valuable contributions volunteers are making in our communities and encourage more people to serve. The Council created the President’s Volunteer Service Award program as a way to thank and honor Americans who, by their demonstrated commitment and example, inspire others to engage in volunteer service. The program continues as an initiative of the Corporation for National and Community Service (CNCS). 2012 Bank of America Retail Banking & Distribution Top Performer Bank of America December 2013 2012 Bank of America Retail Banking & Distribution Top Performer Bank of America December 2013 2012 Bank of America Retail Banking & Distribution Top Performer Bank of America December 2013 2008 Consortium for Graduate Studies in Management Fellow Consortium for Graduate Studies in Management June 2008 2008 Consortium for Graduate Studies in Management Fellow Consortium for Graduate Studies in Management June 2008 2008 Consortium for Graduate Studies in Management Fellow Consortium for Graduate Studies in Management June 2008 ", "Skills Management Consulting Business Strategy Strategy Financial Modeling Emerging Markets Organizational... Strategic Planning Entrepreneurship Economics Research Skills  Management Consulting Business Strategy Strategy Financial Modeling Emerging Markets Organizational... Strategic Planning Entrepreneurship Economics Research Management Consulting Business Strategy Strategy Financial Modeling Emerging Markets Organizational... Strategic Planning Entrepreneurship Economics Research Management Consulting Business Strategy Strategy Financial Modeling Emerging Markets Organizational... Strategic Planning Entrepreneurship Economics Research ", "Summary Seasoned data science and analytics professional with experience in both the technology sector and the US Intelligence Community. Passionate about finding hidden trends, analyzing patterns, and making better decisions through data. \n \nSpecialties: Python, SQL, and R.; Data science of all flavors, including A/B testing, data mining, data visualization, and social network analysis. Summary Seasoned data science and analytics professional with experience in both the technology sector and the US Intelligence Community. Passionate about finding hidden trends, analyzing patterns, and making better decisions through data. \n \nSpecialties: Python, SQL, and R.; Data science of all flavors, including A/B testing, data mining, data visualization, and social network analysis. Seasoned data science and analytics professional with experience in both the technology sector and the US Intelligence Community. Passionate about finding hidden trends, analyzing patterns, and making better decisions through data. \n \nSpecialties: Python, SQL, and R.; Data science of all flavors, including A/B testing, data mining, data visualization, and social network analysis. Seasoned data science and analytics professional with experience in both the technology sector and the US Intelligence Community. Passionate about finding hidden trends, analyzing patterns, and making better decisions through data. \n \nSpecialties: Python, SQL, and R.; Data science of all flavors, including A/B testing, data mining, data visualization, and social network analysis. Experience Associate Principal, Product Quality Operations Google March 2015  – Present (6 months) San Francisco Bay Area Google's Product Quality Operations team is responsible for protecting users and preserving online safety by fighting abuse and fraud across all Google products. Our mission is to ensure that the world's information is safely accessible to all. \n \nAs a member of the Google PQO team, my responsibilities include: \n \n• Driving improvements in abuse detection systems to fight malicious behavior at scale; \n• Conducting complex data analyses to identify and investigate patterns of abuse hidden among vast stores of data; \n• Leveraging knowledge of abuse trends to develop new strategic initiatives and measure their success. Senior Data Analyst Manage.com January 2015  –  March 2015  (3 months) San Francisco Bay Area Manage is a software company using data to power growth and customer engagement across multiple devices. We provide fully-managed user acquisition and revenue optimization services for leading mobile gaming companies and Fortune 500 brands.  \n \nAs part of the Analytics team, my responsibilities included: \n \n• Conducting A/B tests to determine ideal traffic optimization strategies; \n• Investigating trends and anomalies in massive datasets; \n• Producing quantitative analysis and data visualizations to support strategic decision-making by company leadership; \n• Analyzing statistical relationships between operational adjustments and KPIs; \n• Processing, cleaning, and analyzing data in Python and R; \n• Providing analytical support to other divisions. Data Analyst Manage.com February 2014  –  January 2015  (1 year) San Francisco Bay Area Expert Open Source Officer for Big Data Central Intelligence Agency 2013  –  2013  (less than a year) Washington D.C. Metro Area The Central Intelligence Agency's Open Source Center is charged with collecting, translating, analyzing, and disseminating open source information that meets the needs of policymakers, the military, state and local law enforcement, operations officers, and analysts throughout the US Government. \n \nDuring my seven years at the CIA, my responsibilities included: \n \n• Conducting intelligence analysis from a data science perspective. Focused on algorithmic approaches to large datasets, including natural-language processing (NLP), sentiment analysis, censorship, and social network analysis. \n• Delivering innovative analytical products to senior Intelligence Community (IC) and US government officials.  \n• Managing major big data pilot programs, evaluating technologies, and securing and initiating new contracts. \n• Training colleagues in the use of data-driven analysis. \n• Served an overseas tour in Asia. Analytic Lead Central Intelligence Agency 2010  –  2012  (2 years) Washington D.C. Metro Area Open Source Officer Central Intelligence Agency 2007  –  2010  (3 years) Washington D.C. Metro Area Research Assistant U.S.-China Economic and Security Review Commission 2006  –  2007  (1 year) Associate Principal, Product Quality Operations Google March 2015  – Present (6 months) San Francisco Bay Area Google's Product Quality Operations team is responsible for protecting users and preserving online safety by fighting abuse and fraud across all Google products. Our mission is to ensure that the world's information is safely accessible to all. \n \nAs a member of the Google PQO team, my responsibilities include: \n \n• Driving improvements in abuse detection systems to fight malicious behavior at scale; \n• Conducting complex data analyses to identify and investigate patterns of abuse hidden among vast stores of data; \n• Leveraging knowledge of abuse trends to develop new strategic initiatives and measure their success. Associate Principal, Product Quality Operations Google March 2015  – Present (6 months) San Francisco Bay Area Google's Product Quality Operations team is responsible for protecting users and preserving online safety by fighting abuse and fraud across all Google products. Our mission is to ensure that the world's information is safely accessible to all. \n \nAs a member of the Google PQO team, my responsibilities include: \n \n• Driving improvements in abuse detection systems to fight malicious behavior at scale; \n• Conducting complex data analyses to identify and investigate patterns of abuse hidden among vast stores of data; \n• Leveraging knowledge of abuse trends to develop new strategic initiatives and measure their success. Senior Data Analyst Manage.com January 2015  –  March 2015  (3 months) San Francisco Bay Area Manage is a software company using data to power growth and customer engagement across multiple devices. We provide fully-managed user acquisition and revenue optimization services for leading mobile gaming companies and Fortune 500 brands.  \n \nAs part of the Analytics team, my responsibilities included: \n \n• Conducting A/B tests to determine ideal traffic optimization strategies; \n• Investigating trends and anomalies in massive datasets; \n• Producing quantitative analysis and data visualizations to support strategic decision-making by company leadership; \n• Analyzing statistical relationships between operational adjustments and KPIs; \n• Processing, cleaning, and analyzing data in Python and R; \n• Providing analytical support to other divisions. Senior Data Analyst Manage.com January 2015  –  March 2015  (3 months) San Francisco Bay Area Manage is a software company using data to power growth and customer engagement across multiple devices. We provide fully-managed user acquisition and revenue optimization services for leading mobile gaming companies and Fortune 500 brands.  \n \nAs part of the Analytics team, my responsibilities included: \n \n• Conducting A/B tests to determine ideal traffic optimization strategies; \n• Investigating trends and anomalies in massive datasets; \n• Producing quantitative analysis and data visualizations to support strategic decision-making by company leadership; \n• Analyzing statistical relationships between operational adjustments and KPIs; \n• Processing, cleaning, and analyzing data in Python and R; \n• Providing analytical support to other divisions. Data Analyst Manage.com February 2014  –  January 2015  (1 year) San Francisco Bay Area Data Analyst Manage.com February 2014  –  January 2015  (1 year) San Francisco Bay Area Expert Open Source Officer for Big Data Central Intelligence Agency 2013  –  2013  (less than a year) Washington D.C. Metro Area The Central Intelligence Agency's Open Source Center is charged with collecting, translating, analyzing, and disseminating open source information that meets the needs of policymakers, the military, state and local law enforcement, operations officers, and analysts throughout the US Government. \n \nDuring my seven years at the CIA, my responsibilities included: \n \n• Conducting intelligence analysis from a data science perspective. Focused on algorithmic approaches to large datasets, including natural-language processing (NLP), sentiment analysis, censorship, and social network analysis. \n• Delivering innovative analytical products to senior Intelligence Community (IC) and US government officials.  \n• Managing major big data pilot programs, evaluating technologies, and securing and initiating new contracts. \n• Training colleagues in the use of data-driven analysis. \n• Served an overseas tour in Asia. Expert Open Source Officer for Big Data Central Intelligence Agency 2013  –  2013  (less than a year) Washington D.C. Metro Area The Central Intelligence Agency's Open Source Center is charged with collecting, translating, analyzing, and disseminating open source information that meets the needs of policymakers, the military, state and local law enforcement, operations officers, and analysts throughout the US Government. \n \nDuring my seven years at the CIA, my responsibilities included: \n \n• Conducting intelligence analysis from a data science perspective. Focused on algorithmic approaches to large datasets, including natural-language processing (NLP), sentiment analysis, censorship, and social network analysis. \n• Delivering innovative analytical products to senior Intelligence Community (IC) and US government officials.  \n• Managing major big data pilot programs, evaluating technologies, and securing and initiating new contracts. \n• Training colleagues in the use of data-driven analysis. \n• Served an overseas tour in Asia. Analytic Lead Central Intelligence Agency 2010  –  2012  (2 years) Washington D.C. Metro Area Analytic Lead Central Intelligence Agency 2010  –  2012  (2 years) Washington D.C. Metro Area Open Source Officer Central Intelligence Agency 2007  –  2010  (3 years) Washington D.C. Metro Area Open Source Officer Central Intelligence Agency 2007  –  2010  (3 years) Washington D.C. Metro Area Research Assistant U.S.-China Economic and Security Review Commission 2006  –  2007  (1 year) Research Assistant U.S.-China Economic and Security Review Commission 2006  –  2007  (1 year) Languages English Native or bilingual proficiency Chinese (Mandarin) Professional working proficiency Chinese (Cantonese) Limited working proficiency English Native or bilingual proficiency Chinese (Mandarin) Professional working proficiency Chinese (Cantonese) Limited working proficiency English Native or bilingual proficiency Chinese (Mandarin) Professional working proficiency Chinese (Cantonese) Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Data Analysis Analysis Python Data Mining MySQL Data Visualization Analytics R Big Data Data Science Predictive Analytics Text Mining Hive Tableau pandas Optimization Hadoop Quantitative Analytics Mobile Advertising Perl Databases Propaganda Analysis See 7+     See less Skills  Data Analysis Analysis Python Data Mining MySQL Data Visualization Analytics R Big Data Data Science Predictive Analytics Text Mining Hive Tableau pandas Optimization Hadoop Quantitative Analytics Mobile Advertising Perl Databases Propaganda Analysis See 7+     See less Data Analysis Analysis Python Data Mining MySQL Data Visualization Analytics R Big Data Data Science Predictive Analytics Text Mining Hive Tableau pandas Optimization Hadoop Quantitative Analytics Mobile Advertising Perl Databases Propaganda Analysis See 7+     See less Data Analysis Analysis Python Data Mining MySQL Data Visualization Analytics R Big Data Data Science Predictive Analytics Text Mining Hive Tableau pandas Optimization Hadoop Quantitative Analytics Mobile Advertising Perl Databases Propaganda Analysis See 7+     See less Education Brown University Bachelor's Degree,  Computer Science , Magna cum laude 2002  – 2006 Double Major in Computer Science and International Relations. Wellesley High School Brown University Bachelor's Degree,  Computer Science , Magna cum laude 2002  – 2006 Double Major in Computer Science and International Relations. Brown University Bachelor's Degree,  Computer Science , Magna cum laude 2002  – 2006 Double Major in Computer Science and International Relations. Brown University Bachelor's Degree,  Computer Science , Magna cum laude 2002  – 2006 Double Major in Computer Science and International Relations. Wellesley High School Wellesley High School Wellesley High School Honors & Awards 4 CIA Exceptional Performance Awards Central Intelligence Agency 2013 4 CIA Exceptional Performance Awards Central Intelligence Agency 2013 4 CIA Exceptional Performance Awards Central Intelligence Agency 2013 4 CIA Exceptional Performance Awards Central Intelligence Agency 2013 ", "Summary I love technology. I'm a spam-fighter, writer, video editor, speaker, and bug reporter. \n \nI spent over eight years on the Product Quality Operations team at Google, where I improved the quality of multiple Google products by fighting spam and abuse and educating content creators on our guidelines. \n \nI'm now on the Google Flights team, where I support partners who use ITA Software by Google. Summary I love technology. I'm a spam-fighter, writer, video editor, speaker, and bug reporter. \n \nI spent over eight years on the Product Quality Operations team at Google, where I improved the quality of multiple Google products by fighting spam and abuse and educating content creators on our guidelines. \n \nI'm now on the Google Flights team, where I support partners who use ITA Software by Google. I love technology. I'm a spam-fighter, writer, video editor, speaker, and bug reporter. \n \nI spent over eight years on the Product Quality Operations team at Google, where I improved the quality of multiple Google products by fighting spam and abuse and educating content creators on our guidelines. \n \nI'm now on the Google Flights team, where I support partners who use ITA Software by Google. I love technology. I'm a spam-fighter, writer, video editor, speaker, and bug reporter. \n \nI spent over eight years on the Product Quality Operations team at Google, where I improved the quality of multiple Google products by fighting spam and abuse and educating content creators on our guidelines. \n \nI'm now on the Google Flights team, where I support partners who use ITA Software by Google. Experience Partner Operations Manager Google May 2015  – Present (4 months) Cambridge, Massachusetts I support partners who use ITA Software by Google. Associate Principal, Product Quality Operations Google June 2012  –  May 2015  (3 years) Mountain View, CA, USA - Managed and mentored full-time employees and interns \n- Led a global functional group focused on webmaster outreach \n- Created content including video, blog posts, messages, and social posts \n- Helped to launch multiple features of Webmaster Tools Team Lead, Product Quality Operations Google November 2010  –  June 2012  (1 year 8 months) Mountain View, CA, USA - Fought spam in Google Web Search and Google Maps. \n- Educated webmasters on how to make Google-friendly sites. \n- Launched email support system for webmasters \n- Trained team members \n- Person management Sr. Strategist, Search Quality Evaluation Google November 2009  –  November 2010  (1 year 1 month) Mountain View, CA, USA - Fought spam in Google's web index. \n- Educated webmasters on how to make Google-friendly sites. Strategist, Search Quality Evaluation Google November 2007  –  November 2009  (2 years 1 month) Mountain View, CA, USA - Fought spam in Google's web index. \n- Educated webmasters on how to make Google-friendly sites. \n- Launched YouTube channel for webmasters Associate, Search Quality Evaluation Google December 2006  –  November 2007  (1 year) Mountain View, CA, USA - Investigated sites for webspam violations and took action as necessary \n- Participated in user forums and wrote for our blog to help webmasters to make sites accessible to search engines \n- Developed review process for AdWords landing pages Search Quality Evaluator WorkforceLogic (contracted by Google) July 2006  –  December 2006  (6 months) Mountain View, CA, USA - Evaluated websites for quality \n- Wrote a global daily training newsletter \n- Co-organized a global weekly training session with engineering team Producer DVTime Studios 2003  –  2006  (3 years) At DVTime Studios, I worked on a variety of media projects for both individuals and corporations. These projects included training DVDs, event videos, broadcast commercials, and online interactive virtual tours for the real estate industry. I had a number of technical responsibilities including DVD authoring, video recording and editing, and online development. Intern Tierney Communications June 2005  –  August 2005  (3 months) At Tierney Communications I was an intern primarily working in the A/V department. During my time there, I refurbished an Avid editing suite as well as other A/V facilities, helping to create a more efficient and professional operation. I also worked on video editing and services for both internal and external use, including the handling of confidential material, trained non-technical employees on industry-related terms necessary for communication with clients, and researched and recommended new presentation equipment for the sales team to help them stand out from competitors. Assistant Director of A/V Camp Germantown Academy 2003  –  2004  (1 year) I taught video production to students aged 9-14 at a specialty day camp and also produced annual highlights videos for the general day camp. Intern Stone-Glidden May 2002  –  May 2002  (1 month) For a high school \"Senior Project\" I was an intern at Stone-Glidden, an A/V installation company. I observed the sales and design process of high-end home entertainment, security, communication, and automation systems and also assisted with installation of these systems at all stages of completion. Computer Staff Germantown Academy 1999  –  2002  (3 years) I performed summer maintenance and upgrades (both hardware and software) on over 200 Macs used by students and faculty. Partner Operations Manager Google May 2015  – Present (4 months) Cambridge, Massachusetts I support partners who use ITA Software by Google. Partner Operations Manager Google May 2015  – Present (4 months) Cambridge, Massachusetts I support partners who use ITA Software by Google. Associate Principal, Product Quality Operations Google June 2012  –  May 2015  (3 years) Mountain View, CA, USA - Managed and mentored full-time employees and interns \n- Led a global functional group focused on webmaster outreach \n- Created content including video, blog posts, messages, and social posts \n- Helped to launch multiple features of Webmaster Tools Associate Principal, Product Quality Operations Google June 2012  –  May 2015  (3 years) Mountain View, CA, USA - Managed and mentored full-time employees and interns \n- Led a global functional group focused on webmaster outreach \n- Created content including video, blog posts, messages, and social posts \n- Helped to launch multiple features of Webmaster Tools Team Lead, Product Quality Operations Google November 2010  –  June 2012  (1 year 8 months) Mountain View, CA, USA - Fought spam in Google Web Search and Google Maps. \n- Educated webmasters on how to make Google-friendly sites. \n- Launched email support system for webmasters \n- Trained team members \n- Person management Team Lead, Product Quality Operations Google November 2010  –  June 2012  (1 year 8 months) Mountain View, CA, USA - Fought spam in Google Web Search and Google Maps. \n- Educated webmasters on how to make Google-friendly sites. \n- Launched email support system for webmasters \n- Trained team members \n- Person management Sr. Strategist, Search Quality Evaluation Google November 2009  –  November 2010  (1 year 1 month) Mountain View, CA, USA - Fought spam in Google's web index. \n- Educated webmasters on how to make Google-friendly sites. Sr. Strategist, Search Quality Evaluation Google November 2009  –  November 2010  (1 year 1 month) Mountain View, CA, USA - Fought spam in Google's web index. \n- Educated webmasters on how to make Google-friendly sites. Strategist, Search Quality Evaluation Google November 2007  –  November 2009  (2 years 1 month) Mountain View, CA, USA - Fought spam in Google's web index. \n- Educated webmasters on how to make Google-friendly sites. \n- Launched YouTube channel for webmasters Strategist, Search Quality Evaluation Google November 2007  –  November 2009  (2 years 1 month) Mountain View, CA, USA - Fought spam in Google's web index. \n- Educated webmasters on how to make Google-friendly sites. \n- Launched YouTube channel for webmasters Associate, Search Quality Evaluation Google December 2006  –  November 2007  (1 year) Mountain View, CA, USA - Investigated sites for webspam violations and took action as necessary \n- Participated in user forums and wrote for our blog to help webmasters to make sites accessible to search engines \n- Developed review process for AdWords landing pages Associate, Search Quality Evaluation Google December 2006  –  November 2007  (1 year) Mountain View, CA, USA - Investigated sites for webspam violations and took action as necessary \n- Participated in user forums and wrote for our blog to help webmasters to make sites accessible to search engines \n- Developed review process for AdWords landing pages Search Quality Evaluator WorkforceLogic (contracted by Google) July 2006  –  December 2006  (6 months) Mountain View, CA, USA - Evaluated websites for quality \n- Wrote a global daily training newsletter \n- Co-organized a global weekly training session with engineering team Search Quality Evaluator WorkforceLogic (contracted by Google) July 2006  –  December 2006  (6 months) Mountain View, CA, USA - Evaluated websites for quality \n- Wrote a global daily training newsletter \n- Co-organized a global weekly training session with engineering team Producer DVTime Studios 2003  –  2006  (3 years) At DVTime Studios, I worked on a variety of media projects for both individuals and corporations. These projects included training DVDs, event videos, broadcast commercials, and online interactive virtual tours for the real estate industry. I had a number of technical responsibilities including DVD authoring, video recording and editing, and online development. Producer DVTime Studios 2003  –  2006  (3 years) At DVTime Studios, I worked on a variety of media projects for both individuals and corporations. These projects included training DVDs, event videos, broadcast commercials, and online interactive virtual tours for the real estate industry. I had a number of technical responsibilities including DVD authoring, video recording and editing, and online development. Intern Tierney Communications June 2005  –  August 2005  (3 months) At Tierney Communications I was an intern primarily working in the A/V department. During my time there, I refurbished an Avid editing suite as well as other A/V facilities, helping to create a more efficient and professional operation. I also worked on video editing and services for both internal and external use, including the handling of confidential material, trained non-technical employees on industry-related terms necessary for communication with clients, and researched and recommended new presentation equipment for the sales team to help them stand out from competitors. Intern Tierney Communications June 2005  –  August 2005  (3 months) At Tierney Communications I was an intern primarily working in the A/V department. During my time there, I refurbished an Avid editing suite as well as other A/V facilities, helping to create a more efficient and professional operation. I also worked on video editing and services for both internal and external use, including the handling of confidential material, trained non-technical employees on industry-related terms necessary for communication with clients, and researched and recommended new presentation equipment for the sales team to help them stand out from competitors. Assistant Director of A/V Camp Germantown Academy 2003  –  2004  (1 year) I taught video production to students aged 9-14 at a specialty day camp and also produced annual highlights videos for the general day camp. Assistant Director of A/V Camp Germantown Academy 2003  –  2004  (1 year) I taught video production to students aged 9-14 at a specialty day camp and also produced annual highlights videos for the general day camp. Intern Stone-Glidden May 2002  –  May 2002  (1 month) For a high school \"Senior Project\" I was an intern at Stone-Glidden, an A/V installation company. I observed the sales and design process of high-end home entertainment, security, communication, and automation systems and also assisted with installation of these systems at all stages of completion. Intern Stone-Glidden May 2002  –  May 2002  (1 month) For a high school \"Senior Project\" I was an intern at Stone-Glidden, an A/V installation company. I observed the sales and design process of high-end home entertainment, security, communication, and automation systems and also assisted with installation of these systems at all stages of completion. Computer Staff Germantown Academy 1999  –  2002  (3 years) I performed summer maintenance and upgrades (both hardware and software) on over 200 Macs used by students and faculty. Computer Staff Germantown Academy 1999  –  2002  (3 years) I performed summer maintenance and upgrades (both hardware and software) on over 200 Macs used by students and faculty. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Search communications Video Production Video Video Editing Marketing Public Relations Public Speaking Skills  Search communications Video Production Video Video Editing Marketing Public Relations Public Speaking Search communications Video Production Video Video Editing Marketing Public Relations Public Speaking Search communications Video Production Video Video Editing Marketing Public Relations Public Speaking Education The Johns Hopkins University BA,  Film & Media Studies 2002  – 2006 Germantown Academy 1992  – 2002 The Johns Hopkins University BA,  Film & Media Studies 2002  – 2006 The Johns Hopkins University BA,  Film & Media Studies 2002  – 2006 The Johns Hopkins University BA,  Film & Media Studies 2002  – 2006 Germantown Academy 1992  – 2002 Germantown Academy 1992  – 2002 Germantown Academy 1992  – 2002 ", "Languages French French French Skills Marketing Strategy Market Research Partnerships Strategy Business Strategy Entrepreneurship Start-ups Product Management Online Advertising Analytics Competitive Analysis E-commerce Marketing Product Marketing Strategic Partnerships Skills  Marketing Strategy Market Research Partnerships Strategy Business Strategy Entrepreneurship Start-ups Product Management Online Advertising Analytics Competitive Analysis E-commerce Marketing Product Marketing Strategic Partnerships Marketing Strategy Market Research Partnerships Strategy Business Strategy Entrepreneurship Start-ups Product Management Online Advertising Analytics Competitive Analysis E-commerce Marketing Product Marketing Strategic Partnerships Marketing Strategy Market Research Partnerships Strategy Business Strategy Entrepreneurship Start-ups Product Management Online Advertising Analytics Competitive Analysis E-commerce Marketing Product Marketing Strategic Partnerships Honors & Awards ", "Summary ♦ Management Professional with rich and diverse experience leading numerous technology and business initiatives across Commercial Excellence, Business Analytics, Product Development, Marketing and Vendor Management in Fortune Global 100 companies \n \n♦ Graduate of GE Corporate's reputed Information Management Leadership Program \n \n♦ Interest Areas: Product Management, CRM, Analytics, Data Visualization, Technology Evangelism, Social Media and Computer Science \n \n♦ Educational Background ★ MBA from NITIE, Mumbai ★ B.E Computer Science and Engineering Summary ♦ Management Professional with rich and diverse experience leading numerous technology and business initiatives across Commercial Excellence, Business Analytics, Product Development, Marketing and Vendor Management in Fortune Global 100 companies \n \n♦ Graduate of GE Corporate's reputed Information Management Leadership Program \n \n♦ Interest Areas: Product Management, CRM, Analytics, Data Visualization, Technology Evangelism, Social Media and Computer Science \n \n♦ Educational Background ★ MBA from NITIE, Mumbai ★ B.E Computer Science and Engineering ♦ Management Professional with rich and diverse experience leading numerous technology and business initiatives across Commercial Excellence, Business Analytics, Product Development, Marketing and Vendor Management in Fortune Global 100 companies \n \n♦ Graduate of GE Corporate's reputed Information Management Leadership Program \n \n♦ Interest Areas: Product Management, CRM, Analytics, Data Visualization, Technology Evangelism, Social Media and Computer Science \n \n♦ Educational Background ★ MBA from NITIE, Mumbai ★ B.E Computer Science and Engineering ♦ Management Professional with rich and diverse experience leading numerous technology and business initiatives across Commercial Excellence, Business Analytics, Product Development, Marketing and Vendor Management in Fortune Global 100 companies \n \n♦ Graduate of GE Corporate's reputed Information Management Leadership Program \n \n♦ Interest Areas: Product Management, CRM, Analytics, Data Visualization, Technology Evangelism, Social Media and Computer Science \n \n♦ Educational Background ★ MBA from NITIE, Mumbai ★ B.E Computer Science and Engineering Experience Associate Principal, Product Quality Operations Google February 2015  – Present (7 months) Hyderabad, India ♦ Preventing Spam and Abuse on Google Products, increasing user trust and ensuring a safer and high quality product experience. Senior Project Manager - Sales and Marketing, South Asia GE Healthcare March 2013  –  January 2015  (1 year 11 months) Bangalore, India ♦ Program Manager for Salesforce.com, Universal Customer Master, Marketing Automation and other Commercial Excellence Technology Programs for GE Healthcare South Asia. Senior Project Manager - Process Excellence, Healthcare Systems GE Healthcare August 2011  –  February 2013  (1 year 7 months) Bangalore, India ♦ Developed and led a Voice Of Customer Data Analytics program to deliver data backed insights from unstructured data signals to aid in the Value creation for New Product Introductions (NPIs) for Healthcare Systems, $XX Billion business of GE Healthcare. \n \n♦ Led a pilot initiative for short term and long term sales forecasting through statistical analysis leveraging several Macroeconomic and Healthcare industry indicators and historical sales data and trends. \n \n♦ Evangelist for driving adoption of Colab, GE's Enterprise Social Collaboration tool across GE Healthcare. Information Management Leadership Program (IMLP) General Electric July 2009  –  August 2011  (2 years 2 months) Gurgaon and Bangalore, India Information Management Leadership Program (IMLP) is a 2 year rotational program that aims at creating a pipeline of future IM leaders for GE. The IMLP program consists of 4 six month rotations across GE Businesses that allows one to gain exposure to diverse GE businesses, Technology and Functional processes. The program also consists of extensive contact based training on Technology, Business and Leadership skills. \n \nKey Accomplishments: \n \n♦ Conceptualized and developed the Voice of Customer Data Triangulation program in GE Healthcare to identify insights from numerous data sources using text analytics tools – Delivered a successful POC for Digital X-Rays and laid the ground work to scale up the program. \n \n♦ Successfully implemented a Leasing Platform for GE Capital India to support 4X portfolio growth working across multiple cross functional teams and with global vendor teams \n \n♦ Managed a multi-phased Data Network optimization (Tier-2 Hubs decommissioning, MPLS migration) project for over 350 GE business sites in ASPAC, working with virtual teams spread across India, China, HK, Australia, US and South East Asia, resulting in significant improvements in network service levels and significant reductions in Annual Operating costs, optimization of network architecture. \n \n♦ Delivered service contracts module for a Siebel CRM implementation for GE Healthcare’s ANZ Service business  \n \n♦ Other initiatives: Enterprise 2.0, Email marketing solutions. IMLP Intern, Vendor Management Office, Global IT GE Healthcare February 2009  –  May 2009  (4 months) Bangalore, India ♦ Developed an outsourcing metrics dashboard for the then newly formed GE Technology Infrastructure vertical (GE Healthcare, Transportation, Aviation, Enterprise Solutions businesses) to help CIO’s and IT leaders drive vendor strategy \n♦ Tracked and reported key VMO and compliance metrics to all the CIOs and their Vendor Management representatives Marketing Intern Castrol April 2008  –  June 2008  (3 months) Chennai, India ► Product Line Positioning strategy for Corrosion Preventives of Castrol Industrial Lubricants & Services in the Indian B2B Market \n★ Market Research, Competitor Analysis, Product benchmarking, Gap analysis, Product line positioning charts \n \n► Received a Pre Placement Interview Offer and a Certificate of Appreciation from Castrol post internship. Engineer - Software Development Nokia Siemens Networks July 2005  –  June 2007  (2 years) Bangalore, India ♦ Led the development a Telecom Diagnostic product suite and its Graphical Result browser - Responsible for requirements gathering, functional and technical analysis and design, implementation and testing \n♦ Assigned Sub project Leader and Feature Development Coordinator responsibilities across multiple sites – Bratislava, Vienna and Bangalore, within first year \n \n►Core Expertise  \n★Object Oriented Analysis & Design ★Visual C++/MFC Programming ★User Interface Design ★User Experience ★ Software engineering tools - Visual Studio, Rational Rose, Installshield Professional and Rational Clearcase. Project Trainee (Full Time) Siemens February 2005  –  May 2005  (4 months) Bangalore, India ♦ Developed a prototype of a Graphical Result browser for a Telecom Diagnostic product \n♦ Made enhancements to a KPI reporting tool for Base Transceiver Stations \n♦ Automated the interface between Manpower activity tracking system and invoicing finance system Associate Principal, Product Quality Operations Google February 2015  – Present (7 months) Hyderabad, India ♦ Preventing Spam and Abuse on Google Products, increasing user trust and ensuring a safer and high quality product experience. Associate Principal, Product Quality Operations Google February 2015  – Present (7 months) Hyderabad, India ♦ Preventing Spam and Abuse on Google Products, increasing user trust and ensuring a safer and high quality product experience. Senior Project Manager - Sales and Marketing, South Asia GE Healthcare March 2013  –  January 2015  (1 year 11 months) Bangalore, India ♦ Program Manager for Salesforce.com, Universal Customer Master, Marketing Automation and other Commercial Excellence Technology Programs for GE Healthcare South Asia. Senior Project Manager - Sales and Marketing, South Asia GE Healthcare March 2013  –  January 2015  (1 year 11 months) Bangalore, India ♦ Program Manager for Salesforce.com, Universal Customer Master, Marketing Automation and other Commercial Excellence Technology Programs for GE Healthcare South Asia. Senior Project Manager - Process Excellence, Healthcare Systems GE Healthcare August 2011  –  February 2013  (1 year 7 months) Bangalore, India ♦ Developed and led a Voice Of Customer Data Analytics program to deliver data backed insights from unstructured data signals to aid in the Value creation for New Product Introductions (NPIs) for Healthcare Systems, $XX Billion business of GE Healthcare. \n \n♦ Led a pilot initiative for short term and long term sales forecasting through statistical analysis leveraging several Macroeconomic and Healthcare industry indicators and historical sales data and trends. \n \n♦ Evangelist for driving adoption of Colab, GE's Enterprise Social Collaboration tool across GE Healthcare. Senior Project Manager - Process Excellence, Healthcare Systems GE Healthcare August 2011  –  February 2013  (1 year 7 months) Bangalore, India ♦ Developed and led a Voice Of Customer Data Analytics program to deliver data backed insights from unstructured data signals to aid in the Value creation for New Product Introductions (NPIs) for Healthcare Systems, $XX Billion business of GE Healthcare. \n \n♦ Led a pilot initiative for short term and long term sales forecasting through statistical analysis leveraging several Macroeconomic and Healthcare industry indicators and historical sales data and trends. \n \n♦ Evangelist for driving adoption of Colab, GE's Enterprise Social Collaboration tool across GE Healthcare. Information Management Leadership Program (IMLP) General Electric July 2009  –  August 2011  (2 years 2 months) Gurgaon and Bangalore, India Information Management Leadership Program (IMLP) is a 2 year rotational program that aims at creating a pipeline of future IM leaders for GE. The IMLP program consists of 4 six month rotations across GE Businesses that allows one to gain exposure to diverse GE businesses, Technology and Functional processes. The program also consists of extensive contact based training on Technology, Business and Leadership skills. \n \nKey Accomplishments: \n \n♦ Conceptualized and developed the Voice of Customer Data Triangulation program in GE Healthcare to identify insights from numerous data sources using text analytics tools – Delivered a successful POC for Digital X-Rays and laid the ground work to scale up the program. \n \n♦ Successfully implemented a Leasing Platform for GE Capital India to support 4X portfolio growth working across multiple cross functional teams and with global vendor teams \n \n♦ Managed a multi-phased Data Network optimization (Tier-2 Hubs decommissioning, MPLS migration) project for over 350 GE business sites in ASPAC, working with virtual teams spread across India, China, HK, Australia, US and South East Asia, resulting in significant improvements in network service levels and significant reductions in Annual Operating costs, optimization of network architecture. \n \n♦ Delivered service contracts module for a Siebel CRM implementation for GE Healthcare’s ANZ Service business  \n \n♦ Other initiatives: Enterprise 2.0, Email marketing solutions. Information Management Leadership Program (IMLP) General Electric July 2009  –  August 2011  (2 years 2 months) Gurgaon and Bangalore, India Information Management Leadership Program (IMLP) is a 2 year rotational program that aims at creating a pipeline of future IM leaders for GE. The IMLP program consists of 4 six month rotations across GE Businesses that allows one to gain exposure to diverse GE businesses, Technology and Functional processes. The program also consists of extensive contact based training on Technology, Business and Leadership skills. \n \nKey Accomplishments: \n \n♦ Conceptualized and developed the Voice of Customer Data Triangulation program in GE Healthcare to identify insights from numerous data sources using text analytics tools – Delivered a successful POC for Digital X-Rays and laid the ground work to scale up the program. \n \n♦ Successfully implemented a Leasing Platform for GE Capital India to support 4X portfolio growth working across multiple cross functional teams and with global vendor teams \n \n♦ Managed a multi-phased Data Network optimization (Tier-2 Hubs decommissioning, MPLS migration) project for over 350 GE business sites in ASPAC, working with virtual teams spread across India, China, HK, Australia, US and South East Asia, resulting in significant improvements in network service levels and significant reductions in Annual Operating costs, optimization of network architecture. \n \n♦ Delivered service contracts module for a Siebel CRM implementation for GE Healthcare’s ANZ Service business  \n \n♦ Other initiatives: Enterprise 2.0, Email marketing solutions. IMLP Intern, Vendor Management Office, Global IT GE Healthcare February 2009  –  May 2009  (4 months) Bangalore, India ♦ Developed an outsourcing metrics dashboard for the then newly formed GE Technology Infrastructure vertical (GE Healthcare, Transportation, Aviation, Enterprise Solutions businesses) to help CIO’s and IT leaders drive vendor strategy \n♦ Tracked and reported key VMO and compliance metrics to all the CIOs and their Vendor Management representatives IMLP Intern, Vendor Management Office, Global IT GE Healthcare February 2009  –  May 2009  (4 months) Bangalore, India ♦ Developed an outsourcing metrics dashboard for the then newly formed GE Technology Infrastructure vertical (GE Healthcare, Transportation, Aviation, Enterprise Solutions businesses) to help CIO’s and IT leaders drive vendor strategy \n♦ Tracked and reported key VMO and compliance metrics to all the CIOs and their Vendor Management representatives Marketing Intern Castrol April 2008  –  June 2008  (3 months) Chennai, India ► Product Line Positioning strategy for Corrosion Preventives of Castrol Industrial Lubricants & Services in the Indian B2B Market \n★ Market Research, Competitor Analysis, Product benchmarking, Gap analysis, Product line positioning charts \n \n► Received a Pre Placement Interview Offer and a Certificate of Appreciation from Castrol post internship. Marketing Intern Castrol April 2008  –  June 2008  (3 months) Chennai, India ► Product Line Positioning strategy for Corrosion Preventives of Castrol Industrial Lubricants & Services in the Indian B2B Market \n★ Market Research, Competitor Analysis, Product benchmarking, Gap analysis, Product line positioning charts \n \n► Received a Pre Placement Interview Offer and a Certificate of Appreciation from Castrol post internship. Engineer - Software Development Nokia Siemens Networks July 2005  –  June 2007  (2 years) Bangalore, India ♦ Led the development a Telecom Diagnostic product suite and its Graphical Result browser - Responsible for requirements gathering, functional and technical analysis and design, implementation and testing \n♦ Assigned Sub project Leader and Feature Development Coordinator responsibilities across multiple sites – Bratislava, Vienna and Bangalore, within first year \n \n►Core Expertise  \n★Object Oriented Analysis & Design ★Visual C++/MFC Programming ★User Interface Design ★User Experience ★ Software engineering tools - Visual Studio, Rational Rose, Installshield Professional and Rational Clearcase. Engineer - Software Development Nokia Siemens Networks July 2005  –  June 2007  (2 years) Bangalore, India ♦ Led the development a Telecom Diagnostic product suite and its Graphical Result browser - Responsible for requirements gathering, functional and technical analysis and design, implementation and testing \n♦ Assigned Sub project Leader and Feature Development Coordinator responsibilities across multiple sites – Bratislava, Vienna and Bangalore, within first year \n \n►Core Expertise  \n★Object Oriented Analysis & Design ★Visual C++/MFC Programming ★User Interface Design ★User Experience ★ Software engineering tools - Visual Studio, Rational Rose, Installshield Professional and Rational Clearcase. Project Trainee (Full Time) Siemens February 2005  –  May 2005  (4 months) Bangalore, India ♦ Developed a prototype of a Graphical Result browser for a Telecom Diagnostic product \n♦ Made enhancements to a KPI reporting tool for Base Transceiver Stations \n♦ Automated the interface between Manpower activity tracking system and invoicing finance system Project Trainee (Full Time) Siemens February 2005  –  May 2005  (4 months) Bangalore, India ♦ Developed a prototype of a Graphical Result browser for a Telecom Diagnostic product \n♦ Made enhancements to a KPI reporting tool for Base Transceiver Stations \n♦ Automated the interface between Manpower activity tracking system and invoicing finance system Languages English Hindi Malayalam English Hindi Malayalam English Hindi Malayalam Skills Program Management Product Management Business Analysis Salesforce.com Marketo Clarabridge Product Strategy Competitive Analysis Product Development Stakeholder Management Vendor Management CRM Requirements Gathering Telecommunications IT Strategy Marketing Strategy C++ User Experience Master Data Management Social Media User Interface Design Unstructured Data Text Analytics Technology Evangelism Enterprise 2.0 Lean Initiatives Financial Systems Object Oriented... MFC UCM See 15+     See less Skills  Program Management Product Management Business Analysis Salesforce.com Marketo Clarabridge Product Strategy Competitive Analysis Product Development Stakeholder Management Vendor Management CRM Requirements Gathering Telecommunications IT Strategy Marketing Strategy C++ User Experience Master Data Management Social Media User Interface Design Unstructured Data Text Analytics Technology Evangelism Enterprise 2.0 Lean Initiatives Financial Systems Object Oriented... MFC UCM See 15+     See less Program Management Product Management Business Analysis Salesforce.com Marketo Clarabridge Product Strategy Competitive Analysis Product Development Stakeholder Management Vendor Management CRM Requirements Gathering Telecommunications IT Strategy Marketing Strategy C++ User Experience Master Data Management Social Media User Interface Design Unstructured Data Text Analytics Technology Evangelism Enterprise 2.0 Lean Initiatives Financial Systems Object Oriented... MFC UCM See 15+     See less Program Management Product Management Business Analysis Salesforce.com Marketo Clarabridge Product Strategy Competitive Analysis Product Development Stakeholder Management Vendor Management CRM Requirements Gathering Telecommunications IT Strategy Marketing Strategy C++ User Experience Master Data Management Social Media User Interface Design Unstructured Data Text Analytics Technology Evangelism Enterprise 2.0 Lean Initiatives Financial Systems Object Oriented... MFC UCM See 15+     See less Education National Institute of Industrial Engineering MBA,  General Management 2007  – 2009 ♦ Elected Student Placement Coordinator, NITIE, 2007-2009 \n-Managed relationship with more than 50 Corporates and ensured strong placements at NITIE in a recessionary year Activities and Societies:  Elected Student Placement Coordinator ,  2007-2009. Visvesvaraya Technological University BE,  Computer Science and Engineering 2001  – 2005 ♦ Won over 10 prizes at inter and intra-collegiate levels for On the spot programming, Debugging, Quizzing, Skit and Mad-Ads competitions \n♦ Member-Cultural Committee-JSSATE-2001-2003 \n♦ Organizing committee member-Continuum’2004 – First ever technical fest organized by Dept of CSE & ISE-JSSATE \n♦ Founder-Quiz Club-JSSATE-2004 Activities and Societies:  Quizzing ,  Programming and Debugging competitions ,  Dramatics ,  Member-Cultural committee National Institute of Industrial Engineering MBA,  General Management 2007  – 2009 ♦ Elected Student Placement Coordinator, NITIE, 2007-2009 \n-Managed relationship with more than 50 Corporates and ensured strong placements at NITIE in a recessionary year Activities and Societies:  Elected Student Placement Coordinator ,  2007-2009. National Institute of Industrial Engineering MBA,  General Management 2007  – 2009 ♦ Elected Student Placement Coordinator, NITIE, 2007-2009 \n-Managed relationship with more than 50 Corporates and ensured strong placements at NITIE in a recessionary year Activities and Societies:  Elected Student Placement Coordinator ,  2007-2009. National Institute of Industrial Engineering MBA,  General Management 2007  – 2009 ♦ Elected Student Placement Coordinator, NITIE, 2007-2009 \n-Managed relationship with more than 50 Corporates and ensured strong placements at NITIE in a recessionary year Activities and Societies:  Elected Student Placement Coordinator ,  2007-2009. Visvesvaraya Technological University BE,  Computer Science and Engineering 2001  – 2005 ♦ Won over 10 prizes at inter and intra-collegiate levels for On the spot programming, Debugging, Quizzing, Skit and Mad-Ads competitions \n♦ Member-Cultural Committee-JSSATE-2001-2003 \n♦ Organizing committee member-Continuum’2004 – First ever technical fest organized by Dept of CSE & ISE-JSSATE \n♦ Founder-Quiz Club-JSSATE-2004 Activities and Societies:  Quizzing ,  Programming and Debugging competitions ,  Dramatics ,  Member-Cultural committee Visvesvaraya Technological University BE,  Computer Science and Engineering 2001  – 2005 ♦ Won over 10 prizes at inter and intra-collegiate levels for On the spot programming, Debugging, Quizzing, Skit and Mad-Ads competitions \n♦ Member-Cultural Committee-JSSATE-2001-2003 \n♦ Organizing committee member-Continuum’2004 – First ever technical fest organized by Dept of CSE & ISE-JSSATE \n♦ Founder-Quiz Club-JSSATE-2004 Activities and Societies:  Quizzing ,  Programming and Debugging competitions ,  Dramatics ,  Member-Cultural committee Visvesvaraya Technological University BE,  Computer Science and Engineering 2001  – 2005 ♦ Won over 10 prizes at inter and intra-collegiate levels for On the spot programming, Debugging, Quizzing, Skit and Mad-Ads competitions \n♦ Member-Cultural Committee-JSSATE-2001-2003 \n♦ Organizing committee member-Continuum’2004 – First ever technical fest organized by Dept of CSE & ISE-JSSATE \n♦ Founder-Quiz Club-JSSATE-2004 Activities and Societies:  Quizzing ,  Programming and Debugging competitions ,  Dramatics ,  Member-Cultural committee Honors & Awards Best Assignment Leader for IT Leadership Program (ITLP) Employees in GE Healthcare India - ITLP Rotation cycle - Feb-Aug'14 GE Healthcare South Asia CIO and ITPE HRM October 2014 Annual CEO Award for Customer Centricity and Innovation, 2014 GE Healthcare South Asia CEO January 2014 Annual CIO Team Award for Vendor Management, 2014 GE Healthcare Global CIO January 2014 CIO Initiatives Award for External Focus GE Healthcare South Asia CIO February 2014 GE Above and Beyond Bronze Award for External focus GE Healthcare South Asia IT Leader November 2013 Best Assignment Leader - GE India Summer Internship Program, 2013 Head, Human Resources, GE India August 2013 Moderator, Executive panel discussion on “Social Collaboration” at GE Healthcare Asia Technology Conference, 2012 November 2012 GE Above and Beyond Bronze Award for External focus Program Manager - Process Excellence, Healthcare Systems June 2011 Runner up, \"Open Source Code War\"- GE India IT Architecture Summit, 2011 GE India March 2011 Technology Tiger award–GE IMLP Junior Bootcamp GE IMLP Global Program Manager August 2009 Certificate of Appreciation & Pre-Placement Interview offer HR, Castrol India June 2008 Certificate of Appreciation & Pre-Placement Interview offer from Castrol for performance as a Marketing Summer Intern, Jun'08 Best Assignment Leader for IT Leadership Program (ITLP) Employees in GE Healthcare India - ITLP Rotation cycle - Feb-Aug'14 GE Healthcare South Asia CIO and ITPE HRM October 2014 Best Assignment Leader for IT Leadership Program (ITLP) Employees in GE Healthcare India - ITLP Rotation cycle - Feb-Aug'14 GE Healthcare South Asia CIO and ITPE HRM October 2014 Best Assignment Leader for IT Leadership Program (ITLP) Employees in GE Healthcare India - ITLP Rotation cycle - Feb-Aug'14 GE Healthcare South Asia CIO and ITPE HRM October 2014 Annual CEO Award for Customer Centricity and Innovation, 2014 GE Healthcare South Asia CEO January 2014 Annual CEO Award for Customer Centricity and Innovation, 2014 GE Healthcare South Asia CEO January 2014 Annual CEO Award for Customer Centricity and Innovation, 2014 GE Healthcare South Asia CEO January 2014 Annual CIO Team Award for Vendor Management, 2014 GE Healthcare Global CIO January 2014 Annual CIO Team Award for Vendor Management, 2014 GE Healthcare Global CIO January 2014 Annual CIO Team Award for Vendor Management, 2014 GE Healthcare Global CIO January 2014 CIO Initiatives Award for External Focus GE Healthcare South Asia CIO February 2014 CIO Initiatives Award for External Focus GE Healthcare South Asia CIO February 2014 CIO Initiatives Award for External Focus GE Healthcare South Asia CIO February 2014 GE Above and Beyond Bronze Award for External focus GE Healthcare South Asia IT Leader November 2013 GE Above and Beyond Bronze Award for External focus GE Healthcare South Asia IT Leader November 2013 GE Above and Beyond Bronze Award for External focus GE Healthcare South Asia IT Leader November 2013 Best Assignment Leader - GE India Summer Internship Program, 2013 Head, Human Resources, GE India August 2013 Best Assignment Leader - GE India Summer Internship Program, 2013 Head, Human Resources, GE India August 2013 Best Assignment Leader - GE India Summer Internship Program, 2013 Head, Human Resources, GE India August 2013 Moderator, Executive panel discussion on “Social Collaboration” at GE Healthcare Asia Technology Conference, 2012 November 2012 Moderator, Executive panel discussion on “Social Collaboration” at GE Healthcare Asia Technology Conference, 2012 November 2012 Moderator, Executive panel discussion on “Social Collaboration” at GE Healthcare Asia Technology Conference, 2012 November 2012 GE Above and Beyond Bronze Award for External focus Program Manager - Process Excellence, Healthcare Systems June 2011 GE Above and Beyond Bronze Award for External focus Program Manager - Process Excellence, Healthcare Systems June 2011 GE Above and Beyond Bronze Award for External focus Program Manager - Process Excellence, Healthcare Systems June 2011 Runner up, \"Open Source Code War\"- GE India IT Architecture Summit, 2011 GE India March 2011 Runner up, \"Open Source Code War\"- GE India IT Architecture Summit, 2011 GE India March 2011 Runner up, \"Open Source Code War\"- GE India IT Architecture Summit, 2011 GE India March 2011 Technology Tiger award–GE IMLP Junior Bootcamp GE IMLP Global Program Manager August 2009 Technology Tiger award–GE IMLP Junior Bootcamp GE IMLP Global Program Manager August 2009 Technology Tiger award–GE IMLP Junior Bootcamp GE IMLP Global Program Manager August 2009 Certificate of Appreciation & Pre-Placement Interview offer HR, Castrol India June 2008 Certificate of Appreciation & Pre-Placement Interview offer from Castrol for performance as a Marketing Summer Intern, Jun'08 Certificate of Appreciation & Pre-Placement Interview offer HR, Castrol India June 2008 Certificate of Appreciation & Pre-Placement Interview offer from Castrol for performance as a Marketing Summer Intern, Jun'08 Certificate of Appreciation & Pre-Placement Interview offer HR, Castrol India June 2008 Certificate of Appreciation & Pre-Placement Interview offer from Castrol for performance as a Marketing Summer Intern, Jun'08 ", "Experience Director, Search and Analytics Solutions Google October 2013  – Present (1 year 11 months) 1600 Amphitheatre Parkway, Mountain View,. California 94043 Responsible for driving the commercialization and strategy for the global Search ads business and media optimization capabilities for Google Analytics.  Head of Mobile Search Sales and Strategy Google January 2012  – Present (3 years 8 months) Mountain View, CA Head of Mobile Advertising | Online Sales Google March 2010  –  June 2012  (2 years 4 months) Associate Principal McKinsey and Company July 2003  –  December 2009  (6 years 6 months) Sr. Software Engineer EMC September 2002  –  June 2003  (10 months) Sr. Software Engineer Zaplet June 1999  –  June 2002  (3 years 1 month) Director, Search and Analytics Solutions Google October 2013  – Present (1 year 11 months) 1600 Amphitheatre Parkway, Mountain View,. California 94043 Responsible for driving the commercialization and strategy for the global Search ads business and media optimization capabilities for Google Analytics.  Director, Search and Analytics Solutions Google October 2013  – Present (1 year 11 months) 1600 Amphitheatre Parkway, Mountain View,. California 94043 Responsible for driving the commercialization and strategy for the global Search ads business and media optimization capabilities for Google Analytics.  Head of Mobile Search Sales and Strategy Google January 2012  – Present (3 years 8 months) Mountain View, CA Head of Mobile Search Sales and Strategy Google January 2012  – Present (3 years 8 months) Mountain View, CA Head of Mobile Advertising | Online Sales Google March 2010  –  June 2012  (2 years 4 months) Head of Mobile Advertising | Online Sales Google March 2010  –  June 2012  (2 years 4 months) Associate Principal McKinsey and Company July 2003  –  December 2009  (6 years 6 months) Associate Principal McKinsey and Company July 2003  –  December 2009  (6 years 6 months) Sr. Software Engineer EMC September 2002  –  June 2003  (10 months) Sr. Software Engineer EMC September 2002  –  June 2003  (10 months) Sr. Software Engineer Zaplet June 1999  –  June 2002  (3 years 1 month) Sr. Software Engineer Zaplet June 1999  –  June 2002  (3 years 1 month) Skills Strategy Business Strategy Management Consulting Go-to-market Strategy Corporate Development Strategic Partnerships Online Advertising Cloud Computing Analytics E-commerce Mergers & Acquisitions Start-ups Mobile Advertising Competitive Analysis Mobile Applications Software Development Programming Mobile Devices Agile Methodologies Business Development Entrepreneurship See 6+     See less Skills  Strategy Business Strategy Management Consulting Go-to-market Strategy Corporate Development Strategic Partnerships Online Advertising Cloud Computing Analytics E-commerce Mergers & Acquisitions Start-ups Mobile Advertising Competitive Analysis Mobile Applications Software Development Programming Mobile Devices Agile Methodologies Business Development Entrepreneurship See 6+     See less Strategy Business Strategy Management Consulting Go-to-market Strategy Corporate Development Strategic Partnerships Online Advertising Cloud Computing Analytics E-commerce Mergers & Acquisitions Start-ups Mobile Advertising Competitive Analysis Mobile Applications Software Development Programming Mobile Devices Agile Methodologies Business Development Entrepreneurship See 6+     See less Strategy Business Strategy Management Consulting Go-to-market Strategy Corporate Development Strategic Partnerships Online Advertising Cloud Computing Analytics E-commerce Mergers & Acquisitions Start-ups Mobile Advertising Competitive Analysis Mobile Applications Software Development Programming Mobile Devices Agile Methodologies Business Development Entrepreneurship See 6+     See less Education Stanford University MS,  Computer Science 1998  – 2000 Stanford University BS,  Computer Science 1994  – 1998 Manchester High School West 1990  – 1994 Stanford University MS,  Computer Science 1998  – 2000 Stanford University MS,  Computer Science 1998  – 2000 Stanford University MS,  Computer Science 1998  – 2000 Stanford University BS,  Computer Science 1994  – 1998 Stanford University BS,  Computer Science 1994  – 1998 Stanford University BS,  Computer Science 1994  – 1998 Manchester High School West 1990  – 1994 Manchester High School West 1990  – 1994 Manchester High School West 1990  – 1994 ", "Experience Niantic Ops Associate Principal Niantic Labs @ Google May 2015  – Present (4 months) Niantic Ops Senior Strategist Niantic Labs @ Google September 2013  –  May 2015  (1 year 9 months) Niantic Ops Strategist Niantic Labs @ Google November 2012  –  September 2013  (11 months) San Francisco Bay Area Google Play Ops Strategist Google May 2012  –  November 2012  (7 months) Mountain View, CA Google Play Ops Associate Google March 2011  –  May 2012  (1 year 3 months) Mountain View, CA Product Manager - P&C Content Zywave June 2010  –  March 2011  (10 months) Content Writer Zywave May 2010  –  July 2010  (3 months) Content Analyst Zywave June 2009  –  May 2010  (1 year) - Communications writing, primarily P&C content \n- Manage social media accounts \n- Resident Tweeter \n- Collect valuable Partner insight and feedback on products Student Assistant University of Wisconsin Athletic Communications August 2007  –  December 2008  (1 year 5 months) - Media relations position \n- Wrote stories and press releases following women’s lightweight rowing team, women’s soccer team and swimming/diving teams \n- Responsible for updating news stories, releases and features on the Athletic Department’s Web site \n- Served as contact for assigned athletic teams for both coaches and media \n- Represented the Athletic Department in day-to-day business with teams and coaches \n- Ran statistics and assist with post-game press conferences on weekends for major UW sporting events, including football, men’s hockey, women’s hockey and men’s basketball Deputy News Editor The Badger Herald August 2005  –  May 2007  (1 year 10 months) - Worked up from news reporter to City Beat Reporter, City Beat Editor, and then earned position of Deputy News Editor \n- Edited and wrote stories for the largest independent daily campus newspaper in the nation, which has a daily circulation of 16,000 \n- Headlined, coordinated and lead all parts of the news section two nights a week \n- Oversaw the work of four editors and their respective beats on a daily basis Niantic Ops Associate Principal Niantic Labs @ Google May 2015  – Present (4 months) Niantic Ops Associate Principal Niantic Labs @ Google May 2015  – Present (4 months) Niantic Ops Senior Strategist Niantic Labs @ Google September 2013  –  May 2015  (1 year 9 months) Niantic Ops Senior Strategist Niantic Labs @ Google September 2013  –  May 2015  (1 year 9 months) Niantic Ops Strategist Niantic Labs @ Google November 2012  –  September 2013  (11 months) San Francisco Bay Area Niantic Ops Strategist Niantic Labs @ Google November 2012  –  September 2013  (11 months) San Francisco Bay Area Google Play Ops Strategist Google May 2012  –  November 2012  (7 months) Mountain View, CA Google Play Ops Strategist Google May 2012  –  November 2012  (7 months) Mountain View, CA Google Play Ops Associate Google March 2011  –  May 2012  (1 year 3 months) Mountain View, CA Google Play Ops Associate Google March 2011  –  May 2012  (1 year 3 months) Mountain View, CA Product Manager - P&C Content Zywave June 2010  –  March 2011  (10 months) Product Manager - P&C Content Zywave June 2010  –  March 2011  (10 months) Content Writer Zywave May 2010  –  July 2010  (3 months) Content Writer Zywave May 2010  –  July 2010  (3 months) Content Analyst Zywave June 2009  –  May 2010  (1 year) - Communications writing, primarily P&C content \n- Manage social media accounts \n- Resident Tweeter \n- Collect valuable Partner insight and feedback on products Content Analyst Zywave June 2009  –  May 2010  (1 year) - Communications writing, primarily P&C content \n- Manage social media accounts \n- Resident Tweeter \n- Collect valuable Partner insight and feedback on products Student Assistant University of Wisconsin Athletic Communications August 2007  –  December 2008  (1 year 5 months) - Media relations position \n- Wrote stories and press releases following women’s lightweight rowing team, women’s soccer team and swimming/diving teams \n- Responsible for updating news stories, releases and features on the Athletic Department’s Web site \n- Served as contact for assigned athletic teams for both coaches and media \n- Represented the Athletic Department in day-to-day business with teams and coaches \n- Ran statistics and assist with post-game press conferences on weekends for major UW sporting events, including football, men’s hockey, women’s hockey and men’s basketball Student Assistant University of Wisconsin Athletic Communications August 2007  –  December 2008  (1 year 5 months) - Media relations position \n- Wrote stories and press releases following women’s lightweight rowing team, women’s soccer team and swimming/diving teams \n- Responsible for updating news stories, releases and features on the Athletic Department’s Web site \n- Served as contact for assigned athletic teams for both coaches and media \n- Represented the Athletic Department in day-to-day business with teams and coaches \n- Ran statistics and assist with post-game press conferences on weekends for major UW sporting events, including football, men’s hockey, women’s hockey and men’s basketball Deputy News Editor The Badger Herald August 2005  –  May 2007  (1 year 10 months) - Worked up from news reporter to City Beat Reporter, City Beat Editor, and then earned position of Deputy News Editor \n- Edited and wrote stories for the largest independent daily campus newspaper in the nation, which has a daily circulation of 16,000 \n- Headlined, coordinated and lead all parts of the news section two nights a week \n- Oversaw the work of four editors and their respective beats on a daily basis Deputy News Editor The Badger Herald August 2005  –  May 2007  (1 year 10 months) - Worked up from news reporter to City Beat Reporter, City Beat Editor, and then earned position of Deputy News Editor \n- Edited and wrote stories for the largest independent daily campus newspaper in the nation, which has a daily circulation of 16,000 \n- Headlined, coordinated and lead all parts of the news section two nights a week \n- Oversaw the work of four editors and their respective beats on a daily basis Languages English Native or bilingual proficiency Italian Limited working proficiency German Elementary proficiency English Native or bilingual proficiency Italian Limited working proficiency German Elementary proficiency English Native or bilingual proficiency Italian Limited working proficiency German Elementary proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Technical Writing Editing Social Media Project Management Localization Python HTML JSON Public Relations Media Relations Storytelling Social Networking Social Media Marketing Leadership Advertising Account Management See 1+     See less Skills  Technical Writing Editing Social Media Project Management Localization Python HTML JSON Public Relations Media Relations Storytelling Social Networking Social Media Marketing Leadership Advertising Account Management See 1+     See less Technical Writing Editing Social Media Project Management Localization Python HTML JSON Public Relations Media Relations Storytelling Social Networking Social Media Marketing Leadership Advertising Account Management See 1+     See less Technical Writing Editing Social Media Project Management Localization Python HTML JSON Public Relations Media Relations Storytelling Social Networking Social Media Marketing Leadership Advertising Account Management See 1+     See less Education University of Wisconsin-Madison B.A.,  Journalism/Mass Communications (Emphasis in Strategic Communications and Marketing) ,  Anthropology 2005  – 2008 Cumulative G.P.A. - 3.7 \nUpper level course G.P.A. - 3.9 Activities and Societies:  Dean's List ,  graduated with distinction (top 15 percent of class) John Cabot University - Rome Italian ,  History 2007  – 2007 Study abroad student Activities and Societies:  Achieved perfect marks in all courses: Advanced Italian Language and Ancient Roman History University of Wisconsin-Madison B.A.,  Journalism/Mass Communications (Emphasis in Strategic Communications and Marketing) ,  Anthropology 2005  – 2008 Cumulative G.P.A. - 3.7 \nUpper level course G.P.A. - 3.9 Activities and Societies:  Dean's List ,  graduated with distinction (top 15 percent of class) University of Wisconsin-Madison B.A.,  Journalism/Mass Communications (Emphasis in Strategic Communications and Marketing) ,  Anthropology 2005  – 2008 Cumulative G.P.A. - 3.7 \nUpper level course G.P.A. - 3.9 Activities and Societies:  Dean's List ,  graduated with distinction (top 15 percent of class) University of Wisconsin-Madison B.A.,  Journalism/Mass Communications (Emphasis in Strategic Communications and Marketing) ,  Anthropology 2005  – 2008 Cumulative G.P.A. - 3.7 \nUpper level course G.P.A. - 3.9 Activities and Societies:  Dean's List ,  graduated with distinction (top 15 percent of class) John Cabot University - Rome Italian ,  History 2007  – 2007 Study abroad student Activities and Societies:  Achieved perfect marks in all courses: Advanced Italian Language and Ancient Roman History John Cabot University - Rome Italian ,  History 2007  – 2007 Study abroad student Activities and Societies:  Achieved perfect marks in all courses: Advanced Italian Language and Ancient Roman History John Cabot University - Rome Italian ,  History 2007  – 2007 Study abroad student Activities and Societies:  Achieved perfect marks in all courses: Advanced Italian Language and Ancient Roman History ", "Summary Policy specialist with background in policy creation, implementation and enforcement with a focus on protecting users from fraud and abuse online. Summary Policy specialist with background in policy creation, implementation and enforcement with a focus on protecting users from fraud and abuse online. Policy specialist with background in policy creation, implementation and enforcement with a focus on protecting users from fraud and abuse online. Policy specialist with background in policy creation, implementation and enforcement with a focus on protecting users from fraud and abuse online. Experience Associate Principal, AdWords Policy Specialist Google October 2006  – Present (8 years 11 months) Hyderabad Area, India - Collaborate with cross-functional partners from legal, engineering, product management, sales and operations to drive ad policy enforcement changes for global advertising policies for Google AdWords \n- Work on projects to refine procedures and processes to ensure safe online user experience. \n- Develop internal and external communcations. AdWords Representative Google August 2005  –  October 2006  (1 year 3 months) Hyderabad Area, India Customer Service Associate HSBC July 2003  –  August 2005  (2 years 2 months) Hyderabad Area, India Associate Principal, AdWords Policy Specialist Google October 2006  – Present (8 years 11 months) Hyderabad Area, India - Collaborate with cross-functional partners from legal, engineering, product management, sales and operations to drive ad policy enforcement changes for global advertising policies for Google AdWords \n- Work on projects to refine procedures and processes to ensure safe online user experience. \n- Develop internal and external communcations. Associate Principal, AdWords Policy Specialist Google October 2006  – Present (8 years 11 months) Hyderabad Area, India - Collaborate with cross-functional partners from legal, engineering, product management, sales and operations to drive ad policy enforcement changes for global advertising policies for Google AdWords \n- Work on projects to refine procedures and processes to ensure safe online user experience. \n- Develop internal and external communcations. AdWords Representative Google August 2005  –  October 2006  (1 year 3 months) Hyderabad Area, India AdWords Representative Google August 2005  –  October 2006  (1 year 3 months) Hyderabad Area, India Customer Service Associate HSBC July 2003  –  August 2005  (2 years 2 months) Hyderabad Area, India Customer Service Associate HSBC July 2003  –  August 2005  (2 years 2 months) Hyderabad Area, India Languages   Skills Policy Analysis Policy Writing Policy Online Advertising Abuse Prevention Risk Prevention Communication Policy and Procedure... Risk Analysis and... Project Management Internal & External... Google Adwords Pharmaceutical Industry Search Advertising Google Analytics SEM Analytics Advertising Display Advertising PPC See 5+     See less Skills  Policy Analysis Policy Writing Policy Online Advertising Abuse Prevention Risk Prevention Communication Policy and Procedure... Risk Analysis and... Project Management Internal & External... Google Adwords Pharmaceutical Industry Search Advertising Google Analytics SEM Analytics Advertising Display Advertising PPC See 5+     See less Policy Analysis Policy Writing Policy Online Advertising Abuse Prevention Risk Prevention Communication Policy and Procedure... Risk Analysis and... Project Management Internal & External... Google Adwords Pharmaceutical Industry Search Advertising Google Analytics SEM Analytics Advertising Display Advertising PPC See 5+     See less Policy Analysis Policy Writing Policy Online Advertising Abuse Prevention Risk Prevention Communication Policy and Procedure... Risk Analysis and... Project Management Internal & External... Google Adwords Pharmaceutical Industry Search Advertising Google Analytics SEM Analytics Advertising Display Advertising PPC See 5+     See less Education Osmania University Bachelor of Science (B.Sc.),  Microbiology , General Osmania University Bachelor of Science (B.Sc.),  Microbiology , General Osmania University Bachelor of Science (B.Sc.),  Microbiology , General Osmania University Bachelor of Science (B.Sc.),  Microbiology , General ", "Summary ·\t10 years in the network and security industry. \n·\t5 years in the audio and imaging industry. \n·\t3 graduate degrees in engineering. Completed undergraduate degree in business. \n·\t5 years performing supervisory role in a software development team.  \n·\t10 years of software engineering in C#, SSIS, ASP.NET, and Python. \n·\t10 years of database experience in SQL Server, Oracle, and MySQL. \n·\t10 years of data mining/machine learning/statistics using R, SAS, and SPSS. \n·\tExperience in network and firewall equipment, configuring and deploying Cisco switches, routers, and firewalls. \n·\tExperience in research, developing prototypes, project management, consulting for Fortune 500 companies, creating specification and requirements documents, and presenting to a wide range of audiences. \n·\tGood business acumen with strong ability to solve business problems through data driven quantitative methodologies. \n·\tTeam oriented, energetic, collaborative, diplomatic, and flexible style, with the ability to tailor data driven results to various audience levels. \n \n \nLanguages: C#, VB.NET, ASP.NET, SSIS, Python, PHP, Shell, Perl, C, C++, Java, Awk, J2EE, Selenium \nDatabases: SQL Server, Oracle, MySQL \nStatistics Software: R, SAS, SPSS, Minitab \nOperating Systems: Windows, Linux \nNetwork and Security: TCP/IP, SNMP, Cisco Works, MRTG, Cisco switches and routers, Cisco PIX Summary ·\t10 years in the network and security industry. \n·\t5 years in the audio and imaging industry. \n·\t3 graduate degrees in engineering. Completed undergraduate degree in business. \n·\t5 years performing supervisory role in a software development team.  \n·\t10 years of software engineering in C#, SSIS, ASP.NET, and Python. \n·\t10 years of database experience in SQL Server, Oracle, and MySQL. \n·\t10 years of data mining/machine learning/statistics using R, SAS, and SPSS. \n·\tExperience in network and firewall equipment, configuring and deploying Cisco switches, routers, and firewalls. \n·\tExperience in research, developing prototypes, project management, consulting for Fortune 500 companies, creating specification and requirements documents, and presenting to a wide range of audiences. \n·\tGood business acumen with strong ability to solve business problems through data driven quantitative methodologies. \n·\tTeam oriented, energetic, collaborative, diplomatic, and flexible style, with the ability to tailor data driven results to various audience levels. \n \n \nLanguages: C#, VB.NET, ASP.NET, SSIS, Python, PHP, Shell, Perl, C, C++, Java, Awk, J2EE, Selenium \nDatabases: SQL Server, Oracle, MySQL \nStatistics Software: R, SAS, SPSS, Minitab \nOperating Systems: Windows, Linux \nNetwork and Security: TCP/IP, SNMP, Cisco Works, MRTG, Cisco switches and routers, Cisco PIX ·\t10 years in the network and security industry. \n·\t5 years in the audio and imaging industry. \n·\t3 graduate degrees in engineering. Completed undergraduate degree in business. \n·\t5 years performing supervisory role in a software development team.  \n·\t10 years of software engineering in C#, SSIS, ASP.NET, and Python. \n·\t10 years of database experience in SQL Server, Oracle, and MySQL. \n·\t10 years of data mining/machine learning/statistics using R, SAS, and SPSS. \n·\tExperience in network and firewall equipment, configuring and deploying Cisco switches, routers, and firewalls. \n·\tExperience in research, developing prototypes, project management, consulting for Fortune 500 companies, creating specification and requirements documents, and presenting to a wide range of audiences. \n·\tGood business acumen with strong ability to solve business problems through data driven quantitative methodologies. \n·\tTeam oriented, energetic, collaborative, diplomatic, and flexible style, with the ability to tailor data driven results to various audience levels. \n \n \nLanguages: C#, VB.NET, ASP.NET, SSIS, Python, PHP, Shell, Perl, C, C++, Java, Awk, J2EE, Selenium \nDatabases: SQL Server, Oracle, MySQL \nStatistics Software: R, SAS, SPSS, Minitab \nOperating Systems: Windows, Linux \nNetwork and Security: TCP/IP, SNMP, Cisco Works, MRTG, Cisco switches and routers, Cisco PIX ·\t10 years in the network and security industry. \n·\t5 years in the audio and imaging industry. \n·\t3 graduate degrees in engineering. Completed undergraduate degree in business. \n·\t5 years performing supervisory role in a software development team.  \n·\t10 years of software engineering in C#, SSIS, ASP.NET, and Python. \n·\t10 years of database experience in SQL Server, Oracle, and MySQL. \n·\t10 years of data mining/machine learning/statistics using R, SAS, and SPSS. \n·\tExperience in network and firewall equipment, configuring and deploying Cisco switches, routers, and firewalls. \n·\tExperience in research, developing prototypes, project management, consulting for Fortune 500 companies, creating specification and requirements documents, and presenting to a wide range of audiences. \n·\tGood business acumen with strong ability to solve business problems through data driven quantitative methodologies. \n·\tTeam oriented, energetic, collaborative, diplomatic, and flexible style, with the ability to tailor data driven results to various audience levels. \n \n \nLanguages: C#, VB.NET, ASP.NET, SSIS, Python, PHP, Shell, Perl, C, C++, Java, Awk, J2EE, Selenium \nDatabases: SQL Server, Oracle, MySQL \nStatistics Software: R, SAS, SPSS, Minitab \nOperating Systems: Windows, Linux \nNetwork and Security: TCP/IP, SNMP, Cisco Works, MRTG, Cisco switches and routers, Cisco PIX Experience Associate Principal, Product Quality Operations Google January 2015  – Present (8 months) Mountain View, CA Staff Engineer Dolby Laboratories January 2014  –  January 2015  (1 year 1 month) Sunnyvale, CA Software Development Engineer Dolby Laboratories May 2010  –  January 2014  (3 years 9 months) Sunnyvale, CA Software Engineer Check Point Software Technologies January 2005  –  April 2010  (5 years 4 months) Security Vulnerability Research Engineer nCircle November 2003  –  October 2004  (1 year) Network Management Specialist/Security Focal Point IBM Global Services June 2001  –  November 2003  (2 years 6 months) Network Admin Cal Poly University June 2000  –  June 2001  (1 year 1 month) Associate Principal, Product Quality Operations Google January 2015  – Present (8 months) Mountain View, CA Associate Principal, Product Quality Operations Google January 2015  – Present (8 months) Mountain View, CA Staff Engineer Dolby Laboratories January 2014  –  January 2015  (1 year 1 month) Sunnyvale, CA Staff Engineer Dolby Laboratories January 2014  –  January 2015  (1 year 1 month) Sunnyvale, CA Software Development Engineer Dolby Laboratories May 2010  –  January 2014  (3 years 9 months) Sunnyvale, CA Software Development Engineer Dolby Laboratories May 2010  –  January 2014  (3 years 9 months) Sunnyvale, CA Software Engineer Check Point Software Technologies January 2005  –  April 2010  (5 years 4 months) Software Engineer Check Point Software Technologies January 2005  –  April 2010  (5 years 4 months) Security Vulnerability Research Engineer nCircle November 2003  –  October 2004  (1 year) Security Vulnerability Research Engineer nCircle November 2003  –  October 2004  (1 year) Network Management Specialist/Security Focal Point IBM Global Services June 2001  –  November 2003  (2 years 6 months) Network Management Specialist/Security Focal Point IBM Global Services June 2001  –  November 2003  (2 years 6 months) Network Admin Cal Poly University June 2000  –  June 2001  (1 year 1 month) Network Admin Cal Poly University June 2000  –  June 2001  (1 year 1 month) Languages English Native or bilingual proficiency French Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Professional working proficiency Spanish Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Perl Linux Python TCP/IP C++ Java MySQL Operating Systems Windows C PHP Oracle SNMP Databases Microsoft SQL Server Agile Methodologies Software Engineering Firewalls Software Development Apache HTML Ubuntu Network Administration Unix Cloud Computing Security Web Services Enterprise Software See 13+     See less Skills  Perl Linux Python TCP/IP C++ Java MySQL Operating Systems Windows C PHP Oracle SNMP Databases Microsoft SQL Server Agile Methodologies Software Engineering Firewalls Software Development Apache HTML Ubuntu Network Administration Unix Cloud Computing Security Web Services Enterprise Software See 13+     See less Perl Linux Python TCP/IP C++ Java MySQL Operating Systems Windows C PHP Oracle SNMP Databases Microsoft SQL Server Agile Methodologies Software Engineering Firewalls Software Development Apache HTML Ubuntu Network Administration Unix Cloud Computing Security Web Services Enterprise Software See 13+     See less Perl Linux Python TCP/IP C++ Java MySQL Operating Systems Windows C PHP Oracle SNMP Databases Microsoft SQL Server Agile Methodologies Software Engineering Firewalls Software Development Apache HTML Ubuntu Network Administration Unix Cloud Computing Security Web Services Enterprise Software See 13+     See less Education Central Connecticut State University Master's Degree 2009  – 2014 California State University-East Bay Post-Baccalaureate Certificate 2007  – 2009 California State University-East Bay M.S 2002  – 2005 California Polytechnic State University - College of Business B.S 1997  – 2001 Central Connecticut State University Master's Degree 2009  – 2014 Central Connecticut State University Master's Degree 2009  – 2014 Central Connecticut State University Master's Degree 2009  – 2014 California State University-East Bay Post-Baccalaureate Certificate 2007  – 2009 California State University-East Bay Post-Baccalaureate Certificate 2007  – 2009 California State University-East Bay Post-Baccalaureate Certificate 2007  – 2009 California State University-East Bay M.S 2002  – 2005 California State University-East Bay M.S 2002  – 2005 California State University-East Bay M.S 2002  – 2005 California Polytechnic State University - College of Business B.S 1997  – 2001 California Polytechnic State University - College of Business B.S 1997  – 2001 California Polytechnic State University - College of Business B.S 1997  – 2001 ", "Experience Associate Principal and Program Manager - Niantic Labs Google January 2013  – Present (2 years 8 months) San Francisco, CA Commerce Operations Manager YouTube July 2010  –  December 2012  (2 years 6 months) Web Strategist Google January 2008  –  July 2010  (2 years 7 months) Program manager Google September 2006  –  December 2007  (1 year 4 months) Product specialist on Froogle and Google Base Google May 2004  –  September 2006  (2 years 5 months) Webmaster HP July 1999  –  September 2002  (3 years 3 months) Associate Principal and Program Manager - Niantic Labs Google January 2013  – Present (2 years 8 months) San Francisco, CA Associate Principal and Program Manager - Niantic Labs Google January 2013  – Present (2 years 8 months) San Francisco, CA Commerce Operations Manager YouTube July 2010  –  December 2012  (2 years 6 months) Commerce Operations Manager YouTube July 2010  –  December 2012  (2 years 6 months) Web Strategist Google January 2008  –  July 2010  (2 years 7 months) Web Strategist Google January 2008  –  July 2010  (2 years 7 months) Program manager Google September 2006  –  December 2007  (1 year 4 months) Program manager Google September 2006  –  December 2007  (1 year 4 months) Product specialist on Froogle and Google Base Google May 2004  –  September 2006  (2 years 5 months) Product specialist on Froogle and Google Base Google May 2004  –  September 2006  (2 years 5 months) Webmaster HP July 1999  –  September 2002  (3 years 3 months) Webmaster HP July 1999  –  September 2002  (3 years 3 months) Languages Chinese Chinese Chinese Skills Project Management Customer Support YouTube E-commerce Google Apps Leadership HTML Management Career Development Training Cross-functional Team... Team Building Strategy Skills  Project Management Customer Support YouTube E-commerce Google Apps Leadership HTML Management Career Development Training Cross-functional Team... Team Building Strategy Project Management Customer Support YouTube E-commerce Google Apps Leadership HTML Management Career Development Training Cross-functional Team... Team Building Strategy Project Management Customer Support YouTube E-commerce Google Apps Leadership HTML Management Career Development Training Cross-functional Team... Team Building Strategy Education University of California, Davis BA 1999  – 2003 University of California, Davis BA 1999  – 2003 University of California, Davis BA 1999  – 2003 University of California, Davis BA 1999  – 2003 Honors & Awards Operating Committee award Google 2011 A top executive-level award for my contribution to the Google TV launch Additional Honors & Awards Multiple departmental Platinum and Gold-level awards Operating Committee award Google 2011 A top executive-level award for my contribution to the Google TV launch Operating Committee award Google 2011 A top executive-level award for my contribution to the Google TV launch Operating Committee award Google 2011 A top executive-level award for my contribution to the Google TV launch Additional Honors & Awards Multiple departmental Platinum and Gold-level awards Additional Honors & Awards Multiple departmental Platinum and Gold-level awards Additional Honors & Awards Multiple departmental Platinum and Gold-level awards ", "Summary Seasoned product manager with proven track record of launching international online platforms in numerous countries, leading strategic initiatives of Kindle, and improving user experience through continuous innovation.  \n \nPast experience includes managing Amazon.com's highly seasonal Shoes inventory, measuring the effectiveness of marketing programs using data analytic, closing one of Asia's biggest M&A transactions, and launching creative promotions for L'Oreal. Specialties:[Verticals]  \n- Digital media (eBook, MP3) \n- Cloud service \n- Online retail business \n- Small and medium businesses \n- Investment Banking (M&A) \n- Fashion (Shoes/Cosmetics) \n \n[Functions] \n- Product management / Roadmap Design  \n- Technical Program management \n- Product marketing \n- Inventory Planning / Supply Chain Management \n- Pricing \n- Negotiation based on data \n- Financial modeling / Quantitative Analysis Summary Seasoned product manager with proven track record of launching international online platforms in numerous countries, leading strategic initiatives of Kindle, and improving user experience through continuous innovation.  \n \nPast experience includes managing Amazon.com's highly seasonal Shoes inventory, measuring the effectiveness of marketing programs using data analytic, closing one of Asia's biggest M&A transactions, and launching creative promotions for L'Oreal. Specialties:[Verticals]  \n- Digital media (eBook, MP3) \n- Cloud service \n- Online retail business \n- Small and medium businesses \n- Investment Banking (M&A) \n- Fashion (Shoes/Cosmetics) \n \n[Functions] \n- Product management / Roadmap Design  \n- Technical Program management \n- Product marketing \n- Inventory Planning / Supply Chain Management \n- Pricing \n- Negotiation based on data \n- Financial modeling / Quantitative Analysis Seasoned product manager with proven track record of launching international online platforms in numerous countries, leading strategic initiatives of Kindle, and improving user experience through continuous innovation.  \n \nPast experience includes managing Amazon.com's highly seasonal Shoes inventory, measuring the effectiveness of marketing programs using data analytic, closing one of Asia's biggest M&A transactions, and launching creative promotions for L'Oreal. Specialties:[Verticals]  \n- Digital media (eBook, MP3) \n- Cloud service \n- Online retail business \n- Small and medium businesses \n- Investment Banking (M&A) \n- Fashion (Shoes/Cosmetics) \n \n[Functions] \n- Product management / Roadmap Design  \n- Technical Program management \n- Product marketing \n- Inventory Planning / Supply Chain Management \n- Pricing \n- Negotiation based on data \n- Financial modeling / Quantitative Analysis Seasoned product manager with proven track record of launching international online platforms in numerous countries, leading strategic initiatives of Kindle, and improving user experience through continuous innovation.  \n \nPast experience includes managing Amazon.com's highly seasonal Shoes inventory, measuring the effectiveness of marketing programs using data analytic, closing one of Asia's biggest M&A transactions, and launching creative promotions for L'Oreal. Specialties:[Verticals]  \n- Digital media (eBook, MP3) \n- Cloud service \n- Online retail business \n- Small and medium businesses \n- Investment Banking (M&A) \n- Fashion (Shoes/Cosmetics) \n \n[Functions] \n- Product management / Roadmap Design  \n- Technical Program management \n- Product marketing \n- Inventory Planning / Supply Chain Management \n- Pricing \n- Negotiation based on data \n- Financial modeling / Quantitative Analysis Experience Associate Principal, Policy Development Google September 2013  – Present (2 years) Mountain View Lead development of Google ads and commerce products' policies. Senior Product Development Manager, Amazon Cloud Player Amazon.com March 2012  –  August 2013  (1 year 6 months) San Francisco Bay Area Sr. Product Manager for Amazon Cloud Player leading connected devices at home, Android platform (Kindle Fire HD), and customer engagement metrics. Senior Product Manager, Kindle Amazon.com February 2011  –  March 2012  (1 year 2 months) - Expanded Kindle Direct Publishing in multiple countries by analyzing each country, prioritizing features, establishing content policy, and leading cross-functional teams. \n- Launched the key strategic program, KDP Select, where we provide benefits for amazon exclusive contents. \n- Created kindle indie bookstore \n- Set global pricing policy for self-published kindle books Senior In-Stock Manager (Sr. Planner) Amazon.com July 2009  –  February 2011  (1 year 8 months) - Innovation: Developed the sales weighted in-stock metric to prioritize bigger customer impact items out of 1.8M choices, resulting in increasing revenue, optimizing expenditure, and improving customer experience.  \n- Leadership/Teamwork: Hired, trained, and supervised a small team to effectively manage backorders, resulting in $9M reduction in unnecessary outstanding orders and releasing warehouse capacity for seasonally relevant items. \n- Strategic Planning/Execution: Received kudos at the annual team meeting for crafting and executing a comprehensive seasonal product management plan by setting a goal, partnering with system teams, and tracking weekly metrics. Effectively managed 22% of inventory and increased turn by 47 bps. \n- Process Improvement: Created automatic real time sales emails that show live inventory and calculate remaining hours of cover for special promotional deals to protect customer experience, saving 40 hours of manual work.  \n- Initiative: Discovered a forecasting error when items are out of stock, partnered with forecasting team to design availability correction logic within forecasting system, and rolled out this logic to the all products in Shoes team. MBA Analytic Intern in the Category Management Department Keystone Automotive Operations May 2008  –  August 2008  (4 months) - Strategic Insights: Evaluated the effectiveness of 49 marketing programs and prioritized the top 13 by developing metrics (target market penetration, sales growth, impressions, etc) through interviews, benchmarking, and data analysis. Presented to CEO, who then agreed to implement metrics monthly. \n- Initiative: Initiated the segmentation of marketing programs through understanding various objectives and target audiences, developing advertising and sales opportunities worth $26M. \n- Customer Insights: Designed and conducted customer survey to identify customer decision funnels and to improve marketing channel effectiveness by focusing on critical customer touch points. \n- Cost Reduction: Developed process to allocate resources that focus on effective marketing programs and growing customers, cutting marketing costs by 30% and increasing EBITDA by 30%. Senior Analyst in the M&A department Korea Development Bank January 2005  –  July 2007  (2 years 7 months) - Managed Due Diligence \n- Negotiated complex terms with investors \n- Conducted valuations \n- Performed the liaison role between buy-side(or sell-side) and a target company Marketing Assistant L'Oreal December 2002  –  February 2003  (3 months) - Evaluated pricing of products \n- Developed creative promotional campaigns \n- Conducted customer surveys to measure brand perception Associate Principal, Policy Development Google September 2013  – Present (2 years) Mountain View Lead development of Google ads and commerce products' policies. Associate Principal, Policy Development Google September 2013  – Present (2 years) Mountain View Lead development of Google ads and commerce products' policies. Senior Product Development Manager, Amazon Cloud Player Amazon.com March 2012  –  August 2013  (1 year 6 months) San Francisco Bay Area Sr. Product Manager for Amazon Cloud Player leading connected devices at home, Android platform (Kindle Fire HD), and customer engagement metrics. Senior Product Development Manager, Amazon Cloud Player Amazon.com March 2012  –  August 2013  (1 year 6 months) San Francisco Bay Area Sr. Product Manager for Amazon Cloud Player leading connected devices at home, Android platform (Kindle Fire HD), and customer engagement metrics. Senior Product Manager, Kindle Amazon.com February 2011  –  March 2012  (1 year 2 months) - Expanded Kindle Direct Publishing in multiple countries by analyzing each country, prioritizing features, establishing content policy, and leading cross-functional teams. \n- Launched the key strategic program, KDP Select, where we provide benefits for amazon exclusive contents. \n- Created kindle indie bookstore \n- Set global pricing policy for self-published kindle books Senior Product Manager, Kindle Amazon.com February 2011  –  March 2012  (1 year 2 months) - Expanded Kindle Direct Publishing in multiple countries by analyzing each country, prioritizing features, establishing content policy, and leading cross-functional teams. \n- Launched the key strategic program, KDP Select, where we provide benefits for amazon exclusive contents. \n- Created kindle indie bookstore \n- Set global pricing policy for self-published kindle books Senior In-Stock Manager (Sr. Planner) Amazon.com July 2009  –  February 2011  (1 year 8 months) - Innovation: Developed the sales weighted in-stock metric to prioritize bigger customer impact items out of 1.8M choices, resulting in increasing revenue, optimizing expenditure, and improving customer experience.  \n- Leadership/Teamwork: Hired, trained, and supervised a small team to effectively manage backorders, resulting in $9M reduction in unnecessary outstanding orders and releasing warehouse capacity for seasonally relevant items. \n- Strategic Planning/Execution: Received kudos at the annual team meeting for crafting and executing a comprehensive seasonal product management plan by setting a goal, partnering with system teams, and tracking weekly metrics. Effectively managed 22% of inventory and increased turn by 47 bps. \n- Process Improvement: Created automatic real time sales emails that show live inventory and calculate remaining hours of cover for special promotional deals to protect customer experience, saving 40 hours of manual work.  \n- Initiative: Discovered a forecasting error when items are out of stock, partnered with forecasting team to design availability correction logic within forecasting system, and rolled out this logic to the all products in Shoes team. Senior In-Stock Manager (Sr. Planner) Amazon.com July 2009  –  February 2011  (1 year 8 months) - Innovation: Developed the sales weighted in-stock metric to prioritize bigger customer impact items out of 1.8M choices, resulting in increasing revenue, optimizing expenditure, and improving customer experience.  \n- Leadership/Teamwork: Hired, trained, and supervised a small team to effectively manage backorders, resulting in $9M reduction in unnecessary outstanding orders and releasing warehouse capacity for seasonally relevant items. \n- Strategic Planning/Execution: Received kudos at the annual team meeting for crafting and executing a comprehensive seasonal product management plan by setting a goal, partnering with system teams, and tracking weekly metrics. Effectively managed 22% of inventory and increased turn by 47 bps. \n- Process Improvement: Created automatic real time sales emails that show live inventory and calculate remaining hours of cover for special promotional deals to protect customer experience, saving 40 hours of manual work.  \n- Initiative: Discovered a forecasting error when items are out of stock, partnered with forecasting team to design availability correction logic within forecasting system, and rolled out this logic to the all products in Shoes team. MBA Analytic Intern in the Category Management Department Keystone Automotive Operations May 2008  –  August 2008  (4 months) - Strategic Insights: Evaluated the effectiveness of 49 marketing programs and prioritized the top 13 by developing metrics (target market penetration, sales growth, impressions, etc) through interviews, benchmarking, and data analysis. Presented to CEO, who then agreed to implement metrics monthly. \n- Initiative: Initiated the segmentation of marketing programs through understanding various objectives and target audiences, developing advertising and sales opportunities worth $26M. \n- Customer Insights: Designed and conducted customer survey to identify customer decision funnels and to improve marketing channel effectiveness by focusing on critical customer touch points. \n- Cost Reduction: Developed process to allocate resources that focus on effective marketing programs and growing customers, cutting marketing costs by 30% and increasing EBITDA by 30%. MBA Analytic Intern in the Category Management Department Keystone Automotive Operations May 2008  –  August 2008  (4 months) - Strategic Insights: Evaluated the effectiveness of 49 marketing programs and prioritized the top 13 by developing metrics (target market penetration, sales growth, impressions, etc) through interviews, benchmarking, and data analysis. Presented to CEO, who then agreed to implement metrics monthly. \n- Initiative: Initiated the segmentation of marketing programs through understanding various objectives and target audiences, developing advertising and sales opportunities worth $26M. \n- Customer Insights: Designed and conducted customer survey to identify customer decision funnels and to improve marketing channel effectiveness by focusing on critical customer touch points. \n- Cost Reduction: Developed process to allocate resources that focus on effective marketing programs and growing customers, cutting marketing costs by 30% and increasing EBITDA by 30%. Senior Analyst in the M&A department Korea Development Bank January 2005  –  July 2007  (2 years 7 months) - Managed Due Diligence \n- Negotiated complex terms with investors \n- Conducted valuations \n- Performed the liaison role between buy-side(or sell-side) and a target company Senior Analyst in the M&A department Korea Development Bank January 2005  –  July 2007  (2 years 7 months) - Managed Due Diligence \n- Negotiated complex terms with investors \n- Conducted valuations \n- Performed the liaison role between buy-side(or sell-side) and a target company Marketing Assistant L'Oreal December 2002  –  February 2003  (3 months) - Evaluated pricing of products \n- Developed creative promotional campaigns \n- Conducted customer surveys to measure brand perception Marketing Assistant L'Oreal December 2002  –  February 2003  (3 months) - Evaluated pricing of products \n- Developed creative promotional campaigns \n- Conducted customer surveys to measure brand perception Skills Launch Of New Products Design product roadmap Develop metrics UX design Market sizing SQL Advanced Excel Program management Working with cross... Working with cross... Product Launch Cross-functional Team... Program Management Metrics Microsoft Excel User Experience Design Market Sizing Product Management Product Development Strategy Competitive Analysis Analytics Finance Product Marketing See 9+     See less Skills  Launch Of New Products Design product roadmap Develop metrics UX design Market sizing SQL Advanced Excel Program management Working with cross... Working with cross... Product Launch Cross-functional Team... Program Management Metrics Microsoft Excel User Experience Design Market Sizing Product Management Product Development Strategy Competitive Analysis Analytics Finance Product Marketing See 9+     See less Launch Of New Products Design product roadmap Develop metrics UX design Market sizing SQL Advanced Excel Program management Working with cross... Working with cross... Product Launch Cross-functional Team... Program Management Metrics Microsoft Excel User Experience Design Market Sizing Product Management Product Development Strategy Competitive Analysis Analytics Finance Product Marketing See 9+     See less Launch Of New Products Design product roadmap Develop metrics UX design Market sizing SQL Advanced Excel Program management Working with cross... Working with cross... Product Launch Cross-functional Team... Program Management Metrics Microsoft Excel User Experience Design Market Sizing Product Management Product Development Strategy Competitive Analysis Analytics Finance Product Marketing See 9+     See less Education Carnegie Mellon University - Tepper School of Business MBA,  Quantitative Analysis , Marketing,  and Operations 2007  – 2009 - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition) \n- Finalist in McKinsey, A.T. Kearney, and Microsoft case competitions, Teaching Assistant for Finance \n- Co-founder of Volleyball and Ski Clubs, Project lead for Pro bono consulting group (Raised $75K for the client) Michigan State University Exchange student,  Business and Economics 2003  – 2004 Activities and Societies:  Ski Club ,  Habitat for Humanity Carnegie Mellon University - Tepper School of Business MBA,  Quantitative Analysis , Marketing,  and Operations 2007  – 2009 - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition) \n- Finalist in McKinsey, A.T. Kearney, and Microsoft case competitions, Teaching Assistant for Finance \n- Co-founder of Volleyball and Ski Clubs, Project lead for Pro bono consulting group (Raised $75K for the client) Carnegie Mellon University - Tepper School of Business MBA,  Quantitative Analysis , Marketing,  and Operations 2007  – 2009 - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition) \n- Finalist in McKinsey, A.T. Kearney, and Microsoft case competitions, Teaching Assistant for Finance \n- Co-founder of Volleyball and Ski Clubs, Project lead for Pro bono consulting group (Raised $75K for the client) Carnegie Mellon University - Tepper School of Business MBA,  Quantitative Analysis , Marketing,  and Operations 2007  – 2009 - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition) \n- Finalist in McKinsey, A.T. Kearney, and Microsoft case competitions, Teaching Assistant for Finance \n- Co-founder of Volleyball and Ski Clubs, Project lead for Pro bono consulting group (Raised $75K for the client) Michigan State University Exchange student,  Business and Economics 2003  – 2004 Activities and Societies:  Ski Club ,  Habitat for Humanity Michigan State University Exchange student,  Business and Economics 2003  – 2004 Activities and Societies:  Ski Club ,  Habitat for Humanity Michigan State University Exchange student,  Business and Economics 2003  – 2004 Activities and Societies:  Ski Club ,  Habitat for Humanity Honors & Awards Additional Honors & Awards - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition at CMU) \n- Summa Cum Laude (Top 1% out of 700 students) at Yonsei University Additional Honors & Awards - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition at CMU) \n- Summa Cum Laude (Top 1% out of 700 students) at Yonsei University Additional Honors & Awards - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition at CMU) \n- Summa Cum Laude (Top 1% out of 700 students) at Yonsei University Additional Honors & Awards - Randy Pausch Memorial Scholarship Award - representing integrity, determination, and passion (Full Tuition at CMU) \n- Summa Cum Laude (Top 1% out of 700 students) at Yonsei University ", "Experience Operations, Home Services Google August 2015  – Present (1 month) San Francisco Bay Area General Manager San Francisco Homejoy April 2015  –  August 2015  (5 months) San Francisco Bay Area Associate Principal, Strategy and Planning Google 2013  –  2015  (2 years) San Francisco Bay Area I worked in the Strategy and Planning team, supporting Product Quality Operations across Google. In this position, I led various large scale projects, involving operations, engineering and management, that positively impacted quality operations for 20+ Google products. I also successfully managed a business intelligence process, serving as a liaison between operational teams and executives. Business Strategy MBA Intern Google 2012  –  2012  (less than a year) San Francisco Bay Area During the summer of 2012, I successfully led a project to evaluate the global publisher policy team's strategy, organization, operations, and financial impact. This resulted in a crowd-sourcing method that increased quality reviews consistency for the AdSense network, and a new set of metrics for a holistic view of the team's effectiveness at protecting AdWords and AdSense customers. It also led to the implementation of an organization-related proposal that was replicated to other teams. Founder and CEO Aytech Corporation 1997  –  2010  (13 years) Caracas, Venezuela I founded a computer parts wholesale-distribution company in Venezuela. Within a year, I turned it into a recognized nationwide distributor, with offices in Caracas and Miami. I successfully led the organization while facing highly adverse regulation, particularly the Venezuelan currency exchange control, and established strategic international logistical processes to suit increasing Venezuelan restrictions. I also developed private label brands and managed product development, contract manufacturing, pricing strategy, distribution and partnerships. Professor Universidad Catolica Andres Bello / Universidad Monteavila 2005  –  2009  (4 years) Caracas, Venezuela I was hired as a Professor at two prestigious Venezuelan universities, where I taught over 500 students. Courses included: Corporate Finance, Economics, and Financial Analysis. Intern / Strategic Purchases Manager Procter & Gamble 2003  –  2004  (1 year) Caracas, Venezuela I held various roles, including manager of a large global team to design and implement a comprehensive Business Continuity Plan process for all the Beauty Care manufacturing and distribution operations worldwide. I also developed an automated tool for input cost forecasting that became the standard at P&G Latin America. Operations, Home Services Google August 2015  – Present (1 month) San Francisco Bay Area Operations, Home Services Google August 2015  – Present (1 month) San Francisco Bay Area General Manager San Francisco Homejoy April 2015  –  August 2015  (5 months) San Francisco Bay Area General Manager San Francisco Homejoy April 2015  –  August 2015  (5 months) San Francisco Bay Area Associate Principal, Strategy and Planning Google 2013  –  2015  (2 years) San Francisco Bay Area I worked in the Strategy and Planning team, supporting Product Quality Operations across Google. In this position, I led various large scale projects, involving operations, engineering and management, that positively impacted quality operations for 20+ Google products. I also successfully managed a business intelligence process, serving as a liaison between operational teams and executives. Associate Principal, Strategy and Planning Google 2013  –  2015  (2 years) San Francisco Bay Area I worked in the Strategy and Planning team, supporting Product Quality Operations across Google. In this position, I led various large scale projects, involving operations, engineering and management, that positively impacted quality operations for 20+ Google products. I also successfully managed a business intelligence process, serving as a liaison between operational teams and executives. Business Strategy MBA Intern Google 2012  –  2012  (less than a year) San Francisco Bay Area During the summer of 2012, I successfully led a project to evaluate the global publisher policy team's strategy, organization, operations, and financial impact. This resulted in a crowd-sourcing method that increased quality reviews consistency for the AdSense network, and a new set of metrics for a holistic view of the team's effectiveness at protecting AdWords and AdSense customers. It also led to the implementation of an organization-related proposal that was replicated to other teams. Business Strategy MBA Intern Google 2012  –  2012  (less than a year) San Francisco Bay Area During the summer of 2012, I successfully led a project to evaluate the global publisher policy team's strategy, organization, operations, and financial impact. This resulted in a crowd-sourcing method that increased quality reviews consistency for the AdSense network, and a new set of metrics for a holistic view of the team's effectiveness at protecting AdWords and AdSense customers. It also led to the implementation of an organization-related proposal that was replicated to other teams. Founder and CEO Aytech Corporation 1997  –  2010  (13 years) Caracas, Venezuela I founded a computer parts wholesale-distribution company in Venezuela. Within a year, I turned it into a recognized nationwide distributor, with offices in Caracas and Miami. I successfully led the organization while facing highly adverse regulation, particularly the Venezuelan currency exchange control, and established strategic international logistical processes to suit increasing Venezuelan restrictions. I also developed private label brands and managed product development, contract manufacturing, pricing strategy, distribution and partnerships. Founder and CEO Aytech Corporation 1997  –  2010  (13 years) Caracas, Venezuela I founded a computer parts wholesale-distribution company in Venezuela. Within a year, I turned it into a recognized nationwide distributor, with offices in Caracas and Miami. I successfully led the organization while facing highly adverse regulation, particularly the Venezuelan currency exchange control, and established strategic international logistical processes to suit increasing Venezuelan restrictions. I also developed private label brands and managed product development, contract manufacturing, pricing strategy, distribution and partnerships. Professor Universidad Catolica Andres Bello / Universidad Monteavila 2005  –  2009  (4 years) Caracas, Venezuela I was hired as a Professor at two prestigious Venezuelan universities, where I taught over 500 students. Courses included: Corporate Finance, Economics, and Financial Analysis. Professor Universidad Catolica Andres Bello / Universidad Monteavila 2005  –  2009  (4 years) Caracas, Venezuela I was hired as a Professor at two prestigious Venezuelan universities, where I taught over 500 students. Courses included: Corporate Finance, Economics, and Financial Analysis. Intern / Strategic Purchases Manager Procter & Gamble 2003  –  2004  (1 year) Caracas, Venezuela I held various roles, including manager of a large global team to design and implement a comprehensive Business Continuity Plan process for all the Beauty Care manufacturing and distribution operations worldwide. I also developed an automated tool for input cost forecasting that became the standard at P&G Latin America. Intern / Strategic Purchases Manager Procter & Gamble 2003  –  2004  (1 year) Caracas, Venezuela I held various roles, including manager of a large global team to design and implement a comprehensive Business Continuity Plan process for all the Beauty Care manufacturing and distribution operations worldwide. I also developed an automated tool for input cost forecasting that became the standard at P&G Latin America. Languages English Full professional proficiency Spanish Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Entrepreneurship Business Strategy General Management Operations Management Management Consulting Business Development Product Management Project Management Economics Statistics Financial Modeling Marketing Strategy Data Analysis Business Intelligence Sales Pricing Strategy Analytics See 2+     See less Skills  Entrepreneurship Business Strategy General Management Operations Management Management Consulting Business Development Product Management Project Management Economics Statistics Financial Modeling Marketing Strategy Data Analysis Business Intelligence Sales Pricing Strategy Analytics See 2+     See less Entrepreneurship Business Strategy General Management Operations Management Management Consulting Business Development Product Management Project Management Economics Statistics Financial Modeling Marketing Strategy Data Analysis Business Intelligence Sales Pricing Strategy Analytics See 2+     See less Entrepreneurship Business Strategy General Management Operations Management Management Consulting Business Development Product Management Project Management Economics Statistics Financial Modeling Marketing Strategy Data Analysis Business Intelligence Sales Pricing Strategy Analytics See 2+     See less Education Harvard University Master in Public Administration,  Business and Government 2011  – 2013 Activities and Societies:  Business and Government Club Massachusetts Institute of Technology Master in Business Administration,  General Management 2010  – 2013 Activities and Societies:  Latin America Business Club Co-President ,  MIT Sloan Student Senate ,  Global Entrepreneurship Lab Universidad Catolica Andres Bello BA,  Economics / Business Administration 1996  – 2004 Activities and Societies:  \"Catedra de Honor\" member ,  National Economics Students Council Director Harvard University Master in Public Administration,  Business and Government 2011  – 2013 Activities and Societies:  Business and Government Club Harvard University Master in Public Administration,  Business and Government 2011  – 2013 Activities and Societies:  Business and Government Club Harvard University Master in Public Administration,  Business and Government 2011  – 2013 Activities and Societies:  Business and Government Club Massachusetts Institute of Technology Master in Business Administration,  General Management 2010  – 2013 Activities and Societies:  Latin America Business Club Co-President ,  MIT Sloan Student Senate ,  Global Entrepreneurship Lab Massachusetts Institute of Technology Master in Business Administration,  General Management 2010  – 2013 Activities and Societies:  Latin America Business Club Co-President ,  MIT Sloan Student Senate ,  Global Entrepreneurship Lab Massachusetts Institute of Technology Master in Business Administration,  General Management 2010  – 2013 Activities and Societies:  Latin America Business Club Co-President ,  MIT Sloan Student Senate ,  Global Entrepreneurship Lab Universidad Catolica Andres Bello BA,  Economics / Business Administration 1996  – 2004 Activities and Societies:  \"Catedra de Honor\" member ,  National Economics Students Council Director Universidad Catolica Andres Bello BA,  Economics / Business Administration 1996  – 2004 Activities and Societies:  \"Catedra de Honor\" member ,  National Economics Students Council Director Universidad Catolica Andres Bello BA,  Economics / Business Administration 1996  – 2004 Activities and Societies:  \"Catedra de Honor\" member ,  National Economics Students Council Director Honors & Awards ", "Summary Regina is a Program Manager, social good enthusiast, and approaches opportunity by creating shared value. She’s worked in the US and abroad across commerce, sales and corporate engineering at Google since 2002. She's led efforts for AdWords, Benefits, Corporate Engineering, DoubleClick, Learning, People Development and Wallet. To acknowledge the perspective and opportunity culture brings to work, she co-founded the Filipino Googler Network (FGN) in 2011. She is Chair of the employee resource group and recently enabled Googlers from around the globe to partner with non-governmental organizations (NGOs) in-region post Typhoon Haiyan. Outside of work she enjoys experiencing the world through the eyes of her young girls, supporting early stage tech and volunteering with groups focused on female empowerment. She is a board member of the Apl.de.Ap Foundation and Philippine International Aid.  \n Summary Regina is a Program Manager, social good enthusiast, and approaches opportunity by creating shared value. She’s worked in the US and abroad across commerce, sales and corporate engineering at Google since 2002. She's led efforts for AdWords, Benefits, Corporate Engineering, DoubleClick, Learning, People Development and Wallet. To acknowledge the perspective and opportunity culture brings to work, she co-founded the Filipino Googler Network (FGN) in 2011. She is Chair of the employee resource group and recently enabled Googlers from around the globe to partner with non-governmental organizations (NGOs) in-region post Typhoon Haiyan. Outside of work she enjoys experiencing the world through the eyes of her young girls, supporting early stage tech and volunteering with groups focused on female empowerment. She is a board member of the Apl.de.Ap Foundation and Philippine International Aid.  \n Regina is a Program Manager, social good enthusiast, and approaches opportunity by creating shared value. She’s worked in the US and abroad across commerce, sales and corporate engineering at Google since 2002. She's led efforts for AdWords, Benefits, Corporate Engineering, DoubleClick, Learning, People Development and Wallet. To acknowledge the perspective and opportunity culture brings to work, she co-founded the Filipino Googler Network (FGN) in 2011. She is Chair of the employee resource group and recently enabled Googlers from around the globe to partner with non-governmental organizations (NGOs) in-region post Typhoon Haiyan. Outside of work she enjoys experiencing the world through the eyes of her young girls, supporting early stage tech and volunteering with groups focused on female empowerment. She is a board member of the Apl.de.Ap Foundation and Philippine International Aid.  \n Regina is a Program Manager, social good enthusiast, and approaches opportunity by creating shared value. She’s worked in the US and abroad across commerce, sales and corporate engineering at Google since 2002. She's led efforts for AdWords, Benefits, Corporate Engineering, DoubleClick, Learning, People Development and Wallet. To acknowledge the perspective and opportunity culture brings to work, she co-founded the Filipino Googler Network (FGN) in 2011. She is Chair of the employee resource group and recently enabled Googlers from around the globe to partner with non-governmental organizations (NGOs) in-region post Typhoon Haiyan. Outside of work she enjoys experiencing the world through the eyes of her young girls, supporting early stage tech and volunteering with groups focused on female empowerment. She is a board member of the Apl.de.Ap Foundation and Philippine International Aid.  \n Experience Engineering Program Manager Google December 2012  – Present (2 years 9 months) Sr. Program Manager, DoubleClick Google March 2009  – Present (6 years 6 months) Associate Principal, Checkout Google July 2007  –  March 2009  (1 year 9 months) Senior Strategist, Checkout Google May 2006  –  July 2007  (1 year 3 months) Senior Account Manager Google March 2005  –  April 2006  (1 year 2 months) Associate, AdWords Google August 2003  –  July 2004  (1 year) Coordinator, Adwords Google April 2002  –  August 2003  (1 year 5 months) Engineering Program Manager Google December 2012  – Present (2 years 9 months) Engineering Program Manager Google December 2012  – Present (2 years 9 months) Sr. Program Manager, DoubleClick Google March 2009  – Present (6 years 6 months) Sr. Program Manager, DoubleClick Google March 2009  – Present (6 years 6 months) Associate Principal, Checkout Google July 2007  –  March 2009  (1 year 9 months) Associate Principal, Checkout Google July 2007  –  March 2009  (1 year 9 months) Senior Strategist, Checkout Google May 2006  –  July 2007  (1 year 3 months) Senior Strategist, Checkout Google May 2006  –  July 2007  (1 year 3 months) Senior Account Manager Google March 2005  –  April 2006  (1 year 2 months) Senior Account Manager Google March 2005  –  April 2006  (1 year 2 months) Associate, AdWords Google August 2003  –  July 2004  (1 year) Associate, AdWords Google August 2003  –  July 2004  (1 year) Coordinator, Adwords Google April 2002  –  August 2003  (1 year 5 months) Coordinator, Adwords Google April 2002  –  August 2003  (1 year 5 months) Languages English Tagalog English Tagalog English Tagalog Skills Product Management Google Adwords Analytics Online Advertising Program Management DoubleClick SEM Start-ups Web Analytics E-commerce Strategy Skills  Product Management Google Adwords Analytics Online Advertising Program Management DoubleClick SEM Start-ups Web Analytics E-commerce Strategy Product Management Google Adwords Analytics Online Advertising Program Management DoubleClick SEM Start-ups Web Analytics E-commerce Strategy Product Management Google Adwords Analytics Online Advertising Program Management DoubleClick SEM Start-ups Web Analytics E-commerce Strategy Education Chatham University 1992  – 1996 Chatham College Chatham University 1992  – 1996 Chatham University 1992  – 1996 Chatham University 1992  – 1996 Chatham College Chatham College Chatham College ", "Experience Industry Director, Retail Google February 2013  – Present (2 years 7 months) Mountain View, CA Director, Global Sales Operations Google October 2011  –  January 2013  (1 year 4 months) Director, Sales Operations, Northern and Central Europe Google October 2009  –  October 2011  (2 years 1 month) Director, Strategic Partnerships Google January 2007  –  October 2009  (2 years 10 months) SVP, Strategic Planning & Marketing Thomson Learning June 2005  –  January 2007  (1 year 8 months) Associate Principal McKinsey & Company July 1996  –  May 2005  (8 years 11 months) Intern Lumeria 1999  –  1999  (less than a year) Intern Arthur Andersen 1995  –  1995  (less than a year) Industry Director, Retail Google February 2013  – Present (2 years 7 months) Mountain View, CA Industry Director, Retail Google February 2013  – Present (2 years 7 months) Mountain View, CA Director, Global Sales Operations Google October 2011  –  January 2013  (1 year 4 months) Director, Global Sales Operations Google October 2011  –  January 2013  (1 year 4 months) Director, Sales Operations, Northern and Central Europe Google October 2009  –  October 2011  (2 years 1 month) Director, Sales Operations, Northern and Central Europe Google October 2009  –  October 2011  (2 years 1 month) Director, Strategic Partnerships Google January 2007  –  October 2009  (2 years 10 months) Director, Strategic Partnerships Google January 2007  –  October 2009  (2 years 10 months) SVP, Strategic Planning & Marketing Thomson Learning June 2005  –  January 2007  (1 year 8 months) SVP, Strategic Planning & Marketing Thomson Learning June 2005  –  January 2007  (1 year 8 months) Associate Principal McKinsey & Company July 1996  –  May 2005  (8 years 11 months) Associate Principal McKinsey & Company July 1996  –  May 2005  (8 years 11 months) Intern Lumeria 1999  –  1999  (less than a year) Intern Lumeria 1999  –  1999  (less than a year) Intern Arthur Andersen 1995  –  1995  (less than a year) Intern Arthur Andersen 1995  –  1995  (less than a year) Skills Sales Operations Strategic Partnerships Management Marketing E-commerce Strategic Planning Sales Online Advertising Analytics Business Strategy Strategy Product Management Start-ups Digital Strategy Skills  Sales Operations Strategic Partnerships Management Marketing E-commerce Strategic Planning Sales Online Advertising Analytics Business Strategy Strategy Product Management Start-ups Digital Strategy Sales Operations Strategic Partnerships Management Marketing E-commerce Strategic Planning Sales Online Advertising Analytics Business Strategy Strategy Product Management Start-ups Digital Strategy Sales Operations Strategic Partnerships Management Marketing E-commerce Strategic Planning Sales Online Advertising Analytics Business Strategy Strategy Product Management Start-ups Digital Strategy Education Columbia University - Columbia Business School MBA 1998  – 2000 University of Saarbruecken Diplom-Kaufmann,  Business October 1991  – October 1995 Columbia University - Columbia Business School MBA 1998  – 2000 Columbia University - Columbia Business School MBA 1998  – 2000 Columbia University - Columbia Business School MBA 1998  – 2000 University of Saarbruecken Diplom-Kaufmann,  Business October 1991  – October 1995 University of Saarbruecken Diplom-Kaufmann,  Business October 1991  – October 1995 University of Saarbruecken Diplom-Kaufmann,  Business October 1991  – October 1995 ", "Skills Scrum Demand Generation Software Project... Skills  Scrum Demand Generation Software Project... Scrum Demand Generation Software Project... Scrum Demand Generation Software Project... ", "Summary Specialties:Transformation in High Tech, Telecoms and Media companies, organisation design, business building and strategy Summary Specialties:Transformation in High Tech, Telecoms and Media companies, organisation design, business building and strategy Specialties:Transformation in High Tech, Telecoms and Media companies, organisation design, business building and strategy Specialties:Transformation in High Tech, Telecoms and Media companies, organisation design, business building and strategy Experience Managing Director, Global Customer Experience, Google Google January 2015  – Present (8 months) Senior Director, Head of Advertiser Services EMEA Google March 2013  – Present (2 years 6 months) Dublin Director, Global Ad Operations Google February 2010  –  March 2013  (3 years 2 months) Associate Principal McKinsey & Company November 2002  –  February 2010  (7 years 4 months) Owner Independent Business Consultant June 1997  –  August 2000  (3 years 3 months) Senior Manager Ernst & Young July 1994  –  June 1997  (3 years) Senior McDwyer, Lennon and Company June 1987  –  June 1994  (7 years 1 month) Managing Director, Global Customer Experience, Google Google January 2015  – Present (8 months) Managing Director, Global Customer Experience, Google Google January 2015  – Present (8 months) Senior Director, Head of Advertiser Services EMEA Google March 2013  – Present (2 years 6 months) Dublin Senior Director, Head of Advertiser Services EMEA Google March 2013  – Present (2 years 6 months) Dublin Director, Global Ad Operations Google February 2010  –  March 2013  (3 years 2 months) Director, Global Ad Operations Google February 2010  –  March 2013  (3 years 2 months) Associate Principal McKinsey & Company November 2002  –  February 2010  (7 years 4 months) Associate Principal McKinsey & Company November 2002  –  February 2010  (7 years 4 months) Owner Independent Business Consultant June 1997  –  August 2000  (3 years 3 months) Owner Independent Business Consultant June 1997  –  August 2000  (3 years 3 months) Senior Manager Ernst & Young July 1994  –  June 1997  (3 years) Senior Manager Ernst & Young July 1994  –  June 1997  (3 years) Senior McDwyer, Lennon and Company June 1987  –  June 1994  (7 years 1 month) Senior McDwyer, Lennon and Company June 1987  –  June 1994  (7 years 1 month) Skills Strategy Business Strategy Organizational Design Business Transformation Advertising Start-ups Business Development Entrepreneurship Telecommunications Management Consulting Analytics Cross-functional Team... Leadership Development People Development Leadership Management See 1+     See less Skills  Strategy Business Strategy Organizational Design Business Transformation Advertising Start-ups Business Development Entrepreneurship Telecommunications Management Consulting Analytics Cross-functional Team... Leadership Development People Development Leadership Management See 1+     See less Strategy Business Strategy Organizational Design Business Transformation Advertising Start-ups Business Development Entrepreneurship Telecommunications Management Consulting Analytics Cross-functional Team... Leadership Development People Development Leadership Management See 1+     See less Strategy Business Strategy Organizational Design Business Transformation Advertising Start-ups Business Development Entrepreneurship Telecommunications Management Consulting Analytics Cross-functional Team... Leadership Development People Development Leadership Management See 1+     See less Education Ivey Business School at Western University MBA,  Management 2000  – 2002 Institute Chartered Accountants in Ireland ACA,  Chartered Accountancy 1987  – 1994 Ivey Business School at Western University MBA,  Management 2000  – 2002 Ivey Business School at Western University MBA,  Management 2000  – 2002 Ivey Business School at Western University MBA,  Management 2000  – 2002 Institute Chartered Accountants in Ireland ACA,  Chartered Accountancy 1987  – 1994 Institute Chartered Accountants in Ireland ACA,  Chartered Accountancy 1987  – 1994 Institute Chartered Accountants in Ireland ACA,  Chartered Accountancy 1987  – 1994 ", "Summary Global high tech executive with sales, strategy, business development and product marketing experience. Able to envision an aspiring goal, plan for it, and execute to reach it. Demonstrated ability to turn a challenging, complex business around, and continuously improve it Summary Global high tech executive with sales, strategy, business development and product marketing experience. Able to envision an aspiring goal, plan for it, and execute to reach it. Demonstrated ability to turn a challenging, complex business around, and continuously improve it Global high tech executive with sales, strategy, business development and product marketing experience. Able to envision an aspiring goal, plan for it, and execute to reach it. Demonstrated ability to turn a challenging, complex business around, and continuously improve it Global high tech executive with sales, strategy, business development and product marketing experience. Able to envision an aspiring goal, plan for it, and execute to reach it. Demonstrated ability to turn a challenging, complex business around, and continuously improve it Experience Director Global Education Sales Google January 2012  – Present (3 years 8 months) San Francisco Bay Area Head of Global Media Sales Development and Operations Google May 2009  –  January 2012  (2 years 9 months) Head of AdSense Online, Asia-Pacific and LatAm Google July 2007  –  May 2009  (1 year 11 months) Sr. Dir. Product Marketing Motorola August 2005  –  June 2007  (1 year 11 months) Responsible for managing relationship and engagements across Motorola with external partners, with the aim to bring compelling, rich end user experiences to Motorola mobile devices globally \nResponsible for portfolio planning and product/experience definition of Motorola's mass market products (~100 mln units p.a. globally), and for the core communication experience (voice call, contact management, messaging, user interface) across all products (~250 mln units p.a. globally) Dir. of Business Operations and Pricing Motorola December 2003  –  July 2005  (1 year 8 months) Sales operations for Motorola's handset business in Southeast Asia, Australia and New Zealand Associate Principal McKinsey & Company October 1996  –  November 2003  (7 years 2 months) Director Global Education Sales Google January 2012  – Present (3 years 8 months) San Francisco Bay Area Director Global Education Sales Google January 2012  – Present (3 years 8 months) San Francisco Bay Area Head of Global Media Sales Development and Operations Google May 2009  –  January 2012  (2 years 9 months) Head of Global Media Sales Development and Operations Google May 2009  –  January 2012  (2 years 9 months) Head of AdSense Online, Asia-Pacific and LatAm Google July 2007  –  May 2009  (1 year 11 months) Head of AdSense Online, Asia-Pacific and LatAm Google July 2007  –  May 2009  (1 year 11 months) Sr. Dir. Product Marketing Motorola August 2005  –  June 2007  (1 year 11 months) Responsible for managing relationship and engagements across Motorola with external partners, with the aim to bring compelling, rich end user experiences to Motorola mobile devices globally \nResponsible for portfolio planning and product/experience definition of Motorola's mass market products (~100 mln units p.a. globally), and for the core communication experience (voice call, contact management, messaging, user interface) across all products (~250 mln units p.a. globally) Sr. Dir. Product Marketing Motorola August 2005  –  June 2007  (1 year 11 months) Responsible for managing relationship and engagements across Motorola with external partners, with the aim to bring compelling, rich end user experiences to Motorola mobile devices globally \nResponsible for portfolio planning and product/experience definition of Motorola's mass market products (~100 mln units p.a. globally), and for the core communication experience (voice call, contact management, messaging, user interface) across all products (~250 mln units p.a. globally) Dir. of Business Operations and Pricing Motorola December 2003  –  July 2005  (1 year 8 months) Sales operations for Motorola's handset business in Southeast Asia, Australia and New Zealand Dir. of Business Operations and Pricing Motorola December 2003  –  July 2005  (1 year 8 months) Sales operations for Motorola's handset business in Southeast Asia, Australia and New Zealand Associate Principal McKinsey & Company October 1996  –  November 2003  (7 years 2 months) Associate Principal McKinsey & Company October 1996  –  November 2003  (7 years 2 months) Skills Product Marketing Management Go-to-market Strategy Mobile Devices Strategy Business Development Marketing Strategy Product Management Strategic Partnerships Sales Skills  Product Marketing Management Go-to-market Strategy Mobile Devices Strategy Business Development Marketing Strategy Product Management Strategic Partnerships Sales Product Marketing Management Go-to-market Strategy Mobile Devices Strategy Business Development Marketing Strategy Product Management Strategic Partnerships Sales Product Marketing Management Go-to-market Strategy Mobile Devices Strategy Business Development Marketing Strategy Product Management Strategic Partnerships Sales ", "Experience Product Marketing Manager, AdWords Google June 2015  – Present (3 months) Associate Principal, Consumer Operations Google November 2013  –  June 2015  (1 year 8 months) Mountain View, California Consultant Strategic Decisions Group (SDG) September 2012  –  November 2013  (1 year 3 months) San Francisco Bay Area - Over 4 year of strategy consulting experience with a focus on Decision Quality & Decision Analytics \n- Worked extensively with Life Science clients across US, Europe, and Asia, on projects ranging from growth strategy to new product launch, and market entry MBA, Class of 2012 Kellogg School of Management August 2010  –  June 2012  (1 year 11 months) Majored in Finance, Strategy, Marketing, and Social Enterprise Summer Consultant The Boston Consulting Group June 2011  –  August 2011  (3 months) Singapore - Worked with industrial goods and shipping clients \n- Received offer to return as a full time employee at the end of the internship Consultant Strategic Decisions Group August 2007  –  April 2010  (2 years 9 months) Analyst Bain & Company 2007  –  2007  (less than a year) Summer Intern KPMG Advisory May 2006  –  July 2006  (3 months) Summer Intern German Research Center for Biotechnology May 2005  –  July 2005  (3 months) Product Marketing Manager, AdWords Google June 2015  – Present (3 months) Product Marketing Manager, AdWords Google June 2015  – Present (3 months) Associate Principal, Consumer Operations Google November 2013  –  June 2015  (1 year 8 months) Mountain View, California Associate Principal, Consumer Operations Google November 2013  –  June 2015  (1 year 8 months) Mountain View, California Consultant Strategic Decisions Group (SDG) September 2012  –  November 2013  (1 year 3 months) San Francisco Bay Area - Over 4 year of strategy consulting experience with a focus on Decision Quality & Decision Analytics \n- Worked extensively with Life Science clients across US, Europe, and Asia, on projects ranging from growth strategy to new product launch, and market entry Consultant Strategic Decisions Group (SDG) September 2012  –  November 2013  (1 year 3 months) San Francisco Bay Area - Over 4 year of strategy consulting experience with a focus on Decision Quality & Decision Analytics \n- Worked extensively with Life Science clients across US, Europe, and Asia, on projects ranging from growth strategy to new product launch, and market entry MBA, Class of 2012 Kellogg School of Management August 2010  –  June 2012  (1 year 11 months) Majored in Finance, Strategy, Marketing, and Social Enterprise MBA, Class of 2012 Kellogg School of Management August 2010  –  June 2012  (1 year 11 months) Majored in Finance, Strategy, Marketing, and Social Enterprise Summer Consultant The Boston Consulting Group June 2011  –  August 2011  (3 months) Singapore - Worked with industrial goods and shipping clients \n- Received offer to return as a full time employee at the end of the internship Summer Consultant The Boston Consulting Group June 2011  –  August 2011  (3 months) Singapore - Worked with industrial goods and shipping clients \n- Received offer to return as a full time employee at the end of the internship Consultant Strategic Decisions Group August 2007  –  April 2010  (2 years 9 months) Consultant Strategic Decisions Group August 2007  –  April 2010  (2 years 9 months) Analyst Bain & Company 2007  –  2007  (less than a year) Analyst Bain & Company 2007  –  2007  (less than a year) Summer Intern KPMG Advisory May 2006  –  July 2006  (3 months) Summer Intern KPMG Advisory May 2006  –  July 2006  (3 months) Summer Intern German Research Center for Biotechnology May 2005  –  July 2005  (3 months) Summer Intern German Research Center for Biotechnology May 2005  –  July 2005  (3 months) Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Market Entry Strategy Management Consulting Growth Strategies Financial Modeling Business Strategy Strategic Consulting Analytics Competitive Analysis Corporate Development Due Diligence Valuation Skills  Market Entry Strategy Management Consulting Growth Strategies Financial Modeling Business Strategy Strategic Consulting Analytics Competitive Analysis Corporate Development Due Diligence Valuation Market Entry Strategy Management Consulting Growth Strategies Financial Modeling Business Strategy Strategic Consulting Analytics Competitive Analysis Corporate Development Due Diligence Valuation Market Entry Strategy Management Consulting Growth Strategies Financial Modeling Business Strategy Strategic Consulting Analytics Competitive Analysis Corporate Development Due Diligence Valuation Education Northwestern University - Kellogg School of Management MBA,  Finance , Strategy, Marketing,  Social Enterprise 2010  – 2012 Indian Institute of Technology, Delhi Dual Degree (BTech & MTech),  Biochemical Engineering & Biotechnology 2002  – 2007 Delhi Public School - R. K. Puram 2000  – 2002 Northwestern University - Kellogg School of Management MBA,  Finance , Strategy, Marketing,  Social Enterprise 2010  – 2012 Northwestern University - Kellogg School of Management MBA,  Finance , Strategy, Marketing,  Social Enterprise 2010  – 2012 Northwestern University - Kellogg School of Management MBA,  Finance , Strategy, Marketing,  Social Enterprise 2010  – 2012 Indian Institute of Technology, Delhi Dual Degree (BTech & MTech),  Biochemical Engineering & Biotechnology 2002  – 2007 Indian Institute of Technology, Delhi Dual Degree (BTech & MTech),  Biochemical Engineering & Biotechnology 2002  – 2007 Indian Institute of Technology, Delhi Dual Degree (BTech & MTech),  Biochemical Engineering & Biotechnology 2002  – 2007 Delhi Public School - R. K. Puram 2000  – 2002 Delhi Public School - R. K. Puram 2000  – 2002 Delhi Public School - R. K. Puram 2000  – 2002 "]}