{"position": "Associate Support Engineer", "company": "Google", "profiles": ["Summary Mark Rivera has a PhD from the Kellogg School of Management. His research draws from sociology, social-psychology, and statistical physics to understand how people form social networks and how these connections affect creativity, achievement, and job-satisfaction for people and for organizations. \n \nMark has taught classes on Management, Social Networks, & Negotiations at the Kellogg School of Management and has lectured and consulted on the use of Social Network Data at Zynga, Google, a fortune 500 consumer goods manufacturer, IDEO and the Stanford Graduate School of Business. Specialties:Data analysis, Social Network Theory and Methodologies, Survey Design and Implementation, Electronic Data Processing, Complex Systems Theory. Summary Mark Rivera has a PhD from the Kellogg School of Management. His research draws from sociology, social-psychology, and statistical physics to understand how people form social networks and how these connections affect creativity, achievement, and job-satisfaction for people and for organizations. \n \nMark has taught classes on Management, Social Networks, & Negotiations at the Kellogg School of Management and has lectured and consulted on the use of Social Network Data at Zynga, Google, a fortune 500 consumer goods manufacturer, IDEO and the Stanford Graduate School of Business. Specialties:Data analysis, Social Network Theory and Methodologies, Survey Design and Implementation, Electronic Data Processing, Complex Systems Theory. Mark Rivera has a PhD from the Kellogg School of Management. His research draws from sociology, social-psychology, and statistical physics to understand how people form social networks and how these connections affect creativity, achievement, and job-satisfaction for people and for organizations. \n \nMark has taught classes on Management, Social Networks, & Negotiations at the Kellogg School of Management and has lectured and consulted on the use of Social Network Data at Zynga, Google, a fortune 500 consumer goods manufacturer, IDEO and the Stanford Graduate School of Business. Specialties:Data analysis, Social Network Theory and Methodologies, Survey Design and Implementation, Electronic Data Processing, Complex Systems Theory. Mark Rivera has a PhD from the Kellogg School of Management. His research draws from sociology, social-psychology, and statistical physics to understand how people form social networks and how these connections affect creativity, achievement, and job-satisfaction for people and for organizations. \n \nMark has taught classes on Management, Social Networks, & Negotiations at the Kellogg School of Management and has lectured and consulted on the use of Social Network Data at Zynga, Google, a fortune 500 consumer goods manufacturer, IDEO and the Stanford Graduate School of Business. Specialties:Data analysis, Social Network Theory and Methodologies, Survey Design and Implementation, Electronic Data Processing, Complex Systems Theory. Experience People Analyst & Data Scientist Google January 2010  – Present (5 years 8 months) Decision Support Engineering Analyst Google June 2010  –  September 2010  (4 months) Conducted extensive statistical analyses on a large social network composed of millions of independent social interactions. Analyses were targeted at understanding how people’s position in social networks affects their behavior and how certain behaviors are contagious through social connections. Co-Founder ZotStock.com 2008  –  2009  (1 year) In 2006 I raised capital from several investors and formed ZotStock.com – a startup designed to provide an online-forum for recreational investors to submit stock picks and opinions. As the founder of the company I collaborated intensely with website designers and outside researchers to build a website and to design a predictive algorithm designed to aggregate thousands of independent stock predictions. ZotStock.com built on theories from crowd-sourcing and collective intelligence to derive stock predictions from the aggregated opinions a population of independent viewpoints. People Analyst & Data Scientist Google January 2010  – Present (5 years 8 months) People Analyst & Data Scientist Google January 2010  – Present (5 years 8 months) Decision Support Engineering Analyst Google June 2010  –  September 2010  (4 months) Conducted extensive statistical analyses on a large social network composed of millions of independent social interactions. Analyses were targeted at understanding how people’s position in social networks affects their behavior and how certain behaviors are contagious through social connections. Decision Support Engineering Analyst Google June 2010  –  September 2010  (4 months) Conducted extensive statistical analyses on a large social network composed of millions of independent social interactions. Analyses were targeted at understanding how people’s position in social networks affects their behavior and how certain behaviors are contagious through social connections. Co-Founder ZotStock.com 2008  –  2009  (1 year) In 2006 I raised capital from several investors and formed ZotStock.com – a startup designed to provide an online-forum for recreational investors to submit stock picks and opinions. As the founder of the company I collaborated intensely with website designers and outside researchers to build a website and to design a predictive algorithm designed to aggregate thousands of independent stock predictions. ZotStock.com built on theories from crowd-sourcing and collective intelligence to derive stock predictions from the aggregated opinions a population of independent viewpoints. Co-Founder ZotStock.com 2008  –  2009  (1 year) In 2006 I raised capital from several investors and formed ZotStock.com – a startup designed to provide an online-forum for recreational investors to submit stock picks and opinions. As the founder of the company I collaborated intensely with website designers and outside researchers to build a website and to design a predictive algorithm designed to aggregate thousands of independent stock predictions. ZotStock.com built on theories from crowd-sourcing and collective intelligence to derive stock predictions from the aggregated opinions a population of independent viewpoints. Skills Data Analysis Statistics Social Networking Research Sociology Social Psychology Machine Learning Management Statistical Modeling Start-ups Analytics Strategy Algorithms Business Strategy Skills  Data Analysis Statistics Social Networking Research Sociology Social Psychology Machine Learning Management Statistical Modeling Start-ups Analytics Strategy Algorithms Business Strategy Data Analysis Statistics Social Networking Research Sociology Social Psychology Machine Learning Management Statistical Modeling Start-ups Analytics Strategy Algorithms Business Strategy Data Analysis Statistics Social Networking Research Sociology Social Psychology Machine Learning Management Statistical Modeling Start-ups Analytics Strategy Algorithms Business Strategy Education Stanford University Graduate Certificate,  Data Mining & Machine Learning 2013  – 2015 This certificate covers multiple courses in the Stanford Statistics department. Topics covered include machine learning and statistical prediction models (LASSO, Random Forest, AdaBoost, SVM, Naive Bayes, and Ensemble approaches) as well as dimensionality reduction techniques (SVD and PCA). Northwestern University - Kellogg School of Management PhD,  Management & Organizations 2006  – 2010 Northwestern University - Kellogg School of Management M.S.,  Management 2004  – 2006 University of Denver B.A.,  Economics 1999  – 2002 Activities and Societies:  Omicron Delta Epsilon Santa Fe Institute Complexity Science Università degli Studi di Trento Social Networks Stanford University Graduate Certificate,  Data Mining & Machine Learning 2013  – 2015 This certificate covers multiple courses in the Stanford Statistics department. Topics covered include machine learning and statistical prediction models (LASSO, Random Forest, AdaBoost, SVM, Naive Bayes, and Ensemble approaches) as well as dimensionality reduction techniques (SVD and PCA). Stanford University Graduate Certificate,  Data Mining & Machine Learning 2013  – 2015 This certificate covers multiple courses in the Stanford Statistics department. Topics covered include machine learning and statistical prediction models (LASSO, Random Forest, AdaBoost, SVM, Naive Bayes, and Ensemble approaches) as well as dimensionality reduction techniques (SVD and PCA). Stanford University Graduate Certificate,  Data Mining & Machine Learning 2013  – 2015 This certificate covers multiple courses in the Stanford Statistics department. Topics covered include machine learning and statistical prediction models (LASSO, Random Forest, AdaBoost, SVM, Naive Bayes, and Ensemble approaches) as well as dimensionality reduction techniques (SVD and PCA). Northwestern University - Kellogg School of Management PhD,  Management & Organizations 2006  – 2010 Northwestern University - Kellogg School of Management PhD,  Management & Organizations 2006  – 2010 Northwestern University - Kellogg School of Management PhD,  Management & Organizations 2006  – 2010 Northwestern University - Kellogg School of Management M.S.,  Management 2004  – 2006 Northwestern University - Kellogg School of Management M.S.,  Management 2004  – 2006 Northwestern University - Kellogg School of Management M.S.,  Management 2004  – 2006 University of Denver B.A.,  Economics 1999  – 2002 Activities and Societies:  Omicron Delta Epsilon University of Denver B.A.,  Economics 1999  – 2002 Activities and Societies:  Omicron Delta Epsilon University of Denver B.A.,  Economics 1999  – 2002 Activities and Societies:  Omicron Delta Epsilon Santa Fe Institute Complexity Science Santa Fe Institute Complexity Science Santa Fe Institute Complexity Science Università degli Studi di Trento Social Networks Università degli Studi di Trento Social Networks Università degli Studi di Trento Social Networks Honors & Awards Additional Honors & Awards Kellogg School of Management Outstanding Teaching Award (2010), Additional Honors & Awards Kellogg School of Management Outstanding Teaching Award (2010), Additional Honors & Awards Kellogg School of Management Outstanding Teaching Award (2010), Additional Honors & Awards Kellogg School of Management Outstanding Teaching Award (2010), ", "Experience Decision Support Engineering Analyst Google July 2008  – Present (7 years 2 months) Research Assistant Iowa State Department of Statistics October 2007  –  May 2008  (8 months) Helped with several projects including one aimed at estimating the noise parameter from MRI data. Extended a multistage clustering algorithm to handle mixtures of Rice distributions. Used C for implementation and R for prototyping, analysis, and display. Research Assistant Fachbereich Statistik November 2006  –  July 2007  (9 months) Dortmund, Germany Modified existing C++ code, a collection of robust time series methods, to allow it to be called cleanly within R. Under the direction of the German researchers, extended the algorithms to \nhandle missing values and weights. Assisted other groups with C++ and R coding. Research Assistant Iowa State Department of Statistics January 2005  –  July 2006  (1 year 7 months) Investigated the properties of screwdriver scratches collected by our collaborators in mechanical engineering. Explored matching algorithms based on these using C++ with an eye towards forensics applications Programmer University of Iowa Department of Physics and Astronomy November 2004  –  January 2005  (3 months) Helped develop a program to manage a database of physics articles. Used Java for the GUI and (XML) database management and Perl to fetch the citations and articles. Tutor Iowa State Academic Success Center October 2004  –  December 2004  (3 months) Tutored five students in computer science courses covering beginning programming and data structures (C++), discrete math, and basic Unix commands amongst other topics. Research Assistant Iowa State June 2000  –  June 2004  (4 years 1 month) Worked with the ISU contingent of the PHENIX Group of Brookhaven's Relativistic Heavy Ion Collider. Wrote C++ macros and classes to display collider data using CERN's ROOT, an object-oriented data analysis framework. Decision Support Engineering Analyst Google July 2008  – Present (7 years 2 months) Decision Support Engineering Analyst Google July 2008  – Present (7 years 2 months) Research Assistant Iowa State Department of Statistics October 2007  –  May 2008  (8 months) Helped with several projects including one aimed at estimating the noise parameter from MRI data. Extended a multistage clustering algorithm to handle mixtures of Rice distributions. Used C for implementation and R for prototyping, analysis, and display. Research Assistant Iowa State Department of Statistics October 2007  –  May 2008  (8 months) Helped with several projects including one aimed at estimating the noise parameter from MRI data. Extended a multistage clustering algorithm to handle mixtures of Rice distributions. Used C for implementation and R for prototyping, analysis, and display. Research Assistant Fachbereich Statistik November 2006  –  July 2007  (9 months) Dortmund, Germany Modified existing C++ code, a collection of robust time series methods, to allow it to be called cleanly within R. Under the direction of the German researchers, extended the algorithms to \nhandle missing values and weights. Assisted other groups with C++ and R coding. Research Assistant Fachbereich Statistik November 2006  –  July 2007  (9 months) Dortmund, Germany Modified existing C++ code, a collection of robust time series methods, to allow it to be called cleanly within R. Under the direction of the German researchers, extended the algorithms to \nhandle missing values and weights. Assisted other groups with C++ and R coding. Research Assistant Iowa State Department of Statistics January 2005  –  July 2006  (1 year 7 months) Investigated the properties of screwdriver scratches collected by our collaborators in mechanical engineering. Explored matching algorithms based on these using C++ with an eye towards forensics applications Research Assistant Iowa State Department of Statistics January 2005  –  July 2006  (1 year 7 months) Investigated the properties of screwdriver scratches collected by our collaborators in mechanical engineering. Explored matching algorithms based on these using C++ with an eye towards forensics applications Programmer University of Iowa Department of Physics and Astronomy November 2004  –  January 2005  (3 months) Helped develop a program to manage a database of physics articles. Used Java for the GUI and (XML) database management and Perl to fetch the citations and articles. Programmer University of Iowa Department of Physics and Astronomy November 2004  –  January 2005  (3 months) Helped develop a program to manage a database of physics articles. Used Java for the GUI and (XML) database management and Perl to fetch the citations and articles. Tutor Iowa State Academic Success Center October 2004  –  December 2004  (3 months) Tutored five students in computer science courses covering beginning programming and data structures (C++), discrete math, and basic Unix commands amongst other topics. Tutor Iowa State Academic Success Center October 2004  –  December 2004  (3 months) Tutored five students in computer science courses covering beginning programming and data structures (C++), discrete math, and basic Unix commands amongst other topics. Research Assistant Iowa State June 2000  –  June 2004  (4 years 1 month) Worked with the ISU contingent of the PHENIX Group of Brookhaven's Relativistic Heavy Ion Collider. Wrote C++ macros and classes to display collider data using CERN's ROOT, an object-oriented data analysis framework. Research Assistant Iowa State June 2000  –  June 2004  (4 years 1 month) Worked with the ISU contingent of the PHENIX Group of Brookhaven's Relativistic Heavy Ion Collider. Wrote C++ macros and classes to display collider data using CERN's ROOT, an object-oriented data analysis framework. Skills R JavaScript Python Software Development C++ Statistics Data Analysis Skills  R JavaScript Python Software Development C++ Statistics Data Analysis R JavaScript Python Software Development C++ Statistics Data Analysis R JavaScript Python Software Development C++ Statistics Data Analysis Education Iowa State University BS,  Computer Science 1999  – 2004 Minors in mathematics and philosophy Activities and Societies:  Pi Mu Epsilon ,  Philosophy Club Iowa State University MS,  Statistics 2005 Have completed everything but masters project. Activities and Societies:  Philosophy Club Iowa State University BS,  Computer Science 1999  – 2004 Minors in mathematics and philosophy Activities and Societies:  Pi Mu Epsilon ,  Philosophy Club Iowa State University BS,  Computer Science 1999  – 2004 Minors in mathematics and philosophy Activities and Societies:  Pi Mu Epsilon ,  Philosophy Club Iowa State University BS,  Computer Science 1999  – 2004 Minors in mathematics and philosophy Activities and Societies:  Pi Mu Epsilon ,  Philosophy Club Iowa State University MS,  Statistics 2005 Have completed everything but masters project. Activities and Societies:  Philosophy Club Iowa State University MS,  Statistics 2005 Have completed everything but masters project. Activities and Societies:  Philosophy Club Iowa State University MS,  Statistics 2005 Have completed everything but masters project. Activities and Societies:  Philosophy Club Honors & Awards Additional Honors & Awards National Merit Scholarship \nJavaBoutique Applet of the Week Award, May 1999, June 1999, and May 2001 Additional Honors & Awards National Merit Scholarship \nJavaBoutique Applet of the Week Award, May 1999, June 1999, and May 2001 Additional Honors & Awards National Merit Scholarship \nJavaBoutique Applet of the Week Award, May 1999, June 1999, and May 2001 Additional Honors & Awards National Merit Scholarship \nJavaBoutique Applet of the Week Award, May 1999, June 1999, and May 2001 ", "Experience Decision Support Engineering Analyst Google 2010  – Present (5 years) Analyst Charles River Associates August 2005  –  August 2008  (3 years 1 month) Decision Support Engineering Analyst Google 2010  – Present (5 years) Decision Support Engineering Analyst Google 2010  – Present (5 years) Analyst Charles River Associates August 2005  –  August 2008  (3 years 1 month) Analyst Charles River Associates August 2005  –  August 2008  (3 years 1 month) Skills SAS Stata Statistics Quantitative Analysis Economics R Skills  SAS Stata Statistics Quantitative Analysis Economics R SAS Stata Statistics Quantitative Analysis Economics R SAS Stata Statistics Quantitative Analysis Economics R Education Stanford University MS,  Statistics 2008  – 2010 Stanford University MS,  Statistics 2008  – 2010 Stanford University MS,  Statistics 2008  – 2010 Stanford University MS,  Statistics 2008  – 2010 ", "Experience Assistant Professor of Statistics Middlebury August 2015  – Present (1 month) Middlebury VT Visiting Assistant Professor of Statistics Reed College August 2013  –  August 2015  (2 years 1 month) Portland, Oregon Area Teaching Introduction to Probability and Statistics, Probability Theory, and Mathematical Statistics at a small liberal arts college. Decision Support Engineering Analyst Google June 2011  –  March 2013  (1 year 10 months) San Francisco Bay Area Data scientist AKA quantitative analyst AKA statistician in Ads Metrics, the analyst sub-team of Google AdWords, in charge of ensuring the quality of search ads shown on google.com Research Assistant Department of Biostatistics, University of Washington September 2008  –  March 2011  (2 years 7 months) Greater Seattle Area Funded by Professor Jon Wakefield's \"Spatio-Temporal Epidemiology: Methods and Applications\" grant from the National Cancer Institute. Decision Support Engineering Analyst Intern Google January 2010  –  March 2010  (3 months) Internship in Ads Metrics group of Google. Research Assistant Department of Statistics, University of Washington September 2005  –  December 2008  (3 years 4 months) Funded by Professor Werner Stuetzle's \"C-IED\" grant from the Office of Naval Research. Assistant Professor of Statistics Middlebury August 2015  – Present (1 month) Middlebury VT Assistant Professor of Statistics Middlebury August 2015  – Present (1 month) Middlebury VT Visiting Assistant Professor of Statistics Reed College August 2013  –  August 2015  (2 years 1 month) Portland, Oregon Area Teaching Introduction to Probability and Statistics, Probability Theory, and Mathematical Statistics at a small liberal arts college. Visiting Assistant Professor of Statistics Reed College August 2013  –  August 2015  (2 years 1 month) Portland, Oregon Area Teaching Introduction to Probability and Statistics, Probability Theory, and Mathematical Statistics at a small liberal arts college. Decision Support Engineering Analyst Google June 2011  –  March 2013  (1 year 10 months) San Francisco Bay Area Data scientist AKA quantitative analyst AKA statistician in Ads Metrics, the analyst sub-team of Google AdWords, in charge of ensuring the quality of search ads shown on google.com Decision Support Engineering Analyst Google June 2011  –  March 2013  (1 year 10 months) San Francisco Bay Area Data scientist AKA quantitative analyst AKA statistician in Ads Metrics, the analyst sub-team of Google AdWords, in charge of ensuring the quality of search ads shown on google.com Research Assistant Department of Biostatistics, University of Washington September 2008  –  March 2011  (2 years 7 months) Greater Seattle Area Funded by Professor Jon Wakefield's \"Spatio-Temporal Epidemiology: Methods and Applications\" grant from the National Cancer Institute. Research Assistant Department of Biostatistics, University of Washington September 2008  –  March 2011  (2 years 7 months) Greater Seattle Area Funded by Professor Jon Wakefield's \"Spatio-Temporal Epidemiology: Methods and Applications\" grant from the National Cancer Institute. Decision Support Engineering Analyst Intern Google January 2010  –  March 2010  (3 months) Internship in Ads Metrics group of Google. Decision Support Engineering Analyst Intern Google January 2010  –  March 2010  (3 months) Internship in Ads Metrics group of Google. Research Assistant Department of Statistics, University of Washington September 2005  –  December 2008  (3 years 4 months) Funded by Professor Werner Stuetzle's \"C-IED\" grant from the Office of Naval Research. Research Assistant Department of Statistics, University of Washington September 2005  –  December 2008  (3 years 4 months) Funded by Professor Werner Stuetzle's \"C-IED\" grant from the Office of Naval Research. Languages French Korean French Korean French Korean Skills Machine Learning R Experimental Design Statistical Modeling Time Series Analysis LaTeX Mathematical Modeling Statistics Data Mining Predictive Modeling Matlab Data Analysis Biostatistics Science Skills  Machine Learning R Experimental Design Statistical Modeling Time Series Analysis LaTeX Mathematical Modeling Statistics Data Mining Predictive Modeling Matlab Data Analysis Biostatistics Science Machine Learning R Experimental Design Statistical Modeling Time Series Analysis LaTeX Mathematical Modeling Statistics Data Mining Predictive Modeling Matlab Data Analysis Biostatistics Science Machine Learning R Experimental Design Statistical Modeling Time Series Analysis LaTeX Mathematical Modeling Statistics Data Mining Predictive Modeling Matlab Data Analysis Biostatistics Science Education University of Washington PhD,  Statistics 2004  – 2011 McGill University BSc,  Joint Honours Mathematics and Computer Science , Minor Concentration in Management 2000  – 2003 Activities and Societies:  President of Society of Undergraduate Math Students (SUMS) Student Council Marianopolis College Applied Science 1998  – 2000 West Island College High School,  High School/Secondary Diplomas and Certificates 1995  – 1998 University of Washington PhD,  Statistics 2004  – 2011 University of Washington PhD,  Statistics 2004  – 2011 University of Washington PhD,  Statistics 2004  – 2011 McGill University BSc,  Joint Honours Mathematics and Computer Science , Minor Concentration in Management 2000  – 2003 Activities and Societies:  President of Society of Undergraduate Math Students (SUMS) Student Council McGill University BSc,  Joint Honours Mathematics and Computer Science , Minor Concentration in Management 2000  – 2003 Activities and Societies:  President of Society of Undergraduate Math Students (SUMS) Student Council McGill University BSc,  Joint Honours Mathematics and Computer Science , Minor Concentration in Management 2000  – 2003 Activities and Societies:  President of Society of Undergraduate Math Students (SUMS) Student Council Marianopolis College Applied Science 1998  – 2000 Marianopolis College Applied Science 1998  – 2000 Marianopolis College Applied Science 1998  – 2000 West Island College High School,  High School/Secondary Diplomas and Certificates 1995  – 1998 West Island College High School,  High School/Secondary Diplomas and Certificates 1995  – 1998 West Island College High School,  High School/Secondary Diplomas and Certificates 1995  – 1998 Honors & Awards ", "Experience Advanced Technology and Projects Google December 2013  –  March 2015  (1 year 4 months) Mountain View Data products + Science Senior Data Scientist StumbleUpon June 2011  –  December 2013  (2 years 7 months) San Francisco Bay Area PhD student University of Southern California May 2005  –  May 2011  (6 years 1 month) Los Angeles Decision Support Engineering Analyst Intern Google June 2010  –  August 2010  (3 months) Mountain View Advanced Technology and Projects Google December 2013  –  March 2015  (1 year 4 months) Mountain View Data products + Science Advanced Technology and Projects Google December 2013  –  March 2015  (1 year 4 months) Mountain View Data products + Science Senior Data Scientist StumbleUpon June 2011  –  December 2013  (2 years 7 months) San Francisco Bay Area Senior Data Scientist StumbleUpon June 2011  –  December 2013  (2 years 7 months) San Francisco Bay Area PhD student University of Southern California May 2005  –  May 2011  (6 years 1 month) Los Angeles PhD student University of Southern California May 2005  –  May 2011  (6 years 1 month) Los Angeles Decision Support Engineering Analyst Intern Google June 2010  –  August 2010  (3 months) Mountain View Decision Support Engineering Analyst Intern Google June 2010  –  August 2010  (3 months) Mountain View Skills Machine Learning Data Mining Statistical Modeling Predictive Modeling MapReduce Web Analytics Hadoop R Big Data Pattern Recognition Information Retrieval Algorithms Artificial Intelligence Data Visualization Natural Language... Skills  Machine Learning Data Mining Statistical Modeling Predictive Modeling MapReduce Web Analytics Hadoop R Big Data Pattern Recognition Information Retrieval Algorithms Artificial Intelligence Data Visualization Natural Language... Machine Learning Data Mining Statistical Modeling Predictive Modeling MapReduce Web Analytics Hadoop R Big Data Pattern Recognition Information Retrieval Algorithms Artificial Intelligence Data Visualization Natural Language... Machine Learning Data Mining Statistical Modeling Predictive Modeling MapReduce Web Analytics Hadoop R Big Data Pattern Recognition Information Retrieval Algorithms Artificial Intelligence Data Visualization Natural Language... Education University of Southern California PhD,  Neuroscience (Statistical modeling of brain signals ,  Linear/Nonlinear system analysis) 2004  – 2011 Rochester Institute of Technology MS,  Computer Science (computer vision , machine learning) 2001  – 2004 University of Mumbai Bachelor of Engineering (B.E.),  Computer Science University of Southern California PhD,  Neuroscience (Statistical modeling of brain signals ,  Linear/Nonlinear system analysis) 2004  – 2011 University of Southern California PhD,  Neuroscience (Statistical modeling of brain signals ,  Linear/Nonlinear system analysis) 2004  – 2011 University of Southern California PhD,  Neuroscience (Statistical modeling of brain signals ,  Linear/Nonlinear system analysis) 2004  – 2011 Rochester Institute of Technology MS,  Computer Science (computer vision , machine learning) 2001  – 2004 Rochester Institute of Technology MS,  Computer Science (computer vision , machine learning) 2001  – 2004 Rochester Institute of Technology MS,  Computer Science (computer vision , machine learning) 2001  – 2004 University of Mumbai Bachelor of Engineering (B.E.),  Computer Science University of Mumbai Bachelor of Engineering (B.E.),  Computer Science University of Mumbai Bachelor of Engineering (B.E.),  Computer Science Honors & Awards Invited Speaker at The Big Data Innovation Summit, Boston September 2012 Title: Recommendations and Discovery at StumbleUpon Invited Speaker at The Big Data Innovation Summit, Boston September 2012 Title: Recommendations and Discovery at StumbleUpon Invited Speaker at The Big Data Innovation Summit, Boston September 2012 Title: Recommendations and Discovery at StumbleUpon Invited Speaker at The Big Data Innovation Summit, Boston September 2012 Title: Recommendations and Discovery at StumbleUpon ", "Summary Data-driven PM with a passion for innovation Summary Data-driven PM with a passion for innovation Data-driven PM with a passion for innovation Data-driven PM with a passion for innovation Experience Product Manager, Data Science and R&D CrowdFlower June 2014  –  October 2014  (5 months) San Francisco Bay Area - Partnered with the CTO and swat team of engineers on the development of a new business-critical product. Interviewed potential customers, defined priorities, and helped ship an alpha version within two months \n- Implemented an innovative solution to replace the most problematic and time-consuming step in the customer flow (generation of Gold data for quality assurance) \n- Prototyped features with the Data Science Team and shipped them (expected quality of contributions, fraud detection, platform automation and analytics) \n- Spearheaded contributor UX research and tested out most promising features that boost quality and satisfaction \n- Managed a team of two Product Analysts to perform side-by-side tests and track metrics for new initiatives Senior Manager, Advanced Solutions CrowdFlower February 2013  –  May 2014  (1 year 4 months) San Francisco Bay Area - Lead a team of analysts responsible for scoping, custom engineering, and delivery of crowdsourcing projects for enterprise customers \n- Performed quality assessments, A/B tests, optimization to drive CrowdFlower's crowdsourcing solutions \n- Developed a framework and set of applications to diagnose and improve crowdsourcing jobs: data summaries and visualizations, outlier detection, data transformation (coolstuff.crowdflower.com) Decision Support Engineering Analyst Google August 2011  –  2013  (2 years) Mountain View, CA Search Infrastructure Data Analysis Intern Motion Picture Laboratories, Inc. (MovieLabs) 2010  –  2011  (1 year) Palo Alto, CA Product Manager, Data Science and R&D CrowdFlower June 2014  –  October 2014  (5 months) San Francisco Bay Area - Partnered with the CTO and swat team of engineers on the development of a new business-critical product. Interviewed potential customers, defined priorities, and helped ship an alpha version within two months \n- Implemented an innovative solution to replace the most problematic and time-consuming step in the customer flow (generation of Gold data for quality assurance) \n- Prototyped features with the Data Science Team and shipped them (expected quality of contributions, fraud detection, platform automation and analytics) \n- Spearheaded contributor UX research and tested out most promising features that boost quality and satisfaction \n- Managed a team of two Product Analysts to perform side-by-side tests and track metrics for new initiatives Product Manager, Data Science and R&D CrowdFlower June 2014  –  October 2014  (5 months) San Francisco Bay Area - Partnered with the CTO and swat team of engineers on the development of a new business-critical product. Interviewed potential customers, defined priorities, and helped ship an alpha version within two months \n- Implemented an innovative solution to replace the most problematic and time-consuming step in the customer flow (generation of Gold data for quality assurance) \n- Prototyped features with the Data Science Team and shipped them (expected quality of contributions, fraud detection, platform automation and analytics) \n- Spearheaded contributor UX research and tested out most promising features that boost quality and satisfaction \n- Managed a team of two Product Analysts to perform side-by-side tests and track metrics for new initiatives Senior Manager, Advanced Solutions CrowdFlower February 2013  –  May 2014  (1 year 4 months) San Francisco Bay Area - Lead a team of analysts responsible for scoping, custom engineering, and delivery of crowdsourcing projects for enterprise customers \n- Performed quality assessments, A/B tests, optimization to drive CrowdFlower's crowdsourcing solutions \n- Developed a framework and set of applications to diagnose and improve crowdsourcing jobs: data summaries and visualizations, outlier detection, data transformation (coolstuff.crowdflower.com) Senior Manager, Advanced Solutions CrowdFlower February 2013  –  May 2014  (1 year 4 months) San Francisco Bay Area - Lead a team of analysts responsible for scoping, custom engineering, and delivery of crowdsourcing projects for enterprise customers \n- Performed quality assessments, A/B tests, optimization to drive CrowdFlower's crowdsourcing solutions \n- Developed a framework and set of applications to diagnose and improve crowdsourcing jobs: data summaries and visualizations, outlier detection, data transformation (coolstuff.crowdflower.com) Decision Support Engineering Analyst Google August 2011  –  2013  (2 years) Mountain View, CA Search Infrastructure Decision Support Engineering Analyst Google August 2011  –  2013  (2 years) Mountain View, CA Search Infrastructure Data Analysis Intern Motion Picture Laboratories, Inc. (MovieLabs) 2010  –  2011  (1 year) Palo Alto, CA Data Analysis Intern Motion Picture Laboratories, Inc. (MovieLabs) 2010  –  2011  (1 year) Palo Alto, CA Skills Statistics Financial Modeling Data Analysis Strategy Business Strategy Analytics Start-ups Management Consulting HTML Python Analysis Entrepreneurship Product Management Project Management Econometrics Marketing Strategy Product Development Management Product Strategy Data Science E-commerce Java Business Analysis Valuation Economics Corporate Finance R SQL HT CSS jQuery D3.js Ruby Agile Methodologies See 19+     See less Skills  Statistics Financial Modeling Data Analysis Strategy Business Strategy Analytics Start-ups Management Consulting HTML Python Analysis Entrepreneurship Product Management Project Management Econometrics Marketing Strategy Product Development Management Product Strategy Data Science E-commerce Java Business Analysis Valuation Economics Corporate Finance R SQL HT CSS jQuery D3.js Ruby Agile Methodologies See 19+     See less Statistics Financial Modeling Data Analysis Strategy Business Strategy Analytics Start-ups Management Consulting HTML Python Analysis Entrepreneurship Product Management Project Management Econometrics Marketing Strategy Product Development Management Product Strategy Data Science E-commerce Java Business Analysis Valuation Economics Corporate Finance R SQL HT CSS jQuery D3.js Ruby Agile Methodologies See 19+     See less Statistics Financial Modeling Data Analysis Strategy Business Strategy Analytics Start-ups Management Consulting HTML Python Analysis Entrepreneurship Product Management Project Management Econometrics Marketing Strategy Product Development Management Product Strategy Data Science E-commerce Java Business Analysis Valuation Economics Corporate Finance R SQL HT CSS jQuery D3.js Ruby Agile Methodologies See 19+     See less Education Stanford University Master's Degree,  Statistics 2009  – 2011 State University — Higher School of Economics Economics,  Economics&Finance 2005  – 2009 Activities and Societies:  HSE Case Club Stanford University Master's Degree,  Statistics 2009  – 2011 Stanford University Master's Degree,  Statistics 2009  – 2011 Stanford University Master's Degree,  Statistics 2009  – 2011 State University — Higher School of Economics Economics,  Economics&Finance 2005  – 2009 Activities and Societies:  HSE Case Club State University — Higher School of Economics Economics,  Economics&Finance 2005  – 2009 Activities and Societies:  HSE Case Club State University — Higher School of Economics Economics,  Economics&Finance 2005  – 2009 Activities and Societies:  HSE Case Club ", "Experience Decision Support Engineering Analyst Intern Google[x] June 2015  – Present (3 months) San Francisco Bay Area Graduate Student Duke University August 2009  – Present (6 years 1 month) Raleigh-Durham, North Carolina Area Undergraduate Research Assistant and Technician National Institute of Biological Sciences, Beijing November 2007  –  March 2009  (1 year 5 months) Beijing Suburb, China Decision Support Engineering Analyst Intern Google[x] June 2015  – Present (3 months) San Francisco Bay Area Decision Support Engineering Analyst Intern Google[x] June 2015  – Present (3 months) San Francisco Bay Area Graduate Student Duke University August 2009  – Present (6 years 1 month) Raleigh-Durham, North Carolina Area Graduate Student Duke University August 2009  – Present (6 years 1 month) Raleigh-Durham, North Carolina Area Undergraduate Research Assistant and Technician National Institute of Biological Sciences, Beijing November 2007  –  March 2009  (1 year 5 months) Beijing Suburb, China Undergraduate Research Assistant and Technician National Institute of Biological Sciences, Beijing November 2007  –  March 2009  (1 year 5 months) Beijing Suburb, China Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills R Genetics Bioinformatics Genomics Bayesian statistics Machine Learning Transcriptomics Perl Statistics Matlab Skills  R Genetics Bioinformatics Genomics Bayesian statistics Machine Learning Transcriptomics Perl Statistics Matlab R Genetics Bioinformatics Genomics Bayesian statistics Machine Learning Transcriptomics Perl Statistics Matlab R Genetics Bioinformatics Genomics Bayesian statistics Machine Learning Transcriptomics Perl Statistics Matlab Education Duke University Doctor of Philosophy (Ph.D.),  Genetics and Genomics 2009  – 2015 Duke University Master's Degree,  Statistics 2015 Duke University Certificate Program,  Computational Biology and Bioinformatics 2015 Peking University B.S.,  Biological Sciences 2004  – 2008 Duke University Doctor of Philosophy (Ph.D.),  Genetics and Genomics 2009  – 2015 Duke University Doctor of Philosophy (Ph.D.),  Genetics and Genomics 2009  – 2015 Duke University Doctor of Philosophy (Ph.D.),  Genetics and Genomics 2009  – 2015 Duke University Master's Degree,  Statistics 2015 Duke University Master's Degree,  Statistics 2015 Duke University Master's Degree,  Statistics 2015 Duke University Certificate Program,  Computational Biology and Bioinformatics 2015 Duke University Certificate Program,  Computational Biology and Bioinformatics 2015 Duke University Certificate Program,  Computational Biology and Bioinformatics 2015 Peking University B.S.,  Biological Sciences 2004  – 2008 Peking University B.S.,  Biological Sciences 2004  – 2008 Peking University B.S.,  Biological Sciences 2004  – 2008 Honors & Awards ", "Experience Decision Support Engineering Analyst Google April 2011  – Present (4 years 5 months) Scientific Officer in the Group for Mathematical-Statistical Methods Federal Statistical Office, Germany June 2010  –  March 2011  (10 months) Scientific Assistant in the Group for Mathematical-Statistical Methods Federal Statistical Office, Germany May 2009  –  May 2010  (1 year 1 month) Faculty Fellow UC San Diego July 2006  –  June 2008  (2 years) Decision Support Engineering Analyst Google April 2011  – Present (4 years 5 months) Decision Support Engineering Analyst Google April 2011  – Present (4 years 5 months) Scientific Officer in the Group for Mathematical-Statistical Methods Federal Statistical Office, Germany June 2010  –  March 2011  (10 months) Scientific Officer in the Group for Mathematical-Statistical Methods Federal Statistical Office, Germany June 2010  –  March 2011  (10 months) Scientific Assistant in the Group for Mathematical-Statistical Methods Federal Statistical Office, Germany May 2009  –  May 2010  (1 year 1 month) Scientific Assistant in the Group for Mathematical-Statistical Methods Federal Statistical Office, Germany May 2009  –  May 2010  (1 year 1 month) Faculty Fellow UC San Diego July 2006  –  June 2008  (2 years) Faculty Fellow UC San Diego July 2006  –  June 2008  (2 years) Education University of California, San Diego Ph.D. 2002  – 2006 University of California, Berkeley Graduate studies 2004  – 2005 Heidelberg University Diplom 1997  – 2002 The University of Freiburg Undergraduate studies 1999  – 2000 University of California, San Diego Ph.D. 2002  – 2006 University of California, San Diego Ph.D. 2002  – 2006 University of California, San Diego Ph.D. 2002  – 2006 University of California, Berkeley Graduate studies 2004  – 2005 University of California, Berkeley Graduate studies 2004  – 2005 University of California, Berkeley Graduate studies 2004  – 2005 Heidelberg University Diplom 1997  – 2002 Heidelberg University Diplom 1997  – 2002 Heidelberg University Diplom 1997  – 2002 The University of Freiburg Undergraduate studies 1999  – 2000 The University of Freiburg Undergraduate studies 1999  – 2000 The University of Freiburg Undergraduate studies 1999  – 2000 ", "Experience CTO, Co-Founder Sociogramics Inc 2012  – Present (3 years) Mountain View, CA Sociogramics' vision is to return character and community to the core practices of financial institutions with an emphasis on the 80+ million in the U.S. who are unbanked, under-banked and those new to credit (such as recent immigrants and youth). Benefits to financial institutions, such as credit granters, depositories and insurers include increased lifetime account value, real-time life event insights, deepened customer engagement, fraud prevention and reduced delinquencies. Sociogramics was founded by serial entrepreneur and champion of social good, Gary Kremen (founder of both Match.Com and Clean Power Finance), and is backed by a consortium of leading national venture capital funds. Senior Software Engineer Netflix 2010  –  2012  (2 years) Built 100% of the new framework for building movie ranking systems within Netflix. As a result of testing the system (version 1), became the customer default experience on July 4th 2011. One CEO comment was \"Reed commented, in his usual style as a question to Neil, that we have never seen such high [customer] retention gain for any test in the past\". Another CEO comment was that customer retention was equivalent to spending an additional $25million/month on streaming content. Version 2 has 200% higher performance than version 1. Page 7 of the quarter 4 2011 investor letter included the following \"Finally, we had several personalization algorithm breakthroughs for how we sort titles in each category, making it easier for our members to find movies and TV shows they’ll love.\" Software Engineer/Decision Support Engineering Analyst Google 2006  –  2010  (4 years) Mountain View, CA Member of the fraud/abuse team for Google checkout, adsense and adwords. \nSole writer of machine learning algorithm in UserGeist. This system currently monitors 300,000 units of customer feedback per quarter for Google products such as Adwords, Adsense and Chrome. It summarizes topics discussed and looks for emergent topics. My approach won an independent bakeoff between half-a-dozen other Google systems. Principal Scientist Fair Isaac Corporation 2003  –  2006  (3 years) San Diego Principal Investigator for U.S. government BRAHMA III contract. Responsible for writing proposals for new external contracts (e.g. DARPA PANDA). Senior Research Scientist Motorola Human Interface Labs 1999  –  2003  (4 years) Palo Alto, CA Added discriminative training and input transforms to the Motorola software tools. This resulted in a ten-fold decrease in model size for Motorola’s speech recognizer and a 50% decrease in error rate for Motorola’s handwriting recognizer. To the best of my knowledge these systems hold the record for the highest performance achieved on the databases used. \nConsultant to the eSensor DNA array product group – part of Motorola Life Sciences (http://www.motorola.com/lifesciences/esensor). I am the sole investigator in this project. My original project proposal was used by life sciences to obtain a NIMA grant. Approximately $150,000 of this was given to our site for payment for my services. The project was a proposal to improve the signal detection algorithm. This detector algorithm analyzes the electrical signals from the electrochemical cell and infers the presence or absence of targeted DNA sequences. Our current detector has 4 times more sensitivity, is 1/10 of the size and is 20 times faster than the baseline life sciences implementation. CTO, Co-Founder Sociogramics Inc 2012  – Present (3 years) Mountain View, CA Sociogramics' vision is to return character and community to the core practices of financial institutions with an emphasis on the 80+ million in the U.S. who are unbanked, under-banked and those new to credit (such as recent immigrants and youth). Benefits to financial institutions, such as credit granters, depositories and insurers include increased lifetime account value, real-time life event insights, deepened customer engagement, fraud prevention and reduced delinquencies. Sociogramics was founded by serial entrepreneur and champion of social good, Gary Kremen (founder of both Match.Com and Clean Power Finance), and is backed by a consortium of leading national venture capital funds. CTO, Co-Founder Sociogramics Inc 2012  – Present (3 years) Mountain View, CA Sociogramics' vision is to return character and community to the core practices of financial institutions with an emphasis on the 80+ million in the U.S. who are unbanked, under-banked and those new to credit (such as recent immigrants and youth). Benefits to financial institutions, such as credit granters, depositories and insurers include increased lifetime account value, real-time life event insights, deepened customer engagement, fraud prevention and reduced delinquencies. Sociogramics was founded by serial entrepreneur and champion of social good, Gary Kremen (founder of both Match.Com and Clean Power Finance), and is backed by a consortium of leading national venture capital funds. Senior Software Engineer Netflix 2010  –  2012  (2 years) Built 100% of the new framework for building movie ranking systems within Netflix. As a result of testing the system (version 1), became the customer default experience on July 4th 2011. One CEO comment was \"Reed commented, in his usual style as a question to Neil, that we have never seen such high [customer] retention gain for any test in the past\". Another CEO comment was that customer retention was equivalent to spending an additional $25million/month on streaming content. Version 2 has 200% higher performance than version 1. Page 7 of the quarter 4 2011 investor letter included the following \"Finally, we had several personalization algorithm breakthroughs for how we sort titles in each category, making it easier for our members to find movies and TV shows they’ll love.\" Senior Software Engineer Netflix 2010  –  2012  (2 years) Built 100% of the new framework for building movie ranking systems within Netflix. As a result of testing the system (version 1), became the customer default experience on July 4th 2011. One CEO comment was \"Reed commented, in his usual style as a question to Neil, that we have never seen such high [customer] retention gain for any test in the past\". Another CEO comment was that customer retention was equivalent to spending an additional $25million/month on streaming content. Version 2 has 200% higher performance than version 1. Page 7 of the quarter 4 2011 investor letter included the following \"Finally, we had several personalization algorithm breakthroughs for how we sort titles in each category, making it easier for our members to find movies and TV shows they’ll love.\" Software Engineer/Decision Support Engineering Analyst Google 2006  –  2010  (4 years) Mountain View, CA Member of the fraud/abuse team for Google checkout, adsense and adwords. \nSole writer of machine learning algorithm in UserGeist. This system currently monitors 300,000 units of customer feedback per quarter for Google products such as Adwords, Adsense and Chrome. It summarizes topics discussed and looks for emergent topics. My approach won an independent bakeoff between half-a-dozen other Google systems. Software Engineer/Decision Support Engineering Analyst Google 2006  –  2010  (4 years) Mountain View, CA Member of the fraud/abuse team for Google checkout, adsense and adwords. \nSole writer of machine learning algorithm in UserGeist. This system currently monitors 300,000 units of customer feedback per quarter for Google products such as Adwords, Adsense and Chrome. It summarizes topics discussed and looks for emergent topics. My approach won an independent bakeoff between half-a-dozen other Google systems. Principal Scientist Fair Isaac Corporation 2003  –  2006  (3 years) San Diego Principal Investigator for U.S. government BRAHMA III contract. Responsible for writing proposals for new external contracts (e.g. DARPA PANDA). Principal Scientist Fair Isaac Corporation 2003  –  2006  (3 years) San Diego Principal Investigator for U.S. government BRAHMA III contract. Responsible for writing proposals for new external contracts (e.g. DARPA PANDA). Senior Research Scientist Motorola Human Interface Labs 1999  –  2003  (4 years) Palo Alto, CA Added discriminative training and input transforms to the Motorola software tools. This resulted in a ten-fold decrease in model size for Motorola’s speech recognizer and a 50% decrease in error rate for Motorola’s handwriting recognizer. To the best of my knowledge these systems hold the record for the highest performance achieved on the databases used. \nConsultant to the eSensor DNA array product group – part of Motorola Life Sciences (http://www.motorola.com/lifesciences/esensor). I am the sole investigator in this project. My original project proposal was used by life sciences to obtain a NIMA grant. Approximately $150,000 of this was given to our site for payment for my services. The project was a proposal to improve the signal detection algorithm. This detector algorithm analyzes the electrical signals from the electrochemical cell and infers the presence or absence of targeted DNA sequences. Our current detector has 4 times more sensitivity, is 1/10 of the size and is 20 times faster than the baseline life sciences implementation. Senior Research Scientist Motorola Human Interface Labs 1999  –  2003  (4 years) Palo Alto, CA Added discriminative training and input transforms to the Motorola software tools. This resulted in a ten-fold decrease in model size for Motorola’s speech recognizer and a 50% decrease in error rate for Motorola’s handwriting recognizer. To the best of my knowledge these systems hold the record for the highest performance achieved on the databases used. \nConsultant to the eSensor DNA array product group – part of Motorola Life Sciences (http://www.motorola.com/lifesciences/esensor). I am the sole investigator in this project. My original project proposal was used by life sciences to obtain a NIMA grant. Approximately $150,000 of this was given to our site for payment for my services. The project was a proposal to improve the signal detection algorithm. This detector algorithm analyzes the electrical signals from the electrochemical cell and infers the presence or absence of targeted DNA sequences. Our current detector has 4 times more sensitivity, is 1/10 of the size and is 20 times faster than the baseline life sciences implementation. Skills Big data Machine Learning Software Engineering Java C++ Clustering Data Mining Speech Recognition Software Project... Software Design Scripting Teradata Amazon Web Services Performance Tuning Production Support Statistics SQL Unix Mathematical Modeling Multithreading MapReduce Big Data Cloud Computing Algorithms See 9+     See less Skills  Big data Machine Learning Software Engineering Java C++ Clustering Data Mining Speech Recognition Software Project... Software Design Scripting Teradata Amazon Web Services Performance Tuning Production Support Statistics SQL Unix Mathematical Modeling Multithreading MapReduce Big Data Cloud Computing Algorithms See 9+     See less Big data Machine Learning Software Engineering Java C++ Clustering Data Mining Speech Recognition Software Project... Software Design Scripting Teradata Amazon Web Services Performance Tuning Production Support Statistics SQL Unix Mathematical Modeling Multithreading MapReduce Big Data Cloud Computing Algorithms See 9+     See less Big data Machine Learning Software Engineering Java C++ Clustering Data Mining Speech Recognition Software Project... Software Design Scripting Teradata Amazon Web Services Performance Tuning Production Support Statistics SQL Unix Mathematical Modeling Multithreading MapReduce Big Data Cloud Computing Algorithms See 9+     See less Education Cambridge University Doctor of Philosophy (PhD),  Informatics 1991  – 1994 Cambridge University Doctor of Philosophy (PhD),  Informatics 1991  – 1994 Cambridge University Doctor of Philosophy (PhD),  Informatics 1991  – 1994 Cambridge University Doctor of Philosophy (PhD),  Informatics 1991  – 1994 ", "Experience Quantitative Analyst Google July 2012  –  May 2014  (1 year 11 months) Mountain View, CA Forecasting, building models and scripting in R, building dashboard, query and analyze large datasets. Graduate Student Instructor Department of Statistics, UC Berkeley January 2012  –  May 2012  (5 months) Berkeley, CA Statistics 2: Introduction to Statistics Graduate Student Instructor Haas School of Business August 2011  –  December 2011  (5 months) Berkeley, CA Analytic Decision Modeling Using Spreadsheets Decision Support Engineering Analyst Intern Google June 2011  –  August 2011  (3 months) Mountain View, California •Oversaw the development of the internal metrics reporting dashboard – platform research, data hierarchy design, data field property design, functionality and user interface. \n \n•Built a Burn Rate Model (Excel) that visualizes computing resource consumption rates derived from dynamic data. \n \n•Performed ad-hoc reports and analysis on computing resource usage data with an internal language similar to SQL. \n \n•Collaborated cross-functionally (SWEs/PM) to design and create new KPIs based on requirements from Director/PM. \n \n•Assisted Team Liquidity with compute-budget initiatives such as inorganic growth forecasting, budget planning, price re-indexing and network chargeback implementation. Delivered a weekly report and presentation on the project status. Database Management Associate Haas School of Business December 2009  –  May 2011  (1 year 6 months) Berkeley, CA •Designed and implemented Excel applications to automate cleaning and to format standardization processes for raw data. \n \n•Assisted Haas MBA directors in providing accurate periodic dashboard reports on student salary and offer statistics.  \n \n•Provided business school ranking metrics for magazines like US News and World Report and BusinessWeek. \n \n•Monitored the overall integrity of the database for job offers received by MBA students at Haas. IT Engineer Intern Cisco Systems May 2010  –  August 2010  (4 months) San Jose, CA •Created over 40 pages of functional and technical design documents for various software development projects. \n \n•Worked cross-functionally within Cisco IT to ¬assist in creating network solutions for external and internal clients of Cisco. \n \n•Participated in pilot programs for new technologies and debriefed to various Cisco engineering teams in India and USA. Quantitative Analyst Google July 2012  –  May 2014  (1 year 11 months) Mountain View, CA Forecasting, building models and scripting in R, building dashboard, query and analyze large datasets. Quantitative Analyst Google July 2012  –  May 2014  (1 year 11 months) Mountain View, CA Forecasting, building models and scripting in R, building dashboard, query and analyze large datasets. Graduate Student Instructor Department of Statistics, UC Berkeley January 2012  –  May 2012  (5 months) Berkeley, CA Statistics 2: Introduction to Statistics Graduate Student Instructor Department of Statistics, UC Berkeley January 2012  –  May 2012  (5 months) Berkeley, CA Statistics 2: Introduction to Statistics Graduate Student Instructor Haas School of Business August 2011  –  December 2011  (5 months) Berkeley, CA Analytic Decision Modeling Using Spreadsheets Graduate Student Instructor Haas School of Business August 2011  –  December 2011  (5 months) Berkeley, CA Analytic Decision Modeling Using Spreadsheets Decision Support Engineering Analyst Intern Google June 2011  –  August 2011  (3 months) Mountain View, California •Oversaw the development of the internal metrics reporting dashboard – platform research, data hierarchy design, data field property design, functionality and user interface. \n \n•Built a Burn Rate Model (Excel) that visualizes computing resource consumption rates derived from dynamic data. \n \n•Performed ad-hoc reports and analysis on computing resource usage data with an internal language similar to SQL. \n \n•Collaborated cross-functionally (SWEs/PM) to design and create new KPIs based on requirements from Director/PM. \n \n•Assisted Team Liquidity with compute-budget initiatives such as inorganic growth forecasting, budget planning, price re-indexing and network chargeback implementation. Delivered a weekly report and presentation on the project status. Decision Support Engineering Analyst Intern Google June 2011  –  August 2011  (3 months) Mountain View, California •Oversaw the development of the internal metrics reporting dashboard – platform research, data hierarchy design, data field property design, functionality and user interface. \n \n•Built a Burn Rate Model (Excel) that visualizes computing resource consumption rates derived from dynamic data. \n \n•Performed ad-hoc reports and analysis on computing resource usage data with an internal language similar to SQL. \n \n•Collaborated cross-functionally (SWEs/PM) to design and create new KPIs based on requirements from Director/PM. \n \n•Assisted Team Liquidity with compute-budget initiatives such as inorganic growth forecasting, budget planning, price re-indexing and network chargeback implementation. Delivered a weekly report and presentation on the project status. Database Management Associate Haas School of Business December 2009  –  May 2011  (1 year 6 months) Berkeley, CA •Designed and implemented Excel applications to automate cleaning and to format standardization processes for raw data. \n \n•Assisted Haas MBA directors in providing accurate periodic dashboard reports on student salary and offer statistics.  \n \n•Provided business school ranking metrics for magazines like US News and World Report and BusinessWeek. \n \n•Monitored the overall integrity of the database for job offers received by MBA students at Haas. Database Management Associate Haas School of Business December 2009  –  May 2011  (1 year 6 months) Berkeley, CA •Designed and implemented Excel applications to automate cleaning and to format standardization processes for raw data. \n \n•Assisted Haas MBA directors in providing accurate periodic dashboard reports on student salary and offer statistics.  \n \n•Provided business school ranking metrics for magazines like US News and World Report and BusinessWeek. \n \n•Monitored the overall integrity of the database for job offers received by MBA students at Haas. IT Engineer Intern Cisco Systems May 2010  –  August 2010  (4 months) San Jose, CA •Created over 40 pages of functional and technical design documents for various software development projects. \n \n•Worked cross-functionally within Cisco IT to ¬assist in creating network solutions for external and internal clients of Cisco. \n \n•Participated in pilot programs for new technologies and debriefed to various Cisco engineering teams in India and USA. IT Engineer Intern Cisco Systems May 2010  –  August 2010  (4 months) San Jose, CA •Created over 40 pages of functional and technical design documents for various software development projects. \n \n•Worked cross-functionally within Cisco IT to ¬assist in creating network solutions for external and internal clients of Cisco. \n \n•Participated in pilot programs for new technologies and debriefed to various Cisco engineering teams in India and USA. Languages English Professional working proficiency Mandarin Native or bilingual proficiency English Professional working proficiency Mandarin Native or bilingual proficiency English Professional working proficiency Mandarin Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills SQL Data Analysis Analysis R Python VBA Statistics Project Management Statistical Modeling Relational Databases Excel-based Application... Access Databases Big Data Analytics Skills  SQL Data Analysis Analysis R Python VBA Statistics Project Management Statistical Modeling Relational Databases Excel-based Application... Access Databases Big Data Analytics SQL Data Analysis Analysis R Python VBA Statistics Project Management Statistical Modeling Relational Databases Excel-based Application... Access Databases Big Data Analytics SQL Data Analysis Analysis R Python VBA Statistics Project Management Statistical Modeling Relational Databases Excel-based Application... Access Databases Big Data Analytics Education University of California, Berkeley Master of Science (M.S.),  Industrial Engineering & Operations Research 2011  – 2012 Activities and Societies:  Koinonia ,  Graduate Student Instructor for UGBA 104 ,  Graduate Student Instructor for Statistics 2 University of California, Berkeley Bachelor of Science (B.S.),  Industrial Engineering & Operations Research 2007  – 2011 Activities and Societies:  Koinonia Alhambra High School 2003  – 2007 Activities and Societies:  Academy of Future Educators ,  Freshman Basketball Team Chung Cheng High Main 2002  – 2003 University of California, Berkeley Master of Science (M.S.),  Industrial Engineering & Operations Research 2011  – 2012 Activities and Societies:  Koinonia ,  Graduate Student Instructor for UGBA 104 ,  Graduate Student Instructor for Statistics 2 University of California, Berkeley Master of Science (M.S.),  Industrial Engineering & Operations Research 2011  – 2012 Activities and Societies:  Koinonia ,  Graduate Student Instructor for UGBA 104 ,  Graduate Student Instructor for Statistics 2 University of California, Berkeley Master of Science (M.S.),  Industrial Engineering & Operations Research 2011  – 2012 Activities and Societies:  Koinonia ,  Graduate Student Instructor for UGBA 104 ,  Graduate Student Instructor for Statistics 2 University of California, Berkeley Bachelor of Science (B.S.),  Industrial Engineering & Operations Research 2007  – 2011 Activities and Societies:  Koinonia University of California, Berkeley Bachelor of Science (B.S.),  Industrial Engineering & Operations Research 2007  – 2011 Activities and Societies:  Koinonia University of California, Berkeley Bachelor of Science (B.S.),  Industrial Engineering & Operations Research 2007  – 2011 Activities and Societies:  Koinonia Alhambra High School 2003  – 2007 Activities and Societies:  Academy of Future Educators ,  Freshman Basketball Team Alhambra High School 2003  – 2007 Activities and Societies:  Academy of Future Educators ,  Freshman Basketball Team Alhambra High School 2003  – 2007 Activities and Societies:  Academy of Future Educators ,  Freshman Basketball Team Chung Cheng High Main 2002  – 2003 Chung Cheng High Main 2002  – 2003 Chung Cheng High Main 2002  – 2003 Honors & Awards Additional Honors & Awards 2nd Place in IIE Western Region Paper Competition, Feb 2011 Additional Honors & Awards 2nd Place in IIE Western Region Paper Competition, Feb 2011 Additional Honors & Awards 2nd Place in IIE Western Region Paper Competition, Feb 2011 Additional Honors & Awards 2nd Place in IIE Western Region Paper Competition, Feb 2011 ", "Summary Specialties:Product Management, Product Marketing, Engineering, Search Engines, Government Liaison, Negotiations Summary Specialties:Product Management, Product Marketing, Engineering, Search Engines, Government Liaison, Negotiations Specialties:Product Management, Product Marketing, Engineering, Search Engines, Government Liaison, Negotiations Specialties:Product Management, Product Marketing, Engineering, Search Engines, Government Liaison, Negotiations Experience Product Manager, Core Growth Facebook July 2014  – Present (1 year 2 months) Menlo Park Senior Product Manager, Strategic Growth Markets Adobe March 2012  –  July 2014  (2 years 5 months) International market development with focus on Middle East & North Africa, India / SE Asia, Turkey and other exciting new markets! Product Manager Adobe Systems March 2010  –  March 2012  (2 years 1 month) Decision Support Engineering Analyst Google, Inc. February 2006  –  March 2010  (4 years 2 months) - Led search quality initiatives for 18 countries in the Middle-East and North Africa \n- Formulated business strategies and portfolio to improve users’ search and products’ experience \n- Improved search quality for BiDi languages: Arabic, Persian, Urdu & Hebrew \n- Defined country-specific products’ features and worked closely with engineering and product development to drive execution  \n- Provided recommendations to senior executives on products’ issues and market opportunities \n- Reported on search market trends and on steps to maintain Google’s competitive edge in this area \n- Spear-headed usability studies in the MENA region, reported findings and proposed corrective actions and enhancements \n- Consulted with engineering, products teams, and region country managers \n- Hired and managed well qualified search intelligence networks and analyzing reported data \n- Collaborated with Marketing, PR and Market Research teams on marketing events and studies \n- Launched Arabic edition of iGoogle, developed gadgets and retrieved RSS feeds from 15 locales \n- Developed algorithms to classify web documents according to the detected languages \n- Arabic Gmail: Addressed translation and functionality issues, suggested changes to improve product \n- Arabic Google News: Participated in testing and evaluating the product before launch Product Manager, Arabic Knol Google, Inc February 2006  –  March 2010  (4 years 2 months) - Advised senior executives on Arabic market opportunities and kicked off a Google Arabic Content Initiative  \n- Defined the product vision, recruited and worked with engineers on technical and Arabic UX requirements \n- Coordinated engineering, product management, marketing, legal and PR teams and prioritized the workflow \n- Led Arabic product's implementation and launched Knol in Arabic as the 1st international language to launch \n- Analyzed users' feedback, translated issues into feature requests, triaged bugs and followed until execution  \n- Established networks, partnerships and government relationships in top priority Arabic markets \n- Recruited, motivated and managed 500 Arab volunteers and ran region-wide knowledge sharing challenges \n- Trained the trainers, demoed the product and features to students and organizations' leadership \n- Conducted 50+ press and media interviews resulting in over 120 news pieces and shows reaching 4M users \n- Raised funds and sponsorship from governments and businessmen associations in Saudi Arabia and Egypt \n- Championed documentation throughout the project TA, Computer Science The American University February 2003  –  January 2005  (2 years) - Held lab sessions for introductory courses, assisted students in C++ and Assembly Lang. problems \n- Taught problem solving techniques, assisted in troubleshooting and in solving technical problems Product Manager ShopLink 2004  –  2005  (1 year) - Worked in a fast-paced startup environment on the development of an online shopping application  \n- Designed the product and identified essential features, in a team of two, and led implementation \n- Designed Use Cases and the ER-schema. Traced and debugged programs in collaboration with developers Product Manager, Core Growth Facebook July 2014  – Present (1 year 2 months) Menlo Park Product Manager, Core Growth Facebook July 2014  – Present (1 year 2 months) Menlo Park Senior Product Manager, Strategic Growth Markets Adobe March 2012  –  July 2014  (2 years 5 months) International market development with focus on Middle East & North Africa, India / SE Asia, Turkey and other exciting new markets! Senior Product Manager, Strategic Growth Markets Adobe March 2012  –  July 2014  (2 years 5 months) International market development with focus on Middle East & North Africa, India / SE Asia, Turkey and other exciting new markets! Product Manager Adobe Systems March 2010  –  March 2012  (2 years 1 month) Product Manager Adobe Systems March 2010  –  March 2012  (2 years 1 month) Decision Support Engineering Analyst Google, Inc. February 2006  –  March 2010  (4 years 2 months) - Led search quality initiatives for 18 countries in the Middle-East and North Africa \n- Formulated business strategies and portfolio to improve users’ search and products’ experience \n- Improved search quality for BiDi languages: Arabic, Persian, Urdu & Hebrew \n- Defined country-specific products’ features and worked closely with engineering and product development to drive execution  \n- Provided recommendations to senior executives on products’ issues and market opportunities \n- Reported on search market trends and on steps to maintain Google’s competitive edge in this area \n- Spear-headed usability studies in the MENA region, reported findings and proposed corrective actions and enhancements \n- Consulted with engineering, products teams, and region country managers \n- Hired and managed well qualified search intelligence networks and analyzing reported data \n- Collaborated with Marketing, PR and Market Research teams on marketing events and studies \n- Launched Arabic edition of iGoogle, developed gadgets and retrieved RSS feeds from 15 locales \n- Developed algorithms to classify web documents according to the detected languages \n- Arabic Gmail: Addressed translation and functionality issues, suggested changes to improve product \n- Arabic Google News: Participated in testing and evaluating the product before launch Decision Support Engineering Analyst Google, Inc. February 2006  –  March 2010  (4 years 2 months) - Led search quality initiatives for 18 countries in the Middle-East and North Africa \n- Formulated business strategies and portfolio to improve users’ search and products’ experience \n- Improved search quality for BiDi languages: Arabic, Persian, Urdu & Hebrew \n- Defined country-specific products’ features and worked closely with engineering and product development to drive execution  \n- Provided recommendations to senior executives on products’ issues and market opportunities \n- Reported on search market trends and on steps to maintain Google’s competitive edge in this area \n- Spear-headed usability studies in the MENA region, reported findings and proposed corrective actions and enhancements \n- Consulted with engineering, products teams, and region country managers \n- Hired and managed well qualified search intelligence networks and analyzing reported data \n- Collaborated with Marketing, PR and Market Research teams on marketing events and studies \n- Launched Arabic edition of iGoogle, developed gadgets and retrieved RSS feeds from 15 locales \n- Developed algorithms to classify web documents according to the detected languages \n- Arabic Gmail: Addressed translation and functionality issues, suggested changes to improve product \n- Arabic Google News: Participated in testing and evaluating the product before launch Product Manager, Arabic Knol Google, Inc February 2006  –  March 2010  (4 years 2 months) - Advised senior executives on Arabic market opportunities and kicked off a Google Arabic Content Initiative  \n- Defined the product vision, recruited and worked with engineers on technical and Arabic UX requirements \n- Coordinated engineering, product management, marketing, legal and PR teams and prioritized the workflow \n- Led Arabic product's implementation and launched Knol in Arabic as the 1st international language to launch \n- Analyzed users' feedback, translated issues into feature requests, triaged bugs and followed until execution  \n- Established networks, partnerships and government relationships in top priority Arabic markets \n- Recruited, motivated and managed 500 Arab volunteers and ran region-wide knowledge sharing challenges \n- Trained the trainers, demoed the product and features to students and organizations' leadership \n- Conducted 50+ press and media interviews resulting in over 120 news pieces and shows reaching 4M users \n- Raised funds and sponsorship from governments and businessmen associations in Saudi Arabia and Egypt \n- Championed documentation throughout the project Product Manager, Arabic Knol Google, Inc February 2006  –  March 2010  (4 years 2 months) - Advised senior executives on Arabic market opportunities and kicked off a Google Arabic Content Initiative  \n- Defined the product vision, recruited and worked with engineers on technical and Arabic UX requirements \n- Coordinated engineering, product management, marketing, legal and PR teams and prioritized the workflow \n- Led Arabic product's implementation and launched Knol in Arabic as the 1st international language to launch \n- Analyzed users' feedback, translated issues into feature requests, triaged bugs and followed until execution  \n- Established networks, partnerships and government relationships in top priority Arabic markets \n- Recruited, motivated and managed 500 Arab volunteers and ran region-wide knowledge sharing challenges \n- Trained the trainers, demoed the product and features to students and organizations' leadership \n- Conducted 50+ press and media interviews resulting in over 120 news pieces and shows reaching 4M users \n- Raised funds and sponsorship from governments and businessmen associations in Saudi Arabia and Egypt \n- Championed documentation throughout the project TA, Computer Science The American University February 2003  –  January 2005  (2 years) - Held lab sessions for introductory courses, assisted students in C++ and Assembly Lang. problems \n- Taught problem solving techniques, assisted in troubleshooting and in solving technical problems TA, Computer Science The American University February 2003  –  January 2005  (2 years) - Held lab sessions for introductory courses, assisted students in C++ and Assembly Lang. problems \n- Taught problem solving techniques, assisted in troubleshooting and in solving technical problems Product Manager ShopLink 2004  –  2005  (1 year) - Worked in a fast-paced startup environment on the development of an online shopping application  \n- Designed the product and identified essential features, in a team of two, and led implementation \n- Designed Use Cases and the ER-schema. Traced and debugged programs in collaboration with developers Product Manager ShopLink 2004  –  2005  (1 year) - Worked in a fast-paced startup environment on the development of an online shopping application  \n- Designed the product and identified essential features, in a team of two, and led implementation \n- Designed Use Cases and the ER-schema. Traced and debugged programs in collaboration with developers Languages Arabic Arabic Arabic Skills Product Management Product Marketing Negotiation Search Engine Engineering Mobile Applications Mobile Devices User Experience Cloud Computing Agile Methodologies Agile Project Management Enterprise Software Software Project... Analytics Cross-functional Team... Program Management Management Leadership Market Research Search Engines Product Development Start-ups Strategy Business Strategy Competitive Analysis E-commerce Testing Internationalization Marketing Analysis Distributed Systems Scalability Software Development Strategic Partnerships Go-to-market Strategy CRM Emerging Markets Product Requirements See 23+     See less Skills  Product Management Product Marketing Negotiation Search Engine Engineering Mobile Applications Mobile Devices User Experience Cloud Computing Agile Methodologies Agile Project Management Enterprise Software Software Project... Analytics Cross-functional Team... Program Management Management Leadership Market Research Search Engines Product Development Start-ups Strategy Business Strategy Competitive Analysis E-commerce Testing Internationalization Marketing Analysis Distributed Systems Scalability Software Development Strategic Partnerships Go-to-market Strategy CRM Emerging Markets Product Requirements See 23+     See less Product Management Product Marketing Negotiation Search Engine Engineering Mobile Applications Mobile Devices User Experience Cloud Computing Agile Methodologies Agile Project Management Enterprise Software Software Project... Analytics Cross-functional Team... Program Management Management Leadership Market Research Search Engines Product Development Start-ups Strategy Business Strategy Competitive Analysis E-commerce Testing Internationalization Marketing Analysis Distributed Systems Scalability Software Development Strategic Partnerships Go-to-market Strategy CRM Emerging Markets Product Requirements See 23+     See less Product Management Product Marketing Negotiation Search Engine Engineering Mobile Applications Mobile Devices User Experience Cloud Computing Agile Methodologies Agile Project Management Enterprise Software Software Project... Analytics Cross-functional Team... Program Management Management Leadership Market Research Search Engines Product Development Start-ups Strategy Business Strategy Competitive Analysis E-commerce Testing Internationalization Marketing Analysis Distributed Systems Scalability Software Development Strategic Partnerships Go-to-market Strategy CRM Emerging Markets Product Requirements See 23+     See less Education Stanford University Stanford Advanced Project Management,  Graduate Management Classes 2006  – 2008 - Managing Global Initiatives \n- Converting Strategy into Action \n- Leading Effective Teams \n- Leadership for Strategic Execution  \n- Mastering the Project Portfolio \n- Decision Making in Organizations\t \n- Managing Without Authority \n- Public Speaking, Romancing the Room The American University in Cairo Bachelors of Science,  Computer Science ,  Minor: Business Administration 1999  – 2005 National Team, Equestrian and Polo, Egypt: Won Federal Cup in show jumping, trained riders and horses American University of Beirut Study Abroad,  Computer Science 2001  – 2002 - Recruited 150 members, launched opening ceremony, organized activities, trips and raised $7000  \n- Participated in TV shows for world peace and public policy including a one hour live discussion on Al-Jazeera news network with the late president Yasser Arrafat, and American diplomats Activities and Societies:  President/Founder ,  Egyptian Cultural Club ,  American University of California, Los Angeles Study Abroad,  Computer Science ,  Minor: Business Administration 2001  – 2001 Stanford University Stanford Advanced Project Management,  Graduate Management Classes 2006  – 2008 - Managing Global Initiatives \n- Converting Strategy into Action \n- Leading Effective Teams \n- Leadership for Strategic Execution  \n- Mastering the Project Portfolio \n- Decision Making in Organizations\t \n- Managing Without Authority \n- Public Speaking, Romancing the Room Stanford University Stanford Advanced Project Management,  Graduate Management Classes 2006  – 2008 - Managing Global Initiatives \n- Converting Strategy into Action \n- Leading Effective Teams \n- Leadership for Strategic Execution  \n- Mastering the Project Portfolio \n- Decision Making in Organizations\t \n- Managing Without Authority \n- Public Speaking, Romancing the Room Stanford University Stanford Advanced Project Management,  Graduate Management Classes 2006  – 2008 - Managing Global Initiatives \n- Converting Strategy into Action \n- Leading Effective Teams \n- Leadership for Strategic Execution  \n- Mastering the Project Portfolio \n- Decision Making in Organizations\t \n- Managing Without Authority \n- Public Speaking, Romancing the Room The American University in Cairo Bachelors of Science,  Computer Science ,  Minor: Business Administration 1999  – 2005 National Team, Equestrian and Polo, Egypt: Won Federal Cup in show jumping, trained riders and horses The American University in Cairo Bachelors of Science,  Computer Science ,  Minor: Business Administration 1999  – 2005 National Team, Equestrian and Polo, Egypt: Won Federal Cup in show jumping, trained riders and horses The American University in Cairo Bachelors of Science,  Computer Science ,  Minor: Business Administration 1999  – 2005 National Team, Equestrian and Polo, Egypt: Won Federal Cup in show jumping, trained riders and horses American University of Beirut Study Abroad,  Computer Science 2001  – 2002 - Recruited 150 members, launched opening ceremony, organized activities, trips and raised $7000  \n- Participated in TV shows for world peace and public policy including a one hour live discussion on Al-Jazeera news network with the late president Yasser Arrafat, and American diplomats Activities and Societies:  President/Founder ,  Egyptian Cultural Club ,  American American University of Beirut Study Abroad,  Computer Science 2001  – 2002 - Recruited 150 members, launched opening ceremony, organized activities, trips and raised $7000  \n- Participated in TV shows for world peace and public policy including a one hour live discussion on Al-Jazeera news network with the late president Yasser Arrafat, and American diplomats Activities and Societies:  President/Founder ,  Egyptian Cultural Club ,  American American University of Beirut Study Abroad,  Computer Science 2001  – 2002 - Recruited 150 members, launched opening ceremony, organized activities, trips and raised $7000  \n- Participated in TV shows for world peace and public policy including a one hour live discussion on Al-Jazeera news network with the late president Yasser Arrafat, and American diplomats Activities and Societies:  President/Founder ,  Egyptian Cultural Club ,  American University of California, Los Angeles Study Abroad,  Computer Science ,  Minor: Business Administration 2001  – 2001 University of California, Los Angeles Study Abroad,  Computer Science ,  Minor: Business Administration 2001  – 2001 University of California, Los Angeles Study Abroad,  Computer Science ,  Minor: Business Administration 2001  – 2001 Honors & Awards Additional Honors & Awards - Google, Inc. EMG Award 2007 (Executive Management Group Award) \n- Google, Inc. Spot Bonus & Excellence Certificate for outstanding performance \n- Google, Inc. Peer Bonus (2 times: 2008, 2007) \n- Arab Businessmen Association Award, Assiut, Egypt  \n- Outstanding Academic Achievement Award, The American University in Cairo (2 times) \n- Outstanding Extracurricular Activities Award, American University of Beirut \n- National Championship Award, Equestrian and Polo, Egypt Additional Honors & Awards - Google, Inc. EMG Award 2007 (Executive Management Group Award) \n- Google, Inc. Spot Bonus & Excellence Certificate for outstanding performance \n- Google, Inc. Peer Bonus (2 times: 2008, 2007) \n- Arab Businessmen Association Award, Assiut, Egypt  \n- Outstanding Academic Achievement Award, The American University in Cairo (2 times) \n- Outstanding Extracurricular Activities Award, American University of Beirut \n- National Championship Award, Equestrian and Polo, Egypt Additional Honors & Awards - Google, Inc. EMG Award 2007 (Executive Management Group Award) \n- Google, Inc. Spot Bonus & Excellence Certificate for outstanding performance \n- Google, Inc. Peer Bonus (2 times: 2008, 2007) \n- Arab Businessmen Association Award, Assiut, Egypt  \n- Outstanding Academic Achievement Award, The American University in Cairo (2 times) \n- Outstanding Extracurricular Activities Award, American University of Beirut \n- National Championship Award, Equestrian and Polo, Egypt Additional Honors & Awards - Google, Inc. EMG Award 2007 (Executive Management Group Award) \n- Google, Inc. Spot Bonus & Excellence Certificate for outstanding performance \n- Google, Inc. Peer Bonus (2 times: 2008, 2007) \n- Arab Businessmen Association Award, Assiut, Egypt  \n- Outstanding Academic Achievement Award, The American University in Cairo (2 times) \n- Outstanding Extracurricular Activities Award, American University of Beirut \n- National Championship Award, Equestrian and Polo, Egypt ", "Summary Experienced professional in predictive analytics & optimization. Specialties:Solid background in Statistics, Machine Learning, Data Mining and Optimization. \nProficient in JAVA, R, PERL,Oracle, Hadoop, Matlab. Summary Experienced professional in predictive analytics & optimization. Specialties:Solid background in Statistics, Machine Learning, Data Mining and Optimization. \nProficient in JAVA, R, PERL,Oracle, Hadoop, Matlab. Experienced professional in predictive analytics & optimization. Specialties:Solid background in Statistics, Machine Learning, Data Mining and Optimization. \nProficient in JAVA, R, PERL,Oracle, Hadoop, Matlab. Experienced professional in predictive analytics & optimization. Specialties:Solid background in Statistics, Machine Learning, Data Mining and Optimization. \nProficient in JAVA, R, PERL,Oracle, Hadoop, Matlab. Experience Senior Decision Support Engineering Analyst Google June 2011  – Present (4 years 3 months) Mountain View Ads Metrics Team (AdWords Quality) Staff Applied Researcher eBay May 2010  –  July 2011  (1 year 3 months) Query Attributes Demand Mining. \n \nQuery Classification. \n \nRanking Feature Research and Development. Senior Scientist Shopzilla July 2009  –  April 2010  (10 months) Product Type Classification System \n \nKeyword Bidding Optimization for Search Engine Marketing \n \nDeal Ranking Senior Scientist NetSeer Inc June 2007  –  July 2009  (2 years 2 months) Core Conceptual Search Technology: Knowledge Bank Construction and Application Senior Decision Support Engineering Analyst Google June 2011  – Present (4 years 3 months) Mountain View Ads Metrics Team (AdWords Quality) Senior Decision Support Engineering Analyst Google June 2011  – Present (4 years 3 months) Mountain View Ads Metrics Team (AdWords Quality) Staff Applied Researcher eBay May 2010  –  July 2011  (1 year 3 months) Query Attributes Demand Mining. \n \nQuery Classification. \n \nRanking Feature Research and Development. Staff Applied Researcher eBay May 2010  –  July 2011  (1 year 3 months) Query Attributes Demand Mining. \n \nQuery Classification. \n \nRanking Feature Research and Development. Senior Scientist Shopzilla July 2009  –  April 2010  (10 months) Product Type Classification System \n \nKeyword Bidding Optimization for Search Engine Marketing \n \nDeal Ranking Senior Scientist Shopzilla July 2009  –  April 2010  (10 months) Product Type Classification System \n \nKeyword Bidding Optimization for Search Engine Marketing \n \nDeal Ranking Senior Scientist NetSeer Inc June 2007  –  July 2009  (2 years 2 months) Core Conceptual Search Technology: Knowledge Bank Construction and Application Senior Scientist NetSeer Inc June 2007  –  July 2009  (2 years 2 months) Core Conceptual Search Technology: Knowledge Bank Construction and Application Education University of California, Los Angeles MS,  Statistics University of California, Los Angeles MS, Ph.D.,  Electrical Engineering Gene Regulatory Network Exploration  \n \nInformation Processing Principles Identification in Mammalian Retinal Ganglion Cells University of California, Los Angeles MS,  Statistics University of California, Los Angeles MS,  Statistics University of California, Los Angeles MS,  Statistics University of California, Los Angeles MS, Ph.D.,  Electrical Engineering Gene Regulatory Network Exploration  \n \nInformation Processing Principles Identification in Mammalian Retinal Ganglion Cells University of California, Los Angeles MS, Ph.D.,  Electrical Engineering Gene Regulatory Network Exploration  \n \nInformation Processing Principles Identification in Mammalian Retinal Ganglion Cells University of California, Los Angeles MS, Ph.D.,  Electrical Engineering Gene Regulatory Network Exploration  \n \nInformation Processing Principles Identification in Mammalian Retinal Ganglion Cells ", "Summary I am currently studying towards my doctoral degree. I work at the intersection of statistics and machine learning, focusing primarily on high-dimensional graphical models. Summary I am currently studying towards my doctoral degree. I work at the intersection of statistics and machine learning, focusing primarily on high-dimensional graphical models. I am currently studying towards my doctoral degree. I work at the intersection of statistics and machine learning, focusing primarily on high-dimensional graphical models. I am currently studying towards my doctoral degree. I work at the intersection of statistics and machine learning, focusing primarily on high-dimensional graphical models. Experience Decision Support Engineering Analyst Intern Google June 2015  – Present (3 months) Greater Seattle Area Quantitative Research Associate Intern J.P. Morgan June 2014  –  September 2014  (4 months) Greater New York City Area Statistical Analyst Intern StatDNA June 2013  –  September 2013  (4 months) Greater Chicago Area Decision Support Engineering Analyst Intern Google June 2015  – Present (3 months) Greater Seattle Area Decision Support Engineering Analyst Intern Google June 2015  – Present (3 months) Greater Seattle Area Quantitative Research Associate Intern J.P. Morgan June 2014  –  September 2014  (4 months) Greater New York City Area Quantitative Research Associate Intern J.P. Morgan June 2014  –  September 2014  (4 months) Greater New York City Area Statistical Analyst Intern StatDNA June 2013  –  September 2013  (4 months) Greater Chicago Area Statistical Analyst Intern StatDNA June 2013  –  September 2013  (4 months) Greater Chicago Area Skills C/C++ R Python SQL Matlab Perl LaTeX Linux Skills  C/C++ R Python SQL Matlab Perl LaTeX Linux C/C++ R Python SQL Matlab Perl LaTeX Linux C/C++ R Python SQL Matlab Perl LaTeX Linux Education University of Chicago Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 Chinese Academy of Sciences Master of Science (M.S.),  Bioinformatics 2008  – 2011 Nankai University Bachelor of Science (B.S.),  Mathematics 2004  – 2008 University of Chicago Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 University of Chicago Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 University of Chicago Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 Chinese Academy of Sciences Master of Science (M.S.),  Bioinformatics 2008  – 2011 Chinese Academy of Sciences Master of Science (M.S.),  Bioinformatics 2008  – 2011 Chinese Academy of Sciences Master of Science (M.S.),  Bioinformatics 2008  – 2011 Nankai University Bachelor of Science (B.S.),  Mathematics 2004  – 2008 Nankai University Bachelor of Science (B.S.),  Mathematics 2004  – 2008 Nankai University Bachelor of Science (B.S.),  Mathematics 2004  – 2008 Honors & Awards ", "Experience Decision Support Engineering Analyst Google June 2010  – Present (5 years 3 months) Decision Support Engineering Analyst Google June 2010  – Present (5 years 3 months) Decision Support Engineering Analyst Google June 2010  – Present (5 years 3 months) Skills Skills     Education The University of British Columbia PhD,  Statistics 2002  – 2009 The University of British Columbia PhD,  Statistics 2002  – 2009 The University of British Columbia PhD,  Statistics 2002  – 2009 The University of British Columbia PhD,  Statistics 2002  – 2009 ", "Experience Decision Support Engineering Analyst Intern Google June 2015  – Present (3 months) Mountain View, CA IGERT-BDSS Trainee Penn State University September 2013  – Present (2 years) State College Statistician Intern CIEO at United Airlines May 2013  –  August 2013  (4 months) Chicago, IL Teaching Assistant Penn State University September 2011  –  May 2013  (1 year 9 months) State College, Pennsylvania Area Research Assistant The Methodology Center, Penn State University June 2012  –  August 2012  (3 months) State College, Pennsylvania Area Decision Support Engineering Analyst Intern Google June 2015  – Present (3 months) Mountain View, CA Decision Support Engineering Analyst Intern Google June 2015  – Present (3 months) Mountain View, CA IGERT-BDSS Trainee Penn State University September 2013  – Present (2 years) State College IGERT-BDSS Trainee Penn State University September 2013  – Present (2 years) State College Statistician Intern CIEO at United Airlines May 2013  –  August 2013  (4 months) Chicago, IL Statistician Intern CIEO at United Airlines May 2013  –  August 2013  (4 months) Chicago, IL Teaching Assistant Penn State University September 2011  –  May 2013  (1 year 9 months) State College, Pennsylvania Area Teaching Assistant Penn State University September 2011  –  May 2013  (1 year 9 months) State College, Pennsylvania Area Research Assistant The Methodology Center, Penn State University June 2012  –  August 2012  (3 months) State College, Pennsylvania Area Research Assistant The Methodology Center, Penn State University June 2012  –  August 2012  (3 months) State College, Pennsylvania Area Skills LaTeX Data Analysis Statistics R SAS Statistical Modeling Research Skills  LaTeX Data Analysis Statistics R SAS Statistical Modeling Research LaTeX Data Analysis Statistics R SAS Statistical Modeling Research LaTeX Data Analysis Statistics R SAS Statistical Modeling Research Education Penn State University Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 Fudan University Bachelor's degree,  Statistics 2007  – 2011 Penn State University Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 Penn State University Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 Penn State University Doctor of Philosophy (Ph.D.),  Statistics 2011  – 2016 Fudan University Bachelor's degree,  Statistics 2007  – 2011 Fudan University Bachelor's degree,  Statistics 2007  – 2011 Fudan University Bachelor's degree,  Statistics 2007  – 2011 ", "Experience Assistant Professor of Statistics & Public Policy Carnegie Mellon University - H. John Heinz III College August 2014  – Present (1 year 1 month) Pittsburgh Decision Support Engineering Analyst Intern Google June 2011  –  September 2011  (4 months) Assistant Professor of Statistics & Public Policy Carnegie Mellon University - H. John Heinz III College August 2014  – Present (1 year 1 month) Pittsburgh Assistant Professor of Statistics & Public Policy Carnegie Mellon University - H. John Heinz III College August 2014  – Present (1 year 1 month) Pittsburgh Decision Support Engineering Analyst Intern Google June 2011  –  September 2011  (4 months) Decision Support Engineering Analyst Intern Google June 2011  –  September 2011  (4 months) Education Stanford University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2014 University of Toronto - University College Bachelor of Science (BSc),  Mathematics and Statistics 2005  – 2009 Stanford University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2014 Stanford University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2014 Stanford University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2014 University of Toronto - University College Bachelor of Science (BSc),  Mathematics and Statistics 2005  – 2009 University of Toronto - University College Bachelor of Science (BSc),  Mathematics and Statistics 2005  – 2009 University of Toronto - University College Bachelor of Science (BSc),  Mathematics and Statistics 2005  – 2009 ", "Experience College Fellow Harvard University June 2013  – Present (2 years 3 months) Cambridge, MA •\tTaught and co-taught three courses in statistics, including a serious introduction to statistical inference with linear models and related methods, a tutorial that introduces college juniors to reading, writing, presenting, and research in statistics, and a graduate seminar where students explore contributions of Bradley Efron to Statistics. \n•\tManaged classes that ranged from 14 to over 100 students, developed syllabus, lectures, and homework assignments. \n•\tServed on the Masters Degree admissions committee. \n•\tAdvised three undergraduate students on their research projects. Biostatistics Research Consultant NYU School of Medicine, Center for Clinical Research June 2010  – Present (5 years 3 months) NYC (telecommute, part-time) Consulted on more than a dozen biomedical research projects at different stages: design, protocol development, power calculation, data cleaning, statistical analyses and interpretation, writing manuscripts. Several collaborations resulted in publications. Statistical Consultant Biogen Idec 2014  –  2014  (less than a year) Teaching Fellow Harvard University June 2008  –  May 2013  (5 years) Cambridge, MA - Taught 9 distinct courses in Statistics Department as well as at Kennedy School of Government and Massachusetts Institute of Technology.  \n- Class sizes ranged from 20 to 200 and course levels varied from introductory statistics to advanced methods, including Stochastic Methods and Causal Inference.  \n- Developed new recitation materials for each course; for 7 courses was the sole teaching fellow. Statistical Consultant Concentric June 2011  –  February 2012  (9 months) Cambridge, MA - Developed a statistical model to predict users’ purchase propensity based on their temporal exposure to online advertising and offline media. Departmental Teaching Fellow Harvard University Statistics Department September 2010  –  June 2011  (10 months) Cambridge, MA - Led a year-long teaching practicum course; held microteaching sessions in the department; organized social and bonding events to maintain communication between students and faculty.  \n- Designed and implemented a classroom experiment to test whether video projects are more effective than written projects in statistics, conducted analysis and prepared a report. \n- Solely planned and organized a Third Annual Departmental Retreat on “Professional Development”, a day-long event for 50 students and faculty members that included career panel discussions, alumni speakers, and various networking activities. Decision Support Engineering Analyst Intern Google June 2009  –  August 2009  (3 months) New York City, NY - Collaborated with Google research team on expanding a model for estimating casual effect of advertising campaigns. \n- Performed statistical analysis and developed methods to evaluate the change of the effectiveness of online ad campaigns over time. Sales Representative PBXpress Communications, Inc. July 2005  –  October 2006  (1 year 4 months) Coquitlam, BC, Canada - Communicated with potential customers regarding products and services in a leading international VoIP company specializing in software development.  \n- Took the lead in negotiation processes and coordinated retail sales as well as resellers and OEM clients.  \n- Participated in trade shows as a company representative in the United States and Europe. College Fellow Harvard University June 2013  – Present (2 years 3 months) Cambridge, MA •\tTaught and co-taught three courses in statistics, including a serious introduction to statistical inference with linear models and related methods, a tutorial that introduces college juniors to reading, writing, presenting, and research in statistics, and a graduate seminar where students explore contributions of Bradley Efron to Statistics. \n•\tManaged classes that ranged from 14 to over 100 students, developed syllabus, lectures, and homework assignments. \n•\tServed on the Masters Degree admissions committee. \n•\tAdvised three undergraduate students on their research projects. College Fellow Harvard University June 2013  – Present (2 years 3 months) Cambridge, MA •\tTaught and co-taught three courses in statistics, including a serious introduction to statistical inference with linear models and related methods, a tutorial that introduces college juniors to reading, writing, presenting, and research in statistics, and a graduate seminar where students explore contributions of Bradley Efron to Statistics. \n•\tManaged classes that ranged from 14 to over 100 students, developed syllabus, lectures, and homework assignments. \n•\tServed on the Masters Degree admissions committee. \n•\tAdvised three undergraduate students on their research projects. Biostatistics Research Consultant NYU School of Medicine, Center for Clinical Research June 2010  – Present (5 years 3 months) NYC (telecommute, part-time) Consulted on more than a dozen biomedical research projects at different stages: design, protocol development, power calculation, data cleaning, statistical analyses and interpretation, writing manuscripts. Several collaborations resulted in publications. Biostatistics Research Consultant NYU School of Medicine, Center for Clinical Research June 2010  – Present (5 years 3 months) NYC (telecommute, part-time) Consulted on more than a dozen biomedical research projects at different stages: design, protocol development, power calculation, data cleaning, statistical analyses and interpretation, writing manuscripts. Several collaborations resulted in publications. Statistical Consultant Biogen Idec 2014  –  2014  (less than a year) Statistical Consultant Biogen Idec 2014  –  2014  (less than a year) Teaching Fellow Harvard University June 2008  –  May 2013  (5 years) Cambridge, MA - Taught 9 distinct courses in Statistics Department as well as at Kennedy School of Government and Massachusetts Institute of Technology.  \n- Class sizes ranged from 20 to 200 and course levels varied from introductory statistics to advanced methods, including Stochastic Methods and Causal Inference.  \n- Developed new recitation materials for each course; for 7 courses was the sole teaching fellow. Teaching Fellow Harvard University June 2008  –  May 2013  (5 years) Cambridge, MA - Taught 9 distinct courses in Statistics Department as well as at Kennedy School of Government and Massachusetts Institute of Technology.  \n- Class sizes ranged from 20 to 200 and course levels varied from introductory statistics to advanced methods, including Stochastic Methods and Causal Inference.  \n- Developed new recitation materials for each course; for 7 courses was the sole teaching fellow. Statistical Consultant Concentric June 2011  –  February 2012  (9 months) Cambridge, MA - Developed a statistical model to predict users’ purchase propensity based on their temporal exposure to online advertising and offline media. Statistical Consultant Concentric June 2011  –  February 2012  (9 months) Cambridge, MA - Developed a statistical model to predict users’ purchase propensity based on their temporal exposure to online advertising and offline media. Departmental Teaching Fellow Harvard University Statistics Department September 2010  –  June 2011  (10 months) Cambridge, MA - Led a year-long teaching practicum course; held microteaching sessions in the department; organized social and bonding events to maintain communication between students and faculty.  \n- Designed and implemented a classroom experiment to test whether video projects are more effective than written projects in statistics, conducted analysis and prepared a report. \n- Solely planned and organized a Third Annual Departmental Retreat on “Professional Development”, a day-long event for 50 students and faculty members that included career panel discussions, alumni speakers, and various networking activities. Departmental Teaching Fellow Harvard University Statistics Department September 2010  –  June 2011  (10 months) Cambridge, MA - Led a year-long teaching practicum course; held microteaching sessions in the department; organized social and bonding events to maintain communication between students and faculty.  \n- Designed and implemented a classroom experiment to test whether video projects are more effective than written projects in statistics, conducted analysis and prepared a report. \n- Solely planned and organized a Third Annual Departmental Retreat on “Professional Development”, a day-long event for 50 students and faculty members that included career panel discussions, alumni speakers, and various networking activities. Decision Support Engineering Analyst Intern Google June 2009  –  August 2009  (3 months) New York City, NY - Collaborated with Google research team on expanding a model for estimating casual effect of advertising campaigns. \n- Performed statistical analysis and developed methods to evaluate the change of the effectiveness of online ad campaigns over time. Decision Support Engineering Analyst Intern Google June 2009  –  August 2009  (3 months) New York City, NY - Collaborated with Google research team on expanding a model for estimating casual effect of advertising campaigns. \n- Performed statistical analysis and developed methods to evaluate the change of the effectiveness of online ad campaigns over time. Sales Representative PBXpress Communications, Inc. July 2005  –  October 2006  (1 year 4 months) Coquitlam, BC, Canada - Communicated with potential customers regarding products and services in a leading international VoIP company specializing in software development.  \n- Took the lead in negotiation processes and coordinated retail sales as well as resellers and OEM clients.  \n- Participated in trade shows as a company representative in the United States and Europe. Sales Representative PBXpress Communications, Inc. July 2005  –  October 2006  (1 year 4 months) Coquitlam, BC, Canada - Communicated with potential customers regarding products and services in a leading international VoIP company specializing in software development.  \n- Took the lead in negotiation processes and coordinated retail sales as well as resellers and OEM clients.  \n- Participated in trade shows as a company representative in the United States and Europe. Languages English Full professional proficiency Russian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency English Full professional proficiency Russian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Data Analysis Teaching Research Statistical Consulting Mathematical Modeling R Stata Python C/C++ S-Plus LaTeX SQL Processing HTML Statistics Skills  Data Analysis Teaching Research Statistical Consulting Mathematical Modeling R Stata Python C/C++ S-Plus LaTeX SQL Processing HTML Statistics Data Analysis Teaching Research Statistical Consulting Mathematical Modeling R Stata Python C/C++ S-Plus LaTeX SQL Processing HTML Statistics Data Analysis Teaching Research Statistical Consulting Mathematical Modeling R Stata Python C/C++ S-Plus LaTeX SQL Processing HTML Statistics Education Harvard University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2013 Research topics of interests include:  \n- Sensitivity analysis in empirical studies plagued with missing data; \n- Methods of missing data imputation: classification and evaluation; \n- Pearson families of distributions and their application to Bayesian statistical analysis; Harvard University Master of Arts (MA),  Statistics 2007  – 2009 Coursework included: Generalized Linear Models, Hierarchical Models, Statistical Inference, Stochastic Processes, Bayesian Data Analysis and Computing, Time Series Modeling, Methods for Causal Inference, Missing Data Handling. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Bachelor's degree,  Applied Mathematics and System Analysis & Control , 4.0 2002  – 2006 - Graduated magna cum laude; \n- Dean’s List all semesters; \n- Top 2% among 2006 graduating class in the department. Harvard Business School Harvard Business School Harvard University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2013 Research topics of interests include:  \n- Sensitivity analysis in empirical studies plagued with missing data; \n- Methods of missing data imputation: classification and evaluation; \n- Pearson families of distributions and their application to Bayesian statistical analysis; Harvard University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2013 Research topics of interests include:  \n- Sensitivity analysis in empirical studies plagued with missing data; \n- Methods of missing data imputation: classification and evaluation; \n- Pearson families of distributions and their application to Bayesian statistical analysis; Harvard University Doctor of Philosophy (Ph.D.),  Statistics 2009  – 2013 Research topics of interests include:  \n- Sensitivity analysis in empirical studies plagued with missing data; \n- Methods of missing data imputation: classification and evaluation; \n- Pearson families of distributions and their application to Bayesian statistical analysis; Harvard University Master of Arts (MA),  Statistics 2007  – 2009 Coursework included: Generalized Linear Models, Hierarchical Models, Statistical Inference, Stochastic Processes, Bayesian Data Analysis and Computing, Time Series Modeling, Methods for Causal Inference, Missing Data Handling. Harvard University Master of Arts (MA),  Statistics 2007  – 2009 Coursework included: Generalized Linear Models, Hierarchical Models, Statistical Inference, Stochastic Processes, Bayesian Data Analysis and Computing, Time Series Modeling, Methods for Causal Inference, Missing Data Handling. Harvard University Master of Arts (MA),  Statistics 2007  – 2009 Coursework included: Generalized Linear Models, Hierarchical Models, Statistical Inference, Stochastic Processes, Bayesian Data Analysis and Computing, Time Series Modeling, Methods for Causal Inference, Missing Data Handling. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Bachelor's degree,  Applied Mathematics and System Analysis & Control , 4.0 2002  – 2006 - Graduated magna cum laude; \n- Dean’s List all semesters; \n- Top 2% among 2006 graduating class in the department. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Bachelor's degree,  Applied Mathematics and System Analysis & Control , 4.0 2002  – 2006 - Graduated magna cum laude; \n- Dean’s List all semesters; \n- Top 2% among 2006 graduating class in the department. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Bachelor's degree,  Applied Mathematics and System Analysis & Control , 4.0 2002  – 2006 - Graduated magna cum laude; \n- Dean’s List all semesters; \n- Top 2% among 2006 graduating class in the department. Harvard Business School Harvard Business School Harvard Business School Harvard Business School Harvard Business School Harvard Business School Honors & Awards Derek C. Bok Award for Excellence in the Teaching of Undergraduates Harvard University March 2011 Annual award, issued to 5 recipients university-wide. Derek C. Bok Award for Excellence in the Teaching of Undergraduates Harvard University March 2011 Annual award, issued to 5 recipients university-wide. Derek C. Bok Award for Excellence in the Teaching of Undergraduates Harvard University March 2011 Annual award, issued to 5 recipients university-wide. Derek C. Bok Award for Excellence in the Teaching of Undergraduates Harvard University March 2011 Annual award, issued to 5 recipients university-wide. "]}