{"position": "Associate Business Operations Analyst", "company": "Google", "profiles": ["Experience Finance Operations Analyst Google December 2014  – Present (8 months) San Francisco Bay Area Google Express-Adecco  Assurance Senior Associate McGladrey October 2010  –  November 2014  (4 years 2 months) Greater Boston Area •In charge of audit team through entire audit process; run fieldwork, wrap-up, client interface and financial statement preparation on multiple engagements occurring simultaneously \n•Prepare full financial statements with disclosures in accordance with U.S. GAAP for privately held companies. \n•Provide recommendations to clients regarding their internal control practices and procedures. \n•Responsible for training as well as giving formal and informal feedback and performance reviews to entry level associates \n•Work with teams to hit tight deadlines for accelerated SEC filers Assurance Intern Caturano and Company January 2010  –  March 2010  (3 months) Greater Boston Area Assurance intern at the largest regional public accounting firm in New England. Assistant Cash Up Clerk Lake Champlain Pools June 2003  –  September 2008  (5 years 4 months) Assisted bookkeeper and learned basics of reconciling daily receipts and assembling deposits. Finance Operations Analyst Google December 2014  – Present (8 months) San Francisco Bay Area Google Express-Adecco  Finance Operations Analyst Google December 2014  – Present (8 months) San Francisco Bay Area Google Express-Adecco  Assurance Senior Associate McGladrey October 2010  –  November 2014  (4 years 2 months) Greater Boston Area •In charge of audit team through entire audit process; run fieldwork, wrap-up, client interface and financial statement preparation on multiple engagements occurring simultaneously \n•Prepare full financial statements with disclosures in accordance with U.S. GAAP for privately held companies. \n•Provide recommendations to clients regarding their internal control practices and procedures. \n•Responsible for training as well as giving formal and informal feedback and performance reviews to entry level associates \n•Work with teams to hit tight deadlines for accelerated SEC filers Assurance Senior Associate McGladrey October 2010  –  November 2014  (4 years 2 months) Greater Boston Area •In charge of audit team through entire audit process; run fieldwork, wrap-up, client interface and financial statement preparation on multiple engagements occurring simultaneously \n•Prepare full financial statements with disclosures in accordance with U.S. GAAP for privately held companies. \n•Provide recommendations to clients regarding their internal control practices and procedures. \n•Responsible for training as well as giving formal and informal feedback and performance reviews to entry level associates \n•Work with teams to hit tight deadlines for accelerated SEC filers Assurance Intern Caturano and Company January 2010  –  March 2010  (3 months) Greater Boston Area Assurance intern at the largest regional public accounting firm in New England. Assurance Intern Caturano and Company January 2010  –  March 2010  (3 months) Greater Boston Area Assurance intern at the largest regional public accounting firm in New England. Assistant Cash Up Clerk Lake Champlain Pools June 2003  –  September 2008  (5 years 4 months) Assisted bookkeeper and learned basics of reconciling daily receipts and assembling deposits. Assistant Cash Up Clerk Lake Champlain Pools June 2003  –  September 2008  (5 years 4 months) Assisted bookkeeper and learned basics of reconciling daily receipts and assembling deposits. Skills Top Skills 12 Auditing 2 Assurance 2 Internal Controls 2 Microsoft Office 2 Financial Reporting 2 GAAP 1 Financial Statements 1 Financial Accounting 1 Accounting 1 Financial Analysis Christine also knows about... 1 US GAAP 1 Finance 1 Sarbanes-Oxley Act 1 Microsoft Excel Skills  Top Skills 12 Auditing 2 Assurance 2 Internal Controls 2 Microsoft Office 2 Financial Reporting 2 GAAP 1 Financial Statements 1 Financial Accounting 1 Accounting 1 Financial Analysis Christine also knows about... 1 US GAAP 1 Finance 1 Sarbanes-Oxley Act 1 Microsoft Excel Top Skills 12 Auditing 2 Assurance 2 Internal Controls 2 Microsoft Office 2 Financial Reporting 2 GAAP 1 Financial Statements 1 Financial Accounting 1 Accounting 1 Financial Analysis Christine also knows about... 1 US GAAP 1 Finance 1 Sarbanes-Oxley Act 1 Microsoft Excel Top Skills 12 Auditing 2 Assurance 2 Internal Controls 2 Microsoft Office 2 Financial Reporting 2 GAAP 1 Financial Statements 1 Financial Accounting 1 Accounting 1 Financial Analysis Christine also knows about... 1 US GAAP 1 Finance 1 Sarbanes-Oxley Act 1 Microsoft Excel                     1 US GAAP 1 Finance 1 Sarbanes-Oxley Act 1 Microsoft Excel Education D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 St. Lawrence University BS,  Mathematics 2003  – 2007 D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 St. Lawrence University BS,  Mathematics 2003  – 2007 St. Lawrence University BS,  Mathematics 2003  – 2007 St. Lawrence University BS,  Mathematics 2003  – 2007 ", "Skills Top Skills 11 Analytics 11 Product Management 10 Process Improvement 9 Payroll 8 SaaS 7 Strategy 7 Vendor Management 5 Finance 5 Business Intelligence 5 Cloud Computing Jeff also knows about... 4 Business Process... 3 Business Analysis 3 Cross-functional Team... 2 Enterprise Software Skills  Top Skills 11 Analytics 11 Product Management 10 Process Improvement 9 Payroll 8 SaaS 7 Strategy 7 Vendor Management 5 Finance 5 Business Intelligence 5 Cloud Computing Jeff also knows about... 4 Business Process... 3 Business Analysis 3 Cross-functional Team... 2 Enterprise Software Top Skills 11 Analytics 11 Product Management 10 Process Improvement 9 Payroll 8 SaaS 7 Strategy 7 Vendor Management 5 Finance 5 Business Intelligence 5 Cloud Computing Jeff also knows about... 4 Business Process... 3 Business Analysis 3 Cross-functional Team... 2 Enterprise Software Top Skills 11 Analytics 11 Product Management 10 Process Improvement 9 Payroll 8 SaaS 7 Strategy 7 Vendor Management 5 Finance 5 Business Intelligence 5 Cloud Computing Jeff also knows about... 4 Business Process... 3 Business Analysis 3 Cross-functional Team... 2 Enterprise Software                     4 Business Process... 3 Business Analysis 3 Cross-functional Team... 2 Enterprise Software ", "Summary Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Summary Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Experience Project Manager Google June 2010  – Present (5 years 2 months) Mountain View, CA Centralize project requests and prioritization and lead cross-functional engagement with internal organizations. Identify and deliver process enhancements to increase efficiency and accuracy of payroll processing. Manage key operational processes and associated payroll accuracy and employee experiences. Assoc. Mgr., Billing Operations Google April 2007  –  June 2010  (3 years 3 months) Managed team of nine Analysts and 4 contractors providing Billing support to sales teams, providing requirements and feedback to Product Managers on new features and services, and managing special projects in the Global Revenue Operations team. (Open) 1 recommendation Brian Sullivan Attorney - Law Office of Brian M Sullivan, PLLC I have known Leslie-Ann for 10 years now, and I am still constantly impressed by her work ethic, attitude, and business acumen. I highly recommend her to anyone fortunate enough to get the opportunity to work with her. View Finance Operations Analyst & Senior Analyst Google August 2003  –  January 2007  (3 years 6 months) Mountain View, California Create policies and processes for Global Revenue Operations (billing, credit, collections), provide support to sales teams and clients dealing with order-to-cash issues, participate in Product Management core teams, and manage special projects in relation to order-to-cash products and features. Worked cross-functionally with sales teams, sales leadership, and Finance leadership to scale support for rapidly growing AdWords sales organization and client base. \n \n-Built a high-achieving Billing & Payments group, growing the team from 2 people to 14 over a 2 year period. \n-Implemented metrics for tracking team performance and identifying opportunities for increased efficiency, reducing turnaround times for sales support issues by over 50%. \n-Developed new-hire on-boarding plan and training materials. \n-Developed and delivered sales trainings on key Finance policies. (Open) 1 recommendation Anne Sromek Strategic Vendor Management, CorpEng (Google IT) I strongly recommend Leslie-Ann Bergstrom as a colleague and team member. We have worked together since 2011. In fact, when I interviewed for a role at Google, Leslie-Ann took me to lunch and answered all of the questions I had around work/life... View Project Manager Google June 2010  – Present (5 years 2 months) Mountain View, CA Centralize project requests and prioritization and lead cross-functional engagement with internal organizations. Identify and deliver process enhancements to increase efficiency and accuracy of payroll processing. Manage key operational processes and associated payroll accuracy and employee experiences. Project Manager Google June 2010  – Present (5 years 2 months) Mountain View, CA Centralize project requests and prioritization and lead cross-functional engagement with internal organizations. Identify and deliver process enhancements to increase efficiency and accuracy of payroll processing. Manage key operational processes and associated payroll accuracy and employee experiences. Assoc. Mgr., Billing Operations Google April 2007  –  June 2010  (3 years 3 months) Managed team of nine Analysts and 4 contractors providing Billing support to sales teams, providing requirements and feedback to Product Managers on new features and services, and managing special projects in the Global Revenue Operations team. (Open) 1 recommendation Brian Sullivan Attorney - Law Office of Brian M Sullivan, PLLC I have known Leslie-Ann for 10 years now, and I am still constantly impressed by her work ethic, attitude, and business acumen. I highly recommend her to anyone fortunate enough to get the opportunity to work with her. View Assoc. Mgr., Billing Operations Google April 2007  –  June 2010  (3 years 3 months) Managed team of nine Analysts and 4 contractors providing Billing support to sales teams, providing requirements and feedback to Product Managers on new features and services, and managing special projects in the Global Revenue Operations team. (Open) 1 recommendation Brian Sullivan Attorney - Law Office of Brian M Sullivan, PLLC I have known Leslie-Ann for 10 years now, and I am still constantly impressed by her work ethic, attitude, and business acumen. I highly recommend her to anyone fortunate enough to get the opportunity to work with her. View Finance Operations Analyst & Senior Analyst Google August 2003  –  January 2007  (3 years 6 months) Mountain View, California Create policies and processes for Global Revenue Operations (billing, credit, collections), provide support to sales teams and clients dealing with order-to-cash issues, participate in Product Management core teams, and manage special projects in relation to order-to-cash products and features. Worked cross-functionally with sales teams, sales leadership, and Finance leadership to scale support for rapidly growing AdWords sales organization and client base. \n \n-Built a high-achieving Billing & Payments group, growing the team from 2 people to 14 over a 2 year period. \n-Implemented metrics for tracking team performance and identifying opportunities for increased efficiency, reducing turnaround times for sales support issues by over 50%. \n-Developed new-hire on-boarding plan and training materials. \n-Developed and delivered sales trainings on key Finance policies. (Open) 1 recommendation Anne Sromek Strategic Vendor Management, CorpEng (Google IT) I strongly recommend Leslie-Ann Bergstrom as a colleague and team member. We have worked together since 2011. In fact, when I interviewed for a role at Google, Leslie-Ann took me to lunch and answered all of the questions I had around work/life... View Finance Operations Analyst & Senior Analyst Google August 2003  –  January 2007  (3 years 6 months) Mountain View, California Create policies and processes for Global Revenue Operations (billing, credit, collections), provide support to sales teams and clients dealing with order-to-cash issues, participate in Product Management core teams, and manage special projects in relation to order-to-cash products and features. Worked cross-functionally with sales teams, sales leadership, and Finance leadership to scale support for rapidly growing AdWords sales organization and client base. \n \n-Built a high-achieving Billing & Payments group, growing the team from 2 people to 14 over a 2 year period. \n-Implemented metrics for tracking team performance and identifying opportunities for increased efficiency, reducing turnaround times for sales support issues by over 50%. \n-Developed new-hire on-boarding plan and training materials. \n-Developed and delivered sales trainings on key Finance policies. (Open) 1 recommendation Anne Sromek Strategic Vendor Management, CorpEng (Google IT) I strongly recommend Leslie-Ann Bergstrom as a colleague and team member. We have worked together since 2011. In fact, when I interviewed for a role at Google, Leslie-Ann took me to lunch and answered all of the questions I had around work/life... View Skills Top Skills 12 Analytics 11 Cross-functional Team... 8 Leadership 7 Competitive Analysis 7 Project Management 6 Management 5 Strategy 5 Strategic Partnerships 3 Digital Marketing 3 Process Improvement Leslie-Ann also knows about... 3 Marketing 2 Product Marketing 2 Entrepreneurship 2 Business Strategy 2 Start-ups 1 Business Planning Skills  Top Skills 12 Analytics 11 Cross-functional Team... 8 Leadership 7 Competitive Analysis 7 Project Management 6 Management 5 Strategy 5 Strategic Partnerships 3 Digital Marketing 3 Process Improvement Leslie-Ann also knows about... 3 Marketing 2 Product Marketing 2 Entrepreneurship 2 Business Strategy 2 Start-ups 1 Business Planning Top Skills 12 Analytics 11 Cross-functional Team... 8 Leadership 7 Competitive Analysis 7 Project Management 6 Management 5 Strategy 5 Strategic Partnerships 3 Digital Marketing 3 Process Improvement Leslie-Ann also knows about... 3 Marketing 2 Product Marketing 2 Entrepreneurship 2 Business Strategy 2 Start-ups 1 Business Planning Top Skills 12 Analytics 11 Cross-functional Team... 8 Leadership 7 Competitive Analysis 7 Project Management 6 Management 5 Strategy 5 Strategic Partnerships 3 Digital Marketing 3 Process Improvement Leslie-Ann also knows about... 3 Marketing 2 Product Marketing 2 Entrepreneurship 2 Business Strategy 2 Start-ups 1 Business Planning                     3 Marketing 2 Product Marketing 2 Entrepreneurship 2 Business Strategy 2 Start-ups 1 Business Planning Education University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club (Open) 18 courses, including: Pricing International Marketing Strategic Brand Management Corporate Boards Entrepreneurship Managerial Accounting Leadership Seminar in International Business, South Africa Competitive Strategy Social Media See more 8 more courses (Open) 4 recommendations, including: Kevin Krause Director - Microbiology at Achaogen I had the pleasure of working with Leslie-Ann on a number of group projects throughout our time in business school. I found... View Brian Armbrust Principal HR Business Partner (Pharma Product Development) at Genentech Leslie-Ann and I were classmates at Haas School of Business/UC Berkeley and we continue to remain in frequent contact.\n... View 2 more recommendations Santa Clara University BA,  English ,  Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club (Open) 18 courses, including: Pricing International Marketing Strategic Brand Management Corporate Boards Entrepreneurship Managerial Accounting Leadership Seminar in International Business, South Africa Competitive Strategy Social Media See more 8 more courses (Open) 4 recommendations, including: Kevin Krause Director - Microbiology at Achaogen I had the pleasure of working with Leslie-Ann on a number of group projects throughout our time in business school. I found... View Brian Armbrust Principal HR Business Partner (Pharma Product Development) at Genentech Leslie-Ann and I were classmates at Haas School of Business/UC Berkeley and we continue to remain in frequent contact.\n... View 2 more recommendations University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club (Open) 18 courses, including: Pricing International Marketing Strategic Brand Management Corporate Boards Entrepreneurship Managerial Accounting Leadership Seminar in International Business, South Africa Competitive Strategy Social Media See more 8 more courses (Open) 4 recommendations, including: Kevin Krause Director - Microbiology at Achaogen I had the pleasure of working with Leslie-Ann on a number of group projects throughout our time in business school. I found... View Brian Armbrust Principal HR Business Partner (Pharma Product Development) at Genentech Leslie-Ann and I were classmates at Haas School of Business/UC Berkeley and we continue to remain in frequent contact.\n... View 2 more recommendations University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club (Open) 18 courses, including: Pricing International Marketing Strategic Brand Management Corporate Boards Entrepreneurship Managerial Accounting Leadership Seminar in International Business, South Africa Competitive Strategy Social Media See more 8 more courses (Open) 4 recommendations, including: Kevin Krause Director - Microbiology at Achaogen I had the pleasure of working with Leslie-Ann on a number of group projects throughout our time in business school. I found... View Brian Armbrust Principal HR Business Partner (Pharma Product Development) at Genentech Leslie-Ann and I were classmates at Haas School of Business/UC Berkeley and we continue to remain in frequent contact.\n... View 2 more recommendations Santa Clara University BA,  English ,  Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine Santa Clara University BA,  English ,  Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine Santa Clara University BA,  English ,  Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine ", "Summary Specialties: Payments entity structuring and licensing, new product and acquisitions processes and systems integration for payments compliance, global AML investigations and reporting, AML transaction monitoring system design, AML and KYC compliance, eCommerce payments fraud and risk analysis, budget management, vendor management. Summary Specialties: Payments entity structuring and licensing, new product and acquisitions processes and systems integration for payments compliance, global AML investigations and reporting, AML transaction monitoring system design, AML and KYC compliance, eCommerce payments fraud and risk analysis, budget management, vendor management. Specialties: Payments entity structuring and licensing, new product and acquisitions processes and systems integration for payments compliance, global AML investigations and reporting, AML transaction monitoring system design, AML and KYC compliance, eCommerce payments fraud and risk analysis, budget management, vendor management. Specialties: Payments entity structuring and licensing, new product and acquisitions processes and systems integration for payments compliance, global AML investigations and reporting, AML transaction monitoring system design, AML and KYC compliance, eCommerce payments fraud and risk analysis, budget management, vendor management. Experience Payment Compliance-AML Lead, Finance Operations Google August 2011  – Present (4 years) Manage global AML system and tools, investigations and reporting processes. Finance Operations Analyst, Supplier Management Google, Inc. July 2010  –  August 2011  (1 year 2 months) Managed ~$70 million budget for large finance outsourcing vendor. Risk Management Specialist Google, Inc. July 2007  –  July 2010  (3 years 1 month) Fraud/risk investigations, team metrics and new hire training and quality analysis. Payment Compliance-AML Lead, Finance Operations Google August 2011  – Present (4 years) Manage global AML system and tools, investigations and reporting processes. Payment Compliance-AML Lead, Finance Operations Google August 2011  – Present (4 years) Manage global AML system and tools, investigations and reporting processes. Finance Operations Analyst, Supplier Management Google, Inc. July 2010  –  August 2011  (1 year 2 months) Managed ~$70 million budget for large finance outsourcing vendor. Finance Operations Analyst, Supplier Management Google, Inc. July 2010  –  August 2011  (1 year 2 months) Managed ~$70 million budget for large finance outsourcing vendor. Risk Management Specialist Google, Inc. July 2007  –  July 2010  (3 years 1 month) Fraud/risk investigations, team metrics and new hire training and quality analysis. Risk Management Specialist Google, Inc. July 2007  –  July 2010  (3 years 1 month) Fraud/risk investigations, team metrics and new hire training and quality analysis. Skills Top Skills 15 Fraud 3 Anti Money Laundering 2 SAR Reporting 7 Finance 5 Vendor Management 5 Payments 0 SAR Filing 0 FinCEN 3 Fraud Prevention 3 Fraud Investigations Kristina also knows about... 2 KYC 1 Budget Management 0 Mobile Payments 2 Budgets 1 E-commerce 1 AML 0 Process Management 5 Google Adwords 0 Google Wallet 0 Google Docs 0 MSB 0 FCA 0 OFAC 0 Money Transmission Skills  Top Skills 15 Fraud 3 Anti Money Laundering 2 SAR Reporting 7 Finance 5 Vendor Management 5 Payments 0 SAR Filing 0 FinCEN 3 Fraud Prevention 3 Fraud Investigations Kristina also knows about... 2 KYC 1 Budget Management 0 Mobile Payments 2 Budgets 1 E-commerce 1 AML 0 Process Management 5 Google Adwords 0 Google Wallet 0 Google Docs 0 MSB 0 FCA 0 OFAC 0 Money Transmission Top Skills 15 Fraud 3 Anti Money Laundering 2 SAR Reporting 7 Finance 5 Vendor Management 5 Payments 0 SAR Filing 0 FinCEN 3 Fraud Prevention 3 Fraud Investigations Kristina also knows about... 2 KYC 1 Budget Management 0 Mobile Payments 2 Budgets 1 E-commerce 1 AML 0 Process Management 5 Google Adwords 0 Google Wallet 0 Google Docs 0 MSB 0 FCA 0 OFAC 0 Money Transmission Top Skills 15 Fraud 3 Anti Money Laundering 2 SAR Reporting 7 Finance 5 Vendor Management 5 Payments 0 SAR Filing 0 FinCEN 3 Fraud Prevention 3 Fraud Investigations Kristina also knows about... 2 KYC 1 Budget Management 0 Mobile Payments 2 Budgets 1 E-commerce 1 AML 0 Process Management 5 Google Adwords 0 Google Wallet 0 Google Docs 0 MSB 0 FCA 0 OFAC 0 Money Transmission                     2 KYC 1 Budget Management 0 Mobile Payments 2 Budgets 1 E-commerce 1 AML 0 Process Management 5 Google Adwords 0 Google Wallet 0 Google Docs 0 MSB 0 FCA 0 OFAC 0 Money Transmission Education Elizabethtown College Undergraduate,  International Business-Finance 2004  – 2007 Activities and Societies:  International Club ,  Asian Cultural Association ,  Delta Mu Delta Elizabethtown College Undergraduate,  International Business-Finance 2004  – 2007 Activities and Societies:  International Club ,  Asian Cultural Association ,  Delta Mu Delta Elizabethtown College Undergraduate,  International Business-Finance 2004  – 2007 Activities and Societies:  International Club ,  Asian Cultural Association ,  Delta Mu Delta Elizabethtown College Undergraduate,  International Business-Finance 2004  – 2007 Activities and Societies:  International Club ,  Asian Cultural Association ,  Delta Mu Delta ", "Summary 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python Summary 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python Experience Sales Strategy and Ops Manager, Media Platforms Google May 2013  – Present (2 years 3 months) Greater New York City Area Finance Lead, Google Affiliate Network Google December 2012  –  May 2013  (6 months) Greater Chicago Area Currently acting as the Finance Lead for the Google Affiliate Network, based out of Chicago. Responsibilities include: \n \n- Leading the financial planning process for 1,3, and 5 years out \n- Management and monitoring of the P&L \n- Forecasting for the entire business \n- Designing and implementing compensation structures and plans \n- Quota administration \n- Operational analysis / implementation of new strategies \n- Market / opportunity sizing and analysis \n- Financial modeling and due diligence \n- Co-lead for billing operations Sales Finance and Operations Analyst Google January 2011  –  December 2012  (2 years) Chicago - Set quarterly quotas for Google Affiliate Network account managers \n- Track and report progress to quota for bonus payouts \n- Design compensation plans for account managers and account executives on the account management, publisher development and acquisitions teams \n- Provide bottoms-up business unit quarterly and yearly forecast to the BU \n- Provide detailed analysis on various optimization programs \n- Ad-hoc analysis and modelling as necessary (special projects around organizational structure, expansion plans, etc.) \n- Lead analysis and reporting of revenue and net revenue for entire business unit \n- Liaise with central Accounting and Finance teams to provide inputs into GL bookings and Forecast calls \n- Lead internal FP&A for business unit Sr. Financial Analyst Motorola Mobile Devices May 2010  –  January 2011  (9 months) Arlington Heights and Libertyville, IL - Reported actual spend/savings results monthly; responsible for monthly, quarterly and full year outlook \n- Provided in depth analysis for spend and savings related to freight, repair, fulfillment centers and packaging \n- Completed detailed and advanced ad-hoc trending analysis to identify potential cost savings opportunities \n- Drove improvements in the independence, value and efficiency of the internal reporting process \n- Supported procurement teams in the resolution of pricing issues identified through analysis \n- Identified and corrected significant pricing issues between pricing systems to enhance reporting and analysis \n- Presented consolidated results to senior management monthly and as needed Sr. Enterprise Risk Management Analyst Motorola June 2008  –  May 2010  (2 years) Schaumburg, IL & International Locations Business Process Consulting, Compliance Audits, Financial Audits, IT Audits \n \n- Interfaced with and presented to executives and various members of senior management \n- Consulted on intricate compliance issues for various business units and functions across Motorola globally \n- Provided a high level of strategic insight around the planning of several engagements \n- Performed analytics around potential fraudulent activities as part of the Fraud Initiatives Team \n- Completed a corporate SOX governance review for several functions Accounting Analyst Genesis Systems Group January 2008  –  March 2008  (3 months) Solved a prepaid software accounting issue and designed an automated solution for future application. Internal Controls John Deere March 2006  –  December 2006  (10 months) Internal Controls \n- Created a process to track and maintain journal voucher records for S-Ox compliance \n- Completed month end closing on 20+ accounts \n- Performed daily audits of perpetual inventory adjustments \n- Reformatted complicated SAS program to complete a vendor rebate program (savings of $1.6M for company) Sales Strategy and Ops Manager, Media Platforms Google May 2013  – Present (2 years 3 months) Greater New York City Area Sales Strategy and Ops Manager, Media Platforms Google May 2013  – Present (2 years 3 months) Greater New York City Area Finance Lead, Google Affiliate Network Google December 2012  –  May 2013  (6 months) Greater Chicago Area Currently acting as the Finance Lead for the Google Affiliate Network, based out of Chicago. Responsibilities include: \n \n- Leading the financial planning process for 1,3, and 5 years out \n- Management and monitoring of the P&L \n- Forecasting for the entire business \n- Designing and implementing compensation structures and plans \n- Quota administration \n- Operational analysis / implementation of new strategies \n- Market / opportunity sizing and analysis \n- Financial modeling and due diligence \n- Co-lead for billing operations Finance Lead, Google Affiliate Network Google December 2012  –  May 2013  (6 months) Greater Chicago Area Currently acting as the Finance Lead for the Google Affiliate Network, based out of Chicago. Responsibilities include: \n \n- Leading the financial planning process for 1,3, and 5 years out \n- Management and monitoring of the P&L \n- Forecasting for the entire business \n- Designing and implementing compensation structures and plans \n- Quota administration \n- Operational analysis / implementation of new strategies \n- Market / opportunity sizing and analysis \n- Financial modeling and due diligence \n- Co-lead for billing operations Sales Finance and Operations Analyst Google January 2011  –  December 2012  (2 years) Chicago - Set quarterly quotas for Google Affiliate Network account managers \n- Track and report progress to quota for bonus payouts \n- Design compensation plans for account managers and account executives on the account management, publisher development and acquisitions teams \n- Provide bottoms-up business unit quarterly and yearly forecast to the BU \n- Provide detailed analysis on various optimization programs \n- Ad-hoc analysis and modelling as necessary (special projects around organizational structure, expansion plans, etc.) \n- Lead analysis and reporting of revenue and net revenue for entire business unit \n- Liaise with central Accounting and Finance teams to provide inputs into GL bookings and Forecast calls \n- Lead internal FP&A for business unit Sales Finance and Operations Analyst Google January 2011  –  December 2012  (2 years) Chicago - Set quarterly quotas for Google Affiliate Network account managers \n- Track and report progress to quota for bonus payouts \n- Design compensation plans for account managers and account executives on the account management, publisher development and acquisitions teams \n- Provide bottoms-up business unit quarterly and yearly forecast to the BU \n- Provide detailed analysis on various optimization programs \n- Ad-hoc analysis and modelling as necessary (special projects around organizational structure, expansion plans, etc.) \n- Lead analysis and reporting of revenue and net revenue for entire business unit \n- Liaise with central Accounting and Finance teams to provide inputs into GL bookings and Forecast calls \n- Lead internal FP&A for business unit Sr. Financial Analyst Motorola Mobile Devices May 2010  –  January 2011  (9 months) Arlington Heights and Libertyville, IL - Reported actual spend/savings results monthly; responsible for monthly, quarterly and full year outlook \n- Provided in depth analysis for spend and savings related to freight, repair, fulfillment centers and packaging \n- Completed detailed and advanced ad-hoc trending analysis to identify potential cost savings opportunities \n- Drove improvements in the independence, value and efficiency of the internal reporting process \n- Supported procurement teams in the resolution of pricing issues identified through analysis \n- Identified and corrected significant pricing issues between pricing systems to enhance reporting and analysis \n- Presented consolidated results to senior management monthly and as needed Sr. Financial Analyst Motorola Mobile Devices May 2010  –  January 2011  (9 months) Arlington Heights and Libertyville, IL - Reported actual spend/savings results monthly; responsible for monthly, quarterly and full year outlook \n- Provided in depth analysis for spend and savings related to freight, repair, fulfillment centers and packaging \n- Completed detailed and advanced ad-hoc trending analysis to identify potential cost savings opportunities \n- Drove improvements in the independence, value and efficiency of the internal reporting process \n- Supported procurement teams in the resolution of pricing issues identified through analysis \n- Identified and corrected significant pricing issues between pricing systems to enhance reporting and analysis \n- Presented consolidated results to senior management monthly and as needed Sr. Enterprise Risk Management Analyst Motorola June 2008  –  May 2010  (2 years) Schaumburg, IL & International Locations Business Process Consulting, Compliance Audits, Financial Audits, IT Audits \n \n- Interfaced with and presented to executives and various members of senior management \n- Consulted on intricate compliance issues for various business units and functions across Motorola globally \n- Provided a high level of strategic insight around the planning of several engagements \n- Performed analytics around potential fraudulent activities as part of the Fraud Initiatives Team \n- Completed a corporate SOX governance review for several functions Sr. Enterprise Risk Management Analyst Motorola June 2008  –  May 2010  (2 years) Schaumburg, IL & International Locations Business Process Consulting, Compliance Audits, Financial Audits, IT Audits \n \n- Interfaced with and presented to executives and various members of senior management \n- Consulted on intricate compliance issues for various business units and functions across Motorola globally \n- Provided a high level of strategic insight around the planning of several engagements \n- Performed analytics around potential fraudulent activities as part of the Fraud Initiatives Team \n- Completed a corporate SOX governance review for several functions Accounting Analyst Genesis Systems Group January 2008  –  March 2008  (3 months) Solved a prepaid software accounting issue and designed an automated solution for future application. Accounting Analyst Genesis Systems Group January 2008  –  March 2008  (3 months) Solved a prepaid software accounting issue and designed an automated solution for future application. Internal Controls John Deere March 2006  –  December 2006  (10 months) Internal Controls \n- Created a process to track and maintain journal voucher records for S-Ox compliance \n- Completed month end closing on 20+ accounts \n- Performed daily audits of perpetual inventory adjustments \n- Reformatted complicated SAS program to complete a vendor rebate program (savings of $1.6M for company) Internal Controls John Deere March 2006  –  December 2006  (10 months) Internal Controls \n- Created a process to track and maintain journal voucher records for S-Ox compliance \n- Completed month end closing on 20+ accounts \n- Performed daily audits of perpetual inventory adjustments \n- Reformatted complicated SAS program to complete a vendor rebate program (savings of $1.6M for company) Skills Top Skills 15 Forecasting 12 Financial Analysis 10 Financial Modeling 6 Finance 5 Strategic Financial... 4 Financial Forecasting 4 Analytics 3 Strategic Planning 3 Data Analysis 3 Process Improvement Bill also knows about... 2 Revenue Forecasting 2 Microsoft Excel 2 Analysis 2 Business Process... 1 Strategy 0 Financial Planning 0 Strategic Analysis 0 Attention To Detail Skills  Top Skills 15 Forecasting 12 Financial Analysis 10 Financial Modeling 6 Finance 5 Strategic Financial... 4 Financial Forecasting 4 Analytics 3 Strategic Planning 3 Data Analysis 3 Process Improvement Bill also knows about... 2 Revenue Forecasting 2 Microsoft Excel 2 Analysis 2 Business Process... 1 Strategy 0 Financial Planning 0 Strategic Analysis 0 Attention To Detail Top Skills 15 Forecasting 12 Financial Analysis 10 Financial Modeling 6 Finance 5 Strategic Financial... 4 Financial Forecasting 4 Analytics 3 Strategic Planning 3 Data Analysis 3 Process Improvement Bill also knows about... 2 Revenue Forecasting 2 Microsoft Excel 2 Analysis 2 Business Process... 1 Strategy 0 Financial Planning 0 Strategic Analysis 0 Attention To Detail Top Skills 15 Forecasting 12 Financial Analysis 10 Financial Modeling 6 Finance 5 Strategic Financial... 4 Financial Forecasting 4 Analytics 3 Strategic Planning 3 Data Analysis 3 Process Improvement Bill also knows about... 2 Revenue Forecasting 2 Microsoft Excel 2 Analysis 2 Business Process... 1 Strategy 0 Financial Planning 0 Strategic Analysis 0 Attention To Detail                     2 Revenue Forecasting 2 Microsoft Excel 2 Analysis 2 Business Process... 1 Strategy 0 Financial Planning 0 Strategic Analysis 0 Attention To Detail Education The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K ", "Summary Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Summary Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Experience Global Process Manager, Collections Google September 2013  – Present (1 year 11 months) Sr. Finance Operations Analyst - Invoicing Google May 2013  –  September 2013  (5 months) Sr. Finance Operations Analyst - Credit Google April 2011  –  May 2013  (2 years 2 months) Operations Supervisor Enterprise Fleet Management May 2006  –  April 2011  (5 years) (Open) 4 recommendations, including: Mike Facchetti Managing Principal at Verizon Enterprise Solutions Dave and I were classmates for three years at the UCLA Anderson School of Management. During that time, I had the pleasure... View Adam Glazer Auto, Home, Life Insurance & Annuities Agent w/ Liberty Mutual Insurance I had the chance to work with and get to know Dave while I was an Account Executive with Enterprise Fleet Management. Aside... View 2 more recommendations Account Executive Enterprise Fleet Management August 2004  –  May 2006  (1 year 10 months) Management Trainee Enterprise Rent A Car July 2003  –  August 2004  (1 year 2 months) Global Process Manager, Collections Google September 2013  – Present (1 year 11 months) Global Process Manager, Collections Google September 2013  – Present (1 year 11 months) Sr. Finance Operations Analyst - Invoicing Google May 2013  –  September 2013  (5 months) Sr. Finance Operations Analyst - Invoicing Google May 2013  –  September 2013  (5 months) Sr. Finance Operations Analyst - Credit Google April 2011  –  May 2013  (2 years 2 months) Sr. Finance Operations Analyst - Credit Google April 2011  –  May 2013  (2 years 2 months) Operations Supervisor Enterprise Fleet Management May 2006  –  April 2011  (5 years) (Open) 4 recommendations, including: Mike Facchetti Managing Principal at Verizon Enterprise Solutions Dave and I were classmates for three years at the UCLA Anderson School of Management. During that time, I had the pleasure... View Adam Glazer Auto, Home, Life Insurance & Annuities Agent w/ Liberty Mutual Insurance I had the chance to work with and get to know Dave while I was an Account Executive with Enterprise Fleet Management. Aside... View 2 more recommendations Operations Supervisor Enterprise Fleet Management May 2006  –  April 2011  (5 years) (Open) 4 recommendations, including: Mike Facchetti Managing Principal at Verizon Enterprise Solutions Dave and I were classmates for three years at the UCLA Anderson School of Management. During that time, I had the pleasure... View Adam Glazer Auto, Home, Life Insurance & Annuities Agent w/ Liberty Mutual Insurance I had the chance to work with and get to know Dave while I was an Account Executive with Enterprise Fleet Management. Aside... View 2 more recommendations Account Executive Enterprise Fleet Management August 2004  –  May 2006  (1 year 10 months) Account Executive Enterprise Fleet Management August 2004  –  May 2006  (1 year 10 months) Management Trainee Enterprise Rent A Car July 2003  –  August 2004  (1 year 2 months) Management Trainee Enterprise Rent A Car July 2003  –  August 2004  (1 year 2 months) Skills Top Skills 23 Financial Modeling 23 Finance 12 Financial Analysis 8 Forecasting 7 Customer Service 6 Business Development 5 Cross-functional Team... 5 Business Strategy 4 Strategic Planning 4 Sales David also knows about... 3 Competitive Analysis 1 Financial Statement... Skills  Top Skills 23 Financial Modeling 23 Finance 12 Financial Analysis 8 Forecasting 7 Customer Service 6 Business Development 5 Cross-functional Team... 5 Business Strategy 4 Strategic Planning 4 Sales David also knows about... 3 Competitive Analysis 1 Financial Statement... Top Skills 23 Financial Modeling 23 Finance 12 Financial Analysis 8 Forecasting 7 Customer Service 6 Business Development 5 Cross-functional Team... 5 Business Strategy 4 Strategic Planning 4 Sales David also knows about... 3 Competitive Analysis 1 Financial Statement... Top Skills 23 Financial Modeling 23 Finance 12 Financial Analysis 8 Forecasting 7 Customer Service 6 Business Development 5 Cross-functional Team... 5 Business Strategy 4 Strategic Planning 4 Sales David also knows about... 3 Competitive Analysis 1 Financial Statement...                     3 Competitive Analysis 1 Financial Statement... Education UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club (Open) 3 recommendations, including: Brian Lee Engineer at Oxy To preface this recommendation, I have worked with Dave in the same group for two different classes: Fixed Income (Quant)... View Kristopher Scott Chief Financial Officer at Topson Downs Dave and I studied together at UCLA Anderson and partnered on numerous projects during our three years there, including our... View 1 more recommendation University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club (Open) 3 recommendations, including: Brian Lee Engineer at Oxy To preface this recommendation, I have worked with Dave in the same group for two different classes: Fixed Income (Quant)... View Kristopher Scott Chief Financial Officer at Topson Downs Dave and I studied together at UCLA Anderson and partnered on numerous projects during our three years there, including our... View 1 more recommendation UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club (Open) 3 recommendations, including: Brian Lee Engineer at Oxy To preface this recommendation, I have worked with Dave in the same group for two different classes: Fixed Income (Quant)... View Kristopher Scott Chief Financial Officer at Topson Downs Dave and I studied together at UCLA Anderson and partnered on numerous projects during our three years there, including our... View 1 more recommendation UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club (Open) 3 recommendations, including: Brian Lee Engineer at Oxy To preface this recommendation, I have worked with Dave in the same group for two different classes: Fixed Income (Quant)... View Kristopher Scott Chief Financial Officer at Topson Downs Dave and I studied together at UCLA Anderson and partnered on numerous projects during our three years there, including our... View 1 more recommendation University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity Honors & Awards Additional Honors & Awards UCLA - Cum Laude Additional Honors & Awards UCLA - Cum Laude Additional Honors & Awards UCLA - Cum Laude Additional Honors & Awards UCLA - Cum Laude ", "Summary Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Summary Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Experience Finance Operations Analyst Google July 2013  – Present (2 years 1 month) Dublin Global P2P Project Manager responsible for EMEA & LATAM, tasked with ensuring a best in class travel and expense experience for Googlers. \n \n2014 Concur Innovation Award Winner. \n \n Financial Analyst Google August 2011  – Present (4 years) Dublin I support the Google AdWords business by providing actionable insights to drive the business forward. As a Financial Analyst I am a valued partner to the Senior Sales Management teams. I am called upon to build complex scenarios analyses that serve as the basis for recommendations that leaders of the business draw from to make critical strategic decisions. The output of my work is highly visible and has significant global impact. A master juggler working on multiple projects at a time, I can jump from deep analysis or systems development to face to face meetings with senior management while all the time maintaining a consistently high level of attention to detail while finding creative ways to tackle new challenges. \n \nResponsibilities: \n \nDefine, analyse and communicate key metrics and business trends for Sales management teams. \nExecute sophisticated quantitative analyses and advanced modeling that translates data into actionable insights. \nDevelop financial and data models and tools that provide a platform for decision making on a variety of business issues. \nBuild and lead the preparation and publishing of metric forecasting and reporting for internal customers. \nLeverage knowledge of Excel, SQL, Python, etc to build scalable global tools Senior Business Analyst - AdSense Google January 2009  –  August 2011  (2 years 8 months) Lead Analyst for the global AdSense account management team. \nResearch and analyze key business drivers, competitive environment, trends and operating metrics. \nProduction of revenue and KPI reports and dashboards providing regular insights to senior management on the business. \nDevelopment of data models and tools that provide a platform for decision making on a variety of operational issues. \nExecute sophisticated quantitative & statistical analyses and advanced modeling that translates data into actionable insights. \nProvide those insights to account management teams to support sales activities - lead generation, upsells, cross-sells. \nPlay a key role in target setting and performance measurement for sales team. \nMeasure Revenue and ROI from global sales initiatives and events. \nProduction, coordination and presentation of global business reviews. (Open) 2 recommendations Pavel Gusev Experienced business intelligence professional I had a very positive experience to work with Andrew for 4.5 years in Google. We worked together on numerous analytical... View Colm Ó Muiré Programme Manager at Google I have had the pleasure of working closely with Andrew Miller over the past four years or so, and I have found him to be... View Technical Account Manager - AdSense Google February 2007  –  January 2009  (2 years) Managing technical relationship with AdSense partners from technical implementation to on-going technology communications. Assisting partners in implementing and launching new products and services. Building successful, long-term relationships with partners. Liaison between partners and Product Management team. Played a key role in the global launch of the AdSense product for mobile devices (Mobile AFC). Delivered product training to the sales team. \nSpecial projects involving quantitative analysis, industry research, and strategy development. Developing upsell strategies to drive new business opportunities, and maximizing the monetization of the online services. \nAccount management of a portfolio of large UK AdSense partners - working with major website owners to monetise their inventory through AdSense. Upselling AdSense and cross-selling other Google products. (Open) 2 recommendations Lucy Prendeville Team Sales Business Manager at Under Armour Andrew is a great team player, he balances complicated product launches with daily technical flareups for a range of... View Ellen Ten Hove Category Manager Flowers at Greetz I know Andrew as a very bright and strong contributor to the workforce in Google. We worked together on several projects and... View Application Engineer Microsoft 2006  –  2007  (1 year) Vendor management - Technical liason between Microsoft core team (US) and external localisation vendors (Europe) for Office 2007 Sharepoint Portal Server. Investigation and resolution of technical issues to support external vendors. Escalation of internationalization issues to core team, monitoring these issues and communicating with both groups until resolution. \n \nLab management - Installation, provisioning and maintenance of international server labs to enable the testing and engineering of MS Office 2007 server products. (Open) 2 recommendations Breda O'Connell Consultant Business Analyst at Spencer Stuart Andrew was employed in Microsoft as member of a team charged with delivering a variety of components of MS Office 2007 in a... View James Ferris Lead Production Manager at Houghton Mifflin Harcourt I have worked with Andrew on a number of occasions in various roles. I have always found him to be an excellent team player... View Technical Specialist Connect Global Solutions 1998  –  2004  (6 years) Connect Global Solutions was a software localization services company. I was one of the 10 founding members when this company started up in 1998. The company grew to over 50 employees by the time I left to pursue an MBA.  \n \nClients included: \nApple, IBM, Symantec, AutoDesk, AOL, Microsoft (Visio), Canon \n \nRoles included: \nSoftware localization and internationalization \nTeam Leading \nProject Management \nRelationship Management \nProject Analysis \nTechnical Analysis \nBusiness Development \nApplication Development (Open) 1 recommendation Anna Coffey Technical Training Lead at Irish Water / Uisce Eireann Being teamed with Andy on a variety of international projects was always a pleasure as you were confident that his strong work ethic, technical skills and commitment to a project would ensure consistently great results. View Software Engineer Claris Ireland 1996  –  1998  (2 years) Claris was the software subsidiary of Apple Computers. All Apple software was marketed through Claris.  \n \nPrimary localisation engineer for FileMaker Pro (database application) and Claris Homepage (WYSIWYG HTML editor) on Mac and PC. Configured and recompiled build environments. Investigated and resolved software bugs. \nVendor support – provided detailed technical instructions and ongoing technical support to outsourcing vendors. (Open) 1 recommendation Steve Prior Project Manager at Citco Corporate and Trust Andrew is a hard worker and very able software engineer. He took on any task given to him and showed great initiative in acomplishing his objectives. He is also an excellent team player who worked well with all of his co-workers. View Finance Operations Analyst Google July 2013  – Present (2 years 1 month) Dublin Global P2P Project Manager responsible for EMEA & LATAM, tasked with ensuring a best in class travel and expense experience for Googlers. \n \n2014 Concur Innovation Award Winner. \n \n Finance Operations Analyst Google July 2013  – Present (2 years 1 month) Dublin Global P2P Project Manager responsible for EMEA & LATAM, tasked with ensuring a best in class travel and expense experience for Googlers. \n \n2014 Concur Innovation Award Winner. \n \n Financial Analyst Google August 2011  – Present (4 years) Dublin I support the Google AdWords business by providing actionable insights to drive the business forward. As a Financial Analyst I am a valued partner to the Senior Sales Management teams. I am called upon to build complex scenarios analyses that serve as the basis for recommendations that leaders of the business draw from to make critical strategic decisions. The output of my work is highly visible and has significant global impact. A master juggler working on multiple projects at a time, I can jump from deep analysis or systems development to face to face meetings with senior management while all the time maintaining a consistently high level of attention to detail while finding creative ways to tackle new challenges. \n \nResponsibilities: \n \nDefine, analyse and communicate key metrics and business trends for Sales management teams. \nExecute sophisticated quantitative analyses and advanced modeling that translates data into actionable insights. \nDevelop financial and data models and tools that provide a platform for decision making on a variety of business issues. \nBuild and lead the preparation and publishing of metric forecasting and reporting for internal customers. \nLeverage knowledge of Excel, SQL, Python, etc to build scalable global tools Financial Analyst Google August 2011  – Present (4 years) Dublin I support the Google AdWords business by providing actionable insights to drive the business forward. As a Financial Analyst I am a valued partner to the Senior Sales Management teams. I am called upon to build complex scenarios analyses that serve as the basis for recommendations that leaders of the business draw from to make critical strategic decisions. The output of my work is highly visible and has significant global impact. A master juggler working on multiple projects at a time, I can jump from deep analysis or systems development to face to face meetings with senior management while all the time maintaining a consistently high level of attention to detail while finding creative ways to tackle new challenges. \n \nResponsibilities: \n \nDefine, analyse and communicate key metrics and business trends for Sales management teams. \nExecute sophisticated quantitative analyses and advanced modeling that translates data into actionable insights. \nDevelop financial and data models and tools that provide a platform for decision making on a variety of business issues. \nBuild and lead the preparation and publishing of metric forecasting and reporting for internal customers. \nLeverage knowledge of Excel, SQL, Python, etc to build scalable global tools Senior Business Analyst - AdSense Google January 2009  –  August 2011  (2 years 8 months) Lead Analyst for the global AdSense account management team. \nResearch and analyze key business drivers, competitive environment, trends and operating metrics. \nProduction of revenue and KPI reports and dashboards providing regular insights to senior management on the business. \nDevelopment of data models and tools that provide a platform for decision making on a variety of operational issues. \nExecute sophisticated quantitative & statistical analyses and advanced modeling that translates data into actionable insights. \nProvide those insights to account management teams to support sales activities - lead generation, upsells, cross-sells. \nPlay a key role in target setting and performance measurement for sales team. \nMeasure Revenue and ROI from global sales initiatives and events. \nProduction, coordination and presentation of global business reviews. (Open) 2 recommendations Pavel Gusev Experienced business intelligence professional I had a very positive experience to work with Andrew for 4.5 years in Google. We worked together on numerous analytical... View Colm Ó Muiré Programme Manager at Google I have had the pleasure of working closely with Andrew Miller over the past four years or so, and I have found him to be... View Senior Business Analyst - AdSense Google January 2009  –  August 2011  (2 years 8 months) Lead Analyst for the global AdSense account management team. \nResearch and analyze key business drivers, competitive environment, trends and operating metrics. \nProduction of revenue and KPI reports and dashboards providing regular insights to senior management on the business. \nDevelopment of data models and tools that provide a platform for decision making on a variety of operational issues. \nExecute sophisticated quantitative & statistical analyses and advanced modeling that translates data into actionable insights. \nProvide those insights to account management teams to support sales activities - lead generation, upsells, cross-sells. \nPlay a key role in target setting and performance measurement for sales team. \nMeasure Revenue and ROI from global sales initiatives and events. \nProduction, coordination and presentation of global business reviews. (Open) 2 recommendations Pavel Gusev Experienced business intelligence professional I had a very positive experience to work with Andrew for 4.5 years in Google. We worked together on numerous analytical... View Colm Ó Muiré Programme Manager at Google I have had the pleasure of working closely with Andrew Miller over the past four years or so, and I have found him to be... View Technical Account Manager - AdSense Google February 2007  –  January 2009  (2 years) Managing technical relationship with AdSense partners from technical implementation to on-going technology communications. Assisting partners in implementing and launching new products and services. Building successful, long-term relationships with partners. Liaison between partners and Product Management team. Played a key role in the global launch of the AdSense product for mobile devices (Mobile AFC). Delivered product training to the sales team. \nSpecial projects involving quantitative analysis, industry research, and strategy development. Developing upsell strategies to drive new business opportunities, and maximizing the monetization of the online services. \nAccount management of a portfolio of large UK AdSense partners - working with major website owners to monetise their inventory through AdSense. Upselling AdSense and cross-selling other Google products. (Open) 2 recommendations Lucy Prendeville Team Sales Business Manager at Under Armour Andrew is a great team player, he balances complicated product launches with daily technical flareups for a range of... View Ellen Ten Hove Category Manager Flowers at Greetz I know Andrew as a very bright and strong contributor to the workforce in Google. We worked together on several projects and... View Technical Account Manager - AdSense Google February 2007  –  January 2009  (2 years) Managing technical relationship with AdSense partners from technical implementation to on-going technology communications. Assisting partners in implementing and launching new products and services. Building successful, long-term relationships with partners. Liaison between partners and Product Management team. Played a key role in the global launch of the AdSense product for mobile devices (Mobile AFC). Delivered product training to the sales team. \nSpecial projects involving quantitative analysis, industry research, and strategy development. Developing upsell strategies to drive new business opportunities, and maximizing the monetization of the online services. \nAccount management of a portfolio of large UK AdSense partners - working with major website owners to monetise their inventory through AdSense. Upselling AdSense and cross-selling other Google products. (Open) 2 recommendations Lucy Prendeville Team Sales Business Manager at Under Armour Andrew is a great team player, he balances complicated product launches with daily technical flareups for a range of... View Ellen Ten Hove Category Manager Flowers at Greetz I know Andrew as a very bright and strong contributor to the workforce in Google. We worked together on several projects and... View Application Engineer Microsoft 2006  –  2007  (1 year) Vendor management - Technical liason between Microsoft core team (US) and external localisation vendors (Europe) for Office 2007 Sharepoint Portal Server. Investigation and resolution of technical issues to support external vendors. Escalation of internationalization issues to core team, monitoring these issues and communicating with both groups until resolution. \n \nLab management - Installation, provisioning and maintenance of international server labs to enable the testing and engineering of MS Office 2007 server products. (Open) 2 recommendations Breda O'Connell Consultant Business Analyst at Spencer Stuart Andrew was employed in Microsoft as member of a team charged with delivering a variety of components of MS Office 2007 in a... View James Ferris Lead Production Manager at Houghton Mifflin Harcourt I have worked with Andrew on a number of occasions in various roles. I have always found him to be an excellent team player... View Application Engineer Microsoft 2006  –  2007  (1 year) Vendor management - Technical liason between Microsoft core team (US) and external localisation vendors (Europe) for Office 2007 Sharepoint Portal Server. Investigation and resolution of technical issues to support external vendors. Escalation of internationalization issues to core team, monitoring these issues and communicating with both groups until resolution. \n \nLab management - Installation, provisioning and maintenance of international server labs to enable the testing and engineering of MS Office 2007 server products. (Open) 2 recommendations Breda O'Connell Consultant Business Analyst at Spencer Stuart Andrew was employed in Microsoft as member of a team charged with delivering a variety of components of MS Office 2007 in a... View James Ferris Lead Production Manager at Houghton Mifflin Harcourt I have worked with Andrew on a number of occasions in various roles. I have always found him to be an excellent team player... View Technical Specialist Connect Global Solutions 1998  –  2004  (6 years) Connect Global Solutions was a software localization services company. I was one of the 10 founding members when this company started up in 1998. The company grew to over 50 employees by the time I left to pursue an MBA.  \n \nClients included: \nApple, IBM, Symantec, AutoDesk, AOL, Microsoft (Visio), Canon \n \nRoles included: \nSoftware localization and internationalization \nTeam Leading \nProject Management \nRelationship Management \nProject Analysis \nTechnical Analysis \nBusiness Development \nApplication Development (Open) 1 recommendation Anna Coffey Technical Training Lead at Irish Water / Uisce Eireann Being teamed with Andy on a variety of international projects was always a pleasure as you were confident that his strong work ethic, technical skills and commitment to a project would ensure consistently great results. View Technical Specialist Connect Global Solutions 1998  –  2004  (6 years) Connect Global Solutions was a software localization services company. I was one of the 10 founding members when this company started up in 1998. The company grew to over 50 employees by the time I left to pursue an MBA.  \n \nClients included: \nApple, IBM, Symantec, AutoDesk, AOL, Microsoft (Visio), Canon \n \nRoles included: \nSoftware localization and internationalization \nTeam Leading \nProject Management \nRelationship Management \nProject Analysis \nTechnical Analysis \nBusiness Development \nApplication Development (Open) 1 recommendation Anna Coffey Technical Training Lead at Irish Water / Uisce Eireann Being teamed with Andy on a variety of international projects was always a pleasure as you were confident that his strong work ethic, technical skills and commitment to a project would ensure consistently great results. View Software Engineer Claris Ireland 1996  –  1998  (2 years) Claris was the software subsidiary of Apple Computers. All Apple software was marketed through Claris.  \n \nPrimary localisation engineer for FileMaker Pro (database application) and Claris Homepage (WYSIWYG HTML editor) on Mac and PC. Configured and recompiled build environments. Investigated and resolved software bugs. \nVendor support – provided detailed technical instructions and ongoing technical support to outsourcing vendors. (Open) 1 recommendation Steve Prior Project Manager at Citco Corporate and Trust Andrew is a hard worker and very able software engineer. He took on any task given to him and showed great initiative in acomplishing his objectives. He is also an excellent team player who worked well with all of his co-workers. View Software Engineer Claris Ireland 1996  –  1998  (2 years) Claris was the software subsidiary of Apple Computers. All Apple software was marketed through Claris.  \n \nPrimary localisation engineer for FileMaker Pro (database application) and Claris Homepage (WYSIWYG HTML editor) on Mac and PC. Configured and recompiled build environments. Investigated and resolved software bugs. \nVendor support – provided detailed technical instructions and ongoing technical support to outsourcing vendors. (Open) 1 recommendation Steve Prior Project Manager at Citco Corporate and Trust Andrew is a hard worker and very able software engineer. He took on any task given to him and showed great initiative in acomplishing his objectives. He is also an excellent team player who worked well with all of his co-workers. View Skills Top Skills 16 Online Advertising 13 Mobile Devices 11 Business Analysis 5 Google Analytics 5 Microsoft Excel 4 Project Management 4 Business Strategy 4 Strategy 3 Management 2 Google Adwords Andrew also knows about... 2 Product Management 1 Java 1 Vendor Management 1 JavaScript 1 HTML 1 MySQL 1 Data Warehousing 1 Ruby on Rails 1 Account Management 1 Digital Marketing Skills  Top Skills 16 Online Advertising 13 Mobile Devices 11 Business Analysis 5 Google Analytics 5 Microsoft Excel 4 Project Management 4 Business Strategy 4 Strategy 3 Management 2 Google Adwords Andrew also knows about... 2 Product Management 1 Java 1 Vendor Management 1 JavaScript 1 HTML 1 MySQL 1 Data Warehousing 1 Ruby on Rails 1 Account Management 1 Digital Marketing Top Skills 16 Online Advertising 13 Mobile Devices 11 Business Analysis 5 Google Analytics 5 Microsoft Excel 4 Project Management 4 Business Strategy 4 Strategy 3 Management 2 Google Adwords Andrew also knows about... 2 Product Management 1 Java 1 Vendor Management 1 JavaScript 1 HTML 1 MySQL 1 Data Warehousing 1 Ruby on Rails 1 Account Management 1 Digital Marketing Top Skills 16 Online Advertising 13 Mobile Devices 11 Business Analysis 5 Google Analytics 5 Microsoft Excel 4 Project Management 4 Business Strategy 4 Strategy 3 Management 2 Google Adwords Andrew also knows about... 2 Product Management 1 Java 1 Vendor Management 1 JavaScript 1 HTML 1 MySQL 1 Data Warehousing 1 Ruby on Rails 1 Account Management 1 Digital Marketing                     2 Product Management 1 Java 1 Vendor Management 1 JavaScript 1 HTML 1 MySQL 1 Data Warehousing 1 Ruby on Rails 1 Account Management 1 Digital Marketing Education University College Dublin MBA,  Business ,  Management ,  Finance ,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. (Open) 2 recommendations Eamon McGoldrick Head of Finance, Willis Ireland I studied with Andrew during an intensive year on the full time MBA course at the UCD Smurfit School of Business. Over this... View Dermot O'Toole Head of Retail & Marketing at The Maxol Group I studied for a year with Andrew at UCD for our MBA. Andrew and I worked together on a number of group projects and... View The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. University College Dublin MBA,  Business ,  Management ,  Finance ,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. (Open) 2 recommendations Eamon McGoldrick Head of Finance, Willis Ireland I studied with Andrew during an intensive year on the full time MBA course at the UCD Smurfit School of Business. Over this... View Dermot O'Toole Head of Retail & Marketing at The Maxol Group I studied for a year with Andrew at UCD for our MBA. Andrew and I worked together on a number of group projects and... View University College Dublin MBA,  Business ,  Management ,  Finance ,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. (Open) 2 recommendations Eamon McGoldrick Head of Finance, Willis Ireland I studied with Andrew during an intensive year on the full time MBA course at the UCD Smurfit School of Business. Over this... View Dermot O'Toole Head of Retail & Marketing at The Maxol Group I studied for a year with Andrew at UCD for our MBA. Andrew and I worked together on a number of group projects and... View University College Dublin MBA,  Business ,  Management ,  Finance ,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. (Open) 2 recommendations Eamon McGoldrick Head of Finance, Willis Ireland I studied with Andrew during an intensive year on the full time MBA course at the UCD Smurfit School of Business. Over this... View Dermot O'Toole Head of Retail & Marketing at The Maxol Group I studied for a year with Andrew at UCD for our MBA. Andrew and I worked together on a number of group projects and... View The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. Honors & Awards Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) ", "Experience Program Manager, Global Payments Google November 2014  – Present (9 months) Mountain View, CA Enterprise Program Manager, Cloud Platform Google May 2013  –  October 2014  (1 year 6 months) Business Intelligence Project Manager Google February 2011  –  April 2013  (2 years 3 months) Finance Project Analyst Google May 2010  –  February 2011  (10 months) Finance Operations Analyst Google November 2008  –  May 2010  (1 year 7 months) Associate Finance Operations Analyst Google September 2006  –  November 2008  (2 years 3 months) Student Dancer San Francisco Ballet September 1996  –  June 1998  (1 year 10 months) Student Dancer American Ballet Theatre July 1997  –  August 1997  (2 months) Program Manager, Global Payments Google November 2014  – Present (9 months) Mountain View, CA Program Manager, Global Payments Google November 2014  – Present (9 months) Mountain View, CA Enterprise Program Manager, Cloud Platform Google May 2013  –  October 2014  (1 year 6 months) Enterprise Program Manager, Cloud Platform Google May 2013  –  October 2014  (1 year 6 months) Business Intelligence Project Manager Google February 2011  –  April 2013  (2 years 3 months) Business Intelligence Project Manager Google February 2011  –  April 2013  (2 years 3 months) Finance Project Analyst Google May 2010  –  February 2011  (10 months) Finance Project Analyst Google May 2010  –  February 2011  (10 months) Finance Operations Analyst Google November 2008  –  May 2010  (1 year 7 months) Finance Operations Analyst Google November 2008  –  May 2010  (1 year 7 months) Associate Finance Operations Analyst Google September 2006  –  November 2008  (2 years 3 months) Associate Finance Operations Analyst Google September 2006  –  November 2008  (2 years 3 months) Student Dancer San Francisco Ballet September 1996  –  June 1998  (1 year 10 months) Student Dancer San Francisco Ballet September 1996  –  June 1998  (1 year 10 months) Student Dancer American Ballet Theatre July 1997  –  August 1997  (2 months) Student Dancer American Ballet Theatre July 1997  –  August 1997  (2 months) Skills Top Skills 25 Analytics 23 Business Intelligence 11 Google Adwords 11 Google Analytics 11 E-commerce 10 Web Analytics 10 Online Advertising 8 Project Management 6 Data Analysis 6 Product Management Marina also knows about... 5 SQL 5 Program Management 4 Lead Generation 3 Data Mining 3 Business Analysis 3 Search Advertising 3 Mobile Marketing 3 Mobile Advertising 3 Competitive Analysis 3 Mobile Devices 3 CRM 2 Omniture 2 Conversion Optimization 2 Web Development 1 Affiliate Marketing 0 Project Planning See 1+     See less Skills  Top Skills 25 Analytics 23 Business Intelligence 11 Google Adwords 11 Google Analytics 11 E-commerce 10 Web Analytics 10 Online Advertising 8 Project Management 6 Data Analysis 6 Product Management Marina also knows about... 5 SQL 5 Program Management 4 Lead Generation 3 Data Mining 3 Business Analysis 3 Search Advertising 3 Mobile Marketing 3 Mobile Advertising 3 Competitive Analysis 3 Mobile Devices 3 CRM 2 Omniture 2 Conversion Optimization 2 Web Development 1 Affiliate Marketing 0 Project Planning See 1+     See less Top Skills 25 Analytics 23 Business Intelligence 11 Google Adwords 11 Google Analytics 11 E-commerce 10 Web Analytics 10 Online Advertising 8 Project Management 6 Data Analysis 6 Product Management Marina also knows about... 5 SQL 5 Program Management 4 Lead Generation 3 Data Mining 3 Business Analysis 3 Search Advertising 3 Mobile Marketing 3 Mobile Advertising 3 Competitive Analysis 3 Mobile Devices 3 CRM 2 Omniture 2 Conversion Optimization 2 Web Development 1 Affiliate Marketing 0 Project Planning See 1+     See less Top Skills 25 Analytics 23 Business Intelligence 11 Google Adwords 11 Google Analytics 11 E-commerce 10 Web Analytics 10 Online Advertising 8 Project Management 6 Data Analysis 6 Product Management Marina also knows about... 5 SQL 5 Program Management 4 Lead Generation 3 Data Mining 3 Business Analysis 3 Search Advertising 3 Mobile Marketing 3 Mobile Advertising 3 Competitive Analysis 3 Mobile Devices 3 CRM 2 Omniture 2 Conversion Optimization 2 Web Development 1 Affiliate Marketing 0 Project Planning See 1+     See less                     5 SQL 5 Program Management 4 Lead Generation 3 Data Mining 3 Business Analysis 3 Search Advertising 3 Mobile Marketing 3 Mobile Advertising 3 Competitive Analysis 3 Mobile Devices 3 CRM 2 Omniture 2 Conversion Optimization 2 Web Development 1 Affiliate Marketing 0 Project Planning Education Santa Clara University Master of Science,  Engineering Management and Leadership , GPA: 3.8 - Completed 12 units 2010  – 2012 University of San Diego BS,  Political Science ,  Mathematics ,  Philosophy 2000  – 2005 Activities and Societies:  Phi Alpha Delta Law Coed Fraternity ,  International - San Diego ,  CA (2004-2005) University of California, Berkeley Santa Clara University Master of Science,  Engineering Management and Leadership , GPA: 3.8 - Completed 12 units 2010  – 2012 Santa Clara University Master of Science,  Engineering Management and Leadership , GPA: 3.8 - Completed 12 units 2010  – 2012 Santa Clara University Master of Science,  Engineering Management and Leadership , GPA: 3.8 - Completed 12 units 2010  – 2012 University of San Diego BS,  Political Science ,  Mathematics ,  Philosophy 2000  – 2005 Activities and Societies:  Phi Alpha Delta Law Coed Fraternity ,  International - San Diego ,  CA (2004-2005) University of San Diego BS,  Political Science ,  Mathematics ,  Philosophy 2000  – 2005 Activities and Societies:  Phi Alpha Delta Law Coed Fraternity ,  International - San Diego ,  CA (2004-2005) University of San Diego BS,  Political Science ,  Mathematics ,  Philosophy 2000  – 2005 Activities and Societies:  Phi Alpha Delta Law Coed Fraternity ,  International - San Diego ,  CA (2004-2005) University of California, Berkeley University of California, Berkeley University of California, Berkeley ", "Summary Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Summary Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Experience Senior Global Process Manager Google May 2015  – Present (3 months) Finance Operations Manager Google November 2013  –  April 2015  (1 year 6 months) Dublin Senior Finance Operations Analyst Google August 2011  –  October 2013  (2 years 3 months) Dublin (Open) 1 honor or award Patent Award View (Open) 1 recommendation Naga THANY Digital Marketing Executive Olivier has been my manager while I was working on a global collection project.\nI have been impressed by his common sense to resolve many critical problems with simple steps. His business acumen and relationship management abilities are truly... View Credit Risk Manager Accenture October 2006  –  July 2011  (4 years 10 months) Dublin (Open) 1 honor or award Best Risk Analyst in Ireland Nominated for Best Risk Analyst in Ireland by IICM View (Open) 1 recommendation Benjamin Felci Product Manager at S4M Olivier is dedicated and commited in all his professional endeavours. He is always ready to help and give support to his fellow colleagues in all matters either work-related or not. I have often seen him going the extra mile in order to produce the... View Accounting Control Specialist Hertz Europe Service Center August 2005  –  October 2006  (1 year 3 months) Dublin Senior Global Process Manager Google May 2015  – Present (3 months) Senior Global Process Manager Google May 2015  – Present (3 months) Finance Operations Manager Google November 2013  –  April 2015  (1 year 6 months) Dublin Finance Operations Manager Google November 2013  –  April 2015  (1 year 6 months) Dublin Senior Finance Operations Analyst Google August 2011  –  October 2013  (2 years 3 months) Dublin (Open) 1 honor or award Patent Award View (Open) 1 recommendation Naga THANY Digital Marketing Executive Olivier has been my manager while I was working on a global collection project.\nI have been impressed by his common sense to resolve many critical problems with simple steps. His business acumen and relationship management abilities are truly... View Senior Finance Operations Analyst Google August 2011  –  October 2013  (2 years 3 months) Dublin (Open) 1 honor or award Patent Award View (Open) 1 recommendation Naga THANY Digital Marketing Executive Olivier has been my manager while I was working on a global collection project.\nI have been impressed by his common sense to resolve many critical problems with simple steps. His business acumen and relationship management abilities are truly... View Credit Risk Manager Accenture October 2006  –  July 2011  (4 years 10 months) Dublin (Open) 1 honor or award Best Risk Analyst in Ireland Nominated for Best Risk Analyst in Ireland by IICM View (Open) 1 recommendation Benjamin Felci Product Manager at S4M Olivier is dedicated and commited in all his professional endeavours. He is always ready to help and give support to his fellow colleagues in all matters either work-related or not. I have often seen him going the extra mile in order to produce the... View Credit Risk Manager Accenture October 2006  –  July 2011  (4 years 10 months) Dublin (Open) 1 honor or award Best Risk Analyst in Ireland Nominated for Best Risk Analyst in Ireland by IICM View (Open) 1 recommendation Benjamin Felci Product Manager at S4M Olivier is dedicated and commited in all his professional endeavours. He is always ready to help and give support to his fellow colleagues in all matters either work-related or not. I have often seen him going the extra mile in order to produce the... View Accounting Control Specialist Hertz Europe Service Center August 2005  –  October 2006  (1 year 3 months) Dublin Accounting Control Specialist Hertz Europe Service Center August 2005  –  October 2006  (1 year 3 months) Dublin Languages French Spanish French Spanish French Spanish Skills Top Skills 13 Credit Risk 6 Financial Analysis 4 Visio 4 SAP 4 Microsoft Excel 3 Financial Reporting 3 CRM 3 Project Management 2 Microsoft Office 2 Credit Olivier also knows about... 2 Accounts Receivable 2 Finance 2 Process Improvement 1 Photoshop 1 Accounting 1 PowerPoint 1 Outlook 1 Windows 1 Supervisory Skills 1 English 1 Forecasting 1 Risk Management 0 Customer Relations 0 SAP R/3 0 Operational Excellence 0 InDesign 0 QuarkXPress 0 EU 0 Excel 0 Word 0 MS Project 0 Budgeting 0 Market Risk 0 Adobe Acrobat 0 Contract Management 0 ERP 0 Basel II 0 SharePoint 0 Dreamweaver See 14+     See less Skills  Top Skills 13 Credit Risk 6 Financial Analysis 4 Visio 4 SAP 4 Microsoft Excel 3 Financial Reporting 3 CRM 3 Project Management 2 Microsoft Office 2 Credit Olivier also knows about... 2 Accounts Receivable 2 Finance 2 Process Improvement 1 Photoshop 1 Accounting 1 PowerPoint 1 Outlook 1 Windows 1 Supervisory Skills 1 English 1 Forecasting 1 Risk Management 0 Customer Relations 0 SAP R/3 0 Operational Excellence 0 InDesign 0 QuarkXPress 0 EU 0 Excel 0 Word 0 MS Project 0 Budgeting 0 Market Risk 0 Adobe Acrobat 0 Contract Management 0 ERP 0 Basel II 0 SharePoint 0 Dreamweaver See 14+     See less Top Skills 13 Credit Risk 6 Financial Analysis 4 Visio 4 SAP 4 Microsoft Excel 3 Financial Reporting 3 CRM 3 Project Management 2 Microsoft Office 2 Credit Olivier also knows about... 2 Accounts Receivable 2 Finance 2 Process Improvement 1 Photoshop 1 Accounting 1 PowerPoint 1 Outlook 1 Windows 1 Supervisory Skills 1 English 1 Forecasting 1 Risk Management 0 Customer Relations 0 SAP R/3 0 Operational Excellence 0 InDesign 0 QuarkXPress 0 EU 0 Excel 0 Word 0 MS Project 0 Budgeting 0 Market Risk 0 Adobe Acrobat 0 Contract Management 0 ERP 0 Basel II 0 SharePoint 0 Dreamweaver See 14+     See less Top Skills 13 Credit Risk 6 Financial Analysis 4 Visio 4 SAP 4 Microsoft Excel 3 Financial Reporting 3 CRM 3 Project Management 2 Microsoft Office 2 Credit Olivier also knows about... 2 Accounts Receivable 2 Finance 2 Process Improvement 1 Photoshop 1 Accounting 1 PowerPoint 1 Outlook 1 Windows 1 Supervisory Skills 1 English 1 Forecasting 1 Risk Management 0 Customer Relations 0 SAP R/3 0 Operational Excellence 0 InDesign 0 QuarkXPress 0 EU 0 Excel 0 Word 0 MS Project 0 Budgeting 0 Market Risk 0 Adobe Acrobat 0 Contract Management 0 ERP 0 Basel II 0 SharePoint 0 Dreamweaver See 14+     See less                     2 Accounts Receivable 2 Finance 2 Process Improvement 1 Photoshop 1 Accounting 1 PowerPoint 1 Outlook 1 Windows 1 Supervisory Skills 1 English 1 Forecasting 1 Risk Management 0 Customer Relations 0 SAP R/3 0 Operational Excellence 0 InDesign 0 QuarkXPress 0 EU 0 Excel 0 Word 0 MS Project 0 Budgeting 0 Market Risk 0 Adobe Acrobat 0 Contract Management 0 ERP 0 Basel II 0 SharePoint 0 Dreamweaver Honors & Awards Patent Award Google March 2012 Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM Patent Award Google March 2012 Patent Award Google March 2012 Patent Award Google March 2012 Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM ", "Experience Real Estate Portfolio Analyst Google September 2013  – Present (1 year 11 months) Finance Operations Analyst Google January 2011  –  August 2013  (2 years 8 months) Financial Analyst Wells Fargo July 2008  –  January 2011  (2 years 7 months) Summer Analyst Wells Fargo June 2007  –  September 2007  (4 months) Real Estate Portfolio Analyst Google September 2013  – Present (1 year 11 months) Real Estate Portfolio Analyst Google September 2013  – Present (1 year 11 months) Finance Operations Analyst Google January 2011  –  August 2013  (2 years 8 months) Finance Operations Analyst Google January 2011  –  August 2013  (2 years 8 months) Financial Analyst Wells Fargo July 2008  –  January 2011  (2 years 7 months) Financial Analyst Wells Fargo July 2008  –  January 2011  (2 years 7 months) Summer Analyst Wells Fargo June 2007  –  September 2007  (4 months) Summer Analyst Wells Fargo June 2007  –  September 2007  (4 months) Skills 5 Financial Analysis 4 Financial Modeling 3 Corporate Finance 2 Data Analysis 1 Financial Reporting 1 Entrepreneurship 1 Analytics 1 Valuation 1 Competitive Analysis Skills  5 Financial Analysis 4 Financial Modeling 3 Corporate Finance 2 Data Analysis 1 Financial Reporting 1 Entrepreneurship 1 Analytics 1 Valuation 1 Competitive Analysis 5 Financial Analysis 4 Financial Modeling 3 Corporate Finance 2 Data Analysis 1 Financial Reporting 1 Entrepreneurship 1 Analytics 1 Valuation 1 Competitive Analysis 5 Financial Analysis 4 Financial Modeling 3 Corporate Finance 2 Data Analysis 1 Financial Reporting 1 Entrepreneurship 1 Analytics 1 Valuation 1 Competitive Analysis                   Education University of California, Los Angeles Business Economics ,  Education 2004  – 2008 University of California, Los Angeles Business Economics ,  Education 2004  – 2008 University of California, Los Angeles Business Economics ,  Education 2004  – 2008 University of California, Los Angeles Business Economics ,  Education 2004  – 2008 ", "Experience Global Process Manager, Finance Operations Google May 2013  – Present (2 years 3 months) Mountain View, California Senior Finance Operations Analyst Google December 2011  –  April 2013  (1 year 5 months) Mountain View, California Finance Ops Specialist I and II - Mergers and Acquisitions Google November 2008  –  December 2011  (3 years 2 months) Dublin, Ireland Billing Specialist Google June 2007  –  October 2008  (1 year 5 months) Dublin, Ireland Accountant Volvo Polska Sp. z o.o. - Volvo Business Services August 2005  –  June 2007  (1 year 11 months) Wroclaw, Lower Silesian District, Poland Global Process Manager, Finance Operations Google May 2013  – Present (2 years 3 months) Mountain View, California Global Process Manager, Finance Operations Google May 2013  – Present (2 years 3 months) Mountain View, California Senior Finance Operations Analyst Google December 2011  –  April 2013  (1 year 5 months) Mountain View, California Senior Finance Operations Analyst Google December 2011  –  April 2013  (1 year 5 months) Mountain View, California Finance Ops Specialist I and II - Mergers and Acquisitions Google November 2008  –  December 2011  (3 years 2 months) Dublin, Ireland Finance Ops Specialist I and II - Mergers and Acquisitions Google November 2008  –  December 2011  (3 years 2 months) Dublin, Ireland Billing Specialist Google June 2007  –  October 2008  (1 year 5 months) Dublin, Ireland Billing Specialist Google June 2007  –  October 2008  (1 year 5 months) Dublin, Ireland Accountant Volvo Polska Sp. z o.o. - Volvo Business Services August 2005  –  June 2007  (1 year 11 months) Wroclaw, Lower Silesian District, Poland Accountant Volvo Polska Sp. z o.o. - Volvo Business Services August 2005  –  June 2007  (1 year 11 months) Wroclaw, Lower Silesian District, Poland Languages English Full professional proficiency Polish Native or bilingual proficiency English Full professional proficiency Polish Native or bilingual proficiency English Full professional proficiency Polish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Top Skills 2 Process Improvement 2 Project Management 0 Strategy 0 Business Process... 0 Business Strategy 1 Program Management 0 Customer Service 0 Mergers & Acquisitions 2 Financial Analysis 1 Finance Ewa also knows about... 1 Business Analysis 1 Cross-functional Team... Skills  Top Skills 2 Process Improvement 2 Project Management 0 Strategy 0 Business Process... 0 Business Strategy 1 Program Management 0 Customer Service 0 Mergers & Acquisitions 2 Financial Analysis 1 Finance Ewa also knows about... 1 Business Analysis 1 Cross-functional Team... Top Skills 2 Process Improvement 2 Project Management 0 Strategy 0 Business Process... 0 Business Strategy 1 Program Management 0 Customer Service 0 Mergers & Acquisitions 2 Financial Analysis 1 Finance Ewa also knows about... 1 Business Analysis 1 Cross-functional Team... Top Skills 2 Process Improvement 2 Project Management 0 Strategy 0 Business Process... 0 Business Strategy 1 Program Management 0 Customer Service 0 Mergers & Acquisitions 2 Financial Analysis 1 Finance Ewa also knows about... 1 Business Analysis 1 Cross-functional Team...                     1 Business Analysis 1 Cross-functional Team... Education Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 ", "Experience M&A Finance Integration Senior Analyst Google April 2015  – Present (4 months) Finance Operations Analyst Google September 2008  – Present (6 years 11 months) Advisory Associate PricewaterhouseCoopers July 2007  –  September 2008  (1 year 3 months) M&A Finance Integration Senior Analyst Google April 2015  – Present (4 months) M&A Finance Integration Senior Analyst Google April 2015  – Present (4 months) Finance Operations Analyst Google September 2008  – Present (6 years 11 months) Finance Operations Analyst Google September 2008  – Present (6 years 11 months) Advisory Associate PricewaterhouseCoopers July 2007  –  September 2008  (1 year 3 months) Advisory Associate PricewaterhouseCoopers July 2007  –  September 2008  (1 year 3 months) Skills Skills     Education Santa Clara University BSc,  Accounting 2003  – 2007 Santa Clara University BSc,  Accounting 2003  – 2007 Santa Clara University BSc,  Accounting 2003  – 2007 Santa Clara University BSc,  Accounting 2003  – 2007 ", "Summary Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Summary Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Experience Senior Finance Operations Analyst Integreon (Google Inc. Vendor) January 2015  – Present (7 months) San Francisco Bay Area - Manage payroll operations of Google’s company-wide 401K plan, including process execution, coordination with stakeholders, and managing external audits; \n \n- Ensure efficiency and fluidity in payroll operations by troubleshooting unexpected roadblocks, keeping process owners accountable, and providing policy guidelines when appropriate; \n \n- Facilitate weekly management meetings to discuss open projects and issues in ongoing operations - keep track of action items and follow up with point-persons on progress; \n \n- Translate operational needs into specs needed to create systems solutions - provide assistance in design, review and testing of such solutions; \n \n- Reviewed and redesigned a key funding process which reduced lead time by 24 hours, or 100% from the previous mark. Assistant Operations Manager (Operations Strategy) APM Terminals July 2012  –  December 2014  (2 years 6 months) Greater Los Angeles Area - Plan weekly cargo movement through a 380-acre facility that handles approximately 10% of all containerized trade in the US West Coast; \n \n- Implement cost controls on a $200M operating budget, by applying understanding of productivity statistics, contractual constraints, and dependencies between separate processes; \n \n- Produce actionable recommendations through analyses of operating data, drawn through Business Intelligence tools; \n \n- Help design and implement an overhaul of the process for delivering cargo to truckers, which increased hourly labor productivity by 15%. Supervisor, Financial Planning and Contracts Total Terminals International, LLC September 2006  –  July 2012  (5 years 11 months) - Evaluate the magnitude and quality of monthly earnings through analyses of key earnings ratios and cash flow from operations; \n \n- Negotiate service rates with customers and service providers on an annual basis, with a clear understanding of revenue and cost mechanics for the business; \n \n- Present any material expansion or capital investment plans for approval by the Board of Directors through appropriate measures of financial return; \n \n- Develop annual budgets exceeding $500M in revenue for company’s portfolio of marine terminals, and forecast EBITDA on a quarterly and annual basis; \n \n- Implement a long-term strategic plan to increase annual EBITDA earnings by $30M, in transitioning company from a cost-center into a profit center; \n \n- Help devise and execute a $340M minority interest sale of the company, through close communication with stakeholders across the globe, and production of key financial models and boilerplate documents. Senior Finance Operations Analyst Integreon (Google Inc. Vendor) January 2015  – Present (7 months) San Francisco Bay Area - Manage payroll operations of Google’s company-wide 401K plan, including process execution, coordination with stakeholders, and managing external audits; \n \n- Ensure efficiency and fluidity in payroll operations by troubleshooting unexpected roadblocks, keeping process owners accountable, and providing policy guidelines when appropriate; \n \n- Facilitate weekly management meetings to discuss open projects and issues in ongoing operations - keep track of action items and follow up with point-persons on progress; \n \n- Translate operational needs into specs needed to create systems solutions - provide assistance in design, review and testing of such solutions; \n \n- Reviewed and redesigned a key funding process which reduced lead time by 24 hours, or 100% from the previous mark. Senior Finance Operations Analyst Integreon (Google Inc. Vendor) January 2015  – Present (7 months) San Francisco Bay Area - Manage payroll operations of Google’s company-wide 401K plan, including process execution, coordination with stakeholders, and managing external audits; \n \n- Ensure efficiency and fluidity in payroll operations by troubleshooting unexpected roadblocks, keeping process owners accountable, and providing policy guidelines when appropriate; \n \n- Facilitate weekly management meetings to discuss open projects and issues in ongoing operations - keep track of action items and follow up with point-persons on progress; \n \n- Translate operational needs into specs needed to create systems solutions - provide assistance in design, review and testing of such solutions; \n \n- Reviewed and redesigned a key funding process which reduced lead time by 24 hours, or 100% from the previous mark. Assistant Operations Manager (Operations Strategy) APM Terminals July 2012  –  December 2014  (2 years 6 months) Greater Los Angeles Area - Plan weekly cargo movement through a 380-acre facility that handles approximately 10% of all containerized trade in the US West Coast; \n \n- Implement cost controls on a $200M operating budget, by applying understanding of productivity statistics, contractual constraints, and dependencies between separate processes; \n \n- Produce actionable recommendations through analyses of operating data, drawn through Business Intelligence tools; \n \n- Help design and implement an overhaul of the process for delivering cargo to truckers, which increased hourly labor productivity by 15%. Assistant Operations Manager (Operations Strategy) APM Terminals July 2012  –  December 2014  (2 years 6 months) Greater Los Angeles Area - Plan weekly cargo movement through a 380-acre facility that handles approximately 10% of all containerized trade in the US West Coast; \n \n- Implement cost controls on a $200M operating budget, by applying understanding of productivity statistics, contractual constraints, and dependencies between separate processes; \n \n- Produce actionable recommendations through analyses of operating data, drawn through Business Intelligence tools; \n \n- Help design and implement an overhaul of the process for delivering cargo to truckers, which increased hourly labor productivity by 15%. Supervisor, Financial Planning and Contracts Total Terminals International, LLC September 2006  –  July 2012  (5 years 11 months) - Evaluate the magnitude and quality of monthly earnings through analyses of key earnings ratios and cash flow from operations; \n \n- Negotiate service rates with customers and service providers on an annual basis, with a clear understanding of revenue and cost mechanics for the business; \n \n- Present any material expansion or capital investment plans for approval by the Board of Directors through appropriate measures of financial return; \n \n- Develop annual budgets exceeding $500M in revenue for company’s portfolio of marine terminals, and forecast EBITDA on a quarterly and annual basis; \n \n- Implement a long-term strategic plan to increase annual EBITDA earnings by $30M, in transitioning company from a cost-center into a profit center; \n \n- Help devise and execute a $340M minority interest sale of the company, through close communication with stakeholders across the globe, and production of key financial models and boilerplate documents. Supervisor, Financial Planning and Contracts Total Terminals International, LLC September 2006  –  July 2012  (5 years 11 months) - Evaluate the magnitude and quality of monthly earnings through analyses of key earnings ratios and cash flow from operations; \n \n- Negotiate service rates with customers and service providers on an annual basis, with a clear understanding of revenue and cost mechanics for the business; \n \n- Present any material expansion or capital investment plans for approval by the Board of Directors through appropriate measures of financial return; \n \n- Develop annual budgets exceeding $500M in revenue for company’s portfolio of marine terminals, and forecast EBITDA on a quarterly and annual basis; \n \n- Implement a long-term strategic plan to increase annual EBITDA earnings by $30M, in transitioning company from a cost-center into a profit center; \n \n- Help devise and execute a $340M minority interest sale of the company, through close communication with stakeholders across the globe, and production of key financial models and boilerplate documents. Languages Korean Korean Korean Skills Top Skills 7 Operations Management 4 Contract Management 4 Financial Analysis 3 Logistics Management 3 Budgets 3 Analysis 2 Supply Chain Management 1 Business Planning 0 Oracle E-Business Suite 0 Financial Reporting Ji (Paul) also knows about... 0 Business Objects 0 Financial Audits 0 Budget Setting 0 Budget Monitoring 0 Supply Chain Operations Skills  Top Skills 7 Operations Management 4 Contract Management 4 Financial Analysis 3 Logistics Management 3 Budgets 3 Analysis 2 Supply Chain Management 1 Business Planning 0 Oracle E-Business Suite 0 Financial Reporting Ji (Paul) also knows about... 0 Business Objects 0 Financial Audits 0 Budget Setting 0 Budget Monitoring 0 Supply Chain Operations Top Skills 7 Operations Management 4 Contract Management 4 Financial Analysis 3 Logistics Management 3 Budgets 3 Analysis 2 Supply Chain Management 1 Business Planning 0 Oracle E-Business Suite 0 Financial Reporting Ji (Paul) also knows about... 0 Business Objects 0 Financial Audits 0 Budget Setting 0 Budget Monitoring 0 Supply Chain Operations Top Skills 7 Operations Management 4 Contract Management 4 Financial Analysis 3 Logistics Management 3 Budgets 3 Analysis 2 Supply Chain Management 1 Business Planning 0 Oracle E-Business Suite 0 Financial Reporting Ji (Paul) also knows about... 0 Business Objects 0 Financial Audits 0 Budget Setting 0 Budget Monitoring 0 Supply Chain Operations                     0 Business Objects 0 Financial Audits 0 Budget Setting 0 Budget Monitoring 0 Supply Chain Operations Education UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 California State University-Long Beach Global Logistics Specialist,  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2009 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 California State University-Long Beach Global Logistics Specialist,  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2009 California State University-Long Beach Global Logistics Specialist,  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2009 California State University-Long Beach Global Logistics Specialist,  Logistics ,  Materials ,  and Supply Chain Management 2008  – 2009 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 ", "Experience Program Manager - Finance Ops Google October 2013  – Present (1 year 10 months) Mountain View, California Finance Operations Analyst Google January 2011  –  October 2013  (2 years 10 months) Mountain View, CA Assistant Manager II Comerica Bank April 2009  –  January 2011  (1 year 10 months) (Open) 3 recommendations, including: Estrella Fratangelo Recruiter at Kaplan University I had the pleasure of knowing and working with Kate Aguis at Comerica Bank. Kate was always highly respected by her... View Carlton Watson Attorney at Vandeveer Garzia, PC Kate, over the past 3 years, has been an asset to Comerica Bank. She has shown definite leadership abilities through sales... View 1 more recommendation Assistant Manager I Comerica Bank May 2008  –  April 2009  (1 year) Management Trainee Comerica Bank June 2007  –  May 2008  (1 year) Account Coordinator Intern BBDO Detroit May 2006  –  August 2006  (4 months) Program Manager - Finance Ops Google October 2013  – Present (1 year 10 months) Mountain View, California Program Manager - Finance Ops Google October 2013  – Present (1 year 10 months) Mountain View, California Finance Operations Analyst Google January 2011  –  October 2013  (2 years 10 months) Mountain View, CA Finance Operations Analyst Google January 2011  –  October 2013  (2 years 10 months) Mountain View, CA Assistant Manager II Comerica Bank April 2009  –  January 2011  (1 year 10 months) (Open) 3 recommendations, including: Estrella Fratangelo Recruiter at Kaplan University I had the pleasure of knowing and working with Kate Aguis at Comerica Bank. Kate was always highly respected by her... View Carlton Watson Attorney at Vandeveer Garzia, PC Kate, over the past 3 years, has been an asset to Comerica Bank. She has shown definite leadership abilities through sales... View 1 more recommendation Assistant Manager II Comerica Bank April 2009  –  January 2011  (1 year 10 months) (Open) 3 recommendations, including: Estrella Fratangelo Recruiter at Kaplan University I had the pleasure of knowing and working with Kate Aguis at Comerica Bank. Kate was always highly respected by her... View Carlton Watson Attorney at Vandeveer Garzia, PC Kate, over the past 3 years, has been an asset to Comerica Bank. She has shown definite leadership abilities through sales... View 1 more recommendation Assistant Manager I Comerica Bank May 2008  –  April 2009  (1 year) Assistant Manager I Comerica Bank May 2008  –  April 2009  (1 year) Management Trainee Comerica Bank June 2007  –  May 2008  (1 year) Management Trainee Comerica Bank June 2007  –  May 2008  (1 year) Account Coordinator Intern BBDO Detroit May 2006  –  August 2006  (4 months) Account Coordinator Intern BBDO Detroit May 2006  –  August 2006  (4 months) Skills Top Skills 12 Management 10 Social Media 7 Customer Service 7 Training 5 Social Media Marketing 5 Sales 3 Marketing 3 New Business Development 3 Forecasting 2 Account Management Kate also knows about... 2 Banking 1 Advertising 1 Digital Marketing 1 Microsoft Excel 1 Team Building Skills  Top Skills 12 Management 10 Social Media 7 Customer Service 7 Training 5 Social Media Marketing 5 Sales 3 Marketing 3 New Business Development 3 Forecasting 2 Account Management Kate also knows about... 2 Banking 1 Advertising 1 Digital Marketing 1 Microsoft Excel 1 Team Building Top Skills 12 Management 10 Social Media 7 Customer Service 7 Training 5 Social Media Marketing 5 Sales 3 Marketing 3 New Business Development 3 Forecasting 2 Account Management Kate also knows about... 2 Banking 1 Advertising 1 Digital Marketing 1 Microsoft Excel 1 Team Building Top Skills 12 Management 10 Social Media 7 Customer Service 7 Training 5 Social Media Marketing 5 Sales 3 Marketing 3 New Business Development 3 Forecasting 2 Account Management Kate also knows about... 2 Banking 1 Advertising 1 Digital Marketing 1 Microsoft Excel 1 Team Building                     2 Banking 1 Advertising 1 Digital Marketing 1 Microsoft Excel 1 Team Building Education Michigan State University B.A. 2003  – 2007 Lakeland High School 1999  – 2003 Michigan State University B.A. 2003  – 2007 Michigan State University B.A. 2003  – 2007 Michigan State University B.A. 2003  – 2007 Lakeland High School 1999  – 2003 Lakeland High School 1999  – 2003 Lakeland High School 1999  – 2003 ", "Summary Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Summary Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Experience Product Manager Google September 2012  – Present (2 years 11 months) Mountain View, CA Ads & Commerce Group, Ads platforms (9/14-present) \nAds & Commerce Group, Payments (9/12-9/14) Finance Operations Analyst II Google, Inc. January 2011  –  September 2012  (1 year 9 months) Mountain View, CA Product Group lead for Display, GIO Team Research Analyst OECD August 2010  –  December 2010  (5 months) Paris, France Future Global Shocks project Future Global Shocks: Improving Risk Governance Edit Senior Associate The Parthenon Group September 2007  –  September 2009  (2 years 1 month) Greater Boston Area Senior Associate in corporate strategy, education, and private equity practices at boutique consulting firm. Editor Let's Go Travel Guides, Inc. April 2005  –  September 2007  (2 years 6 months) Cambridge, Massachusetts Editor of Ireland 2008 and Associate Editor of Australia 2007 Product Manager Google September 2012  – Present (2 years 11 months) Mountain View, CA Ads & Commerce Group, Ads platforms (9/14-present) \nAds & Commerce Group, Payments (9/12-9/14) Product Manager Google September 2012  – Present (2 years 11 months) Mountain View, CA Ads & Commerce Group, Ads platforms (9/14-present) \nAds & Commerce Group, Payments (9/12-9/14) Finance Operations Analyst II Google, Inc. January 2011  –  September 2012  (1 year 9 months) Mountain View, CA Product Group lead for Display, GIO Team Finance Operations Analyst II Google, Inc. January 2011  –  September 2012  (1 year 9 months) Mountain View, CA Product Group lead for Display, GIO Team Research Analyst OECD August 2010  –  December 2010  (5 months) Paris, France Future Global Shocks project Future Global Shocks: Improving Risk Governance Edit Research Analyst OECD August 2010  –  December 2010  (5 months) Paris, France Future Global Shocks project Future Global Shocks: Improving Risk Governance Edit Future Global Shocks: Improving Risk Governance Edit Future Global Shocks: Improving Risk Governance Edit Future Global Shocks: Improving Risk Governance  Future Global Shocks: Improving Risk Governance  Senior Associate The Parthenon Group September 2007  –  September 2009  (2 years 1 month) Greater Boston Area Senior Associate in corporate strategy, education, and private equity practices at boutique consulting firm. Senior Associate The Parthenon Group September 2007  –  September 2009  (2 years 1 month) Greater Boston Area Senior Associate in corporate strategy, education, and private equity practices at boutique consulting firm. Editor Let's Go Travel Guides, Inc. April 2005  –  September 2007  (2 years 6 months) Cambridge, Massachusetts Editor of Ireland 2008 and Associate Editor of Australia 2007 Editor Let's Go Travel Guides, Inc. April 2005  –  September 2007  (2 years 6 months) Cambridge, Massachusetts Editor of Ireland 2008 and Associate Editor of Australia 2007 Languages English Native or bilingual proficiency Spanish English Native or bilingual proficiency Spanish English Native or bilingual proficiency Spanish Native or bilingual proficiency Skills Top Skills 17 Strategy 11 Management Consulting 9 Analytics 8 Economics 7 Market Research 6 Data Analysis 6 Product Management 5 Financial Modeling 5 Competitive Analysis 4 Project Management Matthew also knows about... 4 Development Economics 4 Professional Writing 4 Stata 3 Operations Management 3 International Finance 3 Business Process... 3 Team Management 2 Business Strategy 1 Entrepreneurship Skills  Top Skills 17 Strategy 11 Management Consulting 9 Analytics 8 Economics 7 Market Research 6 Data Analysis 6 Product Management 5 Financial Modeling 5 Competitive Analysis 4 Project Management Matthew also knows about... 4 Development Economics 4 Professional Writing 4 Stata 3 Operations Management 3 International Finance 3 Business Process... 3 Team Management 2 Business Strategy 1 Entrepreneurship Top Skills 17 Strategy 11 Management Consulting 9 Analytics 8 Economics 7 Market Research 6 Data Analysis 6 Product Management 5 Financial Modeling 5 Competitive Analysis 4 Project Management Matthew also knows about... 4 Development Economics 4 Professional Writing 4 Stata 3 Operations Management 3 International Finance 3 Business Process... 3 Team Management 2 Business Strategy 1 Entrepreneurship Top Skills 17 Strategy 11 Management Consulting 9 Analytics 8 Economics 7 Market Research 6 Data Analysis 6 Product Management 5 Financial Modeling 5 Competitive Analysis 4 Project Management Matthew also knows about... 4 Development Economics 4 Professional Writing 4 Stata 3 Operations Management 3 International Finance 3 Business Process... 3 Team Management 2 Business Strategy 1 Entrepreneurship                     4 Development Economics 4 Professional Writing 4 Stata 3 Operations Management 3 International Finance 3 Business Process... 3 Team Management 2 Business Strategy 1 Entrepreneurship Education University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Xavier High School High School 1999  – 2003 University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Xavier High School High School 1999  – 2003 Xavier High School High School 1999  – 2003 Xavier High School High School 1999  – 2003 Honors & Awards ", "Experience Finance Operations Analyst Google May 2015  – Present (3 months) Sunnyvale CA Subject Matter Expert EMEA - Billing Google January 2014  – Present (1 year 7 months) Dublin The Subject Matter Expert Team supports the Global Customer Experience (GCE) team focusing on efficiency and product improvement.  \n \nResponsibilities: \nSupport and communicate product launches \nCollaborate with cross-functional teams on product and process improvements \nSupport Global Customer Experience teams with billing issues that need further investigation Account Strategist Google April 2013  –  January 2014  (10 months) Dublin, Ireland Support of AdWords and Analytics. Provided troubleshooting and advised advertisers on campaign optimisation, strategy and features. Online Media Associate Google June 2011  –  March 2013  (1 year 10 months) Project Coordinator Kosovo 2.0 January 2010  –  June 2011  (1 year 6 months) Background: Kosovo 2.0 (http://www.kosovotwopointzero.com) is a web portal and magazine, which aims at promoting Kosovo abroad, connecting people worldwide and encouraging communication. \n \nResponsibilities: \nTake care of a smooth work flow by organizing staff and freelancers \nManage the Kosovo 2.0 print magazine \nContribute to the creative execution of ideas and visions of the team \nFundraise and organize events Projects Officer KIJAC January 2010  –  November 2010  (11 months) Background: KIJAC offers a two-year Master’s program in Journalism, and supports projects in \nthe field of journalism and communication. Moreover, KIJAC is providing trainings, organizing \nseminars and conferences. \n \nResponsibilities: \nSupervise ongoing projects \nOrganize and supervise events and seminars \nCommunicate with donors/partners Assistant Producer for Talk show \"Sve je moguce. Sa Anom\" Kijac Centre January 2009  –  January 2010  (1 year 1 month) Kosovo Background: The show aimed at creating a safe space within the Kosovo community, where Kosovo Serbs voices and opinions can be heard. The show identified problems that exist for the Serb minority, and facilitated confidence-building among them.  \n \nResponsibilities: \nAssist technical staff in operations \nOrganize schedule of the host, arrange meetings, make travel arrangements \nReceive guests, seat guests and look for their wellbeing \nCommunicate with donors and provide them with final reports Intern GTZ Kosovo August 2008  –  December 2008  (5 months) Background: GTZ is a German federally-owned organization, which is active worldwide in the \nfield of international cooperation for sustainable development. Intern Alex-Springer Verlag, BILD Redaktion Hamburg July 2007  –  August 2007  (2 months) Background: Axel-Springer is one of the leading media enterprises in Europe. One of its \npublications, the yellow paper BILD is Europe’s most read daily paper. Being chased by \nscandals, BILD remains controversial in Germany, and is an interesting place to look into. Finance Operations Analyst Google May 2015  – Present (3 months) Sunnyvale CA Finance Operations Analyst Google May 2015  – Present (3 months) Sunnyvale CA Subject Matter Expert EMEA - Billing Google January 2014  – Present (1 year 7 months) Dublin The Subject Matter Expert Team supports the Global Customer Experience (GCE) team focusing on efficiency and product improvement.  \n \nResponsibilities: \nSupport and communicate product launches \nCollaborate with cross-functional teams on product and process improvements \nSupport Global Customer Experience teams with billing issues that need further investigation Subject Matter Expert EMEA - Billing Google January 2014  – Present (1 year 7 months) Dublin The Subject Matter Expert Team supports the Global Customer Experience (GCE) team focusing on efficiency and product improvement.  \n \nResponsibilities: \nSupport and communicate product launches \nCollaborate with cross-functional teams on product and process improvements \nSupport Global Customer Experience teams with billing issues that need further investigation Account Strategist Google April 2013  –  January 2014  (10 months) Dublin, Ireland Support of AdWords and Analytics. Provided troubleshooting and advised advertisers on campaign optimisation, strategy and features. Account Strategist Google April 2013  –  January 2014  (10 months) Dublin, Ireland Support of AdWords and Analytics. Provided troubleshooting and advised advertisers on campaign optimisation, strategy and features. Online Media Associate Google June 2011  –  March 2013  (1 year 10 months) Online Media Associate Google June 2011  –  March 2013  (1 year 10 months) Project Coordinator Kosovo 2.0 January 2010  –  June 2011  (1 year 6 months) Background: Kosovo 2.0 (http://www.kosovotwopointzero.com) is a web portal and magazine, which aims at promoting Kosovo abroad, connecting people worldwide and encouraging communication. \n \nResponsibilities: \nTake care of a smooth work flow by organizing staff and freelancers \nManage the Kosovo 2.0 print magazine \nContribute to the creative execution of ideas and visions of the team \nFundraise and organize events Project Coordinator Kosovo 2.0 January 2010  –  June 2011  (1 year 6 months) Background: Kosovo 2.0 (http://www.kosovotwopointzero.com) is a web portal and magazine, which aims at promoting Kosovo abroad, connecting people worldwide and encouraging communication. \n \nResponsibilities: \nTake care of a smooth work flow by organizing staff and freelancers \nManage the Kosovo 2.0 print magazine \nContribute to the creative execution of ideas and visions of the team \nFundraise and organize events Projects Officer KIJAC January 2010  –  November 2010  (11 months) Background: KIJAC offers a two-year Master’s program in Journalism, and supports projects in \nthe field of journalism and communication. Moreover, KIJAC is providing trainings, organizing \nseminars and conferences. \n \nResponsibilities: \nSupervise ongoing projects \nOrganize and supervise events and seminars \nCommunicate with donors/partners Projects Officer KIJAC January 2010  –  November 2010  (11 months) Background: KIJAC offers a two-year Master’s program in Journalism, and supports projects in \nthe field of journalism and communication. Moreover, KIJAC is providing trainings, organizing \nseminars and conferences. \n \nResponsibilities: \nSupervise ongoing projects \nOrganize and supervise events and seminars \nCommunicate with donors/partners Assistant Producer for Talk show \"Sve je moguce. Sa Anom\" Kijac Centre January 2009  –  January 2010  (1 year 1 month) Kosovo Background: The show aimed at creating a safe space within the Kosovo community, where Kosovo Serbs voices and opinions can be heard. The show identified problems that exist for the Serb minority, and facilitated confidence-building among them.  \n \nResponsibilities: \nAssist technical staff in operations \nOrganize schedule of the host, arrange meetings, make travel arrangements \nReceive guests, seat guests and look for their wellbeing \nCommunicate with donors and provide them with final reports Assistant Producer for Talk show \"Sve je moguce. Sa Anom\" Kijac Centre January 2009  –  January 2010  (1 year 1 month) Kosovo Background: The show aimed at creating a safe space within the Kosovo community, where Kosovo Serbs voices and opinions can be heard. The show identified problems that exist for the Serb minority, and facilitated confidence-building among them.  \n \nResponsibilities: \nAssist technical staff in operations \nOrganize schedule of the host, arrange meetings, make travel arrangements \nReceive guests, seat guests and look for their wellbeing \nCommunicate with donors and provide them with final reports Intern GTZ Kosovo August 2008  –  December 2008  (5 months) Background: GTZ is a German federally-owned organization, which is active worldwide in the \nfield of international cooperation for sustainable development. Intern GTZ Kosovo August 2008  –  December 2008  (5 months) Background: GTZ is a German federally-owned organization, which is active worldwide in the \nfield of international cooperation for sustainable development. Intern Alex-Springer Verlag, BILD Redaktion Hamburg July 2007  –  August 2007  (2 months) Background: Axel-Springer is one of the leading media enterprises in Europe. One of its \npublications, the yellow paper BILD is Europe’s most read daily paper. Being chased by \nscandals, BILD remains controversial in Germany, and is an interesting place to look into. Intern Alex-Springer Verlag, BILD Redaktion Hamburg July 2007  –  August 2007  (2 months) Background: Axel-Springer is one of the leading media enterprises in Europe. One of its \npublications, the yellow paper BILD is Europe’s most read daily paper. Being chased by \nscandals, BILD remains controversial in Germany, and is an interesting place to look into. Languages English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 23 Online Advertising 22 Google Analytics 22 New Media 19 Google Adwords 19 Journalism 14 Digital Marketing 12 Social Media Marketing 9 PPC 7 Online Marketing 6 Social Media Sarah also knows about... 5 Advertising 4 Marketing Management 4 SEM 3 Project Management 2 Digital Strategy 2 Digital Media 2 E-commerce 2 Web Analytics 1 Mobile Marketing 1 Process Improvement Skills  Top Skills 23 Online Advertising 22 Google Analytics 22 New Media 19 Google Adwords 19 Journalism 14 Digital Marketing 12 Social Media Marketing 9 PPC 7 Online Marketing 6 Social Media Sarah also knows about... 5 Advertising 4 Marketing Management 4 SEM 3 Project Management 2 Digital Strategy 2 Digital Media 2 E-commerce 2 Web Analytics 1 Mobile Marketing 1 Process Improvement Top Skills 23 Online Advertising 22 Google Analytics 22 New Media 19 Google Adwords 19 Journalism 14 Digital Marketing 12 Social Media Marketing 9 PPC 7 Online Marketing 6 Social Media Sarah also knows about... 5 Advertising 4 Marketing Management 4 SEM 3 Project Management 2 Digital Strategy 2 Digital Media 2 E-commerce 2 Web Analytics 1 Mobile Marketing 1 Process Improvement Top Skills 23 Online Advertising 22 Google Analytics 22 New Media 19 Google Adwords 19 Journalism 14 Digital Marketing 12 Social Media Marketing 9 PPC 7 Online Marketing 6 Social Media Sarah also knows about... 5 Advertising 4 Marketing Management 4 SEM 3 Project Management 2 Digital Strategy 2 Digital Media 2 E-commerce 2 Web Analytics 1 Mobile Marketing 1 Process Improvement                     5 Advertising 4 Marketing Management 4 SEM 3 Project Management 2 Digital Strategy 2 Digital Media 2 E-commerce 2 Web Analytics 1 Mobile Marketing 1 Process Improvement Education KIJAC MA,  Journalism and Communication 2008  – 2010 American University in Bulgaria BA,  Political Science and International Relations & Journalism and Mass Communications 2004  – 2008 Activities and Societies:  September 2006 – September 2007 Managing Editor \"FlashNews\" Online Student Publication\nSeptember 2005 – September 2006 Reporter \"FlashNews\" Online Student Publication KIJAC MA,  Journalism and Communication 2008  – 2010 KIJAC MA,  Journalism and Communication 2008  – 2010 KIJAC MA,  Journalism and Communication 2008  – 2010 American University in Bulgaria BA,  Political Science and International Relations & Journalism and Mass Communications 2004  – 2008 Activities and Societies:  September 2006 – September 2007 Managing Editor \"FlashNews\" Online Student Publication\nSeptember 2005 – September 2006 Reporter \"FlashNews\" Online Student Publication American University in Bulgaria BA,  Political Science and International Relations & Journalism and Mass Communications 2004  – 2008 Activities and Societies:  September 2006 – September 2007 Managing Editor \"FlashNews\" Online Student Publication\nSeptember 2005 – September 2006 Reporter \"FlashNews\" Online Student Publication American University in Bulgaria BA,  Political Science and International Relations & Journalism and Mass Communications 2004  – 2008 Activities and Societies:  September 2006 – September 2007 Managing Editor \"FlashNews\" Online Student Publication\nSeptember 2005 – September 2006 Reporter \"FlashNews\" Online Student Publication ", "Experience Finance Operations Analyst II Google October 2012  – Present (2 years 10 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. AdSense Team lead Google October 2010  – Present (4 years 10 months) Specializing in AdSense payments and platform operations AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Finance Operations Analyst II Google October 2012  – Present (2 years 10 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. Finance Operations Analyst II Google October 2012  – Present (2 years 10 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. AdSense Team lead Google October 2010  – Present (4 years 10 months) Specializing in AdSense payments and platform operations AdSense Team lead Google October 2010  – Present (4 years 10 months) Specializing in AdSense payments and platform operations AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Skills Top Skills 14 Google Adwords 13 Online Advertising 13 Google Analytics 11 Adsense 8 Digital Marketing 6 Online Marketing 5 Project Management 5 E-commerce 4 Web Analytics 4 PPC Colm also knows about... 3 Analytics 1 Vendor Management 1 SEO 1 Online Gaming 0 Community Management 0 Product Management 0 Web Project Management 0 Mobile Devices Skills  Top Skills 14 Google Adwords 13 Online Advertising 13 Google Analytics 11 Adsense 8 Digital Marketing 6 Online Marketing 5 Project Management 5 E-commerce 4 Web Analytics 4 PPC Colm also knows about... 3 Analytics 1 Vendor Management 1 SEO 1 Online Gaming 0 Community Management 0 Product Management 0 Web Project Management 0 Mobile Devices Top Skills 14 Google Adwords 13 Online Advertising 13 Google Analytics 11 Adsense 8 Digital Marketing 6 Online Marketing 5 Project Management 5 E-commerce 4 Web Analytics 4 PPC Colm also knows about... 3 Analytics 1 Vendor Management 1 SEO 1 Online Gaming 0 Community Management 0 Product Management 0 Web Project Management 0 Mobile Devices Top Skills 14 Google Adwords 13 Online Advertising 13 Google Analytics 11 Adsense 8 Digital Marketing 6 Online Marketing 5 Project Management 5 E-commerce 4 Web Analytics 4 PPC Colm also knows about... 3 Analytics 1 Vendor Management 1 SEO 1 Online Gaming 0 Community Management 0 Product Management 0 Web Project Management 0 Mobile Devices                     3 Analytics 1 Vendor Management 1 SEO 1 Online Gaming 0 Community Management 0 Product Management 0 Web Project Management 0 Mobile Devices Education University College Cork MBS,  E-Business and Commerce 2003  – 2005 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 Honors & Awards ", "Experience Finance Operations Analyst - Emerging Business and Acquisitions Google August 2006  – Present (9 years) Credit Analyst McKesson July 2004  –  August 2006  (2 years 2 months) Finance Operations Analyst - Emerging Business and Acquisitions Google August 2006  – Present (9 years) Finance Operations Analyst - Emerging Business and Acquisitions Google August 2006  – Present (9 years) Credit Analyst McKesson July 2004  –  August 2006  (2 years 2 months) Credit Analyst McKesson July 2004  –  August 2006  (2 years 2 months) Skills Skills     Education Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 ", "Experience Finance operations analyst Google February 2011  – Present (4 years 6 months) Adjointe puis Chef de bureau (1BE) Ministère du Budget January 2008  –  December 2010  (3 years) - Prévision des dépenses de l’Etat \n- Redéploiement des moyens pour financer les besoins nouveaux et aléas de gestion \n- Echanges avec la Cour des comptes dans le cadre de la certification des comptes de l'Etat Finance operations analyst Google February 2011  – Present (4 years 6 months) Finance operations analyst Google February 2011  – Present (4 years 6 months) Adjointe puis Chef de bureau (1BE) Ministère du Budget January 2008  –  December 2010  (3 years) - Prévision des dépenses de l’Etat \n- Redéploiement des moyens pour financer les besoins nouveaux et aléas de gestion \n- Echanges avec la Cour des comptes dans le cadre de la certification des comptes de l'Etat Adjointe puis Chef de bureau (1BE) Ministère du Budget January 2008  –  December 2010  (3 years) - Prévision des dépenses de l’Etat \n- Redéploiement des moyens pour financer les besoins nouveaux et aléas de gestion \n- Echanges avec la Cour des comptes dans le cadre de la certification des comptes de l'Etat Skills Skills     Education ESSEC Business School 2000  – 2003 ESSEC Business School 2000  – 2003 ESSEC Business School 2000  – 2003 ESSEC Business School 2000  – 2003 ", "Experience TechHR Programs Specialist Google August 2011  – Present (4 years) Mountain View, CA Finance Operations Analyst - Collections Google January 2010  –  August 2011  (1 year 8 months) Mountain View, CA (Open) 1 recommendation Judith Dominguez Receivables Accountant at IBM Caitlin demonstrated an appreciated knack for tackling issues across teams and multiple products while maintaining a spirit of cooperation and good humor. With an eye for detail she went beyond surface knowledge to delve into how things work to help... View Finance Operations Specialist I - Billing & Payments Google June 2007  –  January 2010  (2 years 8 months) (Open) 1 recommendation Leslie-Ann Bergstrom Project and Process Manager at Google Caitlin is a collaborative team player, an extremely hard worker, a problem solver, and a fun person to work with. She frequently receives peer recognition for her work ethic and willingness to go above and beyond to solve issues for internal... View International Markets Research Assistant Marietta Investment Partners, LLC October 2006  –  May 2007  (8 months) TechHR Programs Specialist Google August 2011  – Present (4 years) Mountain View, CA TechHR Programs Specialist Google August 2011  – Present (4 years) Mountain View, CA Finance Operations Analyst - Collections Google January 2010  –  August 2011  (1 year 8 months) Mountain View, CA (Open) 1 recommendation Judith Dominguez Receivables Accountant at IBM Caitlin demonstrated an appreciated knack for tackling issues across teams and multiple products while maintaining a spirit of cooperation and good humor. With an eye for detail she went beyond surface knowledge to delve into how things work to help... View Finance Operations Analyst - Collections Google January 2010  –  August 2011  (1 year 8 months) Mountain View, CA (Open) 1 recommendation Judith Dominguez Receivables Accountant at IBM Caitlin demonstrated an appreciated knack for tackling issues across teams and multiple products while maintaining a spirit of cooperation and good humor. With an eye for detail she went beyond surface knowledge to delve into how things work to help... View Finance Operations Specialist I - Billing & Payments Google June 2007  –  January 2010  (2 years 8 months) (Open) 1 recommendation Leslie-Ann Bergstrom Project and Process Manager at Google Caitlin is a collaborative team player, an extremely hard worker, a problem solver, and a fun person to work with. She frequently receives peer recognition for her work ethic and willingness to go above and beyond to solve issues for internal... View Finance Operations Specialist I - Billing & Payments Google June 2007  –  January 2010  (2 years 8 months) (Open) 1 recommendation Leslie-Ann Bergstrom Project and Process Manager at Google Caitlin is a collaborative team player, an extremely hard worker, a problem solver, and a fun person to work with. She frequently receives peer recognition for her work ethic and willingness to go above and beyond to solve issues for internal... View International Markets Research Assistant Marietta Investment Partners, LLC October 2006  –  May 2007  (8 months) International Markets Research Assistant Marietta Investment Partners, LLC October 2006  –  May 2007  (8 months) Languages French French French Skills Top Skills 9 Google Adwords 7 Human Resources 5 JavaScript 5 Program Management 4 Management 3 Finance 2 Time Management 2 Google Analytics 2 Web Analytics 1 Customer Service Caitlin also knows about... 1 Invoicing 1 SEM 1 E-commerce 0 Communication 0 AppsScript Skills  Top Skills 9 Google Adwords 7 Human Resources 5 JavaScript 5 Program Management 4 Management 3 Finance 2 Time Management 2 Google Analytics 2 Web Analytics 1 Customer Service Caitlin also knows about... 1 Invoicing 1 SEM 1 E-commerce 0 Communication 0 AppsScript Top Skills 9 Google Adwords 7 Human Resources 5 JavaScript 5 Program Management 4 Management 3 Finance 2 Time Management 2 Google Analytics 2 Web Analytics 1 Customer Service Caitlin also knows about... 1 Invoicing 1 SEM 1 E-commerce 0 Communication 0 AppsScript Top Skills 9 Google Adwords 7 Human Resources 5 JavaScript 5 Program Management 4 Management 3 Finance 2 Time Management 2 Google Analytics 2 Web Analytics 1 Customer Service Caitlin also knows about... 1 Invoicing 1 SEM 1 E-commerce 0 Communication 0 AppsScript                     1 Invoicing 1 SEM 1 E-commerce 0 Communication 0 AppsScript Education University of Notre Dame Bachelor 2002  – 2006 University College Dublin 2005  – 2005 University of Notre Dame Bachelor 2002  – 2006 University of Notre Dame Bachelor 2002  – 2006 University of Notre Dame Bachelor 2002  – 2006 University College Dublin 2005  – 2005 University College Dublin 2005  – 2005 University College Dublin 2005  – 2005 Honors & Awards Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List ", "Summary Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Summary Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Experience Senior Analytical Lead Google March 2014  – Present (1 year 5 months) Greater Los Angeles Area Senior Finance Operations Analyst Google July 2011  –  March 2014  (2 years 9 months) Mountain View, CA M&A Integration \nBudget planning and monthly accrual lead \nAd hoc Analysis \nProcess Improvement \nVendor Management MBA Finance Intern Google June 2010  –  August 2010  (3 months) Product Strategy Intern (LCE/LED TV) Samsung Electronics May 2010  –  June 2010  (2 months) Auditor (Internal & External) ParenteBeard, LLC October 2007  –  May 2009  (1 year 8 months) Accountant Dimensional Fund Advisors August 2005  –  August 2007  (2 years 1 month) Senior Analytical Lead Google March 2014  – Present (1 year 5 months) Greater Los Angeles Area Senior Analytical Lead Google March 2014  – Present (1 year 5 months) Greater Los Angeles Area Senior Finance Operations Analyst Google July 2011  –  March 2014  (2 years 9 months) Mountain View, CA M&A Integration \nBudget planning and monthly accrual lead \nAd hoc Analysis \nProcess Improvement \nVendor Management Senior Finance Operations Analyst Google July 2011  –  March 2014  (2 years 9 months) Mountain View, CA M&A Integration \nBudget planning and monthly accrual lead \nAd hoc Analysis \nProcess Improvement \nVendor Management MBA Finance Intern Google June 2010  –  August 2010  (3 months) MBA Finance Intern Google June 2010  –  August 2010  (3 months) Product Strategy Intern (LCE/LED TV) Samsung Electronics May 2010  –  June 2010  (2 months) Product Strategy Intern (LCE/LED TV) Samsung Electronics May 2010  –  June 2010  (2 months) Auditor (Internal & External) ParenteBeard, LLC October 2007  –  May 2009  (1 year 8 months) Auditor (Internal & External) ParenteBeard, LLC October 2007  –  May 2009  (1 year 8 months) Accountant Dimensional Fund Advisors August 2005  –  August 2007  (2 years 1 month) Accountant Dimensional Fund Advisors August 2005  –  August 2007  (2 years 1 month) Languages English Native or bilingual proficiency Korean Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Korean Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Korean Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills 32 Finance 20 Financial Modeling 18 Financial Analysis 10 Accounting 9 Business Strategy 5 Valuation 4 Analysis 3 Risk Management 2 Private Equity Skills  32 Finance 20 Financial Modeling 18 Financial Analysis 10 Accounting 9 Business Strategy 5 Valuation 4 Analysis 3 Risk Management 2 Private Equity 32 Finance 20 Financial Modeling 18 Financial Analysis 10 Accounting 9 Business Strategy 5 Valuation 4 Analysis 3 Risk Management 2 Private Equity 32 Finance 20 Financial Modeling 18 Financial Analysis 10 Accounting 9 Business Strategy 5 Valuation 4 Analysis 3 Risk Management 2 Private Equity                   Education Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 ", "Summary Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Summary Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Experience Senior Finance Operations Analyst Google January 2014  – Present (1 year 7 months) Mountain View, CA Finance Operations Analyst Google July 2012  –  January 2014  (1 year 7 months) Mountain View, CA Finance Operations Graduate Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Associate - Strategy and Business Development (Citi Transaction Services) Citi July 2008  –  May 2010  (1 year 11 months) New York, NY (Open) 2 honors and awards President's Volunteer Service Award - Bronze View Outstanding contribution towards volunteerism View (Open) 1 recommendation Prabha Jha, CAPM IT Governance & Compliance, PM It was a pleasure to work with Mike. He is hard working, friendly, and patient. He is dedicated to his responsibilities. The team relied on him for his analytical skills and I am sure he will be an asset to any company. View Analyst - Product Management (Citi Transaction Services) Citi July 2006  –  July 2008  (2 years 1 month) New York, NY Senior Finance Operations Analyst Google January 2014  – Present (1 year 7 months) Mountain View, CA Senior Finance Operations Analyst Google January 2014  – Present (1 year 7 months) Mountain View, CA Finance Operations Analyst Google July 2012  –  January 2014  (1 year 7 months) Mountain View, CA Finance Operations Analyst Google July 2012  –  January 2014  (1 year 7 months) Mountain View, CA Finance Operations Graduate Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Finance Operations Graduate Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Associate - Strategy and Business Development (Citi Transaction Services) Citi July 2008  –  May 2010  (1 year 11 months) New York, NY (Open) 2 honors and awards President's Volunteer Service Award - Bronze View Outstanding contribution towards volunteerism View (Open) 1 recommendation Prabha Jha, CAPM IT Governance & Compliance, PM It was a pleasure to work with Mike. He is hard working, friendly, and patient. He is dedicated to his responsibilities. The team relied on him for his analytical skills and I am sure he will be an asset to any company. View Associate - Strategy and Business Development (Citi Transaction Services) Citi July 2008  –  May 2010  (1 year 11 months) New York, NY (Open) 2 honors and awards President's Volunteer Service Award - Bronze View Outstanding contribution towards volunteerism View (Open) 1 recommendation Prabha Jha, CAPM IT Governance & Compliance, PM It was a pleasure to work with Mike. He is hard working, friendly, and patient. He is dedicated to his responsibilities. The team relied on him for his analytical skills and I am sure he will be an asset to any company. View Analyst - Product Management (Citi Transaction Services) Citi July 2006  –  July 2008  (2 years 1 month) New York, NY Analyst - Product Management (Citi Transaction Services) Citi July 2006  –  July 2008  (2 years 1 month) New York, NY Skills Top Skills 16 Strategy 14 Product Management 13 Financial Modeling 10 Financial Analysis 10 Finance 8 Analytics 7 Corporate Finance 4 Business Strategy 3 Process Management 3 Business Analysis Michael also knows about... 3 Competitive Analysis 3 Valuation 2 Process Improvement 2 Product Development 1 Market Analysis 1 Competitive Intelligence 0 Cross-functional... 0 Strategy Development 0 Financial Operations 0 Finance Operations 0 Procure to Pay 0 Corporate Cards 0 Commercial Cards 0 Transaction Banking 0 Transaction Services Skills  Top Skills 16 Strategy 14 Product Management 13 Financial Modeling 10 Financial Analysis 10 Finance 8 Analytics 7 Corporate Finance 4 Business Strategy 3 Process Management 3 Business Analysis Michael also knows about... 3 Competitive Analysis 3 Valuation 2 Process Improvement 2 Product Development 1 Market Analysis 1 Competitive Intelligence 0 Cross-functional... 0 Strategy Development 0 Financial Operations 0 Finance Operations 0 Procure to Pay 0 Corporate Cards 0 Commercial Cards 0 Transaction Banking 0 Transaction Services Top Skills 16 Strategy 14 Product Management 13 Financial Modeling 10 Financial Analysis 10 Finance 8 Analytics 7 Corporate Finance 4 Business Strategy 3 Process Management 3 Business Analysis Michael also knows about... 3 Competitive Analysis 3 Valuation 2 Process Improvement 2 Product Development 1 Market Analysis 1 Competitive Intelligence 0 Cross-functional... 0 Strategy Development 0 Financial Operations 0 Finance Operations 0 Procure to Pay 0 Corporate Cards 0 Commercial Cards 0 Transaction Banking 0 Transaction Services Top Skills 16 Strategy 14 Product Management 13 Financial Modeling 10 Financial Analysis 10 Finance 8 Analytics 7 Corporate Finance 4 Business Strategy 3 Process Management 3 Business Analysis Michael also knows about... 3 Competitive Analysis 3 Valuation 2 Process Improvement 2 Product Development 1 Market Analysis 1 Competitive Intelligence 0 Cross-functional... 0 Strategy Development 0 Financial Operations 0 Finance Operations 0 Procure to Pay 0 Corporate Cards 0 Commercial Cards 0 Transaction Banking 0 Transaction Services                     3 Competitive Analysis 3 Valuation 2 Process Improvement 2 Product Development 1 Market Analysis 1 Competitive Intelligence 0 Cross-functional... 0 Strategy Development 0 Financial Operations 0 Finance Operations 0 Procure to Pay 0 Corporate Cards 0 Commercial Cards 0 Transaction Banking 0 Transaction Services Education University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 (Open) 2 honors and awards National Association of Asian MBAs Global Case Competition - Finalist View Fellowship (Merit-Based) View IPTV: Disrupting the Balance of Power in the US Media Industry Edit Cornell University Bachelor of Arts (BA) 2002  – 2006 University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 (Open) 2 honors and awards National Association of Asian MBAs Global Case Competition - Finalist View Fellowship (Merit-Based) View IPTV: Disrupting the Balance of Power in the US Media Industry Edit University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 (Open) 2 honors and awards National Association of Asian MBAs Global Case Competition - Finalist View Fellowship (Merit-Based) View University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 (Open) 2 honors and awards National Association of Asian MBAs Global Case Competition - Finalist View Fellowship (Merit-Based) View IPTV: Disrupting the Balance of Power in the US Media Industry Edit IPTV: Disrupting the Balance of Power in the US Media Industry Edit IPTV: Disrupting the Balance of Power in the US Media Industry Edit IPTV: Disrupting the Balance of Power in the US Media Industry  IPTV: Disrupting the Balance of Power in the US Media Industry  Cornell University Bachelor of Arts (BA) 2002  – 2006 Cornell University Bachelor of Arts (BA) 2002  – 2006 Cornell University Bachelor of Arts (BA) 2002  – 2006 Honors & Awards National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 "]}