{"position": "Attorney", "company": "Google", "profiles": ["Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, California Document Review Attorney Adecco Group at Google 2011  –  January 2013  (2 years) Contract Attorney Update Legal 2010  –  2011  (1 year) Contract Attorney Hire Counsel 2005  –  2008  (3 years) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, California Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, California Document Review Attorney Adecco Group at Google 2011  –  January 2013  (2 years) Document Review Attorney Adecco Group at Google 2011  –  January 2013  (2 years) Contract Attorney Update Legal 2010  –  2011  (1 year) Contract Attorney Update Legal 2010  –  2011  (1 year) Contract Attorney Hire Counsel 2005  –  2008  (3 years) Contract Attorney Hire Counsel 2005  –  2008  (3 years) Languages Spanish Spanish Spanish Skills Legal Research Legal Writing Litigation Intellectual Property Litigation Support Document Review Wills Trusts Estate Planning Westlaw Skills  Legal Research Legal Writing Litigation Intellectual Property Litigation Support Document Review Wills Trusts Estate Planning Westlaw Legal Research Legal Writing Litigation Intellectual Property Litigation Support Document Review Wills Trusts Estate Planning Westlaw Legal Research Legal Writing Litigation Intellectual Property Litigation Support Document Review Wills Trusts Estate Planning Westlaw Education University of California, Hastings College of the Law Doctor of Law (J.D.) 2000  – 2003 John Jay College of Criminal Justice MA,  Forensic Psychology 1998  – 2000 University of California, Los Angeles BA,  Psychology 1994  – 1998 University of California, Hastings College of the Law Doctor of Law (J.D.) 2000  – 2003 University of California, Hastings College of the Law Doctor of Law (J.D.) 2000  – 2003 University of California, Hastings College of the Law Doctor of Law (J.D.) 2000  – 2003 John Jay College of Criminal Justice MA,  Forensic Psychology 1998  – 2000 John Jay College of Criminal Justice MA,  Forensic Psychology 1998  – 2000 John Jay College of Criminal Justice MA,  Forensic Psychology 1998  – 2000 University of California, Los Angeles BA,  Psychology 1994  – 1998 University of California, Los Angeles BA,  Psychology 1994  – 1998 University of California, Los Angeles BA,  Psychology 1994  – 1998 ", "Experience Team Lead, Discovery Staff Attorney Google December 2012  – Present (2 years 9 months) Mountain View, CA Team Lead, Discovery Staff Attorney Google December 2012  – Present (2 years 9 months) Mountain View, CA Team Lead, Discovery Staff Attorney Google December 2012  – Present (2 years 9 months) Mountain View, CA Skills Patents Legal Research Litigation Legal Writing Civil Litigation Intellectual Property Commercial Litigation Corporate Law Project Management Mediation Courts Litigation Support Employment Law Licensing Westlaw Corporate Governance Arbitration International Law Legal Assistance Dispute Resolution See 5+     See less Skills  Patents Legal Research Litigation Legal Writing Civil Litigation Intellectual Property Commercial Litigation Corporate Law Project Management Mediation Courts Litigation Support Employment Law Licensing Westlaw Corporate Governance Arbitration International Law Legal Assistance Dispute Resolution See 5+     See less Patents Legal Research Litigation Legal Writing Civil Litigation Intellectual Property Commercial Litigation Corporate Law Project Management Mediation Courts Litigation Support Employment Law Licensing Westlaw Corporate Governance Arbitration International Law Legal Assistance Dispute Resolution See 5+     See less Patents Legal Research Litigation Legal Writing Civil Litigation Intellectual Property Commercial Litigation Corporate Law Project Management Mediation Courts Litigation Support Employment Law Licensing Westlaw Corporate Governance Arbitration International Law Legal Assistance Dispute Resolution See 5+     See less Education Northwestern University B.A. Washington University in St. Louis J.D. Northwestern University B.A. Northwestern University B.A. Northwestern University B.A. Washington University in St. Louis J.D. Washington University in St. Louis J.D. Washington University in St. Louis J.D. ", "Summary My legal practice has primarily focused on environmental, employment, and education law. I am a member of both the California and Arizona bars, as well as the bars of the Navajo and Hopi nations. Summary My legal practice has primarily focused on environmental, employment, and education law. I am a member of both the California and Arizona bars, as well as the bars of the Navajo and Hopi nations. My legal practice has primarily focused on environmental, employment, and education law. I am a member of both the California and Arizona bars, as well as the bars of the Navajo and Hopi nations. My legal practice has primarily focused on environmental, employment, and education law. I am a member of both the California and Arizona bars, as well as the bars of the Navajo and Hopi nations. Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Google via Adecco April 2011  –  December 2012  (1 year 9 months) Contract attorney Black Letter Discovery July 2009  –  April 2011  (1 year 10 months) Contract attorney Robert Half Legal May 2009  –  July 2009  (3 months) Attorney Giles Legal, PLC January 2008  –  July 2009  (1 year 7 months) Project duties include legal research and writing; drafting pleadings, motions and briefs; document review, including for relevance and privilege; and strategizing on a variety of legal issues. Associate attorney Gust Rosenfeld, PLC July 2007  –  January 2008  (7 months) Legal practice focused on water resources, environmental, education, and employment areas, mostly through public entity representation. Continued to develop strong writing and analytical skills related to drafting complex legal briefs and motions, water rights leases and agreements, and legal memoranda. Knowledge and experience in counseling employers on employment issues including termination and discipline as well as policies and procedures and other preventative strategies for avoiding liability exposure; employment litigation experience with federal and state employment laws such as Title VII, ADA and FMLA; representation of employers before Equal Employment Opportunity Commission as well as state and federal courts. \nAccomplishments: successful motion practice; several “no cause” findings in EEOC proceedings. Associate attorney Jones, Skelton & Hochuli November 2005  –  July 2007  (1 year 9 months) Legal practice focused on environmental, employment, education, general insurance defense, and complex litigation areas. Developed expertise in state and federal environmental law, including water law, state and federal permitting, natural resources law, cultural resources, native plants, and wildlife issues. Worked as part of team on defense of multi-year, $200 million complex lawsuit involving a variety of environmental issues; responsible for all Clean Water Act claims, acted as the attorney custodian of 50,000 documents, deposed witnesses and assisted in deposition preparation, acted as point person for expert witnesses, worked on discovery issues, and drafted numerous motions and briefs. \nAccomplishments: successful motion practice; won summary judgment for public school district clients in both Title VII and ADA cases; several “no cause” findings in EEOC proceedings. Associate attorney Hufford, Horstman, Mongini, Parnell and Tucker, PC September 2003  –  November 2005  (2 years 3 months) Legal practice focused on education, Indian, and environmental law. Duties included advising public school boards on a variety of education law matters; representing clients in state, federal, and tribal courts; representing school boards before the Equal Employment Opportunity Commission and other bodies on employment matters; advising clients on NEPA issues; and research and legal writing. Accomplishments: successfully represented school boards in administrative hearings on employment matters; defeated class certification attempt in a teachers’ pay action against public school districts; provided pro bono services at DNA-People’s Legal Services. Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Google via Adecco April 2011  –  December 2012  (1 year 9 months) Document Review Attorney Google via Adecco April 2011  –  December 2012  (1 year 9 months) Contract attorney Black Letter Discovery July 2009  –  April 2011  (1 year 10 months) Contract attorney Black Letter Discovery July 2009  –  April 2011  (1 year 10 months) Contract attorney Robert Half Legal May 2009  –  July 2009  (3 months) Contract attorney Robert Half Legal May 2009  –  July 2009  (3 months) Attorney Giles Legal, PLC January 2008  –  July 2009  (1 year 7 months) Project duties include legal research and writing; drafting pleadings, motions and briefs; document review, including for relevance and privilege; and strategizing on a variety of legal issues. Attorney Giles Legal, PLC January 2008  –  July 2009  (1 year 7 months) Project duties include legal research and writing; drafting pleadings, motions and briefs; document review, including for relevance and privilege; and strategizing on a variety of legal issues. Associate attorney Gust Rosenfeld, PLC July 2007  –  January 2008  (7 months) Legal practice focused on water resources, environmental, education, and employment areas, mostly through public entity representation. Continued to develop strong writing and analytical skills related to drafting complex legal briefs and motions, water rights leases and agreements, and legal memoranda. Knowledge and experience in counseling employers on employment issues including termination and discipline as well as policies and procedures and other preventative strategies for avoiding liability exposure; employment litigation experience with federal and state employment laws such as Title VII, ADA and FMLA; representation of employers before Equal Employment Opportunity Commission as well as state and federal courts. \nAccomplishments: successful motion practice; several “no cause” findings in EEOC proceedings. Associate attorney Gust Rosenfeld, PLC July 2007  –  January 2008  (7 months) Legal practice focused on water resources, environmental, education, and employment areas, mostly through public entity representation. Continued to develop strong writing and analytical skills related to drafting complex legal briefs and motions, water rights leases and agreements, and legal memoranda. Knowledge and experience in counseling employers on employment issues including termination and discipline as well as policies and procedures and other preventative strategies for avoiding liability exposure; employment litigation experience with federal and state employment laws such as Title VII, ADA and FMLA; representation of employers before Equal Employment Opportunity Commission as well as state and federal courts. \nAccomplishments: successful motion practice; several “no cause” findings in EEOC proceedings. Associate attorney Jones, Skelton & Hochuli November 2005  –  July 2007  (1 year 9 months) Legal practice focused on environmental, employment, education, general insurance defense, and complex litigation areas. Developed expertise in state and federal environmental law, including water law, state and federal permitting, natural resources law, cultural resources, native plants, and wildlife issues. Worked as part of team on defense of multi-year, $200 million complex lawsuit involving a variety of environmental issues; responsible for all Clean Water Act claims, acted as the attorney custodian of 50,000 documents, deposed witnesses and assisted in deposition preparation, acted as point person for expert witnesses, worked on discovery issues, and drafted numerous motions and briefs. \nAccomplishments: successful motion practice; won summary judgment for public school district clients in both Title VII and ADA cases; several “no cause” findings in EEOC proceedings. Associate attorney Jones, Skelton & Hochuli November 2005  –  July 2007  (1 year 9 months) Legal practice focused on environmental, employment, education, general insurance defense, and complex litigation areas. Developed expertise in state and federal environmental law, including water law, state and federal permitting, natural resources law, cultural resources, native plants, and wildlife issues. Worked as part of team on defense of multi-year, $200 million complex lawsuit involving a variety of environmental issues; responsible for all Clean Water Act claims, acted as the attorney custodian of 50,000 documents, deposed witnesses and assisted in deposition preparation, acted as point person for expert witnesses, worked on discovery issues, and drafted numerous motions and briefs. \nAccomplishments: successful motion practice; won summary judgment for public school district clients in both Title VII and ADA cases; several “no cause” findings in EEOC proceedings. Associate attorney Hufford, Horstman, Mongini, Parnell and Tucker, PC September 2003  –  November 2005  (2 years 3 months) Legal practice focused on education, Indian, and environmental law. Duties included advising public school boards on a variety of education law matters; representing clients in state, federal, and tribal courts; representing school boards before the Equal Employment Opportunity Commission and other bodies on employment matters; advising clients on NEPA issues; and research and legal writing. Accomplishments: successfully represented school boards in administrative hearings on employment matters; defeated class certification attempt in a teachers’ pay action against public school districts; provided pro bono services at DNA-People’s Legal Services. Associate attorney Hufford, Horstman, Mongini, Parnell and Tucker, PC September 2003  –  November 2005  (2 years 3 months) Legal practice focused on education, Indian, and environmental law. Duties included advising public school boards on a variety of education law matters; representing clients in state, federal, and tribal courts; representing school boards before the Equal Employment Opportunity Commission and other bodies on employment matters; advising clients on NEPA issues; and research and legal writing. Accomplishments: successfully represented school boards in administrative hearings on employment matters; defeated class certification attempt in a teachers’ pay action against public school districts; provided pro bono services at DNA-People’s Legal Services. Languages German German German Skills Document Review Pleadings Research Legal Research Litigation Legal Writing Civil Litigation Commercial Litigation Employment Law Intellectual Property Litigation Support Westlaw Depositions Legal Issues Environmental Law Legal Assistance Legal Discovery Patent Litigation See 3+     See less Skills  Document Review Pleadings Research Legal Research Litigation Legal Writing Civil Litigation Commercial Litigation Employment Law Intellectual Property Litigation Support Westlaw Depositions Legal Issues Environmental Law Legal Assistance Legal Discovery Patent Litigation See 3+     See less Document Review Pleadings Research Legal Research Litigation Legal Writing Civil Litigation Commercial Litigation Employment Law Intellectual Property Litigation Support Westlaw Depositions Legal Issues Environmental Law Legal Assistance Legal Discovery Patent Litigation See 3+     See less Document Review Pleadings Research Legal Research Litigation Legal Writing Civil Litigation Commercial Litigation Employment Law Intellectual Property Litigation Support Westlaw Depositions Legal Issues Environmental Law Legal Assistance Legal Discovery Patent Litigation See 3+     See less Education Arizona State University College of Law J.D.,  Environmental law specialization 2000  – 2003 Northern Arizona University B.A.,  German ,  Business Administration 1996  – 2000 Arizona State University College of Law J.D.,  Environmental law specialization 2000  – 2003 Arizona State University College of Law J.D.,  Environmental law specialization 2000  – 2003 Arizona State University College of Law J.D.,  Environmental law specialization 2000  – 2003 Northern Arizona University B.A.,  German ,  Business Administration 1996  – 2000 Northern Arizona University B.A.,  German ,  Business Administration 1996  – 2000 Northern Arizona University B.A.,  German ,  Business Administration 1996  – 2000 ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Document Review Attorney Addeco at Google July 2011  –  January 2013  (1 year 7 months) Contract Attorney Black Letter Discovery 2009  –  July 2011  (2 years) Litigation Associate Morgan, Lewis & Bockius LLP 2007  –  2009  (2 years) San Francisco Bay Area Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Document Review Attorney Addeco at Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Addeco at Google July 2011  –  January 2013  (1 year 7 months) Contract Attorney Black Letter Discovery 2009  –  July 2011  (2 years) Contract Attorney Black Letter Discovery 2009  –  July 2011  (2 years) Litigation Associate Morgan, Lewis & Bockius LLP 2007  –  2009  (2 years) San Francisco Bay Area Litigation Associate Morgan, Lewis & Bockius LLP 2007  –  2009  (2 years) San Francisco Bay Area Languages Japanese Japanese Japanese Skills Litigation Legal Research Intellectual Property Commercial Litigation Legal Writing Westlaw Civil Litigation Copyright Law Corporate Law Litigation Support Licensing Document Review Trials Skills  Litigation Legal Research Intellectual Property Commercial Litigation Legal Writing Westlaw Civil Litigation Copyright Law Corporate Law Litigation Support Licensing Document Review Trials Litigation Legal Research Intellectual Property Commercial Litigation Legal Writing Westlaw Civil Litigation Copyright Law Corporate Law Litigation Support Licensing Document Review Trials Litigation Legal Research Intellectual Property Commercial Litigation Legal Writing Westlaw Civil Litigation Copyright Law Corporate Law Litigation Support Licensing Document Review Trials Education University of Chicago Law School JD 2004  – 2007 University of California, Berkeley B.A.,  English 1997  – 2001 University of Chicago Law School JD 2004  – 2007 University of Chicago Law School JD 2004  – 2007 University of Chicago Law School JD 2004  – 2007 University of California, Berkeley B.A.,  English 1997  – 2001 University of California, Berkeley B.A.,  English 1997  – 2001 University of California, Berkeley B.A.,  English 1997  – 2001 ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Adecco at Google July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Attorney NeurogesX, Inc April 2006  –  December 2008  (2 years 9 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Adecco at Google July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Document Review Attorney Adecco at Google July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Attorney NeurogesX, Inc April 2006  –  December 2008  (2 years 9 months) Attorney NeurogesX, Inc April 2006  –  December 2008  (2 years 9 months) Skills Intellectual Property Legal Research Document Review Corporate Law Legal Writing Litigation Outlook Legal Assistance Skills  Intellectual Property Legal Research Document Review Corporate Law Legal Writing Litigation Outlook Legal Assistance Intellectual Property Legal Research Document Review Corporate Law Legal Writing Litigation Outlook Legal Assistance Intellectual Property Legal Research Document Review Corporate Law Legal Writing Litigation Outlook Legal Assistance Education University of San Diego School of Law JD,  Law 2002  – 2005 University of California, Berkeley A.B.,  Molecular and Cell Biology 1995  – 1999 University of San Diego School of Law JD,  Law 2002  – 2005 University of San Diego School of Law JD,  Law 2002  – 2005 University of San Diego School of Law JD,  Law 2002  – 2005 University of California, Berkeley A.B.,  Molecular and Cell Biology 1995  – 1999 University of California, Berkeley A.B.,  Molecular and Cell Biology 1995  – 1999 University of California, Berkeley A.B.,  Molecular and Cell Biology 1995  – 1999 ", "Experience Discovery Staff Attorney Google January 2015  – Present (8 months) Mountain View, CA Reserve Police Officer LAPD November 2004  – Present (10 years 10 months) WTD, HWD, WLA Document Review Attorney Adecco @ Google August 2013  –  January 2015  (1 year 6 months) Mountain View, CA Contract Attorney Sidley Austin LLP 2013  –  2013  (less than a year) Contract Attorney O'Melveny & Myers LLP 2011  –  2012  (1 year) Century City, CA Attorney DocRun 2011  –  2011  (less than a year) Santa Monica, CA Reserve Deputy City Attorney City of Los Angeles 2010  –  2010  (less than a year) Central, Van Nuys Production Assistant / Production Coordinator WPT Enterprises, Inc. 2009  –  2010  (1 year) Los Angeles, CA Production Assistant Freelance 2008  –  2009  (1 year) Greater Los Angeles Area Executive Assistant / Story Editor Radmin Company 2007  –  2008  (1 year) Beverly Hills, CA Legal Extern Directors Guild of America 2005  –  2005  (less than a year) Los Angeles, CA Development Assistant Flower Films 2001  –  2003  (2 years) Los Angeles, CA Runner / Personal Assistant to Lucy Liu Moonvision Entertainment 2002  –  2002  (less than a year) Los Angeles, CA Runner / Personal Assistant to Nancy Juvonen Flower Films 2002  –  2002  (less than a year) Los Angeles, CA Discovery Staff Attorney Google January 2015  – Present (8 months) Mountain View, CA Discovery Staff Attorney Google January 2015  – Present (8 months) Mountain View, CA Reserve Police Officer LAPD November 2004  – Present (10 years 10 months) WTD, HWD, WLA Reserve Police Officer LAPD November 2004  – Present (10 years 10 months) WTD, HWD, WLA Document Review Attorney Adecco @ Google August 2013  –  January 2015  (1 year 6 months) Mountain View, CA Document Review Attorney Adecco @ Google August 2013  –  January 2015  (1 year 6 months) Mountain View, CA Contract Attorney Sidley Austin LLP 2013  –  2013  (less than a year) Contract Attorney Sidley Austin LLP 2013  –  2013  (less than a year) Contract Attorney O'Melveny & Myers LLP 2011  –  2012  (1 year) Century City, CA Contract Attorney O'Melveny & Myers LLP 2011  –  2012  (1 year) Century City, CA Attorney DocRun 2011  –  2011  (less than a year) Santa Monica, CA Attorney DocRun 2011  –  2011  (less than a year) Santa Monica, CA Reserve Deputy City Attorney City of Los Angeles 2010  –  2010  (less than a year) Central, Van Nuys Reserve Deputy City Attorney City of Los Angeles 2010  –  2010  (less than a year) Central, Van Nuys Production Assistant / Production Coordinator WPT Enterprises, Inc. 2009  –  2010  (1 year) Los Angeles, CA Production Assistant / Production Coordinator WPT Enterprises, Inc. 2009  –  2010  (1 year) Los Angeles, CA Production Assistant Freelance 2008  –  2009  (1 year) Greater Los Angeles Area Production Assistant Freelance 2008  –  2009  (1 year) Greater Los Angeles Area Executive Assistant / Story Editor Radmin Company 2007  –  2008  (1 year) Beverly Hills, CA Executive Assistant / Story Editor Radmin Company 2007  –  2008  (1 year) Beverly Hills, CA Legal Extern Directors Guild of America 2005  –  2005  (less than a year) Los Angeles, CA Legal Extern Directors Guild of America 2005  –  2005  (less than a year) Los Angeles, CA Development Assistant Flower Films 2001  –  2003  (2 years) Los Angeles, CA Development Assistant Flower Films 2001  –  2003  (2 years) Los Angeles, CA Runner / Personal Assistant to Lucy Liu Moonvision Entertainment 2002  –  2002  (less than a year) Los Angeles, CA Runner / Personal Assistant to Lucy Liu Moonvision Entertainment 2002  –  2002  (less than a year) Los Angeles, CA Runner / Personal Assistant to Nancy Juvonen Flower Films 2002  –  2002  (less than a year) Los Angeles, CA Runner / Personal Assistant to Nancy Juvonen Flower Films 2002  –  2002  (less than a year) Los Angeles, CA Skills All of them! Skills  All of them! All of them! All of them! Education UCLA School of Law J.D. UCLA School of Theater, Film, and Television B.A.,  Film/TV UCLA School of Law J.D. UCLA School of Law J.D. UCLA School of Law J.D. UCLA School of Theater, Film, and Television B.A.,  Film/TV UCLA School of Theater, Film, and Television B.A.,  Film/TV UCLA School of Theater, Film, and Television B.A.,  Film/TV ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Document Review Attorney Google (via Adecco) July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Document Review Attorney Bowman and Brooke (via Robert Half Legal) May 2010  –  May 2011  (1 year 1 month) Attorney Structure Law Group, LLP June 2010  –  December 2010  (7 months) San Jose, CA Legal Workshop Coordinator California Lawyers for the Arts November 2009  –  April 2010  (6 months) Law Clerk City of Cleveland Law Department August 2008  –  December 2008  (5 months) Legal Workshop Coordinator California Lawyers for the Arts June 2007  –  August 2007  (3 months) Editor Fifty Kids Productions September 2003  –  January 2005  (1 year 5 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Document Review Attorney Google (via Adecco) July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Document Review Attorney Google (via Adecco) July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Document Review Attorney Bowman and Brooke (via Robert Half Legal) May 2010  –  May 2011  (1 year 1 month) Document Review Attorney Bowman and Brooke (via Robert Half Legal) May 2010  –  May 2011  (1 year 1 month) Attorney Structure Law Group, LLP June 2010  –  December 2010  (7 months) San Jose, CA Attorney Structure Law Group, LLP June 2010  –  December 2010  (7 months) San Jose, CA Legal Workshop Coordinator California Lawyers for the Arts November 2009  –  April 2010  (6 months) Legal Workshop Coordinator California Lawyers for the Arts November 2009  –  April 2010  (6 months) Law Clerk City of Cleveland Law Department August 2008  –  December 2008  (5 months) Law Clerk City of Cleveland Law Department August 2008  –  December 2008  (5 months) Legal Workshop Coordinator California Lawyers for the Arts June 2007  –  August 2007  (3 months) Legal Workshop Coordinator California Lawyers for the Arts June 2007  –  August 2007  (3 months) Editor Fifty Kids Productions September 2003  –  January 2005  (1 year 5 months) Editor Fifty Kids Productions September 2003  –  January 2005  (1 year 5 months) Skills Legal Research Analysis Litigation Corporate Law Legal Writing Civil Litigation Westlaw Litigation Support Copyright Law Intellectual Property Licensing Document Review Patents Mediation Skills  Legal Research Analysis Litigation Corporate Law Legal Writing Civil Litigation Westlaw Litigation Support Copyright Law Intellectual Property Licensing Document Review Patents Mediation Legal Research Analysis Litigation Corporate Law Legal Writing Civil Litigation Westlaw Litigation Support Copyright Law Intellectual Property Licensing Document Review Patents Mediation Legal Research Analysis Litigation Corporate Law Legal Writing Civil Litigation Westlaw Litigation Support Copyright Law Intellectual Property Licensing Document Review Patents Mediation Education Case Western Reserve University Juris Doctor and Master of Business Administration 2005  – 2009 University of California, San Diego Bachelor of Arts,  Psychology 2000  – 2004 Santa Clara University 1999  – 1999 Case Western Reserve University Juris Doctor and Master of Business Administration 2005  – 2009 Case Western Reserve University Juris Doctor and Master of Business Administration 2005  – 2009 Case Western Reserve University Juris Doctor and Master of Business Administration 2005  – 2009 University of California, San Diego Bachelor of Arts,  Psychology 2000  – 2004 University of California, San Diego Bachelor of Arts,  Psychology 2000  – 2004 University of California, San Diego Bachelor of Arts,  Psychology 2000  – 2004 Santa Clara University 1999  – 1999 Santa Clara University 1999  – 1999 Santa Clara University 1999  – 1999 Honors & Awards Additional Honors & Awards CALI Excellence for the Future Award — Law of the Music Industry (2007) \n \nNottingham-Spirk Creativity Competition Winners (2008) Additional Honors & Awards CALI Excellence for the Future Award — Law of the Music Industry (2007) \n \nNottingham-Spirk Creativity Competition Winners (2008) Additional Honors & Awards CALI Excellence for the Future Award — Law of the Music Industry (2007) \n \nNottingham-Spirk Creativity Competition Winners (2008) Additional Honors & Awards CALI Excellence for the Future Award — Law of the Music Industry (2007) \n \nNottingham-Spirk Creativity Competition Winners (2008) ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Adecco at Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Essential Discovery at Cooley LLP April 2010  –  June 2011  (1 year 3 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Adecco at Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Adecco at Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Essential Discovery at Cooley LLP April 2010  –  June 2011  (1 year 3 months) Document Review Attorney Essential Discovery at Cooley LLP April 2010  –  June 2011  (1 year 3 months) Skills Intellectual Property Skills  Intellectual Property Intellectual Property Intellectual Property Education University of San Francisco School of Law 2004  – 2007 University of California, Los Angeles B.S.,  Mechanical Engineering 1997  – 2004 University of San Francisco School of Law 2004  – 2007 University of San Francisco School of Law 2004  – 2007 University of San Francisco School of Law 2004  – 2007 University of California, Los Angeles B.S.,  Mechanical Engineering 1997  – 2004 University of California, Los Angeles B.S.,  Mechanical Engineering 1997  – 2004 University of California, Los Angeles B.S.,  Mechanical Engineering 1997  – 2004 ", "Summary Experienced In-House and eDiscovery Attorney with a passion for Art Law and Cultural Heritage Protection. Thrives on finding creative solutions to challenging problems and collaborating with co-workers to implement new ideas.  \n \nPractice areas include competition, privacy, intellectual property, anti-trust, employment, importation, food & drug, and accounting fraud matters. Although most of my work is in English, I have managed and assisted on cases with significant Italian, French, Spanish and Portuguese document populations. \n \nSoftware Experience: Xerox OmniX, Axcelerate, Relativity, Citrix, Ringtail, LexisNexis, Microsoft Word, Excel, PowerPoint, Outlook, Adobe Suite, Google Drive and GMail. Summary Experienced In-House and eDiscovery Attorney with a passion for Art Law and Cultural Heritage Protection. Thrives on finding creative solutions to challenging problems and collaborating with co-workers to implement new ideas.  \n \nPractice areas include competition, privacy, intellectual property, anti-trust, employment, importation, food & drug, and accounting fraud matters. Although most of my work is in English, I have managed and assisted on cases with significant Italian, French, Spanish and Portuguese document populations. \n \nSoftware Experience: Xerox OmniX, Axcelerate, Relativity, Citrix, Ringtail, LexisNexis, Microsoft Word, Excel, PowerPoint, Outlook, Adobe Suite, Google Drive and GMail. Experienced In-House and eDiscovery Attorney with a passion for Art Law and Cultural Heritage Protection. Thrives on finding creative solutions to challenging problems and collaborating with co-workers to implement new ideas.  \n \nPractice areas include competition, privacy, intellectual property, anti-trust, employment, importation, food & drug, and accounting fraud matters. Although most of my work is in English, I have managed and assisted on cases with significant Italian, French, Spanish and Portuguese document populations. \n \nSoftware Experience: Xerox OmniX, Axcelerate, Relativity, Citrix, Ringtail, LexisNexis, Microsoft Word, Excel, PowerPoint, Outlook, Adobe Suite, Google Drive and GMail. Experienced In-House and eDiscovery Attorney with a passion for Art Law and Cultural Heritage Protection. Thrives on finding creative solutions to challenging problems and collaborating with co-workers to implement new ideas.  \n \nPractice areas include competition, privacy, intellectual property, anti-trust, employment, importation, food & drug, and accounting fraud matters. Although most of my work is in English, I have managed and assisted on cases with significant Italian, French, Spanish and Portuguese document populations. \n \nSoftware Experience: Xerox OmniX, Axcelerate, Relativity, Citrix, Ringtail, LexisNexis, Microsoft Word, Excel, PowerPoint, Outlook, Adobe Suite, Google Drive and GMail. Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Oversees daily management of substantive review and quality control for high-profile litigations, mergers & acquisitions, and government investigations in the areas of IP Litigation, Competition, and General Civil and Criminal Litigation. Develops new workflows, documentation practices, and training presentations independently and in collaboration with teammates to facilitate skills development, job efficiency, and accuracy of analyses. Provides in-depth analysis for investigations with diverse subject matters. Works closely with in-house and outside counsel to streamline reviews, balancing legal requirements with deadlines and scale of review. Refines large document populations down to documents essential to deposition and witness trial prep. Document Review Attorney Google Inc. (via Adecco) April 2012  –  January 2013  (10 months) Mountain View, CA Integral part of new in-house e-Discovery team. Project managed a team of 8 people through planning and execution of analytics, review and production stages to deliver documents ahead of schedule. Coordinated with outside counsel regarding project management and substantive review issues. Communicated with vendors to facilitate review process and address database issues. Routinely analyzed documents for responsiveness, 1st pass privilege analysis and source code analysis with high rates of accuracy. Contract Attorney Keker & Van Nest (via Pathways Personnel) June 2011  –  April 2012  (11 months) San Francisco Bay Area Worked closely with partners on hearing and deposition prep. Reviewed and analyzed documents on cases with diverse subject matter, including patent infringement, breach of contract and trade secret misappropriation. Evaluated documents for responsiveness, privilege, privacy, sensitive business information and substantive issues using Concordance. Maintained accuracy while performing advanced privilege analysis, redactions and logging under tight deadlines. Business Development Manager nuherbs Co. March 2009  –  February 2011  (2 years) Oakland, CA Drafted and revised business contracts and internal HR documents. Oversaw trademark portfolio for new and existing marks, communicating with Outside Counsel as appropriate. Ensured compliance with all State and Federal Regulations, including CITES, Current Good Manufacturing Practices and Food & Drug law requirements.  \nOverhauled communications, social media and outreach programs to increase customer satisfaction and generate new customer leads. Designed, wrote and maintained monthly newsletter. Planned & directed website development for new service. Contract Attorney Robbins Geller Rudman & Dowd LLP February 2007  –  February 2009  (2 years 1 month) San Diego, CA Document review and analysis for large-scale securities class action cases, paper and online. Prepared witness memoranda for deposition based on in-depth analysis of deposition transcripts. Researched relevant case law, assisted with discovery pleadings, and supported partners with expert witness preparation and disclosures. \n(Formerly Coughlin Stoia Gellar Rudman and Robbins; Lerach Coughlin Stoia Gellar Rudman and Robbins) Planned Giving Associate (Volunteer) Museum of Contemporary Art San Diego April 2007  –  December 2007  (9 months) Greater San Diego Area Counseled museum development staff on tax laws, planned giving vehicles, approaches to specific donors and general legal issues, including intellectual property law and vendor contracts. Collaborated with museum staff to ensure marketing materials accurately reflect Federal Tax laws and procedures. Director of Communications Dunn School April 2005  –  August 2006  (1 year 5 months) Researched and strategized overhaul of Planned Giving Program for 501(c)(3) institution. Increased current and alumni community involvement through creation and implementation of new marketing and communications channels to further brand development and differentiation, including weekly and monthly Newsletters, Annual Fund mailers and the Dunn School Journal. Organized and facilitated Grandparents Day and Alumni Weekend scheduling, communications and events. Associate Ericksen Arbuthnot October 2004  –  March 2005  (6 months) Oakland, CA Analyzed cases, researched applicable laws and wrote memoranda, motions, budgets, and case-handling proposals for civil litigation firm requiring high billable hours (2040/year) and frequent client contact and cultivation. Proactively involved in all aspects of pre-trial litigation for heavy caseload necessitating adaptability and fast learning curve. Worked closely with clients, opposing counsel and court officials to settle cases to clients’ satisfaction. Contract Attorney Ajilon Legal July 2004  –  August 2004  (2 months) Reviewed and translated Italian documents for Sidley, Austin, Brown and Wood on high profile, multi-faceted litigation demanding strict adherence to last-minute deadlines and attention to detail. Summer Intern Korshak, Kracoff, Kong & Sugano June 2003  –  August 2003  (3 months) Researched and drafted memoranda for diverse areas of litigation. Efficiently distilled information from complicated deposition transcripts into concise summaries. Gained exposure to clients and the court process by attending mediations, participating in client meetings and preparing for trial. Summer Intern Dr. Pätzold and Partner June 2001  –  August 2001  (3 months) Performed searches for prior art, evaluated possible infringing marks and determined appropriate actions; reviewed USPTO and OHIM applications for accuracy and language at German Trademark and general Intellectual Property prosecution firm. Actively communicated with foreign counsel and clients in English and Italian. Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Oversees daily management of substantive review and quality control for high-profile litigations, mergers & acquisitions, and government investigations in the areas of IP Litigation, Competition, and General Civil and Criminal Litigation. Develops new workflows, documentation practices, and training presentations independently and in collaboration with teammates to facilitate skills development, job efficiency, and accuracy of analyses. Provides in-depth analysis for investigations with diverse subject matters. Works closely with in-house and outside counsel to streamline reviews, balancing legal requirements with deadlines and scale of review. Refines large document populations down to documents essential to deposition and witness trial prep. Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Oversees daily management of substantive review and quality control for high-profile litigations, mergers & acquisitions, and government investigations in the areas of IP Litigation, Competition, and General Civil and Criminal Litigation. Develops new workflows, documentation practices, and training presentations independently and in collaboration with teammates to facilitate skills development, job efficiency, and accuracy of analyses. Provides in-depth analysis for investigations with diverse subject matters. Works closely with in-house and outside counsel to streamline reviews, balancing legal requirements with deadlines and scale of review. Refines large document populations down to documents essential to deposition and witness trial prep. Document Review Attorney Google Inc. (via Adecco) April 2012  –  January 2013  (10 months) Mountain View, CA Integral part of new in-house e-Discovery team. Project managed a team of 8 people through planning and execution of analytics, review and production stages to deliver documents ahead of schedule. Coordinated with outside counsel regarding project management and substantive review issues. Communicated with vendors to facilitate review process and address database issues. Routinely analyzed documents for responsiveness, 1st pass privilege analysis and source code analysis with high rates of accuracy. Document Review Attorney Google Inc. (via Adecco) April 2012  –  January 2013  (10 months) Mountain View, CA Integral part of new in-house e-Discovery team. Project managed a team of 8 people through planning and execution of analytics, review and production stages to deliver documents ahead of schedule. Coordinated with outside counsel regarding project management and substantive review issues. Communicated with vendors to facilitate review process and address database issues. Routinely analyzed documents for responsiveness, 1st pass privilege analysis and source code analysis with high rates of accuracy. Contract Attorney Keker & Van Nest (via Pathways Personnel) June 2011  –  April 2012  (11 months) San Francisco Bay Area Worked closely with partners on hearing and deposition prep. Reviewed and analyzed documents on cases with diverse subject matter, including patent infringement, breach of contract and trade secret misappropriation. Evaluated documents for responsiveness, privilege, privacy, sensitive business information and substantive issues using Concordance. Maintained accuracy while performing advanced privilege analysis, redactions and logging under tight deadlines. Contract Attorney Keker & Van Nest (via Pathways Personnel) June 2011  –  April 2012  (11 months) San Francisco Bay Area Worked closely with partners on hearing and deposition prep. Reviewed and analyzed documents on cases with diverse subject matter, including patent infringement, breach of contract and trade secret misappropriation. Evaluated documents for responsiveness, privilege, privacy, sensitive business information and substantive issues using Concordance. Maintained accuracy while performing advanced privilege analysis, redactions and logging under tight deadlines. Business Development Manager nuherbs Co. March 2009  –  February 2011  (2 years) Oakland, CA Drafted and revised business contracts and internal HR documents. Oversaw trademark portfolio for new and existing marks, communicating with Outside Counsel as appropriate. Ensured compliance with all State and Federal Regulations, including CITES, Current Good Manufacturing Practices and Food & Drug law requirements.  \nOverhauled communications, social media and outreach programs to increase customer satisfaction and generate new customer leads. Designed, wrote and maintained monthly newsletter. Planned & directed website development for new service. Business Development Manager nuherbs Co. March 2009  –  February 2011  (2 years) Oakland, CA Drafted and revised business contracts and internal HR documents. Oversaw trademark portfolio for new and existing marks, communicating with Outside Counsel as appropriate. Ensured compliance with all State and Federal Regulations, including CITES, Current Good Manufacturing Practices and Food & Drug law requirements.  \nOverhauled communications, social media and outreach programs to increase customer satisfaction and generate new customer leads. Designed, wrote and maintained monthly newsletter. Planned & directed website development for new service. Contract Attorney Robbins Geller Rudman & Dowd LLP February 2007  –  February 2009  (2 years 1 month) San Diego, CA Document review and analysis for large-scale securities class action cases, paper and online. Prepared witness memoranda for deposition based on in-depth analysis of deposition transcripts. Researched relevant case law, assisted with discovery pleadings, and supported partners with expert witness preparation and disclosures. \n(Formerly Coughlin Stoia Gellar Rudman and Robbins; Lerach Coughlin Stoia Gellar Rudman and Robbins) Contract Attorney Robbins Geller Rudman & Dowd LLP February 2007  –  February 2009  (2 years 1 month) San Diego, CA Document review and analysis for large-scale securities class action cases, paper and online. Prepared witness memoranda for deposition based on in-depth analysis of deposition transcripts. Researched relevant case law, assisted with discovery pleadings, and supported partners with expert witness preparation and disclosures. \n(Formerly Coughlin Stoia Gellar Rudman and Robbins; Lerach Coughlin Stoia Gellar Rudman and Robbins) Planned Giving Associate (Volunteer) Museum of Contemporary Art San Diego April 2007  –  December 2007  (9 months) Greater San Diego Area Counseled museum development staff on tax laws, planned giving vehicles, approaches to specific donors and general legal issues, including intellectual property law and vendor contracts. Collaborated with museum staff to ensure marketing materials accurately reflect Federal Tax laws and procedures. Planned Giving Associate (Volunteer) Museum of Contemporary Art San Diego April 2007  –  December 2007  (9 months) Greater San Diego Area Counseled museum development staff on tax laws, planned giving vehicles, approaches to specific donors and general legal issues, including intellectual property law and vendor contracts. Collaborated with museum staff to ensure marketing materials accurately reflect Federal Tax laws and procedures. Director of Communications Dunn School April 2005  –  August 2006  (1 year 5 months) Researched and strategized overhaul of Planned Giving Program for 501(c)(3) institution. Increased current and alumni community involvement through creation and implementation of new marketing and communications channels to further brand development and differentiation, including weekly and monthly Newsletters, Annual Fund mailers and the Dunn School Journal. Organized and facilitated Grandparents Day and Alumni Weekend scheduling, communications and events. Director of Communications Dunn School April 2005  –  August 2006  (1 year 5 months) Researched and strategized overhaul of Planned Giving Program for 501(c)(3) institution. Increased current and alumni community involvement through creation and implementation of new marketing and communications channels to further brand development and differentiation, including weekly and monthly Newsletters, Annual Fund mailers and the Dunn School Journal. Organized and facilitated Grandparents Day and Alumni Weekend scheduling, communications and events. Associate Ericksen Arbuthnot October 2004  –  March 2005  (6 months) Oakland, CA Analyzed cases, researched applicable laws and wrote memoranda, motions, budgets, and case-handling proposals for civil litigation firm requiring high billable hours (2040/year) and frequent client contact and cultivation. Proactively involved in all aspects of pre-trial litigation for heavy caseload necessitating adaptability and fast learning curve. Worked closely with clients, opposing counsel and court officials to settle cases to clients’ satisfaction. Associate Ericksen Arbuthnot October 2004  –  March 2005  (6 months) Oakland, CA Analyzed cases, researched applicable laws and wrote memoranda, motions, budgets, and case-handling proposals for civil litigation firm requiring high billable hours (2040/year) and frequent client contact and cultivation. Proactively involved in all aspects of pre-trial litigation for heavy caseload necessitating adaptability and fast learning curve. Worked closely with clients, opposing counsel and court officials to settle cases to clients’ satisfaction. Contract Attorney Ajilon Legal July 2004  –  August 2004  (2 months) Reviewed and translated Italian documents for Sidley, Austin, Brown and Wood on high profile, multi-faceted litigation demanding strict adherence to last-minute deadlines and attention to detail. Contract Attorney Ajilon Legal July 2004  –  August 2004  (2 months) Reviewed and translated Italian documents for Sidley, Austin, Brown and Wood on high profile, multi-faceted litigation demanding strict adherence to last-minute deadlines and attention to detail. Summer Intern Korshak, Kracoff, Kong & Sugano June 2003  –  August 2003  (3 months) Researched and drafted memoranda for diverse areas of litigation. Efficiently distilled information from complicated deposition transcripts into concise summaries. Gained exposure to clients and the court process by attending mediations, participating in client meetings and preparing for trial. Summer Intern Korshak, Kracoff, Kong & Sugano June 2003  –  August 2003  (3 months) Researched and drafted memoranda for diverse areas of litigation. Efficiently distilled information from complicated deposition transcripts into concise summaries. Gained exposure to clients and the court process by attending mediations, participating in client meetings and preparing for trial. Summer Intern Dr. Pätzold and Partner June 2001  –  August 2001  (3 months) Performed searches for prior art, evaluated possible infringing marks and determined appropriate actions; reviewed USPTO and OHIM applications for accuracy and language at German Trademark and general Intellectual Property prosecution firm. Actively communicated with foreign counsel and clients in English and Italian. Summer Intern Dr. Pätzold and Partner June 2001  –  August 2001  (3 months) Performed searches for prior art, evaluated possible infringing marks and determined appropriate actions; reviewed USPTO and OHIM applications for accuracy and language at German Trademark and general Intellectual Property prosecution firm. Actively communicated with foreign counsel and clients in English and Italian. Languages Italian Full professional proficiency French Professional working proficiency Spanish Professional working proficiency Portuguese Limited working proficiency Italian Full professional proficiency French Professional working proficiency Spanish Professional working proficiency Portuguese Limited working proficiency Italian Full professional proficiency French Professional working proficiency Spanish Professional working proficiency Portuguese Limited working proficiency Full professional proficiency Professional working proficiency Professional working proficiency Limited working proficiency Skills Legal Research Litigation Civil Litigation Intellectual Property Mediation Document Review Trademarks Depositions Legal Writing Class Actions Litigation Support Pleadings Patents Research Corporate Governance Skills  Legal Research Litigation Civil Litigation Intellectual Property Mediation Document Review Trademarks Depositions Legal Writing Class Actions Litigation Support Pleadings Patents Research Corporate Governance Legal Research Litigation Civil Litigation Intellectual Property Mediation Document Review Trademarks Depositions Legal Writing Class Actions Litigation Support Pleadings Patents Research Corporate Governance Legal Research Litigation Civil Litigation Intellectual Property Mediation Document Review Trademarks Depositions Legal Writing Class Actions Litigation Support Pleadings Patents Research Corporate Governance Education University of San Diego School of Law Diploma in Taxation 2006  – 2007 Coursework: Federal Estate and Gift Taxation; Corporate Tax; REITS; Estate Planning; Taxation of Property Transactions. Santa Clara University - Leavey School of Business Masters,  Business Administration 2002  – 2003 Completed 32 units Santa Clara University School of Law JD,  Law 2000  – 2003 Activities and Societies:  Lexis-Nexis Associate; Emery Law Scholarship ,  Law Faculty Scholarship; Munich High Tech Summer Program 2001; Student Bar Association Office Manager and Class Representative; Phi Delta Phi President; Pro Bono Plaque Recipient – East San Jose Community Law Center Volunteer; International Law Students Association Officer ,  Women and Law Club Officer ,  Intellectual Property Association member. University of California, Santa Barbara BA,  Italian Cultural Studies 1997  – 1999 Romance language major with coursework emphasis on Art History and Linguistics. Activities and Societies:  Graduated with Highest Honors; Honors in the Major; Dean’s List; Education Abroad Program ,  Italy (year). Washington and Lee University n/a,  n/a 1995  – 1996 Activities and Societies:  Chi Omega Sorority; Volleyball Robert Louis Stevenson 1991  – 1995 University of San Diego School of Law Diploma in Taxation 2006  – 2007 Coursework: Federal Estate and Gift Taxation; Corporate Tax; REITS; Estate Planning; Taxation of Property Transactions. University of San Diego School of Law Diploma in Taxation 2006  – 2007 Coursework: Federal Estate and Gift Taxation; Corporate Tax; REITS; Estate Planning; Taxation of Property Transactions. University of San Diego School of Law Diploma in Taxation 2006  – 2007 Coursework: Federal Estate and Gift Taxation; Corporate Tax; REITS; Estate Planning; Taxation of Property Transactions. Santa Clara University - Leavey School of Business Masters,  Business Administration 2002  – 2003 Completed 32 units Santa Clara University - Leavey School of Business Masters,  Business Administration 2002  – 2003 Completed 32 units Santa Clara University - Leavey School of Business Masters,  Business Administration 2002  – 2003 Completed 32 units Santa Clara University School of Law JD,  Law 2000  – 2003 Activities and Societies:  Lexis-Nexis Associate; Emery Law Scholarship ,  Law Faculty Scholarship; Munich High Tech Summer Program 2001; Student Bar Association Office Manager and Class Representative; Phi Delta Phi President; Pro Bono Plaque Recipient – East San Jose Community Law Center Volunteer; International Law Students Association Officer ,  Women and Law Club Officer ,  Intellectual Property Association member. Santa Clara University School of Law JD,  Law 2000  – 2003 Activities and Societies:  Lexis-Nexis Associate; Emery Law Scholarship ,  Law Faculty Scholarship; Munich High Tech Summer Program 2001; Student Bar Association Office Manager and Class Representative; Phi Delta Phi President; Pro Bono Plaque Recipient – East San Jose Community Law Center Volunteer; International Law Students Association Officer ,  Women and Law Club Officer ,  Intellectual Property Association member. Santa Clara University School of Law JD,  Law 2000  – 2003 Activities and Societies:  Lexis-Nexis Associate; Emery Law Scholarship ,  Law Faculty Scholarship; Munich High Tech Summer Program 2001; Student Bar Association Office Manager and Class Representative; Phi Delta Phi President; Pro Bono Plaque Recipient – East San Jose Community Law Center Volunteer; International Law Students Association Officer ,  Women and Law Club Officer ,  Intellectual Property Association member. University of California, Santa Barbara BA,  Italian Cultural Studies 1997  – 1999 Romance language major with coursework emphasis on Art History and Linguistics. Activities and Societies:  Graduated with Highest Honors; Honors in the Major; Dean’s List; Education Abroad Program ,  Italy (year). University of California, Santa Barbara BA,  Italian Cultural Studies 1997  – 1999 Romance language major with coursework emphasis on Art History and Linguistics. Activities and Societies:  Graduated with Highest Honors; Honors in the Major; Dean’s List; Education Abroad Program ,  Italy (year). University of California, Santa Barbara BA,  Italian Cultural Studies 1997  – 1999 Romance language major with coursework emphasis on Art History and Linguistics. Activities and Societies:  Graduated with Highest Honors; Honors in the Major; Dean’s List; Education Abroad Program ,  Italy (year). Washington and Lee University n/a,  n/a 1995  – 1996 Activities and Societies:  Chi Omega Sorority; Volleyball Washington and Lee University n/a,  n/a 1995  – 1996 Activities and Societies:  Chi Omega Sorority; Volleyball Washington and Lee University n/a,  n/a 1995  – 1996 Activities and Societies:  Chi Omega Sorority; Volleyball Robert Louis Stevenson 1991  – 1995 Robert Louis Stevenson 1991  – 1995 Robert Louis Stevenson 1991  – 1995 ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Contract Attorney Google (through Adecco) July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Contract Attorney Sony Pictures Entertainment April 2011  –  June 2011  (3 months) Culver City, CA Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Mountain View, CA Contract Attorney Google (through Adecco) July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Contract Attorney Google (through Adecco) July 2011  –  January 2013  (1 year 7 months) Mountain View, CA Contract Attorney Sony Pictures Entertainment April 2011  –  June 2011  (3 months) Culver City, CA Contract Attorney Sony Pictures Entertainment April 2011  –  June 2011  (3 months) Culver City, CA Languages Spanish Spanish Spanish Skills Litigation Support Patent Prosecution Corporate Law Legal Writing Patent Litigation Intellectual Property Copyright Law Document Review Patents Licensing Trade Secrets Trademarks Skills  Litigation Support Patent Prosecution Corporate Law Legal Writing Patent Litigation Intellectual Property Copyright Law Document Review Patents Licensing Trade Secrets Trademarks Litigation Support Patent Prosecution Corporate Law Legal Writing Patent Litigation Intellectual Property Copyright Law Document Review Patents Licensing Trade Secrets Trademarks Litigation Support Patent Prosecution Corporate Law Legal Writing Patent Litigation Intellectual Property Copyright Law Document Review Patents Licensing Trade Secrets Trademarks Education Benjamin N. Cardozo School of Law, Yeshiva University Doctor of Law (JD),  Intellectual Property Law 2005  – 2008 University of California, Irvine B.S.,  Information & Computer Science 2001  – 2005 Benjamin N. Cardozo School of Law, Yeshiva University Doctor of Law (JD),  Intellectual Property Law 2005  – 2008 Benjamin N. Cardozo School of Law, Yeshiva University Doctor of Law (JD),  Intellectual Property Law 2005  – 2008 Benjamin N. Cardozo School of Law, Yeshiva University Doctor of Law (JD),  Intellectual Property Law 2005  – 2008 University of California, Irvine B.S.,  Information & Computer Science 2001  – 2005 University of California, Irvine B.S.,  Information & Computer Science 2001  – 2005 University of California, Irvine B.S.,  Information & Computer Science 2001  – 2005 ", "Experience Discovery Staff Attorney Google December 2012  – Present (2 years 9 months) Mountain View, CA Discovery Staff Attorney Google December 2012  – Present (2 years 9 months) Mountain View, CA Discovery Staff Attorney Google December 2012  – Present (2 years 9 months) Mountain View, CA Education UC Hastings College of the Law JD 2006  – 2009 University of California, Los Angeles BS,  Mathematics-Economics ,  Statistics Minor 2004 UC Hastings College of the Law JD 2006  – 2009 UC Hastings College of the Law JD 2006  – 2009 UC Hastings College of the Law JD 2006  – 2009 University of California, Los Angeles BS,  Mathematics-Economics ,  Statistics Minor 2004 University of California, Los Angeles BS,  Mathematics-Economics ,  Statistics Minor 2004 University of California, Los Angeles BS,  Mathematics-Economics ,  Statistics Minor 2004 ", "Skills Document Analysis Trial Preparation Securities Litigation Antitrust Complex Litigation Trials Competition Law Litigation Document Review Litigation Support Patent Litigation Bankruptcy Appeals Civil Litigation Legal Research Legal Writing See 1+     See less Skills  Document Analysis Trial Preparation Securities Litigation Antitrust Complex Litigation Trials Competition Law Litigation Document Review Litigation Support Patent Litigation Bankruptcy Appeals Civil Litigation Legal Research Legal Writing See 1+     See less Document Analysis Trial Preparation Securities Litigation Antitrust Complex Litigation Trials Competition Law Litigation Document Review Litigation Support Patent Litigation Bankruptcy Appeals Civil Litigation Legal Research Legal Writing See 1+     See less Document Analysis Trial Preparation Securities Litigation Antitrust Complex Litigation Trials Competition Law Litigation Document Review Litigation Support Patent Litigation Bankruptcy Appeals Civil Litigation Legal Research Legal Writing See 1+     See less ", "Summary Handled e-discovery and case management for national and international litigation cases including foreign language documents in securities, antitrust, pharmaceutical, intellectual property, employment litigation, SEC, FCPA and EPA investigations. Assist in preparation for witness depositions, including compiling relevant documents for witness binders, researching legal issues and drafting legal memoranda. \n \nAssisted the Ambassador of Ethiopia to the United States in reviewing and drafting official and diplomatic communications, participated in meetings with US private and government entities regarding various issues ranging from aid allocation, investment opportunities and conflict arbitration while at the Embassy of Ethiopia.  \n \nResearched international issues related to human rights, social development and conflict resolution and management while interning at international organizations such as the African Union and the United Nations. Summary Handled e-discovery and case management for national and international litigation cases including foreign language documents in securities, antitrust, pharmaceutical, intellectual property, employment litigation, SEC, FCPA and EPA investigations. Assist in preparation for witness depositions, including compiling relevant documents for witness binders, researching legal issues and drafting legal memoranda. \n \nAssisted the Ambassador of Ethiopia to the United States in reviewing and drafting official and diplomatic communications, participated in meetings with US private and government entities regarding various issues ranging from aid allocation, investment opportunities and conflict arbitration while at the Embassy of Ethiopia.  \n \nResearched international issues related to human rights, social development and conflict resolution and management while interning at international organizations such as the African Union and the United Nations. Handled e-discovery and case management for national and international litigation cases including foreign language documents in securities, antitrust, pharmaceutical, intellectual property, employment litigation, SEC, FCPA and EPA investigations. Assist in preparation for witness depositions, including compiling relevant documents for witness binders, researching legal issues and drafting legal memoranda. \n \nAssisted the Ambassador of Ethiopia to the United States in reviewing and drafting official and diplomatic communications, participated in meetings with US private and government entities regarding various issues ranging from aid allocation, investment opportunities and conflict arbitration while at the Embassy of Ethiopia.  \n \nResearched international issues related to human rights, social development and conflict resolution and management while interning at international organizations such as the African Union and the United Nations. Handled e-discovery and case management for national and international litigation cases including foreign language documents in securities, antitrust, pharmaceutical, intellectual property, employment litigation, SEC, FCPA and EPA investigations. Assist in preparation for witness depositions, including compiling relevant documents for witness binders, researching legal issues and drafting legal memoranda. \n \nAssisted the Ambassador of Ethiopia to the United States in reviewing and drafting official and diplomatic communications, participated in meetings with US private and government entities regarding various issues ranging from aid allocation, investment opportunities and conflict arbitration while at the Embassy of Ethiopia.  \n \nResearched international issues related to human rights, social development and conflict resolution and management while interning at international organizations such as the African Union and the United Nations. Experience Contract Attorney Cravath, Swaine & Moore LLP May 2015  – Present (4 months) Greater New York City Area Review documents in Spanish and French in a proposed merger transaction, and in response to a request by the Antitrust Division of the DOJ pursuant to the Clayton Act and the Premerger Notification Rules and Regulations.  Contract Attorney WilmerHale May 2015  –  May 2015  (1 month) Greater New York City Area Review documents for responsiveness and privilege in a joint SEC/PCAOB investigation of one of the \"Big Four\" audit firms. Analyse and determine as to whether the audit firm's client did not violate the Federal Securities law and/or the PCAOB rules.  Legal Consultant SS Communications PLC March 2015  –  May 2015  (3 months) Addis Ababa, Ethiopia Draft various contracts including Service Legal Agreements with several banks. Contract Attorney/E-Discovery Attorney -- Securities Litigation Practice Group Sullivan & Cromwell LLP September 2013  –  July 2014  (11 months) Greater New York City Area Confidential. \nCurrent and ongoing SEC investigations. Contract Attorney -- Securities Litigation Practice Group Gibson, Dunn & Crutcher LLP November 2013  –  November 2013  (1 month) Greater New York City Area Reviewed documents for responsiveness and privilege in a SEC investigation of a hedge fund to determine if whether or not a number of its employees received non-public information from research analysts of a major bank about a given company before its dissemination and traded on that information. Contract Attorney -- Intellectual Property Litigation Group Sidley Austin LLP September 2013  –  November 2013  (3 months) Greater New York City Area Reviewed French documents in a patent infringement lawsuit brought by one of the world’s largest French cosmetics and beauty company against an American brand of skin care, hair care and cosmetics to determine the subject matter of the documents plaintiff has produced in the litigation and to identify the client’s defenses and counterclaims for use in depositions of plaintiff’s witnesses and in preparing for trial. Contract Attorney -- Litigation Practice Group Blank Rome LLP August 2013  –  August 2013  (1 month) Greater New York City Area Reviewed documents for privilege and made all necessary entries for privilege logs in a patent infringement case brought against a multinational internet company for allegations of using plaintiff’s certified email sender list to filter spam emails. Contract Attorney -- Litigation Department Paul Hastings June 2013  –  July 2013  (2 months) Greater New York City Area Reviewed French documents for responsiveness in an internal investigation triggered by a whistleblower’s allegations of improper, and non-internal policy compliant, sales practices in the France office of one of the largest US multinational computer technology corporation. Translated relevant documents from French to English. Contract Attorney -- Antitrust Group Shearman & Sterling LLP April 2013  –  April 2013  (1 month) Greater New York City Area Reviewed documents for responsiveness and privilege in a matter involving a pre-merger investigation by the Federal Trade Commission, Second Request, regarding the proposed acquisition of a glass containers packaging and manufacturing company. Contract Attorney -- Litigation Practice Group Cravath, Swaine & Moore LLP August 2012  –  February 2013  (7 months) • Reviewed documents in a joint SEC/DOJ investigation of the client’s compliance with internal FCPA policies. Reviewed the effectiveness of the Audit Department controls regarding FCPA policies and certification process, pre-approval requirements for third-party contracts or the use of third-party representatives, internal reporting requirements of a violation of FCPA policy. \n• Reviewed documents for responsiveness and privilege in a patent infringement litigation brought against a leading developer of wireless communication technology. Fact discovery phase. E-Discovery Contract Attorney Google July 2012  –  July 2012  (1 month) Reviewed documents for responsiveness, privilege and issue coding in a Federal Trade Commission investigation if whether the client offers licenses based on FRAND (fair, reasonable, and non-discriminatory) terms for standards-essential patents. Contract Attorney -- Antitrust, Competition and Trade Regulation Practice Bingham McCutchen January 2012  –  March 2012  (3 months) Reviewed documents for responsiveness and privilege in a matter involving a pre-merger investigation by the Federal Trade Commission, Second Request, regarding the proposed acquisition of a music company by another prominent music group. Contract Attorney -- Class Action Litigation Practice Quinn Emanuel October 2011  –  January 2012  (4 months) Greater New York City Area Reviewed French documents for responsiveness, confidentiality and privilege in a group of product liability cases concerning pelvic surgical mesh products. Created a searchable and accessible list of complaints by type of product to easily identify the responsive products and facilitate issue coding. Contract Attorney -- Antitrust Practice Group Wilson Sonsini Goodrich & Rosati July 2011  –  October 2011  (4 months) Greater New York City Area Reviewed documents for responsiveness, confidentiality and privilege in an antitrust litigation alleging that a vendor of photochromic lenses illegally maintained and enhanced a monopoly by employing various business tactics, including refusing to deal with certain companies and requiring exclusivity or preferential treatment from other companies. Contract Attorney -- Intellectual Property Practice Group Morrison & Foerster LLP March 2011  –  July 2011  (5 months) Greater New York City Area Reviewed documents for responsiveness and privilege in support of a complaint filed by one of the world’s leading technology companies for several patents and copyrights infringement by another company’s use of an operating system software platform for cellular telephones and other mobile devices. Contract Attorney -- Commercial Litigation Practice Group Proskauer Rose LLP October 2010  –  March 2011  (6 months) New York New York Reviewed documents for privilege in an insurance coverage action brought by two merged investment banks against eight defendant insurers for their failure to indemnify the banks for the insured portion of losses incurred in connection with the defense and settlement claims brought against one of the banks prior to the merger. Claims were in connection with the investigation of some of the bank’s client’s asset-backed securities after it bought assets by dipping into funds intended to protect bondholders. Contract Attorney -- Litigation Practice Group DLA Piper August 2010  –  September 2010  (2 months) Greater New York City Area Reviewed documents for privilege and responsiveness in defense of a Global Real Estate Group of a major insurance company against claims and allegations by its former Chief Executive Officer of breach of contract by withholding the distribution of profit interests distribution based on the performance of the sale of assets held in each portfolio and in accordance with the profit-sharing incentive program. Contract Attorney -- Intellectual Property Practice Group Gibson, Dunn & Crutcher LLP February 2010  –  June 2010  (5 months) Greater New York City Area Reviewed documents for quality check and privilege in defense of a major corporation against allegations of patent infringement of a technology used in a wireless device and dealing with encryption for the distribution of digital books. Contract Attorney -- Environmental Practice Group Whiteman Osterman & Hanna LLP October 2009  –  January 2010  (4 months) Greater New York City Area Reviewed documents for responsiveness in preparation of an EPA and NYSDEC investigation of whether or not client complied with environmental laws in handling toxic waste pollution and discharges of contamination in public waterways. Review for privilege. Contract Attorney -- Antitrust Litigation Pillsbury Winthrop Shaw Pittman LLP September 2009  –  October 2009  (2 months) Greater New York City Area Reviewed English and Spanish documents for responsiveness in an investigation by the DOJ of a money transmitter serving the Caribbean, Central and South America for allegations of client and competitors fixing prices in violation of Section 1 of the Sherman Act. Contract Attorney -- Labor & Employment Litigation Hogan Lovells July 2009  –  September 2009  (3 months) Greater New York City Area Reviewed documents for responsiveness in preparation of a lawsuit brought by former employees against a national cable company for unpaid wages and compensation. Review for privilege. (Worked on this case while still working on another case at Reed Smith with the accord of both parties as Reed Smith was a remote project and only required that I fulfill the task on time and attend the bi-weekly conference calls.) Contract Attorney -- Intellectual Property Group Reed Smith LLP February 2009  –  August 2009  (7 months) Greater Philadelphia Area Defense of a major pharmaceutical company alleged to have misappropriated French plaintiff’s proprietary insect cell technology for commercial use and misused trade secrets in violation of a prior licensing agreement. Review for quality control and privilege. Translated relevant documents from French to English. Contract Attorney -- Litigation Practice Group Sullivan & Cromwell LLP October 2007  –  January 2009  (1 year 4 months) Greater New York City Area International litigation involving a French client. Discovery phase. Reviewed documents in preparation of a securities litigation wherein a hedge fund alleged a french reinsurance company fraudulently misrepresented its financial situation to induce plaintiff’s investment. Review for quality control as well as for U.S. and French privilege; understand and navigate between the differences of two jurisdictions regarding attorney-client relationships (Attorney-Client privilege in the United States versus French Professional Secrecy rules - that are broader in terms of protection - in France.) Prepared privilege log and translated significant legal documents from French to English. Contract Attorney -- Securities Fraud Litigation Practice Group Bernstein Litowitz Berger & Grossmann LLP July 2007  –  October 2007  (4 months) Greater New York City Area Conducted first and second level review in numerous securities class action litigation filed against one of the nation’s largest healthcare services providers by persons damaged as a result of their purchases of debt securities of the company. Assisted attorneys by drafting memoranda in preparation of witness depositions. Prepared a chronological list of events and analyzed the ratings of the company during the “class period” by major rating agencies. Contract Attorney -- U.S. and International Antitrust Practice Group WilmerHale April 2007  –  June 2007  (3 months) Greater New York City Area Conducted first and second level review of documents relating to a proposed acquisition transaction of a hotel and airways provider in response to a second request by the Antitrust Division of the Department of Justice pursuant to the Pre-Merger Notification Rules and Regulations. Contract Attorney -- Litigation Department Willkie Farr & Gallagher LLP October 2006  –  February 2007  (5 months) Greater New York City Area Reviewed and analyzed corporate financial documents and executive-level communications in response to a SEC informal inquiry with respect to allegations of accounting misconduct, closely worked with forensic accountants and auditors to determine the veracity of the company’s accounting procedures and financial statements. Contract Attorney -- Litigation Practice Group King & Spalding March 2006  –  October 2006  (8 months) Greater New York City Area Examined and analyzed significant French pleadings, correspondence and memoranda, including accounting and financial documents, in response to claims of reporting, books and records and internal control violations in a securities class action litigation. Assisted in the preparation of witness depositions. Translated relevant documents from French to English. Researched relevant information in preparation of a motion to preclude opposing parties from asking the company’s former CEO a number of questions during deposition. Contract Attorney -- Intellectual Property Litigation Group Cadwalader, Wickersham & Taft LLP January 2006  –  March 2006  (3 months) Washington D.C. Metro Area Review responsive French discovery documents in preparation of a defense of a major pharmaceutical company in order to prevent the violation of intellectual property rights by generic substitutes of a famous branded drug. Translated relevant documents from French to English. Judicial Law Clerk FIRST JUDICIAL DISTRICT OF PENNSYLVANIA COURT OF COMMON PLEAS, CRIMINAL TRIAL DIVISION January 2004  –  January 2006  (2 years 1 month) Greater Philadelphia Area Drafted court opinions for submission to the Superior Court of Pennsylvania. Researched and analyzed issues raised on appeal. Wrote court orders, memoranda and decisions. Extensively reviewed and researched legal issues raised in motions before and during jury and waiver trials. Drafted jury instructions for crimes that the Pennsylvania Suggested Standard Criminal Jury Instructions did not provide jury instructions. Attended motion hearings, trials and pretrial conferences. Prepared sentencing guideline forms electronically in accordance with the Pennsylvania Sentencing Guideline Manual. Law Clerk -- International Commerce & Litigation Group DLA Piper (formerly Piper Rudnick LLP) February 2002  –  April 2003  (1 year 3 months) Washington D.C. Metro Area Researched French legal procedures so as to find a basis to preclude a subpoenaed U.S. company from appearing before French courts as a witness in one of the largest corporate fraud investigations in Europe. Analyzed evidentiary documents for briefs for a submission to the international arbitral tribunals in The Hague. Prepared a summary memorandum on the legality of a Cote d’Ivoire Supreme Court decision rejecting a presidential candidacy and its effect on U.S. aid to that country. Reviewed and translated evidentiary documents in the Ethiopian-Eritrean conflict arbitration, organized documents relevant to the Claims Commission and the Borders Commission so as to facilitate the Court’s review of the evidence in both claims. Translated relevant documents and treaties from Amharic into English. Executive Assistant of the Ambassador Embassy of Ethiopia April 2000  –  January 2002  (1 year 10 months) Washington D.C. Metro Area Advised Ambassador on proposals of foreign investments in Ethiopia. Lobbied Congress on various issues ranging from the conflict arbitration with Eritrea and U.S. Aid allocation to Ethiopia. Participated in meetings with representatives of U.S. private and government entities regarding investment and development issues. Assisted the Ambassador in reviewing and drafting official and diplomatic communications. Intern UNOPS June 1999  –  October 1999  (5 months) Geneva Area, Switzerland Prepared a directive and action plan for Program Managers operating in post-conflict countries. Conducted research on social development, with emphasis on the 1995 Copenhagen Declaration and Program of Action, in preparation of the Second Summit on Social Development in June 2000. Intern, Assistant to the Secretary General Synergies Africa June 1998  –  November 1998  (6 months) Geneva Area, Switzerland Researched conflict resolution mechanisms undertaken by AU, UNESCO, WHO and non-governmental organizations. Created project aimed at resolving conflicts in Democratic Republic of Congo and Rwanda and raised CHF 80,000 (approximately US$ 68,000) from the Swiss Government to implement the project. Intern African Union Commission, Addis Ababa June 1996  –  September 1996  (4 months) Addis Ababa, Ethiopia Conducted research in the Conflicts Division on the African Union’s mechanism for conflict prevention, management and resolution in Africa. Collaborated on research work with the Legal Division on the ratification and applicability of the Pelindaba Treaty (African Nuclear Weapon Free Zone Treaty). Contract Attorney Cravath, Swaine & Moore LLP May 2015  – Present (4 months) Greater New York City Area Review documents in Spanish and French in a proposed merger transaction, and in response to a request by the Antitrust Division of the DOJ pursuant to the Clayton Act and the Premerger Notification Rules and Regulations.  Contract Attorney Cravath, Swaine & Moore LLP May 2015  – Present (4 months) Greater New York City Area Review documents in Spanish and French in a proposed merger transaction, and in response to a request by the Antitrust Division of the DOJ pursuant to the Clayton Act and the Premerger Notification Rules and Regulations.  Contract Attorney WilmerHale May 2015  –  May 2015  (1 month) Greater New York City Area Review documents for responsiveness and privilege in a joint SEC/PCAOB investigation of one of the \"Big Four\" audit firms. Analyse and determine as to whether the audit firm's client did not violate the Federal Securities law and/or the PCAOB rules.  Contract Attorney WilmerHale May 2015  –  May 2015  (1 month) Greater New York City Area Review documents for responsiveness and privilege in a joint SEC/PCAOB investigation of one of the \"Big Four\" audit firms. Analyse and determine as to whether the audit firm's client did not violate the Federal Securities law and/or the PCAOB rules.  Legal Consultant SS Communications PLC March 2015  –  May 2015  (3 months) Addis Ababa, Ethiopia Draft various contracts including Service Legal Agreements with several banks. Legal Consultant SS Communications PLC March 2015  –  May 2015  (3 months) Addis Ababa, Ethiopia Draft various contracts including Service Legal Agreements with several banks. Contract Attorney/E-Discovery Attorney -- Securities Litigation Practice Group Sullivan & Cromwell LLP September 2013  –  July 2014  (11 months) Greater New York City Area Confidential. \nCurrent and ongoing SEC investigations. Contract Attorney/E-Discovery Attorney -- Securities Litigation Practice Group Sullivan & Cromwell LLP September 2013  –  July 2014  (11 months) Greater New York City Area Confidential. \nCurrent and ongoing SEC investigations. Contract Attorney -- Securities Litigation Practice Group Gibson, Dunn & Crutcher LLP November 2013  –  November 2013  (1 month) Greater New York City Area Reviewed documents for responsiveness and privilege in a SEC investigation of a hedge fund to determine if whether or not a number of its employees received non-public information from research analysts of a major bank about a given company before its dissemination and traded on that information. Contract Attorney -- Securities Litigation Practice Group Gibson, Dunn & Crutcher LLP November 2013  –  November 2013  (1 month) Greater New York City Area Reviewed documents for responsiveness and privilege in a SEC investigation of a hedge fund to determine if whether or not a number of its employees received non-public information from research analysts of a major bank about a given company before its dissemination and traded on that information. Contract Attorney -- Intellectual Property Litigation Group Sidley Austin LLP September 2013  –  November 2013  (3 months) Greater New York City Area Reviewed French documents in a patent infringement lawsuit brought by one of the world’s largest French cosmetics and beauty company against an American brand of skin care, hair care and cosmetics to determine the subject matter of the documents plaintiff has produced in the litigation and to identify the client’s defenses and counterclaims for use in depositions of plaintiff’s witnesses and in preparing for trial. Contract Attorney -- Intellectual Property Litigation Group Sidley Austin LLP September 2013  –  November 2013  (3 months) Greater New York City Area Reviewed French documents in a patent infringement lawsuit brought by one of the world’s largest French cosmetics and beauty company against an American brand of skin care, hair care and cosmetics to determine the subject matter of the documents plaintiff has produced in the litigation and to identify the client’s defenses and counterclaims for use in depositions of plaintiff’s witnesses and in preparing for trial. Contract Attorney -- Litigation Practice Group Blank Rome LLP August 2013  –  August 2013  (1 month) Greater New York City Area Reviewed documents for privilege and made all necessary entries for privilege logs in a patent infringement case brought against a multinational internet company for allegations of using plaintiff’s certified email sender list to filter spam emails. Contract Attorney -- Litigation Practice Group Blank Rome LLP August 2013  –  August 2013  (1 month) Greater New York City Area Reviewed documents for privilege and made all necessary entries for privilege logs in a patent infringement case brought against a multinational internet company for allegations of using plaintiff’s certified email sender list to filter spam emails. Contract Attorney -- Litigation Department Paul Hastings June 2013  –  July 2013  (2 months) Greater New York City Area Reviewed French documents for responsiveness in an internal investigation triggered by a whistleblower’s allegations of improper, and non-internal policy compliant, sales practices in the France office of one of the largest US multinational computer technology corporation. Translated relevant documents from French to English. Contract Attorney -- Litigation Department Paul Hastings June 2013  –  July 2013  (2 months) Greater New York City Area Reviewed French documents for responsiveness in an internal investigation triggered by a whistleblower’s allegations of improper, and non-internal policy compliant, sales practices in the France office of one of the largest US multinational computer technology corporation. Translated relevant documents from French to English. Contract Attorney -- Antitrust Group Shearman & Sterling LLP April 2013  –  April 2013  (1 month) Greater New York City Area Reviewed documents for responsiveness and privilege in a matter involving a pre-merger investigation by the Federal Trade Commission, Second Request, regarding the proposed acquisition of a glass containers packaging and manufacturing company. Contract Attorney -- Antitrust Group Shearman & Sterling LLP April 2013  –  April 2013  (1 month) Greater New York City Area Reviewed documents for responsiveness and privilege in a matter involving a pre-merger investigation by the Federal Trade Commission, Second Request, regarding the proposed acquisition of a glass containers packaging and manufacturing company. Contract Attorney -- Litigation Practice Group Cravath, Swaine & Moore LLP August 2012  –  February 2013  (7 months) • Reviewed documents in a joint SEC/DOJ investigation of the client’s compliance with internal FCPA policies. Reviewed the effectiveness of the Audit Department controls regarding FCPA policies and certification process, pre-approval requirements for third-party contracts or the use of third-party representatives, internal reporting requirements of a violation of FCPA policy. \n• Reviewed documents for responsiveness and privilege in a patent infringement litigation brought against a leading developer of wireless communication technology. Fact discovery phase. Contract Attorney -- Litigation Practice Group Cravath, Swaine & Moore LLP August 2012  –  February 2013  (7 months) • Reviewed documents in a joint SEC/DOJ investigation of the client’s compliance with internal FCPA policies. Reviewed the effectiveness of the Audit Department controls regarding FCPA policies and certification process, pre-approval requirements for third-party contracts or the use of third-party representatives, internal reporting requirements of a violation of FCPA policy. \n• Reviewed documents for responsiveness and privilege in a patent infringement litigation brought against a leading developer of wireless communication technology. Fact discovery phase. E-Discovery Contract Attorney Google July 2012  –  July 2012  (1 month) Reviewed documents for responsiveness, privilege and issue coding in a Federal Trade Commission investigation if whether the client offers licenses based on FRAND (fair, reasonable, and non-discriminatory) terms for standards-essential patents. E-Discovery Contract Attorney Google July 2012  –  July 2012  (1 month) Reviewed documents for responsiveness, privilege and issue coding in a Federal Trade Commission investigation if whether the client offers licenses based on FRAND (fair, reasonable, and non-discriminatory) terms for standards-essential patents. Contract Attorney -- Antitrust, Competition and Trade Regulation Practice Bingham McCutchen January 2012  –  March 2012  (3 months) Reviewed documents for responsiveness and privilege in a matter involving a pre-merger investigation by the Federal Trade Commission, Second Request, regarding the proposed acquisition of a music company by another prominent music group. Contract Attorney -- Antitrust, Competition and Trade Regulation Practice Bingham McCutchen January 2012  –  March 2012  (3 months) Reviewed documents for responsiveness and privilege in a matter involving a pre-merger investigation by the Federal Trade Commission, Second Request, regarding the proposed acquisition of a music company by another prominent music group. Contract Attorney -- Class Action Litigation Practice Quinn Emanuel October 2011  –  January 2012  (4 months) Greater New York City Area Reviewed French documents for responsiveness, confidentiality and privilege in a group of product liability cases concerning pelvic surgical mesh products. Created a searchable and accessible list of complaints by type of product to easily identify the responsive products and facilitate issue coding. Contract Attorney -- Class Action Litigation Practice Quinn Emanuel October 2011  –  January 2012  (4 months) Greater New York City Area Reviewed French documents for responsiveness, confidentiality and privilege in a group of product liability cases concerning pelvic surgical mesh products. Created a searchable and accessible list of complaints by type of product to easily identify the responsive products and facilitate issue coding. Contract Attorney -- Antitrust Practice Group Wilson Sonsini Goodrich & Rosati July 2011  –  October 2011  (4 months) Greater New York City Area Reviewed documents for responsiveness, confidentiality and privilege in an antitrust litigation alleging that a vendor of photochromic lenses illegally maintained and enhanced a monopoly by employing various business tactics, including refusing to deal with certain companies and requiring exclusivity or preferential treatment from other companies. Contract Attorney -- Antitrust Practice Group Wilson Sonsini Goodrich & Rosati July 2011  –  October 2011  (4 months) Greater New York City Area Reviewed documents for responsiveness, confidentiality and privilege in an antitrust litigation alleging that a vendor of photochromic lenses illegally maintained and enhanced a monopoly by employing various business tactics, including refusing to deal with certain companies and requiring exclusivity or preferential treatment from other companies. Contract Attorney -- Intellectual Property Practice Group Morrison & Foerster LLP March 2011  –  July 2011  (5 months) Greater New York City Area Reviewed documents for responsiveness and privilege in support of a complaint filed by one of the world’s leading technology companies for several patents and copyrights infringement by another company’s use of an operating system software platform for cellular telephones and other mobile devices. Contract Attorney -- Intellectual Property Practice Group Morrison & Foerster LLP March 2011  –  July 2011  (5 months) Greater New York City Area Reviewed documents for responsiveness and privilege in support of a complaint filed by one of the world’s leading technology companies for several patents and copyrights infringement by another company’s use of an operating system software platform for cellular telephones and other mobile devices. Contract Attorney -- Commercial Litigation Practice Group Proskauer Rose LLP October 2010  –  March 2011  (6 months) New York New York Reviewed documents for privilege in an insurance coverage action brought by two merged investment banks against eight defendant insurers for their failure to indemnify the banks for the insured portion of losses incurred in connection with the defense and settlement claims brought against one of the banks prior to the merger. Claims were in connection with the investigation of some of the bank’s client’s asset-backed securities after it bought assets by dipping into funds intended to protect bondholders. Contract Attorney -- Commercial Litigation Practice Group Proskauer Rose LLP October 2010  –  March 2011  (6 months) New York New York Reviewed documents for privilege in an insurance coverage action brought by two merged investment banks against eight defendant insurers for their failure to indemnify the banks for the insured portion of losses incurred in connection with the defense and settlement claims brought against one of the banks prior to the merger. Claims were in connection with the investigation of some of the bank’s client’s asset-backed securities after it bought assets by dipping into funds intended to protect bondholders. Contract Attorney -- Litigation Practice Group DLA Piper August 2010  –  September 2010  (2 months) Greater New York City Area Reviewed documents for privilege and responsiveness in defense of a Global Real Estate Group of a major insurance company against claims and allegations by its former Chief Executive Officer of breach of contract by withholding the distribution of profit interests distribution based on the performance of the sale of assets held in each portfolio and in accordance with the profit-sharing incentive program. Contract Attorney -- Litigation Practice Group DLA Piper August 2010  –  September 2010  (2 months) Greater New York City Area Reviewed documents for privilege and responsiveness in defense of a Global Real Estate Group of a major insurance company against claims and allegations by its former Chief Executive Officer of breach of contract by withholding the distribution of profit interests distribution based on the performance of the sale of assets held in each portfolio and in accordance with the profit-sharing incentive program. Contract Attorney -- Intellectual Property Practice Group Gibson, Dunn & Crutcher LLP February 2010  –  June 2010  (5 months) Greater New York City Area Reviewed documents for quality check and privilege in defense of a major corporation against allegations of patent infringement of a technology used in a wireless device and dealing with encryption for the distribution of digital books. Contract Attorney -- Intellectual Property Practice Group Gibson, Dunn & Crutcher LLP February 2010  –  June 2010  (5 months) Greater New York City Area Reviewed documents for quality check and privilege in defense of a major corporation against allegations of patent infringement of a technology used in a wireless device and dealing with encryption for the distribution of digital books. Contract Attorney -- Environmental Practice Group Whiteman Osterman & Hanna LLP October 2009  –  January 2010  (4 months) Greater New York City Area Reviewed documents for responsiveness in preparation of an EPA and NYSDEC investigation of whether or not client complied with environmental laws in handling toxic waste pollution and discharges of contamination in public waterways. Review for privilege. Contract Attorney -- Environmental Practice Group Whiteman Osterman & Hanna LLP October 2009  –  January 2010  (4 months) Greater New York City Area Reviewed documents for responsiveness in preparation of an EPA and NYSDEC investigation of whether or not client complied with environmental laws in handling toxic waste pollution and discharges of contamination in public waterways. Review for privilege. Contract Attorney -- Antitrust Litigation Pillsbury Winthrop Shaw Pittman LLP September 2009  –  October 2009  (2 months) Greater New York City Area Reviewed English and Spanish documents for responsiveness in an investigation by the DOJ of a money transmitter serving the Caribbean, Central and South America for allegations of client and competitors fixing prices in violation of Section 1 of the Sherman Act. Contract Attorney -- Antitrust Litigation Pillsbury Winthrop Shaw Pittman LLP September 2009  –  October 2009  (2 months) Greater New York City Area Reviewed English and Spanish documents for responsiveness in an investigation by the DOJ of a money transmitter serving the Caribbean, Central and South America for allegations of client and competitors fixing prices in violation of Section 1 of the Sherman Act. Contract Attorney -- Labor & Employment Litigation Hogan Lovells July 2009  –  September 2009  (3 months) Greater New York City Area Reviewed documents for responsiveness in preparation of a lawsuit brought by former employees against a national cable company for unpaid wages and compensation. Review for privilege. (Worked on this case while still working on another case at Reed Smith with the accord of both parties as Reed Smith was a remote project and only required that I fulfill the task on time and attend the bi-weekly conference calls.) Contract Attorney -- Labor & Employment Litigation Hogan Lovells July 2009  –  September 2009  (3 months) Greater New York City Area Reviewed documents for responsiveness in preparation of a lawsuit brought by former employees against a national cable company for unpaid wages and compensation. Review for privilege. (Worked on this case while still working on another case at Reed Smith with the accord of both parties as Reed Smith was a remote project and only required that I fulfill the task on time and attend the bi-weekly conference calls.) Contract Attorney -- Intellectual Property Group Reed Smith LLP February 2009  –  August 2009  (7 months) Greater Philadelphia Area Defense of a major pharmaceutical company alleged to have misappropriated French plaintiff’s proprietary insect cell technology for commercial use and misused trade secrets in violation of a prior licensing agreement. Review for quality control and privilege. Translated relevant documents from French to English. Contract Attorney -- Intellectual Property Group Reed Smith LLP February 2009  –  August 2009  (7 months) Greater Philadelphia Area Defense of a major pharmaceutical company alleged to have misappropriated French plaintiff’s proprietary insect cell technology for commercial use and misused trade secrets in violation of a prior licensing agreement. Review for quality control and privilege. Translated relevant documents from French to English. Contract Attorney -- Litigation Practice Group Sullivan & Cromwell LLP October 2007  –  January 2009  (1 year 4 months) Greater New York City Area International litigation involving a French client. Discovery phase. Reviewed documents in preparation of a securities litigation wherein a hedge fund alleged a french reinsurance company fraudulently misrepresented its financial situation to induce plaintiff’s investment. Review for quality control as well as for U.S. and French privilege; understand and navigate between the differences of two jurisdictions regarding attorney-client relationships (Attorney-Client privilege in the United States versus French Professional Secrecy rules - that are broader in terms of protection - in France.) Prepared privilege log and translated significant legal documents from French to English. Contract Attorney -- Litigation Practice Group Sullivan & Cromwell LLP October 2007  –  January 2009  (1 year 4 months) Greater New York City Area International litigation involving a French client. Discovery phase. Reviewed documents in preparation of a securities litigation wherein a hedge fund alleged a french reinsurance company fraudulently misrepresented its financial situation to induce plaintiff’s investment. Review for quality control as well as for U.S. and French privilege; understand and navigate between the differences of two jurisdictions regarding attorney-client relationships (Attorney-Client privilege in the United States versus French Professional Secrecy rules - that are broader in terms of protection - in France.) Prepared privilege log and translated significant legal documents from French to English. Contract Attorney -- Securities Fraud Litigation Practice Group Bernstein Litowitz Berger & Grossmann LLP July 2007  –  October 2007  (4 months) Greater New York City Area Conducted first and second level review in numerous securities class action litigation filed against one of the nation’s largest healthcare services providers by persons damaged as a result of their purchases of debt securities of the company. Assisted attorneys by drafting memoranda in preparation of witness depositions. Prepared a chronological list of events and analyzed the ratings of the company during the “class period” by major rating agencies. Contract Attorney -- Securities Fraud Litigation Practice Group Bernstein Litowitz Berger & Grossmann LLP July 2007  –  October 2007  (4 months) Greater New York City Area Conducted first and second level review in numerous securities class action litigation filed against one of the nation’s largest healthcare services providers by persons damaged as a result of their purchases of debt securities of the company. Assisted attorneys by drafting memoranda in preparation of witness depositions. Prepared a chronological list of events and analyzed the ratings of the company during the “class period” by major rating agencies. Contract Attorney -- U.S. and International Antitrust Practice Group WilmerHale April 2007  –  June 2007  (3 months) Greater New York City Area Conducted first and second level review of documents relating to a proposed acquisition transaction of a hotel and airways provider in response to a second request by the Antitrust Division of the Department of Justice pursuant to the Pre-Merger Notification Rules and Regulations. Contract Attorney -- U.S. and International Antitrust Practice Group WilmerHale April 2007  –  June 2007  (3 months) Greater New York City Area Conducted first and second level review of documents relating to a proposed acquisition transaction of a hotel and airways provider in response to a second request by the Antitrust Division of the Department of Justice pursuant to the Pre-Merger Notification Rules and Regulations. Contract Attorney -- Litigation Department Willkie Farr & Gallagher LLP October 2006  –  February 2007  (5 months) Greater New York City Area Reviewed and analyzed corporate financial documents and executive-level communications in response to a SEC informal inquiry with respect to allegations of accounting misconduct, closely worked with forensic accountants and auditors to determine the veracity of the company’s accounting procedures and financial statements. Contract Attorney -- Litigation Department Willkie Farr & Gallagher LLP October 2006  –  February 2007  (5 months) Greater New York City Area Reviewed and analyzed corporate financial documents and executive-level communications in response to a SEC informal inquiry with respect to allegations of accounting misconduct, closely worked with forensic accountants and auditors to determine the veracity of the company’s accounting procedures and financial statements. Contract Attorney -- Litigation Practice Group King & Spalding March 2006  –  October 2006  (8 months) Greater New York City Area Examined and analyzed significant French pleadings, correspondence and memoranda, including accounting and financial documents, in response to claims of reporting, books and records and internal control violations in a securities class action litigation. Assisted in the preparation of witness depositions. Translated relevant documents from French to English. Researched relevant information in preparation of a motion to preclude opposing parties from asking the company’s former CEO a number of questions during deposition. Contract Attorney -- Litigation Practice Group King & Spalding March 2006  –  October 2006  (8 months) Greater New York City Area Examined and analyzed significant French pleadings, correspondence and memoranda, including accounting and financial documents, in response to claims of reporting, books and records and internal control violations in a securities class action litigation. Assisted in the preparation of witness depositions. Translated relevant documents from French to English. Researched relevant information in preparation of a motion to preclude opposing parties from asking the company’s former CEO a number of questions during deposition. Contract Attorney -- Intellectual Property Litigation Group Cadwalader, Wickersham & Taft LLP January 2006  –  March 2006  (3 months) Washington D.C. Metro Area Review responsive French discovery documents in preparation of a defense of a major pharmaceutical company in order to prevent the violation of intellectual property rights by generic substitutes of a famous branded drug. Translated relevant documents from French to English. Contract Attorney -- Intellectual Property Litigation Group Cadwalader, Wickersham & Taft LLP January 2006  –  March 2006  (3 months) Washington D.C. Metro Area Review responsive French discovery documents in preparation of a defense of a major pharmaceutical company in order to prevent the violation of intellectual property rights by generic substitutes of a famous branded drug. Translated relevant documents from French to English. Judicial Law Clerk FIRST JUDICIAL DISTRICT OF PENNSYLVANIA COURT OF COMMON PLEAS, CRIMINAL TRIAL DIVISION January 2004  –  January 2006  (2 years 1 month) Greater Philadelphia Area Drafted court opinions for submission to the Superior Court of Pennsylvania. Researched and analyzed issues raised on appeal. Wrote court orders, memoranda and decisions. Extensively reviewed and researched legal issues raised in motions before and during jury and waiver trials. Drafted jury instructions for crimes that the Pennsylvania Suggested Standard Criminal Jury Instructions did not provide jury instructions. Attended motion hearings, trials and pretrial conferences. Prepared sentencing guideline forms electronically in accordance with the Pennsylvania Sentencing Guideline Manual. Judicial Law Clerk FIRST JUDICIAL DISTRICT OF PENNSYLVANIA COURT OF COMMON PLEAS, CRIMINAL TRIAL DIVISION January 2004  –  January 2006  (2 years 1 month) Greater Philadelphia Area Drafted court opinions for submission to the Superior Court of Pennsylvania. Researched and analyzed issues raised on appeal. Wrote court orders, memoranda and decisions. Extensively reviewed and researched legal issues raised in motions before and during jury and waiver trials. Drafted jury instructions for crimes that the Pennsylvania Suggested Standard Criminal Jury Instructions did not provide jury instructions. Attended motion hearings, trials and pretrial conferences. Prepared sentencing guideline forms electronically in accordance with the Pennsylvania Sentencing Guideline Manual. Law Clerk -- International Commerce & Litigation Group DLA Piper (formerly Piper Rudnick LLP) February 2002  –  April 2003  (1 year 3 months) Washington D.C. Metro Area Researched French legal procedures so as to find a basis to preclude a subpoenaed U.S. company from appearing before French courts as a witness in one of the largest corporate fraud investigations in Europe. Analyzed evidentiary documents for briefs for a submission to the international arbitral tribunals in The Hague. Prepared a summary memorandum on the legality of a Cote d’Ivoire Supreme Court decision rejecting a presidential candidacy and its effect on U.S. aid to that country. Reviewed and translated evidentiary documents in the Ethiopian-Eritrean conflict arbitration, organized documents relevant to the Claims Commission and the Borders Commission so as to facilitate the Court’s review of the evidence in both claims. Translated relevant documents and treaties from Amharic into English. Law Clerk -- International Commerce & Litigation Group DLA Piper (formerly Piper Rudnick LLP) February 2002  –  April 2003  (1 year 3 months) Washington D.C. Metro Area Researched French legal procedures so as to find a basis to preclude a subpoenaed U.S. company from appearing before French courts as a witness in one of the largest corporate fraud investigations in Europe. Analyzed evidentiary documents for briefs for a submission to the international arbitral tribunals in The Hague. Prepared a summary memorandum on the legality of a Cote d’Ivoire Supreme Court decision rejecting a presidential candidacy and its effect on U.S. aid to that country. Reviewed and translated evidentiary documents in the Ethiopian-Eritrean conflict arbitration, organized documents relevant to the Claims Commission and the Borders Commission so as to facilitate the Court’s review of the evidence in both claims. Translated relevant documents and treaties from Amharic into English. Executive Assistant of the Ambassador Embassy of Ethiopia April 2000  –  January 2002  (1 year 10 months) Washington D.C. Metro Area Advised Ambassador on proposals of foreign investments in Ethiopia. Lobbied Congress on various issues ranging from the conflict arbitration with Eritrea and U.S. Aid allocation to Ethiopia. Participated in meetings with representatives of U.S. private and government entities regarding investment and development issues. Assisted the Ambassador in reviewing and drafting official and diplomatic communications. Executive Assistant of the Ambassador Embassy of Ethiopia April 2000  –  January 2002  (1 year 10 months) Washington D.C. Metro Area Advised Ambassador on proposals of foreign investments in Ethiopia. Lobbied Congress on various issues ranging from the conflict arbitration with Eritrea and U.S. Aid allocation to Ethiopia. Participated in meetings with representatives of U.S. private and government entities regarding investment and development issues. Assisted the Ambassador in reviewing and drafting official and diplomatic communications. Intern UNOPS June 1999  –  October 1999  (5 months) Geneva Area, Switzerland Prepared a directive and action plan for Program Managers operating in post-conflict countries. Conducted research on social development, with emphasis on the 1995 Copenhagen Declaration and Program of Action, in preparation of the Second Summit on Social Development in June 2000. Intern UNOPS June 1999  –  October 1999  (5 months) Geneva Area, Switzerland Prepared a directive and action plan for Program Managers operating in post-conflict countries. Conducted research on social development, with emphasis on the 1995 Copenhagen Declaration and Program of Action, in preparation of the Second Summit on Social Development in June 2000. Intern, Assistant to the Secretary General Synergies Africa June 1998  –  November 1998  (6 months) Geneva Area, Switzerland Researched conflict resolution mechanisms undertaken by AU, UNESCO, WHO and non-governmental organizations. Created project aimed at resolving conflicts in Democratic Republic of Congo and Rwanda and raised CHF 80,000 (approximately US$ 68,000) from the Swiss Government to implement the project. Intern, Assistant to the Secretary General Synergies Africa June 1998  –  November 1998  (6 months) Geneva Area, Switzerland Researched conflict resolution mechanisms undertaken by AU, UNESCO, WHO and non-governmental organizations. Created project aimed at resolving conflicts in Democratic Republic of Congo and Rwanda and raised CHF 80,000 (approximately US$ 68,000) from the Swiss Government to implement the project. Intern African Union Commission, Addis Ababa June 1996  –  September 1996  (4 months) Addis Ababa, Ethiopia Conducted research in the Conflicts Division on the African Union’s mechanism for conflict prevention, management and resolution in Africa. Collaborated on research work with the Legal Division on the ratification and applicability of the Pelindaba Treaty (African Nuclear Weapon Free Zone Treaty). Intern African Union Commission, Addis Ababa June 1996  –  September 1996  (4 months) Addis Ababa, Ethiopia Conducted research in the Conflicts Division on the African Union’s mechanism for conflict prevention, management and resolution in Africa. Collaborated on research work with the Legal Division on the ratification and applicability of the Pelindaba Treaty (African Nuclear Weapon Free Zone Treaty). Languages French Native or bilingual proficiency Amharic Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency French Native or bilingual proficiency Amharic Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency French Native or bilingual proficiency Amharic Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills International Law Legal Research Corporate Law Litigation Intellectual Property Securities Litigation Compliance Legal Compliance Legal Writing Legal Translation Anti Money Laundering FCPA Sarbanes-Oxley Act Lobbying Government Legal Assistance Courts Commercial Litigation Legal Issues Document Review Appeals Arbitration Litigation Support Employment Law Human Rights Civil Litigation See 11+     See less Skills  International Law Legal Research Corporate Law Litigation Intellectual Property Securities Litigation Compliance Legal Compliance Legal Writing Legal Translation Anti Money Laundering FCPA Sarbanes-Oxley Act Lobbying Government Legal Assistance Courts Commercial Litigation Legal Issues Document Review Appeals Arbitration Litigation Support Employment Law Human Rights Civil Litigation See 11+     See less International Law Legal Research Corporate Law Litigation Intellectual Property Securities Litigation Compliance Legal Compliance Legal Writing Legal Translation Anti Money Laundering FCPA Sarbanes-Oxley Act Lobbying Government Legal Assistance Courts Commercial Litigation Legal Issues Document Review Appeals Arbitration Litigation Support Employment Law Human Rights Civil Litigation See 11+     See less International Law Legal Research Corporate Law Litigation Intellectual Property Securities Litigation Compliance Legal Compliance Legal Writing Legal Translation Anti Money Laundering FCPA Sarbanes-Oxley Act Lobbying Government Legal Assistance Courts Commercial Litigation Legal Issues Document Review Appeals Arbitration Litigation Support Employment Law Human Rights Civil Litigation See 11+     See less Education Georgetown University Law Center Master of Laws (LL.M.),  Securities and Financial Regulation 2001  – 2003 Activities and Societies:  Center for Applied Legal Studies Institut du Droit de la Paix et du Développement (I.D.P.D.) - Université de Nice Sophia-Antipolis. D.E.A. (Diplôme d'Études Approfondies) /LL.M.,  International Law and Legal Studies , 4.0 (major de promotion; 1 percentile) International law and economics; project finance, conflicts management, prevention and resolution in Africa; comparative law (international trade laws vs. international labor laws); international public law (conflicts, treaties and post-conflict legal situations in Africa.) Faculté de Droit et Science Politique - Université Nice Sophia-Antipolis Maîtrise en Droit (Juris Doctor),  International Law and Legal Studies Activities and Societies:  Assistant to Professor Cotnoir - English for Lawyers ,  Lab tutor. Centre International de Valbonne High School,  Baccalauréat Lycée Guebre-Mariam Georgetown University Law Center Master of Laws (LL.M.),  Securities and Financial Regulation 2001  – 2003 Activities and Societies:  Center for Applied Legal Studies Georgetown University Law Center Master of Laws (LL.M.),  Securities and Financial Regulation 2001  – 2003 Activities and Societies:  Center for Applied Legal Studies Georgetown University Law Center Master of Laws (LL.M.),  Securities and Financial Regulation 2001  – 2003 Activities and Societies:  Center for Applied Legal Studies Institut du Droit de la Paix et du Développement (I.D.P.D.) - Université de Nice Sophia-Antipolis. D.E.A. (Diplôme d'Études Approfondies) /LL.M.,  International Law and Legal Studies , 4.0 (major de promotion; 1 percentile) International law and economics; project finance, conflicts management, prevention and resolution in Africa; comparative law (international trade laws vs. international labor laws); international public law (conflicts, treaties and post-conflict legal situations in Africa.) Institut du Droit de la Paix et du Développement (I.D.P.D.) - Université de Nice Sophia-Antipolis. D.E.A. (Diplôme d'Études Approfondies) /LL.M.,  International Law and Legal Studies , 4.0 (major de promotion; 1 percentile) International law and economics; project finance, conflicts management, prevention and resolution in Africa; comparative law (international trade laws vs. international labor laws); international public law (conflicts, treaties and post-conflict legal situations in Africa.) Institut du Droit de la Paix et du Développement (I.D.P.D.) - Université de Nice Sophia-Antipolis. D.E.A. (Diplôme d'Études Approfondies) /LL.M.,  International Law and Legal Studies , 4.0 (major de promotion; 1 percentile) International law and economics; project finance, conflicts management, prevention and resolution in Africa; comparative law (international trade laws vs. international labor laws); international public law (conflicts, treaties and post-conflict legal situations in Africa.) Faculté de Droit et Science Politique - Université Nice Sophia-Antipolis Maîtrise en Droit (Juris Doctor),  International Law and Legal Studies Activities and Societies:  Assistant to Professor Cotnoir - English for Lawyers ,  Lab tutor. Faculté de Droit et Science Politique - Université Nice Sophia-Antipolis Maîtrise en Droit (Juris Doctor),  International Law and Legal Studies Activities and Societies:  Assistant to Professor Cotnoir - English for Lawyers ,  Lab tutor. Faculté de Droit et Science Politique - Université Nice Sophia-Antipolis Maîtrise en Droit (Juris Doctor),  International Law and Legal Studies Activities and Societies:  Assistant to Professor Cotnoir - English for Lawyers ,  Lab tutor. Centre International de Valbonne High School,  Baccalauréat Centre International de Valbonne High School,  Baccalauréat Centre International de Valbonne High School,  Baccalauréat Lycée Guebre-Mariam Lycée Guebre-Mariam Lycée Guebre-Mariam ", "Experience Discovery Staff Attorney Google August 2013  – Present (2 years 1 month) mountain view, california Document Review Attorney Adecco at Google October 2012  –  August 2013  (11 months) Contract Attorney Pathways Personnel October 2012  –  October 2012  (1 month) Contract Attorney Hire Counsel August 2011  –  June 2012  (11 months) Legal Research Assistant UCLA School of Law February 2007  –  July 2010  (3 years 6 months) los angeles, ca Discovery Staff Attorney Google August 2013  – Present (2 years 1 month) mountain view, california Discovery Staff Attorney Google August 2013  – Present (2 years 1 month) mountain view, california Document Review Attorney Adecco at Google October 2012  –  August 2013  (11 months) Document Review Attorney Adecco at Google October 2012  –  August 2013  (11 months) Contract Attorney Pathways Personnel October 2012  –  October 2012  (1 month) Contract Attorney Pathways Personnel October 2012  –  October 2012  (1 month) Contract Attorney Hire Counsel August 2011  –  June 2012  (11 months) Contract Attorney Hire Counsel August 2011  –  June 2012  (11 months) Legal Research Assistant UCLA School of Law February 2007  –  July 2010  (3 years 6 months) los angeles, ca Legal Research Assistant UCLA School of Law February 2007  –  July 2010  (3 years 6 months) los angeles, ca Skills Data Analysis Information Literacy Library Science Legal Research Document Review Research Editing Policy Analysis Proofreading Information Retrieval Metadata Library Research Skills  Data Analysis Information Literacy Library Science Legal Research Document Review Research Editing Policy Analysis Proofreading Information Retrieval Metadata Library Research Data Analysis Information Literacy Library Science Legal Research Document Review Research Editing Policy Analysis Proofreading Information Retrieval Metadata Library Research Data Analysis Information Literacy Library Science Legal Research Document Review Research Editing Policy Analysis Proofreading Information Retrieval Metadata Library Research Education San Jose State University MLIS,  Library and Information Science 2011  – 2015 University of California, Los Angeles - School of Law J.D. 2006  – 2009 Activities and Societies:  OUTlaw ,  Dukeminier Awards Journal of The Best Sexual Orientation and Gender Identity Law Review Articles Oberlin College Bachelor of Arts (BA),  French & Philosophy 1997  – 2001 San Jose State University MLIS,  Library and Information Science 2011  – 2015 San Jose State University MLIS,  Library and Information Science 2011  – 2015 San Jose State University MLIS,  Library and Information Science 2011  – 2015 University of California, Los Angeles - School of Law J.D. 2006  – 2009 Activities and Societies:  OUTlaw ,  Dukeminier Awards Journal of The Best Sexual Orientation and Gender Identity Law Review Articles University of California, Los Angeles - School of Law J.D. 2006  – 2009 Activities and Societies:  OUTlaw ,  Dukeminier Awards Journal of The Best Sexual Orientation and Gender Identity Law Review Articles University of California, Los Angeles - School of Law J.D. 2006  – 2009 Activities and Societies:  OUTlaw ,  Dukeminier Awards Journal of The Best Sexual Orientation and Gender Identity Law Review Articles Oberlin College Bachelor of Arts (BA),  French & Philosophy 1997  – 2001 Oberlin College Bachelor of Arts (BA),  French & Philosophy 1997  – 2001 Oberlin College Bachelor of Arts (BA),  French & Philosophy 1997  – 2001 ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney For Adecco at Google April 2012  –  January 2013  (10 months) Attorney Imani M. Wesley, Attorney at Law May 2008  –  December 2012  (4 years 8 months) E-Discovery Contract Attorney Black Letter Discovery 2008  –  2012  (4 years) San Francisco Bay Area Contract Attorney - Litigation Mayer Brown (via Ajilon Legal) September 2007  –  November 2007  (3 months) Patent Assistant Jones Day (via Robert Half) July 2007  –  September 2007  (3 months) Quality Assurance Engineer Visa International June 1999  –  January 2007  (7 years 8 months) Judicial Extern State Bar Court of CA February 2006  –  May 2006  (4 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney For Adecco at Google April 2012  –  January 2013  (10 months) Document Review Attorney For Adecco at Google April 2012  –  January 2013  (10 months) Attorney Imani M. Wesley, Attorney at Law May 2008  –  December 2012  (4 years 8 months) Attorney Imani M. Wesley, Attorney at Law May 2008  –  December 2012  (4 years 8 months) E-Discovery Contract Attorney Black Letter Discovery 2008  –  2012  (4 years) San Francisco Bay Area E-Discovery Contract Attorney Black Letter Discovery 2008  –  2012  (4 years) San Francisco Bay Area Contract Attorney - Litigation Mayer Brown (via Ajilon Legal) September 2007  –  November 2007  (3 months) Contract Attorney - Litigation Mayer Brown (via Ajilon Legal) September 2007  –  November 2007  (3 months) Patent Assistant Jones Day (via Robert Half) July 2007  –  September 2007  (3 months) Patent Assistant Jones Day (via Robert Half) July 2007  –  September 2007  (3 months) Quality Assurance Engineer Visa International June 1999  –  January 2007  (7 years 8 months) Quality Assurance Engineer Visa International June 1999  –  January 2007  (7 years 8 months) Judicial Extern State Bar Court of CA February 2006  –  May 2006  (4 months) Judicial Extern State Bar Court of CA February 2006  –  May 2006  (4 months) Skills Litigation Support Relativity Catalyst Ringtail California Wills &... Concordance E-Discovery First Advantage iCONECTnxt METALincs Recommind OmniX Document Review Trademarks Intellectual Property Patent Litigation Courts Litigation Patents See 4+     See less Skills  Litigation Support Relativity Catalyst Ringtail California Wills &... Concordance E-Discovery First Advantage iCONECTnxt METALincs Recommind OmniX Document Review Trademarks Intellectual Property Patent Litigation Courts Litigation Patents See 4+     See less Litigation Support Relativity Catalyst Ringtail California Wills &... Concordance E-Discovery First Advantage iCONECTnxt METALincs Recommind OmniX Document Review Trademarks Intellectual Property Patent Litigation Courts Litigation Patents See 4+     See less Litigation Support Relativity Catalyst Ringtail California Wills &... Concordance E-Discovery First Advantage iCONECTnxt METALincs Recommind OmniX Document Review Trademarks Intellectual Property Patent Litigation Courts Litigation Patents See 4+     See less Education Golden Gate University, School of Law LLM 2011  – 2013 Golden Gate University, School of Law Juris Doctor 2002  – 2006 San Francisco State University BS 1995  – 1999 Tuskegee University Golden Gate University, School of Law LLM 2011  – 2013 Golden Gate University, School of Law LLM 2011  – 2013 Golden Gate University, School of Law LLM 2011  – 2013 Golden Gate University, School of Law Juris Doctor 2002  – 2006 Golden Gate University, School of Law Juris Doctor 2002  – 2006 Golden Gate University, School of Law Juris Doctor 2002  – 2006 San Francisco State University BS 1995  – 1999 San Francisco State University BS 1995  – 1999 San Francisco State University BS 1995  – 1999 Tuskegee University Tuskegee University Tuskegee University ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Adecco @ Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Various Staffing Agencies January 2007  –  July 2011  (4 years 7 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Document Review Attorney Adecco @ Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Adecco @ Google July 2011  –  January 2013  (1 year 7 months) Document Review Attorney Various Staffing Agencies January 2007  –  July 2011  (4 years 7 months) Document Review Attorney Various Staffing Agencies January 2007  –  July 2011  (4 years 7 months) Skills Intellectual Property Legal Research Patent Litigation Litigation Commercial Litigation Document Review Privacy Law Skills  Intellectual Property Legal Research Patent Litigation Litigation Commercial Litigation Document Review Privacy Law Intellectual Property Legal Research Patent Litigation Litigation Commercial Litigation Document Review Privacy Law Intellectual Property Legal Research Patent Litigation Litigation Commercial Litigation Document Review Privacy Law Education Santa Clara University School of Law Juris Doctor (J.D.) 2003  – 2006 University of California, San Diego B.S. 1999  – 2002 Bellarmine College Preparatory 1995  – 1999 Santa Clara University School of Law Juris Doctor (J.D.) 2003  – 2006 Santa Clara University School of Law Juris Doctor (J.D.) 2003  – 2006 Santa Clara University School of Law Juris Doctor (J.D.) 2003  – 2006 University of California, San Diego B.S. 1999  – 2002 University of California, San Diego B.S. 1999  – 2002 University of California, San Diego B.S. 1999  – 2002 Bellarmine College Preparatory 1995  – 1999 Bellarmine College Preparatory 1995  – 1999 Bellarmine College Preparatory 1995  – 1999 ", "Experience Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Oversee the workflow of noncustodial, custodial and deposition preparation document reviews. Implement quality control measures during reviews with the goal of ensuring the highest degree of quality work product. Author various types of written deliverables relating to hot documents review, deposition preparation, document production and matter closure. Document Review Attorney Adecco at Google April 2012  –  January 2013  (10 months) Document Review Attorney Black Letter Discovery April 2011  –  April 2012  (1 year 1 month) Law Clerk Leland, Parachini, Steinberg, Matzger & Melnick, LLP January 2009  –  May 2009  (5 months) Research Assistant Office of Professor Peter Jan Honigsberg June 2006  –  April 2009  (2 years 11 months) Law Clerk Law Offices of Ryutaro Hirota October 2007  –  April 2008  (7 months) Law Clerk DeVito Law Group September 2006  –  November 2006  (3 months) Summer Legal Intern Office of the District Attorney, San Francisco June 2006  –  August 2006  (3 months) Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Oversee the workflow of noncustodial, custodial and deposition preparation document reviews. Implement quality control measures during reviews with the goal of ensuring the highest degree of quality work product. Author various types of written deliverables relating to hot documents review, deposition preparation, document production and matter closure. Discovery Staff Attorney Google January 2013  – Present (2 years 8 months) Oversee the workflow of noncustodial, custodial and deposition preparation document reviews. Implement quality control measures during reviews with the goal of ensuring the highest degree of quality work product. Author various types of written deliverables relating to hot documents review, deposition preparation, document production and matter closure. Document Review Attorney Adecco at Google April 2012  –  January 2013  (10 months) Document Review Attorney Adecco at Google April 2012  –  January 2013  (10 months) Document Review Attorney Black Letter Discovery April 2011  –  April 2012  (1 year 1 month) Document Review Attorney Black Letter Discovery April 2011  –  April 2012  (1 year 1 month) Law Clerk Leland, Parachini, Steinberg, Matzger & Melnick, LLP January 2009  –  May 2009  (5 months) Law Clerk Leland, Parachini, Steinberg, Matzger & Melnick, LLP January 2009  –  May 2009  (5 months) Research Assistant Office of Professor Peter Jan Honigsberg June 2006  –  April 2009  (2 years 11 months) Research Assistant Office of Professor Peter Jan Honigsberg June 2006  –  April 2009  (2 years 11 months) Law Clerk Law Offices of Ryutaro Hirota October 2007  –  April 2008  (7 months) Law Clerk Law Offices of Ryutaro Hirota October 2007  –  April 2008  (7 months) Law Clerk DeVito Law Group September 2006  –  November 2006  (3 months) Law Clerk DeVito Law Group September 2006  –  November 2006  (3 months) Summer Legal Intern Office of the District Attorney, San Francisco June 2006  –  August 2006  (3 months) Summer Legal Intern Office of the District Attorney, San Francisco June 2006  –  August 2006  (3 months) Skills Intellectual Property Legal Research Research Legal Issues Family Law Corporate Law Document Review Editing Legal Writing Skills  Intellectual Property Legal Research Research Legal Issues Family Law Corporate Law Document Review Editing Legal Writing Intellectual Property Legal Research Research Legal Issues Family Law Corporate Law Document Review Editing Legal Writing Intellectual Property Legal Research Research Legal Issues Family Law Corporate Law Document Review Editing Legal Writing Education University of San Francisco School of Law JD 2005  – 2009 CALI Award, Fall 2008, Legal Ethics. Activities and Societies:  Business Law Association ,  Co-President ,  Maritime Law Journal ,  Intellectual Property Law Bulletin University of San Francisco - Masagung Graduate School of Management MBA 2006  – 2008 Dean's List, Spring 2008 University of California, Berkeley BA,  Sociology Major , Business Minor 2000  – 2004 Activities and Societies:  Alpha Kappa Delta Sociological Honor Society ,  Cal Hawaii Club ,  Eggster ,  OASES University of San Francisco School of Law JD 2005  – 2009 CALI Award, Fall 2008, Legal Ethics. Activities and Societies:  Business Law Association ,  Co-President ,  Maritime Law Journal ,  Intellectual Property Law Bulletin University of San Francisco School of Law JD 2005  – 2009 CALI Award, Fall 2008, Legal Ethics. Activities and Societies:  Business Law Association ,  Co-President ,  Maritime Law Journal ,  Intellectual Property Law Bulletin University of San Francisco School of Law JD 2005  – 2009 CALI Award, Fall 2008, Legal Ethics. Activities and Societies:  Business Law Association ,  Co-President ,  Maritime Law Journal ,  Intellectual Property Law Bulletin University of San Francisco - Masagung Graduate School of Management MBA 2006  – 2008 Dean's List, Spring 2008 University of San Francisco - Masagung Graduate School of Management MBA 2006  – 2008 Dean's List, Spring 2008 University of San Francisco - Masagung Graduate School of Management MBA 2006  – 2008 Dean's List, Spring 2008 University of California, Berkeley BA,  Sociology Major , Business Minor 2000  – 2004 Activities and Societies:  Alpha Kappa Delta Sociological Honor Society ,  Cal Hawaii Club ,  Eggster ,  OASES University of California, Berkeley BA,  Sociology Major , Business Minor 2000  – 2004 Activities and Societies:  Alpha Kappa Delta Sociological Honor Society ,  Cal Hawaii Club ,  Eggster ,  OASES University of California, Berkeley BA,  Sociology Major , Business Minor 2000  – 2004 Activities and Societies:  Alpha Kappa Delta Sociological Honor Society ,  Cal Hawaii Club ,  Eggster ,  OASES ", "Experience Discovery Staff Attorney Google Inc. January 2013  – Present (2 years 8 months) Mountain View, CA Document Review Attorney Google Inc. via Adecco April 2011  –  January 2013  (1 year 10 months) Mountain View, CA Contract Attorney Fortis General Counsel, LLP November 2008  –  December 2010  (2 years 2 months) Redwood Shores, CA Discovery Staff Attorney Google Inc. January 2013  – Present (2 years 8 months) Mountain View, CA Discovery Staff Attorney Google Inc. January 2013  – Present (2 years 8 months) Mountain View, CA Document Review Attorney Google Inc. via Adecco April 2011  –  January 2013  (1 year 10 months) Mountain View, CA Document Review Attorney Google Inc. via Adecco April 2011  –  January 2013  (1 year 10 months) Mountain View, CA Contract Attorney Fortis General Counsel, LLP November 2008  –  December 2010  (2 years 2 months) Redwood Shores, CA Contract Attorney Fortis General Counsel, LLP November 2008  –  December 2010  (2 years 2 months) Redwood Shores, CA Skills Legal Discovery Litigation Document Review Skills  Legal Discovery Litigation Document Review Legal Discovery Litigation Document Review Legal Discovery Litigation Document Review Education University of the Pacific - McGeorge School of Law J.D. 2003  – 2006 University of the Pacific - McGeorge School of Law J.D. 2003  – 2006 University of the Pacific - McGeorge School of Law J.D. 2003  – 2006 University of the Pacific - McGeorge School of Law J.D. 2003  – 2006 ", "Languages English Spanish Chinese (Traditional) English Spanish Chinese (Traditional) English Spanish Chinese (Traditional) Skills Skills     Education Santa Clara University School of Law JD,  Law University of California, Berkeley BA,  Molecular and Cell Biology Santa Clara University School of Law JD,  Law Santa Clara University School of Law JD,  Law Santa Clara University School of Law JD,  Law University of California, Berkeley BA,  Molecular and Cell Biology University of California, Berkeley BA,  Molecular and Cell Biology University of California, Berkeley BA,  Molecular and Cell Biology ", "Summary - Registered Patent Attorney: experienced in drafting responses to Office Action, appeals, and patent applications.  \n- Document Review Attorney: over three years of experience in document review on a wide variety of matters, including antitrust, copyright, employment, HSR second requests, internal investigations, M&A, patents, privacy, securities, and trademark. Proficient in hard copy review and in the following electronic document review platforms: Catalyst, Kroll-Ontrack, OmniX, Reccomind, Relativity, and Ringtail. Experienced with analytics, QC, privilege logging, and redaction for privilege, privacy, and source code.  \n- Engineer: Extensive experience as an engineer and manager in semiconductor process development and manufacturing. Inventor on eleven (11) U.S. patents. \n \nSpecialties: LEGAL: Drafting USPTO Office Action responses, Appeal Briefs, and Patent Applications. \nENGINEERING: Inventor on eleven issued U.S. Patents. Semiconductor manufacturing process development, especially plasma etching, thin films deposition, and chemi-mechanical planarization. Design of experiments. Troubleshooting of manufacturing problems -- process, equipment, and materials.  \nMANAGEMENT: Project management Leadership of cross-functional teams. Quality improvement systems. Documentation. Summary - Registered Patent Attorney: experienced in drafting responses to Office Action, appeals, and patent applications.  \n- Document Review Attorney: over three years of experience in document review on a wide variety of matters, including antitrust, copyright, employment, HSR second requests, internal investigations, M&A, patents, privacy, securities, and trademark. Proficient in hard copy review and in the following electronic document review platforms: Catalyst, Kroll-Ontrack, OmniX, Reccomind, Relativity, and Ringtail. Experienced with analytics, QC, privilege logging, and redaction for privilege, privacy, and source code.  \n- Engineer: Extensive experience as an engineer and manager in semiconductor process development and manufacturing. Inventor on eleven (11) U.S. patents. \n \nSpecialties: LEGAL: Drafting USPTO Office Action responses, Appeal Briefs, and Patent Applications. \nENGINEERING: Inventor on eleven issued U.S. Patents. Semiconductor manufacturing process development, especially plasma etching, thin films deposition, and chemi-mechanical planarization. Design of experiments. Troubleshooting of manufacturing problems -- process, equipment, and materials.  \nMANAGEMENT: Project management Leadership of cross-functional teams. Quality improvement systems. Documentation. - Registered Patent Attorney: experienced in drafting responses to Office Action, appeals, and patent applications.  \n- Document Review Attorney: over three years of experience in document review on a wide variety of matters, including antitrust, copyright, employment, HSR second requests, internal investigations, M&A, patents, privacy, securities, and trademark. Proficient in hard copy review and in the following electronic document review platforms: Catalyst, Kroll-Ontrack, OmniX, Reccomind, Relativity, and Ringtail. Experienced with analytics, QC, privilege logging, and redaction for privilege, privacy, and source code.  \n- Engineer: Extensive experience as an engineer and manager in semiconductor process development and manufacturing. Inventor on eleven (11) U.S. patents. \n \nSpecialties: LEGAL: Drafting USPTO Office Action responses, Appeal Briefs, and Patent Applications. \nENGINEERING: Inventor on eleven issued U.S. Patents. Semiconductor manufacturing process development, especially plasma etching, thin films deposition, and chemi-mechanical planarization. Design of experiments. Troubleshooting of manufacturing problems -- process, equipment, and materials.  \nMANAGEMENT: Project management Leadership of cross-functional teams. Quality improvement systems. Documentation. - Registered Patent Attorney: experienced in drafting responses to Office Action, appeals, and patent applications.  \n- Document Review Attorney: over three years of experience in document review on a wide variety of matters, including antitrust, copyright, employment, HSR second requests, internal investigations, M&A, patents, privacy, securities, and trademark. Proficient in hard copy review and in the following electronic document review platforms: Catalyst, Kroll-Ontrack, OmniX, Reccomind, Relativity, and Ringtail. Experienced with analytics, QC, privilege logging, and redaction for privilege, privacy, and source code.  \n- Engineer: Extensive experience as an engineer and manager in semiconductor process development and manufacturing. Inventor on eleven (11) U.S. patents. \n \nSpecialties: LEGAL: Drafting USPTO Office Action responses, Appeal Briefs, and Patent Applications. \nENGINEERING: Inventor on eleven issued U.S. Patents. Semiconductor manufacturing process development, especially plasma etching, thin films deposition, and chemi-mechanical planarization. Design of experiments. Troubleshooting of manufacturing problems -- process, equipment, and materials.  \nMANAGEMENT: Project management Leadership of cross-functional teams. Quality improvement systems. Documentation. Experience Patent Attorney Law Office of Thomas G. Mallon December 2009  – Present (5 years 9 months) Contract Attorney Essential Discovery September 2014  – Present (1 year) San Francisco Bay Area Contract Attorney McDermott Will & Emery March 2015  –  March 2015  (1 month) Menlo Park, CA Contract Attorney Beacon Hill Staffing Group, LLC November 2014  –  December 2014  (2 months) San Francisco Bay Area Document Review Attorney Google, through Adecco September 2012  –  2014  (2 years) Mt. View, CA Contract Attorney Evolve Discovery July 2012  –  September 2012  (3 months) San Francisco Bay Area Contract Attorney Black Letter Discovery January 2012  –  July 2012  (7 months) San Francisco Bay Area Contract Attorney Robert Half Legal June 2011  –  September 2011  (4 months) San Francisco Bay Area Law Graduate Santa Clara University August 2006  –  May 2009  (2 years 10 months) Patent Engineer Shemwell Mahamedi LLP August 2007  –  April 2009  (1 year 9 months) Staff Process Engineer Sipex 2002  –  2006  (4 years) Mfg. Operations Manager SiGen 1998  –  2002  (4 years) Process Applications Manager Lam Research 1997  –  1998  (1 year) Process Applications Manager OnTrak Systems 1995  –  1997  (2 years) Sr. Proc. Dev. Engr. LSI Logic 1988  –  1995  (7 years) Staff Process Engineer National Semiconductor October 1987  –  March 1988  (6 months) Staff Process Engineer Fairchild Semiconductor 1980  –  1987  (7 years) Staff Process Engineer Fairchild Camera & Instrument 1980  –  1987  (7 years) Staff Process Engineer Fairchild 1980  –  1987  (7 years) Patent Attorney Law Office of Thomas G. Mallon December 2009  – Present (5 years 9 months) Patent Attorney Law Office of Thomas G. Mallon December 2009  – Present (5 years 9 months) Contract Attorney Essential Discovery September 2014  – Present (1 year) San Francisco Bay Area Contract Attorney Essential Discovery September 2014  – Present (1 year) San Francisco Bay Area Contract Attorney McDermott Will & Emery March 2015  –  March 2015  (1 month) Menlo Park, CA Contract Attorney McDermott Will & Emery March 2015  –  March 2015  (1 month) Menlo Park, CA Contract Attorney Beacon Hill Staffing Group, LLC November 2014  –  December 2014  (2 months) San Francisco Bay Area Contract Attorney Beacon Hill Staffing Group, LLC November 2014  –  December 2014  (2 months) San Francisco Bay Area Document Review Attorney Google, through Adecco September 2012  –  2014  (2 years) Mt. View, CA Document Review Attorney Google, through Adecco September 2012  –  2014  (2 years) Mt. View, CA Contract Attorney Evolve Discovery July 2012  –  September 2012  (3 months) San Francisco Bay Area Contract Attorney Evolve Discovery July 2012  –  September 2012  (3 months) San Francisco Bay Area Contract Attorney Black Letter Discovery January 2012  –  July 2012  (7 months) San Francisco Bay Area Contract Attorney Black Letter Discovery January 2012  –  July 2012  (7 months) San Francisco Bay Area Contract Attorney Robert Half Legal June 2011  –  September 2011  (4 months) San Francisco Bay Area Contract Attorney Robert Half Legal June 2011  –  September 2011  (4 months) San Francisco Bay Area Law Graduate Santa Clara University August 2006  –  May 2009  (2 years 10 months) Law Graduate Santa Clara University August 2006  –  May 2009  (2 years 10 months) Patent Engineer Shemwell Mahamedi LLP August 2007  –  April 2009  (1 year 9 months) Patent Engineer Shemwell Mahamedi LLP August 2007  –  April 2009  (1 year 9 months) Staff Process Engineer Sipex 2002  –  2006  (4 years) Staff Process Engineer Sipex 2002  –  2006  (4 years) Mfg. Operations Manager SiGen 1998  –  2002  (4 years) Mfg. Operations Manager SiGen 1998  –  2002  (4 years) Process Applications Manager Lam Research 1997  –  1998  (1 year) Process Applications Manager Lam Research 1997  –  1998  (1 year) Process Applications Manager OnTrak Systems 1995  –  1997  (2 years) Process Applications Manager OnTrak Systems 1995  –  1997  (2 years) Sr. Proc. Dev. Engr. LSI Logic 1988  –  1995  (7 years) Sr. Proc. Dev. Engr. LSI Logic 1988  –  1995  (7 years) Staff Process Engineer National Semiconductor October 1987  –  March 1988  (6 months) Staff Process Engineer National Semiconductor October 1987  –  March 1988  (6 months) Staff Process Engineer Fairchild Semiconductor 1980  –  1987  (7 years) Staff Process Engineer Fairchild Semiconductor 1980  –  1987  (7 years) Staff Process Engineer Fairchild Camera & Instrument 1980  –  1987  (7 years) Staff Process Engineer Fairchild Camera & Instrument 1980  –  1987  (7 years) Staff Process Engineer Fairchild 1980  –  1987  (7 years) Staff Process Engineer Fairchild 1980  –  1987  (7 years) Skills Patents Semiconductors Legal Writing Project Management Manufacturing Intellectual Property Patent Prosecution Patent Litigation Licensing Electronics Litigation Start-ups Skills  Patents Semiconductors Legal Writing Project Management Manufacturing Intellectual Property Patent Prosecution Patent Litigation Licensing Electronics Litigation Start-ups Patents Semiconductors Legal Writing Project Management Manufacturing Intellectual Property Patent Prosecution Patent Litigation Licensing Electronics Litigation Start-ups Patents Semiconductors Legal Writing Project Management Manufacturing Intellectual Property Patent Prosecution Patent Litigation Licensing Electronics Litigation Start-ups Education Santa Clara University School of Law J.D. 2006  – 2009 Abraham Lincoln High School, San Jose San Jose State University Bachelor of Science (B.S.) Santa Clara University School of Law J.D. 2006  – 2009 Santa Clara University School of Law J.D. 2006  – 2009 Santa Clara University School of Law J.D. 2006  – 2009 Abraham Lincoln High School, San Jose Abraham Lincoln High School, San Jose Abraham Lincoln High School, San Jose San Jose State University Bachelor of Science (B.S.) San Jose State University Bachelor of Science (B.S.) San Jose State University Bachelor of Science (B.S.) ", "Experience Discovery Staff Attorney, Case Manager Google January 2013  – Present (2 years 8 months) Mountain View, CA E-Discovery Case Manager.  \nGeneral Litigation :: Competition / Antitrust :: Patent Litigation Document Review Attorney Adecco @ Google February 2012  –  January 2013  (1 year) Mountain View, CA Contract Attorney for Quinn Emanuel Robert Half Legal May 2011  –  February 2012  (10 months) San Francisco Contract Attorney for Wilson Elser Robert Half Legal March 2011  –  April 2011  (2 months) Oakland Document Review Attorney, including first and second line review. Review of documents for patent, trade secret, and legal privilege. Associate Attorney - Trademark Law Raj Abhyanker, LLP August 2010  –  November 2010  (4 months) Mountain View, CA Associate attorney experience for an international boutique IP law firm in the managing and filing of trademark applications initiated through Trademarkia.com, a start-up internet trademark service and social media website. \n \nTrademark prosecution, including; client intake and interviews, trademark application preparation and filing, assisting clients with description and classification of goods and services, and drafting responses to USPTO office actions and letters of protest. Trademark / Copyright Legal Intern THX Ltd June 2008  –  April 2009  (11 months) Maintained and enforced trademark portfolio, including drafting cease and desist letters, DMCA takedown notices, and enforcement of intellectual property rights in a variety of mediums. \nAssisted in contract management, including reviewing licensing agreements for use of THX trademarks in television and internet broadcasts. \nWorked closely with General Counsel, Contracts Manager, and internal clients. Legal Intern Law Firm of Sterling and Clack September 2007  –  December 2007  (4 months) Researched and authored memorandum regarding maritime personal injury defense cases and Carriage of Goods by Sea contracts. \nResearched and drafted response brief for Ninth Circuit Court of Appeals. Collection Manager / Paralegal Law Office of D Michael Dendy, APLC October 2003  –  August 2006  (2 years 11 months) Managed a unit of 6-10 debt collectors. \nResearched and verified bankruptcy and divorce filings using Lexis-Nexis legal database. \nConducted asset investigations and reviewed confidential credit reports to collect debts for clients. \nTracked and monitored success of collection efforts for unit.  \nMaintained client relationship with firm's largest client. Collection Manager d.michael dendy, aplc 2003  –  2006  (3 years) Discovery Staff Attorney, Case Manager Google January 2013  – Present (2 years 8 months) Mountain View, CA E-Discovery Case Manager.  \nGeneral Litigation :: Competition / Antitrust :: Patent Litigation Discovery Staff Attorney, Case Manager Google January 2013  – Present (2 years 8 months) Mountain View, CA E-Discovery Case Manager.  \nGeneral Litigation :: Competition / Antitrust :: Patent Litigation Document Review Attorney Adecco @ Google February 2012  –  January 2013  (1 year) Mountain View, CA Document Review Attorney Adecco @ Google February 2012  –  January 2013  (1 year) Mountain View, CA Contract Attorney for Quinn Emanuel Robert Half Legal May 2011  –  February 2012  (10 months) San Francisco Contract Attorney for Quinn Emanuel Robert Half Legal May 2011  –  February 2012  (10 months) San Francisco Contract Attorney for Wilson Elser Robert Half Legal March 2011  –  April 2011  (2 months) Oakland Document Review Attorney, including first and second line review. Review of documents for patent, trade secret, and legal privilege. Contract Attorney for Wilson Elser Robert Half Legal March 2011  –  April 2011  (2 months) Oakland Document Review Attorney, including first and second line review. Review of documents for patent, trade secret, and legal privilege. Associate Attorney - Trademark Law Raj Abhyanker, LLP August 2010  –  November 2010  (4 months) Mountain View, CA Associate attorney experience for an international boutique IP law firm in the managing and filing of trademark applications initiated through Trademarkia.com, a start-up internet trademark service and social media website. \n \nTrademark prosecution, including; client intake and interviews, trademark application preparation and filing, assisting clients with description and classification of goods and services, and drafting responses to USPTO office actions and letters of protest. Associate Attorney - Trademark Law Raj Abhyanker, LLP August 2010  –  November 2010  (4 months) Mountain View, CA Associate attorney experience for an international boutique IP law firm in the managing and filing of trademark applications initiated through Trademarkia.com, a start-up internet trademark service and social media website. \n \nTrademark prosecution, including; client intake and interviews, trademark application preparation and filing, assisting clients with description and classification of goods and services, and drafting responses to USPTO office actions and letters of protest. Trademark / Copyright Legal Intern THX Ltd June 2008  –  April 2009  (11 months) Maintained and enforced trademark portfolio, including drafting cease and desist letters, DMCA takedown notices, and enforcement of intellectual property rights in a variety of mediums. \nAssisted in contract management, including reviewing licensing agreements for use of THX trademarks in television and internet broadcasts. \nWorked closely with General Counsel, Contracts Manager, and internal clients. Trademark / Copyright Legal Intern THX Ltd June 2008  –  April 2009  (11 months) Maintained and enforced trademark portfolio, including drafting cease and desist letters, DMCA takedown notices, and enforcement of intellectual property rights in a variety of mediums. \nAssisted in contract management, including reviewing licensing agreements for use of THX trademarks in television and internet broadcasts. \nWorked closely with General Counsel, Contracts Manager, and internal clients. Legal Intern Law Firm of Sterling and Clack September 2007  –  December 2007  (4 months) Researched and authored memorandum regarding maritime personal injury defense cases and Carriage of Goods by Sea contracts. \nResearched and drafted response brief for Ninth Circuit Court of Appeals. Legal Intern Law Firm of Sterling and Clack September 2007  –  December 2007  (4 months) Researched and authored memorandum regarding maritime personal injury defense cases and Carriage of Goods by Sea contracts. \nResearched and drafted response brief for Ninth Circuit Court of Appeals. Collection Manager / Paralegal Law Office of D Michael Dendy, APLC October 2003  –  August 2006  (2 years 11 months) Managed a unit of 6-10 debt collectors. \nResearched and verified bankruptcy and divorce filings using Lexis-Nexis legal database. \nConducted asset investigations and reviewed confidential credit reports to collect debts for clients. \nTracked and monitored success of collection efforts for unit.  \nMaintained client relationship with firm's largest client. Collection Manager / Paralegal Law Office of D Michael Dendy, APLC October 2003  –  August 2006  (2 years 11 months) Managed a unit of 6-10 debt collectors. \nResearched and verified bankruptcy and divorce filings using Lexis-Nexis legal database. \nConducted asset investigations and reviewed confidential credit reports to collect debts for clients. \nTracked and monitored success of collection efforts for unit.  \nMaintained client relationship with firm's largest client. Collection Manager d.michael dendy, aplc 2003  –  2006  (3 years) Collection Manager d.michael dendy, aplc 2003  –  2006  (3 years) Skills Intellectual Property Copyright Law Legal Research Legal Writing Litigation Trademarks Patent Litigation Patents Document Review Licensing Trade Secrets Litigation Support Skills  Intellectual Property Copyright Law Legal Research Legal Writing Litigation Trademarks Patent Litigation Patents Document Review Licensing Trade Secrets Litigation Support Intellectual Property Copyright Law Legal Research Legal Writing Litigation Trademarks Patent Litigation Patents Document Review Licensing Trade Secrets Litigation Support Intellectual Property Copyright Law Legal Research Legal Writing Litigation Trademarks Patent Litigation Patents Document Review Licensing Trade Secrets Litigation Support Education University of San Francisco School of Law Juris Doctor,  Intellectual Property Law 2006  – 2009 Honors Certificate - Intellectual Property Law \nCALI Award for Academic Excellence - Cyberlaw (Spring 2009) Activities and Societies:  USF School of Law Inn of Court\nMaritime Law Journal: Survey and Technical Editor (2006-2008) ,  Senior Managing Editor (2008-2009)\nInvestor Justice Project: Securities Arbitration Clinic (Fall 2008)\nInternet Justice / Intellectual Property Law Clinic (Spring 2008)\nIntensive Advocacy Program (2008)\nInternational Law Program: Trinity College - Dublin ,  IR and Charles University ,  Prague ,  CZ Tulane University Bachelor,  Liberal Arts and Sciences; Political Economics; Philosophy 1999  – 2003 Political Economics / Philosophy University of San Francisco School of Law Juris Doctor,  Intellectual Property Law 2006  – 2009 Honors Certificate - Intellectual Property Law \nCALI Award for Academic Excellence - Cyberlaw (Spring 2009) Activities and Societies:  USF School of Law Inn of Court\nMaritime Law Journal: Survey and Technical Editor (2006-2008) ,  Senior Managing Editor (2008-2009)\nInvestor Justice Project: Securities Arbitration Clinic (Fall 2008)\nInternet Justice / Intellectual Property Law Clinic (Spring 2008)\nIntensive Advocacy Program (2008)\nInternational Law Program: Trinity College - Dublin ,  IR and Charles University ,  Prague ,  CZ University of San Francisco School of Law Juris Doctor,  Intellectual Property Law 2006  – 2009 Honors Certificate - Intellectual Property Law \nCALI Award for Academic Excellence - Cyberlaw (Spring 2009) Activities and Societies:  USF School of Law Inn of Court\nMaritime Law Journal: Survey and Technical Editor (2006-2008) ,  Senior Managing Editor (2008-2009)\nInvestor Justice Project: Securities Arbitration Clinic (Fall 2008)\nInternet Justice / Intellectual Property Law Clinic (Spring 2008)\nIntensive Advocacy Program (2008)\nInternational Law Program: Trinity College - Dublin ,  IR and Charles University ,  Prague ,  CZ University of San Francisco School of Law Juris Doctor,  Intellectual Property Law 2006  – 2009 Honors Certificate - Intellectual Property Law \nCALI Award for Academic Excellence - Cyberlaw (Spring 2009) Activities and Societies:  USF School of Law Inn of Court\nMaritime Law Journal: Survey and Technical Editor (2006-2008) ,  Senior Managing Editor (2008-2009)\nInvestor Justice Project: Securities Arbitration Clinic (Fall 2008)\nInternet Justice / Intellectual Property Law Clinic (Spring 2008)\nIntensive Advocacy Program (2008)\nInternational Law Program: Trinity College - Dublin ,  IR and Charles University ,  Prague ,  CZ Tulane University Bachelor,  Liberal Arts and Sciences; Political Economics; Philosophy 1999  – 2003 Political Economics / Philosophy Tulane University Bachelor,  Liberal Arts and Sciences; Political Economics; Philosophy 1999  – 2003 Political Economics / Philosophy Tulane University Bachelor,  Liberal Arts and Sciences; Political Economics; Philosophy 1999  – 2003 Political Economics / Philosophy "]}