{"position": "BOLD Intern - Hourly", "company": "Google", "profiles": ["Summary Self-motivated high-tech professional fascinated by how technology impacts people and organizations. Enjoys public speaking and not afraid of a large crowd. Gaining experience in project management. Focused on problem solving. Communication is key. Hobbies include graphic design and basic HTML which amplify core role as Community Manager. \n \nMajored in Science, Technology and Society with a concentration in Business and Information Technology at the University of Pennsylvania, College of Arts and Sciences. Focused on creating beautiful customer experiences on Google for Work Connect. \n \nLuis is open to new opportunities and business relationships.  Summary Self-motivated high-tech professional fascinated by how technology impacts people and organizations. Enjoys public speaking and not afraid of a large crowd. Gaining experience in project management. Focused on problem solving. Communication is key. Hobbies include graphic design and basic HTML which amplify core role as Community Manager. \n \nMajored in Science, Technology and Society with a concentration in Business and Information Technology at the University of Pennsylvania, College of Arts and Sciences. Focused on creating beautiful customer experiences on Google for Work Connect. \n \nLuis is open to new opportunities and business relationships.  Self-motivated high-tech professional fascinated by how technology impacts people and organizations. Enjoys public speaking and not afraid of a large crowd. Gaining experience in project management. Focused on problem solving. Communication is key. Hobbies include graphic design and basic HTML which amplify core role as Community Manager. \n \nMajored in Science, Technology and Society with a concentration in Business and Information Technology at the University of Pennsylvania, College of Arts and Sciences. Focused on creating beautiful customer experiences on Google for Work Connect. \n \nLuis is open to new opportunities and business relationships.  Self-motivated high-tech professional fascinated by how technology impacts people and organizations. Enjoys public speaking and not afraid of a large crowd. Gaining experience in project management. Focused on problem solving. Communication is key. Hobbies include graphic design and basic HTML which amplify core role as Community Manager. \n \nMajored in Science, Technology and Society with a concentration in Business and Information Technology at the University of Pennsylvania, College of Arts and Sciences. Focused on creating beautiful customer experiences on Google for Work Connect. \n \nLuis is open to new opportunities and business relationships.  Experience Community Manager Google August 2014  – Present (1 year 1 month) Mountain View, CA • Manage community of 20,000+ System Administrators at Google for Work customer companies \n• Manage internal projects to improve user interface, user experience, and customer satisfaction \n• Create, maintain, and promote a beautiful customer experience IT Project Analyst The Wharton School, Management Department Helpdesk January 2013  –  May 2014  (1 year 5 months) Philadelphia, PA • Maintained inventory of all equipment, software and software licenses \n• Monitored and responded quickly and effectively to requests received through the IT Helpdesk \n• Managed PC setup and deployment for faculty and staff using standard hardware, images and software Enterprise Information Experience Platforms BOLD Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA • Created internal user guide to facilitate change management \n• Performed market analysis on competing partner enablement platforms \n• Designed streamlined model to grant non-apps partners access to Google Partner Connect Support Assistant Information Technology Services, University of Pennsylvania Law School September 2012  –  December 2012  (4 months) Philadelphia, PA • Rolled out Freshdesk to improve customer relationship management \n• Drafted support documentation for online help portal \n• Delivered toner and other office supplies upon request Enterprise Support BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, CA • Overhauled internal data collection system \n• Performed data quality audit  \n• Facilitated training session for new-hire Corporate Paralegal Intern Cleary Gottlieb Steen & Hamilton LLP July 2011  –  August 2011  (2 months) New York, NY • Created content for internal Corporate Paralegal department wiki \n• Catalogued closing documents on network drive \n• Prepared closing sets and sent to clients and partner law firms Information Technology Advisor University of Pennsylvania, College House Computing September 2010  –  May 2011  (9 months) Philadelphia, PA • Troubleshot network connectivity \n• Removed viruses and installed anti-virus software \n• Set up wireless Internet access Continuing Legal Education Intern Morgan, Lewis & Bockius LLP 2010  –  2010  (less than a year) • Prepared documents for data entry \n• Verified, updated and corrected source documents \n• Entered data into designated database and forms Community Manager Google August 2014  – Present (1 year 1 month) Mountain View, CA • Manage community of 20,000+ System Administrators at Google for Work customer companies \n• Manage internal projects to improve user interface, user experience, and customer satisfaction \n• Create, maintain, and promote a beautiful customer experience Community Manager Google August 2014  – Present (1 year 1 month) Mountain View, CA • Manage community of 20,000+ System Administrators at Google for Work customer companies \n• Manage internal projects to improve user interface, user experience, and customer satisfaction \n• Create, maintain, and promote a beautiful customer experience IT Project Analyst The Wharton School, Management Department Helpdesk January 2013  –  May 2014  (1 year 5 months) Philadelphia, PA • Maintained inventory of all equipment, software and software licenses \n• Monitored and responded quickly and effectively to requests received through the IT Helpdesk \n• Managed PC setup and deployment for faculty and staff using standard hardware, images and software IT Project Analyst The Wharton School, Management Department Helpdesk January 2013  –  May 2014  (1 year 5 months) Philadelphia, PA • Maintained inventory of all equipment, software and software licenses \n• Monitored and responded quickly and effectively to requests received through the IT Helpdesk \n• Managed PC setup and deployment for faculty and staff using standard hardware, images and software Enterprise Information Experience Platforms BOLD Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA • Created internal user guide to facilitate change management \n• Performed market analysis on competing partner enablement platforms \n• Designed streamlined model to grant non-apps partners access to Google Partner Connect Enterprise Information Experience Platforms BOLD Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA • Created internal user guide to facilitate change management \n• Performed market analysis on competing partner enablement platforms \n• Designed streamlined model to grant non-apps partners access to Google Partner Connect Support Assistant Information Technology Services, University of Pennsylvania Law School September 2012  –  December 2012  (4 months) Philadelphia, PA • Rolled out Freshdesk to improve customer relationship management \n• Drafted support documentation for online help portal \n• Delivered toner and other office supplies upon request Support Assistant Information Technology Services, University of Pennsylvania Law School September 2012  –  December 2012  (4 months) Philadelphia, PA • Rolled out Freshdesk to improve customer relationship management \n• Drafted support documentation for online help portal \n• Delivered toner and other office supplies upon request Enterprise Support BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, CA • Overhauled internal data collection system \n• Performed data quality audit  \n• Facilitated training session for new-hire Enterprise Support BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, CA • Overhauled internal data collection system \n• Performed data quality audit  \n• Facilitated training session for new-hire Corporate Paralegal Intern Cleary Gottlieb Steen & Hamilton LLP July 2011  –  August 2011  (2 months) New York, NY • Created content for internal Corporate Paralegal department wiki \n• Catalogued closing documents on network drive \n• Prepared closing sets and sent to clients and partner law firms Corporate Paralegal Intern Cleary Gottlieb Steen & Hamilton LLP July 2011  –  August 2011  (2 months) New York, NY • Created content for internal Corporate Paralegal department wiki \n• Catalogued closing documents on network drive \n• Prepared closing sets and sent to clients and partner law firms Information Technology Advisor University of Pennsylvania, College House Computing September 2010  –  May 2011  (9 months) Philadelphia, PA • Troubleshot network connectivity \n• Removed viruses and installed anti-virus software \n• Set up wireless Internet access Information Technology Advisor University of Pennsylvania, College House Computing September 2010  –  May 2011  (9 months) Philadelphia, PA • Troubleshot network connectivity \n• Removed viruses and installed anti-virus software \n• Set up wireless Internet access Continuing Legal Education Intern Morgan, Lewis & Bockius LLP 2010  –  2010  (less than a year) • Prepared documents for data entry \n• Verified, updated and corrected source documents \n• Entered data into designated database and forms Continuing Legal Education Intern Morgan, Lewis & Bockius LLP 2010  –  2010  (less than a year) • Prepared documents for data entry \n• Verified, updated and corrected source documents \n• Entered data into designated database and forms Languages Spanish Spanish Spanish Skills Leadership Public Speaking Project Management Problem Solving Communication Graphic Design Photoshop Basic HTML Google Apps Spanish Data Analysis Microsoft Office Research Social Media Nonprofits Blogging Editing Microsoft Word English Event Planning Fundraising Community Outreach PowerPoint Python Social Networking See 10+     See less Skills  Leadership Public Speaking Project Management Problem Solving Communication Graphic Design Photoshop Basic HTML Google Apps Spanish Data Analysis Microsoft Office Research Social Media Nonprofits Blogging Editing Microsoft Word English Event Planning Fundraising Community Outreach PowerPoint Python Social Networking See 10+     See less Leadership Public Speaking Project Management Problem Solving Communication Graphic Design Photoshop Basic HTML Google Apps Spanish Data Analysis Microsoft Office Research Social Media Nonprofits Blogging Editing Microsoft Word English Event Planning Fundraising Community Outreach PowerPoint Python Social Networking See 10+     See less Leadership Public Speaking Project Management Problem Solving Communication Graphic Design Photoshop Basic HTML Google Apps Spanish Data Analysis Microsoft Office Research Social Media Nonprofits Blogging Editing Microsoft Word English Event Planning Fundraising Community Outreach PowerPoint Python Social Networking See 10+     See less Education University of Pennsylvania Bachelor's Degree,  Science , Technology and Society 2010  – 2014 Explored the intersection between people and technology. Activities and Societies:  Cipactli Latino Honor Society ,  Latino Coalition ,  National Society of Collegiate Scholars ,  Society for Pre-Law Students of Color (SPOC) ,  Gates Millennium Scholars @ Penn (GMS@Penn) Eleanor Roosevelt High School High School 2006  – 2010 Manhattan Academy of Technology University of Pennsylvania Bachelor's Degree,  Science , Technology and Society 2010  – 2014 Explored the intersection between people and technology. Activities and Societies:  Cipactli Latino Honor Society ,  Latino Coalition ,  National Society of Collegiate Scholars ,  Society for Pre-Law Students of Color (SPOC) ,  Gates Millennium Scholars @ Penn (GMS@Penn) University of Pennsylvania Bachelor's Degree,  Science , Technology and Society 2010  – 2014 Explored the intersection between people and technology. Activities and Societies:  Cipactli Latino Honor Society ,  Latino Coalition ,  National Society of Collegiate Scholars ,  Society for Pre-Law Students of Color (SPOC) ,  Gates Millennium Scholars @ Penn (GMS@Penn) University of Pennsylvania Bachelor's Degree,  Science , Technology and Society 2010  – 2014 Explored the intersection between people and technology. Activities and Societies:  Cipactli Latino Honor Society ,  Latino Coalition ,  National Society of Collegiate Scholars ,  Society for Pre-Law Students of Color (SPOC) ,  Gates Millennium Scholars @ Penn (GMS@Penn) Eleanor Roosevelt High School High School 2006  – 2010 Eleanor Roosevelt High School High School 2006  – 2010 Eleanor Roosevelt High School High School 2006  – 2010 Manhattan Academy of Technology Manhattan Academy of Technology Manhattan Academy of Technology Honors & Awards Additional Honors & Awards • Recipient of Gates Millennium Scholarship and Seinfeld Scholarship for leadership and academic excellence \n• Member of National Society of Collegiate Scholars (NSCS) and Cipactli Latino Honor Society Additional Honors & Awards • Recipient of Gates Millennium Scholarship and Seinfeld Scholarship for leadership and academic excellence \n• Member of National Society of Collegiate Scholars (NSCS) and Cipactli Latino Honor Society Additional Honors & Awards • Recipient of Gates Millennium Scholarship and Seinfeld Scholarship for leadership and academic excellence \n• Member of National Society of Collegiate Scholars (NSCS) and Cipactli Latino Honor Society Additional Honors & Awards • Recipient of Gates Millennium Scholarship and Seinfeld Scholarship for leadership and academic excellence \n• Member of National Society of Collegiate Scholars (NSCS) and Cipactli Latino Honor Society ", "Experience Associate Account Strategist Google June 2015  – Present (3 months) Ann Arbor, MI NCAA Division 1 Student-Athlete Loyola University Chicago August 2010  –  June 2015  (4 years 11 months) Greater Chicago Area - Member of Loyola University Chicago's NCAA Divison 1 Mens Cross Country and Track & Field teams. \n-Served as the distance team's leader for the 2013-2014 and 2014-2015 school years. \n- Specialized in the long distance events on the track, including the 3,000m, 5,000m, and 10,000m. \n- Collaborate on a daily basis with a 30 diverse individuals, while striving towards common goals. \n- Assisted the head coach in workout preparation and team communication.  \n- Practice 20-25 hours per week and travel each weekend for competitions, while balancing a full class load.  \n- Achieved numerous All-Conference and All-Academic honors in both the Horizon League and the Missouri Valley Conference. \n- Individual Conference Champion in both the 5,000m and 10,000m race during the 2013 Horizon League Outdoor Track and Field Conference Championships. \n- Member of the 2012 Horizon League Cross Country Championship team, 2013 Horizon League Indoor Track and Field Championship team, and 2013 Horizon League Outdoor Track and Field runner up team. Google Glass Explorer Google August 2013  –  December 2014  (1 year 5 months) Greater Chicago Area - Was chosen to be one of around 8,000 Google Glass Explorers nation-wide. \n- Tested out the Google Glass Explorer edition in the academic setting and in everyday life. \n- Engaged in product demonstrations to promote Glass, and answer inquiries about the product. \n- Took part in forums and discussions related to the Google Glass product.  \n- Photos, videos, and posts were featured numerous times on the Google Glass community page on Google +, the Google Glass Instagram account, and the Google Glass Explorer Volume Collection. BOLD Intern, Online Advertising Specialist Google May 2014  –  August 2014  (4 months) Ann Arbor, MI - Selected as one of 153 students to participate in the competitive internship program, receiving over 5,200 applicants.  \n- Consulted with a wide range of over 300 SMB advertisers delivering the optimal advertising solutions for each customer.  \n- Listened to and assessed customers’ needs, understood the details of their individual campaigns, resolved their questions and explorer how to uncover new business opportunities \n- Advised clients in the creation of Google AdWords Search, Display and YouTube video campaigns. \n- Helped set the vision and the strategy for how their advertising can reach thousands of users through online presence.  \n- Provided Google-caliber client service, research and market analysis \n- Utilized expertise in Google Analytics by offering support by troubleshooting coding issues, educated advertisers in creating analytics reports, and crafted advertisers in implementing the product. \n- Worked in a structured environment, which emphasizes productivity, quality and CSAT targets. \n- Assisted the University Programs team member in planning the BOLD Intern East Coast offsite conference.  \n- Tasks included: planning dining reservations, travel arrangements, team building activities, and organizing guest speakers for a group of around 60 individuals \n- Spent time working with the office's \"culture club\"; the team responsible for hosting the weekly \"TGIF\" events for office. I contributed to the organization and creation of three \"TGIF\" events.  \n- Helped head an intern-ran TGIF event for the office. \n- Tasks included: attending meetings and creating suggestions for possible themes, entertainment options, and catering ideas. I also helped promote the week's event through word-of-mouth, email, and print advertising. Google Student Ambassador Google August 2013  –  June 2014  (11 months) Chicago, IL - Worked as the liaison between Loyola and Google by hosting various events, informational sessions, and product demonstrations to help build Google's brand on campus.  \n- Selected as one of 10 Google Glass explorers to trial and build awareness for the product.  \n- Worked with over 2,500 students throughout the year, and promoted Google Apps for use on campus. \n- Organized information sessions with full time employees and recruiters for students interested in technology-based roles. \n- Answered and relayed any questions and inquiries related to Google. Student-Athlete Professional Development Mentor Loyola University Chicago January 2013  –  May 2014  (1 year 5 months) Greater Chicago Area - Volunteered in the athletic department to help fellow student-athletes with their professional development. \n- Worked with the student-athletes to help them create and/or revise their resumes, apply for jobs/internships, prepare for interviews, and to create future plans.  \n- Spoke about and shared insights on my experiences as an intern, campus ambassador, and a student-athlete. Digital Marketing Consultant Loyola University Chicago August 2013  –  December 2013  (5 months) Greater Chicago Area For a marketing project, worked with a real life client, who founded and ran a dog walking business in the city of Chicago. Was given a fictional $5,000 to use and allocate realistically. Was the project manager of the team, overseeing the entire project.  \n \nMany of the objectives completed within the project include: \n- Improved means of social media, and advertising. Worked out issues with their website and SEO. \n- This included contacting the website developer to fix any glitches that occurred on the site. Suggested to also create more relevant and concrete tabs to webpages on the site.  \n- Emphasized the importance of using their social media platforms as a mean of communication between the company and their clients.  \n- Crafted multiple social media campaigns across all their social media platforms. These included posting Instagram photos and videos of the client's dogs being walked, as well as having the clients post photos to the Facebook pages for themed contests.  \n- Implemented the use of Google AdWords for paid online advertising, as well as the implementation of Google Analytics to track the activity on their website. \n- Was able to increase client's Twitter following by nearly 20% during consultation time. BOLD Intern, Google Analytics Product Support Google May 2013  –  August 2013  (4 months) Ann Arbor, MI - Selected as one of around 150 interns from the competitive pool of over 5,000 applicants.  \n- One of three interns specially trained for Google Analytics product support. \n- Received both Google AdWords and Google Analytics Certification. \n- Consulted with over 200 small-to-medium business owners from around the United States \n- Advised clients on how to create accounts, implement the Google Analytics tracking code, and how to best utilize the various reports offered by Google Analytics in terms of website optimization and Google AdWords advertising strategies. \n- Offered high-level customer support in relation to Google Analytics troubleshooting. \n- Also trained to give consultative session in relation to Google AdWords account optimization. \n- Held training and informational sessions for fellow interns on Google Analytics use and support. Market Research Intern Maxfield Research Inc. May 2012  –  August 2012  (4 months) Greater Minneapolis-St. Paul Area - Served as the only intern throughout the entire company: assisting in actual research projects, advising social media communication, and doing onsite observation reviews  \n- Worked with clients looking to establish various types of real estates, with budgets ranging from $15,000 to $75,000. \n- Conducted preliminary demand estimates and in-depth demographic and economic research studies for clients looking to construct residential and commercial projects in a certain geographic area. \n- Compiled the research findings into written reports for the client to determine feasibility for success of the proposed projects. Associate Account Strategist Google June 2015  – Present (3 months) Ann Arbor, MI Associate Account Strategist Google June 2015  – Present (3 months) Ann Arbor, MI NCAA Division 1 Student-Athlete Loyola University Chicago August 2010  –  June 2015  (4 years 11 months) Greater Chicago Area - Member of Loyola University Chicago's NCAA Divison 1 Mens Cross Country and Track & Field teams. \n-Served as the distance team's leader for the 2013-2014 and 2014-2015 school years. \n- Specialized in the long distance events on the track, including the 3,000m, 5,000m, and 10,000m. \n- Collaborate on a daily basis with a 30 diverse individuals, while striving towards common goals. \n- Assisted the head coach in workout preparation and team communication.  \n- Practice 20-25 hours per week and travel each weekend for competitions, while balancing a full class load.  \n- Achieved numerous All-Conference and All-Academic honors in both the Horizon League and the Missouri Valley Conference. \n- Individual Conference Champion in both the 5,000m and 10,000m race during the 2013 Horizon League Outdoor Track and Field Conference Championships. \n- Member of the 2012 Horizon League Cross Country Championship team, 2013 Horizon League Indoor Track and Field Championship team, and 2013 Horizon League Outdoor Track and Field runner up team. NCAA Division 1 Student-Athlete Loyola University Chicago August 2010  –  June 2015  (4 years 11 months) Greater Chicago Area - Member of Loyola University Chicago's NCAA Divison 1 Mens Cross Country and Track & Field teams. \n-Served as the distance team's leader for the 2013-2014 and 2014-2015 school years. \n- Specialized in the long distance events on the track, including the 3,000m, 5,000m, and 10,000m. \n- Collaborate on a daily basis with a 30 diverse individuals, while striving towards common goals. \n- Assisted the head coach in workout preparation and team communication.  \n- Practice 20-25 hours per week and travel each weekend for competitions, while balancing a full class load.  \n- Achieved numerous All-Conference and All-Academic honors in both the Horizon League and the Missouri Valley Conference. \n- Individual Conference Champion in both the 5,000m and 10,000m race during the 2013 Horizon League Outdoor Track and Field Conference Championships. \n- Member of the 2012 Horizon League Cross Country Championship team, 2013 Horizon League Indoor Track and Field Championship team, and 2013 Horizon League Outdoor Track and Field runner up team. Google Glass Explorer Google August 2013  –  December 2014  (1 year 5 months) Greater Chicago Area - Was chosen to be one of around 8,000 Google Glass Explorers nation-wide. \n- Tested out the Google Glass Explorer edition in the academic setting and in everyday life. \n- Engaged in product demonstrations to promote Glass, and answer inquiries about the product. \n- Took part in forums and discussions related to the Google Glass product.  \n- Photos, videos, and posts were featured numerous times on the Google Glass community page on Google +, the Google Glass Instagram account, and the Google Glass Explorer Volume Collection. Google Glass Explorer Google August 2013  –  December 2014  (1 year 5 months) Greater Chicago Area - Was chosen to be one of around 8,000 Google Glass Explorers nation-wide. \n- Tested out the Google Glass Explorer edition in the academic setting and in everyday life. \n- Engaged in product demonstrations to promote Glass, and answer inquiries about the product. \n- Took part in forums and discussions related to the Google Glass product.  \n- Photos, videos, and posts were featured numerous times on the Google Glass community page on Google +, the Google Glass Instagram account, and the Google Glass Explorer Volume Collection. BOLD Intern, Online Advertising Specialist Google May 2014  –  August 2014  (4 months) Ann Arbor, MI - Selected as one of 153 students to participate in the competitive internship program, receiving over 5,200 applicants.  \n- Consulted with a wide range of over 300 SMB advertisers delivering the optimal advertising solutions for each customer.  \n- Listened to and assessed customers’ needs, understood the details of their individual campaigns, resolved their questions and explorer how to uncover new business opportunities \n- Advised clients in the creation of Google AdWords Search, Display and YouTube video campaigns. \n- Helped set the vision and the strategy for how their advertising can reach thousands of users through online presence.  \n- Provided Google-caliber client service, research and market analysis \n- Utilized expertise in Google Analytics by offering support by troubleshooting coding issues, educated advertisers in creating analytics reports, and crafted advertisers in implementing the product. \n- Worked in a structured environment, which emphasizes productivity, quality and CSAT targets. \n- Assisted the University Programs team member in planning the BOLD Intern East Coast offsite conference.  \n- Tasks included: planning dining reservations, travel arrangements, team building activities, and organizing guest speakers for a group of around 60 individuals \n- Spent time working with the office's \"culture club\"; the team responsible for hosting the weekly \"TGIF\" events for office. I contributed to the organization and creation of three \"TGIF\" events.  \n- Helped head an intern-ran TGIF event for the office. \n- Tasks included: attending meetings and creating suggestions for possible themes, entertainment options, and catering ideas. I also helped promote the week's event through word-of-mouth, email, and print advertising. BOLD Intern, Online Advertising Specialist Google May 2014  –  August 2014  (4 months) Ann Arbor, MI - Selected as one of 153 students to participate in the competitive internship program, receiving over 5,200 applicants.  \n- Consulted with a wide range of over 300 SMB advertisers delivering the optimal advertising solutions for each customer.  \n- Listened to and assessed customers’ needs, understood the details of their individual campaigns, resolved their questions and explorer how to uncover new business opportunities \n- Advised clients in the creation of Google AdWords Search, Display and YouTube video campaigns. \n- Helped set the vision and the strategy for how their advertising can reach thousands of users through online presence.  \n- Provided Google-caliber client service, research and market analysis \n- Utilized expertise in Google Analytics by offering support by troubleshooting coding issues, educated advertisers in creating analytics reports, and crafted advertisers in implementing the product. \n- Worked in a structured environment, which emphasizes productivity, quality and CSAT targets. \n- Assisted the University Programs team member in planning the BOLD Intern East Coast offsite conference.  \n- Tasks included: planning dining reservations, travel arrangements, team building activities, and organizing guest speakers for a group of around 60 individuals \n- Spent time working with the office's \"culture club\"; the team responsible for hosting the weekly \"TGIF\" events for office. I contributed to the organization and creation of three \"TGIF\" events.  \n- Helped head an intern-ran TGIF event for the office. \n- Tasks included: attending meetings and creating suggestions for possible themes, entertainment options, and catering ideas. I also helped promote the week's event through word-of-mouth, email, and print advertising. Google Student Ambassador Google August 2013  –  June 2014  (11 months) Chicago, IL - Worked as the liaison between Loyola and Google by hosting various events, informational sessions, and product demonstrations to help build Google's brand on campus.  \n- Selected as one of 10 Google Glass explorers to trial and build awareness for the product.  \n- Worked with over 2,500 students throughout the year, and promoted Google Apps for use on campus. \n- Organized information sessions with full time employees and recruiters for students interested in technology-based roles. \n- Answered and relayed any questions and inquiries related to Google. Google Student Ambassador Google August 2013  –  June 2014  (11 months) Chicago, IL - Worked as the liaison between Loyola and Google by hosting various events, informational sessions, and product demonstrations to help build Google's brand on campus.  \n- Selected as one of 10 Google Glass explorers to trial and build awareness for the product.  \n- Worked with over 2,500 students throughout the year, and promoted Google Apps for use on campus. \n- Organized information sessions with full time employees and recruiters for students interested in technology-based roles. \n- Answered and relayed any questions and inquiries related to Google. Student-Athlete Professional Development Mentor Loyola University Chicago January 2013  –  May 2014  (1 year 5 months) Greater Chicago Area - Volunteered in the athletic department to help fellow student-athletes with their professional development. \n- Worked with the student-athletes to help them create and/or revise their resumes, apply for jobs/internships, prepare for interviews, and to create future plans.  \n- Spoke about and shared insights on my experiences as an intern, campus ambassador, and a student-athlete. Student-Athlete Professional Development Mentor Loyola University Chicago January 2013  –  May 2014  (1 year 5 months) Greater Chicago Area - Volunteered in the athletic department to help fellow student-athletes with their professional development. \n- Worked with the student-athletes to help them create and/or revise their resumes, apply for jobs/internships, prepare for interviews, and to create future plans.  \n- Spoke about and shared insights on my experiences as an intern, campus ambassador, and a student-athlete. Digital Marketing Consultant Loyola University Chicago August 2013  –  December 2013  (5 months) Greater Chicago Area For a marketing project, worked with a real life client, who founded and ran a dog walking business in the city of Chicago. Was given a fictional $5,000 to use and allocate realistically. Was the project manager of the team, overseeing the entire project.  \n \nMany of the objectives completed within the project include: \n- Improved means of social media, and advertising. Worked out issues with their website and SEO. \n- This included contacting the website developer to fix any glitches that occurred on the site. Suggested to also create more relevant and concrete tabs to webpages on the site.  \n- Emphasized the importance of using their social media platforms as a mean of communication between the company and their clients.  \n- Crafted multiple social media campaigns across all their social media platforms. These included posting Instagram photos and videos of the client's dogs being walked, as well as having the clients post photos to the Facebook pages for themed contests.  \n- Implemented the use of Google AdWords for paid online advertising, as well as the implementation of Google Analytics to track the activity on their website. \n- Was able to increase client's Twitter following by nearly 20% during consultation time. Digital Marketing Consultant Loyola University Chicago August 2013  –  December 2013  (5 months) Greater Chicago Area For a marketing project, worked with a real life client, who founded and ran a dog walking business in the city of Chicago. Was given a fictional $5,000 to use and allocate realistically. Was the project manager of the team, overseeing the entire project.  \n \nMany of the objectives completed within the project include: \n- Improved means of social media, and advertising. Worked out issues with their website and SEO. \n- This included contacting the website developer to fix any glitches that occurred on the site. Suggested to also create more relevant and concrete tabs to webpages on the site.  \n- Emphasized the importance of using their social media platforms as a mean of communication between the company and their clients.  \n- Crafted multiple social media campaigns across all their social media platforms. These included posting Instagram photos and videos of the client's dogs being walked, as well as having the clients post photos to the Facebook pages for themed contests.  \n- Implemented the use of Google AdWords for paid online advertising, as well as the implementation of Google Analytics to track the activity on their website. \n- Was able to increase client's Twitter following by nearly 20% during consultation time. BOLD Intern, Google Analytics Product Support Google May 2013  –  August 2013  (4 months) Ann Arbor, MI - Selected as one of around 150 interns from the competitive pool of over 5,000 applicants.  \n- One of three interns specially trained for Google Analytics product support. \n- Received both Google AdWords and Google Analytics Certification. \n- Consulted with over 200 small-to-medium business owners from around the United States \n- Advised clients on how to create accounts, implement the Google Analytics tracking code, and how to best utilize the various reports offered by Google Analytics in terms of website optimization and Google AdWords advertising strategies. \n- Offered high-level customer support in relation to Google Analytics troubleshooting. \n- Also trained to give consultative session in relation to Google AdWords account optimization. \n- Held training and informational sessions for fellow interns on Google Analytics use and support. BOLD Intern, Google Analytics Product Support Google May 2013  –  August 2013  (4 months) Ann Arbor, MI - Selected as one of around 150 interns from the competitive pool of over 5,000 applicants.  \n- One of three interns specially trained for Google Analytics product support. \n- Received both Google AdWords and Google Analytics Certification. \n- Consulted with over 200 small-to-medium business owners from around the United States \n- Advised clients on how to create accounts, implement the Google Analytics tracking code, and how to best utilize the various reports offered by Google Analytics in terms of website optimization and Google AdWords advertising strategies. \n- Offered high-level customer support in relation to Google Analytics troubleshooting. \n- Also trained to give consultative session in relation to Google AdWords account optimization. \n- Held training and informational sessions for fellow interns on Google Analytics use and support. Market Research Intern Maxfield Research Inc. May 2012  –  August 2012  (4 months) Greater Minneapolis-St. Paul Area - Served as the only intern throughout the entire company: assisting in actual research projects, advising social media communication, and doing onsite observation reviews  \n- Worked with clients looking to establish various types of real estates, with budgets ranging from $15,000 to $75,000. \n- Conducted preliminary demand estimates and in-depth demographic and economic research studies for clients looking to construct residential and commercial projects in a certain geographic area. \n- Compiled the research findings into written reports for the client to determine feasibility for success of the proposed projects. Market Research Intern Maxfield Research Inc. May 2012  –  August 2012  (4 months) Greater Minneapolis-St. Paul Area - Served as the only intern throughout the entire company: assisting in actual research projects, advising social media communication, and doing onsite observation reviews  \n- Worked with clients looking to establish various types of real estates, with budgets ranging from $15,000 to $75,000. \n- Conducted preliminary demand estimates and in-depth demographic and economic research studies for clients looking to construct residential and commercial projects in a certain geographic area. \n- Compiled the research findings into written reports for the client to determine feasibility for success of the proposed projects. Languages   Skills Market Research Facebook Google Analytics Microsoft Office Public Speaking Google Adwords Leadership Teamwork Adobe Creative Suite Customer Service YouTube Prezi Time Management Blogging Social Media Marketing Windows Movie Maker Social Networking Advertising Sales Team Leadership Google+ ESRI Qualtrics Twitter Leadership Development Team Management Team Building Google Docs See 13+     See less Skills  Market Research Facebook Google Analytics Microsoft Office Public Speaking Google Adwords Leadership Teamwork Adobe Creative Suite Customer Service YouTube Prezi Time Management Blogging Social Media Marketing Windows Movie Maker Social Networking Advertising Sales Team Leadership Google+ ESRI Qualtrics Twitter Leadership Development Team Management Team Building Google Docs See 13+     See less Market Research Facebook Google Analytics Microsoft Office Public Speaking Google Adwords Leadership Teamwork Adobe Creative Suite Customer Service YouTube Prezi Time Management Blogging Social Media Marketing Windows Movie Maker Social Networking Advertising Sales Team Leadership Google+ ESRI Qualtrics Twitter Leadership Development Team Management Team Building Google Docs See 13+     See less Market Research Facebook Google Analytics Microsoft Office Public Speaking Google Adwords Leadership Teamwork Adobe Creative Suite Customer Service YouTube Prezi Time Management Blogging Social Media Marketing Windows Movie Maker Social Networking Advertising Sales Team Leadership Google+ ESRI Qualtrics Twitter Leadership Development Team Management Team Building Google Docs See 13+     See less Education Loyola University Chicago Bachelor of Business Administration (B.B.A.),  Marketing ,  Management ,  Operations Management ,  Film & Digital Media , Senior 2010  – 2015 Activities and Societies:  Quinlan School of Business ,  NCAA Division 1 Cross Country ,  NCAA Division 1 Track and Field Loyola University Chicago Bachelor of Business Administration (B.B.A.),  Marketing ,  Management ,  Operations Management ,  Film & Digital Media , Senior 2010  – 2015 Activities and Societies:  Quinlan School of Business ,  NCAA Division 1 Cross Country ,  NCAA Division 1 Track and Field Loyola University Chicago Bachelor of Business Administration (B.B.A.),  Marketing ,  Management ,  Operations Management ,  Film & Digital Media , Senior 2010  – 2015 Activities and Societies:  Quinlan School of Business ,  NCAA Division 1 Cross Country ,  NCAA Division 1 Track and Field Loyola University Chicago Bachelor of Business Administration (B.B.A.),  Marketing ,  Management ,  Operations Management ,  Film & Digital Media , Senior 2010  – 2015 Activities and Societies:  Quinlan School of Business ,  NCAA Division 1 Cross Country ,  NCAA Division 1 Track and Field Honors & Awards Loyola Athletic Tuition Grant Loyola University Chicago Rambler Leadership and Academic Scholarship Loyola University Chicago Deans List Loyola University Chicago Missouri Valley Conference: First Team All Conference Missouri Valley Conference November 2013 Missouri Valley Conference: Scholar-Athlete of the Week Selection Missouri Valley Confernce Missouri Valley Conference: Elite 18 Award Missouri Valley Conference November 2013 Missouri Valley Conference: Cross Country Scholar-Athlete Team Selection Missouri Valley Conference November 2013 Hippocrates Virtus Loyola University Chicago Sports Medicine April 2013 Horizon League: First Team All League Horizon League May 2013 Horizon League: Academic Honor Roll Horizon League Horizon League: Second Team All League Horizon League March 2013 Loyola Athletic Tuition Grant Loyola University Chicago Loyola Athletic Tuition Grant Loyola University Chicago Loyola Athletic Tuition Grant Loyola University Chicago Rambler Leadership and Academic Scholarship Loyola University Chicago Rambler Leadership and Academic Scholarship Loyola University Chicago Rambler Leadership and Academic Scholarship Loyola University Chicago Deans List Loyola University Chicago Deans List Loyola University Chicago Deans List Loyola University Chicago Missouri Valley Conference: First Team All Conference Missouri Valley Conference November 2013 Missouri Valley Conference: First Team All Conference Missouri Valley Conference November 2013 Missouri Valley Conference: First Team All Conference Missouri Valley Conference November 2013 Missouri Valley Conference: Scholar-Athlete of the Week Selection Missouri Valley Confernce Missouri Valley Conference: Scholar-Athlete of the Week Selection Missouri Valley Confernce Missouri Valley Conference: Scholar-Athlete of the Week Selection Missouri Valley Confernce Missouri Valley Conference: Elite 18 Award Missouri Valley Conference November 2013 Missouri Valley Conference: Elite 18 Award Missouri Valley Conference November 2013 Missouri Valley Conference: Elite 18 Award Missouri Valley Conference November 2013 Missouri Valley Conference: Cross Country Scholar-Athlete Team Selection Missouri Valley Conference November 2013 Missouri Valley Conference: Cross Country Scholar-Athlete Team Selection Missouri Valley Conference November 2013 Missouri Valley Conference: Cross Country Scholar-Athlete Team Selection Missouri Valley Conference November 2013 Hippocrates Virtus Loyola University Chicago Sports Medicine April 2013 Hippocrates Virtus Loyola University Chicago Sports Medicine April 2013 Hippocrates Virtus Loyola University Chicago Sports Medicine April 2013 Horizon League: First Team All League Horizon League May 2013 Horizon League: First Team All League Horizon League May 2013 Horizon League: First Team All League Horizon League May 2013 Horizon League: Academic Honor Roll Horizon League Horizon League: Academic Honor Roll Horizon League Horizon League: Academic Honor Roll Horizon League Horizon League: Second Team All League Horizon League March 2013 Horizon League: Second Team All League Horizon League March 2013 Horizon League: Second Team All League Horizon League March 2013 ", "Experience Tech Student Development Coordinator Google March 2014  – Present (1 year 6 months) Mountain View, California Recruiting Coordinator Google July 2013  –  March 2014  (9 months) Mountain View, California Intern Honey Bee Weddings April 2013  –  June 2013  (3 months) Chicago, IL Student Admission Council Coordinator Northwestern University Office of Undergraduate Admission August 2010  –  June 2013  (2 years 11 months) Youth Mentor Project SOAR at the YMCA September 2009  –  June 2013  (3 years 10 months) BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, CA People Operations Dept.  \nEngineering College Recruiting Team BOLD Intern Google June 2011  –  September 2011  (4 months) People Operations Dept. \nTechnical University Programs Team Camp Counselor The Village June 2009  –  August 2010  (1 year 3 months) Tech Student Development Coordinator Google March 2014  – Present (1 year 6 months) Mountain View, California Tech Student Development Coordinator Google March 2014  – Present (1 year 6 months) Mountain View, California Recruiting Coordinator Google July 2013  –  March 2014  (9 months) Mountain View, California Recruiting Coordinator Google July 2013  –  March 2014  (9 months) Mountain View, California Intern Honey Bee Weddings April 2013  –  June 2013  (3 months) Chicago, IL Intern Honey Bee Weddings April 2013  –  June 2013  (3 months) Chicago, IL Student Admission Council Coordinator Northwestern University Office of Undergraduate Admission August 2010  –  June 2013  (2 years 11 months) Student Admission Council Coordinator Northwestern University Office of Undergraduate Admission August 2010  –  June 2013  (2 years 11 months) Youth Mentor Project SOAR at the YMCA September 2009  –  June 2013  (3 years 10 months) Youth Mentor Project SOAR at the YMCA September 2009  –  June 2013  (3 years 10 months) BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, CA People Operations Dept.  \nEngineering College Recruiting Team BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, CA People Operations Dept.  \nEngineering College Recruiting Team BOLD Intern Google June 2011  –  September 2011  (4 months) People Operations Dept. \nTechnical University Programs Team BOLD Intern Google June 2011  –  September 2011  (4 months) People Operations Dept. \nTechnical University Programs Team Camp Counselor The Village June 2009  –  August 2010  (1 year 3 months) Camp Counselor The Village June 2009  –  August 2010  (1 year 3 months) Skills Communication Skills Event Planning Teamwork Team Leadership Google Docs Google Apps Microsoft Office Organization Performing Arts People Skills Facebook Social Media Social Networking Community Outreach Public Speaking Recruiting Spanish Microsoft Word SPSS Communication PowerPoint Research See 7+     See less Skills  Communication Skills Event Planning Teamwork Team Leadership Google Docs Google Apps Microsoft Office Organization Performing Arts People Skills Facebook Social Media Social Networking Community Outreach Public Speaking Recruiting Spanish Microsoft Word SPSS Communication PowerPoint Research See 7+     See less Communication Skills Event Planning Teamwork Team Leadership Google Docs Google Apps Microsoft Office Organization Performing Arts People Skills Facebook Social Media Social Networking Community Outreach Public Speaking Recruiting Spanish Microsoft Word SPSS Communication PowerPoint Research See 7+     See less Communication Skills Event Planning Teamwork Team Leadership Google Docs Google Apps Microsoft Office Organization Performing Arts People Skills Facebook Social Media Social Networking Community Outreach Public Speaking Recruiting Spanish Microsoft Word SPSS Communication PowerPoint Research See 7+     See less Education Northwestern University Bachelor of Science (B.S.),  Performance Studies , African American Studies 2009  – 2013 Activities and Societies:  President of Soul4Real Acapella Group ,  Co-President Project SOAR ,  Member of Lambda Pi Eta ,  NCDC Christopher House Volunteer Northwestern University Bachelor of Science (B.S.),  Performance Studies , African American Studies 2009  – 2013 Activities and Societies:  President of Soul4Real Acapella Group ,  Co-President Project SOAR ,  Member of Lambda Pi Eta ,  NCDC Christopher House Volunteer Northwestern University Bachelor of Science (B.S.),  Performance Studies , African American Studies 2009  – 2013 Activities and Societies:  President of Soul4Real Acapella Group ,  Co-President Project SOAR ,  Member of Lambda Pi Eta ,  NCDC Christopher House Volunteer Northwestern University Bachelor of Science (B.S.),  Performance Studies , African American Studies 2009  – 2013 Activities and Societies:  President of Soul4Real Acapella Group ,  Co-President Project SOAR ,  Member of Lambda Pi Eta ,  NCDC Christopher House Volunteer Honors & Awards Additional Honors & Awards Member of Lambda Pi Eta, National Communication Honor Society \n \nDean's List: Winter and Fall Quarters of 2011, Spring Quarter of 2012 Additional Honors & Awards Member of Lambda Pi Eta, National Communication Honor Society \n \nDean's List: Winter and Fall Quarters of 2011, Spring Quarter of 2012 Additional Honors & Awards Member of Lambda Pi Eta, National Communication Honor Society \n \nDean's List: Winter and Fall Quarters of 2011, Spring Quarter of 2012 Additional Honors & Awards Member of Lambda Pi Eta, National Communication Honor Society \n \nDean's List: Winter and Fall Quarters of 2011, Spring Quarter of 2012 ", "Experience Program Manager Google January 2015  – Present (8 months) Greater New York City Area Account Manager - CPG Google May 2014  –  December 2014  (8 months) Greater New York City Area Account Manager - Financial Services Google December 2013  –  June 2014  (7 months) Greater New York City Area Account Strategist - Mid-Market Advertising Google September 2012  –  January 2014  (1 year 5 months) San Francisco Bay Area -Managed over 180 of Google’s largest SMB accounts \n-Consulted clients on appropriate mix of Google’s Search, Display, Remarketing, Video and various other advertising solutions based on their business needs \n-Analyzed campaign performance and optimized for clients’ traffic or ROI goals \n-Utilized Google Analytics to identify further optimization opportunities \n-Liaised between client and technical support teams to resolve issues and clearly explain product details BOLD Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA -Developed and pitched a business plan with potential revenue increase of 30% within the media & entertainment vertical  \n-Forecasted revenue gains through analysis of internal data combined with external market research \n-Collaborated with senior management in Advertising Policy, Legal and Engineering teams Program Manager Google January 2015  – Present (8 months) Greater New York City Area Program Manager Google January 2015  – Present (8 months) Greater New York City Area Account Manager - CPG Google May 2014  –  December 2014  (8 months) Greater New York City Area Account Manager - CPG Google May 2014  –  December 2014  (8 months) Greater New York City Area Account Manager - Financial Services Google December 2013  –  June 2014  (7 months) Greater New York City Area Account Manager - Financial Services Google December 2013  –  June 2014  (7 months) Greater New York City Area Account Strategist - Mid-Market Advertising Google September 2012  –  January 2014  (1 year 5 months) San Francisco Bay Area -Managed over 180 of Google’s largest SMB accounts \n-Consulted clients on appropriate mix of Google’s Search, Display, Remarketing, Video and various other advertising solutions based on their business needs \n-Analyzed campaign performance and optimized for clients’ traffic or ROI goals \n-Utilized Google Analytics to identify further optimization opportunities \n-Liaised between client and technical support teams to resolve issues and clearly explain product details Account Strategist - Mid-Market Advertising Google September 2012  –  January 2014  (1 year 5 months) San Francisco Bay Area -Managed over 180 of Google’s largest SMB accounts \n-Consulted clients on appropriate mix of Google’s Search, Display, Remarketing, Video and various other advertising solutions based on their business needs \n-Analyzed campaign performance and optimized for clients’ traffic or ROI goals \n-Utilized Google Analytics to identify further optimization opportunities \n-Liaised between client and technical support teams to resolve issues and clearly explain product details BOLD Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA -Developed and pitched a business plan with potential revenue increase of 30% within the media & entertainment vertical  \n-Forecasted revenue gains through analysis of internal data combined with external market research \n-Collaborated with senior management in Advertising Policy, Legal and Engineering teams BOLD Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA -Developed and pitched a business plan with potential revenue increase of 30% within the media & entertainment vertical  \n-Forecasted revenue gains through analysis of internal data combined with external market research \n-Collaborated with senior management in Advertising Policy, Legal and Engineering teams Languages English Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Social Media Market Research Data Analysis Microsoft Excel Microsoft Office PowerPoint Digital Marketing Competitive Analysis Photoshop Research Google Adwords Google Analytics Microsoft Japanese Japanese business... Social Media Marketing Marketing Analysis See 3+     See less Skills  Social Media Market Research Data Analysis Microsoft Excel Microsoft Office PowerPoint Digital Marketing Competitive Analysis Photoshop Research Google Adwords Google Analytics Microsoft Japanese Japanese business... Social Media Marketing Marketing Analysis See 3+     See less Social Media Market Research Data Analysis Microsoft Excel Microsoft Office PowerPoint Digital Marketing Competitive Analysis Photoshop Research Google Adwords Google Analytics Microsoft Japanese Japanese business... Social Media Marketing Marketing Analysis See 3+     See less Social Media Market Research Data Analysis Microsoft Excel Microsoft Office PowerPoint Digital Marketing Competitive Analysis Photoshop Research Google Adwords Google Analytics Microsoft Japanese Japanese business... Social Media Marketing Marketing Analysis See 3+     See less Education University of Pennsylvania - The Wharton School Bachelor of Science (BS),  International Business ,  Marketing 2008  – 2012 University of Pennsylvania Bachelor of Arts (BA),  East Asian Studies 2008  – 2012 Phillips Academy Andover 2004  – 2008 University of Pennsylvania - The Wharton School Bachelor of Science (BS),  International Business ,  Marketing 2008  – 2012 University of Pennsylvania - The Wharton School Bachelor of Science (BS),  International Business ,  Marketing 2008  – 2012 University of Pennsylvania - The Wharton School Bachelor of Science (BS),  International Business ,  Marketing 2008  – 2012 University of Pennsylvania Bachelor of Arts (BA),  East Asian Studies 2008  – 2012 University of Pennsylvania Bachelor of Arts (BA),  East Asian Studies 2008  – 2012 University of Pennsylvania Bachelor of Arts (BA),  East Asian Studies 2008  – 2012 Phillips Academy Andover 2004  – 2008 Phillips Academy Andover 2004  – 2008 Phillips Academy Andover 2004  – 2008 Honors & Awards ", "Experience HR Generalist Google June 2015  – Present (3 months) HR Generalist Google June 2015  – Present (3 months) HR Generalist Google June 2015  – Present (3 months) Languages French Limited working proficiency Korean Professional working proficiency French Limited working proficiency Korean Professional working proficiency French Limited working proficiency Korean Professional working proficiency Limited working proficiency Professional working proficiency Skills Skills     Education Harvard College Bachelor of Arts (BA) 2011  – 2014 Defense Language Institute Associate of Arts (AA) 2007  – 2008 Harvard College Bachelor of Arts (BA) 2011  – 2014 Harvard College Bachelor of Arts (BA) 2011  – 2014 Harvard College Bachelor of Arts (BA) 2011  – 2014 Defense Language Institute Associate of Arts (AA) 2007  – 2008 Defense Language Institute Associate of Arts (AA) 2007  – 2008 Defense Language Institute Associate of Arts (AA) 2007  – 2008 ", "Summary I am a declared Finance major and Environmental Studies minor at Santa Clara University with a passion for sustainable business, social innovation, and food. I enjoy leading an active lifestyle pursued through trail running, skiing, backpacking, and numerous other outdoor activities. Summer of 2012 I worked at my hometown's local running specialty store where I developed an appreciation for small business practices. When I'm not doing meaningful work or exhausting my passion for the outdoors, I am probably in the kitchen cooking nutritional meals with wholesome ingredients to share with my family and friends. Summary I am a declared Finance major and Environmental Studies minor at Santa Clara University with a passion for sustainable business, social innovation, and food. I enjoy leading an active lifestyle pursued through trail running, skiing, backpacking, and numerous other outdoor activities. Summer of 2012 I worked at my hometown's local running specialty store where I developed an appreciation for small business practices. When I'm not doing meaningful work or exhausting my passion for the outdoors, I am probably in the kitchen cooking nutritional meals with wholesome ingredients to share with my family and friends. I am a declared Finance major and Environmental Studies minor at Santa Clara University with a passion for sustainable business, social innovation, and food. I enjoy leading an active lifestyle pursued through trail running, skiing, backpacking, and numerous other outdoor activities. Summer of 2012 I worked at my hometown's local running specialty store where I developed an appreciation for small business practices. When I'm not doing meaningful work or exhausting my passion for the outdoors, I am probably in the kitchen cooking nutritional meals with wholesome ingredients to share with my family and friends. I am a declared Finance major and Environmental Studies minor at Santa Clara University with a passion for sustainable business, social innovation, and food. I enjoy leading an active lifestyle pursued through trail running, skiing, backpacking, and numerous other outdoor activities. Summer of 2012 I worked at my hometown's local running specialty store where I developed an appreciation for small business practices. When I'm not doing meaningful work or exhausting my passion for the outdoors, I am probably in the kitchen cooking nutritional meals with wholesome ingredients to share with my family and friends. Experience SMB Associate Account Manager Google July 2015  – Present (2 months) Mountain View, Ca Student Engagement Intern - Center for Sustainability Santa Clara University September 2013  –  May 2015  (1 year 9 months) Santa Clara University Selective On Campus Sustainability Intern Program focused on Athletics and Recreations \n-Engage all athletes and fitness center users with an info-graphic series to encourage sustainable lifestyles \n-Oversee to student networks, one for off-campus students (LOCALS) to learn and collaborate on sustainability, and the other is for student clubs (SCOOPS) to learn about sustainability \n-Creatively collaborate with other interns to promote sustainability through campus & community outreach Small Business Sales - BOLD Intern Google June 2014  –  August 2014  (3 months) Mountain View, Ca -Helped 200 small businesses grow with AdWords through daily outbound calls \n-Pitched and recieved highest score in a competition with other interns on a project proposal detailing an advertising strategy for a bakery to compete in the mobile market Data Analyst Intern VB/Research December 2013  –  March 2014  (4 months) London, United Kingdom -Clean Energy Pipeline is an online source for news, data, and analytics about the Clean Energy sector \n-Tracked daily SEC filings, maintained the database, prepared a final report reviewing Wind Farms in the EU for 2013 Sports Marketing Intern Santa Clara University August 2013  –  December 2013  (5 months) Selective On Campus Sports Marketing Intern Program \n-Lead game day promotions and organize half time shows People Operations - BOLD Intern Google June 2013  –  August 2013  (3 months) Mountain View, CA Building Opportunities in Leadership and Development – People Operations Intern \n-Worked on a team that serves as a business partner to Google’s sales org to provide them learning and development opportunities \n-More specifically, my project included reducing team inefficiencies and redundancies by developing a communications strategy for our clients, standardizing processes, and utilizing new technology tools. Launched four websites for our clients \n-Participated in intro classes on html, dremel, and tenzing. Gained insight into the Googlers community Accounts Payables Student Assistant Santa Clara University September 2012  –  February 2013  (6 months) Santa Clara University, Ca -Reviewed and prepared invoices, resolved invoice discrepancies, maintained vendor files Sales Associate Forward Motion Sports June 2012  –  January 2013  (8 months) -Worked cash register, provided customers with a unique service experience, developed skills necessary to properly fit runners with shoes according to their foot structure, represented the store at local events and races \n-Developed an appreciation for small businesses and their unique business practices \n-Worked seasonally to help out at the store Google BOLD Immersion Program Google August 2012  –  August 2012  (1 month) Mountain View, California Google BOLD Immersion Program: Summer 2012 \nOne of 50 selected college freshmen; traveled to the Google Headquarters in Mountain View, Ca for a week-long glance at the \ncompany culture and opportunities within the tech-industry SMB Associate Account Manager Google July 2015  – Present (2 months) Mountain View, Ca SMB Associate Account Manager Google July 2015  – Present (2 months) Mountain View, Ca Student Engagement Intern - Center for Sustainability Santa Clara University September 2013  –  May 2015  (1 year 9 months) Santa Clara University Selective On Campus Sustainability Intern Program focused on Athletics and Recreations \n-Engage all athletes and fitness center users with an info-graphic series to encourage sustainable lifestyles \n-Oversee to student networks, one for off-campus students (LOCALS) to learn and collaborate on sustainability, and the other is for student clubs (SCOOPS) to learn about sustainability \n-Creatively collaborate with other interns to promote sustainability through campus & community outreach Student Engagement Intern - Center for Sustainability Santa Clara University September 2013  –  May 2015  (1 year 9 months) Santa Clara University Selective On Campus Sustainability Intern Program focused on Athletics and Recreations \n-Engage all athletes and fitness center users with an info-graphic series to encourage sustainable lifestyles \n-Oversee to student networks, one for off-campus students (LOCALS) to learn and collaborate on sustainability, and the other is for student clubs (SCOOPS) to learn about sustainability \n-Creatively collaborate with other interns to promote sustainability through campus & community outreach Small Business Sales - BOLD Intern Google June 2014  –  August 2014  (3 months) Mountain View, Ca -Helped 200 small businesses grow with AdWords through daily outbound calls \n-Pitched and recieved highest score in a competition with other interns on a project proposal detailing an advertising strategy for a bakery to compete in the mobile market Small Business Sales - BOLD Intern Google June 2014  –  August 2014  (3 months) Mountain View, Ca -Helped 200 small businesses grow with AdWords through daily outbound calls \n-Pitched and recieved highest score in a competition with other interns on a project proposal detailing an advertising strategy for a bakery to compete in the mobile market Data Analyst Intern VB/Research December 2013  –  March 2014  (4 months) London, United Kingdom -Clean Energy Pipeline is an online source for news, data, and analytics about the Clean Energy sector \n-Tracked daily SEC filings, maintained the database, prepared a final report reviewing Wind Farms in the EU for 2013 Data Analyst Intern VB/Research December 2013  –  March 2014  (4 months) London, United Kingdom -Clean Energy Pipeline is an online source for news, data, and analytics about the Clean Energy sector \n-Tracked daily SEC filings, maintained the database, prepared a final report reviewing Wind Farms in the EU for 2013 Sports Marketing Intern Santa Clara University August 2013  –  December 2013  (5 months) Selective On Campus Sports Marketing Intern Program \n-Lead game day promotions and organize half time shows Sports Marketing Intern Santa Clara University August 2013  –  December 2013  (5 months) Selective On Campus Sports Marketing Intern Program \n-Lead game day promotions and organize half time shows People Operations - BOLD Intern Google June 2013  –  August 2013  (3 months) Mountain View, CA Building Opportunities in Leadership and Development – People Operations Intern \n-Worked on a team that serves as a business partner to Google’s sales org to provide them learning and development opportunities \n-More specifically, my project included reducing team inefficiencies and redundancies by developing a communications strategy for our clients, standardizing processes, and utilizing new technology tools. Launched four websites for our clients \n-Participated in intro classes on html, dremel, and tenzing. Gained insight into the Googlers community People Operations - BOLD Intern Google June 2013  –  August 2013  (3 months) Mountain View, CA Building Opportunities in Leadership and Development – People Operations Intern \n-Worked on a team that serves as a business partner to Google’s sales org to provide them learning and development opportunities \n-More specifically, my project included reducing team inefficiencies and redundancies by developing a communications strategy for our clients, standardizing processes, and utilizing new technology tools. Launched four websites for our clients \n-Participated in intro classes on html, dremel, and tenzing. Gained insight into the Googlers community Accounts Payables Student Assistant Santa Clara University September 2012  –  February 2013  (6 months) Santa Clara University, Ca -Reviewed and prepared invoices, resolved invoice discrepancies, maintained vendor files Accounts Payables Student Assistant Santa Clara University September 2012  –  February 2013  (6 months) Santa Clara University, Ca -Reviewed and prepared invoices, resolved invoice discrepancies, maintained vendor files Sales Associate Forward Motion Sports June 2012  –  January 2013  (8 months) -Worked cash register, provided customers with a unique service experience, developed skills necessary to properly fit runners with shoes according to their foot structure, represented the store at local events and races \n-Developed an appreciation for small businesses and their unique business practices \n-Worked seasonally to help out at the store Sales Associate Forward Motion Sports June 2012  –  January 2013  (8 months) -Worked cash register, provided customers with a unique service experience, developed skills necessary to properly fit runners with shoes according to their foot structure, represented the store at local events and races \n-Developed an appreciation for small businesses and their unique business practices \n-Worked seasonally to help out at the store Google BOLD Immersion Program Google August 2012  –  August 2012  (1 month) Mountain View, California Google BOLD Immersion Program: Summer 2012 \nOne of 50 selected college freshmen; traveled to the Google Headquarters in Mountain View, Ca for a week-long glance at the \ncompany culture and opportunities within the tech-industry Google BOLD Immersion Program Google August 2012  –  August 2012  (1 month) Mountain View, California Google BOLD Immersion Program: Summer 2012 \nOne of 50 selected college freshmen; traveled to the Google Headquarters in Mountain View, Ca for a week-long glance at the \ncompany culture and opportunities within the tech-industry Skills Microsoft Excel Microsoft Word Sustainability iMovie Social Networking Highly personable Enjoy Working with... Financial Analysis Business Ethics Communication Skills Perform Well Under... Strategy Execution Creative Problem Solving Community Outreach Sales Data Analysis See 1+     See less Skills  Microsoft Excel Microsoft Word Sustainability iMovie Social Networking Highly personable Enjoy Working with... Financial Analysis Business Ethics Communication Skills Perform Well Under... Strategy Execution Creative Problem Solving Community Outreach Sales Data Analysis See 1+     See less Microsoft Excel Microsoft Word Sustainability iMovie Social Networking Highly personable Enjoy Working with... Financial Analysis Business Ethics Communication Skills Perform Well Under... Strategy Execution Creative Problem Solving Community Outreach Sales Data Analysis See 1+     See less Microsoft Excel Microsoft Word Sustainability iMovie Social Networking Highly personable Enjoy Working with... Financial Analysis Business Ethics Communication Skills Perform Well Under... Strategy Execution Creative Problem Solving Community Outreach Sales Data Analysis See 1+     See less Education Santa Clara University Finance 2011  – 2015 Minor in Environmental Studies Foundation for International Education 2013  – 2014 Study abroad in London England from Dec 2013 - Mar 2014.  Santa Clara University Division I Cross Country and Track Team Santa Clara University Finance 2011  – 2015 Minor in Environmental Studies Santa Clara University Finance 2011  – 2015 Minor in Environmental Studies Santa Clara University Finance 2011  – 2015 Minor in Environmental Studies Foundation for International Education 2013  – 2014 Study abroad in London England from Dec 2013 - Mar 2014.  Foundation for International Education 2013  – 2014 Study abroad in London England from Dec 2013 - Mar 2014.  Foundation for International Education 2013  – 2014 Study abroad in London England from Dec 2013 - Mar 2014.  Santa Clara University Division I Cross Country and Track Team Santa Clara University Division I Cross Country and Track Team Santa Clara University Division I Cross Country and Track Team Honors & Awards Women's Cross Country Newcomer of the Year Coach Felipe Montorro June 2012 Newcomer of the year award recipient as a walk-on freshman for Santa Clara University's division 1 cross-country team. Nike Engineering Design Challenge Santa Clara University School of Engineering and the Innovation & Entrepreneurship Program -Awarded the $1500 grand prize for the Nike+ Digital Sports Product Concept Challenge with out Safetracks product ideas using Nike+ Sensory technology for safer skiing, marketed product by creating the 90sec video \n- Entered into a multi-university storyboard competition with the same objectives as part of the Kern Entrepreneurship Education Network. Top teams of that competition may have the opportunity to present their work directly to Nike product developers (either virtually through a teleconferencing connection, or live) as part of the final judging round  \n-The video I created: https://www.youtube.com/watch?v=Ok4VwJfudsU  \n Women's Cross Country Newcomer of the Year Coach Felipe Montorro June 2012 Newcomer of the year award recipient as a walk-on freshman for Santa Clara University's division 1 cross-country team. Women's Cross Country Newcomer of the Year Coach Felipe Montorro June 2012 Newcomer of the year award recipient as a walk-on freshman for Santa Clara University's division 1 cross-country team. Women's Cross Country Newcomer of the Year Coach Felipe Montorro June 2012 Newcomer of the year award recipient as a walk-on freshman for Santa Clara University's division 1 cross-country team. Nike Engineering Design Challenge Santa Clara University School of Engineering and the Innovation & Entrepreneurship Program -Awarded the $1500 grand prize for the Nike+ Digital Sports Product Concept Challenge with out Safetracks product ideas using Nike+ Sensory technology for safer skiing, marketed product by creating the 90sec video \n- Entered into a multi-university storyboard competition with the same objectives as part of the Kern Entrepreneurship Education Network. Top teams of that competition may have the opportunity to present their work directly to Nike product developers (either virtually through a teleconferencing connection, or live) as part of the final judging round  \n-The video I created: https://www.youtube.com/watch?v=Ok4VwJfudsU  \n Nike Engineering Design Challenge Santa Clara University School of Engineering and the Innovation & Entrepreneurship Program -Awarded the $1500 grand prize for the Nike+ Digital Sports Product Concept Challenge with out Safetracks product ideas using Nike+ Sensory technology for safer skiing, marketed product by creating the 90sec video \n- Entered into a multi-university storyboard competition with the same objectives as part of the Kern Entrepreneurship Education Network. Top teams of that competition may have the opportunity to present their work directly to Nike product developers (either virtually through a teleconferencing connection, or live) as part of the final judging round  \n-The video I created: https://www.youtube.com/watch?v=Ok4VwJfudsU  \n Nike Engineering Design Challenge Santa Clara University School of Engineering and the Innovation & Entrepreneurship Program -Awarded the $1500 grand prize for the Nike+ Digital Sports Product Concept Challenge with out Safetracks product ideas using Nike+ Sensory technology for safer skiing, marketed product by creating the 90sec video \n- Entered into a multi-university storyboard competition with the same objectives as part of the Kern Entrepreneurship Education Network. Top teams of that competition may have the opportunity to present their work directly to Nike product developers (either virtually through a teleconferencing connection, or live) as part of the final judging round  \n-The video I created: https://www.youtube.com/watch?v=Ok4VwJfudsU  \n ", "Experience Benefits Specialist Google 2014  – Present (1 year) United States Partnered with company’s human resources department to create events and company-wide campaigns to educate and promote health and wellness amongst employees \n \nClosely worked with Google’s Latin American offices to create a Benefits department capable of supporting multiple countries \n \nManaged and provided support to events, including: flu vaccination clinics, healthcare plan seminars, and workshops and campaigns to combat smoking and sleep disorders \n Human Resources Coordinator - Ads & Commerce Google 2013  –  August 2014  (1 year) BOLD Intern, People Operations Google June 2012  –  August 2013  (1 year 3 months) Mountain View, CA Worked within the marketing division of Human Resources to create on-boarding materials for new hires, and conducted usability tests to determine effectiveness \n \nDeveloped and designed websites for the Marketing Human Resources department \n \nAssisted team with generalist work, such as the administration of bonuses and manager changes BOLD Intern, Online Media Sales Google June 2011  –  August 2011  (3 months) Mountain View, California Worked within the Display division of Online Media Sales to assist specialist and sales team in the development of client-facing materials for a high-priority summer initiative to engage mid-market advertisers \n \nRevamped and developed the team website for the Display division, and created a competitive analysis for the Google Display Network Legal Intern, The Honorable Zinora Mitchell-Rankin DC Superior Court September 2010  –  November 2010  (3 months) Washington, DC Organized applications and files to improve workflow for judge, as well as sat in on court cases, and observed court proceedings Instructor, Youth Leadership Academy for Girls Fulton County Government May 2010  –  November 2010  (7 months) Atlanta, GA Mentored and tutored young girls through a government-sponsored program in metropolitan Atlanta \n \nChaperoned day trips and oversaw drama performance for 8 year-olds Benefits Specialist Google 2014  – Present (1 year) United States Partnered with company’s human resources department to create events and company-wide campaigns to educate and promote health and wellness amongst employees \n \nClosely worked with Google’s Latin American offices to create a Benefits department capable of supporting multiple countries \n \nManaged and provided support to events, including: flu vaccination clinics, healthcare plan seminars, and workshops and campaigns to combat smoking and sleep disorders \n Benefits Specialist Google 2014  – Present (1 year) United States Partnered with company’s human resources department to create events and company-wide campaigns to educate and promote health and wellness amongst employees \n \nClosely worked with Google’s Latin American offices to create a Benefits department capable of supporting multiple countries \n \nManaged and provided support to events, including: flu vaccination clinics, healthcare plan seminars, and workshops and campaigns to combat smoking and sleep disorders \n Human Resources Coordinator - Ads & Commerce Google 2013  –  August 2014  (1 year) Human Resources Coordinator - Ads & Commerce Google 2013  –  August 2014  (1 year) BOLD Intern, People Operations Google June 2012  –  August 2013  (1 year 3 months) Mountain View, CA Worked within the marketing division of Human Resources to create on-boarding materials for new hires, and conducted usability tests to determine effectiveness \n \nDeveloped and designed websites for the Marketing Human Resources department \n \nAssisted team with generalist work, such as the administration of bonuses and manager changes BOLD Intern, People Operations Google June 2012  –  August 2013  (1 year 3 months) Mountain View, CA Worked within the marketing division of Human Resources to create on-boarding materials for new hires, and conducted usability tests to determine effectiveness \n \nDeveloped and designed websites for the Marketing Human Resources department \n \nAssisted team with generalist work, such as the administration of bonuses and manager changes BOLD Intern, Online Media Sales Google June 2011  –  August 2011  (3 months) Mountain View, California Worked within the Display division of Online Media Sales to assist specialist and sales team in the development of client-facing materials for a high-priority summer initiative to engage mid-market advertisers \n \nRevamped and developed the team website for the Display division, and created a competitive analysis for the Google Display Network BOLD Intern, Online Media Sales Google June 2011  –  August 2011  (3 months) Mountain View, California Worked within the Display division of Online Media Sales to assist specialist and sales team in the development of client-facing materials for a high-priority summer initiative to engage mid-market advertisers \n \nRevamped and developed the team website for the Display division, and created a competitive analysis for the Google Display Network Legal Intern, The Honorable Zinora Mitchell-Rankin DC Superior Court September 2010  –  November 2010  (3 months) Washington, DC Organized applications and files to improve workflow for judge, as well as sat in on court cases, and observed court proceedings Legal Intern, The Honorable Zinora Mitchell-Rankin DC Superior Court September 2010  –  November 2010  (3 months) Washington, DC Organized applications and files to improve workflow for judge, as well as sat in on court cases, and observed court proceedings Instructor, Youth Leadership Academy for Girls Fulton County Government May 2010  –  November 2010  (7 months) Atlanta, GA Mentored and tutored young girls through a government-sponsored program in metropolitan Atlanta \n \nChaperoned day trips and oversaw drama performance for 8 year-olds Instructor, Youth Leadership Academy for Girls Fulton County Government May 2010  –  November 2010  (7 months) Atlanta, GA Mentored and tutored young girls through a government-sponsored program in metropolitan Atlanta \n \nChaperoned day trips and oversaw drama performance for 8 year-olds Languages   Skills Public Speaking Time Management Communication Team Leadership Microsoft Office Sales Marketing Social Media Skills  Public Speaking Time Management Communication Team Leadership Microsoft Office Sales Marketing Social Media Public Speaking Time Management Communication Team Leadership Microsoft Office Sales Marketing Social Media Public Speaking Time Management Communication Team Leadership Microsoft Office Sales Marketing Social Media Education Howard University Communication and Culture,  Legal Communication 2009  – 2013 Activities and Societies:  Public Relations Chair ,  Howard University's Georgia Club; Student Ambassador ,  Howard University; Student Ambassador for the New York Times ,  Adopt-A-Team Program; Student Ambassador for Edelman ,  Adopt-A-Team Program Howard University Communication and Culture,  Legal Communication 2009  – 2013 Activities and Societies:  Public Relations Chair ,  Howard University's Georgia Club; Student Ambassador ,  Howard University; Student Ambassador for the New York Times ,  Adopt-A-Team Program; Student Ambassador for Edelman ,  Adopt-A-Team Program Howard University Communication and Culture,  Legal Communication 2009  – 2013 Activities and Societies:  Public Relations Chair ,  Howard University's Georgia Club; Student Ambassador ,  Howard University; Student Ambassador for the New York Times ,  Adopt-A-Team Program; Student Ambassador for Edelman ,  Adopt-A-Team Program Howard University Communication and Culture,  Legal Communication 2009  – 2013 Activities and Societies:  Public Relations Chair ,  Howard University's Georgia Club; Student Ambassador ,  Howard University; Student Ambassador for the New York Times ,  Adopt-A-Team Program; Student Ambassador for Edelman ,  Adopt-A-Team Program Honors & Awards ", "Experience Media Solutions Lead Google July 2015  – Present (2 months) Greater New York City Area Board Member New Conservatory Theatre Center January 2015  – Present (8 months) San Francisco Bay Area NCTC provides the San Francisco community with high quality youth education programming, Queer & Allied theatre, children's theatre, and new play development with emerging artists residencies to support local and national artists. Associate Account Manager Google 2014  –  July 2015  (1 year) Mountain View, CA BOLD Intern, Global Social Solutions Team (G+ Sales) Google May 2013  –  August 2013  (4 months) Mountain View • Designed and conducted original consumer research on social-local-mobile space to inform product strategy and implementation. \n \n• Created 18+ original product and design recommendations around a streamlined SoLoMo solution for consumers.  \n \n• Performed competitive analysis and sized business opportunities for “second screen” space; findings delivered to senior execs. BOLD Intern, New Products & Solutions Team Google May 2012  –  August 2012  (4 months) New York • Created “Zero-Dollar Guide to Campaigning” – comprehensive online strategy for politicians incorporating 18+ Google products.  \n \n• Researched all Google advertising solutions and created new framework for branding, DR and product launch strategies. \n \n• Developed three comprehensive narratives for PODs to present in top-level client meetings. Marketing Manager Personal Democracy Media May 2011  –  May 2012  (1 year 1 month) New York, New York • Developed and implemented business & marketing plan for #PdPlus, a new premium subscription service.  \n \n• Managed communications during company’s re-brand and created launch collateral including press releases and video.  \n \n• Planned first #PdFMeetup to increase brand awareness: resulted in 300+ people gathering in small groups in 50 cities globally. \n \n• Directed all social media and community outreach efforts; increased following and engagement by 40% across channels. iPhone Application Development Independent iPhone Application Developer/Contractor September 2009  –  May 2012  (2 years 9 months) • Founded and led development for two iPhone applications, “Classic Poetry” and “iOm.”  \n \n• One app featured as “New and Noteworthy” in App Store. Both were “Top 10 Paid Applications”; 15,000+ global downloads. \n \n• Conducted outreach and partnered with bloggers and local businesses to promote apps in innovative ways. \n \n• Managed ten-person team in India and oversaw projects from ideation to conception. Iterated based on consumer feedback. Independent Agent Talent Management September 2006  –  May 2012  (5 years 9 months) • Represented professional magicians and comedians in Los Angeles, New York, & Ohio.  \n \n• Handled PR, marketing, script development, online messaging & branding, scheduling for shows.  \n \n• Organized several 12-city lecture tours, as well as numerous local performances and lectures.  \n \n• Developed relationships with three top online magic distributors & published lecture notes, magic tricks, and DVDs. Owner LA Out Loud October 2008  –  September 2011  (3 years) Los Angeles arts, culture, and entertainment blog. Highlights various restaurants, events, clothing stores, deals/offers, etc. Comedian LA Entertainers October 2001  –  September 2010  (9 years) Media Solutions Lead Google July 2015  – Present (2 months) Greater New York City Area Media Solutions Lead Google July 2015  – Present (2 months) Greater New York City Area Board Member New Conservatory Theatre Center January 2015  – Present (8 months) San Francisco Bay Area NCTC provides the San Francisco community with high quality youth education programming, Queer & Allied theatre, children's theatre, and new play development with emerging artists residencies to support local and national artists. Board Member New Conservatory Theatre Center January 2015  – Present (8 months) San Francisco Bay Area NCTC provides the San Francisco community with high quality youth education programming, Queer & Allied theatre, children's theatre, and new play development with emerging artists residencies to support local and national artists. Associate Account Manager Google 2014  –  July 2015  (1 year) Mountain View, CA Associate Account Manager Google 2014  –  July 2015  (1 year) Mountain View, CA BOLD Intern, Global Social Solutions Team (G+ Sales) Google May 2013  –  August 2013  (4 months) Mountain View • Designed and conducted original consumer research on social-local-mobile space to inform product strategy and implementation. \n \n• Created 18+ original product and design recommendations around a streamlined SoLoMo solution for consumers.  \n \n• Performed competitive analysis and sized business opportunities for “second screen” space; findings delivered to senior execs. BOLD Intern, Global Social Solutions Team (G+ Sales) Google May 2013  –  August 2013  (4 months) Mountain View • Designed and conducted original consumer research on social-local-mobile space to inform product strategy and implementation. \n \n• Created 18+ original product and design recommendations around a streamlined SoLoMo solution for consumers.  \n \n• Performed competitive analysis and sized business opportunities for “second screen” space; findings delivered to senior execs. BOLD Intern, New Products & Solutions Team Google May 2012  –  August 2012  (4 months) New York • Created “Zero-Dollar Guide to Campaigning” – comprehensive online strategy for politicians incorporating 18+ Google products.  \n \n• Researched all Google advertising solutions and created new framework for branding, DR and product launch strategies. \n \n• Developed three comprehensive narratives for PODs to present in top-level client meetings. BOLD Intern, New Products & Solutions Team Google May 2012  –  August 2012  (4 months) New York • Created “Zero-Dollar Guide to Campaigning” – comprehensive online strategy for politicians incorporating 18+ Google products.  \n \n• Researched all Google advertising solutions and created new framework for branding, DR and product launch strategies. \n \n• Developed three comprehensive narratives for PODs to present in top-level client meetings. Marketing Manager Personal Democracy Media May 2011  –  May 2012  (1 year 1 month) New York, New York • Developed and implemented business & marketing plan for #PdPlus, a new premium subscription service.  \n \n• Managed communications during company’s re-brand and created launch collateral including press releases and video.  \n \n• Planned first #PdFMeetup to increase brand awareness: resulted in 300+ people gathering in small groups in 50 cities globally. \n \n• Directed all social media and community outreach efforts; increased following and engagement by 40% across channels. Marketing Manager Personal Democracy Media May 2011  –  May 2012  (1 year 1 month) New York, New York • Developed and implemented business & marketing plan for #PdPlus, a new premium subscription service.  \n \n• Managed communications during company’s re-brand and created launch collateral including press releases and video.  \n \n• Planned first #PdFMeetup to increase brand awareness: resulted in 300+ people gathering in small groups in 50 cities globally. \n \n• Directed all social media and community outreach efforts; increased following and engagement by 40% across channels. iPhone Application Development Independent iPhone Application Developer/Contractor September 2009  –  May 2012  (2 years 9 months) • Founded and led development for two iPhone applications, “Classic Poetry” and “iOm.”  \n \n• One app featured as “New and Noteworthy” in App Store. Both were “Top 10 Paid Applications”; 15,000+ global downloads. \n \n• Conducted outreach and partnered with bloggers and local businesses to promote apps in innovative ways. \n \n• Managed ten-person team in India and oversaw projects from ideation to conception. Iterated based on consumer feedback. iPhone Application Development Independent iPhone Application Developer/Contractor September 2009  –  May 2012  (2 years 9 months) • Founded and led development for two iPhone applications, “Classic Poetry” and “iOm.”  \n \n• One app featured as “New and Noteworthy” in App Store. Both were “Top 10 Paid Applications”; 15,000+ global downloads. \n \n• Conducted outreach and partnered with bloggers and local businesses to promote apps in innovative ways. \n \n• Managed ten-person team in India and oversaw projects from ideation to conception. Iterated based on consumer feedback. Independent Agent Talent Management September 2006  –  May 2012  (5 years 9 months) • Represented professional magicians and comedians in Los Angeles, New York, & Ohio.  \n \n• Handled PR, marketing, script development, online messaging & branding, scheduling for shows.  \n \n• Organized several 12-city lecture tours, as well as numerous local performances and lectures.  \n \n• Developed relationships with three top online magic distributors & published lecture notes, magic tricks, and DVDs. Independent Agent Talent Management September 2006  –  May 2012  (5 years 9 months) • Represented professional magicians and comedians in Los Angeles, New York, & Ohio.  \n \n• Handled PR, marketing, script development, online messaging & branding, scheduling for shows.  \n \n• Organized several 12-city lecture tours, as well as numerous local performances and lectures.  \n \n• Developed relationships with three top online magic distributors & published lecture notes, magic tricks, and DVDs. Owner LA Out Loud October 2008  –  September 2011  (3 years) Los Angeles arts, culture, and entertainment blog. Highlights various restaurants, events, clothing stores, deals/offers, etc. Owner LA Out Loud October 2008  –  September 2011  (3 years) Los Angeles arts, culture, and entertainment blog. Highlights various restaurants, events, clothing stores, deals/offers, etc. Comedian LA Entertainers October 2001  –  September 2010  (9 years) Comedian LA Entertainers October 2001  –  September 2010  (9 years) Languages Spanish Farsi Spanish Farsi Spanish Farsi Skills Social Media Marketing Creative Strategy Online Campaigns Marketing Strategy Facebook Blogging Event Management Promotions Online Advertising Entrepreneurship Advertising Skills  Social Media Marketing Creative Strategy Online Campaigns Marketing Strategy Facebook Blogging Event Management Promotions Online Advertising Entrepreneurship Advertising Social Media Marketing Creative Strategy Online Campaigns Marketing Strategy Facebook Blogging Event Management Promotions Online Advertising Entrepreneurship Advertising Social Media Marketing Creative Strategy Online Campaigns Marketing Strategy Facebook Blogging Event Management Promotions Online Advertising Entrepreneurship Advertising Education Harvard University Bachelor's,  Government & English 2010  – 2014 Activities and Societies:  The Harvard Advocate ,  Harvard University Institute of Politics ,  Conversations with Kirkland (Speaker Series) ,  Harvard University Stand-up Comics Society ,  Playwriting ,  Creative Writing & Campaigns ,  Tech for Change Harvard University Bachelor's,  Government & English 2010  – 2014 Activities and Societies:  The Harvard Advocate ,  Harvard University Institute of Politics ,  Conversations with Kirkland (Speaker Series) ,  Harvard University Stand-up Comics Society ,  Playwriting ,  Creative Writing & Campaigns ,  Tech for Change Harvard University Bachelor's,  Government & English 2010  – 2014 Activities and Societies:  The Harvard Advocate ,  Harvard University Institute of Politics ,  Conversations with Kirkland (Speaker Series) ,  Harvard University Stand-up Comics Society ,  Playwriting ,  Creative Writing & Campaigns ,  Tech for Change Harvard University Bachelor's,  Government & English 2010  – 2014 Activities and Societies:  The Harvard Advocate ,  Harvard University Institute of Politics ,  Conversations with Kirkland (Speaker Series) ,  Harvard University Stand-up Comics Society ,  Playwriting ,  Creative Writing & Campaigns ,  Tech for Change ", "Experience Program Manager Google May 2015  – Present (4 months) Mountain View, CA Financial Analyst Google August 2013  –  May 2015  (1 year 10 months) Mountain View, CA Consultant - The Clinton Foundation Stern Consulting Corps February 2013  –  May 2013  (4 months) New York, New York BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, California Intern Bain & Company October 2011  –  December 2011  (3 months) New York, New York BOLD Intern Google May 2011  –  August 2011  (4 months) New York, New York Student Assistant - Office of Budget Planning & Analysis NYU Stern School of Business September 2010  –  May 2011  (9 months) New York, New York Intern Dynamics Accounting Services May 2010  –  August 2010  (4 months) San Juan, Puerto Rico Program Manager Google May 2015  – Present (4 months) Mountain View, CA Program Manager Google May 2015  – Present (4 months) Mountain View, CA Financial Analyst Google August 2013  –  May 2015  (1 year 10 months) Mountain View, CA Financial Analyst Google August 2013  –  May 2015  (1 year 10 months) Mountain View, CA Consultant - The Clinton Foundation Stern Consulting Corps February 2013  –  May 2013  (4 months) New York, New York Consultant - The Clinton Foundation Stern Consulting Corps February 2013  –  May 2013  (4 months) New York, New York BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, California BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, California Intern Bain & Company October 2011  –  December 2011  (3 months) New York, New York Intern Bain & Company October 2011  –  December 2011  (3 months) New York, New York BOLD Intern Google May 2011  –  August 2011  (4 months) New York, New York BOLD Intern Google May 2011  –  August 2011  (4 months) New York, New York Student Assistant - Office of Budget Planning & Analysis NYU Stern School of Business September 2010  –  May 2011  (9 months) New York, New York Student Assistant - Office of Budget Planning & Analysis NYU Stern School of Business September 2010  –  May 2011  (9 months) New York, New York Intern Dynamics Accounting Services May 2010  –  August 2010  (4 months) San Juan, Puerto Rico Intern Dynamics Accounting Services May 2010  –  August 2010  (4 months) San Juan, Puerto Rico Languages   Skills Skills     Education New York University - Leonard N. Stern School of Business Bachelor of Science (BS) 2009  – 2013 The University of Hong Kong International Business Exchange Program 2012 Baldwin School of Puerto Rico 2009 New York University - Leonard N. Stern School of Business Bachelor of Science (BS) 2009  – 2013 New York University - Leonard N. Stern School of Business Bachelor of Science (BS) 2009  – 2013 New York University - Leonard N. Stern School of Business Bachelor of Science (BS) 2009  – 2013 The University of Hong Kong International Business Exchange Program 2012 The University of Hong Kong International Business Exchange Program 2012 The University of Hong Kong International Business Exchange Program 2012 Baldwin School of Puerto Rico 2009 Baldwin School of Puerto Rico 2009 Baldwin School of Puerto Rico 2009 Honors & Awards ", "Summary Passionate about improving healthcare delivery and equality in the US and the world. Jane of all trades and a voracious consumer of knowledge. Summary Passionate about improving healthcare delivery and equality in the US and the world. Jane of all trades and a voracious consumer of knowledge. Passionate about improving healthcare delivery and equality in the US and the world. Jane of all trades and a voracious consumer of knowledge. Passionate about improving healthcare delivery and equality in the US and the world. Jane of all trades and a voracious consumer of knowledge. Experience Communications Specialist Google December 2012  – Present (2 years 9 months) Mountain View, CA People Operations Communications & Employment Branding People Operations Rotational Associate Google September 2010  –  December 2012  (2 years 4 months) Rotation I: HR Business Partner - Product Management \nRotation II: Compensation & Performance Management Analyst \nRotation III: Employment Branding & Communications Associate BOLD Intern - People Operations Google June 2009  –  August 2009  (3 months) People Operations intern: General & Administrative recruiting BOLD Intern - Online Sales & Operations Google May 2008  –  August 2008  (4 months) Intern in Online Sales and Operations, Adwords Optimization Communications Specialist Google December 2012  – Present (2 years 9 months) Mountain View, CA People Operations Communications & Employment Branding Communications Specialist Google December 2012  – Present (2 years 9 months) Mountain View, CA People Operations Communications & Employment Branding People Operations Rotational Associate Google September 2010  –  December 2012  (2 years 4 months) Rotation I: HR Business Partner - Product Management \nRotation II: Compensation & Performance Management Analyst \nRotation III: Employment Branding & Communications Associate People Operations Rotational Associate Google September 2010  –  December 2012  (2 years 4 months) Rotation I: HR Business Partner - Product Management \nRotation II: Compensation & Performance Management Analyst \nRotation III: Employment Branding & Communications Associate BOLD Intern - People Operations Google June 2009  –  August 2009  (3 months) People Operations intern: General & Administrative recruiting BOLD Intern - People Operations Google June 2009  –  August 2009  (3 months) People Operations intern: General & Administrative recruiting BOLD Intern - Online Sales & Operations Google May 2008  –  August 2008  (4 months) Intern in Online Sales and Operations, Adwords Optimization BOLD Intern - Online Sales & Operations Google May 2008  –  August 2008  (4 months) Intern in Online Sales and Operations, Adwords Optimization Languages English Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Recruiting Performance Management Marketing Strategy Sales Compensation Research Project Management Designs Healthcare Management Public Health Employment Brand Communications Adaptability Economics Mentoring Microsoft Excel SQL Analytics Employer Branding Strategy Data Analysis Public Speaking Leadership Communication Marketing Social Media See 11+     See less Skills  Recruiting Performance Management Marketing Strategy Sales Compensation Research Project Management Designs Healthcare Management Public Health Employment Brand Communications Adaptability Economics Mentoring Microsoft Excel SQL Analytics Employer Branding Strategy Data Analysis Public Speaking Leadership Communication Marketing Social Media See 11+     See less Recruiting Performance Management Marketing Strategy Sales Compensation Research Project Management Designs Healthcare Management Public Health Employment Brand Communications Adaptability Economics Mentoring Microsoft Excel SQL Analytics Employer Branding Strategy Data Analysis Public Speaking Leadership Communication Marketing Social Media See 11+     See less Recruiting Performance Management Marketing Strategy Sales Compensation Research Project Management Designs Healthcare Management Public Health Employment Brand Communications Adaptability Economics Mentoring Microsoft Excel SQL Analytics Employer Branding Strategy Data Analysis Public Speaking Leadership Communication Marketing Social Media See 11+     See less Education University of Pennsylvania - The Wharton School B.S., Economics,  Healthcare Management and Policy 2006  – 2010 Activities and Societies:  The Daily Pennsylvanian - Marketing ,  Civic House - PennCORP ,  Netter Center for Community Partnerships UC Berkeley Post-Baccalaureate Pre-Health Program 2012 University of Pennsylvania - The Wharton School B.S., Economics,  Healthcare Management and Policy 2006  – 2010 Activities and Societies:  The Daily Pennsylvanian - Marketing ,  Civic House - PennCORP ,  Netter Center for Community Partnerships University of Pennsylvania - The Wharton School B.S., Economics,  Healthcare Management and Policy 2006  – 2010 Activities and Societies:  The Daily Pennsylvanian - Marketing ,  Civic House - PennCORP ,  Netter Center for Community Partnerships University of Pennsylvania - The Wharton School B.S., Economics,  Healthcare Management and Policy 2006  – 2010 Activities and Societies:  The Daily Pennsylvanian - Marketing ,  Civic House - PennCORP ,  Netter Center for Community Partnerships UC Berkeley Post-Baccalaureate Pre-Health Program 2012 UC Berkeley Post-Baccalaureate Pre-Health Program 2012 UC Berkeley Post-Baccalaureate Pre-Health Program 2012 ", "Experience Associate Account Strategist Google June 2015  – Present (3 months) Mountain View, CA Director, Social Planning and Events Committee to Represent Undergraduate Minorities (SPEC-TRUM) University of Pennsylvania May 2014  –  May 2015  (1 year 1 month) Greater Philadelphia Area Determine allocation of $32,000 budget for sponsorship of minority-targeted events \n \nDetermine allocation of $60,000 budget for talent, production and marketing for semesterly concerts hosted by the organization \n \nWork with agencies to negotiate pricing and secure talent for fall and spring productions  \n \nManage ticket sales, marketing and day-of-show production for events hosted by the organization Social Media Intern University of Pennsylvania Center for Africana Studies September 2014  –  December 2014  (4 months) Greater Philadelphia Area Manage the organization's Facebook and Twitter profiles, as well as publish content on https://africana.sas.upenn.edu/ Career Prep Fellow Management Leadership for Tomorrow July 2013  –  December 2014  (1 year 6 months) Washington D.C. Metro Area Selected as one of 230 for 18-month professional development program for high-achieving diverse talent \n \nComplete business case studies and intensive projects to hone analytical, quantitative and communication skills BOLD Intern Google June 2014  –  August 2014  (3 months) Mountain View, CA Assisted with optimizing internal marketing for the Talks at Google program by assessing target audiences of over 30 events and creating specialized communications for those demographics \n \nCreated strategy for global networking and exposure to senior leadership that will impact about 200 new hires in Google’s Finance department annually \n \nDrafted proposal for eliminating discrepancies between job descriptions, responsibilities and compensation within the Finance department Foreign Correspondent Pink Pangea August 2013  –  December 2013  (5 months) Paris, France Wrote biweekly articles for women-focused travel site on topics ranging from street safety to leisure in Paris, France \n \nStarred in video segment discussing abroad experience which was featured on partner site's YouTube Channel BOLD Intern Google June 2013  –  August 2013  (3 months) Mountain View, CA Created and edited content, and recommended possible user interfaces for the North America Expectant Parents’ Hub, an internal resource site which garners nearly 2,000 unique visits per year \n \nAnalyzed costs, suggested possible models, and drafted a proposal for a housekeeping pilot program for Google employees in the Bay area Associate Online Editor The Daily Pennsylvanian January 2013  –  May 2013  (5 months) Greater Philadelphia Area Managed the publication’s official Twitter and Facebook accounts, which have respectively 11,800 and 3,759 followers \n \nAnalyzed effectiveness of various online marketing strategies using Twitter and Google Analytics Research Intern Fox Leadership Institute July 2012  –  May 2013  (11 months) Greater Philadelphia Area Researched faith-based prisoner reentry and intergenerational conflict within the African-American church at the Program for Research on Religion and Urban Civil Society  \n \nPrepared and edited documents for peer-reviewed journal submission and publication Associate Account Strategist Google June 2015  – Present (3 months) Mountain View, CA Associate Account Strategist Google June 2015  – Present (3 months) Mountain View, CA Director, Social Planning and Events Committee to Represent Undergraduate Minorities (SPEC-TRUM) University of Pennsylvania May 2014  –  May 2015  (1 year 1 month) Greater Philadelphia Area Determine allocation of $32,000 budget for sponsorship of minority-targeted events \n \nDetermine allocation of $60,000 budget for talent, production and marketing for semesterly concerts hosted by the organization \n \nWork with agencies to negotiate pricing and secure talent for fall and spring productions  \n \nManage ticket sales, marketing and day-of-show production for events hosted by the organization Director, Social Planning and Events Committee to Represent Undergraduate Minorities (SPEC-TRUM) University of Pennsylvania May 2014  –  May 2015  (1 year 1 month) Greater Philadelphia Area Determine allocation of $32,000 budget for sponsorship of minority-targeted events \n \nDetermine allocation of $60,000 budget for talent, production and marketing for semesterly concerts hosted by the organization \n \nWork with agencies to negotiate pricing and secure talent for fall and spring productions  \n \nManage ticket sales, marketing and day-of-show production for events hosted by the organization Social Media Intern University of Pennsylvania Center for Africana Studies September 2014  –  December 2014  (4 months) Greater Philadelphia Area Manage the organization's Facebook and Twitter profiles, as well as publish content on https://africana.sas.upenn.edu/ Social Media Intern University of Pennsylvania Center for Africana Studies September 2014  –  December 2014  (4 months) Greater Philadelphia Area Manage the organization's Facebook and Twitter profiles, as well as publish content on https://africana.sas.upenn.edu/ Career Prep Fellow Management Leadership for Tomorrow July 2013  –  December 2014  (1 year 6 months) Washington D.C. Metro Area Selected as one of 230 for 18-month professional development program for high-achieving diverse talent \n \nComplete business case studies and intensive projects to hone analytical, quantitative and communication skills Career Prep Fellow Management Leadership for Tomorrow July 2013  –  December 2014  (1 year 6 months) Washington D.C. Metro Area Selected as one of 230 for 18-month professional development program for high-achieving diverse talent \n \nComplete business case studies and intensive projects to hone analytical, quantitative and communication skills BOLD Intern Google June 2014  –  August 2014  (3 months) Mountain View, CA Assisted with optimizing internal marketing for the Talks at Google program by assessing target audiences of over 30 events and creating specialized communications for those demographics \n \nCreated strategy for global networking and exposure to senior leadership that will impact about 200 new hires in Google’s Finance department annually \n \nDrafted proposal for eliminating discrepancies between job descriptions, responsibilities and compensation within the Finance department BOLD Intern Google June 2014  –  August 2014  (3 months) Mountain View, CA Assisted with optimizing internal marketing for the Talks at Google program by assessing target audiences of over 30 events and creating specialized communications for those demographics \n \nCreated strategy for global networking and exposure to senior leadership that will impact about 200 new hires in Google’s Finance department annually \n \nDrafted proposal for eliminating discrepancies between job descriptions, responsibilities and compensation within the Finance department Foreign Correspondent Pink Pangea August 2013  –  December 2013  (5 months) Paris, France Wrote biweekly articles for women-focused travel site on topics ranging from street safety to leisure in Paris, France \n \nStarred in video segment discussing abroad experience which was featured on partner site's YouTube Channel Foreign Correspondent Pink Pangea August 2013  –  December 2013  (5 months) Paris, France Wrote biweekly articles for women-focused travel site on topics ranging from street safety to leisure in Paris, France \n \nStarred in video segment discussing abroad experience which was featured on partner site's YouTube Channel BOLD Intern Google June 2013  –  August 2013  (3 months) Mountain View, CA Created and edited content, and recommended possible user interfaces for the North America Expectant Parents’ Hub, an internal resource site which garners nearly 2,000 unique visits per year \n \nAnalyzed costs, suggested possible models, and drafted a proposal for a housekeeping pilot program for Google employees in the Bay area BOLD Intern Google June 2013  –  August 2013  (3 months) Mountain View, CA Created and edited content, and recommended possible user interfaces for the North America Expectant Parents’ Hub, an internal resource site which garners nearly 2,000 unique visits per year \n \nAnalyzed costs, suggested possible models, and drafted a proposal for a housekeeping pilot program for Google employees in the Bay area Associate Online Editor The Daily Pennsylvanian January 2013  –  May 2013  (5 months) Greater Philadelphia Area Managed the publication’s official Twitter and Facebook accounts, which have respectively 11,800 and 3,759 followers \n \nAnalyzed effectiveness of various online marketing strategies using Twitter and Google Analytics Associate Online Editor The Daily Pennsylvanian January 2013  –  May 2013  (5 months) Greater Philadelphia Area Managed the publication’s official Twitter and Facebook accounts, which have respectively 11,800 and 3,759 followers \n \nAnalyzed effectiveness of various online marketing strategies using Twitter and Google Analytics Research Intern Fox Leadership Institute July 2012  –  May 2013  (11 months) Greater Philadelphia Area Researched faith-based prisoner reentry and intergenerational conflict within the African-American church at the Program for Research on Religion and Urban Civil Society  \n \nPrepared and edited documents for peer-reviewed journal submission and publication Research Intern Fox Leadership Institute July 2012  –  May 2013  (11 months) Greater Philadelphia Area Researched faith-based prisoner reentry and intergenerational conflict within the African-American church at the Program for Research on Religion and Urban Civil Society  \n \nPrepared and edited documents for peer-reviewed journal submission and publication Languages English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Microsoft Office Social Media Marketing Music Community Outreach Event Management Event Planning Team Building Public Speaking Research Nonprofits Data Analysis Management PowerPoint Social Media Leadership Microsoft Excel Editing Facebook See 3+     See less Skills  Microsoft Office Social Media Marketing Music Community Outreach Event Management Event Planning Team Building Public Speaking Research Nonprofits Data Analysis Management PowerPoint Social Media Leadership Microsoft Excel Editing Facebook See 3+     See less Microsoft Office Social Media Marketing Music Community Outreach Event Management Event Planning Team Building Public Speaking Research Nonprofits Data Analysis Management PowerPoint Social Media Leadership Microsoft Excel Editing Facebook See 3+     See less Microsoft Office Social Media Marketing Music Community Outreach Event Management Event Planning Team Building Public Speaking Research Nonprofits Data Analysis Management PowerPoint Social Media Leadership Microsoft Excel Editing Facebook See 3+     See less Education University of Pennsylvania BA,  Politics ,  Philosophy ,  Economics 2011  – 2015 Université Paris Sorbonne (Paris IV) Sustainability Studies 2013  – 2013 Study abroad student at Columbia University's Reid Hall program in Paris Academic and Performing Arts Complex (APAC) Classical Piano; Theatre 2008  – 2011 Arts complex for students in the Jackson, Miss. Metro Area studying dance, theatre, visual art or music William B. Murrah High School High School Diploma 2008  – 2011 Jim Hill High School 2007  – 2008 Activities and Societies:  International Baccalaureate Program University of Pennsylvania BA,  Politics ,  Philosophy ,  Economics 2011  – 2015 University of Pennsylvania BA,  Politics ,  Philosophy ,  Economics 2011  – 2015 University of Pennsylvania BA,  Politics ,  Philosophy ,  Economics 2011  – 2015 Université Paris Sorbonne (Paris IV) Sustainability Studies 2013  – 2013 Study abroad student at Columbia University's Reid Hall program in Paris Université Paris Sorbonne (Paris IV) Sustainability Studies 2013  – 2013 Study abroad student at Columbia University's Reid Hall program in Paris Université Paris Sorbonne (Paris IV) Sustainability Studies 2013  – 2013 Study abroad student at Columbia University's Reid Hall program in Paris Academic and Performing Arts Complex (APAC) Classical Piano; Theatre 2008  – 2011 Arts complex for students in the Jackson, Miss. Metro Area studying dance, theatre, visual art or music Academic and Performing Arts Complex (APAC) Classical Piano; Theatre 2008  – 2011 Arts complex for students in the Jackson, Miss. Metro Area studying dance, theatre, visual art or music Academic and Performing Arts Complex (APAC) Classical Piano; Theatre 2008  – 2011 Arts complex for students in the Jackson, Miss. Metro Area studying dance, theatre, visual art or music William B. Murrah High School High School Diploma 2008  – 2011 William B. Murrah High School High School Diploma 2008  – 2011 William B. Murrah High School High School Diploma 2008  – 2011 Jim Hill High School 2007  – 2008 Activities and Societies:  International Baccalaureate Program Jim Hill High School 2007  – 2008 Activities and Societies:  International Baccalaureate Program Jim Hill High School 2007  – 2008 Activities and Societies:  International Baccalaureate Program Honors & Awards APAC Performance Award Academic and Performing Arts Complex May 2011 Awarded to best musician in the department based on theory, technical and performance skills Gladys P. Norris National Piano Festival Superior Pianist Jackson State University Music Department February 2011 Awarded to musicians who demonstrate exceptional technical and performance ability APAC Performance Award Academic and Performing Arts Complex May 2011 Awarded to best musician in the department based on theory, technical and performance skills APAC Performance Award Academic and Performing Arts Complex May 2011 Awarded to best musician in the department based on theory, technical and performance skills APAC Performance Award Academic and Performing Arts Complex May 2011 Awarded to best musician in the department based on theory, technical and performance skills Gladys P. Norris National Piano Festival Superior Pianist Jackson State University Music Department February 2011 Awarded to musicians who demonstrate exceptional technical and performance ability Gladys P. Norris National Piano Festival Superior Pianist Jackson State University Music Department February 2011 Awarded to musicians who demonstrate exceptional technical and performance ability Gladys P. Norris National Piano Festival Superior Pianist Jackson State University Music Department February 2011 Awarded to musicians who demonstrate exceptional technical and performance ability ", "Experience Operations Coordinator Google June 2014  – Present (1 year 3 months) Mountain View, California Teaching Assistant Robert H. Smith School of Business September 2013  –  May 2014  (9 months) College Park, Maryland Was selected to facilitate weekly discussions and assist teaching students how to design and develop cross-disciplinary business applications in Microsoft Visual Studio via Visual Basic Advanced in one of the University of Maryland’s most rigorous courses for Information System majors Google Student Ambassador Google August 2013  –  May 2014  (10 months) College Park, Maryland The Google Student Ambassador program consists of students Google has met over the years through mutual passion for technology and innovation. The Google Student Ambassador Program is an opportunity for students to act as liaisons between Google and their universities. Duties as an ambassador include: \n \nDrive product engagement on and off campus through events and workshops \n \nAct as a liaison between the University of Maryland and the Google team \n \nAttend the Google Summit in Mountain View, California to gain exposure to products, the company culture, and to network with experts BOLD Intern (Google People Services - Operations) Google June 2013  –  August 2013  (3 months) Mountain View, California Streamlined day-to-day coordination processes, built internal tools, and shared knowledge through leading Lunch and Learn sessions and writing key documentation for the People Development Operations cluster within Google People Services (GPS)  \n \nDesigned and built a streamlined information system utilizing Google Apps via Google Apps Script for the Talks at Google program which led to over 60% coordination time savings and higher quality data for reporting standards \n \nDesigned and built six process automation scripts for the GPS Operations team including one which will save over 100 hours per quarter Business Analyst Intern Google September 2012  –  December 2012  (4 months) Mountain View, California Streamlined business processes, built internal tools, and performed analytics for the Sales & Merchant Solutions team within Google Offers  \n \nAutomated and analyzed weekly email distribution check report (which cut down the manual process by four hours per week) and presented insights to engineering targeting team which improved the accuracy of the email targeting distribution system \n \nDesigned and built partner level reporting dashboards to enable the Strategic Partner Managers to gain better insight on deal partner performance and overall health of the program to strategize their business development needs Information Technology Leadership Program Intern GE Capital June 2012  –  August 2012  (3 months) United States Worked on system integration and data warehousing solutions as a Business Analyst for GE Capital Treasury \n \nManaged three separate IT related projects within the Foreign Exchange Simplification team. \n \nHelped Bridge 92% of the data gaps to give the operational accounting team reporting data 90% faster Six Sigma Strategy Consultant Consulted for Bechtel Corporation January 2012  –  May 2012  (5 months) Earned Greenbelt Certification by improving Bechtel Corporation's Standard Work Process Procedure system to enable them to reduce project completion time and rework costs. Operations Assistant Maryland Operations September 2010  –  May 2011  (9 months) College Park, Maryland Worked at University of Maryland managing/working within teams of two to eight members, setting up and breaking down entertainment related events.  \n \nResponsibilities include: working efficiently and effectively in teams, \nrunning various sporting events, and moving equipment around the campus Operations Coordinator Google June 2014  – Present (1 year 3 months) Mountain View, California Operations Coordinator Google June 2014  – Present (1 year 3 months) Mountain View, California Teaching Assistant Robert H. Smith School of Business September 2013  –  May 2014  (9 months) College Park, Maryland Was selected to facilitate weekly discussions and assist teaching students how to design and develop cross-disciplinary business applications in Microsoft Visual Studio via Visual Basic Advanced in one of the University of Maryland’s most rigorous courses for Information System majors Teaching Assistant Robert H. Smith School of Business September 2013  –  May 2014  (9 months) College Park, Maryland Was selected to facilitate weekly discussions and assist teaching students how to design and develop cross-disciplinary business applications in Microsoft Visual Studio via Visual Basic Advanced in one of the University of Maryland’s most rigorous courses for Information System majors Google Student Ambassador Google August 2013  –  May 2014  (10 months) College Park, Maryland The Google Student Ambassador program consists of students Google has met over the years through mutual passion for technology and innovation. The Google Student Ambassador Program is an opportunity for students to act as liaisons between Google and their universities. Duties as an ambassador include: \n \nDrive product engagement on and off campus through events and workshops \n \nAct as a liaison between the University of Maryland and the Google team \n \nAttend the Google Summit in Mountain View, California to gain exposure to products, the company culture, and to network with experts Google Student Ambassador Google August 2013  –  May 2014  (10 months) College Park, Maryland The Google Student Ambassador program consists of students Google has met over the years through mutual passion for technology and innovation. The Google Student Ambassador Program is an opportunity for students to act as liaisons between Google and their universities. Duties as an ambassador include: \n \nDrive product engagement on and off campus through events and workshops \n \nAct as a liaison between the University of Maryland and the Google team \n \nAttend the Google Summit in Mountain View, California to gain exposure to products, the company culture, and to network with experts BOLD Intern (Google People Services - Operations) Google June 2013  –  August 2013  (3 months) Mountain View, California Streamlined day-to-day coordination processes, built internal tools, and shared knowledge through leading Lunch and Learn sessions and writing key documentation for the People Development Operations cluster within Google People Services (GPS)  \n \nDesigned and built a streamlined information system utilizing Google Apps via Google Apps Script for the Talks at Google program which led to over 60% coordination time savings and higher quality data for reporting standards \n \nDesigned and built six process automation scripts for the GPS Operations team including one which will save over 100 hours per quarter BOLD Intern (Google People Services - Operations) Google June 2013  –  August 2013  (3 months) Mountain View, California Streamlined day-to-day coordination processes, built internal tools, and shared knowledge through leading Lunch and Learn sessions and writing key documentation for the People Development Operations cluster within Google People Services (GPS)  \n \nDesigned and built a streamlined information system utilizing Google Apps via Google Apps Script for the Talks at Google program which led to over 60% coordination time savings and higher quality data for reporting standards \n \nDesigned and built six process automation scripts for the GPS Operations team including one which will save over 100 hours per quarter Business Analyst Intern Google September 2012  –  December 2012  (4 months) Mountain View, California Streamlined business processes, built internal tools, and performed analytics for the Sales & Merchant Solutions team within Google Offers  \n \nAutomated and analyzed weekly email distribution check report (which cut down the manual process by four hours per week) and presented insights to engineering targeting team which improved the accuracy of the email targeting distribution system \n \nDesigned and built partner level reporting dashboards to enable the Strategic Partner Managers to gain better insight on deal partner performance and overall health of the program to strategize their business development needs Business Analyst Intern Google September 2012  –  December 2012  (4 months) Mountain View, California Streamlined business processes, built internal tools, and performed analytics for the Sales & Merchant Solutions team within Google Offers  \n \nAutomated and analyzed weekly email distribution check report (which cut down the manual process by four hours per week) and presented insights to engineering targeting team which improved the accuracy of the email targeting distribution system \n \nDesigned and built partner level reporting dashboards to enable the Strategic Partner Managers to gain better insight on deal partner performance and overall health of the program to strategize their business development needs Information Technology Leadership Program Intern GE Capital June 2012  –  August 2012  (3 months) United States Worked on system integration and data warehousing solutions as a Business Analyst for GE Capital Treasury \n \nManaged three separate IT related projects within the Foreign Exchange Simplification team. \n \nHelped Bridge 92% of the data gaps to give the operational accounting team reporting data 90% faster Information Technology Leadership Program Intern GE Capital June 2012  –  August 2012  (3 months) United States Worked on system integration and data warehousing solutions as a Business Analyst for GE Capital Treasury \n \nManaged three separate IT related projects within the Foreign Exchange Simplification team. \n \nHelped Bridge 92% of the data gaps to give the operational accounting team reporting data 90% faster Six Sigma Strategy Consultant Consulted for Bechtel Corporation January 2012  –  May 2012  (5 months) Earned Greenbelt Certification by improving Bechtel Corporation's Standard Work Process Procedure system to enable them to reduce project completion time and rework costs. Six Sigma Strategy Consultant Consulted for Bechtel Corporation January 2012  –  May 2012  (5 months) Earned Greenbelt Certification by improving Bechtel Corporation's Standard Work Process Procedure system to enable them to reduce project completion time and rework costs. Operations Assistant Maryland Operations September 2010  –  May 2011  (9 months) College Park, Maryland Worked at University of Maryland managing/working within teams of two to eight members, setting up and breaking down entertainment related events.  \n \nResponsibilities include: working efficiently and effectively in teams, \nrunning various sporting events, and moving equipment around the campus Operations Assistant Maryland Operations September 2010  –  May 2011  (9 months) College Park, Maryland Worked at University of Maryland managing/working within teams of two to eight members, setting up and breaking down entertainment related events.  \n \nResponsibilities include: working efficiently and effectively in teams, \nrunning various sporting events, and moving equipment around the campus Languages   Skills Microsoft Office Microsoft Excel Microsoft Word SQL ABI Business Analysis Financial Accounting Cost Accounting Project Management MS Project Analysis Analytics Strategy Six Sigma Skills  Microsoft Office Microsoft Excel Microsoft Word SQL ABI Business Analysis Financial Accounting Cost Accounting Project Management MS Project Analysis Analytics Strategy Six Sigma Microsoft Office Microsoft Excel Microsoft Word SQL ABI Business Analysis Financial Accounting Cost Accounting Project Management MS Project Analysis Analytics Strategy Six Sigma Microsoft Office Microsoft Excel Microsoft Word SQL ABI Business Analysis Financial Accounting Cost Accounting Project Management MS Project Analysis Analytics Strategy Six Sigma Education University of Maryland - Robert H. Smith School of Business Bachelor of Science (BS),  Information Systems & Accounting , GPA 3.93 2010  – 2014 Graduated Cum Laude Activities and Societies:  Quality Enhancement Systems and Teams (QUEST) – Honors Fellows Program ,  Business Analytics Fellows Program (BAFP) ,  Phi Chi Theta University of Maryland - Robert H. Smith School of Business Bachelor of Science (BS),  Information Systems & Accounting , GPA 3.93 2010  – 2014 Graduated Cum Laude Activities and Societies:  Quality Enhancement Systems and Teams (QUEST) – Honors Fellows Program ,  Business Analytics Fellows Program (BAFP) ,  Phi Chi Theta University of Maryland - Robert H. Smith School of Business Bachelor of Science (BS),  Information Systems & Accounting , GPA 3.93 2010  – 2014 Graduated Cum Laude Activities and Societies:  Quality Enhancement Systems and Teams (QUEST) – Honors Fellows Program ,  Business Analytics Fellows Program (BAFP) ,  Phi Chi Theta University of Maryland - Robert H. Smith School of Business Bachelor of Science (BS),  Information Systems & Accounting , GPA 3.93 2010  – 2014 Graduated Cum Laude Activities and Societies:  Quality Enhancement Systems and Teams (QUEST) – Honors Fellows Program ,  Business Analytics Fellows Program (BAFP) ,  Phi Chi Theta Honors & Awards ", "Experience New Manager Development Program Manager- APAC Google July 2014  – Present (1 year 2 months) Sydney Area, Australia Changing the APAC new manager on-boarding experience from good to great. Benefits Associate Google October 2013  –  July 2014  (10 months) Mountain View, CA Creating and managing global benefits programs from conception to implementation. Partnering with cross-functional teams and external vendors to implement global benefits initiatives. Tech HR Coordinator Google October 2012  –  October 2013  (1 year 1 month) Mountain View, CA Coordinator for team of 10 HR Business Partners supporting 5000+ employees globally. Daily tasks included data entry and analysis, scheduling and process management. Worked directly with employees to investigate and resolve HR related issues. Student Ambassador Google September 2011  –  May 2012  (9 months) Tufts University Planned and hosted events for more than 300 guests that introduced students to new Google products and features. Utilized social media outlets to promote on-campus events. Circulation Desk Aid Tufts University September 2009  –  May 2012  (2 years 9 months) Ginn Library, Tufts University Oversaw daily patron services and assisted patrons with questions. Assisted with library maintenance (shelving, organizing and cataloguing resources). BOLD Intern Google June 2011  –  August 2011  (3 months) Researched engEDU facilitator network to understand challenges, incentives and opportunities. Used findings to devise and launch a recognition program for engEDU's global facilitator network. \n \nParticipated in weekly leadership workshops, tech talks and business seminars. Jumpstart Corps Member AmeriCorps June 2010  –  August 2010  (3 months) Boston, MA New Manager Development Program Manager- APAC Google July 2014  – Present (1 year 2 months) Sydney Area, Australia Changing the APAC new manager on-boarding experience from good to great. New Manager Development Program Manager- APAC Google July 2014  – Present (1 year 2 months) Sydney Area, Australia Changing the APAC new manager on-boarding experience from good to great. Benefits Associate Google October 2013  –  July 2014  (10 months) Mountain View, CA Creating and managing global benefits programs from conception to implementation. Partnering with cross-functional teams and external vendors to implement global benefits initiatives. Benefits Associate Google October 2013  –  July 2014  (10 months) Mountain View, CA Creating and managing global benefits programs from conception to implementation. Partnering with cross-functional teams and external vendors to implement global benefits initiatives. Tech HR Coordinator Google October 2012  –  October 2013  (1 year 1 month) Mountain View, CA Coordinator for team of 10 HR Business Partners supporting 5000+ employees globally. Daily tasks included data entry and analysis, scheduling and process management. Worked directly with employees to investigate and resolve HR related issues. Tech HR Coordinator Google October 2012  –  October 2013  (1 year 1 month) Mountain View, CA Coordinator for team of 10 HR Business Partners supporting 5000+ employees globally. Daily tasks included data entry and analysis, scheduling and process management. Worked directly with employees to investigate and resolve HR related issues. Student Ambassador Google September 2011  –  May 2012  (9 months) Tufts University Planned and hosted events for more than 300 guests that introduced students to new Google products and features. Utilized social media outlets to promote on-campus events. Student Ambassador Google September 2011  –  May 2012  (9 months) Tufts University Planned and hosted events for more than 300 guests that introduced students to new Google products and features. Utilized social media outlets to promote on-campus events. Circulation Desk Aid Tufts University September 2009  –  May 2012  (2 years 9 months) Ginn Library, Tufts University Oversaw daily patron services and assisted patrons with questions. Assisted with library maintenance (shelving, organizing and cataloguing resources). Circulation Desk Aid Tufts University September 2009  –  May 2012  (2 years 9 months) Ginn Library, Tufts University Oversaw daily patron services and assisted patrons with questions. Assisted with library maintenance (shelving, organizing and cataloguing resources). BOLD Intern Google June 2011  –  August 2011  (3 months) Researched engEDU facilitator network to understand challenges, incentives and opportunities. Used findings to devise and launch a recognition program for engEDU's global facilitator network. \n \nParticipated in weekly leadership workshops, tech talks and business seminars. BOLD Intern Google June 2011  –  August 2011  (3 months) Researched engEDU facilitator network to understand challenges, incentives and opportunities. Used findings to devise and launch a recognition program for engEDU's global facilitator network. \n \nParticipated in weekly leadership workshops, tech talks and business seminars. Jumpstart Corps Member AmeriCorps June 2010  –  August 2010  (3 months) Boston, MA Jumpstart Corps Member AmeriCorps June 2010  –  August 2010  (3 months) Boston, MA Skills Spanish Social Media Data Analysis Microsoft Office PowerPoint Editing Microsoft Excel Teaching Wellness Qualitative Research Microsoft Word Google Analytics Google Docs Illustrator Photoshop HTML Portuguese See 2+     See less Skills  Spanish Social Media Data Analysis Microsoft Office PowerPoint Editing Microsoft Excel Teaching Wellness Qualitative Research Microsoft Word Google Analytics Google Docs Illustrator Photoshop HTML Portuguese See 2+     See less Spanish Social Media Data Analysis Microsoft Office PowerPoint Editing Microsoft Excel Teaching Wellness Qualitative Research Microsoft Word Google Analytics Google Docs Illustrator Photoshop HTML Portuguese See 2+     See less Spanish Social Media Data Analysis Microsoft Office PowerPoint Editing Microsoft Excel Teaching Wellness Qualitative Research Microsoft Word Google Analytics Google Docs Illustrator Photoshop HTML Portuguese See 2+     See less Education Tufts University BA,  Philosophy 2008  – 2012 Institute for the International Education of Students (IES Abroad) 2011  – 2011 Activities and Societies:  Student Council Member Universidad de Granada 2011  – 2011 Tufts University BA,  Philosophy 2008  – 2012 Tufts University BA,  Philosophy 2008  – 2012 Tufts University BA,  Philosophy 2008  – 2012 Institute for the International Education of Students (IES Abroad) 2011  – 2011 Activities and Societies:  Student Council Member Institute for the International Education of Students (IES Abroad) 2011  – 2011 Activities and Societies:  Student Council Member Institute for the International Education of Students (IES Abroad) 2011  – 2011 Activities and Societies:  Student Council Member Universidad de Granada 2011  – 2011 Universidad de Granada 2011  – 2011 Universidad de Granada 2011  – 2011 ", "Summary Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Summary Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Techie fascinated in how the Internet impacts society and how society manifests itself in the Internet. Experience working both on cutting-edge legal agreements (especially advertising contracts, partnerships deals and M&A commercial diligence) as well as engaging with emerging tech policy issues. Comfortable negotiating contracts, improving legal processes as well as conducting hands-on research, ranging from detailed qualitative as well as quantitative (especially regression-based) analysis. A firm believer in keeping the Web a free, open and innovative platform for all to enjoy. Experience BOLD Intern for Ethics & Compliance Google June 2013  –  August 2013  (3 months) Mountain View, California BOLD Intern for Public Policy Google May 2012  –  August 2012  (4 months) Washington D.C. Metro Area Research Clerk Indiano & Williams PSC May 2011  –  August 2011  (4 months) Puerto Rico BOLD Intern for Ethics & Compliance Google June 2013  –  August 2013  (3 months) Mountain View, California BOLD Intern for Ethics & Compliance Google June 2013  –  August 2013  (3 months) Mountain View, California BOLD Intern for Public Policy Google May 2012  –  August 2012  (4 months) Washington D.C. Metro Area BOLD Intern for Public Policy Google May 2012  –  August 2012  (4 months) Washington D.C. Metro Area Research Clerk Indiano & Williams PSC May 2011  –  August 2011  (4 months) Puerto Rico Research Clerk Indiano & Williams PSC May 2011  –  August 2011  (4 months) Puerto Rico Languages Spanish Spanish Spanish Skills Public Policy Politics Strategic Communications Legal Research Research Qualitative Research Policy Analysis Risk Assessment Due Diligence Data Analysis Regression Analysis Skills  Public Policy Politics Strategic Communications Legal Research Research Qualitative Research Policy Analysis Risk Assessment Due Diligence Data Analysis Regression Analysis Public Policy Politics Strategic Communications Legal Research Research Qualitative Research Policy Analysis Risk Assessment Due Diligence Data Analysis Regression Analysis Public Policy Politics Strategic Communications Legal Research Research Qualitative Research Policy Analysis Risk Assessment Due Diligence Data Analysis Regression Analysis Education The George Washington University BA,  Political Communication 2010  – 2014 The George Washington University BA,  Political Communication 2010  – 2014 The George Washington University BA,  Political Communication 2010  – 2014 The George Washington University BA,  Political Communication 2010  – 2014 Honors & Awards ", "Summary A born and raised Hoosier turned Los Angeles resident. Working with interactive Rich Media Digital Advertising on Google's DoubleClick ad platform. Interested in politics, international affairs, tech, sports, entertainment, and new business development. Summary A born and raised Hoosier turned Los Angeles resident. Working with interactive Rich Media Digital Advertising on Google's DoubleClick ad platform. Interested in politics, international affairs, tech, sports, entertainment, and new business development. A born and raised Hoosier turned Los Angeles resident. Working with interactive Rich Media Digital Advertising on Google's DoubleClick ad platform. Interested in politics, international affairs, tech, sports, entertainment, and new business development. A born and raised Hoosier turned Los Angeles resident. Working with interactive Rich Media Digital Advertising on Google's DoubleClick ad platform. Interested in politics, international affairs, tech, sports, entertainment, and new business development. Experience Ad Solutions Consultant Google October 2014  – Present (11 months) Greater Los Angeles Area Sales Ops Rotation - Google for Work Google July 2014  –  September 2014  (3 months) London, United Kingdom Completed a variety of competitive landscape and country level analysis for Google's Enterprise products including Cloud Computing, Drive for Work, and Chromebooks. Also drove data quality cleanups, forecasting initiatives, and vendor management projects. Campaign Manager, DoubleClick Rich Media Google April 2012  –  June 2014  (2 years 3 months) Greater Los Angeles Area Project manager for a dedicated group of clients' large interactive online display advertising initiatives throughout the campaign lifecycle including creative conception, to implementation, to post campaign analysis. Directly supported top tier clients on the buy side of the DoubleClick suite of products. Account Manager, Online Sales and Operations Google July 2011  –  April 2012  (10 months) Worked on a team of 4 to manage a 20-client book of business with $100 million of annual revenue. Optimized and expanded our client's digital advertising presence using Google's AdWords. Online Sales and Operations BOLD Intern Google June 2010  –  August 2010  (3 months) Conducted industry research and created externally facing information one-sheeters and sales pitch templates  \nGenerated sales leads, performed need assessment calls to prospective clients, and delivered sales pitches Government Intern Grant County Commissioner's Office May 2008  –  August 2008  (4 months) Analyzed past expenditures to calculate the county's 2009 multi-million dollar budget  \nMaintained personal correspondence with bank managers to secure loans for county construction projects \nAssisted third-party consultants to limit inefficient government spending including energy costs and mailings Ad Solutions Consultant Google October 2014  – Present (11 months) Greater Los Angeles Area Ad Solutions Consultant Google October 2014  – Present (11 months) Greater Los Angeles Area Sales Ops Rotation - Google for Work Google July 2014  –  September 2014  (3 months) London, United Kingdom Completed a variety of competitive landscape and country level analysis for Google's Enterprise products including Cloud Computing, Drive for Work, and Chromebooks. Also drove data quality cleanups, forecasting initiatives, and vendor management projects. Sales Ops Rotation - Google for Work Google July 2014  –  September 2014  (3 months) London, United Kingdom Completed a variety of competitive landscape and country level analysis for Google's Enterprise products including Cloud Computing, Drive for Work, and Chromebooks. Also drove data quality cleanups, forecasting initiatives, and vendor management projects. Campaign Manager, DoubleClick Rich Media Google April 2012  –  June 2014  (2 years 3 months) Greater Los Angeles Area Project manager for a dedicated group of clients' large interactive online display advertising initiatives throughout the campaign lifecycle including creative conception, to implementation, to post campaign analysis. Directly supported top tier clients on the buy side of the DoubleClick suite of products. Campaign Manager, DoubleClick Rich Media Google April 2012  –  June 2014  (2 years 3 months) Greater Los Angeles Area Project manager for a dedicated group of clients' large interactive online display advertising initiatives throughout the campaign lifecycle including creative conception, to implementation, to post campaign analysis. Directly supported top tier clients on the buy side of the DoubleClick suite of products. Account Manager, Online Sales and Operations Google July 2011  –  April 2012  (10 months) Worked on a team of 4 to manage a 20-client book of business with $100 million of annual revenue. Optimized and expanded our client's digital advertising presence using Google's AdWords. Account Manager, Online Sales and Operations Google July 2011  –  April 2012  (10 months) Worked on a team of 4 to manage a 20-client book of business with $100 million of annual revenue. Optimized and expanded our client's digital advertising presence using Google's AdWords. Online Sales and Operations BOLD Intern Google June 2010  –  August 2010  (3 months) Conducted industry research and created externally facing information one-sheeters and sales pitch templates  \nGenerated sales leads, performed need assessment calls to prospective clients, and delivered sales pitches Online Sales and Operations BOLD Intern Google June 2010  –  August 2010  (3 months) Conducted industry research and created externally facing information one-sheeters and sales pitch templates  \nGenerated sales leads, performed need assessment calls to prospective clients, and delivered sales pitches Government Intern Grant County Commissioner's Office May 2008  –  August 2008  (4 months) Analyzed past expenditures to calculate the county's 2009 multi-million dollar budget  \nMaintained personal correspondence with bank managers to secure loans for county construction projects \nAssisted third-party consultants to limit inefficient government spending including energy costs and mailings Government Intern Grant County Commissioner's Office May 2008  –  August 2008  (4 months) Analyzed past expenditures to calculate the county's 2009 multi-million dollar budget  \nMaintained personal correspondence with bank managers to secure loans for county construction projects \nAssisted third-party consultants to limit inefficient government spending including energy costs and mailings Skills Google Adwords Mobile Advertising Advertising Online Advertising SEM Social Media Marketing Mobile Marketing Digital Strategy Digital Marketing Digital Media Online Marketing DoubleClick New Business Development Lead Generation Social Media PPC Google Analytics E-commerce Public Speaking Media Planning Search Advertising Interactive Advertising Media Buying See 8+     See less Skills  Google Adwords Mobile Advertising Advertising Online Advertising SEM Social Media Marketing Mobile Marketing Digital Strategy Digital Marketing Digital Media Online Marketing DoubleClick New Business Development Lead Generation Social Media PPC Google Analytics E-commerce Public Speaking Media Planning Search Advertising Interactive Advertising Media Buying See 8+     See less Google Adwords Mobile Advertising Advertising Online Advertising SEM Social Media Marketing Mobile Marketing Digital Strategy Digital Marketing Digital Media Online Marketing DoubleClick New Business Development Lead Generation Social Media PPC Google Analytics E-commerce Public Speaking Media Planning Search Advertising Interactive Advertising Media Buying See 8+     See less Google Adwords Mobile Advertising Advertising Online Advertising SEM Social Media Marketing Mobile Marketing Digital Strategy Digital Marketing Digital Media Online Marketing DoubleClick New Business Development Lead Generation Social Media PPC Google Analytics E-commerce Public Speaking Media Planning Search Advertising Interactive Advertising Media Buying See 8+     See less Education Indiana University - Kelley School of Business Bachelors of Science,  Business Economics ,  Public Policy Analysis ,  Political Science 2007  – 2011 Graduated with Distinction, Business Honors, and Hutton Honors Activities and Societies:  Honors Student Association President ,  Department of Student Rights Associate Director ,  Legal Studies Club Vice President ,  Indiana University Student Association Chief of External Affairs ,  iUnity for IUSA Campaign Manager ,  Red Hot for IUSA Campaign Manager ,  Intramural Sports Captain Indiana University - Kelley School of Business Bachelors of Science,  Business Economics ,  Public Policy Analysis ,  Political Science 2007  – 2011 Graduated with Distinction, Business Honors, and Hutton Honors Activities and Societies:  Honors Student Association President ,  Department of Student Rights Associate Director ,  Legal Studies Club Vice President ,  Indiana University Student Association Chief of External Affairs ,  iUnity for IUSA Campaign Manager ,  Red Hot for IUSA Campaign Manager ,  Intramural Sports Captain Indiana University - Kelley School of Business Bachelors of Science,  Business Economics ,  Public Policy Analysis ,  Political Science 2007  – 2011 Graduated with Distinction, Business Honors, and Hutton Honors Activities and Societies:  Honors Student Association President ,  Department of Student Rights Associate Director ,  Legal Studies Club Vice President ,  Indiana University Student Association Chief of External Affairs ,  iUnity for IUSA Campaign Manager ,  Red Hot for IUSA Campaign Manager ,  Intramural Sports Captain Indiana University - Kelley School of Business Bachelors of Science,  Business Economics ,  Public Policy Analysis ,  Political Science 2007  – 2011 Graduated with Distinction, Business Honors, and Hutton Honors Activities and Societies:  Honors Student Association President ,  Department of Student Rights Associate Director ,  Legal Studies Club Vice President ,  Indiana University Student Association Chief of External Affairs ,  iUnity for IUSA Campaign Manager ,  Red Hot for IUSA Campaign Manager ,  Intramural Sports Captain ", "Experience Financial Analyst Google January 2012  – Present (3 years 8 months) Mountain View, California Finance & Planning Analyst Goldman Sachs & Co July 2010  –  January 2012  (1 year 7 months) Forecast, analyze & report on $1bn+ occupancy spend and chargeback allocation methodology. Analyzed cost savings initiatives for facilities management operating and energy expense for over 50 Goldman Sachs facilities. Implement formal global occupancy policy to effectively communicate expense variances & real estate migrations/renovations. Senior Teller Bank of America December 2005  –  November 2009  (4 years) Executed financial transactions and oversaw the activities and performance of 10 teller associates. Achieved weekly sales goals on new accounts and referrals including mortgages, HELOCs and credit card applications. Trained new tellers by explaining customer service etiquette, the Merlin computer system and banking policies. Online Sales Finance Analyst BOLD Intern Google Inc June 2009  –  August 2009  (3 months) Created and presented analysis in online advertising and metrics for online vertical trends. Synthesized over 30 analyst reports and created a Google Q2 earnings deck for all Google Sales managers. Organized and led four intern/employee resource group outings and spearheaded the first intern community service event. Accounting and Controls Analyst BOLD Intern Google Inc May 2008  –  August 2008  (4 months) Developed US accounting threshold policies for monthly close accrual processes by creating and analyzing surveys and brainstorming with upper management. Created an accrual training deck in order for 50+ analysts to understand the monthly close processes. Brainstormed ten new strategies for accrual estimates in order to improve accountants' monthly close efficiency. Financial Operations Analyst INROADS Intern Google Inc May 2007  –  August 2007  (4 months) Carried out daily analyst responsibilities which included: creating business cases through interviews with analysts and engineers, developing the OTC website and organizing termination and escalation processes of finance employees. Developed business requirement documents for five finance projects in the order to cash project management team. \nCreated a new project management charter/initiation process to be implemented by 10 finance project managers. Financial Analyst Google January 2012  – Present (3 years 8 months) Mountain View, California Financial Analyst Google January 2012  – Present (3 years 8 months) Mountain View, California Finance & Planning Analyst Goldman Sachs & Co July 2010  –  January 2012  (1 year 7 months) Forecast, analyze & report on $1bn+ occupancy spend and chargeback allocation methodology. Analyzed cost savings initiatives for facilities management operating and energy expense for over 50 Goldman Sachs facilities. Implement formal global occupancy policy to effectively communicate expense variances & real estate migrations/renovations. Finance & Planning Analyst Goldman Sachs & Co July 2010  –  January 2012  (1 year 7 months) Forecast, analyze & report on $1bn+ occupancy spend and chargeback allocation methodology. Analyzed cost savings initiatives for facilities management operating and energy expense for over 50 Goldman Sachs facilities. Implement formal global occupancy policy to effectively communicate expense variances & real estate migrations/renovations. Senior Teller Bank of America December 2005  –  November 2009  (4 years) Executed financial transactions and oversaw the activities and performance of 10 teller associates. Achieved weekly sales goals on new accounts and referrals including mortgages, HELOCs and credit card applications. Trained new tellers by explaining customer service etiquette, the Merlin computer system and banking policies. Senior Teller Bank of America December 2005  –  November 2009  (4 years) Executed financial transactions and oversaw the activities and performance of 10 teller associates. Achieved weekly sales goals on new accounts and referrals including mortgages, HELOCs and credit card applications. Trained new tellers by explaining customer service etiquette, the Merlin computer system and banking policies. Online Sales Finance Analyst BOLD Intern Google Inc June 2009  –  August 2009  (3 months) Created and presented analysis in online advertising and metrics for online vertical trends. Synthesized over 30 analyst reports and created a Google Q2 earnings deck for all Google Sales managers. Organized and led four intern/employee resource group outings and spearheaded the first intern community service event. Online Sales Finance Analyst BOLD Intern Google Inc June 2009  –  August 2009  (3 months) Created and presented analysis in online advertising and metrics for online vertical trends. Synthesized over 30 analyst reports and created a Google Q2 earnings deck for all Google Sales managers. Organized and led four intern/employee resource group outings and spearheaded the first intern community service event. Accounting and Controls Analyst BOLD Intern Google Inc May 2008  –  August 2008  (4 months) Developed US accounting threshold policies for monthly close accrual processes by creating and analyzing surveys and brainstorming with upper management. Created an accrual training deck in order for 50+ analysts to understand the monthly close processes. Brainstormed ten new strategies for accrual estimates in order to improve accountants' monthly close efficiency. Accounting and Controls Analyst BOLD Intern Google Inc May 2008  –  August 2008  (4 months) Developed US accounting threshold policies for monthly close accrual processes by creating and analyzing surveys and brainstorming with upper management. Created an accrual training deck in order for 50+ analysts to understand the monthly close processes. Brainstormed ten new strategies for accrual estimates in order to improve accountants' monthly close efficiency. Financial Operations Analyst INROADS Intern Google Inc May 2007  –  August 2007  (4 months) Carried out daily analyst responsibilities which included: creating business cases through interviews with analysts and engineers, developing the OTC website and organizing termination and escalation processes of finance employees. Developed business requirement documents for five finance projects in the order to cash project management team. \nCreated a new project management charter/initiation process to be implemented by 10 finance project managers. Financial Operations Analyst INROADS Intern Google Inc May 2007  –  August 2007  (4 months) Carried out daily analyst responsibilities which included: creating business cases through interviews with analysts and engineers, developing the OTC website and organizing termination and escalation processes of finance employees. Developed business requirement documents for five finance projects in the order to cash project management team. \nCreated a new project management charter/initiation process to be implemented by 10 finance project managers. Skills Financial Modeling Accounting Financial Analysis Corporate Finance Banking Project Management Visio Analysis Essbase Strategy Finance Data Analysis Financial Forecasting Accounts Payable Microsoft Office Due Diligence Business Analysis Risk Management Valuation Financial Reporting Sarbanes-Oxley Act Economics Sales SQL Analytics Internal Controls Mergers & Acquisitions Training See 13+     See less Skills  Financial Modeling Accounting Financial Analysis Corporate Finance Banking Project Management Visio Analysis Essbase Strategy Finance Data Analysis Financial Forecasting Accounts Payable Microsoft Office Due Diligence Business Analysis Risk Management Valuation Financial Reporting Sarbanes-Oxley Act Economics Sales SQL Analytics Internal Controls Mergers & Acquisitions Training See 13+     See less Financial Modeling Accounting Financial Analysis Corporate Finance Banking Project Management Visio Analysis Essbase Strategy Finance Data Analysis Financial Forecasting Accounts Payable Microsoft Office Due Diligence Business Analysis Risk Management Valuation Financial Reporting Sarbanes-Oxley Act Economics Sales SQL Analytics Internal Controls Mergers & Acquisitions Training See 13+     See less Financial Modeling Accounting Financial Analysis Corporate Finance Banking Project Management Visio Analysis Essbase Strategy Finance Data Analysis Financial Forecasting Accounts Payable Microsoft Office Due Diligence Business Analysis Risk Management Valuation Financial Reporting Sarbanes-Oxley Act Economics Sales SQL Analytics Internal Controls Mergers & Acquisitions Training See 13+     See less Education University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration 2006  – 2010 Cumulative GPA: 3.64/4.00 Activities and Societies:  Interest Course: Energy & Sustainability ,  Columbia University Spring 2011\nVP of Finance Latino Business Student Association\nVP of Community Service Latino Business Student Association\nVP of IT Latino Business Student Association\nVP of External Berkeley Women in Business\nCo-Founder of Scholarship for Undocumented Students\nLed Financial Literacy Program in Oakland Public Schools Universidad Carlos III de Madrid Study Abroad: Hispanic Studies,  University of California Abroad Program 2010  – 2010 Harvard Business School Summer Venture in Management Program 2009 Northwestern University - Kellogg School of Management Master of Business Administration (M.B.A.) 2015  – 2017 University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration 2006  – 2010 Cumulative GPA: 3.64/4.00 Activities and Societies:  Interest Course: Energy & Sustainability ,  Columbia University Spring 2011\nVP of Finance Latino Business Student Association\nVP of Community Service Latino Business Student Association\nVP of IT Latino Business Student Association\nVP of External Berkeley Women in Business\nCo-Founder of Scholarship for Undocumented Students\nLed Financial Literacy Program in Oakland Public Schools University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration 2006  – 2010 Cumulative GPA: 3.64/4.00 Activities and Societies:  Interest Course: Energy & Sustainability ,  Columbia University Spring 2011\nVP of Finance Latino Business Student Association\nVP of Community Service Latino Business Student Association\nVP of IT Latino Business Student Association\nVP of External Berkeley Women in Business\nCo-Founder of Scholarship for Undocumented Students\nLed Financial Literacy Program in Oakland Public Schools University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration 2006  – 2010 Cumulative GPA: 3.64/4.00 Activities and Societies:  Interest Course: Energy & Sustainability ,  Columbia University Spring 2011\nVP of Finance Latino Business Student Association\nVP of Community Service Latino Business Student Association\nVP of IT Latino Business Student Association\nVP of External Berkeley Women in Business\nCo-Founder of Scholarship for Undocumented Students\nLed Financial Literacy Program in Oakland Public Schools Universidad Carlos III de Madrid Study Abroad: Hispanic Studies,  University of California Abroad Program 2010  – 2010 Universidad Carlos III de Madrid Study Abroad: Hispanic Studies,  University of California Abroad Program 2010  – 2010 Universidad Carlos III de Madrid Study Abroad: Hispanic Studies,  University of California Abroad Program 2010  – 2010 Harvard Business School Summer Venture in Management Program 2009 Harvard Business School Summer Venture in Management Program 2009 Harvard Business School Summer Venture in Management Program 2009 Northwestern University - Kellogg School of Management Master of Business Administration (M.B.A.) 2015  – 2017 Northwestern University - Kellogg School of Management Master of Business Administration (M.B.A.) 2015  – 2017 Northwestern University - Kellogg School of Management Master of Business Administration (M.B.A.) 2015  – 2017 Honors & Awards Additional Honors & Awards Google Advertising Professional Certified Additional Honors & Awards Google Advertising Professional Certified Additional Honors & Awards Google Advertising Professional Certified Additional Honors & Awards Google Advertising Professional Certified ", "Experience Associate Product Marketing Manager, Google for Work Google April 2014  – Present (1 year 5 months) Mountain View, CA Account Manager -- Agency Sales Google January 2013  –  March 2014  (1 year 3 months) Cambridge, MA Diversity Markets Specialist Google July 2013  –  December 2013  (6 months) Mountain View, CA Account Strategist -- SMB Sales Google September 2011  –  December 2012  (1 year 4 months) Cambridge, MA BOLD Intern - Consumer Packaged Goods Sales Vertical Google June 2010  –  September 2010  (4 months) Cambridge, MA Associate Product Marketing Manager, Google for Work Google April 2014  – Present (1 year 5 months) Mountain View, CA Associate Product Marketing Manager, Google for Work Google April 2014  – Present (1 year 5 months) Mountain View, CA Account Manager -- Agency Sales Google January 2013  –  March 2014  (1 year 3 months) Cambridge, MA Account Manager -- Agency Sales Google January 2013  –  March 2014  (1 year 3 months) Cambridge, MA Diversity Markets Specialist Google July 2013  –  December 2013  (6 months) Mountain View, CA Diversity Markets Specialist Google July 2013  –  December 2013  (6 months) Mountain View, CA Account Strategist -- SMB Sales Google September 2011  –  December 2012  (1 year 4 months) Cambridge, MA Account Strategist -- SMB Sales Google September 2011  –  December 2012  (1 year 4 months) Cambridge, MA BOLD Intern - Consumer Packaged Goods Sales Vertical Google June 2010  –  September 2010  (4 months) Cambridge, MA BOLD Intern - Consumer Packaged Goods Sales Vertical Google June 2010  –  September 2010  (4 months) Cambridge, MA Languages Spanish Spanish Spanish Skills Google Adwords SEM Search Advertising Google Analytics PPC Online Advertising Social Media Display Advertising Digital Strategy Online Marketing Digital Marketing Analytics Mobile Advertising Entrepreneurship Strategy Mobile Marketing Web Analytics Social Media Marketing Web Marketing E-commerce See 5+     See less Skills  Google Adwords SEM Search Advertising Google Analytics PPC Online Advertising Social Media Display Advertising Digital Strategy Online Marketing Digital Marketing Analytics Mobile Advertising Entrepreneurship Strategy Mobile Marketing Web Analytics Social Media Marketing Web Marketing E-commerce See 5+     See less Google Adwords SEM Search Advertising Google Analytics PPC Online Advertising Social Media Display Advertising Digital Strategy Online Marketing Digital Marketing Analytics Mobile Advertising Entrepreneurship Strategy Mobile Marketing Web Analytics Social Media Marketing Web Marketing E-commerce See 5+     See less Google Adwords SEM Search Advertising Google Analytics PPC Online Advertising Social Media Display Advertising Digital Strategy Online Marketing Digital Marketing Analytics Mobile Advertising Entrepreneurship Strategy Mobile Marketing Web Analytics Social Media Marketing Web Marketing E-commerce See 5+     See less Education Dartmouth College Bachelor's degree,  Economics 2007  – 2011 Dartmouth College Bachelor's degree,  Economics 2007  – 2011 Dartmouth College Bachelor's degree,  Economics 2007  – 2011 Dartmouth College Bachelor's degree,  Economics 2007  – 2011 ", "Experience Financial Analyst I, Americas Sales Finance Google November 2012  – Present (2 years 10 months) Mountain View, CA Focus on using data to understand revenue trends, opportunity identification and informing sales strategy across display (adnetwork, dsp, adexchange) and mobile (search, apps, web) in the North America and Lat Am. Associate Financial Analyst, Americas Sales Finance Google April 2012  –  November 2012  (8 months) Mountain View, CA Associate Financial Analyst, Global Product and Partnerships Finance Google January 2012  –  April 2012  (4 months) Mountain View, CA Focused on Analysis around Ad Network Globally and Launch of Network Brand Business Associate Financial Analyst, Americas Sales Finance Google August 2010  –  January 2012  (1 year 6 months) Mountain View, CA Partner with the Director of Google's North American Display Ad Network to Drive Revenue \nhttp://www.google.com/adwords/watchthisspace BOLD Intern, Americas Sales Finance Google June 2009  –  August 2009  (3 months) Mountain View, CA Worked on the revenue intelligence team focusing on large clients. Summer Analyst, Equity Research Goldman Sachs June 2008  –  August 2008  (3 months) New York, NY Financial Analyst I, Americas Sales Finance Google November 2012  – Present (2 years 10 months) Mountain View, CA Focus on using data to understand revenue trends, opportunity identification and informing sales strategy across display (adnetwork, dsp, adexchange) and mobile (search, apps, web) in the North America and Lat Am. Financial Analyst I, Americas Sales Finance Google November 2012  – Present (2 years 10 months) Mountain View, CA Focus on using data to understand revenue trends, opportunity identification and informing sales strategy across display (adnetwork, dsp, adexchange) and mobile (search, apps, web) in the North America and Lat Am. Associate Financial Analyst, Americas Sales Finance Google April 2012  –  November 2012  (8 months) Mountain View, CA Associate Financial Analyst, Americas Sales Finance Google April 2012  –  November 2012  (8 months) Mountain View, CA Associate Financial Analyst, Global Product and Partnerships Finance Google January 2012  –  April 2012  (4 months) Mountain View, CA Focused on Analysis around Ad Network Globally and Launch of Network Brand Business Associate Financial Analyst, Global Product and Partnerships Finance Google January 2012  –  April 2012  (4 months) Mountain View, CA Focused on Analysis around Ad Network Globally and Launch of Network Brand Business Associate Financial Analyst, Americas Sales Finance Google August 2010  –  January 2012  (1 year 6 months) Mountain View, CA Partner with the Director of Google's North American Display Ad Network to Drive Revenue \nhttp://www.google.com/adwords/watchthisspace Associate Financial Analyst, Americas Sales Finance Google August 2010  –  January 2012  (1 year 6 months) Mountain View, CA Partner with the Director of Google's North American Display Ad Network to Drive Revenue \nhttp://www.google.com/adwords/watchthisspace BOLD Intern, Americas Sales Finance Google June 2009  –  August 2009  (3 months) Mountain View, CA Worked on the revenue intelligence team focusing on large clients. BOLD Intern, Americas Sales Finance Google June 2009  –  August 2009  (3 months) Mountain View, CA Worked on the revenue intelligence team focusing on large clients. Summer Analyst, Equity Research Goldman Sachs June 2008  –  August 2008  (3 months) New York, NY Summer Analyst, Equity Research Goldman Sachs June 2008  –  August 2008  (3 months) New York, NY Skills Analytics Microsoft Excel SQL Analysis Marketing Strategy Management Program Management Leadership Data Analysis Competitive Analysis Business Strategy Microsoft Office Financial Modeling Market Research Strategy Finance Social Media Financial Analysis See 3+     See less Skills  Analytics Microsoft Excel SQL Analysis Marketing Strategy Management Program Management Leadership Data Analysis Competitive Analysis Business Strategy Microsoft Office Financial Modeling Market Research Strategy Finance Social Media Financial Analysis See 3+     See less Analytics Microsoft Excel SQL Analysis Marketing Strategy Management Program Management Leadership Data Analysis Competitive Analysis Business Strategy Microsoft Office Financial Modeling Market Research Strategy Finance Social Media Financial Analysis See 3+     See less Analytics Microsoft Excel SQL Analysis Marketing Strategy Management Program Management Leadership Data Analysis Competitive Analysis Business Strategy Microsoft Office Financial Modeling Market Research Strategy Finance Social Media Financial Analysis See 3+     See less Education Northwestern University BA,  Economics 2006  – 2010 Activities and Societies:  Undergraduate Black Management Association (UBMA) ,  Consultants Advising Student Enterprises (CASE) ,  ISBE (Institute for Student Business Education) ,  Investment Management Club ,  Intramural Football Northwestern University BA,  Economics 2006  – 2010 Activities and Societies:  Undergraduate Black Management Association (UBMA) ,  Consultants Advising Student Enterprises (CASE) ,  ISBE (Institute for Student Business Education) ,  Investment Management Club ,  Intramural Football Northwestern University BA,  Economics 2006  – 2010 Activities and Societies:  Undergraduate Black Management Association (UBMA) ,  Consultants Advising Student Enterprises (CASE) ,  ISBE (Institute for Student Business Education) ,  Investment Management Club ,  Intramural Football Northwestern University BA,  Economics 2006  – 2010 Activities and Societies:  Undergraduate Black Management Association (UBMA) ,  Consultants Advising Student Enterprises (CASE) ,  ISBE (Institute for Student Business Education) ,  Investment Management Club ,  Intramural Football ", "Experience Vendor Program Manager Google July 2013  – Present (2 years 2 months) San Francisco Co-led 130 agent Hyderabad vendor team supporting 40% of global client volume across four DoubleClick products, led site to a 13% decrease in email resolution time and a 32% decrease in first response time. \n \nManaged Undergraduate intern for 11-week internship; designed and oversaw her budget forecasting project responsible for $XXM annual budge, provided regular performance feedback, she was hired full-time by Google after the summer \n \nLed vendor RFP in Japan to consolidate staffing companies to a single MSP supporting the $XXM business; drafted and negotiated terms for contract and managed vendor transition \n \nLaunched chat and phone support pilots, reducing support resolution time by 99% for clients using these services, planning global expansion Technical Account Manager Google Inc. August 2011  –  July 2013  (2 years) San Francisco Bay Area Promoted first in start class, provided technical support for seven of DoubleClick's top 150 clients, supporting over $XM in total spend, maintaining 100% client satisfaction and top-five support metrics in the Americas \n \nManaged Data Transfer upgrades with Engineering and Product teams; helped redesign process based on client needs, wrote technical documentation for Java and Cloud Storage integration, and trained Global Support team \n \nDesigned and proposed Vendor Program Manager team to Global Support leadership, program was rolled-out a quarter later DoubleClick, BOLD Intern Google June 2010  –  August 2010  (3 months) Rehired as one of 140 interns nationwide to work within Google’s Rich Media division of the DoubleClick team.  \n \nConducted workflow research and made recommendations to achieve a 10% increase in team productivity. Goldman Sachs and Trellus Next Generation Fund Intern Trellus Management June 2010  –  August 2010  (3 months) Selected as one of 10 students to independently manage a $20,000 portfolio as part of the Next General Fund \n \nManaged portfolio of Socially Responsible corporations, researched 10-15 companies a week, wrote weekly executive reports outlining investment decisions, and delivered oral presentation on investment strategy AdWords, BOLD Intern Google June 2009  –  August 2009  (3 months) Selected as one of 90 interns nationwide to work within Google's Online Sales and Operations verticals \n \nDesigned webinar and one sheeter that provide hospital clients with strategies for landing page optimization based on data collected from 260 hospitals identifying potential areas for website improvement Vendor Program Manager Google July 2013  – Present (2 years 2 months) San Francisco Co-led 130 agent Hyderabad vendor team supporting 40% of global client volume across four DoubleClick products, led site to a 13% decrease in email resolution time and a 32% decrease in first response time. \n \nManaged Undergraduate intern for 11-week internship; designed and oversaw her budget forecasting project responsible for $XXM annual budge, provided regular performance feedback, she was hired full-time by Google after the summer \n \nLed vendor RFP in Japan to consolidate staffing companies to a single MSP supporting the $XXM business; drafted and negotiated terms for contract and managed vendor transition \n \nLaunched chat and phone support pilots, reducing support resolution time by 99% for clients using these services, planning global expansion Vendor Program Manager Google July 2013  – Present (2 years 2 months) San Francisco Co-led 130 agent Hyderabad vendor team supporting 40% of global client volume across four DoubleClick products, led site to a 13% decrease in email resolution time and a 32% decrease in first response time. \n \nManaged Undergraduate intern for 11-week internship; designed and oversaw her budget forecasting project responsible for $XXM annual budge, provided regular performance feedback, she was hired full-time by Google after the summer \n \nLed vendor RFP in Japan to consolidate staffing companies to a single MSP supporting the $XXM business; drafted and negotiated terms for contract and managed vendor transition \n \nLaunched chat and phone support pilots, reducing support resolution time by 99% for clients using these services, planning global expansion Technical Account Manager Google Inc. August 2011  –  July 2013  (2 years) San Francisco Bay Area Promoted first in start class, provided technical support for seven of DoubleClick's top 150 clients, supporting over $XM in total spend, maintaining 100% client satisfaction and top-five support metrics in the Americas \n \nManaged Data Transfer upgrades with Engineering and Product teams; helped redesign process based on client needs, wrote technical documentation for Java and Cloud Storage integration, and trained Global Support team \n \nDesigned and proposed Vendor Program Manager team to Global Support leadership, program was rolled-out a quarter later Technical Account Manager Google Inc. August 2011  –  July 2013  (2 years) San Francisco Bay Area Promoted first in start class, provided technical support for seven of DoubleClick's top 150 clients, supporting over $XM in total spend, maintaining 100% client satisfaction and top-five support metrics in the Americas \n \nManaged Data Transfer upgrades with Engineering and Product teams; helped redesign process based on client needs, wrote technical documentation for Java and Cloud Storage integration, and trained Global Support team \n \nDesigned and proposed Vendor Program Manager team to Global Support leadership, program was rolled-out a quarter later DoubleClick, BOLD Intern Google June 2010  –  August 2010  (3 months) Rehired as one of 140 interns nationwide to work within Google’s Rich Media division of the DoubleClick team.  \n \nConducted workflow research and made recommendations to achieve a 10% increase in team productivity. DoubleClick, BOLD Intern Google June 2010  –  August 2010  (3 months) Rehired as one of 140 interns nationwide to work within Google’s Rich Media division of the DoubleClick team.  \n \nConducted workflow research and made recommendations to achieve a 10% increase in team productivity. Goldman Sachs and Trellus Next Generation Fund Intern Trellus Management June 2010  –  August 2010  (3 months) Selected as one of 10 students to independently manage a $20,000 portfolio as part of the Next General Fund \n \nManaged portfolio of Socially Responsible corporations, researched 10-15 companies a week, wrote weekly executive reports outlining investment decisions, and delivered oral presentation on investment strategy Goldman Sachs and Trellus Next Generation Fund Intern Trellus Management June 2010  –  August 2010  (3 months) Selected as one of 10 students to independently manage a $20,000 portfolio as part of the Next General Fund \n \nManaged portfolio of Socially Responsible corporations, researched 10-15 companies a week, wrote weekly executive reports outlining investment decisions, and delivered oral presentation on investment strategy AdWords, BOLD Intern Google June 2009  –  August 2009  (3 months) Selected as one of 90 interns nationwide to work within Google's Online Sales and Operations verticals \n \nDesigned webinar and one sheeter that provide hospital clients with strategies for landing page optimization based on data collected from 260 hospitals identifying potential areas for website improvement AdWords, BOLD Intern Google June 2009  –  August 2009  (3 months) Selected as one of 90 interns nationwide to work within Google's Online Sales and Operations verticals \n \nDesigned webinar and one sheeter that provide hospital clients with strategies for landing page optimization based on data collected from 260 hospitals identifying potential areas for website improvement Languages   Skills Leadership Management Fundraising Public Speaking Google Adwords Sales Research Budgets DoubleClick Windows Analytics Data Analysis Skills  Leadership Management Fundraising Public Speaking Google Adwords Sales Research Budgets DoubleClick Windows Analytics Data Analysis Leadership Management Fundraising Public Speaking Google Adwords Sales Research Budgets DoubleClick Windows Analytics Data Analysis Leadership Management Fundraising Public Speaking Google Adwords Sales Research Budgets DoubleClick Windows Analytics Data Analysis Education Wesleyan University Bachelor of Arts,  College of Social Sciences (government ,  economics ,  history ,  social theory) , 3.89 2007  – 2011 Activities and Societies:  Cardinal Council (a student group working with University Relations to connect students ,  administration ,  and alumni) ,  Debate Team ,  STAND (Darfur awareness and education) ,  Major House Committee SIT Study Abroad-- Amman, Jordan N/A,  Arabic , Cultural and Modernization studies 2009  – 2009 Activities and Societies:  Improved Arabic language ,  completed month long independent research project ,  learned local culture ,  and networked with people across Jordan Northfield Mount Hermon High School 2004  – 2007 Activities and Societies:  Phi Bata Kappa ,  Debate Team Officer ,  Co-Captain Crew Team ,  Ski Team ,  12 time deans list member ,  Traveling Model UN team ,  Judicial Committee member Wesleyan University Bachelor of Arts,  College of Social Sciences (government ,  economics ,  history ,  social theory) , 3.89 2007  – 2011 Activities and Societies:  Cardinal Council (a student group working with University Relations to connect students ,  administration ,  and alumni) ,  Debate Team ,  STAND (Darfur awareness and education) ,  Major House Committee Wesleyan University Bachelor of Arts,  College of Social Sciences (government ,  economics ,  history ,  social theory) , 3.89 2007  – 2011 Activities and Societies:  Cardinal Council (a student group working with University Relations to connect students ,  administration ,  and alumni) ,  Debate Team ,  STAND (Darfur awareness and education) ,  Major House Committee Wesleyan University Bachelor of Arts,  College of Social Sciences (government ,  economics ,  history ,  social theory) , 3.89 2007  – 2011 Activities and Societies:  Cardinal Council (a student group working with University Relations to connect students ,  administration ,  and alumni) ,  Debate Team ,  STAND (Darfur awareness and education) ,  Major House Committee SIT Study Abroad-- Amman, Jordan N/A,  Arabic , Cultural and Modernization studies 2009  – 2009 Activities and Societies:  Improved Arabic language ,  completed month long independent research project ,  learned local culture ,  and networked with people across Jordan SIT Study Abroad-- Amman, Jordan N/A,  Arabic , Cultural and Modernization studies 2009  – 2009 Activities and Societies:  Improved Arabic language ,  completed month long independent research project ,  learned local culture ,  and networked with people across Jordan SIT Study Abroad-- Amman, Jordan N/A,  Arabic , Cultural and Modernization studies 2009  – 2009 Activities and Societies:  Improved Arabic language ,  completed month long independent research project ,  learned local culture ,  and networked with people across Jordan Northfield Mount Hermon High School 2004  – 2007 Activities and Societies:  Phi Bata Kappa ,  Debate Team Officer ,  Co-Captain Crew Team ,  Ski Team ,  12 time deans list member ,  Traveling Model UN team ,  Judicial Committee member Northfield Mount Hermon High School 2004  – 2007 Activities and Societies:  Phi Bata Kappa ,  Debate Team Officer ,  Co-Captain Crew Team ,  Ski Team ,  12 time deans list member ,  Traveling Model UN team ,  Judicial Committee member Northfield Mount Hermon High School 2004  – 2007 Activities and Societies:  Phi Bata Kappa ,  Debate Team Officer ,  Co-Captain Crew Team ,  Ski Team ,  12 time deans list member ,  Traveling Model UN team ,  Judicial Committee member Honors & Awards Additional Honors & Awards Google: 11 Spot Bonuses and 27 Peer Bonuses \n \nWesleyan Service Career Fellowship: Awarded to 6 students for volunteering and socially responsible career aspirations Additional Honors & Awards Google: 11 Spot Bonuses and 27 Peer Bonuses \n \nWesleyan Service Career Fellowship: Awarded to 6 students for volunteering and socially responsible career aspirations Additional Honors & Awards Google: 11 Spot Bonuses and 27 Peer Bonuses \n \nWesleyan Service Career Fellowship: Awarded to 6 students for volunteering and socially responsible career aspirations Additional Honors & Awards Google: 11 Spot Bonuses and 27 Peer Bonuses \n \nWesleyan Service Career Fellowship: Awarded to 6 students for volunteering and socially responsible career aspirations ", "Experience Account Manager: Large Customer Sales Division Google January 2014  – Present (1 year 8 months) Greater New York City Area Account Manager: Small & Medium Size Business Division Google July 2012  –  December 2013  (1 year 6 months) Mountain View, CA -Analyze quarterly portfolio of 400 new advertisers to identify & grow highest potential accounts, driving an average of $1.4M increased annualized revenue. \n-Build client relationships & consult on campaign performance, marketing goals & competitive landscape to develop advertising plans across search, display, mobile & video. \n-Led North America team as a top sales performer for 3 consecutive quarters, exceeding targets by 7% reach, 18% depth. \n-Develop and maintain the Newbie Sales Global and North America teams websites, newsletters, and resources weekly. Bold Intern: DCS Online Sales Inside Sales Team Google May 2011  –  August 2011  (4 months) Mountain View, CA -Worked with several Google departments and utilized various Google tools, systems, and vendors apps to create sales leads. \n-Generated over 600 new leads in the Finance and Healthcare subverticals to support the business that brings in $300 million in revenue per year. \n-Collaborated with the India team to developed industry profiles to create six customized industry sale presentations. \n-Participated in high strategy sales calls directed by senior level sale representatives to gain an understanding of the sales culture and processes. Bold Intern: DCS Online Sales Healthcare Team Google June 2010  –  August 2010  (3 months) Mountain View, CA -Gathered and analyzed healthcare consumer data to understand the emerging online video space. \n \n-Interacted with various Google departments to increase the success of educational healthcare demonstrations and future advertising opportunities via video content on YouTube. \n \n-Developed and hosted a healthcare webinar for 40+ healthcare advertisers and Google employees that included PPT content, marketing awareness, YouTube Links, and data strategy for current and potential clients. Account Manager: Large Customer Sales Division Google January 2014  – Present (1 year 8 months) Greater New York City Area Account Manager: Large Customer Sales Division Google January 2014  – Present (1 year 8 months) Greater New York City Area Account Manager: Small & Medium Size Business Division Google July 2012  –  December 2013  (1 year 6 months) Mountain View, CA -Analyze quarterly portfolio of 400 new advertisers to identify & grow highest potential accounts, driving an average of $1.4M increased annualized revenue. \n-Build client relationships & consult on campaign performance, marketing goals & competitive landscape to develop advertising plans across search, display, mobile & video. \n-Led North America team as a top sales performer for 3 consecutive quarters, exceeding targets by 7% reach, 18% depth. \n-Develop and maintain the Newbie Sales Global and North America teams websites, newsletters, and resources weekly. Account Manager: Small & Medium Size Business Division Google July 2012  –  December 2013  (1 year 6 months) Mountain View, CA -Analyze quarterly portfolio of 400 new advertisers to identify & grow highest potential accounts, driving an average of $1.4M increased annualized revenue. \n-Build client relationships & consult on campaign performance, marketing goals & competitive landscape to develop advertising plans across search, display, mobile & video. \n-Led North America team as a top sales performer for 3 consecutive quarters, exceeding targets by 7% reach, 18% depth. \n-Develop and maintain the Newbie Sales Global and North America teams websites, newsletters, and resources weekly. Bold Intern: DCS Online Sales Inside Sales Team Google May 2011  –  August 2011  (4 months) Mountain View, CA -Worked with several Google departments and utilized various Google tools, systems, and vendors apps to create sales leads. \n-Generated over 600 new leads in the Finance and Healthcare subverticals to support the business that brings in $300 million in revenue per year. \n-Collaborated with the India team to developed industry profiles to create six customized industry sale presentations. \n-Participated in high strategy sales calls directed by senior level sale representatives to gain an understanding of the sales culture and processes. Bold Intern: DCS Online Sales Inside Sales Team Google May 2011  –  August 2011  (4 months) Mountain View, CA -Worked with several Google departments and utilized various Google tools, systems, and vendors apps to create sales leads. \n-Generated over 600 new leads in the Finance and Healthcare subverticals to support the business that brings in $300 million in revenue per year. \n-Collaborated with the India team to developed industry profiles to create six customized industry sale presentations. \n-Participated in high strategy sales calls directed by senior level sale representatives to gain an understanding of the sales culture and processes. Bold Intern: DCS Online Sales Healthcare Team Google June 2010  –  August 2010  (3 months) Mountain View, CA -Gathered and analyzed healthcare consumer data to understand the emerging online video space. \n \n-Interacted with various Google departments to increase the success of educational healthcare demonstrations and future advertising opportunities via video content on YouTube. \n \n-Developed and hosted a healthcare webinar for 40+ healthcare advertisers and Google employees that included PPT content, marketing awareness, YouTube Links, and data strategy for current and potential clients. Bold Intern: DCS Online Sales Healthcare Team Google June 2010  –  August 2010  (3 months) Mountain View, CA -Gathered and analyzed healthcare consumer data to understand the emerging online video space. \n \n-Interacted with various Google departments to increase the success of educational healthcare demonstrations and future advertising opportunities via video content on YouTube. \n \n-Developed and hosted a healthcare webinar for 40+ healthcare advertisers and Google employees that included PPT content, marketing awareness, YouTube Links, and data strategy for current and potential clients. Skills Advertising Social Media Event Planning Marketing Google Adwords Search Advertising Display Advertising Online Advertising Digital Marketing Public Relations PowerPoint Microsoft Word Online Marketing Communication Skills  Advertising Social Media Event Planning Marketing Google Adwords Search Advertising Display Advertising Online Advertising Digital Marketing Public Relations PowerPoint Microsoft Word Online Marketing Communication Advertising Social Media Event Planning Marketing Google Adwords Search Advertising Display Advertising Online Advertising Digital Marketing Public Relations PowerPoint Microsoft Word Online Marketing Communication Advertising Social Media Event Planning Marketing Google Adwords Search Advertising Display Advertising Online Advertising Digital Marketing Public Relations PowerPoint Microsoft Word Online Marketing Communication Education Spelman College Bachelor of Arts (B.A.),  Comparative Woman Studies 2008  – 2012 Spelman College Bachelor of Arts (B.A.),  Comparative Woman Studies 2008  – 2012 Spelman College Bachelor of Arts (B.A.),  Comparative Woman Studies 2008  – 2012 Spelman College Bachelor of Arts (B.A.),  Comparative Woman Studies 2008  – 2012 Honors & Awards Magna Cum Laude May 2012 Magna Cum Laude May 2012 Magna Cum Laude May 2012 Magna Cum Laude May 2012 ", "Summary Specialization in innovation under the umbrella of the convergence of business and technology. Specialties:Internet and New Media Marketing, Data Mining, Analytics, Social Media, Entrepreneurship, Sales, Investment Management, Photography, Web Design, Outdoor / Adventure Travel, World Travel, Java, Python, HTML/CSS, PHP, SQL, XML, Adobe Design Suite, Microsoft 2007 Suite Summary Specialization in innovation under the umbrella of the convergence of business and technology. Specialties:Internet and New Media Marketing, Data Mining, Analytics, Social Media, Entrepreneurship, Sales, Investment Management, Photography, Web Design, Outdoor / Adventure Travel, World Travel, Java, Python, HTML/CSS, PHP, SQL, XML, Adobe Design Suite, Microsoft 2007 Suite Specialization in innovation under the umbrella of the convergence of business and technology. Specialties:Internet and New Media Marketing, Data Mining, Analytics, Social Media, Entrepreneurship, Sales, Investment Management, Photography, Web Design, Outdoor / Adventure Travel, World Travel, Java, Python, HTML/CSS, PHP, SQL, XML, Adobe Design Suite, Microsoft 2007 Suite Specialization in innovation under the umbrella of the convergence of business and technology. Specialties:Internet and New Media Marketing, Data Mining, Analytics, Social Media, Entrepreneurship, Sales, Investment Management, Photography, Web Design, Outdoor / Adventure Travel, World Travel, Java, Python, HTML/CSS, PHP, SQL, XML, Adobe Design Suite, Microsoft 2007 Suite Experience Analyst, Global Inventory Management Google September 2014  – Present (1 year) Mountain View, California The Global Inventory Management team manages the confluence of Google advertising and publishing, which entails working with partners to maintain the dynamic equilibrium of inventory supply and demand across Google’s properties, YouTube, network partners, and publishing partners with a high speciality in mobile. \n \nResponsibilities: \n \n◘ Create and execute innovative and game-changing inventory strategies, decision making frameworks, and market models using Google’s analytical resources and infrastructure \n◘ Identify and develop proactive responses to early advertising industry trends and opportunities using predictive analytics + big datasets \n◘ Partner with cross-functional stakeholders (product managers, strategy and commercialization teams, engineering, etc.) to provide consultation on high impact projects Features Editor The Luminary May 2013  – Present (2 years 4 months) ◘ Freelance photography and journalism for high caliber events Programmatic Implementation & Solutions Consultant Google July 2013  –  September 2014  (1 year 3 months) Mountain View, California ◘ Collaborate with sales, product, clients, and technical teams to ensure offerings are delivered on time and to expectations \n◘ Develop support plans and provide implementation training, consulting services and best practices to sales counterparts \n◘ Provide input to product on functional requirements and communicate release updates to internal stakeholders Student Ambassador Google August 2011  –  May 2013  (1 year 10 months) Bloomington, Indiana Area ◘ Acted as a liaison between Google and Indiana University Bloomington New Business Development Kanu Designs, LLC September 2012  –  January 2013  (5 months) Bloomington, Indiana Area ◘ Explore new business opportunities and partnerships for Kanu Designs \n◘ Manage relationships with high visibility clients and agencies CIO Indiana University Student Association August 2011  –  December 2012  (1 year 5 months) Indiana University Bloomington ◘ Help manage all technology initiatives of the student government body with a budget of over $200,000 Local Search Quality BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, California ◘ Data mined local maps data through the use of an internal querying language in order to develop analytics to serve as benchmark metrics for the team \n◘ Developed training materials to help prepare the team for an internal database transition Search Quality Evaluation BOLD Intern Google June 2011  –  August 2011  (3 months) Mountain View, California ◘ Created the training and e-learning materials for the Webmaster Communications team to train new members to the point of independence and proficiency \n◘ Participated BOLD training seminars which engage interns in personal development sessions and hands on \ninteractions with senior Google executives Summer Intern Sullivan & Cromwell LLP June 2010  –  August 2010  (3 months) Manhattan, New York ◘ Designed and implemented meta-data queries, record digitalization, and SharePoint intranet website \n◘ Managed a team to optimize user-printer relationships and resource utilization Sales Associate Brookstone April 2008  –  August 2009  (1 year 5 months) Newton, Massachusetts ◘ Sales team leadership \n◘ Helped manage and train staff \n◘ Recognized for sales results Intern Williams College Investment Office May 2009  –  June 2009  (2 months) Boston, Massachusetts ◘ Worked directly under Director of Investment Operations and Risk Management \n◘ Participated and organized the audit of Williams College’s $1.4 billion dollar endowment funds \n◘ Created a handbook for future employees that encompassed all the aspects and infrastructure of the office Analyst, Global Inventory Management Google September 2014  – Present (1 year) Mountain View, California The Global Inventory Management team manages the confluence of Google advertising and publishing, which entails working with partners to maintain the dynamic equilibrium of inventory supply and demand across Google’s properties, YouTube, network partners, and publishing partners with a high speciality in mobile. \n \nResponsibilities: \n \n◘ Create and execute innovative and game-changing inventory strategies, decision making frameworks, and market models using Google’s analytical resources and infrastructure \n◘ Identify and develop proactive responses to early advertising industry trends and opportunities using predictive analytics + big datasets \n◘ Partner with cross-functional stakeholders (product managers, strategy and commercialization teams, engineering, etc.) to provide consultation on high impact projects Analyst, Global Inventory Management Google September 2014  – Present (1 year) Mountain View, California The Global Inventory Management team manages the confluence of Google advertising and publishing, which entails working with partners to maintain the dynamic equilibrium of inventory supply and demand across Google’s properties, YouTube, network partners, and publishing partners with a high speciality in mobile. \n \nResponsibilities: \n \n◘ Create and execute innovative and game-changing inventory strategies, decision making frameworks, and market models using Google’s analytical resources and infrastructure \n◘ Identify and develop proactive responses to early advertising industry trends and opportunities using predictive analytics + big datasets \n◘ Partner with cross-functional stakeholders (product managers, strategy and commercialization teams, engineering, etc.) to provide consultation on high impact projects Features Editor The Luminary May 2013  – Present (2 years 4 months) ◘ Freelance photography and journalism for high caliber events Features Editor The Luminary May 2013  – Present (2 years 4 months) ◘ Freelance photography and journalism for high caliber events Programmatic Implementation & Solutions Consultant Google July 2013  –  September 2014  (1 year 3 months) Mountain View, California ◘ Collaborate with sales, product, clients, and technical teams to ensure offerings are delivered on time and to expectations \n◘ Develop support plans and provide implementation training, consulting services and best practices to sales counterparts \n◘ Provide input to product on functional requirements and communicate release updates to internal stakeholders Programmatic Implementation & Solutions Consultant Google July 2013  –  September 2014  (1 year 3 months) Mountain View, California ◘ Collaborate with sales, product, clients, and technical teams to ensure offerings are delivered on time and to expectations \n◘ Develop support plans and provide implementation training, consulting services and best practices to sales counterparts \n◘ Provide input to product on functional requirements and communicate release updates to internal stakeholders Student Ambassador Google August 2011  –  May 2013  (1 year 10 months) Bloomington, Indiana Area ◘ Acted as a liaison between Google and Indiana University Bloomington Student Ambassador Google August 2011  –  May 2013  (1 year 10 months) Bloomington, Indiana Area ◘ Acted as a liaison between Google and Indiana University Bloomington New Business Development Kanu Designs, LLC September 2012  –  January 2013  (5 months) Bloomington, Indiana Area ◘ Explore new business opportunities and partnerships for Kanu Designs \n◘ Manage relationships with high visibility clients and agencies New Business Development Kanu Designs, LLC September 2012  –  January 2013  (5 months) Bloomington, Indiana Area ◘ Explore new business opportunities and partnerships for Kanu Designs \n◘ Manage relationships with high visibility clients and agencies CIO Indiana University Student Association August 2011  –  December 2012  (1 year 5 months) Indiana University Bloomington ◘ Help manage all technology initiatives of the student government body with a budget of over $200,000 CIO Indiana University Student Association August 2011  –  December 2012  (1 year 5 months) Indiana University Bloomington ◘ Help manage all technology initiatives of the student government body with a budget of over $200,000 Local Search Quality BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, California ◘ Data mined local maps data through the use of an internal querying language in order to develop analytics to serve as benchmark metrics for the team \n◘ Developed training materials to help prepare the team for an internal database transition Local Search Quality BOLD Intern Google June 2012  –  August 2012  (3 months) Mountain View, California ◘ Data mined local maps data through the use of an internal querying language in order to develop analytics to serve as benchmark metrics for the team \n◘ Developed training materials to help prepare the team for an internal database transition Search Quality Evaluation BOLD Intern Google June 2011  –  August 2011  (3 months) Mountain View, California ◘ Created the training and e-learning materials for the Webmaster Communications team to train new members to the point of independence and proficiency \n◘ Participated BOLD training seminars which engage interns in personal development sessions and hands on \ninteractions with senior Google executives Search Quality Evaluation BOLD Intern Google June 2011  –  August 2011  (3 months) Mountain View, California ◘ Created the training and e-learning materials for the Webmaster Communications team to train new members to the point of independence and proficiency \n◘ Participated BOLD training seminars which engage interns in personal development sessions and hands on \ninteractions with senior Google executives Summer Intern Sullivan & Cromwell LLP June 2010  –  August 2010  (3 months) Manhattan, New York ◘ Designed and implemented meta-data queries, record digitalization, and SharePoint intranet website \n◘ Managed a team to optimize user-printer relationships and resource utilization Summer Intern Sullivan & Cromwell LLP June 2010  –  August 2010  (3 months) Manhattan, New York ◘ Designed and implemented meta-data queries, record digitalization, and SharePoint intranet website \n◘ Managed a team to optimize user-printer relationships and resource utilization Sales Associate Brookstone April 2008  –  August 2009  (1 year 5 months) Newton, Massachusetts ◘ Sales team leadership \n◘ Helped manage and train staff \n◘ Recognized for sales results Sales Associate Brookstone April 2008  –  August 2009  (1 year 5 months) Newton, Massachusetts ◘ Sales team leadership \n◘ Helped manage and train staff \n◘ Recognized for sales results Intern Williams College Investment Office May 2009  –  June 2009  (2 months) Boston, Massachusetts ◘ Worked directly under Director of Investment Operations and Risk Management \n◘ Participated and organized the audit of Williams College’s $1.4 billion dollar endowment funds \n◘ Created a handbook for future employees that encompassed all the aspects and infrastructure of the office Intern Williams College Investment Office May 2009  –  June 2009  (2 months) Boston, Massachusetts ◘ Worked directly under Director of Investment Operations and Risk Management \n◘ Participated and organized the audit of Williams College’s $1.4 billion dollar endowment funds \n◘ Created a handbook for future employees that encompassed all the aspects and infrastructure of the office Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Entrepreneurship Breakfast Social Media Analytics Resume Writing Personal Branding Strategic Thinking Data Mining Spanish SQL Web Design Business Strategy Adobe Creative Suite HTML Photography Online Advertising Sales Process Marketing Skiing Backpacking Data Analysis Blogging Facebook Innovative Problem... Informatics Dance Personal Development Interviews SEO Organizing Microsoft Technologies SEM Interviewing Programmatic Marketing Sales Ski Management See 22+     See less Skills  Entrepreneurship Breakfast Social Media Analytics Resume Writing Personal Branding Strategic Thinking Data Mining Spanish SQL Web Design Business Strategy Adobe Creative Suite HTML Photography Online Advertising Sales Process Marketing Skiing Backpacking Data Analysis Blogging Facebook Innovative Problem... Informatics Dance Personal Development Interviews SEO Organizing Microsoft Technologies SEM Interviewing Programmatic Marketing Sales Ski Management See 22+     See less Entrepreneurship Breakfast Social Media Analytics Resume Writing Personal Branding Strategic Thinking Data Mining Spanish SQL Web Design Business Strategy Adobe Creative Suite HTML Photography Online Advertising Sales Process Marketing Skiing Backpacking Data Analysis Blogging Facebook Innovative Problem... Informatics Dance Personal Development Interviews SEO Organizing Microsoft Technologies SEM Interviewing Programmatic Marketing Sales Ski Management See 22+     See less Entrepreneurship Breakfast Social Media Analytics Resume Writing Personal Branding Strategic Thinking Data Mining Spanish SQL Web Design Business Strategy Adobe Creative Suite HTML Photography Online Advertising Sales Process Marketing Skiing Backpacking Data Analysis Blogging Facebook Innovative Problem... Informatics Dance Personal Development Interviews SEO Organizing Microsoft Technologies SEM Interviewing Programmatic Marketing Sales Ski Management See 22+     See less Education Indiana University - School of Informatics & Computing Bachelor of Science (BS),  Informatics and Computing 2009  – 2012 Indiana University - Kelley School of Business BS,  Informatics and Business 2009  – 2012 Activities and Societies:  Kelley Living Learning Center ,  Global Sales Leadership Society ,  Sigma Alpha Mu Fraternity ,  Pi Sigma Epsilon Business Fraternity Centro de Lenguas e Intercambio Cultural (CLIC) Sevilla N/A,  Intensive Spanish Immersion 2012  – 2012 Lived with a host family in Seville, Spain and studied Spanish grammer, phonetics, vocabulary, and culture in an intensive immersion environment. Weston High School 2005  – 2009 Indiana University - School of Informatics & Computing Bachelor of Science (BS),  Informatics and Computing 2009  – 2012 Indiana University - School of Informatics & Computing Bachelor of Science (BS),  Informatics and Computing 2009  – 2012 Indiana University - School of Informatics & Computing Bachelor of Science (BS),  Informatics and Computing 2009  – 2012 Indiana University - Kelley School of Business BS,  Informatics and Business 2009  – 2012 Activities and Societies:  Kelley Living Learning Center ,  Global Sales Leadership Society ,  Sigma Alpha Mu Fraternity ,  Pi Sigma Epsilon Business Fraternity Indiana University - Kelley School of Business BS,  Informatics and Business 2009  – 2012 Activities and Societies:  Kelley Living Learning Center ,  Global Sales Leadership Society ,  Sigma Alpha Mu Fraternity ,  Pi Sigma Epsilon Business Fraternity Indiana University - Kelley School of Business BS,  Informatics and Business 2009  – 2012 Activities and Societies:  Kelley Living Learning Center ,  Global Sales Leadership Society ,  Sigma Alpha Mu Fraternity ,  Pi Sigma Epsilon Business Fraternity Centro de Lenguas e Intercambio Cultural (CLIC) Sevilla N/A,  Intensive Spanish Immersion 2012  – 2012 Lived with a host family in Seville, Spain and studied Spanish grammer, phonetics, vocabulary, and culture in an intensive immersion environment. Centro de Lenguas e Intercambio Cultural (CLIC) Sevilla N/A,  Intensive Spanish Immersion 2012  – 2012 Lived with a host family in Seville, Spain and studied Spanish grammer, phonetics, vocabulary, and culture in an intensive immersion environment. Centro de Lenguas e Intercambio Cultural (CLIC) Sevilla N/A,  Intensive Spanish Immersion 2012  – 2012 Lived with a host family in Seville, Spain and studied Spanish grammer, phonetics, vocabulary, and culture in an intensive immersion environment. Weston High School 2005  – 2009 Weston High School 2005  – 2009 Weston High School 2005  – 2009 Honors & Awards Additional Honors & Awards Eagle Scout - Boy Scouts of America, June 2007  \nPhotography - Boston Globe Scholastic Art Award, April 2008 \nFinalist - World Collegiate Sales Open, November 2010 Additional Honors & Awards Eagle Scout - Boy Scouts of America, June 2007  \nPhotography - Boston Globe Scholastic Art Award, April 2008 \nFinalist - World Collegiate Sales Open, November 2010 Additional Honors & Awards Eagle Scout - Boy Scouts of America, June 2007  \nPhotography - Boston Globe Scholastic Art Award, April 2008 \nFinalist - World Collegiate Sales Open, November 2010 Additional Honors & Awards Eagle Scout - Boy Scouts of America, June 2007  \nPhotography - Boston Globe Scholastic Art Award, April 2008 \nFinalist - World Collegiate Sales Open, November 2010 ", "Experience Associate Product Marketing Manager BOLD Intern Google June 2015  – Present (3 months) Mountain View, CA -International Education Marketing Team - Google for Education Technology Summer Analyst JPMorgan Chase June 2014  –  August 2014  (3 months) -Contributed to increasing efficiencies across three lines of business within the Performance Testing division by implementing a consolidated method for project monitoring via the creation of a Microsoft SharePoint page \n-Assisted in the development of demand/capacity workflows in order to standardize resource sharing, serving as the only intern to work with three Performance Testing team leads in charge of more than 40 other employees \n Emerging Leaders Summit EY June 2014  –  June 2014  (1 month) Washington D.C. Metro Area -Selected as one of 250 of top students from across North America out of over 4,000 applicants \n-One of 6 Global Mindset workshop travel certificate winners for strong interest in emerging markets and international business  \n-Actively participated in professional development and leadership training sessions, asking questions to speakers including the Global Managing Partner of Client Service Elevate Conference PwC May 2014  –  May 2014  (1 month) Chicago, Illinois -Engaged in professional development and leadership activities, as well as programs catered toward career opportunities within the firm and industry \n-Chosen as one of 45 of about 1,800 applicants to participate in the Elevate program specifically for the Advisory practice Student Ambassador Google July 2013  –  May 2014  (11 months) Boston College Overview: \n-Appointed as one of 130 Google Student Ambassadors from top universities throughout the U.S. \n-Acted as a liaison between Google and Boston College, promoting education amongst students and  \nfaculty on the opportunities and benefits Google products offer via social media, meetings, and events \n \nA Few Completed Initiatives: \n-Created a Google+ Community, with over 130 members to date, in order to facilitate easier distribution of Google related content to BC students interested in Google: http://goo.gl/aqXO48 \n-Organized technology focus group, gathering over 150 student sign ups for 12 spots in four days \n-Consolidated and submitted referrals for Google Helpouts for topics ranging from Arabic to Computer Science \n-Hosted a viewing party for the inaugural YouTube Music Awards with over 40 attendees, asking Google trivia questions and giving away a brand new Nexus 7 among other prizes \n-Promoted diversity, veterans, and disability Google student scholarships  \n-Hosted a live \"Career Opportunities in Tech\" Google Hangout with a current University Programs recruiter and Google engineer to give freshman through seniors a clearer picture of the level of technical skill Google looks for at each point in one's college career Protégé Modern Guild February 2014  –  April 2014  (3 months) Greater Boston Area -Participated in online career mentoring program \n-Initiated calls with industry experts from Bain & Company, Nike, and Twitter \n-Experienced live, 1-on-1 mentoring from trained career coach Silicon Valley Field Study Course - Tech Trek West Boston College January 2014  –  March 2014  (3 months) San Francisco & Palo Alto, California -Highly competitively admitted course that is open to sophomores through seniors of all majors to apply  \n-Unique combination of classroom learning, student driven presentations and briefings, and a week-long field study to Silicon Valley \n-Experienced master-class sessions with senior executives, entrepreneurs, and venture partners from Twitter, Sequoia Capital, Highland Capital, Google, Apple, Square, Facebook and 13 more \n-Assigned to prepare class for Google visit - organized readings, executive summary, and PowerPoint presentation on the company Extern ITG January 2014  –  January 2014  (1 month) New York City -Introduced to the Financial Services Industry through ITG's competitive Sophomore Externship Program \n-Learned about the industry via presentations from senior speakers (including CEO Bob Gasser), product demos, and professional development workshops \n-Shadowed various individuals in Client Services Platforms and Portfolio Trading positions Founder Isgro's Produce June 2012  –  August 2013  (1 year 3 months) Jobstown, New Jersey -Founded summer produce business – grew and sold fresh, locally grown fruits, vegetables, and honey  \n-Raised revenue of $53,856 over two summers, with a profit of $17,053 \n-Performed business weekly with prominent local farmer in charge of 1,400 acres \n-Interacted with customers from all backgrounds on a daily basis, maintaining and growing customer base over the course of two years BOLD Immersion Program Participant Google July 2013  –  July 2013  (1 month) Mountain View, California -Selected as 1 of 36 rising sophomores from over 1,000 applicants nationally to participate in career exploration and leadership program at Google world headquarters  \n-Member of winning team of 6 students in case study competition relating to SMB sales and advertising recruitment solutions  \n-Attended professional development workshops on topics such as interview preparation and met with speakers including Megan Smith, VP of Google[x] Ghana Technology & Economic Development Field Study Course Boston College March 2013  –  May 2013  (3 months) Accra, Ghana -Competitively admitted course, one of 21 Boston College students across all grades to participate  \n-Examined the role of technology in catalyzing entrepreneurship and market development in sub-Saharan Africa \n-Visited large US multinational firms, such as Google and GE, as well as small and large Ghanaian firms, often meeting with in-country leads and CEOs \n-Attended the MIT Sloan Africa Business Conference and participated in master class sessions with senior executives and co-founders of six organizations targeting needs in the developing world Host Lo-Q, Inc. June 2012  –  August 2012  (3 months) Jackson, New Jersey -Maintained the integrity of customer lines at major rides, with daily park attendance reaching 14,000 people  \n-Increased sales of new waterproof product through customer interactions and promotion Caterer C. Reed's Catering June 2009  –  August 2012  (3 years 3 months) Columbus, New Jersey -Prepared and served entrées and hors d'oeuvres for occasions ranging from picnics to weddings \n-Managed various jobs, overseeing setup, organization, and packing up of food and equipment Associate Product Marketing Manager BOLD Intern Google June 2015  – Present (3 months) Mountain View, CA -International Education Marketing Team - Google for Education Associate Product Marketing Manager BOLD Intern Google June 2015  – Present (3 months) Mountain View, CA -International Education Marketing Team - Google for Education Technology Summer Analyst JPMorgan Chase June 2014  –  August 2014  (3 months) -Contributed to increasing efficiencies across three lines of business within the Performance Testing division by implementing a consolidated method for project monitoring via the creation of a Microsoft SharePoint page \n-Assisted in the development of demand/capacity workflows in order to standardize resource sharing, serving as the only intern to work with three Performance Testing team leads in charge of more than 40 other employees \n Technology Summer Analyst JPMorgan Chase June 2014  –  August 2014  (3 months) -Contributed to increasing efficiencies across three lines of business within the Performance Testing division by implementing a consolidated method for project monitoring via the creation of a Microsoft SharePoint page \n-Assisted in the development of demand/capacity workflows in order to standardize resource sharing, serving as the only intern to work with three Performance Testing team leads in charge of more than 40 other employees \n Emerging Leaders Summit EY June 2014  –  June 2014  (1 month) Washington D.C. Metro Area -Selected as one of 250 of top students from across North America out of over 4,000 applicants \n-One of 6 Global Mindset workshop travel certificate winners for strong interest in emerging markets and international business  \n-Actively participated in professional development and leadership training sessions, asking questions to speakers including the Global Managing Partner of Client Service Emerging Leaders Summit EY June 2014  –  June 2014  (1 month) Washington D.C. Metro Area -Selected as one of 250 of top students from across North America out of over 4,000 applicants \n-One of 6 Global Mindset workshop travel certificate winners for strong interest in emerging markets and international business  \n-Actively participated in professional development and leadership training sessions, asking questions to speakers including the Global Managing Partner of Client Service Elevate Conference PwC May 2014  –  May 2014  (1 month) Chicago, Illinois -Engaged in professional development and leadership activities, as well as programs catered toward career opportunities within the firm and industry \n-Chosen as one of 45 of about 1,800 applicants to participate in the Elevate program specifically for the Advisory practice Elevate Conference PwC May 2014  –  May 2014  (1 month) Chicago, Illinois -Engaged in professional development and leadership activities, as well as programs catered toward career opportunities within the firm and industry \n-Chosen as one of 45 of about 1,800 applicants to participate in the Elevate program specifically for the Advisory practice Student Ambassador Google July 2013  –  May 2014  (11 months) Boston College Overview: \n-Appointed as one of 130 Google Student Ambassadors from top universities throughout the U.S. \n-Acted as a liaison between Google and Boston College, promoting education amongst students and  \nfaculty on the opportunities and benefits Google products offer via social media, meetings, and events \n \nA Few Completed Initiatives: \n-Created a Google+ Community, with over 130 members to date, in order to facilitate easier distribution of Google related content to BC students interested in Google: http://goo.gl/aqXO48 \n-Organized technology focus group, gathering over 150 student sign ups for 12 spots in four days \n-Consolidated and submitted referrals for Google Helpouts for topics ranging from Arabic to Computer Science \n-Hosted a viewing party for the inaugural YouTube Music Awards with over 40 attendees, asking Google trivia questions and giving away a brand new Nexus 7 among other prizes \n-Promoted diversity, veterans, and disability Google student scholarships  \n-Hosted a live \"Career Opportunities in Tech\" Google Hangout with a current University Programs recruiter and Google engineer to give freshman through seniors a clearer picture of the level of technical skill Google looks for at each point in one's college career Student Ambassador Google July 2013  –  May 2014  (11 months) Boston College Overview: \n-Appointed as one of 130 Google Student Ambassadors from top universities throughout the U.S. \n-Acted as a liaison between Google and Boston College, promoting education amongst students and  \nfaculty on the opportunities and benefits Google products offer via social media, meetings, and events \n \nA Few Completed Initiatives: \n-Created a Google+ Community, with over 130 members to date, in order to facilitate easier distribution of Google related content to BC students interested in Google: http://goo.gl/aqXO48 \n-Organized technology focus group, gathering over 150 student sign ups for 12 spots in four days \n-Consolidated and submitted referrals for Google Helpouts for topics ranging from Arabic to Computer Science \n-Hosted a viewing party for the inaugural YouTube Music Awards with over 40 attendees, asking Google trivia questions and giving away a brand new Nexus 7 among other prizes \n-Promoted diversity, veterans, and disability Google student scholarships  \n-Hosted a live \"Career Opportunities in Tech\" Google Hangout with a current University Programs recruiter and Google engineer to give freshman through seniors a clearer picture of the level of technical skill Google looks for at each point in one's college career Protégé Modern Guild February 2014  –  April 2014  (3 months) Greater Boston Area -Participated in online career mentoring program \n-Initiated calls with industry experts from Bain & Company, Nike, and Twitter \n-Experienced live, 1-on-1 mentoring from trained career coach Protégé Modern Guild February 2014  –  April 2014  (3 months) Greater Boston Area -Participated in online career mentoring program \n-Initiated calls with industry experts from Bain & Company, Nike, and Twitter \n-Experienced live, 1-on-1 mentoring from trained career coach Silicon Valley Field Study Course - Tech Trek West Boston College January 2014  –  March 2014  (3 months) San Francisco & Palo Alto, California -Highly competitively admitted course that is open to sophomores through seniors of all majors to apply  \n-Unique combination of classroom learning, student driven presentations and briefings, and a week-long field study to Silicon Valley \n-Experienced master-class sessions with senior executives, entrepreneurs, and venture partners from Twitter, Sequoia Capital, Highland Capital, Google, Apple, Square, Facebook and 13 more \n-Assigned to prepare class for Google visit - organized readings, executive summary, and PowerPoint presentation on the company Silicon Valley Field Study Course - Tech Trek West Boston College January 2014  –  March 2014  (3 months) San Francisco & Palo Alto, California -Highly competitively admitted course that is open to sophomores through seniors of all majors to apply  \n-Unique combination of classroom learning, student driven presentations and briefings, and a week-long field study to Silicon Valley \n-Experienced master-class sessions with senior executives, entrepreneurs, and venture partners from Twitter, Sequoia Capital, Highland Capital, Google, Apple, Square, Facebook and 13 more \n-Assigned to prepare class for Google visit - organized readings, executive summary, and PowerPoint presentation on the company Extern ITG January 2014  –  January 2014  (1 month) New York City -Introduced to the Financial Services Industry through ITG's competitive Sophomore Externship Program \n-Learned about the industry via presentations from senior speakers (including CEO Bob Gasser), product demos, and professional development workshops \n-Shadowed various individuals in Client Services Platforms and Portfolio Trading positions Extern ITG January 2014  –  January 2014  (1 month) New York City -Introduced to the Financial Services Industry through ITG's competitive Sophomore Externship Program \n-Learned about the industry via presentations from senior speakers (including CEO Bob Gasser), product demos, and professional development workshops \n-Shadowed various individuals in Client Services Platforms and Portfolio Trading positions Founder Isgro's Produce June 2012  –  August 2013  (1 year 3 months) Jobstown, New Jersey -Founded summer produce business – grew and sold fresh, locally grown fruits, vegetables, and honey  \n-Raised revenue of $53,856 over two summers, with a profit of $17,053 \n-Performed business weekly with prominent local farmer in charge of 1,400 acres \n-Interacted with customers from all backgrounds on a daily basis, maintaining and growing customer base over the course of two years Founder Isgro's Produce June 2012  –  August 2013  (1 year 3 months) Jobstown, New Jersey -Founded summer produce business – grew and sold fresh, locally grown fruits, vegetables, and honey  \n-Raised revenue of $53,856 over two summers, with a profit of $17,053 \n-Performed business weekly with prominent local farmer in charge of 1,400 acres \n-Interacted with customers from all backgrounds on a daily basis, maintaining and growing customer base over the course of two years BOLD Immersion Program Participant Google July 2013  –  July 2013  (1 month) Mountain View, California -Selected as 1 of 36 rising sophomores from over 1,000 applicants nationally to participate in career exploration and leadership program at Google world headquarters  \n-Member of winning team of 6 students in case study competition relating to SMB sales and advertising recruitment solutions  \n-Attended professional development workshops on topics such as interview preparation and met with speakers including Megan Smith, VP of Google[x] BOLD Immersion Program Participant Google July 2013  –  July 2013  (1 month) Mountain View, California -Selected as 1 of 36 rising sophomores from over 1,000 applicants nationally to participate in career exploration and leadership program at Google world headquarters  \n-Member of winning team of 6 students in case study competition relating to SMB sales and advertising recruitment solutions  \n-Attended professional development workshops on topics such as interview preparation and met with speakers including Megan Smith, VP of Google[x] Ghana Technology & Economic Development Field Study Course Boston College March 2013  –  May 2013  (3 months) Accra, Ghana -Competitively admitted course, one of 21 Boston College students across all grades to participate  \n-Examined the role of technology in catalyzing entrepreneurship and market development in sub-Saharan Africa \n-Visited large US multinational firms, such as Google and GE, as well as small and large Ghanaian firms, often meeting with in-country leads and CEOs \n-Attended the MIT Sloan Africa Business Conference and participated in master class sessions with senior executives and co-founders of six organizations targeting needs in the developing world Ghana Technology & Economic Development Field Study Course Boston College March 2013  –  May 2013  (3 months) Accra, Ghana -Competitively admitted course, one of 21 Boston College students across all grades to participate  \n-Examined the role of technology in catalyzing entrepreneurship and market development in sub-Saharan Africa \n-Visited large US multinational firms, such as Google and GE, as well as small and large Ghanaian firms, often meeting with in-country leads and CEOs \n-Attended the MIT Sloan Africa Business Conference and participated in master class sessions with senior executives and co-founders of six organizations targeting needs in the developing world Host Lo-Q, Inc. June 2012  –  August 2012  (3 months) Jackson, New Jersey -Maintained the integrity of customer lines at major rides, with daily park attendance reaching 14,000 people  \n-Increased sales of new waterproof product through customer interactions and promotion Host Lo-Q, Inc. June 2012  –  August 2012  (3 months) Jackson, New Jersey -Maintained the integrity of customer lines at major rides, with daily park attendance reaching 14,000 people  \n-Increased sales of new waterproof product through customer interactions and promotion Caterer C. Reed's Catering June 2009  –  August 2012  (3 years 3 months) Columbus, New Jersey -Prepared and served entrées and hors d'oeuvres for occasions ranging from picnics to weddings \n-Managed various jobs, overseeing setup, organization, and packing up of food and equipment Caterer C. Reed's Catering June 2009  –  August 2012  (3 years 3 months) Columbus, New Jersey -Prepared and served entrées and hors d'oeuvres for occasions ranging from picnics to weddings \n-Managed various jobs, overseeing setup, organization, and packing up of food and equipment Languages   Skills Leadership Entrepreneurship Strong Work Ethic Technology Eagerness to Learn Social Media Highly self-motivated Teamwork Time Management Personability Public Speaking Google+ Microsoft Office Community Service Tutoring Social Networking Sports Facebook Writing Project Management Microsoft SharePoint See 6+     See less Skills  Leadership Entrepreneurship Strong Work Ethic Technology Eagerness to Learn Social Media Highly self-motivated Teamwork Time Management Personability Public Speaking Google+ Microsoft Office Community Service Tutoring Social Networking Sports Facebook Writing Project Management Microsoft SharePoint See 6+     See less Leadership Entrepreneurship Strong Work Ethic Technology Eagerness to Learn Social Media Highly self-motivated Teamwork Time Management Personability Public Speaking Google+ Microsoft Office Community Service Tutoring Social Networking Sports Facebook Writing Project Management Microsoft SharePoint See 6+     See less Leadership Entrepreneurship Strong Work Ethic Technology Eagerness to Learn Social Media Highly self-motivated Teamwork Time Management Personability Public Speaking Google+ Microsoft Office Community Service Tutoring Social Networking Sports Facebook Writing Project Management Microsoft SharePoint See 6+     See less Education Boston College Bachelor of Science in Management,  Finance & Entrepreneurship ,  International Studies 2012  – 2016 Alpha Sigma Nu Honor Society \nDean's List Activities and Societies:  Technology & Economic Development Ghana Field Study ,  Winston Center for Leadership and Ethics Assistant Director ,  AHANA Management Academy President ,  PULSE Service-Learning Program ,  Volleyball ,  Basketball ,  Tech Trek West Silicon Valley Field Study ,  Portico Teaching Assistant ,  Pedro Arrupe International Service & Immersion Trip ,  Eagle Ops Sports Marketing Program University College Dublin 2014 Other international visits included: Hungary, Italy, Malta, Czech Republic, Poland, England, France, Germany, & Scotland Activities and Societies:  Windsurfing Club ,  International Students Society Harvard Business School Certificate, HBS Summer Venture in Management Program Participant 2015  – 2015 The Harvard Business School Summer Venture in Management Program (SVMP) is a highly selective management training program for rising undergraduate seniors. This program offers participants an opportunity to engage in class discussions led by HBS faculty on current management issues, analyze real-business cases with peers, and gain exposure to the benefits of HBS and other top MBA programs. \n \nStudents are immersed in the renowned case method of instruction and discuss 14 HBS cases on topics including creative industries marketing, entrepreneurship, human capital strategy, and national economic policy. Each day, participants team up to analyze these business cases in preparation to examine and debate ideas through lively class interaction with peers and HBS faculty. \n \nThe 2015 program accepted 88 students from a nation wide applicant pool. Admission is based on academic achievement, demonstrated leadership, and essay responses.  New Egypt High School High School Diploma; Graduated 1 of 131 2008  – 2012 Activities and Societies:  National Honor Society President ,  Future Business Leaders of America Vice President ,  New Jersey Boys State Delegate ,  Model Congress ,  Interact Club ,  Varsity Basketball & Golf Boston College Bachelor of Science in Management,  Finance & Entrepreneurship ,  International Studies 2012  – 2016 Alpha Sigma Nu Honor Society \nDean's List Activities and Societies:  Technology & Economic Development Ghana Field Study ,  Winston Center for Leadership and Ethics Assistant Director ,  AHANA Management Academy President ,  PULSE Service-Learning Program ,  Volleyball ,  Basketball ,  Tech Trek West Silicon Valley Field Study ,  Portico Teaching Assistant ,  Pedro Arrupe International Service & Immersion Trip ,  Eagle Ops Sports Marketing Program Boston College Bachelor of Science in Management,  Finance & Entrepreneurship ,  International Studies 2012  – 2016 Alpha Sigma Nu Honor Society \nDean's List Activities and Societies:  Technology & Economic Development Ghana Field Study ,  Winston Center for Leadership and Ethics Assistant Director ,  AHANA Management Academy President ,  PULSE Service-Learning Program ,  Volleyball ,  Basketball ,  Tech Trek West Silicon Valley Field Study ,  Portico Teaching Assistant ,  Pedro Arrupe International Service & Immersion Trip ,  Eagle Ops Sports Marketing Program Boston College Bachelor of Science in Management,  Finance & Entrepreneurship ,  International Studies 2012  – 2016 Alpha Sigma Nu Honor Society \nDean's List Activities and Societies:  Technology & Economic Development Ghana Field Study ,  Winston Center for Leadership and Ethics Assistant Director ,  AHANA Management Academy President ,  PULSE Service-Learning Program ,  Volleyball ,  Basketball ,  Tech Trek West Silicon Valley Field Study ,  Portico Teaching Assistant ,  Pedro Arrupe International Service & Immersion Trip ,  Eagle Ops Sports Marketing Program University College Dublin 2014 Other international visits included: Hungary, Italy, Malta, Czech Republic, Poland, England, France, Germany, & Scotland Activities and Societies:  Windsurfing Club ,  International Students Society University College Dublin 2014 Other international visits included: Hungary, Italy, Malta, Czech Republic, Poland, England, France, Germany, & Scotland Activities and Societies:  Windsurfing Club ,  International Students Society University College Dublin 2014 Other international visits included: Hungary, Italy, Malta, Czech Republic, Poland, England, France, Germany, & Scotland Activities and Societies:  Windsurfing Club ,  International Students Society Harvard Business School Certificate, HBS Summer Venture in Management Program Participant 2015  – 2015 The Harvard Business School Summer Venture in Management Program (SVMP) is a highly selective management training program for rising undergraduate seniors. This program offers participants an opportunity to engage in class discussions led by HBS faculty on current management issues, analyze real-business cases with peers, and gain exposure to the benefits of HBS and other top MBA programs. \n \nStudents are immersed in the renowned case method of instruction and discuss 14 HBS cases on topics including creative industries marketing, entrepreneurship, human capital strategy, and national economic policy. Each day, participants team up to analyze these business cases in preparation to examine and debate ideas through lively class interaction with peers and HBS faculty. \n \nThe 2015 program accepted 88 students from a nation wide applicant pool. Admission is based on academic achievement, demonstrated leadership, and essay responses.  Harvard Business School Certificate, HBS Summer Venture in Management Program Participant 2015  – 2015 The Harvard Business School Summer Venture in Management Program (SVMP) is a highly selective management training program for rising undergraduate seniors. This program offers participants an opportunity to engage in class discussions led by HBS faculty on current management issues, analyze real-business cases with peers, and gain exposure to the benefits of HBS and other top MBA programs. \n \nStudents are immersed in the renowned case method of instruction and discuss 14 HBS cases on topics including creative industries marketing, entrepreneurship, human capital strategy, and national economic policy. Each day, participants team up to analyze these business cases in preparation to examine and debate ideas through lively class interaction with peers and HBS faculty. \n \nThe 2015 program accepted 88 students from a nation wide applicant pool. Admission is based on academic achievement, demonstrated leadership, and essay responses.  Harvard Business School Certificate, HBS Summer Venture in Management Program Participant 2015  – 2015 The Harvard Business School Summer Venture in Management Program (SVMP) is a highly selective management training program for rising undergraduate seniors. This program offers participants an opportunity to engage in class discussions led by HBS faculty on current management issues, analyze real-business cases with peers, and gain exposure to the benefits of HBS and other top MBA programs. \n \nStudents are immersed in the renowned case method of instruction and discuss 14 HBS cases on topics including creative industries marketing, entrepreneurship, human capital strategy, and national economic policy. Each day, participants team up to analyze these business cases in preparation to examine and debate ideas through lively class interaction with peers and HBS faculty. \n \nThe 2015 program accepted 88 students from a nation wide applicant pool. Admission is based on academic achievement, demonstrated leadership, and essay responses.  New Egypt High School High School Diploma; Graduated 1 of 131 2008  – 2012 Activities and Societies:  National Honor Society President ,  Future Business Leaders of America Vice President ,  New Jersey Boys State Delegate ,  Model Congress ,  Interact Club ,  Varsity Basketball & Golf New Egypt High School High School Diploma; Graduated 1 of 131 2008  – 2012 Activities and Societies:  National Honor Society President ,  Future Business Leaders of America Vice President ,  New Jersey Boys State Delegate ,  Model Congress ,  Interact Club ,  Varsity Basketball & Golf New Egypt High School High School Diploma; Graduated 1 of 131 2008  – 2012 Activities and Societies:  National Honor Society President ,  Future Business Leaders of America Vice President ,  New Jersey Boys State Delegate ,  Model Congress ,  Interact Club ,  Varsity Basketball & Golf Honors & Awards First Honors Dean's List Boston College Alpha Sigma Nu Honor Society Boston College November 2014 -Accepted along with less than 4% of business school class into Alpha Sigma Nu Honor Society of Jesuit Colleges and Universities Boston College Endowed Scholar Boston College -Endowed Scholars are undergraduate students whose education at BC is supported by generous donors to the University. A student is named an Endowed Scholar for a variety of reasons....academic achievement, extracurricular activities, or a combination of factors. \n-Chosen as one of 9 scholars out of about 150 to be featured in the annual Boston College Pops on the Heights Scholarship Gala student video; selected on the basis of academic excellence and campus involvement.  \n McGillycuddy-Logue Travel Grant Recipient McGillycuddy-Logue Center for Undergraduate Global Studies May 2014 -Recipient of travel grant for 2014 fall semester of study at University College Dublin, Ireland's largest and one of Europe's leading research-intensive English speaking universities \n-The McGillycuddy-Logue Center promotes and fosters innovative international learning for undergraduate students at Boston College High School Honors/Awards June 2012 -High Honor Roll, straight A's each semester \n-The Giveback Foundation Scholarship \n-24th Annual Ocean County Superintendent’s Roundtable Student Recognition Award \n-New Egypt Elks Student of the Year Award \n-Quotes for Cash Teachers Insurance Plan of New Jersey Scholarship \n-The Kim and Harold Louie Family Foundation Scholarship \n-Plumstead Township Board of Ed Award for Academic Achievement \n-Ocean County Board of Chosen Freeholder’s Class of 2012 Outstanding Student \n-PTO Scholar Awards \n-Roebling Bank Award \n First Honors Dean's List Boston College First Honors Dean's List Boston College First Honors Dean's List Boston College Alpha Sigma Nu Honor Society Boston College November 2014 -Accepted along with less than 4% of business school class into Alpha Sigma Nu Honor Society of Jesuit Colleges and Universities Alpha Sigma Nu Honor Society Boston College November 2014 -Accepted along with less than 4% of business school class into Alpha Sigma Nu Honor Society of Jesuit Colleges and Universities Alpha Sigma Nu Honor Society Boston College November 2014 -Accepted along with less than 4% of business school class into Alpha Sigma Nu Honor Society of Jesuit Colleges and Universities Boston College Endowed Scholar Boston College -Endowed Scholars are undergraduate students whose education at BC is supported by generous donors to the University. A student is named an Endowed Scholar for a variety of reasons....academic achievement, extracurricular activities, or a combination of factors. \n-Chosen as one of 9 scholars out of about 150 to be featured in the annual Boston College Pops on the Heights Scholarship Gala student video; selected on the basis of academic excellence and campus involvement.  \n Boston College Endowed Scholar Boston College -Endowed Scholars are undergraduate students whose education at BC is supported by generous donors to the University. A student is named an Endowed Scholar for a variety of reasons....academic achievement, extracurricular activities, or a combination of factors. \n-Chosen as one of 9 scholars out of about 150 to be featured in the annual Boston College Pops on the Heights Scholarship Gala student video; selected on the basis of academic excellence and campus involvement.  \n Boston College Endowed Scholar Boston College -Endowed Scholars are undergraduate students whose education at BC is supported by generous donors to the University. A student is named an Endowed Scholar for a variety of reasons....academic achievement, extracurricular activities, or a combination of factors. \n-Chosen as one of 9 scholars out of about 150 to be featured in the annual Boston College Pops on the Heights Scholarship Gala student video; selected on the basis of academic excellence and campus involvement.  \n McGillycuddy-Logue Travel Grant Recipient McGillycuddy-Logue Center for Undergraduate Global Studies May 2014 -Recipient of travel grant for 2014 fall semester of study at University College Dublin, Ireland's largest and one of Europe's leading research-intensive English speaking universities \n-The McGillycuddy-Logue Center promotes and fosters innovative international learning for undergraduate students at Boston College McGillycuddy-Logue Travel Grant Recipient McGillycuddy-Logue Center for Undergraduate Global Studies May 2014 -Recipient of travel grant for 2014 fall semester of study at University College Dublin, Ireland's largest and one of Europe's leading research-intensive English speaking universities \n-The McGillycuddy-Logue Center promotes and fosters innovative international learning for undergraduate students at Boston College McGillycuddy-Logue Travel Grant Recipient McGillycuddy-Logue Center for Undergraduate Global Studies May 2014 -Recipient of travel grant for 2014 fall semester of study at University College Dublin, Ireland's largest and one of Europe's leading research-intensive English speaking universities \n-The McGillycuddy-Logue Center promotes and fosters innovative international learning for undergraduate students at Boston College High School Honors/Awards June 2012 -High Honor Roll, straight A's each semester \n-The Giveback Foundation Scholarship \n-24th Annual Ocean County Superintendent’s Roundtable Student Recognition Award \n-New Egypt Elks Student of the Year Award \n-Quotes for Cash Teachers Insurance Plan of New Jersey Scholarship \n-The Kim and Harold Louie Family Foundation Scholarship \n-Plumstead Township Board of Ed Award for Academic Achievement \n-Ocean County Board of Chosen Freeholder’s Class of 2012 Outstanding Student \n-PTO Scholar Awards \n-Roebling Bank Award \n High School Honors/Awards June 2012 -High Honor Roll, straight A's each semester \n-The Giveback Foundation Scholarship \n-24th Annual Ocean County Superintendent’s Roundtable Student Recognition Award \n-New Egypt Elks Student of the Year Award \n-Quotes for Cash Teachers Insurance Plan of New Jersey Scholarship \n-The Kim and Harold Louie Family Foundation Scholarship \n-Plumstead Township Board of Ed Award for Academic Achievement \n-Ocean County Board of Chosen Freeholder’s Class of 2012 Outstanding Student \n-PTO Scholar Awards \n-Roebling Bank Award \n High School Honors/Awards June 2012 -High Honor Roll, straight A's each semester \n-The Giveback Foundation Scholarship \n-24th Annual Ocean County Superintendent’s Roundtable Student Recognition Award \n-New Egypt Elks Student of the Year Award \n-Quotes for Cash Teachers Insurance Plan of New Jersey Scholarship \n-The Kim and Harold Louie Family Foundation Scholarship \n-Plumstead Township Board of Ed Award for Academic Achievement \n-Ocean County Board of Chosen Freeholder’s Class of 2012 Outstanding Student \n-PTO Scholar Awards \n-Roebling Bank Award \n ", "Summary Dynamic thinker with expertise in program management, human resources and diversity. Looking for increased leadership opportunities and ever in pursuit of new challenges. Summary Dynamic thinker with expertise in program management, human resources and diversity. Looking for increased leadership opportunities and ever in pursuit of new challenges. Dynamic thinker with expertise in program management, human resources and diversity. Looking for increased leadership opportunities and ever in pursuit of new challenges. Dynamic thinker with expertise in program management, human resources and diversity. Looking for increased leadership opportunities and ever in pursuit of new challenges. Experience People Operations Rotation Associate Google July 2014  – Present (1 year 2 months) San Francisco Bay Area Part of a 27 month rotation program gaining deep and cross functional experience at People Operations within Google. Currently in second role as a People Dev Program Specialist where I manage branding and marketing efforts for the Business Associate Program at Google. First role was in YouTube where I performed a blend of data analysis, consulting and program management. Student Advisor Harvard Office of International Education September 2013  –  April 2014  (8 months) Cambridge, MA ● Provided 1:1 and group consultation on study abroad experience to over 50 students. \n● Facilitated bi-annual information sessions for prospective study abroad participants. Intern Harvard Foundation September 2010  –  April 2014  (3 years 8 months) Cambridge, MA ● Administered $50,000 in grants to over 50 on-campus student organizations. \n● Co-headed Associates Program which provides year long guidance and resources to dozens of residential proctors and students improving race relations at Harvard. \n● Directed annual cultural talent showcase with $10,000 budget and over 500 guests. \n● Co-coordinated annual award ceremony which honored over 75 distinguished faculty and students who have improved race relations at Harvard. BOLD Intern, Technical Infrastructure HR Google June 2013  –  August 2013  (3 months) Mountain View, CA ● Created over 12 customized data driven online workbooks to advise company vice presidents in identification and development of top talent as well as facilitating recommendations of appropriate career development resources to potential tech infra leadership successors.  \n● Gathered qualitative and quantitative data from over 23 in depth 60 min 1:1 employee interviews used to create broader written analysis of employee job satisfaction, career goals and leadership needs at Google. \n● Maximized efficiency of an internal tool that rewards outstanding work of employees. In addition to processing over 100 awards through online tool, created standardized procedure to accelerate work flow. BOLD Intern, Engineering University Programs Google June 2012  –  August 2012  (3 months) Mountain View, CA ● Created and ran 3 1.5 hour long development sessions on succeeding in college for rising college freshmen students under Computer Science Summer Institute (CSSI) program.  \n● Directed production of 3 minute promotional video of CSSI program for North America recruitment efforts. \n● Researched and presented analysis of school-specific computer science curriculum to faculty from over 25+ historically black colleges and universities (HBCUs). \n● Overhauled faculty referral system resulting in larger pool of potential hires for Google's engineering programs. Intern, Competitive Intelligence Excellus BCBS May 2011  –  August 2011  (4 months) Rochester, NY Generated comprehensive 150+ page profiles of competitor insurance companies presented directly to company executives to enhance strategy. Entire Microsoft Office Suite was used to create and present profiles. People Operations Rotation Associate Google July 2014  – Present (1 year 2 months) San Francisco Bay Area Part of a 27 month rotation program gaining deep and cross functional experience at People Operations within Google. Currently in second role as a People Dev Program Specialist where I manage branding and marketing efforts for the Business Associate Program at Google. First role was in YouTube where I performed a blend of data analysis, consulting and program management. People Operations Rotation Associate Google July 2014  – Present (1 year 2 months) San Francisco Bay Area Part of a 27 month rotation program gaining deep and cross functional experience at People Operations within Google. Currently in second role as a People Dev Program Specialist where I manage branding and marketing efforts for the Business Associate Program at Google. First role was in YouTube where I performed a blend of data analysis, consulting and program management. Student Advisor Harvard Office of International Education September 2013  –  April 2014  (8 months) Cambridge, MA ● Provided 1:1 and group consultation on study abroad experience to over 50 students. \n● Facilitated bi-annual information sessions for prospective study abroad participants. Student Advisor Harvard Office of International Education September 2013  –  April 2014  (8 months) Cambridge, MA ● Provided 1:1 and group consultation on study abroad experience to over 50 students. \n● Facilitated bi-annual information sessions for prospective study abroad participants. Intern Harvard Foundation September 2010  –  April 2014  (3 years 8 months) Cambridge, MA ● Administered $50,000 in grants to over 50 on-campus student organizations. \n● Co-headed Associates Program which provides year long guidance and resources to dozens of residential proctors and students improving race relations at Harvard. \n● Directed annual cultural talent showcase with $10,000 budget and over 500 guests. \n● Co-coordinated annual award ceremony which honored over 75 distinguished faculty and students who have improved race relations at Harvard. Intern Harvard Foundation September 2010  –  April 2014  (3 years 8 months) Cambridge, MA ● Administered $50,000 in grants to over 50 on-campus student organizations. \n● Co-headed Associates Program which provides year long guidance and resources to dozens of residential proctors and students improving race relations at Harvard. \n● Directed annual cultural talent showcase with $10,000 budget and over 500 guests. \n● Co-coordinated annual award ceremony which honored over 75 distinguished faculty and students who have improved race relations at Harvard. BOLD Intern, Technical Infrastructure HR Google June 2013  –  August 2013  (3 months) Mountain View, CA ● Created over 12 customized data driven online workbooks to advise company vice presidents in identification and development of top talent as well as facilitating recommendations of appropriate career development resources to potential tech infra leadership successors.  \n● Gathered qualitative and quantitative data from over 23 in depth 60 min 1:1 employee interviews used to create broader written analysis of employee job satisfaction, career goals and leadership needs at Google. \n● Maximized efficiency of an internal tool that rewards outstanding work of employees. In addition to processing over 100 awards through online tool, created standardized procedure to accelerate work flow. BOLD Intern, Technical Infrastructure HR Google June 2013  –  August 2013  (3 months) Mountain View, CA ● Created over 12 customized data driven online workbooks to advise company vice presidents in identification and development of top talent as well as facilitating recommendations of appropriate career development resources to potential tech infra leadership successors.  \n● Gathered qualitative and quantitative data from over 23 in depth 60 min 1:1 employee interviews used to create broader written analysis of employee job satisfaction, career goals and leadership needs at Google. \n● Maximized efficiency of an internal tool that rewards outstanding work of employees. In addition to processing over 100 awards through online tool, created standardized procedure to accelerate work flow. BOLD Intern, Engineering University Programs Google June 2012  –  August 2012  (3 months) Mountain View, CA ● Created and ran 3 1.5 hour long development sessions on succeeding in college for rising college freshmen students under Computer Science Summer Institute (CSSI) program.  \n● Directed production of 3 minute promotional video of CSSI program for North America recruitment efforts. \n● Researched and presented analysis of school-specific computer science curriculum to faculty from over 25+ historically black colleges and universities (HBCUs). \n● Overhauled faculty referral system resulting in larger pool of potential hires for Google's engineering programs. BOLD Intern, Engineering University Programs Google June 2012  –  August 2012  (3 months) Mountain View, CA ● Created and ran 3 1.5 hour long development sessions on succeeding in college for rising college freshmen students under Computer Science Summer Institute (CSSI) program.  \n● Directed production of 3 minute promotional video of CSSI program for North America recruitment efforts. \n● Researched and presented analysis of school-specific computer science curriculum to faculty from over 25+ historically black colleges and universities (HBCUs). \n● Overhauled faculty referral system resulting in larger pool of potential hires for Google's engineering programs. Intern, Competitive Intelligence Excellus BCBS May 2011  –  August 2011  (4 months) Rochester, NY Generated comprehensive 150+ page profiles of competitor insurance companies presented directly to company executives to enhance strategy. Entire Microsoft Office Suite was used to create and present profiles. Intern, Competitive Intelligence Excellus BCBS May 2011  –  August 2011  (4 months) Rochester, NY Generated comprehensive 150+ page profiles of competitor insurance companies presented directly to company executives to enhance strategy. Entire Microsoft Office Suite was used to create and present profiles. Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Leadership Qualitative Research French Analysis Higher Education Race Relations Project Management Human Resources Interviews Event Planning Business Strategy Consulting Skills  Leadership Qualitative Research French Analysis Higher Education Race Relations Project Management Human Resources Interviews Event Planning Business Strategy Consulting Leadership Qualitative Research French Analysis Higher Education Race Relations Project Management Human Resources Interviews Event Planning Business Strategy Consulting Leadership Qualitative Research French Analysis Higher Education Race Relations Project Management Human Resources Interviews Event Planning Business Strategy Consulting Education Harvard College Bachelor of Arts (B.A.),  Social Anthropology 2010  – 2014 Activities and Societies:  Delta Gamma Zeta Phi ,  Harvard College Wine Society (In Vino Veritas) Columbia-Penn Program in Paris at Reid Hall 2012  – 2013 Intensive year long immersion in French language and culture through coursework taught solely in French and habitation with French host family. Harvard College Bachelor of Arts (B.A.),  Social Anthropology 2010  – 2014 Activities and Societies:  Delta Gamma Zeta Phi ,  Harvard College Wine Society (In Vino Veritas) Harvard College Bachelor of Arts (B.A.),  Social Anthropology 2010  – 2014 Activities and Societies:  Delta Gamma Zeta Phi ,  Harvard College Wine Society (In Vino Veritas) Harvard College Bachelor of Arts (B.A.),  Social Anthropology 2010  – 2014 Activities and Societies:  Delta Gamma Zeta Phi ,  Harvard College Wine Society (In Vino Veritas) Columbia-Penn Program in Paris at Reid Hall 2012  – 2013 Intensive year long immersion in French language and culture through coursework taught solely in French and habitation with French host family. Columbia-Penn Program in Paris at Reid Hall 2012  – 2013 Intensive year long immersion in French language and culture through coursework taught solely in French and habitation with French host family. Columbia-Penn Program in Paris at Reid Hall 2012  – 2013 Intensive year long immersion in French language and culture through coursework taught solely in French and habitation with French host family. Honors & Awards ", "Experience DoubleClick Solutions Consultant Google 2013  – Present (2 years) New York, NY AdWords Account Manager Google 2012  –  2013  (1 year) Mountain View, CA UPenn Campus Ambassador Google 2011  –  2012  (1 year) Philadelphia, PA AdWords BOLD Intern Google 2011  –  2011  (less than a year) Mountain View, CA Digital Marketing Intern Clinton Foundation 2010  –  2010  (less than a year) New York, NY DoubleClick Solutions Consultant Google 2013  – Present (2 years) New York, NY DoubleClick Solutions Consultant Google 2013  – Present (2 years) New York, NY AdWords Account Manager Google 2012  –  2013  (1 year) Mountain View, CA AdWords Account Manager Google 2012  –  2013  (1 year) Mountain View, CA UPenn Campus Ambassador Google 2011  –  2012  (1 year) Philadelphia, PA UPenn Campus Ambassador Google 2011  –  2012  (1 year) Philadelphia, PA AdWords BOLD Intern Google 2011  –  2011  (less than a year) Mountain View, CA AdWords BOLD Intern Google 2011  –  2011  (less than a year) Mountain View, CA Digital Marketing Intern Clinton Foundation 2010  –  2010  (less than a year) New York, NY Digital Marketing Intern Clinton Foundation 2010  –  2010  (less than a year) New York, NY Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Spanish Mandarin Google Adwords Microsoft Office Microsoft Excel Photoshop Google Apps Qualitative Research Data Analysis Social Media Event Planning Advertising Leadership Google Analytics Digital Marketing Analysis Online Marketing Marketing Stata See 4+     See less Skills  Spanish Mandarin Google Adwords Microsoft Office Microsoft Excel Photoshop Google Apps Qualitative Research Data Analysis Social Media Event Planning Advertising Leadership Google Analytics Digital Marketing Analysis Online Marketing Marketing Stata See 4+     See less Spanish Mandarin Google Adwords Microsoft Office Microsoft Excel Photoshop Google Apps Qualitative Research Data Analysis Social Media Event Planning Advertising Leadership Google Analytics Digital Marketing Analysis Online Marketing Marketing Stata See 4+     See less Spanish Mandarin Google Adwords Microsoft Office Microsoft Excel Photoshop Google Apps Qualitative Research Data Analysis Social Media Event Planning Advertising Leadership Google Analytics Digital Marketing Analysis Online Marketing Marketing Stata See 4+     See less Education University of Pennsylvania B.A. Carol Morgan School of Santo Domingo High School University of Pennsylvania B.A. University of Pennsylvania B.A. University of Pennsylvania B.A. Carol Morgan School of Santo Domingo High School Carol Morgan School of Santo Domingo High School Carol Morgan School of Santo Domingo High School Honors & Awards ", "Summary Specialties:Trilingual: English, Spanish, French \nAdobe InDesign, Photoshop \nMicrosoft Office (including Access and Excel) Summary Specialties:Trilingual: English, Spanish, French \nAdobe InDesign, Photoshop \nMicrosoft Office (including Access and Excel) Specialties:Trilingual: English, Spanish, French \nAdobe InDesign, Photoshop \nMicrosoft Office (including Access and Excel) Specialties:Trilingual: English, Spanish, French \nAdobe InDesign, Photoshop \nMicrosoft Office (including Access and Excel) Experience Associate Account Strategist Google July 2014  – Present (1 year 2 months) Mountain VIew, CA Student Advisory Boardmember Liberal Arts and Management Program- Indiana University December 2012  –  May 2014  (1 year 6 months) Bloomington, IN Lead and mentor current LAMP students \n \nCommunicate between students and LAMP administrators to help meet student desires and needs for the program \n \nAssist in planning and promoting events, both philanthropic and entertainment, to increase student involvement Team Leader 180 Degrees Consulting January 2012  –  December 2013  (2 years) Bloomington, IN Lead a team of five to construct a long-term business strategy for a non-profit organization to improve overall business and social impact with new, practical solutions for efficiency, sustainability, and marketability \n \nCultivate open contact with client ensuring trust, understanding, and overall satisfaction with final recommendations BOLD Intern- Writing and Content Strategy Team Google June 2013  –  August 2013  (3 months) Mountain View, CA Create a team website featuring key team resources and projects to both organize team internally and spread awareness of team’s mission across Google \n \nIdentify research methodology to provide a consistent framework for the team to quantify future content recommendations \n \nDistill pre-existing company style guides and help create a cohesive Knowledge Voice Style Guide in various forms for company-wide distribution Campus Ambassador-Social Media & Marketing Peace Corps September 2011  –  May 2013  (1 year 9 months) Indiana University Maintain an active Peace Corps presence on local social media sites \n \nPromote upcoming Peace Corps events on campus  \n \nConstruct a marketing strategy for future semesters based on analysis of current student outreach BOLD Intern- Commerce Editorial & Creative Team Google May 2012  –  August 2012  (4 months) Mountain View, CA Completed a library of templates for writers to increase both cost and time efficiency by over 45% \n \nUsed statistical analysis to determine effect of new processes on both merchant satisfaction and user purchase rates \n \nAnalyzed and created plan for current and future Photograph database to reduce risk of repeat stock images on upcoming Offers \nContacted business merchants to compose a library of photographs for future Google Offers marketing campaign Editor Hudson & Holland Newsletter September 2010  –  December 2011  (1 year 4 months) Managed staff and oversaw production of monthly newsletter \n \nEdited story drafts for both content and grammar use \n \nDesigned monthly spreads to keep newsletter organized and eye-catching Editor-In-Chief The Harbinger January 2007  –  May 2010  (3 years 5 months) Zionsville, IN Used various computer programs to design and edit monthly magazine spreads \n \nSelected stories for publications to raise popularity of news-magazine and increase awareness of community events \n \nInterviewed subjects about sensitive topics while practicing basic interpersonal skills Exchange Student IU Honors 2009 June 2009  –  July 2009  (2 months) Brest, France Adapted to the French culture and developed French fluency \n \nEnhanced communication skills by living and interacting with members of different cultures Associate Account Strategist Google July 2014  – Present (1 year 2 months) Mountain VIew, CA Associate Account Strategist Google July 2014  – Present (1 year 2 months) Mountain VIew, CA Student Advisory Boardmember Liberal Arts and Management Program- Indiana University December 2012  –  May 2014  (1 year 6 months) Bloomington, IN Lead and mentor current LAMP students \n \nCommunicate between students and LAMP administrators to help meet student desires and needs for the program \n \nAssist in planning and promoting events, both philanthropic and entertainment, to increase student involvement Student Advisory Boardmember Liberal Arts and Management Program- Indiana University December 2012  –  May 2014  (1 year 6 months) Bloomington, IN Lead and mentor current LAMP students \n \nCommunicate between students and LAMP administrators to help meet student desires and needs for the program \n \nAssist in planning and promoting events, both philanthropic and entertainment, to increase student involvement Team Leader 180 Degrees Consulting January 2012  –  December 2013  (2 years) Bloomington, IN Lead a team of five to construct a long-term business strategy for a non-profit organization to improve overall business and social impact with new, practical solutions for efficiency, sustainability, and marketability \n \nCultivate open contact with client ensuring trust, understanding, and overall satisfaction with final recommendations Team Leader 180 Degrees Consulting January 2012  –  December 2013  (2 years) Bloomington, IN Lead a team of five to construct a long-term business strategy for a non-profit organization to improve overall business and social impact with new, practical solutions for efficiency, sustainability, and marketability \n \nCultivate open contact with client ensuring trust, understanding, and overall satisfaction with final recommendations BOLD Intern- Writing and Content Strategy Team Google June 2013  –  August 2013  (3 months) Mountain View, CA Create a team website featuring key team resources and projects to both organize team internally and spread awareness of team’s mission across Google \n \nIdentify research methodology to provide a consistent framework for the team to quantify future content recommendations \n \nDistill pre-existing company style guides and help create a cohesive Knowledge Voice Style Guide in various forms for company-wide distribution BOLD Intern- Writing and Content Strategy Team Google June 2013  –  August 2013  (3 months) Mountain View, CA Create a team website featuring key team resources and projects to both organize team internally and spread awareness of team’s mission across Google \n \nIdentify research methodology to provide a consistent framework for the team to quantify future content recommendations \n \nDistill pre-existing company style guides and help create a cohesive Knowledge Voice Style Guide in various forms for company-wide distribution Campus Ambassador-Social Media & Marketing Peace Corps September 2011  –  May 2013  (1 year 9 months) Indiana University Maintain an active Peace Corps presence on local social media sites \n \nPromote upcoming Peace Corps events on campus  \n \nConstruct a marketing strategy for future semesters based on analysis of current student outreach Campus Ambassador-Social Media & Marketing Peace Corps September 2011  –  May 2013  (1 year 9 months) Indiana University Maintain an active Peace Corps presence on local social media sites \n \nPromote upcoming Peace Corps events on campus  \n \nConstruct a marketing strategy for future semesters based on analysis of current student outreach BOLD Intern- Commerce Editorial & Creative Team Google May 2012  –  August 2012  (4 months) Mountain View, CA Completed a library of templates for writers to increase both cost and time efficiency by over 45% \n \nUsed statistical analysis to determine effect of new processes on both merchant satisfaction and user purchase rates \n \nAnalyzed and created plan for current and future Photograph database to reduce risk of repeat stock images on upcoming Offers \nContacted business merchants to compose a library of photographs for future Google Offers marketing campaign BOLD Intern- Commerce Editorial & Creative Team Google May 2012  –  August 2012  (4 months) Mountain View, CA Completed a library of templates for writers to increase both cost and time efficiency by over 45% \n \nUsed statistical analysis to determine effect of new processes on both merchant satisfaction and user purchase rates \n \nAnalyzed and created plan for current and future Photograph database to reduce risk of repeat stock images on upcoming Offers \nContacted business merchants to compose a library of photographs for future Google Offers marketing campaign Editor Hudson & Holland Newsletter September 2010  –  December 2011  (1 year 4 months) Managed staff and oversaw production of monthly newsletter \n \nEdited story drafts for both content and grammar use \n \nDesigned monthly spreads to keep newsletter organized and eye-catching Editor Hudson & Holland Newsletter September 2010  –  December 2011  (1 year 4 months) Managed staff and oversaw production of monthly newsletter \n \nEdited story drafts for both content and grammar use \n \nDesigned monthly spreads to keep newsletter organized and eye-catching Editor-In-Chief The Harbinger January 2007  –  May 2010  (3 years 5 months) Zionsville, IN Used various computer programs to design and edit monthly magazine spreads \n \nSelected stories for publications to raise popularity of news-magazine and increase awareness of community events \n \nInterviewed subjects about sensitive topics while practicing basic interpersonal skills Editor-In-Chief The Harbinger January 2007  –  May 2010  (3 years 5 months) Zionsville, IN Used various computer programs to design and edit monthly magazine spreads \n \nSelected stories for publications to raise popularity of news-magazine and increase awareness of community events \n \nInterviewed subjects about sensitive topics while practicing basic interpersonal skills Exchange Student IU Honors 2009 June 2009  –  July 2009  (2 months) Brest, France Adapted to the French culture and developed French fluency \n \nEnhanced communication skills by living and interacting with members of different cultures Exchange Student IU Honors 2009 June 2009  –  July 2009  (2 months) Brest, France Adapted to the French culture and developed French fluency \n \nEnhanced communication skills by living and interacting with members of different cultures Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Google Adwords Online Advertising Spanish Microsoft Office Microsoft Excel English French Photoshop Research InDesign Press Releases Leadership Editing Microsoft Access Adobe Photoshop Adobe InDesign See 1+     See less Skills  Google Adwords Online Advertising Spanish Microsoft Office Microsoft Excel English French Photoshop Research InDesign Press Releases Leadership Editing Microsoft Access Adobe Photoshop Adobe InDesign See 1+     See less Google Adwords Online Advertising Spanish Microsoft Office Microsoft Excel English French Photoshop Research InDesign Press Releases Leadership Editing Microsoft Access Adobe Photoshop Adobe InDesign See 1+     See less Google Adwords Online Advertising Spanish Microsoft Office Microsoft Excel English French Photoshop Research InDesign Press Releases Leadership Editing Microsoft Access Adobe Photoshop Adobe InDesign See 1+     See less Education Indiana University Bachelor’s Degree,  International Communication ,  Marketing ,  Liberal Arts & Management Program , GPA: 3.7/4.0 2010  – 2014 Thematic Concentration: International Communication \nRegional Concentration: Western Europe \nFinancing 100% of college expenses through academic scholarships Activities and Societies:  Liberal Arts and Management Certificate Program Indiana University Bachelor’s Degree,  International Communication ,  Marketing ,  Liberal Arts & Management Program , GPA: 3.7/4.0 2010  – 2014 Thematic Concentration: International Communication \nRegional Concentration: Western Europe \nFinancing 100% of college expenses through academic scholarships Activities and Societies:  Liberal Arts and Management Certificate Program Indiana University Bachelor’s Degree,  International Communication ,  Marketing ,  Liberal Arts & Management Program , GPA: 3.7/4.0 2010  – 2014 Thematic Concentration: International Communication \nRegional Concentration: Western Europe \nFinancing 100% of college expenses through academic scholarships Activities and Societies:  Liberal Arts and Management Certificate Program Indiana University Bachelor’s Degree,  International Communication ,  Marketing ,  Liberal Arts & Management Program , GPA: 3.7/4.0 2010  – 2014 Thematic Concentration: International Communication \nRegional Concentration: Western Europe \nFinancing 100% of college expenses through academic scholarships Activities and Societies:  Liberal Arts and Management Certificate Program "]}