{"position": "Communications Manager", "company": "Google", "profiles": ["Summary inquisitive marketer, constant learner, humble leader. \n \nSpecialties: Digital Marketing, Social Marketing, Brand Management, Marketing Strategy, Brand Positioning, Marketing Research, Sales Strategy, Competitive Analysis, Product Marketing, Partnerships. Summary inquisitive marketer, constant learner, humble leader. \n \nSpecialties: Digital Marketing, Social Marketing, Brand Management, Marketing Strategy, Brand Positioning, Marketing Research, Sales Strategy, Competitive Analysis, Product Marketing, Partnerships. inquisitive marketer, constant learner, humble leader. \n \nSpecialties: Digital Marketing, Social Marketing, Brand Management, Marketing Strategy, Brand Positioning, Marketing Research, Sales Strategy, Competitive Analysis, Product Marketing, Partnerships. inquisitive marketer, constant learner, humble leader. \n \nSpecialties: Digital Marketing, Social Marketing, Brand Management, Marketing Strategy, Brand Positioning, Marketing Research, Sales Strategy, Competitive Analysis, Product Marketing, Partnerships. Experience Director, Marketing Google May 2014  – Present (1 year 3 months) Ann Arbor, MI Lead a team of xx of the best data analysts, writers, digital marketers, and strategists working within Google Marketing, who are tasked with shaping and delivering - seamlessly, and in real-time - the consumer, industry, and marketing insights that our customers need to win on the web. Group Marketing Manager - US Large Advertiser Marketing Google 2011  –  May 2014  (3 years) Owning the platforms Google uses to connect with our largest and most strategically important Clients: internal events, external events, customer councils, sites, webinars, and more. (Open) 1 project Think with Google A site with all of Google's research, data, insights, and thought leadership designed for marketers. View (Open) 5 honors and awards Think with Google Best Overall Website - Think Insights (Gold)\nContent Marketing Project of the Year - Think Insights (Silver)\nBest Editorial... View Think with Google Best BtB mobile website View Think with Google one of five finalist in the business category View Think Events - gold award for the \"Best Use of a Custom App\" category\n- silver in the \"Best Combination of Event Technologies (B-to-B)\"... View Think With Google People's choice award for business products and services View Group Marketing Manager - Finance, Auto, Travel, Entertainment, CPG, Healthcare, BtB, C&L Google 2010  –  2011  (1 year) Led the marketing strategy, research, and events for eight industries. \n \n• Promoted from Head of Marketing to Group Product Marketing Manager in November 2009.  \n \n• Managed a team of x individuals to support eight verticals, 30+ sales teams, two sales channels, and 500+ clients through industry specific research, events, marketing collateral and sales strategies. \n \n• Led a cross industry team to create innovative marketing plans to amplify the impact of our custom industry research. Developed a standard methodology that is now used to scale all custom research; initial roll out led to a 10x increase in reach and consumption of the research. \n \n• Chosen to participate in “Stream”, WPP’s gathering of 300 media, creative, and tech leaders from around the world. \n \n• Promoted five team members based on outstanding performance and contributions to sales and marketing. Group Marketing Manager - Automotive, Finance, Entertainment, and Travel Google 2009  –  2010  (1 year) Birmingham, Michigan Led the marketing strategy, research, and events for the auto, finance, entertainment, and travel industries. \n \n• Chosen to lead a team of x individuals in developing the strategies, plans, contacts, thought leadership, and field support necessary to grow the Automotive, Finance, Travel, and Media/Entertainment Industry’s digital advertising spend. Marketing efforts supported 20+ sales teams and 300+ clients. \n \n• Managed a multi-million dollar market research plan designed to establish the connection between online activities and off-line sales, the role of search in shaping consumer buying behavior, and the impact of online video on product consideration and purchase. Plan included 20+ custom research analyses. \n \n• Partnered with sales to develop compelling case studies, webinars, collateral and sales strategies across multiple markets and industries. Information utilized in client presentations, at industry conferences, and in internal strategy meetings to define the business case for search, online video, and display advertising. (Open) 5 recommendations, including: Christina Counts New Business Development & Account Management I had the pleasure of working with Davang over a 4 year span while he was the Automotive Marketing Manager at Google. I was... View Lance Paull Executive Creative Director at Evoke Health I enjoyed working with Davang. He was always willing to learn and apply new ideas and concepts. I found him to be a smart... View 3 more recommendations Industry Marketing Manager - Automotive Google 2007  –  2009  (2 years) Birmingham, Michigan Drove the marketing strategy, research, and events for the auto vertical. \n \n• Led a team of x individuals in developing the strategies, plans, contacts, thought leadership, and field support necessary to grow the Automotive Industry’s digital advertising spend. Supported six sales teams and 75+ clients. \n \n• Created two global marketing events designed to bring industry thought leaders, senior clients, and agency partners together to discuss marketing challenges. Events attended by 500+ partners controlling $1B+ in digital spend. \n \n• Developed and executed seven custom research studies using click-stream and survey based data to understand automotive consumer’s online behavior. Presented research and industry trends at 100+ senior client level meetings. \n \n• Conceptualized and executed the first global auto webinar at Google; viewed by 2,000+ people from 20+ countries.  \n \n• Established an innovative partnership with Polk and Compete, Inc. to create a unique analysis linking online automotive buyer behavior with actual buyer registration data. Resulted in 100+ client meetings and PR coverage. \n \n• Chosen to speak on two major industry panels, JD Power and SEMA. Panels drew 800+ and 200+ people respectively. Product Marketing Manager Ford Motor Company 2006  –  2007  (1 year) Dearborn, Michigan Drove for the packaging, pricing, and positioning of new vehicle programs. \n \n• Managed the marketing elements of the first Ford Global Product Development System (GPDS) based program. The program was developed on time, achieved all profit targets, and was approved by the Board of Directors. Research confirmed polarizing and emotion-evoking design, top choice interior, and overall top choice selection. \n \n• Developed a prototype ordering strategy with the Consumer Marketing team designed to identify early marketing launch needs. Strategy led to a reduction in prototypes resulting in $1.2M+ savings. \n \n• Selected as a member of the Marketing Career Model Team tasked to develop a Marketing Career Development Path, specifically focusing on the Education and Training elements. Communications Manager Ford Motor Company 2005  –  2006  (1 year) Dearborn, Michigan Led media communications and planning for Lincoln cars. \n \n• Developed the communications plan for the new Mercury Milan and Lincoln Zephyr. Managed a six person agency team and led the development of TV, print, experiential and non-traditional launch campaigns with a $100M+ budget.  \n \n• Conceptualized, developed, and launched the Lincoln.com/reachhigher website. The website provided consumers exclusive content, live broadcasts of vehicle reveals, and unique images of the 2007 Lincoln line-up prior to their official unveil. Site received 1.2M unique visitors and generated 30,000+ hand raisers. \n \n• Established Corporate Partnerships with American Airlines and House of Blues. Partnerships enabled development of holistic marketing campaigns including direct mail, print, TV, ride and drives, on site activation, and viral elements. Elements directly resulted in 50,000+ hand raisers and 1,200 sales. \n \n• Created the Milan Makes Your Day experiential campaign to engage consumers in unexpected ways designed around their passion points and the vehicle. Campaign delivered 130% of the hand raiser objective and was covered in USA Today, WSJ, New York Times, Detroit News, and brand/trade publications. (Open) 1 recommendation Sudhir Sahay Executive account director at Edmunds.com Davang is an exceptionally talented marketing professional. He is the rare combination of a good strategic thinker who is also detail-oriented and can successfully execute. The ideas he developed and executed for launching a trio of important... View Marketing Launch Manager Ford Motor Company 2003  –  2005  (2 years) Dearborn, Michigan Led the launch of new vehicles to our internal teams and dealership partners. \n \n• Hired into Ford's Marketing Leadership Program, an accelerated Marketing Management Program. \n \n• “Outstanding” performer (highest rating) in 2003. Promoted in 2004. \n \n• Analyzed target consumer behavior and spending data to determine passion points; created $1M Freestyle Ultimate Tailgate Experience National Tour to capitalize on target customer interest in collegiate sports; established corporate partnerships with Coca-Cola, Adidas, and Snickers to enhance tailgate tour. Assistant Brand Manager The Procter and Gamble Company 2002  –  2002  (less than a year) Cincinnati, Ohio Interned on the PUR brand, working on new product concepts and marketing communications. \n \n• Evaluated new product opportunities in the $13B pet care market. Developed a co-branded product and comprehensive consumer and customer marketing strategies to leverage the brand equity of PUR Water Filtration Systems and IAMS pet food. Created product packaging and positioning concepts. Forecasted $10M Net Present Value. \n \n• Created analytical tool to evaluate the ROI of $5M in media spending for PUR brand promotions. Presented findings and recommendations that shifted merchandising investment strategy. Zone Manager Ford Motor Company 1999  –  2001  (2 years) Dearborn, Michigan Helped dealerships grow market share and profitability. \n \n• “Outstanding” performer (highest rating) 1999-2001. Promoted in 1999 and 2000. \n• Designed sales forecast model and implemented sales strategy in collaboration with ten dealers to generate 15% increase in dealership profits. Resulted in $4M gross profit for Ford. Customer Service Manager Ford Motor Company 1998  –  1999  (1 year) Dearborn, Michigan Partnered with dealers to improve customer service experiences and overall profitability. \n \n• Developed marketing and pricing strategy for fifteen dealership Parts and Service Departments. Increased sales by 13% and generated additional $5M in revenue. Partner D&C collectibles 1992  –  1996  (4 years) Inkster, Michigan • Turned passion for sports into a business. Invested $700k+ (in total) in sports memorabilia inventory including cards, signed material, and other collectibles; achieved average annual sales of $160k and earned net profits of $90k by age 17. Director, Marketing Google May 2014  – Present (1 year 3 months) Ann Arbor, MI Lead a team of xx of the best data analysts, writers, digital marketers, and strategists working within Google Marketing, who are tasked with shaping and delivering - seamlessly, and in real-time - the consumer, industry, and marketing insights that our customers need to win on the web. Director, Marketing Google May 2014  – Present (1 year 3 months) Ann Arbor, MI Lead a team of xx of the best data analysts, writers, digital marketers, and strategists working within Google Marketing, who are tasked with shaping and delivering - seamlessly, and in real-time - the consumer, industry, and marketing insights that our customers need to win on the web. Group Marketing Manager - US Large Advertiser Marketing Google 2011  –  May 2014  (3 years) Owning the platforms Google uses to connect with our largest and most strategically important Clients: internal events, external events, customer councils, sites, webinars, and more. (Open) 1 project Think with Google A site with all of Google's research, data, insights, and thought leadership designed for marketers. View (Open) 5 honors and awards Think with Google Best Overall Website - Think Insights (Gold)\nContent Marketing Project of the Year - Think Insights (Silver)\nBest Editorial... View Think with Google Best BtB mobile website View Think with Google one of five finalist in the business category View Think Events - gold award for the \"Best Use of a Custom App\" category\n- silver in the \"Best Combination of Event Technologies (B-to-B)\"... View Think With Google People's choice award for business products and services View Group Marketing Manager - US Large Advertiser Marketing Google 2011  –  May 2014  (3 years) Owning the platforms Google uses to connect with our largest and most strategically important Clients: internal events, external events, customer councils, sites, webinars, and more. (Open) 1 project Think with Google A site with all of Google's research, data, insights, and thought leadership designed for marketers. View (Open) 5 honors and awards Think with Google Best Overall Website - Think Insights (Gold)\nContent Marketing Project of the Year - Think Insights (Silver)\nBest Editorial... View Think with Google Best BtB mobile website View Think with Google one of five finalist in the business category View Think Events - gold award for the \"Best Use of a Custom App\" category\n- silver in the \"Best Combination of Event Technologies (B-to-B)\"... View Think With Google People's choice award for business products and services View Group Marketing Manager - Finance, Auto, Travel, Entertainment, CPG, Healthcare, BtB, C&L Google 2010  –  2011  (1 year) Led the marketing strategy, research, and events for eight industries. \n \n• Promoted from Head of Marketing to Group Product Marketing Manager in November 2009.  \n \n• Managed a team of x individuals to support eight verticals, 30+ sales teams, two sales channels, and 500+ clients through industry specific research, events, marketing collateral and sales strategies. \n \n• Led a cross industry team to create innovative marketing plans to amplify the impact of our custom industry research. Developed a standard methodology that is now used to scale all custom research; initial roll out led to a 10x increase in reach and consumption of the research. \n \n• Chosen to participate in “Stream”, WPP’s gathering of 300 media, creative, and tech leaders from around the world. \n \n• Promoted five team members based on outstanding performance and contributions to sales and marketing. Group Marketing Manager - Finance, Auto, Travel, Entertainment, CPG, Healthcare, BtB, C&L Google 2010  –  2011  (1 year) Led the marketing strategy, research, and events for eight industries. \n \n• Promoted from Head of Marketing to Group Product Marketing Manager in November 2009.  \n \n• Managed a team of x individuals to support eight verticals, 30+ sales teams, two sales channels, and 500+ clients through industry specific research, events, marketing collateral and sales strategies. \n \n• Led a cross industry team to create innovative marketing plans to amplify the impact of our custom industry research. Developed a standard methodology that is now used to scale all custom research; initial roll out led to a 10x increase in reach and consumption of the research. \n \n• Chosen to participate in “Stream”, WPP’s gathering of 300 media, creative, and tech leaders from around the world. \n \n• Promoted five team members based on outstanding performance and contributions to sales and marketing. Group Marketing Manager - Automotive, Finance, Entertainment, and Travel Google 2009  –  2010  (1 year) Birmingham, Michigan Led the marketing strategy, research, and events for the auto, finance, entertainment, and travel industries. \n \n• Chosen to lead a team of x individuals in developing the strategies, plans, contacts, thought leadership, and field support necessary to grow the Automotive, Finance, Travel, and Media/Entertainment Industry’s digital advertising spend. Marketing efforts supported 20+ sales teams and 300+ clients. \n \n• Managed a multi-million dollar market research plan designed to establish the connection between online activities and off-line sales, the role of search in shaping consumer buying behavior, and the impact of online video on product consideration and purchase. Plan included 20+ custom research analyses. \n \n• Partnered with sales to develop compelling case studies, webinars, collateral and sales strategies across multiple markets and industries. Information utilized in client presentations, at industry conferences, and in internal strategy meetings to define the business case for search, online video, and display advertising. (Open) 5 recommendations, including: Christina Counts New Business Development & Account Management I had the pleasure of working with Davang over a 4 year span while he was the Automotive Marketing Manager at Google. I was... View Lance Paull Executive Creative Director at Evoke Health I enjoyed working with Davang. He was always willing to learn and apply new ideas and concepts. I found him to be a smart... View 3 more recommendations Group Marketing Manager - Automotive, Finance, Entertainment, and Travel Google 2009  –  2010  (1 year) Birmingham, Michigan Led the marketing strategy, research, and events for the auto, finance, entertainment, and travel industries. \n \n• Chosen to lead a team of x individuals in developing the strategies, plans, contacts, thought leadership, and field support necessary to grow the Automotive, Finance, Travel, and Media/Entertainment Industry’s digital advertising spend. Marketing efforts supported 20+ sales teams and 300+ clients. \n \n• Managed a multi-million dollar market research plan designed to establish the connection between online activities and off-line sales, the role of search in shaping consumer buying behavior, and the impact of online video on product consideration and purchase. Plan included 20+ custom research analyses. \n \n• Partnered with sales to develop compelling case studies, webinars, collateral and sales strategies across multiple markets and industries. Information utilized in client presentations, at industry conferences, and in internal strategy meetings to define the business case for search, online video, and display advertising. (Open) 5 recommendations, including: Christina Counts New Business Development & Account Management I had the pleasure of working with Davang over a 4 year span while he was the Automotive Marketing Manager at Google. I was... View Lance Paull Executive Creative Director at Evoke Health I enjoyed working with Davang. He was always willing to learn and apply new ideas and concepts. I found him to be a smart... View 3 more recommendations Industry Marketing Manager - Automotive Google 2007  –  2009  (2 years) Birmingham, Michigan Drove the marketing strategy, research, and events for the auto vertical. \n \n• Led a team of x individuals in developing the strategies, plans, contacts, thought leadership, and field support necessary to grow the Automotive Industry’s digital advertising spend. Supported six sales teams and 75+ clients. \n \n• Created two global marketing events designed to bring industry thought leaders, senior clients, and agency partners together to discuss marketing challenges. Events attended by 500+ partners controlling $1B+ in digital spend. \n \n• Developed and executed seven custom research studies using click-stream and survey based data to understand automotive consumer’s online behavior. Presented research and industry trends at 100+ senior client level meetings. \n \n• Conceptualized and executed the first global auto webinar at Google; viewed by 2,000+ people from 20+ countries.  \n \n• Established an innovative partnership with Polk and Compete, Inc. to create a unique analysis linking online automotive buyer behavior with actual buyer registration data. Resulted in 100+ client meetings and PR coverage. \n \n• Chosen to speak on two major industry panels, JD Power and SEMA. Panels drew 800+ and 200+ people respectively. Industry Marketing Manager - Automotive Google 2007  –  2009  (2 years) Birmingham, Michigan Drove the marketing strategy, research, and events for the auto vertical. \n \n• Led a team of x individuals in developing the strategies, plans, contacts, thought leadership, and field support necessary to grow the Automotive Industry’s digital advertising spend. Supported six sales teams and 75+ clients. \n \n• Created two global marketing events designed to bring industry thought leaders, senior clients, and agency partners together to discuss marketing challenges. Events attended by 500+ partners controlling $1B+ in digital spend. \n \n• Developed and executed seven custom research studies using click-stream and survey based data to understand automotive consumer’s online behavior. Presented research and industry trends at 100+ senior client level meetings. \n \n• Conceptualized and executed the first global auto webinar at Google; viewed by 2,000+ people from 20+ countries.  \n \n• Established an innovative partnership with Polk and Compete, Inc. to create a unique analysis linking online automotive buyer behavior with actual buyer registration data. Resulted in 100+ client meetings and PR coverage. \n \n• Chosen to speak on two major industry panels, JD Power and SEMA. Panels drew 800+ and 200+ people respectively. Product Marketing Manager Ford Motor Company 2006  –  2007  (1 year) Dearborn, Michigan Drove for the packaging, pricing, and positioning of new vehicle programs. \n \n• Managed the marketing elements of the first Ford Global Product Development System (GPDS) based program. The program was developed on time, achieved all profit targets, and was approved by the Board of Directors. Research confirmed polarizing and emotion-evoking design, top choice interior, and overall top choice selection. \n \n• Developed a prototype ordering strategy with the Consumer Marketing team designed to identify early marketing launch needs. Strategy led to a reduction in prototypes resulting in $1.2M+ savings. \n \n• Selected as a member of the Marketing Career Model Team tasked to develop a Marketing Career Development Path, specifically focusing on the Education and Training elements. Product Marketing Manager Ford Motor Company 2006  –  2007  (1 year) Dearborn, Michigan Drove for the packaging, pricing, and positioning of new vehicle programs. \n \n• Managed the marketing elements of the first Ford Global Product Development System (GPDS) based program. The program was developed on time, achieved all profit targets, and was approved by the Board of Directors. Research confirmed polarizing and emotion-evoking design, top choice interior, and overall top choice selection. \n \n• Developed a prototype ordering strategy with the Consumer Marketing team designed to identify early marketing launch needs. Strategy led to a reduction in prototypes resulting in $1.2M+ savings. \n \n• Selected as a member of the Marketing Career Model Team tasked to develop a Marketing Career Development Path, specifically focusing on the Education and Training elements. Communications Manager Ford Motor Company 2005  –  2006  (1 year) Dearborn, Michigan Led media communications and planning for Lincoln cars. \n \n• Developed the communications plan for the new Mercury Milan and Lincoln Zephyr. Managed a six person agency team and led the development of TV, print, experiential and non-traditional launch campaigns with a $100M+ budget.  \n \n• Conceptualized, developed, and launched the Lincoln.com/reachhigher website. The website provided consumers exclusive content, live broadcasts of vehicle reveals, and unique images of the 2007 Lincoln line-up prior to their official unveil. Site received 1.2M unique visitors and generated 30,000+ hand raisers. \n \n• Established Corporate Partnerships with American Airlines and House of Blues. Partnerships enabled development of holistic marketing campaigns including direct mail, print, TV, ride and drives, on site activation, and viral elements. Elements directly resulted in 50,000+ hand raisers and 1,200 sales. \n \n• Created the Milan Makes Your Day experiential campaign to engage consumers in unexpected ways designed around their passion points and the vehicle. Campaign delivered 130% of the hand raiser objective and was covered in USA Today, WSJ, New York Times, Detroit News, and brand/trade publications. (Open) 1 recommendation Sudhir Sahay Executive account director at Edmunds.com Davang is an exceptionally talented marketing professional. He is the rare combination of a good strategic thinker who is also detail-oriented and can successfully execute. The ideas he developed and executed for launching a trio of important... View Communications Manager Ford Motor Company 2005  –  2006  (1 year) Dearborn, Michigan Led media communications and planning for Lincoln cars. \n \n• Developed the communications plan for the new Mercury Milan and Lincoln Zephyr. Managed a six person agency team and led the development of TV, print, experiential and non-traditional launch campaigns with a $100M+ budget.  \n \n• Conceptualized, developed, and launched the Lincoln.com/reachhigher website. The website provided consumers exclusive content, live broadcasts of vehicle reveals, and unique images of the 2007 Lincoln line-up prior to their official unveil. Site received 1.2M unique visitors and generated 30,000+ hand raisers. \n \n• Established Corporate Partnerships with American Airlines and House of Blues. Partnerships enabled development of holistic marketing campaigns including direct mail, print, TV, ride and drives, on site activation, and viral elements. Elements directly resulted in 50,000+ hand raisers and 1,200 sales. \n \n• Created the Milan Makes Your Day experiential campaign to engage consumers in unexpected ways designed around their passion points and the vehicle. Campaign delivered 130% of the hand raiser objective and was covered in USA Today, WSJ, New York Times, Detroit News, and brand/trade publications. (Open) 1 recommendation Sudhir Sahay Executive account director at Edmunds.com Davang is an exceptionally talented marketing professional. He is the rare combination of a good strategic thinker who is also detail-oriented and can successfully execute. The ideas he developed and executed for launching a trio of important... View Marketing Launch Manager Ford Motor Company 2003  –  2005  (2 years) Dearborn, Michigan Led the launch of new vehicles to our internal teams and dealership partners. \n \n• Hired into Ford's Marketing Leadership Program, an accelerated Marketing Management Program. \n \n• “Outstanding” performer (highest rating) in 2003. Promoted in 2004. \n \n• Analyzed target consumer behavior and spending data to determine passion points; created $1M Freestyle Ultimate Tailgate Experience National Tour to capitalize on target customer interest in collegiate sports; established corporate partnerships with Coca-Cola, Adidas, and Snickers to enhance tailgate tour. Marketing Launch Manager Ford Motor Company 2003  –  2005  (2 years) Dearborn, Michigan Led the launch of new vehicles to our internal teams and dealership partners. \n \n• Hired into Ford's Marketing Leadership Program, an accelerated Marketing Management Program. \n \n• “Outstanding” performer (highest rating) in 2003. Promoted in 2004. \n \n• Analyzed target consumer behavior and spending data to determine passion points; created $1M Freestyle Ultimate Tailgate Experience National Tour to capitalize on target customer interest in collegiate sports; established corporate partnerships with Coca-Cola, Adidas, and Snickers to enhance tailgate tour. Assistant Brand Manager The Procter and Gamble Company 2002  –  2002  (less than a year) Cincinnati, Ohio Interned on the PUR brand, working on new product concepts and marketing communications. \n \n• Evaluated new product opportunities in the $13B pet care market. Developed a co-branded product and comprehensive consumer and customer marketing strategies to leverage the brand equity of PUR Water Filtration Systems and IAMS pet food. Created product packaging and positioning concepts. Forecasted $10M Net Present Value. \n \n• Created analytical tool to evaluate the ROI of $5M in media spending for PUR brand promotions. Presented findings and recommendations that shifted merchandising investment strategy. Assistant Brand Manager The Procter and Gamble Company 2002  –  2002  (less than a year) Cincinnati, Ohio Interned on the PUR brand, working on new product concepts and marketing communications. \n \n• Evaluated new product opportunities in the $13B pet care market. Developed a co-branded product and comprehensive consumer and customer marketing strategies to leverage the brand equity of PUR Water Filtration Systems and IAMS pet food. Created product packaging and positioning concepts. Forecasted $10M Net Present Value. \n \n• Created analytical tool to evaluate the ROI of $5M in media spending for PUR brand promotions. Presented findings and recommendations that shifted merchandising investment strategy. Zone Manager Ford Motor Company 1999  –  2001  (2 years) Dearborn, Michigan Helped dealerships grow market share and profitability. \n \n• “Outstanding” performer (highest rating) 1999-2001. Promoted in 1999 and 2000. \n• Designed sales forecast model and implemented sales strategy in collaboration with ten dealers to generate 15% increase in dealership profits. Resulted in $4M gross profit for Ford. Zone Manager Ford Motor Company 1999  –  2001  (2 years) Dearborn, Michigan Helped dealerships grow market share and profitability. \n \n• “Outstanding” performer (highest rating) 1999-2001. Promoted in 1999 and 2000. \n• Designed sales forecast model and implemented sales strategy in collaboration with ten dealers to generate 15% increase in dealership profits. Resulted in $4M gross profit for Ford. Customer Service Manager Ford Motor Company 1998  –  1999  (1 year) Dearborn, Michigan Partnered with dealers to improve customer service experiences and overall profitability. \n \n• Developed marketing and pricing strategy for fifteen dealership Parts and Service Departments. Increased sales by 13% and generated additional $5M in revenue. Customer Service Manager Ford Motor Company 1998  –  1999  (1 year) Dearborn, Michigan Partnered with dealers to improve customer service experiences and overall profitability. \n \n• Developed marketing and pricing strategy for fifteen dealership Parts and Service Departments. Increased sales by 13% and generated additional $5M in revenue. Partner D&C collectibles 1992  –  1996  (4 years) Inkster, Michigan • Turned passion for sports into a business. Invested $700k+ (in total) in sports memorabilia inventory including cards, signed material, and other collectibles; achieved average annual sales of $160k and earned net profits of $90k by age 17. Partner D&C collectibles 1992  –  1996  (4 years) Inkster, Michigan • Turned passion for sports into a business. Invested $700k+ (in total) in sports memorabilia inventory including cards, signed material, and other collectibles; achieved average annual sales of $160k and earned net profits of $90k by age 17. Languages Gujarati Limited working proficiency English Native or bilingual proficiency Gujarati Limited working proficiency English Native or bilingual proficiency Gujarati Limited working proficiency English Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Top Skills 66 Competitive Analysis 65 Marketing Strategy 55 Digital Marketing 44 Product Marketing 42 Marketing 36 Brand Management 31 Strategy 30 Online Advertising 25 Strategic Partnerships 20 Marketing Research Davang also knows about... 17 Automotive 16 Web Analytics 15 Marketing Communications 14 Online Marketing 14 Digital Media 13 Product Development 9 Digital Strategy 9 SEM 7 Management 7 Marketing Management 6 Start-ups 6 Market Research 6 Integrated Marketing 6 Leadership 5 Analytics 4 E-commerce 3 FMCG 3 Positioning 3 Advertising 3 Mobile Marketing 2 Interactive Marketing 2 Social Media Marketing 2 Brand Development 2 Direct Marketing 2 Customer Insight 2 B2B Marketing 2 Web Marketing 2 Lead Generation 2 Email Marketing 1 BtB Marketing 1 PPC 1 Google Adwords 1 Sales 0 Google Analytics 0 Segmentation 0 Customer Acquisition 0 Multi-channel Marketing 0 Mobile Advertising See 23+     See less Skills  Top Skills 66 Competitive Analysis 65 Marketing Strategy 55 Digital Marketing 44 Product Marketing 42 Marketing 36 Brand Management 31 Strategy 30 Online Advertising 25 Strategic Partnerships 20 Marketing Research Davang also knows about... 17 Automotive 16 Web Analytics 15 Marketing Communications 14 Online Marketing 14 Digital Media 13 Product Development 9 Digital Strategy 9 SEM 7 Management 7 Marketing Management 6 Start-ups 6 Market Research 6 Integrated Marketing 6 Leadership 5 Analytics 4 E-commerce 3 FMCG 3 Positioning 3 Advertising 3 Mobile Marketing 2 Interactive Marketing 2 Social Media Marketing 2 Brand Development 2 Direct Marketing 2 Customer Insight 2 B2B Marketing 2 Web Marketing 2 Lead Generation 2 Email Marketing 1 BtB Marketing 1 PPC 1 Google Adwords 1 Sales 0 Google Analytics 0 Segmentation 0 Customer Acquisition 0 Multi-channel Marketing 0 Mobile Advertising See 23+     See less Top Skills 66 Competitive Analysis 65 Marketing Strategy 55 Digital Marketing 44 Product Marketing 42 Marketing 36 Brand Management 31 Strategy 30 Online Advertising 25 Strategic Partnerships 20 Marketing Research Davang also knows about... 17 Automotive 16 Web Analytics 15 Marketing Communications 14 Online Marketing 14 Digital Media 13 Product Development 9 Digital Strategy 9 SEM 7 Management 7 Marketing Management 6 Start-ups 6 Market Research 6 Integrated Marketing 6 Leadership 5 Analytics 4 E-commerce 3 FMCG 3 Positioning 3 Advertising 3 Mobile Marketing 2 Interactive Marketing 2 Social Media Marketing 2 Brand Development 2 Direct Marketing 2 Customer Insight 2 B2B Marketing 2 Web Marketing 2 Lead Generation 2 Email Marketing 1 BtB Marketing 1 PPC 1 Google Adwords 1 Sales 0 Google Analytics 0 Segmentation 0 Customer Acquisition 0 Multi-channel Marketing 0 Mobile Advertising See 23+     See less Top Skills 66 Competitive Analysis 65 Marketing Strategy 55 Digital Marketing 44 Product Marketing 42 Marketing 36 Brand Management 31 Strategy 30 Online Advertising 25 Strategic Partnerships 20 Marketing Research Davang also knows about... 17 Automotive 16 Web Analytics 15 Marketing Communications 14 Online Marketing 14 Digital Media 13 Product Development 9 Digital Strategy 9 SEM 7 Management 7 Marketing Management 6 Start-ups 6 Market Research 6 Integrated Marketing 6 Leadership 5 Analytics 4 E-commerce 3 FMCG 3 Positioning 3 Advertising 3 Mobile Marketing 2 Interactive Marketing 2 Social Media Marketing 2 Brand Development 2 Direct Marketing 2 Customer Insight 2 B2B Marketing 2 Web Marketing 2 Lead Generation 2 Email Marketing 1 BtB Marketing 1 PPC 1 Google Adwords 1 Sales 0 Google Analytics 0 Segmentation 0 Customer Acquisition 0 Multi-channel Marketing 0 Mobile Advertising See 23+     See less                     17 Automotive 16 Web Analytics 15 Marketing Communications 14 Online Marketing 14 Digital Media 13 Product Development 9 Digital Strategy 9 SEM 7 Management 7 Marketing Management 6 Start-ups 6 Market Research 6 Integrated Marketing 6 Leadership 5 Analytics 4 E-commerce 3 FMCG 3 Positioning 3 Advertising 3 Mobile Marketing 2 Interactive Marketing 2 Social Media Marketing 2 Brand Development 2 Direct Marketing 2 Customer Insight 2 B2B Marketing 2 Web Marketing 2 Lead Generation 2 Email Marketing 1 BtB Marketing 1 PPC 1 Google Adwords 1 Sales 0 Google Analytics 0 Segmentation 0 Customer Acquisition 0 Multi-channel Marketing 0 Mobile Advertising Education Yale University - Yale School of Management MBA,  Marketing and Strategy 2001  – 2003 Focus on Marketing and Strategy \n \n• Distinction grade (highest grade given to top 10% of the class) in the following courses: Marketing Strategy, Consumer Behavior, Competitive Strategies, Listening to the Consumer, Product Planning, Leadership, and Business Ethics. Activities and Societies:  • Member of the Student Advisory Council ,  Admissions Committee ,  and Minority Recruiting Committee. University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (BBA),  Marketing , Graduated with Honors 1994  – 1998 • Teaching Assistant for the Introductory BBA Finance course \n \n• Recipient of University of Michigan Honors Convocation Award for academic excellence Activities and Societies:  Pi Kappa Alpha Fraternity Yale University - Yale School of Management MBA,  Marketing and Strategy 2001  – 2003 Focus on Marketing and Strategy \n \n• Distinction grade (highest grade given to top 10% of the class) in the following courses: Marketing Strategy, Consumer Behavior, Competitive Strategies, Listening to the Consumer, Product Planning, Leadership, and Business Ethics. Activities and Societies:  • Member of the Student Advisory Council ,  Admissions Committee ,  and Minority Recruiting Committee. Yale University - Yale School of Management MBA,  Marketing and Strategy 2001  – 2003 Focus on Marketing and Strategy \n \n• Distinction grade (highest grade given to top 10% of the class) in the following courses: Marketing Strategy, Consumer Behavior, Competitive Strategies, Listening to the Consumer, Product Planning, Leadership, and Business Ethics. Activities and Societies:  • Member of the Student Advisory Council ,  Admissions Committee ,  and Minority Recruiting Committee. Yale University - Yale School of Management MBA,  Marketing and Strategy 2001  – 2003 Focus on Marketing and Strategy \n \n• Distinction grade (highest grade given to top 10% of the class) in the following courses: Marketing Strategy, Consumer Behavior, Competitive Strategies, Listening to the Consumer, Product Planning, Leadership, and Business Ethics. Activities and Societies:  • Member of the Student Advisory Council ,  Admissions Committee ,  and Minority Recruiting Committee. University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (BBA),  Marketing , Graduated with Honors 1994  – 1998 • Teaching Assistant for the Introductory BBA Finance course \n \n• Recipient of University of Michigan Honors Convocation Award for academic excellence Activities and Societies:  Pi Kappa Alpha Fraternity University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (BBA),  Marketing , Graduated with Honors 1994  – 1998 • Teaching Assistant for the Introductory BBA Finance course \n \n• Recipient of University of Michigan Honors Convocation Award for academic excellence Activities and Societies:  Pi Kappa Alpha Fraternity University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration (BBA),  Marketing , Graduated with Honors 1994  – 1998 • Teaching Assistant for the Introductory BBA Finance course \n \n• Recipient of University of Michigan Honors Convocation Award for academic excellence Activities and Societies:  Pi Kappa Alpha Fraternity Honors & Awards Think with Google Content Marketing Institute/Content Marketing World awards 2013 Best Overall Website - Think Insights (Gold) \nContent Marketing Project of the Year - Think Insights (Silver) \nBest Editorial - Think Insights (Honorable Mention) \nBest Curated Content Site - Think Insights (Gold) \nBest Overall Design - Think Insights (Bronze) \nBest Email Driven Content Platform - Think Insights Newsletter (Silver) \n Think with Google Web Marketing Assocation 2013 Best BtB mobile website Think with Google SXSW 2013 one of five finalist in the business category Think Events Event Technology Awards 2013 - gold award for the \"Best Use of a Custom App\" category \n- silver in the \"Best Combination of Event Technologies (B-to-B)\" category Think With Google The Webby Award 2014 People's choice award for business products and services Think with Google Content Marketing Institute/Content Marketing World awards 2013 Best Overall Website - Think Insights (Gold) \nContent Marketing Project of the Year - Think Insights (Silver) \nBest Editorial - Think Insights (Honorable Mention) \nBest Curated Content Site - Think Insights (Gold) \nBest Overall Design - Think Insights (Bronze) \nBest Email Driven Content Platform - Think Insights Newsletter (Silver) \n Think with Google Content Marketing Institute/Content Marketing World awards 2013 Best Overall Website - Think Insights (Gold) \nContent Marketing Project of the Year - Think Insights (Silver) \nBest Editorial - Think Insights (Honorable Mention) \nBest Curated Content Site - Think Insights (Gold) \nBest Overall Design - Think Insights (Bronze) \nBest Email Driven Content Platform - Think Insights Newsletter (Silver) \n Think with Google Content Marketing Institute/Content Marketing World awards 2013 Best Overall Website - Think Insights (Gold) \nContent Marketing Project of the Year - Think Insights (Silver) \nBest Editorial - Think Insights (Honorable Mention) \nBest Curated Content Site - Think Insights (Gold) \nBest Overall Design - Think Insights (Bronze) \nBest Email Driven Content Platform - Think Insights Newsletter (Silver) \n Think with Google Web Marketing Assocation 2013 Best BtB mobile website Think with Google Web Marketing Assocation 2013 Best BtB mobile website Think with Google Web Marketing Assocation 2013 Best BtB mobile website Think with Google SXSW 2013 one of five finalist in the business category Think with Google SXSW 2013 one of five finalist in the business category Think with Google SXSW 2013 one of five finalist in the business category Think Events Event Technology Awards 2013 - gold award for the \"Best Use of a Custom App\" category \n- silver in the \"Best Combination of Event Technologies (B-to-B)\" category Think Events Event Technology Awards 2013 - gold award for the \"Best Use of a Custom App\" category \n- silver in the \"Best Combination of Event Technologies (B-to-B)\" category Think Events Event Technology Awards 2013 - gold award for the \"Best Use of a Custom App\" category \n- silver in the \"Best Combination of Event Technologies (B-to-B)\" category Think With Google The Webby Award 2014 People's choice award for business products and services Think With Google The Webby Award 2014 People's choice award for business products and services Think With Google The Webby Award 2014 People's choice award for business products and services ", "Summary Specialties:Project Management \nOnline Video \nOnline Advertising \nOnline Partnerships \nAccount Management \nOnline Marketing \nCommercial Partnerships \nMobile Marketing \nOnline Video \nMobile Video \nInternet Marketing \nMarketing Summary Specialties:Project Management \nOnline Video \nOnline Advertising \nOnline Partnerships \nAccount Management \nOnline Marketing \nCommercial Partnerships \nMobile Marketing \nOnline Video \nMobile Video \nInternet Marketing \nMarketing Specialties:Project Management \nOnline Video \nOnline Advertising \nOnline Partnerships \nAccount Management \nOnline Marketing \nCommercial Partnerships \nMobile Marketing \nOnline Video \nMobile Video \nInternet Marketing \nMarketing Specialties:Project Management \nOnline Video \nOnline Advertising \nOnline Partnerships \nAccount Management \nOnline Marketing \nCommercial Partnerships \nMobile Marketing \nOnline Video \nMobile Video \nInternet Marketing \nMarketing Experience YouTube, Creator Communities Group Manager, Europe Google October 2014  – Present (10 months) Ireland Manage a team of Community Managers covering 6 markets across EMEA.  \nEstablishing team, setting strategy, promoting team internally, coaching, managing, identifying & driving success metrics every quarter. Representing team to wider creator organisation. YouTube Content Operations & Communications Manager, Europe Google January 2012  – Present (3 years 7 months) Dublin YouTube Partnerships Manager, North & Central Europe Google April 2010  –  January 2012  (1 year 10 months) Senior Account Manager Saffron Digital June 2007  –  April 2010  (2 years 11 months) Account manage a number of key accounts for Saffron Digital including UK mobile operators, broadcasters & media companies. Strategic Partnerships Manager Filmnight.com April 2006  –  June 2007  (1 year 3 months) Business Development Exec. Jacob Online Ltd. April 2005  –  April 2006  (1 year 1 month) Product Manager Web Reservations International February 2003  –  January 2005  (2 years) YouTube, Creator Communities Group Manager, Europe Google October 2014  – Present (10 months) Ireland Manage a team of Community Managers covering 6 markets across EMEA.  \nEstablishing team, setting strategy, promoting team internally, coaching, managing, identifying & driving success metrics every quarter. Representing team to wider creator organisation. YouTube, Creator Communities Group Manager, Europe Google October 2014  – Present (10 months) Ireland Manage a team of Community Managers covering 6 markets across EMEA.  \nEstablishing team, setting strategy, promoting team internally, coaching, managing, identifying & driving success metrics every quarter. Representing team to wider creator organisation. YouTube Content Operations & Communications Manager, Europe Google January 2012  – Present (3 years 7 months) Dublin YouTube Content Operations & Communications Manager, Europe Google January 2012  – Present (3 years 7 months) Dublin YouTube Partnerships Manager, North & Central Europe Google April 2010  –  January 2012  (1 year 10 months) YouTube Partnerships Manager, North & Central Europe Google April 2010  –  January 2012  (1 year 10 months) Senior Account Manager Saffron Digital June 2007  –  April 2010  (2 years 11 months) Account manage a number of key accounts for Saffron Digital including UK mobile operators, broadcasters & media companies. Senior Account Manager Saffron Digital June 2007  –  April 2010  (2 years 11 months) Account manage a number of key accounts for Saffron Digital including UK mobile operators, broadcasters & media companies. Strategic Partnerships Manager Filmnight.com April 2006  –  June 2007  (1 year 3 months) Strategic Partnerships Manager Filmnight.com April 2006  –  June 2007  (1 year 3 months) Business Development Exec. Jacob Online Ltd. April 2005  –  April 2006  (1 year 1 month) Business Development Exec. Jacob Online Ltd. April 2005  –  April 2006  (1 year 1 month) Product Manager Web Reservations International February 2003  –  January 2005  (2 years) Product Manager Web Reservations International February 2003  –  January 2005  (2 years) Skills Top Skills 13 Mobile Marketing 10 Online Marketing 6 Affiliate Marketing 6 Online Advertising 6 Business Development 4 Account Management 4 Digital Media 3 Digital Strategy 2 SEO 2 Marketing Ciara also knows about... 2 YouTube 2 Web Video 1 Web Marketing 1 Strategy Skills  Top Skills 13 Mobile Marketing 10 Online Marketing 6 Affiliate Marketing 6 Online Advertising 6 Business Development 4 Account Management 4 Digital Media 3 Digital Strategy 2 SEO 2 Marketing Ciara also knows about... 2 YouTube 2 Web Video 1 Web Marketing 1 Strategy Top Skills 13 Mobile Marketing 10 Online Marketing 6 Affiliate Marketing 6 Online Advertising 6 Business Development 4 Account Management 4 Digital Media 3 Digital Strategy 2 SEO 2 Marketing Ciara also knows about... 2 YouTube 2 Web Video 1 Web Marketing 1 Strategy Top Skills 13 Mobile Marketing 10 Online Marketing 6 Affiliate Marketing 6 Online Advertising 6 Business Development 4 Account Management 4 Digital Media 3 Digital Strategy 2 SEO 2 Marketing Ciara also knows about... 2 YouTube 2 Web Video 1 Web Marketing 1 Strategy                     2 YouTube 2 Web Video 1 Web Marketing 1 Strategy Education Dublin City University BSC,  International Business and Languages 1998  – 2002 Dublin City University BSC,  International Business and Languages 1998  – 2002 Dublin City University BSC,  International Business and Languages 1998  – 2002 Dublin City University BSC,  International Business and Languages 1998  – 2002 ", "Experience Corporate Communications Manager III Google February 2015  – Present (6 months) Communications Manager III, Google Maps Google January 2014  –  March 2015  (1 year 3 months) Communications Manager III, Android Google February 2012  –  January 2014  (2 years) Android Policy Principal Google August 2011  –  February 2012  (7 months) Policy Manager, Consumer Products Google January 2010  –  July 2011  (1 year 7 months) Senior Policy Specialist, AdWords Google July 2007  –  January 2010  (2 years 7 months) Product Manager -Ad Opeartions Systems Google November 2006  –  November 2007  (1 year 1 month) Product Specialist - AdWords Google January 2004  –  November 2006  (2 years 11 months) Policy Specialist, AdWords Google January 2003  –  November 2006  (3 years 11 months) Corporate Communications Manager III Google February 2015  – Present (6 months) Corporate Communications Manager III Google February 2015  – Present (6 months) Communications Manager III, Google Maps Google January 2014  –  March 2015  (1 year 3 months) Communications Manager III, Google Maps Google January 2014  –  March 2015  (1 year 3 months) Communications Manager III, Android Google February 2012  –  January 2014  (2 years) Communications Manager III, Android Google February 2012  –  January 2014  (2 years) Android Policy Principal Google August 2011  –  February 2012  (7 months) Android Policy Principal Google August 2011  –  February 2012  (7 months) Policy Manager, Consumer Products Google January 2010  –  July 2011  (1 year 7 months) Policy Manager, Consumer Products Google January 2010  –  July 2011  (1 year 7 months) Senior Policy Specialist, AdWords Google July 2007  –  January 2010  (2 years 7 months) Senior Policy Specialist, AdWords Google July 2007  –  January 2010  (2 years 7 months) Product Manager -Ad Opeartions Systems Google November 2006  –  November 2007  (1 year 1 month) Product Manager -Ad Opeartions Systems Google November 2006  –  November 2007  (1 year 1 month) Product Specialist - AdWords Google January 2004  –  November 2006  (2 years 11 months) Product Specialist - AdWords Google January 2004  –  November 2006  (2 years 11 months) Policy Specialist, AdWords Google January 2003  –  November 2006  (3 years 11 months) Policy Specialist, AdWords Google January 2003  –  November 2006  (3 years 11 months) Skills Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Skills  Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Education Texas Christian University - M.J. Neeley School of Business B.S,  Business Management ,  Minor in Spanish 1998  – 2002 Activities and Societies:  Member of TCU Women's Soccer Team ,  Division 1 ,  1998-2002 Texas Christian University - M.J. Neeley School of Business B.S,  Business Management ,  Minor in Spanish 1998  – 2002 Activities and Societies:  Member of TCU Women's Soccer Team ,  Division 1 ,  1998-2002 Texas Christian University - M.J. Neeley School of Business B.S,  Business Management ,  Minor in Spanish 1998  – 2002 Activities and Societies:  Member of TCU Women's Soccer Team ,  Division 1 ,  1998-2002 Texas Christian University - M.J. Neeley School of Business B.S,  Business Management ,  Minor in Spanish 1998  – 2002 Activities and Societies:  Member of TCU Women's Soccer Team ,  Division 1 ,  1998-2002 ", "Experience Executive and Internal Communications Manager Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Senior Account Executive, Retail Google January 2012  –  March 2014  (2 years 3 months) San Francisco Bay Area Agency Business Development Lead Google July 2010  –  February 2012  (1 year 8 months) Greater New York City Area Senior Account Manager Google March 2008  –  June 2010  (2 years 4 months) Greater New York City Area New Business Lead/Account Executive XM Satellite Radio October 2006  –  February 2008  (1 year 5 months) Network Planner NBC Universal March 2004  –  September 2006  (2 years 7 months) Greater New York City Area Corporate Investment Group Investcorp October 2000  –  February 2004  (3 years 5 months) Greater New York City Area Executive and Internal Communications Manager Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Executive and Internal Communications Manager Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Senior Account Executive, Retail Google January 2012  –  March 2014  (2 years 3 months) San Francisco Bay Area Senior Account Executive, Retail Google January 2012  –  March 2014  (2 years 3 months) San Francisco Bay Area Agency Business Development Lead Google July 2010  –  February 2012  (1 year 8 months) Greater New York City Area Agency Business Development Lead Google July 2010  –  February 2012  (1 year 8 months) Greater New York City Area Senior Account Manager Google March 2008  –  June 2010  (2 years 4 months) Greater New York City Area Senior Account Manager Google March 2008  –  June 2010  (2 years 4 months) Greater New York City Area New Business Lead/Account Executive XM Satellite Radio October 2006  –  February 2008  (1 year 5 months) New Business Lead/Account Executive XM Satellite Radio October 2006  –  February 2008  (1 year 5 months) Network Planner NBC Universal March 2004  –  September 2006  (2 years 7 months) Greater New York City Area Network Planner NBC Universal March 2004  –  September 2006  (2 years 7 months) Greater New York City Area Corporate Investment Group Investcorp October 2000  –  February 2004  (3 years 5 months) Greater New York City Area Corporate Investment Group Investcorp October 2000  –  February 2004  (3 years 5 months) Greater New York City Area Languages Spanish Native or bilingual proficiency French Professional working proficiency Spanish Native or bilingual proficiency French Professional working proficiency Spanish Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Skills  Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Honors & Awards President's Honor Roll J. Wayne Reitz Scholarship for leadership President's Honor Roll President's Honor Roll President's Honor Roll J. Wayne Reitz Scholarship for leadership J. Wayne Reitz Scholarship for leadership J. Wayne Reitz Scholarship for leadership ", "Experience Executive and Internal Communications Manager Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Senior Account Executive, Retail Google January 2012  –  March 2014  (2 years 3 months) San Francisco Bay Area Agency Business Development Lead Google July 2010  –  February 2012  (1 year 8 months) Greater New York City Area Senior Account Manager Google March 2008  –  June 2010  (2 years 4 months) Greater New York City Area New Business Lead/Account Executive XM Satellite Radio October 2006  –  February 2008  (1 year 5 months) Network Planner NBC Universal March 2004  –  September 2006  (2 years 7 months) Greater New York City Area Corporate Investment Group Investcorp October 2000  –  February 2004  (3 years 5 months) Greater New York City Area Executive and Internal Communications Manager Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Executive and Internal Communications Manager Google April 2014  – Present (1 year 4 months) San Francisco Bay Area Senior Account Executive, Retail Google January 2012  –  March 2014  (2 years 3 months) San Francisco Bay Area Senior Account Executive, Retail Google January 2012  –  March 2014  (2 years 3 months) San Francisco Bay Area Agency Business Development Lead Google July 2010  –  February 2012  (1 year 8 months) Greater New York City Area Agency Business Development Lead Google July 2010  –  February 2012  (1 year 8 months) Greater New York City Area Senior Account Manager Google March 2008  –  June 2010  (2 years 4 months) Greater New York City Area Senior Account Manager Google March 2008  –  June 2010  (2 years 4 months) Greater New York City Area New Business Lead/Account Executive XM Satellite Radio October 2006  –  February 2008  (1 year 5 months) New Business Lead/Account Executive XM Satellite Radio October 2006  –  February 2008  (1 year 5 months) Network Planner NBC Universal March 2004  –  September 2006  (2 years 7 months) Greater New York City Area Network Planner NBC Universal March 2004  –  September 2006  (2 years 7 months) Greater New York City Area Corporate Investment Group Investcorp October 2000  –  February 2004  (3 years 5 months) Greater New York City Area Corporate Investment Group Investcorp October 2000  –  February 2004  (3 years 5 months) Greater New York City Area Languages Spanish Native or bilingual proficiency French Professional working proficiency Spanish Native or bilingual proficiency French Professional working proficiency Spanish Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Skills  Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Online Advertising Mobile Advertising Digital Strategy Digital Marketing Display Advertising Mobile Marketing Google Adwords Digital Media SEM PPC Web Analytics Honors & Awards President's Honor Roll J. Wayne Reitz Scholarship for leadership President's Honor Roll President's Honor Roll President's Honor Roll J. Wayne Reitz Scholarship for leadership J. Wayne Reitz Scholarship for leadership J. Wayne Reitz Scholarship for leadership ", "Summary Multilingual communications expert. Driven by creativity both professionally and personally. Deep passion for innovative solutions to unusual problems. Very much a people person. Recognised consistently throughout career for professionalism, flexibility, energy, versatility, innovation and results. \n \nIrish Times Profile, Aug 2013 - \"Creative Catalysts: 100 People Making Things Happen in Ireland Right Now\" \n \nSpecialist areas: Learning & development, internal communications, event management, people management, creative writing, public speaking Summary Multilingual communications expert. Driven by creativity both professionally and personally. Deep passion for innovative solutions to unusual problems. Very much a people person. Recognised consistently throughout career for professionalism, flexibility, energy, versatility, innovation and results. \n \nIrish Times Profile, Aug 2013 - \"Creative Catalysts: 100 People Making Things Happen in Ireland Right Now\" \n \nSpecialist areas: Learning & development, internal communications, event management, people management, creative writing, public speaking Multilingual communications expert. Driven by creativity both professionally and personally. Deep passion for innovative solutions to unusual problems. Very much a people person. Recognised consistently throughout career for professionalism, flexibility, energy, versatility, innovation and results. \n \nIrish Times Profile, Aug 2013 - \"Creative Catalysts: 100 People Making Things Happen in Ireland Right Now\" \n \nSpecialist areas: Learning & development, internal communications, event management, people management, creative writing, public speaking Multilingual communications expert. Driven by creativity both professionally and personally. Deep passion for innovative solutions to unusual problems. Very much a people person. Recognised consistently throughout career for professionalism, flexibility, energy, versatility, innovation and results. \n \nIrish Times Profile, Aug 2013 - \"Creative Catalysts: 100 People Making Things Happen in Ireland Right Now\" \n \nSpecialist areas: Learning & development, internal communications, event management, people management, creative writing, public speaking Experience Internal Communications Manager Google April 2014  – Present (1 year 4 months) Dublin Internal Communications Manager for Google EMEA HQ, Ireland \n \nSpecialist areas: Executive communications, Change communications, Global event management, Innovative and creative communication channels Founder / Director Lingo: Spoken Word Festival March 2014  – Present (1 year 5 months) Ireland Core festival programming, marketing and communications for LINGO, Ireland's first ever spoken word festival; Independently managed and ethically funded. \nCurated 100+ performers over 3 days across 4 Dublin venues. \nKey stats: 900+ attendees. 70% shows sold out. 94% favourability rating.  \n \nSpecialist areas: Project management; Internal Communications; Marketing; Artist liaison; Volunteer management LINGO Festival Edit Creator / Host / Curator The Brownbread Mixtape July 2009  – Present (6 years 1 month) Dublin Curator, host and creator of critically acclaimed independent music & spoken word show in Dublin; specialising in Irish artists [Music, spoken word, theatre, comedy] \n \nProfiled in Irish Times, Aug 2013 -- \"Creative Catalysts:100 People Making Things Happen in Ireland Right Now\" \n \nCurated 80+ events in Irish venues from 50 – 300+ capacity (incl. Electric Picnic & Longitude Festival) \n \nSpecialist areas: Online / offline marketing, communications, PR, advertising, sponsorship, design, ticketing, booking. Manager, Global Expansion Team Google November 2009  –  March 2014  (4 years 5 months) Dublin Ireland Award winning people manager of a diverse, multilingual global sales team of 30+ export specialists and 45+ vendors supporting large AdWords clients. \n \nSpecialist areas: Internal Communication, Public speaking, Event management, Training and Facilitation. Account Strategist Google June 2006  –  August 2008  (2 years 3 months) AdWords online advertising specialist for German, Swedish, English and Irish markets. Index Editor - Digital Archivist Modern Language Association September 1999  –  February 2006  (6 years 6 months) Indexing and cataloguing editor of foreign language scholarly publications (German, Swedish, Norwegian, Danish and Dutch.) for MLA International Bibliography Internal Communications Manager Google April 2014  – Present (1 year 4 months) Dublin Internal Communications Manager for Google EMEA HQ, Ireland \n \nSpecialist areas: Executive communications, Change communications, Global event management, Innovative and creative communication channels Internal Communications Manager Google April 2014  – Present (1 year 4 months) Dublin Internal Communications Manager for Google EMEA HQ, Ireland \n \nSpecialist areas: Executive communications, Change communications, Global event management, Innovative and creative communication channels Founder / Director Lingo: Spoken Word Festival March 2014  – Present (1 year 5 months) Ireland Core festival programming, marketing and communications for LINGO, Ireland's first ever spoken word festival; Independently managed and ethically funded. \nCurated 100+ performers over 3 days across 4 Dublin venues. \nKey stats: 900+ attendees. 70% shows sold out. 94% favourability rating.  \n \nSpecialist areas: Project management; Internal Communications; Marketing; Artist liaison; Volunteer management LINGO Festival Edit Founder / Director Lingo: Spoken Word Festival March 2014  – Present (1 year 5 months) Ireland Core festival programming, marketing and communications for LINGO, Ireland's first ever spoken word festival; Independently managed and ethically funded. \nCurated 100+ performers over 3 days across 4 Dublin venues. \nKey stats: 900+ attendees. 70% shows sold out. 94% favourability rating.  \n \nSpecialist areas: Project management; Internal Communications; Marketing; Artist liaison; Volunteer management LINGO Festival Edit LINGO Festival Edit LINGO Festival Edit LINGO Festival  LINGO Festival  Creator / Host / Curator The Brownbread Mixtape July 2009  – Present (6 years 1 month) Dublin Curator, host and creator of critically acclaimed independent music & spoken word show in Dublin; specialising in Irish artists [Music, spoken word, theatre, comedy] \n \nProfiled in Irish Times, Aug 2013 -- \"Creative Catalysts:100 People Making Things Happen in Ireland Right Now\" \n \nCurated 80+ events in Irish venues from 50 – 300+ capacity (incl. Electric Picnic & Longitude Festival) \n \nSpecialist areas: Online / offline marketing, communications, PR, advertising, sponsorship, design, ticketing, booking. Creator / Host / Curator The Brownbread Mixtape July 2009  – Present (6 years 1 month) Dublin Curator, host and creator of critically acclaimed independent music & spoken word show in Dublin; specialising in Irish artists [Music, spoken word, theatre, comedy] \n \nProfiled in Irish Times, Aug 2013 -- \"Creative Catalysts:100 People Making Things Happen in Ireland Right Now\" \n \nCurated 80+ events in Irish venues from 50 – 300+ capacity (incl. Electric Picnic & Longitude Festival) \n \nSpecialist areas: Online / offline marketing, communications, PR, advertising, sponsorship, design, ticketing, booking. Manager, Global Expansion Team Google November 2009  –  March 2014  (4 years 5 months) Dublin Ireland Award winning people manager of a diverse, multilingual global sales team of 30+ export specialists and 45+ vendors supporting large AdWords clients. \n \nSpecialist areas: Internal Communication, Public speaking, Event management, Training and Facilitation. Manager, Global Expansion Team Google November 2009  –  March 2014  (4 years 5 months) Dublin Ireland Award winning people manager of a diverse, multilingual global sales team of 30+ export specialists and 45+ vendors supporting large AdWords clients. \n \nSpecialist areas: Internal Communication, Public speaking, Event management, Training and Facilitation. Account Strategist Google June 2006  –  August 2008  (2 years 3 months) AdWords online advertising specialist for German, Swedish, English and Irish markets. Account Strategist Google June 2006  –  August 2008  (2 years 3 months) AdWords online advertising specialist for German, Swedish, English and Irish markets. Index Editor - Digital Archivist Modern Language Association September 1999  –  February 2006  (6 years 6 months) Indexing and cataloguing editor of foreign language scholarly publications (German, Swedish, Norwegian, Danish and Dutch.) for MLA International Bibliography Index Editor - Digital Archivist Modern Language Association September 1999  –  February 2006  (6 years 6 months) Indexing and cataloguing editor of foreign language scholarly publications (German, Swedish, Norwegian, Danish and Dutch.) for MLA International Bibliography Languages English Native or bilingual proficiency Swedish Native or bilingual proficiency German Full professional proficiency French Elementary proficiency Dutch Elementary proficiency English Native or bilingual proficiency Swedish Native or bilingual proficiency German Full professional proficiency French Elementary proficiency Dutch Elementary proficiency English Native or bilingual proficiency Swedish Native or bilingual proficiency German Full professional proficiency French Elementary proficiency Dutch Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Elementary proficiency Skills Top Skills 0 Internal Communications Skills  Top Skills 0 Internal Communications Top Skills 0 Internal Communications Top Skills 0 Internal Communications   ", "Experience Communications Manager, gTech Ads Google November 2014  – Present (9 months) NYC - Manage internal communications for VP and his 1,600+ person global service organization. Global Product Expert, Sales Knowledge Management & Communications Google October 2011  –  November 2014  (3 years 2 months) New York, NY - Passionate advocate for producing a high-quality internal ‘must-read’ communication used weekly by sales Googlers worldwide. \n- Project manage global design of Sales newsletter tool, and its supporting processes. \n- Authored and maintained the business/product requirement documents outlining business case and desired structure and functionality for newsletter tool from content submission, through editorial, regional review, publication and archiving. \n- Lead cross-functional efforts to secure global stakeholder buy-in on newsletter tool and process changes. \n- Serve as business partner to internal Google Project Manager and Engineers working jointly to chart progress against project management goals and deadlines.  \n- Designed and performed extensive end-to-end user testing  \n- Lead change management efforts by authoring process documents as well as writing and delivering training to key global stakeholders. \n- Own ongoing bug reporting, feature request road-mapping and feedback loop. \n- Solicit, collect, prioritize and action user feedback on newsletter tool and process. Specialist, Sales Knowledge Management and Communications Google May 2007  –  November 2011  (4 years 7 months) New York, NY - Generalist handling Sales Knowledge Management projects including Global newsletter, central knowledge repository, sales intranet and more. \n- Weekly newsletter Editor; Read, edited, approved and published all newsletter content weekly (400+ versions published weekly) \n- Collaborate with new teams seeking communications consultation by performing a needs assessment and helping craft a communications plan. \n- Ran refresher training program for global sales team around key communications tools. Account Manager Google April 2003  –  April 2007  (4 years 1 month) New York, NY •\tDevelop, implement and optimize strategic advertising initiatives for 50+ top East Coast Entertainment & Media companies  \n•\tProvide ongoing account guidance, reporting, strategy, support, and service for all accounts. \n•\tManage online marketing spend in excess of $12.5MM a quarter \n•\tDrove revenue growth on top spending account by 275% in six months  \n•\tLead client relationship building efforts and face-to-face meetings with top industry clients such as Discovery Communications, MTV Networks and SonyBMG \n•\tSupervise and mentor a support team of two \n•\tRun team meeting to set weekly priorities for business group; includes preparing agenda, assigning next-steps and collecting follow-up information Senior Administrator - Sothebys.com Sotheby's November 1999  –  April 2003  (3 years 6 months) New York, NY Communications Manager, gTech Ads Google November 2014  – Present (9 months) NYC - Manage internal communications for VP and his 1,600+ person global service organization. Communications Manager, gTech Ads Google November 2014  – Present (9 months) NYC - Manage internal communications for VP and his 1,600+ person global service organization. Global Product Expert, Sales Knowledge Management & Communications Google October 2011  –  November 2014  (3 years 2 months) New York, NY - Passionate advocate for producing a high-quality internal ‘must-read’ communication used weekly by sales Googlers worldwide. \n- Project manage global design of Sales newsletter tool, and its supporting processes. \n- Authored and maintained the business/product requirement documents outlining business case and desired structure and functionality for newsletter tool from content submission, through editorial, regional review, publication and archiving. \n- Lead cross-functional efforts to secure global stakeholder buy-in on newsletter tool and process changes. \n- Serve as business partner to internal Google Project Manager and Engineers working jointly to chart progress against project management goals and deadlines.  \n- Designed and performed extensive end-to-end user testing  \n- Lead change management efforts by authoring process documents as well as writing and delivering training to key global stakeholders. \n- Own ongoing bug reporting, feature request road-mapping and feedback loop. \n- Solicit, collect, prioritize and action user feedback on newsletter tool and process. Global Product Expert, Sales Knowledge Management & Communications Google October 2011  –  November 2014  (3 years 2 months) New York, NY - Passionate advocate for producing a high-quality internal ‘must-read’ communication used weekly by sales Googlers worldwide. \n- Project manage global design of Sales newsletter tool, and its supporting processes. \n- Authored and maintained the business/product requirement documents outlining business case and desired structure and functionality for newsletter tool from content submission, through editorial, regional review, publication and archiving. \n- Lead cross-functional efforts to secure global stakeholder buy-in on newsletter tool and process changes. \n- Serve as business partner to internal Google Project Manager and Engineers working jointly to chart progress against project management goals and deadlines.  \n- Designed and performed extensive end-to-end user testing  \n- Lead change management efforts by authoring process documents as well as writing and delivering training to key global stakeholders. \n- Own ongoing bug reporting, feature request road-mapping and feedback loop. \n- Solicit, collect, prioritize and action user feedback on newsletter tool and process. Specialist, Sales Knowledge Management and Communications Google May 2007  –  November 2011  (4 years 7 months) New York, NY - Generalist handling Sales Knowledge Management projects including Global newsletter, central knowledge repository, sales intranet and more. \n- Weekly newsletter Editor; Read, edited, approved and published all newsletter content weekly (400+ versions published weekly) \n- Collaborate with new teams seeking communications consultation by performing a needs assessment and helping craft a communications plan. \n- Ran refresher training program for global sales team around key communications tools. Specialist, Sales Knowledge Management and Communications Google May 2007  –  November 2011  (4 years 7 months) New York, NY - Generalist handling Sales Knowledge Management projects including Global newsletter, central knowledge repository, sales intranet and more. \n- Weekly newsletter Editor; Read, edited, approved and published all newsletter content weekly (400+ versions published weekly) \n- Collaborate with new teams seeking communications consultation by performing a needs assessment and helping craft a communications plan. \n- Ran refresher training program for global sales team around key communications tools. Account Manager Google April 2003  –  April 2007  (4 years 1 month) New York, NY •\tDevelop, implement and optimize strategic advertising initiatives for 50+ top East Coast Entertainment & Media companies  \n•\tProvide ongoing account guidance, reporting, strategy, support, and service for all accounts. \n•\tManage online marketing spend in excess of $12.5MM a quarter \n•\tDrove revenue growth on top spending account by 275% in six months  \n•\tLead client relationship building efforts and face-to-face meetings with top industry clients such as Discovery Communications, MTV Networks and SonyBMG \n•\tSupervise and mentor a support team of two \n•\tRun team meeting to set weekly priorities for business group; includes preparing agenda, assigning next-steps and collecting follow-up information Account Manager Google April 2003  –  April 2007  (4 years 1 month) New York, NY •\tDevelop, implement and optimize strategic advertising initiatives for 50+ top East Coast Entertainment & Media companies  \n•\tProvide ongoing account guidance, reporting, strategy, support, and service for all accounts. \n•\tManage online marketing spend in excess of $12.5MM a quarter \n•\tDrove revenue growth on top spending account by 275% in six months  \n•\tLead client relationship building efforts and face-to-face meetings with top industry clients such as Discovery Communications, MTV Networks and SonyBMG \n•\tSupervise and mentor a support team of two \n•\tRun team meeting to set weekly priorities for business group; includes preparing agenda, assigning next-steps and collecting follow-up information Senior Administrator - Sothebys.com Sotheby's November 1999  –  April 2003  (3 years 6 months) New York, NY Senior Administrator - Sothebys.com Sotheby's November 1999  –  April 2003  (3 years 6 months) New York, NY Skills 1 Change Management 1 Advertising 1 Strategy 1 Sales 1 Online Advertising 1 Editing Skills  1 Change Management 1 Advertising 1 Strategy 1 Sales 1 Online Advertising 1 Editing 1 Change Management 1 Advertising 1 Strategy 1 Sales 1 Online Advertising 1 Editing 1 Change Management 1 Advertising 1 Strategy 1 Sales 1 Online Advertising 1 Editing             Education College of the Holy Cross BA,  Art History and Sociology College of the Holy Cross BA,  Art History and Sociology College of the Holy Cross BA,  Art History and Sociology College of the Holy Cross BA,  Art History and Sociology ", "Summary Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Summary Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Experience Product Marketing Manager, Google Play Music Google February 2015  – Present (6 months) San Francisco Bay Area Product Marketing Manager, Google Registry Google November 2013  –  February 2015  (1 year 4 months) Greater New York City Area Communications Manager, People Operations Google December 2012  –  November 2013  (1 year) Greater New York City Area Communications Specialist, People Operations Google February 2011  –  December 2012  (1 year 11 months) San Francisco Bay Area Account Manager/Digital Media Strategist Vanguard Communications September 2009  –  January 2011  (1 year 5 months) Washington D.C. Metro Area Led the Online Group Division of the Integrated Media Services Team. Responsible for the development and growth of internal online capacity, communications product development and marketing. Expert in online communications, integrated media strategy, interactive development and media relations. \n \nConceptualized and led the creation of Vanguard's award-winning blog, InSites. Edited and wrote as a regular contributor.  \n \nDeveloped and maintained online communications presences via search engine optimization, social networking platforms, websites, email and video development.  \n \nRegularly assisted with traditional media outreach tasks. Wrote letters to the editor, press releases, talking points, op eds, backgrounders and other copy.  \n \nLed internal and external training efforts regarding online communications strategies, tactics and utilization. (Open) 1 recommendation Juan Martinez Senior Drupal Developer What a technology enthusiast! Chris has an exceptional ability to understand and use new technologies. He's fun to work with, too. Great colleague and bright professional. View Marketing Manager Live Nation April 2007  –  August 2009  (2 years 5 months) Washington D.C. Metro Area Developed and executed marketing plans for live music and comedy events. Maintained strict budgets and deadlines. Consulted a small marketing team, artist managers, agents and publicists to coordinate campaign efforts and optimize marketing strategies. Events managed included: Van Morrison, Aerosmith, Kings of Leon, Dane Cook, Coldplay, The Who, Cirque du Soliel’s Delirium, Linkin Park, George Carlin, Lewis Black, Flight of the Conchords, Morrissey, Jackson Browne, Feist, Rilo Kiley and more.  \n \nOversaw media buying (print, radio, television, web, outdoor, grassroots) and created, arranged and executed promotional efforts for marketing campaigns. Led local digital integration efforts on Twitter, Facebook, MySpace, and other online platforms. Managed a design team, marketing assistants and interns.  \n \nCommunicated extensively with the area media to obtain additional publicity. Executed large scale media relations projects as needed, including those for Paul McCartney, Cirque du Soliel, Pray for Peace, Jay-Z Concert for Change, Elton John & Billy Joel Face 2 Face 2009 and others. Served as an on-site media and marketing liaison during live events. Drafted and delivered press releases to area media outlets. (Open) 1 recommendation Andy Thompson Director of Product - Cameo at Vimeo Chris is extremely intelligent and detail oriented. He's also a great guy to work with. View Consultant The National Center for State Courts April 2007  –  July 2007  (4 months) Washington D.C. Metro Area Authored Jur-E Bulletin while an employee was on maternity leave. Jur-E Bulletin is a weekly newsletter reaching more than 1,100 jury related professionals across the country. Director of Public Relations and Business Development Jammin' Java Music Club & Cafe September 2006  –  March 2007  (7 months) Oversaw all media outreach and marketing programs, involving active contact with members of the Washington D.C. press community, artists and artist management agencies.  \n \nDeveloped relationships with local, regional and national businesses for the purposes of bringing on sponsors, selling advertisements, and coordinating cross-promotional opportunities. \n \nManaged and directed operations for the venue, including scheduling sound engineers and door staff, standardizing procedures and branding, and increasing overall efficiency. Created and maintained the Jammin' Java Internship Program by hiring three interns to assist with office operations. Music Editor On Tap Magazine December 2005  –  November 2006  (1 year) Washington D.C. Metro Area Organized a freelance staff of 10+ writers for a monthly print and web publication. Planned and structured all monthly music coverage. Edited all music content for content, grammar and punctuation.  \n \nAuthored over 50 articles. (Open) 1 recommendation Joel Sparks Owner / Author / Publisher at CATTHULHU.com As Music Editor, Chris Connelly was knowledgeable, responsive, and creative. He really helped bolster the magazine's reputation as a source for music news. It was a pleasure to write for an editor with such a good grasp of both journalism and rock. View Court Research Analyst The National Center for State Courts June 2004  –  August 2006  (2 years 3 months) Washington D.C. Metro Area Oversaw a national data collection effort related to increasing citizen participation in jury service, a job requiring collaboration with state court administrators, chief justices, numerous trial judges, court staff and attorneys. Created and maintained a database of over 10,000 survey responses. Conducted research and analysis on this dataset and others. Published articles in journals from the American Bar Association and the American Judges Association. \n \nServed as a professional consultant to courts around the country. Responded to court inquiries and worked as a member of the Jury Community of Practice for the National Center for State Courts.  \n \nAuthored the Jur-E Bulletin weekly newsletter reaching more than one thousand jury related professionals across the country. Research Assistant Government Department, College of William & Mary June 2002  –  December 2002  (7 months) Williamsburg, VA Authored and presented \"Veto Bargaining Between the Congress and President\" with Professor John Gilmour to the annual meeting of the Southern Political Science Association in November 2002, with research efforts focusing on the legislative relationship between the president and Congress. Product Marketing Manager, Google Play Music Google February 2015  – Present (6 months) San Francisco Bay Area Product Marketing Manager, Google Play Music Google February 2015  – Present (6 months) San Francisco Bay Area Product Marketing Manager, Google Registry Google November 2013  –  February 2015  (1 year 4 months) Greater New York City Area Product Marketing Manager, Google Registry Google November 2013  –  February 2015  (1 year 4 months) Greater New York City Area Communications Manager, People Operations Google December 2012  –  November 2013  (1 year) Greater New York City Area Communications Manager, People Operations Google December 2012  –  November 2013  (1 year) Greater New York City Area Communications Specialist, People Operations Google February 2011  –  December 2012  (1 year 11 months) San Francisco Bay Area Communications Specialist, People Operations Google February 2011  –  December 2012  (1 year 11 months) San Francisco Bay Area Account Manager/Digital Media Strategist Vanguard Communications September 2009  –  January 2011  (1 year 5 months) Washington D.C. Metro Area Led the Online Group Division of the Integrated Media Services Team. Responsible for the development and growth of internal online capacity, communications product development and marketing. Expert in online communications, integrated media strategy, interactive development and media relations. \n \nConceptualized and led the creation of Vanguard's award-winning blog, InSites. Edited and wrote as a regular contributor.  \n \nDeveloped and maintained online communications presences via search engine optimization, social networking platforms, websites, email and video development.  \n \nRegularly assisted with traditional media outreach tasks. Wrote letters to the editor, press releases, talking points, op eds, backgrounders and other copy.  \n \nLed internal and external training efforts regarding online communications strategies, tactics and utilization. (Open) 1 recommendation Juan Martinez Senior Drupal Developer What a technology enthusiast! Chris has an exceptional ability to understand and use new technologies. He's fun to work with, too. Great colleague and bright professional. View Account Manager/Digital Media Strategist Vanguard Communications September 2009  –  January 2011  (1 year 5 months) Washington D.C. Metro Area Led the Online Group Division of the Integrated Media Services Team. Responsible for the development and growth of internal online capacity, communications product development and marketing. Expert in online communications, integrated media strategy, interactive development and media relations. \n \nConceptualized and led the creation of Vanguard's award-winning blog, InSites. Edited and wrote as a regular contributor.  \n \nDeveloped and maintained online communications presences via search engine optimization, social networking platforms, websites, email and video development.  \n \nRegularly assisted with traditional media outreach tasks. Wrote letters to the editor, press releases, talking points, op eds, backgrounders and other copy.  \n \nLed internal and external training efforts regarding online communications strategies, tactics and utilization. (Open) 1 recommendation Juan Martinez Senior Drupal Developer What a technology enthusiast! Chris has an exceptional ability to understand and use new technologies. He's fun to work with, too. Great colleague and bright professional. View Marketing Manager Live Nation April 2007  –  August 2009  (2 years 5 months) Washington D.C. Metro Area Developed and executed marketing plans for live music and comedy events. Maintained strict budgets and deadlines. Consulted a small marketing team, artist managers, agents and publicists to coordinate campaign efforts and optimize marketing strategies. Events managed included: Van Morrison, Aerosmith, Kings of Leon, Dane Cook, Coldplay, The Who, Cirque du Soliel’s Delirium, Linkin Park, George Carlin, Lewis Black, Flight of the Conchords, Morrissey, Jackson Browne, Feist, Rilo Kiley and more.  \n \nOversaw media buying (print, radio, television, web, outdoor, grassroots) and created, arranged and executed promotional efforts for marketing campaigns. Led local digital integration efforts on Twitter, Facebook, MySpace, and other online platforms. Managed a design team, marketing assistants and interns.  \n \nCommunicated extensively with the area media to obtain additional publicity. Executed large scale media relations projects as needed, including those for Paul McCartney, Cirque du Soliel, Pray for Peace, Jay-Z Concert for Change, Elton John & Billy Joel Face 2 Face 2009 and others. Served as an on-site media and marketing liaison during live events. Drafted and delivered press releases to area media outlets. (Open) 1 recommendation Andy Thompson Director of Product - Cameo at Vimeo Chris is extremely intelligent and detail oriented. He's also a great guy to work with. View Marketing Manager Live Nation April 2007  –  August 2009  (2 years 5 months) Washington D.C. Metro Area Developed and executed marketing plans for live music and comedy events. Maintained strict budgets and deadlines. Consulted a small marketing team, artist managers, agents and publicists to coordinate campaign efforts and optimize marketing strategies. Events managed included: Van Morrison, Aerosmith, Kings of Leon, Dane Cook, Coldplay, The Who, Cirque du Soliel’s Delirium, Linkin Park, George Carlin, Lewis Black, Flight of the Conchords, Morrissey, Jackson Browne, Feist, Rilo Kiley and more.  \n \nOversaw media buying (print, radio, television, web, outdoor, grassroots) and created, arranged and executed promotional efforts for marketing campaigns. Led local digital integration efforts on Twitter, Facebook, MySpace, and other online platforms. Managed a design team, marketing assistants and interns.  \n \nCommunicated extensively with the area media to obtain additional publicity. Executed large scale media relations projects as needed, including those for Paul McCartney, Cirque du Soliel, Pray for Peace, Jay-Z Concert for Change, Elton John & Billy Joel Face 2 Face 2009 and others. Served as an on-site media and marketing liaison during live events. Drafted and delivered press releases to area media outlets. (Open) 1 recommendation Andy Thompson Director of Product - Cameo at Vimeo Chris is extremely intelligent and detail oriented. He's also a great guy to work with. View Consultant The National Center for State Courts April 2007  –  July 2007  (4 months) Washington D.C. Metro Area Authored Jur-E Bulletin while an employee was on maternity leave. Jur-E Bulletin is a weekly newsletter reaching more than 1,100 jury related professionals across the country. Consultant The National Center for State Courts April 2007  –  July 2007  (4 months) Washington D.C. Metro Area Authored Jur-E Bulletin while an employee was on maternity leave. Jur-E Bulletin is a weekly newsletter reaching more than 1,100 jury related professionals across the country. Director of Public Relations and Business Development Jammin' Java Music Club & Cafe September 2006  –  March 2007  (7 months) Oversaw all media outreach and marketing programs, involving active contact with members of the Washington D.C. press community, artists and artist management agencies.  \n \nDeveloped relationships with local, regional and national businesses for the purposes of bringing on sponsors, selling advertisements, and coordinating cross-promotional opportunities. \n \nManaged and directed operations for the venue, including scheduling sound engineers and door staff, standardizing procedures and branding, and increasing overall efficiency. Created and maintained the Jammin' Java Internship Program by hiring three interns to assist with office operations. Director of Public Relations and Business Development Jammin' Java Music Club & Cafe September 2006  –  March 2007  (7 months) Oversaw all media outreach and marketing programs, involving active contact with members of the Washington D.C. press community, artists and artist management agencies.  \n \nDeveloped relationships with local, regional and national businesses for the purposes of bringing on sponsors, selling advertisements, and coordinating cross-promotional opportunities. \n \nManaged and directed operations for the venue, including scheduling sound engineers and door staff, standardizing procedures and branding, and increasing overall efficiency. Created and maintained the Jammin' Java Internship Program by hiring three interns to assist with office operations. Music Editor On Tap Magazine December 2005  –  November 2006  (1 year) Washington D.C. Metro Area Organized a freelance staff of 10+ writers for a monthly print and web publication. Planned and structured all monthly music coverage. Edited all music content for content, grammar and punctuation.  \n \nAuthored over 50 articles. (Open) 1 recommendation Joel Sparks Owner / Author / Publisher at CATTHULHU.com As Music Editor, Chris Connelly was knowledgeable, responsive, and creative. He really helped bolster the magazine's reputation as a source for music news. It was a pleasure to write for an editor with such a good grasp of both journalism and rock. View Music Editor On Tap Magazine December 2005  –  November 2006  (1 year) Washington D.C. Metro Area Organized a freelance staff of 10+ writers for a monthly print and web publication. Planned and structured all monthly music coverage. Edited all music content for content, grammar and punctuation.  \n \nAuthored over 50 articles. (Open) 1 recommendation Joel Sparks Owner / Author / Publisher at CATTHULHU.com As Music Editor, Chris Connelly was knowledgeable, responsive, and creative. He really helped bolster the magazine's reputation as a source for music news. It was a pleasure to write for an editor with such a good grasp of both journalism and rock. View Court Research Analyst The National Center for State Courts June 2004  –  August 2006  (2 years 3 months) Washington D.C. Metro Area Oversaw a national data collection effort related to increasing citizen participation in jury service, a job requiring collaboration with state court administrators, chief justices, numerous trial judges, court staff and attorneys. Created and maintained a database of over 10,000 survey responses. Conducted research and analysis on this dataset and others. Published articles in journals from the American Bar Association and the American Judges Association. \n \nServed as a professional consultant to courts around the country. Responded to court inquiries and worked as a member of the Jury Community of Practice for the National Center for State Courts.  \n \nAuthored the Jur-E Bulletin weekly newsletter reaching more than one thousand jury related professionals across the country. Court Research Analyst The National Center for State Courts June 2004  –  August 2006  (2 years 3 months) Washington D.C. Metro Area Oversaw a national data collection effort related to increasing citizen participation in jury service, a job requiring collaboration with state court administrators, chief justices, numerous trial judges, court staff and attorneys. Created and maintained a database of over 10,000 survey responses. Conducted research and analysis on this dataset and others. Published articles in journals from the American Bar Association and the American Judges Association. \n \nServed as a professional consultant to courts around the country. Responded to court inquiries and worked as a member of the Jury Community of Practice for the National Center for State Courts.  \n \nAuthored the Jur-E Bulletin weekly newsletter reaching more than one thousand jury related professionals across the country. Research Assistant Government Department, College of William & Mary June 2002  –  December 2002  (7 months) Williamsburg, VA Authored and presented \"Veto Bargaining Between the Congress and President\" with Professor John Gilmour to the annual meeting of the Southern Political Science Association in November 2002, with research efforts focusing on the legislative relationship between the president and Congress. Research Assistant Government Department, College of William & Mary June 2002  –  December 2002  (7 months) Williamsburg, VA Authored and presented \"Veto Bargaining Between the Congress and President\" with Professor John Gilmour to the annual meeting of the Southern Political Science Association in November 2002, with research efforts focusing on the legislative relationship between the president and Congress. Languages   Skills Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Skills  Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing                     1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Education The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 The College of William and Mary Bachelor's Degree 2001  – 2004 Glenbard West High School High School 1997  – 2001 The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 The College of William and Mary Bachelor's Degree 2001  – 2004 The College of William and Mary Bachelor's Degree 2001  – 2004 The College of William and Mary Bachelor's Degree 2001  – 2004 Glenbard West High School High School 1997  – 2001 Glenbard West High School High School 1997  – 2001 Glenbard West High School High School 1997  – 2001 Honors & Awards ", "Summary Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Summary Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Chris Connelly is a product marketing manager at Google working on Google Play Music. \n \nAfter joining Google in 2011, Chris worked to refine Google's employment brand. Chris served as the project manager for Google’s global submissions to the Great Place to Work Institute’s evaluation of employers, helping return Google to the top of FORTUNE Magazine’s “100 Best Companies to Work For” list in 2012 and 2013, as well as topping comparable rankings around the world. Chris has also completed multimedia content overhauls of google.com/jobs, google.com/students, youtube.com/jobs, and google.com/diversity/women. He went on to work as the product marketing manager for Google Registry, helping to set the strategic direction for Google's top-level domain efforts. \n \nPrior to joining Google, Chris (at varying points) worked as a digital communications consultant, concert promoter, journalist, jury administration researcher and semi-professional musician. Chris holds a B.A. in history and government from the College of William & Mary and an M.A. in communication from the Johns Hopkins University. Experience Product Marketing Manager, Google Play Music Google February 2015  – Present (6 months) San Francisco Bay Area Product Marketing Manager, Google Registry Google November 2013  –  February 2015  (1 year 4 months) Greater New York City Area Communications Manager, People Operations Google December 2012  –  November 2013  (1 year) Greater New York City Area Communications Specialist, People Operations Google February 2011  –  December 2012  (1 year 11 months) San Francisco Bay Area Account Manager/Digital Media Strategist Vanguard Communications September 2009  –  January 2011  (1 year 5 months) Washington D.C. Metro Area Led the Online Group Division of the Integrated Media Services Team. Responsible for the development and growth of internal online capacity, communications product development and marketing. Expert in online communications, integrated media strategy, interactive development and media relations. \n \nConceptualized and led the creation of Vanguard's award-winning blog, InSites. Edited and wrote as a regular contributor.  \n \nDeveloped and maintained online communications presences via search engine optimization, social networking platforms, websites, email and video development.  \n \nRegularly assisted with traditional media outreach tasks. Wrote letters to the editor, press releases, talking points, op eds, backgrounders and other copy.  \n \nLed internal and external training efforts regarding online communications strategies, tactics and utilization. (Open) 1 recommendation Juan Martinez Senior Drupal Developer What a technology enthusiast! Chris has an exceptional ability to understand and use new technologies. He's fun to work with, too. Great colleague and bright professional. View Marketing Manager Live Nation April 2007  –  August 2009  (2 years 5 months) Washington D.C. Metro Area Developed and executed marketing plans for live music and comedy events. Maintained strict budgets and deadlines. Consulted a small marketing team, artist managers, agents and publicists to coordinate campaign efforts and optimize marketing strategies. Events managed included: Van Morrison, Aerosmith, Kings of Leon, Dane Cook, Coldplay, The Who, Cirque du Soliel’s Delirium, Linkin Park, George Carlin, Lewis Black, Flight of the Conchords, Morrissey, Jackson Browne, Feist, Rilo Kiley and more.  \n \nOversaw media buying (print, radio, television, web, outdoor, grassroots) and created, arranged and executed promotional efforts for marketing campaigns. Led local digital integration efforts on Twitter, Facebook, MySpace, and other online platforms. Managed a design team, marketing assistants and interns.  \n \nCommunicated extensively with the area media to obtain additional publicity. Executed large scale media relations projects as needed, including those for Paul McCartney, Cirque du Soliel, Pray for Peace, Jay-Z Concert for Change, Elton John & Billy Joel Face 2 Face 2009 and others. Served as an on-site media and marketing liaison during live events. Drafted and delivered press releases to area media outlets. (Open) 1 recommendation Andy Thompson Director of Product - Cameo at Vimeo Chris is extremely intelligent and detail oriented. He's also a great guy to work with. View Consultant The National Center for State Courts April 2007  –  July 2007  (4 months) Washington D.C. Metro Area Authored Jur-E Bulletin while an employee was on maternity leave. Jur-E Bulletin is a weekly newsletter reaching more than 1,100 jury related professionals across the country. Director of Public Relations and Business Development Jammin' Java Music Club & Cafe September 2006  –  March 2007  (7 months) Oversaw all media outreach and marketing programs, involving active contact with members of the Washington D.C. press community, artists and artist management agencies.  \n \nDeveloped relationships with local, regional and national businesses for the purposes of bringing on sponsors, selling advertisements, and coordinating cross-promotional opportunities. \n \nManaged and directed operations for the venue, including scheduling sound engineers and door staff, standardizing procedures and branding, and increasing overall efficiency. Created and maintained the Jammin' Java Internship Program by hiring three interns to assist with office operations. Music Editor On Tap Magazine December 2005  –  November 2006  (1 year) Washington D.C. Metro Area Organized a freelance staff of 10+ writers for a monthly print and web publication. Planned and structured all monthly music coverage. Edited all music content for content, grammar and punctuation.  \n \nAuthored over 50 articles. (Open) 1 recommendation Joel Sparks Owner / Author / Publisher at CATTHULHU.com As Music Editor, Chris Connelly was knowledgeable, responsive, and creative. He really helped bolster the magazine's reputation as a source for music news. It was a pleasure to write for an editor with such a good grasp of both journalism and rock. View Court Research Analyst The National Center for State Courts June 2004  –  August 2006  (2 years 3 months) Washington D.C. Metro Area Oversaw a national data collection effort related to increasing citizen participation in jury service, a job requiring collaboration with state court administrators, chief justices, numerous trial judges, court staff and attorneys. Created and maintained a database of over 10,000 survey responses. Conducted research and analysis on this dataset and others. Published articles in journals from the American Bar Association and the American Judges Association. \n \nServed as a professional consultant to courts around the country. Responded to court inquiries and worked as a member of the Jury Community of Practice for the National Center for State Courts.  \n \nAuthored the Jur-E Bulletin weekly newsletter reaching more than one thousand jury related professionals across the country. Research Assistant Government Department, College of William & Mary June 2002  –  December 2002  (7 months) Williamsburg, VA Authored and presented \"Veto Bargaining Between the Congress and President\" with Professor John Gilmour to the annual meeting of the Southern Political Science Association in November 2002, with research efforts focusing on the legislative relationship between the president and Congress. Product Marketing Manager, Google Play Music Google February 2015  – Present (6 months) San Francisco Bay Area Product Marketing Manager, Google Play Music Google February 2015  – Present (6 months) San Francisco Bay Area Product Marketing Manager, Google Registry Google November 2013  –  February 2015  (1 year 4 months) Greater New York City Area Product Marketing Manager, Google Registry Google November 2013  –  February 2015  (1 year 4 months) Greater New York City Area Communications Manager, People Operations Google December 2012  –  November 2013  (1 year) Greater New York City Area Communications Manager, People Operations Google December 2012  –  November 2013  (1 year) Greater New York City Area Communications Specialist, People Operations Google February 2011  –  December 2012  (1 year 11 months) San Francisco Bay Area Communications Specialist, People Operations Google February 2011  –  December 2012  (1 year 11 months) San Francisco Bay Area Account Manager/Digital Media Strategist Vanguard Communications September 2009  –  January 2011  (1 year 5 months) Washington D.C. Metro Area Led the Online Group Division of the Integrated Media Services Team. Responsible for the development and growth of internal online capacity, communications product development and marketing. Expert in online communications, integrated media strategy, interactive development and media relations. \n \nConceptualized and led the creation of Vanguard's award-winning blog, InSites. Edited and wrote as a regular contributor.  \n \nDeveloped and maintained online communications presences via search engine optimization, social networking platforms, websites, email and video development.  \n \nRegularly assisted with traditional media outreach tasks. Wrote letters to the editor, press releases, talking points, op eds, backgrounders and other copy.  \n \nLed internal and external training efforts regarding online communications strategies, tactics and utilization. (Open) 1 recommendation Juan Martinez Senior Drupal Developer What a technology enthusiast! Chris has an exceptional ability to understand and use new technologies. He's fun to work with, too. Great colleague and bright professional. View Account Manager/Digital Media Strategist Vanguard Communications September 2009  –  January 2011  (1 year 5 months) Washington D.C. Metro Area Led the Online Group Division of the Integrated Media Services Team. Responsible for the development and growth of internal online capacity, communications product development and marketing. Expert in online communications, integrated media strategy, interactive development and media relations. \n \nConceptualized and led the creation of Vanguard's award-winning blog, InSites. Edited and wrote as a regular contributor.  \n \nDeveloped and maintained online communications presences via search engine optimization, social networking platforms, websites, email and video development.  \n \nRegularly assisted with traditional media outreach tasks. Wrote letters to the editor, press releases, talking points, op eds, backgrounders and other copy.  \n \nLed internal and external training efforts regarding online communications strategies, tactics and utilization. (Open) 1 recommendation Juan Martinez Senior Drupal Developer What a technology enthusiast! Chris has an exceptional ability to understand and use new technologies. He's fun to work with, too. Great colleague and bright professional. View Marketing Manager Live Nation April 2007  –  August 2009  (2 years 5 months) Washington D.C. Metro Area Developed and executed marketing plans for live music and comedy events. Maintained strict budgets and deadlines. Consulted a small marketing team, artist managers, agents and publicists to coordinate campaign efforts and optimize marketing strategies. Events managed included: Van Morrison, Aerosmith, Kings of Leon, Dane Cook, Coldplay, The Who, Cirque du Soliel’s Delirium, Linkin Park, George Carlin, Lewis Black, Flight of the Conchords, Morrissey, Jackson Browne, Feist, Rilo Kiley and more.  \n \nOversaw media buying (print, radio, television, web, outdoor, grassroots) and created, arranged and executed promotional efforts for marketing campaigns. Led local digital integration efforts on Twitter, Facebook, MySpace, and other online platforms. Managed a design team, marketing assistants and interns.  \n \nCommunicated extensively with the area media to obtain additional publicity. Executed large scale media relations projects as needed, including those for Paul McCartney, Cirque du Soliel, Pray for Peace, Jay-Z Concert for Change, Elton John & Billy Joel Face 2 Face 2009 and others. Served as an on-site media and marketing liaison during live events. Drafted and delivered press releases to area media outlets. (Open) 1 recommendation Andy Thompson Director of Product - Cameo at Vimeo Chris is extremely intelligent and detail oriented. He's also a great guy to work with. View Marketing Manager Live Nation April 2007  –  August 2009  (2 years 5 months) Washington D.C. Metro Area Developed and executed marketing plans for live music and comedy events. Maintained strict budgets and deadlines. Consulted a small marketing team, artist managers, agents and publicists to coordinate campaign efforts and optimize marketing strategies. Events managed included: Van Morrison, Aerosmith, Kings of Leon, Dane Cook, Coldplay, The Who, Cirque du Soliel’s Delirium, Linkin Park, George Carlin, Lewis Black, Flight of the Conchords, Morrissey, Jackson Browne, Feist, Rilo Kiley and more.  \n \nOversaw media buying (print, radio, television, web, outdoor, grassroots) and created, arranged and executed promotional efforts for marketing campaigns. Led local digital integration efforts on Twitter, Facebook, MySpace, and other online platforms. Managed a design team, marketing assistants and interns.  \n \nCommunicated extensively with the area media to obtain additional publicity. Executed large scale media relations projects as needed, including those for Paul McCartney, Cirque du Soliel, Pray for Peace, Jay-Z Concert for Change, Elton John & Billy Joel Face 2 Face 2009 and others. Served as an on-site media and marketing liaison during live events. Drafted and delivered press releases to area media outlets. (Open) 1 recommendation Andy Thompson Director of Product - Cameo at Vimeo Chris is extremely intelligent and detail oriented. He's also a great guy to work with. View Consultant The National Center for State Courts April 2007  –  July 2007  (4 months) Washington D.C. Metro Area Authored Jur-E Bulletin while an employee was on maternity leave. Jur-E Bulletin is a weekly newsletter reaching more than 1,100 jury related professionals across the country. Consultant The National Center for State Courts April 2007  –  July 2007  (4 months) Washington D.C. Metro Area Authored Jur-E Bulletin while an employee was on maternity leave. Jur-E Bulletin is a weekly newsletter reaching more than 1,100 jury related professionals across the country. Director of Public Relations and Business Development Jammin' Java Music Club & Cafe September 2006  –  March 2007  (7 months) Oversaw all media outreach and marketing programs, involving active contact with members of the Washington D.C. press community, artists and artist management agencies.  \n \nDeveloped relationships with local, regional and national businesses for the purposes of bringing on sponsors, selling advertisements, and coordinating cross-promotional opportunities. \n \nManaged and directed operations for the venue, including scheduling sound engineers and door staff, standardizing procedures and branding, and increasing overall efficiency. Created and maintained the Jammin' Java Internship Program by hiring three interns to assist with office operations. Director of Public Relations and Business Development Jammin' Java Music Club & Cafe September 2006  –  March 2007  (7 months) Oversaw all media outreach and marketing programs, involving active contact with members of the Washington D.C. press community, artists and artist management agencies.  \n \nDeveloped relationships with local, regional and national businesses for the purposes of bringing on sponsors, selling advertisements, and coordinating cross-promotional opportunities. \n \nManaged and directed operations for the venue, including scheduling sound engineers and door staff, standardizing procedures and branding, and increasing overall efficiency. Created and maintained the Jammin' Java Internship Program by hiring three interns to assist with office operations. Music Editor On Tap Magazine December 2005  –  November 2006  (1 year) Washington D.C. Metro Area Organized a freelance staff of 10+ writers for a monthly print and web publication. Planned and structured all monthly music coverage. Edited all music content for content, grammar and punctuation.  \n \nAuthored over 50 articles. (Open) 1 recommendation Joel Sparks Owner / Author / Publisher at CATTHULHU.com As Music Editor, Chris Connelly was knowledgeable, responsive, and creative. He really helped bolster the magazine's reputation as a source for music news. It was a pleasure to write for an editor with such a good grasp of both journalism and rock. View Music Editor On Tap Magazine December 2005  –  November 2006  (1 year) Washington D.C. Metro Area Organized a freelance staff of 10+ writers for a monthly print and web publication. Planned and structured all monthly music coverage. Edited all music content for content, grammar and punctuation.  \n \nAuthored over 50 articles. (Open) 1 recommendation Joel Sparks Owner / Author / Publisher at CATTHULHU.com As Music Editor, Chris Connelly was knowledgeable, responsive, and creative. He really helped bolster the magazine's reputation as a source for music news. It was a pleasure to write for an editor with such a good grasp of both journalism and rock. View Court Research Analyst The National Center for State Courts June 2004  –  August 2006  (2 years 3 months) Washington D.C. Metro Area Oversaw a national data collection effort related to increasing citizen participation in jury service, a job requiring collaboration with state court administrators, chief justices, numerous trial judges, court staff and attorneys. Created and maintained a database of over 10,000 survey responses. Conducted research and analysis on this dataset and others. Published articles in journals from the American Bar Association and the American Judges Association. \n \nServed as a professional consultant to courts around the country. Responded to court inquiries and worked as a member of the Jury Community of Practice for the National Center for State Courts.  \n \nAuthored the Jur-E Bulletin weekly newsletter reaching more than one thousand jury related professionals across the country. Court Research Analyst The National Center for State Courts June 2004  –  August 2006  (2 years 3 months) Washington D.C. Metro Area Oversaw a national data collection effort related to increasing citizen participation in jury service, a job requiring collaboration with state court administrators, chief justices, numerous trial judges, court staff and attorneys. Created and maintained a database of over 10,000 survey responses. Conducted research and analysis on this dataset and others. Published articles in journals from the American Bar Association and the American Judges Association. \n \nServed as a professional consultant to courts around the country. Responded to court inquiries and worked as a member of the Jury Community of Practice for the National Center for State Courts.  \n \nAuthored the Jur-E Bulletin weekly newsletter reaching more than one thousand jury related professionals across the country. Research Assistant Government Department, College of William & Mary June 2002  –  December 2002  (7 months) Williamsburg, VA Authored and presented \"Veto Bargaining Between the Congress and President\" with Professor John Gilmour to the annual meeting of the Southern Political Science Association in November 2002, with research efforts focusing on the legislative relationship between the president and Congress. Research Assistant Government Department, College of William & Mary June 2002  –  December 2002  (7 months) Williamsburg, VA Authored and presented \"Veto Bargaining Between the Congress and President\" with Professor John Gilmour to the annual meeting of the Southern Political Science Association in November 2002, with research efforts focusing on the legislative relationship between the president and Congress. Languages   Skills Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Skills  Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Top Skills 15 Media Relations 14 Press Releases 10 Public Relations 5 Editing 4 Publicity 2 Writing 2 Social Media 2 Online Advertising 2 Facebook 2 Marketing Chris also knows about... 1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing                     1 Strategic Communications 1 Marketing Communications 1 Social Networking 1 Digital Media 1 Journalism 1 Advertising 1 SEO 1 Blogging 0 Public Speaking 0 Project Management 0 Marketing Strategy 0 Product Marketing Education The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 The College of William and Mary Bachelor's Degree 2001  – 2004 Glenbard West High School High School 1997  – 2001 The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more The Johns Hopkins University Master's Degree 2009  – 2014 (Open) 10 courses Research & Writing Methods (taught by: Deborah Beck of Beck Research) Media Effects (taught by: Jane Twomey of Johns Hopkins University) Digital Political Strategy (taught by: Alan Rosenblatt of the Center for American Progress) Press Secretary: Theory & Practice (taught by: David Helfert, Communications Director for Rep. Neil Abercrombie) Speechwriting: Theory & Practice (taught by: Ken Masugi of the Claremont Institute) Opinion Writing (taught by: Steve Daley of the Chicago Tribune and Porter Novelli) Political Communication: Campaigns (taught by: Shalaigh Murray, Communications Director for Vice President Joe Biden, and Stephanie Cutter, host of CNN's Crossfire) International Public Relations and Public Diplomacy (taught by: Joan Mower of Voice of America) Introduction to the Digital Age (taught by: Steve Thompson of Johns Hopkins University) Changing Behavior through Communication (taught by Jennifer Bishop-Crawford of the United States Department of Heath and Human Services) See more University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 University of Pennsylvania - The Wharton School Google Marketing Academy - Executive Education 2014  – 2014 The College of William and Mary Bachelor's Degree 2001  – 2004 The College of William and Mary Bachelor's Degree 2001  – 2004 The College of William and Mary Bachelor's Degree 2001  – 2004 Glenbard West High School High School 1997  – 2001 Glenbard West High School High School 1997  – 2001 Glenbard West High School High School 1997  – 2001 Honors & Awards ", "Experience Communications Manager Google January 2015  – Present (7 months) Mountain View, CA PR for Android Platform, Android Wear, Android Auto Communications Manager Google January 2014  –  January 2015  (1 year 1 month) Mountain View, CA PR for Google+, Hangouts, Photos. Developer Communications Google February 2012  –  January 2014  (2 years) Mountain View, CA PR for Google I/O, Cloud services, APIs and Developer products. Enterprise Google Docs Technical Specialist Google 2010  –  2012  (2 years) Account Executive LaunchSquad May 2009  –  April 2010  (1 year) Digital Media Research Fellow Content Film 2008  –  2008  (less than a year) Communications Manager Google January 2015  – Present (7 months) Mountain View, CA PR for Android Platform, Android Wear, Android Auto Communications Manager Google January 2015  – Present (7 months) Mountain View, CA PR for Android Platform, Android Wear, Android Auto Communications Manager Google January 2014  –  January 2015  (1 year 1 month) Mountain View, CA PR for Google+, Hangouts, Photos. Communications Manager Google January 2014  –  January 2015  (1 year 1 month) Mountain View, CA PR for Google+, Hangouts, Photos. Developer Communications Google February 2012  –  January 2014  (2 years) Mountain View, CA PR for Google I/O, Cloud services, APIs and Developer products. Developer Communications Google February 2012  –  January 2014  (2 years) Mountain View, CA PR for Google I/O, Cloud services, APIs and Developer products. Enterprise Google Docs Technical Specialist Google 2010  –  2012  (2 years) Enterprise Google Docs Technical Specialist Google 2010  –  2012  (2 years) Account Executive LaunchSquad May 2009  –  April 2010  (1 year) Account Executive LaunchSquad May 2009  –  April 2010  (1 year) Digital Media Research Fellow Content Film 2008  –  2008  (less than a year) Digital Media Research Fellow Content Film 2008  –  2008  (less than a year) Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 7 Digital Media 6 Digital Strategy 5 Public Relations 5 Social Media Marketing 3 Social Media 2 Press Releases 1 Media Relations 1 Blogging 1 Facebook 1 Digital Marketing Elizabeth also knows about... 1 Social Networking 1 Google Analytics 1 Strategic Communications 1 Salesforce.com 1 Content Strategy 1 Copywriting 1 New Media Skills  Top Skills 7 Digital Media 6 Digital Strategy 5 Public Relations 5 Social Media Marketing 3 Social Media 2 Press Releases 1 Media Relations 1 Blogging 1 Facebook 1 Digital Marketing Elizabeth also knows about... 1 Social Networking 1 Google Analytics 1 Strategic Communications 1 Salesforce.com 1 Content Strategy 1 Copywriting 1 New Media Top Skills 7 Digital Media 6 Digital Strategy 5 Public Relations 5 Social Media Marketing 3 Social Media 2 Press Releases 1 Media Relations 1 Blogging 1 Facebook 1 Digital Marketing Elizabeth also knows about... 1 Social Networking 1 Google Analytics 1 Strategic Communications 1 Salesforce.com 1 Content Strategy 1 Copywriting 1 New Media Top Skills 7 Digital Media 6 Digital Strategy 5 Public Relations 5 Social Media Marketing 3 Social Media 2 Press Releases 1 Media Relations 1 Blogging 1 Facebook 1 Digital Marketing Elizabeth also knows about... 1 Social Networking 1 Google Analytics 1 Strategic Communications 1 Salesforce.com 1 Content Strategy 1 Copywriting 1 New Media                     1 Social Networking 1 Google Analytics 1 Strategic Communications 1 Salesforce.com 1 Content Strategy 1 Copywriting 1 New Media Education Stanford University M.A.,  Digital Media and Communications 2007  – 2009 Stanford University B.A.,  Psychology 2004  – 2007 Stanford University M.A.,  Digital Media and Communications 2007  – 2009 Stanford University M.A.,  Digital Media and Communications 2007  – 2009 Stanford University M.A.,  Digital Media and Communications 2007  – 2009 Stanford University B.A.,  Psychology 2004  – 2007 Stanford University B.A.,  Psychology 2004  – 2007 Stanford University B.A.,  Psychology 2004  – 2007 ", "Experience Internal Communications Manager, Global Tech Google March 2014  – Present (1 year 5 months) Internal Communication Manager, EMEA Engineering & Product Management Google January 2010  –  February 2014  (4 years 2 months) Communications Manager Zattoo 2007  –  2009  (2 years) (Open) 1 recommendation Francesco Vass CEO at tutti.ch I've worked with Helen first at McKinsey, where she would make me smile daily with her column on the intranet. Then again at Zattoo, where she established and led our whole internal and external communications efforts. Helen easily juggles blog... View External and internal communications professional McKinsey & Company January 2001  –  July 2007  (6 years 7 months) Internal Communications Manager, Global Tech Google March 2014  – Present (1 year 5 months) Internal Communications Manager, Global Tech Google March 2014  – Present (1 year 5 months) Internal Communication Manager, EMEA Engineering & Product Management Google January 2010  –  February 2014  (4 years 2 months) Internal Communication Manager, EMEA Engineering & Product Management Google January 2010  –  February 2014  (4 years 2 months) Communications Manager Zattoo 2007  –  2009  (2 years) (Open) 1 recommendation Francesco Vass CEO at tutti.ch I've worked with Helen first at McKinsey, where she would make me smile daily with her column on the intranet. Then again at Zattoo, where she established and led our whole internal and external communications efforts. Helen easily juggles blog... View Communications Manager Zattoo 2007  –  2009  (2 years) (Open) 1 recommendation Francesco Vass CEO at tutti.ch I've worked with Helen first at McKinsey, where she would make me smile daily with her column on the intranet. Then again at Zattoo, where she established and led our whole internal and external communications efforts. Helen easily juggles blog... View External and internal communications professional McKinsey & Company January 2001  –  July 2007  (6 years 7 months) External and internal communications professional McKinsey & Company January 2001  –  July 2007  (6 years 7 months) Skills 29 Internal Communications 15 Blogging 7 Newsletters 6 Intranet 6 News Writing 3 User Experience 1 Written & Oral... 1 Entertainment Journalism Skills  29 Internal Communications 15 Blogging 7 Newsletters 6 Intranet 6 News Writing 3 User Experience 1 Written & Oral... 1 Entertainment Journalism 29 Internal Communications 15 Blogging 7 Newsletters 6 Intranet 6 News Writing 3 User Experience 1 Written & Oral... 1 Entertainment Journalism 29 Internal Communications 15 Blogging 7 Newsletters 6 Intranet 6 News Writing 3 User Experience 1 Written & Oral... 1 Entertainment Journalism                 Education University of Zurich lic. phil. I,  English literature and linguistics 1988  – 1998 Part-time student due to birth of my two children during this period. University of Zurich lic. phil. I,  English literature and linguistics 1988  – 1998 Part-time student due to birth of my two children during this period. University of Zurich lic. phil. I,  English literature and linguistics 1988  – 1998 Part-time student due to birth of my two children during this period. University of Zurich lic. phil. I,  English literature and linguistics 1988  – 1998 Part-time student due to birth of my two children during this period. ", "Summary Communications professional with experience in both internal and external comms across a variety of subject areas. Eight years at Google, with previous experience in small non-profits and large institutions in the U.S. and abroad.  Summary Communications professional with experience in both internal and external comms across a variety of subject areas. Eight years at Google, with previous experience in small non-profits and large institutions in the U.S. and abroad.  Communications professional with experience in both internal and external comms across a variety of subject areas. Eight years at Google, with previous experience in small non-profits and large institutions in the U.S. and abroad.  Communications professional with experience in both internal and external comms across a variety of subject areas. Eight years at Google, with previous experience in small non-profits and large institutions in the U.S. and abroad.  Experience Senior Manager, Internal Communications - Technical Infrastructure Google August 2013  – Present (2 years) Mountain View, CA I lead internal communications for the Technical Infrastructure organization (TI), led by SVP Urs Hoelzle. TI is the largest single product area at Google, with teams on six continents and in dozens of offices.  \n \nMy team and I:  \n- Provide strategic communications guidance to over a dozen VPs across Data Centers, Networking, SRE, Privacy and Security, Corporate IT and Google Cloud Platform \n- Produce presentations for team all-hands meetings and TGIF (Google's weekly company-wide meeting) \n- Lead communications workshops for senior leaders looking to improve their skills \n- Work with engineers and product managers to publish internal news articles (and the occasional goofy video) to inform Googlers of what's going on in Technical Infrastructure \n- Work closely with Human Resources and other internal partners on change communications (leadership changes, team reorganizations, etc.) \n- Nurture and protect the unique elements of Google culture that make it such a great place to work \n \n \n Communications Manager, Google Green and Google.org Google December 2010  –  August 2013  (2 years 9 months) Mountain View, CA External communications lead for data center energy efficiency, renewable energy and Google.org’s environmental initiatives.  \n \nKey Accomplishments: \n- Threw open the doors to Google's data centers with the first-ever visit from a reporter (Steven Levy) and photos of our facilities.  \n- Raised awareness of Google's leadership in sustainability and renewable energy, contributing to our 1st place ranking in the 2012 and 2013 Greenpeace Cool IT Leaderboard. \n- Organized the 2011 European Data Center Efficiency and 2013 “How Green is the Internet?” summits. \n- Launched Google Earth Engine at the 2010 United Nations Framework Convention on Climate Change in Cancun, Mexico. \n \n Manager, Internal Communications, Spanish Speaking Latin America Google April 2012  –  October 2012  (7 months) Buenos Aires, Argentina Assignment in Buenos Aires managing internal communications for Google's Latin American sales organization while maintaining Google Green responsibilities.  \n \nKey accomplishments: \n- Was interviewed in Spanish on national television and survived. \n \n \n Communications Manager, Google Earth and Maps Google April 2007  –  November 2010  (3 years 8 months) Mountain View, CA External communications lead for Google’s mapping products.  \n \nKey accomplishments:  \n- Brought CNN to the Brazilian Amazon to cover a series of training workshops held by the Google Earth Outreach team. Resulted in CNN's first-ever live broadcast from the Amazonian rainforest.  \n- Coordinated Ocean in Google Earth launch event with Al Gore, Eric Schmidt and Marissa Mayer. Assistant Director, Operation Assist The Children's Health Fund September 2005  –  March 2007  (1 year 7 months) - Developed programs, coordinated logistics and provided budgetary oversight for CHF’s efforts in the recovery and rebuilding of the post-Katrina Gulf Coast (including clinical programs, public health initiatives and demographic studies) \n- Researched, designed and implemented preparedness guidelines and emergency response plans for CHF’s National Network of mobile health clinics \n- Supervised Operation Assist Coordinator, Regional Logistics Coordinator and contracted consultants \n \nPrevious role: \nManager, Operation Assist (2005 - 2006) \n Media Relations Officer City of Athens, Zappeion Press Center July 2004  –  August 2004  (2 months) Athens, Greece - Produced and edited daily newsletter sent to 1200 journalists during 2004 Olympic Games \n- Provided daily press updates and media analysis to Athens Mayor Dora Bakoyannis \n- Finagled tickets to synchronized swimming, gymnastics and women's soccer  \n Coordinator, Margaret Mead Film and Video Festival American Museum of Natural History 1997  –  2002  (5 years) New York, NY Coordinated logistical and creative aspects of the nation’s longest-running showcase for international documentary and other Museum film events. Responsibilities included research, pre-screening, writing of publicity materials, supervision of interns, oversight of Traveling Festival and High School Program. \n \n \nPrevious roles: \nFestival Associate (2000-2001) \nFestival Assistant (1998-2000) \nIntern (1997-1998) \n Senior Manager, Internal Communications - Technical Infrastructure Google August 2013  – Present (2 years) Mountain View, CA I lead internal communications for the Technical Infrastructure organization (TI), led by SVP Urs Hoelzle. TI is the largest single product area at Google, with teams on six continents and in dozens of offices.  \n \nMy team and I:  \n- Provide strategic communications guidance to over a dozen VPs across Data Centers, Networking, SRE, Privacy and Security, Corporate IT and Google Cloud Platform \n- Produce presentations for team all-hands meetings and TGIF (Google's weekly company-wide meeting) \n- Lead communications workshops for senior leaders looking to improve their skills \n- Work with engineers and product managers to publish internal news articles (and the occasional goofy video) to inform Googlers of what's going on in Technical Infrastructure \n- Work closely with Human Resources and other internal partners on change communications (leadership changes, team reorganizations, etc.) \n- Nurture and protect the unique elements of Google culture that make it such a great place to work \n \n \n Senior Manager, Internal Communications - Technical Infrastructure Google August 2013  – Present (2 years) Mountain View, CA I lead internal communications for the Technical Infrastructure organization (TI), led by SVP Urs Hoelzle. TI is the largest single product area at Google, with teams on six continents and in dozens of offices.  \n \nMy team and I:  \n- Provide strategic communications guidance to over a dozen VPs across Data Centers, Networking, SRE, Privacy and Security, Corporate IT and Google Cloud Platform \n- Produce presentations for team all-hands meetings and TGIF (Google's weekly company-wide meeting) \n- Lead communications workshops for senior leaders looking to improve their skills \n- Work with engineers and product managers to publish internal news articles (and the occasional goofy video) to inform Googlers of what's going on in Technical Infrastructure \n- Work closely with Human Resources and other internal partners on change communications (leadership changes, team reorganizations, etc.) \n- Nurture and protect the unique elements of Google culture that make it such a great place to work \n \n \n Communications Manager, Google Green and Google.org Google December 2010  –  August 2013  (2 years 9 months) Mountain View, CA External communications lead for data center energy efficiency, renewable energy and Google.org’s environmental initiatives.  \n \nKey Accomplishments: \n- Threw open the doors to Google's data centers with the first-ever visit from a reporter (Steven Levy) and photos of our facilities.  \n- Raised awareness of Google's leadership in sustainability and renewable energy, contributing to our 1st place ranking in the 2012 and 2013 Greenpeace Cool IT Leaderboard. \n- Organized the 2011 European Data Center Efficiency and 2013 “How Green is the Internet?” summits. \n- Launched Google Earth Engine at the 2010 United Nations Framework Convention on Climate Change in Cancun, Mexico. \n \n Communications Manager, Google Green and Google.org Google December 2010  –  August 2013  (2 years 9 months) Mountain View, CA External communications lead for data center energy efficiency, renewable energy and Google.org’s environmental initiatives.  \n \nKey Accomplishments: \n- Threw open the doors to Google's data centers with the first-ever visit from a reporter (Steven Levy) and photos of our facilities.  \n- Raised awareness of Google's leadership in sustainability and renewable energy, contributing to our 1st place ranking in the 2012 and 2013 Greenpeace Cool IT Leaderboard. \n- Organized the 2011 European Data Center Efficiency and 2013 “How Green is the Internet?” summits. \n- Launched Google Earth Engine at the 2010 United Nations Framework Convention on Climate Change in Cancun, Mexico. \n \n Manager, Internal Communications, Spanish Speaking Latin America Google April 2012  –  October 2012  (7 months) Buenos Aires, Argentina Assignment in Buenos Aires managing internal communications for Google's Latin American sales organization while maintaining Google Green responsibilities.  \n \nKey accomplishments: \n- Was interviewed in Spanish on national television and survived. \n \n \n Manager, Internal Communications, Spanish Speaking Latin America Google April 2012  –  October 2012  (7 months) Buenos Aires, Argentina Assignment in Buenos Aires managing internal communications for Google's Latin American sales organization while maintaining Google Green responsibilities.  \n \nKey accomplishments: \n- Was interviewed in Spanish on national television and survived. \n \n \n Communications Manager, Google Earth and Maps Google April 2007  –  November 2010  (3 years 8 months) Mountain View, CA External communications lead for Google’s mapping products.  \n \nKey accomplishments:  \n- Brought CNN to the Brazilian Amazon to cover a series of training workshops held by the Google Earth Outreach team. Resulted in CNN's first-ever live broadcast from the Amazonian rainforest.  \n- Coordinated Ocean in Google Earth launch event with Al Gore, Eric Schmidt and Marissa Mayer. Communications Manager, Google Earth and Maps Google April 2007  –  November 2010  (3 years 8 months) Mountain View, CA External communications lead for Google’s mapping products.  \n \nKey accomplishments:  \n- Brought CNN to the Brazilian Amazon to cover a series of training workshops held by the Google Earth Outreach team. Resulted in CNN's first-ever live broadcast from the Amazonian rainforest.  \n- Coordinated Ocean in Google Earth launch event with Al Gore, Eric Schmidt and Marissa Mayer. Assistant Director, Operation Assist The Children's Health Fund September 2005  –  March 2007  (1 year 7 months) - Developed programs, coordinated logistics and provided budgetary oversight for CHF’s efforts in the recovery and rebuilding of the post-Katrina Gulf Coast (including clinical programs, public health initiatives and demographic studies) \n- Researched, designed and implemented preparedness guidelines and emergency response plans for CHF’s National Network of mobile health clinics \n- Supervised Operation Assist Coordinator, Regional Logistics Coordinator and contracted consultants \n \nPrevious role: \nManager, Operation Assist (2005 - 2006) \n Assistant Director, Operation Assist The Children's Health Fund September 2005  –  March 2007  (1 year 7 months) - Developed programs, coordinated logistics and provided budgetary oversight for CHF’s efforts in the recovery and rebuilding of the post-Katrina Gulf Coast (including clinical programs, public health initiatives and demographic studies) \n- Researched, designed and implemented preparedness guidelines and emergency response plans for CHF’s National Network of mobile health clinics \n- Supervised Operation Assist Coordinator, Regional Logistics Coordinator and contracted consultants \n \nPrevious role: \nManager, Operation Assist (2005 - 2006) \n Media Relations Officer City of Athens, Zappeion Press Center July 2004  –  August 2004  (2 months) Athens, Greece - Produced and edited daily newsletter sent to 1200 journalists during 2004 Olympic Games \n- Provided daily press updates and media analysis to Athens Mayor Dora Bakoyannis \n- Finagled tickets to synchronized swimming, gymnastics and women's soccer  \n Media Relations Officer City of Athens, Zappeion Press Center July 2004  –  August 2004  (2 months) Athens, Greece - Produced and edited daily newsletter sent to 1200 journalists during 2004 Olympic Games \n- Provided daily press updates and media analysis to Athens Mayor Dora Bakoyannis \n- Finagled tickets to synchronized swimming, gymnastics and women's soccer  \n Coordinator, Margaret Mead Film and Video Festival American Museum of Natural History 1997  –  2002  (5 years) New York, NY Coordinated logistical and creative aspects of the nation’s longest-running showcase for international documentary and other Museum film events. Responsibilities included research, pre-screening, writing of publicity materials, supervision of interns, oversight of Traveling Festival and High School Program. \n \n \nPrevious roles: \nFestival Associate (2000-2001) \nFestival Assistant (1998-2000) \nIntern (1997-1998) \n Coordinator, Margaret Mead Film and Video Festival American Museum of Natural History 1997  –  2002  (5 years) New York, NY Coordinated logistical and creative aspects of the nation’s longest-running showcase for international documentary and other Museum film events. Responsibilities included research, pre-screening, writing of publicity materials, supervision of interns, oversight of Traveling Festival and High School Program. \n \n \nPrevious roles: \nFestival Associate (2000-2001) \nFestival Assistant (1998-2000) \nIntern (1997-1998) \n Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Top Skills 14 Strategic Communications 8 Internal Communications 6 Social Media 6 Content Strategy 4 Digital Media 3 Community Outreach 2 Renewable Energy 2 Energy Efficiency 2 Corporate Social... 1 Corporate Sustainability Kate also knows about... 1 Cultural Anthropology 1 Cross-functional Team... 1 Data Center 0 Product Communication Skills  Top Skills 14 Strategic Communications 8 Internal Communications 6 Social Media 6 Content Strategy 4 Digital Media 3 Community Outreach 2 Renewable Energy 2 Energy Efficiency 2 Corporate Social... 1 Corporate Sustainability Kate also knows about... 1 Cultural Anthropology 1 Cross-functional Team... 1 Data Center 0 Product Communication Top Skills 14 Strategic Communications 8 Internal Communications 6 Social Media 6 Content Strategy 4 Digital Media 3 Community Outreach 2 Renewable Energy 2 Energy Efficiency 2 Corporate Social... 1 Corporate Sustainability Kate also knows about... 1 Cultural Anthropology 1 Cross-functional Team... 1 Data Center 0 Product Communication Top Skills 14 Strategic Communications 8 Internal Communications 6 Social Media 6 Content Strategy 4 Digital Media 3 Community Outreach 2 Renewable Energy 2 Energy Efficiency 2 Corporate Social... 1 Corporate Sustainability Kate also knows about... 1 Cultural Anthropology 1 Cross-functional Team... 1 Data Center 0 Product Communication                     1 Cultural Anthropology 1 Cross-functional Team... 1 Data Center 0 Product Communication ", "Summary Providing employees and their families with access to evidence-based wellness programs that meet their needs, whenever and wherever they need them, no matter their health status. Summary Providing employees and their families with access to evidence-based wellness programs that meet their needs, whenever and wherever they need them, no matter their health status. Providing employees and their families with access to evidence-based wellness programs that meet their needs, whenever and wherever they need them, no matter their health status. Providing employees and their families with access to evidence-based wellness programs that meet their needs, whenever and wherever they need them, no matter their health status. Experience Projects and Communications Manager, Benefits Google May 2011  – Present (4 years 3 months) Lead Engagement for Health and Wellness Initiative \n* Launched the new wellness initiative to all global employees. \n* Consult with program managers on engagement strategies for our programs and campaigns. \n* Plan communications for health and wellness program launches and campaigns to sustain employee and dependent engagement. \n* Develop and deploy wellness programs such as onsite health consultations, flu prevention, tobacco cessation. Projects and Communications Specialist, Benefits Google March 2010  –  May 2011  (1 year 3 months) Mountain View, California Financial Education initiative \n* Managed budget and tracked metrics for global education initiative. \n* Managed communications, drove engagement and helped plan program consisting of financial classes, speakers, 1:1 sessions and online resources. \n \nHealth and Wellness Pilot \n* Designed, launched and implemented a controlled experiment where we tracked awareness, behavior changes and health outcomes amongst two groups of new hires. \n \nChildren's Center Practicum Program \n* Created a program to hire practicum students in our Children's Centers that provides them with hands on experience that builds on their studies. \n* Contributed to first student hire. Talent & Outreach Programs Specialist Google September 2006  –  March 2010  (3 years 7 months) Scholarship Programs  \n* Managed Google's Scholarship Programs including marketing, application, review, selection, awarding and payment processes.  \n* Launched new scholarships, nationally and abroad. \n* Planned Annual Scholars' Retreat \n \nInternship Programs \n* Worked on assignment in Zurich for 6 months to enhance the EMEA internship program. \n* Oversaw global internship programs to ensure global consistency in hiring, onboarding, events and performance reviews. \n \nOther Projects \n* Planned events and camps for top students, to encourage the study of STEM subjects. \n* Hosted international student visits. \n* Created university marketing campaigns. Recruiting Coordinator Google May 2005  –  September 2006  (1 year 5 months) Supported the recruiting function for the Engineering Recruiting team. \n* Facilitated all stages of the hiring process to ensure positive candidate experience. \n* Recruited interns for UI Design and User Experience teams. \n* Acted as lead for the recruiting coordinator team. \n* Audited offer packets going for final reviews. Operations / Office Manager Villa Italia Gourmet Food & Wine, Inc. July 2002  –  May 2005  (2 years 11 months) South San Francisco, CA Office Manager \n* Planned all wine tastings and company events, both locally and internationally. \n* Managed office of 12 full-time employees. \n* Acted as primary contact between wineries abroad and our office. \n* Accountable for legal compliance associated with importing wine. \n* Edited company website. \n \nOperations Manager \n* Coordinated shipping and receiving of all goods, including containers from Europe, orders to our wholesale distributors throughout the U.S., and to local Bay Area restaurants. \n* Managed inventory.  \n* Prepared monthly sales reports. Projects and Communications Manager, Benefits Google May 2011  – Present (4 years 3 months) Lead Engagement for Health and Wellness Initiative \n* Launched the new wellness initiative to all global employees. \n* Consult with program managers on engagement strategies for our programs and campaigns. \n* Plan communications for health and wellness program launches and campaigns to sustain employee and dependent engagement. \n* Develop and deploy wellness programs such as onsite health consultations, flu prevention, tobacco cessation. Projects and Communications Manager, Benefits Google May 2011  – Present (4 years 3 months) Lead Engagement for Health and Wellness Initiative \n* Launched the new wellness initiative to all global employees. \n* Consult with program managers on engagement strategies for our programs and campaigns. \n* Plan communications for health and wellness program launches and campaigns to sustain employee and dependent engagement. \n* Develop and deploy wellness programs such as onsite health consultations, flu prevention, tobacco cessation. Projects and Communications Specialist, Benefits Google March 2010  –  May 2011  (1 year 3 months) Mountain View, California Financial Education initiative \n* Managed budget and tracked metrics for global education initiative. \n* Managed communications, drove engagement and helped plan program consisting of financial classes, speakers, 1:1 sessions and online resources. \n \nHealth and Wellness Pilot \n* Designed, launched and implemented a controlled experiment where we tracked awareness, behavior changes and health outcomes amongst two groups of new hires. \n \nChildren's Center Practicum Program \n* Created a program to hire practicum students in our Children's Centers that provides them with hands on experience that builds on their studies. \n* Contributed to first student hire. Projects and Communications Specialist, Benefits Google March 2010  –  May 2011  (1 year 3 months) Mountain View, California Financial Education initiative \n* Managed budget and tracked metrics for global education initiative. \n* Managed communications, drove engagement and helped plan program consisting of financial classes, speakers, 1:1 sessions and online resources. \n \nHealth and Wellness Pilot \n* Designed, launched and implemented a controlled experiment where we tracked awareness, behavior changes and health outcomes amongst two groups of new hires. \n \nChildren's Center Practicum Program \n* Created a program to hire practicum students in our Children's Centers that provides them with hands on experience that builds on their studies. \n* Contributed to first student hire. Talent & Outreach Programs Specialist Google September 2006  –  March 2010  (3 years 7 months) Scholarship Programs  \n* Managed Google's Scholarship Programs including marketing, application, review, selection, awarding and payment processes.  \n* Launched new scholarships, nationally and abroad. \n* Planned Annual Scholars' Retreat \n \nInternship Programs \n* Worked on assignment in Zurich for 6 months to enhance the EMEA internship program. \n* Oversaw global internship programs to ensure global consistency in hiring, onboarding, events and performance reviews. \n \nOther Projects \n* Planned events and camps for top students, to encourage the study of STEM subjects. \n* Hosted international student visits. \n* Created university marketing campaigns. Talent & Outreach Programs Specialist Google September 2006  –  March 2010  (3 years 7 months) Scholarship Programs  \n* Managed Google's Scholarship Programs including marketing, application, review, selection, awarding and payment processes.  \n* Launched new scholarships, nationally and abroad. \n* Planned Annual Scholars' Retreat \n \nInternship Programs \n* Worked on assignment in Zurich for 6 months to enhance the EMEA internship program. \n* Oversaw global internship programs to ensure global consistency in hiring, onboarding, events and performance reviews. \n \nOther Projects \n* Planned events and camps for top students, to encourage the study of STEM subjects. \n* Hosted international student visits. \n* Created university marketing campaigns. Recruiting Coordinator Google May 2005  –  September 2006  (1 year 5 months) Supported the recruiting function for the Engineering Recruiting team. \n* Facilitated all stages of the hiring process to ensure positive candidate experience. \n* Recruited interns for UI Design and User Experience teams. \n* Acted as lead for the recruiting coordinator team. \n* Audited offer packets going for final reviews. Recruiting Coordinator Google May 2005  –  September 2006  (1 year 5 months) Supported the recruiting function for the Engineering Recruiting team. \n* Facilitated all stages of the hiring process to ensure positive candidate experience. \n* Recruited interns for UI Design and User Experience teams. \n* Acted as lead for the recruiting coordinator team. \n* Audited offer packets going for final reviews. Operations / Office Manager Villa Italia Gourmet Food & Wine, Inc. July 2002  –  May 2005  (2 years 11 months) South San Francisco, CA Office Manager \n* Planned all wine tastings and company events, both locally and internationally. \n* Managed office of 12 full-time employees. \n* Acted as primary contact between wineries abroad and our office. \n* Accountable for legal compliance associated with importing wine. \n* Edited company website. \n \nOperations Manager \n* Coordinated shipping and receiving of all goods, including containers from Europe, orders to our wholesale distributors throughout the U.S., and to local Bay Area restaurants. \n* Managed inventory.  \n* Prepared monthly sales reports. Operations / Office Manager Villa Italia Gourmet Food & Wine, Inc. July 2002  –  May 2005  (2 years 11 months) South San Francisco, CA Office Manager \n* Planned all wine tastings and company events, both locally and internationally. \n* Managed office of 12 full-time employees. \n* Acted as primary contact between wineries abroad and our office. \n* Accountable for legal compliance associated with importing wine. \n* Edited company website. \n \nOperations Manager \n* Coordinated shipping and receiving of all goods, including containers from Europe, orders to our wholesale distributors throughout the U.S., and to local Bay Area restaurants. \n* Managed inventory.  \n* Prepared monthly sales reports. Languages Spanish Italian Spanish Italian Spanish Italian Skills 8 Recruiting 4 Onboarding 4 Employee Benefits 3 College Recruiting 2 Technical Recruiting 1 Talent Acquisition 0 University Relations 0 Social Networking Skills  8 Recruiting 4 Onboarding 4 Employee Benefits 3 College Recruiting 2 Technical Recruiting 1 Talent Acquisition 0 University Relations 0 Social Networking 8 Recruiting 4 Onboarding 4 Employee Benefits 3 College Recruiting 2 Technical Recruiting 1 Talent Acquisition 0 University Relations 0 Social Networking 8 Recruiting 4 Onboarding 4 Employee Benefits 3 College Recruiting 2 Technical Recruiting 1 Talent Acquisition 0 University Relations 0 Social Networking                 Education University of California, Santa Barbara BA,  Latin American & Iberian Studies and Italian Studies 1998  – 2002 Universidad de Granada Study abroad 2000  – 2001 Activities and Societies:  Studied abroad with the University of California Education Abroad Program University of California, Santa Barbara BA,  Latin American & Iberian Studies and Italian Studies 1998  – 2002 University of California, Santa Barbara BA,  Latin American & Iberian Studies and Italian Studies 1998  – 2002 University of California, Santa Barbara BA,  Latin American & Iberian Studies and Italian Studies 1998  – 2002 Universidad de Granada Study abroad 2000  – 2001 Activities and Societies:  Studied abroad with the University of California Education Abroad Program Universidad de Granada Study abroad 2000  – 2001 Activities and Societies:  Studied abroad with the University of California Education Abroad Program Universidad de Granada Study abroad 2000  – 2001 Activities and Societies:  Studied abroad with the University of California Education Abroad Program ", "Experience Head of Internal Communications (Europe, the Middle East and Africa) Google January 2015  – Present (7 months) London, United Kingdom Internal Communications Manager (Europe, the Middle East and Africa) Google September 2012  –  January 2015  (2 years 5 months) London, United Kingdom Internal Communications and Events Manager (UK) Google May 2011  –  September 2012  (1 year 5 months) London, United Kingdom Associate, Agency Team (Northern and Central Europe) Google November 2009  –  May 2011  (1 year 7 months) Google (Northern and Central Europe) Assistant to Country Director, Google UK Google UK January 2007  –  November 2009  (2 years 11 months) London, United Kingdom Head of Internal Communications (Europe, the Middle East and Africa) Google January 2015  – Present (7 months) London, United Kingdom Head of Internal Communications (Europe, the Middle East and Africa) Google January 2015  – Present (7 months) London, United Kingdom Internal Communications Manager (Europe, the Middle East and Africa) Google September 2012  –  January 2015  (2 years 5 months) London, United Kingdom Internal Communications Manager (Europe, the Middle East and Africa) Google September 2012  –  January 2015  (2 years 5 months) London, United Kingdom Internal Communications and Events Manager (UK) Google May 2011  –  September 2012  (1 year 5 months) London, United Kingdom Internal Communications and Events Manager (UK) Google May 2011  –  September 2012  (1 year 5 months) London, United Kingdom Associate, Agency Team (Northern and Central Europe) Google November 2009  –  May 2011  (1 year 7 months) Google (Northern and Central Europe) Associate, Agency Team (Northern and Central Europe) Google November 2009  –  May 2011  (1 year 7 months) Google (Northern and Central Europe) Assistant to Country Director, Google UK Google UK January 2007  –  November 2009  (2 years 11 months) London, United Kingdom Assistant to Country Director, Google UK Google UK January 2007  –  November 2009  (2 years 11 months) London, United Kingdom Skills Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Skills  Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events...                     1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Education King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London BA Double Hons,  Classics & English 2001  – 2004 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest School GCSEs,  Various 1994  – 1999 King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London BA Double Hons,  Classics & English 2001  – 2004 King's College London BA Double Hons,  Classics & English 2001  – 2004 King's College London BA Double Hons,  Classics & English 2001  – 2004 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest School GCSEs,  Various 1994  – 1999 Forest School GCSEs,  Various 1994  – 1999 Forest School GCSEs,  Various 1994  – 1999 ", "Experience Head of Internal Communications (Europe, the Middle East and Africa) Google January 2015  – Present (7 months) London, United Kingdom Internal Communications Manager (Europe, the Middle East and Africa) Google September 2012  –  January 2015  (2 years 5 months) London, United Kingdom Internal Communications and Events Manager (UK) Google May 2011  –  September 2012  (1 year 5 months) London, United Kingdom Associate, Agency Team (Northern and Central Europe) Google November 2009  –  May 2011  (1 year 7 months) Google (Northern and Central Europe) Assistant to Country Director, Google UK Google UK January 2007  –  November 2009  (2 years 11 months) London, United Kingdom Head of Internal Communications (Europe, the Middle East and Africa) Google January 2015  – Present (7 months) London, United Kingdom Head of Internal Communications (Europe, the Middle East and Africa) Google January 2015  – Present (7 months) London, United Kingdom Internal Communications Manager (Europe, the Middle East and Africa) Google September 2012  –  January 2015  (2 years 5 months) London, United Kingdom Internal Communications Manager (Europe, the Middle East and Africa) Google September 2012  –  January 2015  (2 years 5 months) London, United Kingdom Internal Communications and Events Manager (UK) Google May 2011  –  September 2012  (1 year 5 months) London, United Kingdom Internal Communications and Events Manager (UK) Google May 2011  –  September 2012  (1 year 5 months) London, United Kingdom Associate, Agency Team (Northern and Central Europe) Google November 2009  –  May 2011  (1 year 7 months) Google (Northern and Central Europe) Associate, Agency Team (Northern and Central Europe) Google November 2009  –  May 2011  (1 year 7 months) Google (Northern and Central Europe) Assistant to Country Director, Google UK Google UK January 2007  –  November 2009  (2 years 11 months) London, United Kingdom Assistant to Country Director, Google UK Google UK January 2007  –  November 2009  (2 years 11 months) London, United Kingdom Skills Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Skills  Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Top Skills 11 Internal Communications 3 SEM 3 Content Strategy 2 Corporate Communications 2 Copywriting 2 Digital Copywriting 2 Digital Marketing 2 Online Advertising 1 Digital Media 1 Web Analytics Chloe also knows about... 1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events...                     1 Google Analytics 1 Online Marketing 1 Google Adwords 1 Digital Strategy 1 Mobile Marketing 1 Social Media 1 PPC 0 Special Events... Education King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London BA Double Hons,  Classics & English 2001  – 2004 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest School GCSEs,  Various 1994  – 1999 King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London MA,  English Literature: Shakespearean Drama 2004  – 2006 King's College London BA Double Hons,  Classics & English 2001  – 2004 King's College London BA Double Hons,  Classics & English 2001  – 2004 King's College London BA Double Hons,  Classics & English 2001  – 2004 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest Sixth Form College A-Levels,  English ,  Business Studies ,  Government and Politics 1999  – 2001 Forest School GCSEs,  Various 1994  – 1999 Forest School GCSEs,  Various 1994  – 1999 Forest School GCSEs,  Various 1994  – 1999 ", "Experience Public Policy & Communications Manager, Special Projects Google June 2015  – Present (2 months) San Francisco Bay Area Sidewalk Labs - www.sidewalkinc.com \nOther projects to be announced Public Policy & Government Relations, Manager Google November 2013  –  June 2015  (1 year 8 months) Asia Pacific, Middle East, Africa & Russia Economic policy, campaigns and strategy \n \n(3 month rotation to Europe on a project working on Google's data centers) \n \nProjects include: \n- Launched YouTube in Thailand \n- Setting up the Google APAC blog  \n- SME Heroes project in Hong Kong and then India \n- Data localization research and campaign \n- Launched Street View in Mongolia \n- Economic impact of Belgium data center \n Co Founder HkHelpersCampaign October 2013  –  June 2014  (9 months) Hong Kong Co-founded advocacy group to promote the rights of domestic workers in Hong Kong. Website: http://hkhelperscampaign.com/ Senior Policy Analyst Google Inc. November 2011  –  November 2013  (2 years 1 month) Hong Kong Projects include: \n \n- Launched Street View in Bangladesh \n- Innovation stimulus projects in Punjab (Pakistan), Karnataka (India), Thailand, Taiwan and Korea \n- Led company Chairman, Eric Schmidt, on trip to Pakistan, including meeting with Prime Minister and the Army Chief \n- Organized senior executive trip to Senegal, Nigeria and South Africa \n- Set up School of Internet & Society in the Lahore School of Management Sciences, Pakistan \n Director Asia Internet Coalition December 2010  –  December 2011  (1 year 1 month) Hong Kong Projects include: \n \n- Launched the Asia Internet Coalition (with 4 other companies) & served as Treasurer on the Board Public Policy Analyst Google November 2010  –  November 2011  (1 year 1 month) Hong Kong Policy lead for Hong Kong, Macau & Pakistan \n \nProjects include: \n \n- Economic impact on the web report in Hong Kong \n- Street View permission in Pakistan + MOU with Punjab Chief Minister \n- HK data center announcement \n- HK copyright legislative review process \n- Launched the Google policy fellowship to APAC \n- Launched the Asia Internet Coalition and served on the board of directors (Treasurer) \n Public Policy Associate Google July 2010  –  November 2010  (5 months) Hong Kong Policy head for Hong Kong, Macau & Pakistan \nPolicy support for regional director (report writing, briefing documents, etc) \n \nProjects include: \n- Google disaster response to floods in Pakistan & $1m USD grant to NGOs \n Online Media Associate Google September 2008  –  July 2010  (1 year 11 months) Volunteer Dublin Simon Community September 2008  –  February 2010  (1 year 6 months) Volunteer Suas / Sabuj Sangha June 2008  –  September 2008  (4 months) Online Operations Intern Google June 2007  –  September 2007  (4 months) Public Policy & Communications Manager, Special Projects Google June 2015  – Present (2 months) San Francisco Bay Area Sidewalk Labs - www.sidewalkinc.com \nOther projects to be announced Public Policy & Communications Manager, Special Projects Google June 2015  – Present (2 months) San Francisco Bay Area Sidewalk Labs - www.sidewalkinc.com \nOther projects to be announced Public Policy & Government Relations, Manager Google November 2013  –  June 2015  (1 year 8 months) Asia Pacific, Middle East, Africa & Russia Economic policy, campaigns and strategy \n \n(3 month rotation to Europe on a project working on Google's data centers) \n \nProjects include: \n- Launched YouTube in Thailand \n- Setting up the Google APAC blog  \n- SME Heroes project in Hong Kong and then India \n- Data localization research and campaign \n- Launched Street View in Mongolia \n- Economic impact of Belgium data center \n Public Policy & Government Relations, Manager Google November 2013  –  June 2015  (1 year 8 months) Asia Pacific, Middle East, Africa & Russia Economic policy, campaigns and strategy \n \n(3 month rotation to Europe on a project working on Google's data centers) \n \nProjects include: \n- Launched YouTube in Thailand \n- Setting up the Google APAC blog  \n- SME Heroes project in Hong Kong and then India \n- Data localization research and campaign \n- Launched Street View in Mongolia \n- Economic impact of Belgium data center \n Co Founder HkHelpersCampaign October 2013  –  June 2014  (9 months) Hong Kong Co-founded advocacy group to promote the rights of domestic workers in Hong Kong. Website: http://hkhelperscampaign.com/ Co Founder HkHelpersCampaign October 2013  –  June 2014  (9 months) Hong Kong Co-founded advocacy group to promote the rights of domestic workers in Hong Kong. Website: http://hkhelperscampaign.com/ Senior Policy Analyst Google Inc. November 2011  –  November 2013  (2 years 1 month) Hong Kong Projects include: \n \n- Launched Street View in Bangladesh \n- Innovation stimulus projects in Punjab (Pakistan), Karnataka (India), Thailand, Taiwan and Korea \n- Led company Chairman, Eric Schmidt, on trip to Pakistan, including meeting with Prime Minister and the Army Chief \n- Organized senior executive trip to Senegal, Nigeria and South Africa \n- Set up School of Internet & Society in the Lahore School of Management Sciences, Pakistan \n Senior Policy Analyst Google Inc. November 2011  –  November 2013  (2 years 1 month) Hong Kong Projects include: \n \n- Launched Street View in Bangladesh \n- Innovation stimulus projects in Punjab (Pakistan), Karnataka (India), Thailand, Taiwan and Korea \n- Led company Chairman, Eric Schmidt, on trip to Pakistan, including meeting with Prime Minister and the Army Chief \n- Organized senior executive trip to Senegal, Nigeria and South Africa \n- Set up School of Internet & Society in the Lahore School of Management Sciences, Pakistan \n Director Asia Internet Coalition December 2010  –  December 2011  (1 year 1 month) Hong Kong Projects include: \n \n- Launched the Asia Internet Coalition (with 4 other companies) & served as Treasurer on the Board Director Asia Internet Coalition December 2010  –  December 2011  (1 year 1 month) Hong Kong Projects include: \n \n- Launched the Asia Internet Coalition (with 4 other companies) & served as Treasurer on the Board Public Policy Analyst Google November 2010  –  November 2011  (1 year 1 month) Hong Kong Policy lead for Hong Kong, Macau & Pakistan \n \nProjects include: \n \n- Economic impact on the web report in Hong Kong \n- Street View permission in Pakistan + MOU with Punjab Chief Minister \n- HK data center announcement \n- HK copyright legislative review process \n- Launched the Google policy fellowship to APAC \n- Launched the Asia Internet Coalition and served on the board of directors (Treasurer) \n Public Policy Analyst Google November 2010  –  November 2011  (1 year 1 month) Hong Kong Policy lead for Hong Kong, Macau & Pakistan \n \nProjects include: \n \n- Economic impact on the web report in Hong Kong \n- Street View permission in Pakistan + MOU with Punjab Chief Minister \n- HK data center announcement \n- HK copyright legislative review process \n- Launched the Google policy fellowship to APAC \n- Launched the Asia Internet Coalition and served on the board of directors (Treasurer) \n Public Policy Associate Google July 2010  –  November 2010  (5 months) Hong Kong Policy head for Hong Kong, Macau & Pakistan \nPolicy support for regional director (report writing, briefing documents, etc) \n \nProjects include: \n- Google disaster response to floods in Pakistan & $1m USD grant to NGOs \n Public Policy Associate Google July 2010  –  November 2010  (5 months) Hong Kong Policy head for Hong Kong, Macau & Pakistan \nPolicy support for regional director (report writing, briefing documents, etc) \n \nProjects include: \n- Google disaster response to floods in Pakistan & $1m USD grant to NGOs \n Online Media Associate Google September 2008  –  July 2010  (1 year 11 months) Online Media Associate Google September 2008  –  July 2010  (1 year 11 months) Volunteer Dublin Simon Community September 2008  –  February 2010  (1 year 6 months) Volunteer Dublin Simon Community September 2008  –  February 2010  (1 year 6 months) Volunteer Suas / Sabuj Sangha June 2008  –  September 2008  (4 months) Volunteer Suas / Sabuj Sangha June 2008  –  September 2008  (4 months) Online Operations Intern Google June 2007  –  September 2007  (4 months) Online Operations Intern Google June 2007  –  September 2007  (4 months) Skills Top Skills 31 Policy 24 New Media 21 Strategy 18 Politics 12 Research 11 Public Relations 9 Strategic Communications 9 Business Strategy 9 Human Rights 8 Digital Marketing William also knows about... 8 Media Relations 8 Social Networking 7 Project Management 6 Social Media 5 Strategic Planning 4 Policy Analysis 3 International... 3 Public Policy 1 Networking 1 Team Leadership 1 Public Speaking 1 Corporate Social... 1 Event Management 1 Social Media Marketing 1 Qualitative Research 1 Public Affairs 1 Corporate Communications See 2+     See less Skills  Top Skills 31 Policy 24 New Media 21 Strategy 18 Politics 12 Research 11 Public Relations 9 Strategic Communications 9 Business Strategy 9 Human Rights 8 Digital Marketing William also knows about... 8 Media Relations 8 Social Networking 7 Project Management 6 Social Media 5 Strategic Planning 4 Policy Analysis 3 International... 3 Public Policy 1 Networking 1 Team Leadership 1 Public Speaking 1 Corporate Social... 1 Event Management 1 Social Media Marketing 1 Qualitative Research 1 Public Affairs 1 Corporate Communications See 2+     See less Top Skills 31 Policy 24 New Media 21 Strategy 18 Politics 12 Research 11 Public Relations 9 Strategic Communications 9 Business Strategy 9 Human Rights 8 Digital Marketing William also knows about... 8 Media Relations 8 Social Networking 7 Project Management 6 Social Media 5 Strategic Planning 4 Policy Analysis 3 International... 3 Public Policy 1 Networking 1 Team Leadership 1 Public Speaking 1 Corporate Social... 1 Event Management 1 Social Media Marketing 1 Qualitative Research 1 Public Affairs 1 Corporate Communications See 2+     See less Top Skills 31 Policy 24 New Media 21 Strategy 18 Politics 12 Research 11 Public Relations 9 Strategic Communications 9 Business Strategy 9 Human Rights 8 Digital Marketing William also knows about... 8 Media Relations 8 Social Networking 7 Project Management 6 Social Media 5 Strategic Planning 4 Policy Analysis 3 International... 3 Public Policy 1 Networking 1 Team Leadership 1 Public Speaking 1 Corporate Social... 1 Event Management 1 Social Media Marketing 1 Qualitative Research 1 Public Affairs 1 Corporate Communications See 2+     See less                     8 Media Relations 8 Social Networking 7 Project Management 6 Social Media 5 Strategic Planning 4 Policy Analysis 3 International... 3 Public Policy 1 Networking 1 Team Leadership 1 Public Speaking 1 Corporate Social... 1 Event Management 1 Social Media Marketing 1 Qualitative Research 1 Public Affairs 1 Corporate Communications Education The University of Hong Kong Master of Laws (LLM),  Human Rights Law 2011  – 2013 Dublin City University MIR,  Masters in International Relations 2008  – 2010 Trinity College Dublin First Class Honours,  Business and Political Science 2004  – 2008 Uppsala University Business & Political Science 2006  – 2007 Erasmus Clongowes Wood College N/A,  Secondary education 1998  – 2004 The University of Hong Kong Master of Laws (LLM),  Human Rights Law 2011  – 2013 The University of Hong Kong Master of Laws (LLM),  Human Rights Law 2011  – 2013 The University of Hong Kong Master of Laws (LLM),  Human Rights Law 2011  – 2013 Dublin City University MIR,  Masters in International Relations 2008  – 2010 Dublin City University MIR,  Masters in International Relations 2008  – 2010 Dublin City University MIR,  Masters in International Relations 2008  – 2010 Trinity College Dublin First Class Honours,  Business and Political Science 2004  – 2008 Trinity College Dublin First Class Honours,  Business and Political Science 2004  – 2008 Trinity College Dublin First Class Honours,  Business and Political Science 2004  – 2008 Uppsala University Business & Political Science 2006  – 2007 Erasmus Uppsala University Business & Political Science 2006  – 2007 Erasmus Uppsala University Business & Political Science 2006  – 2007 Erasmus Clongowes Wood College N/A,  Secondary education 1998  – 2004 Clongowes Wood College N/A,  Secondary education 1998  – 2004 Clongowes Wood College N/A,  Secondary education 1998  – 2004 ", "Experience Communications Manager, Benefits Google Inc. December 2013  – Present (1 year 8 months) Mountain View, CA Communications specialist & project manager for US & APAC Benefits and Wellness programs. Manager, Community Initatives Google January 2013  –  December 2013  (1 year) Mountain View, CA - Develop, drive, and optimize the community strategy for Search, Chrome, Android, Maps & Gmail  \n \n- Manage performance of community manager team \n \n- Lead team to deliver effective customer support in communities Consumer Operations Manager, Web Search Google October 2011  –  January 2013  (1 year 4 months) Mountain View, CA Product Support Lead - Android & Mobile Google October 2008  –  October 2011  (3 years 1 month) Mountain View, CA - Lead pre-and post launch user support for mobile offerings, including help content, user communities, and product improvement based on user data and team workflow efficiency.  \n \n- Supported Google+, Buzz, and YouTube Android, iOS, web apps & xHTML apps \n \n- Delivered on-site training, mentoring and supervision to 100+ Kirkland call-center agents for Nexus One launch. Formalized quality review process & coordinated facilities revamp of office. Repeated the process in the UK.  \n \n- Supported initial Android Market launch in Q4 2008, including app and comment reviews. Created escalation path for trademark or policy issues.  \n \n- Wrote/reviewed blog posts for Google Mobile, YouTube, Official Google, & Google Apps blogs. Ran multiple in-person events to drive awareness of 'Google Mobile' brand. Consumer Experience Specialist - Social (orkut, Lively) Google September 2006  –  October 2008  (2 years 2 months) Mountain View, CA LIVELY \n- Launched Lively in July 08, w/full help center and user help community, abuse tool integration, and contextual help within product. \n- Ran 3-month pre-launch trusted tester program at Arizona State University \n- Created user policy and wrote initial Google blog post.  \n- Represented product to internal teams, interested parties (personal demo for Newt Gingrich), and pitched to potential external partners.  \n- Oversaw sunset of product in Dec 2008 – rampdown proposal & messaging to users and partners.  \n \nORKUT \nContent Management & Online Help: Piloted Known Issues page which sliced incoming email on known bugs. Maintained 300+ article Help Center, created abuse troubleshooter.  \n \nX-Functional Agent: Compiled user issues and requests for eng, mktg, UI, and legal teams. Standardized/revised all messaging sent from the product.  \n \nCommunity management: Created and managed orkut's English help forum, which quickly grew to over 1M users. Drove recognition for superusers (including at-Google events in India and Brazil). \n \nTrainer/Mentor: Trained new Hyderabad ops team (via off-hours VC and in-person training in India). Created best practices guide for working on a global team, travel guide for visiting distributed offices, and defined biweekly process for sharing team updates across US, India, and Brazil. Editorial Assistant, Assistant Editor, Associate Editor UP Media Group June 2002  –  August 2006  (4 years 3 months) Greater Atlanta Area - Developed & edited pages for Circuits Assembly, a small business-to-business magazine.  \n- Wrote monthly online or in print editorials, cultivated/posted industry news for weekly online newsletter \n- Honed copyediting skills and editorial strategy for readers/advertisers.  \n- Interfaced with authors, manufacturers, agencies & suppliers to develop publicity-ready materials. \n- Served as liaison at press conferences and facility tours in the U.S. and internationally (coordinating trade show logistics, interviewing clients and recruiting authors & advertisers).  \n- Ran yearly customer support awards program (developed schedule and budget, identify/recruit participants, monitor hundreds of customer satisfaction entries, coordinated onsite event). \n \nAmerican Society of Business Publication Editors - Young Leaders Scholarship Winner (2004) \nAmerican Society of Business Publication Editors - ATL Secretary of the Board Communications Manager, Benefits Google Inc. December 2013  – Present (1 year 8 months) Mountain View, CA Communications specialist & project manager for US & APAC Benefits and Wellness programs. Communications Manager, Benefits Google Inc. December 2013  – Present (1 year 8 months) Mountain View, CA Communications specialist & project manager for US & APAC Benefits and Wellness programs. Manager, Community Initatives Google January 2013  –  December 2013  (1 year) Mountain View, CA - Develop, drive, and optimize the community strategy for Search, Chrome, Android, Maps & Gmail  \n \n- Manage performance of community manager team \n \n- Lead team to deliver effective customer support in communities Manager, Community Initatives Google January 2013  –  December 2013  (1 year) Mountain View, CA - Develop, drive, and optimize the community strategy for Search, Chrome, Android, Maps & Gmail  \n \n- Manage performance of community manager team \n \n- Lead team to deliver effective customer support in communities Consumer Operations Manager, Web Search Google October 2011  –  January 2013  (1 year 4 months) Mountain View, CA Consumer Operations Manager, Web Search Google October 2011  –  January 2013  (1 year 4 months) Mountain View, CA Product Support Lead - Android & Mobile Google October 2008  –  October 2011  (3 years 1 month) Mountain View, CA - Lead pre-and post launch user support for mobile offerings, including help content, user communities, and product improvement based on user data and team workflow efficiency.  \n \n- Supported Google+, Buzz, and YouTube Android, iOS, web apps & xHTML apps \n \n- Delivered on-site training, mentoring and supervision to 100+ Kirkland call-center agents for Nexus One launch. Formalized quality review process & coordinated facilities revamp of office. Repeated the process in the UK.  \n \n- Supported initial Android Market launch in Q4 2008, including app and comment reviews. Created escalation path for trademark or policy issues.  \n \n- Wrote/reviewed blog posts for Google Mobile, YouTube, Official Google, & Google Apps blogs. Ran multiple in-person events to drive awareness of 'Google Mobile' brand. Product Support Lead - Android & Mobile Google October 2008  –  October 2011  (3 years 1 month) Mountain View, CA - Lead pre-and post launch user support for mobile offerings, including help content, user communities, and product improvement based on user data and team workflow efficiency.  \n \n- Supported Google+, Buzz, and YouTube Android, iOS, web apps & xHTML apps \n \n- Delivered on-site training, mentoring and supervision to 100+ Kirkland call-center agents for Nexus One launch. Formalized quality review process & coordinated facilities revamp of office. Repeated the process in the UK.  \n \n- Supported initial Android Market launch in Q4 2008, including app and comment reviews. Created escalation path for trademark or policy issues.  \n \n- Wrote/reviewed blog posts for Google Mobile, YouTube, Official Google, & Google Apps blogs. Ran multiple in-person events to drive awareness of 'Google Mobile' brand. Consumer Experience Specialist - Social (orkut, Lively) Google September 2006  –  October 2008  (2 years 2 months) Mountain View, CA LIVELY \n- Launched Lively in July 08, w/full help center and user help community, abuse tool integration, and contextual help within product. \n- Ran 3-month pre-launch trusted tester program at Arizona State University \n- Created user policy and wrote initial Google blog post.  \n- Represented product to internal teams, interested parties (personal demo for Newt Gingrich), and pitched to potential external partners.  \n- Oversaw sunset of product in Dec 2008 – rampdown proposal & messaging to users and partners.  \n \nORKUT \nContent Management & Online Help: Piloted Known Issues page which sliced incoming email on known bugs. Maintained 300+ article Help Center, created abuse troubleshooter.  \n \nX-Functional Agent: Compiled user issues and requests for eng, mktg, UI, and legal teams. Standardized/revised all messaging sent from the product.  \n \nCommunity management: Created and managed orkut's English help forum, which quickly grew to over 1M users. Drove recognition for superusers (including at-Google events in India and Brazil). \n \nTrainer/Mentor: Trained new Hyderabad ops team (via off-hours VC and in-person training in India). Created best practices guide for working on a global team, travel guide for visiting distributed offices, and defined biweekly process for sharing team updates across US, India, and Brazil. Consumer Experience Specialist - Social (orkut, Lively) Google September 2006  –  October 2008  (2 years 2 months) Mountain View, CA LIVELY \n- Launched Lively in July 08, w/full help center and user help community, abuse tool integration, and contextual help within product. \n- Ran 3-month pre-launch trusted tester program at Arizona State University \n- Created user policy and wrote initial Google blog post.  \n- Represented product to internal teams, interested parties (personal demo for Newt Gingrich), and pitched to potential external partners.  \n- Oversaw sunset of product in Dec 2008 – rampdown proposal & messaging to users and partners.  \n \nORKUT \nContent Management & Online Help: Piloted Known Issues page which sliced incoming email on known bugs. Maintained 300+ article Help Center, created abuse troubleshooter.  \n \nX-Functional Agent: Compiled user issues and requests for eng, mktg, UI, and legal teams. Standardized/revised all messaging sent from the product.  \n \nCommunity management: Created and managed orkut's English help forum, which quickly grew to over 1M users. Drove recognition for superusers (including at-Google events in India and Brazil). \n \nTrainer/Mentor: Trained new Hyderabad ops team (via off-hours VC and in-person training in India). Created best practices guide for working on a global team, travel guide for visiting distributed offices, and defined biweekly process for sharing team updates across US, India, and Brazil. Editorial Assistant, Assistant Editor, Associate Editor UP Media Group June 2002  –  August 2006  (4 years 3 months) Greater Atlanta Area - Developed & edited pages for Circuits Assembly, a small business-to-business magazine.  \n- Wrote monthly online or in print editorials, cultivated/posted industry news for weekly online newsletter \n- Honed copyediting skills and editorial strategy for readers/advertisers.  \n- Interfaced with authors, manufacturers, agencies & suppliers to develop publicity-ready materials. \n- Served as liaison at press conferences and facility tours in the U.S. and internationally (coordinating trade show logistics, interviewing clients and recruiting authors & advertisers).  \n- Ran yearly customer support awards program (developed schedule and budget, identify/recruit participants, monitor hundreds of customer satisfaction entries, coordinated onsite event). \n \nAmerican Society of Business Publication Editors - Young Leaders Scholarship Winner (2004) \nAmerican Society of Business Publication Editors - ATL Secretary of the Board Editorial Assistant, Assistant Editor, Associate Editor UP Media Group June 2002  –  August 2006  (4 years 3 months) Greater Atlanta Area - Developed & edited pages for Circuits Assembly, a small business-to-business magazine.  \n- Wrote monthly online or in print editorials, cultivated/posted industry news for weekly online newsletter \n- Honed copyediting skills and editorial strategy for readers/advertisers.  \n- Interfaced with authors, manufacturers, agencies & suppliers to develop publicity-ready materials. \n- Served as liaison at press conferences and facility tours in the U.S. and internationally (coordinating trade show logistics, interviewing clients and recruiting authors & advertisers).  \n- Ran yearly customer support awards program (developed schedule and budget, identify/recruit participants, monitor hundreds of customer satisfaction entries, coordinated onsite event). \n \nAmerican Society of Business Publication Editors - Young Leaders Scholarship Winner (2004) \nAmerican Society of Business Publication Editors - ATL Secretary of the Board Languages English Native or bilingual proficiency French Elementary proficiency Portuguese Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Portuguese Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Portuguese Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Skills  Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords                     4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Education Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section University of Sussex Year abroad,  British Literature & History 1999  – 2000 Episcopal School of Acadiana 1992  – 1998 Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section University of Sussex Year abroad,  British Literature & History 1999  – 2000 University of Sussex Year abroad,  British Literature & History 1999  – 2000 University of Sussex Year abroad,  British Literature & History 1999  – 2000 Episcopal School of Acadiana 1992  – 1998 Episcopal School of Acadiana 1992  – 1998 Episcopal School of Acadiana 1992  – 1998 ", "Experience Communications Manager, Benefits Google Inc. December 2013  – Present (1 year 8 months) Mountain View, CA Communications specialist & project manager for US & APAC Benefits and Wellness programs. Manager, Community Initatives Google January 2013  –  December 2013  (1 year) Mountain View, CA - Develop, drive, and optimize the community strategy for Search, Chrome, Android, Maps & Gmail  \n \n- Manage performance of community manager team \n \n- Lead team to deliver effective customer support in communities Consumer Operations Manager, Web Search Google October 2011  –  January 2013  (1 year 4 months) Mountain View, CA Product Support Lead - Android & Mobile Google October 2008  –  October 2011  (3 years 1 month) Mountain View, CA - Lead pre-and post launch user support for mobile offerings, including help content, user communities, and product improvement based on user data and team workflow efficiency.  \n \n- Supported Google+, Buzz, and YouTube Android, iOS, web apps & xHTML apps \n \n- Delivered on-site training, mentoring and supervision to 100+ Kirkland call-center agents for Nexus One launch. Formalized quality review process & coordinated facilities revamp of office. Repeated the process in the UK.  \n \n- Supported initial Android Market launch in Q4 2008, including app and comment reviews. Created escalation path for trademark or policy issues.  \n \n- Wrote/reviewed blog posts for Google Mobile, YouTube, Official Google, & Google Apps blogs. Ran multiple in-person events to drive awareness of 'Google Mobile' brand. Consumer Experience Specialist - Social (orkut, Lively) Google September 2006  –  October 2008  (2 years 2 months) Mountain View, CA LIVELY \n- Launched Lively in July 08, w/full help center and user help community, abuse tool integration, and contextual help within product. \n- Ran 3-month pre-launch trusted tester program at Arizona State University \n- Created user policy and wrote initial Google blog post.  \n- Represented product to internal teams, interested parties (personal demo for Newt Gingrich), and pitched to potential external partners.  \n- Oversaw sunset of product in Dec 2008 – rampdown proposal & messaging to users and partners.  \n \nORKUT \nContent Management & Online Help: Piloted Known Issues page which sliced incoming email on known bugs. Maintained 300+ article Help Center, created abuse troubleshooter.  \n \nX-Functional Agent: Compiled user issues and requests for eng, mktg, UI, and legal teams. Standardized/revised all messaging sent from the product.  \n \nCommunity management: Created and managed orkut's English help forum, which quickly grew to over 1M users. Drove recognition for superusers (including at-Google events in India and Brazil). \n \nTrainer/Mentor: Trained new Hyderabad ops team (via off-hours VC and in-person training in India). Created best practices guide for working on a global team, travel guide for visiting distributed offices, and defined biweekly process for sharing team updates across US, India, and Brazil. Editorial Assistant, Assistant Editor, Associate Editor UP Media Group June 2002  –  August 2006  (4 years 3 months) Greater Atlanta Area - Developed & edited pages for Circuits Assembly, a small business-to-business magazine.  \n- Wrote monthly online or in print editorials, cultivated/posted industry news for weekly online newsletter \n- Honed copyediting skills and editorial strategy for readers/advertisers.  \n- Interfaced with authors, manufacturers, agencies & suppliers to develop publicity-ready materials. \n- Served as liaison at press conferences and facility tours in the U.S. and internationally (coordinating trade show logistics, interviewing clients and recruiting authors & advertisers).  \n- Ran yearly customer support awards program (developed schedule and budget, identify/recruit participants, monitor hundreds of customer satisfaction entries, coordinated onsite event). \n \nAmerican Society of Business Publication Editors - Young Leaders Scholarship Winner (2004) \nAmerican Society of Business Publication Editors - ATL Secretary of the Board Communications Manager, Benefits Google Inc. December 2013  – Present (1 year 8 months) Mountain View, CA Communications specialist & project manager for US & APAC Benefits and Wellness programs. Communications Manager, Benefits Google Inc. December 2013  – Present (1 year 8 months) Mountain View, CA Communications specialist & project manager for US & APAC Benefits and Wellness programs. Manager, Community Initatives Google January 2013  –  December 2013  (1 year) Mountain View, CA - Develop, drive, and optimize the community strategy for Search, Chrome, Android, Maps & Gmail  \n \n- Manage performance of community manager team \n \n- Lead team to deliver effective customer support in communities Manager, Community Initatives Google January 2013  –  December 2013  (1 year) Mountain View, CA - Develop, drive, and optimize the community strategy for Search, Chrome, Android, Maps & Gmail  \n \n- Manage performance of community manager team \n \n- Lead team to deliver effective customer support in communities Consumer Operations Manager, Web Search Google October 2011  –  January 2013  (1 year 4 months) Mountain View, CA Consumer Operations Manager, Web Search Google October 2011  –  January 2013  (1 year 4 months) Mountain View, CA Product Support Lead - Android & Mobile Google October 2008  –  October 2011  (3 years 1 month) Mountain View, CA - Lead pre-and post launch user support for mobile offerings, including help content, user communities, and product improvement based on user data and team workflow efficiency.  \n \n- Supported Google+, Buzz, and YouTube Android, iOS, web apps & xHTML apps \n \n- Delivered on-site training, mentoring and supervision to 100+ Kirkland call-center agents for Nexus One launch. Formalized quality review process & coordinated facilities revamp of office. Repeated the process in the UK.  \n \n- Supported initial Android Market launch in Q4 2008, including app and comment reviews. Created escalation path for trademark or policy issues.  \n \n- Wrote/reviewed blog posts for Google Mobile, YouTube, Official Google, & Google Apps blogs. Ran multiple in-person events to drive awareness of 'Google Mobile' brand. Product Support Lead - Android & Mobile Google October 2008  –  October 2011  (3 years 1 month) Mountain View, CA - Lead pre-and post launch user support for mobile offerings, including help content, user communities, and product improvement based on user data and team workflow efficiency.  \n \n- Supported Google+, Buzz, and YouTube Android, iOS, web apps & xHTML apps \n \n- Delivered on-site training, mentoring and supervision to 100+ Kirkland call-center agents for Nexus One launch. Formalized quality review process & coordinated facilities revamp of office. Repeated the process in the UK.  \n \n- Supported initial Android Market launch in Q4 2008, including app and comment reviews. Created escalation path for trademark or policy issues.  \n \n- Wrote/reviewed blog posts for Google Mobile, YouTube, Official Google, & Google Apps blogs. Ran multiple in-person events to drive awareness of 'Google Mobile' brand. Consumer Experience Specialist - Social (orkut, Lively) Google September 2006  –  October 2008  (2 years 2 months) Mountain View, CA LIVELY \n- Launched Lively in July 08, w/full help center and user help community, abuse tool integration, and contextual help within product. \n- Ran 3-month pre-launch trusted tester program at Arizona State University \n- Created user policy and wrote initial Google blog post.  \n- Represented product to internal teams, interested parties (personal demo for Newt Gingrich), and pitched to potential external partners.  \n- Oversaw sunset of product in Dec 2008 – rampdown proposal & messaging to users and partners.  \n \nORKUT \nContent Management & Online Help: Piloted Known Issues page which sliced incoming email on known bugs. Maintained 300+ article Help Center, created abuse troubleshooter.  \n \nX-Functional Agent: Compiled user issues and requests for eng, mktg, UI, and legal teams. Standardized/revised all messaging sent from the product.  \n \nCommunity management: Created and managed orkut's English help forum, which quickly grew to over 1M users. Drove recognition for superusers (including at-Google events in India and Brazil). \n \nTrainer/Mentor: Trained new Hyderabad ops team (via off-hours VC and in-person training in India). Created best practices guide for working on a global team, travel guide for visiting distributed offices, and defined biweekly process for sharing team updates across US, India, and Brazil. Consumer Experience Specialist - Social (orkut, Lively) Google September 2006  –  October 2008  (2 years 2 months) Mountain View, CA LIVELY \n- Launched Lively in July 08, w/full help center and user help community, abuse tool integration, and contextual help within product. \n- Ran 3-month pre-launch trusted tester program at Arizona State University \n- Created user policy and wrote initial Google blog post.  \n- Represented product to internal teams, interested parties (personal demo for Newt Gingrich), and pitched to potential external partners.  \n- Oversaw sunset of product in Dec 2008 – rampdown proposal & messaging to users and partners.  \n \nORKUT \nContent Management & Online Help: Piloted Known Issues page which sliced incoming email on known bugs. Maintained 300+ article Help Center, created abuse troubleshooter.  \n \nX-Functional Agent: Compiled user issues and requests for eng, mktg, UI, and legal teams. Standardized/revised all messaging sent from the product.  \n \nCommunity management: Created and managed orkut's English help forum, which quickly grew to over 1M users. Drove recognition for superusers (including at-Google events in India and Brazil). \n \nTrainer/Mentor: Trained new Hyderabad ops team (via off-hours VC and in-person training in India). Created best practices guide for working on a global team, travel guide for visiting distributed offices, and defined biweekly process for sharing team updates across US, India, and Brazil. Editorial Assistant, Assistant Editor, Associate Editor UP Media Group June 2002  –  August 2006  (4 years 3 months) Greater Atlanta Area - Developed & edited pages for Circuits Assembly, a small business-to-business magazine.  \n- Wrote monthly online or in print editorials, cultivated/posted industry news for weekly online newsletter \n- Honed copyediting skills and editorial strategy for readers/advertisers.  \n- Interfaced with authors, manufacturers, agencies & suppliers to develop publicity-ready materials. \n- Served as liaison at press conferences and facility tours in the U.S. and internationally (coordinating trade show logistics, interviewing clients and recruiting authors & advertisers).  \n- Ran yearly customer support awards program (developed schedule and budget, identify/recruit participants, monitor hundreds of customer satisfaction entries, coordinated onsite event). \n \nAmerican Society of Business Publication Editors - Young Leaders Scholarship Winner (2004) \nAmerican Society of Business Publication Editors - ATL Secretary of the Board Editorial Assistant, Assistant Editor, Associate Editor UP Media Group June 2002  –  August 2006  (4 years 3 months) Greater Atlanta Area - Developed & edited pages for Circuits Assembly, a small business-to-business magazine.  \n- Wrote monthly online or in print editorials, cultivated/posted industry news for weekly online newsletter \n- Honed copyediting skills and editorial strategy for readers/advertisers.  \n- Interfaced with authors, manufacturers, agencies & suppliers to develop publicity-ready materials. \n- Served as liaison at press conferences and facility tours in the U.S. and internationally (coordinating trade show logistics, interviewing clients and recruiting authors & advertisers).  \n- Ran yearly customer support awards program (developed schedule and budget, identify/recruit participants, monitor hundreds of customer satisfaction entries, coordinated onsite event). \n \nAmerican Society of Business Publication Editors - Young Leaders Scholarship Winner (2004) \nAmerican Society of Business Publication Editors - ATL Secretary of the Board Languages English Native or bilingual proficiency French Elementary proficiency Portuguese Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Portuguese Elementary proficiency English Native or bilingual proficiency French Elementary proficiency Portuguese Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Skills  Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Top Skills 23 Blogging 20 Social Media 18 Content Management 11 Google Analytics 10 Editing 10 Mobile Devices 6 Online Advertising 5 Web Analytics 5 Management 5 Community Management Robin also knows about... 4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords                     4 Copy Editing 3 Content Strategy 3 Digital Marketing 3 Digital Media 3 Customer Support 3 Training 3 WordPress 3 Newsletters 2 Cross-functional... 2 Event Management 2 Advertising 2 SEM 1 Google Adwords Education Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section University of Sussex Year abroad,  British Literature & History 1999  – 2000 Episcopal School of Acadiana 1992  – 1998 Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section Emory University Bachelor of Arts (B.A.),  Joint major in English Literature & History ,  minor in French , Summa Cum Laude 1998  – 2002 Activities and Societies:  Journalist for The Emory Wheel ,  Arts & Living section University of Sussex Year abroad,  British Literature & History 1999  – 2000 University of Sussex Year abroad,  British Literature & History 1999  – 2000 University of Sussex Year abroad,  British Literature & History 1999  – 2000 Episcopal School of Acadiana 1992  – 1998 Episcopal School of Acadiana 1992  – 1998 Episcopal School of Acadiana 1992  – 1998 ", "Experience Sales Training & Communications Manager Google Fiber May 2014  – Present (1 year 3 months) Mountain View, CA Product Launch Lead - Global Mobile Google October 2012  – Present (2 years 10 months) San Francisco Bay Area Associate Vendor Manager, Google Offers Google November 2011  –  October 2012  (1 year) Rich Media Campaign Manager at Doubleclick/Google Google October 2010  –  November 2011  (1 year 2 months) Inside Sales Representative Google 2007  –  2010  (3 years) Sales Training & Communications Manager Google Fiber May 2014  – Present (1 year 3 months) Mountain View, CA Sales Training & Communications Manager Google Fiber May 2014  – Present (1 year 3 months) Mountain View, CA Product Launch Lead - Global Mobile Google October 2012  – Present (2 years 10 months) San Francisco Bay Area Product Launch Lead - Global Mobile Google October 2012  – Present (2 years 10 months) San Francisco Bay Area Associate Vendor Manager, Google Offers Google November 2011  –  October 2012  (1 year) Associate Vendor Manager, Google Offers Google November 2011  –  October 2012  (1 year) Rich Media Campaign Manager at Doubleclick/Google Google October 2010  –  November 2011  (1 year 2 months) Rich Media Campaign Manager at Doubleclick/Google Google October 2010  –  November 2011  (1 year 2 months) Inside Sales Representative Google 2007  –  2010  (3 years) Inside Sales Representative Google 2007  –  2010  (3 years) Skills Top Skills 16 Google Adwords 15 Digital Marketing 10 SEM 8 Online Advertising 5 PPC 5 Google Analytics 4 Salesforce.com 4 Lead Generation 3 Web Analytics 3 Analytics Kaila also knows about... 3 Social Media Marketing 3 Social Media 2 YouTube 1 Mobile Marketing 1 E-commerce 1 Digital Media 1 Digital Strategy 1 Account Management Skills  Top Skills 16 Google Adwords 15 Digital Marketing 10 SEM 8 Online Advertising 5 PPC 5 Google Analytics 4 Salesforce.com 4 Lead Generation 3 Web Analytics 3 Analytics Kaila also knows about... 3 Social Media Marketing 3 Social Media 2 YouTube 1 Mobile Marketing 1 E-commerce 1 Digital Media 1 Digital Strategy 1 Account Management Top Skills 16 Google Adwords 15 Digital Marketing 10 SEM 8 Online Advertising 5 PPC 5 Google Analytics 4 Salesforce.com 4 Lead Generation 3 Web Analytics 3 Analytics Kaila also knows about... 3 Social Media Marketing 3 Social Media 2 YouTube 1 Mobile Marketing 1 E-commerce 1 Digital Media 1 Digital Strategy 1 Account Management Top Skills 16 Google Adwords 15 Digital Marketing 10 SEM 8 Online Advertising 5 PPC 5 Google Analytics 4 Salesforce.com 4 Lead Generation 3 Web Analytics 3 Analytics Kaila also knows about... 3 Social Media Marketing 3 Social Media 2 YouTube 1 Mobile Marketing 1 E-commerce 1 Digital Media 1 Digital Strategy 1 Account Management                     3 Social Media Marketing 3 Social Media 2 YouTube 1 Mobile Marketing 1 E-commerce 1 Digital Media 1 Digital Strategy 1 Account Management Education University of Notre Dame BA,  English ,  Spanish 2003  – 2007 University of Notre Dame BA,  English ,  Spanish 2003  – 2007 University of Notre Dame BA,  English ,  Spanish 2003  – 2007 University of Notre Dame BA,  English ,  Spanish 2003  – 2007 ", "Summary Gabby is currently the chief of staff for Google’s Diversity, Integrity and Governance group. She spent the past 4 years managing Google’s employment brand, where she used an authentic Google voice in the name of finding, growing and keeping top talent. Prior to joining Google, Gabby put on a suit and heels while studying for her M.B.A at NYU Stern’s School of Business. She’s a Blue (for those of you who’ve taken True Colors), a connector (according to Malcolm Gladwell) and thinks everything looks better in a matrix. Summary Gabby is currently the chief of staff for Google’s Diversity, Integrity and Governance group. She spent the past 4 years managing Google’s employment brand, where she used an authentic Google voice in the name of finding, growing and keeping top talent. Prior to joining Google, Gabby put on a suit and heels while studying for her M.B.A at NYU Stern’s School of Business. She’s a Blue (for those of you who’ve taken True Colors), a connector (according to Malcolm Gladwell) and thinks everything looks better in a matrix. Gabby is currently the chief of staff for Google’s Diversity, Integrity and Governance group. She spent the past 4 years managing Google’s employment brand, where she used an authentic Google voice in the name of finding, growing and keeping top talent. Prior to joining Google, Gabby put on a suit and heels while studying for her M.B.A at NYU Stern’s School of Business. She’s a Blue (for those of you who’ve taken True Colors), a connector (according to Malcolm Gladwell) and thinks everything looks better in a matrix. Gabby is currently the chief of staff for Google’s Diversity, Integrity and Governance group. She spent the past 4 years managing Google’s employment brand, where she used an authentic Google voice in the name of finding, growing and keeping top talent. Prior to joining Google, Gabby put on a suit and heels while studying for her M.B.A at NYU Stern’s School of Business. She’s a Blue (for those of you who’ve taken True Colors), a connector (according to Malcolm Gladwell) and thinks everything looks better in a matrix. Experience Chief of Staff, Diversity Integrity and Governance Google April 2013  – Present (2 years 4 months) Employment Branding & Communications Manager Google January 2011  –  March 2013  (2 years 3 months) Mountain View, CA •\tLaunched global jobs site with new design, navigation and content that improved user engagement as measured by 75% increase in time-on-site  \n•\tDesigned vision for and managed Great Place to Work application, resulting in unprecedented #1 ranking for the past two years, making Google the only company to top the list 4 times  \n•\tTransformed candidate experience by developing an app-based offer letter for recent graduates, resulting in improved brand impression and decreased time-to-accept \n•\tCreated branding strategy for candidate communications, which included overhauling all job descriptions and training all recruiters to better reflect Google’s voice and values Communications Manager Google July 2009  –  December 2010  (1 year 6 months) Mountain View, CA •\tDesigned and implemented a tiered communications strategy for annual employee engagement survey that drove more than 20,000 Googlers to take the survey (participation rate of 88%) \n•\tProvided Googlers with increased transparency into Google’s hiring process through executive communications that increased referrals by 15% and reduced interview feedback latency by 30% \n•\tPartnered with senior HR executives to roll out HR priorities to 1,000 person HR organization at annual People Operations conference, quarterly All Hands and through ongoing communications Marketing Intern Google May 2008  –  August 2008  (4 months) Mountain View, CA •\tConducted quantitative and qualitative data analysis to identify company-wide trends around hiring and sourcing programs, with special emphasis on the employee referral program Program Associate Charles and Lynn Schusterman Family Foundation September 2003  –  June 2007  (3 years 10 months) •\tReviewed grant proposals, evaluated program impact and prepared funding recommendations for President and Executive Director of premiere Jewish philanthropic Foundation  \n•\tCultivated grantee relationships by providing professional and lay leadership with guidance in strategic planning, fundraising, capacity building and best practices in field of Jewish education \n•\tInitiated and executed annual training programs in time management, meeting facilitation and public speaking to 75 rising professionals in the field of Jewish communal service Leadership Development Intern AIPAC June 2002  –  August 2002  (3 months) Chief of Staff, Diversity Integrity and Governance Google April 2013  – Present (2 years 4 months) Chief of Staff, Diversity Integrity and Governance Google April 2013  – Present (2 years 4 months) Employment Branding & Communications Manager Google January 2011  –  March 2013  (2 years 3 months) Mountain View, CA •\tLaunched global jobs site with new design, navigation and content that improved user engagement as measured by 75% increase in time-on-site  \n•\tDesigned vision for and managed Great Place to Work application, resulting in unprecedented #1 ranking for the past two years, making Google the only company to top the list 4 times  \n•\tTransformed candidate experience by developing an app-based offer letter for recent graduates, resulting in improved brand impression and decreased time-to-accept \n•\tCreated branding strategy for candidate communications, which included overhauling all job descriptions and training all recruiters to better reflect Google’s voice and values Employment Branding & Communications Manager Google January 2011  –  March 2013  (2 years 3 months) Mountain View, CA •\tLaunched global jobs site with new design, navigation and content that improved user engagement as measured by 75% increase in time-on-site  \n•\tDesigned vision for and managed Great Place to Work application, resulting in unprecedented #1 ranking for the past two years, making Google the only company to top the list 4 times  \n•\tTransformed candidate experience by developing an app-based offer letter for recent graduates, resulting in improved brand impression and decreased time-to-accept \n•\tCreated branding strategy for candidate communications, which included overhauling all job descriptions and training all recruiters to better reflect Google’s voice and values Communications Manager Google July 2009  –  December 2010  (1 year 6 months) Mountain View, CA •\tDesigned and implemented a tiered communications strategy for annual employee engagement survey that drove more than 20,000 Googlers to take the survey (participation rate of 88%) \n•\tProvided Googlers with increased transparency into Google’s hiring process through executive communications that increased referrals by 15% and reduced interview feedback latency by 30% \n•\tPartnered with senior HR executives to roll out HR priorities to 1,000 person HR organization at annual People Operations conference, quarterly All Hands and through ongoing communications Communications Manager Google July 2009  –  December 2010  (1 year 6 months) Mountain View, CA •\tDesigned and implemented a tiered communications strategy for annual employee engagement survey that drove more than 20,000 Googlers to take the survey (participation rate of 88%) \n•\tProvided Googlers with increased transparency into Google’s hiring process through executive communications that increased referrals by 15% and reduced interview feedback latency by 30% \n•\tPartnered with senior HR executives to roll out HR priorities to 1,000 person HR organization at annual People Operations conference, quarterly All Hands and through ongoing communications Marketing Intern Google May 2008  –  August 2008  (4 months) Mountain View, CA •\tConducted quantitative and qualitative data analysis to identify company-wide trends around hiring and sourcing programs, with special emphasis on the employee referral program Marketing Intern Google May 2008  –  August 2008  (4 months) Mountain View, CA •\tConducted quantitative and qualitative data analysis to identify company-wide trends around hiring and sourcing programs, with special emphasis on the employee referral program Program Associate Charles and Lynn Schusterman Family Foundation September 2003  –  June 2007  (3 years 10 months) •\tReviewed grant proposals, evaluated program impact and prepared funding recommendations for President and Executive Director of premiere Jewish philanthropic Foundation  \n•\tCultivated grantee relationships by providing professional and lay leadership with guidance in strategic planning, fundraising, capacity building and best practices in field of Jewish education \n•\tInitiated and executed annual training programs in time management, meeting facilitation and public speaking to 75 rising professionals in the field of Jewish communal service Program Associate Charles and Lynn Schusterman Family Foundation September 2003  –  June 2007  (3 years 10 months) •\tReviewed grant proposals, evaluated program impact and prepared funding recommendations for President and Executive Director of premiere Jewish philanthropic Foundation  \n•\tCultivated grantee relationships by providing professional and lay leadership with guidance in strategic planning, fundraising, capacity building and best practices in field of Jewish education \n•\tInitiated and executed annual training programs in time management, meeting facilitation and public speaking to 75 rising professionals in the field of Jewish communal service Leadership Development Intern AIPAC June 2002  –  August 2002  (3 months) Leadership Development Intern AIPAC June 2002  –  August 2002  (3 months) Skills Top Skills 16 Strategic Communications 5 Philanthropy 4 Fundraising 3 Grant Writing 3 Strategy 2 Public Speaking 1 Social Media 0 Non-profits 0 Social Entrepreneurship 0 Event Planning Gabrielle also knows about... 0 Digital Strategy 0 Research 0 Digital Marketing 0 Editing 0 Volunteer Management 0 Digital Media 0 Grants 0 New Media 0 Community Outreach 0 Market Research Skills  Top Skills 16 Strategic Communications 5 Philanthropy 4 Fundraising 3 Grant Writing 3 Strategy 2 Public Speaking 1 Social Media 0 Non-profits 0 Social Entrepreneurship 0 Event Planning Gabrielle also knows about... 0 Digital Strategy 0 Research 0 Digital Marketing 0 Editing 0 Volunteer Management 0 Digital Media 0 Grants 0 New Media 0 Community Outreach 0 Market Research Top Skills 16 Strategic Communications 5 Philanthropy 4 Fundraising 3 Grant Writing 3 Strategy 2 Public Speaking 1 Social Media 0 Non-profits 0 Social Entrepreneurship 0 Event Planning Gabrielle also knows about... 0 Digital Strategy 0 Research 0 Digital Marketing 0 Editing 0 Volunteer Management 0 Digital Media 0 Grants 0 New Media 0 Community Outreach 0 Market Research Top Skills 16 Strategic Communications 5 Philanthropy 4 Fundraising 3 Grant Writing 3 Strategy 2 Public Speaking 1 Social Media 0 Non-profits 0 Social Entrepreneurship 0 Event Planning Gabrielle also knows about... 0 Digital Strategy 0 Research 0 Digital Marketing 0 Editing 0 Volunteer Management 0 Digital Media 0 Grants 0 New Media 0 Community Outreach 0 Market Research                     0 Digital Strategy 0 Research 0 Digital Marketing 0 Editing 0 Volunteer Management 0 Digital Media 0 Grants 0 New Media 0 Community Outreach 0 Market Research Education New York University - Leonard N. Stern School of Business Master of Business Administration (MBA),  Strategy & Marketing 2007  – 2009 University of Pennsylvania BA,  History 1999  – 2003 New York University - Leonard N. Stern School of Business Master of Business Administration (MBA),  Strategy & Marketing 2007  – 2009 New York University - Leonard N. Stern School of Business Master of Business Administration (MBA),  Strategy & Marketing 2007  – 2009 New York University - Leonard N. Stern School of Business Master of Business Administration (MBA),  Strategy & Marketing 2007  – 2009 University of Pennsylvania BA,  History 1999  – 2003 University of Pennsylvania BA,  History 1999  – 2003 University of Pennsylvania BA,  History 1999  – 2003 "]}