{"position": "Corporate Counsel", "company": "Google", "profiles": ["Experience Associate Corporate Counsel Google October 2014  – Present (11 months) Mountain View, CA Corporate Counsel Lab126, an Amazon.com company February 2013  –  September 2014  (1 year 8 months) Cupertino, CA Associate Davis Polk & Wardwell October 2008  –  January 2013  (4 years 4 months) Menlo Park, CA Associate Corporate Counsel Google October 2014  – Present (11 months) Mountain View, CA Associate Corporate Counsel Google October 2014  – Present (11 months) Mountain View, CA Corporate Counsel Lab126, an Amazon.com company February 2013  –  September 2014  (1 year 8 months) Cupertino, CA Corporate Counsel Lab126, an Amazon.com company February 2013  –  September 2014  (1 year 8 months) Cupertino, CA Associate Davis Polk & Wardwell October 2008  –  January 2013  (4 years 4 months) Menlo Park, CA Associate Davis Polk & Wardwell October 2008  –  January 2013  (4 years 4 months) Menlo Park, CA Languages English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Skills     Education Indiana University Bloomington BA,  English / Chinese Stanford University Law School Doctor of Law (J.D.) Indiana University Bloomington BA,  English / Chinese Indiana University Bloomington BA,  English / Chinese Indiana University Bloomington BA,  English / Chinese Stanford University Law School Doctor of Law (J.D.) Stanford University Law School Doctor of Law (J.D.) Stanford University Law School Doctor of Law (J.D.) ", "Experience Corporate Counsel Google November 2013  – Present (1 year 10 months) Commercial deals, product counseling, policy and regulatory matters, litigations Associate Legal Counsel Google February 2011  –  October 2013  (2 years 9 months) Commercial deals, product counseling, policy and regulatory matters, litigations In-house attorney Nissan Motor Co., Ltd February 2008  –  January 2011  (3 years) Legal Sony Computer Entertainment Inc. April 2004  –  January 2008  (3 years 10 months) Corporate Counsel Google November 2013  – Present (1 year 10 months) Commercial deals, product counseling, policy and regulatory matters, litigations Corporate Counsel Google November 2013  – Present (1 year 10 months) Commercial deals, product counseling, policy and regulatory matters, litigations Associate Legal Counsel Google February 2011  –  October 2013  (2 years 9 months) Commercial deals, product counseling, policy and regulatory matters, litigations Associate Legal Counsel Google February 2011  –  October 2013  (2 years 9 months) Commercial deals, product counseling, policy and regulatory matters, litigations In-house attorney Nissan Motor Co., Ltd February 2008  –  January 2011  (3 years) In-house attorney Nissan Motor Co., Ltd February 2008  –  January 2011  (3 years) Legal Sony Computer Entertainment Inc. April 2004  –  January 2008  (3 years 10 months) Legal Sony Computer Entertainment Inc. April 2004  –  January 2008  (3 years 10 months) Languages English English English Skills Intellectual Property Licensing Corporate Law Legal Writing Commercial Litigation Legal Research Litigation Privacy Law Joint Ventures Competition Law Employment Law International Law Corporate Governance Mergers & Acquisitions Legal Advice Contract Negotiation Due Diligence See 2+     See less Skills  Intellectual Property Licensing Corporate Law Legal Writing Commercial Litigation Legal Research Litigation Privacy Law Joint Ventures Competition Law Employment Law International Law Corporate Governance Mergers & Acquisitions Legal Advice Contract Negotiation Due Diligence See 2+     See less Intellectual Property Licensing Corporate Law Legal Writing Commercial Litigation Legal Research Litigation Privacy Law Joint Ventures Competition Law Employment Law International Law Corporate Governance Mergers & Acquisitions Legal Advice Contract Negotiation Due Diligence See 2+     See less Intellectual Property Licensing Corporate Law Legal Writing Commercial Litigation Legal Research Litigation Privacy Law Joint Ventures Competition Law Employment Law International Law Corporate Governance Mergers & Acquisitions Legal Advice Contract Negotiation Due Diligence See 2+     See less Education Temple University - James E. Beasley School of Law LL.M. (Master of Laws),  Law 2006  – 2008 慶応義塾大学 LL.B. (Bachelor of Laws),  Law 1997  – 2002 Temple University - James E. Beasley School of Law LL.M. (Master of Laws),  Law 2006  – 2008 Temple University - James E. Beasley School of Law LL.M. (Master of Laws),  Law 2006  – 2008 Temple University - James E. Beasley School of Law LL.M. (Master of Laws),  Law 2006  – 2008 慶応義塾大学 LL.B. (Bachelor of Laws),  Law 1997  – 2002 慶応義塾大学 LL.B. (Bachelor of Laws),  Law 1997  – 2002 慶応義塾大学 LL.B. (Bachelor of Laws),  Law 1997  – 2002 ", "Summary Corporate Counsel - Commercial Summary Corporate Counsel - Commercial Corporate Counsel - Commercial Corporate Counsel - Commercial Experience Corporate Counsel Google October 2012  – Present (2 years 11 months) Corporate Counsel - Commercial Corporate Counsel Symantec Corporation July 2007  –  October 2012  (5 years 4 months) - Responsible for providing legal support for corporate maintenance/management of company global subsidiaries. \n \n- Provided legal support to Procurement/IT-Vendor Management Office teams for company procurement activities including negotiating inbound license and services agreements and resolving escalated legal and business issues.  \n \n- Involved with all aspects of M&A transactions including preparation of NDAs and LOIs, managing/coordinating cross-functional teams during diligence, negotiating agreements and managing post-closing matters.  \n \n- Provided legal support to Tax/Treasury teams. Associate Attorney Doherty & Catlow February 2001  –  May 2006  (5 years 4 months) insurance defense litigation Corporate Counsel Google October 2012  – Present (2 years 11 months) Corporate Counsel - Commercial Corporate Counsel Google October 2012  – Present (2 years 11 months) Corporate Counsel - Commercial Corporate Counsel Symantec Corporation July 2007  –  October 2012  (5 years 4 months) - Responsible for providing legal support for corporate maintenance/management of company global subsidiaries. \n \n- Provided legal support to Procurement/IT-Vendor Management Office teams for company procurement activities including negotiating inbound license and services agreements and resolving escalated legal and business issues.  \n \n- Involved with all aspects of M&A transactions including preparation of NDAs and LOIs, managing/coordinating cross-functional teams during diligence, negotiating agreements and managing post-closing matters.  \n \n- Provided legal support to Tax/Treasury teams. Corporate Counsel Symantec Corporation July 2007  –  October 2012  (5 years 4 months) - Responsible for providing legal support for corporate maintenance/management of company global subsidiaries. \n \n- Provided legal support to Procurement/IT-Vendor Management Office teams for company procurement activities including negotiating inbound license and services agreements and resolving escalated legal and business issues.  \n \n- Involved with all aspects of M&A transactions including preparation of NDAs and LOIs, managing/coordinating cross-functional teams during diligence, negotiating agreements and managing post-closing matters.  \n \n- Provided legal support to Tax/Treasury teams. Associate Attorney Doherty & Catlow February 2001  –  May 2006  (5 years 4 months) insurance defense litigation Associate Attorney Doherty & Catlow February 2001  –  May 2006  (5 years 4 months) insurance defense litigation Skills Corporate Law Mergers Litigation Procurement Software Licensing Licensing Mergers & Acquisitions Start-ups Strategy Contract Negotiation Privacy Law Negotiation Cross-functional Team... Intellectual Property Data Privacy Management Strategic Partnerships See 2+     See less Skills  Corporate Law Mergers Litigation Procurement Software Licensing Licensing Mergers & Acquisitions Start-ups Strategy Contract Negotiation Privacy Law Negotiation Cross-functional Team... Intellectual Property Data Privacy Management Strategic Partnerships See 2+     See less Corporate Law Mergers Litigation Procurement Software Licensing Licensing Mergers & Acquisitions Start-ups Strategy Contract Negotiation Privacy Law Negotiation Cross-functional Team... Intellectual Property Data Privacy Management Strategic Partnerships See 2+     See less Corporate Law Mergers Litigation Procurement Software Licensing Licensing Mergers & Acquisitions Start-ups Strategy Contract Negotiation Privacy Law Negotiation Cross-functional Team... Intellectual Property Data Privacy Management Strategic Partnerships See 2+     See less Education University of California, Hastings College of the Law JD,  Law 1997  – 2000 Activities and Societies:  Hastings Law Journal - Senior Notes Editor\nAssociated Students of UC Hastings (ASUCH) - Secretary\n(the elected student government of UC Hastings responsible for representing the interests of the student body) University of California, Los Angeles BA,  Psychology 1993  – 1997 Activities and Societies:  Theta Kappa Phi University of California, Hastings College of the Law JD,  Law 1997  – 2000 Activities and Societies:  Hastings Law Journal - Senior Notes Editor\nAssociated Students of UC Hastings (ASUCH) - Secretary\n(the elected student government of UC Hastings responsible for representing the interests of the student body) University of California, Hastings College of the Law JD,  Law 1997  – 2000 Activities and Societies:  Hastings Law Journal - Senior Notes Editor\nAssociated Students of UC Hastings (ASUCH) - Secretary\n(the elected student government of UC Hastings responsible for representing the interests of the student body) University of California, Hastings College of the Law JD,  Law 1997  – 2000 Activities and Societies:  Hastings Law Journal - Senior Notes Editor\nAssociated Students of UC Hastings (ASUCH) - Secretary\n(the elected student government of UC Hastings responsible for representing the interests of the student body) University of California, Los Angeles BA,  Psychology 1993  – 1997 Activities and Societies:  Theta Kappa Phi University of California, Los Angeles BA,  Psychology 1993  – 1997 Activities and Societies:  Theta Kappa Phi University of California, Los Angeles BA,  Psychology 1993  – 1997 Activities and Societies:  Theta Kappa Phi ", "Experience Senior Corporate Counsel Google Inc. December 2014  – Present (9 months) Mountain View, CA Corporate Counsel Google April 2012  –  December 2014  (2 years 9 months) Mountain View, CA Senior Corporate Counsel Symantec Corporation August 2004  –  April 2012  (7 years 9 months) Licensing Attorney specializing in Open Source, inbound technology licensing and strategic alliances. Associate Gunderson Dettmer Stough Villeneuve Franklin & Hachigian January 2003  –  August 2004  (1 year 8 months) Barbri Rep BAR/BRI Bar Review 1999  –  2002  (3 years) Senior Corporate Counsel Google Inc. December 2014  – Present (9 months) Mountain View, CA Senior Corporate Counsel Google Inc. December 2014  – Present (9 months) Mountain View, CA Corporate Counsel Google April 2012  –  December 2014  (2 years 9 months) Mountain View, CA Corporate Counsel Google April 2012  –  December 2014  (2 years 9 months) Mountain View, CA Senior Corporate Counsel Symantec Corporation August 2004  –  April 2012  (7 years 9 months) Licensing Attorney specializing in Open Source, inbound technology licensing and strategic alliances. Senior Corporate Counsel Symantec Corporation August 2004  –  April 2012  (7 years 9 months) Licensing Attorney specializing in Open Source, inbound technology licensing and strategic alliances. Associate Gunderson Dettmer Stough Villeneuve Franklin & Hachigian January 2003  –  August 2004  (1 year 8 months) Associate Gunderson Dettmer Stough Villeneuve Franklin & Hachigian January 2003  –  August 2004  (1 year 8 months) Barbri Rep BAR/BRI Bar Review 1999  –  2002  (3 years) Barbri Rep BAR/BRI Bar Review 1999  –  2002  (3 years) Skills Intellectual Property Mergers Software Licensing Start-ups Licensing Due Diligence Negotiation SaaS Skills  Intellectual Property Mergers Software Licensing Start-ups Licensing Due Diligence Negotiation SaaS Intellectual Property Mergers Software Licensing Start-ups Licensing Due Diligence Negotiation SaaS Intellectual Property Mergers Software Licensing Start-ups Licensing Due Diligence Negotiation SaaS Education The George Washington University Law School Doctor of Law (JD),  Intellectual Property Law 1999  – 2002 University of California, Berkeley Bachelor of Engineering (BE),  Industrial Engineering and Operations Research 1995  – 1999 The George Washington University Law School Doctor of Law (JD),  Intellectual Property Law 1999  – 2002 The George Washington University Law School Doctor of Law (JD),  Intellectual Property Law 1999  – 2002 The George Washington University Law School Doctor of Law (JD),  Intellectual Property Law 1999  – 2002 University of California, Berkeley Bachelor of Engineering (BE),  Industrial Engineering and Operations Research 1995  – 1999 University of California, Berkeley Bachelor of Engineering (BE),  Industrial Engineering and Operations Research 1995  – 1999 University of California, Berkeley Bachelor of Engineering (BE),  Industrial Engineering and Operations Research 1995  – 1999 ", "Experience Corporate Counsel NBC Universal July 2010  – Present (5 years 2 months) Legal Google August 2007  –  June 2010  (2 years 11 months) Legal Counsel Google 2007  –  2009  (2 years) Corporate Counsel Google 2007  –  2009  (2 years) Corporate Counsel Sony Computer Entertainment Japan 2005  –  2007  (2 years) Corporate Counsel Sony Computer Entertainment Inc. 2005  –  2007  (2 years) Trainee Legal Aid Foundation of Los Angeles 2002  –  2003  (1 year) Counsel Nagashima Ohno & Tsunematsu 2000  –  2002  (2 years) Counsel Blakemore & Associates 1998  –  2000  (2 years) Corporate Counsel NBC Universal July 2010  – Present (5 years 2 months) Corporate Counsel NBC Universal July 2010  – Present (5 years 2 months) Legal Google August 2007  –  June 2010  (2 years 11 months) Legal Google August 2007  –  June 2010  (2 years 11 months) Legal Counsel Google 2007  –  2009  (2 years) Legal Counsel Google 2007  –  2009  (2 years) Corporate Counsel Google 2007  –  2009  (2 years) Corporate Counsel Google 2007  –  2009  (2 years) Corporate Counsel Sony Computer Entertainment Japan 2005  –  2007  (2 years) Corporate Counsel Sony Computer Entertainment Japan 2005  –  2007  (2 years) Corporate Counsel Sony Computer Entertainment Inc. 2005  –  2007  (2 years) Corporate Counsel Sony Computer Entertainment Inc. 2005  –  2007  (2 years) Trainee Legal Aid Foundation of Los Angeles 2002  –  2003  (1 year) Trainee Legal Aid Foundation of Los Angeles 2002  –  2003  (1 year) Counsel Nagashima Ohno & Tsunematsu 2000  –  2002  (2 years) Counsel Nagashima Ohno & Tsunematsu 2000  –  2002  (2 years) Counsel Blakemore & Associates 1998  –  2000  (2 years) Counsel Blakemore & Associates 1998  –  2000  (2 years) Education University of California, Los Angeles - School of Law LLM 2002  – 2003 USC Gould School of Law University of California, Los Angeles - School of Law LLM 2002  – 2003 University of California, Los Angeles - School of Law LLM 2002  – 2003 University of California, Los Angeles - School of Law LLM 2002  – 2003 USC Gould School of Law USC Gould School of Law USC Gould School of Law ", "Experience Corporate Counsel Google August 2011  – Present (4 years 1 month) San Bruno, CA YouTube division Corporate Counsel Pandora July 2010  –  July 2011  (1 year 1 month) Oakland, CA Counsel for Ad Sales, Communications and Events/Marketing Departments. Manager, Business Affairs Current TV, LLC August 2006  –  July 2010  (4 years) Supervise all aspects of on-air and online contests, including drafting of contest rules, review of entries, development of internal auditing systems, and implementation of fraud-protection policies.  \n \nNegotiate and ensure fulfillment of promotional partnership and sponsorship deals, including viewer-created advertising campaigns, live event coverage, and cross-marketing initiatives.  \n \nImplement cross-platform initiatives, specifically as they related to digital distribution and content syndication.  \n \nReview programming content to ensure compliance with broadcast standards and contractual obligations.  \n \nDraft and negotiate production and acquisitions agreements, and assist production staff with clearance issues.  \n \nDraft and negotiate operations agreements relating to IT infrastructure, broadcast operations, and online advertising network management.  \n \nEvaluate potential partners, content providers, and service providers from a business and legal perspective.  \n \nProvide corporate training seminars on DMCA guidelines, fair use, defamation and rights of privacy.  \n \nAssist with development of internal software systems relating to rights management, scheduling, and digital distribution. \n \nManage global intellectual property rights; conduct trademark analysis of proposed branding and programming franchises; prepare US, UK and EU IP registrations. Interim Director, Business Affairs Current UK Limited October 2008  –  May 2009  (8 months) Negotiated complex advertising agreements and implemented viewer-created advertising campaigns for large-scale partners. \n \nProvided legal training and seminars to programming and online staff, specifically relating to UK fair dealing, defamation, privacy, and data protection laws.  \n \nWorked closely with Human Resources on UK employment matters, including negotiation of talent agreements and development of new hire processes. \n \nAssisted Finance and Operations department with matters relating to insurance, internal budget compliance, advertising revenue projections, and development of automated payment systems.  \n \nManage and train Business Affairs support staff in UK and Italy. Intellectual Property Associate Kronenberger Hanley, LLP October 2005  –  July 2006  (10 months) Specialized in intellectual property law for internet-based companies, with an emphasis in trademark/copyright infringement, defamation, and rights of publicity.  \n \nDrafted Federal and state pleadings relating to Federal internet regulations, California anti-SLAPP law, computer fraud, cyber-squatting, and unfair business practices.  \n \nPrepared end user agreements for online service providers, including website terms of use and privacy policies and software licensing agreements. Summer Associate Josh A. Arce, Attorney at Law June 2004  –  December 2004  (7 months) Drafted recording, publishing and financing contracts for music artists and bands. \n \nPrepared litigation pleadings relating to corporate, employment, and personal injury suits. Attended and assisted in preparation for depositions, mediations, and settlement conferences.  \n \nAssisted clients with corporate formation and management, including preparation of operational agreements and intellectual property filings. Legal Intern Law Offices of George M. Rush January 2004  –  August 2004  (8 months) Drafted film production and financing contracts for local directors, producers, and screenwriters. \nPrepared legal reference guides and clearance documents for documentary filmmakers.  \nResearched and drafted discovery documents regarding low-income landlord/tenant litigation and rights of publicity/distribution suits. Corporate Counsel Google August 2011  – Present (4 years 1 month) San Bruno, CA YouTube division Corporate Counsel Google August 2011  – Present (4 years 1 month) San Bruno, CA YouTube division Corporate Counsel Pandora July 2010  –  July 2011  (1 year 1 month) Oakland, CA Counsel for Ad Sales, Communications and Events/Marketing Departments. Corporate Counsel Pandora July 2010  –  July 2011  (1 year 1 month) Oakland, CA Counsel for Ad Sales, Communications and Events/Marketing Departments. Manager, Business Affairs Current TV, LLC August 2006  –  July 2010  (4 years) Supervise all aspects of on-air and online contests, including drafting of contest rules, review of entries, development of internal auditing systems, and implementation of fraud-protection policies.  \n \nNegotiate and ensure fulfillment of promotional partnership and sponsorship deals, including viewer-created advertising campaigns, live event coverage, and cross-marketing initiatives.  \n \nImplement cross-platform initiatives, specifically as they related to digital distribution and content syndication.  \n \nReview programming content to ensure compliance with broadcast standards and contractual obligations.  \n \nDraft and negotiate production and acquisitions agreements, and assist production staff with clearance issues.  \n \nDraft and negotiate operations agreements relating to IT infrastructure, broadcast operations, and online advertising network management.  \n \nEvaluate potential partners, content providers, and service providers from a business and legal perspective.  \n \nProvide corporate training seminars on DMCA guidelines, fair use, defamation and rights of privacy.  \n \nAssist with development of internal software systems relating to rights management, scheduling, and digital distribution. \n \nManage global intellectual property rights; conduct trademark analysis of proposed branding and programming franchises; prepare US, UK and EU IP registrations. Manager, Business Affairs Current TV, LLC August 2006  –  July 2010  (4 years) Supervise all aspects of on-air and online contests, including drafting of contest rules, review of entries, development of internal auditing systems, and implementation of fraud-protection policies.  \n \nNegotiate and ensure fulfillment of promotional partnership and sponsorship deals, including viewer-created advertising campaigns, live event coverage, and cross-marketing initiatives.  \n \nImplement cross-platform initiatives, specifically as they related to digital distribution and content syndication.  \n \nReview programming content to ensure compliance with broadcast standards and contractual obligations.  \n \nDraft and negotiate production and acquisitions agreements, and assist production staff with clearance issues.  \n \nDraft and negotiate operations agreements relating to IT infrastructure, broadcast operations, and online advertising network management.  \n \nEvaluate potential partners, content providers, and service providers from a business and legal perspective.  \n \nProvide corporate training seminars on DMCA guidelines, fair use, defamation and rights of privacy.  \n \nAssist with development of internal software systems relating to rights management, scheduling, and digital distribution. \n \nManage global intellectual property rights; conduct trademark analysis of proposed branding and programming franchises; prepare US, UK and EU IP registrations. Interim Director, Business Affairs Current UK Limited October 2008  –  May 2009  (8 months) Negotiated complex advertising agreements and implemented viewer-created advertising campaigns for large-scale partners. \n \nProvided legal training and seminars to programming and online staff, specifically relating to UK fair dealing, defamation, privacy, and data protection laws.  \n \nWorked closely with Human Resources on UK employment matters, including negotiation of talent agreements and development of new hire processes. \n \nAssisted Finance and Operations department with matters relating to insurance, internal budget compliance, advertising revenue projections, and development of automated payment systems.  \n \nManage and train Business Affairs support staff in UK and Italy. Interim Director, Business Affairs Current UK Limited October 2008  –  May 2009  (8 months) Negotiated complex advertising agreements and implemented viewer-created advertising campaigns for large-scale partners. \n \nProvided legal training and seminars to programming and online staff, specifically relating to UK fair dealing, defamation, privacy, and data protection laws.  \n \nWorked closely with Human Resources on UK employment matters, including negotiation of talent agreements and development of new hire processes. \n \nAssisted Finance and Operations department with matters relating to insurance, internal budget compliance, advertising revenue projections, and development of automated payment systems.  \n \nManage and train Business Affairs support staff in UK and Italy. Intellectual Property Associate Kronenberger Hanley, LLP October 2005  –  July 2006  (10 months) Specialized in intellectual property law for internet-based companies, with an emphasis in trademark/copyright infringement, defamation, and rights of publicity.  \n \nDrafted Federal and state pleadings relating to Federal internet regulations, California anti-SLAPP law, computer fraud, cyber-squatting, and unfair business practices.  \n \nPrepared end user agreements for online service providers, including website terms of use and privacy policies and software licensing agreements. Intellectual Property Associate Kronenberger Hanley, LLP October 2005  –  July 2006  (10 months) Specialized in intellectual property law for internet-based companies, with an emphasis in trademark/copyright infringement, defamation, and rights of publicity.  \n \nDrafted Federal and state pleadings relating to Federal internet regulations, California anti-SLAPP law, computer fraud, cyber-squatting, and unfair business practices.  \n \nPrepared end user agreements for online service providers, including website terms of use and privacy policies and software licensing agreements. Summer Associate Josh A. Arce, Attorney at Law June 2004  –  December 2004  (7 months) Drafted recording, publishing and financing contracts for music artists and bands. \n \nPrepared litigation pleadings relating to corporate, employment, and personal injury suits. Attended and assisted in preparation for depositions, mediations, and settlement conferences.  \n \nAssisted clients with corporate formation and management, including preparation of operational agreements and intellectual property filings. Summer Associate Josh A. Arce, Attorney at Law June 2004  –  December 2004  (7 months) Drafted recording, publishing and financing contracts for music artists and bands. \n \nPrepared litigation pleadings relating to corporate, employment, and personal injury suits. Attended and assisted in preparation for depositions, mediations, and settlement conferences.  \n \nAssisted clients with corporate formation and management, including preparation of operational agreements and intellectual property filings. Legal Intern Law Offices of George M. Rush January 2004  –  August 2004  (8 months) Drafted film production and financing contracts for local directors, producers, and screenwriters. \nPrepared legal reference guides and clearance documents for documentary filmmakers.  \nResearched and drafted discovery documents regarding low-income landlord/tenant litigation and rights of publicity/distribution suits. Legal Intern Law Offices of George M. Rush January 2004  –  August 2004  (8 months) Drafted film production and financing contracts for local directors, producers, and screenwriters. \nPrepared legal reference guides and clearance documents for documentary filmmakers.  \nResearched and drafted discovery documents regarding low-income landlord/tenant litigation and rights of publicity/distribution suits. Skills Intellectual Property Broadcast New Media Legal Writing Digital Media Television Licensing Entertainment Video Production Advertising Video Entertainment Law Documentaries Social Media Web Video Legal Research Intellectual Property... Start-ups Film Social Networking See 5+     See less Skills  Intellectual Property Broadcast New Media Legal Writing Digital Media Television Licensing Entertainment Video Production Advertising Video Entertainment Law Documentaries Social Media Web Video Legal Research Intellectual Property... Start-ups Film Social Networking See 5+     See less Intellectual Property Broadcast New Media Legal Writing Digital Media Television Licensing Entertainment Video Production Advertising Video Entertainment Law Documentaries Social Media Web Video Legal Research Intellectual Property... Start-ups Film Social Networking See 5+     See less Intellectual Property Broadcast New Media Legal Writing Digital Media Television Licensing Entertainment Video Production Advertising Video Entertainment Law Documentaries Social Media Web Video Legal Research Intellectual Property... Start-ups Film Social Networking See 5+     See less Education University of California, Hastings College of the Law J.D. 2002  – 2005 Activities and Societies:  Association of Communications ,  Sports & Entertainment Law University of California, Los Angeles B.A.,  Political Science 1998  – 2002 Activities and Societies:  Sigma Delta Sigma ,  Co-founder & Vice President University of California, Hastings College of the Law J.D. 2002  – 2005 Activities and Societies:  Association of Communications ,  Sports & Entertainment Law University of California, Hastings College of the Law J.D. 2002  – 2005 Activities and Societies:  Association of Communications ,  Sports & Entertainment Law University of California, Hastings College of the Law J.D. 2002  – 2005 Activities and Societies:  Association of Communications ,  Sports & Entertainment Law University of California, Los Angeles B.A.,  Political Science 1998  – 2002 Activities and Societies:  Sigma Delta Sigma ,  Co-founder & Vice President University of California, Los Angeles B.A.,  Political Science 1998  – 2002 Activities and Societies:  Sigma Delta Sigma ,  Co-founder & Vice President University of California, Los Angeles B.A.,  Political Science 1998  – 2002 Activities and Societies:  Sigma Delta Sigma ,  Co-founder & Vice President ", "Summary In my current role at Google, I focus on product strategy, early-stage business development and strategic partnerships across Google's $XB suite of shopping products and services, including our ad products (e.g., Product Ads and its current variants, Local Inventory Ads and Purchases on Google), our trust services (e.g., Trusted Stores, Seller Ratings and our mystery-shopping service) and our nascent fulfillment efforts (e.g., Shopping Express). In short, I incubate new products and scale existing products through partnerships.  \n \nI joined Google in August 2010 as part of its acquisition of virtual goods monetization company, Jambool, where I served as VP, Business and Legal Affairs. Prior to Jambool, I spent 9 years at Yahoo! in senior legal and business development roles, focused on search, shopping, local and travel. I earned my BA in English Literature and Communication Studies from UCLA and my JD from Villanova University School of Law. \n \nSpecialties: Business Development, Strategy, Monetization, Management Summary In my current role at Google, I focus on product strategy, early-stage business development and strategic partnerships across Google's $XB suite of shopping products and services, including our ad products (e.g., Product Ads and its current variants, Local Inventory Ads and Purchases on Google), our trust services (e.g., Trusted Stores, Seller Ratings and our mystery-shopping service) and our nascent fulfillment efforts (e.g., Shopping Express). In short, I incubate new products and scale existing products through partnerships.  \n \nI joined Google in August 2010 as part of its acquisition of virtual goods monetization company, Jambool, where I served as VP, Business and Legal Affairs. Prior to Jambool, I spent 9 years at Yahoo! in senior legal and business development roles, focused on search, shopping, local and travel. I earned my BA in English Literature and Communication Studies from UCLA and my JD from Villanova University School of Law. \n \nSpecialties: Business Development, Strategy, Monetization, Management In my current role at Google, I focus on product strategy, early-stage business development and strategic partnerships across Google's $XB suite of shopping products and services, including our ad products (e.g., Product Ads and its current variants, Local Inventory Ads and Purchases on Google), our trust services (e.g., Trusted Stores, Seller Ratings and our mystery-shopping service) and our nascent fulfillment efforts (e.g., Shopping Express). In short, I incubate new products and scale existing products through partnerships.  \n \nI joined Google in August 2010 as part of its acquisition of virtual goods monetization company, Jambool, where I served as VP, Business and Legal Affairs. Prior to Jambool, I spent 9 years at Yahoo! in senior legal and business development roles, focused on search, shopping, local and travel. I earned my BA in English Literature and Communication Studies from UCLA and my JD from Villanova University School of Law. \n \nSpecialties: Business Development, Strategy, Monetization, Management In my current role at Google, I focus on product strategy, early-stage business development and strategic partnerships across Google's $XB suite of shopping products and services, including our ad products (e.g., Product Ads and its current variants, Local Inventory Ads and Purchases on Google), our trust services (e.g., Trusted Stores, Seller Ratings and our mystery-shopping service) and our nascent fulfillment efforts (e.g., Shopping Express). In short, I incubate new products and scale existing products through partnerships.  \n \nI joined Google in August 2010 as part of its acquisition of virtual goods monetization company, Jambool, where I served as VP, Business and Legal Affairs. Prior to Jambool, I spent 9 years at Yahoo! in senior legal and business development roles, focused on search, shopping, local and travel. I earned my BA in English Literature and Communication Studies from UCLA and my JD from Villanova University School of Law. \n \nSpecialties: Business Development, Strategy, Monetization, Management Experience Director of Product Partnerships, Ads & Commerce Google May 2013  – Present (2 years 4 months) Head of Global Business Development, Shopping Google April 2012  –  May 2013  (1 year 2 months) Head of Business Development, Commerce Google August 2010  –  April 2012  (1 year 9 months) Go-to-market strategy and early-stage business development for Commerce group, including Google Offers and Google Wallet. VP, Business & Legal Affairs Social Gold | Jambool (acquired by Google) March 2009  –  August 2010  (1 year 6 months) As first non-coding hire and first non-founding member of executive team, lead all sales and business development efforts, presided over all legal matters, and tried not to get in the way of some of the most talented engineers on the planet. VP Business Affairs & General Counsel SearchMe, Inc. March 2008  –  December 2008  (10 months) Lead all business development efforts, focusing on relationships that accelerated product development, drove user engagement, broadened distribution and generated revenue. Presided over all legal matters, including intellectual property, site compliance and commercial transactions. Senior Director, Global Strategic Partnerships Yahoo! May 2005  –  January 2007  (1 year 9 months) Cultivated and expanded strategic relationships with Fortune 100 companies. Worked closely with vertical business units and network sales force to achieve corporate objectives and revenue goals. Director, Strategic Alliances Yahoo! August 2002  –  May 2005  (2 years 10 months) Conducted horizontal business development and relationship management for Yahoo!'s largest and most strategic relationships, including Hewlett-Packard, HSBC Bank, Overture, Travelocity and Wal-Mart. Senior Corporate Counsel Yahoo! October 2000  –  August 2002  (1 year 11 months) Served primary legal and secondary business development function on most commercial relationships of strategic significance to Yahoo!. Corporate Counsel Yahoo! October 1999  –  October 2000  (1 year 1 month) Advised sales and business development teams on partnering strategies and deal structures. Drafted and negotiated complex licensing, integration, distribution and advertising agreements. Associate Corporate Counsel Yahoo! March 1998  –  October 1999  (1 year 8 months) Spearheaded outbound licensing program and policed trademark portfolio. Devised and implemented Yahoo!'s first compliance program, responding to civil and criminal discovery arising from user conduct on the Yahoo! Network. Public Policy Counsel Netscape November 1997  –  February 1998  (4 months) Advised General Counsel and Associate General Counsel, Public Policy on matters of public policy. Director of Product Partnerships, Ads & Commerce Google May 2013  – Present (2 years 4 months) Director of Product Partnerships, Ads & Commerce Google May 2013  – Present (2 years 4 months) Head of Global Business Development, Shopping Google April 2012  –  May 2013  (1 year 2 months) Head of Global Business Development, Shopping Google April 2012  –  May 2013  (1 year 2 months) Head of Business Development, Commerce Google August 2010  –  April 2012  (1 year 9 months) Go-to-market strategy and early-stage business development for Commerce group, including Google Offers and Google Wallet. Head of Business Development, Commerce Google August 2010  –  April 2012  (1 year 9 months) Go-to-market strategy and early-stage business development for Commerce group, including Google Offers and Google Wallet. VP, Business & Legal Affairs Social Gold | Jambool (acquired by Google) March 2009  –  August 2010  (1 year 6 months) As first non-coding hire and first non-founding member of executive team, lead all sales and business development efforts, presided over all legal matters, and tried not to get in the way of some of the most talented engineers on the planet. VP, Business & Legal Affairs Social Gold | Jambool (acquired by Google) March 2009  –  August 2010  (1 year 6 months) As first non-coding hire and first non-founding member of executive team, lead all sales and business development efforts, presided over all legal matters, and tried not to get in the way of some of the most talented engineers on the planet. VP Business Affairs & General Counsel SearchMe, Inc. March 2008  –  December 2008  (10 months) Lead all business development efforts, focusing on relationships that accelerated product development, drove user engagement, broadened distribution and generated revenue. Presided over all legal matters, including intellectual property, site compliance and commercial transactions. VP Business Affairs & General Counsel SearchMe, Inc. March 2008  –  December 2008  (10 months) Lead all business development efforts, focusing on relationships that accelerated product development, drove user engagement, broadened distribution and generated revenue. Presided over all legal matters, including intellectual property, site compliance and commercial transactions. Senior Director, Global Strategic Partnerships Yahoo! May 2005  –  January 2007  (1 year 9 months) Cultivated and expanded strategic relationships with Fortune 100 companies. Worked closely with vertical business units and network sales force to achieve corporate objectives and revenue goals. Senior Director, Global Strategic Partnerships Yahoo! May 2005  –  January 2007  (1 year 9 months) Cultivated and expanded strategic relationships with Fortune 100 companies. Worked closely with vertical business units and network sales force to achieve corporate objectives and revenue goals. Director, Strategic Alliances Yahoo! August 2002  –  May 2005  (2 years 10 months) Conducted horizontal business development and relationship management for Yahoo!'s largest and most strategic relationships, including Hewlett-Packard, HSBC Bank, Overture, Travelocity and Wal-Mart. Director, Strategic Alliances Yahoo! August 2002  –  May 2005  (2 years 10 months) Conducted horizontal business development and relationship management for Yahoo!'s largest and most strategic relationships, including Hewlett-Packard, HSBC Bank, Overture, Travelocity and Wal-Mart. Senior Corporate Counsel Yahoo! October 2000  –  August 2002  (1 year 11 months) Served primary legal and secondary business development function on most commercial relationships of strategic significance to Yahoo!. Senior Corporate Counsel Yahoo! October 2000  –  August 2002  (1 year 11 months) Served primary legal and secondary business development function on most commercial relationships of strategic significance to Yahoo!. Corporate Counsel Yahoo! October 1999  –  October 2000  (1 year 1 month) Advised sales and business development teams on partnering strategies and deal structures. Drafted and negotiated complex licensing, integration, distribution and advertising agreements. Corporate Counsel Yahoo! October 1999  –  October 2000  (1 year 1 month) Advised sales and business development teams on partnering strategies and deal structures. Drafted and negotiated complex licensing, integration, distribution and advertising agreements. Associate Corporate Counsel Yahoo! March 1998  –  October 1999  (1 year 8 months) Spearheaded outbound licensing program and policed trademark portfolio. Devised and implemented Yahoo!'s first compliance program, responding to civil and criminal discovery arising from user conduct on the Yahoo! Network. Associate Corporate Counsel Yahoo! March 1998  –  October 1999  (1 year 8 months) Spearheaded outbound licensing program and policed trademark portfolio. Devised and implemented Yahoo!'s first compliance program, responding to civil and criminal discovery arising from user conduct on the Yahoo! Network. Public Policy Counsel Netscape November 1997  –  February 1998  (4 months) Advised General Counsel and Associate General Counsel, Public Policy on matters of public policy. Public Policy Counsel Netscape November 1997  –  February 1998  (4 months) Advised General Counsel and Associate General Counsel, Public Policy on matters of public policy. Skills Monetization Strategic Partnerships Product Development Search Mobile Applications SaaS Mobile Marketing Analytics Mobile Commerce Digital Strategy Online Gaming Mobile Internet Social Networking Partnerships Mobile Payments Contract Negotiation Social Games Strategy Business Development New Business Development Leadership Online Marketing Sales Go-to-market Strategy Marketing See 10+     See less Skills  Monetization Strategic Partnerships Product Development Search Mobile Applications SaaS Mobile Marketing Analytics Mobile Commerce Digital Strategy Online Gaming Mobile Internet Social Networking Partnerships Mobile Payments Contract Negotiation Social Games Strategy Business Development New Business Development Leadership Online Marketing Sales Go-to-market Strategy Marketing See 10+     See less Monetization Strategic Partnerships Product Development Search Mobile Applications SaaS Mobile Marketing Analytics Mobile Commerce Digital Strategy Online Gaming Mobile Internet Social Networking Partnerships Mobile Payments Contract Negotiation Social Games Strategy Business Development New Business Development Leadership Online Marketing Sales Go-to-market Strategy Marketing See 10+     See less Monetization Strategic Partnerships Product Development Search Mobile Applications SaaS Mobile Marketing Analytics Mobile Commerce Digital Strategy Online Gaming Mobile Internet Social Networking Partnerships Mobile Payments Contract Negotiation Social Games Strategy Business Development New Business Development Leadership Online Marketing Sales Go-to-market Strategy Marketing See 10+     See less Education Villanova University School of Law JD 1994  – 1997 Activities and Societies:  Legal Extern ,  Ministry of Science and Technology ,  Republic of Croatia\nResearch Fellow and Founding Member ,  Project Bosnia -- an effort to leverage technology as a means to restore the rule of law in war-torn Bosnia University of Oxford Comparative Studies ,  Computer Law 1995  – 1995 University of California, Los Angeles BA,  English Literature and Communication Studies 1990  – 1994 Homestead High School 1986  – 1990 Villanova University School of Law JD 1994  – 1997 Activities and Societies:  Legal Extern ,  Ministry of Science and Technology ,  Republic of Croatia\nResearch Fellow and Founding Member ,  Project Bosnia -- an effort to leverage technology as a means to restore the rule of law in war-torn Bosnia Villanova University School of Law JD 1994  – 1997 Activities and Societies:  Legal Extern ,  Ministry of Science and Technology ,  Republic of Croatia\nResearch Fellow and Founding Member ,  Project Bosnia -- an effort to leverage technology as a means to restore the rule of law in war-torn Bosnia Villanova University School of Law JD 1994  – 1997 Activities and Societies:  Legal Extern ,  Ministry of Science and Technology ,  Republic of Croatia\nResearch Fellow and Founding Member ,  Project Bosnia -- an effort to leverage technology as a means to restore the rule of law in war-torn Bosnia University of Oxford Comparative Studies ,  Computer Law 1995  – 1995 University of Oxford Comparative Studies ,  Computer Law 1995  – 1995 University of Oxford Comparative Studies ,  Computer Law 1995  – 1995 University of California, Los Angeles BA,  English Literature and Communication Studies 1990  – 1994 University of California, Los Angeles BA,  English Literature and Communication Studies 1990  – 1994 University of California, Los Angeles BA,  English Literature and Communication Studies 1990  – 1994 Homestead High School 1986  – 1990 Homestead High School 1986  – 1990 Homestead High School 1986  – 1990 ", "Skills Corporate Governance Skills  Corporate Governance Corporate Governance Corporate Governance ", "Experience Corporate Counsel Google February 2014  – Present (1 year 7 months) Mountain View, CA Corporate Counsel Salesforce.com January 2012  –  February 2014  (2 years 2 months) San Francisco Bay Area Associate O'Melveny & Myers LLP October 2006  –  November 2011  (5 years 2 months) New York, Silicon Valley and Tokyo Summer Associate Milbank, Tweed, Hadley & McCloy LLP May 2005  –  August 2005  (4 months) New York, New York Corporate Counsel Google February 2014  – Present (1 year 7 months) Mountain View, CA Corporate Counsel Google February 2014  – Present (1 year 7 months) Mountain View, CA Corporate Counsel Salesforce.com January 2012  –  February 2014  (2 years 2 months) San Francisco Bay Area Corporate Counsel Salesforce.com January 2012  –  February 2014  (2 years 2 months) San Francisco Bay Area Associate O'Melveny & Myers LLP October 2006  –  November 2011  (5 years 2 months) New York, Silicon Valley and Tokyo Associate O'Melveny & Myers LLP October 2006  –  November 2011  (5 years 2 months) New York, Silicon Valley and Tokyo Summer Associate Milbank, Tweed, Hadley & McCloy LLP May 2005  –  August 2005  (4 months) New York, New York Summer Associate Milbank, Tweed, Hadley & McCloy LLP May 2005  –  August 2005  (4 months) New York, New York Skills Corporate Law Venture Capital Securities Law Mergers Private Equity Securities Regulation Corporate Governance Mergers & Acquisitions Cross-border... Licensing Joint Ventures Intellectual Property Legal Writing Privacy Law Skills  Corporate Law Venture Capital Securities Law Mergers Private Equity Securities Regulation Corporate Governance Mergers & Acquisitions Cross-border... Licensing Joint Ventures Intellectual Property Legal Writing Privacy Law Corporate Law Venture Capital Securities Law Mergers Private Equity Securities Regulation Corporate Governance Mergers & Acquisitions Cross-border... Licensing Joint Ventures Intellectual Property Legal Writing Privacy Law Corporate Law Venture Capital Securities Law Mergers Private Equity Securities Regulation Corporate Governance Mergers & Acquisitions Cross-border... Licensing Joint Ventures Intellectual Property Legal Writing Privacy Law Education UCLA School of Law JD,  Business Law 2003  – 2006 UCLA BA,  Int'l Economics ,  French UCLA School of Law JD,  Business Law 2003  – 2006 UCLA School of Law JD,  Business Law 2003  – 2006 UCLA School of Law JD,  Business Law 2003  – 2006 UCLA BA,  Int'l Economics ,  French UCLA BA,  Int'l Economics ,  French UCLA BA,  Int'l Economics ,  French ", "Experience Associate Corporate Counsel Google August 2014  – Present (1 year 1 month) Mountain View, CA Corporate Counsel T-Systems North America, Inc. July 2013  –  July 2014  (1 year 1 month) New York, NY Associate Ropes & Gray LLP January 2011  –  July 2013  (2 years 7 months) New York, NY Summer Fellow Harvard Law School - WilmerHale Legal Services Center June 2008  –  August 2008  (3 months) Greater Boston Area Teacher Shanghai Community International School July 2006  –  June 2007  (1 year) Shanghai, China Associate Corporate Counsel Google August 2014  – Present (1 year 1 month) Mountain View, CA Associate Corporate Counsel Google August 2014  – Present (1 year 1 month) Mountain View, CA Corporate Counsel T-Systems North America, Inc. July 2013  –  July 2014  (1 year 1 month) New York, NY Corporate Counsel T-Systems North America, Inc. July 2013  –  July 2014  (1 year 1 month) New York, NY Associate Ropes & Gray LLP January 2011  –  July 2013  (2 years 7 months) New York, NY Associate Ropes & Gray LLP January 2011  –  July 2013  (2 years 7 months) New York, NY Summer Fellow Harvard Law School - WilmerHale Legal Services Center June 2008  –  August 2008  (3 months) Greater Boston Area Summer Fellow Harvard Law School - WilmerHale Legal Services Center June 2008  –  August 2008  (3 months) Greater Boston Area Teacher Shanghai Community International School July 2006  –  June 2007  (1 year) Shanghai, China Teacher Shanghai Community International School July 2006  –  June 2007  (1 year) Shanghai, China Languages   Skills Skills     Education University of Southern California J.D.,  Law Activities and Societies:  Southern California Law Review ,  Public Interest Law Foundation (Board Member) ,  USC Law Merit Scholarship Recipient ,  Volunteer with the LA County Barrister's Domestic Violence Project London School of Economics and Political Science LL.M,  Corporate and Commercial Law Harvard University Bachelor of Arts (B.A.) Activities and Societies:  Phillips Brooks House Association ,  Gates Millennium Scholar University of Southern California J.D.,  Law Activities and Societies:  Southern California Law Review ,  Public Interest Law Foundation (Board Member) ,  USC Law Merit Scholarship Recipient ,  Volunteer with the LA County Barrister's Domestic Violence Project University of Southern California J.D.,  Law Activities and Societies:  Southern California Law Review ,  Public Interest Law Foundation (Board Member) ,  USC Law Merit Scholarship Recipient ,  Volunteer with the LA County Barrister's Domestic Violence Project University of Southern California J.D.,  Law Activities and Societies:  Southern California Law Review ,  Public Interest Law Foundation (Board Member) ,  USC Law Merit Scholarship Recipient ,  Volunteer with the LA County Barrister's Domestic Violence Project London School of Economics and Political Science LL.M,  Corporate and Commercial Law London School of Economics and Political Science LL.M,  Corporate and Commercial Law London School of Economics and Political Science LL.M,  Corporate and Commercial Law Harvard University Bachelor of Arts (B.A.) Activities and Societies:  Phillips Brooks House Association ,  Gates Millennium Scholar Harvard University Bachelor of Arts (B.A.) Activities and Societies:  Phillips Brooks House Association ,  Gates Millennium Scholar Harvard University Bachelor of Arts (B.A.) Activities and Societies:  Phillips Brooks House Association ,  Gates Millennium Scholar Honors & Awards ", "Summary Specialties: Renewable Energy Investments, Project Finance, Aircraft Finance, Film Finance, Leveraged Finance and other Acquisition Financings, Mergers & Acquisitions, General Corporate Law, and Commercial Contracts. Summary Specialties: Renewable Energy Investments, Project Finance, Aircraft Finance, Film Finance, Leveraged Finance and other Acquisition Financings, Mergers & Acquisitions, General Corporate Law, and Commercial Contracts. Specialties: Renewable Energy Investments, Project Finance, Aircraft Finance, Film Finance, Leveraged Finance and other Acquisition Financings, Mergers & Acquisitions, General Corporate Law, and Commercial Contracts. Specialties: Renewable Energy Investments, Project Finance, Aircraft Finance, Film Finance, Leveraged Finance and other Acquisition Financings, Mergers & Acquisitions, General Corporate Law, and Commercial Contracts. Experience Associate Corporate Counsel Google Inc. October 2013  – Present (1 year 11 months) Mountain View, CA Renewable Energy & Alternative Investments Secondee Google Inc. (Seconded from Milbank) May 2013  –  October 2013  (6 months) Mountain View, CA Renewable Energy & Alternative Investments Associate Milbank, Tweed, Hadley & McCloy LLP May 2012  –  May 2013  (1 year 1 month) New York, NY Global Transportation & Space Finance Corporate Associate Morgan, Lewis & Bockius LLP October 2008  –  May 2012  (3 years 8 months) New York, NY M&A/Corporate finance Law Clerk Federal Magistrate Judge Cheryl Pollak August 2007  –  August 2008  (1 year 1 month) Brooklyn, NY Summer Intern Manhattan District Attorney's Office June 2006  –  August 2006  (3 months) New York, NY Summer Intern New York State Division of Human Rights June 2005  –  August 2005  (3 months) New York, NY Summer Intern James Mintz Group, Inc. 2002  –  2002  (less than a year) Washington, DC Intern for private investigator. Associate Corporate Counsel Google Inc. October 2013  – Present (1 year 11 months) Mountain View, CA Renewable Energy & Alternative Investments Associate Corporate Counsel Google Inc. October 2013  – Present (1 year 11 months) Mountain View, CA Renewable Energy & Alternative Investments Secondee Google Inc. (Seconded from Milbank) May 2013  –  October 2013  (6 months) Mountain View, CA Renewable Energy & Alternative Investments Secondee Google Inc. (Seconded from Milbank) May 2013  –  October 2013  (6 months) Mountain View, CA Renewable Energy & Alternative Investments Associate Milbank, Tweed, Hadley & McCloy LLP May 2012  –  May 2013  (1 year 1 month) New York, NY Global Transportation & Space Finance Associate Milbank, Tweed, Hadley & McCloy LLP May 2012  –  May 2013  (1 year 1 month) New York, NY Global Transportation & Space Finance Corporate Associate Morgan, Lewis & Bockius LLP October 2008  –  May 2012  (3 years 8 months) New York, NY M&A/Corporate finance Corporate Associate Morgan, Lewis & Bockius LLP October 2008  –  May 2012  (3 years 8 months) New York, NY M&A/Corporate finance Law Clerk Federal Magistrate Judge Cheryl Pollak August 2007  –  August 2008  (1 year 1 month) Brooklyn, NY Law Clerk Federal Magistrate Judge Cheryl Pollak August 2007  –  August 2008  (1 year 1 month) Brooklyn, NY Summer Intern Manhattan District Attorney's Office June 2006  –  August 2006  (3 months) New York, NY Summer Intern Manhattan District Attorney's Office June 2006  –  August 2006  (3 months) New York, NY Summer Intern New York State Division of Human Rights June 2005  –  August 2005  (3 months) New York, NY Summer Intern New York State Division of Human Rights June 2005  –  August 2005  (3 months) New York, NY Summer Intern James Mintz Group, Inc. 2002  –  2002  (less than a year) Washington, DC Intern for private investigator. Summer Intern James Mintz Group, Inc. 2002  –  2002  (less than a year) Washington, DC Intern for private investigator. Languages French French French Skills Corporate Law Licensing Mergers & Acquisitions Project Finance Finance Leveraged Finance Corporate Governance Joint Ventures Investments Securities Regulation Legal Writing Commercial Litigation Litigation Private Equity Legal Research Civil Litigation See 1+     See less Skills  Corporate Law Licensing Mergers & Acquisitions Project Finance Finance Leveraged Finance Corporate Governance Joint Ventures Investments Securities Regulation Legal Writing Commercial Litigation Litigation Private Equity Legal Research Civil Litigation See 1+     See less Corporate Law Licensing Mergers & Acquisitions Project Finance Finance Leveraged Finance Corporate Governance Joint Ventures Investments Securities Regulation Legal Writing Commercial Litigation Litigation Private Equity Legal Research Civil Litigation See 1+     See less Corporate Law Licensing Mergers & Acquisitions Project Finance Finance Leveraged Finance Corporate Governance Joint Ventures Investments Securities Regulation Legal Writing Commercial Litigation Litigation Private Equity Legal Research Civil Litigation See 1+     See less Education University of Michigan Law School JD,  Law 2004  – 2007 Wesleyan University BA,  Psychology 1999  – 2003 Activities and Societies:  Varsity Squash\nMen's Club Rugby\nOuting Club/Rock Climbing Milton Academy 1994  – 1998 St. Albans 1989  – 1994 University of Michigan Law School JD,  Law 2004  – 2007 University of Michigan Law School JD,  Law 2004  – 2007 University of Michigan Law School JD,  Law 2004  – 2007 Wesleyan University BA,  Psychology 1999  – 2003 Activities and Societies:  Varsity Squash\nMen's Club Rugby\nOuting Club/Rock Climbing Wesleyan University BA,  Psychology 1999  – 2003 Activities and Societies:  Varsity Squash\nMen's Club Rugby\nOuting Club/Rock Climbing Wesleyan University BA,  Psychology 1999  – 2003 Activities and Societies:  Varsity Squash\nMen's Club Rugby\nOuting Club/Rock Climbing Milton Academy 1994  – 1998 Milton Academy 1994  – 1998 Milton Academy 1994  – 1998 St. Albans 1989  – 1994 St. Albans 1989  – 1994 St. Albans 1989  – 1994 ", "Skills Strategy Development IP Marketing Open Source Procurement Software Licensing Licensing Negotiations License Management Higher Education Training Template Creation Team Leadership Leadership Development Cross Functional Team... Public Speaking Technical Course... Document Drafting Strategy Business Development Legal Writing Corporate Law Intellectual Property Program Management Cloud Computing Start-ups Strategic Partnerships Enterprise Software Licensing SaaS Management Human Resources Contract Negotiation Executive Management See 18+     See less Skills  Strategy Development IP Marketing Open Source Procurement Software Licensing Licensing Negotiations License Management Higher Education Training Template Creation Team Leadership Leadership Development Cross Functional Team... Public Speaking Technical Course... Document Drafting Strategy Business Development Legal Writing Corporate Law Intellectual Property Program Management Cloud Computing Start-ups Strategic Partnerships Enterprise Software Licensing SaaS Management Human Resources Contract Negotiation Executive Management See 18+     See less Strategy Development IP Marketing Open Source Procurement Software Licensing Licensing Negotiations License Management Higher Education Training Template Creation Team Leadership Leadership Development Cross Functional Team... Public Speaking Technical Course... Document Drafting Strategy Business Development Legal Writing Corporate Law Intellectual Property Program Management Cloud Computing Start-ups Strategic Partnerships Enterprise Software Licensing SaaS Management Human Resources Contract Negotiation Executive Management See 18+     See less Strategy Development IP Marketing Open Source Procurement Software Licensing Licensing Negotiations License Management Higher Education Training Template Creation Team Leadership Leadership Development Cross Functional Team... Public Speaking Technical Course... Document Drafting Strategy Business Development Legal Writing Corporate Law Intellectual Property Program Management Cloud Computing Start-ups Strategic Partnerships Enterprise Software Licensing SaaS Management Human Resources Contract Negotiation Executive Management See 18+     See less ", "Experience Director, Product Management Google Inc. February 2015  – Present (7 months) Mountain View, CA VP Global Software Partnerships and Innovation Motorola Mobility, a Google Company March 2013  –  February 2015  (2 years) Sunnyvale, California As Vice President, Global Software Partnerships and Innovation, Masumi leads Strategic Partnership and Business Development activities including software partnerships, advanced technology sourcing and licensing, content partnerships and other product enabling relationships across the full portfolio of Motorola Mobility devices. Director and Head of APAC, New Business Development Google Inc. May 2010  –  March 2013  (2 years 11 months) Tokyo, Japan Senior Corporate Counsel Google Inc October 2003  –  May 2010  (6 years 8 months) Mountain View, California Associate (Corporate) Morrison & Foerster LLP July 2000  –  October 2003  (3 years 4 months) Palo Alto, California Director, Product Management Google Inc. February 2015  – Present (7 months) Mountain View, CA Director, Product Management Google Inc. February 2015  – Present (7 months) Mountain View, CA VP Global Software Partnerships and Innovation Motorola Mobility, a Google Company March 2013  –  February 2015  (2 years) Sunnyvale, California As Vice President, Global Software Partnerships and Innovation, Masumi leads Strategic Partnership and Business Development activities including software partnerships, advanced technology sourcing and licensing, content partnerships and other product enabling relationships across the full portfolio of Motorola Mobility devices. VP Global Software Partnerships and Innovation Motorola Mobility, a Google Company March 2013  –  February 2015  (2 years) Sunnyvale, California As Vice President, Global Software Partnerships and Innovation, Masumi leads Strategic Partnership and Business Development activities including software partnerships, advanced technology sourcing and licensing, content partnerships and other product enabling relationships across the full portfolio of Motorola Mobility devices. Director and Head of APAC, New Business Development Google Inc. May 2010  –  March 2013  (2 years 11 months) Tokyo, Japan Director and Head of APAC, New Business Development Google Inc. May 2010  –  March 2013  (2 years 11 months) Tokyo, Japan Senior Corporate Counsel Google Inc October 2003  –  May 2010  (6 years 8 months) Mountain View, California Senior Corporate Counsel Google Inc October 2003  –  May 2010  (6 years 8 months) Mountain View, California Associate (Corporate) Morrison & Foerster LLP July 2000  –  October 2003  (3 years 4 months) Palo Alto, California Associate (Corporate) Morrison & Foerster LLP July 2000  –  October 2003  (3 years 4 months) Palo Alto, California Languages Japanese Native or bilingual proficiency Japanese Native or bilingual proficiency Japanese Native or bilingual proficiency Native or bilingual proficiency Skills New Business Development Management Licensing Entrepreneurship Strategic Partnerships Intellectual Property Start-ups Venture Capital Mergers & Acquisitions E-commerce Joint Ventures Strategy Business Strategy Corporate Development Contract Negotiation Corporate Law Corporate Governance Business Development SaaS Online Advertising Mobile Devices Social Media Due Diligence Digital Media Legal Writing Mobile Advertising See 11+     See less Skills  New Business Development Management Licensing Entrepreneurship Strategic Partnerships Intellectual Property Start-ups Venture Capital Mergers & Acquisitions E-commerce Joint Ventures Strategy Business Strategy Corporate Development Contract Negotiation Corporate Law Corporate Governance Business Development SaaS Online Advertising Mobile Devices Social Media Due Diligence Digital Media Legal Writing Mobile Advertising See 11+     See less New Business Development Management Licensing Entrepreneurship Strategic Partnerships Intellectual Property Start-ups Venture Capital Mergers & Acquisitions E-commerce Joint Ventures Strategy Business Strategy Corporate Development Contract Negotiation Corporate Law Corporate Governance Business Development SaaS Online Advertising Mobile Devices Social Media Due Diligence Digital Media Legal Writing Mobile Advertising See 11+     See less New Business Development Management Licensing Entrepreneurship Strategic Partnerships Intellectual Property Start-ups Venture Capital Mergers & Acquisitions E-commerce Joint Ventures Strategy Business Strategy Corporate Development Contract Negotiation Corporate Law Corporate Governance Business Development SaaS Online Advertising Mobile Devices Social Media Due Diligence Digital Media Legal Writing Mobile Advertising See 11+     See less Education University of Michigan B.A.,  Political Science; Asian Studies 1990  – 2004 University of Washington School of Law J.D. 1997  – 2000 Kyoto University LL.M. (Master of Laws),  Civil Procedure; Alternative Dispute Resolution 1995  – 1997 University of Michigan B.A.,  Political Science; Asian Studies 1990  – 2004 University of Michigan B.A.,  Political Science; Asian Studies 1990  – 2004 University of Michigan B.A.,  Political Science; Asian Studies 1990  – 2004 University of Washington School of Law J.D. 1997  – 2000 University of Washington School of Law J.D. 1997  – 2000 University of Washington School of Law J.D. 1997  – 2000 Kyoto University LL.M. (Master of Laws),  Civil Procedure; Alternative Dispute Resolution 1995  – 1997 Kyoto University LL.M. (Master of Laws),  Civil Procedure; Alternative Dispute Resolution 1995  – 1997 Kyoto University LL.M. (Master of Laws),  Civil Procedure; Alternative Dispute Resolution 1995  – 1997 ", "Experience Senior Corporate Counsel Google Senior Corporate Counsel Yahoo! 1997  –  2001  (4 years) Senior Corporate Counsel Google Senior Corporate Counsel Google Senior Corporate Counsel Yahoo! 1997  –  2001  (4 years) Senior Corporate Counsel Yahoo! 1997  –  2001  (4 years) ", "Experience Corporate Counsel Google May 2015  – Present (4 months) Mountain View, CA Product Counsel and Commercial Counsel at Google [x] Associate Corporate Counsel Google May 2013  –  May 2015  (2 years 1 month) Associate Cleary Gottlieb Steen & Hamilton LLP September 2008  –  April 2013  (4 years 8 months) Technology Transactions; Intellectual Property; Litigation Research Associate FDO Partners December 2003  –  August 2005  (1 year 9 months) Quantitative Finance; Programming Corporate Counsel Google May 2015  – Present (4 months) Mountain View, CA Product Counsel and Commercial Counsel at Google [x] Corporate Counsel Google May 2015  – Present (4 months) Mountain View, CA Product Counsel and Commercial Counsel at Google [x] Associate Corporate Counsel Google May 2013  –  May 2015  (2 years 1 month) Associate Corporate Counsel Google May 2013  –  May 2015  (2 years 1 month) Associate Cleary Gottlieb Steen & Hamilton LLP September 2008  –  April 2013  (4 years 8 months) Technology Transactions; Intellectual Property; Litigation Associate Cleary Gottlieb Steen & Hamilton LLP September 2008  –  April 2013  (4 years 8 months) Technology Transactions; Intellectual Property; Litigation Research Associate FDO Partners December 2003  –  August 2005  (1 year 9 months) Quantitative Finance; Programming Research Associate FDO Partners December 2003  –  August 2005  (1 year 9 months) Quantitative Finance; Programming Skills Product Counseling Regulatory Compliance Contract Negotiation Information Technology Data Privacy Intellectual Property Licensing New Technology... Clean Energy... Consumer Electronics Business Strategy Internet Services Skills  Product Counseling Regulatory Compliance Contract Negotiation Information Technology Data Privacy Intellectual Property Licensing New Technology... Clean Energy... Consumer Electronics Business Strategy Internet Services Product Counseling Regulatory Compliance Contract Negotiation Information Technology Data Privacy Intellectual Property Licensing New Technology... Clean Energy... Consumer Electronics Business Strategy Internet Services Product Counseling Regulatory Compliance Contract Negotiation Information Technology Data Privacy Intellectual Property Licensing New Technology... Clean Energy... Consumer Electronics Business Strategy Internet Services Education Harvard Law School Doctor of Law (JD) 2005  – 2008 Activities and Societies:  Journal of Law and Technology ,  Harvard Defenders ,  Berkman Center for Internet & Society Harvard University AM,  Astronomy 1998  – 2003 Activities and Societies:  NSF Graduate Student Research Fellow Yale University BS, magna cum laude,  Physics 1994  – 1998 Activities and Societies:  Phi Beta Kappa Harvard Law School Doctor of Law (JD) 2005  – 2008 Activities and Societies:  Journal of Law and Technology ,  Harvard Defenders ,  Berkman Center for Internet & Society Harvard Law School Doctor of Law (JD) 2005  – 2008 Activities and Societies:  Journal of Law and Technology ,  Harvard Defenders ,  Berkman Center for Internet & Society Harvard Law School Doctor of Law (JD) 2005  – 2008 Activities and Societies:  Journal of Law and Technology ,  Harvard Defenders ,  Berkman Center for Internet & Society Harvard University AM,  Astronomy 1998  – 2003 Activities and Societies:  NSF Graduate Student Research Fellow Harvard University AM,  Astronomy 1998  – 2003 Activities and Societies:  NSF Graduate Student Research Fellow Harvard University AM,  Astronomy 1998  – 2003 Activities and Societies:  NSF Graduate Student Research Fellow Yale University BS, magna cum laude,  Physics 1994  – 1998 Activities and Societies:  Phi Beta Kappa Yale University BS, magna cum laude,  Physics 1994  – 1998 Activities and Societies:  Phi Beta Kappa Yale University BS, magna cum laude,  Physics 1994  – 1998 Activities and Societies:  Phi Beta Kappa ", "Skills Intellectual Property Digital Marketing Licensing Skills  Intellectual Property Digital Marketing Licensing Intellectual Property Digital Marketing Licensing Intellectual Property Digital Marketing Licensing ", "Skills Strategic Partnerships Business Development Corporate Development Partnerships Asia Pacific Start-ups E-commerce Digital Media Online Advertising Mobile Devices Digital Marketing Product Management Skills  Strategic Partnerships Business Development Corporate Development Partnerships Asia Pacific Start-ups E-commerce Digital Media Online Advertising Mobile Devices Digital Marketing Product Management Strategic Partnerships Business Development Corporate Development Partnerships Asia Pacific Start-ups E-commerce Digital Media Online Advertising Mobile Devices Digital Marketing Product Management Strategic Partnerships Business Development Corporate Development Partnerships Asia Pacific Start-ups E-commerce Digital Media Online Advertising Mobile Devices Digital Marketing Product Management ", "Experience Senior Counsel Google, Inc May 2010  – Present (5 years 4 months) Head of Commercial for Latin America. Product advice on regional localizations. General legal advice for regional offices. Corporate Counsel Google Inc 2008  –  2010  (2 years) Associate Corporate Counsel Google Inc 2006  –  2008  (2 years) Gould Program for Negotiation and Mediation Stanford University 2002  –  2004  (2 years) Associate Counsel Morales, Noguera, Valdivieso & Besa 1998  –  1999  (1 year) Senior Counsel Google, Inc May 2010  – Present (5 years 4 months) Head of Commercial for Latin America. Product advice on regional localizations. General legal advice for regional offices. Senior Counsel Google, Inc May 2010  – Present (5 years 4 months) Head of Commercial for Latin America. Product advice on regional localizations. General legal advice for regional offices. Corporate Counsel Google Inc 2008  –  2010  (2 years) Corporate Counsel Google Inc 2008  –  2010  (2 years) Associate Corporate Counsel Google Inc 2006  –  2008  (2 years) Associate Corporate Counsel Google Inc 2006  –  2008  (2 years) Gould Program for Negotiation and Mediation Stanford University 2002  –  2004  (2 years) Gould Program for Negotiation and Mediation Stanford University 2002  –  2004  (2 years) Associate Counsel Morales, Noguera, Valdivieso & Besa 1998  –  1999  (1 year) Associate Counsel Morales, Noguera, Valdivieso & Besa 1998  –  1999  (1 year) Languages Spanish Spanish Spanish Skills Privacy Intellectual Property Licensing International Law Corporate Law International agreements Skills  Privacy Intellectual Property Licensing International Law Corporate Law International agreements Privacy Intellectual Property Licensing International Law Corporate Law International agreements Privacy Intellectual Property Licensing International Law Corporate Law International agreements Education Stanford University JSM,  Law 2002  – 2003 University of California, Berkeley - School of Law LL.M.,  Law 2000  – 2001 Pontificia Universidad Católica de Chile 1990  – 1996 Saint George's College Stanford University JSM,  Law 2002  – 2003 Stanford University JSM,  Law 2002  – 2003 Stanford University JSM,  Law 2002  – 2003 University of California, Berkeley - School of Law LL.M.,  Law 2000  – 2001 University of California, Berkeley - School of Law LL.M.,  Law 2000  – 2001 University of California, Berkeley - School of Law LL.M.,  Law 2000  – 2001 Pontificia Universidad Católica de Chile 1990  – 1996 Pontificia Universidad Católica de Chile 1990  – 1996 Pontificia Universidad Católica de Chile 1990  – 1996 Saint George's College Saint George's College Saint George's College ", "Experience Associate Corporate Counsel Google December 2013  – Present (1 year 9 months) Commercial Counsel for Google Apps Corporate Counsel Symantec August 2010  –  December 2013  (3 years 5 months) Commercial Counsel for Norton Partnerships, eCommerce and Enterprise Verticals Legal Counsel Adobe Systems November 2008  –  August 2010  (1 year 10 months) Mobile Product and Commercial Counsel Associate Corporate Counsel Google December 2013  – Present (1 year 9 months) Commercial Counsel for Google Apps Associate Corporate Counsel Google December 2013  – Present (1 year 9 months) Commercial Counsel for Google Apps Corporate Counsel Symantec August 2010  –  December 2013  (3 years 5 months) Commercial Counsel for Norton Partnerships, eCommerce and Enterprise Verticals Corporate Counsel Symantec August 2010  –  December 2013  (3 years 5 months) Commercial Counsel for Norton Partnerships, eCommerce and Enterprise Verticals Legal Counsel Adobe Systems November 2008  –  August 2010  (1 year 10 months) Mobile Product and Commercial Counsel Legal Counsel Adobe Systems November 2008  –  August 2010  (1 year 10 months) Mobile Product and Commercial Counsel Languages Cantonese Cantonese Cantonese Skills Intellectual Property Licensing Software Licensing Legal Research Trademarks Copyright Law Contract Law Contract Negotiation Enterprise Software Skills  Intellectual Property Licensing Software Licensing Legal Research Trademarks Copyright Law Contract Law Contract Negotiation Enterprise Software Intellectual Property Licensing Software Licensing Legal Research Trademarks Copyright Law Contract Law Contract Negotiation Enterprise Software Intellectual Property Licensing Software Licensing Legal Research Trademarks Copyright Law Contract Law Contract Negotiation Enterprise Software Education University of San Francisco School of Law JD 2004  – 2007 University of California, Davis BA,  Economics and Political Science 1999  – 2004 Lowell High School 1995  – 1999 University of San Francisco School of Law JD 2004  – 2007 University of San Francisco School of Law JD 2004  – 2007 University of San Francisco School of Law JD 2004  – 2007 University of California, Davis BA,  Economics and Political Science 1999  – 2004 University of California, Davis BA,  Economics and Political Science 1999  – 2004 University of California, Davis BA,  Economics and Political Science 1999  – 2004 Lowell High School 1995  – 1999 Lowell High School 1995  – 1999 Lowell High School 1995  – 1999 ", "Experience Associate Corporate Counsel Google December 2014  – Present (9 months) São Paulo Area, Brazil Senior Contracts Manager Google May 2011  –  December 2014  (3 years 8 months) Part of the commercial legal team for LATAM. Lawyer Coimbra, Focaccia, Lebrão e Advogados August 2008  –  April 2011  (2 years 9 months) Legal consultancy for marketing agencies, mobile marketing, mobile providers and foreigners startups in Brazil. Academical monitor Fundação Getulio Vargas July 2006  –  December 2008  (2 years 6 months) Providing academic suppport for teachers and coordenator for course of \"Estratégias Processuais na Advocacia Empresarial\"- GVLaw extention program. Trainee Rayes, Fagundes e Oliveira Ramos Advogados Associados May 2008  –  August 2008  (4 months) Litigation area, specially consumers complaints of food companies and ISP. Trainee Dinamarco & Rossi Advogados March 2005  –  May 2008  (3 years 3 months) Corporate litigation area, specially high courts appeals. Associate Corporate Counsel Google December 2014  – Present (9 months) São Paulo Area, Brazil Associate Corporate Counsel Google December 2014  – Present (9 months) São Paulo Area, Brazil Senior Contracts Manager Google May 2011  –  December 2014  (3 years 8 months) Part of the commercial legal team for LATAM. Senior Contracts Manager Google May 2011  –  December 2014  (3 years 8 months) Part of the commercial legal team for LATAM. Lawyer Coimbra, Focaccia, Lebrão e Advogados August 2008  –  April 2011  (2 years 9 months) Legal consultancy for marketing agencies, mobile marketing, mobile providers and foreigners startups in Brazil. Lawyer Coimbra, Focaccia, Lebrão e Advogados August 2008  –  April 2011  (2 years 9 months) Legal consultancy for marketing agencies, mobile marketing, mobile providers and foreigners startups in Brazil. Academical monitor Fundação Getulio Vargas July 2006  –  December 2008  (2 years 6 months) Providing academic suppport for teachers and coordenator for course of \"Estratégias Processuais na Advocacia Empresarial\"- GVLaw extention program. Academical monitor Fundação Getulio Vargas July 2006  –  December 2008  (2 years 6 months) Providing academic suppport for teachers and coordenator for course of \"Estratégias Processuais na Advocacia Empresarial\"- GVLaw extention program. Trainee Rayes, Fagundes e Oliveira Ramos Advogados Associados May 2008  –  August 2008  (4 months) Litigation area, specially consumers complaints of food companies and ISP. Trainee Rayes, Fagundes e Oliveira Ramos Advogados Associados May 2008  –  August 2008  (4 months) Litigation area, specially consumers complaints of food companies and ISP. Trainee Dinamarco & Rossi Advogados March 2005  –  May 2008  (3 years 3 months) Corporate litigation area, specially high courts appeals. Trainee Dinamarco & Rossi Advogados March 2005  –  May 2008  (3 years 3 months) Corporate litigation area, specially high courts appeals. Languages Inglês Native or bilingual proficiency Português Native or bilingual proficiency Inglês Native or bilingual proficiency Português Native or bilingual proficiency Inglês Native or bilingual proficiency Português Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Corporate Law Legal Assistance Intellectual Property Start-ups Litigation Legal Research Courts Commercial Litigation Corporate Governance Legal Advice Due Diligence Administrative Law Licensing Competition Law International Law Cyberlaw Civil Litigation Negotiation Mobile Devices IT law Consumer Law IT Law See 7+     See less Skills  Corporate Law Legal Assistance Intellectual Property Start-ups Litigation Legal Research Courts Commercial Litigation Corporate Governance Legal Advice Due Diligence Administrative Law Licensing Competition Law International Law Cyberlaw Civil Litigation Negotiation Mobile Devices IT law Consumer Law IT Law See 7+     See less Corporate Law Legal Assistance Intellectual Property Start-ups Litigation Legal Research Courts Commercial Litigation Corporate Governance Legal Advice Due Diligence Administrative Law Licensing Competition Law International Law Cyberlaw Civil Litigation Negotiation Mobile Devices IT law Consumer Law IT Law See 7+     See less Corporate Law Legal Assistance Intellectual Property Start-ups Litigation Legal Research Courts Commercial Litigation Corporate Governance Legal Advice Due Diligence Administrative Law Licensing Competition Law International Law Cyberlaw Civil Litigation Negotiation Mobile Devices IT law Consumer Law IT Law See 7+     See less Education GVLaw Post-Graduation (lato sensu),  Contracts 2012  – 2013 Course focused in corporate-related contracts. Universidade de São Paulo Bachelor's degree,  Law 2004  – 2008 GVLaw Post-Graduation (lato sensu),  Contracts 2012  – 2013 Course focused in corporate-related contracts. GVLaw Post-Graduation (lato sensu),  Contracts 2012  – 2013 Course focused in corporate-related contracts. GVLaw Post-Graduation (lato sensu),  Contracts 2012  – 2013 Course focused in corporate-related contracts. Universidade de São Paulo Bachelor's degree,  Law 2004  – 2008 Universidade de São Paulo Bachelor's degree,  Law 2004  – 2008 Universidade de São Paulo Bachelor's degree,  Law 2004  – 2008 ", "Skills Litigation Political Law public policy Technology Corporate Law Corporate Governance Politics Corporate Social... Federal Government State Government Local Government Political Campaigns Policy Government Legislation Skills  Litigation Political Law public policy Technology Corporate Law Corporate Governance Politics Corporate Social... Federal Government State Government Local Government Political Campaigns Policy Government Legislation Litigation Political Law public policy Technology Corporate Law Corporate Governance Politics Corporate Social... Federal Government State Government Local Government Political Campaigns Policy Government Legislation Litigation Political Law public policy Technology Corporate Law Corporate Governance Politics Corporate Social... Federal Government State Government Local Government Political Campaigns Policy Government Legislation ", "Summary Attorney specializing in mergers and acquisitions. Wide-ranging exposure in assisting public and private company clients with general corporate, governance and disclosure practices, including compliance with the requirements of state corporate laws, federal securities laws and the rules and regulations of the SEC, the NYSE, Nasdaq and FINRA, as well as advising corporate clients on commercial and IP agreements and private financings. \n \nSpecialties: Mergers and acquisitions Summary Attorney specializing in mergers and acquisitions. Wide-ranging exposure in assisting public and private company clients with general corporate, governance and disclosure practices, including compliance with the requirements of state corporate laws, federal securities laws and the rules and regulations of the SEC, the NYSE, Nasdaq and FINRA, as well as advising corporate clients on commercial and IP agreements and private financings. \n \nSpecialties: Mergers and acquisitions Attorney specializing in mergers and acquisitions. Wide-ranging exposure in assisting public and private company clients with general corporate, governance and disclosure practices, including compliance with the requirements of state corporate laws, federal securities laws and the rules and regulations of the SEC, the NYSE, Nasdaq and FINRA, as well as advising corporate clients on commercial and IP agreements and private financings. \n \nSpecialties: Mergers and acquisitions Attorney specializing in mergers and acquisitions. Wide-ranging exposure in assisting public and private company clients with general corporate, governance and disclosure practices, including compliance with the requirements of state corporate laws, federal securities laws and the rules and regulations of the SEC, the NYSE, Nasdaq and FINRA, as well as advising corporate clients on commercial and IP agreements and private financings. \n \nSpecialties: Mergers and acquisitions Experience Corporate Counsel - Advanced Technology and Products (ATAP) Google November 2014  – Present (10 months) Secondee - M&A Legal Team Google September 2013  –  October 2014  (1 year 2 months) Mountain View Currently seconded from Wilson Sonsini to Google's M&A legal team. I generally serve as the lead internal counsel for acquisitions, investments and divestitures, working with Google's internal deal team and outside counsel to execute transactions. Associate Wilson Sonsini Goodrich and Rosati April 2011  –  October 2014  (3 years 7 months) Broad experience representing strategic and financial buyers and sellers in public and private mergers, stock and asset acquisitions and divestitures, joint ventures and similar corporate transactions.  \n \nProvide guidance regarding strategic planning, transaction structures, takeover defenses, fiduciary duties and corporate organization. Manage teams of junior associates and specialists in connection with execution of transactions, including supervision of due diligence investigation process, drafting of ancillary documentation and closings. Corporate Associate Davis Polk & Wardwell 2004  –  May 2011  (7 years) Extensive background as lead associate advising in both M&A transactions and public securities offerings of equity and high-yield, investment grade and convertible debt.  \n \nWide-ranging exposure in assisting public and private company clients with general corporate law, corporate governance and disclosure practices, as well as advising corporate clients on private financing arrangements, IP licenses and general commercial agreements. Research Assistant Professor Arthur Miller May 2002  –  June 2004  (2 years 2 months) Worked closely with Professor Miller in updating, revising and composing text for Wright, Miller & Cooper's Federal Practice and Procedure, a leading federal civil procedure treatise. Aided in the research and drafting of Mr. Miller's academic law article. Corporate Project Assistant Ater Wynne LLP November 2000  –  June 2001  (8 months) Provided support for a team of corporate partners and associates on business transactions. Reorganized and updated a four-year backlog of corporate governance materials for 200+ corporate clients. Created and implemented a system of tracking stock and other equity holders of corporate clients. Intern, Office of Counsel to the President The White House, Washington D.C. May 1997  –  August 1997  (4 months) Conducted extensive research on substantive legal issues, including developing and presenting materials relating to campaign finance hearings in both branches of Congress. Assisted legal counsel in arranging, preparing and delivering subpoenaed material to the U.S. Senate and House Judiciary Committees. Corporate Counsel - Advanced Technology and Products (ATAP) Google November 2014  – Present (10 months) Corporate Counsel - Advanced Technology and Products (ATAP) Google November 2014  – Present (10 months) Secondee - M&A Legal Team Google September 2013  –  October 2014  (1 year 2 months) Mountain View Currently seconded from Wilson Sonsini to Google's M&A legal team. I generally serve as the lead internal counsel for acquisitions, investments and divestitures, working with Google's internal deal team and outside counsel to execute transactions. Secondee - M&A Legal Team Google September 2013  –  October 2014  (1 year 2 months) Mountain View Currently seconded from Wilson Sonsini to Google's M&A legal team. I generally serve as the lead internal counsel for acquisitions, investments and divestitures, working with Google's internal deal team and outside counsel to execute transactions. Associate Wilson Sonsini Goodrich and Rosati April 2011  –  October 2014  (3 years 7 months) Broad experience representing strategic and financial buyers and sellers in public and private mergers, stock and asset acquisitions and divestitures, joint ventures and similar corporate transactions.  \n \nProvide guidance regarding strategic planning, transaction structures, takeover defenses, fiduciary duties and corporate organization. Manage teams of junior associates and specialists in connection with execution of transactions, including supervision of due diligence investigation process, drafting of ancillary documentation and closings. Associate Wilson Sonsini Goodrich and Rosati April 2011  –  October 2014  (3 years 7 months) Broad experience representing strategic and financial buyers and sellers in public and private mergers, stock and asset acquisitions and divestitures, joint ventures and similar corporate transactions.  \n \nProvide guidance regarding strategic planning, transaction structures, takeover defenses, fiduciary duties and corporate organization. Manage teams of junior associates and specialists in connection with execution of transactions, including supervision of due diligence investigation process, drafting of ancillary documentation and closings. Corporate Associate Davis Polk & Wardwell 2004  –  May 2011  (7 years) Extensive background as lead associate advising in both M&A transactions and public securities offerings of equity and high-yield, investment grade and convertible debt.  \n \nWide-ranging exposure in assisting public and private company clients with general corporate law, corporate governance and disclosure practices, as well as advising corporate clients on private financing arrangements, IP licenses and general commercial agreements. Corporate Associate Davis Polk & Wardwell 2004  –  May 2011  (7 years) Extensive background as lead associate advising in both M&A transactions and public securities offerings of equity and high-yield, investment grade and convertible debt.  \n \nWide-ranging exposure in assisting public and private company clients with general corporate law, corporate governance and disclosure practices, as well as advising corporate clients on private financing arrangements, IP licenses and general commercial agreements. Research Assistant Professor Arthur Miller May 2002  –  June 2004  (2 years 2 months) Worked closely with Professor Miller in updating, revising and composing text for Wright, Miller & Cooper's Federal Practice and Procedure, a leading federal civil procedure treatise. Aided in the research and drafting of Mr. Miller's academic law article. Research Assistant Professor Arthur Miller May 2002  –  June 2004  (2 years 2 months) Worked closely with Professor Miller in updating, revising and composing text for Wright, Miller & Cooper's Federal Practice and Procedure, a leading federal civil procedure treatise. Aided in the research and drafting of Mr. Miller's academic law article. Corporate Project Assistant Ater Wynne LLP November 2000  –  June 2001  (8 months) Provided support for a team of corporate partners and associates on business transactions. Reorganized and updated a four-year backlog of corporate governance materials for 200+ corporate clients. Created and implemented a system of tracking stock and other equity holders of corporate clients. Corporate Project Assistant Ater Wynne LLP November 2000  –  June 2001  (8 months) Provided support for a team of corporate partners and associates on business transactions. Reorganized and updated a four-year backlog of corporate governance materials for 200+ corporate clients. Created and implemented a system of tracking stock and other equity holders of corporate clients. Intern, Office of Counsel to the President The White House, Washington D.C. May 1997  –  August 1997  (4 months) Conducted extensive research on substantive legal issues, including developing and presenting materials relating to campaign finance hearings in both branches of Congress. Assisted legal counsel in arranging, preparing and delivering subpoenaed material to the U.S. Senate and House Judiciary Committees. Intern, Office of Counsel to the President The White House, Washington D.C. May 1997  –  August 1997  (4 months) Conducted extensive research on substantive legal issues, including developing and presenting materials relating to campaign finance hearings in both branches of Congress. Assisted legal counsel in arranging, preparing and delivering subpoenaed material to the U.S. Senate and House Judiciary Committees. Skills Securities Regulation Litigation Mergers Corporate Law Corporate Governance Due Diligence Intellectual Property Mergers & Acquisitions Research Joint Ventures Licensing Legal Writing Acquisitions Strategy Cross-border... Legal Advice Securities See 2+     See less Skills  Securities Regulation Litigation Mergers Corporate Law Corporate Governance Due Diligence Intellectual Property Mergers & Acquisitions Research Joint Ventures Licensing Legal Writing Acquisitions Strategy Cross-border... Legal Advice Securities See 2+     See less Securities Regulation Litigation Mergers Corporate Law Corporate Governance Due Diligence Intellectual Property Mergers & Acquisitions Research Joint Ventures Licensing Legal Writing Acquisitions Strategy Cross-border... Legal Advice Securities See 2+     See less Securities Regulation Litigation Mergers Corporate Law Corporate Governance Due Diligence Intellectual Property Mergers & Acquisitions Research Joint Ventures Licensing Legal Writing Acquisitions Strategy Cross-border... Legal Advice Securities See 2+     See less Education New York University School of Law JD 2001  – 2004 Activities and Societies:  Robert McKay Scholar; Articles Editor ,  Annual Survey of American Law; Secretary ,  Small Business Law Connection ,  2002-2004 University of Oregon Bachelor of Arts,  Political Science 1996  – 2000 Activities and Societies:  Honors thesis: Problems with Campaign Finance Reform\nPolitical Science Peer Counselor\nOregon Club Baseball The Catlin Gabel School 1994  – 1996 Jesuit High School, Portland Oregon 1992  – 1994 New York University School of Law JD 2001  – 2004 Activities and Societies:  Robert McKay Scholar; Articles Editor ,  Annual Survey of American Law; Secretary ,  Small Business Law Connection ,  2002-2004 New York University School of Law JD 2001  – 2004 Activities and Societies:  Robert McKay Scholar; Articles Editor ,  Annual Survey of American Law; Secretary ,  Small Business Law Connection ,  2002-2004 New York University School of Law JD 2001  – 2004 Activities and Societies:  Robert McKay Scholar; Articles Editor ,  Annual Survey of American Law; Secretary ,  Small Business Law Connection ,  2002-2004 University of Oregon Bachelor of Arts,  Political Science 1996  – 2000 Activities and Societies:  Honors thesis: Problems with Campaign Finance Reform\nPolitical Science Peer Counselor\nOregon Club Baseball University of Oregon Bachelor of Arts,  Political Science 1996  – 2000 Activities and Societies:  Honors thesis: Problems with Campaign Finance Reform\nPolitical Science Peer Counselor\nOregon Club Baseball University of Oregon Bachelor of Arts,  Political Science 1996  – 2000 Activities and Societies:  Honors thesis: Problems with Campaign Finance Reform\nPolitical Science Peer Counselor\nOregon Club Baseball The Catlin Gabel School 1994  – 1996 The Catlin Gabel School 1994  – 1996 The Catlin Gabel School 1994  – 1996 Jesuit High School, Portland Oregon 1992  – 1994 Jesuit High School, Portland Oregon 1992  – 1994 Jesuit High School, Portland Oregon 1992  – 1994 Honors & Awards Northern California Rising Star Super Lawyers Named to Super Lawyer's Northern California Rising Stars list 2010, 2012 and 2013 Northern California Rising Star Super Lawyers Named to Super Lawyer's Northern California Rising Stars list 2010, 2012 and 2013 Northern California Rising Star Super Lawyers Named to Super Lawyer's Northern California Rising Stars list 2010, 2012 and 2013 Northern California Rising Star Super Lawyers Named to Super Lawyer's Northern California Rising Stars list 2010, 2012 and 2013 "]}