{"position": "Creative", "company": "Google", "profiles": ["Experience Freelance Creative at Google Creative Labs Google February 2015  – Present (7 months) Greater New York City Area Creative Mother June 2014  –  February 2015  (9 months) Greater New York City Area Creative Intern AKQA May 2013  –  August 2013  (4 months) san francisco bay area Worked as an Art Director & Designer on Google+, Levi's, and Air Jordan. Director, Products & Marketing and Research Scientist Global Cell Solutions August 2011  –  August 2012  (1 year 1 month) charlottesville, virginia area Emergency Medicine Scribe Best Practices June 2009  –  September 2011  (2 years 4 months) Freelance Creative at Google Creative Labs Google February 2015  – Present (7 months) Greater New York City Area Freelance Creative at Google Creative Labs Google February 2015  – Present (7 months) Greater New York City Area Creative Mother June 2014  –  February 2015  (9 months) Greater New York City Area Creative Mother June 2014  –  February 2015  (9 months) Greater New York City Area Creative Intern AKQA May 2013  –  August 2013  (4 months) san francisco bay area Worked as an Art Director & Designer on Google+, Levi's, and Air Jordan. Creative Intern AKQA May 2013  –  August 2013  (4 months) san francisco bay area Worked as an Art Director & Designer on Google+, Levi's, and Air Jordan. Director, Products & Marketing and Research Scientist Global Cell Solutions August 2011  –  August 2012  (1 year 1 month) charlottesville, virginia area Director, Products & Marketing and Research Scientist Global Cell Solutions August 2011  –  August 2012  (1 year 1 month) charlottesville, virginia area Emergency Medicine Scribe Best Practices June 2009  –  September 2011  (2 years 4 months) Emergency Medicine Scribe Best Practices June 2009  –  September 2011  (2 years 4 months) Languages Spanish Spanish Spanish Skills Proficient with Mac OS X Windows 7 Adobe Creative Suite Lifesciences Product Development Research Microsoft Excel Product Management Product Marketing Biotechnology Business Development Product Launch Marketing Strategy Cell Culture Marketing Advertising See 1+     See less Skills  Proficient with Mac OS X Windows 7 Adobe Creative Suite Lifesciences Product Development Research Microsoft Excel Product Management Product Marketing Biotechnology Business Development Product Launch Marketing Strategy Cell Culture Marketing Advertising See 1+     See less Proficient with Mac OS X Windows 7 Adobe Creative Suite Lifesciences Product Development Research Microsoft Excel Product Management Product Marketing Biotechnology Business Development Product Launch Marketing Strategy Cell Culture Marketing Advertising See 1+     See less Proficient with Mac OS X Windows 7 Adobe Creative Suite Lifesciences Product Development Research Microsoft Excel Product Management Product Marketing Biotechnology Business Development Product Launch Marketing Strategy Cell Culture Marketing Advertising See 1+     See less Education VCU Brandcenter Master's degree,  Art Direction 2012  – 2014 University of Virginia BA,  Spanish 2005  – 2009 Activities and Societies:  American Medical Student Association ,  Senior Associate Photo Editor for The Cavalier Daily VCU Brandcenter Master's degree,  Art Direction 2012  – 2014 VCU Brandcenter Master's degree,  Art Direction 2012  – 2014 VCU Brandcenter Master's degree,  Art Direction 2012  – 2014 University of Virginia BA,  Spanish 2005  – 2009 Activities and Societies:  American Medical Student Association ,  Senior Associate Photo Editor for The Cavalier Daily University of Virginia BA,  Spanish 2005  – 2009 Activities and Societies:  American Medical Student Association ,  Senior Associate Photo Editor for The Cavalier Daily University of Virginia BA,  Spanish 2005  – 2009 Activities and Societies:  American Medical Student Association ,  Senior Associate Photo Editor for The Cavalier Daily ", "Summary Senior Freelance TV Producer and Consultant. Currently producing for Saatchi & Saatchi London. Summary Senior Freelance TV Producer and Consultant. Currently producing for Saatchi & Saatchi London. Senior Freelance TV Producer and Consultant. Currently producing for Saatchi & Saatchi London. Senior Freelance TV Producer and Consultant. Currently producing for Saatchi & Saatchi London. Experience Senior Producer Freelance Senior Producer at Google Creative Lab through Adecco July 2015  – Present (2 months) London, United Kingdom Producing films for Google Creative Labs Freelance Creative Consultant (ad hoc) ENID London November 2012  – Present (2 years 10 months) Promoting and consulting for the production companies represented by ENID. Freelance Senior Producer Saatchi & Saatchi London February 2015  –  July 2015  (6 months) London, United Kingdom Developing work for Toyota Europe with Juan Cabral and producing films for Toyota Europe with Agustin Alberdi Production Consultant at Google Creative Lab (through Adecco) Google May 2014  –  January 2015  (9 months) London, United Kingdom Producing and consulting for Creative Labs Freelance Senior TV Producer AMV BBDO January 2013  –  April 2013  (4 months) Work with various clients, including Mars, Mercedes, and Quaker. Freelance Senior TV Producer Havas January 2012  –  January 2013  (1 year 1 month) London Produced Santander TV commercial/ live event/ digital and integrated campaign directed by Finn McGough. Belvita Breakfast Idents directed by Giles Ripley and V05 product demos directed by Tom Kingsley. Co-produced Credit Suisse Titian directed by Tell No One which won Gold in the Craft Awards at Cannes 2013 for Art Direction Jewellery Designer/Silversmith Thumper Green January 2004  –  January 2012  (8 years 1 month) London, United Kingdom Freelance TV Producer EURO RSCG London 2011  –  2012  (1 year) Produced Citroen/An Idiot Abroad Idents directed by Richard Ayoade Freelance Senior TV Producer Mother 2006  –  2011  (5 years) Working on Diet Coke, Yell.com, Stella Artois, Boots, Pimms, Rocky Biscuits amongst other brands. Freelance TV Producer Leo Burnett UK 2006  –  2006  (less than a year) Working on Nintendo and Heathrow Terminal 6. TV Producer HHCL 2004  –  2006  (2 years) Working on Sky TV Producer Saatchi & Saatchi 1998  –  2004  (6 years) Working on Visa, Walk the Walk Charity, Toyota, Carlsberg, Olay Senior Producer Freelance Senior Producer at Google Creative Lab through Adecco July 2015  – Present (2 months) London, United Kingdom Producing films for Google Creative Labs Senior Producer Freelance Senior Producer at Google Creative Lab through Adecco July 2015  – Present (2 months) London, United Kingdom Producing films for Google Creative Labs Freelance Creative Consultant (ad hoc) ENID London November 2012  – Present (2 years 10 months) Promoting and consulting for the production companies represented by ENID. Freelance Creative Consultant (ad hoc) ENID London November 2012  – Present (2 years 10 months) Promoting and consulting for the production companies represented by ENID. Freelance Senior Producer Saatchi & Saatchi London February 2015  –  July 2015  (6 months) London, United Kingdom Developing work for Toyota Europe with Juan Cabral and producing films for Toyota Europe with Agustin Alberdi Freelance Senior Producer Saatchi & Saatchi London February 2015  –  July 2015  (6 months) London, United Kingdom Developing work for Toyota Europe with Juan Cabral and producing films for Toyota Europe with Agustin Alberdi Production Consultant at Google Creative Lab (through Adecco) Google May 2014  –  January 2015  (9 months) London, United Kingdom Producing and consulting for Creative Labs Production Consultant at Google Creative Lab (through Adecco) Google May 2014  –  January 2015  (9 months) London, United Kingdom Producing and consulting for Creative Labs Freelance Senior TV Producer AMV BBDO January 2013  –  April 2013  (4 months) Work with various clients, including Mars, Mercedes, and Quaker. Freelance Senior TV Producer AMV BBDO January 2013  –  April 2013  (4 months) Work with various clients, including Mars, Mercedes, and Quaker. Freelance Senior TV Producer Havas January 2012  –  January 2013  (1 year 1 month) London Produced Santander TV commercial/ live event/ digital and integrated campaign directed by Finn McGough. Belvita Breakfast Idents directed by Giles Ripley and V05 product demos directed by Tom Kingsley. Co-produced Credit Suisse Titian directed by Tell No One which won Gold in the Craft Awards at Cannes 2013 for Art Direction Freelance Senior TV Producer Havas January 2012  –  January 2013  (1 year 1 month) London Produced Santander TV commercial/ live event/ digital and integrated campaign directed by Finn McGough. Belvita Breakfast Idents directed by Giles Ripley and V05 product demos directed by Tom Kingsley. Co-produced Credit Suisse Titian directed by Tell No One which won Gold in the Craft Awards at Cannes 2013 for Art Direction Jewellery Designer/Silversmith Thumper Green January 2004  –  January 2012  (8 years 1 month) London, United Kingdom Jewellery Designer/Silversmith Thumper Green January 2004  –  January 2012  (8 years 1 month) London, United Kingdom Freelance TV Producer EURO RSCG London 2011  –  2012  (1 year) Produced Citroen/An Idiot Abroad Idents directed by Richard Ayoade Freelance TV Producer EURO RSCG London 2011  –  2012  (1 year) Produced Citroen/An Idiot Abroad Idents directed by Richard Ayoade Freelance Senior TV Producer Mother 2006  –  2011  (5 years) Working on Diet Coke, Yell.com, Stella Artois, Boots, Pimms, Rocky Biscuits amongst other brands. Freelance Senior TV Producer Mother 2006  –  2011  (5 years) Working on Diet Coke, Yell.com, Stella Artois, Boots, Pimms, Rocky Biscuits amongst other brands. Freelance TV Producer Leo Burnett UK 2006  –  2006  (less than a year) Working on Nintendo and Heathrow Terminal 6. Freelance TV Producer Leo Burnett UK 2006  –  2006  (less than a year) Working on Nintendo and Heathrow Terminal 6. TV Producer HHCL 2004  –  2006  (2 years) Working on Sky TV Producer HHCL 2004  –  2006  (2 years) Working on Sky TV Producer Saatchi & Saatchi 1998  –  2004  (6 years) Working on Visa, Walk the Walk Charity, Toyota, Carlsberg, Olay TV Producer Saatchi & Saatchi 1998  –  2004  (6 years) Working on Visa, Walk the Walk Charity, Toyota, Carlsberg, Olay Skills Creative Direction Television Advertising Creative Strategy Video Production Film Digital Strategy Commercials Copywriting New Media Art Direction Digital Media Interactive Advertising Integrated Marketing Skills  Creative Direction Television Advertising Creative Strategy Video Production Film Digital Strategy Commercials Copywriting New Media Art Direction Digital Media Interactive Advertising Integrated Marketing Creative Direction Television Advertising Creative Strategy Video Production Film Digital Strategy Commercials Copywriting New Media Art Direction Digital Media Interactive Advertising Integrated Marketing Creative Direction Television Advertising Creative Strategy Video Production Film Digital Strategy Commercials Copywriting New Media Art Direction Digital Media Interactive Advertising Integrated Marketing Education ... ... ... ... ", "Summary Currently, I enjoy heading a stellar creative department and leading creative from concept to product. I'm an integrated creative that combines digital, print, experiential, social and video. Recently, I've had the pleasure of working with Bombay Sapphire, TriBeCa Film Festival, Mumm Napa, J.P. Wiser's, Bacardi, Uncommon, Oxley and D'Usse.  \n \nFor over 15 years, I've run lean as a sole creative and flush as an integral member of a team. I've tackled packaging, liquor, entertainment, branding and pharma. I've strategized for new pitches, designed cohesive multi-channel tactics, videos, games, apps, websites and paid media, run a nationally-distributed literary and art magazine, concepted new business and product launch materials, and created sales and branding materials. \n \nSpecialties:  \nCreative and art direction \nIntegrated campaign concepts & strategy \nCreative ideation, look & feel and design  \nDevice agnostic web design \nApp design \nVideo concepts and storyboards \nBranding \nDigital Art creation \nGame and puzzle concepts  \nCS suite Summary Currently, I enjoy heading a stellar creative department and leading creative from concept to product. I'm an integrated creative that combines digital, print, experiential, social and video. Recently, I've had the pleasure of working with Bombay Sapphire, TriBeCa Film Festival, Mumm Napa, J.P. Wiser's, Bacardi, Uncommon, Oxley and D'Usse.  \n \nFor over 15 years, I've run lean as a sole creative and flush as an integral member of a team. I've tackled packaging, liquor, entertainment, branding and pharma. I've strategized for new pitches, designed cohesive multi-channel tactics, videos, games, apps, websites and paid media, run a nationally-distributed literary and art magazine, concepted new business and product launch materials, and created sales and branding materials. \n \nSpecialties:  \nCreative and art direction \nIntegrated campaign concepts & strategy \nCreative ideation, look & feel and design  \nDevice agnostic web design \nApp design \nVideo concepts and storyboards \nBranding \nDigital Art creation \nGame and puzzle concepts  \nCS suite Currently, I enjoy heading a stellar creative department and leading creative from concept to product. I'm an integrated creative that combines digital, print, experiential, social and video. Recently, I've had the pleasure of working with Bombay Sapphire, TriBeCa Film Festival, Mumm Napa, J.P. Wiser's, Bacardi, Uncommon, Oxley and D'Usse.  \n \nFor over 15 years, I've run lean as a sole creative and flush as an integral member of a team. I've tackled packaging, liquor, entertainment, branding and pharma. I've strategized for new pitches, designed cohesive multi-channel tactics, videos, games, apps, websites and paid media, run a nationally-distributed literary and art magazine, concepted new business and product launch materials, and created sales and branding materials. \n \nSpecialties:  \nCreative and art direction \nIntegrated campaign concepts & strategy \nCreative ideation, look & feel and design  \nDevice agnostic web design \nApp design \nVideo concepts and storyboards \nBranding \nDigital Art creation \nGame and puzzle concepts  \nCS suite Currently, I enjoy heading a stellar creative department and leading creative from concept to product. I'm an integrated creative that combines digital, print, experiential, social and video. Recently, I've had the pleasure of working with Bombay Sapphire, TriBeCa Film Festival, Mumm Napa, J.P. Wiser's, Bacardi, Uncommon, Oxley and D'Usse.  \n \nFor over 15 years, I've run lean as a sole creative and flush as an integral member of a team. I've tackled packaging, liquor, entertainment, branding and pharma. I've strategized for new pitches, designed cohesive multi-channel tactics, videos, games, apps, websites and paid media, run a nationally-distributed literary and art magazine, concepted new business and product launch materials, and created sales and branding materials. \n \nSpecialties:  \nCreative and art direction \nIntegrated campaign concepts & strategy \nCreative ideation, look & feel and design  \nDevice agnostic web design \nApp design \nVideo concepts and storyboards \nBranding \nDigital Art creation \nGame and puzzle concepts  \nCS suite Experience Creative Overthinking November 2012  – Present (2 years 10 months) Short description:  \nThink it. Visualize it. Make it. Burn with creative fire. \n \nLong description: \nResponsible for the creation and management of creative from concept to completion. Concepts, creates look & feel and designs elements for all digital platforms including apps, websites and paid media, as well as for more traditional forms of media, including print, OOH, and video. Plans brand experiences via UX, wireframes, and interaction design as well as user flow for multi-channel programs. Works with Strategists to develop top level strategy and pitch ideation. Directs Art Directors, Designers and Developers to accomplish Creative needs. Freelance Creative / Designer Freelance Graphic Design January 2012  –  November 2012  (11 months) NYC Clients: Bacardi, Wrigley, Novartis, Google Creative Labs, & others \n \nConcepting tactics involving digital, social and print for integration into overall brand/goal strategy. \n \nCreating look and feel from overall brand guides to specific tactics.  \n \nLeading small teams of creatives and/or production artists. \n \nProviding clients with timely, goal-driven and thought-provoking solutions. \n \nDesigned a web-based casual puzzle game, that is currently on facebook: http://apps.facebook.com/mindjolt/games/the-calendar Design Group Specialist / Interactive Art Director LLNS September 2010  –  January 2012  (1 year 5 months) Concepting and creating digital artwork for print and interactive channels.  \n \nCreating look and feel of project individual aspects and contributing to overall project look and feel. \n \nMoving projects through all stages: from creation and art direction to print/interactive production to prepress or development, all while keeping project on track, cohesive and consistant. \n \nSupport both creative and production arms of LLNS with technical skills and design knowledge.  Design Group Specialist LyonHeart 2007  –  2010  (3 years) Art Director/Designer Campfire January 2009  –  April 2009  (4 months) Project: SXSW panel \"Living in Your Own Branded Entertainment Experience\" \n \n-- Concepted and designed all promotional materials including digital assets, buttons and flyers \n-- Concepted and created puzzle to initially trigger audience engagement Writer/Actor Campfire May 2008  –  August 2008  (4 months) Project: HBO True Blood Campaign \n \n-- Wrote as multiple vampire characters for public forum \n-- Acted in \"Gateway\" video for online/social puzzle Design Group Specialist LLNS 2002  –  September 2007  (5 years) Art Director/Designer Campfire March 2007  –  August 2007  (6 months) Project: Pontiac/Maxim \"Motorati Island\" Campaign \n \n-- Concepted and designed \"Motorati Island\" passport \n-- Designed \"Motorati Island\" online tie-in for Maxim's Hot 100 \n-- Created additional support materials for ongoing interactive/social campaign Designer Campfire May 2005  –  October 2005  (6 months) Project: Audi \"Art of the Heist\" Campaign \n \n-- Created digital support materials for integrated campaign Creative Overthinking November 2012  – Present (2 years 10 months) Short description:  \nThink it. Visualize it. Make it. Burn with creative fire. \n \nLong description: \nResponsible for the creation and management of creative from concept to completion. Concepts, creates look & feel and designs elements for all digital platforms including apps, websites and paid media, as well as for more traditional forms of media, including print, OOH, and video. Plans brand experiences via UX, wireframes, and interaction design as well as user flow for multi-channel programs. Works with Strategists to develop top level strategy and pitch ideation. Directs Art Directors, Designers and Developers to accomplish Creative needs. Creative Overthinking November 2012  – Present (2 years 10 months) Short description:  \nThink it. Visualize it. Make it. Burn with creative fire. \n \nLong description: \nResponsible for the creation and management of creative from concept to completion. Concepts, creates look & feel and designs elements for all digital platforms including apps, websites and paid media, as well as for more traditional forms of media, including print, OOH, and video. Plans brand experiences via UX, wireframes, and interaction design as well as user flow for multi-channel programs. Works with Strategists to develop top level strategy and pitch ideation. Directs Art Directors, Designers and Developers to accomplish Creative needs. Freelance Creative / Designer Freelance Graphic Design January 2012  –  November 2012  (11 months) NYC Clients: Bacardi, Wrigley, Novartis, Google Creative Labs, & others \n \nConcepting tactics involving digital, social and print for integration into overall brand/goal strategy. \n \nCreating look and feel from overall brand guides to specific tactics.  \n \nLeading small teams of creatives and/or production artists. \n \nProviding clients with timely, goal-driven and thought-provoking solutions. \n \nDesigned a web-based casual puzzle game, that is currently on facebook: http://apps.facebook.com/mindjolt/games/the-calendar Freelance Creative / Designer Freelance Graphic Design January 2012  –  November 2012  (11 months) NYC Clients: Bacardi, Wrigley, Novartis, Google Creative Labs, & others \n \nConcepting tactics involving digital, social and print for integration into overall brand/goal strategy. \n \nCreating look and feel from overall brand guides to specific tactics.  \n \nLeading small teams of creatives and/or production artists. \n \nProviding clients with timely, goal-driven and thought-provoking solutions. \n \nDesigned a web-based casual puzzle game, that is currently on facebook: http://apps.facebook.com/mindjolt/games/the-calendar Design Group Specialist / Interactive Art Director LLNS September 2010  –  January 2012  (1 year 5 months) Concepting and creating digital artwork for print and interactive channels.  \n \nCreating look and feel of project individual aspects and contributing to overall project look and feel. \n \nMoving projects through all stages: from creation and art direction to print/interactive production to prepress or development, all while keeping project on track, cohesive and consistant. \n \nSupport both creative and production arms of LLNS with technical skills and design knowledge.  Design Group Specialist / Interactive Art Director LLNS September 2010  –  January 2012  (1 year 5 months) Concepting and creating digital artwork for print and interactive channels.  \n \nCreating look and feel of project individual aspects and contributing to overall project look and feel. \n \nMoving projects through all stages: from creation and art direction to print/interactive production to prepress or development, all while keeping project on track, cohesive and consistant. \n \nSupport both creative and production arms of LLNS with technical skills and design knowledge.  Design Group Specialist LyonHeart 2007  –  2010  (3 years) Design Group Specialist LyonHeart 2007  –  2010  (3 years) Art Director/Designer Campfire January 2009  –  April 2009  (4 months) Project: SXSW panel \"Living in Your Own Branded Entertainment Experience\" \n \n-- Concepted and designed all promotional materials including digital assets, buttons and flyers \n-- Concepted and created puzzle to initially trigger audience engagement Art Director/Designer Campfire January 2009  –  April 2009  (4 months) Project: SXSW panel \"Living in Your Own Branded Entertainment Experience\" \n \n-- Concepted and designed all promotional materials including digital assets, buttons and flyers \n-- Concepted and created puzzle to initially trigger audience engagement Writer/Actor Campfire May 2008  –  August 2008  (4 months) Project: HBO True Blood Campaign \n \n-- Wrote as multiple vampire characters for public forum \n-- Acted in \"Gateway\" video for online/social puzzle Writer/Actor Campfire May 2008  –  August 2008  (4 months) Project: HBO True Blood Campaign \n \n-- Wrote as multiple vampire characters for public forum \n-- Acted in \"Gateway\" video for online/social puzzle Design Group Specialist LLNS 2002  –  September 2007  (5 years) Design Group Specialist LLNS 2002  –  September 2007  (5 years) Art Director/Designer Campfire March 2007  –  August 2007  (6 months) Project: Pontiac/Maxim \"Motorati Island\" Campaign \n \n-- Concepted and designed \"Motorati Island\" passport \n-- Designed \"Motorati Island\" online tie-in for Maxim's Hot 100 \n-- Created additional support materials for ongoing interactive/social campaign Art Director/Designer Campfire March 2007  –  August 2007  (6 months) Project: Pontiac/Maxim \"Motorati Island\" Campaign \n \n-- Concepted and designed \"Motorati Island\" passport \n-- Designed \"Motorati Island\" online tie-in for Maxim's Hot 100 \n-- Created additional support materials for ongoing interactive/social campaign Designer Campfire May 2005  –  October 2005  (6 months) Project: Audi \"Art of the Heist\" Campaign \n \n-- Created digital support materials for integrated campaign Designer Campfire May 2005  –  October 2005  (6 months) Project: Audi \"Art of the Heist\" Campaign \n \n-- Created digital support materials for integrated campaign Skills Art Direction Graphic Design Web Design Logo Design Branding & Identity Photoshop Illustrator InDesign Adobe Creative Suite High-end Retouching Casual Game Design Puzzle Concepts Tactical Planning Small Group Management Sketching Acrylic Painting Conceptual Art Video Flash User Interface Design Integrated Marketing Advertising Interactive Advertising Image Manipulation User Experience Interaction Design Typography Dreamweaver Packaging Creative Direction See 15+     See less Skills  Art Direction Graphic Design Web Design Logo Design Branding & Identity Photoshop Illustrator InDesign Adobe Creative Suite High-end Retouching Casual Game Design Puzzle Concepts Tactical Planning Small Group Management Sketching Acrylic Painting Conceptual Art Video Flash User Interface Design Integrated Marketing Advertising Interactive Advertising Image Manipulation User Experience Interaction Design Typography Dreamweaver Packaging Creative Direction See 15+     See less Art Direction Graphic Design Web Design Logo Design Branding & Identity Photoshop Illustrator InDesign Adobe Creative Suite High-end Retouching Casual Game Design Puzzle Concepts Tactical Planning Small Group Management Sketching Acrylic Painting Conceptual Art Video Flash User Interface Design Integrated Marketing Advertising Interactive Advertising Image Manipulation User Experience Interaction Design Typography Dreamweaver Packaging Creative Direction See 15+     See less Art Direction Graphic Design Web Design Logo Design Branding & Identity Photoshop Illustrator InDesign Adobe Creative Suite High-end Retouching Casual Game Design Puzzle Concepts Tactical Planning Small Group Management Sketching Acrylic Painting Conceptual Art Video Flash User Interface Design Integrated Marketing Advertising Interactive Advertising Image Manipulation User Experience Interaction Design Typography Dreamweaver Packaging Creative Direction See 15+     See less Education University of Colorado at Denver University of Colorado at Denver University of Colorado at Denver University of Colorado at Denver ", "Summary Specialties:I specialize in creative interactive design of all types. Including web, IOS, Arduino, and motion design. Summary Specialties:I specialize in creative interactive design of all types. Including web, IOS, Arduino, and motion design. Specialties:I specialize in creative interactive design of all types. Including web, IOS, Arduino, and motion design. Specialties:I specialize in creative interactive design of all types. Including web, IOS, Arduino, and motion design. Experience Creative Technologist Bossa April 2012  –  March 2015  (3 years) Manhattan Senior Art Director StrawberryFrog January 2011  –  January 2012  (1 year 1 month) Senior Art Director Big Spaceship 2009  –  December 2010  (1 year) Interactive Director Struck Creative 2006  –  August 2009  (3 years) Associate Creative Director Rain 2009  –  2009  (less than a year) Creative Director Property Solutions December 2002  –  July 2006  (3 years 8 months) Project Leader Avalon Digital Marketing Inc. June 2001  –  April 2003  (1 year 11 months) Creative Director Boyd Interactive May 1999  –  June 2001  (2 years 2 months) Creative Technologist Bossa April 2012  –  March 2015  (3 years) Manhattan Creative Technologist Bossa April 2012  –  March 2015  (3 years) Manhattan Senior Art Director StrawberryFrog January 2011  –  January 2012  (1 year 1 month) Senior Art Director StrawberryFrog January 2011  –  January 2012  (1 year 1 month) Senior Art Director Big Spaceship 2009  –  December 2010  (1 year) Senior Art Director Big Spaceship 2009  –  December 2010  (1 year) Interactive Director Struck Creative 2006  –  August 2009  (3 years) Interactive Director Struck Creative 2006  –  August 2009  (3 years) Associate Creative Director Rain 2009  –  2009  (less than a year) Associate Creative Director Rain 2009  –  2009  (less than a year) Creative Director Property Solutions December 2002  –  July 2006  (3 years 8 months) Creative Director Property Solutions December 2002  –  July 2006  (3 years 8 months) Project Leader Avalon Digital Marketing Inc. June 2001  –  April 2003  (1 year 11 months) Project Leader Avalon Digital Marketing Inc. June 2001  –  April 2003  (1 year 11 months) Creative Director Boyd Interactive May 1999  –  June 2001  (2 years 2 months) Creative Director Boyd Interactive May 1999  –  June 2001  (2 years 2 months) Skills Interaction Design Node.js AngularJS Backbone.js Ember.js OpenFrameworks c# Swift C++ InDesign Art Direction Illustrator User Interface Design Interactive Advertising Graphics Creative Direction User Experience Web Design ActionScript Photoshop Flash Typography Flash Animation Motion Design Illustration Information Architecture After Effects Storyboarding Motion Graphics PHP HTML 5 Maya Animation CSS 3D HTML5 jQuery JavaScript Prototyping Cinema 4D Objective-C Java Cinder Unity3D See 29+     See less Skills  Interaction Design Node.js AngularJS Backbone.js Ember.js OpenFrameworks c# Swift C++ InDesign Art Direction Illustrator User Interface Design Interactive Advertising Graphics Creative Direction User Experience Web Design ActionScript Photoshop Flash Typography Flash Animation Motion Design Illustration Information Architecture After Effects Storyboarding Motion Graphics PHP HTML 5 Maya Animation CSS 3D HTML5 jQuery JavaScript Prototyping Cinema 4D Objective-C Java Cinder Unity3D See 29+     See less Interaction Design Node.js AngularJS Backbone.js Ember.js OpenFrameworks c# Swift C++ InDesign Art Direction Illustrator User Interface Design Interactive Advertising Graphics Creative Direction User Experience Web Design ActionScript Photoshop Flash Typography Flash Animation Motion Design Illustration Information Architecture After Effects Storyboarding Motion Graphics PHP HTML 5 Maya Animation CSS 3D HTML5 jQuery JavaScript Prototyping Cinema 4D Objective-C Java Cinder Unity3D See 29+     See less Interaction Design Node.js AngularJS Backbone.js Ember.js OpenFrameworks c# Swift C++ InDesign Art Direction Illustrator User Interface Design Interactive Advertising Graphics Creative Direction User Experience Web Design ActionScript Photoshop Flash Typography Flash Animation Motion Design Illustration Information Architecture After Effects Storyboarding Motion Graphics PHP HTML 5 Maya Animation CSS 3D HTML5 jQuery JavaScript Prototyping Cinema 4D Objective-C Java Cinder Unity3D See 29+     See less Honors & Awards ", "Summary CREATIVE DIRECTOR (Art Director) with extensive professional experience in creative concepting, strategic brand development, digital marketing and film/web production.  \n \nBrand Experience: \nFedEx, BBC, Google, Snickers, Starbucks, ESPN, DieHard, Virgin Mobile, DirecTV, Budweiser, Bud Light, Guinness, Fox Sports, Levis, Timberland, Craftsman, Pepsi, McDonalds, Oreo, Chrysler, HBO, Citibank, Bacardi, Sprite, Toyota and more. \n \nRecognition: \nAdAge Viral Top 10, AdWeek's Best of Decade List, AICP, ANDY Awards, Art Directors Club, Athena Awards, Cannes Lions, Clio Awards, Communication Arts, D&ADs, London International Awards, Luerzer's Archive, OBIE Awards, One Show, One Show Design, One Show Interactive and more. \n \nSpecialties: Creating memorable advertising via TV, print and digital. Excellent presentation and leadership skills. Summary CREATIVE DIRECTOR (Art Director) with extensive professional experience in creative concepting, strategic brand development, digital marketing and film/web production.  \n \nBrand Experience: \nFedEx, BBC, Google, Snickers, Starbucks, ESPN, DieHard, Virgin Mobile, DirecTV, Budweiser, Bud Light, Guinness, Fox Sports, Levis, Timberland, Craftsman, Pepsi, McDonalds, Oreo, Chrysler, HBO, Citibank, Bacardi, Sprite, Toyota and more. \n \nRecognition: \nAdAge Viral Top 10, AdWeek's Best of Decade List, AICP, ANDY Awards, Art Directors Club, Athena Awards, Cannes Lions, Clio Awards, Communication Arts, D&ADs, London International Awards, Luerzer's Archive, OBIE Awards, One Show, One Show Design, One Show Interactive and more. \n \nSpecialties: Creating memorable advertising via TV, print and digital. Excellent presentation and leadership skills. CREATIVE DIRECTOR (Art Director) with extensive professional experience in creative concepting, strategic brand development, digital marketing and film/web production.  \n \nBrand Experience: \nFedEx, BBC, Google, Snickers, Starbucks, ESPN, DieHard, Virgin Mobile, DirecTV, Budweiser, Bud Light, Guinness, Fox Sports, Levis, Timberland, Craftsman, Pepsi, McDonalds, Oreo, Chrysler, HBO, Citibank, Bacardi, Sprite, Toyota and more. \n \nRecognition: \nAdAge Viral Top 10, AdWeek's Best of Decade List, AICP, ANDY Awards, Art Directors Club, Athena Awards, Cannes Lions, Clio Awards, Communication Arts, D&ADs, London International Awards, Luerzer's Archive, OBIE Awards, One Show, One Show Design, One Show Interactive and more. \n \nSpecialties: Creating memorable advertising via TV, print and digital. Excellent presentation and leadership skills. CREATIVE DIRECTOR (Art Director) with extensive professional experience in creative concepting, strategic brand development, digital marketing and film/web production.  \n \nBrand Experience: \nFedEx, BBC, Google, Snickers, Starbucks, ESPN, DieHard, Virgin Mobile, DirecTV, Budweiser, Bud Light, Guinness, Fox Sports, Levis, Timberland, Craftsman, Pepsi, McDonalds, Oreo, Chrysler, HBO, Citibank, Bacardi, Sprite, Toyota and more. \n \nRecognition: \nAdAge Viral Top 10, AdWeek's Best of Decade List, AICP, ANDY Awards, Art Directors Club, Athena Awards, Cannes Lions, Clio Awards, Communication Arts, D&ADs, London International Awards, Luerzer's Archive, OBIE Awards, One Show, One Show Design, One Show Interactive and more. \n \nSpecialties: Creating memorable advertising via TV, print and digital. Excellent presentation and leadership skills. Experience Freelance Creative Director (Art Director) www.jamieoverkamp.com October 2010  – Present (4 years 11 months) NYC Recent freelance opportunities: \n-Google Creative Labs \n-Sid Lee New York (Client: Google) \n-Johannes Leonardo (Clients: Google, Bacardi, Sprite) \n-DeVito/Verdi New York (Clients: Daffy's, Legal Seafood) \n-Wieden Kennedy New York (Clients: NBA ESPN, ESPN News) \n-BBH New York (Client: Levi's) \n-Creature Seattle (Clients: HBO, Pepsi, Starbucks) \n-MRY (Clients: Blackberry, Microsoft) \n-360i (Client: Canon) \n-Arnold (Carnival Cruise, United, Atlantic City Tourism) \n \nTo request Jamie Overkamp, CD/AD to work for your agency, client or brand, email jamieoverkamp [at] gmail [dot] com. Associate Creative Director (Art Director) Young & Rubicam May 2009  –  November 2010  (1 year 7 months) Chicago, IL Advanced Portfolio Teacher Miami Ad School 2005  –  2010  (5 years) Associate Creative Director (Art Director) DDB December 2007  –  February 2009  (1 year 3 months) Chicago, IL Art Director BBDO March 2004  –  March 2007  (3 years 1 month) new york Art Director Fallon NY 2003  –  2004  (1 year) New York, NY Art Director Cliff Freeman & Partners 2003  –  2003  (less than a year) New York Freelance Creative Director (Art Director) www.jamieoverkamp.com October 2010  – Present (4 years 11 months) NYC Recent freelance opportunities: \n-Google Creative Labs \n-Sid Lee New York (Client: Google) \n-Johannes Leonardo (Clients: Google, Bacardi, Sprite) \n-DeVito/Verdi New York (Clients: Daffy's, Legal Seafood) \n-Wieden Kennedy New York (Clients: NBA ESPN, ESPN News) \n-BBH New York (Client: Levi's) \n-Creature Seattle (Clients: HBO, Pepsi, Starbucks) \n-MRY (Clients: Blackberry, Microsoft) \n-360i (Client: Canon) \n-Arnold (Carnival Cruise, United, Atlantic City Tourism) \n \nTo request Jamie Overkamp, CD/AD to work for your agency, client or brand, email jamieoverkamp [at] gmail [dot] com. Freelance Creative Director (Art Director) www.jamieoverkamp.com October 2010  – Present (4 years 11 months) NYC Recent freelance opportunities: \n-Google Creative Labs \n-Sid Lee New York (Client: Google) \n-Johannes Leonardo (Clients: Google, Bacardi, Sprite) \n-DeVito/Verdi New York (Clients: Daffy's, Legal Seafood) \n-Wieden Kennedy New York (Clients: NBA ESPN, ESPN News) \n-BBH New York (Client: Levi's) \n-Creature Seattle (Clients: HBO, Pepsi, Starbucks) \n-MRY (Clients: Blackberry, Microsoft) \n-360i (Client: Canon) \n-Arnold (Carnival Cruise, United, Atlantic City Tourism) \n \nTo request Jamie Overkamp, CD/AD to work for your agency, client or brand, email jamieoverkamp [at] gmail [dot] com. Associate Creative Director (Art Director) Young & Rubicam May 2009  –  November 2010  (1 year 7 months) Chicago, IL Associate Creative Director (Art Director) Young & Rubicam May 2009  –  November 2010  (1 year 7 months) Chicago, IL Advanced Portfolio Teacher Miami Ad School 2005  –  2010  (5 years) Advanced Portfolio Teacher Miami Ad School 2005  –  2010  (5 years) Associate Creative Director (Art Director) DDB December 2007  –  February 2009  (1 year 3 months) Chicago, IL Associate Creative Director (Art Director) DDB December 2007  –  February 2009  (1 year 3 months) Chicago, IL Art Director BBDO March 2004  –  March 2007  (3 years 1 month) new york Art Director BBDO March 2004  –  March 2007  (3 years 1 month) new york Art Director Fallon NY 2003  –  2004  (1 year) New York, NY Art Director Fallon NY 2003  –  2004  (1 year) New York, NY Art Director Cliff Freeman & Partners 2003  –  2003  (less than a year) New York Art Director Cliff Freeman & Partners 2003  –  2003  (less than a year) New York Skills Creative Strategy Interactive Advertising Art Direction Advertising Viral Marketing Digital Marketing Television Brand Management Outdoor Advertising Creative Direction Concept Development Typography Brand Architecture Interactive Marketing Corporate Identity Copywriting Digital Strategy Brand Development Direct Mail Experience Design Social Media Marketing Integrated Marketing Branding & Identity Interaction Design User Interface Design Visual Communication Corporate Branding Illustration User Experience Logo Design Adobe Creative Suite See 16+     See less Skills  Creative Strategy Interactive Advertising Art Direction Advertising Viral Marketing Digital Marketing Television Brand Management Outdoor Advertising Creative Direction Concept Development Typography Brand Architecture Interactive Marketing Corporate Identity Copywriting Digital Strategy Brand Development Direct Mail Experience Design Social Media Marketing Integrated Marketing Branding & Identity Interaction Design User Interface Design Visual Communication Corporate Branding Illustration User Experience Logo Design Adobe Creative Suite See 16+     See less Creative Strategy Interactive Advertising Art Direction Advertising Viral Marketing Digital Marketing Television Brand Management Outdoor Advertising Creative Direction Concept Development Typography Brand Architecture Interactive Marketing Corporate Identity Copywriting Digital Strategy Brand Development Direct Mail Experience Design Social Media Marketing Integrated Marketing Branding & Identity Interaction Design User Interface Design Visual Communication Corporate Branding Illustration User Experience Logo Design Adobe Creative Suite See 16+     See less Creative Strategy Interactive Advertising Art Direction Advertising Viral Marketing Digital Marketing Television Brand Management Outdoor Advertising Creative Direction Concept Development Typography Brand Architecture Interactive Marketing Corporate Identity Copywriting Digital Strategy Brand Development Direct Mail Experience Design Social Media Marketing Integrated Marketing Branding & Identity Interaction Design User Interface Design Visual Communication Corporate Branding Illustration User Experience Logo Design Adobe Creative Suite See 16+     See less Honors & Awards ", "Summary Hello! My name's Suzi, I'm a junior creative with big ambitions to make it in the advertising industry. I have a first class honours degree in Creative Advertising from the University of Lincoln and am obsessed with my craft - art direction and design in general. Since graduating, I've had experience with placements and freelancing as a creative in London. \n \nIf you'd like to know any more, get in touch! Summary Hello! My name's Suzi, I'm a junior creative with big ambitions to make it in the advertising industry. I have a first class honours degree in Creative Advertising from the University of Lincoln and am obsessed with my craft - art direction and design in general. Since graduating, I've had experience with placements and freelancing as a creative in London. \n \nIf you'd like to know any more, get in touch! Hello! My name's Suzi, I'm a junior creative with big ambitions to make it in the advertising industry. I have a first class honours degree in Creative Advertising from the University of Lincoln and am obsessed with my craft - art direction and design in general. Since graduating, I've had experience with placements and freelancing as a creative in London. \n \nIf you'd like to know any more, get in touch! Hello! My name's Suzi, I'm a junior creative with big ambitions to make it in the advertising industry. I have a first class honours degree in Creative Advertising from the University of Lincoln and am obsessed with my craft - art direction and design in general. Since graduating, I've had experience with placements and freelancing as a creative in London. \n \nIf you'd like to know any more, get in touch! Experience Creative Placement BMB LLC June 2015  –  June 2015  (1 month) Creative Placement ODD May 2015  –  May 2015  (1 month) Freelance Creative Fold7 April 2015  –  April 2015  (1 month) Creative Placement Fold7 August 2014  –  March 2015  (8 months) Working on Gumtree, Carlsberg, Reebok, The Big Issue Foundation, Sports Direct, Wink Bingo and 888 Casino. Creative Placement 1DA July 2014  –  July 2014  (1 month) London, United Kingdom New Blood Academy 2014 D&AD July 2014  –  July 2014  (1 month) I won a place on the D&AD New Blood Academy 2014 after being awarded Best In Show at the New Blood Exhibition for our Rimmel Mascara spec work. Over an intense two weeks we participated in workshops and live briefs with Google Creative Labs, MPC and ended with a group pitch to Vodafone on the closing night of the Academy. Head Bartender Chimichanga April 2013  –  June 2014  (1 year 3 months) Lincoln, United Kingdom Creative Placement BMB LLC June 2015  –  June 2015  (1 month) Creative Placement BMB LLC June 2015  –  June 2015  (1 month) Creative Placement ODD May 2015  –  May 2015  (1 month) Creative Placement ODD May 2015  –  May 2015  (1 month) Freelance Creative Fold7 April 2015  –  April 2015  (1 month) Freelance Creative Fold7 April 2015  –  April 2015  (1 month) Creative Placement Fold7 August 2014  –  March 2015  (8 months) Working on Gumtree, Carlsberg, Reebok, The Big Issue Foundation, Sports Direct, Wink Bingo and 888 Casino. Creative Placement Fold7 August 2014  –  March 2015  (8 months) Working on Gumtree, Carlsberg, Reebok, The Big Issue Foundation, Sports Direct, Wink Bingo and 888 Casino. Creative Placement 1DA July 2014  –  July 2014  (1 month) London, United Kingdom Creative Placement 1DA July 2014  –  July 2014  (1 month) London, United Kingdom New Blood Academy 2014 D&AD July 2014  –  July 2014  (1 month) I won a place on the D&AD New Blood Academy 2014 after being awarded Best In Show at the New Blood Exhibition for our Rimmel Mascara spec work. Over an intense two weeks we participated in workshops and live briefs with Google Creative Labs, MPC and ended with a group pitch to Vodafone on the closing night of the Academy. New Blood Academy 2014 D&AD July 2014  –  July 2014  (1 month) I won a place on the D&AD New Blood Academy 2014 after being awarded Best In Show at the New Blood Exhibition for our Rimmel Mascara spec work. Over an intense two weeks we participated in workshops and live briefs with Google Creative Labs, MPC and ended with a group pitch to Vodafone on the closing night of the Academy. Head Bartender Chimichanga April 2013  –  June 2014  (1 year 3 months) Lincoln, United Kingdom Head Bartender Chimichanga April 2013  –  June 2014  (1 year 3 months) Lincoln, United Kingdom Skills Art Direction Advertising Photoshop Creative Direction Illustrator Graphic Design Idea Generation Presentations Brand Development Typography Concept Development Copywriting Skills  Art Direction Advertising Photoshop Creative Direction Illustrator Graphic Design Idea Generation Presentations Brand Development Typography Concept Development Copywriting Art Direction Advertising Photoshop Creative Direction Illustrator Graphic Design Idea Generation Presentations Brand Development Typography Concept Development Copywriting Art Direction Advertising Photoshop Creative Direction Illustrator Graphic Design Idea Generation Presentations Brand Development Typography Concept Development Copywriting Education University of Lincoln Creative Advertising BA(Hons),  Advertising , 1st class honours 2011  – 2014 Spalding High School 2004  – 2011 University of Lincoln Creative Advertising BA(Hons),  Advertising , 1st class honours 2011  – 2014 University of Lincoln Creative Advertising BA(Hons),  Advertising , 1st class honours 2011  – 2014 University of Lincoln Creative Advertising BA(Hons),  Advertising , 1st class honours 2011  – 2014 Spalding High School 2004  – 2011 Spalding High School 2004  – 2011 Spalding High School 2004  – 2011 Honors & Awards New Blood Best In Show D&AD New Blood July 2014 With my former partner, I was awarded Best In Show at D&AD New Blood Exhibition 2014 for spec work on Rimmel Mascara. This award led to us being chosen for a Wildcard place at their New Blood Academy. New Blood Best In Show D&AD New Blood July 2014 With my former partner, I was awarded Best In Show at D&AD New Blood Exhibition 2014 for spec work on Rimmel Mascara. This award led to us being chosen for a Wildcard place at their New Blood Academy. New Blood Best In Show D&AD New Blood July 2014 With my former partner, I was awarded Best In Show at D&AD New Blood Exhibition 2014 for spec work on Rimmel Mascara. This award led to us being chosen for a Wildcard place at their New Blood Academy. New Blood Best In Show D&AD New Blood July 2014 With my former partner, I was awarded Best In Show at D&AD New Blood Exhibition 2014 for spec work on Rimmel Mascara. This award led to us being chosen for a Wildcard place at their New Blood Academy. ", "Summary Freelance Creative Technologist creating cutting-edge interactive experiences for the web and physical installations. Also music composer & sound designer. Lives online at www.owenhindley.co.uk Summary Freelance Creative Technologist creating cutting-edge interactive experiences for the web and physical installations. Also music composer & sound designer. Lives online at www.owenhindley.co.uk Freelance Creative Technologist creating cutting-edge interactive experiences for the web and physical installations. Also music composer & sound designer. Lives online at www.owenhindley.co.uk Freelance Creative Technologist creating cutting-edge interactive experiences for the web and physical installations. Also music composer & sound designer. Lives online at www.owenhindley.co.uk Experience Creative Technologist & Partner Retropi April 2014  – Present (1 year 5 months) Creative Technologist Freelance February 2014  – Present (1 year 7 months) Creative Technologist B-Reel January 2012  –  January 2014  (2 years 1 month) Hoxton, London Creative Technologist working directly on the concepting, scoping, planning, build and delivery of award-winning interactive campaigns. often as lead developer. High-end HTML5 and back-end development (PHP, Node.js, Python) as well as occasional sound design & programming across desktop, tablet and mobile. \n \nDeveloped proprietary cross-platform sound & video playback system for Mercedes-Benz's Sound With Power campaign, winning the FWA Cutting Edge award in 2013. \n \nClients include Google Creative Labs, Mercedes-Benz UK, Adidas, Three Mobile, Ray-Ban/Luxottica, working with agencies such as W+K, CP+B, AMV BBDO and BBH. Awards include Cannes Lions, FWA Site of the Day (x 4), and nominations for Webby's People's Choice Award. Creative Technologist Metropolis Group June 2010  –  January 2012  (1 year 8 months) London, United Kingdom Web developer working in HTML5/OOJS, PHP and Flash AS3 to produce online and desktop interactives for (predominantly) music industry clients (including Universal, EMI and Warner Music). Produced iTunes LPs for The Beatles digital release in 2010, as well as the no.1 selling '1s' album and the Beach Boys 'Smile' LP. \niPhone developer, working on Say What!? music game, released in conjunction with Sony Music Entertainment, which charted at No.1 in the Free Apps category on the Apple App Store. Working in native Objective-C, using the Cocos2d framework. \nComposer and sound designer, including work for TV (Channel 4's OnTrack with Seat series), and online (catalyst.org). Freelance Multimedia Developer Mediastation 2009  –  January 2011  (2 years) Flash AS3 & front-end HTML/JS/CSS developer, severside development in PHP and ASP.NET. Worked on Webby-award winning Wizarding World of Harry Potter site (www.universalorlando.com/harrypotter). Additional graphic design & motion graphics. Sound recordist & editor/designer, on location and on motion capture shoots. Sound Supervisor Figment Productions 2008  –  2009  (1 year) On-set sound recordist, foley editor & supervisor, dialogue editor, sound designer and mix engineer. Sound supervisor for independent horror feature The Fallow Field (http://www.imdb.com/title/tt1568892/) Multimedia Developer Flaming Pear Interactive 2007  –  2009  (2 years) Bespoke hardware & software design, building physical multimedia interactive installations. C#/.NET, including XNA & WPF for 3d interfaces, and ASP.NET for serverside programming. OpenCV for camera-based multitouch input. Creating interfaces and hardware control using Flash AS3. Design and installation of electronic sensor and control systems for interactives. Sound recordist for shoots involving motion-control rigs and on location (street interviews, conferences). Sound designer and editor. Creative Technologist & Partner Retropi April 2014  – Present (1 year 5 months) Creative Technologist & Partner Retropi April 2014  – Present (1 year 5 months) Creative Technologist Freelance February 2014  – Present (1 year 7 months) Creative Technologist Freelance February 2014  – Present (1 year 7 months) Creative Technologist B-Reel January 2012  –  January 2014  (2 years 1 month) Hoxton, London Creative Technologist working directly on the concepting, scoping, planning, build and delivery of award-winning interactive campaigns. often as lead developer. High-end HTML5 and back-end development (PHP, Node.js, Python) as well as occasional sound design & programming across desktop, tablet and mobile. \n \nDeveloped proprietary cross-platform sound & video playback system for Mercedes-Benz's Sound With Power campaign, winning the FWA Cutting Edge award in 2013. \n \nClients include Google Creative Labs, Mercedes-Benz UK, Adidas, Three Mobile, Ray-Ban/Luxottica, working with agencies such as W+K, CP+B, AMV BBDO and BBH. Awards include Cannes Lions, FWA Site of the Day (x 4), and nominations for Webby's People's Choice Award. Creative Technologist B-Reel January 2012  –  January 2014  (2 years 1 month) Hoxton, London Creative Technologist working directly on the concepting, scoping, planning, build and delivery of award-winning interactive campaigns. often as lead developer. High-end HTML5 and back-end development (PHP, Node.js, Python) as well as occasional sound design & programming across desktop, tablet and mobile. \n \nDeveloped proprietary cross-platform sound & video playback system for Mercedes-Benz's Sound With Power campaign, winning the FWA Cutting Edge award in 2013. \n \nClients include Google Creative Labs, Mercedes-Benz UK, Adidas, Three Mobile, Ray-Ban/Luxottica, working with agencies such as W+K, CP+B, AMV BBDO and BBH. Awards include Cannes Lions, FWA Site of the Day (x 4), and nominations for Webby's People's Choice Award. Creative Technologist Metropolis Group June 2010  –  January 2012  (1 year 8 months) London, United Kingdom Web developer working in HTML5/OOJS, PHP and Flash AS3 to produce online and desktop interactives for (predominantly) music industry clients (including Universal, EMI and Warner Music). Produced iTunes LPs for The Beatles digital release in 2010, as well as the no.1 selling '1s' album and the Beach Boys 'Smile' LP. \niPhone developer, working on Say What!? music game, released in conjunction with Sony Music Entertainment, which charted at No.1 in the Free Apps category on the Apple App Store. Working in native Objective-C, using the Cocos2d framework. \nComposer and sound designer, including work for TV (Channel 4's OnTrack with Seat series), and online (catalyst.org). Creative Technologist Metropolis Group June 2010  –  January 2012  (1 year 8 months) London, United Kingdom Web developer working in HTML5/OOJS, PHP and Flash AS3 to produce online and desktop interactives for (predominantly) music industry clients (including Universal, EMI and Warner Music). Produced iTunes LPs for The Beatles digital release in 2010, as well as the no.1 selling '1s' album and the Beach Boys 'Smile' LP. \niPhone developer, working on Say What!? music game, released in conjunction with Sony Music Entertainment, which charted at No.1 in the Free Apps category on the Apple App Store. Working in native Objective-C, using the Cocos2d framework. \nComposer and sound designer, including work for TV (Channel 4's OnTrack with Seat series), and online (catalyst.org). Freelance Multimedia Developer Mediastation 2009  –  January 2011  (2 years) Flash AS3 & front-end HTML/JS/CSS developer, severside development in PHP and ASP.NET. Worked on Webby-award winning Wizarding World of Harry Potter site (www.universalorlando.com/harrypotter). Additional graphic design & motion graphics. Sound recordist & editor/designer, on location and on motion capture shoots. Freelance Multimedia Developer Mediastation 2009  –  January 2011  (2 years) Flash AS3 & front-end HTML/JS/CSS developer, severside development in PHP and ASP.NET. Worked on Webby-award winning Wizarding World of Harry Potter site (www.universalorlando.com/harrypotter). Additional graphic design & motion graphics. Sound recordist & editor/designer, on location and on motion capture shoots. Sound Supervisor Figment Productions 2008  –  2009  (1 year) On-set sound recordist, foley editor & supervisor, dialogue editor, sound designer and mix engineer. Sound supervisor for independent horror feature The Fallow Field (http://www.imdb.com/title/tt1568892/) Sound Supervisor Figment Productions 2008  –  2009  (1 year) On-set sound recordist, foley editor & supervisor, dialogue editor, sound designer and mix engineer. Sound supervisor for independent horror feature The Fallow Field (http://www.imdb.com/title/tt1568892/) Multimedia Developer Flaming Pear Interactive 2007  –  2009  (2 years) Bespoke hardware & software design, building physical multimedia interactive installations. C#/.NET, including XNA & WPF for 3d interfaces, and ASP.NET for serverside programming. OpenCV for camera-based multitouch input. Creating interfaces and hardware control using Flash AS3. Design and installation of electronic sensor and control systems for interactives. Sound recordist for shoots involving motion-control rigs and on location (street interviews, conferences). Sound designer and editor. Multimedia Developer Flaming Pear Interactive 2007  –  2009  (2 years) Bespoke hardware & software design, building physical multimedia interactive installations. C#/.NET, including XNA & WPF for 3d interfaces, and ASP.NET for serverside programming. OpenCV for camera-based multitouch input. Creating interfaces and hardware control using Flash AS3. Design and installation of electronic sensor and control systems for interactives. Sound recordist for shoots involving motion-control rigs and on location (street interviews, conferences). Sound designer and editor. Skills Flash Motion Graphics Sound Video Editing Sound Design Audio Engineering After Effects Graphic Design ActionScript Animation JavaScript Web Development Advanced CSS CSS WebGL WebAudio Audio Editing Audio Post Production HTML 5 HTML5 See 5+     See less Skills  Flash Motion Graphics Sound Video Editing Sound Design Audio Engineering After Effects Graphic Design ActionScript Animation JavaScript Web Development Advanced CSS CSS WebGL WebAudio Audio Editing Audio Post Production HTML 5 HTML5 See 5+     See less Flash Motion Graphics Sound Video Editing Sound Design Audio Engineering After Effects Graphic Design ActionScript Animation JavaScript Web Development Advanced CSS CSS WebGL WebAudio Audio Editing Audio Post Production HTML 5 HTML5 See 5+     See less Flash Motion Graphics Sound Video Editing Sound Design Audio Engineering After Effects Graphic Design ActionScript Animation JavaScript Web Development Advanced CSS CSS WebGL WebAudio Audio Editing Audio Post Production HTML 5 HTML5 See 5+     See less Education University of Surrey BEng Audio Media Engineering,  Electronic Engineering , Audio Engineering, Video Engineering, DSP,  Software Design 2004  – 2009 1st class degree classification; Final year project: Multitouch realtime video editing & performance system. Activities and Societies:  GU2 Radio (Station Manager 2006-7) ,  USSU Stage Crew University of Surrey BEng Audio Media Engineering,  Electronic Engineering , Audio Engineering, Video Engineering, DSP,  Software Design 2004  – 2009 1st class degree classification; Final year project: Multitouch realtime video editing & performance system. Activities and Societies:  GU2 Radio (Station Manager 2006-7) ,  USSU Stage Crew University of Surrey BEng Audio Media Engineering,  Electronic Engineering , Audio Engineering, Video Engineering, DSP,  Software Design 2004  – 2009 1st class degree classification; Final year project: Multitouch realtime video editing & performance system. Activities and Societies:  GU2 Radio (Station Manager 2006-7) ,  USSU Stage Crew University of Surrey BEng Audio Media Engineering,  Electronic Engineering , Audio Engineering, Video Engineering, DSP,  Software Design 2004  – 2009 1st class degree classification; Final year project: Multitouch realtime video editing & performance system. Activities and Societies:  GU2 Radio (Station Manager 2006-7) ,  USSU Stage Crew ", "Summary My 14-year career includes working in a wide variety of companies: From ATL agencies to purely digital hot shops.  \n \nHalf of it took place in London, where I worked in places like Fallon, Lean Mean Fighting Machine, Digitas, among others. These were challenging years and I've worked as a senior creative on projects for global brands like Unilever, Eurostar, Sony, Guinness and a few others.  \n \nIn 2010 I moved to fast-paced São Paulo, Brazil, where I'm currently based. Here I worked as a Creative Director at AgenciaClickIsobar, responsible for the integrated FIAT account and later had the same role for Nivea.  \n \nAfter a prolific stint at AgenciaClick, in March 2012 I left to found the creative lab SEÑORES, with a few collaborators based in NYC and London. It's focused on developing high impact communication and innovation projects. Both coming from a client's brief or proprietary, which turns out to be at the same time hugely fun and daunting. \n \nIn between all that, back in 2011, I've started running a creativity workshop at MiamiAdSchool. Thankfully, it became a great success among creatives and planners and we had people from the likes of Nike and Google Creative Labs taking part.  \n \nLife's been busy in the tropics. \n \nSpecialties: Creative Direction, Art Direction, Typography, Interactive,  \nCreative Strategy and working hard to add Writing to the list. Summary My 14-year career includes working in a wide variety of companies: From ATL agencies to purely digital hot shops.  \n \nHalf of it took place in London, where I worked in places like Fallon, Lean Mean Fighting Machine, Digitas, among others. These were challenging years and I've worked as a senior creative on projects for global brands like Unilever, Eurostar, Sony, Guinness and a few others.  \n \nIn 2010 I moved to fast-paced São Paulo, Brazil, where I'm currently based. Here I worked as a Creative Director at AgenciaClickIsobar, responsible for the integrated FIAT account and later had the same role for Nivea.  \n \nAfter a prolific stint at AgenciaClick, in March 2012 I left to found the creative lab SEÑORES, with a few collaborators based in NYC and London. It's focused on developing high impact communication and innovation projects. Both coming from a client's brief or proprietary, which turns out to be at the same time hugely fun and daunting. \n \nIn between all that, back in 2011, I've started running a creativity workshop at MiamiAdSchool. Thankfully, it became a great success among creatives and planners and we had people from the likes of Nike and Google Creative Labs taking part.  \n \nLife's been busy in the tropics. \n \nSpecialties: Creative Direction, Art Direction, Typography, Interactive,  \nCreative Strategy and working hard to add Writing to the list. My 14-year career includes working in a wide variety of companies: From ATL agencies to purely digital hot shops.  \n \nHalf of it took place in London, where I worked in places like Fallon, Lean Mean Fighting Machine, Digitas, among others. These were challenging years and I've worked as a senior creative on projects for global brands like Unilever, Eurostar, Sony, Guinness and a few others.  \n \nIn 2010 I moved to fast-paced São Paulo, Brazil, where I'm currently based. Here I worked as a Creative Director at AgenciaClickIsobar, responsible for the integrated FIAT account and later had the same role for Nivea.  \n \nAfter a prolific stint at AgenciaClick, in March 2012 I left to found the creative lab SEÑORES, with a few collaborators based in NYC and London. It's focused on developing high impact communication and innovation projects. Both coming from a client's brief or proprietary, which turns out to be at the same time hugely fun and daunting. \n \nIn between all that, back in 2011, I've started running a creativity workshop at MiamiAdSchool. Thankfully, it became a great success among creatives and planners and we had people from the likes of Nike and Google Creative Labs taking part.  \n \nLife's been busy in the tropics. \n \nSpecialties: Creative Direction, Art Direction, Typography, Interactive,  \nCreative Strategy and working hard to add Writing to the list. My 14-year career includes working in a wide variety of companies: From ATL agencies to purely digital hot shops.  \n \nHalf of it took place in London, where I worked in places like Fallon, Lean Mean Fighting Machine, Digitas, among others. These were challenging years and I've worked as a senior creative on projects for global brands like Unilever, Eurostar, Sony, Guinness and a few others.  \n \nIn 2010 I moved to fast-paced São Paulo, Brazil, where I'm currently based. Here I worked as a Creative Director at AgenciaClickIsobar, responsible for the integrated FIAT account and later had the same role for Nivea.  \n \nAfter a prolific stint at AgenciaClick, in March 2012 I left to found the creative lab SEÑORES, with a few collaborators based in NYC and London. It's focused on developing high impact communication and innovation projects. Both coming from a client's brief or proprietary, which turns out to be at the same time hugely fun and daunting. \n \nIn between all that, back in 2011, I've started running a creativity workshop at MiamiAdSchool. Thankfully, it became a great success among creatives and planners and we had people from the likes of Nike and Google Creative Labs taking part.  \n \nLife's been busy in the tropics. \n \nSpecialties: Creative Direction, Art Direction, Typography, Interactive,  \nCreative Strategy and working hard to add Writing to the list. Experience Creative director & Founder Señores February 2012  – Present (3 years 7 months) São Paulo & NYC Creative & Business leadership to build the most creative and innovative company in the communication industry. Creative Director AgenciaClick Isobar January 2011  –  February 2012  (1 year 2 months) Working for Nivea, AntarticaSubZero, SonyEricsson and FIAT. Senior Freelance Creative Hyper, 18ft&Rising and Nitro January 2010  –  January 2011  (1 year 1 month) Working for brands like Nokia, Dove and Lovefilm (pitch winner) Freelance Creative Fallon September 2009  –  January 2010  (5 months) We've won an Unilever global business and worked on projects for Kerry LowLow and Eurostar. Senior Creative - Freelance EMI Music July 2009  –  August 2009  (2 months) Launching Eliza Doolittle. It included creating from traditional music videos to some awesome social media tools. Senior Creative Digitas October 2007  –  March 2009  (1 year 6 months) During my period at Digitas London, I've worked on a great \nnumber of key projects for the company on a regional and global level. \nThat included helping brands like P&G (Ariel, Oral-B and Pantene), Delta Airlines, Samsung, Vauxhall-GM, LloydsTSB and Shell. Eventually we worked on pitches and client tasks with other agencies from Publicis Groupe, such as Saatchi&Saatchi and Leo Burnett. Creative - Freelance Lean Mean Fighting Machine July 2007  –  October 2007  (4 months) Idea generation and executions for a range of brands – Virgin Bets, Emirates, Creative Review among others. Creative - Freelance Antidote, JWT April 2007  –  July 2007  (4 months) Working for Shell, WeAreWhatWeDo and Rapha Sportwear. Senior Creative Young & Rubicam June 2004  –  May 2005  (1 year) Working for VIVO and Brasilia-DF Local Government. Creative SetteGraal 2003  –  2004  (1 year) Working CTIS (regional electronics retailer) and Conjunto Nacional (regional shopping mall) Junior creative McCann Worldgroup 2001  –  2002  (1 year) Working for Ministry of Agriculture Creative director & Founder Señores February 2012  – Present (3 years 7 months) São Paulo & NYC Creative & Business leadership to build the most creative and innovative company in the communication industry. Creative director & Founder Señores February 2012  – Present (3 years 7 months) São Paulo & NYC Creative & Business leadership to build the most creative and innovative company in the communication industry. Creative Director AgenciaClick Isobar January 2011  –  February 2012  (1 year 2 months) Working for Nivea, AntarticaSubZero, SonyEricsson and FIAT. Creative Director AgenciaClick Isobar January 2011  –  February 2012  (1 year 2 months) Working for Nivea, AntarticaSubZero, SonyEricsson and FIAT. Senior Freelance Creative Hyper, 18ft&Rising and Nitro January 2010  –  January 2011  (1 year 1 month) Working for brands like Nokia, Dove and Lovefilm (pitch winner) Senior Freelance Creative Hyper, 18ft&Rising and Nitro January 2010  –  January 2011  (1 year 1 month) Working for brands like Nokia, Dove and Lovefilm (pitch winner) Freelance Creative Fallon September 2009  –  January 2010  (5 months) We've won an Unilever global business and worked on projects for Kerry LowLow and Eurostar. Freelance Creative Fallon September 2009  –  January 2010  (5 months) We've won an Unilever global business and worked on projects for Kerry LowLow and Eurostar. Senior Creative - Freelance EMI Music July 2009  –  August 2009  (2 months) Launching Eliza Doolittle. It included creating from traditional music videos to some awesome social media tools. Senior Creative - Freelance EMI Music July 2009  –  August 2009  (2 months) Launching Eliza Doolittle. It included creating from traditional music videos to some awesome social media tools. Senior Creative Digitas October 2007  –  March 2009  (1 year 6 months) During my period at Digitas London, I've worked on a great \nnumber of key projects for the company on a regional and global level. \nThat included helping brands like P&G (Ariel, Oral-B and Pantene), Delta Airlines, Samsung, Vauxhall-GM, LloydsTSB and Shell. Eventually we worked on pitches and client tasks with other agencies from Publicis Groupe, such as Saatchi&Saatchi and Leo Burnett. Senior Creative Digitas October 2007  –  March 2009  (1 year 6 months) During my period at Digitas London, I've worked on a great \nnumber of key projects for the company on a regional and global level. \nThat included helping brands like P&G (Ariel, Oral-B and Pantene), Delta Airlines, Samsung, Vauxhall-GM, LloydsTSB and Shell. Eventually we worked on pitches and client tasks with other agencies from Publicis Groupe, such as Saatchi&Saatchi and Leo Burnett. Creative - Freelance Lean Mean Fighting Machine July 2007  –  October 2007  (4 months) Idea generation and executions for a range of brands – Virgin Bets, Emirates, Creative Review among others. Creative - Freelance Lean Mean Fighting Machine July 2007  –  October 2007  (4 months) Idea generation and executions for a range of brands – Virgin Bets, Emirates, Creative Review among others. Creative - Freelance Antidote, JWT April 2007  –  July 2007  (4 months) Working for Shell, WeAreWhatWeDo and Rapha Sportwear. Creative - Freelance Antidote, JWT April 2007  –  July 2007  (4 months) Working for Shell, WeAreWhatWeDo and Rapha Sportwear. Senior Creative Young & Rubicam June 2004  –  May 2005  (1 year) Working for VIVO and Brasilia-DF Local Government. Senior Creative Young & Rubicam June 2004  –  May 2005  (1 year) Working for VIVO and Brasilia-DF Local Government. Creative SetteGraal 2003  –  2004  (1 year) Working CTIS (regional electronics retailer) and Conjunto Nacional (regional shopping mall) Creative SetteGraal 2003  –  2004  (1 year) Working CTIS (regional electronics retailer) and Conjunto Nacional (regional shopping mall) Junior creative McCann Worldgroup 2001  –  2002  (1 year) Working for Ministry of Agriculture Junior creative McCann Worldgroup 2001  –  2002  (1 year) Working for Ministry of Agriculture Languages English Portuguese Italian French (basic) English Portuguese Italian French (basic) English Portuguese Italian French (basic) Skills Creative Strategy Creative Direction Art Direction Directing Interactive Advertising Digital Strategy Advertising Concept Development Interaction Design Typography Integrated Marketing Digital Marketing Digital Media Graphic Design Outdoor Advertising Copywriting Online Advertising User Interface Design Visual Communication Interactive Marketing Social Media Web Design See 7+     See less Skills  Creative Strategy Creative Direction Art Direction Directing Interactive Advertising Digital Strategy Advertising Concept Development Interaction Design Typography Integrated Marketing Digital Marketing Digital Media Graphic Design Outdoor Advertising Copywriting Online Advertising User Interface Design Visual Communication Interactive Marketing Social Media Web Design See 7+     See less Creative Strategy Creative Direction Art Direction Directing Interactive Advertising Digital Strategy Advertising Concept Development Interaction Design Typography Integrated Marketing Digital Marketing Digital Media Graphic Design Outdoor Advertising Copywriting Online Advertising User Interface Design Visual Communication Interactive Marketing Social Media Web Design See 7+     See less Creative Strategy Creative Direction Art Direction Directing Interactive Advertising Digital Strategy Advertising Concept Development Interaction Design Typography Integrated Marketing Digital Marketing Digital Media Graphic Design Outdoor Advertising Copywriting Online Advertising User Interface Design Visual Communication Interactive Marketing Social Media Web Design See 7+     See less Education London College of Communication Postgraduate degree,  Experimental Typography 2005  – 2006 Postgraduate course on Experimental Typography. Graduated with distinction \nwith the 'Collaborative Type' project. Hyper Island Karlskrona Digital & Creativity 2010  – 2010 Activities and Societies:  Super mega intensive 5-day workshop at the Swedish nest of digital wisdom. UCLA Fundamentals of Screenwriting,  Film/Cinema/Video Studies 2013  – 2013 with Prof. Richard Walter (Los Angeles - USA) D&AD Workshops Advertising Workshop - Winning portfolio 2007  – 2007 Activities and Societies:  Each of the participant agencies ,  has set up a brief for which\nwe had 1 week to work on ,  come back and amaze the creative director. Fallon ,  Wieden & Kennedy ,  Leo Burnett ,  Agency Republic were some of them. Universidade de Brasília BA,  Advertising 1997  – 2002 School of Visual Arts - New York Photography 1999  – 1999 London College of Communication Postgraduate degree,  Experimental Typography 2005  – 2006 Postgraduate course on Experimental Typography. Graduated with distinction \nwith the 'Collaborative Type' project. London College of Communication Postgraduate degree,  Experimental Typography 2005  – 2006 Postgraduate course on Experimental Typography. Graduated with distinction \nwith the 'Collaborative Type' project. London College of Communication Postgraduate degree,  Experimental Typography 2005  – 2006 Postgraduate course on Experimental Typography. Graduated with distinction \nwith the 'Collaborative Type' project. Hyper Island Karlskrona Digital & Creativity 2010  – 2010 Activities and Societies:  Super mega intensive 5-day workshop at the Swedish nest of digital wisdom. Hyper Island Karlskrona Digital & Creativity 2010  – 2010 Activities and Societies:  Super mega intensive 5-day workshop at the Swedish nest of digital wisdom. Hyper Island Karlskrona Digital & Creativity 2010  – 2010 Activities and Societies:  Super mega intensive 5-day workshop at the Swedish nest of digital wisdom. UCLA Fundamentals of Screenwriting,  Film/Cinema/Video Studies 2013  – 2013 with Prof. Richard Walter (Los Angeles - USA) UCLA Fundamentals of Screenwriting,  Film/Cinema/Video Studies 2013  – 2013 with Prof. Richard Walter (Los Angeles - USA) UCLA Fundamentals of Screenwriting,  Film/Cinema/Video Studies 2013  – 2013 with Prof. Richard Walter (Los Angeles - USA) D&AD Workshops Advertising Workshop - Winning portfolio 2007  – 2007 Activities and Societies:  Each of the participant agencies ,  has set up a brief for which\nwe had 1 week to work on ,  come back and amaze the creative director. Fallon ,  Wieden & Kennedy ,  Leo Burnett ,  Agency Republic were some of them. D&AD Workshops Advertising Workshop - Winning portfolio 2007  – 2007 Activities and Societies:  Each of the participant agencies ,  has set up a brief for which\nwe had 1 week to work on ,  come back and amaze the creative director. Fallon ,  Wieden & Kennedy ,  Leo Burnett ,  Agency Republic were some of them. D&AD Workshops Advertising Workshop - Winning portfolio 2007  – 2007 Activities and Societies:  Each of the participant agencies ,  has set up a brief for which\nwe had 1 week to work on ,  come back and amaze the creative director. Fallon ,  Wieden & Kennedy ,  Leo Burnett ,  Agency Republic were some of them. Universidade de Brasília BA,  Advertising 1997  – 2002 Universidade de Brasília BA,  Advertising 1997  – 2002 Universidade de Brasília BA,  Advertising 1997  – 2002 School of Visual Arts - New York Photography 1999  – 1999 School of Visual Arts - New York Photography 1999  – 1999 School of Visual Arts - New York Photography 1999  – 1999 ", "Summary I'm a senior creative, writer & director currently working for the Guardian's in-house branded content agency, Guardian Labs, creating entertaining, interesting and shareable content for top brands.  \n \nI also direct commercials and short films, repped by Habana Creative. \n \nnyallcook.com Summary I'm a senior creative, writer & director currently working for the Guardian's in-house branded content agency, Guardian Labs, creating entertaining, interesting and shareable content for top brands.  \n \nI also direct commercials and short films, repped by Habana Creative. \n \nnyallcook.com I'm a senior creative, writer & director currently working for the Guardian's in-house branded content agency, Guardian Labs, creating entertaining, interesting and shareable content for top brands.  \n \nI also direct commercials and short films, repped by Habana Creative. \n \nnyallcook.com I'm a senior creative, writer & director currently working for the Guardian's in-house branded content agency, Guardian Labs, creating entertaining, interesting and shareable content for top brands.  \n \nI also direct commercials and short films, repped by Habana Creative. \n \nnyallcook.com Experience Senior Creative // Video Director Guardian Labs January 2015  – Present (8 months) Creating branded content for the Guardian's in-house agency - Guardian Labs Director Habana Creative September 2013  – Present (2 years) Directing/writing branded content and commercials for agencies. \nHabana is a creative production company that represents a growing roster of revolutionary directors, writers and animators. Senior Creative Freelance September 2013  –  December 2014  (1 year 4 months) Regular freelance creative gigs at London's top agencies:  \nAcross the Pond, Google Creative Labs, We Are Social, Tribal Worldwide, M&C Saatchi, VCCP, GaurdianLabs, Recipe Creative glue Isobar June 2012  –  September 2013  (1 year 4 months) Worked on exciting projects for Toyota, Pringles, Google, Eristoff, Auto Trader, The Guardian, and a little bit of Kellogg's. Creative iris worldwide January 2010  –  June 2012  (2 years 6 months) Client list: Sony, COI, Unilever, Dairy Crest, Barclaycard, Disney, Kerry Foods, Orange, Philips, PepsiCo & Britvic Copywriter Grey 2009  –  2010  (1 year) Mumbai Area, India Client list: Audi, Pantene, JM Financial, Axa Life Insurance Copywriter Saatchi & Saatchi 2008  –  2008  (less than a year) Mumbai Area, India Client list: Cox & Kings, Ariel, Olay, Calcium Sanchoz and Tetley Jnr Copywriter Feref Ltd 2007  –  2008  (1 year) Feref is a Movie & Entertainment specialist marketing agency, I worked mainly on digital campaigns for top movie clients like Fox, Paramount and Warner Bros. Senior Creative // Video Director Guardian Labs January 2015  – Present (8 months) Creating branded content for the Guardian's in-house agency - Guardian Labs Senior Creative // Video Director Guardian Labs January 2015  – Present (8 months) Creating branded content for the Guardian's in-house agency - Guardian Labs Director Habana Creative September 2013  – Present (2 years) Directing/writing branded content and commercials for agencies. \nHabana is a creative production company that represents a growing roster of revolutionary directors, writers and animators. Director Habana Creative September 2013  – Present (2 years) Directing/writing branded content and commercials for agencies. \nHabana is a creative production company that represents a growing roster of revolutionary directors, writers and animators. Senior Creative Freelance September 2013  –  December 2014  (1 year 4 months) Regular freelance creative gigs at London's top agencies:  \nAcross the Pond, Google Creative Labs, We Are Social, Tribal Worldwide, M&C Saatchi, VCCP, GaurdianLabs, Recipe Senior Creative Freelance September 2013  –  December 2014  (1 year 4 months) Regular freelance creative gigs at London's top agencies:  \nAcross the Pond, Google Creative Labs, We Are Social, Tribal Worldwide, M&C Saatchi, VCCP, GaurdianLabs, Recipe Creative glue Isobar June 2012  –  September 2013  (1 year 4 months) Worked on exciting projects for Toyota, Pringles, Google, Eristoff, Auto Trader, The Guardian, and a little bit of Kellogg's. Creative glue Isobar June 2012  –  September 2013  (1 year 4 months) Worked on exciting projects for Toyota, Pringles, Google, Eristoff, Auto Trader, The Guardian, and a little bit of Kellogg's. Creative iris worldwide January 2010  –  June 2012  (2 years 6 months) Client list: Sony, COI, Unilever, Dairy Crest, Barclaycard, Disney, Kerry Foods, Orange, Philips, PepsiCo & Britvic Creative iris worldwide January 2010  –  June 2012  (2 years 6 months) Client list: Sony, COI, Unilever, Dairy Crest, Barclaycard, Disney, Kerry Foods, Orange, Philips, PepsiCo & Britvic Copywriter Grey 2009  –  2010  (1 year) Mumbai Area, India Client list: Audi, Pantene, JM Financial, Axa Life Insurance Copywriter Grey 2009  –  2010  (1 year) Mumbai Area, India Client list: Audi, Pantene, JM Financial, Axa Life Insurance Copywriter Saatchi & Saatchi 2008  –  2008  (less than a year) Mumbai Area, India Client list: Cox & Kings, Ariel, Olay, Calcium Sanchoz and Tetley Copywriter Saatchi & Saatchi 2008  –  2008  (less than a year) Mumbai Area, India Client list: Cox & Kings, Ariel, Olay, Calcium Sanchoz and Tetley Jnr Copywriter Feref Ltd 2007  –  2008  (1 year) Feref is a Movie & Entertainment specialist marketing agency, I worked mainly on digital campaigns for top movie clients like Fox, Paramount and Warner Bros. Jnr Copywriter Feref Ltd 2007  –  2008  (1 year) Feref is a Movie & Entertainment specialist marketing agency, I worked mainly on digital campaigns for top movie clients like Fox, Paramount and Warner Bros. Skills Copywriting Advertising Creative Development Film Digital Marketing Creative Direction Interactive Advertising Entertainment Commercials Art Direction Creative Strategy Facebook Outdoor Advertising Concept Development Skills  Copywriting Advertising Creative Development Film Digital Marketing Creative Direction Interactive Advertising Entertainment Commercials Art Direction Creative Strategy Facebook Outdoor Advertising Concept Development Copywriting Advertising Creative Development Film Digital Marketing Creative Direction Interactive Advertising Entertainment Commercials Art Direction Creative Strategy Facebook Outdoor Advertising Concept Development Copywriting Advertising Creative Development Film Digital Marketing Creative Direction Interactive Advertising Entertainment Commercials Art Direction Creative Strategy Facebook Outdoor Advertising Concept Development Education University of Gloucestershire BA (Hons),  Creative Advertising 2005  – 2008 Won Best Stand at show D&AD New Blood 2008, Gained place on D&AD Gradate Recruitment Scheme through portfolio surgery and shortlisted for Shelf Awards 2008 University of Gloucestershire BA (Hons),  Creative Advertising 2005  – 2008 Won Best Stand at show D&AD New Blood 2008, Gained place on D&AD Gradate Recruitment Scheme through portfolio surgery and shortlisted for Shelf Awards 2008 University of Gloucestershire BA (Hons),  Creative Advertising 2005  – 2008 Won Best Stand at show D&AD New Blood 2008, Gained place on D&AD Gradate Recruitment Scheme through portfolio surgery and shortlisted for Shelf Awards 2008 University of Gloucestershire BA (Hons),  Creative Advertising 2005  – 2008 Won Best Stand at show D&AD New Blood 2008, Gained place on D&AD Gradate Recruitment Scheme through portfolio surgery and shortlisted for Shelf Awards 2008 Honors & Awards Additional Honors & Awards Dadi award \nIAB Creative Showcase - 1st Place \nWebby Honouree \nMAA Best Award \nFWA Mobile site of the day \nIPM - Gold & Silver \nMAA Best Award - Merit \nLondon Long Copy - Finalist \n24 Hour Ad Challenge - Shortlisted \nD&AD Best in Show \nD&AD Portfolio Award Additional Honors & Awards Dadi award \nIAB Creative Showcase - 1st Place \nWebby Honouree \nMAA Best Award \nFWA Mobile site of the day \nIPM - Gold & Silver \nMAA Best Award - Merit \nLondon Long Copy - Finalist \n24 Hour Ad Challenge - Shortlisted \nD&AD Best in Show \nD&AD Portfolio Award Additional Honors & Awards Dadi award \nIAB Creative Showcase - 1st Place \nWebby Honouree \nMAA Best Award \nFWA Mobile site of the day \nIPM - Gold & Silver \nMAA Best Award - Merit \nLondon Long Copy - Finalist \n24 Hour Ad Challenge - Shortlisted \nD&AD Best in Show \nD&AD Portfolio Award Additional Honors & Awards Dadi award \nIAB Creative Showcase - 1st Place \nWebby Honouree \nMAA Best Award \nFWA Mobile site of the day \nIPM - Gold & Silver \nMAA Best Award - Merit \nLondon Long Copy - Finalist \n24 Hour Ad Challenge - Shortlisted \nD&AD Best in Show \nD&AD Portfolio Award ", "Experience Freelance Senior Designer Johannes Leonardo April 2014  –  September 2014  (6 months) Freelance Designer Kate Spade Saturday May 2013  –  June 2013  (2 months) NYC Designer Google Creative Labs January 2013  –  March 2013  (3 months) New York Design Director Silver and Partners October 2011  –  October 2012  (1 year 1 month) Art Director/Designer Anomaly October 2008  –  February 2011  (2 years 5 months) Designer Apple Inc. October 2006  –  November 2007  (1 year 2 months) Freelance Senior Designer Johannes Leonardo April 2014  –  September 2014  (6 months) Freelance Senior Designer Johannes Leonardo April 2014  –  September 2014  (6 months) Freelance Designer Kate Spade Saturday May 2013  –  June 2013  (2 months) NYC Freelance Designer Kate Spade Saturday May 2013  –  June 2013  (2 months) NYC Designer Google Creative Labs January 2013  –  March 2013  (3 months) New York Designer Google Creative Labs January 2013  –  March 2013  (3 months) New York Design Director Silver and Partners October 2011  –  October 2012  (1 year 1 month) Design Director Silver and Partners October 2011  –  October 2012  (1 year 1 month) Art Director/Designer Anomaly October 2008  –  February 2011  (2 years 5 months) Art Director/Designer Anomaly October 2008  –  February 2011  (2 years 5 months) Designer Apple Inc. October 2006  –  November 2007  (1 year 2 months) Designer Apple Inc. October 2006  –  November 2007  (1 year 2 months) Skills Photoshop Indesign Illustrator Facebooking Twittering Tumblring Running Showering Biking Skatboarding Motorcycling Tattooing Reading Dining Laughing Art Direction Mountain Biking InDesign Interactive Advertising Concept Development Creative Strategy Tattoo See 7+     See less Skills  Photoshop Indesign Illustrator Facebooking Twittering Tumblring Running Showering Biking Skatboarding Motorcycling Tattooing Reading Dining Laughing Art Direction Mountain Biking InDesign Interactive Advertising Concept Development Creative Strategy Tattoo See 7+     See less Photoshop Indesign Illustrator Facebooking Twittering Tumblring Running Showering Biking Skatboarding Motorcycling Tattooing Reading Dining Laughing Art Direction Mountain Biking InDesign Interactive Advertising Concept Development Creative Strategy Tattoo See 7+     See less Photoshop Indesign Illustrator Facebooking Twittering Tumblring Running Showering Biking Skatboarding Motorcycling Tattooing Reading Dining Laughing Art Direction Mountain Biking InDesign Interactive Advertising Concept Development Creative Strategy Tattoo See 7+     See less Education Pratt Institute BFA,  Illustration ,  Package Design ,  Advertising ,  Graphic Design 2002  – 2006 Pratt Senior Show Pratt Institute BFA,  Illustration ,  Package Design ,  Advertising ,  Graphic Design 2002  – 2006 Pratt Senior Show Pratt Institute BFA,  Illustration ,  Package Design ,  Advertising ,  Graphic Design 2002  – 2006 Pratt Senior Show Pratt Institute BFA,  Illustration ,  Package Design ,  Advertising ,  Graphic Design 2002  – 2006 Pratt Senior Show Honors & Awards Art Director/designer Cannes Lion, 2011 Grand Prix for Diesel Be Stupid. \nGold + Silver Pencils for Diesel \nSome other stuff for collateral. \n \n Art Director/designer Cannes Lion, 2011 Grand Prix for Diesel Be Stupid. \nGold + Silver Pencils for Diesel \nSome other stuff for collateral. \n \n Art Director/designer Cannes Lion, 2011 Grand Prix for Diesel Be Stupid. \nGold + Silver Pencils for Diesel \nSome other stuff for collateral. \n \n Art Director/designer Cannes Lion, 2011 Grand Prix for Diesel Be Stupid. \nGold + Silver Pencils for Diesel \nSome other stuff for collateral. \n \n ", "Summary Colin is a Creative Director with 14 years of experience at traditional and digital agencies across the country. Starting his career at TBWA Chiat NY then moving onto Cliff Freeman, McCann NY, Hal Riney SF, Crispin, R/GA, and GREY NY. Just before joining Sid Lee he was at Google Creative Labs and 72andSunny NY.  \nHe’s been on some iconic brands such as Samsung, Merrell, Smirnoff, Crown Royal, NFL, VW, Burger King, Google and Nike. Most notably his Domino’s Pizza Tracker work which is recognized as best digital of the decade by One Club and his Nike Film Room work that taught kids how to ball like their favorite superstars. His work has been recognized by Cannes, One Show, D&AD, AICP, Andy’s, Clios, Communication Arts, Art Directors Club, Tomorrow Awards, Webby's, SXSW and LIA.  \nAt Sid Lee his main focus is to bring integrated thinking and use his experience to lead teams to create famous work.  \n Summary Colin is a Creative Director with 14 years of experience at traditional and digital agencies across the country. Starting his career at TBWA Chiat NY then moving onto Cliff Freeman, McCann NY, Hal Riney SF, Crispin, R/GA, and GREY NY. Just before joining Sid Lee he was at Google Creative Labs and 72andSunny NY.  \nHe’s been on some iconic brands such as Samsung, Merrell, Smirnoff, Crown Royal, NFL, VW, Burger King, Google and Nike. Most notably his Domino’s Pizza Tracker work which is recognized as best digital of the decade by One Club and his Nike Film Room work that taught kids how to ball like their favorite superstars. His work has been recognized by Cannes, One Show, D&AD, AICP, Andy’s, Clios, Communication Arts, Art Directors Club, Tomorrow Awards, Webby's, SXSW and LIA.  \nAt Sid Lee his main focus is to bring integrated thinking and use his experience to lead teams to create famous work.  \n Colin is a Creative Director with 14 years of experience at traditional and digital agencies across the country. Starting his career at TBWA Chiat NY then moving onto Cliff Freeman, McCann NY, Hal Riney SF, Crispin, R/GA, and GREY NY. Just before joining Sid Lee he was at Google Creative Labs and 72andSunny NY.  \nHe’s been on some iconic brands such as Samsung, Merrell, Smirnoff, Crown Royal, NFL, VW, Burger King, Google and Nike. Most notably his Domino’s Pizza Tracker work which is recognized as best digital of the decade by One Club and his Nike Film Room work that taught kids how to ball like their favorite superstars. His work has been recognized by Cannes, One Show, D&AD, AICP, Andy’s, Clios, Communication Arts, Art Directors Club, Tomorrow Awards, Webby's, SXSW and LIA.  \nAt Sid Lee his main focus is to bring integrated thinking and use his experience to lead teams to create famous work.  \n Colin is a Creative Director with 14 years of experience at traditional and digital agencies across the country. Starting his career at TBWA Chiat NY then moving onto Cliff Freeman, McCann NY, Hal Riney SF, Crispin, R/GA, and GREY NY. Just before joining Sid Lee he was at Google Creative Labs and 72andSunny NY.  \nHe’s been on some iconic brands such as Samsung, Merrell, Smirnoff, Crown Royal, NFL, VW, Burger King, Google and Nike. Most notably his Domino’s Pizza Tracker work which is recognized as best digital of the decade by One Club and his Nike Film Room work that taught kids how to ball like their favorite superstars. His work has been recognized by Cannes, One Show, D&AD, AICP, Andy’s, Clios, Communication Arts, Art Directors Club, Tomorrow Awards, Webby's, SXSW and LIA.  \nAt Sid Lee his main focus is to bring integrated thinking and use his experience to lead teams to create famous work.  \n Experience Creative Director SID LEE May 2015  – Present (4 months) Greater New York City Area Working on Merrell and new business.  Freelance Creative Director SID LEE April 2015  –  May 2015  (2 months) Greater New York City Area Freelance Creative Director 72andSunny January 2015  –  April 2015  (4 months) Greater New York City Area Freelance Creative Director Marcel Worldwide October 2014  –  January 2015  (4 months) NYC Freelance Creative Director / Art Direction Google March 2014  –  October 2014  (8 months) Greater New York City Area Worked on a number of projects two of them being spacecraftforall.com and the Android branding campaign. \n \nA Spacecraft For All: The Chrome Experiment \n2014 FWA Site of the Month, August \n2014 FWA Site of the Day, August \n2014 Mobile Site of the Day, August  \n2014 Awwwards Site of the Day, September 2014 Awwwards Site of the Month, September Creative Director, Digital Integration Grey Group July 2012  –  January 2014  (1 year 7 months) New York, NY Helping to create new and interesting things for brands. Using any modern means necessary. Mostly on Marriott Hotels and the NFL. Creative Director R/GA January 2009  –  July 2012  (3 years 7 months) NY Creating content and solving problems for clients with my partner Jason Hoff.  \n \nGoogle Wallet Integrated Campaign \n \n2013 Commarts Digital Annual \n2012 Andy's Silver, Reset \n2012 One Show Interactive Shortlist, Brand Transformation \n2012 One Show Interactive Shortlist, Mobile App \n2012 AICP NEXT Award for Mobile \n2012 Webby Winner, Experimental & Innovation \n2012 Webby Nominee, Online Commercials \n2012 Clio Shortlist, Mobile Apps \n2012 One Show Entertainment Finalist \n2012 Tomorrow Awards Finalist \n \nGoogle Offers OOH \n2012 OBIES Finalist \"Big Tags\" \n2012 OBIES Silver \"Hanging Tags\" \n \nNike The Film Room \n2011 Gold Andy \n2011 D&AD Annual \n2011 Creative Review Annual \"Best of Book\" \n2011 Gold Clio \n2011 AICP NEXT Award for Experiential \n2011 Cannes Bronze Lion \n2011 Cannes Titanium and Integrated Shortlist \n2011 Jay Chiat Award Creative Technologies Gold \n2011 London International Awards Gold - Environmental \n2011 London International Awards Gold - The NEW Category \n2011 London International Awards Silver - Sports \n \nNike Black Mamba Site/Twitter Viz \n2011 Cannes Bronze Lion \n2011 SAMMY Awards Best in Show \n2011 SAMMY Awards Best Social Creative \n2011 SAMMY Awards Best Social Promotion for a Product Launch \n2012 Tomorrow Awards - Shortlist \n2012 One Show Interactive Silver \n2012 Andy's Shortlist \n \nNike Epic - Playoffs Player Twitter Visualization \n2012 Tomorrow Awards - Shortlist \n2012 SXSW Peoples Choice Finalist \n2012 SXSW Social Finalist \n2012 One Show Finalist Associate Creative Director Cliff Freeman and Partners March 2008  –  January 2009  (11 months) Digital and Traditional on Snapple, Quiznos, and Valley National Bank. Art Director Crispin Porter + Bogusky November 2006  –  March 2008  (1 year 5 months) Digital and Traditional for VW, Burger King, Bell Helmets, Truth Anti-Smoking, American Express, Dominos and Geek Squad. \n \nDomino's Pizza Tracker  \n2010 One Club: Best of the Digital Decade  \n2008 One Show Gold  \n2008 Clio Silver \n2008 LIAA Silver \n \nDomino's You Got 30 Minutes \n2009 Clio - Integrated Campaign - Bronze \n2009 Cannes - Integrated campaign - Bronze Senior Art Director Riney April 2005  –  November 2006  (1 year 8 months) San Francisco Bay Area Traditional and Digital Creative for Sprint, Harputs Adidas, Anthem Blue Cross & Blue Shield, Peter Kim Jewelry, Cord Blood Research, HP, AAA Auto Club & Insurance \n \nPeter Kim Jewelry \"Valentines Day\" \n2006 Cannes Shortlist \n \nPeter Kim Jewelry Make it Up to Her Print \n2006 NY Festivals Finalist \n2006 Cannes Shortlist \n \nHarputs Adidas Spring/Summer Statue \n2006 NY Festivals Finalist  \n \nPeter Kim Jewelry \"Ring\"  \n2006 NY Festivals Finalist Art Director McCann Erickson 2002  –  2003  (1 year) Traditional Creative for Xbox, Rolling Rock, Microsoft, \nPapermate, Black & Decker, Wendy’s and Coca-Cola Classic. Jr. Art Director Cliff Freeman and Partners December 2000  –  December 2001  (1 year 1 month) Traditional Creative for Hardee’s, Staples, Quiznos, Mohegan Sun, Fanta Coca-Cola and Mike’s Hard Lemonade. Jr. Copywriter TBWA\\Chiat\\Day June 2000  –  December 2000  (7 months) Traditional Creative for Circuit City, Samsonite, NYC Teaching \nFellows and Stockback.com. Creative Director SID LEE May 2015  – Present (4 months) Greater New York City Area Working on Merrell and new business.  Creative Director SID LEE May 2015  – Present (4 months) Greater New York City Area Working on Merrell and new business.  Freelance Creative Director SID LEE April 2015  –  May 2015  (2 months) Greater New York City Area Freelance Creative Director SID LEE April 2015  –  May 2015  (2 months) Greater New York City Area Freelance Creative Director 72andSunny January 2015  –  April 2015  (4 months) Greater New York City Area Freelance Creative Director 72andSunny January 2015  –  April 2015  (4 months) Greater New York City Area Freelance Creative Director Marcel Worldwide October 2014  –  January 2015  (4 months) NYC Freelance Creative Director Marcel Worldwide October 2014  –  January 2015  (4 months) NYC Freelance Creative Director / Art Direction Google March 2014  –  October 2014  (8 months) Greater New York City Area Worked on a number of projects two of them being spacecraftforall.com and the Android branding campaign. \n \nA Spacecraft For All: The Chrome Experiment \n2014 FWA Site of the Month, August \n2014 FWA Site of the Day, August \n2014 Mobile Site of the Day, August  \n2014 Awwwards Site of the Day, September 2014 Awwwards Site of the Month, September Freelance Creative Director / Art Direction Google March 2014  –  October 2014  (8 months) Greater New York City Area Worked on a number of projects two of them being spacecraftforall.com and the Android branding campaign. \n \nA Spacecraft For All: The Chrome Experiment \n2014 FWA Site of the Month, August \n2014 FWA Site of the Day, August \n2014 Mobile Site of the Day, August  \n2014 Awwwards Site of the Day, September 2014 Awwwards Site of the Month, September Creative Director, Digital Integration Grey Group July 2012  –  January 2014  (1 year 7 months) New York, NY Helping to create new and interesting things for brands. Using any modern means necessary. Mostly on Marriott Hotels and the NFL. Creative Director, Digital Integration Grey Group July 2012  –  January 2014  (1 year 7 months) New York, NY Helping to create new and interesting things for brands. Using any modern means necessary. Mostly on Marriott Hotels and the NFL. Creative Director R/GA January 2009  –  July 2012  (3 years 7 months) NY Creating content and solving problems for clients with my partner Jason Hoff.  \n \nGoogle Wallet Integrated Campaign \n \n2013 Commarts Digital Annual \n2012 Andy's Silver, Reset \n2012 One Show Interactive Shortlist, Brand Transformation \n2012 One Show Interactive Shortlist, Mobile App \n2012 AICP NEXT Award for Mobile \n2012 Webby Winner, Experimental & Innovation \n2012 Webby Nominee, Online Commercials \n2012 Clio Shortlist, Mobile Apps \n2012 One Show Entertainment Finalist \n2012 Tomorrow Awards Finalist \n \nGoogle Offers OOH \n2012 OBIES Finalist \"Big Tags\" \n2012 OBIES Silver \"Hanging Tags\" \n \nNike The Film Room \n2011 Gold Andy \n2011 D&AD Annual \n2011 Creative Review Annual \"Best of Book\" \n2011 Gold Clio \n2011 AICP NEXT Award for Experiential \n2011 Cannes Bronze Lion \n2011 Cannes Titanium and Integrated Shortlist \n2011 Jay Chiat Award Creative Technologies Gold \n2011 London International Awards Gold - Environmental \n2011 London International Awards Gold - The NEW Category \n2011 London International Awards Silver - Sports \n \nNike Black Mamba Site/Twitter Viz \n2011 Cannes Bronze Lion \n2011 SAMMY Awards Best in Show \n2011 SAMMY Awards Best Social Creative \n2011 SAMMY Awards Best Social Promotion for a Product Launch \n2012 Tomorrow Awards - Shortlist \n2012 One Show Interactive Silver \n2012 Andy's Shortlist \n \nNike Epic - Playoffs Player Twitter Visualization \n2012 Tomorrow Awards - Shortlist \n2012 SXSW Peoples Choice Finalist \n2012 SXSW Social Finalist \n2012 One Show Finalist Creative Director R/GA January 2009  –  July 2012  (3 years 7 months) NY Creating content and solving problems for clients with my partner Jason Hoff.  \n \nGoogle Wallet Integrated Campaign \n \n2013 Commarts Digital Annual \n2012 Andy's Silver, Reset \n2012 One Show Interactive Shortlist, Brand Transformation \n2012 One Show Interactive Shortlist, Mobile App \n2012 AICP NEXT Award for Mobile \n2012 Webby Winner, Experimental & Innovation \n2012 Webby Nominee, Online Commercials \n2012 Clio Shortlist, Mobile Apps \n2012 One Show Entertainment Finalist \n2012 Tomorrow Awards Finalist \n \nGoogle Offers OOH \n2012 OBIES Finalist \"Big Tags\" \n2012 OBIES Silver \"Hanging Tags\" \n \nNike The Film Room \n2011 Gold Andy \n2011 D&AD Annual \n2011 Creative Review Annual \"Best of Book\" \n2011 Gold Clio \n2011 AICP NEXT Award for Experiential \n2011 Cannes Bronze Lion \n2011 Cannes Titanium and Integrated Shortlist \n2011 Jay Chiat Award Creative Technologies Gold \n2011 London International Awards Gold - Environmental \n2011 London International Awards Gold - The NEW Category \n2011 London International Awards Silver - Sports \n \nNike Black Mamba Site/Twitter Viz \n2011 Cannes Bronze Lion \n2011 SAMMY Awards Best in Show \n2011 SAMMY Awards Best Social Creative \n2011 SAMMY Awards Best Social Promotion for a Product Launch \n2012 Tomorrow Awards - Shortlist \n2012 One Show Interactive Silver \n2012 Andy's Shortlist \n \nNike Epic - Playoffs Player Twitter Visualization \n2012 Tomorrow Awards - Shortlist \n2012 SXSW Peoples Choice Finalist \n2012 SXSW Social Finalist \n2012 One Show Finalist Associate Creative Director Cliff Freeman and Partners March 2008  –  January 2009  (11 months) Digital and Traditional on Snapple, Quiznos, and Valley National Bank. Associate Creative Director Cliff Freeman and Partners March 2008  –  January 2009  (11 months) Digital and Traditional on Snapple, Quiznos, and Valley National Bank. Art Director Crispin Porter + Bogusky November 2006  –  March 2008  (1 year 5 months) Digital and Traditional for VW, Burger King, Bell Helmets, Truth Anti-Smoking, American Express, Dominos and Geek Squad. \n \nDomino's Pizza Tracker  \n2010 One Club: Best of the Digital Decade  \n2008 One Show Gold  \n2008 Clio Silver \n2008 LIAA Silver \n \nDomino's You Got 30 Minutes \n2009 Clio - Integrated Campaign - Bronze \n2009 Cannes - Integrated campaign - Bronze Art Director Crispin Porter + Bogusky November 2006  –  March 2008  (1 year 5 months) Digital and Traditional for VW, Burger King, Bell Helmets, Truth Anti-Smoking, American Express, Dominos and Geek Squad. \n \nDomino's Pizza Tracker  \n2010 One Club: Best of the Digital Decade  \n2008 One Show Gold  \n2008 Clio Silver \n2008 LIAA Silver \n \nDomino's You Got 30 Minutes \n2009 Clio - Integrated Campaign - Bronze \n2009 Cannes - Integrated campaign - Bronze Senior Art Director Riney April 2005  –  November 2006  (1 year 8 months) San Francisco Bay Area Traditional and Digital Creative for Sprint, Harputs Adidas, Anthem Blue Cross & Blue Shield, Peter Kim Jewelry, Cord Blood Research, HP, AAA Auto Club & Insurance \n \nPeter Kim Jewelry \"Valentines Day\" \n2006 Cannes Shortlist \n \nPeter Kim Jewelry Make it Up to Her Print \n2006 NY Festivals Finalist \n2006 Cannes Shortlist \n \nHarputs Adidas Spring/Summer Statue \n2006 NY Festivals Finalist  \n \nPeter Kim Jewelry \"Ring\"  \n2006 NY Festivals Finalist Senior Art Director Riney April 2005  –  November 2006  (1 year 8 months) San Francisco Bay Area Traditional and Digital Creative for Sprint, Harputs Adidas, Anthem Blue Cross & Blue Shield, Peter Kim Jewelry, Cord Blood Research, HP, AAA Auto Club & Insurance \n \nPeter Kim Jewelry \"Valentines Day\" \n2006 Cannes Shortlist \n \nPeter Kim Jewelry Make it Up to Her Print \n2006 NY Festivals Finalist \n2006 Cannes Shortlist \n \nHarputs Adidas Spring/Summer Statue \n2006 NY Festivals Finalist  \n \nPeter Kim Jewelry \"Ring\"  \n2006 NY Festivals Finalist Art Director McCann Erickson 2002  –  2003  (1 year) Traditional Creative for Xbox, Rolling Rock, Microsoft, \nPapermate, Black & Decker, Wendy’s and Coca-Cola Classic. Art Director McCann Erickson 2002  –  2003  (1 year) Traditional Creative for Xbox, Rolling Rock, Microsoft, \nPapermate, Black & Decker, Wendy’s and Coca-Cola Classic. Jr. Art Director Cliff Freeman and Partners December 2000  –  December 2001  (1 year 1 month) Traditional Creative for Hardee’s, Staples, Quiznos, Mohegan Sun, Fanta Coca-Cola and Mike’s Hard Lemonade. Jr. Art Director Cliff Freeman and Partners December 2000  –  December 2001  (1 year 1 month) Traditional Creative for Hardee’s, Staples, Quiznos, Mohegan Sun, Fanta Coca-Cola and Mike’s Hard Lemonade. Jr. Copywriter TBWA\\Chiat\\Day June 2000  –  December 2000  (7 months) Traditional Creative for Circuit City, Samsonite, NYC Teaching \nFellows and Stockback.com. Jr. Copywriter TBWA\\Chiat\\Day June 2000  –  December 2000  (7 months) Traditional Creative for Circuit City, Samsonite, NYC Teaching \nFellows and Stockback.com. Languages Korean  Korean  Korean  Skills Integrated Marketing Creative Direction Concept Development Art Direction InDesign Advertising Outdoor Advertising Television Creative Development User Experience Brand Management Creative Strategy Interactive Advertising User Interface Design Information Architecture Photography Digital Strategy Interaction Design Brand Development Interactive Marketing Creative Campaign... See 6+     See less Skills  Integrated Marketing Creative Direction Concept Development Art Direction InDesign Advertising Outdoor Advertising Television Creative Development User Experience Brand Management Creative Strategy Interactive Advertising User Interface Design Information Architecture Photography Digital Strategy Interaction Design Brand Development Interactive Marketing Creative Campaign... See 6+     See less Integrated Marketing Creative Direction Concept Development Art Direction InDesign Advertising Outdoor Advertising Television Creative Development User Experience Brand Management Creative Strategy Interactive Advertising User Interface Design Information Architecture Photography Digital Strategy Interaction Design Brand Development Interactive Marketing Creative Campaign... See 6+     See less Integrated Marketing Creative Direction Concept Development Art Direction InDesign Advertising Outdoor Advertising Television Creative Development User Experience Brand Management Creative Strategy Interactive Advertising User Interface Design Information Architecture Photography Digital Strategy Interaction Design Brand Development Interactive Marketing Creative Campaign... See 6+     See less Education School of Visual Arts BFA,  Advertising 1996  – 2000 Nikon OOH \n2000 Student Andy Award  \n2000 Silver Student Art Directors Club School of Visual Arts BFA,  Advertising 1996  – 2000 Nikon OOH \n2000 Student Andy Award  \n2000 Silver Student Art Directors Club School of Visual Arts BFA,  Advertising 1996  – 2000 Nikon OOH \n2000 Student Andy Award  \n2000 Silver Student Art Directors Club School of Visual Arts BFA,  Advertising 1996  – 2000 Nikon OOH \n2000 Student Andy Award  \n2000 Silver Student Art Directors Club ", "Summary Portfolio: LeBeardMagnifique.com \n \nAlex Ohannessian (otherwise known as ohanna / ohannanana / alex o.).  \n \nI work. Creative at Publicis Seattle. Previously, freelanced around New York at BBH, 360i and Publicis for over a year. Before that, worked full-time at BBDO/Proximity NY (Sr. Art Director) working mainly on Visa (FIFA, Olympics, Signature and Prepaid). I also spent some years at SapientNitro (Coca-Cola & Powerade - FIFA) and at AlmaDDB (StateFarm, McDonald's and Pepsi).  \n \nExperienced in both digital and traditional advertising. I love every part of the creative process, specially the ideating / concepting stages. My focus is art direction, but I write whenever possible (I have done some of the writing on past agency and personal projects). Have worked on several sports centered projects.  \n \nI teach. I have been an instructor at Miami Ad School since 2010 - taught Everything is Media, Interactive Concepts and Head to Head (competitions class) both at the Miami and Brooklyn locations. I have also done guest lectures at NYU and have been a part-time lecturer at the University of Miami.  \n \nFamily guy. Married to Nadia. Parents of Toulouse (our shiny-gray-coat Weimaraner).  \n \nFootball. Fútbol. ˈfo͝otˌbôl. I seem to gravitate towards soccer a bit - at work, at home or at a stadium (Nacional and Uruguay) and sometimes, on the pitch.  \n \nMusician. I play guitar (+ some charango) and sing [badly]. Compose music and lyrics whenever possible. Slightly obsessed with trying to play Hendrix songs. Used to play in a band [TrecePuentes], which is how I met my wife [great success / case study for being in a band]. \n \nMy next music goal is to record an album (some day) and learn Lou Reed's Perfect Day on the piano (just the one song, play it at a party and when people ask for more say \"but I'm le tired…\").  \n \nMontevideo [Uruguay] → Miami → NYC → Seattle \n[Buffalo, Iowa, Puerto Rico, & Madrid in between]. \n Summary Portfolio: LeBeardMagnifique.com \n \nAlex Ohannessian (otherwise known as ohanna / ohannanana / alex o.).  \n \nI work. Creative at Publicis Seattle. Previously, freelanced around New York at BBH, 360i and Publicis for over a year. Before that, worked full-time at BBDO/Proximity NY (Sr. Art Director) working mainly on Visa (FIFA, Olympics, Signature and Prepaid). I also spent some years at SapientNitro (Coca-Cola & Powerade - FIFA) and at AlmaDDB (StateFarm, McDonald's and Pepsi).  \n \nExperienced in both digital and traditional advertising. I love every part of the creative process, specially the ideating / concepting stages. My focus is art direction, but I write whenever possible (I have done some of the writing on past agency and personal projects). Have worked on several sports centered projects.  \n \nI teach. I have been an instructor at Miami Ad School since 2010 - taught Everything is Media, Interactive Concepts and Head to Head (competitions class) both at the Miami and Brooklyn locations. I have also done guest lectures at NYU and have been a part-time lecturer at the University of Miami.  \n \nFamily guy. Married to Nadia. Parents of Toulouse (our shiny-gray-coat Weimaraner).  \n \nFootball. Fútbol. ˈfo͝otˌbôl. I seem to gravitate towards soccer a bit - at work, at home or at a stadium (Nacional and Uruguay) and sometimes, on the pitch.  \n \nMusician. I play guitar (+ some charango) and sing [badly]. Compose music and lyrics whenever possible. Slightly obsessed with trying to play Hendrix songs. Used to play in a band [TrecePuentes], which is how I met my wife [great success / case study for being in a band]. \n \nMy next music goal is to record an album (some day) and learn Lou Reed's Perfect Day on the piano (just the one song, play it at a party and when people ask for more say \"but I'm le tired…\").  \n \nMontevideo [Uruguay] → Miami → NYC → Seattle \n[Buffalo, Iowa, Puerto Rico, & Madrid in between]. \n Portfolio: LeBeardMagnifique.com \n \nAlex Ohannessian (otherwise known as ohanna / ohannanana / alex o.).  \n \nI work. Creative at Publicis Seattle. Previously, freelanced around New York at BBH, 360i and Publicis for over a year. Before that, worked full-time at BBDO/Proximity NY (Sr. Art Director) working mainly on Visa (FIFA, Olympics, Signature and Prepaid). I also spent some years at SapientNitro (Coca-Cola & Powerade - FIFA) and at AlmaDDB (StateFarm, McDonald's and Pepsi).  \n \nExperienced in both digital and traditional advertising. I love every part of the creative process, specially the ideating / concepting stages. My focus is art direction, but I write whenever possible (I have done some of the writing on past agency and personal projects). Have worked on several sports centered projects.  \n \nI teach. I have been an instructor at Miami Ad School since 2010 - taught Everything is Media, Interactive Concepts and Head to Head (competitions class) both at the Miami and Brooklyn locations. I have also done guest lectures at NYU and have been a part-time lecturer at the University of Miami.  \n \nFamily guy. Married to Nadia. Parents of Toulouse (our shiny-gray-coat Weimaraner).  \n \nFootball. Fútbol. ˈfo͝otˌbôl. I seem to gravitate towards soccer a bit - at work, at home or at a stadium (Nacional and Uruguay) and sometimes, on the pitch.  \n \nMusician. I play guitar (+ some charango) and sing [badly]. Compose music and lyrics whenever possible. Slightly obsessed with trying to play Hendrix songs. Used to play in a band [TrecePuentes], which is how I met my wife [great success / case study for being in a band]. \n \nMy next music goal is to record an album (some day) and learn Lou Reed's Perfect Day on the piano (just the one song, play it at a party and when people ask for more say \"but I'm le tired…\").  \n \nMontevideo [Uruguay] → Miami → NYC → Seattle \n[Buffalo, Iowa, Puerto Rico, & Madrid in between]. \n Portfolio: LeBeardMagnifique.com \n \nAlex Ohannessian (otherwise known as ohanna / ohannanana / alex o.).  \n \nI work. Creative at Publicis Seattle. Previously, freelanced around New York at BBH, 360i and Publicis for over a year. Before that, worked full-time at BBDO/Proximity NY (Sr. Art Director) working mainly on Visa (FIFA, Olympics, Signature and Prepaid). I also spent some years at SapientNitro (Coca-Cola & Powerade - FIFA) and at AlmaDDB (StateFarm, McDonald's and Pepsi).  \n \nExperienced in both digital and traditional advertising. I love every part of the creative process, specially the ideating / concepting stages. My focus is art direction, but I write whenever possible (I have done some of the writing on past agency and personal projects). Have worked on several sports centered projects.  \n \nI teach. I have been an instructor at Miami Ad School since 2010 - taught Everything is Media, Interactive Concepts and Head to Head (competitions class) both at the Miami and Brooklyn locations. I have also done guest lectures at NYU and have been a part-time lecturer at the University of Miami.  \n \nFamily guy. Married to Nadia. Parents of Toulouse (our shiny-gray-coat Weimaraner).  \n \nFootball. Fútbol. ˈfo͝otˌbôl. I seem to gravitate towards soccer a bit - at work, at home or at a stadium (Nacional and Uruguay) and sometimes, on the pitch.  \n \nMusician. I play guitar (+ some charango) and sing [badly]. Compose music and lyrics whenever possible. Slightly obsessed with trying to play Hendrix songs. Used to play in a band [TrecePuentes], which is how I met my wife [great success / case study for being in a band]. \n \nMy next music goal is to record an album (some day) and learn Lou Reed's Perfect Day on the piano (just the one song, play it at a party and when people ask for more say \"but I'm le tired…\").  \n \nMontevideo [Uruguay] → Miami → NYC → Seattle \n[Buffalo, Iowa, Puerto Rico, & Madrid in between]. \n Experience Senior Art Director Publicis Seattle June 2015  – Present (3 months) Greater Seattle Area Instructor Miami Ad School March 2010  – Present (5 years 6 months) Brooklyn, New York Currently teaching Everything is Media (Dumbo, New York location). \nPreviously, I've taught Interactive Concepts (Miami). Freelance Creative 360i December 2014  –  December 2014  (1 month) Freelance Creative Bartle Bogle Hegarty NY October 2014  –  November 2014  (2 months) Freelance ACD / Art Director Publicis August 2014  –  October 2014  (3 months) Working mainly on Coffee Mate. Freelance Creative Bartle Bogle Hegarty NY June 2014  –  August 2014  (3 months) new york Freelance ACD / Art Director Publicis April 2014  –  June 2014  (3 months) Greater New York City Area Creative | Senior Art Director Proximity - BBDO NY. July 2012  –  April 2014  (1 year 10 months) Greater New York City Area Team Visa. Focused mostly on Visa FIFA, Visa Olympics, some Visa NFL and Prepaid. Creative | Art Director Alma DDB March 2011  –  June 2012  (1 year 4 months) Working on State Farm, McDonalds and Pepsi. Team Leader - PhilADthropy University of Miami February 2012  –  February 2012  (1 month) School of Communications - PhilADthropy Participated on this year's University of Miami's PhilADthropy event as a Team Leader. Each Team Leader is assigned a group of UM students to work for 25 straight hours for a given non-profit organization. Creative | Designer - Art Director SapientNitro July 2008  –  March 2011  (2 years 9 months) Creative / Consultant CameloPardus February 2009  –  February 2011  (2 years 1 month) help the Bikinator with design, communication ideas, and whatever she needs Part-time lecturer - Intro to Graphic Design University of Miami January 2009  –  May 2009  (5 months) Creative Associate Echovant March 2004  –  July 2006  (2 years 5 months) Senior Art Director Publicis Seattle June 2015  – Present (3 months) Greater Seattle Area Senior Art Director Publicis Seattle June 2015  – Present (3 months) Greater Seattle Area Instructor Miami Ad School March 2010  – Present (5 years 6 months) Brooklyn, New York Currently teaching Everything is Media (Dumbo, New York location). \nPreviously, I've taught Interactive Concepts (Miami). Instructor Miami Ad School March 2010  – Present (5 years 6 months) Brooklyn, New York Currently teaching Everything is Media (Dumbo, New York location). \nPreviously, I've taught Interactive Concepts (Miami). Freelance Creative 360i December 2014  –  December 2014  (1 month) Freelance Creative 360i December 2014  –  December 2014  (1 month) Freelance Creative Bartle Bogle Hegarty NY October 2014  –  November 2014  (2 months) Freelance Creative Bartle Bogle Hegarty NY October 2014  –  November 2014  (2 months) Freelance ACD / Art Director Publicis August 2014  –  October 2014  (3 months) Working mainly on Coffee Mate. Freelance ACD / Art Director Publicis August 2014  –  October 2014  (3 months) Working mainly on Coffee Mate. Freelance Creative Bartle Bogle Hegarty NY June 2014  –  August 2014  (3 months) new york Freelance Creative Bartle Bogle Hegarty NY June 2014  –  August 2014  (3 months) new york Freelance ACD / Art Director Publicis April 2014  –  June 2014  (3 months) Greater New York City Area Freelance ACD / Art Director Publicis April 2014  –  June 2014  (3 months) Greater New York City Area Creative | Senior Art Director Proximity - BBDO NY. July 2012  –  April 2014  (1 year 10 months) Greater New York City Area Team Visa. Focused mostly on Visa FIFA, Visa Olympics, some Visa NFL and Prepaid. Creative | Senior Art Director Proximity - BBDO NY. July 2012  –  April 2014  (1 year 10 months) Greater New York City Area Team Visa. Focused mostly on Visa FIFA, Visa Olympics, some Visa NFL and Prepaid. Creative | Art Director Alma DDB March 2011  –  June 2012  (1 year 4 months) Working on State Farm, McDonalds and Pepsi. Creative | Art Director Alma DDB March 2011  –  June 2012  (1 year 4 months) Working on State Farm, McDonalds and Pepsi. Team Leader - PhilADthropy University of Miami February 2012  –  February 2012  (1 month) School of Communications - PhilADthropy Participated on this year's University of Miami's PhilADthropy event as a Team Leader. Each Team Leader is assigned a group of UM students to work for 25 straight hours for a given non-profit organization. Team Leader - PhilADthropy University of Miami February 2012  –  February 2012  (1 month) School of Communications - PhilADthropy Participated on this year's University of Miami's PhilADthropy event as a Team Leader. Each Team Leader is assigned a group of UM students to work for 25 straight hours for a given non-profit organization. Creative | Designer - Art Director SapientNitro July 2008  –  March 2011  (2 years 9 months) Creative | Designer - Art Director SapientNitro July 2008  –  March 2011  (2 years 9 months) Creative / Consultant CameloPardus February 2009  –  February 2011  (2 years 1 month) help the Bikinator with design, communication ideas, and whatever she needs Creative / Consultant CameloPardus February 2009  –  February 2011  (2 years 1 month) help the Bikinator with design, communication ideas, and whatever she needs Part-time lecturer - Intro to Graphic Design University of Miami January 2009  –  May 2009  (5 months) Part-time lecturer - Intro to Graphic Design University of Miami January 2009  –  May 2009  (5 months) Creative Associate Echovant March 2004  –  July 2006  (2 years 5 months) Creative Associate Echovant March 2004  –  July 2006  (2 years 5 months) Languages Spanish Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Concept Ideation Strategic thinking guitar player some Pro Tools |... CS5 Adobe Creative Suite Final Cut Pro After Effects Fluent French Fluent English Fluent Spanish experienced [bad] live... song & lyrics composer Adobe Creative Suite InDesign Spanish Art Direction Illustrator Pro Tools Photoshop Creative Direction Integrated Marketing English Advertising Digital Marketing Strategic Thinking Interactive Advertising Dreamweaver Guitarist Concept Development Creative Strategy Graphic Design Copywriting See 17+     See less Skills  Concept Ideation Strategic thinking guitar player some Pro Tools |... CS5 Adobe Creative Suite Final Cut Pro After Effects Fluent French Fluent English Fluent Spanish experienced [bad] live... song & lyrics composer Adobe Creative Suite InDesign Spanish Art Direction Illustrator Pro Tools Photoshop Creative Direction Integrated Marketing English Advertising Digital Marketing Strategic Thinking Interactive Advertising Dreamweaver Guitarist Concept Development Creative Strategy Graphic Design Copywriting See 17+     See less Concept Ideation Strategic thinking guitar player some Pro Tools |... CS5 Adobe Creative Suite Final Cut Pro After Effects Fluent French Fluent English Fluent Spanish experienced [bad] live... song & lyrics composer Adobe Creative Suite InDesign Spanish Art Direction Illustrator Pro Tools Photoshop Creative Direction Integrated Marketing English Advertising Digital Marketing Strategic Thinking Interactive Advertising Dreamweaver Guitarist Concept Development Creative Strategy Graphic Design Copywriting See 17+     See less Concept Ideation Strategic thinking guitar player some Pro Tools |... CS5 Adobe Creative Suite Final Cut Pro After Effects Fluent French Fluent English Fluent Spanish experienced [bad] live... song & lyrics composer Adobe Creative Suite InDesign Spanish Art Direction Illustrator Pro Tools Photoshop Creative Direction Integrated Marketing English Advertising Digital Marketing Strategic Thinking Interactive Advertising Dreamweaver Guitarist Concept Development Creative Strategy Graphic Design Copywriting See 17+     See less Education Miami Ad School Masters in Art Direction,  Communication - Art Direction 2006  – 2008 Activities and Societies:  soccer captain Florida International University Masters,  Communication 2006  – 2008 University of Miami Bachelor of Science in Communications,  Advertising - Graphic Design (double major) | Marketing Minor 2000  – 2003 Lycee Francais de Montevideo Uruguayan and French Baccalaureates,  Économique et Social / Humanístico - Economía 1986  – 1997 Miami Ad School Masters in Art Direction,  Communication - Art Direction 2006  – 2008 Activities and Societies:  soccer captain Miami Ad School Masters in Art Direction,  Communication - Art Direction 2006  – 2008 Activities and Societies:  soccer captain Miami Ad School Masters in Art Direction,  Communication - Art Direction 2006  – 2008 Activities and Societies:  soccer captain Florida International University Masters,  Communication 2006  – 2008 Florida International University Masters,  Communication 2006  – 2008 Florida International University Masters,  Communication 2006  – 2008 University of Miami Bachelor of Science in Communications,  Advertising - Graphic Design (double major) | Marketing Minor 2000  – 2003 University of Miami Bachelor of Science in Communications,  Advertising - Graphic Design (double major) | Marketing Minor 2000  – 2003 University of Miami Bachelor of Science in Communications,  Advertising - Graphic Design (double major) | Marketing Minor 2000  – 2003 Lycee Francais de Montevideo Uruguayan and French Baccalaureates,  Économique et Social / Humanístico - Economía 1986  – 1997 Lycee Francais de Montevideo Uruguayan and French Baccalaureates,  Économique et Social / Humanístico - Economía 1986  – 1997 Lycee Francais de Montevideo Uruguayan and French Baccalaureates,  Économique et Social / Humanístico - Economía 1986  – 1997 Honors & Awards Additional Honors & Awards Cannes Lions - Shortlist [Mobile] \nNew York Festivals - International Advertising Awards - Silver  \nD&AD 2nd Prize \nOne Show shortlist \nFWA - Mobile Of The Day \nEffie Awards - Bronze \nOMMA Awards - Gold \nAddy - National: Gold, Silver | Regional: 2 Gold, 3 Silver  \nW3 Awards - Gold & 2 Silver \nUSH Idea Awards Best Integrated Campaign \nEl Ojo de Iberoamérica Bronze - Ojo Innovador \nFIAP - merit  \nWeb Award - Events Standard of Excellence & Beverage Standard of Excellence \nCreativity Awards - 2 Silver \nDPAC - Finalist \n \nPublished on Creativity-Online \nIncluded in The Creative Internet [106 cool things] by Google Creative Labs \nAlma DDB No. 6 on Ad Age's Agency A-List \n \nBest of Show - CP+B /Miami Ad School Student Award \n \n[2010 Foosball Championship Runner-up] at SapientNitro Additional Honors & Awards Cannes Lions - Shortlist [Mobile] \nNew York Festivals - International Advertising Awards - Silver  \nD&AD 2nd Prize \nOne Show shortlist \nFWA - Mobile Of The Day \nEffie Awards - Bronze \nOMMA Awards - Gold \nAddy - National: Gold, Silver | Regional: 2 Gold, 3 Silver  \nW3 Awards - Gold & 2 Silver \nUSH Idea Awards Best Integrated Campaign \nEl Ojo de Iberoamérica Bronze - Ojo Innovador \nFIAP - merit  \nWeb Award - Events Standard of Excellence & Beverage Standard of Excellence \nCreativity Awards - 2 Silver \nDPAC - Finalist \n \nPublished on Creativity-Online \nIncluded in The Creative Internet [106 cool things] by Google Creative Labs \nAlma DDB No. 6 on Ad Age's Agency A-List \n \nBest of Show - CP+B /Miami Ad School Student Award \n \n[2010 Foosball Championship Runner-up] at SapientNitro Additional Honors & Awards Cannes Lions - Shortlist [Mobile] \nNew York Festivals - International Advertising Awards - Silver  \nD&AD 2nd Prize \nOne Show shortlist \nFWA - Mobile Of The Day \nEffie Awards - Bronze \nOMMA Awards - Gold \nAddy - National: Gold, Silver | Regional: 2 Gold, 3 Silver  \nW3 Awards - Gold & 2 Silver \nUSH Idea Awards Best Integrated Campaign \nEl Ojo de Iberoamérica Bronze - Ojo Innovador \nFIAP - merit  \nWeb Award - Events Standard of Excellence & Beverage Standard of Excellence \nCreativity Awards - 2 Silver \nDPAC - Finalist \n \nPublished on Creativity-Online \nIncluded in The Creative Internet [106 cool things] by Google Creative Labs \nAlma DDB No. 6 on Ad Age's Agency A-List \n \nBest of Show - CP+B /Miami Ad School Student Award \n \n[2010 Foosball Championship Runner-up] at SapientNitro Additional Honors & Awards Cannes Lions - Shortlist [Mobile] \nNew York Festivals - International Advertising Awards - Silver  \nD&AD 2nd Prize \nOne Show shortlist \nFWA - Mobile Of The Day \nEffie Awards - Bronze \nOMMA Awards - Gold \nAddy - National: Gold, Silver | Regional: 2 Gold, 3 Silver  \nW3 Awards - Gold & 2 Silver \nUSH Idea Awards Best Integrated Campaign \nEl Ojo de Iberoamérica Bronze - Ojo Innovador \nFIAP - merit  \nWeb Award - Events Standard of Excellence & Beverage Standard of Excellence \nCreativity Awards - 2 Silver \nDPAC - Finalist \n \nPublished on Creativity-Online \nIncluded in The Creative Internet [106 cool things] by Google Creative Labs \nAlma DDB No. 6 on Ad Age's Agency A-List \n \nBest of Show - CP+B /Miami Ad School Student Award \n \n[2010 Foosball Championship Runner-up] at SapientNitro "]}