{"position": "Customer Solutions Engineer", "company": "Google", "profiles": ["Summary Technology Management, Project Management and Software engineering for high-performance applications. Particularly interested in Internet application architecture. Always interested in website's performance and optimization. Specialties:Java,  \nInformation Retrieval, \nWebmetrics, \nHigh-performance Systems and algorithms, \nParallel computing, \nRuby on Rails, \nPython, \nAgile Project Management, \nScrum Summary Technology Management, Project Management and Software engineering for high-performance applications. Particularly interested in Internet application architecture. Always interested in website's performance and optimization. Specialties:Java,  \nInformation Retrieval, \nWebmetrics, \nHigh-performance Systems and algorithms, \nParallel computing, \nRuby on Rails, \nPython, \nAgile Project Management, \nScrum Technology Management, Project Management and Software engineering for high-performance applications. Particularly interested in Internet application architecture. Always interested in website's performance and optimization. Specialties:Java,  \nInformation Retrieval, \nWebmetrics, \nHigh-performance Systems and algorithms, \nParallel computing, \nRuby on Rails, \nPython, \nAgile Project Management, \nScrum Technology Management, Project Management and Software engineering for high-performance applications. Particularly interested in Internet application architecture. Always interested in website's performance and optimization. Specialties:Java,  \nInformation Retrieval, \nWebmetrics, \nHigh-performance Systems and algorithms, \nParallel computing, \nRuby on Rails, \nPython, \nAgile Project Management, \nScrum Experience Manager, Dedicated Ads Solutions Google October 2014  – Present (11 months) São Paulo Area, Brazil I lead the Dedicated Ads Solutions team in Brazil. We are a solution-generating force that helps our sales teams and customers, providing innovative, cutting-edge solutions to the business problems faced by the world’s largest advertisers.  Head of Advertising Operations & Technology, LatAm Google May 2015  –  August 2015  (4 months) São Paulo Area, Brazil Manager, Customer Solutions Engineers Google January 2014  –  September 2014  (9 months) São Paulo, Brazil Customer Solutions Engineer Google June 2010  –  December 2013  (3 years 7 months) I provide consulting, solution design, training, coaching and troubleshooting  services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. IT Manager Predicta 2002  –  June 2010  (8 years) Development Manager StarMedia 1998  –  2001  (3 years) Software Engineer Cade? 1997  –  1998  (1 year) Manager, Dedicated Ads Solutions Google October 2014  – Present (11 months) São Paulo Area, Brazil I lead the Dedicated Ads Solutions team in Brazil. We are a solution-generating force that helps our sales teams and customers, providing innovative, cutting-edge solutions to the business problems faced by the world’s largest advertisers.  Manager, Dedicated Ads Solutions Google October 2014  – Present (11 months) São Paulo Area, Brazil I lead the Dedicated Ads Solutions team in Brazil. We are a solution-generating force that helps our sales teams and customers, providing innovative, cutting-edge solutions to the business problems faced by the world’s largest advertisers.  Head of Advertising Operations & Technology, LatAm Google May 2015  –  August 2015  (4 months) São Paulo Area, Brazil Head of Advertising Operations & Technology, LatAm Google May 2015  –  August 2015  (4 months) São Paulo Area, Brazil Manager, Customer Solutions Engineers Google January 2014  –  September 2014  (9 months) São Paulo, Brazil Manager, Customer Solutions Engineers Google January 2014  –  September 2014  (9 months) São Paulo, Brazil Customer Solutions Engineer Google June 2010  –  December 2013  (3 years 7 months) I provide consulting, solution design, training, coaching and troubleshooting  services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Customer Solutions Engineer Google June 2010  –  December 2013  (3 years 7 months) I provide consulting, solution design, training, coaching and troubleshooting  services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. IT Manager Predicta 2002  –  June 2010  (8 years) IT Manager Predicta 2002  –  June 2010  (8 years) Development Manager StarMedia 1998  –  2001  (3 years) Development Manager StarMedia 1998  –  2001  (3 years) Software Engineer Cade? 1997  –  1998  (1 year) Software Engineer Cade? 1997  –  1998  (1 year) Languages English English English Skills Scrum Java Agile Project Management Ruby on Rails Python Software Project... Software Development System Architecture Information Retrieval MySQL Parallel Computing Software Engineering Agile Ruby jQuery SEM Online Advertising Google Adwords Google Analytics Ad Serving Web Analytics Behavioral Targeting Google App Engine Google Maps JavaScript Agile Methodologies Apache Linux See 13+     See less Skills  Scrum Java Agile Project Management Ruby on Rails Python Software Project... Software Development System Architecture Information Retrieval MySQL Parallel Computing Software Engineering Agile Ruby jQuery SEM Online Advertising Google Adwords Google Analytics Ad Serving Web Analytics Behavioral Targeting Google App Engine Google Maps JavaScript Agile Methodologies Apache Linux See 13+     See less Scrum Java Agile Project Management Ruby on Rails Python Software Project... Software Development System Architecture Information Retrieval MySQL Parallel Computing Software Engineering Agile Ruby jQuery SEM Online Advertising Google Adwords Google Analytics Ad Serving Web Analytics Behavioral Targeting Google App Engine Google Maps JavaScript Agile Methodologies Apache Linux See 13+     See less Scrum Java Agile Project Management Ruby on Rails Python Software Project... Software Development System Architecture Information Retrieval MySQL Parallel Computing Software Engineering Agile Ruby jQuery SEM Online Advertising Google Adwords Google Analytics Ad Serving Web Analytics Behavioral Targeting Google App Engine Google Maps JavaScript Agile Methodologies Apache Linux See 13+     See less Education Fundação Getulio Vargas Master of Business Administration (MBA),  Business 2012  – 2014 Fundação Getulio Vargas Specialist,  Statistical models for Quantitative Marketing 2011  – 2011 Fundação Getulio Vargas Specialist,  Negotiation 2009  – 2009 Fundação Getúlio Vargas Master of Business Administration (MBA),  Project Management 2006  – 2007 Universidade Federal do Rio de Janeiro Postgrad,  Computer Science 2003  – 2004 Universidade do Estado do Rio de Janeiro Bachelor,  Information Technology 1995  – 2001 Fundação Getulio Vargas Master of Business Administration (MBA),  Business 2012  – 2014 Fundação Getulio Vargas Master of Business Administration (MBA),  Business 2012  – 2014 Fundação Getulio Vargas Master of Business Administration (MBA),  Business 2012  – 2014 Fundação Getulio Vargas Specialist,  Statistical models for Quantitative Marketing 2011  – 2011 Fundação Getulio Vargas Specialist,  Statistical models for Quantitative Marketing 2011  – 2011 Fundação Getulio Vargas Specialist,  Statistical models for Quantitative Marketing 2011  – 2011 Fundação Getulio Vargas Specialist,  Negotiation 2009  – 2009 Fundação Getulio Vargas Specialist,  Negotiation 2009  – 2009 Fundação Getulio Vargas Specialist,  Negotiation 2009  – 2009 Fundação Getúlio Vargas Master of Business Administration (MBA),  Project Management 2006  – 2007 Fundação Getúlio Vargas Master of Business Administration (MBA),  Project Management 2006  – 2007 Fundação Getúlio Vargas Master of Business Administration (MBA),  Project Management 2006  – 2007 Universidade Federal do Rio de Janeiro Postgrad,  Computer Science 2003  – 2004 Universidade Federal do Rio de Janeiro Postgrad,  Computer Science 2003  – 2004 Universidade Federal do Rio de Janeiro Postgrad,  Computer Science 2003  – 2004 Universidade do Estado do Rio de Janeiro Bachelor,  Information Technology 1995  – 2001 Universidade do Estado do Rio de Janeiro Bachelor,  Information Technology 1995  – 2001 Universidade do Estado do Rio de Janeiro Bachelor,  Information Technology 1995  – 2001 Honors & Awards Additional Honors & Awards ITIL Foundations Certified \nSun Certified Java Programmer (SCJP) \nSun Certified Web Component Developer (SCWCD) Additional Honors & Awards ITIL Foundations Certified \nSun Certified Java Programmer (SCJP) \nSun Certified Web Component Developer (SCWCD) Additional Honors & Awards ITIL Foundations Certified \nSun Certified Java Programmer (SCJP) \nSun Certified Web Component Developer (SCWCD) Additional Honors & Awards ITIL Foundations Certified \nSun Certified Java Programmer (SCJP) \nSun Certified Web Component Developer (SCWCD) ", "Summary I currently work from Hamburg, Germany as an Ads Solutions Engineer for Google. \n \nBefore that, I worked as a full-time researcher on the EU FP7 I-SEARCH project where I represented Google. My main research interests are the Semantic Web, Multimedia Semantics, and Social Networks. \n \nIn parallel to my job at Google, I worked on a PhD in Computing at the Universitat Politècnica de Catalunya, Barcelona, Spain. My thesis is on event summarization based on multimedia data from social networks and was successfully defended in May 2014. \n \nAlso in parallel to my job at Google, I have started a Postdoc at the Laboratoire d'InfoRmatique en Image et Systèmes d'information (LIRIS), Lyon, France where I work on models and tools for publishing and analyzing annotated videos of live performances. \n \nMy dream location for work and life would be Barcelona, Spain. Summary I currently work from Hamburg, Germany as an Ads Solutions Engineer for Google. \n \nBefore that, I worked as a full-time researcher on the EU FP7 I-SEARCH project where I represented Google. My main research interests are the Semantic Web, Multimedia Semantics, and Social Networks. \n \nIn parallel to my job at Google, I worked on a PhD in Computing at the Universitat Politècnica de Catalunya, Barcelona, Spain. My thesis is on event summarization based on multimedia data from social networks and was successfully defended in May 2014. \n \nAlso in parallel to my job at Google, I have started a Postdoc at the Laboratoire d'InfoRmatique en Image et Systèmes d'information (LIRIS), Lyon, France where I work on models and tools for publishing and analyzing annotated videos of live performances. \n \nMy dream location for work and life would be Barcelona, Spain. I currently work from Hamburg, Germany as an Ads Solutions Engineer for Google. \n \nBefore that, I worked as a full-time researcher on the EU FP7 I-SEARCH project where I represented Google. My main research interests are the Semantic Web, Multimedia Semantics, and Social Networks. \n \nIn parallel to my job at Google, I worked on a PhD in Computing at the Universitat Politècnica de Catalunya, Barcelona, Spain. My thesis is on event summarization based on multimedia data from social networks and was successfully defended in May 2014. \n \nAlso in parallel to my job at Google, I have started a Postdoc at the Laboratoire d'InfoRmatique en Image et Systèmes d'information (LIRIS), Lyon, France where I work on models and tools for publishing and analyzing annotated videos of live performances. \n \nMy dream location for work and life would be Barcelona, Spain. I currently work from Hamburg, Germany as an Ads Solutions Engineer for Google. \n \nBefore that, I worked as a full-time researcher on the EU FP7 I-SEARCH project where I represented Google. My main research interests are the Semantic Web, Multimedia Semantics, and Social Networks. \n \nIn parallel to my job at Google, I worked on a PhD in Computing at the Universitat Politècnica de Catalunya, Barcelona, Spain. My thesis is on event summarization based on multimedia data from social networks and was successfully defended in May 2014. \n \nAlso in parallel to my job at Google, I have started a Postdoc at the Laboratoire d'InfoRmatique en Image et Systèmes d'information (LIRIS), Lyon, France where I work on models and tools for publishing and analyzing annotated videos of live performances. \n \nMy dream location for work and life would be Barcelona, Spain. Experience Ads Solutions Engineer Google April 2013  – Present (2 years 5 months) Hamburg Area, Germany Rejoined my previous team after completing the PhD. Working in the Google Technical Services (gTech) team, which serves as the primary point of contact for Google's global Sales, Business Development, and Partnerships teams to support the sales organization across all products. Dealing with the revenue-wise most important Google customers on Big Data analyses and dashboards. Postdoctoral Researcher Université Claude Bernard Lyon 1 October 2013  – Present (1 year 11 months) Lyon Area, France Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Research Scientist Google May 2010  –  March 2013  (2 years 11 months) Hamburg Area, Germany I represented Google in the EU FP7 I-SEARCH project that aimed for the creation of a multimodal search engine. Google’s main responsibilities lied in researching the Graphical User Interface requirements of the search engine for different input modalities and ensuring its operativeness across different device classes, as well as in project dissemination efforts. Customer Solutions Engineer Google October 2007  –  April 2010  (2 years 7 months) Worked in the Google Technical Services (gTech) team, which serves as the primary point of contact for Google's global Sales, Business Development, and Partnerships teams to support the sales organization across all products. Temporary Software Developer Google February 2005  –  July 2007  (2 years 6 months) Responsible for the AdWords API client library in PHP. Engineering Intern Google June 2006  –  July 2006  (2 months) Developed the AdWords API client library in PHP. Ads Solutions Engineer Google April 2013  – Present (2 years 5 months) Hamburg Area, Germany Rejoined my previous team after completing the PhD. Working in the Google Technical Services (gTech) team, which serves as the primary point of contact for Google's global Sales, Business Development, and Partnerships teams to support the sales organization across all products. Dealing with the revenue-wise most important Google customers on Big Data analyses and dashboards. Ads Solutions Engineer Google April 2013  – Present (2 years 5 months) Hamburg Area, Germany Rejoined my previous team after completing the PhD. Working in the Google Technical Services (gTech) team, which serves as the primary point of contact for Google's global Sales, Business Development, and Partnerships teams to support the sales organization across all products. Dealing with the revenue-wise most important Google customers on Big Data analyses and dashboards. Postdoctoral Researcher Université Claude Bernard Lyon 1 October 2013  – Present (1 year 11 months) Lyon Area, France Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Postdoctoral Researcher Université Claude Bernard Lyon 1 October 2013  – Present (1 year 11 months) Lyon Area, France Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Research Scientist Google May 2010  –  March 2013  (2 years 11 months) Hamburg Area, Germany I represented Google in the EU FP7 I-SEARCH project that aimed for the creation of a multimodal search engine. Google’s main responsibilities lied in researching the Graphical User Interface requirements of the search engine for different input modalities and ensuring its operativeness across different device classes, as well as in project dissemination efforts. Research Scientist Google May 2010  –  March 2013  (2 years 11 months) Hamburg Area, Germany I represented Google in the EU FP7 I-SEARCH project that aimed for the creation of a multimodal search engine. Google’s main responsibilities lied in researching the Graphical User Interface requirements of the search engine for different input modalities and ensuring its operativeness across different device classes, as well as in project dissemination efforts. Customer Solutions Engineer Google October 2007  –  April 2010  (2 years 7 months) Worked in the Google Technical Services (gTech) team, which serves as the primary point of contact for Google's global Sales, Business Development, and Partnerships teams to support the sales organization across all products. Customer Solutions Engineer Google October 2007  –  April 2010  (2 years 7 months) Worked in the Google Technical Services (gTech) team, which serves as the primary point of contact for Google's global Sales, Business Development, and Partnerships teams to support the sales organization across all products. Temporary Software Developer Google February 2005  –  July 2007  (2 years 6 months) Responsible for the AdWords API client library in PHP. Temporary Software Developer Google February 2005  –  July 2007  (2 years 6 months) Responsible for the AdWords API client library in PHP. Engineering Intern Google June 2006  –  July 2006  (2 months) Developed the AdWords API client library in PHP. Engineering Intern Google June 2006  –  July 2006  (2 months) Developed the AdWords API client library in PHP. Languages German French Spanish Catalan English Latin German French Spanish Catalan English Latin German French Spanish Catalan English Latin Skills Semantic Web Semantics Information Retrieval JavaScript REST Natural Language... Computer Science Linked Data Web Development Semantic Technologies Multimedia Semantics RDFa Research RDF Social Media Resource Description... Web Standards Standardization Social Networking Social Network Analysis Academic Publishing Programming HTML 5 Semantic Semantic HTML PhD Wikipedia Web Services Wikidata Postdoc Artificial Intelligence Informatica HTML5 See 18+     See less Skills  Semantic Web Semantics Information Retrieval JavaScript REST Natural Language... Computer Science Linked Data Web Development Semantic Technologies Multimedia Semantics RDFa Research RDF Social Media Resource Description... Web Standards Standardization Social Networking Social Network Analysis Academic Publishing Programming HTML 5 Semantic Semantic HTML PhD Wikipedia Web Services Wikidata Postdoc Artificial Intelligence Informatica HTML5 See 18+     See less Semantic Web Semantics Information Retrieval JavaScript REST Natural Language... Computer Science Linked Data Web Development Semantic Technologies Multimedia Semantics RDFa Research RDF Social Media Resource Description... Web Standards Standardization Social Networking Social Network Analysis Academic Publishing Programming HTML 5 Semantic Semantic HTML PhD Wikipedia Web Services Wikidata Postdoc Artificial Intelligence Informatica HTML5 See 18+     See less Semantic Web Semantics Information Retrieval JavaScript REST Natural Language... Computer Science Linked Data Web Development Semantic Technologies Multimedia Semantics RDFa Research RDF Social Media Resource Description... Web Standards Standardization Social Networking Social Network Analysis Academic Publishing Programming HTML 5 Semantic Semantic HTML PhD Wikipedia Web Services Wikidata Postdoc Artificial Intelligence Informatica HTML5 See 18+     See less Education Université Claude Bernard Lyon 1 Postdoc,  Computer Science , Postdoc 2013  – 2014 Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Universitat Politècnica de Catalunya cand. Ph.D.,  Computer Science 2010  – 2014 I currently work on a PhD on event summarization based on social networks, co-supervised by Joaquim Gabarro (UPC) and Michael Hausenblas (former DERI, now MapR). The title of my thesis is Enriching Unstructured Media Content About Events to Enable Semi-Automated Summaries, Compilations, and Improved Search by Leveraging Social Networks. The thesis was submitted for review in October 2013. Ecole Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble Master of Science (MS),  Computer Science 2005  – 2007 Universität Karlsruhe (TH) Master (Dipl. Inf.),  Computer Sciences 2002  – 2006 Université Claude Bernard Lyon 1 Postdoc,  Computer Science , Postdoc 2013  – 2014 Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Université Claude Bernard Lyon 1 Postdoc,  Computer Science , Postdoc 2013  – 2014 Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Université Claude Bernard Lyon 1 Postdoc,  Computer Science , Postdoc 2013  – 2014 Postdoctoral researcher working on models and tools for publishing and analyzing annotated videos of live performances. Universitat Politècnica de Catalunya cand. Ph.D.,  Computer Science 2010  – 2014 I currently work on a PhD on event summarization based on social networks, co-supervised by Joaquim Gabarro (UPC) and Michael Hausenblas (former DERI, now MapR). The title of my thesis is Enriching Unstructured Media Content About Events to Enable Semi-Automated Summaries, Compilations, and Improved Search by Leveraging Social Networks. The thesis was submitted for review in October 2013. Universitat Politècnica de Catalunya cand. Ph.D.,  Computer Science 2010  – 2014 I currently work on a PhD on event summarization based on social networks, co-supervised by Joaquim Gabarro (UPC) and Michael Hausenblas (former DERI, now MapR). The title of my thesis is Enriching Unstructured Media Content About Events to Enable Semi-Automated Summaries, Compilations, and Improved Search by Leveraging Social Networks. The thesis was submitted for review in October 2013. Universitat Politècnica de Catalunya cand. Ph.D.,  Computer Science 2010  – 2014 I currently work on a PhD on event summarization based on social networks, co-supervised by Joaquim Gabarro (UPC) and Michael Hausenblas (former DERI, now MapR). The title of my thesis is Enriching Unstructured Media Content About Events to Enable Semi-Automated Summaries, Compilations, and Improved Search by Leveraging Social Networks. The thesis was submitted for review in October 2013. Ecole Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble Master of Science (MS),  Computer Science 2005  – 2007 Ecole Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble Master of Science (MS),  Computer Science 2005  – 2007 Ecole Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble Master of Science (MS),  Computer Science 2005  – 2007 Universität Karlsruhe (TH) Master (Dipl. Inf.),  Computer Sciences 2002  – 2006 Universität Karlsruhe (TH) Master (Dipl. Inf.),  Computer Sciences 2002  – 2006 Universität Karlsruhe (TH) Master (Dipl. Inf.),  Computer Sciences 2002  – 2006 ", "Experience Customer Solutions Engineer Google August 2013  – Present (2 years 1 month) Argentina Technical Account Manager Google June 2012  –  August 2013  (1 year 3 months) Buenos Aires, Argentina Lead Software Engineer VIRIDIAN S.A. September 2010  –  June 2012  (1 year 10 months) J2EE Team Lead Verizon Business February 2006  –  September 2010  (4 years 8 months) J2EE Technical Lead J2EE Architect Latinsys January 2005  –  January 2006  (1 year 1 month) J2EE Senior Developer Synthesis Retail Solutions January 2002  –  January 2005  (3 years 1 month) 2nd Level Production Support/Developer for Correo Argentino Siemens Itron Business Services January 1999  –  January 2002  (3 years 1 month) Customer Solutions Engineer Google August 2013  – Present (2 years 1 month) Argentina Customer Solutions Engineer Google August 2013  – Present (2 years 1 month) Argentina Technical Account Manager Google June 2012  –  August 2013  (1 year 3 months) Buenos Aires, Argentina Technical Account Manager Google June 2012  –  August 2013  (1 year 3 months) Buenos Aires, Argentina Lead Software Engineer VIRIDIAN S.A. September 2010  –  June 2012  (1 year 10 months) Lead Software Engineer VIRIDIAN S.A. September 2010  –  June 2012  (1 year 10 months) J2EE Team Lead Verizon Business February 2006  –  September 2010  (4 years 8 months) J2EE Technical Lead J2EE Team Lead Verizon Business February 2006  –  September 2010  (4 years 8 months) J2EE Technical Lead J2EE Architect Latinsys January 2005  –  January 2006  (1 year 1 month) J2EE Architect Latinsys January 2005  –  January 2006  (1 year 1 month) J2EE Senior Developer Synthesis Retail Solutions January 2002  –  January 2005  (3 years 1 month) J2EE Senior Developer Synthesis Retail Solutions January 2002  –  January 2005  (3 years 1 month) 2nd Level Production Support/Developer for Correo Argentino Siemens Itron Business Services January 1999  –  January 2002  (3 years 1 month) 2nd Level Production Support/Developer for Correo Argentino Siemens Itron Business Services January 1999  –  January 2002  (3 years 1 month) Skills Agile Methodologies Web Services Software Development Software Project... Scrum Java Java Enterprise Edition Linux XML SQL Tomcat Subversion Skills  Agile Methodologies Web Services Software Development Software Project... Scrum Java Java Enterprise Edition Linux XML SQL Tomcat Subversion Agile Methodologies Web Services Software Development Software Project... Scrum Java Java Enterprise Edition Linux XML SQL Tomcat Subversion Agile Methodologies Web Services Software Development Software Project... Scrum Java Java Enterprise Edition Linux XML SQL Tomcat Subversion Education Universidad de San Andres MBA,  Business 2010  – 2011 Universidad Centro de Altos Estudios en Ciencias Exactas Licenciado en Sistemas,  Computer Science 2002  – 2006 Universidad de San Andres MBA,  Business 2010  – 2011 Universidad de San Andres MBA,  Business 2010  – 2011 Universidad de San Andres MBA,  Business 2010  – 2011 Universidad Centro de Altos Estudios en Ciencias Exactas Licenciado en Sistemas,  Computer Science 2002  – 2006 Universidad Centro de Altos Estudios en Ciencias Exactas Licenciado en Sistemas,  Computer Science 2002  – 2006 Universidad Centro de Altos Estudios en Ciencias Exactas Licenciado en Sistemas,  Computer Science 2002  – 2006 ", "Experience Youtube Software Engineer Google May 2012  – Present (3 years 4 months) Zurich Youtube, Technical Solutions Engineer Google September 2010  –  May 2012  (1 year 9 months) Zurich Customer Solutions Engineer Google December 2008  –  September 2010  (1 year 10 months) Madrid Area, Spain Engineering Lead - LATAM Mobile Integration Yahoo! May 2008  –  October 2008  (6 months) TSE Google January 2007  –  April 2008  (1 year 4 months) Software Engineer Ericsson R+D March 2000  –  February 2007  (7 years) PMC Member Apache 2005  –  2007  (2 years) CTO Mirai España 2000  –  2000  (less than a year) Youtube Software Engineer Google May 2012  – Present (3 years 4 months) Zurich Youtube Software Engineer Google May 2012  – Present (3 years 4 months) Zurich Youtube, Technical Solutions Engineer Google September 2010  –  May 2012  (1 year 9 months) Zurich Youtube, Technical Solutions Engineer Google September 2010  –  May 2012  (1 year 9 months) Zurich Customer Solutions Engineer Google December 2008  –  September 2010  (1 year 10 months) Madrid Area, Spain Customer Solutions Engineer Google December 2008  –  September 2010  (1 year 10 months) Madrid Area, Spain Engineering Lead - LATAM Mobile Integration Yahoo! May 2008  –  October 2008  (6 months) Engineering Lead - LATAM Mobile Integration Yahoo! May 2008  –  October 2008  (6 months) TSE Google January 2007  –  April 2008  (1 year 4 months) TSE Google January 2007  –  April 2008  (1 year 4 months) Software Engineer Ericsson R+D March 2000  –  February 2007  (7 years) Software Engineer Ericsson R+D March 2000  –  February 2007  (7 years) PMC Member Apache 2005  –  2007  (2 years) PMC Member Apache 2005  –  2007  (2 years) CTO Mirai España 2000  –  2000  (less than a year) CTO Mirai España 2000  –  2000  (less than a year) Skills Software Design Linux Mobile Devices Java Agile Methodologies Skills  Software Design Linux Mobile Devices Java Agile Methodologies Software Design Linux Mobile Devices Java Agile Methodologies Software Design Linux Mobile Devices Java Agile Methodologies Education Universidad Politécnica de Madrid Master's degree,  Computer Science 1993  – 2000 Universidad Politécnica de Madrid Master's degree,  Computer Science 1993  – 2000 Universidad Politécnica de Madrid Master's degree,  Computer Science 1993  – 2000 Universidad Politécnica de Madrid Master's degree,  Computer Science 1993  – 2000 ", "Summary An ex software engineer now working on the business side, presenting to clients, training and helping sales to close deals, I support clients from pre-sales, building their campaign and going live. \n \nMy unique background means I know everything about creating an online campaign from beginning to end, strategy, advertising, website, databases, APIs, hosting, programming, design, tracking and campaign evaluation. \n \nGoals; to always learn more about the above. \n \nVarious web technologies both front- and back-end, HTML, CSS, Javascript, Python, PHP, PERL, Java, Google App Engine, MySQL, ActionScript 2 and 3, various Google/YouTube APIs, Google Analytics Certificated. Summary An ex software engineer now working on the business side, presenting to clients, training and helping sales to close deals, I support clients from pre-sales, building their campaign and going live. \n \nMy unique background means I know everything about creating an online campaign from beginning to end, strategy, advertising, website, databases, APIs, hosting, programming, design, tracking and campaign evaluation. \n \nGoals; to always learn more about the above. \n \nVarious web technologies both front- and back-end, HTML, CSS, Javascript, Python, PHP, PERL, Java, Google App Engine, MySQL, ActionScript 2 and 3, various Google/YouTube APIs, Google Analytics Certificated. An ex software engineer now working on the business side, presenting to clients, training and helping sales to close deals, I support clients from pre-sales, building their campaign and going live. \n \nMy unique background means I know everything about creating an online campaign from beginning to end, strategy, advertising, website, databases, APIs, hosting, programming, design, tracking and campaign evaluation. \n \nGoals; to always learn more about the above. \n \nVarious web technologies both front- and back-end, HTML, CSS, Javascript, Python, PHP, PERL, Java, Google App Engine, MySQL, ActionScript 2 and 3, various Google/YouTube APIs, Google Analytics Certificated. An ex software engineer now working on the business side, presenting to clients, training and helping sales to close deals, I support clients from pre-sales, building their campaign and going live. \n \nMy unique background means I know everything about creating an online campaign from beginning to end, strategy, advertising, website, databases, APIs, hosting, programming, design, tracking and campaign evaluation. \n \nGoals; to always learn more about the above. \n \nVarious web technologies both front- and back-end, HTML, CSS, Javascript, Python, PHP, PERL, Java, Google App Engine, MySQL, ActionScript 2 and 3, various Google/YouTube APIs, Google Analytics Certificated. Experience Technical Product Expert Google May 2015  – Present (4 months) London, United Kingdom Product expert for all YouTube Reservation products (instream, trueview, masthead etc). \n- Bug triaging and prioritisation. \n- Beta testing for advertisers. \n- Product improvements. Product Specialist Google January 2014  –  May 2015  (1 year 5 months) London, United Kingdom Product specialist for YouTube focusing on: \n \n- Live streaming, Hangouts-on-Air. \n- Custom gadgets. \n- YouTube Channels. \n- YouTube Data/Player API. \n- Legal and policy questions for adverts. \n- Tracking and evaluation of campaigns. Technical Producer Google June 2011  –  January 2014  (2 years 8 months) London, United Kingdom I help plan and develop advertiser gadgets running on YouTube. \n \n- Concept questions, what is possible on YouTube. \n- YouTube Data/Player API questions. \n- Tracking and evaluation of campaigns. \n- Expertise in YouTube channels and Engagement products. \n- Legal and Policy questions for adverts. \n \nI also identify and recruit suitable vendors for our Engagement Solutions Developer program. Customer Solutions Engineer Google July 2008  –  June 2011  (3 years) London, United Kingdom Worked on various internal and external projects for YouTube. \n \nInternal projects \nWorked on several sales tools, helping sales teams to pitch, present and follow-up more efficiently. \nOffered YouTube API support to various advertisers building gadgets on YouTube. \n \nExternal marketing projects \n- Life in a Day \nI created gadgets for stage 1 and 2, this encompassed the gadget that collected the 8,000 video clips which the film is made up of. \nThe gadget was visited by over 11 million people during the course of three weeks. \n \nGadget was written in ActionScript3, which communicated with the YouTube Data API - http://www.youtube.com/lifeinaday \n \n- Open Reichstag - Bundestagswahl 2009 \nI created a voting/debating gadget in AS3 for the German Elections, users could vote in favour or against a subject and upload their own video to argue their point. Votes and videos were stored in an App Engine back-end. \nhttp://www.youtube.com/openreichstag Software Engineer DoubleClick June 2007  –  June 2008  (1 year 1 month) London, United Kingdom DoubleClick bought my previous employer in order to get to the TABS product which was used for ads trafficking. \n \nI continued developing the product which was now launched on a new platform and named DoubleClick studio. Software Developer Tangozebra November 2006  –  June 2007  (8 months) London, United Kingdom I worked on the TABS product, a software used to test and manage rich media adverts. I also provided back-end support for the creative team when needed. Developer Winweb International Ltd June 2006  –  November 2006  (6 months) Web Developer Turret RAI June 2001  –  June 2003  (2 years 1 month) Web Developer 365 Corporation Plc June 2000  –  March 2001  (10 months) Internet associate Epson August 1999  –  June 2000  (11 months) Technical Product Expert Google May 2015  – Present (4 months) London, United Kingdom Product expert for all YouTube Reservation products (instream, trueview, masthead etc). \n- Bug triaging and prioritisation. \n- Beta testing for advertisers. \n- Product improvements. Technical Product Expert Google May 2015  – Present (4 months) London, United Kingdom Product expert for all YouTube Reservation products (instream, trueview, masthead etc). \n- Bug triaging and prioritisation. \n- Beta testing for advertisers. \n- Product improvements. Product Specialist Google January 2014  –  May 2015  (1 year 5 months) London, United Kingdom Product specialist for YouTube focusing on: \n \n- Live streaming, Hangouts-on-Air. \n- Custom gadgets. \n- YouTube Channels. \n- YouTube Data/Player API. \n- Legal and policy questions for adverts. \n- Tracking and evaluation of campaigns. Product Specialist Google January 2014  –  May 2015  (1 year 5 months) London, United Kingdom Product specialist for YouTube focusing on: \n \n- Live streaming, Hangouts-on-Air. \n- Custom gadgets. \n- YouTube Channels. \n- YouTube Data/Player API. \n- Legal and policy questions for adverts. \n- Tracking and evaluation of campaigns. Technical Producer Google June 2011  –  January 2014  (2 years 8 months) London, United Kingdom I help plan and develop advertiser gadgets running on YouTube. \n \n- Concept questions, what is possible on YouTube. \n- YouTube Data/Player API questions. \n- Tracking and evaluation of campaigns. \n- Expertise in YouTube channels and Engagement products. \n- Legal and Policy questions for adverts. \n \nI also identify and recruit suitable vendors for our Engagement Solutions Developer program. Technical Producer Google June 2011  –  January 2014  (2 years 8 months) London, United Kingdom I help plan and develop advertiser gadgets running on YouTube. \n \n- Concept questions, what is possible on YouTube. \n- YouTube Data/Player API questions. \n- Tracking and evaluation of campaigns. \n- Expertise in YouTube channels and Engagement products. \n- Legal and Policy questions for adverts. \n \nI also identify and recruit suitable vendors for our Engagement Solutions Developer program. Customer Solutions Engineer Google July 2008  –  June 2011  (3 years) London, United Kingdom Worked on various internal and external projects for YouTube. \n \nInternal projects \nWorked on several sales tools, helping sales teams to pitch, present and follow-up more efficiently. \nOffered YouTube API support to various advertisers building gadgets on YouTube. \n \nExternal marketing projects \n- Life in a Day \nI created gadgets for stage 1 and 2, this encompassed the gadget that collected the 8,000 video clips which the film is made up of. \nThe gadget was visited by over 11 million people during the course of three weeks. \n \nGadget was written in ActionScript3, which communicated with the YouTube Data API - http://www.youtube.com/lifeinaday \n \n- Open Reichstag - Bundestagswahl 2009 \nI created a voting/debating gadget in AS3 for the German Elections, users could vote in favour or against a subject and upload their own video to argue their point. Votes and videos were stored in an App Engine back-end. \nhttp://www.youtube.com/openreichstag Customer Solutions Engineer Google July 2008  –  June 2011  (3 years) London, United Kingdom Worked on various internal and external projects for YouTube. \n \nInternal projects \nWorked on several sales tools, helping sales teams to pitch, present and follow-up more efficiently. \nOffered YouTube API support to various advertisers building gadgets on YouTube. \n \nExternal marketing projects \n- Life in a Day \nI created gadgets for stage 1 and 2, this encompassed the gadget that collected the 8,000 video clips which the film is made up of. \nThe gadget was visited by over 11 million people during the course of three weeks. \n \nGadget was written in ActionScript3, which communicated with the YouTube Data API - http://www.youtube.com/lifeinaday \n \n- Open Reichstag - Bundestagswahl 2009 \nI created a voting/debating gadget in AS3 for the German Elections, users could vote in favour or against a subject and upload their own video to argue their point. Votes and videos were stored in an App Engine back-end. \nhttp://www.youtube.com/openreichstag Software Engineer DoubleClick June 2007  –  June 2008  (1 year 1 month) London, United Kingdom DoubleClick bought my previous employer in order to get to the TABS product which was used for ads trafficking. \n \nI continued developing the product which was now launched on a new platform and named DoubleClick studio. Software Engineer DoubleClick June 2007  –  June 2008  (1 year 1 month) London, United Kingdom DoubleClick bought my previous employer in order to get to the TABS product which was used for ads trafficking. \n \nI continued developing the product which was now launched on a new platform and named DoubleClick studio. Software Developer Tangozebra November 2006  –  June 2007  (8 months) London, United Kingdom I worked on the TABS product, a software used to test and manage rich media adverts. I also provided back-end support for the creative team when needed. Software Developer Tangozebra November 2006  –  June 2007  (8 months) London, United Kingdom I worked on the TABS product, a software used to test and manage rich media adverts. I also provided back-end support for the creative team when needed. Developer Winweb International Ltd June 2006  –  November 2006  (6 months) Developer Winweb International Ltd June 2006  –  November 2006  (6 months) Web Developer Turret RAI June 2001  –  June 2003  (2 years 1 month) Web Developer Turret RAI June 2001  –  June 2003  (2 years 1 month) Web Developer 365 Corporation Plc June 2000  –  March 2001  (10 months) Web Developer 365 Corporation Plc June 2000  –  March 2001  (10 months) Internet associate Epson August 1999  –  June 2000  (11 months) Internet associate Epson August 1999  –  June 2000  (11 months) Languages English Swedish English Swedish English Swedish Skills Python JavaScript CSS PHP ActionScript MySQL Google App Engine Java HTML Online Advertising Django User Experience Databases Google Analytics Web Analytics Programming Digital Strategy See 2+     See less Skills  Python JavaScript CSS PHP ActionScript MySQL Google App Engine Java HTML Online Advertising Django User Experience Databases Google Analytics Web Analytics Programming Digital Strategy See 2+     See less Python JavaScript CSS PHP ActionScript MySQL Google App Engine Java HTML Online Advertising Django User Experience Databases Google Analytics Web Analytics Programming Digital Strategy See 2+     See less Python JavaScript CSS PHP ActionScript MySQL Google App Engine Java HTML Online Advertising Django User Experience Databases Google Analytics Web Analytics Programming Digital Strategy See 2+     See less Education Stockholms universitet / Stockholm University Bachelor of Science,  Computer and Systems Sciences 2003  – 2006 After working four years in the IT industry I decided to return to university and study for a degree. Stockholms universitet / Stockholm University Humanities study programme 1997  – 1999 Mixed studies of humanities \n- Philosophy \n- History \n- Computational Logic and Argumentation Stockholms universitet / Stockholm University Bachelor of Science,  Computer and Systems Sciences 2003  – 2006 After working four years in the IT industry I decided to return to university and study for a degree. Stockholms universitet / Stockholm University Bachelor of Science,  Computer and Systems Sciences 2003  – 2006 After working four years in the IT industry I decided to return to university and study for a degree. Stockholms universitet / Stockholm University Bachelor of Science,  Computer and Systems Sciences 2003  – 2006 After working four years in the IT industry I decided to return to university and study for a degree. Stockholms universitet / Stockholm University Humanities study programme 1997  – 1999 Mixed studies of humanities \n- Philosophy \n- History \n- Computational Logic and Argumentation Stockholms universitet / Stockholm University Humanities study programme 1997  – 1999 Mixed studies of humanities \n- Philosophy \n- History \n- Computational Logic and Argumentation Stockholms universitet / Stockholm University Humanities study programme 1997  – 1999 Mixed studies of humanities \n- Philosophy \n- History \n- Computational Logic and Argumentation Honors & Awards Additional Honors & Awards I received an honorable mention when my team won an OC Award (Google's second-highest award for innovation) 2010 for our joint effort on YouTube Monetisation. Additional Honors & Awards I received an honorable mention when my team won an OC Award (Google's second-highest award for innovation) 2010 for our joint effort on YouTube Monetisation. Additional Honors & Awards I received an honorable mention when my team won an OC Award (Google's second-highest award for innovation) 2010 for our joint effort on YouTube Monetisation. Additional Honors & Awards I received an honorable mention when my team won an OC Award (Google's second-highest award for innovation) 2010 for our joint effort on YouTube Monetisation. ", "Experience Customer Solutions Engineer Google August 2011  – Present (4 years 1 month) Web Solutions Engineer Google March 2010  –  August 2011  (1 year 6 months) Implemented and deployed large scalable internal web tools for the global sales organisation using Google Infrastructure. IT Field Technican & Inventory Manager Google January 2007  –  March 2010  (3 years 3 months) IT Engineer Yahoo! January 2004  –  March 2007  (3 years 3 months) IT Systems Administrator & Web Developer Kelkoo May 2002  –  July 2004  (2 years 3 months) Customer Solutions Engineer Google August 2011  – Present (4 years 1 month) Customer Solutions Engineer Google August 2011  – Present (4 years 1 month) Web Solutions Engineer Google March 2010  –  August 2011  (1 year 6 months) Implemented and deployed large scalable internal web tools for the global sales organisation using Google Infrastructure. Web Solutions Engineer Google March 2010  –  August 2011  (1 year 6 months) Implemented and deployed large scalable internal web tools for the global sales organisation using Google Infrastructure. IT Field Technican & Inventory Manager Google January 2007  –  March 2010  (3 years 3 months) IT Field Technican & Inventory Manager Google January 2007  –  March 2010  (3 years 3 months) IT Engineer Yahoo! January 2004  –  March 2007  (3 years 3 months) IT Engineer Yahoo! January 2004  –  March 2007  (3 years 3 months) IT Systems Administrator & Web Developer Kelkoo May 2002  –  July 2004  (2 years 3 months) IT Systems Administrator & Web Developer Kelkoo May 2002  –  July 2004  (2 years 3 months) Skills linux Mac OS X Windows Web Engineering css javascript jQuery ajax python Google App Engine Google API Google Adwords... Apple Certified... BigTable MySQL Distributed Systems Cloud Computing LANDesk Norton Ghost Chrome Extensions Microsoft Office MapReduce SEO SEM PHP Android Development Django Smarty See 13+     See less Skills  linux Mac OS X Windows Web Engineering css javascript jQuery ajax python Google App Engine Google API Google Adwords... Apple Certified... BigTable MySQL Distributed Systems Cloud Computing LANDesk Norton Ghost Chrome Extensions Microsoft Office MapReduce SEO SEM PHP Android Development Django Smarty See 13+     See less linux Mac OS X Windows Web Engineering css javascript jQuery ajax python Google App Engine Google API Google Adwords... Apple Certified... BigTable MySQL Distributed Systems Cloud Computing LANDesk Norton Ghost Chrome Extensions Microsoft Office MapReduce SEO SEM PHP Android Development Django Smarty See 13+     See less linux Mac OS X Windows Web Engineering css javascript jQuery ajax python Google App Engine Google API Google Adwords... Apple Certified... BigTable MySQL Distributed Systems Cloud Computing LANDesk Norton Ghost Chrome Extensions Microsoft Office MapReduce SEO SEM PHP Android Development Django Smarty See 13+     See less Education University of Greenwich 2:1 Honours,  Computer Science 1999  – 2002 Activities and Societies:  Final year project was in Data Mining using Clustering Techniques. University of Greenwich 2:1 Honours,  Computer Science 1999  – 2002 Activities and Societies:  Final year project was in Data Mining using Clustering Techniques. University of Greenwich 2:1 Honours,  Computer Science 1999  – 2002 Activities and Societies:  Final year project was in Data Mining using Clustering Techniques. University of Greenwich 2:1 Honours,  Computer Science 1999  – 2002 Activities and Societies:  Final year project was in Data Mining using Clustering Techniques. ", "Summary Developer, enterprise systems architect and consultant with computer science background, software engineering and project management knowledge, coaching & training experience and business communication skills. Summary Developer, enterprise systems architect and consultant with computer science background, software engineering and project management knowledge, coaching & training experience and business communication skills. Developer, enterprise systems architect and consultant with computer science background, software engineering and project management knowledge, coaching & training experience and business communication skills. Developer, enterprise systems architect and consultant with computer science background, software engineering and project management knowledge, coaching & training experience and business communication skills. Experience Dedicated Ads Solutions Lead Google October 2014  – Present (11 months) San Francisco Bay Area I lead the technical implementation team responsible for a one of four sectors in the US sales organization. Customer Solutions Engineer Google August 2010  –  November 2014  (4 years 4 months) I provide consulting, solution design, training, coaching and troubleshooting  services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Owner & C.T.O. Root Technologies S.C. 2004  –  April 2010  (6 years) As C.T.O I was responsible for the technical baseline for all solutions including software, hardware, and telecommunications with high availability components. I also directly participate in most projects as software architect, consultant, and lead developer. I also was involved in selected customer relations. Dedicated Ads Solutions Lead Google October 2014  – Present (11 months) San Francisco Bay Area I lead the technical implementation team responsible for a one of four sectors in the US sales organization. Dedicated Ads Solutions Lead Google October 2014  – Present (11 months) San Francisco Bay Area I lead the technical implementation team responsible for a one of four sectors in the US sales organization. Customer Solutions Engineer Google August 2010  –  November 2014  (4 years 4 months) I provide consulting, solution design, training, coaching and troubleshooting  services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Customer Solutions Engineer Google August 2010  –  November 2014  (4 years 4 months) I provide consulting, solution design, training, coaching and troubleshooting  services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Owner & C.T.O. Root Technologies S.C. 2004  –  April 2010  (6 years) As C.T.O I was responsible for the technical baseline for all solutions including software, hardware, and telecommunications with high availability components. I also directly participate in most projects as software architect, consultant, and lead developer. I also was involved in selected customer relations. Owner & C.T.O. Root Technologies S.C. 2004  –  April 2010  (6 years) As C.T.O I was responsible for the technical baseline for all solutions including software, hardware, and telecommunications with high availability components. I also directly participate in most projects as software architect, consultant, and lead developer. I also was involved in selected customer relations. Languages English Portuguese English Portuguese English Portuguese Skills Agile Methodologies Java Enterprise Edition Project Management Architecture Public Speaking System Architecture Google Analytics Google Adwords Google Apps Google App Engine Google Maps Google API YouTube API Hibernate JavaScript Sun Certified Java... Core Java Sales Presentations Consulting Teaching Software Design Network Architecture Entrepreneurship Apache Distributed Systems Linux Spring PostgreSQL Java Tomcat Subversion Architectures Software Engineering Python Spring Framework E-commerce See 21+     See less Skills  Agile Methodologies Java Enterprise Edition Project Management Architecture Public Speaking System Architecture Google Analytics Google Adwords Google Apps Google App Engine Google Maps Google API YouTube API Hibernate JavaScript Sun Certified Java... Core Java Sales Presentations Consulting Teaching Software Design Network Architecture Entrepreneurship Apache Distributed Systems Linux Spring PostgreSQL Java Tomcat Subversion Architectures Software Engineering Python Spring Framework E-commerce See 21+     See less Agile Methodologies Java Enterprise Edition Project Management Architecture Public Speaking System Architecture Google Analytics Google Adwords Google Apps Google App Engine Google Maps Google API YouTube API Hibernate JavaScript Sun Certified Java... Core Java Sales Presentations Consulting Teaching Software Design Network Architecture Entrepreneurship Apache Distributed Systems Linux Spring PostgreSQL Java Tomcat Subversion Architectures Software Engineering Python Spring Framework E-commerce See 21+     See less Agile Methodologies Java Enterprise Edition Project Management Architecture Public Speaking System Architecture Google Analytics Google Adwords Google Apps Google App Engine Google Maps Google API YouTube API Hibernate JavaScript Sun Certified Java... Core Java Sales Presentations Consulting Teaching Software Design Network Architecture Entrepreneurship Apache Distributed Systems Linux Spring PostgreSQL Java Tomcat Subversion Architectures Software Engineering Python Spring Framework E-commerce See 21+     See less Education Universidad Nacional Autónoma de México bs,  Computer Science 1996  – 2001 Universidad Nacional Autónoma de México bs,  Computer Science 1996  – 2001 Universidad Nacional Autónoma de México bs,  Computer Science 1996  – 2001 Universidad Nacional Autónoma de México bs,  Computer Science 1996  – 2001 ", "Experience Engineering Manager Google September 2010  – Present (5 years) Web Solutions Engineer Google August 2008  –  September 2010  (2 years 2 months) Customer Solutions Engineer Google August 2007  –  August 2008  (1 year 1 month) Sales Engineer Vorsite July 2006  –  August 2007  (1 year 2 months) Senior Systems Engineer Vorsite June 2005  –  July 2006  (1 year 2 months) Sr. Systems Specialist Merck June 2004  –  June 2005  (1 year 1 month) Systems Specialist Merck June 2003  –  June 2004  (1 year 1 month) Systems Analyst Merck June 2002  –  June 2003  (1 year 1 month) Engineering Manager Google September 2010  – Present (5 years) Engineering Manager Google September 2010  – Present (5 years) Web Solutions Engineer Google August 2008  –  September 2010  (2 years 2 months) Web Solutions Engineer Google August 2008  –  September 2010  (2 years 2 months) Customer Solutions Engineer Google August 2007  –  August 2008  (1 year 1 month) Customer Solutions Engineer Google August 2007  –  August 2008  (1 year 1 month) Sales Engineer Vorsite July 2006  –  August 2007  (1 year 2 months) Sales Engineer Vorsite July 2006  –  August 2007  (1 year 2 months) Senior Systems Engineer Vorsite June 2005  –  July 2006  (1 year 2 months) Senior Systems Engineer Vorsite June 2005  –  July 2006  (1 year 2 months) Sr. Systems Specialist Merck June 2004  –  June 2005  (1 year 1 month) Sr. Systems Specialist Merck June 2004  –  June 2005  (1 year 1 month) Systems Specialist Merck June 2003  –  June 2004  (1 year 1 month) Systems Specialist Merck June 2003  –  June 2004  (1 year 1 month) Systems Analyst Merck June 2002  –  June 2003  (1 year 1 month) Systems Analyst Merck June 2002  –  June 2003  (1 year 1 month) Skills Software Development Python JavaScript SQL Agile Methodologies Java Software Engineering Linux Web Applications HTML Product Management Distributed Systems Engineering Management Skills  Software Development Python JavaScript SQL Agile Methodologies Java Software Engineering Linux Web Applications HTML Product Management Distributed Systems Engineering Management Software Development Python JavaScript SQL Agile Methodologies Java Software Engineering Linux Web Applications HTML Product Management Distributed Systems Engineering Management Software Development Python JavaScript SQL Agile Methodologies Java Software Engineering Linux Web Applications HTML Product Management Distributed Systems Engineering Management Education Villanova University MS,  Computer Science September 2002  – May 2004 Rensselaer Polytechnic Institute BS (Dual),  Computer Science , Pyschology 1998  – 2002 Villanova University MS,  Computer Science September 2002  – May 2004 Villanova University MS,  Computer Science September 2002  – May 2004 Villanova University MS,  Computer Science September 2002  – May 2004 Rensselaer Polytechnic Institute BS (Dual),  Computer Science , Pyschology 1998  – 2002 Rensselaer Polytechnic Institute BS (Dual),  Computer Science , Pyschology 1998  – 2002 Rensselaer Polytechnic Institute BS (Dual),  Computer Science , Pyschology 1998  – 2002 ", "Summary Customer Solution Engineer at @Google France. \nex PM at @ultranoir, ex-intern at @Google France.  \n@HECParis student, #ENSEEIHT engineer.  \nFond of new technologies, mobile and videogames. \nAh yeah, and founder of the S.W.A.G. (urban football tournament) >> http://www.swag2013.fr Summary Customer Solution Engineer at @Google France. \nex PM at @ultranoir, ex-intern at @Google France.  \n@HECParis student, #ENSEEIHT engineer.  \nFond of new technologies, mobile and videogames. \nAh yeah, and founder of the S.W.A.G. (urban football tournament) >> http://www.swag2013.fr Customer Solution Engineer at @Google France. \nex PM at @ultranoir, ex-intern at @Google France.  \n@HECParis student, #ENSEEIHT engineer.  \nFond of new technologies, mobile and videogames. \nAh yeah, and founder of the S.W.A.G. (urban football tournament) >> http://www.swag2013.fr Customer Solution Engineer at @Google France. \nex PM at @ultranoir, ex-intern at @Google France.  \n@HECParis student, #ENSEEIHT engineer.  \nFond of new technologies, mobile and videogames. \nAh yeah, and founder of the S.W.A.G. (urban football tournament) >> http://www.swag2013.fr Experience Customer Solutions Engineer Google September 2013  – Present (2 years) Paris Area, France - Propose and/or design technical solutions, which include creating prototypes and proofs of concept. \n- Analyze solutions design of customer's systems, including usage patterns and identified inefficiencies. \n- Provide technical consulting and solutions feasibility according to products' Terms and Conditions. \n- Solve customers' business issues with Google technology, brainstorming with the Sales team on technical propositions to enhance customer websites around three vectors: traffic building, user engagement, and conversion capabilities. \n- Present prototypes, demos, and proofs of concept to a wide variety of audiences, which include marketing professionals and engineers. Product Manager / Project Manager ultranoir January 2012  –  September 2013  (1 year 9 months) Paris Area, France - Web project management \n- BlackOffice Product Management (CMS solution) \n- Pre-sale and Sales experience (call for tenders, client-facing presentations) \n- Social network management and consulting \n- Backend development and data management for the World Biggest Digital Model (in collaboration with Google and EndPoint) \n- Management of the Soccer Web Agencies Game (fustal tournament with 200 people  \nfrom the most prestigious French web agencies) Founder Soccer Web Agencies Game 2012  –  2013  (1 year) Paris Area, France Management of a urban football tournament between the most prestigious Parisian Web Agencies. \n300 people, 20 teams, 2 days tournament, 1 winner Product Analyst Intern Google June 2011  –  December 2011  (7 months) Paris Area, France Google Voice deployment and development \nBusiness development in Europe \n- Market study about the international mobile calls market \n- Emergency Services integration within the \"Call in Gmail\" function \n- Number portability (porting-in and porting-out) \n- Interactive Voice Response recording  \n \n20% project: \nParticipated in the development of the largest Google Earth installation in the world in partnership with the \"Pavillon de l'Arsenal\" in Paris \n(http://google-latlong.blogspot.com/2011/12/new-view-of-google-earth-on-48-screens.html)  \n- 48 screens showing Google Earth over 40m2 \n- largest Liquid Galaxy installation in the world \n- launched by the deputy Mayor of Paris \nArticles: \nGizmodo: http://goo.gl/ap6OR \nGoogle blog: http://goo.gl/qYtW0 \nLibération: http://goo.gl/K8Z7H \n \nMisc: \n- designed the Women@Google Paris logo Strategic Marketing Consultant Orange Labs January 2011  –  April 2011  (4 months) Paris Area, France Work on Orange multi-screens strategy (pc, mobile, tablet and TV). \nFirst, we studied multiscreen uses on television, computer, tablet and smartphone. Then, we benchmarked some existing multiscreen applications. \nWe achieved a deliverable for our service. Android Development Intern Amadeus IT Group SA March 2010  –  August 2010  (6 months) Sophia Antipolis, France Design of an Android Application which can rent a car. \nThis application will be able to locate the user, to suggest various cars of multiple providers and to make the transaction, using Amadeus services. Information System Engineer Orange UPRSO - France Telecom June 2009  –  August 2009  (3 months) Toulouse Area, France Training period at Orange UPR Sud-Ouest at Portet sur Garonne in the information system department. Work on databases and a market study about carpool Information System Engineer Orange UPRSO - France Telecom June 2008  –  July 2008  (2 months) Toulouse Area, France Training period at Orange UPR Sud-Ouest at Portet sur Garonne in the data processing department. Discovery of the modus operandi of the company, creation and management of Excel databases, reworking of the intranet webpage of the service. Computer Science Intern Bosch May 2007  –  June 2007  (2 months) Rodez, France 6 weeks internship at Robert BOSCH business of Rodez in the data-processing department . Work on the network, the security, and more precisely the VLANs Customer Solutions Engineer Google September 2013  – Present (2 years) Paris Area, France - Propose and/or design technical solutions, which include creating prototypes and proofs of concept. \n- Analyze solutions design of customer's systems, including usage patterns and identified inefficiencies. \n- Provide technical consulting and solutions feasibility according to products' Terms and Conditions. \n- Solve customers' business issues with Google technology, brainstorming with the Sales team on technical propositions to enhance customer websites around three vectors: traffic building, user engagement, and conversion capabilities. \n- Present prototypes, demos, and proofs of concept to a wide variety of audiences, which include marketing professionals and engineers. Customer Solutions Engineer Google September 2013  – Present (2 years) Paris Area, France - Propose and/or design technical solutions, which include creating prototypes and proofs of concept. \n- Analyze solutions design of customer's systems, including usage patterns and identified inefficiencies. \n- Provide technical consulting and solutions feasibility according to products' Terms and Conditions. \n- Solve customers' business issues with Google technology, brainstorming with the Sales team on technical propositions to enhance customer websites around three vectors: traffic building, user engagement, and conversion capabilities. \n- Present prototypes, demos, and proofs of concept to a wide variety of audiences, which include marketing professionals and engineers. Product Manager / Project Manager ultranoir January 2012  –  September 2013  (1 year 9 months) Paris Area, France - Web project management \n- BlackOffice Product Management (CMS solution) \n- Pre-sale and Sales experience (call for tenders, client-facing presentations) \n- Social network management and consulting \n- Backend development and data management for the World Biggest Digital Model (in collaboration with Google and EndPoint) \n- Management of the Soccer Web Agencies Game (fustal tournament with 200 people  \nfrom the most prestigious French web agencies) Product Manager / Project Manager ultranoir January 2012  –  September 2013  (1 year 9 months) Paris Area, France - Web project management \n- BlackOffice Product Management (CMS solution) \n- Pre-sale and Sales experience (call for tenders, client-facing presentations) \n- Social network management and consulting \n- Backend development and data management for the World Biggest Digital Model (in collaboration with Google and EndPoint) \n- Management of the Soccer Web Agencies Game (fustal tournament with 200 people  \nfrom the most prestigious French web agencies) Founder Soccer Web Agencies Game 2012  –  2013  (1 year) Paris Area, France Management of a urban football tournament between the most prestigious Parisian Web Agencies. \n300 people, 20 teams, 2 days tournament, 1 winner Founder Soccer Web Agencies Game 2012  –  2013  (1 year) Paris Area, France Management of a urban football tournament between the most prestigious Parisian Web Agencies. \n300 people, 20 teams, 2 days tournament, 1 winner Product Analyst Intern Google June 2011  –  December 2011  (7 months) Paris Area, France Google Voice deployment and development \nBusiness development in Europe \n- Market study about the international mobile calls market \n- Emergency Services integration within the \"Call in Gmail\" function \n- Number portability (porting-in and porting-out) \n- Interactive Voice Response recording  \n \n20% project: \nParticipated in the development of the largest Google Earth installation in the world in partnership with the \"Pavillon de l'Arsenal\" in Paris \n(http://google-latlong.blogspot.com/2011/12/new-view-of-google-earth-on-48-screens.html)  \n- 48 screens showing Google Earth over 40m2 \n- largest Liquid Galaxy installation in the world \n- launched by the deputy Mayor of Paris \nArticles: \nGizmodo: http://goo.gl/ap6OR \nGoogle blog: http://goo.gl/qYtW0 \nLibération: http://goo.gl/K8Z7H \n \nMisc: \n- designed the Women@Google Paris logo Product Analyst Intern Google June 2011  –  December 2011  (7 months) Paris Area, France Google Voice deployment and development \nBusiness development in Europe \n- Market study about the international mobile calls market \n- Emergency Services integration within the \"Call in Gmail\" function \n- Number portability (porting-in and porting-out) \n- Interactive Voice Response recording  \n \n20% project: \nParticipated in the development of the largest Google Earth installation in the world in partnership with the \"Pavillon de l'Arsenal\" in Paris \n(http://google-latlong.blogspot.com/2011/12/new-view-of-google-earth-on-48-screens.html)  \n- 48 screens showing Google Earth over 40m2 \n- largest Liquid Galaxy installation in the world \n- launched by the deputy Mayor of Paris \nArticles: \nGizmodo: http://goo.gl/ap6OR \nGoogle blog: http://goo.gl/qYtW0 \nLibération: http://goo.gl/K8Z7H \n \nMisc: \n- designed the Women@Google Paris logo Strategic Marketing Consultant Orange Labs January 2011  –  April 2011  (4 months) Paris Area, France Work on Orange multi-screens strategy (pc, mobile, tablet and TV). \nFirst, we studied multiscreen uses on television, computer, tablet and smartphone. Then, we benchmarked some existing multiscreen applications. \nWe achieved a deliverable for our service. Strategic Marketing Consultant Orange Labs January 2011  –  April 2011  (4 months) Paris Area, France Work on Orange multi-screens strategy (pc, mobile, tablet and TV). \nFirst, we studied multiscreen uses on television, computer, tablet and smartphone. Then, we benchmarked some existing multiscreen applications. \nWe achieved a deliverable for our service. Android Development Intern Amadeus IT Group SA March 2010  –  August 2010  (6 months) Sophia Antipolis, France Design of an Android Application which can rent a car. \nThis application will be able to locate the user, to suggest various cars of multiple providers and to make the transaction, using Amadeus services. Android Development Intern Amadeus IT Group SA March 2010  –  August 2010  (6 months) Sophia Antipolis, France Design of an Android Application which can rent a car. \nThis application will be able to locate the user, to suggest various cars of multiple providers and to make the transaction, using Amadeus services. Information System Engineer Orange UPRSO - France Telecom June 2009  –  August 2009  (3 months) Toulouse Area, France Training period at Orange UPR Sud-Ouest at Portet sur Garonne in the information system department. Work on databases and a market study about carpool Information System Engineer Orange UPRSO - France Telecom June 2009  –  August 2009  (3 months) Toulouse Area, France Training period at Orange UPR Sud-Ouest at Portet sur Garonne in the information system department. Work on databases and a market study about carpool Information System Engineer Orange UPRSO - France Telecom June 2008  –  July 2008  (2 months) Toulouse Area, France Training period at Orange UPR Sud-Ouest at Portet sur Garonne in the data processing department. Discovery of the modus operandi of the company, creation and management of Excel databases, reworking of the intranet webpage of the service. Information System Engineer Orange UPRSO - France Telecom June 2008  –  July 2008  (2 months) Toulouse Area, France Training period at Orange UPR Sud-Ouest at Portet sur Garonne in the data processing department. Discovery of the modus operandi of the company, creation and management of Excel databases, reworking of the intranet webpage of the service. Computer Science Intern Bosch May 2007  –  June 2007  (2 months) Rodez, France 6 weeks internship at Robert BOSCH business of Rodez in the data-processing department . Work on the network, the security, and more precisely the VLANs Computer Science Intern Bosch May 2007  –  June 2007  (2 months) Rodez, France 6 weeks internship at Robert BOSCH business of Rodez in the data-processing department . Work on the network, the security, and more precisely the VLANs Languages Français Native or bilingual proficiency English Full professional proficiency Espagnol Full professional proficiency Italien Elementary proficiency Français Native or bilingual proficiency English Full professional proficiency Espagnol Full professional proficiency Italien Elementary proficiency Français Native or bilingual proficiency English Full professional proficiency Espagnol Full professional proficiency Italien Elementary proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Product Management International Project... Google Earth Work in A Fast-paced... Web Project Management Google App Engine Software Project... Google PHP Google Maps Community Management Google Docs Microsoft Office SEO Android Google Apps KML Team-spirited Python Cross-functional Team... Open Minded Google Analytics Customer-facing JSON See 9+     See less Skills  Product Management International Project... Google Earth Work in A Fast-paced... Web Project Management Google App Engine Software Project... Google PHP Google Maps Community Management Google Docs Microsoft Office SEO Android Google Apps KML Team-spirited Python Cross-functional Team... Open Minded Google Analytics Customer-facing JSON See 9+     See less Product Management International Project... Google Earth Work in A Fast-paced... Web Project Management Google App Engine Software Project... Google PHP Google Maps Community Management Google Docs Microsoft Office SEO Android Google Apps KML Team-spirited Python Cross-functional Team... Open Minded Google Analytics Customer-facing JSON See 9+     See less Product Management International Project... Google Earth Work in A Fast-paced... Web Project Management Google App Engine Software Project... Google PHP Google Maps Community Management Google Docs Microsoft Office SEO Android Google Apps KML Team-spirited Python Cross-functional Team... Open Minded Google Analytics Customer-facing JSON See 9+     See less Education HEC School of Management Specialized Masters in New Technologies Management,  Management, New Technologies 2010  – 2011 Activities and Societies:  THEC Talk speaker (\"The Security Network\") Specialized Masters in New Technologies Management, Management, New Technologies,  Management, New Technologies 2010  – 2011 ENSEEIHT - Ecole Nationale Supérieure d'Electrotechnique, d'Electronique, d'Informatique, d'Hydraulique et des Télécommunications Diplôme d'Ingénieur en Télécoms/Réseaux,  Télécoms/Réseaux 2007  – 2010 Telecoms & Networks Activities and Societies:  Student Association Member (2008-2009) (graphist):posters creation ,  research ,  meetings and discussion with sponsors ,  management of parties Cycle Préparatoire Polytechnique Maths ,  Physics ,  Chemistry , Computer Science,  English ,  Spanish 2005  – 2007 Lycée Ferdinand Foch Baccalaureat Scientifique,  Spé Maths 2002  – 2005 Activities and Societies:  Coding Club HEC School of Management Specialized Masters in New Technologies Management,  Management, New Technologies 2010  – 2011 Activities and Societies:  THEC Talk speaker (\"The Security Network\") HEC School of Management Specialized Masters in New Technologies Management,  Management, New Technologies 2010  – 2011 Activities and Societies:  THEC Talk speaker (\"The Security Network\") HEC School of Management Specialized Masters in New Technologies Management,  Management, New Technologies 2010  – 2011 Activities and Societies:  THEC Talk speaker (\"The Security Network\") Specialized Masters in New Technologies Management, Management, New Technologies,  Management, New Technologies 2010  – 2011 Specialized Masters in New Technologies Management, Management, New Technologies,  Management, New Technologies 2010  – 2011 Specialized Masters in New Technologies Management, Management, New Technologies,  Management, New Technologies 2010  – 2011 ENSEEIHT - Ecole Nationale Supérieure d'Electrotechnique, d'Electronique, d'Informatique, d'Hydraulique et des Télécommunications Diplôme d'Ingénieur en Télécoms/Réseaux,  Télécoms/Réseaux 2007  – 2010 Telecoms & Networks Activities and Societies:  Student Association Member (2008-2009) (graphist):posters creation ,  research ,  meetings and discussion with sponsors ,  management of parties ENSEEIHT - Ecole Nationale Supérieure d'Electrotechnique, d'Electronique, d'Informatique, d'Hydraulique et des Télécommunications Diplôme d'Ingénieur en Télécoms/Réseaux,  Télécoms/Réseaux 2007  – 2010 Telecoms & Networks Activities and Societies:  Student Association Member (2008-2009) (graphist):posters creation ,  research ,  meetings and discussion with sponsors ,  management of parties ENSEEIHT - Ecole Nationale Supérieure d'Electrotechnique, d'Electronique, d'Informatique, d'Hydraulique et des Télécommunications Diplôme d'Ingénieur en Télécoms/Réseaux,  Télécoms/Réseaux 2007  – 2010 Telecoms & Networks Activities and Societies:  Student Association Member (2008-2009) (graphist):posters creation ,  research ,  meetings and discussion with sponsors ,  management of parties Cycle Préparatoire Polytechnique Maths ,  Physics ,  Chemistry , Computer Science,  English ,  Spanish 2005  – 2007 Cycle Préparatoire Polytechnique Maths ,  Physics ,  Chemistry , Computer Science,  English ,  Spanish 2005  – 2007 Cycle Préparatoire Polytechnique Maths ,  Physics ,  Chemistry , Computer Science,  English ,  Spanish 2005  – 2007 Lycée Ferdinand Foch Baccalaureat Scientifique,  Spé Maths 2002  – 2005 Activities and Societies:  Coding Club Lycée Ferdinand Foch Baccalaureat Scientifique,  Spé Maths 2002  – 2005 Activities and Societies:  Coding Club Lycée Ferdinand Foch Baccalaureat Scientifique,  Spé Maths 2002  – 2005 Activities and Societies:  Coding Club Honors & Awards “Win moments that matter” Award Google April 2015 \"David managed a highly sensitive escalation that was damaging Google's relationship with those customers. Following a data driven approach, and connecting with internal experts, David was able to address an issue that was waiting for a solution for months, and successfully managed communication with internal and external stakeholders.\" “Work as one gTech” Award Google March 2015 \"Thank you David for personally going above and beyond to help make the first EMEA Offsite in Q1 such a success! Your resourceful and creative contributions to the event made a lasting impression on everyone involved! We couldn't have done it without you.\" “Do cool sh!t that matters” Google December 2014 \"David once again effectively put his technical skills at the service of the business and run an analysis that discovered a huge opportunity in France tied to the adoption of mobile friendly URLs in Ads.\" Outstanding achievements and impact Google July 2014 \"David’s execution during Q2 has been simply outstanding. Besides completing revenue generating projects contributing for more than 50% of the impact recorded in SEEMEA (200% above his personal OKRs), David is driving the team’s engagement with L'Oreal and successfully launched the first CSE-GCAS project in the region. \nBut David’s scope of action was even broader than that! He contributed and presented at high visibility events like the CMOs summit of the Richemont Group, delivered trainings about Arduino technology, co-organized and attended different Google external outreach events like in particular the HashCode event in Paris. Thank you David for your drive and impact!\" EMEA 20% Award Q4 2011 Nelson Mattos, Google January 2012 Award for building the World's Biggest Digital Model at Pavillon de l'Arsenal Amadeus Great Intern Contest - Runner up Amadeus July 2010 Selected among the 10 top interns of 2010, out ouf 150+ interns “Win moments that matter” Award Google April 2015 \"David managed a highly sensitive escalation that was damaging Google's relationship with those customers. Following a data driven approach, and connecting with internal experts, David was able to address an issue that was waiting for a solution for months, and successfully managed communication with internal and external stakeholders.\" “Win moments that matter” Award Google April 2015 \"David managed a highly sensitive escalation that was damaging Google's relationship with those customers. Following a data driven approach, and connecting with internal experts, David was able to address an issue that was waiting for a solution for months, and successfully managed communication with internal and external stakeholders.\" “Win moments that matter” Award Google April 2015 \"David managed a highly sensitive escalation that was damaging Google's relationship with those customers. Following a data driven approach, and connecting with internal experts, David was able to address an issue that was waiting for a solution for months, and successfully managed communication with internal and external stakeholders.\" “Work as one gTech” Award Google March 2015 \"Thank you David for personally going above and beyond to help make the first EMEA Offsite in Q1 such a success! Your resourceful and creative contributions to the event made a lasting impression on everyone involved! We couldn't have done it without you.\" “Work as one gTech” Award Google March 2015 \"Thank you David for personally going above and beyond to help make the first EMEA Offsite in Q1 such a success! Your resourceful and creative contributions to the event made a lasting impression on everyone involved! We couldn't have done it without you.\" “Work as one gTech” Award Google March 2015 \"Thank you David for personally going above and beyond to help make the first EMEA Offsite in Q1 such a success! Your resourceful and creative contributions to the event made a lasting impression on everyone involved! We couldn't have done it without you.\" “Do cool sh!t that matters” Google December 2014 \"David once again effectively put his technical skills at the service of the business and run an analysis that discovered a huge opportunity in France tied to the adoption of mobile friendly URLs in Ads.\" “Do cool sh!t that matters” Google December 2014 \"David once again effectively put his technical skills at the service of the business and run an analysis that discovered a huge opportunity in France tied to the adoption of mobile friendly URLs in Ads.\" “Do cool sh!t that matters” Google December 2014 \"David once again effectively put his technical skills at the service of the business and run an analysis that discovered a huge opportunity in France tied to the adoption of mobile friendly URLs in Ads.\" Outstanding achievements and impact Google July 2014 \"David’s execution during Q2 has been simply outstanding. Besides completing revenue generating projects contributing for more than 50% of the impact recorded in SEEMEA (200% above his personal OKRs), David is driving the team’s engagement with L'Oreal and successfully launched the first CSE-GCAS project in the region. \nBut David’s scope of action was even broader than that! He contributed and presented at high visibility events like the CMOs summit of the Richemont Group, delivered trainings about Arduino technology, co-organized and attended different Google external outreach events like in particular the HashCode event in Paris. Thank you David for your drive and impact!\" Outstanding achievements and impact Google July 2014 \"David’s execution during Q2 has been simply outstanding. Besides completing revenue generating projects contributing for more than 50% of the impact recorded in SEEMEA (200% above his personal OKRs), David is driving the team’s engagement with L'Oreal and successfully launched the first CSE-GCAS project in the region. \nBut David’s scope of action was even broader than that! He contributed and presented at high visibility events like the CMOs summit of the Richemont Group, delivered trainings about Arduino technology, co-organized and attended different Google external outreach events like in particular the HashCode event in Paris. Thank you David for your drive and impact!\" Outstanding achievements and impact Google July 2014 \"David’s execution during Q2 has been simply outstanding. Besides completing revenue generating projects contributing for more than 50% of the impact recorded in SEEMEA (200% above his personal OKRs), David is driving the team’s engagement with L'Oreal and successfully launched the first CSE-GCAS project in the region. \nBut David’s scope of action was even broader than that! He contributed and presented at high visibility events like the CMOs summit of the Richemont Group, delivered trainings about Arduino technology, co-organized and attended different Google external outreach events like in particular the HashCode event in Paris. Thank you David for your drive and impact!\" EMEA 20% Award Q4 2011 Nelson Mattos, Google January 2012 Award for building the World's Biggest Digital Model at Pavillon de l'Arsenal EMEA 20% Award Q4 2011 Nelson Mattos, Google January 2012 Award for building the World's Biggest Digital Model at Pavillon de l'Arsenal EMEA 20% Award Q4 2011 Nelson Mattos, Google January 2012 Award for building the World's Biggest Digital Model at Pavillon de l'Arsenal Amadeus Great Intern Contest - Runner up Amadeus July 2010 Selected among the 10 top interns of 2010, out ouf 150+ interns Amadeus Great Intern Contest - Runner up Amadeus July 2010 Selected among the 10 top interns of 2010, out ouf 150+ interns Amadeus Great Intern Contest - Runner up Amadeus July 2010 Selected among the 10 top interns of 2010, out ouf 150+ interns ", "Experience Technical Program Manager, Payments Google April 2014  – Present (1 year 5 months) Partner Technology Manager, Wallet Google February 2013  –  April 2014  (1 year 3 months) Mobile Product Operations Manager Google January 2011  –  January 2013  (2 years 1 month) San Francisco Bay Area Operations manager for mobile advertising solution on DoubleClick platform; responsible for launching products into market, developing tools, training programs and processes to scale global support operation; collaborate with sales to sell and consult on complex solutions to strategic prospects and clients. Mobile Product Specialist Google November 2009  –  December 2010  (1 year 2 months) Customer Solutions Engineer Google March 2008  –  December 2009  (1 year 10 months) Consulting Engineer DoubleClick October 2007  –  March 2008  (6 months) Network System Administrator NYU Stern School of Business March 2003  –  September 2007  (4 years 7 months) Technical Program Manager, Payments Google April 2014  – Present (1 year 5 months) Technical Program Manager, Payments Google April 2014  – Present (1 year 5 months) Partner Technology Manager, Wallet Google February 2013  –  April 2014  (1 year 3 months) Partner Technology Manager, Wallet Google February 2013  –  April 2014  (1 year 3 months) Mobile Product Operations Manager Google January 2011  –  January 2013  (2 years 1 month) San Francisco Bay Area Operations manager for mobile advertising solution on DoubleClick platform; responsible for launching products into market, developing tools, training programs and processes to scale global support operation; collaborate with sales to sell and consult on complex solutions to strategic prospects and clients. Mobile Product Operations Manager Google January 2011  –  January 2013  (2 years 1 month) San Francisco Bay Area Operations manager for mobile advertising solution on DoubleClick platform; responsible for launching products into market, developing tools, training programs and processes to scale global support operation; collaborate with sales to sell and consult on complex solutions to strategic prospects and clients. Mobile Product Specialist Google November 2009  –  December 2010  (1 year 2 months) Mobile Product Specialist Google November 2009  –  December 2010  (1 year 2 months) Customer Solutions Engineer Google March 2008  –  December 2009  (1 year 10 months) Customer Solutions Engineer Google March 2008  –  December 2009  (1 year 10 months) Consulting Engineer DoubleClick October 2007  –  March 2008  (6 months) Consulting Engineer DoubleClick October 2007  –  March 2008  (6 months) Network System Administrator NYU Stern School of Business March 2003  –  September 2007  (4 years 7 months) Network System Administrator NYU Stern School of Business March 2003  –  September 2007  (4 years 7 months) Skills Mobile Advertising Mobile Applications Mobile Devices Mobile Marketing Mobile Technology Online Advertising Digital Marketing Objective-C Python Java Perl JavaScript CSS Android iOS User Experience Strategy DoubleClick Apache Google Analytics Ad Serving See 6+     See less Skills  Mobile Advertising Mobile Applications Mobile Devices Mobile Marketing Mobile Technology Online Advertising Digital Marketing Objective-C Python Java Perl JavaScript CSS Android iOS User Experience Strategy DoubleClick Apache Google Analytics Ad Serving See 6+     See less Mobile Advertising Mobile Applications Mobile Devices Mobile Marketing Mobile Technology Online Advertising Digital Marketing Objective-C Python Java Perl JavaScript CSS Android iOS User Experience Strategy DoubleClick Apache Google Analytics Ad Serving See 6+     See less Mobile Advertising Mobile Applications Mobile Devices Mobile Marketing Mobile Technology Online Advertising Digital Marketing Objective-C Python Java Perl JavaScript CSS Android iOS User Experience Strategy DoubleClick Apache Google Analytics Ad Serving See 6+     See less Education New York University Master of Science,  Computer Science 2007 New York University Bachelor of Arts (B.A.),  Economics ,  Math and Computer Science 2002 New York University Master of Science,  Computer Science 2007 New York University Master of Science,  Computer Science 2007 New York University Master of Science,  Computer Science 2007 New York University Bachelor of Arts (B.A.),  Economics ,  Math and Computer Science 2002 New York University Bachelor of Arts (B.A.),  Economics ,  Math and Computer Science 2002 New York University Bachelor of Arts (B.A.),  Economics ,  Math and Computer Science 2002 ", "Experience Customer Solutions Engineer Google April 2012  – Present (3 years 5 months) Tokyo, Japan * Dedicated to advertisers as Technical Account Manager for Google Products. \n- Support advertisers to Implement AdWords products \n- Solve issues about Google products \n \n* Develop some tools Account Manager Google July 2010  –  March 2012  (1 year 9 months) * ISO rep for publisher side \n- Developing partner for AdSense and Admob \n- Prised for most acquired partner in a quarter \n \n* TAM for Ad Exchange products \n- Support team to develop partner revenue by Ad Exchange related product Engineer Recruit April 2007  –  June 2010  (3 years 3 months) Work as Engineer lead for Blogwatcher. Inc staff Recruit Media Communications July 2004  –  March 2007  (2 years 9 months) Engineer &　Division Manager GMO Media & Solutions April 2000  –  February 2004  (3 years 11 months) * As Engineer \n- Develop web mailing list system which used to be one of biggest service in Japan \n- Perl/PHP/Java \n- Management for mail/web server \n \n* As Division Manager \n- Sell mail advertisement service Sales Representative NTT (Nippon Telegraph and Telephone Corporation) April 1999  –  March 2000  (1 year) Sales for telecommunication services Customer Solutions Engineer Google April 2012  – Present (3 years 5 months) Tokyo, Japan * Dedicated to advertisers as Technical Account Manager for Google Products. \n- Support advertisers to Implement AdWords products \n- Solve issues about Google products \n \n* Develop some tools Customer Solutions Engineer Google April 2012  – Present (3 years 5 months) Tokyo, Japan * Dedicated to advertisers as Technical Account Manager for Google Products. \n- Support advertisers to Implement AdWords products \n- Solve issues about Google products \n \n* Develop some tools Account Manager Google July 2010  –  March 2012  (1 year 9 months) * ISO rep for publisher side \n- Developing partner for AdSense and Admob \n- Prised for most acquired partner in a quarter \n \n* TAM for Ad Exchange products \n- Support team to develop partner revenue by Ad Exchange related product Account Manager Google July 2010  –  March 2012  (1 year 9 months) * ISO rep for publisher side \n- Developing partner for AdSense and Admob \n- Prised for most acquired partner in a quarter \n \n* TAM for Ad Exchange products \n- Support team to develop partner revenue by Ad Exchange related product Engineer Recruit April 2007  –  June 2010  (3 years 3 months) Work as Engineer lead for Blogwatcher. Inc Engineer Recruit April 2007  –  June 2010  (3 years 3 months) Work as Engineer lead for Blogwatcher. Inc staff Recruit Media Communications July 2004  –  March 2007  (2 years 9 months) staff Recruit Media Communications July 2004  –  March 2007  (2 years 9 months) Engineer &　Division Manager GMO Media & Solutions April 2000  –  February 2004  (3 years 11 months) * As Engineer \n- Develop web mailing list system which used to be one of biggest service in Japan \n- Perl/PHP/Java \n- Management for mail/web server \n \n* As Division Manager \n- Sell mail advertisement service Engineer &　Division Manager GMO Media & Solutions April 2000  –  February 2004  (3 years 11 months) * As Engineer \n- Develop web mailing list system which used to be one of biggest service in Japan \n- Perl/PHP/Java \n- Management for mail/web server \n \n* As Division Manager \n- Sell mail advertisement service Sales Representative NTT (Nippon Telegraph and Telephone Corporation) April 1999  –  March 2000  (1 year) Sales for telecommunication services Sales Representative NTT (Nippon Telegraph and Telephone Corporation) April 1999  –  March 2000  (1 year) Sales for telecommunication services Skills Mobile Devices Online Advertising Digital Marketing Product Development MySQL APIs JavaScript Start-ups New Business Development Entrepreneurship Account Management Digital Media Skills  Mobile Devices Online Advertising Digital Marketing Product Development MySQL APIs JavaScript Start-ups New Business Development Entrepreneurship Account Management Digital Media Mobile Devices Online Advertising Digital Marketing Product Development MySQL APIs JavaScript Start-ups New Business Development Entrepreneurship Account Management Digital Media Mobile Devices Online Advertising Digital Marketing Product Development MySQL APIs JavaScript Start-ups New Business Development Entrepreneurship Account Management Digital Media Education Aoyama Gakuin University Master,  Mechanical Engineering 1997  – 1999 青山学院大学 / Aoyama Gakuin University Mechanical Engineering 1993  – 1997 Aoyama Gakuin University Master,  Mechanical Engineering 1997  – 1999 Aoyama Gakuin University Master,  Mechanical Engineering 1997  – 1999 Aoyama Gakuin University Master,  Mechanical Engineering 1997  – 1999 青山学院大学 / Aoyama Gakuin University Mechanical Engineering 1993  – 1997 青山学院大学 / Aoyama Gakuin University Mechanical Engineering 1993  – 1997 青山学院大学 / Aoyama Gakuin University Mechanical Engineering 1993  – 1997 ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Python Java Software Engineering JavaScript Linux Google App Engine Software Development Skills  Python Java Software Engineering JavaScript Linux Google App Engine Software Development Python Java Software Engineering JavaScript Linux Google App Engine Software Development Python Java Software Engineering JavaScript Linux Google App Engine Software Development ", "Skills Agile Methodologies Distributed Systems Java JavaScript Software Development Python Software Engineering Linux Scalability SQL XML Ruby Perl Subversion C++ Skills  Agile Methodologies Distributed Systems Java JavaScript Software Development Python Software Engineering Linux Scalability SQL XML Ruby Perl Subversion C++ Agile Methodologies Distributed Systems Java JavaScript Software Development Python Software Engineering Linux Scalability SQL XML Ruby Perl Subversion C++ Agile Methodologies Distributed Systems Java JavaScript Software Development Python Software Engineering Linux Scalability SQL XML Ruby Perl Subversion C++ ", "Summary Experienced with mobile digital marketing, adwords mobile, android and iOS. Seasoned product roll-out manage technical who has \n1. Pleasant Personalities \n2. Positive Influencer \n3. Quick learner \n4. Can-do attitude Summary Experienced with mobile digital marketing, adwords mobile, android and iOS. Seasoned product roll-out manage technical who has \n1. Pleasant Personalities \n2. Positive Influencer \n3. Quick learner \n4. Can-do attitude Experienced with mobile digital marketing, adwords mobile, android and iOS. Seasoned product roll-out manage technical who has \n1. Pleasant Personalities \n2. Positive Influencer \n3. Quick learner \n4. Can-do attitude Experienced with mobile digital marketing, adwords mobile, android and iOS. Seasoned product roll-out manage technical who has \n1. Pleasant Personalities \n2. Positive Influencer \n3. Quick learner \n4. Can-do attitude Experience Product Technology Manager Google December 2013  – Present (1 year 9 months) Singapore 1. Managed the roll out process of Google's mobile adwords products . \n2. Provide hands on support for very early adopter of Google's new Products. \n3. Build scalable tools/solutions to bridge the gaps between products and the markets. \n4. Involved in the early design phase of Google's mobile adwords products.  \n5. Released products: mobile conversion tracking, remarketing, deep linking, 3rd party integration. \n Customer Solutions Engineer Google September 2013  –  December 2013  (4 months) Singapore 1. Provide hands on support for top tier dedicated advertisers. \n2. Provide onsite technical pitch support. \n3. Products covered: Web conversion tracking, remarketing, dynamic remarketing, Google Tag Managers(GTM) implementation and so on. \n Technology Analyst Credit Suisse February 2012  –  September 2013  (1 year 8 months) Singapore 1. Work Life Balance Chairman of Technical Analyst Society \n2. Workforce Simulation Portal development - C#/JQuery/MVC/AngularJS Internship Credit Suisse May 2011  –  August 2011  (4 months) Singapore 1. Process optimization for Active Directory Department. \n2. Automate Manual Process of Active Directory Department. \n3. Awarded return offer as technical analyst. IT consultant(intern) NTUC Income May 2010  –  August 2010  (4 months) Singapore 1. Program scripts to generate reports from PeopleSoft for HR department use. \n2. Database optimization. \n3. Awarded Best Project for interns. Teaching assistant National University of Singapore January 2008  –  August 2010  (2 years 8 months) Singapore Product Technology Manager Google December 2013  – Present (1 year 9 months) Singapore 1. Managed the roll out process of Google's mobile adwords products . \n2. Provide hands on support for very early adopter of Google's new Products. \n3. Build scalable tools/solutions to bridge the gaps between products and the markets. \n4. Involved in the early design phase of Google's mobile adwords products.  \n5. Released products: mobile conversion tracking, remarketing, deep linking, 3rd party integration. \n Product Technology Manager Google December 2013  – Present (1 year 9 months) Singapore 1. Managed the roll out process of Google's mobile adwords products . \n2. Provide hands on support for very early adopter of Google's new Products. \n3. Build scalable tools/solutions to bridge the gaps between products and the markets. \n4. Involved in the early design phase of Google's mobile adwords products.  \n5. Released products: mobile conversion tracking, remarketing, deep linking, 3rd party integration. \n Customer Solutions Engineer Google September 2013  –  December 2013  (4 months) Singapore 1. Provide hands on support for top tier dedicated advertisers. \n2. Provide onsite technical pitch support. \n3. Products covered: Web conversion tracking, remarketing, dynamic remarketing, Google Tag Managers(GTM) implementation and so on. \n Customer Solutions Engineer Google September 2013  –  December 2013  (4 months) Singapore 1. Provide hands on support for top tier dedicated advertisers. \n2. Provide onsite technical pitch support. \n3. Products covered: Web conversion tracking, remarketing, dynamic remarketing, Google Tag Managers(GTM) implementation and so on. \n Technology Analyst Credit Suisse February 2012  –  September 2013  (1 year 8 months) Singapore 1. Work Life Balance Chairman of Technical Analyst Society \n2. Workforce Simulation Portal development - C#/JQuery/MVC/AngularJS Technology Analyst Credit Suisse February 2012  –  September 2013  (1 year 8 months) Singapore 1. Work Life Balance Chairman of Technical Analyst Society \n2. Workforce Simulation Portal development - C#/JQuery/MVC/AngularJS Internship Credit Suisse May 2011  –  August 2011  (4 months) Singapore 1. Process optimization for Active Directory Department. \n2. Automate Manual Process of Active Directory Department. \n3. Awarded return offer as technical analyst. Internship Credit Suisse May 2011  –  August 2011  (4 months) Singapore 1. Process optimization for Active Directory Department. \n2. Automate Manual Process of Active Directory Department. \n3. Awarded return offer as technical analyst. IT consultant(intern) NTUC Income May 2010  –  August 2010  (4 months) Singapore 1. Program scripts to generate reports from PeopleSoft for HR department use. \n2. Database optimization. \n3. Awarded Best Project for interns. IT consultant(intern) NTUC Income May 2010  –  August 2010  (4 months) Singapore 1. Program scripts to generate reports from PeopleSoft for HR department use. \n2. Database optimization. \n3. Awarded Best Project for interns. Teaching assistant National University of Singapore January 2008  –  August 2010  (2 years 8 months) Singapore Teaching assistant National University of Singapore January 2008  –  August 2010  (2 years 8 months) Singapore Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Ad Tech Mobile Marketing Technical Consultation New Product Roll Out Online Advertising RTB Online Marketing Mobile Applications Google Adwords JavaScript MySQL Java PHP Objective-C SQL C# Databases Android MVC iOS See 5+     See less Skills  Ad Tech Mobile Marketing Technical Consultation New Product Roll Out Online Advertising RTB Online Marketing Mobile Applications Google Adwords JavaScript MySQL Java PHP Objective-C SQL C# Databases Android MVC iOS See 5+     See less Ad Tech Mobile Marketing Technical Consultation New Product Roll Out Online Advertising RTB Online Marketing Mobile Applications Google Adwords JavaScript MySQL Java PHP Objective-C SQL C# Databases Android MVC iOS See 5+     See less Ad Tech Mobile Marketing Technical Consultation New Product Roll Out Online Advertising RTB Online Marketing Mobile Applications Google Adwords JavaScript MySQL Java PHP Objective-C SQL C# Databases Android MVC iOS See 5+     See less Education National University of Singapore Bachelor,  Computer Science , 4.25 2007  – 2012 Activities and Societies:  Judo - Captain / Sports Club - Marketing Executive National University of Singapore Bachelor of Science (B.Sc.),  Applied Mathematics , 4.0 2007  – 2012 Activities and Societies:  Judo - Captain Sports / Club - Marketing Executive National University of Singapore Bachelor,  Computer Science , 4.25 2007  – 2012 Activities and Societies:  Judo - Captain / Sports Club - Marketing Executive National University of Singapore Bachelor,  Computer Science , 4.25 2007  – 2012 Activities and Societies:  Judo - Captain / Sports Club - Marketing Executive National University of Singapore Bachelor,  Computer Science , 4.25 2007  – 2012 Activities and Societies:  Judo - Captain / Sports Club - Marketing Executive National University of Singapore Bachelor of Science (B.Sc.),  Applied Mathematics , 4.0 2007  – 2012 Activities and Societies:  Judo - Captain Sports / Club - Marketing Executive National University of Singapore Bachelor of Science (B.Sc.),  Applied Mathematics , 4.0 2007  – 2012 Activities and Societies:  Judo - Captain Sports / Club - Marketing Executive National University of Singapore Bachelor of Science (B.Sc.),  Applied Mathematics , 4.0 2007  – 2012 Activities and Societies:  Judo - Captain Sports / Club - Marketing Executive Honors & Awards Credit Suisse Code Olympic global coding competition Credit Suisse AG March 2012 It's a coding challenge open to all application developers in Credit Suisse. I was awarded third place. National University of Singapore School of Computing Dean’s List Award National University of Singapore School of Computing 2008 & 2010 Team NUS sports Award National University of Singapore Best Rookie Award (2007), Honoury Award(2010) MOE School-Based PRC scholarship Ministry Of Education Singapore January 2003 Thinkquest International Web Design Competition Oracle Education Foundation 2006 3rd Place - 19 and Under \nAvailable here: \nhttp://www.thinkquest.org/library/winners/2006_international.html NUS iCreate Competition National University of Singapore 2012 Mobile application development competition, 1st Place. Credit Suisse Code Olympic global coding competition Credit Suisse AG March 2012 It's a coding challenge open to all application developers in Credit Suisse. I was awarded third place. Credit Suisse Code Olympic global coding competition Credit Suisse AG March 2012 It's a coding challenge open to all application developers in Credit Suisse. I was awarded third place. Credit Suisse Code Olympic global coding competition Credit Suisse AG March 2012 It's a coding challenge open to all application developers in Credit Suisse. I was awarded third place. National University of Singapore School of Computing Dean’s List Award National University of Singapore School of Computing 2008 & 2010 National University of Singapore School of Computing Dean’s List Award National University of Singapore School of Computing 2008 & 2010 National University of Singapore School of Computing Dean’s List Award National University of Singapore School of Computing 2008 & 2010 Team NUS sports Award National University of Singapore Best Rookie Award (2007), Honoury Award(2010) Team NUS sports Award National University of Singapore Best Rookie Award (2007), Honoury Award(2010) Team NUS sports Award National University of Singapore Best Rookie Award (2007), Honoury Award(2010) MOE School-Based PRC scholarship Ministry Of Education Singapore January 2003 MOE School-Based PRC scholarship Ministry Of Education Singapore January 2003 MOE School-Based PRC scholarship Ministry Of Education Singapore January 2003 Thinkquest International Web Design Competition Oracle Education Foundation 2006 3rd Place - 19 and Under \nAvailable here: \nhttp://www.thinkquest.org/library/winners/2006_international.html Thinkquest International Web Design Competition Oracle Education Foundation 2006 3rd Place - 19 and Under \nAvailable here: \nhttp://www.thinkquest.org/library/winners/2006_international.html Thinkquest International Web Design Competition Oracle Education Foundation 2006 3rd Place - 19 and Under \nAvailable here: \nhttp://www.thinkquest.org/library/winners/2006_international.html NUS iCreate Competition National University of Singapore 2012 Mobile application development competition, 1st Place. NUS iCreate Competition National University of Singapore 2012 Mobile application development competition, 1st Place. NUS iCreate Competition National University of Singapore 2012 Mobile application development competition, 1st Place. ", "Experience Staff Technical Solutions Consultant Google February 2014  – Present (1 year 7 months) Sydney Area, Australia Develop and deploy innovative solutions for strategic advertising clients using nascent products. Senior Solutions Engineer Google February 2012  –  February 2014  (2 years 1 month) Australia Work with agency clients to maximise their return from Google's suite of products. Enterprise Solutions Engineer Google April 2010  –  January 2012  (1 year 10 months) Australia Design solutions to customers' business problems using Google products. Senior Customer Solutions Engineer Google October 2006  –  March 2010  (3 years 6 months) Work with strategic clients to maximise their return from Google's suite of products. Technology Specialist Telstra March 2004  –  September 2006  (2 years 7 months) Worked on Media Streaming, Bigpond Movie Downloads and Web Hosting projects. \nWeb Marketing Association's 2005 Web Award \nhttp://www.advertisingcompetition.org/winner.asp?eid=4880 Systems Integrator / Implementation Analyst Ericsson March 2003  –  March 2004  (1 year 1 month) Worked on the SingleView Billing Implementation for Hutchison Australia. Software Engineer Cisco Systems September 2002  –  March 2003  (7 months) Analysis, Documentation, Remediation, Testing and Implementation of various front-end and back-end reports and applications Senior Analyst Programmer IBM Global Services May 1999  –  September 2002  (3 years 5 months) Worked on the ARBOR Project for the Optus account. Software Engineer (Y2K) AMP 1998  –  May 1999  (1 year) Worked on Y2K for AMPlus (with Anderson Consulting). Software Engineer Commonwealth Bank of Australia 1995  –  1998  (3 years) Worked on the Mobile Banking and Point of Sale Account Opening Projects. Staff Technical Solutions Consultant Google February 2014  – Present (1 year 7 months) Sydney Area, Australia Develop and deploy innovative solutions for strategic advertising clients using nascent products. Staff Technical Solutions Consultant Google February 2014  – Present (1 year 7 months) Sydney Area, Australia Develop and deploy innovative solutions for strategic advertising clients using nascent products. Senior Solutions Engineer Google February 2012  –  February 2014  (2 years 1 month) Australia Work with agency clients to maximise their return from Google's suite of products. Senior Solutions Engineer Google February 2012  –  February 2014  (2 years 1 month) Australia Work with agency clients to maximise their return from Google's suite of products. Enterprise Solutions Engineer Google April 2010  –  January 2012  (1 year 10 months) Australia Design solutions to customers' business problems using Google products. Enterprise Solutions Engineer Google April 2010  –  January 2012  (1 year 10 months) Australia Design solutions to customers' business problems using Google products. Senior Customer Solutions Engineer Google October 2006  –  March 2010  (3 years 6 months) Work with strategic clients to maximise their return from Google's suite of products. Senior Customer Solutions Engineer Google October 2006  –  March 2010  (3 years 6 months) Work with strategic clients to maximise their return from Google's suite of products. Technology Specialist Telstra March 2004  –  September 2006  (2 years 7 months) Worked on Media Streaming, Bigpond Movie Downloads and Web Hosting projects. \nWeb Marketing Association's 2005 Web Award \nhttp://www.advertisingcompetition.org/winner.asp?eid=4880 Technology Specialist Telstra March 2004  –  September 2006  (2 years 7 months) Worked on Media Streaming, Bigpond Movie Downloads and Web Hosting projects. \nWeb Marketing Association's 2005 Web Award \nhttp://www.advertisingcompetition.org/winner.asp?eid=4880 Systems Integrator / Implementation Analyst Ericsson March 2003  –  March 2004  (1 year 1 month) Worked on the SingleView Billing Implementation for Hutchison Australia. Systems Integrator / Implementation Analyst Ericsson March 2003  –  March 2004  (1 year 1 month) Worked on the SingleView Billing Implementation for Hutchison Australia. Software Engineer Cisco Systems September 2002  –  March 2003  (7 months) Analysis, Documentation, Remediation, Testing and Implementation of various front-end and back-end reports and applications Software Engineer Cisco Systems September 2002  –  March 2003  (7 months) Analysis, Documentation, Remediation, Testing and Implementation of various front-end and back-end reports and applications Senior Analyst Programmer IBM Global Services May 1999  –  September 2002  (3 years 5 months) Worked on the ARBOR Project for the Optus account. Senior Analyst Programmer IBM Global Services May 1999  –  September 2002  (3 years 5 months) Worked on the ARBOR Project for the Optus account. Software Engineer (Y2K) AMP 1998  –  May 1999  (1 year) Worked on Y2K for AMPlus (with Anderson Consulting). Software Engineer (Y2K) AMP 1998  –  May 1999  (1 year) Worked on Y2K for AMPlus (with Anderson Consulting). Software Engineer Commonwealth Bank of Australia 1995  –  1998  (3 years) Worked on the Mobile Banking and Point of Sale Account Opening Projects. Software Engineer Commonwealth Bank of Australia 1995  –  1998  (3 years) Worked on the Mobile Banking and Point of Sale Account Opening Projects. Skills Cloud Computing Solution Architecture SaaS Software Development Enterprise Architecture Enterprise Software Pre-sales Integration Agile Project Management Testing Strategy XML Mobile Devices Agile Methodologies Web Services SOA Linux Web Applications Software Engineering Mobile Applications Software Design Unix Distributed Systems Scalability Perl Google App Engine Google Web Toolkit JavaScript Java Web Analytics See 15+     See less Skills  Cloud Computing Solution Architecture SaaS Software Development Enterprise Architecture Enterprise Software Pre-sales Integration Agile Project Management Testing Strategy XML Mobile Devices Agile Methodologies Web Services SOA Linux Web Applications Software Engineering Mobile Applications Software Design Unix Distributed Systems Scalability Perl Google App Engine Google Web Toolkit JavaScript Java Web Analytics See 15+     See less Cloud Computing Solution Architecture SaaS Software Development Enterprise Architecture Enterprise Software Pre-sales Integration Agile Project Management Testing Strategy XML Mobile Devices Agile Methodologies Web Services SOA Linux Web Applications Software Engineering Mobile Applications Software Design Unix Distributed Systems Scalability Perl Google App Engine Google Web Toolkit JavaScript Java Web Analytics See 15+     See less Cloud Computing Solution Architecture SaaS Software Development Enterprise Architecture Enterprise Software Pre-sales Integration Agile Project Management Testing Strategy XML Mobile Devices Agile Methodologies Web Services SOA Linux Web Applications Software Engineering Mobile Applications Software Design Unix Distributed Systems Scalability Perl Google App Engine Google Web Toolkit JavaScript Java Web Analytics See 15+     See less Education University of Technology, Sydney MSc,  Advanced Computing 2005  – 2008 Macquarie University BSc,  Computer Science 1991  – 1994 Marist College University of Technology, Sydney MSc,  Advanced Computing 2005  – 2008 University of Technology, Sydney MSc,  Advanced Computing 2005  – 2008 University of Technology, Sydney MSc,  Advanced Computing 2005  – 2008 Macquarie University BSc,  Computer Science 1991  – 1994 Macquarie University BSc,  Computer Science 1991  – 1994 Macquarie University BSc,  Computer Science 1991  – 1994 Marist College Marist College Marist College ", "Summary After a startup experience in connected TVs, I joined Google to help Advertisers improve their online marketing performances. \n \nI worked for 2 years on the bleeding edge of Google's digital marketing products, helping Advertiser explore uncharted territory and improve their performances. \n \nI am now using this experience as a Google AdWords product manager to help shape the future of AdWords for the most advanced advertisers. Summary After a startup experience in connected TVs, I joined Google to help Advertisers improve their online marketing performances. \n \nI worked for 2 years on the bleeding edge of Google's digital marketing products, helping Advertiser explore uncharted territory and improve their performances. \n \nI am now using this experience as a Google AdWords product manager to help shape the future of AdWords for the most advanced advertisers. After a startup experience in connected TVs, I joined Google to help Advertisers improve their online marketing performances. \n \nI worked for 2 years on the bleeding edge of Google's digital marketing products, helping Advertiser explore uncharted territory and improve their performances. \n \nI am now using this experience as a Google AdWords product manager to help shape the future of AdWords for the most advanced advertisers. After a startup experience in connected TVs, I joined Google to help Advertisers improve their online marketing performances. \n \nI worked for 2 years on the bleeding edge of Google's digital marketing products, helping Advertiser explore uncharted territory and improve their performances. \n \nI am now using this experience as a Google AdWords product manager to help shape the future of AdWords for the most advanced advertisers. Experience Product Manager Google July 2014  – Present (1 year 2 months) San Francisco Bay Area Help improve features of the Google ads buying and management platform \"AdWords\" for the power users. \n \nI focus on: \n- URL Upgrade to improve tracking management \n- Bulk toolks (AdWords Scripts, automated rules, Bulk edit and upload in AdWords front end) \n- Business data Management  Customer Solutions Engineer Google January 2012  –  July 2014  (2 years 7 months) Paris Area, France June 2013 - July 2014 \nSingle Business Engineer for SEEMEA on a programmatic advertising on display project. \n- Supporting Customers of this project in France, Russia, Qatar, Spain & Italy  \n- Defining serviceability and scaling opportunities and leading global project on scaling via partnerships. \n- Building custom integrations for very advanced customers. \n \nJanuary 2012 - Mai 2013 \n1 of 3 engineers supporting the large customers sales organisation (500+ sales supporting $1B+) \n- Supported complex product integration with 50+ Fortune 100 advertisers with an estimated annual  \n$20M impact in incremental revenue. \n- Developed  tools  to  improve  and  optimize  sales  processes  (self  support  platform,  Tag customization  interface)  used  by  more  than  1.5K  internal  active  users  and  saving  an estimated 10,000 FTE hours. \n- Designed  and  developed  an  automated  email  program  that  sends  search  trends  to businesses. Adopted by more than a thousand Fortune 100 advertisers worldwide in a year, it sends 12K emails every weeks and received a “dare to be audacious” Gold award in 2013. \n \nJuly 2012 - Mai 2013 \n20% Product Manager \nHelped grow the global performance display business to $1B in 2013 \n- Drove the integration of performance display related feature into the chrome extension  \n‘Tag Assistant’ spanning 100K external users and 3K internal users. The extension helps sales & customers better troubleshoot issues in the integration of Google tag products and delivered almost 2 millions diagnostics on performance display products in 2013. \n- Developed a test & demo platform for customers & sales to give a better understanding  \nof the performance display products. \n- Involved in product roadmap discussion and proposed a few features who got integrated in  \nthe adwords front‐end. Board Member Telecom ParisTech alumni July 2012  –  June 2014  (2 years) Définition des actions stratégiques pour améliorer l'image de l'association auprès des élèves. Software Development Manager Netvizio October 2010  –  December 2011  (1 year 3 months) Tel aviv (Israël) En charge du développement des solutions pour Télévisions connectées de Netvizio. \n- Design d'une solution middle-ware pour combler le manque de standard parmi les constructeurs de télévisons connectées. \n- Design et implémentation d'applications pour télévisions connectées \n- Définition du processus de recrutement de développeurs \n- Acquisition d'une forte expérience de l’environnement et des outils de développement sur les télévisions connectées Samsung Consultant en management de projet Web DJRiS November 2009  –  August 2010  (10 months) Conseil en strategie d'un web projet. \nDeveloppement d'applications Facebook dans le cadre d'une campagne de communication pour le lancement de ce projet Consultant et developpeur Telecom Etude September 2007  –  August 2010  (3 years) Réalisation de plusieurs projets : \n- Consultant en gestion de projet IT \n- Développement d'applications Facebook \n- Récupération de données et classification automatique \n- Développement d'une plate-forme de partage de données Consultant Dialogue Social Enterprise GmbH January 2010  –  April 2010  (4 months) Définition, design et implémentation d'une solution de partage de données pour Dialogue Social Entreprise, une petite entreprise très dispersée internationalement Product Manager Google July 2014  – Present (1 year 2 months) San Francisco Bay Area Help improve features of the Google ads buying and management platform \"AdWords\" for the power users. \n \nI focus on: \n- URL Upgrade to improve tracking management \n- Bulk toolks (AdWords Scripts, automated rules, Bulk edit and upload in AdWords front end) \n- Business data Management  Product Manager Google July 2014  – Present (1 year 2 months) San Francisco Bay Area Help improve features of the Google ads buying and management platform \"AdWords\" for the power users. \n \nI focus on: \n- URL Upgrade to improve tracking management \n- Bulk toolks (AdWords Scripts, automated rules, Bulk edit and upload in AdWords front end) \n- Business data Management  Customer Solutions Engineer Google January 2012  –  July 2014  (2 years 7 months) Paris Area, France June 2013 - July 2014 \nSingle Business Engineer for SEEMEA on a programmatic advertising on display project. \n- Supporting Customers of this project in France, Russia, Qatar, Spain & Italy  \n- Defining serviceability and scaling opportunities and leading global project on scaling via partnerships. \n- Building custom integrations for very advanced customers. \n \nJanuary 2012 - Mai 2013 \n1 of 3 engineers supporting the large customers sales organisation (500+ sales supporting $1B+) \n- Supported complex product integration with 50+ Fortune 100 advertisers with an estimated annual  \n$20M impact in incremental revenue. \n- Developed  tools  to  improve  and  optimize  sales  processes  (self  support  platform,  Tag customization  interface)  used  by  more  than  1.5K  internal  active  users  and  saving  an estimated 10,000 FTE hours. \n- Designed  and  developed  an  automated  email  program  that  sends  search  trends  to businesses. Adopted by more than a thousand Fortune 100 advertisers worldwide in a year, it sends 12K emails every weeks and received a “dare to be audacious” Gold award in 2013. \n \nJuly 2012 - Mai 2013 \n20% Product Manager \nHelped grow the global performance display business to $1B in 2013 \n- Drove the integration of performance display related feature into the chrome extension  \n‘Tag Assistant’ spanning 100K external users and 3K internal users. The extension helps sales & customers better troubleshoot issues in the integration of Google tag products and delivered almost 2 millions diagnostics on performance display products in 2013. \n- Developed a test & demo platform for customers & sales to give a better understanding  \nof the performance display products. \n- Involved in product roadmap discussion and proposed a few features who got integrated in  \nthe adwords front‐end. Customer Solutions Engineer Google January 2012  –  July 2014  (2 years 7 months) Paris Area, France June 2013 - July 2014 \nSingle Business Engineer for SEEMEA on a programmatic advertising on display project. \n- Supporting Customers of this project in France, Russia, Qatar, Spain & Italy  \n- Defining serviceability and scaling opportunities and leading global project on scaling via partnerships. \n- Building custom integrations for very advanced customers. \n \nJanuary 2012 - Mai 2013 \n1 of 3 engineers supporting the large customers sales organisation (500+ sales supporting $1B+) \n- Supported complex product integration with 50+ Fortune 100 advertisers with an estimated annual  \n$20M impact in incremental revenue. \n- Developed  tools  to  improve  and  optimize  sales  processes  (self  support  platform,  Tag customization  interface)  used  by  more  than  1.5K  internal  active  users  and  saving  an estimated 10,000 FTE hours. \n- Designed  and  developed  an  automated  email  program  that  sends  search  trends  to businesses. Adopted by more than a thousand Fortune 100 advertisers worldwide in a year, it sends 12K emails every weeks and received a “dare to be audacious” Gold award in 2013. \n \nJuly 2012 - Mai 2013 \n20% Product Manager \nHelped grow the global performance display business to $1B in 2013 \n- Drove the integration of performance display related feature into the chrome extension  \n‘Tag Assistant’ spanning 100K external users and 3K internal users. The extension helps sales & customers better troubleshoot issues in the integration of Google tag products and delivered almost 2 millions diagnostics on performance display products in 2013. \n- Developed a test & demo platform for customers & sales to give a better understanding  \nof the performance display products. \n- Involved in product roadmap discussion and proposed a few features who got integrated in  \nthe adwords front‐end. Board Member Telecom ParisTech alumni July 2012  –  June 2014  (2 years) Définition des actions stratégiques pour améliorer l'image de l'association auprès des élèves. Board Member Telecom ParisTech alumni July 2012  –  June 2014  (2 years) Définition des actions stratégiques pour améliorer l'image de l'association auprès des élèves. Software Development Manager Netvizio October 2010  –  December 2011  (1 year 3 months) Tel aviv (Israël) En charge du développement des solutions pour Télévisions connectées de Netvizio. \n- Design d'une solution middle-ware pour combler le manque de standard parmi les constructeurs de télévisons connectées. \n- Design et implémentation d'applications pour télévisions connectées \n- Définition du processus de recrutement de développeurs \n- Acquisition d'une forte expérience de l’environnement et des outils de développement sur les télévisions connectées Samsung Software Development Manager Netvizio October 2010  –  December 2011  (1 year 3 months) Tel aviv (Israël) En charge du développement des solutions pour Télévisions connectées de Netvizio. \n- Design d'une solution middle-ware pour combler le manque de standard parmi les constructeurs de télévisons connectées. \n- Design et implémentation d'applications pour télévisions connectées \n- Définition du processus de recrutement de développeurs \n- Acquisition d'une forte expérience de l’environnement et des outils de développement sur les télévisions connectées Samsung Consultant en management de projet Web DJRiS November 2009  –  August 2010  (10 months) Conseil en strategie d'un web projet. \nDeveloppement d'applications Facebook dans le cadre d'une campagne de communication pour le lancement de ce projet Consultant en management de projet Web DJRiS November 2009  –  August 2010  (10 months) Conseil en strategie d'un web projet. \nDeveloppement d'applications Facebook dans le cadre d'une campagne de communication pour le lancement de ce projet Consultant et developpeur Telecom Etude September 2007  –  August 2010  (3 years) Réalisation de plusieurs projets : \n- Consultant en gestion de projet IT \n- Développement d'applications Facebook \n- Récupération de données et classification automatique \n- Développement d'une plate-forme de partage de données Consultant et developpeur Telecom Etude September 2007  –  August 2010  (3 years) Réalisation de plusieurs projets : \n- Consultant en gestion de projet IT \n- Développement d'applications Facebook \n- Récupération de données et classification automatique \n- Développement d'une plate-forme de partage de données Consultant Dialogue Social Enterprise GmbH January 2010  –  April 2010  (4 months) Définition, design et implémentation d'une solution de partage de données pour Dialogue Social Entreprise, une petite entreprise très dispersée internationalement Consultant Dialogue Social Enterprise GmbH January 2010  –  April 2010  (4 months) Définition, design et implémentation d'une solution de partage de données pour Dialogue Social Entreprise, une petite entreprise très dispersée internationalement Languages French Native or bilingual proficiency English Native or bilingual proficiency German Elementary proficiency Hebrew Limited working proficiency French Native or bilingual proficiency English Native or bilingual proficiency German Elementary proficiency Hebrew Limited working proficiency French Native or bilingual proficiency English Native or bilingual proficiency German Elementary proficiency Hebrew Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Limited working proficiency Skills Business Strategy Product Specification Team Leadership Online Marketing Online Advertising Web Analytics Web Project Management International Project... JavaScript HTML CSS Python Java PHP MySQL Strategy Software Development Digital Marketing E-commerce Computer Science Software Engineering Web Development Web Applications Network Security SEM Google Adwords Web 2.0 Programming Display Advertising Algorithms Machine Learning REST Search Advertising Big Data Shell Scripting Mobile Internet System Architecture TCP/IP SQL Google App Engine Analytics Entrepreneurship Google Apps Conversion Optimization Google Webmaster Tools Internet Strategy PPC Search Web Marketing Product Management See 35+     See less Skills  Business Strategy Product Specification Team Leadership Online Marketing Online Advertising Web Analytics Web Project Management International Project... JavaScript HTML CSS Python Java PHP MySQL Strategy Software Development Digital Marketing E-commerce Computer Science Software Engineering Web Development Web Applications Network Security SEM Google Adwords Web 2.0 Programming Display Advertising Algorithms Machine Learning REST Search Advertising Big Data Shell Scripting Mobile Internet System Architecture TCP/IP SQL Google App Engine Analytics Entrepreneurship Google Apps Conversion Optimization Google Webmaster Tools Internet Strategy PPC Search Web Marketing Product Management See 35+     See less Business Strategy Product Specification Team Leadership Online Marketing Online Advertising Web Analytics Web Project Management International Project... JavaScript HTML CSS Python Java PHP MySQL Strategy Software Development Digital Marketing E-commerce Computer Science Software Engineering Web Development Web Applications Network Security SEM Google Adwords Web 2.0 Programming Display Advertising Algorithms Machine Learning REST Search Advertising Big Data Shell Scripting Mobile Internet System Architecture TCP/IP SQL Google App Engine Analytics Entrepreneurship Google Apps Conversion Optimization Google Webmaster Tools Internet Strategy PPC Search Web Marketing Product Management See 35+     See less Business Strategy Product Specification Team Leadership Online Marketing Online Advertising Web Analytics Web Project Management International Project... JavaScript HTML CSS Python Java PHP MySQL Strategy Software Development Digital Marketing E-commerce Computer Science Software Engineering Web Development Web Applications Network Security SEM Google Adwords Web 2.0 Programming Display Advertising Algorithms Machine Learning REST Search Advertising Big Data Shell Scripting Mobile Internet System Architecture TCP/IP SQL Google App Engine Analytics Entrepreneurship Google Apps Conversion Optimization Google Webmaster Tools Internet Strategy PPC Search Web Marketing Product Management See 35+     See less Education University of California, Berkeley, Haas School of Business Executive Education,  Product Management 2014  – 2014 Executive education of UC Berkeley on Product management Imperial College London Msc,  Advanced Computing 2009  – 2010 Intelligent Data and Machine learning \nNetwork Security \nQuantitative Finance \nAutomated and logic programming (Prolog) \nAdvanced Database \nParallel and distributed Algorithms Institut Eurécom Master 1,  Network & Security 2008  – 2009 Minor in Business management Telecom ParisTech Ingenieur,  TIC 2005  – 2010 2007 - 2010 : Telecom ParisTech \n2005 - 2007 : Preparatory classes Activities and Societies:  Organisation du Gala ,  Journal ,  Club ski University of California, Berkeley, Haas School of Business Executive Education,  Product Management 2014  – 2014 Executive education of UC Berkeley on Product management University of California, Berkeley, Haas School of Business Executive Education,  Product Management 2014  – 2014 Executive education of UC Berkeley on Product management University of California, Berkeley, Haas School of Business Executive Education,  Product Management 2014  – 2014 Executive education of UC Berkeley on Product management Imperial College London Msc,  Advanced Computing 2009  – 2010 Intelligent Data and Machine learning \nNetwork Security \nQuantitative Finance \nAutomated and logic programming (Prolog) \nAdvanced Database \nParallel and distributed Algorithms Imperial College London Msc,  Advanced Computing 2009  – 2010 Intelligent Data and Machine learning \nNetwork Security \nQuantitative Finance \nAutomated and logic programming (Prolog) \nAdvanced Database \nParallel and distributed Algorithms Imperial College London Msc,  Advanced Computing 2009  – 2010 Intelligent Data and Machine learning \nNetwork Security \nQuantitative Finance \nAutomated and logic programming (Prolog) \nAdvanced Database \nParallel and distributed Algorithms Institut Eurécom Master 1,  Network & Security 2008  – 2009 Minor in Business management Institut Eurécom Master 1,  Network & Security 2008  – 2009 Minor in Business management Institut Eurécom Master 1,  Network & Security 2008  – 2009 Minor in Business management Telecom ParisTech Ingenieur,  TIC 2005  – 2010 2007 - 2010 : Telecom ParisTech \n2005 - 2007 : Preparatory classes Activities and Societies:  Organisation du Gala ,  Journal ,  Club ski Telecom ParisTech Ingenieur,  TIC 2005  – 2010 2007 - 2010 : Telecom ParisTech \n2005 - 2007 : Preparatory classes Activities and Societies:  Organisation du Gala ,  Journal ,  Club ski Telecom ParisTech Ingenieur,  TIC 2005  – 2010 2007 - 2010 : Telecom ParisTech \n2005 - 2007 : Preparatory classes Activities and Societies:  Organisation du Gala ,  Journal ,  Club ski Honors & Awards ", "Summary Software Engineer with 7 years experience implementing large client-server systems in Java and C# using object-oriented programming, including two as a lead/scrum master; develop and design open source development platforms to build rich Internet applications faster; I implement a framework to automate test execution increasing team productivity. \nResults-oriented focus in agile development. Summary Software Engineer with 7 years experience implementing large client-server systems in Java and C# using object-oriented programming, including two as a lead/scrum master; develop and design open source development platforms to build rich Internet applications faster; I implement a framework to automate test execution increasing team productivity. \nResults-oriented focus in agile development. Software Engineer with 7 years experience implementing large client-server systems in Java and C# using object-oriented programming, including two as a lead/scrum master; develop and design open source development platforms to build rich Internet applications faster; I implement a framework to automate test execution increasing team productivity. \nResults-oriented focus in agile development. Software Engineer with 7 years experience implementing large client-server systems in Java and C# using object-oriented programming, including two as a lead/scrum master; develop and design open source development platforms to build rich Internet applications faster; I implement a framework to automate test execution increasing team productivity. \nResults-oriented focus in agile development. Experience Customer Solutions Engineer Google February 2015  – Present (7 months) Seattle, Washington Software Engineer Intel Corporation May 2013  –  February 2015  (1 year 10 months) Seattle, Washington Led a project with a focus on internal customer care providing technical solutions and support. \n \nDeveloped a scalable web service used as a middleware to connect client applications through a Restful API and an XMPP Server to add user and device information (C#, Tsung). \n \nSubmitted an invention for the XMPP Connection pool maximization used to reduce the amount of resources (CPU, memory and network). \n \nDesigned and developed a live video conference demo integrating WebRTC and XMPP Jingle as signaling channel (Javascript). \n \nDeveloped an Advanced XMPP client (Google Chrome extension) to check back-end response for different XMPP requests (Javascript). Associate Professor Universidad Empresarial Siglo 21 July 2011  –  April 2013  (1 year 10 months) Argentina Software Engineer Intel Corporation April 2008  –  April 2013  (5 years 1 month) Argentina Led teams with a focus on team leadership, data analysis and stakeholder management. \n \nDeveloped key features that enabled marketing team to make deals with Adobe AIR and Best Buy. (C#) \n \nDesigned and developed the first version of AppUp Windows User Experience using Model-View-Controller pattern design to minimize the risk of introducing errors by enabling product evolution. (C#, XML). \n \nDesigned and developed Tango Creek, an in-house platform encourages and enables service offerings strategic differentiation in the marketplace. (C#, web services) Software Engineer (Vendor) Google January 2008  –  April 2008  (4 months) San Francisco Bay Area Improved product quality by reducing 20 percent of bugs in less than 2 weeks with an average of 2 bugs fixed per day for Google HR internal tool (Java, Hibernate, Webworks, Googlee and SOAP) Software Engineer Globant January 2007  –  April 2008  (1 year 4 months) Implemented open source platform created to build rich Internet applications faster. (Java, Spring) \n \nReduced response time by 55% by implementing a second level cache to improve performance on a web service. (Java, EHCACHE) Software Engineer in Test (Vendor) Google February 2007  –  October 2007  (9 months) San Francisco Bay Area Implemented and designed a framework to automate functional test cases. The framework was presented at Google Test Automation Conference (GTAC): \"Building a Flexible and Extensible Framework around Selenium\". (Java) \n \nObtained Google Readability Code Review for Java by implementing Decorator Pattern Design used to extend functionality on runtime. (Java) Software Developer Grupo Sempai, S.L. July 2006  –  January 2007  (7 months) Developed an application that translate from any programing language to a Service Oriented Architecture (SOA) over Java as an Eclipse plug-in. Customer Solutions Engineer Google February 2015  – Present (7 months) Seattle, Washington Customer Solutions Engineer Google February 2015  – Present (7 months) Seattle, Washington Software Engineer Intel Corporation May 2013  –  February 2015  (1 year 10 months) Seattle, Washington Led a project with a focus on internal customer care providing technical solutions and support. \n \nDeveloped a scalable web service used as a middleware to connect client applications through a Restful API and an XMPP Server to add user and device information (C#, Tsung). \n \nSubmitted an invention for the XMPP Connection pool maximization used to reduce the amount of resources (CPU, memory and network). \n \nDesigned and developed a live video conference demo integrating WebRTC and XMPP Jingle as signaling channel (Javascript). \n \nDeveloped an Advanced XMPP client (Google Chrome extension) to check back-end response for different XMPP requests (Javascript). Software Engineer Intel Corporation May 2013  –  February 2015  (1 year 10 months) Seattle, Washington Led a project with a focus on internal customer care providing technical solutions and support. \n \nDeveloped a scalable web service used as a middleware to connect client applications through a Restful API and an XMPP Server to add user and device information (C#, Tsung). \n \nSubmitted an invention for the XMPP Connection pool maximization used to reduce the amount of resources (CPU, memory and network). \n \nDesigned and developed a live video conference demo integrating WebRTC and XMPP Jingle as signaling channel (Javascript). \n \nDeveloped an Advanced XMPP client (Google Chrome extension) to check back-end response for different XMPP requests (Javascript). Associate Professor Universidad Empresarial Siglo 21 July 2011  –  April 2013  (1 year 10 months) Argentina Associate Professor Universidad Empresarial Siglo 21 July 2011  –  April 2013  (1 year 10 months) Argentina Software Engineer Intel Corporation April 2008  –  April 2013  (5 years 1 month) Argentina Led teams with a focus on team leadership, data analysis and stakeholder management. \n \nDeveloped key features that enabled marketing team to make deals with Adobe AIR and Best Buy. (C#) \n \nDesigned and developed the first version of AppUp Windows User Experience using Model-View-Controller pattern design to minimize the risk of introducing errors by enabling product evolution. (C#, XML). \n \nDesigned and developed Tango Creek, an in-house platform encourages and enables service offerings strategic differentiation in the marketplace. (C#, web services) Software Engineer Intel Corporation April 2008  –  April 2013  (5 years 1 month) Argentina Led teams with a focus on team leadership, data analysis and stakeholder management. \n \nDeveloped key features that enabled marketing team to make deals with Adobe AIR and Best Buy. (C#) \n \nDesigned and developed the first version of AppUp Windows User Experience using Model-View-Controller pattern design to minimize the risk of introducing errors by enabling product evolution. (C#, XML). \n \nDesigned and developed Tango Creek, an in-house platform encourages and enables service offerings strategic differentiation in the marketplace. (C#, web services) Software Engineer (Vendor) Google January 2008  –  April 2008  (4 months) San Francisco Bay Area Improved product quality by reducing 20 percent of bugs in less than 2 weeks with an average of 2 bugs fixed per day for Google HR internal tool (Java, Hibernate, Webworks, Googlee and SOAP) Software Engineer (Vendor) Google January 2008  –  April 2008  (4 months) San Francisco Bay Area Improved product quality by reducing 20 percent of bugs in less than 2 weeks with an average of 2 bugs fixed per day for Google HR internal tool (Java, Hibernate, Webworks, Googlee and SOAP) Software Engineer Globant January 2007  –  April 2008  (1 year 4 months) Implemented open source platform created to build rich Internet applications faster. (Java, Spring) \n \nReduced response time by 55% by implementing a second level cache to improve performance on a web service. (Java, EHCACHE) Software Engineer Globant January 2007  –  April 2008  (1 year 4 months) Implemented open source platform created to build rich Internet applications faster. (Java, Spring) \n \nReduced response time by 55% by implementing a second level cache to improve performance on a web service. (Java, EHCACHE) Software Engineer in Test (Vendor) Google February 2007  –  October 2007  (9 months) San Francisco Bay Area Implemented and designed a framework to automate functional test cases. The framework was presented at Google Test Automation Conference (GTAC): \"Building a Flexible and Extensible Framework around Selenium\". (Java) \n \nObtained Google Readability Code Review for Java by implementing Decorator Pattern Design used to extend functionality on runtime. (Java) Software Engineer in Test (Vendor) Google February 2007  –  October 2007  (9 months) San Francisco Bay Area Implemented and designed a framework to automate functional test cases. The framework was presented at Google Test Automation Conference (GTAC): \"Building a Flexible and Extensible Framework around Selenium\". (Java) \n \nObtained Google Readability Code Review for Java by implementing Decorator Pattern Design used to extend functionality on runtime. (Java) Software Developer Grupo Sempai, S.L. July 2006  –  January 2007  (7 months) Developed an application that translate from any programing language to a Service Oriented Architecture (SOA) over Java as an Eclipse plug-in. Software Developer Grupo Sempai, S.L. July 2006  –  January 2007  (7 months) Developed an application that translate from any programing language to a Service Oriented Architecture (SOA) over Java as an Eclipse plug-in. Languages Spanish English Spanish English Spanish English Skills Java Selenium Web Services XML HTML C# Spring Maven TestNG Object Oriented Design Design Patterns MVC Algorithms Agile Scrum Project Management QA Engineering Software Engineering Test Automation Teamwork Team Leadership Agile Methodologies Subversion REST Hibernate See 10+     See less Skills  Java Selenium Web Services XML HTML C# Spring Maven TestNG Object Oriented Design Design Patterns MVC Algorithms Agile Scrum Project Management QA Engineering Software Engineering Test Automation Teamwork Team Leadership Agile Methodologies Subversion REST Hibernate See 10+     See less Java Selenium Web Services XML HTML C# Spring Maven TestNG Object Oriented Design Design Patterns MVC Algorithms Agile Scrum Project Management QA Engineering Software Engineering Test Automation Teamwork Team Leadership Agile Methodologies Subversion REST Hibernate See 10+     See less Java Selenium Web Services XML HTML C# Spring Maven TestNG Object Oriented Design Design Patterns MVC Algorithms Agile Scrum Project Management QA Engineering Software Engineering Test Automation Teamwork Team Leadership Agile Methodologies Subversion REST Hibernate See 10+     See less Education Universidad Blas Pascal Diploma in Project Management,  Project Management 2011  – 2011 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Systems Engineer 2000  – 2008 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Programmer Analyst 2000  – 2003 Universidad Blas Pascal Diploma in Project Management,  Project Management 2011  – 2011 Universidad Blas Pascal Diploma in Project Management,  Project Management 2011  – 2011 Universidad Blas Pascal Diploma in Project Management,  Project Management 2011  – 2011 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Systems Engineer 2000  – 2008 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Systems Engineer 2000  – 2008 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Systems Engineer 2000  – 2008 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Programmer Analyst 2000  – 2003 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Programmer Analyst 2000  – 2003 Universidad Nacional del Centro de la Provincia de Buenos Aires Engineer's Degree,  Computer Science , Programmer Analyst 2000  – 2003 Honors & Awards Additional Honors & Awards Two Intel Division Recognition Award (Q1 2010 and Q3 2010): for delivered a product in record time and for outstanding performance and stability improvements. Additional Honors & Awards Two Intel Division Recognition Award (Q1 2010 and Q3 2010): for delivered a product in record time and for outstanding performance and stability improvements. Additional Honors & Awards Two Intel Division Recognition Award (Q1 2010 and Q3 2010): for delivered a product in record time and for outstanding performance and stability improvements. Additional Honors & Awards Two Intel Division Recognition Award (Q1 2010 and Q3 2010): for delivered a product in record time and for outstanding performance and stability improvements. ", "Experience Product Technology Manager, Mobile Google January 2015  – Present (8 months) São Paulo Area, Brazil Responsible for end-to-end incubation and implementation of Alpha and Beta products  \n- Consolidate product feedback for feature requests and escalations \n- Own product serviceability and release readiness \n- Rollout new products / feature with Global Ops Customer Solutions Engineer Google January 2012  –  January 2015  (3 years 1 month) São Paulo Area, Brazil - Sales Engineer: solve customers' business issues with Google technology, working with a variety of audiences, which include marketing professionals and engineers. \n \n- Propose, design, create and present prototypes, demos and proofs of concept \n \n- Collaborate closely with Google's engineering groups to create better products and technical solutions that enables the growth of our customers' business. \n \n- Dynamic Remarketing Specialist Customer Solutions Engineer Intern Google August 2011  –  January 2012  (6 months) São Paulo Area, Brazil Cofounder & Business Director MobiClub August 2010  –  August 2011  (1 year 1 month) Recife Area, Brazil Cofounder of the startup Mobiclub, an Innovative Mobile Payment company that won the Campus Party innovation challenge, the biggest technology event in Brazil. Microsoft CRM Dynamics Developer Netbull Consultoria August 2009  –  January 2010  (6 months) Developed custom solutions for customers using Microsoft CRM Dynamics 4.0 and Asp .Net Instructor Microsoft Innovation Center Pernambuco March 2009  –  December 2009  (10 months) Instructor of Microsoft's Student-to-Business (S2B) program (ASP . Net, C# e SQL Server) Intern Microsoft Innovation Center Pernambuco January 2009  –  August 2009  (8 months) Intern of Microsoft Innovation Center Pernambuco researching and developing new technology solutions for the local market using Microsoft products. Product Technology Manager, Mobile Google January 2015  – Present (8 months) São Paulo Area, Brazil Responsible for end-to-end incubation and implementation of Alpha and Beta products  \n- Consolidate product feedback for feature requests and escalations \n- Own product serviceability and release readiness \n- Rollout new products / feature with Global Ops Product Technology Manager, Mobile Google January 2015  – Present (8 months) São Paulo Area, Brazil Responsible for end-to-end incubation and implementation of Alpha and Beta products  \n- Consolidate product feedback for feature requests and escalations \n- Own product serviceability and release readiness \n- Rollout new products / feature with Global Ops Customer Solutions Engineer Google January 2012  –  January 2015  (3 years 1 month) São Paulo Area, Brazil - Sales Engineer: solve customers' business issues with Google technology, working with a variety of audiences, which include marketing professionals and engineers. \n \n- Propose, design, create and present prototypes, demos and proofs of concept \n \n- Collaborate closely with Google's engineering groups to create better products and technical solutions that enables the growth of our customers' business. \n \n- Dynamic Remarketing Specialist Customer Solutions Engineer Google January 2012  –  January 2015  (3 years 1 month) São Paulo Area, Brazil - Sales Engineer: solve customers' business issues with Google technology, working with a variety of audiences, which include marketing professionals and engineers. \n \n- Propose, design, create and present prototypes, demos and proofs of concept \n \n- Collaborate closely with Google's engineering groups to create better products and technical solutions that enables the growth of our customers' business. \n \n- Dynamic Remarketing Specialist Customer Solutions Engineer Intern Google August 2011  –  January 2012  (6 months) São Paulo Area, Brazil Customer Solutions Engineer Intern Google August 2011  –  January 2012  (6 months) São Paulo Area, Brazil Cofounder & Business Director MobiClub August 2010  –  August 2011  (1 year 1 month) Recife Area, Brazil Cofounder of the startup Mobiclub, an Innovative Mobile Payment company that won the Campus Party innovation challenge, the biggest technology event in Brazil. Cofounder & Business Director MobiClub August 2010  –  August 2011  (1 year 1 month) Recife Area, Brazil Cofounder of the startup Mobiclub, an Innovative Mobile Payment company that won the Campus Party innovation challenge, the biggest technology event in Brazil. Microsoft CRM Dynamics Developer Netbull Consultoria August 2009  –  January 2010  (6 months) Developed custom solutions for customers using Microsoft CRM Dynamics 4.0 and Asp .Net Microsoft CRM Dynamics Developer Netbull Consultoria August 2009  –  January 2010  (6 months) Developed custom solutions for customers using Microsoft CRM Dynamics 4.0 and Asp .Net Instructor Microsoft Innovation Center Pernambuco March 2009  –  December 2009  (10 months) Instructor of Microsoft's Student-to-Business (S2B) program (ASP . Net, C# e SQL Server) Instructor Microsoft Innovation Center Pernambuco March 2009  –  December 2009  (10 months) Instructor of Microsoft's Student-to-Business (S2B) program (ASP . Net, C# e SQL Server) Intern Microsoft Innovation Center Pernambuco January 2009  –  August 2009  (8 months) Intern of Microsoft Innovation Center Pernambuco researching and developing new technology solutions for the local market using Microsoft products. Intern Microsoft Innovation Center Pernambuco January 2009  –  August 2009  (8 months) Intern of Microsoft Innovation Center Pernambuco researching and developing new technology solutions for the local market using Microsoft products. Languages English English English Skills Skills     Education FIA - Fundação Instituto de Administração Postgraduate,  Business 2013  – 2014 Universidade Federal de Pernambuco Bachelor's degree,  Computer Science 2007  – 2011 EMPRETEC - SEBRAE Empretec,  Business Administration and Management , General 2010  – 2010 Empretec is a United Nations programme to promote the creation of sustainable small- and medium-sized enterprises (SMEs). Empretec works to support entrepreneurs to build innovative and internationally competitive SMEs. Grayling High School High School 2005  – 2006 Activities and Societies:  Honor Roll Student FIA - Fundação Instituto de Administração Postgraduate,  Business 2013  – 2014 FIA - Fundação Instituto de Administração Postgraduate,  Business 2013  – 2014 FIA - Fundação Instituto de Administração Postgraduate,  Business 2013  – 2014 Universidade Federal de Pernambuco Bachelor's degree,  Computer Science 2007  – 2011 Universidade Federal de Pernambuco Bachelor's degree,  Computer Science 2007  – 2011 Universidade Federal de Pernambuco Bachelor's degree,  Computer Science 2007  – 2011 EMPRETEC - SEBRAE Empretec,  Business Administration and Management , General 2010  – 2010 Empretec is a United Nations programme to promote the creation of sustainable small- and medium-sized enterprises (SMEs). Empretec works to support entrepreneurs to build innovative and internationally competitive SMEs. EMPRETEC - SEBRAE Empretec,  Business Administration and Management , General 2010  – 2010 Empretec is a United Nations programme to promote the creation of sustainable small- and medium-sized enterprises (SMEs). Empretec works to support entrepreneurs to build innovative and internationally competitive SMEs. EMPRETEC - SEBRAE Empretec,  Business Administration and Management , General 2010  – 2010 Empretec is a United Nations programme to promote the creation of sustainable small- and medium-sized enterprises (SMEs). Empretec works to support entrepreneurs to build innovative and internationally competitive SMEs. Grayling High School High School 2005  – 2006 Activities and Societies:  Honor Roll Student Grayling High School High School 2005  – 2006 Activities and Societies:  Honor Roll Student Grayling High School High School 2005  – 2006 Activities and Societies:  Honor Roll Student Honors & Awards ", "Summary “Just as energy is the basis of life itself, and ideas the source of innovation, so is innovation the vital spark of all human change, improvement and progress” Ted Levitt Summary “Just as energy is the basis of life itself, and ideas the source of innovation, so is innovation the vital spark of all human change, improvement and progress” Ted Levitt “Just as energy is the basis of life itself, and ideas the source of innovation, so is innovation the vital spark of all human change, improvement and progress” Ted Levitt “Just as energy is the basis of life itself, and ideas the source of innovation, so is innovation the vital spark of all human change, improvement and progress” Ted Levitt Experience Product Manager Google May 2015  – Present (4 months) Mountain View, CA Mobile app pomotion advertising in Google Search Product Technology Manager Google December 2013  –  May 2015  (1 year 6 months) San Francisco Bay Area Ensuring the success of mobile advertising products by facilitating trials with app developers and advertisers, building tools to enable sales teams, fostering strategic external partnerships, and providing real-time feedback to product teams. Customer Solutions Engineer Google November 2011  –  December 2013  (2 years 2 months) Mountain View, CA Providing engineering consulting to Google's largest customers, identifying technical solutions to complex business problems and evangelizing Google's advanced advertising technologies. Software Developer Propertyware, Inc. May 2011  –  November 2011  (7 months) San Francisco Bay Area Built features and implemented improvements to Propertyware.com, an online property management software. Solutions Engineer / .NET Engineer Firemans Fund Insurance Company June 2010  –  May 2011  (1 year) Novato, CA Coordinated defect solutions and feature implementations between engineers and business analysts. New Product Development Intern Neudesic May 2009  –  August 2009  (4 months) Technical writing and web design IT Support Consultant USC May 2007  –  June 2008  (1 year 2 months) Customer facing IT support specialist for professors and graduate students of the College of Arts and Letters Engineering Intern iRadeon May 2006  –  August 2006  (4 months) Technical writing and quality assurance Product Manager Google May 2015  – Present (4 months) Mountain View, CA Mobile app pomotion advertising in Google Search Product Manager Google May 2015  – Present (4 months) Mountain View, CA Mobile app pomotion advertising in Google Search Product Technology Manager Google December 2013  –  May 2015  (1 year 6 months) San Francisco Bay Area Ensuring the success of mobile advertising products by facilitating trials with app developers and advertisers, building tools to enable sales teams, fostering strategic external partnerships, and providing real-time feedback to product teams. Product Technology Manager Google December 2013  –  May 2015  (1 year 6 months) San Francisco Bay Area Ensuring the success of mobile advertising products by facilitating trials with app developers and advertisers, building tools to enable sales teams, fostering strategic external partnerships, and providing real-time feedback to product teams. Customer Solutions Engineer Google November 2011  –  December 2013  (2 years 2 months) Mountain View, CA Providing engineering consulting to Google's largest customers, identifying technical solutions to complex business problems and evangelizing Google's advanced advertising technologies. Customer Solutions Engineer Google November 2011  –  December 2013  (2 years 2 months) Mountain View, CA Providing engineering consulting to Google's largest customers, identifying technical solutions to complex business problems and evangelizing Google's advanced advertising technologies. Software Developer Propertyware, Inc. May 2011  –  November 2011  (7 months) San Francisco Bay Area Built features and implemented improvements to Propertyware.com, an online property management software. Software Developer Propertyware, Inc. May 2011  –  November 2011  (7 months) San Francisco Bay Area Built features and implemented improvements to Propertyware.com, an online property management software. Solutions Engineer / .NET Engineer Firemans Fund Insurance Company June 2010  –  May 2011  (1 year) Novato, CA Coordinated defect solutions and feature implementations between engineers and business analysts. Solutions Engineer / .NET Engineer Firemans Fund Insurance Company June 2010  –  May 2011  (1 year) Novato, CA Coordinated defect solutions and feature implementations between engineers and business analysts. New Product Development Intern Neudesic May 2009  –  August 2009  (4 months) Technical writing and web design New Product Development Intern Neudesic May 2009  –  August 2009  (4 months) Technical writing and web design IT Support Consultant USC May 2007  –  June 2008  (1 year 2 months) Customer facing IT support specialist for professors and graduate students of the College of Arts and Letters IT Support Consultant USC May 2007  –  June 2008  (1 year 2 months) Customer facing IT support specialist for professors and graduate students of the College of Arts and Letters Engineering Intern iRadeon May 2006  –  August 2006  (4 months) Technical writing and quality assurance Engineering Intern iRadeon May 2006  –  August 2006  (4 months) Technical writing and quality assurance Skills SQL HTML C++ MySQL Java XML JavaScript Python Linux C# CSS C Software Engineering Skills  SQL HTML C++ MySQL Java XML JavaScript Python Linux C# CSS C Software Engineering SQL HTML C++ MySQL Java XML JavaScript Python Linux C# CSS C Software Engineering SQL HTML C++ MySQL Java XML JavaScript Python Linux C# CSS C Software Engineering Education University of California, Berkeley, Haas School of Business Product Management 2014  – 2014 Certificate University of Southern California BS,  Computer Science 2005  – 2010 2nd place award recipient in a national FAA software design competition. Activities and Societies:  Society of Women Engineers ,  Women in Engineering ,  Alpha Phi University of California, Berkeley, Haas School of Business Product Management 2014  – 2014 Certificate University of California, Berkeley, Haas School of Business Product Management 2014  – 2014 Certificate University of California, Berkeley, Haas School of Business Product Management 2014  – 2014 Certificate University of Southern California BS,  Computer Science 2005  – 2010 2nd place award recipient in a national FAA software design competition. Activities and Societies:  Society of Women Engineers ,  Women in Engineering ,  Alpha Phi University of Southern California BS,  Computer Science 2005  – 2010 2nd place award recipient in a national FAA software design competition. Activities and Societies:  Society of Women Engineers ,  Women in Engineering ,  Alpha Phi University of Southern California BS,  Computer Science 2005  – 2010 2nd place award recipient in a national FAA software design competition. Activities and Societies:  Society of Women Engineers ,  Women in Engineering ,  Alpha Phi ", "Summary An engineer turned technical consultant, currently working at Google. I've spent years both working on actual software projects and just as much time working directly with clients to meet their business needs with technical solutions. \n \nMy strengths lie in the breadth and depth of my knowledge and my ability to help carry any stakeholder through the process of understanding their business needs and the powers of the technologies they use. \n \nI have a strong passion for teaching, learning and technology and thrive in environments where new challenges demand personal growth and development. Summary An engineer turned technical consultant, currently working at Google. I've spent years both working on actual software projects and just as much time working directly with clients to meet their business needs with technical solutions. \n \nMy strengths lie in the breadth and depth of my knowledge and my ability to help carry any stakeholder through the process of understanding their business needs and the powers of the technologies they use. \n \nI have a strong passion for teaching, learning and technology and thrive in environments where new challenges demand personal growth and development. An engineer turned technical consultant, currently working at Google. I've spent years both working on actual software projects and just as much time working directly with clients to meet their business needs with technical solutions. \n \nMy strengths lie in the breadth and depth of my knowledge and my ability to help carry any stakeholder through the process of understanding their business needs and the powers of the technologies they use. \n \nI have a strong passion for teaching, learning and technology and thrive in environments where new challenges demand personal growth and development. An engineer turned technical consultant, currently working at Google. I've spent years both working on actual software projects and just as much time working directly with clients to meet their business needs with technical solutions. \n \nMy strengths lie in the breadth and depth of my knowledge and my ability to help carry any stakeholder through the process of understanding their business needs and the powers of the technologies they use. \n \nI have a strong passion for teaching, learning and technology and thrive in environments where new challenges demand personal growth and development. Experience Customer Solutions Engineer Google July 2013  – Present (2 years 2 months) Greater New York City Area Technical consultation for Google's largest customers. Web Solutions Engineer Google July 2011  –  July 2013  (2 years 1 month) San Francisco Bay Area Web based tools for Google's operations and sales teams. Web Developer The Jonah Group April 2010  –  September 2010  (6 months) Toronto, Canada Area Developing web based applications for external clients, usually using the Drupal framework. \n \nAlso developing and deploying customizations for clients sites. \n \nInteracting with clients directly and developing ad-hoc solutions. Web Developer The Jonah Group September 2009  –  December 2009  (4 months) Software Developer The Jonah Group January 2009  –  April 2009  (4 months) Web Developer Empathica 2007  –  2008  (1 year) Work with team to root cause and solve bugs. Feature development for core products under timelines. Web Developer Empathica 2007  –  2008  (1 year) Customer Solutions Engineer Google July 2013  – Present (2 years 2 months) Greater New York City Area Technical consultation for Google's largest customers. Customer Solutions Engineer Google July 2013  – Present (2 years 2 months) Greater New York City Area Technical consultation for Google's largest customers. Web Solutions Engineer Google July 2011  –  July 2013  (2 years 1 month) San Francisco Bay Area Web based tools for Google's operations and sales teams. Web Solutions Engineer Google July 2011  –  July 2013  (2 years 1 month) San Francisco Bay Area Web based tools for Google's operations and sales teams. Web Developer The Jonah Group April 2010  –  September 2010  (6 months) Toronto, Canada Area Developing web based applications for external clients, usually using the Drupal framework. \n \nAlso developing and deploying customizations for clients sites. \n \nInteracting with clients directly and developing ad-hoc solutions. Web Developer The Jonah Group April 2010  –  September 2010  (6 months) Toronto, Canada Area Developing web based applications for external clients, usually using the Drupal framework. \n \nAlso developing and deploying customizations for clients sites. \n \nInteracting with clients directly and developing ad-hoc solutions. Web Developer The Jonah Group September 2009  –  December 2009  (4 months) Web Developer The Jonah Group September 2009  –  December 2009  (4 months) Software Developer The Jonah Group January 2009  –  April 2009  (4 months) Software Developer The Jonah Group January 2009  –  April 2009  (4 months) Web Developer Empathica 2007  –  2008  (1 year) Work with team to root cause and solve bugs. Feature development for core products under timelines. Web Developer Empathica 2007  –  2008  (1 year) Work with team to root cause and solve bugs. Feature development for core products under timelines. Web Developer Empathica 2007  –  2008  (1 year) Web Developer Empathica 2007  –  2008  (1 year) Skills PHP JavaScript HTML Drupal Open Source C# MySQL Web Applications Git jQuery Java XML MVC Software Development Python Django Technical Sales... Project Management Stakeholder Management Stakeholder Engagement Big Data Analytics Data Visualization Scripting CSS Agile Methodologies Dependency Injection Software Design Statistical Data... Teaching Public Speaking Team Motivation Improvisation See 18+     See less Skills  PHP JavaScript HTML Drupal Open Source C# MySQL Web Applications Git jQuery Java XML MVC Software Development Python Django Technical Sales... Project Management Stakeholder Management Stakeholder Engagement Big Data Analytics Data Visualization Scripting CSS Agile Methodologies Dependency Injection Software Design Statistical Data... Teaching Public Speaking Team Motivation Improvisation See 18+     See less PHP JavaScript HTML Drupal Open Source C# MySQL Web Applications Git jQuery Java XML MVC Software Development Python Django Technical Sales... Project Management Stakeholder Management Stakeholder Engagement Big Data Analytics Data Visualization Scripting CSS Agile Methodologies Dependency Injection Software Design Statistical Data... Teaching Public Speaking Team Motivation Improvisation See 18+     See less PHP JavaScript HTML Drupal Open Source C# MySQL Web Applications Git jQuery Java XML MVC Software Development Python Django Technical Sales... Project Management Stakeholder Management Stakeholder Engagement Big Data Analytics Data Visualization Scripting CSS Agile Methodologies Dependency Injection Software Design Statistical Data... Teaching Public Speaking Team Motivation Improvisation See 18+     See less Education University of Waterloo BCS,  Mathematics 2006  – 2011 Computer Science \nMathematics \nPsychology \nJapanese Language University of Waterloo BCS,  Mathematics 2006  – 2011 Computer Science \nMathematics \nPsychology \nJapanese Language University of Waterloo BCS,  Mathematics 2006  – 2011 Computer Science \nMathematics \nPsychology \nJapanese Language University of Waterloo BCS,  Mathematics 2006  – 2011 Computer Science \nMathematics \nPsychology \nJapanese Language ", "Summary Sales Engineer with a background in software development and business analysis. Summary Sales Engineer with a background in software development and business analysis. Sales Engineer with a background in software development and business analysis. Sales Engineer with a background in software development and business analysis. Experience Manager, Sales Technical Operations Google May 2013  – Present (2 years 4 months) London, United Kingdom Customer Solutions Engineer Google October 2011  –  May 2013  (1 year 8 months) London, United Kingdom Customer Solutions Engineer Google July 2010  –  October 2011  (1 year 4 months) Sydney, Australia Sales Engineer Autonomy October 2007  –  July 2010  (2 years 10 months) Product Manager Clickview August 2005  –  October 2007  (2 years 3 months) Lead Software Developer/Analyst ClickView October 2002  –  August 2005  (2 years 11 months) Manager, Sales Technical Operations Google May 2013  – Present (2 years 4 months) London, United Kingdom Manager, Sales Technical Operations Google May 2013  – Present (2 years 4 months) London, United Kingdom Customer Solutions Engineer Google October 2011  –  May 2013  (1 year 8 months) London, United Kingdom Customer Solutions Engineer Google October 2011  –  May 2013  (1 year 8 months) London, United Kingdom Customer Solutions Engineer Google July 2010  –  October 2011  (1 year 4 months) Sydney, Australia Customer Solutions Engineer Google July 2010  –  October 2011  (1 year 4 months) Sydney, Australia Sales Engineer Autonomy October 2007  –  July 2010  (2 years 10 months) Sales Engineer Autonomy October 2007  –  July 2010  (2 years 10 months) Product Manager Clickview August 2005  –  October 2007  (2 years 3 months) Product Manager Clickview August 2005  –  October 2007  (2 years 3 months) Lead Software Developer/Analyst ClickView October 2002  –  August 2005  (2 years 11 months) Lead Software Developer/Analyst ClickView October 2002  –  August 2005  (2 years 11 months) Skills SOA jQuery XML MySQL C# Google Adwords Google Analytics Java JavaScript C C++ Sales Support Sales Engineering YouTube Online Sales Online Marketing Online Advertising Entrepreneur PHP Autonomy Document Management Records Management Google Website Optimizer SEO SEM Technical Writing Team Management See 12+     See less Skills  SOA jQuery XML MySQL C# Google Adwords Google Analytics Java JavaScript C C++ Sales Support Sales Engineering YouTube Online Sales Online Marketing Online Advertising Entrepreneur PHP Autonomy Document Management Records Management Google Website Optimizer SEO SEM Technical Writing Team Management See 12+     See less SOA jQuery XML MySQL C# Google Adwords Google Analytics Java JavaScript C C++ Sales Support Sales Engineering YouTube Online Sales Online Marketing Online Advertising Entrepreneur PHP Autonomy Document Management Records Management Google Website Optimizer SEO SEM Technical Writing Team Management See 12+     See less SOA jQuery XML MySQL C# Google Adwords Google Analytics Java JavaScript C C++ Sales Support Sales Engineering YouTube Online Sales Online Marketing Online Advertising Entrepreneur PHP Autonomy Document Management Records Management Google Website Optimizer SEO SEM Technical Writing Team Management See 12+     See less Education University of Technology, Sydney Bachelor of Science in IT 2002  – 2005 University of Technology, Sydney Bachelor of Science in IT 2002  – 2005 University of Technology, Sydney Bachelor of Science in IT 2002  – 2005 University of Technology, Sydney Bachelor of Science in IT 2002  – 2005 ", "Summary I am an internet software designer, engineer and team leader, working with internet software technologies since my start in 1993. Passionate about software craftsmanship and the marriage of people and technology, I've explored this in a range of roles from technical programme and project management, hands-on engineer, user experience, business consulting, and director. In the 5+ years I've been at Google, I've got to work with internet software at a global level with an enormous range of people, technologies and products, and lead the design and delivery of products to help Google's advertising sales force become more productive using agile/lean methods.  \n \nAt EMC Conchango I specialised in strategy around, and delivery of Web 2.0 applications and social computing, with particular focus on UK Retail Financial Services. PRINCE2 Practitioner, Certified Scrum Master. Created Conchango's Web 2.0 community of excellence and led the charge on a number of major UK and European brands to shape their online strategy. Passionate advocate of Scrum and Agile methods, along with user-centred design principles and practices (I read alertbox and asktog regularly). \n \nEarlier, as technical programme manager, I successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production and helped shape and evolve it over 4 phases. Won 11 industry awards for innovation and usability and I loved the 'incubator' environment that was created to rapidly iterate. \n \nComputer science / software engineering / user experience / information architecture. Moved to technical management / leadership back in 2001 lead teams of 20-30 across continents. I have deep experience with the ATG ebusiness framework and contracted with them in Spain on Spain's biggest ecommerce project to-date (with Telefonica). I love music and write regularly. Do a search for 'shadow harp' to see an invention of mine in collaboration with Zackary Booth Simpson when living in Barcelona. Specialties:Internet software design, ebusiness, open standards, Agile coach, Agile software delivery, Agile project management, Certified Scrum Master, Java / App Engine / Chrome / HTML5, user experience design, Web 2.0, Social Computing and how it impacts your business. Ruby on Rails. Summary I am an internet software designer, engineer and team leader, working with internet software technologies since my start in 1993. Passionate about software craftsmanship and the marriage of people and technology, I've explored this in a range of roles from technical programme and project management, hands-on engineer, user experience, business consulting, and director. In the 5+ years I've been at Google, I've got to work with internet software at a global level with an enormous range of people, technologies and products, and lead the design and delivery of products to help Google's advertising sales force become more productive using agile/lean methods.  \n \nAt EMC Conchango I specialised in strategy around, and delivery of Web 2.0 applications and social computing, with particular focus on UK Retail Financial Services. PRINCE2 Practitioner, Certified Scrum Master. Created Conchango's Web 2.0 community of excellence and led the charge on a number of major UK and European brands to shape their online strategy. Passionate advocate of Scrum and Agile methods, along with user-centred design principles and practices (I read alertbox and asktog regularly). \n \nEarlier, as technical programme manager, I successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production and helped shape and evolve it over 4 phases. Won 11 industry awards for innovation and usability and I loved the 'incubator' environment that was created to rapidly iterate. \n \nComputer science / software engineering / user experience / information architecture. Moved to technical management / leadership back in 2001 lead teams of 20-30 across continents. I have deep experience with the ATG ebusiness framework and contracted with them in Spain on Spain's biggest ecommerce project to-date (with Telefonica). I love music and write regularly. Do a search for 'shadow harp' to see an invention of mine in collaboration with Zackary Booth Simpson when living in Barcelona. Specialties:Internet software design, ebusiness, open standards, Agile coach, Agile software delivery, Agile project management, Certified Scrum Master, Java / App Engine / Chrome / HTML5, user experience design, Web 2.0, Social Computing and how it impacts your business. Ruby on Rails. I am an internet software designer, engineer and team leader, working with internet software technologies since my start in 1993. Passionate about software craftsmanship and the marriage of people and technology, I've explored this in a range of roles from technical programme and project management, hands-on engineer, user experience, business consulting, and director. In the 5+ years I've been at Google, I've got to work with internet software at a global level with an enormous range of people, technologies and products, and lead the design and delivery of products to help Google's advertising sales force become more productive using agile/lean methods.  \n \nAt EMC Conchango I specialised in strategy around, and delivery of Web 2.0 applications and social computing, with particular focus on UK Retail Financial Services. PRINCE2 Practitioner, Certified Scrum Master. Created Conchango's Web 2.0 community of excellence and led the charge on a number of major UK and European brands to shape their online strategy. Passionate advocate of Scrum and Agile methods, along with user-centred design principles and practices (I read alertbox and asktog regularly). \n \nEarlier, as technical programme manager, I successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production and helped shape and evolve it over 4 phases. Won 11 industry awards for innovation and usability and I loved the 'incubator' environment that was created to rapidly iterate. \n \nComputer science / software engineering / user experience / information architecture. Moved to technical management / leadership back in 2001 lead teams of 20-30 across continents. I have deep experience with the ATG ebusiness framework and contracted with them in Spain on Spain's biggest ecommerce project to-date (with Telefonica). I love music and write regularly. Do a search for 'shadow harp' to see an invention of mine in collaboration with Zackary Booth Simpson when living in Barcelona. Specialties:Internet software design, ebusiness, open standards, Agile coach, Agile software delivery, Agile project management, Certified Scrum Master, Java / App Engine / Chrome / HTML5, user experience design, Web 2.0, Social Computing and how it impacts your business. Ruby on Rails. I am an internet software designer, engineer and team leader, working with internet software technologies since my start in 1993. Passionate about software craftsmanship and the marriage of people and technology, I've explored this in a range of roles from technical programme and project management, hands-on engineer, user experience, business consulting, and director. In the 5+ years I've been at Google, I've got to work with internet software at a global level with an enormous range of people, technologies and products, and lead the design and delivery of products to help Google's advertising sales force become more productive using agile/lean methods.  \n \nAt EMC Conchango I specialised in strategy around, and delivery of Web 2.0 applications and social computing, with particular focus on UK Retail Financial Services. PRINCE2 Practitioner, Certified Scrum Master. Created Conchango's Web 2.0 community of excellence and led the charge on a number of major UK and European brands to shape their online strategy. Passionate advocate of Scrum and Agile methods, along with user-centred design principles and practices (I read alertbox and asktog regularly). \n \nEarlier, as technical programme manager, I successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production and helped shape and evolve it over 4 phases. Won 11 industry awards for innovation and usability and I loved the 'incubator' environment that was created to rapidly iterate. \n \nComputer science / software engineering / user experience / information architecture. Moved to technical management / leadership back in 2001 lead teams of 20-30 across continents. I have deep experience with the ATG ebusiness framework and contracted with them in Spain on Spain's biggest ecommerce project to-date (with Telefonica). I love music and write regularly. Do a search for 'shadow harp' to see an invention of mine in collaboration with Zackary Booth Simpson when living in Barcelona. Specialties:Internet software design, ebusiness, open standards, Agile coach, Agile software delivery, Agile project management, Certified Scrum Master, Java / App Engine / Chrome / HTML5, user experience design, Web 2.0, Social Computing and how it impacts your business. Ruby on Rails. Experience Product Manager Google January 2012  – Present (3 years 8 months) London, United Kingdom My new role title reflects a slight change in focus from when I was a Technical Programme Manager: although before I was responsible for the products I have, this new role more firmly moves into the Product Management sphere, moving away from day to day technical delivery and having more time for more strategic product lifecycle concerns: adoption, ROI, user feedback, but keeping user experience, stakeholder management, release management, PRD and feature prioritisation I did before. Technical Programme Manager Google April 2011  –  December 2011  (9 months) I manage a portfolio of internal products for Google's huge global sales force. Heading the global project office I'm leading the adoption and proficiency of agile / lean practices across the dozen workstreams that are in place at any given time. Customer Solutions Engineer and Agile Coach Google January 2010  –  April 2011  (1 year 4 months) I design and build software that generates revenue for Google. I also help educate other groups internally and externally on similar objectives. Technologies and products used will cover pretty much all Google technologies.  \n \nI continue to hold a parallel role in the global Agile practices team supporting and training other teams in agile methods. \n \nQualifications: Google Certified Professional for AdWords, Analytics, and Website Optimizer Technical Account Manager (TAM) and Agile Coach Google January 2008  –  January 2010  (2 years 1 month) Responsible for working with Google partners in the EMEA region to ensure technical delivery and overall relationship well-being of partner-related initiatives, either in-bound (services and customisations needed by Google, from partner) or out-bound (services and customisations needed by partner, from Google). Also active inside Google's agile practices special interest group holding training courses. Senior Agile Proj Mgr / Web 2.0 Solution Architect Conchango August 2006  –  December 2007  (1 year 5 months) Scrum Master aka Senior Agile Project Manager specialising in social computing (google for ''social computing guy') and web 2.0 with extensive experience with UK Financial Services Protection Products. Technical Project Manager Practiv Applied Software Ltd January 2003  –  July 2006  (3 years 7 months) Successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production in early 2003 and helped shape and evolve it over the subsequent 2 years. It has since won 11 awards. \n \nThen moved to a similar 'me too' project at BUPA but focused more on a mixture of technical, business project management with some ebusiness consulting as well. Technical Project Manager ATG March 2002  –  November 2002  (9 months) ATG and Sun worked with Telefonica to build their PDSL platform in 2002. It was a pretty wizzy system which offered things like video game rental, videoconferencing, etc. The ATG team were sharp and I was able to contribute to the code base at one point to work with order processing and suchlike; but by and large my job was to help keep the project focused and on-track. It was chaotic; Telefonica aren't much fun to work with. Alan, Pat and Xavi rock and I wouldn't hesitate in working with any of them in future (hopefully they'll link up at some point) 'Local CTO' IconMediaLab 2001  –  2001  (less than a year) Swedish stock-exchange-listed IconMediaLab was almost 'pure product' of the Dot Com Boom. Flush with cash these guys rapidly grew to have 1800 people in 32 plush offices worldwide (their SF offices cost $US60k/month, $1m to set up and they committed to a 10 year lease). But there wasn't a lot of substance to their strategy and when times got rough, it imploded.  \n \nSo my stint in their Barcelona office was interesting. I certainly learnt a lot about how not to manage an office by the MD there, and some insight into what the CTO role involves. I wasn't really ready for that role to be honest; but it was the first step in my move away from 'pure tech' to a leadership track. I had a team of 16 people -- some of whom didn't speak English, and I focused on team career development, selling & educating technology to clients, and process improvement. I had a desk on the 28th floor of a building in Barcelona where I could see the beach below. It was nice. I had fun; it was never going to last. Senior Java / ATG Developer eDreams November 1999  –  September 2000  (11 months) Java software developer where I learnt ATG Dynamo. Occasional project manager and team leader, working initially in San Francisco then later Barcelona of what could only be called a mad place to work at the time. Mad but immensely fun. Technical Consultant ie3 1997  –  1998  (1 year) Pioneered early web-based Java apps Cofounding Director MPS 1996  –  1998  (2 years) Musick Point Software was our foray into the World of Business after our stint at the University of Auckland. We worked with Java and sold user experience services (e.g. breakfast presentation to New Zealand Computer Society: 'usability, the next competitive advantage') -- both somewhat ahead of our time, particularly in New Zealand. Research programmer University of Auckland 1993  –  1997  (4 years) This was a Mac / Unix environment. My career highlights from this age was to write a portable communications library, 'platform independent packets' which was source-compatible with Mac front end clients (8Mhz Mac SEs mostly!) and our Digital Unix back ends. Through some 4-byte char hacks I managed to get code that would send binary-compatible data even though the front end was big endian and the back end was little-endian. [Learn more on endianness: http://en.wikipedia.org/wiki/Endianness] \n \nI rewrote the Computer Science Department's resource management suite: machine bookings, printing, and internet data usage, the latter is when students had to pay for internet traffic. The latter, 'Net Guardian', was then rolled out across the University of Auckland, renamed 'Net Account'. \n \nMac GUIs were very sophisticated for the time, based on a GUI library I cowrote with a friend of mine, Richard Knuckey. We called it The Screen Manager and it should've rocked the world, but we got hung up on commercial issues. Product Manager Google January 2012  – Present (3 years 8 months) London, United Kingdom My new role title reflects a slight change in focus from when I was a Technical Programme Manager: although before I was responsible for the products I have, this new role more firmly moves into the Product Management sphere, moving away from day to day technical delivery and having more time for more strategic product lifecycle concerns: adoption, ROI, user feedback, but keeping user experience, stakeholder management, release management, PRD and feature prioritisation I did before. Product Manager Google January 2012  – Present (3 years 8 months) London, United Kingdom My new role title reflects a slight change in focus from when I was a Technical Programme Manager: although before I was responsible for the products I have, this new role more firmly moves into the Product Management sphere, moving away from day to day technical delivery and having more time for more strategic product lifecycle concerns: adoption, ROI, user feedback, but keeping user experience, stakeholder management, release management, PRD and feature prioritisation I did before. Technical Programme Manager Google April 2011  –  December 2011  (9 months) I manage a portfolio of internal products for Google's huge global sales force. Heading the global project office I'm leading the adoption and proficiency of agile / lean practices across the dozen workstreams that are in place at any given time. Technical Programme Manager Google April 2011  –  December 2011  (9 months) I manage a portfolio of internal products for Google's huge global sales force. Heading the global project office I'm leading the adoption and proficiency of agile / lean practices across the dozen workstreams that are in place at any given time. Customer Solutions Engineer and Agile Coach Google January 2010  –  April 2011  (1 year 4 months) I design and build software that generates revenue for Google. I also help educate other groups internally and externally on similar objectives. Technologies and products used will cover pretty much all Google technologies.  \n \nI continue to hold a parallel role in the global Agile practices team supporting and training other teams in agile methods. \n \nQualifications: Google Certified Professional for AdWords, Analytics, and Website Optimizer Customer Solutions Engineer and Agile Coach Google January 2010  –  April 2011  (1 year 4 months) I design and build software that generates revenue for Google. I also help educate other groups internally and externally on similar objectives. Technologies and products used will cover pretty much all Google technologies.  \n \nI continue to hold a parallel role in the global Agile practices team supporting and training other teams in agile methods. \n \nQualifications: Google Certified Professional for AdWords, Analytics, and Website Optimizer Technical Account Manager (TAM) and Agile Coach Google January 2008  –  January 2010  (2 years 1 month) Responsible for working with Google partners in the EMEA region to ensure technical delivery and overall relationship well-being of partner-related initiatives, either in-bound (services and customisations needed by Google, from partner) or out-bound (services and customisations needed by partner, from Google). Also active inside Google's agile practices special interest group holding training courses. Technical Account Manager (TAM) and Agile Coach Google January 2008  –  January 2010  (2 years 1 month) Responsible for working with Google partners in the EMEA region to ensure technical delivery and overall relationship well-being of partner-related initiatives, either in-bound (services and customisations needed by Google, from partner) or out-bound (services and customisations needed by partner, from Google). Also active inside Google's agile practices special interest group holding training courses. Senior Agile Proj Mgr / Web 2.0 Solution Architect Conchango August 2006  –  December 2007  (1 year 5 months) Scrum Master aka Senior Agile Project Manager specialising in social computing (google for ''social computing guy') and web 2.0 with extensive experience with UK Financial Services Protection Products. Senior Agile Proj Mgr / Web 2.0 Solution Architect Conchango August 2006  –  December 2007  (1 year 5 months) Scrum Master aka Senior Agile Project Manager specialising in social computing (google for ''social computing guy') and web 2.0 with extensive experience with UK Financial Services Protection Products. Technical Project Manager Practiv Applied Software Ltd January 2003  –  July 2006  (3 years 7 months) Successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production in early 2003 and helped shape and evolve it over the subsequent 2 years. It has since won 11 awards. \n \nThen moved to a similar 'me too' project at BUPA but focused more on a mixture of technical, business project management with some ebusiness consulting as well. Technical Project Manager Practiv Applied Software Ltd January 2003  –  July 2006  (3 years 7 months) Successfully delivered UK's leading online protection solution (Friends Provident eSelect) to production in early 2003 and helped shape and evolve it over the subsequent 2 years. It has since won 11 awards. \n \nThen moved to a similar 'me too' project at BUPA but focused more on a mixture of technical, business project management with some ebusiness consulting as well. Technical Project Manager ATG March 2002  –  November 2002  (9 months) ATG and Sun worked with Telefonica to build their PDSL platform in 2002. It was a pretty wizzy system which offered things like video game rental, videoconferencing, etc. The ATG team were sharp and I was able to contribute to the code base at one point to work with order processing and suchlike; but by and large my job was to help keep the project focused and on-track. It was chaotic; Telefonica aren't much fun to work with. Alan, Pat and Xavi rock and I wouldn't hesitate in working with any of them in future (hopefully they'll link up at some point) Technical Project Manager ATG March 2002  –  November 2002  (9 months) ATG and Sun worked with Telefonica to build their PDSL platform in 2002. It was a pretty wizzy system which offered things like video game rental, videoconferencing, etc. The ATG team were sharp and I was able to contribute to the code base at one point to work with order processing and suchlike; but by and large my job was to help keep the project focused and on-track. It was chaotic; Telefonica aren't much fun to work with. Alan, Pat and Xavi rock and I wouldn't hesitate in working with any of them in future (hopefully they'll link up at some point) 'Local CTO' IconMediaLab 2001  –  2001  (less than a year) Swedish stock-exchange-listed IconMediaLab was almost 'pure product' of the Dot Com Boom. Flush with cash these guys rapidly grew to have 1800 people in 32 plush offices worldwide (their SF offices cost $US60k/month, $1m to set up and they committed to a 10 year lease). But there wasn't a lot of substance to their strategy and when times got rough, it imploded.  \n \nSo my stint in their Barcelona office was interesting. I certainly learnt a lot about how not to manage an office by the MD there, and some insight into what the CTO role involves. I wasn't really ready for that role to be honest; but it was the first step in my move away from 'pure tech' to a leadership track. I had a team of 16 people -- some of whom didn't speak English, and I focused on team career development, selling & educating technology to clients, and process improvement. I had a desk on the 28th floor of a building in Barcelona where I could see the beach below. It was nice. I had fun; it was never going to last. 'Local CTO' IconMediaLab 2001  –  2001  (less than a year) Swedish stock-exchange-listed IconMediaLab was almost 'pure product' of the Dot Com Boom. Flush with cash these guys rapidly grew to have 1800 people in 32 plush offices worldwide (their SF offices cost $US60k/month, $1m to set up and they committed to a 10 year lease). But there wasn't a lot of substance to their strategy and when times got rough, it imploded.  \n \nSo my stint in their Barcelona office was interesting. I certainly learnt a lot about how not to manage an office by the MD there, and some insight into what the CTO role involves. I wasn't really ready for that role to be honest; but it was the first step in my move away from 'pure tech' to a leadership track. I had a team of 16 people -- some of whom didn't speak English, and I focused on team career development, selling & educating technology to clients, and process improvement. I had a desk on the 28th floor of a building in Barcelona where I could see the beach below. It was nice. I had fun; it was never going to last. Senior Java / ATG Developer eDreams November 1999  –  September 2000  (11 months) Java software developer where I learnt ATG Dynamo. Occasional project manager and team leader, working initially in San Francisco then later Barcelona of what could only be called a mad place to work at the time. Mad but immensely fun. Senior Java / ATG Developer eDreams November 1999  –  September 2000  (11 months) Java software developer where I learnt ATG Dynamo. Occasional project manager and team leader, working initially in San Francisco then later Barcelona of what could only be called a mad place to work at the time. Mad but immensely fun. Technical Consultant ie3 1997  –  1998  (1 year) Pioneered early web-based Java apps Technical Consultant ie3 1997  –  1998  (1 year) Pioneered early web-based Java apps Cofounding Director MPS 1996  –  1998  (2 years) Musick Point Software was our foray into the World of Business after our stint at the University of Auckland. We worked with Java and sold user experience services (e.g. breakfast presentation to New Zealand Computer Society: 'usability, the next competitive advantage') -- both somewhat ahead of our time, particularly in New Zealand. Cofounding Director MPS 1996  –  1998  (2 years) Musick Point Software was our foray into the World of Business after our stint at the University of Auckland. We worked with Java and sold user experience services (e.g. breakfast presentation to New Zealand Computer Society: 'usability, the next competitive advantage') -- both somewhat ahead of our time, particularly in New Zealand. Research programmer University of Auckland 1993  –  1997  (4 years) This was a Mac / Unix environment. My career highlights from this age was to write a portable communications library, 'platform independent packets' which was source-compatible with Mac front end clients (8Mhz Mac SEs mostly!) and our Digital Unix back ends. Through some 4-byte char hacks I managed to get code that would send binary-compatible data even though the front end was big endian and the back end was little-endian. [Learn more on endianness: http://en.wikipedia.org/wiki/Endianness] \n \nI rewrote the Computer Science Department's resource management suite: machine bookings, printing, and internet data usage, the latter is when students had to pay for internet traffic. The latter, 'Net Guardian', was then rolled out across the University of Auckland, renamed 'Net Account'. \n \nMac GUIs were very sophisticated for the time, based on a GUI library I cowrote with a friend of mine, Richard Knuckey. We called it The Screen Manager and it should've rocked the world, but we got hung up on commercial issues. Research programmer University of Auckland 1993  –  1997  (4 years) This was a Mac / Unix environment. My career highlights from this age was to write a portable communications library, 'platform independent packets' which was source-compatible with Mac front end clients (8Mhz Mac SEs mostly!) and our Digital Unix back ends. Through some 4-byte char hacks I managed to get code that would send binary-compatible data even though the front end was big endian and the back end was little-endian. [Learn more on endianness: http://en.wikipedia.org/wiki/Endianness] \n \nI rewrote the Computer Science Department's resource management suite: machine bookings, printing, and internet data usage, the latter is when students had to pay for internet traffic. The latter, 'Net Guardian', was then rolled out across the University of Auckland, renamed 'Net Account'. \n \nMac GUIs were very sophisticated for the time, based on a GUI library I cowrote with a friend of mine, Richard Knuckey. We called it The Screen Manager and it should've rocked the world, but we got hung up on commercial issues. Languages Spanish Spanish Spanish Skills Scrum Agile Project Management User Experience HTML5 Java Web 2.0 Chrome GWT Agile Ruby on Rails Social Computing JavaScript Ruby PHP Certified Scrum Master... C++ User Interface Design C Git Interaction Design HTML Information Architecture SQL Software Project... Software Development Design Patterns Linux Android User Experience Design Agile Methodologies HTML 5 E-commerce Google App Engine Usability TDD Web Applications MySQL Continuous Integration Object Oriented Design Software Engineering Web Development Software Design UML User Interface OOP Software Product... Social Media Lean Software... Google Analytics Geeky stuff See 35+     See less Skills  Scrum Agile Project Management User Experience HTML5 Java Web 2.0 Chrome GWT Agile Ruby on Rails Social Computing JavaScript Ruby PHP Certified Scrum Master... C++ User Interface Design C Git Interaction Design HTML Information Architecture SQL Software Project... Software Development Design Patterns Linux Android User Experience Design Agile Methodologies HTML 5 E-commerce Google App Engine Usability TDD Web Applications MySQL Continuous Integration Object Oriented Design Software Engineering Web Development Software Design UML User Interface OOP Software Product... Social Media Lean Software... Google Analytics Geeky stuff See 35+     See less Scrum Agile Project Management User Experience HTML5 Java Web 2.0 Chrome GWT Agile Ruby on Rails Social Computing JavaScript Ruby PHP Certified Scrum Master... C++ User Interface Design C Git Interaction Design HTML Information Architecture SQL Software Project... Software Development Design Patterns Linux Android User Experience Design Agile Methodologies HTML 5 E-commerce Google App Engine Usability TDD Web Applications MySQL Continuous Integration Object Oriented Design Software Engineering Web Development Software Design UML User Interface OOP Software Product... Social Media Lean Software... Google Analytics Geeky stuff See 35+     See less Scrum Agile Project Management User Experience HTML5 Java Web 2.0 Chrome GWT Agile Ruby on Rails Social Computing JavaScript Ruby PHP Certified Scrum Master... C++ User Interface Design C Git Interaction Design HTML Information Architecture SQL Software Project... Software Development Design Patterns Linux Android User Experience Design Agile Methodologies HTML 5 E-commerce Google App Engine Usability TDD Web Applications MySQL Continuous Integration Object Oriented Design Software Engineering Web Development Software Design UML User Interface OOP Software Product... Social Media Lean Software... Google Analytics Geeky stuff See 35+     See less Education University of Auckland Bachelor of Science,  Computer Science 1994  – 1995 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study.  \n \nThe internet had been around for many years in 1994 but obviously the web was nascent. I got early inroads into the web development; really at its forefront back then when 'there was this thing called NSCA Mosaic' and 'the world was still trying to decide whether to choose WWW, Gopher (a hierarchical information metaphor), or WAIS (Wide-Area Information Service'). The chief reservations the academics had about WWW was that it wasn't searchable. Natch. Activities and Societies:  Artificial Intelligence University of Auckland Bachelor of Science,  Computer Science , A+ 1993  – 1994 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study. Activities and Societies:  Postgrad: Object Oriented Analysis and Design. 100% for my analysis of the Metrowerks Powerplant C++ framework ,  which I went on to use professionally.\nAlso studied postgrad course Hypertext and Multimedia Systems University of Auckland BSc,  Computer Science 1990  – 1992 University of Auckland Bachelor of Science,  Computer Science 1994  – 1995 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study.  \n \nThe internet had been around for many years in 1994 but obviously the web was nascent. I got early inroads into the web development; really at its forefront back then when 'there was this thing called NSCA Mosaic' and 'the world was still trying to decide whether to choose WWW, Gopher (a hierarchical information metaphor), or WAIS (Wide-Area Information Service'). The chief reservations the academics had about WWW was that it wasn't searchable. Natch. Activities and Societies:  Artificial Intelligence University of Auckland Bachelor of Science,  Computer Science 1994  – 1995 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study.  \n \nThe internet had been around for many years in 1994 but obviously the web was nascent. I got early inroads into the web development; really at its forefront back then when 'there was this thing called NSCA Mosaic' and 'the world was still trying to decide whether to choose WWW, Gopher (a hierarchical information metaphor), or WAIS (Wide-Area Information Service'). The chief reservations the academics had about WWW was that it wasn't searchable. Natch. Activities and Societies:  Artificial Intelligence University of Auckland Bachelor of Science,  Computer Science 1994  – 1995 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study.  \n \nThe internet had been around for many years in 1994 but obviously the web was nascent. I got early inroads into the web development; really at its forefront back then when 'there was this thing called NSCA Mosaic' and 'the world was still trying to decide whether to choose WWW, Gopher (a hierarchical information metaphor), or WAIS (Wide-Area Information Service'). The chief reservations the academics had about WWW was that it wasn't searchable. Natch. Activities and Societies:  Artificial Intelligence University of Auckland Bachelor of Science,  Computer Science , A+ 1993  – 1994 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study. Activities and Societies:  Postgrad: Object Oriented Analysis and Design. 100% for my analysis of the Metrowerks Powerplant C++ framework ,  which I went on to use professionally.\nAlso studied postgrad course Hypertext and Multimedia Systems University of Auckland Bachelor of Science,  Computer Science , A+ 1993  – 1994 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study. Activities and Societies:  Postgrad: Object Oriented Analysis and Design. 100% for my analysis of the Metrowerks Powerplant C++ framework ,  which I went on to use professionally.\nAlso studied postgrad course Hypertext and Multimedia Systems University of Auckland Bachelor of Science,  Computer Science , A+ 1993  – 1994 As a research assistant at the Computer Science Department in Auckland University, I was able to continue study. Activities and Societies:  Postgrad: Object Oriented Analysis and Design. 100% for my analysis of the Metrowerks Powerplant C++ framework ,  which I went on to use professionally.\nAlso studied postgrad course Hypertext and Multimedia Systems University of Auckland BSc,  Computer Science 1990  – 1992 University of Auckland BSc,  Computer Science 1990  – 1992 University of Auckland BSc,  Computer Science 1990  – 1992 Honors & Awards Additional Honors & Awards Google EMEA Star Award 2009 Additional Honors & Awards Google EMEA Star Award 2009 Additional Honors & Awards Google EMEA Star Award 2009 Additional Honors & Awards Google EMEA Star Award 2009 ", "Summary * Experienced digital marketing professional with focus on digital analytics \n* Google's spokesperson and evangelizer at online marketing events. \n* Author: Digital Metrics Playbook - Measuring Your Online Branding Strategies \nhttp://digitalmetricsplaybook.com/ Summary * Experienced digital marketing professional with focus on digital analytics \n* Google's spokesperson and evangelizer at online marketing events. \n* Author: Digital Metrics Playbook - Measuring Your Online Branding Strategies \nhttp://digitalmetricsplaybook.com/ * Experienced digital marketing professional with focus on digital analytics \n* Google's spokesperson and evangelizer at online marketing events. \n* Author: Digital Metrics Playbook - Measuring Your Online Branding Strategies \nhttp://digitalmetricsplaybook.com/ * Experienced digital marketing professional with focus on digital analytics \n* Google's spokesperson and evangelizer at online marketing events. \n* Author: Digital Metrics Playbook - Measuring Your Online Branding Strategies \nhttp://digitalmetricsplaybook.com/ Experience Manager, Dedicated Ads Solutions, Latam Google October 2014  – Present (11 months) São Paulo Area, Brazil Leads a team of Solutions Consultants in Latin America to support regional Ads business across the whole Ads product offering including AdWords, YouTube, DoubleClick and Google Analytics. \n \nWorks across the entire sales lifecycle: pre-sales, product implementations, trainings, post-sales support and consultative engagements. Manager, Advertiser Platforms Solutions, LatAm Google May 2013  –  September 2014  (1 year 5 months) São Paulo Area, Brazil Leads a team of Solutions Consultants in Latin America and US to support regional Ads business. \n \nWorks across the entire sales lifecycle: pre-sales, product implementations, trainings, post-sales support and consultative engagements. We are responsible for: \n \n* Google Analytics Premium \n* DoubleClick for Advertisers \n* DoubleClick Search \n* DoubleClick Bid Manager \n* DoubleClick Ad Exchange Digital Analytics Teacher (Digital Marketing post grad programs) November 2010  –  December 2013  (3 years 2 months) Providing Digital Analytics classes for Online Marketing post grad programs at: \n* Universidad Anáhuac, Mexico \n* Universidad de Palermo, Argentina \n* Universidad de Salamanca, Spain \n* Universidad de Piura, Peru Google Analytics Specialist for Latin America Google May 2010  –  April 2013  (3 years) Mexico City Area, Mexico * Google Analytics representative in Latin America. In charge of evangelization and promotion of all Google’s measurement tools. Providing business focused trainings for agencies and advertisers. Working as Web Analytics consultant for strategic clients. \n* Spokesperson for Google at online marketing events. Participated as speaker in 50+ public events in 5 countries in the region. \n* Editor of “Central de Conversiones”, the official Blog in Spanish for Google’s measurement tools. Published 300+ posts and generated a reader base of 3,000+ people in all Spanish speaking countries, including Spain. \n* Head of the Google Analytics Certified Partners program in Latam. Grown the partner network from 4 partners in 1 country to 11 partners in 5 countries. \n* Columnist at CNN Expansión and regular contributor to other online information sources. Published 30+ original articles and interviews in online and printed media in 4 countries. \n* Board Advisor at MMetrO, monthly digital marketing event that strives to spread knowledge and expertise of Spanish speaking digital analytics though leaders. Helped produce 15 events with 30 different speakers / thought leaders of the online marketing industry from Spanish Speaking countries. \n* Country Manager, Mexico, Digital Analytics Association. Customer Solutions Engineer Google July 2007  –  April 2010  (2 years 10 months) Mexico City Area, Mexico Provide consulting, solution design, training, coaching and troubleshooting services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Founder, CEO, Stuntman, Cage Cleaner and Dog Walker Extremo Vertical November 2006  –  February 2010  (3 years 4 months) I just go to the mountain and then write and post pics and videos and stuff to my personal blog Digital Media Manager El Financiero July 1999  –  July 2007  (8 years 1 month) Mexico City Area, Mexico * Founded the Digital Media business unit, with over 100% sales growth year over year. Last year's growth was 400%. \n* Grew operation margin to 200% on the last year. \n* Integrated cost effective solution for the corporate website showing the lowest operation cost across the media market. \n* Served over 100 paid campaigns the last year. \n* Developed a wide variety of services like the website in spanish and chinese, mobile channels, real-time quotes terminal, daily newsletters, SMS news feed and a digital newspaper edition delivered via Internet. \n* Coordinated customer support procedures for all digital services. \n* Implemented Solomon as our main management tool. Project Manager Intersoftware August 1997  –  June 1999  (1 year 11 months) Mexico City Area, Mexico * Managed software development projects since early analysis stages until deployment. \n* Developed a nation wide customer database for Grupo Industrial Bimbo with GPS capabilities. \n* Developed Intranet solutions for other well known companies like Coca Cola FEMSA, Seguros Monterrey-Aetna, Warner Lambert, Grupo Nacional Provincial and Herbalife. \n* Defined enterprise wide coding and documentation policies. Software Development Engineer Grupo Siglo May 1997  –  August 1997  (4 months) Mexico City Area, Mexico * Developed part of the Project Management System on the Corporate Intranet. \n* Researched new technologies for Internet development. \n* Participated in the Election's Day Documentation Project gathering information and building statistical reports. \n* Delivered a presentation about new tools for dynamic web pages development during the Information Technology Congress at ITESM, Mexico City Consultant Grupo Cima May 1996  –  May 1997  (1 year 1 month) Mexico City Area, Mexico * Developed and deployed the first management system for Panama’s Stock Exchange. \n* Developed management solutions for Sony, Hilos Omega and Global Autoparts. IT Engineer ITESM Campus Ciudad de México December 1995  –  December 1996  (1 year 1 month) Mexico City Area, Mexico * Tech support for Unix workstations. Managed HP-UX, AIX and Solaris operating systems. \n* Managed user's network login accounts all over the Campus. \n* Developed Student Affairs web site, with information about sports and cultural activities. \n* Created schedule management system for classes given by this department. \n* Created promotional material for cultural activities such as classes, concerts and plays. \n* Participated as technical staff for special events, responsible for audio and stage setup. Manager, Dedicated Ads Solutions, Latam Google October 2014  – Present (11 months) São Paulo Area, Brazil Leads a team of Solutions Consultants in Latin America to support regional Ads business across the whole Ads product offering including AdWords, YouTube, DoubleClick and Google Analytics. \n \nWorks across the entire sales lifecycle: pre-sales, product implementations, trainings, post-sales support and consultative engagements. Manager, Dedicated Ads Solutions, Latam Google October 2014  – Present (11 months) São Paulo Area, Brazil Leads a team of Solutions Consultants in Latin America to support regional Ads business across the whole Ads product offering including AdWords, YouTube, DoubleClick and Google Analytics. \n \nWorks across the entire sales lifecycle: pre-sales, product implementations, trainings, post-sales support and consultative engagements. Manager, Advertiser Platforms Solutions, LatAm Google May 2013  –  September 2014  (1 year 5 months) São Paulo Area, Brazil Leads a team of Solutions Consultants in Latin America and US to support regional Ads business. \n \nWorks across the entire sales lifecycle: pre-sales, product implementations, trainings, post-sales support and consultative engagements. We are responsible for: \n \n* Google Analytics Premium \n* DoubleClick for Advertisers \n* DoubleClick Search \n* DoubleClick Bid Manager \n* DoubleClick Ad Exchange Manager, Advertiser Platforms Solutions, LatAm Google May 2013  –  September 2014  (1 year 5 months) São Paulo Area, Brazil Leads a team of Solutions Consultants in Latin America and US to support regional Ads business. \n \nWorks across the entire sales lifecycle: pre-sales, product implementations, trainings, post-sales support and consultative engagements. We are responsible for: \n \n* Google Analytics Premium \n* DoubleClick for Advertisers \n* DoubleClick Search \n* DoubleClick Bid Manager \n* DoubleClick Ad Exchange Digital Analytics Teacher (Digital Marketing post grad programs) November 2010  –  December 2013  (3 years 2 months) Providing Digital Analytics classes for Online Marketing post grad programs at: \n* Universidad Anáhuac, Mexico \n* Universidad de Palermo, Argentina \n* Universidad de Salamanca, Spain \n* Universidad de Piura, Peru Digital Analytics Teacher (Digital Marketing post grad programs) November 2010  –  December 2013  (3 years 2 months) Providing Digital Analytics classes for Online Marketing post grad programs at: \n* Universidad Anáhuac, Mexico \n* Universidad de Palermo, Argentina \n* Universidad de Salamanca, Spain \n* Universidad de Piura, Peru Google Analytics Specialist for Latin America Google May 2010  –  April 2013  (3 years) Mexico City Area, Mexico * Google Analytics representative in Latin America. In charge of evangelization and promotion of all Google’s measurement tools. Providing business focused trainings for agencies and advertisers. Working as Web Analytics consultant for strategic clients. \n* Spokesperson for Google at online marketing events. Participated as speaker in 50+ public events in 5 countries in the region. \n* Editor of “Central de Conversiones”, the official Blog in Spanish for Google’s measurement tools. Published 300+ posts and generated a reader base of 3,000+ people in all Spanish speaking countries, including Spain. \n* Head of the Google Analytics Certified Partners program in Latam. Grown the partner network from 4 partners in 1 country to 11 partners in 5 countries. \n* Columnist at CNN Expansión and regular contributor to other online information sources. Published 30+ original articles and interviews in online and printed media in 4 countries. \n* Board Advisor at MMetrO, monthly digital marketing event that strives to spread knowledge and expertise of Spanish speaking digital analytics though leaders. Helped produce 15 events with 30 different speakers / thought leaders of the online marketing industry from Spanish Speaking countries. \n* Country Manager, Mexico, Digital Analytics Association. Google Analytics Specialist for Latin America Google May 2010  –  April 2013  (3 years) Mexico City Area, Mexico * Google Analytics representative in Latin America. In charge of evangelization and promotion of all Google’s measurement tools. Providing business focused trainings for agencies and advertisers. Working as Web Analytics consultant for strategic clients. \n* Spokesperson for Google at online marketing events. Participated as speaker in 50+ public events in 5 countries in the region. \n* Editor of “Central de Conversiones”, the official Blog in Spanish for Google’s measurement tools. Published 300+ posts and generated a reader base of 3,000+ people in all Spanish speaking countries, including Spain. \n* Head of the Google Analytics Certified Partners program in Latam. Grown the partner network from 4 partners in 1 country to 11 partners in 5 countries. \n* Columnist at CNN Expansión and regular contributor to other online information sources. Published 30+ original articles and interviews in online and printed media in 4 countries. \n* Board Advisor at MMetrO, monthly digital marketing event that strives to spread knowledge and expertise of Spanish speaking digital analytics though leaders. Helped produce 15 events with 30 different speakers / thought leaders of the online marketing industry from Spanish Speaking countries. \n* Country Manager, Mexico, Digital Analytics Association. Customer Solutions Engineer Google July 2007  –  April 2010  (2 years 10 months) Mexico City Area, Mexico Provide consulting, solution design, training, coaching and troubleshooting services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Customer Solutions Engineer Google July 2007  –  April 2010  (2 years 10 months) Mexico City Area, Mexico Provide consulting, solution design, training, coaching and troubleshooting services to customers and selected internal teams. The CSE team participates in revenue-generating, technically challenging projects. Founder, CEO, Stuntman, Cage Cleaner and Dog Walker Extremo Vertical November 2006  –  February 2010  (3 years 4 months) I just go to the mountain and then write and post pics and videos and stuff to my personal blog Founder, CEO, Stuntman, Cage Cleaner and Dog Walker Extremo Vertical November 2006  –  February 2010  (3 years 4 months) I just go to the mountain and then write and post pics and videos and stuff to my personal blog Digital Media Manager El Financiero July 1999  –  July 2007  (8 years 1 month) Mexico City Area, Mexico * Founded the Digital Media business unit, with over 100% sales growth year over year. Last year's growth was 400%. \n* Grew operation margin to 200% on the last year. \n* Integrated cost effective solution for the corporate website showing the lowest operation cost across the media market. \n* Served over 100 paid campaigns the last year. \n* Developed a wide variety of services like the website in spanish and chinese, mobile channels, real-time quotes terminal, daily newsletters, SMS news feed and a digital newspaper edition delivered via Internet. \n* Coordinated customer support procedures for all digital services. \n* Implemented Solomon as our main management tool. Digital Media Manager El Financiero July 1999  –  July 2007  (8 years 1 month) Mexico City Area, Mexico * Founded the Digital Media business unit, with over 100% sales growth year over year. Last year's growth was 400%. \n* Grew operation margin to 200% on the last year. \n* Integrated cost effective solution for the corporate website showing the lowest operation cost across the media market. \n* Served over 100 paid campaigns the last year. \n* Developed a wide variety of services like the website in spanish and chinese, mobile channels, real-time quotes terminal, daily newsletters, SMS news feed and a digital newspaper edition delivered via Internet. \n* Coordinated customer support procedures for all digital services. \n* Implemented Solomon as our main management tool. Project Manager Intersoftware August 1997  –  June 1999  (1 year 11 months) Mexico City Area, Mexico * Managed software development projects since early analysis stages until deployment. \n* Developed a nation wide customer database for Grupo Industrial Bimbo with GPS capabilities. \n* Developed Intranet solutions for other well known companies like Coca Cola FEMSA, Seguros Monterrey-Aetna, Warner Lambert, Grupo Nacional Provincial and Herbalife. \n* Defined enterprise wide coding and documentation policies. Project Manager Intersoftware August 1997  –  June 1999  (1 year 11 months) Mexico City Area, Mexico * Managed software development projects since early analysis stages until deployment. \n* Developed a nation wide customer database for Grupo Industrial Bimbo with GPS capabilities. \n* Developed Intranet solutions for other well known companies like Coca Cola FEMSA, Seguros Monterrey-Aetna, Warner Lambert, Grupo Nacional Provincial and Herbalife. \n* Defined enterprise wide coding and documentation policies. Software Development Engineer Grupo Siglo May 1997  –  August 1997  (4 months) Mexico City Area, Mexico * Developed part of the Project Management System on the Corporate Intranet. \n* Researched new technologies for Internet development. \n* Participated in the Election's Day Documentation Project gathering information and building statistical reports. \n* Delivered a presentation about new tools for dynamic web pages development during the Information Technology Congress at ITESM, Mexico City Software Development Engineer Grupo Siglo May 1997  –  August 1997  (4 months) Mexico City Area, Mexico * Developed part of the Project Management System on the Corporate Intranet. \n* Researched new technologies for Internet development. \n* Participated in the Election's Day Documentation Project gathering information and building statistical reports. \n* Delivered a presentation about new tools for dynamic web pages development during the Information Technology Congress at ITESM, Mexico City Consultant Grupo Cima May 1996  –  May 1997  (1 year 1 month) Mexico City Area, Mexico * Developed and deployed the first management system for Panama’s Stock Exchange. \n* Developed management solutions for Sony, Hilos Omega and Global Autoparts. Consultant Grupo Cima May 1996  –  May 1997  (1 year 1 month) Mexico City Area, Mexico * Developed and deployed the first management system for Panama’s Stock Exchange. \n* Developed management solutions for Sony, Hilos Omega and Global Autoparts. IT Engineer ITESM Campus Ciudad de México December 1995  –  December 1996  (1 year 1 month) Mexico City Area, Mexico * Tech support for Unix workstations. Managed HP-UX, AIX and Solaris operating systems. \n* Managed user's network login accounts all over the Campus. \n* Developed Student Affairs web site, with information about sports and cultural activities. \n* Created schedule management system for classes given by this department. \n* Created promotional material for cultural activities such as classes, concerts and plays. \n* Participated as technical staff for special events, responsible for audio and stage setup. IT Engineer ITESM Campus Ciudad de México December 1995  –  December 1996  (1 year 1 month) Mexico City Area, Mexico * Tech support for Unix workstations. Managed HP-UX, AIX and Solaris operating systems. \n* Managed user's network login accounts all over the Campus. \n* Developed Student Affairs web site, with information about sports and cultural activities. \n* Created schedule management system for classes given by this department. \n* Created promotional material for cultural activities such as classes, concerts and plays. \n* Participated as technical staff for special events, responsible for audio and stage setup. Languages Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Full professional proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Skills Web Analytics Online Marketing Digital Analytics Web Development E-commerce Project Management SEM Digital Marketing Google Analytics Social Media SEO Social Media Marketing Google Adwords Digital Media Email Marketing Advertising Online Advertising Social Media Measurement See 3+     See less Skills  Web Analytics Online Marketing Digital Analytics Web Development E-commerce Project Management SEM Digital Marketing Google Analytics Social Media SEO Social Media Marketing Google Adwords Digital Media Email Marketing Advertising Online Advertising Social Media Measurement See 3+     See less Web Analytics Online Marketing Digital Analytics Web Development E-commerce Project Management SEM Digital Marketing Google Analytics Social Media SEO Social Media Marketing Google Adwords Digital Media Email Marketing Advertising Online Advertising Social Media Measurement See 3+     See less Web Analytics Online Marketing Digital Analytics Web Development E-commerce Project Management SEM Digital Marketing Google Analytics Social Media SEO Social Media Marketing Google Adwords Digital Media Email Marketing Advertising Online Advertising Social Media Measurement See 3+     See less Education Instituto Tecnológico y de Estudios Superiores de Monterrey Management Skills postgrad course,  Administration 2005  – 2006 Instituto Tecnológico y de Estudios Superiores de Monterrey Bachelor,  Computer Science 1992  – 1997 Graduated with Honors Centro Universitario México Mathematics 1989  – 1992 Instituto Tecnológico y de Estudios Superiores de Monterrey Management Skills postgrad course,  Administration 2005  – 2006 Instituto Tecnológico y de Estudios Superiores de Monterrey Management Skills postgrad course,  Administration 2005  – 2006 Instituto Tecnológico y de Estudios Superiores de Monterrey Management Skills postgrad course,  Administration 2005  – 2006 Instituto Tecnológico y de Estudios Superiores de Monterrey Bachelor,  Computer Science 1992  – 1997 Graduated with Honors Instituto Tecnológico y de Estudios Superiores de Monterrey Bachelor,  Computer Science 1992  – 1997 Graduated with Honors Instituto Tecnológico y de Estudios Superiores de Monterrey Bachelor,  Computer Science 1992  – 1997 Graduated with Honors Centro Universitario México Mathematics 1989  – 1992 Centro Universitario México Mathematics 1989  – 1992 Centro Universitario México Mathematics 1989  – 1992 ", "Summary Experienced manager and tech lead, focused on building cutting-edge products for software and media companies of all sizes. I have handled all sides of product development, from design & implementation through operations, strategy, and sales. I specialize in getting new ideas off the ground, turning around troubled projects, and tying disparate functional groups together. Summary Experienced manager and tech lead, focused on building cutting-edge products for software and media companies of all sizes. I have handled all sides of product development, from design & implementation through operations, strategy, and sales. I specialize in getting new ideas off the ground, turning around troubled projects, and tying disparate functional groups together. Experienced manager and tech lead, focused on building cutting-edge products for software and media companies of all sizes. I have handled all sides of product development, from design & implementation through operations, strategy, and sales. I specialize in getting new ideas off the ground, turning around troubled projects, and tying disparate functional groups together. Experienced manager and tech lead, focused on building cutting-edge products for software and media companies of all sizes. I have handled all sides of product development, from design & implementation through operations, strategy, and sales. I specialize in getting new ideas off the ground, turning around troubled projects, and tying disparate functional groups together. Experience Head of Dedicated Ads Solutions Google 2014  – Present (1 year) San Francisco Bay Area Lead business partner for sales teams supporting top-tier US clients in Retail, Telecommunications, and Consumer Electronics, representing $XBB in sales annually. Managing a team of sales engineering and solutions consultants distributed across 3 locations in the United States, focusing on delivering high-impact innovative solutions to critical business challenges. Touching $XXX M in revenue annually through engagement across major buy-side advertising products. \n \n Manager/TL, Customer Solutions Engineering Google 2013  –  2014  (1 year) San Francisco Bay Area The CSE team provides high-touch technical consulting services to Google's largest advertising partners. We work with advertisers whose needs and challenges are beyond the scope of standard approaches, developing both internal and external solutions where the core product suites have not yet caught up. The role is equal parts engineer, consultant, and project manager - acting as the technical POC in a highly complex, dynamic, and rapidly-changing environment. \n \nManaged a remote team of junior engineers across 3 offices, grew QoQ impact by over 400% in 6 months. Handled numerous escalations and critical cross-functional situations in addition to usual management responsibilities (stakeholder management, team development, hiring, performance management, etc). Senior Customer Solutions Engineer, gTech Google 2011  –  2013  (2 years) New York, NY Hired as a high-touch technical consultant, tasked with solving open-ended business problems faced by clients through a combination of both technical and soft skills. \n \n- Worked with senior-level marketing teams at over 20% of the Fortune 500 to help them develop systems to manage highly-automated AdWords campaigns at scale. \n- Worked with internal Google marketing teams to ensure special-promotion websites were properly constructed and able to operate reliably in the face of massive load. \n- Developed guidelines to capture and quantify the impact of our global team within the organization, transforming the operating model and increasing headcount allocations by 50%. \n- Developed guidelines on prototype development, encouraging innovation within the team, and enabling the team to scale our impact well beyond headcount. \n Engineering Director Bee Software 2008  –  2010  (2 years) New York, NY Bee Software facilitates the rapid construction of Data Warehouses. Our clients were organizations that were unable to aggregate and manage the large volumes of decentralized, unstructured data they owned. \n \nI wore many hats for Bee Software covering all aspects of the company. I built core technological components, sales pitches, marketing strategies, and was a public face for the company in all aspects of the business. Senior Software Engineer / TL Wall Street Source 2005  –  2008  (3 years) New York, NY Wall Street Source was a real-time financial news and information service aimed for financial professionals. Reporting directly to the CTO, tasked with rebuilding and managing all technical infrastructure, including development and operations teams. \n \n* Lead redesign, development and deployment of entire infrastructure stack, including hardware, database, messaging, caching and app-serving layers. \n* Migrated from 10 year old Solaris platform to new Linux-infrastructure. \n* Reduced system downtime by 98% in under 4 months. \n* Lead full datacenter migration with zero user downtime. \n* Responsible for capacity planning, including team, server and infrastructure requirements. \n* Technical representative on all client-facing engagements with top-tier Investment Banks and Hedge Funds. Owner PRL Solutions, LLC 2004  –  2006  (2 years) New York, NY I created PRL Solutions as a means to handle the consulting work, specifically in the areas of system design, data aggregation/analysis, and OSS development on Krang. \n \nPrevious clients include Kahr Real Estate Services, PlusThree, and The Erlbaum Group. Senior Software Engineer Open List, Inc. 2005  –  2005  (less than a year) New York, NY Open List was an early-stage local search engine for restaurants, hotels and attractions around the world. First engineer hired, turned prototype into an object-oriented pipeline architecture used to process 10+ million web pages reviewing hotels, restaurants and attractions globally. OpenList was sold to Marchex for $13M. \n* Refactored data pipeline resulting in a 50x performance improvement (1 week to 4 hours) \n* Developed the core application framework upon which all further development was based.  \n* Set coding standards and developed a unit testing framework to improve code quality and reliability. \n* Recruited, interviewed and hired team of 3 engineers + PM. \n Senior Software Engineer About.com / Primedia 2001  –  2005  (4 years) New York, NY Part of the PIRT group, the in-house consulting group for over 250 magazines within Primedia. Our goal was the migration of over 100 separate website stacks to a single, consolidated platform running on About.com's infrastructure. This included the development and operational support of all software and infrastructure to support the websites of these magazines, and to do so with minimal staff and resources. \n \nKrang, the content management system we developed to support these magazines, was made freely available as an Open-Source project, and supported the websites of magazines including New York Magazine, Motor Trend, and Ski, as well as organizations including the United Federation of Teachers, the Democratic Senatorial Campaign Committee, and the Democratic Congressional Campaign Committee. Co Founder, Software Engineer ClickTheButton.com 1999  –  2001  (2 years) New York, NY ClickTheButton was an online price-comparison service competing primarily with DealTime and MySimon (in the era before Google's Froogle service). \n \nInitial developer, responsible for all aspects of development (crawling, data pipeline, indexing, search engine, website) and system administration through the MVP that secured funding. Lead development through multiple major releases of data-processing pipeline that handled ingestion of all product data across ~ 300 online merchants. \n Software Engineer Time Inc 1997  –  1999  (2 years) New York, NY Developer for Time Inc's Pathfinder website, the portal site that ran all the websites for Time Inc's magazine properties when Pathfinder was the seventh-largest site on the web. Worked on projects for Time, Entertainment Weekly, Fortune, Money and other magazines. Head of Dedicated Ads Solutions Google 2014  – Present (1 year) San Francisco Bay Area Lead business partner for sales teams supporting top-tier US clients in Retail, Telecommunications, and Consumer Electronics, representing $XBB in sales annually. Managing a team of sales engineering and solutions consultants distributed across 3 locations in the United States, focusing on delivering high-impact innovative solutions to critical business challenges. Touching $XXX M in revenue annually through engagement across major buy-side advertising products. \n \n Head of Dedicated Ads Solutions Google 2014  – Present (1 year) San Francisco Bay Area Lead business partner for sales teams supporting top-tier US clients in Retail, Telecommunications, and Consumer Electronics, representing $XBB in sales annually. Managing a team of sales engineering and solutions consultants distributed across 3 locations in the United States, focusing on delivering high-impact innovative solutions to critical business challenges. Touching $XXX M in revenue annually through engagement across major buy-side advertising products. \n \n Manager/TL, Customer Solutions Engineering Google 2013  –  2014  (1 year) San Francisco Bay Area The CSE team provides high-touch technical consulting services to Google's largest advertising partners. We work with advertisers whose needs and challenges are beyond the scope of standard approaches, developing both internal and external solutions where the core product suites have not yet caught up. The role is equal parts engineer, consultant, and project manager - acting as the technical POC in a highly complex, dynamic, and rapidly-changing environment. \n \nManaged a remote team of junior engineers across 3 offices, grew QoQ impact by over 400% in 6 months. Handled numerous escalations and critical cross-functional situations in addition to usual management responsibilities (stakeholder management, team development, hiring, performance management, etc). Manager/TL, Customer Solutions Engineering Google 2013  –  2014  (1 year) San Francisco Bay Area The CSE team provides high-touch technical consulting services to Google's largest advertising partners. We work with advertisers whose needs and challenges are beyond the scope of standard approaches, developing both internal and external solutions where the core product suites have not yet caught up. The role is equal parts engineer, consultant, and project manager - acting as the technical POC in a highly complex, dynamic, and rapidly-changing environment. \n \nManaged a remote team of junior engineers across 3 offices, grew QoQ impact by over 400% in 6 months. Handled numerous escalations and critical cross-functional situations in addition to usual management responsibilities (stakeholder management, team development, hiring, performance management, etc). Senior Customer Solutions Engineer, gTech Google 2011  –  2013  (2 years) New York, NY Hired as a high-touch technical consultant, tasked with solving open-ended business problems faced by clients through a combination of both technical and soft skills. \n \n- Worked with senior-level marketing teams at over 20% of the Fortune 500 to help them develop systems to manage highly-automated AdWords campaigns at scale. \n- Worked with internal Google marketing teams to ensure special-promotion websites were properly constructed and able to operate reliably in the face of massive load. \n- Developed guidelines to capture and quantify the impact of our global team within the organization, transforming the operating model and increasing headcount allocations by 50%. \n- Developed guidelines on prototype development, encouraging innovation within the team, and enabling the team to scale our impact well beyond headcount. \n Senior Customer Solutions Engineer, gTech Google 2011  –  2013  (2 years) New York, NY Hired as a high-touch technical consultant, tasked with solving open-ended business problems faced by clients through a combination of both technical and soft skills. \n \n- Worked with senior-level marketing teams at over 20% of the Fortune 500 to help them develop systems to manage highly-automated AdWords campaigns at scale. \n- Worked with internal Google marketing teams to ensure special-promotion websites were properly constructed and able to operate reliably in the face of massive load. \n- Developed guidelines to capture and quantify the impact of our global team within the organization, transforming the operating model and increasing headcount allocations by 50%. \n- Developed guidelines on prototype development, encouraging innovation within the team, and enabling the team to scale our impact well beyond headcount. \n Engineering Director Bee Software 2008  –  2010  (2 years) New York, NY Bee Software facilitates the rapid construction of Data Warehouses. Our clients were organizations that were unable to aggregate and manage the large volumes of decentralized, unstructured data they owned. \n \nI wore many hats for Bee Software covering all aspects of the company. I built core technological components, sales pitches, marketing strategies, and was a public face for the company in all aspects of the business. Engineering Director Bee Software 2008  –  2010  (2 years) New York, NY Bee Software facilitates the rapid construction of Data Warehouses. Our clients were organizations that were unable to aggregate and manage the large volumes of decentralized, unstructured data they owned. \n \nI wore many hats for Bee Software covering all aspects of the company. I built core technological components, sales pitches, marketing strategies, and was a public face for the company in all aspects of the business. Senior Software Engineer / TL Wall Street Source 2005  –  2008  (3 years) New York, NY Wall Street Source was a real-time financial news and information service aimed for financial professionals. Reporting directly to the CTO, tasked with rebuilding and managing all technical infrastructure, including development and operations teams. \n \n* Lead redesign, development and deployment of entire infrastructure stack, including hardware, database, messaging, caching and app-serving layers. \n* Migrated from 10 year old Solaris platform to new Linux-infrastructure. \n* Reduced system downtime by 98% in under 4 months. \n* Lead full datacenter migration with zero user downtime. \n* Responsible for capacity planning, including team, server and infrastructure requirements. \n* Technical representative on all client-facing engagements with top-tier Investment Banks and Hedge Funds. Senior Software Engineer / TL Wall Street Source 2005  –  2008  (3 years) New York, NY Wall Street Source was a real-time financial news and information service aimed for financial professionals. Reporting directly to the CTO, tasked with rebuilding and managing all technical infrastructure, including development and operations teams. \n \n* Lead redesign, development and deployment of entire infrastructure stack, including hardware, database, messaging, caching and app-serving layers. \n* Migrated from 10 year old Solaris platform to new Linux-infrastructure. \n* Reduced system downtime by 98% in under 4 months. \n* Lead full datacenter migration with zero user downtime. \n* Responsible for capacity planning, including team, server and infrastructure requirements. \n* Technical representative on all client-facing engagements with top-tier Investment Banks and Hedge Funds. Owner PRL Solutions, LLC 2004  –  2006  (2 years) New York, NY I created PRL Solutions as a means to handle the consulting work, specifically in the areas of system design, data aggregation/analysis, and OSS development on Krang. \n \nPrevious clients include Kahr Real Estate Services, PlusThree, and The Erlbaum Group. Owner PRL Solutions, LLC 2004  –  2006  (2 years) New York, NY I created PRL Solutions as a means to handle the consulting work, specifically in the areas of system design, data aggregation/analysis, and OSS development on Krang. \n \nPrevious clients include Kahr Real Estate Services, PlusThree, and The Erlbaum Group. Senior Software Engineer Open List, Inc. 2005  –  2005  (less than a year) New York, NY Open List was an early-stage local search engine for restaurants, hotels and attractions around the world. First engineer hired, turned prototype into an object-oriented pipeline architecture used to process 10+ million web pages reviewing hotels, restaurants and attractions globally. OpenList was sold to Marchex for $13M. \n* Refactored data pipeline resulting in a 50x performance improvement (1 week to 4 hours) \n* Developed the core application framework upon which all further development was based.  \n* Set coding standards and developed a unit testing framework to improve code quality and reliability. \n* Recruited, interviewed and hired team of 3 engineers + PM. \n Senior Software Engineer Open List, Inc. 2005  –  2005  (less than a year) New York, NY Open List was an early-stage local search engine for restaurants, hotels and attractions around the world. First engineer hired, turned prototype into an object-oriented pipeline architecture used to process 10+ million web pages reviewing hotels, restaurants and attractions globally. OpenList was sold to Marchex for $13M. \n* Refactored data pipeline resulting in a 50x performance improvement (1 week to 4 hours) \n* Developed the core application framework upon which all further development was based.  \n* Set coding standards and developed a unit testing framework to improve code quality and reliability. \n* Recruited, interviewed and hired team of 3 engineers + PM. \n Senior Software Engineer About.com / Primedia 2001  –  2005  (4 years) New York, NY Part of the PIRT group, the in-house consulting group for over 250 magazines within Primedia. Our goal was the migration of over 100 separate website stacks to a single, consolidated platform running on About.com's infrastructure. This included the development and operational support of all software and infrastructure to support the websites of these magazines, and to do so with minimal staff and resources. \n \nKrang, the content management system we developed to support these magazines, was made freely available as an Open-Source project, and supported the websites of magazines including New York Magazine, Motor Trend, and Ski, as well as organizations including the United Federation of Teachers, the Democratic Senatorial Campaign Committee, and the Democratic Congressional Campaign Committee. Senior Software Engineer About.com / Primedia 2001  –  2005  (4 years) New York, NY Part of the PIRT group, the in-house consulting group for over 250 magazines within Primedia. Our goal was the migration of over 100 separate website stacks to a single, consolidated platform running on About.com's infrastructure. This included the development and operational support of all software and infrastructure to support the websites of these magazines, and to do so with minimal staff and resources. \n \nKrang, the content management system we developed to support these magazines, was made freely available as an Open-Source project, and supported the websites of magazines including New York Magazine, Motor Trend, and Ski, as well as organizations including the United Federation of Teachers, the Democratic Senatorial Campaign Committee, and the Democratic Congressional Campaign Committee. Co Founder, Software Engineer ClickTheButton.com 1999  –  2001  (2 years) New York, NY ClickTheButton was an online price-comparison service competing primarily with DealTime and MySimon (in the era before Google's Froogle service). \n \nInitial developer, responsible for all aspects of development (crawling, data pipeline, indexing, search engine, website) and system administration through the MVP that secured funding. Lead development through multiple major releases of data-processing pipeline that handled ingestion of all product data across ~ 300 online merchants. \n Co Founder, Software Engineer ClickTheButton.com 1999  –  2001  (2 years) New York, NY ClickTheButton was an online price-comparison service competing primarily with DealTime and MySimon (in the era before Google's Froogle service). \n \nInitial developer, responsible for all aspects of development (crawling, data pipeline, indexing, search engine, website) and system administration through the MVP that secured funding. Lead development through multiple major releases of data-processing pipeline that handled ingestion of all product data across ~ 300 online merchants. \n Software Engineer Time Inc 1997  –  1999  (2 years) New York, NY Developer for Time Inc's Pathfinder website, the portal site that ran all the websites for Time Inc's magazine properties when Pathfinder was the seventh-largest site on the web. Worked on projects for Time, Entertainment Weekly, Fortune, Money and other magazines. Software Engineer Time Inc 1997  –  1999  (2 years) New York, NY Developer for Time Inc's Pathfinder website, the portal site that ran all the websites for Time Inc's magazine properties when Pathfinder was the seventh-largest site on the web. Worked on projects for Time, Entertainment Weekly, Fortune, Money and other magazines. Languages English English English Skills Software Development Cloud Computing Product Development Agile Methodologies Management Project Management Mobile Applications CRM Relational Databases XML Unix Web Development Architecture Perl Startup Development Technical Hiring Managing Start-ups Strategic Planning Leadership Development Team Facilitation Test Driven Development Linux Mentoring Coding Standards Account Management Performance Metrics Business Strategy Software Consulting Client Relations Skills Apache Team Leadership JavaScript Web Applications Architectures Strategic Partnerships MySQL Distributed Systems See 22+     See less Skills  Software Development Cloud Computing Product Development Agile Methodologies Management Project Management Mobile Applications CRM Relational Databases XML Unix Web Development Architecture Perl Startup Development Technical Hiring Managing Start-ups Strategic Planning Leadership Development Team Facilitation Test Driven Development Linux Mentoring Coding Standards Account Management Performance Metrics Business Strategy Software Consulting Client Relations Skills Apache Team Leadership JavaScript Web Applications Architectures Strategic Partnerships MySQL Distributed Systems See 22+     See less Software Development Cloud Computing Product Development Agile Methodologies Management Project Management Mobile Applications CRM Relational Databases XML Unix Web Development Architecture Perl Startup Development Technical Hiring Managing Start-ups Strategic Planning Leadership Development Team Facilitation Test Driven Development Linux Mentoring Coding Standards Account Management Performance Metrics Business Strategy Software Consulting Client Relations Skills Apache Team Leadership JavaScript Web Applications Architectures Strategic Partnerships MySQL Distributed Systems See 22+     See less Software Development Cloud Computing Product Development Agile Methodologies Management Project Management Mobile Applications CRM Relational Databases XML Unix Web Development Architecture Perl Startup Development Technical Hiring Managing Start-ups Strategic Planning Leadership Development Team Facilitation Test Driven Development Linux Mentoring Coding Standards Account Management Performance Metrics Business Strategy Software Consulting Client Relations Skills Apache Team Leadership JavaScript Web Applications Architectures Strategic Partnerships MySQL Distributed Systems See 22+     See less Education New York University - Leonard N. Stern School of Business Master of Business Administration (M.B.A.),  Management , Entrepreneurship and Innovation 2006  – 2009 Vassar College BA,  Computer Science 1992  – 1997 New York University - Leonard N. Stern School of Business Master of Business Administration (M.B.A.),  Management , Entrepreneurship and Innovation 2006  – 2009 New York University - Leonard N. Stern School of Business Master of Business Administration (M.B.A.),  Management , Entrepreneurship and Innovation 2006  – 2009 New York University - Leonard N. Stern School of Business Master of Business Administration (M.B.A.),  Management , Entrepreneurship and Innovation 2006  – 2009 Vassar College BA,  Computer Science 1992  – 1997 Vassar College BA,  Computer Science 1992  – 1997 Vassar College BA,  Computer Science 1992  – 1997 ", "Experience Product Technology Manager, Performance Display Google October 2014  – Present (11 months) Senior Technical Solutions Engineer Google June 2014  –  September 2014  (4 months) Mountain View, California Customer Solutions Engineer Google May 2011  –  May 2014  (3 years 1 month) Japan Solution Architect Akamai Technologies June 2009  –  April 2011  (1 year 11 months) Software Engineer Yahoo! Japan July 2004  –  July 2009  (5 years 1 month) - Lead Engineer of the Yahoo! User Data Base - distributed hash table that contains user accounts and attributes. \n- Lead Engineer of the Yahoo! Media Data Base - distributed file store for Yahoo!'s media files. Software Engineer Fujitsu April 1999  –  June 2004  (5 years 3 months) - Developer & Systems Engineer of Fujitsu Linux Solution Group (2 years) \n- Developer of VOIP Router (1 year) \n- Developer of Telephone Swichiboard for NTT (2 years) Product Technology Manager, Performance Display Google October 2014  – Present (11 months) Product Technology Manager, Performance Display Google October 2014  – Present (11 months) Senior Technical Solutions Engineer Google June 2014  –  September 2014  (4 months) Mountain View, California Senior Technical Solutions Engineer Google June 2014  –  September 2014  (4 months) Mountain View, California Customer Solutions Engineer Google May 2011  –  May 2014  (3 years 1 month) Japan Customer Solutions Engineer Google May 2011  –  May 2014  (3 years 1 month) Japan Solution Architect Akamai Technologies June 2009  –  April 2011  (1 year 11 months) Solution Architect Akamai Technologies June 2009  –  April 2011  (1 year 11 months) Software Engineer Yahoo! Japan July 2004  –  July 2009  (5 years 1 month) - Lead Engineer of the Yahoo! User Data Base - distributed hash table that contains user accounts and attributes. \n- Lead Engineer of the Yahoo! Media Data Base - distributed file store for Yahoo!'s media files. Software Engineer Yahoo! Japan July 2004  –  July 2009  (5 years 1 month) - Lead Engineer of the Yahoo! User Data Base - distributed hash table that contains user accounts and attributes. \n- Lead Engineer of the Yahoo! Media Data Base - distributed file store for Yahoo!'s media files. Software Engineer Fujitsu April 1999  –  June 2004  (5 years 3 months) - Developer & Systems Engineer of Fujitsu Linux Solution Group (2 years) \n- Developer of VOIP Router (1 year) \n- Developer of Telephone Swichiboard for NTT (2 years) Software Engineer Fujitsu April 1999  –  June 2004  (5 years 3 months) - Developer & Systems Engineer of Fujitsu Linux Solution Group (2 years) \n- Developer of VOIP Router (1 year) \n- Developer of Telephone Swichiboard for NTT (2 years) "]}