{"position": "Financial Operations Analyst", "company": "Google", "profiles": ["Experience Finance Operations Analyst Google December 2014  – Present (9 months) San Francisco Bay Area Google Express-Adecco  Assurance Senior Associate McGladrey October 2010  –  November 2014  (4 years 2 months) Greater Boston Area •In charge of audit team through entire audit process; run fieldwork, wrap-up, client interface and financial statement preparation on multiple engagements occurring simultaneously \n•Prepare full financial statements with disclosures in accordance with U.S. GAAP for privately held companies. \n•Provide recommendations to clients regarding their internal control practices and procedures. \n•Responsible for training as well as giving formal and informal feedback and performance reviews to entry level associates \n•Work with teams to hit tight deadlines for accelerated SEC filers Assurance Intern Caturano and Company January 2010  –  March 2010  (3 months) Greater Boston Area Assurance intern at the largest regional public accounting firm in New England. Assistant Accounting Clerk Lake Champlain Pools June 2003  –  September 2008  (5 years 4 months) Assisted bookkeeper and learned basics of reconciling daily receipts and assembling deposits. Finance Operations Analyst Google December 2014  – Present (9 months) San Francisco Bay Area Google Express-Adecco  Finance Operations Analyst Google December 2014  – Present (9 months) San Francisco Bay Area Google Express-Adecco  Assurance Senior Associate McGladrey October 2010  –  November 2014  (4 years 2 months) Greater Boston Area •In charge of audit team through entire audit process; run fieldwork, wrap-up, client interface and financial statement preparation on multiple engagements occurring simultaneously \n•Prepare full financial statements with disclosures in accordance with U.S. GAAP for privately held companies. \n•Provide recommendations to clients regarding their internal control practices and procedures. \n•Responsible for training as well as giving formal and informal feedback and performance reviews to entry level associates \n•Work with teams to hit tight deadlines for accelerated SEC filers Assurance Senior Associate McGladrey October 2010  –  November 2014  (4 years 2 months) Greater Boston Area •In charge of audit team through entire audit process; run fieldwork, wrap-up, client interface and financial statement preparation on multiple engagements occurring simultaneously \n•Prepare full financial statements with disclosures in accordance with U.S. GAAP for privately held companies. \n•Provide recommendations to clients regarding their internal control practices and procedures. \n•Responsible for training as well as giving formal and informal feedback and performance reviews to entry level associates \n•Work with teams to hit tight deadlines for accelerated SEC filers Assurance Intern Caturano and Company January 2010  –  March 2010  (3 months) Greater Boston Area Assurance intern at the largest regional public accounting firm in New England. Assurance Intern Caturano and Company January 2010  –  March 2010  (3 months) Greater Boston Area Assurance intern at the largest regional public accounting firm in New England. Assistant Accounting Clerk Lake Champlain Pools June 2003  –  September 2008  (5 years 4 months) Assisted bookkeeper and learned basics of reconciling daily receipts and assembling deposits. Assistant Accounting Clerk Lake Champlain Pools June 2003  –  September 2008  (5 years 4 months) Assisted bookkeeper and learned basics of reconciling daily receipts and assembling deposits. Skills Auditing Assurance Internal Controls Microsoft Office Financial Reporting Financial Statements Financial Accounting Accounting GAAP Financial Analysis US GAAP Finance Sarbanes-Oxley Act Microsoft Excel Skills  Auditing Assurance Internal Controls Microsoft Office Financial Reporting Financial Statements Financial Accounting Accounting GAAP Financial Analysis US GAAP Finance Sarbanes-Oxley Act Microsoft Excel Auditing Assurance Internal Controls Microsoft Office Financial Reporting Financial Statements Financial Accounting Accounting GAAP Financial Analysis US GAAP Finance Sarbanes-Oxley Act Microsoft Excel Auditing Assurance Internal Controls Microsoft Office Financial Reporting Financial Statements Financial Accounting Accounting GAAP Financial Analysis US GAAP Finance Sarbanes-Oxley Act Microsoft Excel Education D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 St. Lawrence University BS,  Mathematics 2003  – 2007 D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 D'Amore-McKim School of Business at Northeastern University MBA/MSA,  Business/Accounting 2009  – 2010 St. Lawrence University BS,  Mathematics 2003  – 2007 St. Lawrence University BS,  Mathematics 2003  – 2007 St. Lawrence University BS,  Mathematics 2003  – 2007 ", "Skills SaaS Analytics Finance Business Intelligence Product Management Cloud Computing Strategy Vendor Management Business Analysis Process Improvement Cross-functional Team... Enterprise Software Payroll Business Process... Skills  SaaS Analytics Finance Business Intelligence Product Management Cloud Computing Strategy Vendor Management Business Analysis Process Improvement Cross-functional Team... Enterprise Software Payroll Business Process... SaaS Analytics Finance Business Intelligence Product Management Cloud Computing Strategy Vendor Management Business Analysis Process Improvement Cross-functional Team... Enterprise Software Payroll Business Process... SaaS Analytics Finance Business Intelligence Product Management Cloud Computing Strategy Vendor Management Business Analysis Process Improvement Cross-functional Team... Enterprise Software Payroll Business Process... ", "Summary Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Summary Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Google Project Manager and MBA with 10 years experience in operations and project management focused on process improvement, scalability, and scrappy problem-solving. Managed teams and processes at all stages from early days of extremeley rapid growth through maturity and stability. \nMBA graduate from UC Berkeley's top-ranked business program. Experience Project Manager Google June 2010  – Present (5 years 3 months) Mountain View, CA Centralize project requests and prioritization and lead cross-functional engagement with internal organizations. Identify and deliver process enhancements to increase efficiency and accuracy of payroll processing. Manage key operational processes and associated payroll accuracy and employee experiences. Assoc. Mgr., Billing Operations Google April 2007  –  June 2010  (3 years 3 months) Managed team of nine Analysts and 4 contractors providing Billing support to sales teams, providing requirements and feedback to Product Managers on new features and services, and managing special projects in the Global Revenue Operations team. Finance Operations Analyst & Senior Analyst Google August 2003  –  January 2007  (3 years 6 months) Mountain View, California Create policies and processes for Global Revenue Operations (billing, credit, collections), provide support to sales teams and clients dealing with order-to-cash issues, participate in Product Management core teams, and manage special projects in relation to order-to-cash products and features. Worked cross-functionally with sales teams, sales leadership, and Finance leadership to scale support for rapidly growing AdWords sales organization and client base. \n \n-Built a high-achieving Billing & Payments group, growing the team from 2 people to 14 over a 2 year period. \n-Implemented metrics for tracking team performance and identifying opportunities for increased efficiency, reducing turnaround times for sales support issues by over 50%. \n-Developed new-hire on-boarding plan and training materials. \n-Developed and delivered sales trainings on key Finance policies. Project Manager Google June 2010  – Present (5 years 3 months) Mountain View, CA Centralize project requests and prioritization and lead cross-functional engagement with internal organizations. Identify and deliver process enhancements to increase efficiency and accuracy of payroll processing. Manage key operational processes and associated payroll accuracy and employee experiences. Project Manager Google June 2010  – Present (5 years 3 months) Mountain View, CA Centralize project requests and prioritization and lead cross-functional engagement with internal organizations. Identify and deliver process enhancements to increase efficiency and accuracy of payroll processing. Manage key operational processes and associated payroll accuracy and employee experiences. Assoc. Mgr., Billing Operations Google April 2007  –  June 2010  (3 years 3 months) Managed team of nine Analysts and 4 contractors providing Billing support to sales teams, providing requirements and feedback to Product Managers on new features and services, and managing special projects in the Global Revenue Operations team. Assoc. Mgr., Billing Operations Google April 2007  –  June 2010  (3 years 3 months) Managed team of nine Analysts and 4 contractors providing Billing support to sales teams, providing requirements and feedback to Product Managers on new features and services, and managing special projects in the Global Revenue Operations team. Finance Operations Analyst & Senior Analyst Google August 2003  –  January 2007  (3 years 6 months) Mountain View, California Create policies and processes for Global Revenue Operations (billing, credit, collections), provide support to sales teams and clients dealing with order-to-cash issues, participate in Product Management core teams, and manage special projects in relation to order-to-cash products and features. Worked cross-functionally with sales teams, sales leadership, and Finance leadership to scale support for rapidly growing AdWords sales organization and client base. \n \n-Built a high-achieving Billing & Payments group, growing the team from 2 people to 14 over a 2 year period. \n-Implemented metrics for tracking team performance and identifying opportunities for increased efficiency, reducing turnaround times for sales support issues by over 50%. \n-Developed new-hire on-boarding plan and training materials. \n-Developed and delivered sales trainings on key Finance policies. Finance Operations Analyst & Senior Analyst Google August 2003  –  January 2007  (3 years 6 months) Mountain View, California Create policies and processes for Global Revenue Operations (billing, credit, collections), provide support to sales teams and clients dealing with order-to-cash issues, participate in Product Management core teams, and manage special projects in relation to order-to-cash products and features. Worked cross-functionally with sales teams, sales leadership, and Finance leadership to scale support for rapidly growing AdWords sales organization and client base. \n \n-Built a high-achieving Billing & Payments group, growing the team from 2 people to 14 over a 2 year period. \n-Implemented metrics for tracking team performance and identifying opportunities for increased efficiency, reducing turnaround times for sales support issues by over 50%. \n-Developed new-hire on-boarding plan and training materials. \n-Developed and delivered sales trainings on key Finance policies. Skills Analytics Competitive Analysis Cross-functional Team... Strategy Digital Marketing Product Marketing Strategic Partnerships Management Leadership Project Management Entrepreneurship Process Improvement Business Strategy Marketing Start-ups Business Planning See 1+     See less Skills  Analytics Competitive Analysis Cross-functional Team... Strategy Digital Marketing Product Marketing Strategic Partnerships Management Leadership Project Management Entrepreneurship Process Improvement Business Strategy Marketing Start-ups Business Planning See 1+     See less Analytics Competitive Analysis Cross-functional Team... Strategy Digital Marketing Product Marketing Strategic Partnerships Management Leadership Project Management Entrepreneurship Process Improvement Business Strategy Marketing Start-ups Business Planning See 1+     See less Analytics Competitive Analysis Cross-functional Team... Strategy Digital Marketing Product Marketing Strategic Partnerships Management Leadership Project Management Entrepreneurship Process Improvement Business Strategy Marketing Start-ups Business Planning See 1+     See less Education University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club Santa Clara University BA,  English , Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club University of California, Berkeley - Walter A. Haas School of Business MBA 2009  – 2012 Completed the Haas Evening & Weekend MBA program while working full-time at Google. Awarded fellowship from Google for full sponsorship of tuition. Activities and Societies:  Secretary ,  MBA Student Association\nWomen in Leadership (WIL)\nWIL Conference Volunteer\nMarketing Club Santa Clara University BA,  English , Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine Santa Clara University BA,  English , Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine Santa Clara University BA,  English , Business Minor 1998  – 2002 Activities and Societies:  Santa Clara Review literary magazine ", "Skills Fraud Anti Money Laundering SAR Reporting Finance Vendor Management Payments SAR Filing FinCEN Fraud Prevention Fraud Investigations KYC Budget Management Mobile Payments Budgets E-commerce AML Process Management Google Adwords Google Wallet Google Docs MSB FCA OFAC Money Transmission See 9+     See less Skills  Fraud Anti Money Laundering SAR Reporting Finance Vendor Management Payments SAR Filing FinCEN Fraud Prevention Fraud Investigations KYC Budget Management Mobile Payments Budgets E-commerce AML Process Management Google Adwords Google Wallet Google Docs MSB FCA OFAC Money Transmission See 9+     See less Fraud Anti Money Laundering SAR Reporting Finance Vendor Management Payments SAR Filing FinCEN Fraud Prevention Fraud Investigations KYC Budget Management Mobile Payments Budgets E-commerce AML Process Management Google Adwords Google Wallet Google Docs MSB FCA OFAC Money Transmission See 9+     See less Fraud Anti Money Laundering SAR Reporting Finance Vendor Management Payments SAR Filing FinCEN Fraud Prevention Fraud Investigations KYC Budget Management Mobile Payments Budgets E-commerce AML Process Management Google Adwords Google Wallet Google Docs MSB FCA OFAC Money Transmission See 9+     See less ", "Summary 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python Summary 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python 2008 graduate of Augustana college (Accy, Fin, Econ). Studied Accy @ UConn from 2008-2010; Pursuing MBA in Analytic Finance and Strategic Management from the University of Chicago Booth School of Business as a Chicago Business Fellow (CBF). \n \nExperienced in financial analysis, financial modeling, strategic analysis, accounting, internal reporting & forecasting, and market penetration opportunities. Building skills to pursue M&A analysis jobs within Google. Specialties:CIA, CFE, CMA; Business Process Improvement Consulting; Compliance Consulting & Assurance; Financial Analysis; Financial Modeling. \n \nAdvanced Excel skills; learning SQL/VBA/C++/Python Experience Sales Strategy and Ops Manager, Media Platforms Google May 2013  – Present (2 years 4 months) Greater New York City Area Finance Lead, Google Affiliate Network Google December 2012  –  May 2013  (6 months) Greater Chicago Area Currently acting as the Finance Lead for the Google Affiliate Network, based out of Chicago. Responsibilities include: \n \n- Leading the financial planning process for 1,3, and 5 years out \n- Management and monitoring of the P&L \n- Forecasting for the entire business \n- Designing and implementing compensation structures and plans \n- Quota administration \n- Operational analysis / implementation of new strategies \n- Market / opportunity sizing and analysis \n- Financial modeling and due diligence \n- Co-lead for billing operations Sales Finance and Operations Analyst Google January 2011  –  December 2012  (2 years) Chicago - Set quarterly quotas for Google Affiliate Network account managers \n- Track and report progress to quota for bonus payouts \n- Design compensation plans for account managers and account executives on the account management, publisher development and acquisitions teams \n- Provide bottoms-up business unit quarterly and yearly forecast to the BU \n- Provide detailed analysis on various optimization programs \n- Ad-hoc analysis and modelling as necessary (special projects around organizational structure, expansion plans, etc.) \n- Lead analysis and reporting of revenue and net revenue for entire business unit \n- Liaise with central Accounting and Finance teams to provide inputs into GL bookings and Forecast calls \n- Lead internal FP&A for business unit Sr. Financial Analyst Motorola Mobile Devices May 2010  –  January 2011  (9 months) Arlington Heights and Libertyville, IL - Reported actual spend/savings results monthly; responsible for monthly, quarterly and full year outlook \n- Provided in depth analysis for spend and savings related to freight, repair, fulfillment centers and packaging \n- Completed detailed and advanced ad-hoc trending analysis to identify potential cost savings opportunities \n- Drove improvements in the independence, value and efficiency of the internal reporting process \n- Supported procurement teams in the resolution of pricing issues identified through analysis \n- Identified and corrected significant pricing issues between pricing systems to enhance reporting and analysis \n- Presented consolidated results to senior management monthly and as needed Sr. Enterprise Risk Management Analyst Motorola June 2008  –  May 2010  (2 years) Schaumburg, IL & International Locations Business Process Consulting, Compliance Audits, Financial Audits, IT Audits \n \n- Interfaced with and presented to executives and various members of senior management \n- Consulted on intricate compliance issues for various business units and functions across Motorola globally \n- Provided a high level of strategic insight around the planning of several engagements \n- Performed analytics around potential fraudulent activities as part of the Fraud Initiatives Team \n- Completed a corporate SOX governance review for several functions Accounting Analyst Genesis Systems Group January 2008  –  March 2008  (3 months) Solved a prepaid software accounting issue and designed an automated solution for future application. Internal Controls John Deere March 2006  –  December 2006  (10 months) Internal Controls \n- Created a process to track and maintain journal voucher records for S-Ox compliance \n- Completed month end closing on 20+ accounts \n- Performed daily audits of perpetual inventory adjustments \n- Reformatted complicated SAS program to complete a vendor rebate program (savings of $1.6M for company) Sales Strategy and Ops Manager, Media Platforms Google May 2013  – Present (2 years 4 months) Greater New York City Area Sales Strategy and Ops Manager, Media Platforms Google May 2013  – Present (2 years 4 months) Greater New York City Area Finance Lead, Google Affiliate Network Google December 2012  –  May 2013  (6 months) Greater Chicago Area Currently acting as the Finance Lead for the Google Affiliate Network, based out of Chicago. Responsibilities include: \n \n- Leading the financial planning process for 1,3, and 5 years out \n- Management and monitoring of the P&L \n- Forecasting for the entire business \n- Designing and implementing compensation structures and plans \n- Quota administration \n- Operational analysis / implementation of new strategies \n- Market / opportunity sizing and analysis \n- Financial modeling and due diligence \n- Co-lead for billing operations Finance Lead, Google Affiliate Network Google December 2012  –  May 2013  (6 months) Greater Chicago Area Currently acting as the Finance Lead for the Google Affiliate Network, based out of Chicago. Responsibilities include: \n \n- Leading the financial planning process for 1,3, and 5 years out \n- Management and monitoring of the P&L \n- Forecasting for the entire business \n- Designing and implementing compensation structures and plans \n- Quota administration \n- Operational analysis / implementation of new strategies \n- Market / opportunity sizing and analysis \n- Financial modeling and due diligence \n- Co-lead for billing operations Sales Finance and Operations Analyst Google January 2011  –  December 2012  (2 years) Chicago - Set quarterly quotas for Google Affiliate Network account managers \n- Track and report progress to quota for bonus payouts \n- Design compensation plans for account managers and account executives on the account management, publisher development and acquisitions teams \n- Provide bottoms-up business unit quarterly and yearly forecast to the BU \n- Provide detailed analysis on various optimization programs \n- Ad-hoc analysis and modelling as necessary (special projects around organizational structure, expansion plans, etc.) \n- Lead analysis and reporting of revenue and net revenue for entire business unit \n- Liaise with central Accounting and Finance teams to provide inputs into GL bookings and Forecast calls \n- Lead internal FP&A for business unit Sales Finance and Operations Analyst Google January 2011  –  December 2012  (2 years) Chicago - Set quarterly quotas for Google Affiliate Network account managers \n- Track and report progress to quota for bonus payouts \n- Design compensation plans for account managers and account executives on the account management, publisher development and acquisitions teams \n- Provide bottoms-up business unit quarterly and yearly forecast to the BU \n- Provide detailed analysis on various optimization programs \n- Ad-hoc analysis and modelling as necessary (special projects around organizational structure, expansion plans, etc.) \n- Lead analysis and reporting of revenue and net revenue for entire business unit \n- Liaise with central Accounting and Finance teams to provide inputs into GL bookings and Forecast calls \n- Lead internal FP&A for business unit Sr. Financial Analyst Motorola Mobile Devices May 2010  –  January 2011  (9 months) Arlington Heights and Libertyville, IL - Reported actual spend/savings results monthly; responsible for monthly, quarterly and full year outlook \n- Provided in depth analysis for spend and savings related to freight, repair, fulfillment centers and packaging \n- Completed detailed and advanced ad-hoc trending analysis to identify potential cost savings opportunities \n- Drove improvements in the independence, value and efficiency of the internal reporting process \n- Supported procurement teams in the resolution of pricing issues identified through analysis \n- Identified and corrected significant pricing issues between pricing systems to enhance reporting and analysis \n- Presented consolidated results to senior management monthly and as needed Sr. Financial Analyst Motorola Mobile Devices May 2010  –  January 2011  (9 months) Arlington Heights and Libertyville, IL - Reported actual spend/savings results monthly; responsible for monthly, quarterly and full year outlook \n- Provided in depth analysis for spend and savings related to freight, repair, fulfillment centers and packaging \n- Completed detailed and advanced ad-hoc trending analysis to identify potential cost savings opportunities \n- Drove improvements in the independence, value and efficiency of the internal reporting process \n- Supported procurement teams in the resolution of pricing issues identified through analysis \n- Identified and corrected significant pricing issues between pricing systems to enhance reporting and analysis \n- Presented consolidated results to senior management monthly and as needed Sr. Enterprise Risk Management Analyst Motorola June 2008  –  May 2010  (2 years) Schaumburg, IL & International Locations Business Process Consulting, Compliance Audits, Financial Audits, IT Audits \n \n- Interfaced with and presented to executives and various members of senior management \n- Consulted on intricate compliance issues for various business units and functions across Motorola globally \n- Provided a high level of strategic insight around the planning of several engagements \n- Performed analytics around potential fraudulent activities as part of the Fraud Initiatives Team \n- Completed a corporate SOX governance review for several functions Sr. Enterprise Risk Management Analyst Motorola June 2008  –  May 2010  (2 years) Schaumburg, IL & International Locations Business Process Consulting, Compliance Audits, Financial Audits, IT Audits \n \n- Interfaced with and presented to executives and various members of senior management \n- Consulted on intricate compliance issues for various business units and functions across Motorola globally \n- Provided a high level of strategic insight around the planning of several engagements \n- Performed analytics around potential fraudulent activities as part of the Fraud Initiatives Team \n- Completed a corporate SOX governance review for several functions Accounting Analyst Genesis Systems Group January 2008  –  March 2008  (3 months) Solved a prepaid software accounting issue and designed an automated solution for future application. Accounting Analyst Genesis Systems Group January 2008  –  March 2008  (3 months) Solved a prepaid software accounting issue and designed an automated solution for future application. Internal Controls John Deere March 2006  –  December 2006  (10 months) Internal Controls \n- Created a process to track and maintain journal voucher records for S-Ox compliance \n- Completed month end closing on 20+ accounts \n- Performed daily audits of perpetual inventory adjustments \n- Reformatted complicated SAS program to complete a vendor rebate program (savings of $1.6M for company) Internal Controls John Deere March 2006  –  December 2006  (10 months) Internal Controls \n- Created a process to track and maintain journal voucher records for S-Ox compliance \n- Completed month end closing on 20+ accounts \n- Performed daily audits of perpetual inventory adjustments \n- Reformatted complicated SAS program to complete a vendor rebate program (savings of $1.6M for company) Skills Financial Analysis Financial Planning Strategic Planning Data Analysis Financial Forecasting Revenue Forecasting Strategic Analysis Attention To Detail Microsoft Excel Financial Modeling Strategic Financial... Forecasting Analysis Process Improvement Analytics Finance Business Process... Strategy See 3+     See less Skills  Financial Analysis Financial Planning Strategic Planning Data Analysis Financial Forecasting Revenue Forecasting Strategic Analysis Attention To Detail Microsoft Excel Financial Modeling Strategic Financial... Forecasting Analysis Process Improvement Analytics Finance Business Process... Strategy See 3+     See less Financial Analysis Financial Planning Strategic Planning Data Analysis Financial Forecasting Revenue Forecasting Strategic Analysis Attention To Detail Microsoft Excel Financial Modeling Strategic Financial... Forecasting Analysis Process Improvement Analytics Finance Business Process... Strategy See 3+     See less Financial Analysis Financial Planning Strategic Planning Data Analysis Financial Forecasting Revenue Forecasting Strategic Analysis Attention To Detail Microsoft Excel Financial Modeling Strategic Financial... Forecasting Analysis Process Improvement Analytics Finance Business Process... Strategy See 3+     See less Education The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 The University of Chicago - Booth School of Business MBA,  Analytic Finance ,  Strategic Management ,  Entrepreneurship & Accounting 2010  – 2013 Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K Augustana College Bachelor of Arts,  Accounting & Finance 2004  – 2008 Activities and Societies:  ODK ,  BBBS ,  Circle K ", "Summary Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Summary Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Senior Finance Operations Professional. Skills include financial modeling, underwriting, process optimization, operations and sales management, contract compliance, customer service and accounting  \n \nSpecialties: Financial Statement Analysis, Administrative Management, \nCustomer Service Experience Global Process Manager, Collections Google September 2013  – Present (2 years) Sr. Finance Operations Analyst - Invoicing Google May 2013  –  September 2013  (5 months) Sr. Finance Operations Analyst - Credit Google April 2011  –  May 2013  (2 years 2 months) Operations Supervisor Enterprise Fleet Management May 2006  –  April 2011  (5 years) Account Executive Enterprise Fleet Management August 2004  –  May 2006  (1 year 10 months) Management Trainee Enterprise Rent A Car July 2003  –  August 2004  (1 year 2 months) Global Process Manager, Collections Google September 2013  – Present (2 years) Global Process Manager, Collections Google September 2013  – Present (2 years) Sr. Finance Operations Analyst - Invoicing Google May 2013  –  September 2013  (5 months) Sr. Finance Operations Analyst - Invoicing Google May 2013  –  September 2013  (5 months) Sr. Finance Operations Analyst - Credit Google April 2011  –  May 2013  (2 years 2 months) Sr. Finance Operations Analyst - Credit Google April 2011  –  May 2013  (2 years 2 months) Operations Supervisor Enterprise Fleet Management May 2006  –  April 2011  (5 years) Operations Supervisor Enterprise Fleet Management May 2006  –  April 2011  (5 years) Account Executive Enterprise Fleet Management August 2004  –  May 2006  (1 year 10 months) Account Executive Enterprise Fleet Management August 2004  –  May 2006  (1 year 10 months) Management Trainee Enterprise Rent A Car July 2003  –  August 2004  (1 year 2 months) Management Trainee Enterprise Rent A Car July 2003  –  August 2004  (1 year 2 months) Skills Customer Service Financial Statement... Financial Analysis Financial Modeling Forecasting Finance Competitive Analysis Cross-functional Team... Business Development Strategic Planning Sales Business Strategy Skills  Customer Service Financial Statement... Financial Analysis Financial Modeling Forecasting Finance Competitive Analysis Cross-functional Team... Business Development Strategic Planning Sales Business Strategy Customer Service Financial Statement... Financial Analysis Financial Modeling Forecasting Finance Competitive Analysis Cross-functional Team... Business Development Strategic Planning Sales Business Strategy Customer Service Financial Statement... Financial Analysis Financial Modeling Forecasting Finance Competitive Analysis Cross-functional Team... Business Development Strategic Planning Sales Business Strategy Education UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club UCLA Anderson School of Management MBA,  Finance 2007  – 2010 Dean's Honor Society \nJune 2008 - Washington (DC) Campus Syposium on Business and Government Activities and Societies:  External Representative ,  Student Council\nInvestment Finance Club University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity University of California, Los Angeles BA,  Classical Civilizations 1999  – 2003 Cum Laude \nHonors from the College of Letters and Sciences Activities and Societies:  UCLA Football Program 1999-2003\nSigma Nu Fraternity Honors & Awards Additional Honors & Awards UCLA - Cum Laude Additional Honors & Awards UCLA - Cum Laude Additional Honors & Awards UCLA - Cum Laude Additional Honors & Awards UCLA - Cum Laude ", "Summary Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Summary Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Engineering graduate with a Masters in Business (MBA) and over 10 years experience in the Internet and IT industry. My time at Google has led to a deep understanding of the Online Advertising industry. First with AdSense (The Google Ad Network) as a Technical Account manager and Financial Analyst for AdWords (Google's flagship advertising product). I am currently managing a global finance operation within the Travel & Expense team at Google \n \nSpecialties: Business analysis & delivering business and industry insights. Generation and presentation of operational & revenue reports. Account management, Vendor management, Project management. \nTechnologies: MySQL databases, data warehouses, Advanced Excel, AdWords & AdSense platforms, Google Analytics, HTML, JavaScript, Java, Ruby on Rails. Experience Finance Operations Analyst Google July 2013  – Present (2 years 2 months) Dublin Global P2P Project Manager responsible for EMEA & LATAM, tasked with ensuring a best in class travel and expense experience for Googlers. \n \n2014 Concur Innovation Award Winner. \n \n Financial Analyst Google August 2011  – Present (4 years 1 month) Dublin I support the Google AdWords business by providing actionable insights to drive the business forward. As a Financial Analyst I am a valued partner to the Senior Sales Management teams. I am called upon to build complex scenarios analyses that serve as the basis for recommendations that leaders of the business draw from to make critical strategic decisions. The output of my work is highly visible and has significant global impact. A master juggler working on multiple projects at a time, I can jump from deep analysis or systems development to face to face meetings with senior management while all the time maintaining a consistently high level of attention to detail while finding creative ways to tackle new challenges. \n \nResponsibilities: \n \nDefine, analyse and communicate key metrics and business trends for Sales management teams. \nExecute sophisticated quantitative analyses and advanced modeling that translates data into actionable insights. \nDevelop financial and data models and tools that provide a platform for decision making on a variety of business issues. \nBuild and lead the preparation and publishing of metric forecasting and reporting for internal customers. \nLeverage knowledge of Excel, SQL, Python, etc to build scalable global tools Senior Business Analyst - AdSense Google January 2009  –  August 2011  (2 years 8 months) Lead Analyst for the global AdSense account management team. \nResearch and analyze key business drivers, competitive environment, trends and operating metrics. \nProduction of revenue and KPI reports and dashboards providing regular insights to senior management on the business. \nDevelopment of data models and tools that provide a platform for decision making on a variety of operational issues. \nExecute sophisticated quantitative & statistical analyses and advanced modeling that translates data into actionable insights. \nProvide those insights to account management teams to support sales activities - lead generation, upsells, cross-sells. \nPlay a key role in target setting and performance measurement for sales team. \nMeasure Revenue and ROI from global sales initiatives and events. \nProduction, coordination and presentation of global business reviews. Technical Account Manager - AdSense Google February 2007  –  January 2009  (2 years) Managing technical relationship with AdSense partners from technical implementation to on-going technology communications. Assisting partners in implementing and launching new products and services. Building successful, long-term relationships with partners. Liaison between partners and Product Management team. Played a key role in the global launch of the AdSense product for mobile devices (Mobile AFC). Delivered product training to the sales team. \nSpecial projects involving quantitative analysis, industry research, and strategy development. Developing upsell strategies to drive new business opportunities, and maximizing the monetization of the online services. \nAccount management of a portfolio of large UK AdSense partners - working with major website owners to monetise their inventory through AdSense. Upselling AdSense and cross-selling other Google products. Application Engineer Microsoft 2006  –  2007  (1 year) Vendor management - Technical liason between Microsoft core team (US) and external localisation vendors (Europe) for Office 2007 Sharepoint Portal Server. Investigation and resolution of technical issues to support external vendors. Escalation of internationalization issues to core team, monitoring these issues and communicating with both groups until resolution. \n \nLab management - Installation, provisioning and maintenance of international server labs to enable the testing and engineering of MS Office 2007 server products. Technical Specialist Connect Global Solutions 1998  –  2004  (6 years) Connect Global Solutions was a software localization services company. I was one of the 10 founding members when this company started up in 1998. The company grew to over 50 employees by the time I left to pursue an MBA.  \n \nClients included: \nApple, IBM, Symantec, AutoDesk, AOL, Microsoft (Visio), Canon \n \nRoles included: \nSoftware localization and internationalization \nTeam Leading \nProject Management \nRelationship Management \nProject Analysis \nTechnical Analysis \nBusiness Development \nApplication Development Software Engineer Claris Ireland 1996  –  1998  (2 years) Claris was the software subsidiary of Apple Computers. All Apple software was marketed through Claris.  \n \nPrimary localisation engineer for FileMaker Pro (database application) and Claris Homepage (WYSIWYG HTML editor) on Mac and PC. Configured and recompiled build environments. Investigated and resolved software bugs. \nVendor support – provided detailed technical instructions and ongoing technical support to outsourcing vendors. Finance Operations Analyst Google July 2013  – Present (2 years 2 months) Dublin Global P2P Project Manager responsible for EMEA & LATAM, tasked with ensuring a best in class travel and expense experience for Googlers. \n \n2014 Concur Innovation Award Winner. \n \n Finance Operations Analyst Google July 2013  – Present (2 years 2 months) Dublin Global P2P Project Manager responsible for EMEA & LATAM, tasked with ensuring a best in class travel and expense experience for Googlers. \n \n2014 Concur Innovation Award Winner. \n \n Financial Analyst Google August 2011  – Present (4 years 1 month) Dublin I support the Google AdWords business by providing actionable insights to drive the business forward. As a Financial Analyst I am a valued partner to the Senior Sales Management teams. I am called upon to build complex scenarios analyses that serve as the basis for recommendations that leaders of the business draw from to make critical strategic decisions. The output of my work is highly visible and has significant global impact. A master juggler working on multiple projects at a time, I can jump from deep analysis or systems development to face to face meetings with senior management while all the time maintaining a consistently high level of attention to detail while finding creative ways to tackle new challenges. \n \nResponsibilities: \n \nDefine, analyse and communicate key metrics and business trends for Sales management teams. \nExecute sophisticated quantitative analyses and advanced modeling that translates data into actionable insights. \nDevelop financial and data models and tools that provide a platform for decision making on a variety of business issues. \nBuild and lead the preparation and publishing of metric forecasting and reporting for internal customers. \nLeverage knowledge of Excel, SQL, Python, etc to build scalable global tools Financial Analyst Google August 2011  – Present (4 years 1 month) Dublin I support the Google AdWords business by providing actionable insights to drive the business forward. As a Financial Analyst I am a valued partner to the Senior Sales Management teams. I am called upon to build complex scenarios analyses that serve as the basis for recommendations that leaders of the business draw from to make critical strategic decisions. The output of my work is highly visible and has significant global impact. A master juggler working on multiple projects at a time, I can jump from deep analysis or systems development to face to face meetings with senior management while all the time maintaining a consistently high level of attention to detail while finding creative ways to tackle new challenges. \n \nResponsibilities: \n \nDefine, analyse and communicate key metrics and business trends for Sales management teams. \nExecute sophisticated quantitative analyses and advanced modeling that translates data into actionable insights. \nDevelop financial and data models and tools that provide a platform for decision making on a variety of business issues. \nBuild and lead the preparation and publishing of metric forecasting and reporting for internal customers. \nLeverage knowledge of Excel, SQL, Python, etc to build scalable global tools Senior Business Analyst - AdSense Google January 2009  –  August 2011  (2 years 8 months) Lead Analyst for the global AdSense account management team. \nResearch and analyze key business drivers, competitive environment, trends and operating metrics. \nProduction of revenue and KPI reports and dashboards providing regular insights to senior management on the business. \nDevelopment of data models and tools that provide a platform for decision making on a variety of operational issues. \nExecute sophisticated quantitative & statistical analyses and advanced modeling that translates data into actionable insights. \nProvide those insights to account management teams to support sales activities - lead generation, upsells, cross-sells. \nPlay a key role in target setting and performance measurement for sales team. \nMeasure Revenue and ROI from global sales initiatives and events. \nProduction, coordination and presentation of global business reviews. Senior Business Analyst - AdSense Google January 2009  –  August 2011  (2 years 8 months) Lead Analyst for the global AdSense account management team. \nResearch and analyze key business drivers, competitive environment, trends and operating metrics. \nProduction of revenue and KPI reports and dashboards providing regular insights to senior management on the business. \nDevelopment of data models and tools that provide a platform for decision making on a variety of operational issues. \nExecute sophisticated quantitative & statistical analyses and advanced modeling that translates data into actionable insights. \nProvide those insights to account management teams to support sales activities - lead generation, upsells, cross-sells. \nPlay a key role in target setting and performance measurement for sales team. \nMeasure Revenue and ROI from global sales initiatives and events. \nProduction, coordination and presentation of global business reviews. Technical Account Manager - AdSense Google February 2007  –  January 2009  (2 years) Managing technical relationship with AdSense partners from technical implementation to on-going technology communications. Assisting partners in implementing and launching new products and services. Building successful, long-term relationships with partners. Liaison between partners and Product Management team. Played a key role in the global launch of the AdSense product for mobile devices (Mobile AFC). Delivered product training to the sales team. \nSpecial projects involving quantitative analysis, industry research, and strategy development. Developing upsell strategies to drive new business opportunities, and maximizing the monetization of the online services. \nAccount management of a portfolio of large UK AdSense partners - working with major website owners to monetise their inventory through AdSense. Upselling AdSense and cross-selling other Google products. Technical Account Manager - AdSense Google February 2007  –  January 2009  (2 years) Managing technical relationship with AdSense partners from technical implementation to on-going technology communications. Assisting partners in implementing and launching new products and services. Building successful, long-term relationships with partners. Liaison between partners and Product Management team. Played a key role in the global launch of the AdSense product for mobile devices (Mobile AFC). Delivered product training to the sales team. \nSpecial projects involving quantitative analysis, industry research, and strategy development. Developing upsell strategies to drive new business opportunities, and maximizing the monetization of the online services. \nAccount management of a portfolio of large UK AdSense partners - working with major website owners to monetise their inventory through AdSense. Upselling AdSense and cross-selling other Google products. Application Engineer Microsoft 2006  –  2007  (1 year) Vendor management - Technical liason between Microsoft core team (US) and external localisation vendors (Europe) for Office 2007 Sharepoint Portal Server. Investigation and resolution of technical issues to support external vendors. Escalation of internationalization issues to core team, monitoring these issues and communicating with both groups until resolution. \n \nLab management - Installation, provisioning and maintenance of international server labs to enable the testing and engineering of MS Office 2007 server products. Application Engineer Microsoft 2006  –  2007  (1 year) Vendor management - Technical liason between Microsoft core team (US) and external localisation vendors (Europe) for Office 2007 Sharepoint Portal Server. Investigation and resolution of technical issues to support external vendors. Escalation of internationalization issues to core team, monitoring these issues and communicating with both groups until resolution. \n \nLab management - Installation, provisioning and maintenance of international server labs to enable the testing and engineering of MS Office 2007 server products. Technical Specialist Connect Global Solutions 1998  –  2004  (6 years) Connect Global Solutions was a software localization services company. I was one of the 10 founding members when this company started up in 1998. The company grew to over 50 employees by the time I left to pursue an MBA.  \n \nClients included: \nApple, IBM, Symantec, AutoDesk, AOL, Microsoft (Visio), Canon \n \nRoles included: \nSoftware localization and internationalization \nTeam Leading \nProject Management \nRelationship Management \nProject Analysis \nTechnical Analysis \nBusiness Development \nApplication Development Technical Specialist Connect Global Solutions 1998  –  2004  (6 years) Connect Global Solutions was a software localization services company. I was one of the 10 founding members when this company started up in 1998. The company grew to over 50 employees by the time I left to pursue an MBA.  \n \nClients included: \nApple, IBM, Symantec, AutoDesk, AOL, Microsoft (Visio), Canon \n \nRoles included: \nSoftware localization and internationalization \nTeam Leading \nProject Management \nRelationship Management \nProject Analysis \nTechnical Analysis \nBusiness Development \nApplication Development Software Engineer Claris Ireland 1996  –  1998  (2 years) Claris was the software subsidiary of Apple Computers. All Apple software was marketed through Claris.  \n \nPrimary localisation engineer for FileMaker Pro (database application) and Claris Homepage (WYSIWYG HTML editor) on Mac and PC. Configured and recompiled build environments. Investigated and resolved software bugs. \nVendor support – provided detailed technical instructions and ongoing technical support to outsourcing vendors. Software Engineer Claris Ireland 1996  –  1998  (2 years) Claris was the software subsidiary of Apple Computers. All Apple software was marketed through Claris.  \n \nPrimary localisation engineer for FileMaker Pro (database application) and Claris Homepage (WYSIWYG HTML editor) on Mac and PC. Configured and recompiled build environments. Investigated and resolved software bugs. \nVendor support – provided detailed technical instructions and ongoing technical support to outsourcing vendors. Skills Google Analytics Java Project Management Vendor Management JavaScript HTML MySQL Data Warehousing Ruby on Rails Microsoft Excel Business Analysis Online Advertising Account Management Google Adwords Mobile Devices Business Strategy Management Strategy Digital Marketing Product Management See 5+     See less Skills  Google Analytics Java Project Management Vendor Management JavaScript HTML MySQL Data Warehousing Ruby on Rails Microsoft Excel Business Analysis Online Advertising Account Management Google Adwords Mobile Devices Business Strategy Management Strategy Digital Marketing Product Management See 5+     See less Google Analytics Java Project Management Vendor Management JavaScript HTML MySQL Data Warehousing Ruby on Rails Microsoft Excel Business Analysis Online Advertising Account Management Google Adwords Mobile Devices Business Strategy Management Strategy Digital Marketing Product Management See 5+     See less Google Analytics Java Project Management Vendor Management JavaScript HTML MySQL Data Warehousing Ruby on Rails Microsoft Excel Business Analysis Online Advertising Account Management Google Adwords Mobile Devices Business Strategy Management Strategy Digital Marketing Product Management See 5+     See less Education University College Dublin MBA,  Business ,  Management , Finance,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. University College Dublin MBA,  Business ,  Management , Finance,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. University College Dublin MBA,  Business ,  Management , Finance,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. University College Dublin MBA,  Business ,  Management , Finance,  Marketing 2004  – 2005 Smurfit Business School, UCD. \nAwarded academic scholarship based on GMAT score of 700 (93rd percentile) \n \nSubjects: \nCorporate Finance, Financial Reporting, Business Economics, Management Accounting, Financial Statement Analysis, Business Planning & Project Management, Principles of Finance, Strategic Management, Organisational Behaviour, Marketing Management, Entrepreneurial Management, Operations Management, Management Information Systems, International Business, Human Resource Management, Negotiations, B2B Marketing, Strategic Brand Management, Leadership. \n \nProjects: \nFinancial statement analysis of Sun Microsystems annual report.  \nDeveloped a business plan to establish a \"cultural consultancy\" in Shanghai, China.  \nPrepared a detailed analysis of the online advertising business model incorporating partner networks. The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming The Open University Post Grad Diploma,  Software Development 2000  – 2004 This was a distance learning course, achieved over 4 years while working full time.  \n \nSubjects: Relational Database Systems, Advanced Database Technology, E-Commerce, Object Oriented Programming , Software Engineering, User Interface Design, Java Network Programming University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. University College Cork B.ENG,  Electrical & Electronic Engineering 1991  – 1995 Final year subjects: Opto-electronics, Digital Signal Processing, Applied Maths, Telecommunications, Control Engineering, Microwave Electronics, Power Electronics, Digital IC Design, Italian. Honors & Awards Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) Additional Honors & Awards Sun Certified Java Programmer for Java 2 Platform, Exam 310-025 (2002) ", "Languages English Native or bilingual proficiency Croatian Native or bilingual proficiency English Native or bilingual proficiency Croatian Native or bilingual proficiency English Native or bilingual proficiency Croatian Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Skills     ", "Summary Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Summary Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Specialties:Credit Risk Management; \nCollections Management; \nVendor Management; \nContract Management; \nOperational Excellence; \nEU VAT Rules & Principles; \nCustomer Relationship Management; \nProject Management; \n \nAccounting systems: SAP R3, Oracle; \nMicrosoft Office: Basic Pack + Info Path, Sharepoint and Visio; \nAdobe Softwares: Photoshop, Premiere, Indesign, Quark Xpress Experience Senior Global Process Manager Google May 2015  – Present (4 months) Finance Operations Manager Google November 2013  –  April 2015  (1 year 6 months) Dublin Senior Finance Operations Analyst Google August 2011  –  October 2013  (2 years 3 months) Dublin Credit Risk Manager Accenture October 2006  –  July 2011  (4 years 10 months) Dublin Accounting Control Specialist Hertz Europe Service Center August 2005  –  October 2006  (1 year 3 months) Dublin Senior Global Process Manager Google May 2015  – Present (4 months) Senior Global Process Manager Google May 2015  – Present (4 months) Finance Operations Manager Google November 2013  –  April 2015  (1 year 6 months) Dublin Finance Operations Manager Google November 2013  –  April 2015  (1 year 6 months) Dublin Senior Finance Operations Analyst Google August 2011  –  October 2013  (2 years 3 months) Dublin Senior Finance Operations Analyst Google August 2011  –  October 2013  (2 years 3 months) Dublin Credit Risk Manager Accenture October 2006  –  July 2011  (4 years 10 months) Dublin Credit Risk Manager Accenture October 2006  –  July 2011  (4 years 10 months) Dublin Accounting Control Specialist Hertz Europe Service Center August 2005  –  October 2006  (1 year 3 months) Dublin Accounting Control Specialist Hertz Europe Service Center August 2005  –  October 2006  (1 year 3 months) Dublin Languages French Spanish French Spanish French Spanish Skills Microsoft Office Customer Relations SAP R/3 Credit Risk Operational Excellence Photoshop InDesign QuarkXPress Visio Accounting EU Excel Word PowerPoint Outlook MS Project Budgeting SAP Windows Credit Supervisory Skills Financial Reporting Market Risk Adobe Acrobat Contract Management ERP English Basel II SharePoint Accounts Receivable Dreamweaver Microsoft Excel Financial Analysis CRM Project Management Finance Forecasting Risk Management Process Improvement See 24+     See less Skills  Microsoft Office Customer Relations SAP R/3 Credit Risk Operational Excellence Photoshop InDesign QuarkXPress Visio Accounting EU Excel Word PowerPoint Outlook MS Project Budgeting SAP Windows Credit Supervisory Skills Financial Reporting Market Risk Adobe Acrobat Contract Management ERP English Basel II SharePoint Accounts Receivable Dreamweaver Microsoft Excel Financial Analysis CRM Project Management Finance Forecasting Risk Management Process Improvement See 24+     See less Microsoft Office Customer Relations SAP R/3 Credit Risk Operational Excellence Photoshop InDesign QuarkXPress Visio Accounting EU Excel Word PowerPoint Outlook MS Project Budgeting SAP Windows Credit Supervisory Skills Financial Reporting Market Risk Adobe Acrobat Contract Management ERP English Basel II SharePoint Accounts Receivable Dreamweaver Microsoft Excel Financial Analysis CRM Project Management Finance Forecasting Risk Management Process Improvement See 24+     See less Microsoft Office Customer Relations SAP R/3 Credit Risk Operational Excellence Photoshop InDesign QuarkXPress Visio Accounting EU Excel Word PowerPoint Outlook MS Project Budgeting SAP Windows Credit Supervisory Skills Financial Reporting Market Risk Adobe Acrobat Contract Management ERP English Basel II SharePoint Accounts Receivable Dreamweaver Microsoft Excel Financial Analysis CRM Project Management Finance Forecasting Risk Management Process Improvement See 24+     See less Honors & Awards Patent Award Google March 2012 Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM Patent Award Google March 2012 Patent Award Google March 2012 Patent Award Google March 2012 Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM Best Risk Analyst in Ireland IICM November 2009 Nominated for Best Risk Analyst in Ireland by IICM ", "Experience Real Estate Portfolio Analyst Google September 2013  – Present (2 years) Finance Operations Analyst Google January 2011  –  August 2013  (2 years 8 months) Financial Analyst Wells Fargo July 2008  –  January 2011  (2 years 7 months) Summer Analyst Wells Fargo June 2007  –  September 2007  (4 months) Real Estate Portfolio Analyst Google September 2013  – Present (2 years) Real Estate Portfolio Analyst Google September 2013  – Present (2 years) Finance Operations Analyst Google January 2011  –  August 2013  (2 years 8 months) Finance Operations Analyst Google January 2011  –  August 2013  (2 years 8 months) Financial Analyst Wells Fargo July 2008  –  January 2011  (2 years 7 months) Financial Analyst Wells Fargo July 2008  –  January 2011  (2 years 7 months) Summer Analyst Wells Fargo June 2007  –  September 2007  (4 months) Summer Analyst Wells Fargo June 2007  –  September 2007  (4 months) Skills Financial Reporting Financial Analysis Data Analysis Financial Modeling Entrepreneurship Analytics Corporate Finance Valuation Competitive Analysis Skills  Financial Reporting Financial Analysis Data Analysis Financial Modeling Entrepreneurship Analytics Corporate Finance Valuation Competitive Analysis Financial Reporting Financial Analysis Data Analysis Financial Modeling Entrepreneurship Analytics Corporate Finance Valuation Competitive Analysis Financial Reporting Financial Analysis Data Analysis Financial Modeling Entrepreneurship Analytics Corporate Finance Valuation Competitive Analysis Education University of California, Los Angeles Business Economics , Education 2004  – 2008 University of California, Los Angeles Business Economics , Education 2004  – 2008 University of California, Los Angeles Business Economics , Education 2004  – 2008 University of California, Los Angeles Business Economics , Education 2004  – 2008 ", "Experience Global Process Manager, Finance Operations Google May 2013  – Present (2 years 4 months) Mountain View, California Senior Finance Operations Analyst Google December 2011  –  April 2013  (1 year 5 months) Mountain View, California Finance Ops Specialist I and II - Mergers and Acquisitions Google November 2008  –  December 2011  (3 years 2 months) Dublin, Ireland Billing Specialist Google June 2007  –  October 2008  (1 year 5 months) Dublin, Ireland Accountant Volvo Polska Sp. z o.o. - Volvo Business Services August 2005  –  June 2007  (1 year 11 months) Wroclaw, Lower Silesian District, Poland Global Process Manager, Finance Operations Google May 2013  – Present (2 years 4 months) Mountain View, California Global Process Manager, Finance Operations Google May 2013  – Present (2 years 4 months) Mountain View, California Senior Finance Operations Analyst Google December 2011  –  April 2013  (1 year 5 months) Mountain View, California Senior Finance Operations Analyst Google December 2011  –  April 2013  (1 year 5 months) Mountain View, California Finance Ops Specialist I and II - Mergers and Acquisitions Google November 2008  –  December 2011  (3 years 2 months) Dublin, Ireland Finance Ops Specialist I and II - Mergers and Acquisitions Google November 2008  –  December 2011  (3 years 2 months) Dublin, Ireland Billing Specialist Google June 2007  –  October 2008  (1 year 5 months) Dublin, Ireland Billing Specialist Google June 2007  –  October 2008  (1 year 5 months) Dublin, Ireland Accountant Volvo Polska Sp. z o.o. - Volvo Business Services August 2005  –  June 2007  (1 year 11 months) Wroclaw, Lower Silesian District, Poland Accountant Volvo Polska Sp. z o.o. - Volvo Business Services August 2005  –  June 2007  (1 year 11 months) Wroclaw, Lower Silesian District, Poland Languages English Full professional proficiency Polish Native or bilingual proficiency English Full professional proficiency Polish Native or bilingual proficiency English Full professional proficiency Polish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Process Improvement Project Management Strategy Business Process... Business Strategy Program Management Customer Service Mergers & Acquisitions Financial Analysis Finance Business Analysis Cross-functional Team... Skills  Process Improvement Project Management Strategy Business Process... Business Strategy Program Management Customer Service Mergers & Acquisitions Financial Analysis Finance Business Analysis Cross-functional Team... Process Improvement Project Management Strategy Business Process... Business Strategy Program Management Customer Service Mergers & Acquisitions Financial Analysis Finance Business Analysis Cross-functional Team... Process Improvement Project Management Strategy Business Process... Business Strategy Program Management Customer Service Mergers & Acquisitions Financial Analysis Finance Business Analysis Cross-functional Team... Education Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 Akademia Ekonomiczna im. Oskara Langego we Wrocławiu Master's degree 1999  – 2004 ", "Experience M&A Finance Integration Senior Analyst Google April 2015  – Present (5 months) Finance Operations Analyst Google September 2008  – Present (7 years) Advisory Associate PricewaterhouseCoopers July 2007  –  September 2008  (1 year 3 months) M&A Finance Integration Senior Analyst Google April 2015  – Present (5 months) M&A Finance Integration Senior Analyst Google April 2015  – Present (5 months) Finance Operations Analyst Google September 2008  – Present (7 years) Finance Operations Analyst Google September 2008  – Present (7 years) Advisory Associate PricewaterhouseCoopers July 2007  –  September 2008  (1 year 3 months) Advisory Associate PricewaterhouseCoopers July 2007  –  September 2008  (1 year 3 months) Education Santa Clara University BSc,  Accounting 2003  – 2007 Santa Clara University BSc,  Accounting 2003  – 2007 Santa Clara University BSc,  Accounting 2003  – 2007 Santa Clara University BSc,  Accounting 2003  – 2007 ", "Summary Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Summary Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Finance professional with hands-on experience in operations management; highly effective in quantitative analysis, process enhancement and project management. Experience Senior Finance Operations Analyst Integreon (Google Inc. Vendor) January 2015  – Present (8 months) San Francisco Bay Area - Manage payroll operations of Google’s company-wide 401K plan, including process execution, coordination with stakeholders, and managing external audits; \n \n- Ensure efficiency and fluidity in payroll operations by troubleshooting unexpected roadblocks, keeping process owners accountable, and providing policy guidelines when appropriate; \n \n- Facilitate weekly management meetings to discuss open projects and issues in ongoing operations - keep track of action items and follow up with point-persons on progress; \n \n- Translate operational needs into specs needed to create systems solutions - provide assistance in design, review and testing of such solutions; \n \n- Reviewed and redesigned a key funding process which reduced lead time by 24 hours, or 100% from the previous mark. Assistant Operations Manager (Operations Strategy) APM Terminals July 2012  –  December 2014  (2 years 6 months) Greater Los Angeles Area - Plan weekly cargo movement through a 380-acre facility that handles approximately 10% of all containerized trade in the US West Coast; \n \n- Implement cost controls on a $200M operating budget, by applying understanding of productivity statistics, contractual constraints, and dependencies between separate processes; \n \n- Produce actionable recommendations through analyses of operating data, drawn through Business Intelligence tools; \n \n- Help design and implement an overhaul of the process for delivering cargo to truckers, which increased hourly labor productivity by 15%. Supervisor, Financial Planning and Contracts Total Terminals International, LLC September 2006  –  July 2012  (5 years 11 months) - Evaluate the magnitude and quality of monthly earnings through analyses of key earnings ratios and cash flow from operations; \n \n- Negotiate service rates with customers and service providers on an annual basis, with a clear understanding of revenue and cost mechanics for the business; \n \n- Present any material expansion or capital investment plans for approval by the Board of Directors through appropriate measures of financial return; \n \n- Develop annual budgets exceeding $500M in revenue for company’s portfolio of marine terminals, and forecast EBITDA on a quarterly and annual basis; \n \n- Implement a long-term strategic plan to increase annual EBITDA earnings by $30M, in transitioning company from a cost-center into a profit center; \n \n- Help devise and execute a $340M minority interest sale of the company, through close communication with stakeholders across the globe, and production of key financial models and boilerplate documents. Senior Finance Operations Analyst Integreon (Google Inc. Vendor) January 2015  – Present (8 months) San Francisco Bay Area - Manage payroll operations of Google’s company-wide 401K plan, including process execution, coordination with stakeholders, and managing external audits; \n \n- Ensure efficiency and fluidity in payroll operations by troubleshooting unexpected roadblocks, keeping process owners accountable, and providing policy guidelines when appropriate; \n \n- Facilitate weekly management meetings to discuss open projects and issues in ongoing operations - keep track of action items and follow up with point-persons on progress; \n \n- Translate operational needs into specs needed to create systems solutions - provide assistance in design, review and testing of such solutions; \n \n- Reviewed and redesigned a key funding process which reduced lead time by 24 hours, or 100% from the previous mark. Senior Finance Operations Analyst Integreon (Google Inc. Vendor) January 2015  – Present (8 months) San Francisco Bay Area - Manage payroll operations of Google’s company-wide 401K plan, including process execution, coordination with stakeholders, and managing external audits; \n \n- Ensure efficiency and fluidity in payroll operations by troubleshooting unexpected roadblocks, keeping process owners accountable, and providing policy guidelines when appropriate; \n \n- Facilitate weekly management meetings to discuss open projects and issues in ongoing operations - keep track of action items and follow up with point-persons on progress; \n \n- Translate operational needs into specs needed to create systems solutions - provide assistance in design, review and testing of such solutions; \n \n- Reviewed and redesigned a key funding process which reduced lead time by 24 hours, or 100% from the previous mark. Assistant Operations Manager (Operations Strategy) APM Terminals July 2012  –  December 2014  (2 years 6 months) Greater Los Angeles Area - Plan weekly cargo movement through a 380-acre facility that handles approximately 10% of all containerized trade in the US West Coast; \n \n- Implement cost controls on a $200M operating budget, by applying understanding of productivity statistics, contractual constraints, and dependencies between separate processes; \n \n- Produce actionable recommendations through analyses of operating data, drawn through Business Intelligence tools; \n \n- Help design and implement an overhaul of the process for delivering cargo to truckers, which increased hourly labor productivity by 15%. Assistant Operations Manager (Operations Strategy) APM Terminals July 2012  –  December 2014  (2 years 6 months) Greater Los Angeles Area - Plan weekly cargo movement through a 380-acre facility that handles approximately 10% of all containerized trade in the US West Coast; \n \n- Implement cost controls on a $200M operating budget, by applying understanding of productivity statistics, contractual constraints, and dependencies between separate processes; \n \n- Produce actionable recommendations through analyses of operating data, drawn through Business Intelligence tools; \n \n- Help design and implement an overhaul of the process for delivering cargo to truckers, which increased hourly labor productivity by 15%. Supervisor, Financial Planning and Contracts Total Terminals International, LLC September 2006  –  July 2012  (5 years 11 months) - Evaluate the magnitude and quality of monthly earnings through analyses of key earnings ratios and cash flow from operations; \n \n- Negotiate service rates with customers and service providers on an annual basis, with a clear understanding of revenue and cost mechanics for the business; \n \n- Present any material expansion or capital investment plans for approval by the Board of Directors through appropriate measures of financial return; \n \n- Develop annual budgets exceeding $500M in revenue for company’s portfolio of marine terminals, and forecast EBITDA on a quarterly and annual basis; \n \n- Implement a long-term strategic plan to increase annual EBITDA earnings by $30M, in transitioning company from a cost-center into a profit center; \n \n- Help devise and execute a $340M minority interest sale of the company, through close communication with stakeholders across the globe, and production of key financial models and boilerplate documents. Supervisor, Financial Planning and Contracts Total Terminals International, LLC September 2006  –  July 2012  (5 years 11 months) - Evaluate the magnitude and quality of monthly earnings through analyses of key earnings ratios and cash flow from operations; \n \n- Negotiate service rates with customers and service providers on an annual basis, with a clear understanding of revenue and cost mechanics for the business; \n \n- Present any material expansion or capital investment plans for approval by the Board of Directors through appropriate measures of financial return; \n \n- Develop annual budgets exceeding $500M in revenue for company’s portfolio of marine terminals, and forecast EBITDA on a quarterly and annual basis; \n \n- Implement a long-term strategic plan to increase annual EBITDA earnings by $30M, in transitioning company from a cost-center into a profit center; \n \n- Help devise and execute a $340M minority interest sale of the company, through close communication with stakeholders across the globe, and production of key financial models and boilerplate documents. Languages Korean Korean Korean Skills Oracle E-Business Suite Business Planning Contract Management Financial Analysis Financial Reporting Business Objects Financial Audits Budget Setting Budget Monitoring Logistics Management Operations Management Supply Chain Management Supply Chain Operations Budgets Analysis Skills  Oracle E-Business Suite Business Planning Contract Management Financial Analysis Financial Reporting Business Objects Financial Audits Budget Setting Budget Monitoring Logistics Management Operations Management Supply Chain Management Supply Chain Operations Budgets Analysis Oracle E-Business Suite Business Planning Contract Management Financial Analysis Financial Reporting Business Objects Financial Audits Budget Setting Budget Monitoring Logistics Management Operations Management Supply Chain Management Supply Chain Operations Budgets Analysis Oracle E-Business Suite Business Planning Contract Management Financial Analysis Financial Reporting Business Objects Financial Audits Budget Setting Budget Monitoring Logistics Management Operations Management Supply Chain Management Supply Chain Operations Budgets Analysis Education UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 California State University-Long Beach Global Logistics Specialist,  Logistics , Materials, and Supply Chain Management 2008  – 2009 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 UCLA Anderson School of Management Master of Business Administration (M.B.A.) 2011  – 2014 California State University-Long Beach Global Logistics Specialist,  Logistics , Materials, and Supply Chain Management 2008  – 2009 California State University-Long Beach Global Logistics Specialist,  Logistics , Materials, and Supply Chain Management 2008  – 2009 California State University-Long Beach Global Logistics Specialist,  Logistics , Materials, and Supply Chain Management 2008  – 2009 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  Economics 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 University of California, Los Angeles Bachelor's degree,  International Development Studies 2002  – 2006 ", "Experience Program Manager - Finance Ops Google October 2013  – Present (1 year 11 months) Mountain View, California Finance Operations Analyst Google January 2011  –  October 2013  (2 years 10 months) Mountain View, CA Assistant Manager II Comerica Bank April 2009  –  January 2011  (1 year 10 months) Assistant Manager I Comerica Bank May 2008  –  April 2009  (1 year) Management Trainee Comerica Bank June 2007  –  May 2008  (1 year) Account Coordinator Intern BBDO Detroit May 2006  –  August 2006  (4 months) Program Manager - Finance Ops Google October 2013  – Present (1 year 11 months) Mountain View, California Program Manager - Finance Ops Google October 2013  – Present (1 year 11 months) Mountain View, California Finance Operations Analyst Google January 2011  –  October 2013  (2 years 10 months) Mountain View, CA Finance Operations Analyst Google January 2011  –  October 2013  (2 years 10 months) Mountain View, CA Assistant Manager II Comerica Bank April 2009  –  January 2011  (1 year 10 months) Assistant Manager II Comerica Bank April 2009  –  January 2011  (1 year 10 months) Assistant Manager I Comerica Bank May 2008  –  April 2009  (1 year) Assistant Manager I Comerica Bank May 2008  –  April 2009  (1 year) Management Trainee Comerica Bank June 2007  –  May 2008  (1 year) Management Trainee Comerica Bank June 2007  –  May 2008  (1 year) Account Coordinator Intern BBDO Detroit May 2006  –  August 2006  (4 months) Account Coordinator Intern BBDO Detroit May 2006  –  August 2006  (4 months) Skills Marketing Social Media Marketing Social Media Advertising Account Management Customer Service Sales Digital Marketing Microsoft Excel Management Training Banking New Business Development Forecasting Team Building Skills  Marketing Social Media Marketing Social Media Advertising Account Management Customer Service Sales Digital Marketing Microsoft Excel Management Training Banking New Business Development Forecasting Team Building Marketing Social Media Marketing Social Media Advertising Account Management Customer Service Sales Digital Marketing Microsoft Excel Management Training Banking New Business Development Forecasting Team Building Marketing Social Media Marketing Social Media Advertising Account Management Customer Service Sales Digital Marketing Microsoft Excel Management Training Banking New Business Development Forecasting Team Building Education Michigan State University B.A. 2003  – 2007 Lakeland High School 1999  – 2003 Michigan State University B.A. 2003  – 2007 Michigan State University B.A. 2003  – 2007 Michigan State University B.A. 2003  – 2007 Lakeland High School 1999  – 2003 Lakeland High School 1999  – 2003 Lakeland High School 1999  – 2003 ", "Summary Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Summary Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Specialties: Product Management, Strategy consulting, project management, OTC operations, economic analysis, conjoint surveys, professional writing, payments industry, development economics Experience Product Manager Google September 2012  – Present (3 years) Mountain View, CA Ads & Commerce Group, Ads platforms (9/14-present) \nAds & Commerce Group, Payments (9/12-9/14) Finance Operations Analyst II Google, Inc. January 2011  –  September 2012  (1 year 9 months) Mountain View, CA Product Group lead for Display, GIO Team Research Analyst OECD August 2010  –  December 2010  (5 months) Paris, France Future Global Shocks project Senior Associate The Parthenon Group September 2007  –  September 2009  (2 years 1 month) Greater Boston Area Senior Associate in corporate strategy, education, and private equity practices at boutique consulting firm. Editor Let's Go Travel Guides, Inc. April 2005  –  September 2007  (2 years 6 months) Cambridge, Massachusetts Editor of Ireland 2008 and Associate Editor of Australia 2007 Product Manager Google September 2012  – Present (3 years) Mountain View, CA Ads & Commerce Group, Ads platforms (9/14-present) \nAds & Commerce Group, Payments (9/12-9/14) Product Manager Google September 2012  – Present (3 years) Mountain View, CA Ads & Commerce Group, Ads platforms (9/14-present) \nAds & Commerce Group, Payments (9/12-9/14) Finance Operations Analyst II Google, Inc. January 2011  –  September 2012  (1 year 9 months) Mountain View, CA Product Group lead for Display, GIO Team Finance Operations Analyst II Google, Inc. January 2011  –  September 2012  (1 year 9 months) Mountain View, CA Product Group lead for Display, GIO Team Research Analyst OECD August 2010  –  December 2010  (5 months) Paris, France Future Global Shocks project Research Analyst OECD August 2010  –  December 2010  (5 months) Paris, France Future Global Shocks project Senior Associate The Parthenon Group September 2007  –  September 2009  (2 years 1 month) Greater Boston Area Senior Associate in corporate strategy, education, and private equity practices at boutique consulting firm. Senior Associate The Parthenon Group September 2007  –  September 2009  (2 years 1 month) Greater Boston Area Senior Associate in corporate strategy, education, and private equity practices at boutique consulting firm. Editor Let's Go Travel Guides, Inc. April 2005  –  September 2007  (2 years 6 months) Cambridge, Massachusetts Editor of Ireland 2008 and Associate Editor of Australia 2007 Editor Let's Go Travel Guides, Inc. April 2005  –  September 2007  (2 years 6 months) Cambridge, Massachusetts Editor of Ireland 2008 and Associate Editor of Australia 2007 Languages English Native or bilingual proficiency Spanish English Native or bilingual proficiency Spanish English Native or bilingual proficiency Spanish Native or bilingual proficiency Skills Economics Management Consulting Project Management Development Economics Professional Writing Financial Modeling Strategy Analytics Market Research Data Analysis Stata Operations Management International Finance Business Process... Team Management Competitive Analysis Product Management Entrepreneurship Business Strategy See 4+     See less Skills  Economics Management Consulting Project Management Development Economics Professional Writing Financial Modeling Strategy Analytics Market Research Data Analysis Stata Operations Management International Finance Business Process... Team Management Competitive Analysis Product Management Entrepreneurship Business Strategy See 4+     See less Economics Management Consulting Project Management Development Economics Professional Writing Financial Modeling Strategy Analytics Market Research Data Analysis Stata Operations Management International Finance Business Process... Team Management Competitive Analysis Product Management Entrepreneurship Business Strategy See 4+     See less Economics Management Consulting Project Management Development Economics Professional Writing Financial Modeling Strategy Analytics Market Research Data Analysis Stata Operations Management International Finance Business Process... Team Management Competitive Analysis Product Management Entrepreneurship Business Strategy See 4+     See less Education University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Xavier High School High School 1999  – 2003 University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club University of Oxford M.Sc.,  Economics 2009  – 2010 Research interests include: political economy of aid, game theory, global capital flows, environmental economics Activities and Societies:  MCR Executive Committee ,  Exeter College Boat Club Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Harvard University A.B.,  Economics 2003  – 2007 Graduated Cum Laude on Advanced Course Track in Economics; Citation in Spanish Language from Department of Romance Languages; Published in Harvard College Economist Activities and Societies:  Harvard Crimson ,  Habitat for Humanity International ,  Harvard Civics Teaching Program ,  Harvard College Marathon Team Xavier High School High School 1999  – 2003 Xavier High School High School 1999  – 2003 Xavier High School High School 1999  – 2003 Honors & Awards ", "Languages English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Google Adwords Google Analytics Digital Marketing Online Advertising New Media Social Media Marketing Social Media Advertising Marketing Management Journalism Online Marketing PPC SEM Mobile Marketing Process Improvement Digital Strategy Digital Media E-commerce Project Management Web Analytics See 5+     See less Skills  Google Adwords Google Analytics Digital Marketing Online Advertising New Media Social Media Marketing Social Media Advertising Marketing Management Journalism Online Marketing PPC SEM Mobile Marketing Process Improvement Digital Strategy Digital Media E-commerce Project Management Web Analytics See 5+     See less Google Adwords Google Analytics Digital Marketing Online Advertising New Media Social Media Marketing Social Media Advertising Marketing Management Journalism Online Marketing PPC SEM Mobile Marketing Process Improvement Digital Strategy Digital Media E-commerce Project Management Web Analytics See 5+     See less Google Adwords Google Analytics Digital Marketing Online Advertising New Media Social Media Marketing Social Media Advertising Marketing Management Journalism Online Marketing PPC SEM Mobile Marketing Process Improvement Digital Strategy Digital Media E-commerce Project Management Web Analytics See 5+     See less ", "Experience Finance Operations Analyst II Google October 2012  – Present (2 years 11 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. AdSense Team lead Google October 2010  – Present (4 years 11 months) Specializing in AdSense payments and platform operations AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Finance Operations Analyst II Google October 2012  – Present (2 years 11 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. Finance Operations Analyst II Google October 2012  – Present (2 years 11 months) To boldly go where no payment has gone before!! Rolling out our new billing and payments platform globally, bringing new forms of payment, ease of use to our global publisher base and simplifying our ads products disbursement cycle.  \n \nI also enjoy a nice pair of slacks and have many leather bound books. AdSense Team lead Google October 2010  – Present (4 years 11 months) Specializing in AdSense payments and platform operations AdSense Team lead Google October 2010  – Present (4 years 11 months) Specializing in AdSense payments and platform operations AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Account Strategist Google November 2008  –  October 2010  (2 years) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Senior Associate Google July 2007  –  November 2008  (1 year 5 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) AdSense Account Associate Google January 2006  –  June 2007  (1 year 6 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Account Coordinator Google June 2005  –  January 2006  (8 months) Skills Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Skills  Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Project Management Vendor Management E-commerce Online Advertising Digital Marketing Web Analytics Google Analytics Community Management SEO Online Gaming Product Management Analytics Web Project Management Mobile Devices Google Adwords Adsense Online Marketing PPC See 3+     See less Education University College Cork MBS,  E-Business and Commerce 2003  – 2005 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University College Cork MBS,  E-Business and Commerce 2003  – 2005 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 University of Limerick BTech,  Information Technology & Telecommunications 1999  – 2003 Honors & Awards ", "Experience Finance Operations Analyst - Emerging Business and Acquisitions Google August 2006  – Present (9 years 1 month) Credit Analyst McKesson July 2004  –  August 2006  (2 years 2 months) Finance Operations Analyst - Emerging Business and Acquisitions Google August 2006  – Present (9 years 1 month) Finance Operations Analyst - Emerging Business and Acquisitions Google August 2006  – Present (9 years 1 month) Credit Analyst McKesson July 2004  –  August 2006  (2 years 2 months) Credit Analyst McKesson July 2004  –  August 2006  (2 years 2 months) Education Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 Suffolk University - Sawyer Business School Bachelors,  Finance 2000  – 2004 ", "Experience Finance operations analyst Google February 2011  – Present (4 years 7 months) Adjointe puis Chef de bureau (1BE) Ministère du Budget January 2008  –  December 2010  (3 years) - Prévision des dépenses de l’Etat \n- Redéploiement des moyens pour financer les besoins nouveaux et aléas de gestion \n- Echanges avec la Cour des comptes dans le cadre de la certification des comptes de l'Etat Finance operations analyst Google February 2011  – Present (4 years 7 months) Finance operations analyst Google February 2011  – Present (4 years 7 months) Adjointe puis Chef de bureau (1BE) Ministère du Budget January 2008  –  December 2010  (3 years) - Prévision des dépenses de l’Etat \n- Redéploiement des moyens pour financer les besoins nouveaux et aléas de gestion \n- Echanges avec la Cour des comptes dans le cadre de la certification des comptes de l'Etat Adjointe puis Chef de bureau (1BE) Ministère du Budget January 2008  –  December 2010  (3 years) - Prévision des dépenses de l’Etat \n- Redéploiement des moyens pour financer les besoins nouveaux et aléas de gestion \n- Echanges avec la Cour des comptes dans le cadre de la certification des comptes de l'Etat Education ESSEC Business School 2000  – 2003 ESSEC Business School 2000  – 2003 ESSEC Business School 2000  – 2003 ESSEC Business School 2000  – 2003 ", "Experience TechHR Programs Specialist Google August 2011  – Present (4 years 1 month) Mountain View, CA Finance Operations Analyst - Collections Google January 2010  –  August 2011  (1 year 8 months) Mountain View, CA Finance Operations Specialist I - Billing & Payments Google June 2007  –  January 2010  (2 years 8 months) International Markets Research Assistant Marietta Investment Partners, LLC October 2006  –  May 2007  (8 months) TechHR Programs Specialist Google August 2011  – Present (4 years 1 month) Mountain View, CA TechHR Programs Specialist Google August 2011  – Present (4 years 1 month) Mountain View, CA Finance Operations Analyst - Collections Google January 2010  –  August 2011  (1 year 8 months) Mountain View, CA Finance Operations Analyst - Collections Google January 2010  –  August 2011  (1 year 8 months) Mountain View, CA Finance Operations Specialist I - Billing & Payments Google June 2007  –  January 2010  (2 years 8 months) Finance Operations Specialist I - Billing & Payments Google June 2007  –  January 2010  (2 years 8 months) International Markets Research Assistant Marietta Investment Partners, LLC October 2006  –  May 2007  (8 months) International Markets Research Assistant Marietta Investment Partners, LLC October 2006  –  May 2007  (8 months) Languages French French French Skills Google Adwords Human Resources Communication JavaScript AppsScript Finance Customer Service Program Management Invoicing Time Management SEM Management Google Analytics Web Analytics E-commerce Skills  Google Adwords Human Resources Communication JavaScript AppsScript Finance Customer Service Program Management Invoicing Time Management SEM Management Google Analytics Web Analytics E-commerce Google Adwords Human Resources Communication JavaScript AppsScript Finance Customer Service Program Management Invoicing Time Management SEM Management Google Analytics Web Analytics E-commerce Google Adwords Human Resources Communication JavaScript AppsScript Finance Customer Service Program Management Invoicing Time Management SEM Management Google Analytics Web Analytics E-commerce Education University of Notre Dame Bachelor 2002  – 2006 University College Dublin 2005  – 2005 University of Notre Dame Bachelor 2002  – 2006 University of Notre Dame Bachelor 2002  – 2006 University of Notre Dame Bachelor 2002  – 2006 University College Dublin 2005  – 2005 University College Dublin 2005  – 2005 University College Dublin 2005  – 2005 Honors & Awards Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List Additional Honors & Awards Cum Laude \nSigma Tau Delta English Honors Society \nDean's List ", "Summary Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Summary Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Analytical Lead at Google with 7+ years of experience in Finance / Accounting. Experience Senior Analytical Lead Google March 2014  – Present (1 year 6 months) Greater Los Angeles Area Senior Finance Operations Analyst Google July 2011  –  March 2014  (2 years 9 months) Mountain View, CA M&A Integration \nBudget planning and monthly accrual lead \nAd hoc Analysis \nProcess Improvement \nVendor Management MBA Finance Intern Google June 2010  –  August 2010  (3 months) Product Strategy Intern (LCE/LED TV) Samsung Electronics May 2010  –  June 2010  (2 months) Auditor (Internal & External) ParenteBeard, LLC October 2007  –  May 2009  (1 year 8 months) Accountant Dimensional Fund Advisors August 2005  –  August 2007  (2 years 1 month) Senior Analytical Lead Google March 2014  – Present (1 year 6 months) Greater Los Angeles Area Senior Analytical Lead Google March 2014  – Present (1 year 6 months) Greater Los Angeles Area Senior Finance Operations Analyst Google July 2011  –  March 2014  (2 years 9 months) Mountain View, CA M&A Integration \nBudget planning and monthly accrual lead \nAd hoc Analysis \nProcess Improvement \nVendor Management Senior Finance Operations Analyst Google July 2011  –  March 2014  (2 years 9 months) Mountain View, CA M&A Integration \nBudget planning and monthly accrual lead \nAd hoc Analysis \nProcess Improvement \nVendor Management MBA Finance Intern Google June 2010  –  August 2010  (3 months) MBA Finance Intern Google June 2010  –  August 2010  (3 months) Product Strategy Intern (LCE/LED TV) Samsung Electronics May 2010  –  June 2010  (2 months) Product Strategy Intern (LCE/LED TV) Samsung Electronics May 2010  –  June 2010  (2 months) Auditor (Internal & External) ParenteBeard, LLC October 2007  –  May 2009  (1 year 8 months) Auditor (Internal & External) ParenteBeard, LLC October 2007  –  May 2009  (1 year 8 months) Accountant Dimensional Fund Advisors August 2005  –  August 2007  (2 years 1 month) Accountant Dimensional Fund Advisors August 2005  –  August 2007  (2 years 1 month) Languages English Native or bilingual proficiency Korean Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Korean Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Korean Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Accounting Analysis Financial Modeling Valuation Private Equity Financial Analysis Finance Risk Management Business Strategy Skills  Accounting Analysis Financial Modeling Valuation Private Equity Financial Analysis Finance Risk Management Business Strategy Accounting Analysis Financial Modeling Valuation Private Equity Financial Analysis Finance Risk Management Business Strategy Accounting Analysis Financial Modeling Valuation Private Equity Financial Analysis Finance Risk Management Business Strategy Education Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club Cornell University - S.C. Johnson Graduate School of Management Master of Business Administration (MBA) 2009  – 2011 Activities and Societies:  Consultant ,  Big Red Incubator; Fellow ,  Big Red MicroCapital; VP ,  West Coast Club; Old Ezra Finance Club; General Management Club; Media & Entertainment Club; Healthcare & Biotechnology; Soccer Club University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 University of California, Berkeley B.A.,  Political Economy of Industrialized Societies 2001  – 2005 ", "Summary Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Summary Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Global process owner for financial processes, focused on defining, launching, and managing scalable, cost-efficient processes that generate $XYB in payment flows across 50+ countries. Experienced with ERP systems automation, process design, change management, and process reengineering in Payments and Corporate Cards. Experience Senior Finance Operations Analyst Google January 2014  – Present (1 year 8 months) Mountain View, CA Finance Operations Analyst Google July 2012  –  January 2014  (1 year 7 months) Mountain View, CA Finance Operations Graduate Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Associate - Strategy and Business Development (Citi Transaction Services) Citi July 2008  –  May 2010  (1 year 11 months) New York, NY Analyst - Product Management (Citi Transaction Services) Citi July 2006  –  July 2008  (2 years 1 month) New York, NY Senior Finance Operations Analyst Google January 2014  – Present (1 year 8 months) Mountain View, CA Senior Finance Operations Analyst Google January 2014  – Present (1 year 8 months) Mountain View, CA Finance Operations Analyst Google July 2012  –  January 2014  (1 year 7 months) Mountain View, CA Finance Operations Analyst Google July 2012  –  January 2014  (1 year 7 months) Mountain View, CA Finance Operations Graduate Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Finance Operations Graduate Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Associate - Strategy and Business Development (Citi Transaction Services) Citi July 2008  –  May 2010  (1 year 11 months) New York, NY Associate - Strategy and Business Development (Citi Transaction Services) Citi July 2008  –  May 2010  (1 year 11 months) New York, NY Analyst - Product Management (Citi Transaction Services) Citi July 2006  –  July 2008  (2 years 1 month) New York, NY Analyst - Product Management (Citi Transaction Services) Citi July 2006  –  July 2008  (2 years 1 month) New York, NY Skills Product Management Process Management Process Improvement Product Development Cross-functional... Market Analysis Competitive Intelligence Business Strategy Strategy Development Financial Analysis Financial Modeling Corporate Finance Financial Operations Finance Operations Procure to Pay Corporate Cards Commercial Cards Transaction Banking Transaction Services Finance Business Analysis Strategy Competitive Analysis Valuation Analytics See 10+     See less Skills  Product Management Process Management Process Improvement Product Development Cross-functional... Market Analysis Competitive Intelligence Business Strategy Strategy Development Financial Analysis Financial Modeling Corporate Finance Financial Operations Finance Operations Procure to Pay Corporate Cards Commercial Cards Transaction Banking Transaction Services Finance Business Analysis Strategy Competitive Analysis Valuation Analytics See 10+     See less Product Management Process Management Process Improvement Product Development Cross-functional... Market Analysis Competitive Intelligence Business Strategy Strategy Development Financial Analysis Financial Modeling Corporate Finance Financial Operations Finance Operations Procure to Pay Corporate Cards Commercial Cards Transaction Banking Transaction Services Finance Business Analysis Strategy Competitive Analysis Valuation Analytics See 10+     See less Product Management Process Management Process Improvement Product Development Cross-functional... Market Analysis Competitive Intelligence Business Strategy Strategy Development Financial Analysis Financial Modeling Corporate Finance Financial Operations Finance Operations Procure to Pay Corporate Cards Commercial Cards Transaction Banking Transaction Services Finance Business Analysis Strategy Competitive Analysis Valuation Analytics See 10+     See less Education University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 Cornell University Bachelor of Arts (BA) 2002  – 2006 University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 University of Southern California - Marshall School of Business Master of Business Administration (MBA) 2010  – 2012 Cornell University Bachelor of Arts (BA) 2002  – 2006 Cornell University Bachelor of Arts (BA) 2002  – 2006 Cornell University Bachelor of Arts (BA) 2002  – 2006 Honors & Awards National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 National Association of Asian MBAs Global Case Competition - Finalist National Association of Asian MBAs August 2011 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 Fellowship (Merit-Based) University of Southern California - Marshall School of Business April 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 President's Volunteer Service Award - Bronze Corporation for National and Community Service 2010 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 Outstanding contribution towards volunteerism Citi Asian Pacific Heritage Network - NYC 2009 "]}