{"position": "Global Online Advertising Associate", "company": "Google", "profiles": ["Experience Media & Entertainment Account Manager Google January 2011  –  October 2012  (1 year 10 months) AdWords, Entertainment and Media Global Online Advertising Associate Google November 2009  –  January 2011  (1 year 3 months) Paralegal Law In Order December 2008  –  May 2009  (6 months) Used high attention to detail and computer literacy to scan, code and manipulate legal documents as efficiently and accurately as possible. Marketing and Sales Assistant Hollowell Products Co. September 2008  –  October 2008  (2 months) I helped pull contact information for potential sales and followed up on Internet inquiries through a sales contact program called “ACT.” I also found new trade magazines for announcements and used independent thinking to suggest and help develop new Internet advertising methods. Account Executive Intern DDB September 2007  –  December 2007  (4 months) Closed client account forms, participated in meetings, edited brochures, pulled competitive ads from AdMango and placed them into competitive reports. From this experience, I also gained efficient time management skills due to tight deadlines. Interactive Media Intern Doner Advertising May 2007  –  August 2007  (4 months) Enhanced computer skills by continuously pulling, creating and editing summary by placement reports, executive summaries, insertion orders and creative analyses in online interactive programs such as Atlas, Mediaplex and ComScore. I learned valuable people skills by contacting clients and attending daily meetings with vendors interested in our business. I demonstrated teamwork when putting together reports and ideas with other co-workers. Search Marketing Assistant Plus1 Media September 2006  –  May 2007  (9 months) Strengthened online advertisement click-through-rates in top search engines by testing ads, analyzing results, and implementing changes. Also developed and tested different variables of company landing pages to increase conversion rates and ease of navigation. Through this time, I gained valuable skills relevant to the evolving Internet advertising industry. (Open) 1 recommendation Bryan Rahn Founder at Precision SEM Leah helped our company in our pay per click advertising and conversion rate optimization departments. She got hands on experience working with paid search, including Google, Yahoo SM and Bing. She was able to increase our ROI, and show results in... View Media & Entertainment Account Manager Google January 2011  –  October 2012  (1 year 10 months) AdWords, Entertainment and Media Media & Entertainment Account Manager Google January 2011  –  October 2012  (1 year 10 months) AdWords, Entertainment and Media Global Online Advertising Associate Google November 2009  –  January 2011  (1 year 3 months) Global Online Advertising Associate Google November 2009  –  January 2011  (1 year 3 months) Paralegal Law In Order December 2008  –  May 2009  (6 months) Used high attention to detail and computer literacy to scan, code and manipulate legal documents as efficiently and accurately as possible. Paralegal Law In Order December 2008  –  May 2009  (6 months) Used high attention to detail and computer literacy to scan, code and manipulate legal documents as efficiently and accurately as possible. Marketing and Sales Assistant Hollowell Products Co. September 2008  –  October 2008  (2 months) I helped pull contact information for potential sales and followed up on Internet inquiries through a sales contact program called “ACT.” I also found new trade magazines for announcements and used independent thinking to suggest and help develop new Internet advertising methods. Marketing and Sales Assistant Hollowell Products Co. September 2008  –  October 2008  (2 months) I helped pull contact information for potential sales and followed up on Internet inquiries through a sales contact program called “ACT.” I also found new trade magazines for announcements and used independent thinking to suggest and help develop new Internet advertising methods. Account Executive Intern DDB September 2007  –  December 2007  (4 months) Closed client account forms, participated in meetings, edited brochures, pulled competitive ads from AdMango and placed them into competitive reports. From this experience, I also gained efficient time management skills due to tight deadlines. Account Executive Intern DDB September 2007  –  December 2007  (4 months) Closed client account forms, participated in meetings, edited brochures, pulled competitive ads from AdMango and placed them into competitive reports. From this experience, I also gained efficient time management skills due to tight deadlines. Interactive Media Intern Doner Advertising May 2007  –  August 2007  (4 months) Enhanced computer skills by continuously pulling, creating and editing summary by placement reports, executive summaries, insertion orders and creative analyses in online interactive programs such as Atlas, Mediaplex and ComScore. I learned valuable people skills by contacting clients and attending daily meetings with vendors interested in our business. I demonstrated teamwork when putting together reports and ideas with other co-workers. Interactive Media Intern Doner Advertising May 2007  –  August 2007  (4 months) Enhanced computer skills by continuously pulling, creating and editing summary by placement reports, executive summaries, insertion orders and creative analyses in online interactive programs such as Atlas, Mediaplex and ComScore. I learned valuable people skills by contacting clients and attending daily meetings with vendors interested in our business. I demonstrated teamwork when putting together reports and ideas with other co-workers. Search Marketing Assistant Plus1 Media September 2006  –  May 2007  (9 months) Strengthened online advertisement click-through-rates in top search engines by testing ads, analyzing results, and implementing changes. Also developed and tested different variables of company landing pages to increase conversion rates and ease of navigation. Through this time, I gained valuable skills relevant to the evolving Internet advertising industry. (Open) 1 recommendation Bryan Rahn Founder at Precision SEM Leah helped our company in our pay per click advertising and conversion rate optimization departments. She got hands on experience working with paid search, including Google, Yahoo SM and Bing. She was able to increase our ROI, and show results in... View Search Marketing Assistant Plus1 Media September 2006  –  May 2007  (9 months) Strengthened online advertisement click-through-rates in top search engines by testing ads, analyzing results, and implementing changes. Also developed and tested different variables of company landing pages to increase conversion rates and ease of navigation. Through this time, I gained valuable skills relevant to the evolving Internet advertising industry. (Open) 1 recommendation Bryan Rahn Founder at Precision SEM Leah helped our company in our pay per click advertising and conversion rate optimization departments. She got hands on experience working with paid search, including Google, Yahoo SM and Bing. She was able to increase our ROI, and show results in... View Skills 12 Online Advertising 6 Google Adwords 4 Advertising 3 SEM 3 PPC 2 Google Analytics 1 Conversion Optimization 1 Yahoo Search Marketing Skills  12 Online Advertising 6 Google Adwords 4 Advertising 3 SEM 3 PPC 2 Google Analytics 1 Conversion Optimization 1 Yahoo Search Marketing 12 Online Advertising 6 Google Adwords 4 Advertising 3 SEM 3 PPC 2 Google Analytics 1 Conversion Optimization 1 Yahoo Search Marketing 12 Online Advertising 6 Google Adwords 4 Advertising 3 SEM 3 PPC 2 Google Analytics 1 Conversion Optimization 1 Yahoo Search Marketing                 Education The University of Hong Kong Journalism 2007  – 2008 Six-month study abroad program where I served an internship with DDB in addition to web media classes. University of Missouri-Columbia Bachelors,  Advertising ,  Journalism ,  Minor in Business 2004  – 2008 Honors College \nFor my Senior Capstone Project, I exercised teamwork with three other classmates to plan, budget, create and present a public relations campaign for the Missouri Department of Social Services’ Children’s Division. Activities and Societies:  Intensive English Program (IEP) Conversation Partner ,  Global Missouri Journalism Ambassador ,  University of Missouri Alternative Spring Break Site Leader ,  Jeollanamdo English Camp Activities Coordinator/Teacher ,  MU Disabilities Center Volunteer The University of Hong Kong Journalism 2007  – 2008 Six-month study abroad program where I served an internship with DDB in addition to web media classes. The University of Hong Kong Journalism 2007  – 2008 Six-month study abroad program where I served an internship with DDB in addition to web media classes. The University of Hong Kong Journalism 2007  – 2008 Six-month study abroad program where I served an internship with DDB in addition to web media classes. University of Missouri-Columbia Bachelors,  Advertising ,  Journalism ,  Minor in Business 2004  – 2008 Honors College \nFor my Senior Capstone Project, I exercised teamwork with three other classmates to plan, budget, create and present a public relations campaign for the Missouri Department of Social Services’ Children’s Division. Activities and Societies:  Intensive English Program (IEP) Conversation Partner ,  Global Missouri Journalism Ambassador ,  University of Missouri Alternative Spring Break Site Leader ,  Jeollanamdo English Camp Activities Coordinator/Teacher ,  MU Disabilities Center Volunteer University of Missouri-Columbia Bachelors,  Advertising ,  Journalism ,  Minor in Business 2004  – 2008 Honors College \nFor my Senior Capstone Project, I exercised teamwork with three other classmates to plan, budget, create and present a public relations campaign for the Missouri Department of Social Services’ Children’s Division. Activities and Societies:  Intensive English Program (IEP) Conversation Partner ,  Global Missouri Journalism Ambassador ,  University of Missouri Alternative Spring Break Site Leader ,  Jeollanamdo English Camp Activities Coordinator/Teacher ,  MU Disabilities Center Volunteer University of Missouri-Columbia Bachelors,  Advertising ,  Journalism ,  Minor in Business 2004  – 2008 Honors College \nFor my Senior Capstone Project, I exercised teamwork with three other classmates to plan, budget, create and present a public relations campaign for the Missouri Department of Social Services’ Children’s Division. Activities and Societies:  Intensive English Program (IEP) Conversation Partner ,  Global Missouri Journalism Ambassador ,  University of Missouri Alternative Spring Break Site Leader ,  Jeollanamdo English Camp Activities Coordinator/Teacher ,  MU Disabilities Center Volunteer ", "Experience Design Producer, Social UX Google February 2015  – Present (6 months) Community Manager, Project Fi Google September 2014  –  January 2015  (5 months) Community Manager, Search Google April 2012  –  August 2014  (2 years 5 months) Global Online Advertising Associate Google January 2010  –  May 2012  (2 years 5 months) Design Producer, Social UX Google February 2015  – Present (6 months) Design Producer, Social UX Google February 2015  – Present (6 months) Community Manager, Project Fi Google September 2014  –  January 2015  (5 months) Community Manager, Project Fi Google September 2014  –  January 2015  (5 months) Community Manager, Search Google April 2012  –  August 2014  (2 years 5 months) Community Manager, Search Google April 2012  –  August 2014  (2 years 5 months) Global Online Advertising Associate Google January 2010  –  May 2012  (2 years 5 months) Global Online Advertising Associate Google January 2010  –  May 2012  (2 years 5 months) Skills 13 Social Media 12 Online Advertising 5 Google Docs Skills  13 Social Media 12 Online Advertising 5 Google Docs 13 Social Media 12 Online Advertising 5 Google Docs 13 Social Media 12 Online Advertising 5 Google Docs       Education Bryn Mawr College A.B.,  Growth and Structure of Cities Senior Thesis: “A Place to Call Home: Visionary Downtown Projects in Las Vegas and Atlantic City” Activities and Societies:  Career Development Office Peer Mentoring ,  The College News Co-Editor ,  Growth and Structure of Cities Department Student Representative and TA University of California, Berkeley Post-Baccalaureate Certificate in Visual Arts 2013  – 2016 Stanford University Advanced Project Management Certificate 2013  – 2014 Hackbright Academy Software Engineering Fellowship 2014 Bryn Mawr College A.B.,  Growth and Structure of Cities Senior Thesis: “A Place to Call Home: Visionary Downtown Projects in Las Vegas and Atlantic City” Activities and Societies:  Career Development Office Peer Mentoring ,  The College News Co-Editor ,  Growth and Structure of Cities Department Student Representative and TA Bryn Mawr College A.B.,  Growth and Structure of Cities Senior Thesis: “A Place to Call Home: Visionary Downtown Projects in Las Vegas and Atlantic City” Activities and Societies:  Career Development Office Peer Mentoring ,  The College News Co-Editor ,  Growth and Structure of Cities Department Student Representative and TA Bryn Mawr College A.B.,  Growth and Structure of Cities Senior Thesis: “A Place to Call Home: Visionary Downtown Projects in Las Vegas and Atlantic City” Activities and Societies:  Career Development Office Peer Mentoring ,  The College News Co-Editor ,  Growth and Structure of Cities Department Student Representative and TA University of California, Berkeley Post-Baccalaureate Certificate in Visual Arts 2013  – 2016 University of California, Berkeley Post-Baccalaureate Certificate in Visual Arts 2013  – 2016 University of California, Berkeley Post-Baccalaureate Certificate in Visual Arts 2013  – 2016 Stanford University Advanced Project Management Certificate 2013  – 2014 Stanford University Advanced Project Management Certificate 2013  – 2014 Stanford University Advanced Project Management Certificate 2013  – 2014 Hackbright Academy Software Engineering Fellowship 2014 Hackbright Academy Software Engineering Fellowship 2014 Hackbright Academy Software Engineering Fellowship 2014 Honors & Awards ", "Summary As a payments and fraud expert, it's my job to where two hats: that of the fraudster, always thinking of new ways to attack an ecosystem - and that of the merchant, where stopping fraud is just one out of 100 tasks at hand.  \n \nAs a Product Manager, it has been my pleasure to explore the interconnected world of fraud operations, machine learning, risk mitigation, and product design. I have helped mitigate fraud across multiple verticals: from ads, to the sharing economy, to e-commerce and travel. I have learned the universal truths that tie fraud in these industries together, as well as the challenges that are unique to each of these business models.  \n \nGoing forward, my concentration is on building the most robust fraud mitigation platform available in the payments processing industry today. Concentrating on automation, the customer experience, and achieving the perfect balance between risk mitigation and conversion optimization. Summary As a payments and fraud expert, it's my job to where two hats: that of the fraudster, always thinking of new ways to attack an ecosystem - and that of the merchant, where stopping fraud is just one out of 100 tasks at hand.  \n \nAs a Product Manager, it has been my pleasure to explore the interconnected world of fraud operations, machine learning, risk mitigation, and product design. I have helped mitigate fraud across multiple verticals: from ads, to the sharing economy, to e-commerce and travel. I have learned the universal truths that tie fraud in these industries together, as well as the challenges that are unique to each of these business models.  \n \nGoing forward, my concentration is on building the most robust fraud mitigation platform available in the payments processing industry today. Concentrating on automation, the customer experience, and achieving the perfect balance between risk mitigation and conversion optimization. As a payments and fraud expert, it's my job to where two hats: that of the fraudster, always thinking of new ways to attack an ecosystem - and that of the merchant, where stopping fraud is just one out of 100 tasks at hand.  \n \nAs a Product Manager, it has been my pleasure to explore the interconnected world of fraud operations, machine learning, risk mitigation, and product design. I have helped mitigate fraud across multiple verticals: from ads, to the sharing economy, to e-commerce and travel. I have learned the universal truths that tie fraud in these industries together, as well as the challenges that are unique to each of these business models.  \n \nGoing forward, my concentration is on building the most robust fraud mitigation platform available in the payments processing industry today. Concentrating on automation, the customer experience, and achieving the perfect balance between risk mitigation and conversion optimization. As a payments and fraud expert, it's my job to where two hats: that of the fraudster, always thinking of new ways to attack an ecosystem - and that of the merchant, where stopping fraud is just one out of 100 tasks at hand.  \n \nAs a Product Manager, it has been my pleasure to explore the interconnected world of fraud operations, machine learning, risk mitigation, and product design. I have helped mitigate fraud across multiple verticals: from ads, to the sharing economy, to e-commerce and travel. I have learned the universal truths that tie fraud in these industries together, as well as the challenges that are unique to each of these business models.  \n \nGoing forward, my concentration is on building the most robust fraud mitigation platform available in the payments processing industry today. Concentrating on automation, the customer experience, and achieving the perfect balance between risk mitigation and conversion optimization. Experience Senior Product Manager - Risk & Fraud Adyen April 2015  – Present (4 months) Amsterdam Area, Netherlands As the Senior Product Manager for Risk and Fraud at Adyen, I am solely responsible for driving the vision of our risk mitigation solutions within the company. This requires me to wear lots of hats from day-to-day, but generally this entails the following tasks: \n- Establishing product road-maps and KPIs. \n- Maintaining a consistent vision and philosophy towards the product, ensuring that all cross-functional partners are in alignment with those goals. \n- Establishing, and maintaining, a marketing and sales philosophy towards the product. \n- Establishing, and continually improving, our pricing strategy, based on engagement data and customer feedback.  \n- Meeting face-to-face with current and prospective users to establish new development tasks and instill best practices.  \n Project Manager - Online Trust and Safety and Risk Airbnb July 2014  –  April 2015  (10 months) San Francisco Bay Area As a Project Manager in Online Trust and Safety and Risk at Airbnb, my primary focus is on reducing and automating our elimination of risk incidences across a wide spectrum of online risk vectors. In all, this include the following: \n \n•Establishing quarterly roadmaps for engineering and operationally driven projects in the online risk space. Writing Objectives and Key Results and ensuring follow through.  \n \n•Ensuring that communication across engineering, data science, and operations occurs in an effective and efficient way, resulting in quicker implementation of new workflows and continual improvement of processes and tools.  \n \n•Owning all projects within the online space, including account takeover mitigation, chargeback risk, fake inventory detection, phishing message thresholding, etc.  \n \n•Hiring additional project managers for our team - creating job reqs, phone screening, establishing interview challenges, etc. Technical Project Manager - Ads Quality/Risk Google September 2013  –  July 2014  (11 months) Mountain View, CA As a Technical Project Manager in Ads Quality Operations, my primary focus is to liaison the complex relationship between risk analysts, the engineering team we work with, and the infrastructure team that supports our efforts. This involves the following: \n \n•Writing and overseeing the technical objectives and key results between operations, engineering, and infrastructure groups, focusing on tackling new and persisting fraud trends on Google’s ad platforms. \n \n•Managing the entire development cycle of emerging workflows and tool rollouts amongst both Infrastructure and Operational groups, utilizing Scrum/Agile Development.  \n \n•Managing the development of a range of fraud prevention systems, including bank phishing models, analyst tools, cloaking detection systems, and machine-learning content classification models. \n \n•Interpreting large, SQL-based, data sets pertaining to fraud, in order to properly prioritize operational and engineering solutions to decrease fraud revenue impact and increase automation. \n \n•Working cross-functionally with other companies and fraud-related entities to integrate best practices, signals, and data-sharing pipelines. Ads Quality/Risk Strategist and North American Policy POC Google July 2012  –  September 2013  (1 year 3 months) Mountain View, CA I work to ensure that the ads on Google's network are high quality and ensure a positive experience for our users. I specialize in technical gaming and trend-based fraud prevention. \n \n•Perform as a strategist on a global policy and payment fraud enforcement team to identify and eliminate new fraud trends (personally responsible for over 40,000 customer reviews). \n \n•Work cross-functionally with partners in Engineering, Legal, Policy, Sales, and Operations. \n \n•Communicate extensively with Risk Engineering to develop new techniques and approaches to fight advanced gaming and cloaking. \n \n•Perform the duties of a locational POC - including project management, global consistency attainment, and partnerships with management on ensuring appropriate engineering focus. \n \n•Work as a POC for taking high-profile escalations from upper management, regulatory bodies, legal, and PR. \n \n•Specialize in developing new techniques to fight technical gaming and cloaking on our ad network. (Open) 1 honor or award Product Quality Operations Gold Award Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. View Global Online Advertising Associate - Policy/Fraud Specialist Google July 2011  –  July 2012  (1 year 1 month) Ann Arbor, MI The role involved troubleshooting technical and account management issues with mid-tier clients utilizing the AdWords advertising platform. My primary concentration was on fielding questions from customers impacted by or engaging in fraud on the ad network. Volunteer Counselor Badger Boys State, Inc. June 2006  –  June 2011  (5 years 1 month) Senior Product Manager - Risk & Fraud Adyen April 2015  – Present (4 months) Amsterdam Area, Netherlands As the Senior Product Manager for Risk and Fraud at Adyen, I am solely responsible for driving the vision of our risk mitigation solutions within the company. This requires me to wear lots of hats from day-to-day, but generally this entails the following tasks: \n- Establishing product road-maps and KPIs. \n- Maintaining a consistent vision and philosophy towards the product, ensuring that all cross-functional partners are in alignment with those goals. \n- Establishing, and maintaining, a marketing and sales philosophy towards the product. \n- Establishing, and continually improving, our pricing strategy, based on engagement data and customer feedback.  \n- Meeting face-to-face with current and prospective users to establish new development tasks and instill best practices.  \n Senior Product Manager - Risk & Fraud Adyen April 2015  – Present (4 months) Amsterdam Area, Netherlands As the Senior Product Manager for Risk and Fraud at Adyen, I am solely responsible for driving the vision of our risk mitigation solutions within the company. This requires me to wear lots of hats from day-to-day, but generally this entails the following tasks: \n- Establishing product road-maps and KPIs. \n- Maintaining a consistent vision and philosophy towards the product, ensuring that all cross-functional partners are in alignment with those goals. \n- Establishing, and maintaining, a marketing and sales philosophy towards the product. \n- Establishing, and continually improving, our pricing strategy, based on engagement data and customer feedback.  \n- Meeting face-to-face with current and prospective users to establish new development tasks and instill best practices.  \n Project Manager - Online Trust and Safety and Risk Airbnb July 2014  –  April 2015  (10 months) San Francisco Bay Area As a Project Manager in Online Trust and Safety and Risk at Airbnb, my primary focus is on reducing and automating our elimination of risk incidences across a wide spectrum of online risk vectors. In all, this include the following: \n \n•Establishing quarterly roadmaps for engineering and operationally driven projects in the online risk space. Writing Objectives and Key Results and ensuring follow through.  \n \n•Ensuring that communication across engineering, data science, and operations occurs in an effective and efficient way, resulting in quicker implementation of new workflows and continual improvement of processes and tools.  \n \n•Owning all projects within the online space, including account takeover mitigation, chargeback risk, fake inventory detection, phishing message thresholding, etc.  \n \n•Hiring additional project managers for our team - creating job reqs, phone screening, establishing interview challenges, etc. Project Manager - Online Trust and Safety and Risk Airbnb July 2014  –  April 2015  (10 months) San Francisco Bay Area As a Project Manager in Online Trust and Safety and Risk at Airbnb, my primary focus is on reducing and automating our elimination of risk incidences across a wide spectrum of online risk vectors. In all, this include the following: \n \n•Establishing quarterly roadmaps for engineering and operationally driven projects in the online risk space. Writing Objectives and Key Results and ensuring follow through.  \n \n•Ensuring that communication across engineering, data science, and operations occurs in an effective and efficient way, resulting in quicker implementation of new workflows and continual improvement of processes and tools.  \n \n•Owning all projects within the online space, including account takeover mitigation, chargeback risk, fake inventory detection, phishing message thresholding, etc.  \n \n•Hiring additional project managers for our team - creating job reqs, phone screening, establishing interview challenges, etc. Technical Project Manager - Ads Quality/Risk Google September 2013  –  July 2014  (11 months) Mountain View, CA As a Technical Project Manager in Ads Quality Operations, my primary focus is to liaison the complex relationship between risk analysts, the engineering team we work with, and the infrastructure team that supports our efforts. This involves the following: \n \n•Writing and overseeing the technical objectives and key results between operations, engineering, and infrastructure groups, focusing on tackling new and persisting fraud trends on Google’s ad platforms. \n \n•Managing the entire development cycle of emerging workflows and tool rollouts amongst both Infrastructure and Operational groups, utilizing Scrum/Agile Development.  \n \n•Managing the development of a range of fraud prevention systems, including bank phishing models, analyst tools, cloaking detection systems, and machine-learning content classification models. \n \n•Interpreting large, SQL-based, data sets pertaining to fraud, in order to properly prioritize operational and engineering solutions to decrease fraud revenue impact and increase automation. \n \n•Working cross-functionally with other companies and fraud-related entities to integrate best practices, signals, and data-sharing pipelines. Technical Project Manager - Ads Quality/Risk Google September 2013  –  July 2014  (11 months) Mountain View, CA As a Technical Project Manager in Ads Quality Operations, my primary focus is to liaison the complex relationship between risk analysts, the engineering team we work with, and the infrastructure team that supports our efforts. This involves the following: \n \n•Writing and overseeing the technical objectives and key results between operations, engineering, and infrastructure groups, focusing on tackling new and persisting fraud trends on Google’s ad platforms. \n \n•Managing the entire development cycle of emerging workflows and tool rollouts amongst both Infrastructure and Operational groups, utilizing Scrum/Agile Development.  \n \n•Managing the development of a range of fraud prevention systems, including bank phishing models, analyst tools, cloaking detection systems, and machine-learning content classification models. \n \n•Interpreting large, SQL-based, data sets pertaining to fraud, in order to properly prioritize operational and engineering solutions to decrease fraud revenue impact and increase automation. \n \n•Working cross-functionally with other companies and fraud-related entities to integrate best practices, signals, and data-sharing pipelines. Ads Quality/Risk Strategist and North American Policy POC Google July 2012  –  September 2013  (1 year 3 months) Mountain View, CA I work to ensure that the ads on Google's network are high quality and ensure a positive experience for our users. I specialize in technical gaming and trend-based fraud prevention. \n \n•Perform as a strategist on a global policy and payment fraud enforcement team to identify and eliminate new fraud trends (personally responsible for over 40,000 customer reviews). \n \n•Work cross-functionally with partners in Engineering, Legal, Policy, Sales, and Operations. \n \n•Communicate extensively with Risk Engineering to develop new techniques and approaches to fight advanced gaming and cloaking. \n \n•Perform the duties of a locational POC - including project management, global consistency attainment, and partnerships with management on ensuring appropriate engineering focus. \n \n•Work as a POC for taking high-profile escalations from upper management, regulatory bodies, legal, and PR. \n \n•Specialize in developing new techniques to fight technical gaming and cloaking on our ad network. (Open) 1 honor or award Product Quality Operations Gold Award Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. View Ads Quality/Risk Strategist and North American Policy POC Google July 2012  –  September 2013  (1 year 3 months) Mountain View, CA I work to ensure that the ads on Google's network are high quality and ensure a positive experience for our users. I specialize in technical gaming and trend-based fraud prevention. \n \n•Perform as a strategist on a global policy and payment fraud enforcement team to identify and eliminate new fraud trends (personally responsible for over 40,000 customer reviews). \n \n•Work cross-functionally with partners in Engineering, Legal, Policy, Sales, and Operations. \n \n•Communicate extensively with Risk Engineering to develop new techniques and approaches to fight advanced gaming and cloaking. \n \n•Perform the duties of a locational POC - including project management, global consistency attainment, and partnerships with management on ensuring appropriate engineering focus. \n \n•Work as a POC for taking high-profile escalations from upper management, regulatory bodies, legal, and PR. \n \n•Specialize in developing new techniques to fight technical gaming and cloaking on our ad network. (Open) 1 honor or award Product Quality Operations Gold Award Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. View Global Online Advertising Associate - Policy/Fraud Specialist Google July 2011  –  July 2012  (1 year 1 month) Ann Arbor, MI The role involved troubleshooting technical and account management issues with mid-tier clients utilizing the AdWords advertising platform. My primary concentration was on fielding questions from customers impacted by or engaging in fraud on the ad network. Global Online Advertising Associate - Policy/Fraud Specialist Google July 2011  –  July 2012  (1 year 1 month) Ann Arbor, MI The role involved troubleshooting technical and account management issues with mid-tier clients utilizing the AdWords advertising platform. My primary concentration was on fielding questions from customers impacted by or engaging in fraud on the ad network. Volunteer Counselor Badger Boys State, Inc. June 2006  –  June 2011  (5 years 1 month) Volunteer Counselor Badger Boys State, Inc. June 2006  –  June 2011  (5 years 1 month) Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 15 Online Advertising 13 Project Management 6 Risk Analysis 5 Social Media 5 Data Analysis 5 Management 4 Python 4 Policy 3 Google Adwords 2 SQL Brian also knows about... 2 Risk Assessment 2 Public Speaking 2 Java 1 Risk Analytics 1 Troubleshooting 1 Event Planning 1 Critical Thinking 1 Policy Development 1 Microsoft Office 1 Google Docs 1 Microsoft Excel 1 Advertising 1 Public Relations 0 Customer Support 0 Technical Support 0 Google Analytics See 1+     See less Skills  Top Skills 15 Online Advertising 13 Project Management 6 Risk Analysis 5 Social Media 5 Data Analysis 5 Management 4 Python 4 Policy 3 Google Adwords 2 SQL Brian also knows about... 2 Risk Assessment 2 Public Speaking 2 Java 1 Risk Analytics 1 Troubleshooting 1 Event Planning 1 Critical Thinking 1 Policy Development 1 Microsoft Office 1 Google Docs 1 Microsoft Excel 1 Advertising 1 Public Relations 0 Customer Support 0 Technical Support 0 Google Analytics See 1+     See less Top Skills 15 Online Advertising 13 Project Management 6 Risk Analysis 5 Social Media 5 Data Analysis 5 Management 4 Python 4 Policy 3 Google Adwords 2 SQL Brian also knows about... 2 Risk Assessment 2 Public Speaking 2 Java 1 Risk Analytics 1 Troubleshooting 1 Event Planning 1 Critical Thinking 1 Policy Development 1 Microsoft Office 1 Google Docs 1 Microsoft Excel 1 Advertising 1 Public Relations 0 Customer Support 0 Technical Support 0 Google Analytics See 1+     See less Top Skills 15 Online Advertising 13 Project Management 6 Risk Analysis 5 Social Media 5 Data Analysis 5 Management 4 Python 4 Policy 3 Google Adwords 2 SQL Brian also knows about... 2 Risk Assessment 2 Public Speaking 2 Java 1 Risk Analytics 1 Troubleshooting 1 Event Planning 1 Critical Thinking 1 Policy Development 1 Microsoft Office 1 Google Docs 1 Microsoft Excel 1 Advertising 1 Public Relations 0 Customer Support 0 Technical Support 0 Google Analytics See 1+     See less                     2 Risk Assessment 2 Public Speaking 2 Java 1 Risk Analytics 1 Troubleshooting 1 Event Planning 1 Critical Thinking 1 Policy Development 1 Microsoft Office 1 Google Docs 1 Microsoft Excel 1 Advertising 1 Public Relations 0 Customer Support 0 Technical Support 0 Google Analytics Education University of Wisconsin-Madison Bachelor of Science (B.S.),  Secondary Education - English 2006  – 2010 Herb Kohl Scholarship, PGA Scholarship, UW School of Education Scholarship, Women's Civic League Scholarship, Williams Bay High School Leadership Scholarship Activities and Societies:  Student WEA ,  Student Leadership Program ,  volunteer tutor ,  LGBT Leadership Program Williams Bay School District 2002  – 2006 University of Wisconsin-Madison Bachelor of Science (B.S.),  Secondary Education - English 2006  – 2010 Herb Kohl Scholarship, PGA Scholarship, UW School of Education Scholarship, Women's Civic League Scholarship, Williams Bay High School Leadership Scholarship Activities and Societies:  Student WEA ,  Student Leadership Program ,  volunteer tutor ,  LGBT Leadership Program University of Wisconsin-Madison Bachelor of Science (B.S.),  Secondary Education - English 2006  – 2010 Herb Kohl Scholarship, PGA Scholarship, UW School of Education Scholarship, Women's Civic League Scholarship, Williams Bay High School Leadership Scholarship Activities and Societies:  Student WEA ,  Student Leadership Program ,  volunteer tutor ,  LGBT Leadership Program University of Wisconsin-Madison Bachelor of Science (B.S.),  Secondary Education - English 2006  – 2010 Herb Kohl Scholarship, PGA Scholarship, UW School of Education Scholarship, Women's Civic League Scholarship, Williams Bay High School Leadership Scholarship Activities and Societies:  Student WEA ,  Student Leadership Program ,  volunteer tutor ,  LGBT Leadership Program Williams Bay School District 2002  – 2006 Williams Bay School District 2002  – 2006 Williams Bay School District 2002  – 2006 Honors & Awards Product Quality Operations Gold Award Google 2013 Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. Product Quality Operations Gold Award Google 2013 Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. Product Quality Operations Gold Award Google 2013 Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. Product Quality Operations Gold Award Google 2013 Received a global distinction award for my discovery and handling of a high-profile fraud case that impacted several cross-functional organizations across sales, operations, and engineering. ", "Experience Digital Marketing Strategist Thomson Reuters (FindLaw) July 2014  – Present (1 year 1 month) Sunnyvale, CA Accounts Manager/ e-Strategist Milestone Internet Marketing January 2012  –  July 2014  (2 years 7 months) Santa Clara, CA Global Online Advertising Associate (Contract Position) Google March 2011  –  December 2011  (10 months) Local Data Quality Analyst (Contract Position) Google July 2009  –  July 2010  (1 year 1 month) Marketing Coordinator Document Pros May 2007  –  November 2008  (1 year 7 months) (Open) 1 recommendation David Stanek California Soccer Solutions Jason is a dedicated and hard working individual, consistently looking for new challenges and creating marketing material that is second to none. Jason was instrumental in helping grow a small company into a successful business by managing website... View Account Coordinator Godbe Communications August 2006  –  May 2007  (10 months) Digital Marketing Strategist Thomson Reuters (FindLaw) July 2014  – Present (1 year 1 month) Sunnyvale, CA Digital Marketing Strategist Thomson Reuters (FindLaw) July 2014  – Present (1 year 1 month) Sunnyvale, CA Accounts Manager/ e-Strategist Milestone Internet Marketing January 2012  –  July 2014  (2 years 7 months) Santa Clara, CA Accounts Manager/ e-Strategist Milestone Internet Marketing January 2012  –  July 2014  (2 years 7 months) Santa Clara, CA Global Online Advertising Associate (Contract Position) Google March 2011  –  December 2011  (10 months) Global Online Advertising Associate (Contract Position) Google March 2011  –  December 2011  (10 months) Local Data Quality Analyst (Contract Position) Google July 2009  –  July 2010  (1 year 1 month) Local Data Quality Analyst (Contract Position) Google July 2009  –  July 2010  (1 year 1 month) Marketing Coordinator Document Pros May 2007  –  November 2008  (1 year 7 months) (Open) 1 recommendation David Stanek California Soccer Solutions Jason is a dedicated and hard working individual, consistently looking for new challenges and creating marketing material that is second to none. Jason was instrumental in helping grow a small company into a successful business by managing website... View Marketing Coordinator Document Pros May 2007  –  November 2008  (1 year 7 months) (Open) 1 recommendation David Stanek California Soccer Solutions Jason is a dedicated and hard working individual, consistently looking for new challenges and creating marketing material that is second to none. Jason was instrumental in helping grow a small company into a successful business by managing website... View Account Coordinator Godbe Communications August 2006  –  May 2007  (10 months) Account Coordinator Godbe Communications August 2006  –  May 2007  (10 months) Skills Top Skills 14 Google Analytics 8 Google Adwords 5 SEM 4 Web Analytics 3 PPC 3 SEO 3 Online Advertising 1 MSN AdCenter 1 Omniture 1 Social Networking Jason also knows about... 1 Facebook 1 WordPress 0 Dreamweaver 0 Photoshop 0 Illustrator 0 HTML 0 PHP 0 Drupal 0 Microsoft Office 0 jQuery 0 Online Marketing 0 Search Advertising 0 CMS 0 Keyword Advertising 0 Sponsored Search 0 Advertising Operations 0 Basecamp 0 Twitter 0 Facebook Marketing 0 Salesforce.com 0 Word Tracker 0 Github See 7+     See less Skills  Top Skills 14 Google Analytics 8 Google Adwords 5 SEM 4 Web Analytics 3 PPC 3 SEO 3 Online Advertising 1 MSN AdCenter 1 Omniture 1 Social Networking Jason also knows about... 1 Facebook 1 WordPress 0 Dreamweaver 0 Photoshop 0 Illustrator 0 HTML 0 PHP 0 Drupal 0 Microsoft Office 0 jQuery 0 Online Marketing 0 Search Advertising 0 CMS 0 Keyword Advertising 0 Sponsored Search 0 Advertising Operations 0 Basecamp 0 Twitter 0 Facebook Marketing 0 Salesforce.com 0 Word Tracker 0 Github See 7+     See less Top Skills 14 Google Analytics 8 Google Adwords 5 SEM 4 Web Analytics 3 PPC 3 SEO 3 Online Advertising 1 MSN AdCenter 1 Omniture 1 Social Networking Jason also knows about... 1 Facebook 1 WordPress 0 Dreamweaver 0 Photoshop 0 Illustrator 0 HTML 0 PHP 0 Drupal 0 Microsoft Office 0 jQuery 0 Online Marketing 0 Search Advertising 0 CMS 0 Keyword Advertising 0 Sponsored Search 0 Advertising Operations 0 Basecamp 0 Twitter 0 Facebook Marketing 0 Salesforce.com 0 Word Tracker 0 Github See 7+     See less Top Skills 14 Google Analytics 8 Google Adwords 5 SEM 4 Web Analytics 3 PPC 3 SEO 3 Online Advertising 1 MSN AdCenter 1 Omniture 1 Social Networking Jason also knows about... 1 Facebook 1 WordPress 0 Dreamweaver 0 Photoshop 0 Illustrator 0 HTML 0 PHP 0 Drupal 0 Microsoft Office 0 jQuery 0 Online Marketing 0 Search Advertising 0 CMS 0 Keyword Advertising 0 Sponsored Search 0 Advertising Operations 0 Basecamp 0 Twitter 0 Facebook Marketing 0 Salesforce.com 0 Word Tracker 0 Github See 7+     See less                     1 Facebook 1 WordPress 0 Dreamweaver 0 Photoshop 0 Illustrator 0 HTML 0 PHP 0 Drupal 0 Microsoft Office 0 jQuery 0 Online Marketing 0 Search Advertising 0 CMS 0 Keyword Advertising 0 Sponsored Search 0 Advertising Operations 0 Basecamp 0 Twitter 0 Facebook Marketing 0 Salesforce.com 0 Word Tracker 0 Github Education San Jose State University MS 2005  – 2008 University of Cincinnati BFA 1997  – 2002 San Jose State University MS 2005  – 2008 San Jose State University MS 2005  – 2008 San Jose State University MS 2005  – 2008 University of Cincinnati BFA 1997  – 2002 University of Cincinnati BFA 1997  – 2002 University of Cincinnati BFA 1997  – 2002 ", "Summary John Paul Photography website Edit Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers Edit Welcome to S3 Graphics - Create world-class graphics and video cores Edit HP - United States | Laptop Computers, Desktops , Printers, Servers and more Edit johnpauldavid_bizcard_JPP Edit johnpauldavid_bizcard_ISV_Evangelist Edit johnpauldavid_bizcard_JPP_backofcard Edit johnpauldavid_bizcard_MPM Edit johnpauldavid_bizcard_SQA_Engineer Edit SEE MORE SEE LESS Summary John Paul Photography website Edit Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers Edit Welcome to S3 Graphics - Create world-class graphics and video cores Edit HP - United States | Laptop Computers, Desktops , Printers, Servers and more Edit johnpauldavid_bizcard_JPP Edit johnpauldavid_bizcard_ISV_Evangelist Edit johnpauldavid_bizcard_JPP_backofcard Edit johnpauldavid_bizcard_MPM Edit johnpauldavid_bizcard_SQA_Engineer Edit SEE MORE SEE LESS   John Paul Photography website Edit Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers Edit Welcome to S3 Graphics - Create world-class graphics and video cores Edit HP - United States | Laptop Computers, Desktops , Printers, Servers and more Edit johnpauldavid_bizcard_JPP Edit johnpauldavid_bizcard_ISV_Evangelist Edit johnpauldavid_bizcard_JPP_backofcard Edit johnpauldavid_bizcard_MPM Edit johnpauldavid_bizcard_SQA_Engineer Edit John Paul Photography website Edit Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers Edit John Paul Photography website Edit John Paul Photography website  John Paul Photography website  Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers Edit Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers  Printroom: Web Storefronts, Online Sales, and Digital Printing for Professional Photographers  Welcome to S3 Graphics - Create world-class graphics and video cores Edit HP - United States | Laptop Computers, Desktops , Printers, Servers and more Edit johnpauldavid_bizcard_JPP Edit Welcome to S3 Graphics - Create world-class graphics and video cores Edit Welcome to S3 Graphics - Create world-class graphics and video cores  Welcome to S3 Graphics - Create world-class graphics and video cores  HP - United States | Laptop Computers, Desktops , Printers, Servers and more Edit HP - United States | Laptop Computers, Desktops , Printers, Servers and more  HP - United States | Laptop Computers, Desktops , Printers, Servers and more  johnpauldavid_bizcard_JPP Edit johnpauldavid_bizcard_JPP  johnpauldavid_bizcard_JPP  johnpauldavid_bizcard_ISV_Evangelist Edit johnpauldavid_bizcard_JPP_backofcard Edit johnpauldavid_bizcard_ISV_Evangelist Edit johnpauldavid_bizcard_ISV_Evangelist  johnpauldavid_bizcard_ISV_Evangelist  johnpauldavid_bizcard_JPP_backofcard Edit johnpauldavid_bizcard_JPP_backofcard  johnpauldavid_bizcard_JPP_backofcard  johnpauldavid_bizcard_MPM Edit johnpauldavid_bizcard_SQA_Engineer Edit johnpauldavid_bizcard_MPM Edit johnpauldavid_bizcard_MPM  johnpauldavid_bizcard_MPM  johnpauldavid_bizcard_SQA_Engineer Edit johnpauldavid_bizcard_SQA_Engineer  johnpauldavid_bizcard_SQA_Engineer  Skills Top Skills 16 Online Advertising 14 Marketing 14 Social Media Marketing 12 Advertising 11 Social Media 7 Product Marketing 7 Photography 6 Sales 5 Digital Photography 4 Google Adwords John Paul also knows about... 4 Social Networking 4 Online Marketing 3 Strategy 3 Photoshop 3 Image Editing 3 Salesforce.com 3 Event Management 3 Marketing Communications 2 Adobe Creative Suite 2 Strategic Partnerships 2 Product Management 2 Program Management 2 Facebook 2 Marketing Strategy 2 SEO 2 Management 2 Email Marketing 2 Digital Media 2 Digital Marketing 2 Multimedia 2 Video 2 PPC 1 Account Management 1 Business Development 1 SQA Team Test 1 Google Adwords... See 11+     See less Skills  Top Skills 16 Online Advertising 14 Marketing 14 Social Media Marketing 12 Advertising 11 Social Media 7 Product Marketing 7 Photography 6 Sales 5 Digital Photography 4 Google Adwords John Paul also knows about... 4 Social Networking 4 Online Marketing 3 Strategy 3 Photoshop 3 Image Editing 3 Salesforce.com 3 Event Management 3 Marketing Communications 2 Adobe Creative Suite 2 Strategic Partnerships 2 Product Management 2 Program Management 2 Facebook 2 Marketing Strategy 2 SEO 2 Management 2 Email Marketing 2 Digital Media 2 Digital Marketing 2 Multimedia 2 Video 2 PPC 1 Account Management 1 Business Development 1 SQA Team Test 1 Google Adwords... See 11+     See less Top Skills 16 Online Advertising 14 Marketing 14 Social Media Marketing 12 Advertising 11 Social Media 7 Product Marketing 7 Photography 6 Sales 5 Digital Photography 4 Google Adwords John Paul also knows about... 4 Social Networking 4 Online Marketing 3 Strategy 3 Photoshop 3 Image Editing 3 Salesforce.com 3 Event Management 3 Marketing Communications 2 Adobe Creative Suite 2 Strategic Partnerships 2 Product Management 2 Program Management 2 Facebook 2 Marketing Strategy 2 SEO 2 Management 2 Email Marketing 2 Digital Media 2 Digital Marketing 2 Multimedia 2 Video 2 PPC 1 Account Management 1 Business Development 1 SQA Team Test 1 Google Adwords... See 11+     See less Top Skills 16 Online Advertising 14 Marketing 14 Social Media Marketing 12 Advertising 11 Social Media 7 Product Marketing 7 Photography 6 Sales 5 Digital Photography 4 Google Adwords John Paul also knows about... 4 Social Networking 4 Online Marketing 3 Strategy 3 Photoshop 3 Image Editing 3 Salesforce.com 3 Event Management 3 Marketing Communications 2 Adobe Creative Suite 2 Strategic Partnerships 2 Product Management 2 Program Management 2 Facebook 2 Marketing Strategy 2 SEO 2 Management 2 Email Marketing 2 Digital Media 2 Digital Marketing 2 Multimedia 2 Video 2 PPC 1 Account Management 1 Business Development 1 SQA Team Test 1 Google Adwords... See 11+     See less                     4 Social Networking 4 Online Marketing 3 Strategy 3 Photoshop 3 Image Editing 3 Salesforce.com 3 Event Management 3 Marketing Communications 2 Adobe Creative Suite 2 Strategic Partnerships 2 Product Management 2 Program Management 2 Facebook 2 Marketing Strategy 2 SEO 2 Management 2 Email Marketing 2 Digital Media 2 Digital Marketing 2 Multimedia 2 Video 2 PPC 1 Account Management 1 Business Development 1 SQA Team Test 1 Google Adwords... ", "Summary I've been working in a sales and customer relationship development role for over a year and a half at Google. I've helped over 750 clients improve their online advertising campaigns so that they saw better results and more business leads flow in.  \n \nIt is a very rewarding experience to work with small and medium business owners that might not have the expertise nor the time to devote to running a successful ad campaign. When we can work together to understand their clientele's user psychology, and I can educate them on creative solutions to develop their business strategy, it becomes quite fun for both our parties when they see the results come in. Specialties:Marketing, Field Research, Data Analysis and Forecasting. \nGroup Projects, Sales, Product Management. Summary I've been working in a sales and customer relationship development role for over a year and a half at Google. I've helped over 750 clients improve their online advertising campaigns so that they saw better results and more business leads flow in.  \n \nIt is a very rewarding experience to work with small and medium business owners that might not have the expertise nor the time to devote to running a successful ad campaign. When we can work together to understand their clientele's user psychology, and I can educate them on creative solutions to develop their business strategy, it becomes quite fun for both our parties when they see the results come in. Specialties:Marketing, Field Research, Data Analysis and Forecasting. \nGroup Projects, Sales, Product Management. I've been working in a sales and customer relationship development role for over a year and a half at Google. I've helped over 750 clients improve their online advertising campaigns so that they saw better results and more business leads flow in.  \n \nIt is a very rewarding experience to work with small and medium business owners that might not have the expertise nor the time to devote to running a successful ad campaign. When we can work together to understand their clientele's user psychology, and I can educate them on creative solutions to develop their business strategy, it becomes quite fun for both our parties when they see the results come in. Specialties:Marketing, Field Research, Data Analysis and Forecasting. \nGroup Projects, Sales, Product Management. I've been working in a sales and customer relationship development role for over a year and a half at Google. I've helped over 750 clients improve their online advertising campaigns so that they saw better results and more business leads flow in.  \n \nIt is a very rewarding experience to work with small and medium business owners that might not have the expertise nor the time to devote to running a successful ad campaign. When we can work together to understand their clientele's user psychology, and I can educate them on creative solutions to develop their business strategy, it becomes quite fun for both our parties when they see the results come in. Specialties:Marketing, Field Research, Data Analysis and Forecasting. \nGroup Projects, Sales, Product Management. Experience Sales Manager Google October 2014  – Present (10 months) Managing the best sales team at Google. Consistently exceeding our quotas while helping our customers thrive and grow. Product Solutions Specialist Google October 2012  – Present (2 years 10 months) Product expert for Sales team in Social, Mobile, Youtube, and Display ads. Liaison between the Eng and Sales team, working to develop the ad platforms and improve the product, as well as to push forth company initiatives and reach aggressive targets. SMB Sales AdWords Strategist Google January 2012  –  December 2012  (1 year) Treated AdWords clients at scale to help develop their campaigns and direct more relevant and quality leads to their websites. Reactivated over 100 lapsed clients and helped them reach conversion goals as well as to drive revenue for our sales team by establishing long-term client relationships. Global Online Advertising Associate Google February 2011  –  December 2011  (11 months) Volunteer Greening Berkeley September 2008  –  March 2011  (2 years 7 months) Working on numerous projects including park renovation, landscaping, and construction on the Ohlone Greenway. Participated in creation of better public facilities for the North Berkeley community. \n \nRebuilding Together Oakland September-November 2008 \nRestoring inner city schools in Oakland. Building gardens, installing new equipment, painting exterior, organizing group efforts that led to efficient completion of projects. Community Outreach Intern Bay Localize 2011  –  2011  (less than a year) Lead Marketing Associate Rising Sun Energy Center January 2010  –  June 2010  (6 months) In charge of developing client relations and advertizing; networking with members of the Bay Area energy industry, supervising four interns; providing student training in the use of company tools and charting progress.  \nCreating customer presentations; improving company website; attending local environmental gatherings. Business Development Assistant Meritel Group, Inc October 2009  –  December 2009  (3 months) Conducted research on small-scale manufacturers with wider distribution potential; organized meetings to help add value to our clients' businesses; documented sales/cost data for future analysis.  \nSet up client meeting to discuss potential deals; identified client needs and provided constructive feedback on each party's requirements and goals to prepare the sales team and assure an agreeable contract. Industrial Engineering Intern Biokinetics Inc May 2007  –  July 2007  (3 months) Used AutoCAD to make schematics adjustments for new Genentech plant development; made red-line corrections to future building plans and implemented changes into P&IDs.  \nOrganized budget and payroll data; ordered necessary equipment for various projects.  \nChecked gas/air/water piping layout for consistency across plan diagrams, correcting discrepancies. Legal Library Assistant Heller Ehrman LLP May 2006  –  July 2006  (3 months) Collected data for information relevant to legal cases; created and organized databases. \nUpdated and organized catalog; conducted logistical work in planning and restructuring library system.  \nClassified fiscal data; responsible for budget for literary purchases. \n \nAccolades/Skills and Interests \nExperience in conducting surveys, doing field research, econometric and data analysis and forecasting. Sales Manager Google October 2014  – Present (10 months) Managing the best sales team at Google. Consistently exceeding our quotas while helping our customers thrive and grow. Sales Manager Google October 2014  – Present (10 months) Managing the best sales team at Google. Consistently exceeding our quotas while helping our customers thrive and grow. Product Solutions Specialist Google October 2012  – Present (2 years 10 months) Product expert for Sales team in Social, Mobile, Youtube, and Display ads. Liaison between the Eng and Sales team, working to develop the ad platforms and improve the product, as well as to push forth company initiatives and reach aggressive targets. Product Solutions Specialist Google October 2012  – Present (2 years 10 months) Product expert for Sales team in Social, Mobile, Youtube, and Display ads. Liaison between the Eng and Sales team, working to develop the ad platforms and improve the product, as well as to push forth company initiatives and reach aggressive targets. SMB Sales AdWords Strategist Google January 2012  –  December 2012  (1 year) Treated AdWords clients at scale to help develop their campaigns and direct more relevant and quality leads to their websites. Reactivated over 100 lapsed clients and helped them reach conversion goals as well as to drive revenue for our sales team by establishing long-term client relationships. SMB Sales AdWords Strategist Google January 2012  –  December 2012  (1 year) Treated AdWords clients at scale to help develop their campaigns and direct more relevant and quality leads to their websites. Reactivated over 100 lapsed clients and helped them reach conversion goals as well as to drive revenue for our sales team by establishing long-term client relationships. Global Online Advertising Associate Google February 2011  –  December 2011  (11 months) Global Online Advertising Associate Google February 2011  –  December 2011  (11 months) Volunteer Greening Berkeley September 2008  –  March 2011  (2 years 7 months) Working on numerous projects including park renovation, landscaping, and construction on the Ohlone Greenway. Participated in creation of better public facilities for the North Berkeley community. \n \nRebuilding Together Oakland September-November 2008 \nRestoring inner city schools in Oakland. Building gardens, installing new equipment, painting exterior, organizing group efforts that led to efficient completion of projects. Volunteer Greening Berkeley September 2008  –  March 2011  (2 years 7 months) Working on numerous projects including park renovation, landscaping, and construction on the Ohlone Greenway. Participated in creation of better public facilities for the North Berkeley community. \n \nRebuilding Together Oakland September-November 2008 \nRestoring inner city schools in Oakland. Building gardens, installing new equipment, painting exterior, organizing group efforts that led to efficient completion of projects. Community Outreach Intern Bay Localize 2011  –  2011  (less than a year) Community Outreach Intern Bay Localize 2011  –  2011  (less than a year) Lead Marketing Associate Rising Sun Energy Center January 2010  –  June 2010  (6 months) In charge of developing client relations and advertizing; networking with members of the Bay Area energy industry, supervising four interns; providing student training in the use of company tools and charting progress.  \nCreating customer presentations; improving company website; attending local environmental gatherings. Lead Marketing Associate Rising Sun Energy Center January 2010  –  June 2010  (6 months) In charge of developing client relations and advertizing; networking with members of the Bay Area energy industry, supervising four interns; providing student training in the use of company tools and charting progress.  \nCreating customer presentations; improving company website; attending local environmental gatherings. Business Development Assistant Meritel Group, Inc October 2009  –  December 2009  (3 months) Conducted research on small-scale manufacturers with wider distribution potential; organized meetings to help add value to our clients' businesses; documented sales/cost data for future analysis.  \nSet up client meeting to discuss potential deals; identified client needs and provided constructive feedback on each party's requirements and goals to prepare the sales team and assure an agreeable contract. Business Development Assistant Meritel Group, Inc October 2009  –  December 2009  (3 months) Conducted research on small-scale manufacturers with wider distribution potential; organized meetings to help add value to our clients' businesses; documented sales/cost data for future analysis.  \nSet up client meeting to discuss potential deals; identified client needs and provided constructive feedback on each party's requirements and goals to prepare the sales team and assure an agreeable contract. Industrial Engineering Intern Biokinetics Inc May 2007  –  July 2007  (3 months) Used AutoCAD to make schematics adjustments for new Genentech plant development; made red-line corrections to future building plans and implemented changes into P&IDs.  \nOrganized budget and payroll data; ordered necessary equipment for various projects.  \nChecked gas/air/water piping layout for consistency across plan diagrams, correcting discrepancies. Industrial Engineering Intern Biokinetics Inc May 2007  –  July 2007  (3 months) Used AutoCAD to make schematics adjustments for new Genentech plant development; made red-line corrections to future building plans and implemented changes into P&IDs.  \nOrganized budget and payroll data; ordered necessary equipment for various projects.  \nChecked gas/air/water piping layout for consistency across plan diagrams, correcting discrepancies. Legal Library Assistant Heller Ehrman LLP May 2006  –  July 2006  (3 months) Collected data for information relevant to legal cases; created and organized databases. \nUpdated and organized catalog; conducted logistical work in planning and restructuring library system.  \nClassified fiscal data; responsible for budget for literary purchases. \n \nAccolades/Skills and Interests \nExperience in conducting surveys, doing field research, econometric and data analysis and forecasting. Legal Library Assistant Heller Ehrman LLP May 2006  –  July 2006  (3 months) Collected data for information relevant to legal cases; created and organized databases. \nUpdated and organized catalog; conducted logistical work in planning and restructuring library system.  \nClassified fiscal data; responsible for budget for literary purchases. \n \nAccolades/Skills and Interests \nExperience in conducting surveys, doing field research, econometric and data analysis and forecasting. Languages Russian Italian Russian Italian Russian Italian Skills Top Skills 25 Online Advertising 20 Google Adwords 13 Marketing 11 Data Analysis 10 SEM 9 Google Analytics 5 Social Media 5 Advertising 4 Marketing Strategy 3 Business Development Felix also knows about... 2 PPC 2 Salesforce.com 2 Competitive Analysis 2 Product Management 1 Google Docs 1 Web Analytics 0 Field Research 0 Renewable Energy Skills  Top Skills 25 Online Advertising 20 Google Adwords 13 Marketing 11 Data Analysis 10 SEM 9 Google Analytics 5 Social Media 5 Advertising 4 Marketing Strategy 3 Business Development Felix also knows about... 2 PPC 2 Salesforce.com 2 Competitive Analysis 2 Product Management 1 Google Docs 1 Web Analytics 0 Field Research 0 Renewable Energy Top Skills 25 Online Advertising 20 Google Adwords 13 Marketing 11 Data Analysis 10 SEM 9 Google Analytics 5 Social Media 5 Advertising 4 Marketing Strategy 3 Business Development Felix also knows about... 2 PPC 2 Salesforce.com 2 Competitive Analysis 2 Product Management 1 Google Docs 1 Web Analytics 0 Field Research 0 Renewable Energy Top Skills 25 Online Advertising 20 Google Adwords 13 Marketing 11 Data Analysis 10 SEM 9 Google Analytics 5 Social Media 5 Advertising 4 Marketing Strategy 3 Business Development Felix also knows about... 2 PPC 2 Salesforce.com 2 Competitive Analysis 2 Product Management 1 Google Docs 1 Web Analytics 0 Field Research 0 Renewable Energy                     2 PPC 2 Salesforce.com 2 Competitive Analysis 2 Product Management 1 Google Docs 1 Web Analytics 0 Field Research 0 Renewable Energy Education University of California, Berkeley Bachelor of Arts,  Economics 2006  – 2010 SAT: 2170 (700 W/720 V/750 M), 760 (Math IIC), 780 (History), 750 (Chemistry) University of California, Berkeley Economics,  Economics ,  City Planning ,  Energy and Resources 2006  – 2009 Lowell High School 2002  – 2006 University of California, Berkeley Bachelor of Arts,  Economics 2006  – 2010 SAT: 2170 (700 W/720 V/750 M), 760 (Math IIC), 780 (History), 750 (Chemistry) University of California, Berkeley Bachelor of Arts,  Economics 2006  – 2010 SAT: 2170 (700 W/720 V/750 M), 760 (Math IIC), 780 (History), 750 (Chemistry) University of California, Berkeley Bachelor of Arts,  Economics 2006  – 2010 SAT: 2170 (700 W/720 V/750 M), 760 (Math IIC), 780 (History), 750 (Chemistry) University of California, Berkeley Economics,  Economics ,  City Planning ,  Energy and Resources 2006  – 2009 University of California, Berkeley Economics,  Economics ,  City Planning ,  Energy and Resources 2006  – 2009 University of California, Berkeley Economics,  Economics ,  City Planning ,  Energy and Resources 2006  – 2009 Lowell High School 2002  – 2006 Lowell High School 2002  – 2006 Lowell High School 2002  – 2006 ", "Summary www.twitter.com/rshirkhoda \nwww.about.me/rshirkhoda Summary www.twitter.com/rshirkhoda \nwww.about.me/rshirkhoda www.twitter.com/rshirkhoda \nwww.about.me/rshirkhoda www.twitter.com/rshirkhoda \nwww.about.me/rshirkhoda Experience Interim CEO Full Circle Fund July 2015  – Present (1 month) Full Circle Fund is an active network of professionals who leverage their time, talent and connections to help nonprofit organizations launch new initiatives, make a greater impact, and accelerate positive change in the Bay Area. Since being founded in 2000, FCF has raised $11 million, accelerated 100+ Bay Area nonprofits, and engaged hundreds of professionals in over 90,000 hours of service.  Full Circle Fund // 2014 Annual Report Edit K-12 Education Outreach Specialist Google June 2012  –  June 2015  (3 years 1 month) Grew and managed $2m annual grant and nonprofit consulting program called the RISE Awards. Responsible for funding 40+ organizations in 19 countries reaching 100,000+ girls & minorities through computer science outreach. Expanded program by creating and launching partnership fund that enables organizations to seek funding for collaboration on joint initiatives, removing barriers to financial resources and promoting positive sum output. Organized and hosted 3 day annual global conference, convening 125+ nonprofit leaders to share resources and create a community rooted in outreach, research and evaluation. Oversaw $3.5m team operating budget.  \n \n Google RISE Awards: Supporting Computer Science Education Globally Edit K-12 Education Outreach Coordinator Google April 2011  –  May 2012  (1 year 2 months) Mountain View, California Oversaw $350k grant-making program, responsible for awarding funding to 26 organizations in 13 countries. Developed and piloted University Ambassador program elevating students as community leaders through grassroots organized computer science outreach reaching 6,000 African youth. Supported outreach program to engage 175 U.S students with computer science through online learning; developed MOOC, organized newsletter, annual dinner, & YouTube brand channel. Goal of opening doors for students around the world by expanding access to quality teachers and helping inspire understanding of computer science.  \n Global Online Advertising Associate Google January 2010  –  March 2011  (1 year 3 months) Mountain View, California Effectively provided proactive consultative and optimization services to 150+ high value advertising Agencies quarterly driving over $1m annual incremental sales. Consistently developed and maintained a strong understanding of online advertising trends, specifically with the AdWords product. Business Analyst Target October 2008  –  January 2010  (1 year 4 months) Minneapolis, Minnesota Optimized financial planning including costs, supply chain expenses, and gross margin. Planned and forecasted sales at the item level for over 300 individual items across two floor pads. Managed shipment of inventory from overseas to 26 domestic warehouses and 1700 stores nationwide. Collaborated & negotiated with over 15 vendors to analyze trend and maximize bottom-line profit. Accountable for budgeting 96 million dollars of annual sales across four brand categories. (Open) 1 recommendation Joe Jost Vice President at AdTaxi Networks Roxy and I worked very closely together while at Target. As our individual classes oftentimes overlapped, our responsibilities demanded collaboration and complete transparency. Roxy was a great partner and possesses exceptional communication,... View IT Consultant University of Michigan Information Technology Central Services September 2007  –  April 2008  (8 months) Ann Arbor, Michigan Business Consultant BOND Business Organization and Development September 2006  –  January 2008  (1 year 5 months) Ann Arbor, Michigan International Education Advocate Dream Volunteers June 2007  –  December 2007  (7 months) Antigua, Guatemala (Open) 2 recommendations Carlos Alvarado Lead Buyer - Men's Grooming Roxana is not only amazing person in general, but also an amazing person to work with. As part of the University of Dreams... View Brian Buntz Executive Director - Dream Volunteers/Young Dreamer Network Roxana is incredibly bright, hard-working, dedicated, and positive. She brings enthusiasm, talent, excellent interpersonal... View Interim CEO Full Circle Fund July 2015  – Present (1 month) Full Circle Fund is an active network of professionals who leverage their time, talent and connections to help nonprofit organizations launch new initiatives, make a greater impact, and accelerate positive change in the Bay Area. Since being founded in 2000, FCF has raised $11 million, accelerated 100+ Bay Area nonprofits, and engaged hundreds of professionals in over 90,000 hours of service.  Full Circle Fund // 2014 Annual Report Edit Interim CEO Full Circle Fund July 2015  – Present (1 month) Full Circle Fund is an active network of professionals who leverage their time, talent and connections to help nonprofit organizations launch new initiatives, make a greater impact, and accelerate positive change in the Bay Area. Since being founded in 2000, FCF has raised $11 million, accelerated 100+ Bay Area nonprofits, and engaged hundreds of professionals in over 90,000 hours of service.  Full Circle Fund // 2014 Annual Report Edit Full Circle Fund // 2014 Annual Report Edit Full Circle Fund // 2014 Annual Report Edit Full Circle Fund // 2014 Annual Report  Full Circle Fund // 2014 Annual Report  K-12 Education Outreach Specialist Google June 2012  –  June 2015  (3 years 1 month) Grew and managed $2m annual grant and nonprofit consulting program called the RISE Awards. Responsible for funding 40+ organizations in 19 countries reaching 100,000+ girls & minorities through computer science outreach. Expanded program by creating and launching partnership fund that enables organizations to seek funding for collaboration on joint initiatives, removing barriers to financial resources and promoting positive sum output. Organized and hosted 3 day annual global conference, convening 125+ nonprofit leaders to share resources and create a community rooted in outreach, research and evaluation. Oversaw $3.5m team operating budget.  \n \n Google RISE Awards: Supporting Computer Science Education Globally Edit K-12 Education Outreach Specialist Google June 2012  –  June 2015  (3 years 1 month) Grew and managed $2m annual grant and nonprofit consulting program called the RISE Awards. Responsible for funding 40+ organizations in 19 countries reaching 100,000+ girls & minorities through computer science outreach. Expanded program by creating and launching partnership fund that enables organizations to seek funding for collaboration on joint initiatives, removing barriers to financial resources and promoting positive sum output. Organized and hosted 3 day annual global conference, convening 125+ nonprofit leaders to share resources and create a community rooted in outreach, research and evaluation. Oversaw $3.5m team operating budget.  \n \n Google RISE Awards: Supporting Computer Science Education Globally Edit Google RISE Awards: Supporting Computer Science Education Globally Edit Google RISE Awards: Supporting Computer Science Education Globally Edit Google RISE Awards: Supporting Computer Science Education Globally  Google RISE Awards: Supporting Computer Science Education Globally  K-12 Education Outreach Coordinator Google April 2011  –  May 2012  (1 year 2 months) Mountain View, California Oversaw $350k grant-making program, responsible for awarding funding to 26 organizations in 13 countries. Developed and piloted University Ambassador program elevating students as community leaders through grassroots organized computer science outreach reaching 6,000 African youth. Supported outreach program to engage 175 U.S students with computer science through online learning; developed MOOC, organized newsletter, annual dinner, & YouTube brand channel. Goal of opening doors for students around the world by expanding access to quality teachers and helping inspire understanding of computer science.  \n K-12 Education Outreach Coordinator Google April 2011  –  May 2012  (1 year 2 months) Mountain View, California Oversaw $350k grant-making program, responsible for awarding funding to 26 organizations in 13 countries. Developed and piloted University Ambassador program elevating students as community leaders through grassroots organized computer science outreach reaching 6,000 African youth. Supported outreach program to engage 175 U.S students with computer science through online learning; developed MOOC, organized newsletter, annual dinner, & YouTube brand channel. Goal of opening doors for students around the world by expanding access to quality teachers and helping inspire understanding of computer science.  \n Global Online Advertising Associate Google January 2010  –  March 2011  (1 year 3 months) Mountain View, California Effectively provided proactive consultative and optimization services to 150+ high value advertising Agencies quarterly driving over $1m annual incremental sales. Consistently developed and maintained a strong understanding of online advertising trends, specifically with the AdWords product. Global Online Advertising Associate Google January 2010  –  March 2011  (1 year 3 months) Mountain View, California Effectively provided proactive consultative and optimization services to 150+ high value advertising Agencies quarterly driving over $1m annual incremental sales. Consistently developed and maintained a strong understanding of online advertising trends, specifically with the AdWords product. Business Analyst Target October 2008  –  January 2010  (1 year 4 months) Minneapolis, Minnesota Optimized financial planning including costs, supply chain expenses, and gross margin. Planned and forecasted sales at the item level for over 300 individual items across two floor pads. Managed shipment of inventory from overseas to 26 domestic warehouses and 1700 stores nationwide. Collaborated & negotiated with over 15 vendors to analyze trend and maximize bottom-line profit. Accountable for budgeting 96 million dollars of annual sales across four brand categories. (Open) 1 recommendation Joe Jost Vice President at AdTaxi Networks Roxy and I worked very closely together while at Target. As our individual classes oftentimes overlapped, our responsibilities demanded collaboration and complete transparency. Roxy was a great partner and possesses exceptional communication,... View Business Analyst Target October 2008  –  January 2010  (1 year 4 months) Minneapolis, Minnesota Optimized financial planning including costs, supply chain expenses, and gross margin. Planned and forecasted sales at the item level for over 300 individual items across two floor pads. Managed shipment of inventory from overseas to 26 domestic warehouses and 1700 stores nationwide. Collaborated & negotiated with over 15 vendors to analyze trend and maximize bottom-line profit. Accountable for budgeting 96 million dollars of annual sales across four brand categories. (Open) 1 recommendation Joe Jost Vice President at AdTaxi Networks Roxy and I worked very closely together while at Target. As our individual classes oftentimes overlapped, our responsibilities demanded collaboration and complete transparency. Roxy was a great partner and possesses exceptional communication,... View IT Consultant University of Michigan Information Technology Central Services September 2007  –  April 2008  (8 months) Ann Arbor, Michigan IT Consultant University of Michigan Information Technology Central Services September 2007  –  April 2008  (8 months) Ann Arbor, Michigan Business Consultant BOND Business Organization and Development September 2006  –  January 2008  (1 year 5 months) Ann Arbor, Michigan Business Consultant BOND Business Organization and Development September 2006  –  January 2008  (1 year 5 months) Ann Arbor, Michigan International Education Advocate Dream Volunteers June 2007  –  December 2007  (7 months) Antigua, Guatemala (Open) 2 recommendations Carlos Alvarado Lead Buyer - Men's Grooming Roxana is not only amazing person in general, but also an amazing person to work with. As part of the University of Dreams... View Brian Buntz Executive Director - Dream Volunteers/Young Dreamer Network Roxana is incredibly bright, hard-working, dedicated, and positive. She brings enthusiasm, talent, excellent interpersonal... View International Education Advocate Dream Volunteers June 2007  –  December 2007  (7 months) Antigua, Guatemala (Open) 2 recommendations Carlos Alvarado Lead Buyer - Men's Grooming Roxana is not only amazing person in general, but also an amazing person to work with. As part of the University of Dreams... View Brian Buntz Executive Director - Dream Volunteers/Young Dreamer Network Roxana is incredibly bright, hard-working, dedicated, and positive. She brings enthusiasm, talent, excellent interpersonal... View Languages English Native or bilingual proficiency Persian/Farsi Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Persian/Farsi Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Persian/Farsi Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Top Skills 35 Online Advertising 29 Management 24 Nonprofits 21 Google Adwords 16 Community Outreach 13 Competitive Analysis 13 Program Management 13 Social Media 12 Leadership 11 Strategic Planning Roxana also knows about... 9 Marketing 9 Google Analytics 8 Event Management 8 Analysis 8 Data Analysis 5 Sales 5 Business Strategy 5 Advertising 3 Budgets 2 Educational Outreach 2 Student Outreach 2 SEO 1 Nonprofit Consultancy 1 Grants 1 Computer Science 0 Grant Management 0 Computer Science... 0 STEM Education See 3+     See less Skills  Top Skills 35 Online Advertising 29 Management 24 Nonprofits 21 Google Adwords 16 Community Outreach 13 Competitive Analysis 13 Program Management 13 Social Media 12 Leadership 11 Strategic Planning Roxana also knows about... 9 Marketing 9 Google Analytics 8 Event Management 8 Analysis 8 Data Analysis 5 Sales 5 Business Strategy 5 Advertising 3 Budgets 2 Educational Outreach 2 Student Outreach 2 SEO 1 Nonprofit Consultancy 1 Grants 1 Computer Science 0 Grant Management 0 Computer Science... 0 STEM Education See 3+     See less Top Skills 35 Online Advertising 29 Management 24 Nonprofits 21 Google Adwords 16 Community Outreach 13 Competitive Analysis 13 Program Management 13 Social Media 12 Leadership 11 Strategic Planning Roxana also knows about... 9 Marketing 9 Google Analytics 8 Event Management 8 Analysis 8 Data Analysis 5 Sales 5 Business Strategy 5 Advertising 3 Budgets 2 Educational Outreach 2 Student Outreach 2 SEO 1 Nonprofit Consultancy 1 Grants 1 Computer Science 0 Grant Management 0 Computer Science... 0 STEM Education See 3+     See less Top Skills 35 Online Advertising 29 Management 24 Nonprofits 21 Google Adwords 16 Community Outreach 13 Competitive Analysis 13 Program Management 13 Social Media 12 Leadership 11 Strategic Planning Roxana also knows about... 9 Marketing 9 Google Analytics 8 Event Management 8 Analysis 8 Data Analysis 5 Sales 5 Business Strategy 5 Advertising 3 Budgets 2 Educational Outreach 2 Student Outreach 2 SEO 1 Nonprofit Consultancy 1 Grants 1 Computer Science 0 Grant Management 0 Computer Science... 0 STEM Education See 3+     See less                     9 Marketing 9 Google Analytics 8 Event Management 8 Analysis 8 Data Analysis 5 Sales 5 Business Strategy 5 Advertising 3 Budgets 2 Educational Outreach 2 Student Outreach 2 SEO 1 Nonprofit Consultancy 1 Grants 1 Computer Science 0 Grant Management 0 Computer Science... 0 STEM Education Education Stanford University Graduate School of Education Master of Education (M.Ed.),  Policy and Organizational Leadership 2016 Candidate for M.Ed. Expected graduation Summer 2016.  University of Michigan BA,  Communications Activities and Societies:  University of Michigan Mentorship Program\nMichigan Association of Communication Studies\nFuture Business Leaders of America – Phi Beta Lambda: Tested first in MI ,  qualified nationally for Management Analysis & Decision Making. (Open) 1 recommendation Mika Carter Senior eBusiness, Digital & Social Media Marketing Professional As a Graduate Student Instructor at the University of Michigan, I taught Roxana in the Communication Studies department. Roxana showed natural leadership ability, a strong work ethic and a vibrant personality. I have no doubt that Roxana will... View Stanford University Graduate School of Education Master of Education (M.Ed.),  Policy and Organizational Leadership 2016 Candidate for M.Ed. Expected graduation Summer 2016.  Stanford University Graduate School of Education Master of Education (M.Ed.),  Policy and Organizational Leadership 2016 Candidate for M.Ed. Expected graduation Summer 2016.  Stanford University Graduate School of Education Master of Education (M.Ed.),  Policy and Organizational Leadership 2016 Candidate for M.Ed. Expected graduation Summer 2016.  University of Michigan BA,  Communications Activities and Societies:  University of Michigan Mentorship Program\nMichigan Association of Communication Studies\nFuture Business Leaders of America – Phi Beta Lambda: Tested first in MI ,  qualified nationally for Management Analysis & Decision Making. (Open) 1 recommendation Mika Carter Senior eBusiness, Digital & Social Media Marketing Professional As a Graduate Student Instructor at the University of Michigan, I taught Roxana in the Communication Studies department. Roxana showed natural leadership ability, a strong work ethic and a vibrant personality. I have no doubt that Roxana will... View University of Michigan BA,  Communications Activities and Societies:  University of Michigan Mentorship Program\nMichigan Association of Communication Studies\nFuture Business Leaders of America – Phi Beta Lambda: Tested first in MI ,  qualified nationally for Management Analysis & Decision Making. (Open) 1 recommendation Mika Carter Senior eBusiness, Digital & Social Media Marketing Professional As a Graduate Student Instructor at the University of Michigan, I taught Roxana in the Communication Studies department. Roxana showed natural leadership ability, a strong work ethic and a vibrant personality. I have no doubt that Roxana will... View University of Michigan BA,  Communications Activities and Societies:  University of Michigan Mentorship Program\nMichigan Association of Communication Studies\nFuture Business Leaders of America – Phi Beta Lambda: Tested first in MI ,  qualified nationally for Management Analysis & Decision Making. (Open) 1 recommendation Mika Carter Senior eBusiness, Digital & Social Media Marketing Professional As a Graduate Student Instructor at the University of Michigan, I taught Roxana in the Communication Studies department. Roxana showed natural leadership ability, a strong work ethic and a vibrant personality. I have no doubt that Roxana will... View Honors & Awards Additional Honors & Awards University of Michigan Honors \nJames B. Angell Scholar Additional Honors & Awards University of Michigan Honors \nJames B. Angell Scholar Additional Honors & Awards University of Michigan Honors \nJames B. Angell Scholar Additional Honors & Awards University of Michigan Honors \nJames B. Angell Scholar ", "Experience Enterprise Customer Success Manager Reputation.com July 2014  – Present (1 year 1 month) Account Specialist Indeed.com March 2012  –  February 2014  (2 years) San Mateo Managing pay per click campaigns on Indeed's search engine. Help clients measure their success and ROI from Indeed, and see the value of their Indeed investment as compared with other sites/sources. Identify and consult with clients on optimization and growth opportunities. Increase revenue and retention rate for my accounts. Lead Larger Opportunity segment by recognizing and retaining relationships from our high spending clients. Assist with new client setup. Diagnose and solve technical problems. (Open) 1 recommendation Cyndi Hicks Senior Client Support Specialist at Indeed I had the pleasure of working with Jackie at Indeed.com for a year and a half, and I can say Jackie is truly a stand out employee. I was constantly impressed with Jackie's adaptability, handling any situation or circumstance that was thrown her... View Global Online Advertising Associate Google February 2011  –  December 2011  (11 months) Maintained a high volume call center for new AdWords advertisers globally. Streamlined  \naccounts for new advertisers by offering suggestions on optimization and providing feedback to  \ninquiries. Proactively responded to incoming calls from clients and performed immediate  \nconsultation. Input content of phone calls into data base and followed up via email when  \nnecessary. Researched accounts and consulted specialist teams on issues in need of  \nescalation. Marketing Coordinator Google May 2010  –  December 2010  (8 months) Mountain View Effectively managed a team of photographers in various geographic locations by scheduling photo shoots, routing daily travel and tracking activity. Educated new and existing business owners on the advantages gained with the Google Business Photos product. Frequently followed up with clients with updates and gathered feedback to maintain healthy relationships. Consistently exceeded weekly call volume sales quotas and established myself as a very respectful and helpful member of the Innerspace team. Merchandise Representative Coty Prestige September 2006  –  May 2010  (3 years 9 months) Daly City, Ca Exhibited various lines of fragrance to customers to reach weekly sales goals. Organized and executed monthly events to present all fragrance lines. Showcased new lines by using creative and unique strategies to appeal to the targeted demographic. Enterprise Customer Success Manager Reputation.com July 2014  – Present (1 year 1 month) Enterprise Customer Success Manager Reputation.com July 2014  – Present (1 year 1 month) Account Specialist Indeed.com March 2012  –  February 2014  (2 years) San Mateo Managing pay per click campaigns on Indeed's search engine. Help clients measure their success and ROI from Indeed, and see the value of their Indeed investment as compared with other sites/sources. Identify and consult with clients on optimization and growth opportunities. Increase revenue and retention rate for my accounts. Lead Larger Opportunity segment by recognizing and retaining relationships from our high spending clients. Assist with new client setup. Diagnose and solve technical problems. (Open) 1 recommendation Cyndi Hicks Senior Client Support Specialist at Indeed I had the pleasure of working with Jackie at Indeed.com for a year and a half, and I can say Jackie is truly a stand out employee. I was constantly impressed with Jackie's adaptability, handling any situation or circumstance that was thrown her... View Account Specialist Indeed.com March 2012  –  February 2014  (2 years) San Mateo Managing pay per click campaigns on Indeed's search engine. Help clients measure their success and ROI from Indeed, and see the value of their Indeed investment as compared with other sites/sources. Identify and consult with clients on optimization and growth opportunities. Increase revenue and retention rate for my accounts. Lead Larger Opportunity segment by recognizing and retaining relationships from our high spending clients. Assist with new client setup. Diagnose and solve technical problems. (Open) 1 recommendation Cyndi Hicks Senior Client Support Specialist at Indeed I had the pleasure of working with Jackie at Indeed.com for a year and a half, and I can say Jackie is truly a stand out employee. I was constantly impressed with Jackie's adaptability, handling any situation or circumstance that was thrown her... View Global Online Advertising Associate Google February 2011  –  December 2011  (11 months) Maintained a high volume call center for new AdWords advertisers globally. Streamlined  \naccounts for new advertisers by offering suggestions on optimization and providing feedback to  \ninquiries. Proactively responded to incoming calls from clients and performed immediate  \nconsultation. Input content of phone calls into data base and followed up via email when  \nnecessary. Researched accounts and consulted specialist teams on issues in need of  \nescalation. Global Online Advertising Associate Google February 2011  –  December 2011  (11 months) Maintained a high volume call center for new AdWords advertisers globally. Streamlined  \naccounts for new advertisers by offering suggestions on optimization and providing feedback to  \ninquiries. Proactively responded to incoming calls from clients and performed immediate  \nconsultation. Input content of phone calls into data base and followed up via email when  \nnecessary. Researched accounts and consulted specialist teams on issues in need of  \nescalation. Marketing Coordinator Google May 2010  –  December 2010  (8 months) Mountain View Effectively managed a team of photographers in various geographic locations by scheduling photo shoots, routing daily travel and tracking activity. Educated new and existing business owners on the advantages gained with the Google Business Photos product. Frequently followed up with clients with updates and gathered feedback to maintain healthy relationships. Consistently exceeded weekly call volume sales quotas and established myself as a very respectful and helpful member of the Innerspace team. Marketing Coordinator Google May 2010  –  December 2010  (8 months) Mountain View Effectively managed a team of photographers in various geographic locations by scheduling photo shoots, routing daily travel and tracking activity. Educated new and existing business owners on the advantages gained with the Google Business Photos product. Frequently followed up with clients with updates and gathered feedback to maintain healthy relationships. Consistently exceeded weekly call volume sales quotas and established myself as a very respectful and helpful member of the Innerspace team. Merchandise Representative Coty Prestige September 2006  –  May 2010  (3 years 9 months) Daly City, Ca Exhibited various lines of fragrance to customers to reach weekly sales goals. Organized and executed monthly events to present all fragrance lines. Showcased new lines by using creative and unique strategies to appeal to the targeted demographic. Merchandise Representative Coty Prestige September 2006  –  May 2010  (3 years 9 months) Daly City, Ca Exhibited various lines of fragrance to customers to reach weekly sales goals. Organized and executed monthly events to present all fragrance lines. Showcased new lines by using creative and unique strategies to appeal to the targeted demographic. Skills Top Skills 31 Online Advertising 19 Salesforce.com 15 Marketing 14 Google Adwords 13 SEM 12 PPC 12 Social Media 12 Social Media Marketing 11 Facebook 6 Lead Generation Jacqueline also knows about... 5 Social Networking 3 Google Analytics 3 Account Management 3 Advertising 1 Digital Marketing 1 Client Services 0 Outlook 0 MySpace 0 Customer Support 0 Magazines 0 Web Marketing 0 Digital Media 0 CRM 0 Campaign management 0 ad operations Skills  Top Skills 31 Online Advertising 19 Salesforce.com 15 Marketing 14 Google Adwords 13 SEM 12 PPC 12 Social Media 12 Social Media Marketing 11 Facebook 6 Lead Generation Jacqueline also knows about... 5 Social Networking 3 Google Analytics 3 Account Management 3 Advertising 1 Digital Marketing 1 Client Services 0 Outlook 0 MySpace 0 Customer Support 0 Magazines 0 Web Marketing 0 Digital Media 0 CRM 0 Campaign management 0 ad operations Top Skills 31 Online Advertising 19 Salesforce.com 15 Marketing 14 Google Adwords 13 SEM 12 PPC 12 Social Media 12 Social Media Marketing 11 Facebook 6 Lead Generation Jacqueline also knows about... 5 Social Networking 3 Google Analytics 3 Account Management 3 Advertising 1 Digital Marketing 1 Client Services 0 Outlook 0 MySpace 0 Customer Support 0 Magazines 0 Web Marketing 0 Digital Media 0 CRM 0 Campaign management 0 ad operations Top Skills 31 Online Advertising 19 Salesforce.com 15 Marketing 14 Google Adwords 13 SEM 12 PPC 12 Social Media 12 Social Media Marketing 11 Facebook 6 Lead Generation Jacqueline also knows about... 5 Social Networking 3 Google Analytics 3 Account Management 3 Advertising 1 Digital Marketing 1 Client Services 0 Outlook 0 MySpace 0 Customer Support 0 Magazines 0 Web Marketing 0 Digital Media 0 CRM 0 Campaign management 0 ad operations                     5 Social Networking 3 Google Analytics 3 Account Management 3 Advertising 1 Digital Marketing 1 Client Services 0 Outlook 0 MySpace 0 Customer Support 0 Magazines 0 Web Marketing 0 Digital Media 0 CRM 0 Campaign management 0 ad operations Education San Francisco State University BA,  Journalism 2007  – 2010 (Open) 1 project American Graffiti Feature on graffiti writers for [X]press magazine View San Francisco State University BA,  Journalism 2007  – 2010 (Open) 1 project American Graffiti Feature on graffiti writers for [X]press magazine View San Francisco State University BA,  Journalism 2007  – 2010 (Open) 1 project American Graffiti Feature on graffiti writers for [X]press magazine View San Francisco State University BA,  Journalism 2007  – 2010 (Open) 1 project American Graffiti Feature on graffiti writers for [X]press magazine View ", "Experience Account Manager Google January 2013  – Present (2 years 7 months) San Francisco Bay Area Digital advertising and marketing consultant, specializing in performance branding and lead generation SMB Sales Account Strategist Google November 2012  –  December 2012  (2 months) Mountain View, CA Develop digital online marketing & media strategy for small to medium businesses. Global Online Advertising Associate Account Strategist Google July 2011  –  November 2012  (1 year 5 months) Mountain View, CA Assist small to medium businesses with the development and implementation of strategic advertising/marketing plans for online platforms (Open) 2 honors and awards Google Spot Bonus Awarded for collaborative efforts to help our sales teams meet targets for Q1.  View Business Impact Award Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record... View Office of Information Technology University of Notre Dame October 2009  –  August 2011  (1 year 11 months) South Bend, IN Customer Service, troubleshooting, assisting professors and students with technological related issues. Account Manager Google January 2013  – Present (2 years 7 months) San Francisco Bay Area Digital advertising and marketing consultant, specializing in performance branding and lead generation Account Manager Google January 2013  – Present (2 years 7 months) San Francisco Bay Area Digital advertising and marketing consultant, specializing in performance branding and lead generation SMB Sales Account Strategist Google November 2012  –  December 2012  (2 months) Mountain View, CA Develop digital online marketing & media strategy for small to medium businesses. SMB Sales Account Strategist Google November 2012  –  December 2012  (2 months) Mountain View, CA Develop digital online marketing & media strategy for small to medium businesses. Global Online Advertising Associate Account Strategist Google July 2011  –  November 2012  (1 year 5 months) Mountain View, CA Assist small to medium businesses with the development and implementation of strategic advertising/marketing plans for online platforms (Open) 2 honors and awards Google Spot Bonus Awarded for collaborative efforts to help our sales teams meet targets for Q1.  View Business Impact Award Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record... View Global Online Advertising Associate Account Strategist Google July 2011  –  November 2012  (1 year 5 months) Mountain View, CA Assist small to medium businesses with the development and implementation of strategic advertising/marketing plans for online platforms (Open) 2 honors and awards Google Spot Bonus Awarded for collaborative efforts to help our sales teams meet targets for Q1.  View Business Impact Award Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record... View Office of Information Technology University of Notre Dame October 2009  –  August 2011  (1 year 11 months) South Bend, IN Customer Service, troubleshooting, assisting professors and students with technological related issues. Office of Information Technology University of Notre Dame October 2009  –  August 2011  (1 year 11 months) South Bend, IN Customer Service, troubleshooting, assisting professors and students with technological related issues. Languages Spanish Spanish Spanish Skills Top Skills 26 Online Advertising 13 Social Media Marketing 13 Strategy 10 Google Adwords 10 Brand Management 9 Social Media 5 Marketing 4 Strategic Planning 4 Marketing Strategy 3 Data Analysis Molly also knows about... 3 Google Analytics 2 Event Planning 2 Sales 2 Marketing Communications 1 Facebook 1 Microsoft Office 1 PowerPoint 1 Marketing Research 1 SEM 0 Customer Service 0 HTML 0 XML 0 CSS 0 Dreamweaver 0 Access 0 Photoshop 0 People Skills 0 Organizational... 0 Team Leadership 0 Project Planning See 5+     See less Skills  Top Skills 26 Online Advertising 13 Social Media Marketing 13 Strategy 10 Google Adwords 10 Brand Management 9 Social Media 5 Marketing 4 Strategic Planning 4 Marketing Strategy 3 Data Analysis Molly also knows about... 3 Google Analytics 2 Event Planning 2 Sales 2 Marketing Communications 1 Facebook 1 Microsoft Office 1 PowerPoint 1 Marketing Research 1 SEM 0 Customer Service 0 HTML 0 XML 0 CSS 0 Dreamweaver 0 Access 0 Photoshop 0 People Skills 0 Organizational... 0 Team Leadership 0 Project Planning See 5+     See less Top Skills 26 Online Advertising 13 Social Media Marketing 13 Strategy 10 Google Adwords 10 Brand Management 9 Social Media 5 Marketing 4 Strategic Planning 4 Marketing Strategy 3 Data Analysis Molly also knows about... 3 Google Analytics 2 Event Planning 2 Sales 2 Marketing Communications 1 Facebook 1 Microsoft Office 1 PowerPoint 1 Marketing Research 1 SEM 0 Customer Service 0 HTML 0 XML 0 CSS 0 Dreamweaver 0 Access 0 Photoshop 0 People Skills 0 Organizational... 0 Team Leadership 0 Project Planning See 5+     See less Top Skills 26 Online Advertising 13 Social Media Marketing 13 Strategy 10 Google Adwords 10 Brand Management 9 Social Media 5 Marketing 4 Strategic Planning 4 Marketing Strategy 3 Data Analysis Molly also knows about... 3 Google Analytics 2 Event Planning 2 Sales 2 Marketing Communications 1 Facebook 1 Microsoft Office 1 PowerPoint 1 Marketing Research 1 SEM 0 Customer Service 0 HTML 0 XML 0 CSS 0 Dreamweaver 0 Access 0 Photoshop 0 People Skills 0 Organizational... 0 Team Leadership 0 Project Planning See 5+     See less                     3 Google Analytics 2 Event Planning 2 Sales 2 Marketing Communications 1 Facebook 1 Microsoft Office 1 PowerPoint 1 Marketing Research 1 SEM 0 Customer Service 0 HTML 0 XML 0 CSS 0 Dreamweaver 0 Access 0 Photoshop 0 People Skills 0 Organizational... 0 Team Leadership 0 Project Planning Education University of Notre Dame BA,  Psychology/ Computer Applications 2008  – 2011 Activities and Societies:  University of Notre Dame Cheerleading ,  Lewis Hall Section Representative ,  University of Notre Dame Equestrian Team (Freshman President) ,  Blankets for Babies Volunteer ,  Logan Center Volunteer ,  Yearbook Member. Dublin University of Notre Dame BA,  Psychology/ Computer Applications 2008  – 2011 Activities and Societies:  University of Notre Dame Cheerleading ,  Lewis Hall Section Representative ,  University of Notre Dame Equestrian Team (Freshman President) ,  Blankets for Babies Volunteer ,  Logan Center Volunteer ,  Yearbook Member. University of Notre Dame BA,  Psychology/ Computer Applications 2008  – 2011 Activities and Societies:  University of Notre Dame Cheerleading ,  Lewis Hall Section Representative ,  University of Notre Dame Equestrian Team (Freshman President) ,  Blankets for Babies Volunteer ,  Logan Center Volunteer ,  Yearbook Member. University of Notre Dame BA,  Psychology/ Computer Applications 2008  – 2011 Activities and Societies:  University of Notre Dame Cheerleading ,  Lewis Hall Section Representative ,  University of Notre Dame Equestrian Team (Freshman President) ,  Blankets for Babies Volunteer ,  Logan Center Volunteer ,  Yearbook Member. Dublin Dublin Dublin Honors & Awards Google Spot Bonus SMB Director of Sales December 2011 Awarded for collaborative efforts to help our sales teams meet targets for Q1.  Business Impact Award Welcome Team Managers December 2011 Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record for highest weekly & quarterly numbers. Additional Honors & Awards Google Gold Award \nGoogle Spot Bonus Award \nGoogle \"It\" Award \nGoogle Business Impact Award \nPeer Bonus Award \nUniversity of Notre Dame Dean's List \nMember of National Honors Society Google Spot Bonus SMB Director of Sales December 2011 Awarded for collaborative efforts to help our sales teams meet targets for Q1.  Google Spot Bonus SMB Director of Sales December 2011 Awarded for collaborative efforts to help our sales teams meet targets for Q1.  Google Spot Bonus SMB Director of Sales December 2011 Awarded for collaborative efforts to help our sales teams meet targets for Q1.  Business Impact Award Welcome Team Managers December 2011 Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record for highest weekly & quarterly numbers. Business Impact Award Welcome Team Managers December 2011 Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record for highest weekly & quarterly numbers. Business Impact Award Welcome Team Managers December 2011 Awarded for obtaining the highest sales numbers in North America for the new advertiser program. Set program level record for highest weekly & quarterly numbers. Additional Honors & Awards Google Gold Award \nGoogle Spot Bonus Award \nGoogle \"It\" Award \nGoogle Business Impact Award \nPeer Bonus Award \nUniversity of Notre Dame Dean's List \nMember of National Honors Society Additional Honors & Awards Google Gold Award \nGoogle Spot Bonus Award \nGoogle \"It\" Award \nGoogle Business Impact Award \nPeer Bonus Award \nUniversity of Notre Dame Dean's List \nMember of National Honors Society Additional Honors & Awards Google Gold Award \nGoogle Spot Bonus Award \nGoogle \"It\" Award \nGoogle Business Impact Award \nPeer Bonus Award \nUniversity of Notre Dame Dean's List \nMember of National Honors Society ", "Experience Partner Operations Specialist Google October 2012  – Present (2 years 10 months) Mountain View, CA Account Strategist Google May 2012  –  October 2012  (6 months) Mountain View, CA Global Online Advertising Associate Google August 2010  –  May 2012  (1 year 10 months) Partner Operations Specialist Google October 2012  – Present (2 years 10 months) Mountain View, CA Partner Operations Specialist Google October 2012  – Present (2 years 10 months) Mountain View, CA Account Strategist Google May 2012  –  October 2012  (6 months) Mountain View, CA Account Strategist Google May 2012  –  October 2012  (6 months) Mountain View, CA Global Online Advertising Associate Google August 2010  –  May 2012  (1 year 10 months) Global Online Advertising Associate Google August 2010  –  May 2012  (1 year 10 months) Skills 7 Google Adwords 6 Online Advertising 3 Google Analytics 3 SEM 3 Web Analytics Skills  7 Google Adwords 6 Online Advertising 3 Google Analytics 3 SEM 3 Web Analytics 7 Google Adwords 6 Online Advertising 3 Google Analytics 3 SEM 3 Web Analytics 7 Google Adwords 6 Online Advertising 3 Google Analytics 3 SEM 3 Web Analytics           Education Trinity College-Hartford BA,  Political Science 2006  – 2010 Activities and Societies:  Pi Kappa Alpha ,  The Fred Pfeil Community Project ,  The Office of Community Service and Civic Engagement ,  Habitat for Humanity ,  Honor Council Quincy High School Trinity College-Hartford BA,  Political Science 2006  – 2010 Activities and Societies:  Pi Kappa Alpha ,  The Fred Pfeil Community Project ,  The Office of Community Service and Civic Engagement ,  Habitat for Humanity ,  Honor Council Trinity College-Hartford BA,  Political Science 2006  – 2010 Activities and Societies:  Pi Kappa Alpha ,  The Fred Pfeil Community Project ,  The Office of Community Service and Civic Engagement ,  Habitat for Humanity ,  Honor Council Trinity College-Hartford BA,  Political Science 2006  – 2010 Activities and Societies:  Pi Kappa Alpha ,  The Fred Pfeil Community Project ,  The Office of Community Service and Civic Engagement ,  Habitat for Humanity ,  Honor Council Quincy High School Quincy High School Quincy High School Honors & Awards Additional Honors & Awards Phi Beta Kappa, Pi Gamma Mu, Honors in General Scholarship, Trinity College Presidential Scholarship Additional Honors & Awards Phi Beta Kappa, Pi Gamma Mu, Honors in General Scholarship, Trinity College Presidential Scholarship Additional Honors & Awards Phi Beta Kappa, Pi Gamma Mu, Honors in General Scholarship, Trinity College Presidential Scholarship Additional Honors & Awards Phi Beta Kappa, Pi Gamma Mu, Honors in General Scholarship, Trinity College Presidential Scholarship ", "Experience Account Manager, DoubleClick Search Google October 2012  –  May 2015  (2 years 8 months) Greater New York City Area - Account lead for \"Big Six\" agency holding company; additional former clients include a large independent agency and a Google “Top 100” direct marketer account. \n \n- Grew book of business by over $300M (across 15+ brands) through extensive relationship building, successful competitive trials, and strategic feature implementation. \n \n- Leveraged client management, industry, and product expertise to consult on the application of DoubleClick technology and implement industry best practices to enable customer success and meet or exceed quarterly and annual goals. \n \n- Drove product use and account retention through targeted, consultative focus on specific business challenges (including performance optimization, workflow simplification, and streamlined reporting).  \n \n- Collaborated with agency VPs, SVPs, and senior leadership to identify opportunities for case studies and proof-of-concept experiments to support broader agency business objectives. \n \n- Subject matter expert on performance bidding implementation, reporting, and analysis; integrations across the DoubleClick Stack; third-party API integrations (call tracking, analytics providers, offline data). Global Online Advertising Associate Google August 2011  –  October 2012  (1 year 3 months) Ann Arbor, MI - Supported and grew small businesses that use AdWords and Google Analytics by providing technical guidance and strategic feature consultations for performance optimization. Account Manager, DoubleClick Search Google October 2012  –  May 2015  (2 years 8 months) Greater New York City Area - Account lead for \"Big Six\" agency holding company; additional former clients include a large independent agency and a Google “Top 100” direct marketer account. \n \n- Grew book of business by over $300M (across 15+ brands) through extensive relationship building, successful competitive trials, and strategic feature implementation. \n \n- Leveraged client management, industry, and product expertise to consult on the application of DoubleClick technology and implement industry best practices to enable customer success and meet or exceed quarterly and annual goals. \n \n- Drove product use and account retention through targeted, consultative focus on specific business challenges (including performance optimization, workflow simplification, and streamlined reporting).  \n \n- Collaborated with agency VPs, SVPs, and senior leadership to identify opportunities for case studies and proof-of-concept experiments to support broader agency business objectives. \n \n- Subject matter expert on performance bidding implementation, reporting, and analysis; integrations across the DoubleClick Stack; third-party API integrations (call tracking, analytics providers, offline data). Account Manager, DoubleClick Search Google October 2012  –  May 2015  (2 years 8 months) Greater New York City Area - Account lead for \"Big Six\" agency holding company; additional former clients include a large independent agency and a Google “Top 100” direct marketer account. \n \n- Grew book of business by over $300M (across 15+ brands) through extensive relationship building, successful competitive trials, and strategic feature implementation. \n \n- Leveraged client management, industry, and product expertise to consult on the application of DoubleClick technology and implement industry best practices to enable customer success and meet or exceed quarterly and annual goals. \n \n- Drove product use and account retention through targeted, consultative focus on specific business challenges (including performance optimization, workflow simplification, and streamlined reporting).  \n \n- Collaborated with agency VPs, SVPs, and senior leadership to identify opportunities for case studies and proof-of-concept experiments to support broader agency business objectives. \n \n- Subject matter expert on performance bidding implementation, reporting, and analysis; integrations across the DoubleClick Stack; third-party API integrations (call tracking, analytics providers, offline data). Global Online Advertising Associate Google August 2011  –  October 2012  (1 year 3 months) Ann Arbor, MI - Supported and grew small businesses that use AdWords and Google Analytics by providing technical guidance and strategic feature consultations for performance optimization. Global Online Advertising Associate Google August 2011  –  October 2012  (1 year 3 months) Ann Arbor, MI - Supported and grew small businesses that use AdWords and Google Analytics by providing technical guidance and strategic feature consultations for performance optimization. Skills Top Skills 4 DoubleClick 3 Google Adwords 3 Online Advertising 2 Google Analytics 1 PPC 1 Project Management 1 Search 1 SEM 1 Search Advertising 1 Display Advertising Stephanie also knows about... 1 Web Analytics 1 Mobile Marketing 1 Digital Strategy 1 Digital Marketing 1 Mobile Advertising 1 Ad Serving 1 Account Management Skills  Top Skills 4 DoubleClick 3 Google Adwords 3 Online Advertising 2 Google Analytics 1 PPC 1 Project Management 1 Search 1 SEM 1 Search Advertising 1 Display Advertising Stephanie also knows about... 1 Web Analytics 1 Mobile Marketing 1 Digital Strategy 1 Digital Marketing 1 Mobile Advertising 1 Ad Serving 1 Account Management Top Skills 4 DoubleClick 3 Google Adwords 3 Online Advertising 2 Google Analytics 1 PPC 1 Project Management 1 Search 1 SEM 1 Search Advertising 1 Display Advertising Stephanie also knows about... 1 Web Analytics 1 Mobile Marketing 1 Digital Strategy 1 Digital Marketing 1 Mobile Advertising 1 Ad Serving 1 Account Management Top Skills 4 DoubleClick 3 Google Adwords 3 Online Advertising 2 Google Analytics 1 PPC 1 Project Management 1 Search 1 SEM 1 Search Advertising 1 Display Advertising Stephanie also knows about... 1 Web Analytics 1 Mobile Marketing 1 Digital Strategy 1 Digital Marketing 1 Mobile Advertising 1 Ad Serving 1 Account Management                     1 Web Analytics 1 Mobile Marketing 1 Digital Strategy 1 Digital Marketing 1 Mobile Advertising 1 Ad Serving 1 Account Management Education Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2015  – 2017 Northwestern University Bachelor's degree,  Political Science and Government 2007  – 2011 Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2015  – 2017 Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2015  – 2017 Dartmouth College - The Tuck School of Business at Dartmouth Master of Business Administration (MBA) 2015  – 2017 Northwestern University Bachelor's degree,  Political Science and Government 2007  – 2011 Northwestern University Bachelor's degree,  Political Science and Government 2007  – 2011 Northwestern University Bachelor's degree,  Political Science and Government 2007  – 2011 ", "Experience Tools Specialist, gTech Consumers Google April 2015  – Present (4 months) Account Strategist Google October 2013  –  April 2015  (1 year 7 months) Global Online Advertising Associate Google July 2011  –  October 2013  (2 years 4 months) Human Resources Intern MLB Network May 2010  –  August 2010  (4 months) Labor Relations Intern Major League Baseball January 2010  –  May 2010  (5 months) Worked with the department on salary arbitration matters, through research and data analysis. Student Information Assistant Cornell University January 2009  –  May 2009  (5 months) Assisted library patrons with navigating through research resources \nProvided customer service Intern Binghamton Mayor's Office December 2006  –  January 2007  (2 months) Tools Specialist, gTech Consumers Google April 2015  – Present (4 months) Tools Specialist, gTech Consumers Google April 2015  – Present (4 months) Account Strategist Google October 2013  –  April 2015  (1 year 7 months) Account Strategist Google October 2013  –  April 2015  (1 year 7 months) Global Online Advertising Associate Google July 2011  –  October 2013  (2 years 4 months) Global Online Advertising Associate Google July 2011  –  October 2013  (2 years 4 months) Human Resources Intern MLB Network May 2010  –  August 2010  (4 months) Human Resources Intern MLB Network May 2010  –  August 2010  (4 months) Labor Relations Intern Major League Baseball January 2010  –  May 2010  (5 months) Worked with the department on salary arbitration matters, through research and data analysis. Labor Relations Intern Major League Baseball January 2010  –  May 2010  (5 months) Worked with the department on salary arbitration matters, through research and data analysis. Student Information Assistant Cornell University January 2009  –  May 2009  (5 months) Assisted library patrons with navigating through research resources \nProvided customer service Student Information Assistant Cornell University January 2009  –  May 2009  (5 months) Assisted library patrons with navigating through research resources \nProvided customer service Intern Binghamton Mayor's Office December 2006  –  January 2007  (2 months) Intern Binghamton Mayor's Office December 2006  –  January 2007  (2 months) Skills Skills     Education Cornell University BS,  Industrial and Labor Relations 2007  – 2011 Activities and Societies:  Tradition Fellow ,  Class of 2011 Council ,  Class of 2011 Senior Class Campaign ,  Sports Marketing Group ,  Sports Management Club Cornell University BS,  Industrial and Labor Relations 2007  – 2011 Activities and Societies:  Tradition Fellow ,  Class of 2011 Council ,  Class of 2011 Senior Class Campaign ,  Sports Marketing Group ,  Sports Management Club Cornell University BS,  Industrial and Labor Relations 2007  – 2011 Activities and Societies:  Tradition Fellow ,  Class of 2011 Council ,  Class of 2011 Senior Class Campaign ,  Sports Marketing Group ,  Sports Management Club Cornell University BS,  Industrial and Labor Relations 2007  – 2011 Activities and Societies:  Tradition Fellow ,  Class of 2011 Council ,  Class of 2011 Senior Class Campaign ,  Sports Marketing Group ,  Sports Management Club ", "Experience Global Online Advertising Associate Google August 2010  –  September 2011  (1 year 2 months) Ann Arbor, MI •\tManaged customer inquiries by phone, email, and live chat \n•\tPerformed strategic phone consultations with AdWords customers in order to optimize accounts for improved performance and return on investment \n•\tTested unreleased Google products and programs and relayed necessary improvements to engineering team \n•\tRan the weekly meeting, wrote, edited, and fact-checked the global newsletters, wrote and proofread mass emails, and ran all team events as the Communications Lead for the Account Development team \n•\tOrganized and hosted multi-cultural events in the office, ran the bi-monthly meeting, and created inter-office publications to promote inclusion and acceptance as Google’s Mosaic (diversity group) Lead  \n•\tManaged the creation of Google’s Sponsor booth at the Michigan Minority Supplier Diversity Conference in 2011 and created and distributed printed brochures and Google logo items as Google’s Accelerate Team (small minority owned business marketing team) Communications Liaison (Open) 1 recommendation Vicki Chan Customer Support Trainer Charity is extremely passionate, candid and motivated. In my time working with her at Google, she was never afraid to challenge the status quo and ask tough questions in order to arrive at the best possible solutions for our advertisers and users.... View Communications Manager University of Leeds Union's Volunteering and Community Office September 2009  –  August 2010  (1 year) Leeds, United Kingdom •\tCreated, edited, proofread, and compiled external communications for the University's Union, including; newsletters, email marketing, posters, press releases, and flyers  \n•\tOrganized events hosted at the Union including calendar logistics, technical equipment set-up, external representative correspondences, and managed the needs of speaking guests \n• Updated and maintained our office's website content Customer Service Representative RockAuto January 2010  –  July 2010  (7 months) Madison, WI •\tProcessed customer service inquiries for orders placed with RockAuto \n•\tResearched different types of car components to gain a more in-depth understanding of the products sold and to help customers find the correct auto parts for their vehicles \n•\tServed as an intermediary between customers and RockAuto in order to resolve disputes, make sales, and help customers make the best purchase for their vehicles Application Processor University of Wisconsin January 2009  –  August 2009  (8 months) Madison, WI •\tProcessed student and parent tax forms for financial aid approval using federally mandated criteria Public Policy Intern WI State Representative Tamara Grigsby February 2009  –  May 2009  (4 months) Madison, WI •\tWrote talking points, press releases, edited and proofread written information, anticipated and debunked counter arguments, and researched legislation and public policy \n•\tLiaised with key constituents regarding concerns or suggested improvements for the district Sales Representative Intern Pfizer May 2008  –  August 2008  (4 months) Milwaukee, WI •\tCompleted two weeks of intensive training with in-depth lessons and examinations on the functions of the human body and the effects of prescription medicines \n•\tVisited doctors’ offices daily to discuss the uses and superiority of Pfizer’s prescription medicine while using suggestive selling techniques to persuade them to write more Pfizer specific prescriptions \n•\tHosted luncheons and dinners with Doctors and their key staff members to discuss Pfizer and any concerns they may have had about prescribing Pfizer over competitors Undergraduate Research Analyst UW-Center for Cooperatives October 2007  –  June 2008  (9 months) Madison, WI •\tConducted research on the economic impact of cooperatives by inputting and organizing data acquired by interview and manual research \n•\tContacted national cooperatives to solicit information about their economic standing, input this data into an Excel Pivot table, and organized data based on the acquired information in order to compile it into a written report for mass distribution \n•\tTrained replacement on how to acquire the data, the uses of the data systems, and how to input and organize the data Tutor/Mentor University of Wisconsin December 2006  –  May 2008  (1 year 6 months) Madison, WI •\tTutored high school and middle school students in Spanish, French, English, and History daily \n•\tCounseled and mentored students on post-graduation options, emotional concerns, and maintained contact after their graduation from high school and college Global Quality Sourcing Intern GE June 2006  –  August 2006  (3 months) Waukesha, WI •\tPerformed pre-audits and ensured that each GE supplier abided by the global quality standards \n•\tContacted representatives from each supplier to inform them of missing documents  \n•\tEnsured that required documents were delivered to the quality sourcing Engineers \n•\tCreated a customer comment categorization matrix and webpage that directed customers to the proper web site or call center representative in order to simplify the customer call center experience Global Online Advertising Associate Google August 2010  –  September 2011  (1 year 2 months) Ann Arbor, MI •\tManaged customer inquiries by phone, email, and live chat \n•\tPerformed strategic phone consultations with AdWords customers in order to optimize accounts for improved performance and return on investment \n•\tTested unreleased Google products and programs and relayed necessary improvements to engineering team \n•\tRan the weekly meeting, wrote, edited, and fact-checked the global newsletters, wrote and proofread mass emails, and ran all team events as the Communications Lead for the Account Development team \n•\tOrganized and hosted multi-cultural events in the office, ran the bi-monthly meeting, and created inter-office publications to promote inclusion and acceptance as Google’s Mosaic (diversity group) Lead  \n•\tManaged the creation of Google’s Sponsor booth at the Michigan Minority Supplier Diversity Conference in 2011 and created and distributed printed brochures and Google logo items as Google’s Accelerate Team (small minority owned business marketing team) Communications Liaison (Open) 1 recommendation Vicki Chan Customer Support Trainer Charity is extremely passionate, candid and motivated. In my time working with her at Google, she was never afraid to challenge the status quo and ask tough questions in order to arrive at the best possible solutions for our advertisers and users.... View Global Online Advertising Associate Google August 2010  –  September 2011  (1 year 2 months) Ann Arbor, MI •\tManaged customer inquiries by phone, email, and live chat \n•\tPerformed strategic phone consultations with AdWords customers in order to optimize accounts for improved performance and return on investment \n•\tTested unreleased Google products and programs and relayed necessary improvements to engineering team \n•\tRan the weekly meeting, wrote, edited, and fact-checked the global newsletters, wrote and proofread mass emails, and ran all team events as the Communications Lead for the Account Development team \n•\tOrganized and hosted multi-cultural events in the office, ran the bi-monthly meeting, and created inter-office publications to promote inclusion and acceptance as Google’s Mosaic (diversity group) Lead  \n•\tManaged the creation of Google’s Sponsor booth at the Michigan Minority Supplier Diversity Conference in 2011 and created and distributed printed brochures and Google logo items as Google’s Accelerate Team (small minority owned business marketing team) Communications Liaison (Open) 1 recommendation Vicki Chan Customer Support Trainer Charity is extremely passionate, candid and motivated. In my time working with her at Google, she was never afraid to challenge the status quo and ask tough questions in order to arrive at the best possible solutions for our advertisers and users.... View Communications Manager University of Leeds Union's Volunteering and Community Office September 2009  –  August 2010  (1 year) Leeds, United Kingdom •\tCreated, edited, proofread, and compiled external communications for the University's Union, including; newsletters, email marketing, posters, press releases, and flyers  \n•\tOrganized events hosted at the Union including calendar logistics, technical equipment set-up, external representative correspondences, and managed the needs of speaking guests \n• Updated and maintained our office's website content Communications Manager University of Leeds Union's Volunteering and Community Office September 2009  –  August 2010  (1 year) Leeds, United Kingdom •\tCreated, edited, proofread, and compiled external communications for the University's Union, including; newsletters, email marketing, posters, press releases, and flyers  \n•\tOrganized events hosted at the Union including calendar logistics, technical equipment set-up, external representative correspondences, and managed the needs of speaking guests \n• Updated and maintained our office's website content Customer Service Representative RockAuto January 2010  –  July 2010  (7 months) Madison, WI •\tProcessed customer service inquiries for orders placed with RockAuto \n•\tResearched different types of car components to gain a more in-depth understanding of the products sold and to help customers find the correct auto parts for their vehicles \n•\tServed as an intermediary between customers and RockAuto in order to resolve disputes, make sales, and help customers make the best purchase for their vehicles Customer Service Representative RockAuto January 2010  –  July 2010  (7 months) Madison, WI •\tProcessed customer service inquiries for orders placed with RockAuto \n•\tResearched different types of car components to gain a more in-depth understanding of the products sold and to help customers find the correct auto parts for their vehicles \n•\tServed as an intermediary between customers and RockAuto in order to resolve disputes, make sales, and help customers make the best purchase for their vehicles Application Processor University of Wisconsin January 2009  –  August 2009  (8 months) Madison, WI •\tProcessed student and parent tax forms for financial aid approval using federally mandated criteria Application Processor University of Wisconsin January 2009  –  August 2009  (8 months) Madison, WI •\tProcessed student and parent tax forms for financial aid approval using federally mandated criteria Public Policy Intern WI State Representative Tamara Grigsby February 2009  –  May 2009  (4 months) Madison, WI •\tWrote talking points, press releases, edited and proofread written information, anticipated and debunked counter arguments, and researched legislation and public policy \n•\tLiaised with key constituents regarding concerns or suggested improvements for the district Public Policy Intern WI State Representative Tamara Grigsby February 2009  –  May 2009  (4 months) Madison, WI •\tWrote talking points, press releases, edited and proofread written information, anticipated and debunked counter arguments, and researched legislation and public policy \n•\tLiaised with key constituents regarding concerns or suggested improvements for the district Sales Representative Intern Pfizer May 2008  –  August 2008  (4 months) Milwaukee, WI •\tCompleted two weeks of intensive training with in-depth lessons and examinations on the functions of the human body and the effects of prescription medicines \n•\tVisited doctors’ offices daily to discuss the uses and superiority of Pfizer’s prescription medicine while using suggestive selling techniques to persuade them to write more Pfizer specific prescriptions \n•\tHosted luncheons and dinners with Doctors and their key staff members to discuss Pfizer and any concerns they may have had about prescribing Pfizer over competitors Sales Representative Intern Pfizer May 2008  –  August 2008  (4 months) Milwaukee, WI •\tCompleted two weeks of intensive training with in-depth lessons and examinations on the functions of the human body and the effects of prescription medicines \n•\tVisited doctors’ offices daily to discuss the uses and superiority of Pfizer’s prescription medicine while using suggestive selling techniques to persuade them to write more Pfizer specific prescriptions \n•\tHosted luncheons and dinners with Doctors and their key staff members to discuss Pfizer and any concerns they may have had about prescribing Pfizer over competitors Undergraduate Research Analyst UW-Center for Cooperatives October 2007  –  June 2008  (9 months) Madison, WI •\tConducted research on the economic impact of cooperatives by inputting and organizing data acquired by interview and manual research \n•\tContacted national cooperatives to solicit information about their economic standing, input this data into an Excel Pivot table, and organized data based on the acquired information in order to compile it into a written report for mass distribution \n•\tTrained replacement on how to acquire the data, the uses of the data systems, and how to input and organize the data Undergraduate Research Analyst UW-Center for Cooperatives October 2007  –  June 2008  (9 months) Madison, WI •\tConducted research on the economic impact of cooperatives by inputting and organizing data acquired by interview and manual research \n•\tContacted national cooperatives to solicit information about their economic standing, input this data into an Excel Pivot table, and organized data based on the acquired information in order to compile it into a written report for mass distribution \n•\tTrained replacement on how to acquire the data, the uses of the data systems, and how to input and organize the data Tutor/Mentor University of Wisconsin December 2006  –  May 2008  (1 year 6 months) Madison, WI •\tTutored high school and middle school students in Spanish, French, English, and History daily \n•\tCounseled and mentored students on post-graduation options, emotional concerns, and maintained contact after their graduation from high school and college Tutor/Mentor University of Wisconsin December 2006  –  May 2008  (1 year 6 months) Madison, WI •\tTutored high school and middle school students in Spanish, French, English, and History daily \n•\tCounseled and mentored students on post-graduation options, emotional concerns, and maintained contact after their graduation from high school and college Global Quality Sourcing Intern GE June 2006  –  August 2006  (3 months) Waukesha, WI •\tPerformed pre-audits and ensured that each GE supplier abided by the global quality standards \n•\tContacted representatives from each supplier to inform them of missing documents  \n•\tEnsured that required documents were delivered to the quality sourcing Engineers \n•\tCreated a customer comment categorization matrix and webpage that directed customers to the proper web site or call center representative in order to simplify the customer call center experience Global Quality Sourcing Intern GE June 2006  –  August 2006  (3 months) Waukesha, WI •\tPerformed pre-audits and ensured that each GE supplier abided by the global quality standards \n•\tContacted representatives from each supplier to inform them of missing documents  \n•\tEnsured that required documents were delivered to the quality sourcing Engineers \n•\tCreated a customer comment categorization matrix and webpage that directed customers to the proper web site or call center representative in order to simplify the customer call center experience Skills 10 Editing 9 Event Planning 9 Online Advertising 8 Public Speaking 7 Marketing Communications 6 Email Marketing 5 Spanish Skills  10 Editing 9 Event Planning 9 Online Advertising 8 Public Speaking 7 Marketing Communications 6 Email Marketing 5 Spanish 10 Editing 9 Event Planning 9 Online Advertising 8 Public Speaking 7 Marketing Communications 6 Email Marketing 5 Spanish 10 Editing 9 Event Planning 9 Online Advertising 8 Public Speaking 7 Marketing Communications 6 Email Marketing 5 Spanish               Education University of Leeds B.A,  Sociology & Political Science 2009  – 2010 Study Abroad Program University of Wisconsin-Madison B.A.,  Sociology ,  Political Science ,  & Spanish 2006  – 2010 International Living Experiences: Dominican Republic and England \nLanguage Fluency: Spanish, and English \nLanguage Proficiency: French Activities and Societies:  INROADS Scholar ,  TRIO Scholar ,  Academic Advancement Program Scholar ,  ¡Aprendanlo! Volunteer ESL Teacher ,  YoungLife Mentor ,  La Causa Volunteer ,  & American Diabetes Association Volunteer Pontifica Universidad Complutense Madre y Maestra Spanish Study Abroad Program University School of Milwaukee University of Leeds B.A,  Sociology & Political Science 2009  – 2010 Study Abroad Program University of Leeds B.A,  Sociology & Political Science 2009  – 2010 Study Abroad Program University of Leeds B.A,  Sociology & Political Science 2009  – 2010 Study Abroad Program University of Wisconsin-Madison B.A.,  Sociology ,  Political Science ,  & Spanish 2006  – 2010 International Living Experiences: Dominican Republic and England \nLanguage Fluency: Spanish, and English \nLanguage Proficiency: French Activities and Societies:  INROADS Scholar ,  TRIO Scholar ,  Academic Advancement Program Scholar ,  ¡Aprendanlo! Volunteer ESL Teacher ,  YoungLife Mentor ,  La Causa Volunteer ,  & American Diabetes Association Volunteer University of Wisconsin-Madison B.A.,  Sociology ,  Political Science ,  & Spanish 2006  – 2010 International Living Experiences: Dominican Republic and England \nLanguage Fluency: Spanish, and English \nLanguage Proficiency: French Activities and Societies:  INROADS Scholar ,  TRIO Scholar ,  Academic Advancement Program Scholar ,  ¡Aprendanlo! Volunteer ESL Teacher ,  YoungLife Mentor ,  La Causa Volunteer ,  & American Diabetes Association Volunteer University of Wisconsin-Madison B.A.,  Sociology ,  Political Science ,  & Spanish 2006  – 2010 International Living Experiences: Dominican Republic and England \nLanguage Fluency: Spanish, and English \nLanguage Proficiency: French Activities and Societies:  INROADS Scholar ,  TRIO Scholar ,  Academic Advancement Program Scholar ,  ¡Aprendanlo! Volunteer ESL Teacher ,  YoungLife Mentor ,  La Causa Volunteer ,  & American Diabetes Association Volunteer Pontifica Universidad Complutense Madre y Maestra Spanish Study Abroad Program Pontifica Universidad Complutense Madre y Maestra Spanish Study Abroad Program Pontifica Universidad Complutense Madre y Maestra Spanish Study Abroad Program University School of Milwaukee University School of Milwaukee University School of Milwaukee ", "Languages   Skills 22 Forecasting 19 Procurement 17 SAP 11 Materials Management 11 Customer Service 11 Purchasing 11 Microsoft Excel 7 Supply Management 2 Coordination Skills  22 Forecasting 19 Procurement 17 SAP 11 Materials Management 11 Customer Service 11 Purchasing 11 Microsoft Excel 7 Supply Management 2 Coordination 22 Forecasting 19 Procurement 17 SAP 11 Materials Management 11 Customer Service 11 Purchasing 11 Microsoft Excel 7 Supply Management 2 Coordination 22 Forecasting 19 Procurement 17 SAP 11 Materials Management 11 Customer Service 11 Purchasing 11 Microsoft Excel 7 Supply Management 2 Coordination                   ", "Summary An analytical and creative approach to problem solving derived from a diverse background including leadership, organizational, technological and customer relationship experiences. A fast learner with an ability to make complicated, technical ideas understandable. Interested in a field that moves rapidly that requires life long learning, tested by constant unique challenges. Specialties:Google AdWords Certified (Basic, Advanced Search and Display) Summary An analytical and creative approach to problem solving derived from a diverse background including leadership, organizational, technological and customer relationship experiences. A fast learner with an ability to make complicated, technical ideas understandable. Interested in a field that moves rapidly that requires life long learning, tested by constant unique challenges. Specialties:Google AdWords Certified (Basic, Advanced Search and Display) An analytical and creative approach to problem solving derived from a diverse background including leadership, organizational, technological and customer relationship experiences. A fast learner with an ability to make complicated, technical ideas understandable. Interested in a field that moves rapidly that requires life long learning, tested by constant unique challenges. Specialties:Google AdWords Certified (Basic, Advanced Search and Display) An analytical and creative approach to problem solving derived from a diverse background including leadership, organizational, technological and customer relationship experiences. A fast learner with an ability to make complicated, technical ideas understandable. Interested in a field that moves rapidly that requires life long learning, tested by constant unique challenges. Specialties:Google AdWords Certified (Basic, Advanced Search and Display) Experience SMB Product and Solution Specialist Google July 2013  – Present (2 years 1 month) SMB AdWords Account Strategist Google July 2011  –  July 2013  (2 years 1 month) Global Online Advertising Associate Google March 2011  –  July 2011  (5 months) Intern Habitat for Humanity of McLean County May 2010  –  August 2010  (4 months) As part of the Corporate Community Partners Internship with State Farm I worked 2 days a week at Habitat for Humanity of McLean County. My main focus was to make their online and social media presence more effective. I streamlined their home webpage, making it more accessible and user friendly. I also, managed the HFH Facebook page, resulting in a 35% increase in \"friends.\" I also applied for and received a grant from Google, giving Habitat for Humanity free access to Google AdWords and an AdWords advertising budget worth up to $10,000 per month. Other projects included: creating a safety plan, compiling information for a new homeowners guide regarding LEED certified housing. (Open) 1 recommendation Kristen Sand Director of Resource Development at Mid Central Community Action, Inc. I am pleased and honored to write a recommendation for Nick Kogelman. As Executive Director of Habitat for Humanity of McLean County; I have the opportunity to work with a variety of individuals from our community. Without a doubt, Nick has been... View Corporate Community Partners Intern State Farm Insurance April 2010  –  August 2010  (5 months) This internship partnered State Farm Insurance, Habitat for Humanity and the Illinois Wesleyan University Action Research Center. I spent 3 days per week working in the Property and Casualty Claims department of State Farm and 2 days per week at Habitat for Humanity. I specialized in catastrophe services at State Farm. My main focus was to create specialized ad hoc reports on a large amount of independent insurance adjuster data to be used for an annual meeting with external business partners. Another objective was to help track and manage independent insurance adjusters. As part of this project, I created a system to simplify and streamline independent adjuster management. Legal Intern Ronda D. Taylor Glenn Law Offices August 2009  –  December 2009  (5 months) I was involved in a number of daly activities including legal, financial and administrative activities. These ranged from drafting legal documents to general administrative activities such as file maintenance. I was given the opportunity to develop a knowledge of legal research using Lexis Nexis. Finally I was able to form, maintain and build client relationships based on legal needs and experiences. (Open) 1 recommendation J. Harrison Fulk Associate Attorney at Ronda D. Taylor Glenn Law Offices Nicholas was a pleasure for all office staff, and myself to work with. His intelligence and poise assert themselves naturally and upon first impression, and his social skills will allow him to fit in pleasantly in a wide range of work environments.... View Intern First Community Bank of Joliet June 2009  –  August 2009  (3 months) During my summer at First Community I worked on collateral, insurance, and financial information in the loan department. In order to do this effectively I became familiar with the bank wide record keeping system and worked to streamline the financial reporting system. Additionally, I helped to update both the internal audit and loan review report. Golf Associate Dick's Sporting Goods June 2008  –  June 2009  (1 year 1 month) I demonstrated excellent customer service resulting in top sales per hour worked for the golf department during the month of July 2009. I worked with customers to diagnose their needs and suggest the best product to fit their skill set. In doing so, I learned to make complicated, technical information understandable for all customers. I also helped to execute various promotional events including annual sales promotions. SMB Product and Solution Specialist Google July 2013  – Present (2 years 1 month) SMB Product and Solution Specialist Google July 2013  – Present (2 years 1 month) SMB AdWords Account Strategist Google July 2011  –  July 2013  (2 years 1 month) SMB AdWords Account Strategist Google July 2011  –  July 2013  (2 years 1 month) Global Online Advertising Associate Google March 2011  –  July 2011  (5 months) Global Online Advertising Associate Google March 2011  –  July 2011  (5 months) Intern Habitat for Humanity of McLean County May 2010  –  August 2010  (4 months) As part of the Corporate Community Partners Internship with State Farm I worked 2 days a week at Habitat for Humanity of McLean County. My main focus was to make their online and social media presence more effective. I streamlined their home webpage, making it more accessible and user friendly. I also, managed the HFH Facebook page, resulting in a 35% increase in \"friends.\" I also applied for and received a grant from Google, giving Habitat for Humanity free access to Google AdWords and an AdWords advertising budget worth up to $10,000 per month. Other projects included: creating a safety plan, compiling information for a new homeowners guide regarding LEED certified housing. (Open) 1 recommendation Kristen Sand Director of Resource Development at Mid Central Community Action, Inc. I am pleased and honored to write a recommendation for Nick Kogelman. As Executive Director of Habitat for Humanity of McLean County; I have the opportunity to work with a variety of individuals from our community. Without a doubt, Nick has been... View Intern Habitat for Humanity of McLean County May 2010  –  August 2010  (4 months) As part of the Corporate Community Partners Internship with State Farm I worked 2 days a week at Habitat for Humanity of McLean County. My main focus was to make their online and social media presence more effective. I streamlined their home webpage, making it more accessible and user friendly. I also, managed the HFH Facebook page, resulting in a 35% increase in \"friends.\" I also applied for and received a grant from Google, giving Habitat for Humanity free access to Google AdWords and an AdWords advertising budget worth up to $10,000 per month. Other projects included: creating a safety plan, compiling information for a new homeowners guide regarding LEED certified housing. (Open) 1 recommendation Kristen Sand Director of Resource Development at Mid Central Community Action, Inc. I am pleased and honored to write a recommendation for Nick Kogelman. As Executive Director of Habitat for Humanity of McLean County; I have the opportunity to work with a variety of individuals from our community. Without a doubt, Nick has been... View Corporate Community Partners Intern State Farm Insurance April 2010  –  August 2010  (5 months) This internship partnered State Farm Insurance, Habitat for Humanity and the Illinois Wesleyan University Action Research Center. I spent 3 days per week working in the Property and Casualty Claims department of State Farm and 2 days per week at Habitat for Humanity. I specialized in catastrophe services at State Farm. My main focus was to create specialized ad hoc reports on a large amount of independent insurance adjuster data to be used for an annual meeting with external business partners. Another objective was to help track and manage independent insurance adjusters. As part of this project, I created a system to simplify and streamline independent adjuster management. Corporate Community Partners Intern State Farm Insurance April 2010  –  August 2010  (5 months) This internship partnered State Farm Insurance, Habitat for Humanity and the Illinois Wesleyan University Action Research Center. I spent 3 days per week working in the Property and Casualty Claims department of State Farm and 2 days per week at Habitat for Humanity. I specialized in catastrophe services at State Farm. My main focus was to create specialized ad hoc reports on a large amount of independent insurance adjuster data to be used for an annual meeting with external business partners. Another objective was to help track and manage independent insurance adjusters. As part of this project, I created a system to simplify and streamline independent adjuster management. Legal Intern Ronda D. Taylor Glenn Law Offices August 2009  –  December 2009  (5 months) I was involved in a number of daly activities including legal, financial and administrative activities. These ranged from drafting legal documents to general administrative activities such as file maintenance. I was given the opportunity to develop a knowledge of legal research using Lexis Nexis. Finally I was able to form, maintain and build client relationships based on legal needs and experiences. (Open) 1 recommendation J. Harrison Fulk Associate Attorney at Ronda D. Taylor Glenn Law Offices Nicholas was a pleasure for all office staff, and myself to work with. His intelligence and poise assert themselves naturally and upon first impression, and his social skills will allow him to fit in pleasantly in a wide range of work environments.... View Legal Intern Ronda D. Taylor Glenn Law Offices August 2009  –  December 2009  (5 months) I was involved in a number of daly activities including legal, financial and administrative activities. These ranged from drafting legal documents to general administrative activities such as file maintenance. I was given the opportunity to develop a knowledge of legal research using Lexis Nexis. Finally I was able to form, maintain and build client relationships based on legal needs and experiences. (Open) 1 recommendation J. Harrison Fulk Associate Attorney at Ronda D. Taylor Glenn Law Offices Nicholas was a pleasure for all office staff, and myself to work with. His intelligence and poise assert themselves naturally and upon first impression, and his social skills will allow him to fit in pleasantly in a wide range of work environments.... View Intern First Community Bank of Joliet June 2009  –  August 2009  (3 months) During my summer at First Community I worked on collateral, insurance, and financial information in the loan department. In order to do this effectively I became familiar with the bank wide record keeping system and worked to streamline the financial reporting system. Additionally, I helped to update both the internal audit and loan review report. Intern First Community Bank of Joliet June 2009  –  August 2009  (3 months) During my summer at First Community I worked on collateral, insurance, and financial information in the loan department. In order to do this effectively I became familiar with the bank wide record keeping system and worked to streamline the financial reporting system. Additionally, I helped to update both the internal audit and loan review report. Golf Associate Dick's Sporting Goods June 2008  –  June 2009  (1 year 1 month) I demonstrated excellent customer service resulting in top sales per hour worked for the golf department during the month of July 2009. I worked with customers to diagnose their needs and suggest the best product to fit their skill set. In doing so, I learned to make complicated, technical information understandable for all customers. I also helped to execute various promotional events including annual sales promotions. Golf Associate Dick's Sporting Goods June 2008  –  June 2009  (1 year 1 month) I demonstrated excellent customer service resulting in top sales per hour worked for the golf department during the month of July 2009. I worked with customers to diagnose their needs and suggest the best product to fit their skill set. In doing so, I learned to make complicated, technical information understandable for all customers. I also helped to execute various promotional events including annual sales promotions. Skills Top Skills 15 Social Media 12 Online Advertising 9 Google Adwords 9 Marketing 7 Sales 5 Leadership 4 Customer Service 4 CRM 4 Social Media Marketing 3 Online Marketing Nicholas also knows about... 3 Google Analytics 3 SEM 2 Public Relations 2 Budgets 2 Management 2 Time Management 2 Microsoft Excel 1 Web Analytics 1 Market Research 1 Integrated Marketing 1 Digital Media 1 Competitive Analysis 1 Marketing Communications 1 Marketing Strategy 1 Advertising 1 Analytics 1 Email Marketing 1 Digital Strategy 1 Digital Marketing 1 Account Management 1 Media Planning 1 Mobile Marketing 1 Search Advertising 1 Display Advertising 1 Google Docs 0 PPC See 11+     See less Skills  Top Skills 15 Social Media 12 Online Advertising 9 Google Adwords 9 Marketing 7 Sales 5 Leadership 4 Customer Service 4 CRM 4 Social Media Marketing 3 Online Marketing Nicholas also knows about... 3 Google Analytics 3 SEM 2 Public Relations 2 Budgets 2 Management 2 Time Management 2 Microsoft Excel 1 Web Analytics 1 Market Research 1 Integrated Marketing 1 Digital Media 1 Competitive Analysis 1 Marketing Communications 1 Marketing Strategy 1 Advertising 1 Analytics 1 Email Marketing 1 Digital Strategy 1 Digital Marketing 1 Account Management 1 Media Planning 1 Mobile Marketing 1 Search Advertising 1 Display Advertising 1 Google Docs 0 PPC See 11+     See less Top Skills 15 Social Media 12 Online Advertising 9 Google Adwords 9 Marketing 7 Sales 5 Leadership 4 Customer Service 4 CRM 4 Social Media Marketing 3 Online Marketing Nicholas also knows about... 3 Google Analytics 3 SEM 2 Public Relations 2 Budgets 2 Management 2 Time Management 2 Microsoft Excel 1 Web Analytics 1 Market Research 1 Integrated Marketing 1 Digital Media 1 Competitive Analysis 1 Marketing Communications 1 Marketing Strategy 1 Advertising 1 Analytics 1 Email Marketing 1 Digital Strategy 1 Digital Marketing 1 Account Management 1 Media Planning 1 Mobile Marketing 1 Search Advertising 1 Display Advertising 1 Google Docs 0 PPC See 11+     See less Top Skills 15 Social Media 12 Online Advertising 9 Google Adwords 9 Marketing 7 Sales 5 Leadership 4 Customer Service 4 CRM 4 Social Media Marketing 3 Online Marketing Nicholas also knows about... 3 Google Analytics 3 SEM 2 Public Relations 2 Budgets 2 Management 2 Time Management 2 Microsoft Excel 1 Web Analytics 1 Market Research 1 Integrated Marketing 1 Digital Media 1 Competitive Analysis 1 Marketing Communications 1 Marketing Strategy 1 Advertising 1 Analytics 1 Email Marketing 1 Digital Strategy 1 Digital Marketing 1 Account Management 1 Media Planning 1 Mobile Marketing 1 Search Advertising 1 Display Advertising 1 Google Docs 0 PPC See 11+     See less                     3 Google Analytics 3 SEM 2 Public Relations 2 Budgets 2 Management 2 Time Management 2 Microsoft Excel 1 Web Analytics 1 Market Research 1 Integrated Marketing 1 Digital Media 1 Competitive Analysis 1 Marketing Communications 1 Marketing Strategy 1 Advertising 1 Analytics 1 Email Marketing 1 Digital Strategy 1 Digital Marketing 1 Account Management 1 Media Planning 1 Mobile Marketing 1 Search Advertising 1 Display Advertising 1 Google Docs 0 PPC Education Illinois Wesleyan University Bachelors of Arts,  Business Administration (Management) 2007  – 2010 Graduated Summa Cum Laude \n \nBusiness Administration major with a concentration in Management, Sociology minor. \n \nStudied abroad in London for a semester in fall of 2008 \n \nTeam Leader, Google Marketing Challenge, Spring 2010 \nI guided my team to make decisions about how to design, implement and control a real Google AdWords account for a small business. Activities and Societies:  Edyth E. Wallace Scholarship recipient for outstanding business student\nDean’s List all semesters\nDRL (Christian student association) leadership board\nAwarded Alumni Scholarship from Illinois Wesleyan University\nPhi Eta Sigma ,  Freshman scholastic honor society\nPhi Beta Delta ,  International Studies Honor Society\nPhi Kappa Phi ,  national interdisciplinary honor society (Open) 1 recommendation Sascha Vitzthum, Ph.D. CMO at fashion4home GmbH Nicholas is one of the top three students of his class at Illinois Wesleyan University. Aside from his outstanding intellect, he shows a maturity level rarely seen among undergraduate students. Every company should be delighted to have Nicholas join... View Illinois Wesleyan University Bachelors of Arts,  Business Administration (Management) 2007  – 2010 Graduated Summa Cum Laude \n \nBusiness Administration major with a concentration in Management, Sociology minor. \n \nStudied abroad in London for a semester in fall of 2008 \n \nTeam Leader, Google Marketing Challenge, Spring 2010 \nI guided my team to make decisions about how to design, implement and control a real Google AdWords account for a small business. Activities and Societies:  Edyth E. Wallace Scholarship recipient for outstanding business student\nDean’s List all semesters\nDRL (Christian student association) leadership board\nAwarded Alumni Scholarship from Illinois Wesleyan University\nPhi Eta Sigma ,  Freshman scholastic honor society\nPhi Beta Delta ,  International Studies Honor Society\nPhi Kappa Phi ,  national interdisciplinary honor society (Open) 1 recommendation Sascha Vitzthum, Ph.D. CMO at fashion4home GmbH Nicholas is one of the top three students of his class at Illinois Wesleyan University. Aside from his outstanding intellect, he shows a maturity level rarely seen among undergraduate students. Every company should be delighted to have Nicholas join... View Illinois Wesleyan University Bachelors of Arts,  Business Administration (Management) 2007  – 2010 Graduated Summa Cum Laude \n \nBusiness Administration major with a concentration in Management, Sociology minor. \n \nStudied abroad in London for a semester in fall of 2008 \n \nTeam Leader, Google Marketing Challenge, Spring 2010 \nI guided my team to make decisions about how to design, implement and control a real Google AdWords account for a small business. Activities and Societies:  Edyth E. Wallace Scholarship recipient for outstanding business student\nDean’s List all semesters\nDRL (Christian student association) leadership board\nAwarded Alumni Scholarship from Illinois Wesleyan University\nPhi Eta Sigma ,  Freshman scholastic honor society\nPhi Beta Delta ,  International Studies Honor Society\nPhi Kappa Phi ,  national interdisciplinary honor society (Open) 1 recommendation Sascha Vitzthum, Ph.D. CMO at fashion4home GmbH Nicholas is one of the top three students of his class at Illinois Wesleyan University. Aside from his outstanding intellect, he shows a maturity level rarely seen among undergraduate students. Every company should be delighted to have Nicholas join... View Illinois Wesleyan University Bachelors of Arts,  Business Administration (Management) 2007  – 2010 Graduated Summa Cum Laude \n \nBusiness Administration major with a concentration in Management, Sociology minor. \n \nStudied abroad in London for a semester in fall of 2008 \n \nTeam Leader, Google Marketing Challenge, Spring 2010 \nI guided my team to make decisions about how to design, implement and control a real Google AdWords account for a small business. Activities and Societies:  Edyth E. Wallace Scholarship recipient for outstanding business student\nDean’s List all semesters\nDRL (Christian student association) leadership board\nAwarded Alumni Scholarship from Illinois Wesleyan University\nPhi Eta Sigma ,  Freshman scholastic honor society\nPhi Beta Delta ,  International Studies Honor Society\nPhi Kappa Phi ,  national interdisciplinary honor society (Open) 1 recommendation Sascha Vitzthum, Ph.D. CMO at fashion4home GmbH Nicholas is one of the top three students of his class at Illinois Wesleyan University. Aside from his outstanding intellect, he shows a maturity level rarely seen among undergraduate students. Every company should be delighted to have Nicholas join... View Honors & Awards Additional Honors & Awards Dean's List All Semesters \nEdyth E Wallace Scholarship for outstanding business student \nPhi Beta Delta International Studies Honor Society \nPhi Kappa Phi National Interdisciplinary Honor Society \nPhi Eta Sigma Freshman Academic Honor Society Additional Honors & Awards Dean's List All Semesters \nEdyth E Wallace Scholarship for outstanding business student \nPhi Beta Delta International Studies Honor Society \nPhi Kappa Phi National Interdisciplinary Honor Society \nPhi Eta Sigma Freshman Academic Honor Society Additional Honors & Awards Dean's List All Semesters \nEdyth E Wallace Scholarship for outstanding business student \nPhi Beta Delta International Studies Honor Society \nPhi Kappa Phi National Interdisciplinary Honor Society \nPhi Eta Sigma Freshman Academic Honor Society Additional Honors & Awards Dean's List All Semesters \nEdyth E Wallace Scholarship for outstanding business student \nPhi Beta Delta International Studies Honor Society \nPhi Kappa Phi National Interdisciplinary Honor Society \nPhi Eta Sigma Freshman Academic Honor Society ", "Summary UCLA graduate currently working in People Operations at Google, Inc. My background includes extensive experience in communications, from social media management to online and print journalism. My work has appeared in People Magazine, online for Yahoo!, and in the Daily Bruin and UCLA Magazine. Summary UCLA graduate currently working in People Operations at Google, Inc. My background includes extensive experience in communications, from social media management to online and print journalism. My work has appeared in People Magazine, online for Yahoo!, and in the Daily Bruin and UCLA Magazine. UCLA graduate currently working in People Operations at Google, Inc. My background includes extensive experience in communications, from social media management to online and print journalism. My work has appeared in People Magazine, online for Yahoo!, and in the Daily Bruin and UCLA Magazine. UCLA graduate currently working in People Operations at Google, Inc. My background includes extensive experience in communications, from social media management to online and print journalism. My work has appeared in People Magazine, online for Yahoo!, and in the Daily Bruin and UCLA Magazine. Experience People Programs Specialist Google October 2013  – Present (1 year 10 months) -Promoted in October 2013 People Programs Coordinator Google January 2013  –  October 2013  (10 months) Mountain View -Support the recruiting and hiring process for all hiring decisions made within the company. \n-Manage the review of candidates and provide feedback to recruiters, other coordinators, and executives. Global Online Advertising Associate Google April 2011  –  December 2012  (1 year 9 months) Mountain View, CA -Product specialist in AdWords, AdWords Express, Google Analytics and Google Places. \n-Educated and empowered AdWords advertisers. \n-Mentored peers and interns through quality assurance processes. Social Media Intern Yahoo! June 2010  –  December 2010  (7 months) Santa Monica, CA -Developed and directed successful social media campaigns for Yahoo! omg!, Yahoo! TV, and Yahoo! Movies. \n-Worked closely with Yahoo! editorial, product and sales staff to integrate and highlight Yahoo! content into social media avenues.  \n-Tracked growth on Yahoo! Facebook accounts as the number of fans grew over 200% during my internship period. \n-Utilized new social media tools as a social currency that benefitted both the Yahoo! sites and fans, and effectively drove brand awareness and engagement. Editorial and Social Media Assistant UCLA Magazine January 2009  –  December 2010  (2 years) Westwood, CA -Wrote over 40 stories for UCLA Magazine and their accompanying website, www.magazine.ucla.edu. \n-Proposed story ideas for both the magazine and the website. \n-Maintained and updated the UCLA Magazine website on a weekly basis, utilizing my skills in HTML coding and Adobe Photoshop. \nManaged the UCLA Facebook and Twitter accounts, the primary sites where incoming students can ask questions and expect a timely, personal response. Celebrity Reporter (Intern) People Magazine January 2010  –  June 2010  (6 months) Los Angeles, CA -Covered dozens of celebrity events, providing accurate and detailed reports and observations. \n-Transformed quotes and interviews into engaging and exciting stories for People Magazine and PEOPLE.com. \n-Researched detailed background information and verified facts for the editorial staff, often under strict deadlines. Panhellenic Delegate Alpha Delta Pi Sorority January 2009  –  January 2010  (1 year 1 month) Westwood, CA -Served on the Executive Board of Alpha Delta Pi.  \n-Responsibilities included attending several weekly meetings, coordinating Panhellenic events, and acting as the liaison between ADPi and the student body of UCLA. Reporter The Daily Bruin January 2008  –  December 2008  (1 year) Westwood, CA -Obtained sources, researched stories and wrote accurate and interesting pieces for the UCLA student population. \n-Wrote and edited pieces under demanding deadlines, including several stories completed in less than one hour. \n-Archive: http://dailybruin.com/author/bethany_powers/ People Programs Specialist Google October 2013  – Present (1 year 10 months) -Promoted in October 2013 People Programs Specialist Google October 2013  – Present (1 year 10 months) -Promoted in October 2013 People Programs Coordinator Google January 2013  –  October 2013  (10 months) Mountain View -Support the recruiting and hiring process for all hiring decisions made within the company. \n-Manage the review of candidates and provide feedback to recruiters, other coordinators, and executives. People Programs Coordinator Google January 2013  –  October 2013  (10 months) Mountain View -Support the recruiting and hiring process for all hiring decisions made within the company. \n-Manage the review of candidates and provide feedback to recruiters, other coordinators, and executives. Global Online Advertising Associate Google April 2011  –  December 2012  (1 year 9 months) Mountain View, CA -Product specialist in AdWords, AdWords Express, Google Analytics and Google Places. \n-Educated and empowered AdWords advertisers. \n-Mentored peers and interns through quality assurance processes. Global Online Advertising Associate Google April 2011  –  December 2012  (1 year 9 months) Mountain View, CA -Product specialist in AdWords, AdWords Express, Google Analytics and Google Places. \n-Educated and empowered AdWords advertisers. \n-Mentored peers and interns through quality assurance processes. Social Media Intern Yahoo! June 2010  –  December 2010  (7 months) Santa Monica, CA -Developed and directed successful social media campaigns for Yahoo! omg!, Yahoo! TV, and Yahoo! Movies. \n-Worked closely with Yahoo! editorial, product and sales staff to integrate and highlight Yahoo! content into social media avenues.  \n-Tracked growth on Yahoo! Facebook accounts as the number of fans grew over 200% during my internship period. \n-Utilized new social media tools as a social currency that benefitted both the Yahoo! sites and fans, and effectively drove brand awareness and engagement. Social Media Intern Yahoo! June 2010  –  December 2010  (7 months) Santa Monica, CA -Developed and directed successful social media campaigns for Yahoo! omg!, Yahoo! TV, and Yahoo! Movies. \n-Worked closely with Yahoo! editorial, product and sales staff to integrate and highlight Yahoo! content into social media avenues.  \n-Tracked growth on Yahoo! Facebook accounts as the number of fans grew over 200% during my internship period. \n-Utilized new social media tools as a social currency that benefitted both the Yahoo! sites and fans, and effectively drove brand awareness and engagement. Editorial and Social Media Assistant UCLA Magazine January 2009  –  December 2010  (2 years) Westwood, CA -Wrote over 40 stories for UCLA Magazine and their accompanying website, www.magazine.ucla.edu. \n-Proposed story ideas for both the magazine and the website. \n-Maintained and updated the UCLA Magazine website on a weekly basis, utilizing my skills in HTML coding and Adobe Photoshop. \nManaged the UCLA Facebook and Twitter accounts, the primary sites where incoming students can ask questions and expect a timely, personal response. Editorial and Social Media Assistant UCLA Magazine January 2009  –  December 2010  (2 years) Westwood, CA -Wrote over 40 stories for UCLA Magazine and their accompanying website, www.magazine.ucla.edu. \n-Proposed story ideas for both the magazine and the website. \n-Maintained and updated the UCLA Magazine website on a weekly basis, utilizing my skills in HTML coding and Adobe Photoshop. \nManaged the UCLA Facebook and Twitter accounts, the primary sites where incoming students can ask questions and expect a timely, personal response. Celebrity Reporter (Intern) People Magazine January 2010  –  June 2010  (6 months) Los Angeles, CA -Covered dozens of celebrity events, providing accurate and detailed reports and observations. \n-Transformed quotes and interviews into engaging and exciting stories for People Magazine and PEOPLE.com. \n-Researched detailed background information and verified facts for the editorial staff, often under strict deadlines. Celebrity Reporter (Intern) People Magazine January 2010  –  June 2010  (6 months) Los Angeles, CA -Covered dozens of celebrity events, providing accurate and detailed reports and observations. \n-Transformed quotes and interviews into engaging and exciting stories for People Magazine and PEOPLE.com. \n-Researched detailed background information and verified facts for the editorial staff, often under strict deadlines. Panhellenic Delegate Alpha Delta Pi Sorority January 2009  –  January 2010  (1 year 1 month) Westwood, CA -Served on the Executive Board of Alpha Delta Pi.  \n-Responsibilities included attending several weekly meetings, coordinating Panhellenic events, and acting as the liaison between ADPi and the student body of UCLA. Panhellenic Delegate Alpha Delta Pi Sorority January 2009  –  January 2010  (1 year 1 month) Westwood, CA -Served on the Executive Board of Alpha Delta Pi.  \n-Responsibilities included attending several weekly meetings, coordinating Panhellenic events, and acting as the liaison between ADPi and the student body of UCLA. Reporter The Daily Bruin January 2008  –  December 2008  (1 year) Westwood, CA -Obtained sources, researched stories and wrote accurate and interesting pieces for the UCLA student population. \n-Wrote and edited pieces under demanding deadlines, including several stories completed in less than one hour. \n-Archive: http://dailybruin.com/author/bethany_powers/ Reporter The Daily Bruin January 2008  –  December 2008  (1 year) Westwood, CA -Obtained sources, researched stories and wrote accurate and interesting pieces for the UCLA student population. \n-Wrote and edited pieces under demanding deadlines, including several stories completed in less than one hour. \n-Archive: http://dailybruin.com/author/bethany_powers/ Skills Top Skills 3 Google Analytics 2 Social Media Marketing 1 Human Resources 1 Quality Assurance... 1 Google Adwords 1 Customer Service 1 Celebrity Outreach 0 Customer Service... 0 Project Management 0 Peer Mentoring Bethany also knows about... 0 Mentoring New Hires 0 Facebook Marketing 0 Lifestyle Writing 0 Journalism Skills  Top Skills 3 Google Analytics 2 Social Media Marketing 1 Human Resources 1 Quality Assurance... 1 Google Adwords 1 Customer Service 1 Celebrity Outreach 0 Customer Service... 0 Project Management 0 Peer Mentoring Bethany also knows about... 0 Mentoring New Hires 0 Facebook Marketing 0 Lifestyle Writing 0 Journalism Top Skills 3 Google Analytics 2 Social Media Marketing 1 Human Resources 1 Quality Assurance... 1 Google Adwords 1 Customer Service 1 Celebrity Outreach 0 Customer Service... 0 Project Management 0 Peer Mentoring Bethany also knows about... 0 Mentoring New Hires 0 Facebook Marketing 0 Lifestyle Writing 0 Journalism Top Skills 3 Google Analytics 2 Social Media Marketing 1 Human Resources 1 Quality Assurance... 1 Google Adwords 1 Customer Service 1 Celebrity Outreach 0 Customer Service... 0 Project Management 0 Peer Mentoring Bethany also knows about... 0 Mentoring New Hires 0 Facebook Marketing 0 Lifestyle Writing 0 Journalism                     0 Mentoring New Hires 0 Facebook Marketing 0 Lifestyle Writing 0 Journalism Education University of California, Los Angeles B.A.,  American Literature 2007  – 2011 Activities and Societies:  Alpha Delta Pi ,  Sigma Tau Delta English Honor Society ,  Undergraduate Communication Association University of California, Los Angeles B.A.,  American Literature 2007  – 2011 Activities and Societies:  Alpha Delta Pi ,  Sigma Tau Delta English Honor Society ,  Undergraduate Communication Association University of California, Los Angeles B.A.,  American Literature 2007  – 2011 Activities and Societies:  Alpha Delta Pi ,  Sigma Tau Delta English Honor Society ,  Undergraduate Communication Association University of California, Los Angeles B.A.,  American Literature 2007  – 2011 Activities and Societies:  Alpha Delta Pi ,  Sigma Tau Delta English Honor Society ,  Undergraduate Communication Association ", "Experience Ads Policy Specialist YouTube July 2014  – Present (1 year 1 month) San Bruno Collaborate with multiple internal cross-functional stakeholders and with relevant external industry bodies on policy-related issues and projects.  \n \nIdentify gaps or conflicts proactively in existing policy support framework, develop scalable solutions and work to win consensus across the organization. \n \nPromote understanding of policies through crisp documentation and presentation to internal executives and stakeholder teams, and to external agencies when appropriate. \n \nIncrease efficiency through automation, workflow streamlining, and system optimization. Design scalable workflow, systems and infrastructure solutions that enable effective global implementation of new or reformed policies.  \n \nManage rollout of enforcement changes, including providing analytical insights, training enforcement teams and operational support for advertiser issues. Manage the review process for YouTube ads and sales engagement programs, working cross-functionally with sales, compliance and operation teams to ensure that our advertising policies are being enforced correctly and consistently. Global Online Advertising Associate Google 2010  – Present (5 years) Mountain View, California Online Advertising Associate for Small Business Sector (SMB)\t \n• Provides account strategy and troubleshooting support to SMB Advertisers using Google AdWords. \n \n• Maintained above average Quality Ratings quarter after quarter as well as achieving above average Customer Satisfaction for the last seven quarters (95%.) \n \n• Facilitates SMB Service and Sales onboarding by leading 8 days of the rigorous AdWords Academy training. 95% of participants rated 5 out of 5 when assessing course satisfaction. 98% students passed AdWords Fundamentals Exam on the first try. \n \n• Created schedule, course structure, and lecture materials for SMB’s first New Manager Bootcamp; facilitated training and continuous learning sessions throughout the quarter  \n \n• Innovation Team Member responsible for holding quarterly “Fix-It” Session. \n \n• Rotation Product Point of Contact: Responsibilities included keeping members of the rotation abreast of Product changes and updates, identifying areas of necessary development, and organizing trainings to address gaps in product knowledge \n \n• Plans agenda, coordinates speakers, and hosts monthly All Hands events for SMB North America Pre-Kindergarten Teacher Teach For America August 2009  –  July 2011  (2 years) Pre-Kindergarten Charter Teacher in Head Start Classroom\t \n \nSelected as one of 4,000 out of over 45,000 applicants to serve in national service corps of recent college graduates committed to teaching in low-income communities and becoming lifelong leaders and advocates for change \n \n• Developed and implemented math and reading curriculum for Head Start Pre-Kindergarteners \n \n• Achieved above average results with 95% of students attaining over 90% mastery of end of year objectives \n \n• Served as a Second Year Peer Mentor for first year corps members struggling in the classroom \n \n• Conceptualized and initiated a popular pen-pal program now employed throughout Houston region  \n \n• Solely responsible for restructuring the alphabet knowledge Excel tracking system now utilized by all Pre-Kindergarten teachers in Teach For America  \n \n• Assisted with Teach For America matriculation, acting as a personal liaison between the company and potential new corps members \n \n• Presented, planed and collaborated in weekly Professional Learning Committee meetings for a selective cohort of high performing second year corps members Office Administrator UCLA Health System January 2007  –  June 2007  (6 months) Compiled, organized, and maintained health records for over 10,000 research participants \nEdited formal documents written by lead researcher Ads Policy Specialist YouTube July 2014  – Present (1 year 1 month) San Bruno Collaborate with multiple internal cross-functional stakeholders and with relevant external industry bodies on policy-related issues and projects.  \n \nIdentify gaps or conflicts proactively in existing policy support framework, develop scalable solutions and work to win consensus across the organization. \n \nPromote understanding of policies through crisp documentation and presentation to internal executives and stakeholder teams, and to external agencies when appropriate. \n \nIncrease efficiency through automation, workflow streamlining, and system optimization. Design scalable workflow, systems and infrastructure solutions that enable effective global implementation of new or reformed policies.  \n \nManage rollout of enforcement changes, including providing analytical insights, training enforcement teams and operational support for advertiser issues. Manage the review process for YouTube ads and sales engagement programs, working cross-functionally with sales, compliance and operation teams to ensure that our advertising policies are being enforced correctly and consistently. Ads Policy Specialist YouTube July 2014  – Present (1 year 1 month) San Bruno Collaborate with multiple internal cross-functional stakeholders and with relevant external industry bodies on policy-related issues and projects.  \n \nIdentify gaps or conflicts proactively in existing policy support framework, develop scalable solutions and work to win consensus across the organization. \n \nPromote understanding of policies through crisp documentation and presentation to internal executives and stakeholder teams, and to external agencies when appropriate. \n \nIncrease efficiency through automation, workflow streamlining, and system optimization. Design scalable workflow, systems and infrastructure solutions that enable effective global implementation of new or reformed policies.  \n \nManage rollout of enforcement changes, including providing analytical insights, training enforcement teams and operational support for advertiser issues. Manage the review process for YouTube ads and sales engagement programs, working cross-functionally with sales, compliance and operation teams to ensure that our advertising policies are being enforced correctly and consistently. Global Online Advertising Associate Google 2010  – Present (5 years) Mountain View, California Online Advertising Associate for Small Business Sector (SMB)\t \n• Provides account strategy and troubleshooting support to SMB Advertisers using Google AdWords. \n \n• Maintained above average Quality Ratings quarter after quarter as well as achieving above average Customer Satisfaction for the last seven quarters (95%.) \n \n• Facilitates SMB Service and Sales onboarding by leading 8 days of the rigorous AdWords Academy training. 95% of participants rated 5 out of 5 when assessing course satisfaction. 98% students passed AdWords Fundamentals Exam on the first try. \n \n• Created schedule, course structure, and lecture materials for SMB’s first New Manager Bootcamp; facilitated training and continuous learning sessions throughout the quarter  \n \n• Innovation Team Member responsible for holding quarterly “Fix-It” Session. \n \n• Rotation Product Point of Contact: Responsibilities included keeping members of the rotation abreast of Product changes and updates, identifying areas of necessary development, and organizing trainings to address gaps in product knowledge \n \n• Plans agenda, coordinates speakers, and hosts monthly All Hands events for SMB North America Global Online Advertising Associate Google 2010  – Present (5 years) Mountain View, California Online Advertising Associate for Small Business Sector (SMB)\t \n• Provides account strategy and troubleshooting support to SMB Advertisers using Google AdWords. \n \n• Maintained above average Quality Ratings quarter after quarter as well as achieving above average Customer Satisfaction for the last seven quarters (95%.) \n \n• Facilitates SMB Service and Sales onboarding by leading 8 days of the rigorous AdWords Academy training. 95% of participants rated 5 out of 5 when assessing course satisfaction. 98% students passed AdWords Fundamentals Exam on the first try. \n \n• Created schedule, course structure, and lecture materials for SMB’s first New Manager Bootcamp; facilitated training and continuous learning sessions throughout the quarter  \n \n• Innovation Team Member responsible for holding quarterly “Fix-It” Session. \n \n• Rotation Product Point of Contact: Responsibilities included keeping members of the rotation abreast of Product changes and updates, identifying areas of necessary development, and organizing trainings to address gaps in product knowledge \n \n• Plans agenda, coordinates speakers, and hosts monthly All Hands events for SMB North America Pre-Kindergarten Teacher Teach For America August 2009  –  July 2011  (2 years) Pre-Kindergarten Charter Teacher in Head Start Classroom\t \n \nSelected as one of 4,000 out of over 45,000 applicants to serve in national service corps of recent college graduates committed to teaching in low-income communities and becoming lifelong leaders and advocates for change \n \n• Developed and implemented math and reading curriculum for Head Start Pre-Kindergarteners \n \n• Achieved above average results with 95% of students attaining over 90% mastery of end of year objectives \n \n• Served as a Second Year Peer Mentor for first year corps members struggling in the classroom \n \n• Conceptualized and initiated a popular pen-pal program now employed throughout Houston region  \n \n• Solely responsible for restructuring the alphabet knowledge Excel tracking system now utilized by all Pre-Kindergarten teachers in Teach For America  \n \n• Assisted with Teach For America matriculation, acting as a personal liaison between the company and potential new corps members \n \n• Presented, planed and collaborated in weekly Professional Learning Committee meetings for a selective cohort of high performing second year corps members Pre-Kindergarten Teacher Teach For America August 2009  –  July 2011  (2 years) Pre-Kindergarten Charter Teacher in Head Start Classroom\t \n \nSelected as one of 4,000 out of over 45,000 applicants to serve in national service corps of recent college graduates committed to teaching in low-income communities and becoming lifelong leaders and advocates for change \n \n• Developed and implemented math and reading curriculum for Head Start Pre-Kindergarteners \n \n• Achieved above average results with 95% of students attaining over 90% mastery of end of year objectives \n \n• Served as a Second Year Peer Mentor for first year corps members struggling in the classroom \n \n• Conceptualized and initiated a popular pen-pal program now employed throughout Houston region  \n \n• Solely responsible for restructuring the alphabet knowledge Excel tracking system now utilized by all Pre-Kindergarten teachers in Teach For America  \n \n• Assisted with Teach For America matriculation, acting as a personal liaison between the company and potential new corps members \n \n• Presented, planed and collaborated in weekly Professional Learning Committee meetings for a selective cohort of high performing second year corps members Office Administrator UCLA Health System January 2007  –  June 2007  (6 months) Compiled, organized, and maintained health records for over 10,000 research participants \nEdited formal documents written by lead researcher Office Administrator UCLA Health System January 2007  –  June 2007  (6 months) Compiled, organized, and maintained health records for over 10,000 research participants \nEdited formal documents written by lead researcher Skills 5 Microsoft Office 2 Google Adwords... 0 Pre-K to 4th Grade... Skills  5 Microsoft Office 2 Google Adwords... 0 Pre-K to 4th Grade... 5 Microsoft Office 2 Google Adwords... 0 Pre-K to 4th Grade... 5 Microsoft Office 2 Google Adwords... 0 Pre-K to 4th Grade...       Education University of California, Los Angeles BA,  Global Studies ,  Geography 2005  – 2009 Activities and Societies:  Chi Omega Recruitment Director ,  Global Studies Travel Study Participant ,  Daily Bruin Marketing Intern University of California, Los Angeles BA,  Global Studies ,  Geography 2005  – 2009 Activities and Societies:  Chi Omega Recruitment Director ,  Global Studies Travel Study Participant ,  Daily Bruin Marketing Intern University of California, Los Angeles BA,  Global Studies ,  Geography 2005  – 2009 Activities and Societies:  Chi Omega Recruitment Director ,  Global Studies Travel Study Participant ,  Daily Bruin Marketing Intern University of California, Los Angeles BA,  Global Studies ,  Geography 2005  – 2009 Activities and Societies:  Chi Omega Recruitment Director ,  Global Studies Travel Study Participant ,  Daily Bruin Marketing Intern ", "Experience Global Online Advertising Associate Google July 2011  – Present (4 years 1 month) Ann Arbor, MI intern a3integration 2008  –  2010  (2 years) Global Online Advertising Associate Google July 2011  – Present (4 years 1 month) Ann Arbor, MI Global Online Advertising Associate Google July 2011  – Present (4 years 1 month) Ann Arbor, MI intern a3integration 2008  –  2010  (2 years) intern a3integration 2008  –  2010  (2 years) Skills Skills     Education Kalamazoo College 2007  – 2011 Kalamazoo College 2007  – 2011 Kalamazoo College 2007  – 2011 Kalamazoo College 2007  – 2011 ", "Summary I am a passionate advertiser with a degree from the University of Michigan. I am also active within the local ballroom dancing community. Currently, I am working at Google in internal technical support for AdWords products and focusing on product improvements for the Google Display Network. \n \nSpecialties: Google AdWords technical knowledge, Google Display Network, Google Analytics, Google AdSense, Basic web publishing and design (html, CSS), Program knowledge (Word, Outlook, Excel, Adobe Photoshop, Illustrator, Dreamweaver, InDesign) Summary I am a passionate advertiser with a degree from the University of Michigan. I am also active within the local ballroom dancing community. Currently, I am working at Google in internal technical support for AdWords products and focusing on product improvements for the Google Display Network. \n \nSpecialties: Google AdWords technical knowledge, Google Display Network, Google Analytics, Google AdSense, Basic web publishing and design (html, CSS), Program knowledge (Word, Outlook, Excel, Adobe Photoshop, Illustrator, Dreamweaver, InDesign) I am a passionate advertiser with a degree from the University of Michigan. I am also active within the local ballroom dancing community. Currently, I am working at Google in internal technical support for AdWords products and focusing on product improvements for the Google Display Network. \n \nSpecialties: Google AdWords technical knowledge, Google Display Network, Google Analytics, Google AdSense, Basic web publishing and design (html, CSS), Program knowledge (Word, Outlook, Excel, Adobe Photoshop, Illustrator, Dreamweaver, InDesign) I am a passionate advertiser with a degree from the University of Michigan. I am also active within the local ballroom dancing community. Currently, I am working at Google in internal technical support for AdWords products and focusing on product improvements for the Google Display Network. \n \nSpecialties: Google AdWords technical knowledge, Google Display Network, Google Analytics, Google AdSense, Basic web publishing and design (html, CSS), Program knowledge (Word, Outlook, Excel, Adobe Photoshop, Illustrator, Dreamweaver, InDesign) Languages English Polish English Polish English Polish Skills Top Skills 28 Online Advertising 26 Google Analytics 20 Google Adwords 16 Advertising 6 CSS 5 SEM 4 Photoshop 4 Social Media 3 Web Analytics 3 PPC Kasia also knows about... 2 Microsoft Excel 2 Content Management 1 YouTube 0 Email Marketing Skills  Top Skills 28 Online Advertising 26 Google Analytics 20 Google Adwords 16 Advertising 6 CSS 5 SEM 4 Photoshop 4 Social Media 3 Web Analytics 3 PPC Kasia also knows about... 2 Microsoft Excel 2 Content Management 1 YouTube 0 Email Marketing Top Skills 28 Online Advertising 26 Google Analytics 20 Google Adwords 16 Advertising 6 CSS 5 SEM 4 Photoshop 4 Social Media 3 Web Analytics 3 PPC Kasia also knows about... 2 Microsoft Excel 2 Content Management 1 YouTube 0 Email Marketing Top Skills 28 Online Advertising 26 Google Analytics 20 Google Adwords 16 Advertising 6 CSS 5 SEM 4 Photoshop 4 Social Media 3 Web Analytics 3 PPC Kasia also knows about... 2 Microsoft Excel 2 Content Management 1 YouTube 0 Email Marketing                     2 Microsoft Excel 2 Content Management 1 YouTube 0 Email Marketing Honors & Awards ", "Experience Program Manager, Privacy Google February 2014  – Present (1 year 6 months) Mountain View, California Community Manager, Hangouts and Chat Google, Inc July 2012  –  February 2014  (1 year 8 months) Mountain View, California I provide a real-life, human connection between Google and the G+ Hangouts and Chat users. My position also entails keeping users happy and informed, having an ear to the ground to understand user feedback and needs in real time, identifying influential users and arming them with tools to spread the word outside of our communities and support other users within them. \n \n \nFollow me here: https://plus.google.com/u/1/+DoriStorbeck/posts Global Online Advertising Associate Google November 2010  –  July 2012  (1 year 9 months) •\tProvided quality support to hundreds of AdWords advertisers by phone, email, and chat through troubleshooting and offering account optimization recommendations to improve performance and return on investment. \n•\tDrove high customer satisfaction by addressing performance concerns, investigating advertiser questions about AdWords features and navigation, and implementing best practices. \n•\tFocused specifically on Google Analytics, conversion tracking methods, and other technical and troubleshooting issues. \n•\tExperienced with 1:many support and outreach, including identifying and developing programs to scale customer education and support. Research Assistant: Compulsive Hoarding Lab, Randy Frost PhD Smith College August 2009  –  May 2010  (10 months) •\tAnalyzed data from a large Internet study to determine the relationship between indecisiveness, perfectionism, and hoarding; authored an academic paper on the findings, to be presented at a poster session at the 2010 Convention for Applied Behavioral and Cognitive Therapies \n•\tParticipated in weekly lab meetings to build rapport among members and discuss ongoing and upcoming projects  \n•\tRevised and refined research posters on hoarding treatment programs and associations between hoarding, OCD, and ADHD symptoms in clients \n•\tPresented research findings in poster session at the 2009 Convention for Applied Behavioral and Cognitive Therapies Tutorial Assistant Jacobson Center, Smith College January 2009  –  May 2010  (1 year 5 months) •\tFriendly first point of contact for students needing tutorial or writing assistance; helped students effectively use the Center’s services by providing information, referral, and encouragement \n•\tAnswered phone calls, e-mails, and drop-in visits while coordinating tutor reports, arranging Center records, and maintaining database of tutor hours \n•\tAssisted Tutorial Services Coordinator with bi-weekly payroll duties Research Assistant: Mental Control Lab, Daniel Wegner PhD Harvard University May 2009  –  August 2009  (4 months) •\tDirected in-lab studies and administered surveys investigating topics of self-control, conscious will, mind perception, and moral judgment to a diverse population (ranging from the homeless to University students and faculty) on the streets of Cambridge \n•\tConsulted graduate students, other RAs to compose and improve surveys and refine protocols for in-lab studies \n•\tProvided feedback on surveys, lab studies, and data collection methods; helped generate ideas to enhance results \n•\tCollaborated with other RAs to code, enter, organize, clean, and analyze data using SPSS Research Assistant Psychological Services Center, U-Mass Amherst May 2008  –  September 2008  (5 months) •\tWorked with director of PSC, assistant professors, graduate students, and other research assistants to polish research study protocols  \n•\tMet with new patients prior to their interaction with a clinician to obtain informed consent for ongoing research studies \n•\tCompleted data entry for research study measures completed at several checkpoints by both patients and their therapists Campus Center Cafe - Barista (Summer) Smith College May 2008  –  August 2008  (4 months) •\tProvided high level of polite, attentive customer service through hectic, high-traffic meal times; handled cash transactions  \n•\tTrained new employee to prepare drinks, operate cash register, and communicate with customers \n•\tPraised by manager and staff for positive attitude, self-starter initiative, and skillful handling of challenging customers \n•\tRequested extra responsibilities to ensure organization and cleanliness of daily café operation Research Assistant: Perception and Action Lab, Michael Richardson PhD Colby College September 2006  –  December 2006  (4 months) •\tConducted online research of publications and summarized published articles to keep professor up to date \n•\tCreated reference databases using Endnote \n•\tProvided professor with updates at frequent one-on-one meetings Barn Manager and Camp Counselor Pompositticut Farm Day Camp May 2004  –  August 2006  (2 years 4 months) •\tSupervised and coached staff of 6 resulting in improved teamwork, enhanced communication, and greater motivation \n•\tUtilized problem-solving skills and creativity to engage campers of different ages, experiences, and backgrounds, and to promote mutual respect, support, and teamwork among children and staff from a variety of cultures \n•\tIndependently developed camp equine program and educational curriculum to educate a diverse group of up to 10 teenagers aged 12-16 \n•\tManaged health and wellness of up to 36 horses; provided on-call emergency equine medical services Program Manager, Privacy Google February 2014  – Present (1 year 6 months) Mountain View, California Program Manager, Privacy Google February 2014  – Present (1 year 6 months) Mountain View, California Community Manager, Hangouts and Chat Google, Inc July 2012  –  February 2014  (1 year 8 months) Mountain View, California I provide a real-life, human connection between Google and the G+ Hangouts and Chat users. My position also entails keeping users happy and informed, having an ear to the ground to understand user feedback and needs in real time, identifying influential users and arming them with tools to spread the word outside of our communities and support other users within them. \n \n \nFollow me here: https://plus.google.com/u/1/+DoriStorbeck/posts Community Manager, Hangouts and Chat Google, Inc July 2012  –  February 2014  (1 year 8 months) Mountain View, California I provide a real-life, human connection between Google and the G+ Hangouts and Chat users. My position also entails keeping users happy and informed, having an ear to the ground to understand user feedback and needs in real time, identifying influential users and arming them with tools to spread the word outside of our communities and support other users within them. \n \n \nFollow me here: https://plus.google.com/u/1/+DoriStorbeck/posts Global Online Advertising Associate Google November 2010  –  July 2012  (1 year 9 months) •\tProvided quality support to hundreds of AdWords advertisers by phone, email, and chat through troubleshooting and offering account optimization recommendations to improve performance and return on investment. \n•\tDrove high customer satisfaction by addressing performance concerns, investigating advertiser questions about AdWords features and navigation, and implementing best practices. \n•\tFocused specifically on Google Analytics, conversion tracking methods, and other technical and troubleshooting issues. \n•\tExperienced with 1:many support and outreach, including identifying and developing programs to scale customer education and support. Global Online Advertising Associate Google November 2010  –  July 2012  (1 year 9 months) •\tProvided quality support to hundreds of AdWords advertisers by phone, email, and chat through troubleshooting and offering account optimization recommendations to improve performance and return on investment. \n•\tDrove high customer satisfaction by addressing performance concerns, investigating advertiser questions about AdWords features and navigation, and implementing best practices. \n•\tFocused specifically on Google Analytics, conversion tracking methods, and other technical and troubleshooting issues. \n•\tExperienced with 1:many support and outreach, including identifying and developing programs to scale customer education and support. Research Assistant: Compulsive Hoarding Lab, Randy Frost PhD Smith College August 2009  –  May 2010  (10 months) •\tAnalyzed data from a large Internet study to determine the relationship between indecisiveness, perfectionism, and hoarding; authored an academic paper on the findings, to be presented at a poster session at the 2010 Convention for Applied Behavioral and Cognitive Therapies \n•\tParticipated in weekly lab meetings to build rapport among members and discuss ongoing and upcoming projects  \n•\tRevised and refined research posters on hoarding treatment programs and associations between hoarding, OCD, and ADHD symptoms in clients \n•\tPresented research findings in poster session at the 2009 Convention for Applied Behavioral and Cognitive Therapies Research Assistant: Compulsive Hoarding Lab, Randy Frost PhD Smith College August 2009  –  May 2010  (10 months) •\tAnalyzed data from a large Internet study to determine the relationship between indecisiveness, perfectionism, and hoarding; authored an academic paper on the findings, to be presented at a poster session at the 2010 Convention for Applied Behavioral and Cognitive Therapies \n•\tParticipated in weekly lab meetings to build rapport among members and discuss ongoing and upcoming projects  \n•\tRevised and refined research posters on hoarding treatment programs and associations between hoarding, OCD, and ADHD symptoms in clients \n•\tPresented research findings in poster session at the 2009 Convention for Applied Behavioral and Cognitive Therapies Tutorial Assistant Jacobson Center, Smith College January 2009  –  May 2010  (1 year 5 months) •\tFriendly first point of contact for students needing tutorial or writing assistance; helped students effectively use the Center’s services by providing information, referral, and encouragement \n•\tAnswered phone calls, e-mails, and drop-in visits while coordinating tutor reports, arranging Center records, and maintaining database of tutor hours \n•\tAssisted Tutorial Services Coordinator with bi-weekly payroll duties Tutorial Assistant Jacobson Center, Smith College January 2009  –  May 2010  (1 year 5 months) •\tFriendly first point of contact for students needing tutorial or writing assistance; helped students effectively use the Center’s services by providing information, referral, and encouragement \n•\tAnswered phone calls, e-mails, and drop-in visits while coordinating tutor reports, arranging Center records, and maintaining database of tutor hours \n•\tAssisted Tutorial Services Coordinator with bi-weekly payroll duties Research Assistant: Mental Control Lab, Daniel Wegner PhD Harvard University May 2009  –  August 2009  (4 months) •\tDirected in-lab studies and administered surveys investigating topics of self-control, conscious will, mind perception, and moral judgment to a diverse population (ranging from the homeless to University students and faculty) on the streets of Cambridge \n•\tConsulted graduate students, other RAs to compose and improve surveys and refine protocols for in-lab studies \n•\tProvided feedback on surveys, lab studies, and data collection methods; helped generate ideas to enhance results \n•\tCollaborated with other RAs to code, enter, organize, clean, and analyze data using SPSS Research Assistant: Mental Control Lab, Daniel Wegner PhD Harvard University May 2009  –  August 2009  (4 months) •\tDirected in-lab studies and administered surveys investigating topics of self-control, conscious will, mind perception, and moral judgment to a diverse population (ranging from the homeless to University students and faculty) on the streets of Cambridge \n•\tConsulted graduate students, other RAs to compose and improve surveys and refine protocols for in-lab studies \n•\tProvided feedback on surveys, lab studies, and data collection methods; helped generate ideas to enhance results \n•\tCollaborated with other RAs to code, enter, organize, clean, and analyze data using SPSS Research Assistant Psychological Services Center, U-Mass Amherst May 2008  –  September 2008  (5 months) •\tWorked with director of PSC, assistant professors, graduate students, and other research assistants to polish research study protocols  \n•\tMet with new patients prior to their interaction with a clinician to obtain informed consent for ongoing research studies \n•\tCompleted data entry for research study measures completed at several checkpoints by both patients and their therapists Research Assistant Psychological Services Center, U-Mass Amherst May 2008  –  September 2008  (5 months) •\tWorked with director of PSC, assistant professors, graduate students, and other research assistants to polish research study protocols  \n•\tMet with new patients prior to their interaction with a clinician to obtain informed consent for ongoing research studies \n•\tCompleted data entry for research study measures completed at several checkpoints by both patients and their therapists Campus Center Cafe - Barista (Summer) Smith College May 2008  –  August 2008  (4 months) •\tProvided high level of polite, attentive customer service through hectic, high-traffic meal times; handled cash transactions  \n•\tTrained new employee to prepare drinks, operate cash register, and communicate with customers \n•\tPraised by manager and staff for positive attitude, self-starter initiative, and skillful handling of challenging customers \n•\tRequested extra responsibilities to ensure organization and cleanliness of daily café operation Campus Center Cafe - Barista (Summer) Smith College May 2008  –  August 2008  (4 months) •\tProvided high level of polite, attentive customer service through hectic, high-traffic meal times; handled cash transactions  \n•\tTrained new employee to prepare drinks, operate cash register, and communicate with customers \n•\tPraised by manager and staff for positive attitude, self-starter initiative, and skillful handling of challenging customers \n•\tRequested extra responsibilities to ensure organization and cleanliness of daily café operation Research Assistant: Perception and Action Lab, Michael Richardson PhD Colby College September 2006  –  December 2006  (4 months) •\tConducted online research of publications and summarized published articles to keep professor up to date \n•\tCreated reference databases using Endnote \n•\tProvided professor with updates at frequent one-on-one meetings Research Assistant: Perception and Action Lab, Michael Richardson PhD Colby College September 2006  –  December 2006  (4 months) •\tConducted online research of publications and summarized published articles to keep professor up to date \n•\tCreated reference databases using Endnote \n•\tProvided professor with updates at frequent one-on-one meetings Barn Manager and Camp Counselor Pompositticut Farm Day Camp May 2004  –  August 2006  (2 years 4 months) •\tSupervised and coached staff of 6 resulting in improved teamwork, enhanced communication, and greater motivation \n•\tUtilized problem-solving skills and creativity to engage campers of different ages, experiences, and backgrounds, and to promote mutual respect, support, and teamwork among children and staff from a variety of cultures \n•\tIndependently developed camp equine program and educational curriculum to educate a diverse group of up to 10 teenagers aged 12-16 \n•\tManaged health and wellness of up to 36 horses; provided on-call emergency equine medical services Barn Manager and Camp Counselor Pompositticut Farm Day Camp May 2004  –  August 2006  (2 years 4 months) •\tSupervised and coached staff of 6 resulting in improved teamwork, enhanced communication, and greater motivation \n•\tUtilized problem-solving skills and creativity to engage campers of different ages, experiences, and backgrounds, and to promote mutual respect, support, and teamwork among children and staff from a variety of cultures \n•\tIndependently developed camp equine program and educational curriculum to educate a diverse group of up to 10 teenagers aged 12-16 \n•\tManaged health and wellness of up to 36 horses; provided on-call emergency equine medical services Skills Top Skills 10 Google Analytics 8 SPSS 8 Online Advertising 7 Research 4 Google Adwords 3 Teaching 3 Microsoft Office 2 Community Management 1 Writing 1 Quality Assurance Dori also knows about... 1 Google+ 0 Psychology 0 Basic Programming 0 Customer Satisfaction 0 Outstanding Customer... 0 Cold Calling 0 PC 0 Mac OS 0 Google Docs 0 Cycling 0 Cooking 0 Forums 0 Forum Postings 0 Hangouts 0 Hangouts On Air (HOA) Skills  Top Skills 10 Google Analytics 8 SPSS 8 Online Advertising 7 Research 4 Google Adwords 3 Teaching 3 Microsoft Office 2 Community Management 1 Writing 1 Quality Assurance Dori also knows about... 1 Google+ 0 Psychology 0 Basic Programming 0 Customer Satisfaction 0 Outstanding Customer... 0 Cold Calling 0 PC 0 Mac OS 0 Google Docs 0 Cycling 0 Cooking 0 Forums 0 Forum Postings 0 Hangouts 0 Hangouts On Air (HOA) Top Skills 10 Google Analytics 8 SPSS 8 Online Advertising 7 Research 4 Google Adwords 3 Teaching 3 Microsoft Office 2 Community Management 1 Writing 1 Quality Assurance Dori also knows about... 1 Google+ 0 Psychology 0 Basic Programming 0 Customer Satisfaction 0 Outstanding Customer... 0 Cold Calling 0 PC 0 Mac OS 0 Google Docs 0 Cycling 0 Cooking 0 Forums 0 Forum Postings 0 Hangouts 0 Hangouts On Air (HOA) Top Skills 10 Google Analytics 8 SPSS 8 Online Advertising 7 Research 4 Google Adwords 3 Teaching 3 Microsoft Office 2 Community Management 1 Writing 1 Quality Assurance Dori also knows about... 1 Google+ 0 Psychology 0 Basic Programming 0 Customer Satisfaction 0 Outstanding Customer... 0 Cold Calling 0 PC 0 Mac OS 0 Google Docs 0 Cycling 0 Cooking 0 Forums 0 Forum Postings 0 Hangouts 0 Hangouts On Air (HOA)                     1 Google+ 0 Psychology 0 Basic Programming 0 Customer Satisfaction 0 Outstanding Customer... 0 Cold Calling 0 PC 0 Mac OS 0 Google Docs 0 Cycling 0 Cooking 0 Forums 0 Forum Postings 0 Hangouts 0 Hangouts On Air (HOA) Education Smith College B.A.,  Psychology 2007  – 2010 Activities and Societies:  •\tPhi Beta Kappa ,  Academic Honor Society\n•\tSigma Xi Associate Member ,  Scientific Research Society\n•\tPsi Chi ,  National Honor Society in Psychology ,  Smith College Chapter\n•\tMember of Smith College Judicial Board ,  Smith College\n•\tMember of Campus Center Activities Board ,  Smith College Colby College 2006  – 2006 Concord Academy Smith College B.A.,  Psychology 2007  – 2010 Activities and Societies:  •\tPhi Beta Kappa ,  Academic Honor Society\n•\tSigma Xi Associate Member ,  Scientific Research Society\n•\tPsi Chi ,  National Honor Society in Psychology ,  Smith College Chapter\n•\tMember of Smith College Judicial Board ,  Smith College\n•\tMember of Campus Center Activities Board ,  Smith College Smith College B.A.,  Psychology 2007  – 2010 Activities and Societies:  •\tPhi Beta Kappa ,  Academic Honor Society\n•\tSigma Xi Associate Member ,  Scientific Research Society\n•\tPsi Chi ,  National Honor Society in Psychology ,  Smith College Chapter\n•\tMember of Smith College Judicial Board ,  Smith College\n•\tMember of Campus Center Activities Board ,  Smith College Smith College B.A.,  Psychology 2007  – 2010 Activities and Societies:  •\tPhi Beta Kappa ,  Academic Honor Society\n•\tSigma Xi Associate Member ,  Scientific Research Society\n•\tPsi Chi ,  National Honor Society in Psychology ,  Smith College Chapter\n•\tMember of Smith College Judicial Board ,  Smith College\n•\tMember of Campus Center Activities Board ,  Smith College Colby College 2006  – 2006 Colby College 2006  – 2006 Colby College 2006  – 2006 Concord Academy Concord Academy Concord Academy Honors & Awards ", "Summary A seasoned technology professional; I draw on 5 years of ads product development, sales experience, and expertise in customer data/CRM systems to help guide operational and product decisionmaking. My tapestry of skills allows me to evaluate the business-readiness of new sales strategies, alpha-products, and existing product changes. I specialize in conducting meaningful ad-hoc analysis, presenting clear, comprehensible, data insights, and challenging decision-makers to question assumptions about their product and business. Summary A seasoned technology professional; I draw on 5 years of ads product development, sales experience, and expertise in customer data/CRM systems to help guide operational and product decisionmaking. My tapestry of skills allows me to evaluate the business-readiness of new sales strategies, alpha-products, and existing product changes. I specialize in conducting meaningful ad-hoc analysis, presenting clear, comprehensible, data insights, and challenging decision-makers to question assumptions about their product and business. A seasoned technology professional; I draw on 5 years of ads product development, sales experience, and expertise in customer data/CRM systems to help guide operational and product decisionmaking. My tapestry of skills allows me to evaluate the business-readiness of new sales strategies, alpha-products, and existing product changes. I specialize in conducting meaningful ad-hoc analysis, presenting clear, comprehensible, data insights, and challenging decision-makers to question assumptions about their product and business. A seasoned technology professional; I draw on 5 years of ads product development, sales experience, and expertise in customer data/CRM systems to help guide operational and product decisionmaking. My tapestry of skills allows me to evaluate the business-readiness of new sales strategies, alpha-products, and existing product changes. I specialize in conducting meaningful ad-hoc analysis, presenting clear, comprehensible, data insights, and challenging decision-makers to question assumptions about their product and business. Experience Operations Analyst Google January 2014  – Present (1 year 7 months) - Design and manage confidential product development tests for existing and early-stage alpha products  \n \n- Use SQL to define highly specific customer pilot segments and split test product performance  \n \n- Provide analytic support to sales, design workflow, and create dashboards measuring team progress towards targets \n \n- Manage data collection and analysis to understand the market potential of new offerings or proposed changes \n \n- Lead data analysis and visualization of learnings for team decks, weekly reporting, and executive presentations (Open) 1 course Python (8 week course) See more Agency Strategist Google April 2011  –  December 2013  (2 years 9 months) - Chosen as a founding member to construct the agency strategist role for SMB globally based on product and analytical expertise and helped grow it into a global team. \n \n- Managed a businesses portfolio of over $90M in annual spend. \n \n- Worked with over 50 advertising agency partners in 2 years on nearly 600 clients to manage, optimize, and grow their digital advertising spend with Google.  \n \n- Collaborated with the product management and engineering teams within Google to enhance features based on customer feedback. (Open) 2 projects New Business Development Rotation, Brazil - Lead business development project which established a $1.2M revenue source for the Brazilian Inside Sales Team\n- Founded... View Scaled Customer Marketing - Managed email lead generation project\n- Proposed and implemented a call tracking framework (phone tree) for 70,000... View Global Online Advertising Associate Google August 2010  –  March 2011  (8 months) Research Intern The Carter Center April 2009  –  August 2009  (5 months) Greater Atlanta Area I researched a new approach to refugee land issues using satellite data which eventually lead to pilot policy initiative. I also assessed the language and feasibility of mediation policy content for President Jimmy Carter’s aids and drafted time-critical geopolitical briefs circulated to President Carter and his upper level staff. Research Intern Middlebury Institute of International Studies at Monterey June 2008  –  August 2008  (3 months) I conducted research on chemical and biological weapons, disarmament and nuclear nonproliferation and specifically lead an investigation project on rogue Botulinum toxin production and weaponization. Operations Analyst Google January 2014  – Present (1 year 7 months) - Design and manage confidential product development tests for existing and early-stage alpha products  \n \n- Use SQL to define highly specific customer pilot segments and split test product performance  \n \n- Provide analytic support to sales, design workflow, and create dashboards measuring team progress towards targets \n \n- Manage data collection and analysis to understand the market potential of new offerings or proposed changes \n \n- Lead data analysis and visualization of learnings for team decks, weekly reporting, and executive presentations (Open) 1 course Python (8 week course) See more Operations Analyst Google January 2014  – Present (1 year 7 months) - Design and manage confidential product development tests for existing and early-stage alpha products  \n \n- Use SQL to define highly specific customer pilot segments and split test product performance  \n \n- Provide analytic support to sales, design workflow, and create dashboards measuring team progress towards targets \n \n- Manage data collection and analysis to understand the market potential of new offerings or proposed changes \n \n- Lead data analysis and visualization of learnings for team decks, weekly reporting, and executive presentations (Open) 1 course Python (8 week course) See more Agency Strategist Google April 2011  –  December 2013  (2 years 9 months) - Chosen as a founding member to construct the agency strategist role for SMB globally based on product and analytical expertise and helped grow it into a global team. \n \n- Managed a businesses portfolio of over $90M in annual spend. \n \n- Worked with over 50 advertising agency partners in 2 years on nearly 600 clients to manage, optimize, and grow their digital advertising spend with Google.  \n \n- Collaborated with the product management and engineering teams within Google to enhance features based on customer feedback. (Open) 2 projects New Business Development Rotation, Brazil - Lead business development project which established a $1.2M revenue source for the Brazilian Inside Sales Team\n- Founded... View Scaled Customer Marketing - Managed email lead generation project\n- Proposed and implemented a call tracking framework (phone tree) for 70,000... View Agency Strategist Google April 2011  –  December 2013  (2 years 9 months) - Chosen as a founding member to construct the agency strategist role for SMB globally based on product and analytical expertise and helped grow it into a global team. \n \n- Managed a businesses portfolio of over $90M in annual spend. \n \n- Worked with over 50 advertising agency partners in 2 years on nearly 600 clients to manage, optimize, and grow their digital advertising spend with Google.  \n \n- Collaborated with the product management and engineering teams within Google to enhance features based on customer feedback. (Open) 2 projects New Business Development Rotation, Brazil - Lead business development project which established a $1.2M revenue source for the Brazilian Inside Sales Team\n- Founded... View Scaled Customer Marketing - Managed email lead generation project\n- Proposed and implemented a call tracking framework (phone tree) for 70,000... View Global Online Advertising Associate Google August 2010  –  March 2011  (8 months) Global Online Advertising Associate Google August 2010  –  March 2011  (8 months) Research Intern The Carter Center April 2009  –  August 2009  (5 months) Greater Atlanta Area I researched a new approach to refugee land issues using satellite data which eventually lead to pilot policy initiative. I also assessed the language and feasibility of mediation policy content for President Jimmy Carter’s aids and drafted time-critical geopolitical briefs circulated to President Carter and his upper level staff. Research Intern The Carter Center April 2009  –  August 2009  (5 months) Greater Atlanta Area I researched a new approach to refugee land issues using satellite data which eventually lead to pilot policy initiative. I also assessed the language and feasibility of mediation policy content for President Jimmy Carter’s aids and drafted time-critical geopolitical briefs circulated to President Carter and his upper level staff. Research Intern Middlebury Institute of International Studies at Monterey June 2008  –  August 2008  (3 months) I conducted research on chemical and biological weapons, disarmament and nuclear nonproliferation and specifically lead an investigation project on rogue Botulinum toxin production and weaponization. Research Intern Middlebury Institute of International Studies at Monterey June 2008  –  August 2008  (3 months) I conducted research on chemical and biological weapons, disarmament and nuclear nonproliferation and specifically lead an investigation project on rogue Botulinum toxin production and weaponization. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Top Skills 1 Data Analysis 1 Project Management 0 Sales Operations 2 Web Analytics 0 Product Development 0 Product Management 1 SQL 0 CRM 2 Analytics 0 New Business Development Alex also knows about... 0 Digital Strategy 0 data 0 ROI Optimization 0 Strategic Partnerships 11 Google Analytics 11 Google Adwords 20 Online Advertising 11 SEM 7 Social Media 3 Policy Analysis 4 Digital Marketing 2 SEO 3 Web Marketing 2 PPC 1 Political Campaigns 0 Mobile Advertising 0 Affiliate Marketing 0 Mobile Marketing 0 YouTube 0 E-commerce 1 Social Media Marketing 0 Lead Generation 0 Email Marketing 0 Military History 0 High Tech Sales 0 Technology Guru 0 Surfing 0 Marketing Strategy 0 Marketing 0 Digital Media 0 Advertising 0 Strategy 0 Testing 0 Community Management 0 Management 0 Start-ups 0 Business Development 0 Analysis 0 Entrepreneurship 0 Microsoft Excel See 25+     See less Skills  Top Skills 1 Data Analysis 1 Project Management 0 Sales Operations 2 Web Analytics 0 Product Development 0 Product Management 1 SQL 0 CRM 2 Analytics 0 New Business Development Alex also knows about... 0 Digital Strategy 0 data 0 ROI Optimization 0 Strategic Partnerships 11 Google Analytics 11 Google Adwords 20 Online Advertising 11 SEM 7 Social Media 3 Policy Analysis 4 Digital Marketing 2 SEO 3 Web Marketing 2 PPC 1 Political Campaigns 0 Mobile Advertising 0 Affiliate Marketing 0 Mobile Marketing 0 YouTube 0 E-commerce 1 Social Media Marketing 0 Lead Generation 0 Email Marketing 0 Military History 0 High Tech Sales 0 Technology Guru 0 Surfing 0 Marketing Strategy 0 Marketing 0 Digital Media 0 Advertising 0 Strategy 0 Testing 0 Community Management 0 Management 0 Start-ups 0 Business Development 0 Analysis 0 Entrepreneurship 0 Microsoft Excel See 25+     See less Top Skills 1 Data Analysis 1 Project Management 0 Sales Operations 2 Web Analytics 0 Product Development 0 Product Management 1 SQL 0 CRM 2 Analytics 0 New Business Development Alex also knows about... 0 Digital Strategy 0 data 0 ROI Optimization 0 Strategic Partnerships 11 Google Analytics 11 Google Adwords 20 Online Advertising 11 SEM 7 Social Media 3 Policy Analysis 4 Digital Marketing 2 SEO 3 Web Marketing 2 PPC 1 Political Campaigns 0 Mobile Advertising 0 Affiliate Marketing 0 Mobile Marketing 0 YouTube 0 E-commerce 1 Social Media Marketing 0 Lead Generation 0 Email Marketing 0 Military History 0 High Tech Sales 0 Technology Guru 0 Surfing 0 Marketing Strategy 0 Marketing 0 Digital Media 0 Advertising 0 Strategy 0 Testing 0 Community Management 0 Management 0 Start-ups 0 Business Development 0 Analysis 0 Entrepreneurship 0 Microsoft Excel See 25+     See less Top Skills 1 Data Analysis 1 Project Management 0 Sales Operations 2 Web Analytics 0 Product Development 0 Product Management 1 SQL 0 CRM 2 Analytics 0 New Business Development Alex also knows about... 0 Digital Strategy 0 data 0 ROI Optimization 0 Strategic Partnerships 11 Google Analytics 11 Google Adwords 20 Online Advertising 11 SEM 7 Social Media 3 Policy Analysis 4 Digital Marketing 2 SEO 3 Web Marketing 2 PPC 1 Political Campaigns 0 Mobile Advertising 0 Affiliate Marketing 0 Mobile Marketing 0 YouTube 0 E-commerce 1 Social Media Marketing 0 Lead Generation 0 Email Marketing 0 Military History 0 High Tech Sales 0 Technology Guru 0 Surfing 0 Marketing Strategy 0 Marketing 0 Digital Media 0 Advertising 0 Strategy 0 Testing 0 Community Management 0 Management 0 Start-ups 0 Business Development 0 Analysis 0 Entrepreneurship 0 Microsoft Excel See 25+     See less                     0 Digital Strategy 0 data 0 ROI Optimization 0 Strategic Partnerships 11 Google Analytics 11 Google Adwords 20 Online Advertising 11 SEM 7 Social Media 3 Policy Analysis 4 Digital Marketing 2 SEO 3 Web Marketing 2 PPC 1 Political Campaigns 0 Mobile Advertising 0 Affiliate Marketing 0 Mobile Marketing 0 YouTube 0 E-commerce 1 Social Media Marketing 0 Lead Generation 0 Email Marketing 0 Military History 0 High Tech Sales 0 Technology Guru 0 Surfing 0 Marketing Strategy 0 Marketing 0 Digital Media 0 Advertising 0 Strategy 0 Testing 0 Community Management 0 Management 0 Start-ups 0 Business Development 0 Analysis 0 Entrepreneurship 0 Microsoft Excel Education Carleton College BA,  Political Science , 3.87 2006  – 2010 Activities and Societies:  Distinction in major ,  Magna Cum Laude\nPhi Beta Kappa National Honor Society ,  Student Senate new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool Carleton College BA,  Political Science , 3.87 2006  – 2010 Activities and Societies:  Distinction in major ,  Magna Cum Laude\nPhi Beta Kappa National Honor Society ,  Student Senate Carleton College BA,  Political Science , 3.87 2006  – 2010 Activities and Societies:  Distinction in major ,  Magna Cum Laude\nPhi Beta Kappa National Honor Society ,  Student Senate Carleton College BA,  Political Science , 3.87 2006  – 2010 Activities and Societies:  Distinction in major ,  Magna Cum Laude\nPhi Beta Kappa National Honor Society ,  Student Senate new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool new community jewish highschool ", "Experience Owner, Web Marketing Consultant Spruce, LLC June 2013  – Present (2 years 2 months) Greater Milwaukee Area • Social media management \n• Content creation / copywriting \n• Community management \n• Search engine marketing \n• Social media consulting & training \n• Brand strategy Community Manager Google July 2011  –  May 2013  (1 year 11 months) Mountain View, CA • Support and engage users via social, forums and email for Calendar, Hangouts, Chat, and Gmail \n• Report key community trends to cross-functional partners via weekly/biweekly community reports \n• Triage user issues and file bugs / feature requests to product/engineering team (60+ per quarter) \n• Create content for product launches and channel user stories for marketing campaigns \n• Coordinate social channel posting schedule and content with Google+ / Gmail teams \n• Train new-hire Community Managers by auditing materials and hosting/coordinating modules \n• Planned/hosted SXSW event Happy Hour and designed/ordered swag for 100+ VIP users \n• Developed and managed Trusted Tester program to monitor feedback and surface issues with experimental product versions and grow relationships with power users/VIPs \n \n**Awarded 9 peer bonuses and 1 Gold Award for User Advocacy (Open) 1 recommendation Keith Rabkin Head of Build Planning and Operations Katherine was an excellent community manager who not only launched the Google community for Hangouts and Chat, but grew it into one of the most thriving at Google. She possesses all the important skills for managing a community and managed to... View Global Online Advertising Associate Google January 2010  –  July 2011  (1 year 7 months) Support \n•Provide general and specialized (technical/troubleshooting/billing) phone/chat/email support for North America advertisers \n•Determine Top Issues of focus for verbalization/training exercises from phone Top Issue volume data \n \nQuality Assurance Team \n•Support 6 customer service representatives as mentor/coach \n•Derive high-level trends of both strength/development \n•Deliver potentially difficult feedback in live coaching sessions \n•Review 40+ interactions quarterly \n•Deliver positive and difficult written feedback \n•Serve as Quality Blog North America POC: write 3+ posts quarterly, coordinate/edit all posting to ensure global applicability, design/market contest to boost interaction/reviewer contribution/readership \n \nMisc. \n•Audit Trainings and lead Noogler onboarding/training \n•Google Cares Communication Team (Q3 2010- Q1 2011) People Ops Program Coordinator, Employee Referral Team, On Site at Google WorkforceLogic October 2009  –  December 2009  (3 months) •Analyze and reply to referral@google.com alias inquiries and requests \n•Maintain internal guide and resources to assist recruiters in processing Employee Referrals \n•Support \"Make a Google Match\" contest to incentivize referrals: adapt and revise content for messaging and promotions to 10,000+ Googlers \n•Determine prizes and deliver to local winners as Make a Google Match “Prize Patrol” Branding/Social Media Strategist 1stGig.com August 2009  –  October 2009  (3 months) (Open) 1 recommendation Ginger Terrell - Growth Director Creative | Recruiting | Referral Networking | Event Planning | Business Consulting/Training | Social Media | Blogs | BNI Katherine has a way with words - both spoken and written. Her blogging and presentation skills are impeccable and she is creative with her content. Katherine and I worked remotely together at 1stGig and she was helpful, easy to connect with,... View Conference Coordinator, Facilitator & Technician Madison Videoconference December 2004  –  October 2009  (4 years 11 months) (Open) 2 recommendations Annette Rolain Summer Associate Law Clerk at Wilson Elser I worked with Katherine for two and a half years at Madison Videoconference, and as Conference Coordinator she managed me... View Robert Gramann President, Gramann Reporting, Ltd. Katherine has been an integral part of our Madison operations since her becoming involved with Madison Videoconference in... View Customer Service Specialist Gramann Reporting May 2002  –  October 2009  (7 years 6 months) Owner, Web Marketing Consultant Spruce, LLC June 2013  – Present (2 years 2 months) Greater Milwaukee Area • Social media management \n• Content creation / copywriting \n• Community management \n• Search engine marketing \n• Social media consulting & training \n• Brand strategy Owner, Web Marketing Consultant Spruce, LLC June 2013  – Present (2 years 2 months) Greater Milwaukee Area • Social media management \n• Content creation / copywriting \n• Community management \n• Search engine marketing \n• Social media consulting & training \n• Brand strategy Community Manager Google July 2011  –  May 2013  (1 year 11 months) Mountain View, CA • Support and engage users via social, forums and email for Calendar, Hangouts, Chat, and Gmail \n• Report key community trends to cross-functional partners via weekly/biweekly community reports \n• Triage user issues and file bugs / feature requests to product/engineering team (60+ per quarter) \n• Create content for product launches and channel user stories for marketing campaigns \n• Coordinate social channel posting schedule and content with Google+ / Gmail teams \n• Train new-hire Community Managers by auditing materials and hosting/coordinating modules \n• Planned/hosted SXSW event Happy Hour and designed/ordered swag for 100+ VIP users \n• Developed and managed Trusted Tester program to monitor feedback and surface issues with experimental product versions and grow relationships with power users/VIPs \n \n**Awarded 9 peer bonuses and 1 Gold Award for User Advocacy (Open) 1 recommendation Keith Rabkin Head of Build Planning and Operations Katherine was an excellent community manager who not only launched the Google community for Hangouts and Chat, but grew it into one of the most thriving at Google. She possesses all the important skills for managing a community and managed to... View Community Manager Google July 2011  –  May 2013  (1 year 11 months) Mountain View, CA • Support and engage users via social, forums and email for Calendar, Hangouts, Chat, and Gmail \n• Report key community trends to cross-functional partners via weekly/biweekly community reports \n• Triage user issues and file bugs / feature requests to product/engineering team (60+ per quarter) \n• Create content for product launches and channel user stories for marketing campaigns \n• Coordinate social channel posting schedule and content with Google+ / Gmail teams \n• Train new-hire Community Managers by auditing materials and hosting/coordinating modules \n• Planned/hosted SXSW event Happy Hour and designed/ordered swag for 100+ VIP users \n• Developed and managed Trusted Tester program to monitor feedback and surface issues with experimental product versions and grow relationships with power users/VIPs \n \n**Awarded 9 peer bonuses and 1 Gold Award for User Advocacy (Open) 1 recommendation Keith Rabkin Head of Build Planning and Operations Katherine was an excellent community manager who not only launched the Google community for Hangouts and Chat, but grew it into one of the most thriving at Google. She possesses all the important skills for managing a community and managed to... View Global Online Advertising Associate Google January 2010  –  July 2011  (1 year 7 months) Support \n•Provide general and specialized (technical/troubleshooting/billing) phone/chat/email support for North America advertisers \n•Determine Top Issues of focus for verbalization/training exercises from phone Top Issue volume data \n \nQuality Assurance Team \n•Support 6 customer service representatives as mentor/coach \n•Derive high-level trends of both strength/development \n•Deliver potentially difficult feedback in live coaching sessions \n•Review 40+ interactions quarterly \n•Deliver positive and difficult written feedback \n•Serve as Quality Blog North America POC: write 3+ posts quarterly, coordinate/edit all posting to ensure global applicability, design/market contest to boost interaction/reviewer contribution/readership \n \nMisc. \n•Audit Trainings and lead Noogler onboarding/training \n•Google Cares Communication Team (Q3 2010- Q1 2011) Global Online Advertising Associate Google January 2010  –  July 2011  (1 year 7 months) Support \n•Provide general and specialized (technical/troubleshooting/billing) phone/chat/email support for North America advertisers \n•Determine Top Issues of focus for verbalization/training exercises from phone Top Issue volume data \n \nQuality Assurance Team \n•Support 6 customer service representatives as mentor/coach \n•Derive high-level trends of both strength/development \n•Deliver potentially difficult feedback in live coaching sessions \n•Review 40+ interactions quarterly \n•Deliver positive and difficult written feedback \n•Serve as Quality Blog North America POC: write 3+ posts quarterly, coordinate/edit all posting to ensure global applicability, design/market contest to boost interaction/reviewer contribution/readership \n \nMisc. \n•Audit Trainings and lead Noogler onboarding/training \n•Google Cares Communication Team (Q3 2010- Q1 2011) People Ops Program Coordinator, Employee Referral Team, On Site at Google WorkforceLogic October 2009  –  December 2009  (3 months) •Analyze and reply to referral@google.com alias inquiries and requests \n•Maintain internal guide and resources to assist recruiters in processing Employee Referrals \n•Support \"Make a Google Match\" contest to incentivize referrals: adapt and revise content for messaging and promotions to 10,000+ Googlers \n•Determine prizes and deliver to local winners as Make a Google Match “Prize Patrol” People Ops Program Coordinator, Employee Referral Team, On Site at Google WorkforceLogic October 2009  –  December 2009  (3 months) •Analyze and reply to referral@google.com alias inquiries and requests \n•Maintain internal guide and resources to assist recruiters in processing Employee Referrals \n•Support \"Make a Google Match\" contest to incentivize referrals: adapt and revise content for messaging and promotions to 10,000+ Googlers \n•Determine prizes and deliver to local winners as Make a Google Match “Prize Patrol” Branding/Social Media Strategist 1stGig.com August 2009  –  October 2009  (3 months) (Open) 1 recommendation Ginger Terrell - Growth Director Creative | Recruiting | Referral Networking | Event Planning | Business Consulting/Training | Social Media | Blogs | BNI Katherine has a way with words - both spoken and written. Her blogging and presentation skills are impeccable and she is creative with her content. Katherine and I worked remotely together at 1stGig and she was helpful, easy to connect with,... View Branding/Social Media Strategist 1stGig.com August 2009  –  October 2009  (3 months) (Open) 1 recommendation Ginger Terrell - Growth Director Creative | Recruiting | Referral Networking | Event Planning | Business Consulting/Training | Social Media | Blogs | BNI Katherine has a way with words - both spoken and written. Her blogging and presentation skills are impeccable and she is creative with her content. Katherine and I worked remotely together at 1stGig and she was helpful, easy to connect with,... View Conference Coordinator, Facilitator & Technician Madison Videoconference December 2004  –  October 2009  (4 years 11 months) (Open) 2 recommendations Annette Rolain Summer Associate Law Clerk at Wilson Elser I worked with Katherine for two and a half years at Madison Videoconference, and as Conference Coordinator she managed me... View Robert Gramann President, Gramann Reporting, Ltd. Katherine has been an integral part of our Madison operations since her becoming involved with Madison Videoconference in... View Conference Coordinator, Facilitator & Technician Madison Videoconference December 2004  –  October 2009  (4 years 11 months) (Open) 2 recommendations Annette Rolain Summer Associate Law Clerk at Wilson Elser I worked with Katherine for two and a half years at Madison Videoconference, and as Conference Coordinator she managed me... View Robert Gramann President, Gramann Reporting, Ltd. Katherine has been an integral part of our Madison operations since her becoming involved with Madison Videoconference in... View Customer Service Specialist Gramann Reporting May 2002  –  October 2009  (7 years 6 months) Customer Service Specialist Gramann Reporting May 2002  –  October 2009  (7 years 6 months) Skills Top Skills 34 Social Media 33 Online Advertising 27 Blogging 22 Online Marketing 19 Advertising 16 Customer Service 16 Social Media Marketing 15 SEM 14 Social Networking 12 Google Adwords Katherine also knows about... 12 Community Management 12 Web Analytics 12 Content Strategy 11 Google Analytics 10 Facebook 8 Online Content Creation 8 Management 7 Email Marketing 7 Training 4 Nutritional Counseling 4 YouTube 4 PPC 4 Digital Strategy 3 Cross-functional... 3 Social Media Measurement Skills  Top Skills 34 Social Media 33 Online Advertising 27 Blogging 22 Online Marketing 19 Advertising 16 Customer Service 16 Social Media Marketing 15 SEM 14 Social Networking 12 Google Adwords Katherine also knows about... 12 Community Management 12 Web Analytics 12 Content Strategy 11 Google Analytics 10 Facebook 8 Online Content Creation 8 Management 7 Email Marketing 7 Training 4 Nutritional Counseling 4 YouTube 4 PPC 4 Digital Strategy 3 Cross-functional... 3 Social Media Measurement Top Skills 34 Social Media 33 Online Advertising 27 Blogging 22 Online Marketing 19 Advertising 16 Customer Service 16 Social Media Marketing 15 SEM 14 Social Networking 12 Google Adwords Katherine also knows about... 12 Community Management 12 Web Analytics 12 Content Strategy 11 Google Analytics 10 Facebook 8 Online Content Creation 8 Management 7 Email Marketing 7 Training 4 Nutritional Counseling 4 YouTube 4 PPC 4 Digital Strategy 3 Cross-functional... 3 Social Media Measurement Top Skills 34 Social Media 33 Online Advertising 27 Blogging 22 Online Marketing 19 Advertising 16 Customer Service 16 Social Media Marketing 15 SEM 14 Social Networking 12 Google Adwords Katherine also knows about... 12 Community Management 12 Web Analytics 12 Content Strategy 11 Google Analytics 10 Facebook 8 Online Content Creation 8 Management 7 Email Marketing 7 Training 4 Nutritional Counseling 4 YouTube 4 PPC 4 Digital Strategy 3 Cross-functional... 3 Social Media Measurement                     12 Community Management 12 Web Analytics 12 Content Strategy 11 Google Analytics 10 Facebook 8 Online Content Creation 8 Management 7 Email Marketing 7 Training 4 Nutritional Counseling 4 YouTube 4 PPC 4 Digital Strategy 3 Cross-functional... 3 Social Media Measurement Education University of Wisconsin-Madison - School of Business BBA,  Marketing 2005  – 2009 Activities and Societies:  Women in Business ,  Finance & Investment Society ,  Mu Kappa Tau ,  Phi Eta Sigma Honor Society (Open) 1 recommendation Joann Peck Associate Dean of Undergraduate Program at University of Wisconsin-Madison School of Business Katherine works hard and is very intelligent. A great combination! View City University London 2008  – 2008 Study Abroad January 2008- May 2008 University of Wisconsin-Madison - School of Business BBA,  Marketing 2005  – 2009 Activities and Societies:  Women in Business ,  Finance & Investment Society ,  Mu Kappa Tau ,  Phi Eta Sigma Honor Society (Open) 1 recommendation Joann Peck Associate Dean of Undergraduate Program at University of Wisconsin-Madison School of Business Katherine works hard and is very intelligent. A great combination! View University of Wisconsin-Madison - School of Business BBA,  Marketing 2005  – 2009 Activities and Societies:  Women in Business ,  Finance & Investment Society ,  Mu Kappa Tau ,  Phi Eta Sigma Honor Society (Open) 1 recommendation Joann Peck Associate Dean of Undergraduate Program at University of Wisconsin-Madison School of Business Katherine works hard and is very intelligent. A great combination! View University of Wisconsin-Madison - School of Business BBA,  Marketing 2005  – 2009 Activities and Societies:  Women in Business ,  Finance & Investment Society ,  Mu Kappa Tau ,  Phi Eta Sigma Honor Society (Open) 1 recommendation Joann Peck Associate Dean of Undergraduate Program at University of Wisconsin-Madison School of Business Katherine works hard and is very intelligent. A great combination! View City University London 2008  – 2008 Study Abroad January 2008- May 2008 City University London 2008  – 2008 Study Abroad January 2008- May 2008 City University London 2008  – 2008 Study Abroad January 2008- May 2008 Honors & Awards Additional Honors & Awards Sigma Alpha Lambda National Leadership and Honors Organization; Phi Eta Sigma Honor Society; Lake Country Rotary Scholarship; Arrowhead National Honor Society Scholarship, 2 semester’s Dean’s List, Wisconsin School of Business 2009 Recognition of Academic Excellence Additional Honors & Awards Sigma Alpha Lambda National Leadership and Honors Organization; Phi Eta Sigma Honor Society; Lake Country Rotary Scholarship; Arrowhead National Honor Society Scholarship, 2 semester’s Dean’s List, Wisconsin School of Business 2009 Recognition of Academic Excellence Additional Honors & Awards Sigma Alpha Lambda National Leadership and Honors Organization; Phi Eta Sigma Honor Society; Lake Country Rotary Scholarship; Arrowhead National Honor Society Scholarship, 2 semester’s Dean’s List, Wisconsin School of Business 2009 Recognition of Academic Excellence Additional Honors & Awards Sigma Alpha Lambda National Leadership and Honors Organization; Phi Eta Sigma Honor Society; Lake Country Rotary Scholarship; Arrowhead National Honor Society Scholarship, 2 semester’s Dean’s List, Wisconsin School of Business 2009 Recognition of Academic Excellence ", "Summary I am a recent graduate with a Bachelors in Business Administration. My experience has focused on customer service, sales, promotion and leadership. My goal is to obtain full-time employment in the marketing field. Summary I am a recent graduate with a Bachelors in Business Administration. My experience has focused on customer service, sales, promotion and leadership. My goal is to obtain full-time employment in the marketing field. I am a recent graduate with a Bachelors in Business Administration. My experience has focused on customer service, sales, promotion and leadership. My goal is to obtain full-time employment in the marketing field. I am a recent graduate with a Bachelors in Business Administration. My experience has focused on customer service, sales, promotion and leadership. My goal is to obtain full-time employment in the marketing field. Experience Global Online Advertising Associate Google 2009  – Present (6 years) Manager Canine To Five February 2009  –  October 2009  (9 months) Canine to Five is Metro Detroit's finest dog daycare, boarding, and grooming facility, located in the heart of Detroit's Historic Midtown Neighborhood. http://www.caninetofivedetroit.com/ \n \nCurrently, I am working on street team promotions for the daycare and strategic distribution of informative brochures. Account Executive CFW Creative Sports July 2007  –  March 2009  (1 year 9 months) CFW Creative Sports is a premier sports marketing company that handles official game programs for Michigan professional and collegiate sports teams and events.  \n \nI create and manage a network of clients that advertise in the official game program publications. Mentor WSU SBA Learning Community 2008  –  2009  (1 year) Global Online Advertising Associate Google 2009  – Present (6 years) Global Online Advertising Associate Google 2009  – Present (6 years) Manager Canine To Five February 2009  –  October 2009  (9 months) Canine to Five is Metro Detroit's finest dog daycare, boarding, and grooming facility, located in the heart of Detroit's Historic Midtown Neighborhood. http://www.caninetofivedetroit.com/ \n \nCurrently, I am working on street team promotions for the daycare and strategic distribution of informative brochures. Manager Canine To Five February 2009  –  October 2009  (9 months) Canine to Five is Metro Detroit's finest dog daycare, boarding, and grooming facility, located in the heart of Detroit's Historic Midtown Neighborhood. http://www.caninetofivedetroit.com/ \n \nCurrently, I am working on street team promotions for the daycare and strategic distribution of informative brochures. Account Executive CFW Creative Sports July 2007  –  March 2009  (1 year 9 months) CFW Creative Sports is a premier sports marketing company that handles official game programs for Michigan professional and collegiate sports teams and events.  \n \nI create and manage a network of clients that advertise in the official game program publications. Account Executive CFW Creative Sports July 2007  –  March 2009  (1 year 9 months) CFW Creative Sports is a premier sports marketing company that handles official game programs for Michigan professional and collegiate sports teams and events.  \n \nI create and manage a network of clients that advertise in the official game program publications. Mentor WSU SBA Learning Community 2008  –  2009  (1 year) Mentor WSU SBA Learning Community 2008  –  2009  (1 year) Skills Skills     Education Wayne State University BS of Business Administration,  Marketing/Advertising 2005  – 2009 I have maintained a position on the Dean's List throughout my college career. Recently, I have been selected to receive the Delta Sigma Pi Scholarship Key Award. Activities and Societies:  American Advertising Federation ,  B-Start: an accelerated honors program ,  National Society of Collegiate Scholars ,  Detroit Fellow Tutoring ,  Beta Gamma Sigma ,  Learning Community Mentor ,  International Business Seminar Study Abroad ,  Intro to Business Tutor ,  Revamp the Love Project ,  Metro South ,  Wayne State University Scholars Day Volunteer ,  Habitat for Humanity ,  Greening of Detroit ,  WSU SBA Promotion and Tenure Committee ,  Trunk or Treat ,  Metro Kids Hero Wayne State University BS of Business Administration,  Marketing/Advertising 2005  – 2009 I have maintained a position on the Dean's List throughout my college career. Recently, I have been selected to receive the Delta Sigma Pi Scholarship Key Award. Activities and Societies:  American Advertising Federation ,  B-Start: an accelerated honors program ,  National Society of Collegiate Scholars ,  Detroit Fellow Tutoring ,  Beta Gamma Sigma ,  Learning Community Mentor ,  International Business Seminar Study Abroad ,  Intro to Business Tutor ,  Revamp the Love Project ,  Metro South ,  Wayne State University Scholars Day Volunteer ,  Habitat for Humanity ,  Greening of Detroit ,  WSU SBA Promotion and Tenure Committee ,  Trunk or Treat ,  Metro Kids Hero Wayne State University BS of Business Administration,  Marketing/Advertising 2005  – 2009 I have maintained a position on the Dean's List throughout my college career. Recently, I have been selected to receive the Delta Sigma Pi Scholarship Key Award. Activities and Societies:  American Advertising Federation ,  B-Start: an accelerated honors program ,  National Society of Collegiate Scholars ,  Detroit Fellow Tutoring ,  Beta Gamma Sigma ,  Learning Community Mentor ,  International Business Seminar Study Abroad ,  Intro to Business Tutor ,  Revamp the Love Project ,  Metro South ,  Wayne State University Scholars Day Volunteer ,  Habitat for Humanity ,  Greening of Detroit ,  WSU SBA Promotion and Tenure Committee ,  Trunk or Treat ,  Metro Kids Hero Wayne State University BS of Business Administration,  Marketing/Advertising 2005  – 2009 I have maintained a position on the Dean's List throughout my college career. Recently, I have been selected to receive the Delta Sigma Pi Scholarship Key Award. Activities and Societies:  American Advertising Federation ,  B-Start: an accelerated honors program ,  National Society of Collegiate Scholars ,  Detroit Fellow Tutoring ,  Beta Gamma Sigma ,  Learning Community Mentor ,  International Business Seminar Study Abroad ,  Intro to Business Tutor ,  Revamp the Love Project ,  Metro South ,  Wayne State University Scholars Day Volunteer ,  Habitat for Humanity ,  Greening of Detroit ,  WSU SBA Promotion and Tenure Committee ,  Trunk or Treat ,  Metro Kids Hero "]}