{"position": "Global Communications Manager", "company": "Google", "profiles": ["Skills Corporate Communications Crisis Communications Strategic Communications Media Relations Press Releases Public Relations Speech Writing Internal Communications Social Media Content Strategy Content Development Blogging New Media Journalism Copy Editing Editing Digital Media Web Content Executive... Digital Strategy News Writing Storytelling Politics See 8+     See less Skills  Corporate Communications Crisis Communications Strategic Communications Media Relations Press Releases Public Relations Speech Writing Internal Communications Social Media Content Strategy Content Development Blogging New Media Journalism Copy Editing Editing Digital Media Web Content Executive... Digital Strategy News Writing Storytelling Politics See 8+     See less Corporate Communications Crisis Communications Strategic Communications Media Relations Press Releases Public Relations Speech Writing Internal Communications Social Media Content Strategy Content Development Blogging New Media Journalism Copy Editing Editing Digital Media Web Content Executive... Digital Strategy News Writing Storytelling Politics See 8+     See less Corporate Communications Crisis Communications Strategic Communications Media Relations Press Releases Public Relations Speech Writing Internal Communications Social Media Content Strategy Content Development Blogging New Media Journalism Copy Editing Editing Digital Media Web Content Executive... Digital Strategy News Writing Storytelling Politics See 8+     See less ", "Skills Media Relations Public Relations Social Media Corporate Communications Strategic Communications Press Releases Social Media Marketing Non-profits Marketing Communications Editing Research Community Outreach Public Speaking Blogging Digital Media Content Strategy Copy Editing Management Content Development Nonprofits Reputation Management Newsletters Facebook Social Networking Marketing Online Marketing Integrated Marketing Copywriting Journalism B2B Program Management Advertising Communication Training Digital Marketing See 19+     See less Skills  Media Relations Public Relations Social Media Corporate Communications Strategic Communications Press Releases Social Media Marketing Non-profits Marketing Communications Editing Research Community Outreach Public Speaking Blogging Digital Media Content Strategy Copy Editing Management Content Development Nonprofits Reputation Management Newsletters Facebook Social Networking Marketing Online Marketing Integrated Marketing Copywriting Journalism B2B Program Management Advertising Communication Training Digital Marketing See 19+     See less Media Relations Public Relations Social Media Corporate Communications Strategic Communications Press Releases Social Media Marketing Non-profits Marketing Communications Editing Research Community Outreach Public Speaking Blogging Digital Media Content Strategy Copy Editing Management Content Development Nonprofits Reputation Management Newsletters Facebook Social Networking Marketing Online Marketing Integrated Marketing Copywriting Journalism B2B Program Management Advertising Communication Training Digital Marketing See 19+     See less Media Relations Public Relations Social Media Corporate Communications Strategic Communications Press Releases Social Media Marketing Non-profits Marketing Communications Editing Research Community Outreach Public Speaking Blogging Digital Media Content Strategy Copy Editing Management Content Development Nonprofits Reputation Management Newsletters Facebook Social Networking Marketing Online Marketing Integrated Marketing Copywriting Journalism B2B Program Management Advertising Communication Training Digital Marketing See 19+     See less Honors & Awards ", "Experience Director of Policy and Public Affairs Google October 2014  – Present (11 months) Washington DC Chief of Staff & Head of Public Affairs Google June 2012  – Present (3 years 3 months) Washington, DC Sr. Manager, Global Communications and Public Affairs Google September 2009  – Present (6 years) Lead public relations and public affairs for Google in Washington DC Director of Policy and Public Affairs Google October 2014  – Present (11 months) Washington DC Director of Policy and Public Affairs Google October 2014  – Present (11 months) Washington DC Chief of Staff & Head of Public Affairs Google June 2012  – Present (3 years 3 months) Washington, DC Chief of Staff & Head of Public Affairs Google June 2012  – Present (3 years 3 months) Washington, DC Sr. Manager, Global Communications and Public Affairs Google September 2009  – Present (6 years) Lead public relations and public affairs for Google in Washington DC Sr. Manager, Global Communications and Public Affairs Google September 2009  – Present (6 years) Lead public relations and public affairs for Google in Washington DC Skills Political Campaigns Public Relations Public Affairs Politics Public Policy Strategic Communications Media Relations Strategy Skills  Political Campaigns Public Relations Public Affairs Politics Public Policy Strategic Communications Media Relations Strategy Political Campaigns Public Relations Public Affairs Politics Public Policy Strategic Communications Media Relations Strategy Political Campaigns Public Relations Public Affairs Politics Public Policy Strategic Communications Media Relations Strategy ", "Summary Communications professional with a knack for launching successful consumer products and brands. I love telling stories, winning new customers and communicating clearly and honestly in a crisis. I’m a collaborative manager who enjoys working with marketing, product and policy teams to keep the story straight while mapping everything back to the heart of a brand.  Summary Communications professional with a knack for launching successful consumer products and brands. I love telling stories, winning new customers and communicating clearly and honestly in a crisis. I’m a collaborative manager who enjoys working with marketing, product and policy teams to keep the story straight while mapping everything back to the heart of a brand.  Communications professional with a knack for launching successful consumer products and brands. I love telling stories, winning new customers and communicating clearly and honestly in a crisis. I’m a collaborative manager who enjoys working with marketing, product and policy teams to keep the story straight while mapping everything back to the heart of a brand.  Communications professional with a knack for launching successful consumer products and brands. I love telling stories, winning new customers and communicating clearly and honestly in a crisis. I’m a collaborative manager who enjoys working with marketing, product and policy teams to keep the story straight while mapping everything back to the heart of a brand.  Experience Principal Tyler Communications November 2013  – Present (1 year 10 months) San Francisco Bay Area Develop and implement strategic marketing and communications plans for technology, sports and lifestyle companies. Clients include The World Surf League, hello.com, Data Collective and Basil Racuk.  Senior Manager, Global Communications & Public Affairs Google December 2008  –  November 2013  (5 years) Mountain View, California Oversaw communications for Google Maps, Google Commerce and Google Search. Managed a five-person team and an agency. Coordinated communications globally, working closely with the international marketing and policy teams. Reported status and results to senior management.  Press Secretary Obama/Biden '09 2009  –  2009  (less than a year) Scranton, Pennsylvania Area Staffed Scranton press office in final months of the campaign. Produced press conferences and a statewide bus tour. Synced daily messages with campaign headquarters and responded to inbound media inquiries.  \n Founder, Executive Director Lights Out San Francisco 2007  –  2009  (2 years) San Francisco Bay Area Founded grassroots campaign encouraging San Francisco to save energy by turning off lights for one-hour. The Golden Gate Bridge, City Hall, local restaurants and many others went dark for the hour and Google.com turned it’s homepage black to promote the event. I directed all aspects of the initiative including marketing, press, government relations, fundraising and field operations.  Manager, Global Communications & Public Affairs Google 2001  –  2006  (5 years) Mountain View, California Led communications for Google Search, Gmail, Google Book Search, Google News, Blogger, the Google Search Appliance and other products. Reported status and results to senior management.  Manager, Communications Keen.com and then Crowdburst 2000  –  2001  (1 year) San Francisco Bay Area Managed public relations for two tech startups. Developed communications plans that resulted high-visibility story placements (including a front page story in the Washington Post), strategic press announcements, industry conference presentations and influencer/analyst relations.  Manager, Communications Netscape 1998  –  2001  (3 years) Mountain View, California Managed communications for Netscape Netcenter and Search. Wrote press announcements, managed partner relationships, coordinated press/analyst tours and speaking engagements. Continued in the same role at AOL after it acquired Netscape. Associate Copithorne & Bellows 1997  –  1998  (1 year) San Francisco Bay Area Worked across multiple accounts including McAfee/Network Associates, Hewlett Packard, VeriFone and Iomega. Led pro bono campaign for the San Francisco Multimedia Summit.  Advance Staff The White House 1994  –  1998  (4 years) Washington D.C. Metro Area Traveled in advance of President Clinton and Vice President Gore to coordinate official and political trips. Served as White House liaison to press and local elected officials. Specialized in producing large­ scale White House events and managing press..  Principal Tyler Communications November 2013  – Present (1 year 10 months) San Francisco Bay Area Develop and implement strategic marketing and communications plans for technology, sports and lifestyle companies. Clients include The World Surf League, hello.com, Data Collective and Basil Racuk.  Principal Tyler Communications November 2013  – Present (1 year 10 months) San Francisco Bay Area Develop and implement strategic marketing and communications plans for technology, sports and lifestyle companies. Clients include The World Surf League, hello.com, Data Collective and Basil Racuk.  Senior Manager, Global Communications & Public Affairs Google December 2008  –  November 2013  (5 years) Mountain View, California Oversaw communications for Google Maps, Google Commerce and Google Search. Managed a five-person team and an agency. Coordinated communications globally, working closely with the international marketing and policy teams. Reported status and results to senior management.  Senior Manager, Global Communications & Public Affairs Google December 2008  –  November 2013  (5 years) Mountain View, California Oversaw communications for Google Maps, Google Commerce and Google Search. Managed a five-person team and an agency. Coordinated communications globally, working closely with the international marketing and policy teams. Reported status and results to senior management.  Press Secretary Obama/Biden '09 2009  –  2009  (less than a year) Scranton, Pennsylvania Area Staffed Scranton press office in final months of the campaign. Produced press conferences and a statewide bus tour. Synced daily messages with campaign headquarters and responded to inbound media inquiries.  \n Press Secretary Obama/Biden '09 2009  –  2009  (less than a year) Scranton, Pennsylvania Area Staffed Scranton press office in final months of the campaign. Produced press conferences and a statewide bus tour. Synced daily messages with campaign headquarters and responded to inbound media inquiries.  \n Founder, Executive Director Lights Out San Francisco 2007  –  2009  (2 years) San Francisco Bay Area Founded grassroots campaign encouraging San Francisco to save energy by turning off lights for one-hour. The Golden Gate Bridge, City Hall, local restaurants and many others went dark for the hour and Google.com turned it’s homepage black to promote the event. I directed all aspects of the initiative including marketing, press, government relations, fundraising and field operations.  Founder, Executive Director Lights Out San Francisco 2007  –  2009  (2 years) San Francisco Bay Area Founded grassroots campaign encouraging San Francisco to save energy by turning off lights for one-hour. The Golden Gate Bridge, City Hall, local restaurants and many others went dark for the hour and Google.com turned it’s homepage black to promote the event. I directed all aspects of the initiative including marketing, press, government relations, fundraising and field operations.  Manager, Global Communications & Public Affairs Google 2001  –  2006  (5 years) Mountain View, California Led communications for Google Search, Gmail, Google Book Search, Google News, Blogger, the Google Search Appliance and other products. Reported status and results to senior management.  Manager, Global Communications & Public Affairs Google 2001  –  2006  (5 years) Mountain View, California Led communications for Google Search, Gmail, Google Book Search, Google News, Blogger, the Google Search Appliance and other products. Reported status and results to senior management.  Manager, Communications Keen.com and then Crowdburst 2000  –  2001  (1 year) San Francisco Bay Area Managed public relations for two tech startups. Developed communications plans that resulted high-visibility story placements (including a front page story in the Washington Post), strategic press announcements, industry conference presentations and influencer/analyst relations.  Manager, Communications Keen.com and then Crowdburst 2000  –  2001  (1 year) San Francisco Bay Area Managed public relations for two tech startups. Developed communications plans that resulted high-visibility story placements (including a front page story in the Washington Post), strategic press announcements, industry conference presentations and influencer/analyst relations.  Manager, Communications Netscape 1998  –  2001  (3 years) Mountain View, California Managed communications for Netscape Netcenter and Search. Wrote press announcements, managed partner relationships, coordinated press/analyst tours and speaking engagements. Continued in the same role at AOL after it acquired Netscape. Manager, Communications Netscape 1998  –  2001  (3 years) Mountain View, California Managed communications for Netscape Netcenter and Search. Wrote press announcements, managed partner relationships, coordinated press/analyst tours and speaking engagements. Continued in the same role at AOL after it acquired Netscape. Associate Copithorne & Bellows 1997  –  1998  (1 year) San Francisco Bay Area Worked across multiple accounts including McAfee/Network Associates, Hewlett Packard, VeriFone and Iomega. Led pro bono campaign for the San Francisco Multimedia Summit.  Associate Copithorne & Bellows 1997  –  1998  (1 year) San Francisco Bay Area Worked across multiple accounts including McAfee/Network Associates, Hewlett Packard, VeriFone and Iomega. Led pro bono campaign for the San Francisco Multimedia Summit.  Advance Staff The White House 1994  –  1998  (4 years) Washington D.C. Metro Area Traveled in advance of President Clinton and Vice President Gore to coordinate official and political trips. Served as White House liaison to press and local elected officials. Specialized in producing large­ scale White House events and managing press..  Advance Staff The White House 1994  –  1998  (4 years) Washington D.C. Metro Area Traveled in advance of President Clinton and Vice President Gore to coordinate official and political trips. Served as White House liaison to press and local elected officials. Specialized in producing large­ scale White House events and managing press..  Languages   Skills Marketing Strategy Strategic Public... Media Relations Strategic Communications Strategic Partnerships Blogging Crisis Communications Public Affairs Public Relations Content Strategy Corporate Communications Internal Communications Content Development Digital Strategy Digital Media Social Media Social Media Marketing Marketing Strategy Marketing Communications Digital Marketing Start-ups See 7+     See less Skills  Marketing Strategy Strategic Public... Media Relations Strategic Communications Strategic Partnerships Blogging Crisis Communications Public Affairs Public Relations Content Strategy Corporate Communications Internal Communications Content Development Digital Strategy Digital Media Social Media Social Media Marketing Marketing Strategy Marketing Communications Digital Marketing Start-ups See 7+     See less Marketing Strategy Strategic Public... Media Relations Strategic Communications Strategic Partnerships Blogging Crisis Communications Public Affairs Public Relations Content Strategy Corporate Communications Internal Communications Content Development Digital Strategy Digital Media Social Media Social Media Marketing Marketing Strategy Marketing Communications Digital Marketing Start-ups See 7+     See less Marketing Strategy Strategic Public... Media Relations Strategic Communications Strategic Partnerships Blogging Crisis Communications Public Affairs Public Relations Content Strategy Corporate Communications Internal Communications Content Development Digital Strategy Digital Media Social Media Social Media Marketing Marketing Strategy Marketing Communications Digital Marketing Start-ups See 7+     See less Education Lewis and Clark College BA,  Double Major in English and History 1992  – 1996 Activities and Societies:  Student Leader ,  College Outdoors program. Assisted program leaders to plan and lead weekend and weeklong outdoor adventures from camping ,  to more technical mountaineering and sea kayaking trips. Columbia University in the City of New York Certificate of Completion,  Shape of Two Cities. 1990  – 1991 One year, intensive liberal arts program focusing on design and urban history of New York and Paris. Lewis and Clark College BA,  Double Major in English and History 1992  – 1996 Activities and Societies:  Student Leader ,  College Outdoors program. Assisted program leaders to plan and lead weekend and weeklong outdoor adventures from camping ,  to more technical mountaineering and sea kayaking trips. Lewis and Clark College BA,  Double Major in English and History 1992  – 1996 Activities and Societies:  Student Leader ,  College Outdoors program. Assisted program leaders to plan and lead weekend and weeklong outdoor adventures from camping ,  to more technical mountaineering and sea kayaking trips. Lewis and Clark College BA,  Double Major in English and History 1992  – 1996 Activities and Societies:  Student Leader ,  College Outdoors program. Assisted program leaders to plan and lead weekend and weeklong outdoor adventures from camping ,  to more technical mountaineering and sea kayaking trips. Columbia University in the City of New York Certificate of Completion,  Shape of Two Cities. 1990  – 1991 One year, intensive liberal arts program focusing on design and urban history of New York and Paris. Columbia University in the City of New York Certificate of Completion,  Shape of Two Cities. 1990  – 1991 One year, intensive liberal arts program focusing on design and urban history of New York and Paris. Columbia University in the City of New York Certificate of Completion,  Shape of Two Cities. 1990  – 1991 One year, intensive liberal arts program focusing on design and urban history of New York and Paris. Honors & Awards Google Operating Committee Award Google Inc. January 2010 Recognized with two Operating Committee awards for my work on Google Search and Google Translate. Certificate of Excellence Google Inc. February 2011 Recognizing my work on Google Commerce. San Francisco's \"Hot 20 under 40\" 7x7 Magazine September 2007 Recognized as a community leader for my work on Lights Out San Francisco.  Google Operating Committee Award Google Inc. January 2010 Recognized with two Operating Committee awards for my work on Google Search and Google Translate. Google Operating Committee Award Google Inc. January 2010 Recognized with two Operating Committee awards for my work on Google Search and Google Translate. Google Operating Committee Award Google Inc. January 2010 Recognized with two Operating Committee awards for my work on Google Search and Google Translate. Certificate of Excellence Google Inc. February 2011 Recognizing my work on Google Commerce. Certificate of Excellence Google Inc. February 2011 Recognizing my work on Google Commerce. Certificate of Excellence Google Inc. February 2011 Recognizing my work on Google Commerce. San Francisco's \"Hot 20 under 40\" 7x7 Magazine September 2007 Recognized as a community leader for my work on Lights Out San Francisco.  San Francisco's \"Hot 20 under 40\" 7x7 Magazine September 2007 Recognized as a community leader for my work on Lights Out San Francisco.  San Francisco's \"Hot 20 under 40\" 7x7 Magazine September 2007 Recognized as a community leader for my work on Lights Out San Francisco.  ", "Skills Media Relations Skills  Media Relations Media Relations Media Relations ", "Experience Team Lead - Advertising Google April 2014  – Present (1 year 5 months) New York, NY AM Lead/Sr. AM/AE - Advertising Google April 2013  –  April 2014  (1 year 1 month) New York Senior AE/AM- Advertising Google January 2012  –  April 2013  (1 year 4 months) New York Senior Account Specialist/YouTube Mobile Product Specialist - Mobile Advertising Team Google February 2009  –  December 2011  (2 years 11 months) Manager - Global Communications and Public Affairs Google July 2007  –  February 2009  (1 year 8 months) Senior Account Manager - Financial Services Advertising Google January 2007  –  July 2007  (7 months) Senior Associate/Account Manager Google January 2004  –  December 2005  (2 years) Client Services Coordinator/Client Services Associate Google March 2002  –  January 2004  (1 year 11 months) Digital Media Ventures Group Sony Music Entertainment February 2001  –  November 2001  (10 months) GO.com Walt Disney Internet Group October 1999  –  November 2001  (2 years 2 months) Team Lead - Advertising Google April 2014  – Present (1 year 5 months) New York, NY Team Lead - Advertising Google April 2014  – Present (1 year 5 months) New York, NY AM Lead/Sr. AM/AE - Advertising Google April 2013  –  April 2014  (1 year 1 month) New York AM Lead/Sr. AM/AE - Advertising Google April 2013  –  April 2014  (1 year 1 month) New York Senior AE/AM- Advertising Google January 2012  –  April 2013  (1 year 4 months) New York Senior AE/AM- Advertising Google January 2012  –  April 2013  (1 year 4 months) New York Senior Account Specialist/YouTube Mobile Product Specialist - Mobile Advertising Team Google February 2009  –  December 2011  (2 years 11 months) Senior Account Specialist/YouTube Mobile Product Specialist - Mobile Advertising Team Google February 2009  –  December 2011  (2 years 11 months) Manager - Global Communications and Public Affairs Google July 2007  –  February 2009  (1 year 8 months) Manager - Global Communications and Public Affairs Google July 2007  –  February 2009  (1 year 8 months) Senior Account Manager - Financial Services Advertising Google January 2007  –  July 2007  (7 months) Senior Account Manager - Financial Services Advertising Google January 2007  –  July 2007  (7 months) Senior Associate/Account Manager Google January 2004  –  December 2005  (2 years) Senior Associate/Account Manager Google January 2004  –  December 2005  (2 years) Client Services Coordinator/Client Services Associate Google March 2002  –  January 2004  (1 year 11 months) Client Services Coordinator/Client Services Associate Google March 2002  –  January 2004  (1 year 11 months) Digital Media Ventures Group Sony Music Entertainment February 2001  –  November 2001  (10 months) Digital Media Ventures Group Sony Music Entertainment February 2001  –  November 2001  (10 months) GO.com Walt Disney Internet Group October 1999  –  November 2001  (2 years 2 months) GO.com Walt Disney Internet Group October 1999  –  November 2001  (2 years 2 months) Skills Mobile Advertising Digital Media SEM Corporate Communications Community Outreach Account Management Business Relationship... Sales Account Sales Strategies Search Analytics New Business Development Digital Marketing Social Media Marketing Video Advertising Sales Presentations Internal Communications Public Relations Event Planning Marketing Marketing Research Entrepreneurship Product Development Volunteer Management Training Education Sales Operations Sales Management Mobile Marketing Display Advertising Online Advertising See 15+     See less Skills  Mobile Advertising Digital Media SEM Corporate Communications Community Outreach Account Management Business Relationship... Sales Account Sales Strategies Search Analytics New Business Development Digital Marketing Social Media Marketing Video Advertising Sales Presentations Internal Communications Public Relations Event Planning Marketing Marketing Research Entrepreneurship Product Development Volunteer Management Training Education Sales Operations Sales Management Mobile Marketing Display Advertising Online Advertising See 15+     See less Mobile Advertising Digital Media SEM Corporate Communications Community Outreach Account Management Business Relationship... Sales Account Sales Strategies Search Analytics New Business Development Digital Marketing Social Media Marketing Video Advertising Sales Presentations Internal Communications Public Relations Event Planning Marketing Marketing Research Entrepreneurship Product Development Volunteer Management Training Education Sales Operations Sales Management Mobile Marketing Display Advertising Online Advertising See 15+     See less Mobile Advertising Digital Media SEM Corporate Communications Community Outreach Account Management Business Relationship... Sales Account Sales Strategies Search Analytics New Business Development Digital Marketing Social Media Marketing Video Advertising Sales Presentations Internal Communications Public Relations Event Planning Marketing Marketing Research Entrepreneurship Product Development Volunteer Management Training Education Sales Operations Sales Management Mobile Marketing Display Advertising Online Advertising See 15+     See less Education University of Pennsylvania - The Wharton School Bachelor of Science (BS),  Marketing and Entrepreneurship 1995  – 1999 Vermont College of Fine Arts MFA,  Writing for Children and Young Adults University of Pennsylvania - The Wharton School Bachelor of Science (BS),  Marketing and Entrepreneurship 1995  – 1999 University of Pennsylvania - The Wharton School Bachelor of Science (BS),  Marketing and Entrepreneurship 1995  – 1999 University of Pennsylvania - The Wharton School Bachelor of Science (BS),  Marketing and Entrepreneurship 1995  – 1999 Vermont College of Fine Arts MFA,  Writing for Children and Young Adults Vermont College of Fine Arts MFA,  Writing for Children and Young Adults Vermont College of Fine Arts MFA,  Writing for Children and Young Adults ", "Skills Public Relations Media Relations Crisis Communications Corporate Communications Communications Strategy Crisis Management Public Speaking Reputation Management Policy Government Relations Product Launch Social Media Communications Planning Strategic Communications Media Skills Training Skills  Public Relations Media Relations Crisis Communications Corporate Communications Communications Strategy Crisis Management Public Speaking Reputation Management Policy Government Relations Product Launch Social Media Communications Planning Strategic Communications Media Skills Training Public Relations Media Relations Crisis Communications Corporate Communications Communications Strategy Crisis Management Public Speaking Reputation Management Policy Government Relations Product Launch Social Media Communications Planning Strategic Communications Media Skills Training Public Relations Media Relations Crisis Communications Corporate Communications Communications Strategy Crisis Management Public Speaking Reputation Management Policy Government Relations Product Launch Social Media Communications Planning Strategic Communications Media Skills Training ", "Summary I'm an experienced project manager with strong attention to detail and leadership skills. I excel at finding, organizing and clearly presenting relevant information and helping others to do so. I have a passion for crafting effective messaging, creating strong strategies and managing complex project. Summary I'm an experienced project manager with strong attention to detail and leadership skills. I excel at finding, organizing and clearly presenting relevant information and helping others to do so. I have a passion for crafting effective messaging, creating strong strategies and managing complex project. I'm an experienced project manager with strong attention to detail and leadership skills. I excel at finding, organizing and clearly presenting relevant information and helping others to do so. I have a passion for crafting effective messaging, creating strong strategies and managing complex project. I'm an experienced project manager with strong attention to detail and leadership skills. I excel at finding, organizing and clearly presenting relevant information and helping others to do so. I have a passion for crafting effective messaging, creating strong strategies and managing complex project. Experience Director of Content and Communications Reserve October 2014  – Present (11 months) Greater New York City Area Chief word-herder at Reserve. I help tell the company's story and work with a passionate, dedicated team to help make the dining experience better both for restaurants and their guests. Senior Strategist, Product Quality Operations Google January 2014  – Present (1 year 8 months) Develop, execute and manage strategy to help protect Google users from fraud, spam and abuse. Work cross-functionally to help users and thought leaders better understand Google's online safety policies and enforcement. Manager, Global Communications and Public Affairs Google August 2010  – Present (5 years 1 month) Previously served as the privacy PR lead for the US and help drive proactive and reactive PR for a wide range of product and policy issues. I covered privacy, security, digital literacy and child safety. Prior to that I was the US PR lead for Google's mobile apps - coordinated press strategies for over 40 mobile launches, spanning more than a dozen mobile products. Shaped and conducted two innovative New York consumer media tours, serving as Google’s spokesperson to outlets such as Glamour, Men’s Health and Family Circle. Gave phone, video and in-person interviews on consumer uses for Google’s mobile technology to over 75 reporters. Supported core Search and data-driven narratives. Served as global PR lead for Google Search 2011 Zeitgeist campaign, helping coordinate print, online, radio and broadcast interview opportunities on local, national and international levels. Received numerous awards for PR work and project management. Director of Content and Communications Reserve October 2014  – Present (11 months) Greater New York City Area Chief word-herder at Reserve. I help tell the company's story and work with a passionate, dedicated team to help make the dining experience better both for restaurants and their guests. Director of Content and Communications Reserve October 2014  – Present (11 months) Greater New York City Area Chief word-herder at Reserve. I help tell the company's story and work with a passionate, dedicated team to help make the dining experience better both for restaurants and their guests. Senior Strategist, Product Quality Operations Google January 2014  – Present (1 year 8 months) Develop, execute and manage strategy to help protect Google users from fraud, spam and abuse. Work cross-functionally to help users and thought leaders better understand Google's online safety policies and enforcement. Senior Strategist, Product Quality Operations Google January 2014  – Present (1 year 8 months) Develop, execute and manage strategy to help protect Google users from fraud, spam and abuse. Work cross-functionally to help users and thought leaders better understand Google's online safety policies and enforcement. Manager, Global Communications and Public Affairs Google August 2010  – Present (5 years 1 month) Previously served as the privacy PR lead for the US and help drive proactive and reactive PR for a wide range of product and policy issues. I covered privacy, security, digital literacy and child safety. Prior to that I was the US PR lead for Google's mobile apps - coordinated press strategies for over 40 mobile launches, spanning more than a dozen mobile products. Shaped and conducted two innovative New York consumer media tours, serving as Google’s spokesperson to outlets such as Glamour, Men’s Health and Family Circle. Gave phone, video and in-person interviews on consumer uses for Google’s mobile technology to over 75 reporters. Supported core Search and data-driven narratives. Served as global PR lead for Google Search 2011 Zeitgeist campaign, helping coordinate print, online, radio and broadcast interview opportunities on local, national and international levels. Received numerous awards for PR work and project management. Manager, Global Communications and Public Affairs Google August 2010  – Present (5 years 1 month) Previously served as the privacy PR lead for the US and help drive proactive and reactive PR for a wide range of product and policy issues. I covered privacy, security, digital literacy and child safety. Prior to that I was the US PR lead for Google's mobile apps - coordinated press strategies for over 40 mobile launches, spanning more than a dozen mobile products. Shaped and conducted two innovative New York consumer media tours, serving as Google’s spokesperson to outlets such as Glamour, Men’s Health and Family Circle. Gave phone, video and in-person interviews on consumer uses for Google’s mobile technology to over 75 reporters. Supported core Search and data-driven narratives. Served as global PR lead for Google Search 2011 Zeitgeist campaign, helping coordinate print, online, radio and broadcast interview opportunities on local, national and international levels. Received numerous awards for PR work and project management. Languages German German German Skills Project Management Program Management Strategic Planning Strategic Communications Public Relations Crisis Communications Communication Training Cross-functional Team... Corporate Communications Process Improvement Social Media Event Planning Media Relations Social Media Marketing Messaging Message Development Press Releases Teamwork Blogging Strategy Marketing Communications Leadership Public Speaking Editorial Content Strategy Management See 11+     See less Skills  Project Management Program Management Strategic Planning Strategic Communications Public Relations Crisis Communications Communication Training Cross-functional Team... Corporate Communications Process Improvement Social Media Event Planning Media Relations Social Media Marketing Messaging Message Development Press Releases Teamwork Blogging Strategy Marketing Communications Leadership Public Speaking Editorial Content Strategy Management See 11+     See less Project Management Program Management Strategic Planning Strategic Communications Public Relations Crisis Communications Communication Training Cross-functional Team... Corporate Communications Process Improvement Social Media Event Planning Media Relations Social Media Marketing Messaging Message Development Press Releases Teamwork Blogging Strategy Marketing Communications Leadership Public Speaking Editorial Content Strategy Management See 11+     See less Project Management Program Management Strategic Planning Strategic Communications Public Relations Crisis Communications Communication Training Cross-functional Team... Corporate Communications Process Improvement Social Media Event Planning Media Relations Social Media Marketing Messaging Message Development Press Releases Teamwork Blogging Strategy Marketing Communications Leadership Public Speaking Editorial Content Strategy Management See 11+     See less Education Stanford University Masters 2006  – 2007 Stanford University MA 2003  – 2007 Stanford University Masters Degree 2003  – 2007 Gymnasium Korschenbroich Bachelors Degrees 2002  – 2003 Orono High School 1998  – 2002 Maine Coast Semester 2001  – 2001 Stanford University Masters 2006  – 2007 Stanford University Masters 2006  – 2007 Stanford University Masters 2006  – 2007 Stanford University MA 2003  – 2007 Stanford University MA 2003  – 2007 Stanford University MA 2003  – 2007 Stanford University Masters Degree 2003  – 2007 Stanford University Masters Degree 2003  – 2007 Stanford University Masters Degree 2003  – 2007 Gymnasium Korschenbroich Bachelors Degrees 2002  – 2003 Gymnasium Korschenbroich Bachelors Degrees 2002  – 2003 Gymnasium Korschenbroich Bachelors Degrees 2002  – 2003 Orono High School 1998  – 2002 Orono High School 1998  – 2002 Orono High School 1998  – 2002 Maine Coast Semester 2001  – 2001 Maine Coast Semester 2001  – 2001 Maine Coast Semester 2001  – 2001 ", "Experience Manager - Global Communications & Public Affairs Google November 2011  – Present (3 years 10 months) Mountain View, CA Communications lead for Google advertising policy / issues, and various Google advertising products, including search ads and Analytics. Senior Associate - Global Communications & Public Affairs Google November 2009  –  November 2011  (2 years 1 month) B2B communications for various Google advertising products, including mobile ads. Associate - Global Communications & Public Affairs Google August 2008  –  November 2009  (1 year 4 months) Mountain View, CA - New York, NY Consumer focused PR-lead for various 'geo' products including: Google Earth, Google Mars, Google Moon. Intern Spark Media June 2007  –  August 2007  (3 months) Washington D.C. Metro Area Aided in National Archives research, script-reading, sound-editing and spot-checking of PBS documentaries 'A Prince Among Slaves' and 'American Voices' Intern Rogers Joseph O'Donnell June 2006  –  August 2006  (3 months) San Francisco Bay Area Assistant to lawyers and paralegals. Participant in relevant case document searches. Intern The Kivelstadt Group June 2005  –  August 2005  (3 months) San Francisco Bay Area Assisted CEO/owner, CFO, and accountants of commercial real estate development firm Manager - Global Communications & Public Affairs Google November 2011  – Present (3 years 10 months) Mountain View, CA Communications lead for Google advertising policy / issues, and various Google advertising products, including search ads and Analytics. Manager - Global Communications & Public Affairs Google November 2011  – Present (3 years 10 months) Mountain View, CA Communications lead for Google advertising policy / issues, and various Google advertising products, including search ads and Analytics. Senior Associate - Global Communications & Public Affairs Google November 2009  –  November 2011  (2 years 1 month) B2B communications for various Google advertising products, including mobile ads. Senior Associate - Global Communications & Public Affairs Google November 2009  –  November 2011  (2 years 1 month) B2B communications for various Google advertising products, including mobile ads. Associate - Global Communications & Public Affairs Google August 2008  –  November 2009  (1 year 4 months) Mountain View, CA - New York, NY Consumer focused PR-lead for various 'geo' products including: Google Earth, Google Mars, Google Moon. Associate - Global Communications & Public Affairs Google August 2008  –  November 2009  (1 year 4 months) Mountain View, CA - New York, NY Consumer focused PR-lead for various 'geo' products including: Google Earth, Google Mars, Google Moon. Intern Spark Media June 2007  –  August 2007  (3 months) Washington D.C. Metro Area Aided in National Archives research, script-reading, sound-editing and spot-checking of PBS documentaries 'A Prince Among Slaves' and 'American Voices' Intern Spark Media June 2007  –  August 2007  (3 months) Washington D.C. Metro Area Aided in National Archives research, script-reading, sound-editing and spot-checking of PBS documentaries 'A Prince Among Slaves' and 'American Voices' Intern Rogers Joseph O'Donnell June 2006  –  August 2006  (3 months) San Francisco Bay Area Assistant to lawyers and paralegals. Participant in relevant case document searches. Intern Rogers Joseph O'Donnell June 2006  –  August 2006  (3 months) San Francisco Bay Area Assistant to lawyers and paralegals. Participant in relevant case document searches. Intern The Kivelstadt Group June 2005  –  August 2005  (3 months) San Francisco Bay Area Assisted CEO/owner, CFO, and accountants of commercial real estate development firm Intern The Kivelstadt Group June 2005  –  August 2005  (3 months) San Francisco Bay Area Assisted CEO/owner, CFO, and accountants of commercial real estate development firm Languages French French French Skills Fluent in French Press Relations Mobile Technology Mobile Communications Mobile Advertising Mobile Internet Mobile Marketing Writing Monetization Strategic Partnerships Digital Strategy Digital Marketing Digital Media Public Affairs Content Strategy SEM Social Media Marketing Go-to-market Strategy E-commerce Interactive Marketing New Media PPC Corporate Development Mobile Applications Product Management SEO Content Development Online Marketing Mobile Devices Strategy Display Advertising Strategic Communications User Interface Design Search Advertising User Experience Web Analytics Content Management Entrepreneurship Google Analytics Start-ups Omniture Integrated Marketing Email Marketing Product Marketing Online Advertising Competitive Analysis Venture Capital Analytics Google Adwords See 34+     See less Skills  Fluent in French Press Relations Mobile Technology Mobile Communications Mobile Advertising Mobile Internet Mobile Marketing Writing Monetization Strategic Partnerships Digital Strategy Digital Marketing Digital Media Public Affairs Content Strategy SEM Social Media Marketing Go-to-market Strategy E-commerce Interactive Marketing New Media PPC Corporate Development Mobile Applications Product Management SEO Content Development Online Marketing Mobile Devices Strategy Display Advertising Strategic Communications User Interface Design Search Advertising User Experience Web Analytics Content Management Entrepreneurship Google Analytics Start-ups Omniture Integrated Marketing Email Marketing Product Marketing Online Advertising Competitive Analysis Venture Capital Analytics Google Adwords See 34+     See less Fluent in French Press Relations Mobile Technology Mobile Communications Mobile Advertising Mobile Internet Mobile Marketing Writing Monetization Strategic Partnerships Digital Strategy Digital Marketing Digital Media Public Affairs Content Strategy SEM Social Media Marketing Go-to-market Strategy E-commerce Interactive Marketing New Media PPC Corporate Development Mobile Applications Product Management SEO Content Development Online Marketing Mobile Devices Strategy Display Advertising Strategic Communications User Interface Design Search Advertising User Experience Web Analytics Content Management Entrepreneurship Google Analytics Start-ups Omniture Integrated Marketing Email Marketing Product Marketing Online Advertising Competitive Analysis Venture Capital Analytics Google Adwords See 34+     See less Fluent in French Press Relations Mobile Technology Mobile Communications Mobile Advertising Mobile Internet Mobile Marketing Writing Monetization Strategic Partnerships Digital Strategy Digital Marketing Digital Media Public Affairs Content Strategy SEM Social Media Marketing Go-to-market Strategy E-commerce Interactive Marketing New Media PPC Corporate Development Mobile Applications Product Management SEO Content Development Online Marketing Mobile Devices Strategy Display Advertising Strategic Communications User Interface Design Search Advertising User Experience Web Analytics Content Management Entrepreneurship Google Analytics Start-ups Omniture Integrated Marketing Email Marketing Product Marketing Online Advertising Competitive Analysis Venture Capital Analytics Google Adwords See 34+     See less Education University of Pennsylvania BA,  English (Honors) 2004  – 2008 English Major (Honors) San Francisco University High School 2000  – 2004 Activities and Societies:  Jazz Band (Tenor Saxophone) ,  Varsity Cross-Country Team ,  Varsity Basketball Team ,  Peer Advisor French American International School 1991  – 2000 University of Pennsylvania BA,  English (Honors) 2004  – 2008 English Major (Honors) University of Pennsylvania BA,  English (Honors) 2004  – 2008 English Major (Honors) University of Pennsylvania BA,  English (Honors) 2004  – 2008 English Major (Honors) San Francisco University High School 2000  – 2004 Activities and Societies:  Jazz Band (Tenor Saxophone) ,  Varsity Cross-Country Team ,  Varsity Basketball Team ,  Peer Advisor San Francisco University High School 2000  – 2004 Activities and Societies:  Jazz Band (Tenor Saxophone) ,  Varsity Cross-Country Team ,  Varsity Basketball Team ,  Peer Advisor San Francisco University High School 2000  – 2004 Activities and Societies:  Jazz Band (Tenor Saxophone) ,  Varsity Cross-Country Team ,  Varsity Basketball Team ,  Peer Advisor French American International School 1991  – 2000 French American International School 1991  – 2000 French American International School 1991  – 2000 ", "Skills Social Media Blogging Social Media Marketing Social Networking Editing New Media Public Relations Copywriting Corporate Communications Editorial Skills  Social Media Blogging Social Media Marketing Social Networking Editing New Media Public Relations Copywriting Corporate Communications Editorial Social Media Blogging Social Media Marketing Social Networking Editing New Media Public Relations Copywriting Corporate Communications Editorial Social Media Blogging Social Media Marketing Social Networking Editing New Media Public Relations Copywriting Corporate Communications Editorial ", "Experience Manager, Global Communications & Public Affairs Google June 2011  – Present (4 years 3 months) Account Executive The OutCast Agency August 2009  –  May 2011  (1 year 10 months) Facebook, salesforce.com, Jigsaw, CalStar Account Coordinator / Assistant Account Executive Porter Novelli July 2008  –  August 2009  (1 year 2 months) Southern California McDonald's, Ronald McDonald House Charities of Southern California Intern Porter Novelli January 2008  –  June 2008  (6 months) Manager, Global Communications & Public Affairs Google June 2011  – Present (4 years 3 months) Manager, Global Communications & Public Affairs Google June 2011  – Present (4 years 3 months) Account Executive The OutCast Agency August 2009  –  May 2011  (1 year 10 months) Facebook, salesforce.com, Jigsaw, CalStar Account Executive The OutCast Agency August 2009  –  May 2011  (1 year 10 months) Facebook, salesforce.com, Jigsaw, CalStar Account Coordinator / Assistant Account Executive Porter Novelli July 2008  –  August 2009  (1 year 2 months) Southern California McDonald's, Ronald McDonald House Charities of Southern California Account Coordinator / Assistant Account Executive Porter Novelli July 2008  –  August 2009  (1 year 2 months) Southern California McDonald's, Ronald McDonald House Charities of Southern California Intern Porter Novelli January 2008  –  June 2008  (6 months) Intern Porter Novelli January 2008  –  June 2008  (6 months) Skills Media Relations Public Relations Social Media Marketing Corporate Communications Salesforce.com Marketing Communications Strategic Communications Public Affairs Marketing Skills  Media Relations Public Relations Social Media Marketing Corporate Communications Salesforce.com Marketing Communications Strategic Communications Public Affairs Marketing Media Relations Public Relations Social Media Marketing Corporate Communications Salesforce.com Marketing Communications Strategic Communications Public Affairs Marketing Media Relations Public Relations Social Media Marketing Corporate Communications Salesforce.com Marketing Communications Strategic Communications Public Affairs Marketing Education University of California, Los Angeles B.A.,  Communication Studies 2004  – 2008 Activities and Societies:  UCLA Orientation Program ,  Office of Residential Life ,  Student Alumni Association ,  Center for Society & Genetics University of California, Los Angeles B.A.,  Communication Studies 2004  – 2008 Activities and Societies:  UCLA Orientation Program ,  Office of Residential Life ,  Student Alumni Association ,  Center for Society & Genetics University of California, Los Angeles B.A.,  Communication Studies 2004  – 2008 Activities and Societies:  UCLA Orientation Program ,  Office of Residential Life ,  Student Alumni Association ,  Center for Society & Genetics University of California, Los Angeles B.A.,  Communication Studies 2004  – 2008 Activities and Societies:  UCLA Orientation Program ,  Office of Residential Life ,  Student Alumni Association ,  Center for Society & Genetics ", "Experience International Communications Facebook May 2015  – Present (4 months) - Manage international communications strategy, operations, and issues Senior Manager, Public Policy & Government Relations YouTube September 2014  –  May 2015  (9 months) - Public policy lead for YouTube across a variety of issues including controversial content, terrorism, child safety, and copyright \n- Worked with policy operations and enforcement team to refine content policies and responses to violence and terrorism \n- Partnered with senior executives and key members of cross-functional teams to develop effective public policy materials on YouTube product features or launches for global government relations teams. \n- Partnered with PR, product, and engineering to roll out YouTube Kids Senior Manager, Public Policy & Government Relations Google January 2014  –  May 2015  (1 year 5 months) -Managed public policy and government relations strategy around free expression and controversial content issues \n-Conducted research, advocacy and outreach  \n-Served as Google's representative on the Board of Directors of the Global Network Initiative Senior Manager, Global Communications & Public Policy, Free Expression & International Relations Google February 2011  –  December 2013  (2 years 11 months) - Led communications strategy and media relations for free expression, international relations, and the Transparency Report \n- Mitigated negative coverage, managed crisis communications, and course-corrected misinformation on Google's advocacy for a free and open Internet \n- Strategic planning for free expression public policy advocacy \n PR lead, Google Fiber Google May 2012  –  September 2012  (5 months) Strategic PR lead for launch and pre-registration for Google Fiber in Kansas City Senior Manager, Public Policy & Global Communications, Asia-Pacific Google February 2011  –  July 2011  (6 months) - Five-month assignment as policy and PR lead for the Asia Pacific region, with a focus on free expression \n- Crisis response for Japan earthquake and tsunami \n- Managed PR for China censorship issues Manager, Global Communications & Public Affairs, Privacy Google August 2008  –  February 2011  (2 years 7 months) - Led Google PR efforts on privacy  \n- Advised all product PR efforts on privacy, including for Chrome, Android and Street View  \n- Coordinated companywide, cross-functional privacy council with advisors from engineering, product management, legal, public policy, and communications \n- Adept at crisis communications Senior Editor Foreign Policy Magazine June 2005  –  February 2008  (2 years 9 months) - Commissioned and edited feature articles \n- Wrote for website Freelance Writer and Editor various publications 2001  –  2008  (7 years) - Wrote for various publications including The New Republic, Portfolio, Fortune Small Business, Budget Travel Writer-Reporter Fortune Magazine 1999  –  2005  (6 years) - Reported and wrote stories focusing on telecommunications, technology, and media Editorial Assistant Newsweek Magazine 1998  –  1999  (1 year) - Researched stories for international and overseas editions International Communications Facebook May 2015  – Present (4 months) - Manage international communications strategy, operations, and issues International Communications Facebook May 2015  – Present (4 months) - Manage international communications strategy, operations, and issues Senior Manager, Public Policy & Government Relations YouTube September 2014  –  May 2015  (9 months) - Public policy lead for YouTube across a variety of issues including controversial content, terrorism, child safety, and copyright \n- Worked with policy operations and enforcement team to refine content policies and responses to violence and terrorism \n- Partnered with senior executives and key members of cross-functional teams to develop effective public policy materials on YouTube product features or launches for global government relations teams. \n- Partnered with PR, product, and engineering to roll out YouTube Kids Senior Manager, Public Policy & Government Relations YouTube September 2014  –  May 2015  (9 months) - Public policy lead for YouTube across a variety of issues including controversial content, terrorism, child safety, and copyright \n- Worked with policy operations and enforcement team to refine content policies and responses to violence and terrorism \n- Partnered with senior executives and key members of cross-functional teams to develop effective public policy materials on YouTube product features or launches for global government relations teams. \n- Partnered with PR, product, and engineering to roll out YouTube Kids Senior Manager, Public Policy & Government Relations Google January 2014  –  May 2015  (1 year 5 months) -Managed public policy and government relations strategy around free expression and controversial content issues \n-Conducted research, advocacy and outreach  \n-Served as Google's representative on the Board of Directors of the Global Network Initiative Senior Manager, Public Policy & Government Relations Google January 2014  –  May 2015  (1 year 5 months) -Managed public policy and government relations strategy around free expression and controversial content issues \n-Conducted research, advocacy and outreach  \n-Served as Google's representative on the Board of Directors of the Global Network Initiative Senior Manager, Global Communications & Public Policy, Free Expression & International Relations Google February 2011  –  December 2013  (2 years 11 months) - Led communications strategy and media relations for free expression, international relations, and the Transparency Report \n- Mitigated negative coverage, managed crisis communications, and course-corrected misinformation on Google's advocacy for a free and open Internet \n- Strategic planning for free expression public policy advocacy \n Senior Manager, Global Communications & Public Policy, Free Expression & International Relations Google February 2011  –  December 2013  (2 years 11 months) - Led communications strategy and media relations for free expression, international relations, and the Transparency Report \n- Mitigated negative coverage, managed crisis communications, and course-corrected misinformation on Google's advocacy for a free and open Internet \n- Strategic planning for free expression public policy advocacy \n PR lead, Google Fiber Google May 2012  –  September 2012  (5 months) Strategic PR lead for launch and pre-registration for Google Fiber in Kansas City PR lead, Google Fiber Google May 2012  –  September 2012  (5 months) Strategic PR lead for launch and pre-registration for Google Fiber in Kansas City Senior Manager, Public Policy & Global Communications, Asia-Pacific Google February 2011  –  July 2011  (6 months) - Five-month assignment as policy and PR lead for the Asia Pacific region, with a focus on free expression \n- Crisis response for Japan earthquake and tsunami \n- Managed PR for China censorship issues Senior Manager, Public Policy & Global Communications, Asia-Pacific Google February 2011  –  July 2011  (6 months) - Five-month assignment as policy and PR lead for the Asia Pacific region, with a focus on free expression \n- Crisis response for Japan earthquake and tsunami \n- Managed PR for China censorship issues Manager, Global Communications & Public Affairs, Privacy Google August 2008  –  February 2011  (2 years 7 months) - Led Google PR efforts on privacy  \n- Advised all product PR efforts on privacy, including for Chrome, Android and Street View  \n- Coordinated companywide, cross-functional privacy council with advisors from engineering, product management, legal, public policy, and communications \n- Adept at crisis communications Manager, Global Communications & Public Affairs, Privacy Google August 2008  –  February 2011  (2 years 7 months) - Led Google PR efforts on privacy  \n- Advised all product PR efforts on privacy, including for Chrome, Android and Street View  \n- Coordinated companywide, cross-functional privacy council with advisors from engineering, product management, legal, public policy, and communications \n- Adept at crisis communications Senior Editor Foreign Policy Magazine June 2005  –  February 2008  (2 years 9 months) - Commissioned and edited feature articles \n- Wrote for website Senior Editor Foreign Policy Magazine June 2005  –  February 2008  (2 years 9 months) - Commissioned and edited feature articles \n- Wrote for website Freelance Writer and Editor various publications 2001  –  2008  (7 years) - Wrote for various publications including The New Republic, Portfolio, Fortune Small Business, Budget Travel Freelance Writer and Editor various publications 2001  –  2008  (7 years) - Wrote for various publications including The New Republic, Portfolio, Fortune Small Business, Budget Travel Writer-Reporter Fortune Magazine 1999  –  2005  (6 years) - Reported and wrote stories focusing on telecommunications, technology, and media Writer-Reporter Fortune Magazine 1999  –  2005  (6 years) - Reported and wrote stories focusing on telecommunications, technology, and media Editorial Assistant Newsweek Magazine 1998  –  1999  (1 year) - Researched stories for international and overseas editions Editorial Assistant Newsweek Magazine 1998  –  1999  (1 year) - Researched stories for international and overseas editions Skills International Relations Editing Writing Blogging Publishing Media relations Public Relations Publicity Public Policy Policy Business Reporting Corporate Communications Strategic Communications Crisis Communications Communications Strategy Journalism Internet Content Strategy Media Relations Magazines Public Affairs See 6+     See less Skills  International Relations Editing Writing Blogging Publishing Media relations Public Relations Publicity Public Policy Policy Business Reporting Corporate Communications Strategic Communications Crisis Communications Communications Strategy Journalism Internet Content Strategy Media Relations Magazines Public Affairs See 6+     See less International Relations Editing Writing Blogging Publishing Media relations Public Relations Publicity Public Policy Policy Business Reporting Corporate Communications Strategic Communications Crisis Communications Communications Strategy Journalism Internet Content Strategy Media Relations Magazines Public Affairs See 6+     See less International Relations Editing Writing Blogging Publishing Media relations Public Relations Publicity Public Policy Policy Business Reporting Corporate Communications Strategic Communications Crisis Communications Communications Strategy Journalism Internet Content Strategy Media Relations Magazines Public Affairs See 6+     See less Education The London School of Economics and Political Science (LSE) MSc,  International Relations 1996  – 1997 Activities and Societies:  Fulbright fellowship University of California, Berkeley BA,  Political Science 1992  – 1996 The University of Göttingen Political Science 1994  – 1995 Activities and Societies:  University of California Education Abroad Program Boulder High School Urheilupuiston Luko, Mikkeli The London School of Economics and Political Science (LSE) MSc,  International Relations 1996  – 1997 Activities and Societies:  Fulbright fellowship The London School of Economics and Political Science (LSE) MSc,  International Relations 1996  – 1997 Activities and Societies:  Fulbright fellowship The London School of Economics and Political Science (LSE) MSc,  International Relations 1996  – 1997 Activities and Societies:  Fulbright fellowship University of California, Berkeley BA,  Political Science 1992  – 1996 University of California, Berkeley BA,  Political Science 1992  – 1996 University of California, Berkeley BA,  Political Science 1992  – 1996 The University of Göttingen Political Science 1994  – 1995 Activities and Societies:  University of California Education Abroad Program The University of Göttingen Political Science 1994  – 1995 Activities and Societies:  University of California Education Abroad Program The University of Göttingen Political Science 1994  – 1995 Activities and Societies:  University of California Education Abroad Program Boulder High School Boulder High School Boulder High School Urheilupuiston Luko, Mikkeli Urheilupuiston Luko, Mikkeli Urheilupuiston Luko, Mikkeli Honors & Awards Additional Honors & Awards Fulbright fellowship, East-West Center Jefferson Fellowship, American Assembly Next Generation Project, Asia Foundation Emerging Leader Additional Honors & Awards Fulbright fellowship, East-West Center Jefferson Fellowship, American Assembly Next Generation Project, Asia Foundation Emerging Leader Additional Honors & Awards Fulbright fellowship, East-West Center Jefferson Fellowship, American Assembly Next Generation Project, Asia Foundation Emerging Leader Additional Honors & Awards Fulbright fellowship, East-West Center Jefferson Fellowship, American Assembly Next Generation Project, Asia Foundation Emerging Leader ", "Summary I'm an IBMer. I'm also a former Googler and a former HPer. \n \nI am a strategic, seasoned marketing executive with deep expertise in corporate marketing, especially social media, public relations, brand management, and employee communications. Plus, I'm a Guinness World Record holder! \n \nTelling stories is my passion and I also know my way around building innovative content strategies. Summary I'm an IBMer. I'm also a former Googler and a former HPer. \n \nI am a strategic, seasoned marketing executive with deep expertise in corporate marketing, especially social media, public relations, brand management, and employee communications. Plus, I'm a Guinness World Record holder! \n \nTelling stories is my passion and I also know my way around building innovative content strategies. I'm an IBMer. I'm also a former Googler and a former HPer. \n \nI am a strategic, seasoned marketing executive with deep expertise in corporate marketing, especially social media, public relations, brand management, and employee communications. Plus, I'm a Guinness World Record holder! \n \nTelling stories is my passion and I also know my way around building innovative content strategies. I'm an IBMer. I'm also a former Googler and a former HPer. \n \nI am a strategic, seasoned marketing executive with deep expertise in corporate marketing, especially social media, public relations, brand management, and employee communications. Plus, I'm a Guinness World Record holder! \n \nTelling stories is my passion and I also know my way around building innovative content strategies. Experience Global Director, Digital Content & Editorial Marketing, IBM Commerce, Social, Mobile IBM February 2015  – Present (7 months) Social Business Program Director IBM September 2013  – Present (2 years) Head of Social Media Strategy, Industry Solutions IBM January 2012  –  February 2013  (1 year 2 months) Senior Director Coremetrics (acquired by IBM in 2010) October 2009  –  December 2011  (2 years 3 months) Director, Corporate Communications Coremetrics (acquired by IBM in 2010) September 2008  –  September 2009  (1 year 1 month) Senior Manager, Global Communications and Public Affairs Google February 2004  –  May 2008  (4 years 4 months) Senior Manager, Public Relations Hewlett Packard 1999  –  2004  (5 years) Senior Account Executive Weber Group (now Weber Shandwick) 1998  –  1999  (1 year) Global Director, Digital Content & Editorial Marketing, IBM Commerce, Social, Mobile IBM February 2015  – Present (7 months) Global Director, Digital Content & Editorial Marketing, IBM Commerce, Social, Mobile IBM February 2015  – Present (7 months) Social Business Program Director IBM September 2013  – Present (2 years) Social Business Program Director IBM September 2013  – Present (2 years) Head of Social Media Strategy, Industry Solutions IBM January 2012  –  February 2013  (1 year 2 months) Head of Social Media Strategy, Industry Solutions IBM January 2012  –  February 2013  (1 year 2 months) Senior Director Coremetrics (acquired by IBM in 2010) October 2009  –  December 2011  (2 years 3 months) Senior Director Coremetrics (acquired by IBM in 2010) October 2009  –  December 2011  (2 years 3 months) Director, Corporate Communications Coremetrics (acquired by IBM in 2010) September 2008  –  September 2009  (1 year 1 month) Director, Corporate Communications Coremetrics (acquired by IBM in 2010) September 2008  –  September 2009  (1 year 1 month) Senior Manager, Global Communications and Public Affairs Google February 2004  –  May 2008  (4 years 4 months) Senior Manager, Global Communications and Public Affairs Google February 2004  –  May 2008  (4 years 4 months) Senior Manager, Public Relations Hewlett Packard 1999  –  2004  (5 years) Senior Manager, Public Relations Hewlett Packard 1999  –  2004  (5 years) Senior Account Executive Weber Group (now Weber Shandwick) 1998  –  1999  (1 year) Senior Account Executive Weber Group (now Weber Shandwick) 1998  –  1999  (1 year) Languages Italian French Italian French Italian French Skills Communication Training Social Media Marketing Social Media Digital Media Integrated Marketing Marketing Communications Strategy Crisis Communications Corporate Communications Content Management Strategic Communications Social Listening Marketing Internal Communications Public Relations Start-ups See 1+     See less Skills  Communication Training Social Media Marketing Social Media Digital Media Integrated Marketing Marketing Communications Strategy Crisis Communications Corporate Communications Content Management Strategic Communications Social Listening Marketing Internal Communications Public Relations Start-ups See 1+     See less Communication Training Social Media Marketing Social Media Digital Media Integrated Marketing Marketing Communications Strategy Crisis Communications Corporate Communications Content Management Strategic Communications Social Listening Marketing Internal Communications Public Relations Start-ups See 1+     See less Communication Training Social Media Marketing Social Media Digital Media Integrated Marketing Marketing Communications Strategy Crisis Communications Corporate Communications Content Management Strategic Communications Social Listening Marketing Internal Communications Public Relations Start-ups See 1+     See less Education University of California, Berkeley Bachelor of Arts (B.A.),  English Literature Activities and Societies:  Phi Beta Kappa ,  Highest Honors University of Southern California MA,  Communications Management Activities and Societies:  Annenberg Merit Scholar University of California, Berkeley Bachelor of Arts (B.A.),  English Literature Activities and Societies:  Phi Beta Kappa ,  Highest Honors University of California, Berkeley Bachelor of Arts (B.A.),  English Literature Activities and Societies:  Phi Beta Kappa ,  Highest Honors University of California, Berkeley Bachelor of Arts (B.A.),  English Literature Activities and Societies:  Phi Beta Kappa ,  Highest Honors University of Southern California MA,  Communications Management Activities and Societies:  Annenberg Merit Scholar University of Southern California MA,  Communications Management Activities and Societies:  Annenberg Merit Scholar University of Southern California MA,  Communications Management Activities and Societies:  Annenberg Merit Scholar ", "Languages French French French Skills Press Releases Public Relations Media Relations HTML Public Speaking JavaScript Publications Blogging New Media Copywriting Digital Media Social Media Editing Public Affairs Marketing Skills  Press Releases Public Relations Media Relations HTML Public Speaking JavaScript Publications Blogging New Media Copywriting Digital Media Social Media Editing Public Affairs Marketing Press Releases Public Relations Media Relations HTML Public Speaking JavaScript Publications Blogging New Media Copywriting Digital Media Social Media Editing Public Affairs Marketing Press Releases Public Relations Media Relations HTML Public Speaking JavaScript Publications Blogging New Media Copywriting Digital Media Social Media Editing Public Affairs Marketing ", "Experience Executive Communications Manager Google August 2008  – Present (7 years 1 month) Mountain View, CA Internal Communications Executive Communications Manager Google August 2008  – Present (7 years 1 month) Mountain View, CA Internal Communications Executive Communications Manager Google August 2008  – Present (7 years 1 month) Mountain View, CA Internal Communications Education University of Pennsylvania B.S. & B.A.,  Computer Science; Psychology 1999  – 2003 Minor: Asian American Studies University of Pennsylvania B.S. & B.A.,  Computer Science; Psychology 1999  – 2003 Minor: Asian American Studies University of Pennsylvania B.S. & B.A.,  Computer Science; Psychology 1999  – 2003 Minor: Asian American Studies University of Pennsylvania B.S. & B.A.,  Computer Science; Psychology 1999  – 2003 Minor: Asian American Studies ", "Skills Social Media Corporate Communications Crisis Communications Public Affairs Media Relations Internal Communications Strategic Communications Public Relations Strategy Digital Strategy Digital Media Integrated Marketing New Media Publicity Skills  Social Media Corporate Communications Crisis Communications Public Affairs Media Relations Internal Communications Strategic Communications Public Relations Strategy Digital Strategy Digital Media Integrated Marketing New Media Publicity Social Media Corporate Communications Crisis Communications Public Affairs Media Relations Internal Communications Strategic Communications Public Relations Strategy Digital Strategy Digital Media Integrated Marketing New Media Publicity Social Media Corporate Communications Crisis Communications Public Affairs Media Relations Internal Communications Strategic Communications Public Relations Strategy Digital Strategy Digital Media Integrated Marketing New Media Publicity ", "Skills Digital Media Social Media Marketing Strategic Communications Social Media Press Releases Public Relations Marketing Communications Crisis Communications Blogging Editing Leadership Advertising Media Relations Strategy Digital Marketing Skills  Digital Media Social Media Marketing Strategic Communications Social Media Press Releases Public Relations Marketing Communications Crisis Communications Blogging Editing Leadership Advertising Media Relations Strategy Digital Marketing Digital Media Social Media Marketing Strategic Communications Social Media Press Releases Public Relations Marketing Communications Crisis Communications Blogging Editing Leadership Advertising Media Relations Strategy Digital Marketing Digital Media Social Media Marketing Strategic Communications Social Media Press Releases Public Relations Marketing Communications Crisis Communications Blogging Editing Leadership Advertising Media Relations Strategy Digital Marketing ", "Summary Diana is a communications and marketing professional with expertise in brand-building and integrated marketing campaigns. She has experience leading global PR teams and has built strong relationships with tech, business and consumer reporters, including bloggers and broadcast media. \n \nSpecialties- \nBrand development \nBrand awareness \nStrategic partnerships \nMessage development and narratives \nSocial media \nPublic relations \nCorporate reputation and positioning \nStrategic communications \nFinancial communications, earnings, and M&A \nCrisis management and litigation Summary Diana is a communications and marketing professional with expertise in brand-building and integrated marketing campaigns. She has experience leading global PR teams and has built strong relationships with tech, business and consumer reporters, including bloggers and broadcast media. \n \nSpecialties- \nBrand development \nBrand awareness \nStrategic partnerships \nMessage development and narratives \nSocial media \nPublic relations \nCorporate reputation and positioning \nStrategic communications \nFinancial communications, earnings, and M&A \nCrisis management and litigation Diana is a communications and marketing professional with expertise in brand-building and integrated marketing campaigns. She has experience leading global PR teams and has built strong relationships with tech, business and consumer reporters, including bloggers and broadcast media. \n \nSpecialties- \nBrand development \nBrand awareness \nStrategic partnerships \nMessage development and narratives \nSocial media \nPublic relations \nCorporate reputation and positioning \nStrategic communications \nFinancial communications, earnings, and M&A \nCrisis management and litigation Diana is a communications and marketing professional with expertise in brand-building and integrated marketing campaigns. She has experience leading global PR teams and has built strong relationships with tech, business and consumer reporters, including bloggers and broadcast media. \n \nSpecialties- \nBrand development \nBrand awareness \nStrategic partnerships \nMessage development and narratives \nSocial media \nPublic relations \nCorporate reputation and positioning \nStrategic communications \nFinancial communications, earnings, and M&A \nCrisis management and litigation Experience Director of Communications Zazzle July 2012  – Present (3 years 2 months) San Francisco Bay Area Senior Manager, Global Communications and Public Affairs Google June 2006  –  June 2012  (6 years 1 month) Communications Consultant Self-Employed 2001  –  2004  (3 years) Public Relations Manager Shockwave.com 1999  –  2001  (2 years) Account Executive Fleishman-Hillard 1999  –  1999  (less than a year) Field / Assistant to Press Secretary Congressional Campaign 1998  –  1998  (less than a year) Director of Communications Zazzle July 2012  – Present (3 years 2 months) San Francisco Bay Area Director of Communications Zazzle July 2012  – Present (3 years 2 months) San Francisco Bay Area Senior Manager, Global Communications and Public Affairs Google June 2006  –  June 2012  (6 years 1 month) Senior Manager, Global Communications and Public Affairs Google June 2006  –  June 2012  (6 years 1 month) Communications Consultant Self-Employed 2001  –  2004  (3 years) Communications Consultant Self-Employed 2001  –  2004  (3 years) Public Relations Manager Shockwave.com 1999  –  2001  (2 years) Public Relations Manager Shockwave.com 1999  –  2001  (2 years) Account Executive Fleishman-Hillard 1999  –  1999  (less than a year) Account Executive Fleishman-Hillard 1999  –  1999  (less than a year) Field / Assistant to Press Secretary Congressional Campaign 1998  –  1998  (less than a year) Field / Assistant to Press Secretary Congressional Campaign 1998  –  1998  (less than a year) Skills Social Media Blogging Online Advertising Strategic Communications Media Relations Public Relations Building Brand Awareness Events Marketing Content Marketing Consumer Media Writing Crisis Communications Media Skills Training Advertising Copy Editing Social Media Marketing Editorial Feature Articles Digital Strategy Publishing Online Marketing Digital Media Digital Marketing Strategic Partnerships Messaging New Media Corporate Communications Integrated Marketing Sponsorship Content Management Content Strategy Web Content SEM Brand Awareness See 20+     See less Skills  Social Media Blogging Online Advertising Strategic Communications Media Relations Public Relations Building Brand Awareness Events Marketing Content Marketing Consumer Media Writing Crisis Communications Media Skills Training Advertising Copy Editing Social Media Marketing Editorial Feature Articles Digital Strategy Publishing Online Marketing Digital Media Digital Marketing Strategic Partnerships Messaging New Media Corporate Communications Integrated Marketing Sponsorship Content Management Content Strategy Web Content SEM Brand Awareness See 20+     See less Social Media Blogging Online Advertising Strategic Communications Media Relations Public Relations Building Brand Awareness Events Marketing Content Marketing Consumer Media Writing Crisis Communications Media Skills Training Advertising Copy Editing Social Media Marketing Editorial Feature Articles Digital Strategy Publishing Online Marketing Digital Media Digital Marketing Strategic Partnerships Messaging New Media Corporate Communications Integrated Marketing Sponsorship Content Management Content Strategy Web Content SEM Brand Awareness See 20+     See less Social Media Blogging Online Advertising Strategic Communications Media Relations Public Relations Building Brand Awareness Events Marketing Content Marketing Consumer Media Writing Crisis Communications Media Skills Training Advertising Copy Editing Social Media Marketing Editorial Feature Articles Digital Strategy Publishing Online Marketing Digital Media Digital Marketing Strategic Partnerships Messaging New Media Corporate Communications Integrated Marketing Sponsorship Content Management Content Strategy Web Content SEM Brand Awareness See 20+     See less Education University of California, Berkeley - Walter A. Haas School of Business MBA 2004  – 2006 Harvard University BA,  English 1994  – 1998 University of California, Berkeley - Walter A. Haas School of Business MBA 2004  – 2006 University of California, Berkeley - Walter A. Haas School of Business MBA 2004  – 2006 University of California, Berkeley - Walter A. Haas School of Business MBA 2004  – 2006 Harvard University BA,  English 1994  – 1998 Harvard University BA,  English 1994  – 1998 Harvard University BA,  English 1994  – 1998 ", "Summary Communications professional and one-time attorney with 10+ years in media relations and legal affairs. \n \nSpecialties: crisis communications, executive communications, corporate positioning, and issues/reputation management, with extensive experience in technology, payments, strategic partnerships, business/finance, monetization, IP, M&A, litigation, HR issues, and general corporate matters. Summary Communications professional and one-time attorney with 10+ years in media relations and legal affairs. \n \nSpecialties: crisis communications, executive communications, corporate positioning, and issues/reputation management, with extensive experience in technology, payments, strategic partnerships, business/finance, monetization, IP, M&A, litigation, HR issues, and general corporate matters. Communications professional and one-time attorney with 10+ years in media relations and legal affairs. \n \nSpecialties: crisis communications, executive communications, corporate positioning, and issues/reputation management, with extensive experience in technology, payments, strategic partnerships, business/finance, monetization, IP, M&A, litigation, HR issues, and general corporate matters. Communications professional and one-time attorney with 10+ years in media relations and legal affairs. \n \nSpecialties: crisis communications, executive communications, corporate positioning, and issues/reputation management, with extensive experience in technology, payments, strategic partnerships, business/finance, monetization, IP, M&A, litigation, HR issues, and general corporate matters. Experience Head of Communications Square January 2015  – Present (8 months) I lead Square's communications team, responsible for the company's corporate, product, and internal communications efforts, as well as community relations. Director, Corporate Communications Square September 2011  –  December 2014  (3 years 4 months) I led Square's corporate communications team within the company's Brand organization, managing media relations for company milestones including flagship product introductions, Starbucks partnership, financing rounds, executive issues, and board appointments. \n \nTeam's responsibilities included: business and finance communications, executives, M&A, strategic partnerships, HR/culture, risk and fraud, litigation, security, privacy, government and regulatory affairs, compliance and policy, internal communications, and other company matters.  Manager, Global Communications, Public Affairs Google August 2010  –  September 2011  (1 year 2 months) Crisis, issues, and executive communications; managed team responsible for finance, litigation, and M&A comms, including Oracle lawsuit, and Google's acquisition of Motorola. Manager, Global Communications, Public Affairs YouTube September 2007  –  August 2010  (3 years) Led communications re: YouTube's business, monetization/advertising products, copyright issues (including Viacom lawsuit), and news and politics initiatives. Manager, Global Communications, Public Affairs Google January 2007  –  September 2007  (9 months) Communications re: mergers and acquisitions, business development, and other general corporate issues. Senior Contracts Manager Independent Television Service June 2005  –  January 2007  (1 year 8 months) Drafted/negotiated agreements for the production, license, and distribution of content for the Public Broadcasting Service (PBS); provided advice and counsel regarding fair use and copyright infringement, as well as defamation, public disclosure, and other intellectual property and/or privacy matters. Head of Communications Square January 2015  – Present (8 months) I lead Square's communications team, responsible for the company's corporate, product, and internal communications efforts, as well as community relations. Head of Communications Square January 2015  – Present (8 months) I lead Square's communications team, responsible for the company's corporate, product, and internal communications efforts, as well as community relations. Director, Corporate Communications Square September 2011  –  December 2014  (3 years 4 months) I led Square's corporate communications team within the company's Brand organization, managing media relations for company milestones including flagship product introductions, Starbucks partnership, financing rounds, executive issues, and board appointments. \n \nTeam's responsibilities included: business and finance communications, executives, M&A, strategic partnerships, HR/culture, risk and fraud, litigation, security, privacy, government and regulatory affairs, compliance and policy, internal communications, and other company matters.  Director, Corporate Communications Square September 2011  –  December 2014  (3 years 4 months) I led Square's corporate communications team within the company's Brand organization, managing media relations for company milestones including flagship product introductions, Starbucks partnership, financing rounds, executive issues, and board appointments. \n \nTeam's responsibilities included: business and finance communications, executives, M&A, strategic partnerships, HR/culture, risk and fraud, litigation, security, privacy, government and regulatory affairs, compliance and policy, internal communications, and other company matters.  Manager, Global Communications, Public Affairs Google August 2010  –  September 2011  (1 year 2 months) Crisis, issues, and executive communications; managed team responsible for finance, litigation, and M&A comms, including Oracle lawsuit, and Google's acquisition of Motorola. Manager, Global Communications, Public Affairs Google August 2010  –  September 2011  (1 year 2 months) Crisis, issues, and executive communications; managed team responsible for finance, litigation, and M&A comms, including Oracle lawsuit, and Google's acquisition of Motorola. Manager, Global Communications, Public Affairs YouTube September 2007  –  August 2010  (3 years) Led communications re: YouTube's business, monetization/advertising products, copyright issues (including Viacom lawsuit), and news and politics initiatives. Manager, Global Communications, Public Affairs YouTube September 2007  –  August 2010  (3 years) Led communications re: YouTube's business, monetization/advertising products, copyright issues (including Viacom lawsuit), and news and politics initiatives. Manager, Global Communications, Public Affairs Google January 2007  –  September 2007  (9 months) Communications re: mergers and acquisitions, business development, and other general corporate issues. Manager, Global Communications, Public Affairs Google January 2007  –  September 2007  (9 months) Communications re: mergers and acquisitions, business development, and other general corporate issues. Senior Contracts Manager Independent Television Service June 2005  –  January 2007  (1 year 8 months) Drafted/negotiated agreements for the production, license, and distribution of content for the Public Broadcasting Service (PBS); provided advice and counsel regarding fair use and copyright infringement, as well as defamation, public disclosure, and other intellectual property and/or privacy matters. Senior Contracts Manager Independent Television Service June 2005  –  January 2007  (1 year 8 months) Drafted/negotiated agreements for the production, license, and distribution of content for the Public Broadcasting Service (PBS); provided advice and counsel regarding fair use and copyright infringement, as well as defamation, public disclosure, and other intellectual property and/or privacy matters. Languages   Skills Mergers Monetization Litigation Payments Media Analysis IP Digital Media New Media Strategic Partnerships Start-ups Social Media Public Relations Skills  Mergers Monetization Litigation Payments Media Analysis IP Digital Media New Media Strategic Partnerships Start-ups Social Media Public Relations Mergers Monetization Litigation Payments Media Analysis IP Digital Media New Media Strategic Partnerships Start-ups Social Media Public Relations Mergers Monetization Litigation Payments Media Analysis IP Digital Media New Media Strategic Partnerships Start-ups Social Media Public Relations Education University of California, Hastings College of the Law JD 2001  – 2004 Yale University B.A.,  History of Art 1997  – 2001 University of California, Hastings College of the Law JD 2001  – 2004 University of California, Hastings College of the Law JD 2001  – 2004 University of California, Hastings College of the Law JD 2001  – 2004 Yale University B.A.,  History of Art 1997  – 2001 Yale University B.A.,  History of Art 1997  – 2001 Yale University B.A.,  History of Art 1997  – 2001 Honors & Awards ", "Skills Social Media Public Relations Media Relations Crisis Communications Communication Training Corporate Communications Strategic Communications Analyst Relations Internal Communications Messaging Start-ups Entertainment Advertising New Media Strategy Social Media Marketing Digital Media Facebook See 3+     See less Skills  Social Media Public Relations Media Relations Crisis Communications Communication Training Corporate Communications Strategic Communications Analyst Relations Internal Communications Messaging Start-ups Entertainment Advertising New Media Strategy Social Media Marketing Digital Media Facebook See 3+     See less Social Media Public Relations Media Relations Crisis Communications Communication Training Corporate Communications Strategic Communications Analyst Relations Internal Communications Messaging Start-ups Entertainment Advertising New Media Strategy Social Media Marketing Digital Media Facebook See 3+     See less Social Media Public Relations Media Relations Crisis Communications Communication Training Corporate Communications Strategic Communications Analyst Relations Internal Communications Messaging Start-ups Entertainment Advertising New Media Strategy Social Media Marketing Digital Media Facebook See 3+     See less ", "Experience Senior Manager, Communications and Public Affairs Google February 2010  – Present (5 years 7 months) Greater New York City Area Reporter CNN February 2005  –  January 2010  (5 years) Washington D.C. Metro Area Political Producer CNN May 2000  –  February 2005  (4 years 10 months) Washington D.C. Metro Area Senior Manager, Communications and Public Affairs Google February 2010  – Present (5 years 7 months) Greater New York City Area Senior Manager, Communications and Public Affairs Google February 2010  – Present (5 years 7 months) Greater New York City Area Reporter CNN February 2005  –  January 2010  (5 years) Washington D.C. Metro Area Reporter CNN February 2005  –  January 2010  (5 years) Washington D.C. Metro Area Political Producer CNN May 2000  –  February 2005  (4 years 10 months) Washington D.C. Metro Area Political Producer CNN May 2000  –  February 2005  (4 years 10 months) Washington D.C. Metro Area Education American University Master of Arts (MA),  International Relations and Affairs 1998  – 2000 University of Leeds Bachelor of Arts (BA),  History 1995  – 1998 American University Master of Arts (MA),  International Relations and Affairs 1998  – 2000 American University Master of Arts (MA),  International Relations and Affairs 1998  – 2000 American University Master of Arts (MA),  International Relations and Affairs 1998  – 2000 University of Leeds Bachelor of Arts (BA),  History 1995  – 1998 University of Leeds Bachelor of Arts (BA),  History 1995  – 1998 University of Leeds Bachelor of Arts (BA),  History 1995  – 1998 ", "Experience Manager, Communications Google July 2013  – Present (2 years 2 months) Mountain View, CA I’m currently on the Global Communications and Public Policy team at Google, where I’m a communications manager for Google[x]. My work involves setting communications strategy for Google[x]’s latest projects, including Project Loon, the Google Self-Driving Car Project, Project Wing and Makani energy kites.  \n Senior Associate, Corporate Communications Google October 2011  –  June 2013  (1 year 9 months) Mountain View, CA PR lead for corporate development (42+ acquisitions), investments, HR, real estate & workplace services Associate, Corporate Communications Google January 2011  –  September 2011  (9 months) Mountain View, CA PR for M&A and patent litigation Recruiting Intern DreamWorks Animation September 2010  –  December 2010  (4 months) Corporate Communications Intern Facebook May 2010  –  August 2010  (4 months) Client Associate Infinity Financial Services February 2009  –  May 2010  (1 year 4 months) Administrative Assistant Torque Interactive Media December 2008  –  October 2009  (11 months) Manager, Communications Google July 2013  – Present (2 years 2 months) Mountain View, CA I’m currently on the Global Communications and Public Policy team at Google, where I’m a communications manager for Google[x]. My work involves setting communications strategy for Google[x]’s latest projects, including Project Loon, the Google Self-Driving Car Project, Project Wing and Makani energy kites.  \n Manager, Communications Google July 2013  – Present (2 years 2 months) Mountain View, CA I’m currently on the Global Communications and Public Policy team at Google, where I’m a communications manager for Google[x]. My work involves setting communications strategy for Google[x]’s latest projects, including Project Loon, the Google Self-Driving Car Project, Project Wing and Makani energy kites.  \n Senior Associate, Corporate Communications Google October 2011  –  June 2013  (1 year 9 months) Mountain View, CA PR lead for corporate development (42+ acquisitions), investments, HR, real estate & workplace services Senior Associate, Corporate Communications Google October 2011  –  June 2013  (1 year 9 months) Mountain View, CA PR lead for corporate development (42+ acquisitions), investments, HR, real estate & workplace services Associate, Corporate Communications Google January 2011  –  September 2011  (9 months) Mountain View, CA PR for M&A and patent litigation Associate, Corporate Communications Google January 2011  –  September 2011  (9 months) Mountain View, CA PR for M&A and patent litigation Recruiting Intern DreamWorks Animation September 2010  –  December 2010  (4 months) Recruiting Intern DreamWorks Animation September 2010  –  December 2010  (4 months) Corporate Communications Intern Facebook May 2010  –  August 2010  (4 months) Corporate Communications Intern Facebook May 2010  –  August 2010  (4 months) Client Associate Infinity Financial Services February 2009  –  May 2010  (1 year 4 months) Client Associate Infinity Financial Services February 2009  –  May 2010  (1 year 4 months) Administrative Assistant Torque Interactive Media December 2008  –  October 2009  (11 months) Administrative Assistant Torque Interactive Media December 2008  –  October 2009  (11 months) Skills Corporate Communications Public Relations Strategic Communications Media Relations Product Communications Brand Communications Crisis Communications Mergers & Acquisitions HR Communications Writing Human Resources Content Strategy Social Media Project Management Project Planning Skills  Corporate Communications Public Relations Strategic Communications Media Relations Product Communications Brand Communications Crisis Communications Mergers & Acquisitions HR Communications Writing Human Resources Content Strategy Social Media Project Management Project Planning Corporate Communications Public Relations Strategic Communications Media Relations Product Communications Brand Communications Crisis Communications Mergers & Acquisitions HR Communications Writing Human Resources Content Strategy Social Media Project Management Project Planning Corporate Communications Public Relations Strategic Communications Media Relations Product Communications Brand Communications Crisis Communications Mergers & Acquisitions HR Communications Writing Human Resources Content Strategy Social Media Project Management Project Planning Education University of California, Berkeley 2010 Stanford University Strategic Decision and Risk Management Certificate University of California, Berkeley 2010 University of California, Berkeley 2010 University of California, Berkeley 2010 Stanford University Strategic Decision and Risk Management Certificate Stanford University Strategic Decision and Risk Management Certificate Stanford University Strategic Decision and Risk Management Certificate ", "Experience Customer Success Manager WalkMe™ March 2015  – Present (6 months) San Francisco Bay Area -Deep experience with the WalkMe platform and ability to guide others to build creative and compelling business cases for return on investment \n- History of managing Fortune 500 clients \n- Data driven decision making based on customer data. \n-Problem solver both in operations and analytics; able to structure a variety of client questions, work across organization to solve, and present useful recommendations that drive impact \n- Consistently reliable judgment; ability to drive impact and value  \n- Able to accurately assess challenging customer situations and to surface and manage needs Manager, Global Communications & Public Affairs Google April 2014  –  October 2014  (7 months) Mountain View, CA Storytelling for Google[x]'s Project Wing and Google Fiber. Deputy Director, Communications US Air Force Reserve May 2012  –  May 2014  (2 years 1 month) National Media Engagement -- 805 Third Ave, New York, NY - Plans media/civic engagements in NYC for the Secretary of the Air Force, Chief of Staff of the Air Force & key AF leaders; provides on-scene public affairs support \n- Advises/counsels senior AF leaders & experts on NYC's dynamic mass media environment; conducts media analysis \n- Developed guidance and provided counsel for high-profile executives appearing on Today Show, Good Morning America, Fox and MSNBC Morning Joe during Air Force Week N.Y. 2012; reached 133m people, $15m in ad value \n- Built first digital strategy for Air Force N.Y.; implementation resulted in 10x increase in Facebook reach, 15x increase in Twitter reach, 50x increase in Instagram reach; netted media engagements with the Office of the Mayor and NASDAQ  \n- Managed Air Force presence and media strategy for Air Force Week N.Y. 2013, reached 8m people at 1% the cost of Air Force Week 2012; established cost-effective model for units across the Air Force Co-Founder, Director of Communications Bonfyre App April 2012  –  December 2013  (1 year 9 months) -\tDeveloped brand voice; led messaging, product launch, internal, and external communication strategies; fostered relationships with Techcrunch, VentureBeat, PandoDaily, and Forbes; placements helped close $2m funding round \n-\tPlanned and managed company launch at DEMO 2012; including media lists prep, interview sourcing, execution, and logistics; exceeded coverage goals and only non-main stage demonstrator to be recognized as “Top 14” by Techcrunch  \n-\tLed content collaboration with product, engineering, business, and Fortune 500 clients (Anheuser-Busch, Amazon, Express Scripts) to highlight B2B wins; drove repeat purchase and helped scale revenue Deputy Director, Public Affairs United States Air Force May 2008  –  2012  (4 years) Cannon Air Force Base, N.M. - Managed 15 communication specialists supporting a combat-deployable special operations wing of 5,200 Airmen, 550 civilians, and their families  \n- Directed special operations crisis communication program, arranged 150+ interviews and news conferences for media outlets to include the Wall Street Journal, New York Times and Washington Post; zero information security incidents  \n- Resourced and managed $80k annual public affairs budget; ensured photo, video and strategic communications support for combatant commanders executing US military objectives on four continents \n- Conceived robust three-state base community outreach plan in support of controversial training proposal; engaged multi-state congressional delegates, ensured support of essential training mission from key stakeholders Director, Information Operations ISAF June 2010  –  July 2011  (1 year 2 months) Afghanistan (Provincial Reconstruction Team - Zabul) - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level – US Ambassador Eikenberry delivered results in US-AFG policy review \n- Oversaw development of provincial radio expansion in Zabul, leveraged radio as the primary means of government to citizen communication -- increased radio reach by 33%, employed 20 local nationals, grew grassroots radio human capacity 500% -- resulted in construction of first provincial media center \n- Established regional command model for religious engagement operations -- united Islamic scholars and provincial officials to formally address religious outreach across the province; advised founding of Zabul Public Outreach Committee, which facilitated government execution of 300 mosque rehab projects and delivered religious items to 4,000 Zabulis during Islamic holy days \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government \n- Planned and executed 7 media embeds – New York Times/Weekly Standard/Daily Beast global coverage amplified ISAF and Afghan government progress in militarily and politically strategic terrain St. Louis Branch Executive Board Member/President The Linus Foundation September 2006  –  May 2008  (1 year 9 months) - Led executive board of 10 students to execute 4 fundraising events--drew 2,000 attendees & raised/donated $23K to local area children’s charities  \n- Built branch recruiting plan/constitution--ensured that exiting board members would be replaced w/philanthropic & determined individuals--cemented Linus’ positive presence and reputation  \n- Coordinated w/ New York HQ to ensure continuity of messages and efficient delivery of event materials to Saint Louis philanthropic and business publications Chief Operating Officer MovingOffCampus.com December 2005  –  May 2008  (2 years 6 months) Customer Success Manager WalkMe™ March 2015  – Present (6 months) San Francisco Bay Area -Deep experience with the WalkMe platform and ability to guide others to build creative and compelling business cases for return on investment \n- History of managing Fortune 500 clients \n- Data driven decision making based on customer data. \n-Problem solver both in operations and analytics; able to structure a variety of client questions, work across organization to solve, and present useful recommendations that drive impact \n- Consistently reliable judgment; ability to drive impact and value  \n- Able to accurately assess challenging customer situations and to surface and manage needs Customer Success Manager WalkMe™ March 2015  – Present (6 months) San Francisco Bay Area -Deep experience with the WalkMe platform and ability to guide others to build creative and compelling business cases for return on investment \n- History of managing Fortune 500 clients \n- Data driven decision making based on customer data. \n-Problem solver both in operations and analytics; able to structure a variety of client questions, work across organization to solve, and present useful recommendations that drive impact \n- Consistently reliable judgment; ability to drive impact and value  \n- Able to accurately assess challenging customer situations and to surface and manage needs Manager, Global Communications & Public Affairs Google April 2014  –  October 2014  (7 months) Mountain View, CA Storytelling for Google[x]'s Project Wing and Google Fiber. Manager, Global Communications & Public Affairs Google April 2014  –  October 2014  (7 months) Mountain View, CA Storytelling for Google[x]'s Project Wing and Google Fiber. Deputy Director, Communications US Air Force Reserve May 2012  –  May 2014  (2 years 1 month) National Media Engagement -- 805 Third Ave, New York, NY - Plans media/civic engagements in NYC for the Secretary of the Air Force, Chief of Staff of the Air Force & key AF leaders; provides on-scene public affairs support \n- Advises/counsels senior AF leaders & experts on NYC's dynamic mass media environment; conducts media analysis \n- Developed guidance and provided counsel for high-profile executives appearing on Today Show, Good Morning America, Fox and MSNBC Morning Joe during Air Force Week N.Y. 2012; reached 133m people, $15m in ad value \n- Built first digital strategy for Air Force N.Y.; implementation resulted in 10x increase in Facebook reach, 15x increase in Twitter reach, 50x increase in Instagram reach; netted media engagements with the Office of the Mayor and NASDAQ  \n- Managed Air Force presence and media strategy for Air Force Week N.Y. 2013, reached 8m people at 1% the cost of Air Force Week 2012; established cost-effective model for units across the Air Force Deputy Director, Communications US Air Force Reserve May 2012  –  May 2014  (2 years 1 month) National Media Engagement -- 805 Third Ave, New York, NY - Plans media/civic engagements in NYC for the Secretary of the Air Force, Chief of Staff of the Air Force & key AF leaders; provides on-scene public affairs support \n- Advises/counsels senior AF leaders & experts on NYC's dynamic mass media environment; conducts media analysis \n- Developed guidance and provided counsel for high-profile executives appearing on Today Show, Good Morning America, Fox and MSNBC Morning Joe during Air Force Week N.Y. 2012; reached 133m people, $15m in ad value \n- Built first digital strategy for Air Force N.Y.; implementation resulted in 10x increase in Facebook reach, 15x increase in Twitter reach, 50x increase in Instagram reach; netted media engagements with the Office of the Mayor and NASDAQ  \n- Managed Air Force presence and media strategy for Air Force Week N.Y. 2013, reached 8m people at 1% the cost of Air Force Week 2012; established cost-effective model for units across the Air Force Co-Founder, Director of Communications Bonfyre App April 2012  –  December 2013  (1 year 9 months) -\tDeveloped brand voice; led messaging, product launch, internal, and external communication strategies; fostered relationships with Techcrunch, VentureBeat, PandoDaily, and Forbes; placements helped close $2m funding round \n-\tPlanned and managed company launch at DEMO 2012; including media lists prep, interview sourcing, execution, and logistics; exceeded coverage goals and only non-main stage demonstrator to be recognized as “Top 14” by Techcrunch  \n-\tLed content collaboration with product, engineering, business, and Fortune 500 clients (Anheuser-Busch, Amazon, Express Scripts) to highlight B2B wins; drove repeat purchase and helped scale revenue Co-Founder, Director of Communications Bonfyre App April 2012  –  December 2013  (1 year 9 months) -\tDeveloped brand voice; led messaging, product launch, internal, and external communication strategies; fostered relationships with Techcrunch, VentureBeat, PandoDaily, and Forbes; placements helped close $2m funding round \n-\tPlanned and managed company launch at DEMO 2012; including media lists prep, interview sourcing, execution, and logistics; exceeded coverage goals and only non-main stage demonstrator to be recognized as “Top 14” by Techcrunch  \n-\tLed content collaboration with product, engineering, business, and Fortune 500 clients (Anheuser-Busch, Amazon, Express Scripts) to highlight B2B wins; drove repeat purchase and helped scale revenue Deputy Director, Public Affairs United States Air Force May 2008  –  2012  (4 years) Cannon Air Force Base, N.M. - Managed 15 communication specialists supporting a combat-deployable special operations wing of 5,200 Airmen, 550 civilians, and their families  \n- Directed special operations crisis communication program, arranged 150+ interviews and news conferences for media outlets to include the Wall Street Journal, New York Times and Washington Post; zero information security incidents  \n- Resourced and managed $80k annual public affairs budget; ensured photo, video and strategic communications support for combatant commanders executing US military objectives on four continents \n- Conceived robust three-state base community outreach plan in support of controversial training proposal; engaged multi-state congressional delegates, ensured support of essential training mission from key stakeholders Deputy Director, Public Affairs United States Air Force May 2008  –  2012  (4 years) Cannon Air Force Base, N.M. - Managed 15 communication specialists supporting a combat-deployable special operations wing of 5,200 Airmen, 550 civilians, and their families  \n- Directed special operations crisis communication program, arranged 150+ interviews and news conferences for media outlets to include the Wall Street Journal, New York Times and Washington Post; zero information security incidents  \n- Resourced and managed $80k annual public affairs budget; ensured photo, video and strategic communications support for combatant commanders executing US military objectives on four continents \n- Conceived robust three-state base community outreach plan in support of controversial training proposal; engaged multi-state congressional delegates, ensured support of essential training mission from key stakeholders Director, Information Operations ISAF June 2010  –  July 2011  (1 year 2 months) Afghanistan (Provincial Reconstruction Team - Zabul) - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level – US Ambassador Eikenberry delivered results in US-AFG policy review \n- Oversaw development of provincial radio expansion in Zabul, leveraged radio as the primary means of government to citizen communication -- increased radio reach by 33%, employed 20 local nationals, grew grassroots radio human capacity 500% -- resulted in construction of first provincial media center \n- Established regional command model for religious engagement operations -- united Islamic scholars and provincial officials to formally address religious outreach across the province; advised founding of Zabul Public Outreach Committee, which facilitated government execution of 300 mosque rehab projects and delivered religious items to 4,000 Zabulis during Islamic holy days \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government \n- Planned and executed 7 media embeds – New York Times/Weekly Standard/Daily Beast global coverage amplified ISAF and Afghan government progress in militarily and politically strategic terrain Director, Information Operations ISAF June 2010  –  July 2011  (1 year 2 months) Afghanistan (Provincial Reconstruction Team - Zabul) - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level – US Ambassador Eikenberry delivered results in US-AFG policy review \n- Oversaw development of provincial radio expansion in Zabul, leveraged radio as the primary means of government to citizen communication -- increased radio reach by 33%, employed 20 local nationals, grew grassroots radio human capacity 500% -- resulted in construction of first provincial media center \n- Established regional command model for religious engagement operations -- united Islamic scholars and provincial officials to formally address religious outreach across the province; advised founding of Zabul Public Outreach Committee, which facilitated government execution of 300 mosque rehab projects and delivered religious items to 4,000 Zabulis during Islamic holy days \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government \n- Planned and executed 7 media embeds – New York Times/Weekly Standard/Daily Beast global coverage amplified ISAF and Afghan government progress in militarily and politically strategic terrain St. Louis Branch Executive Board Member/President The Linus Foundation September 2006  –  May 2008  (1 year 9 months) - Led executive board of 10 students to execute 4 fundraising events--drew 2,000 attendees & raised/donated $23K to local area children’s charities  \n- Built branch recruiting plan/constitution--ensured that exiting board members would be replaced w/philanthropic & determined individuals--cemented Linus’ positive presence and reputation  \n- Coordinated w/ New York HQ to ensure continuity of messages and efficient delivery of event materials to Saint Louis philanthropic and business publications St. Louis Branch Executive Board Member/President The Linus Foundation September 2006  –  May 2008  (1 year 9 months) - Led executive board of 10 students to execute 4 fundraising events--drew 2,000 attendees & raised/donated $23K to local area children’s charities  \n- Built branch recruiting plan/constitution--ensured that exiting board members would be replaced w/philanthropic & determined individuals--cemented Linus’ positive presence and reputation  \n- Coordinated w/ New York HQ to ensure continuity of messages and efficient delivery of event materials to Saint Louis philanthropic and business publications Chief Operating Officer MovingOffCampus.com December 2005  –  May 2008  (2 years 6 months) Chief Operating Officer MovingOffCampus.com December 2005  –  May 2008  (2 years 6 months) Languages   Skills Strategic Communications Social Media Media Relations Crisis Communications Entrepreneurship Integrated Marketing Marketing Communications Fundraising Public Relations Critical Thinking Start-ups Strategy Reputation Management Event Management Strategic Planning Marketing Strategy SEO Leadership Community Development Web Applications Mobile Design Mobile Applications Defense Policy Air Force Technical Writing Journalism Writing International Relations Community Relations Program Management Itineraries Operations Scrum Product Management Project Management Press Releases Facebook Internal Communications Government See 24+     See less Skills  Strategic Communications Social Media Media Relations Crisis Communications Entrepreneurship Integrated Marketing Marketing Communications Fundraising Public Relations Critical Thinking Start-ups Strategy Reputation Management Event Management Strategic Planning Marketing Strategy SEO Leadership Community Development Web Applications Mobile Design Mobile Applications Defense Policy Air Force Technical Writing Journalism Writing International Relations Community Relations Program Management Itineraries Operations Scrum Product Management Project Management Press Releases Facebook Internal Communications Government See 24+     See less Strategic Communications Social Media Media Relations Crisis Communications Entrepreneurship Integrated Marketing Marketing Communications Fundraising Public Relations Critical Thinking Start-ups Strategy Reputation Management Event Management Strategic Planning Marketing Strategy SEO Leadership Community Development Web Applications Mobile Design Mobile Applications Defense Policy Air Force Technical Writing Journalism Writing International Relations Community Relations Program Management Itineraries Operations Scrum Product Management Project Management Press Releases Facebook Internal Communications Government See 24+     See less Strategic Communications Social Media Media Relations Crisis Communications Entrepreneurship Integrated Marketing Marketing Communications Fundraising Public Relations Critical Thinking Start-ups Strategy Reputation Management Event Management Strategic Planning Marketing Strategy SEO Leadership Community Development Web Applications Mobile Design Mobile Applications Defense Policy Air Force Technical Writing Journalism Writing International Relations Community Relations Program Management Itineraries Operations Scrum Product Management Project Management Press Releases Facebook Internal Communications Government See 24+     See less Education Tradecraft Sales and Business Development 2014  – 2015 Tradecraft is a full time, in-person immersive training program for people who want to become either a ux designer, growth hacker or sales and business development professional. The program has been designed by industry leading experts to ensure that you graduate with both the depth and breadth of knowledge you’ll need to make meaningful contributions on your first day at a high-growth startup. Once you select your vertical focus you will work with a large group of world-class mentors and a small group of inspiring peers to learn new skills while doing real work for real companies. Washington University in St. Louis BA,  Political Science 2004  – 2008 Activities and Societies:  Sigma Alpha Mu ,  Lock and Chain Honorary ,  United States Air Force ROTC ,  The Linus Foundation The George Washington University MPS,  Public Relations 2011  – 2014 Tradecraft Sales and Business Development 2014  – 2015 Tradecraft is a full time, in-person immersive training program for people who want to become either a ux designer, growth hacker or sales and business development professional. The program has been designed by industry leading experts to ensure that you graduate with both the depth and breadth of knowledge you’ll need to make meaningful contributions on your first day at a high-growth startup. Once you select your vertical focus you will work with a large group of world-class mentors and a small group of inspiring peers to learn new skills while doing real work for real companies. Tradecraft Sales and Business Development 2014  – 2015 Tradecraft is a full time, in-person immersive training program for people who want to become either a ux designer, growth hacker or sales and business development professional. The program has been designed by industry leading experts to ensure that you graduate with both the depth and breadth of knowledge you’ll need to make meaningful contributions on your first day at a high-growth startup. Once you select your vertical focus you will work with a large group of world-class mentors and a small group of inspiring peers to learn new skills while doing real work for real companies. Tradecraft Sales and Business Development 2014  – 2015 Tradecraft is a full time, in-person immersive training program for people who want to become either a ux designer, growth hacker or sales and business development professional. The program has been designed by industry leading experts to ensure that you graduate with both the depth and breadth of knowledge you’ll need to make meaningful contributions on your first day at a high-growth startup. Once you select your vertical focus you will work with a large group of world-class mentors and a small group of inspiring peers to learn new skills while doing real work for real companies. Washington University in St. Louis BA,  Political Science 2004  – 2008 Activities and Societies:  Sigma Alpha Mu ,  Lock and Chain Honorary ,  United States Air Force ROTC ,  The Linus Foundation Washington University in St. Louis BA,  Political Science 2004  – 2008 Activities and Societies:  Sigma Alpha Mu ,  Lock and Chain Honorary ,  United States Air Force ROTC ,  The Linus Foundation Washington University in St. Louis BA,  Political Science 2004  – 2008 Activities and Societies:  Sigma Alpha Mu ,  Lock and Chain Honorary ,  United States Air Force ROTC ,  The Linus Foundation The George Washington University MPS,  Public Relations 2011  – 2014 The George Washington University MPS,  Public Relations 2011  – 2014 The George Washington University MPS,  Public Relations 2011  – 2014 Honors & Awards Bronze Star Medal United States June 2011 - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level. \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government 30 Under 30 (St Louis) St. Louis Business Journal July 2013 The 30 Under 30 awards recognizes the future business leaders of the St Louis community. \n \nhttp://www.bizjournals.com/stlouis/blog/2013/07/30-under-30-ray-gobberg-of-bonfyre.html Bronze Star Medal United States June 2011 - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level. \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government Bronze Star Medal United States June 2011 - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level. \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government Bronze Star Medal United States June 2011 - Led 125 ground combat missions and mentored/trained provincial-level government officials to execute strategic communications programs, connecting the government with key influencers at the provincial, district, village level. \n- Facilitated more than $1.2mil in funding of 12 strategic initiatives in areas of governance, communication capacity, and reintegration, which created leadership positions for Afghans in radio, newspaper and government 30 Under 30 (St Louis) St. Louis Business Journal July 2013 The 30 Under 30 awards recognizes the future business leaders of the St Louis community. \n \nhttp://www.bizjournals.com/stlouis/blog/2013/07/30-under-30-ray-gobberg-of-bonfyre.html 30 Under 30 (St Louis) St. Louis Business Journal July 2013 The 30 Under 30 awards recognizes the future business leaders of the St Louis community. \n \nhttp://www.bizjournals.com/stlouis/blog/2013/07/30-under-30-ray-gobberg-of-bonfyre.html 30 Under 30 (St Louis) St. Louis Business Journal July 2013 The 30 Under 30 awards recognizes the future business leaders of the St Louis community. \n \nhttp://www.bizjournals.com/stlouis/blog/2013/07/30-under-30-ray-gobberg-of-bonfyre.html "]}