{"position": "Google Applications Strategist", "company": "Google", "profiles": ["Summary Thoughtful and solution-focused marketing professional with an agency background in strategic media planning and buying. Demonstrated history of developing, selling and implementing print, digital and cross-platform programs to B2C and B2B marketers. Dedicated business partner focused on building strong client and agency relationships by delivering value through education and innovative sales solutions. Excellent communicator with industry expertise in CPG, Healthcare and Retail. \n \nSpecialties: Advertising Sales, Digital Media, Traditional Media, Cross Platform Sales, Media Planning and Buying, Event Sponsorships, Social Media Summary Thoughtful and solution-focused marketing professional with an agency background in strategic media planning and buying. Demonstrated history of developing, selling and implementing print, digital and cross-platform programs to B2C and B2B marketers. Dedicated business partner focused on building strong client and agency relationships by delivering value through education and innovative sales solutions. Excellent communicator with industry expertise in CPG, Healthcare and Retail. \n \nSpecialties: Advertising Sales, Digital Media, Traditional Media, Cross Platform Sales, Media Planning and Buying, Event Sponsorships, Social Media Thoughtful and solution-focused marketing professional with an agency background in strategic media planning and buying. Demonstrated history of developing, selling and implementing print, digital and cross-platform programs to B2C and B2B marketers. Dedicated business partner focused on building strong client and agency relationships by delivering value through education and innovative sales solutions. Excellent communicator with industry expertise in CPG, Healthcare and Retail. \n \nSpecialties: Advertising Sales, Digital Media, Traditional Media, Cross Platform Sales, Media Planning and Buying, Event Sponsorships, Social Media Thoughtful and solution-focused marketing professional with an agency background in strategic media planning and buying. Demonstrated history of developing, selling and implementing print, digital and cross-platform programs to B2C and B2B marketers. Dedicated business partner focused on building strong client and agency relationships by delivering value through education and innovative sales solutions. Excellent communicator with industry expertise in CPG, Healthcare and Retail. \n \nSpecialties: Advertising Sales, Digital Media, Traditional Media, Cross Platform Sales, Media Planning and Buying, Event Sponsorships, Social Media Experience Brand Product Strategist, BrandLab Google October 2014  – Present (11 months) San Francisco Bay Area BrandLab is a custom workshop experience designed to help brands grow their brand-building capabilities. We partner with brands to advance their digital strategies by exploring how to connect with consumers across a diverse series of segments and maximize Google’s tools and technologies to bring their stories to life online. \n \n Account Executive Google July 2011  –  September 2014  (3 years 3 months) san francisco bay area Health Services industry with a focus on Dental, Nutrition and Fitness Midwest Sales Manager- Men's Health and Women's Health Rodale August 2010  –  July 2011  (1 year) Men's Health & Women's Health \nwww.menshealth.com \nwww.womenshealthmag.com Midwest Sales Manager- Prevention Rodale September 2008  –  August 2010  (2 years) Prevention Magazine & Prevention.com Contact Activation Supervisor Starcom August 2007  –  August 2008  (1 year 1 month) P&G Print AOR- Full Portfolio Client Activation Associate Starcom November 2006  –  August 2007  (10 months) P&G Print AOR- APDO/PCC, Fem Care, Snack/Beverage Communications Strategy Associate Starcom Mediavest Group July 2005  –  November 2006  (1 year 5 months) SMG United- P&G/Tampax Brand Product Strategist, BrandLab Google October 2014  – Present (11 months) San Francisco Bay Area BrandLab is a custom workshop experience designed to help brands grow their brand-building capabilities. We partner with brands to advance their digital strategies by exploring how to connect with consumers across a diverse series of segments and maximize Google’s tools and technologies to bring their stories to life online. \n \n Brand Product Strategist, BrandLab Google October 2014  – Present (11 months) San Francisco Bay Area BrandLab is a custom workshop experience designed to help brands grow their brand-building capabilities. We partner with brands to advance their digital strategies by exploring how to connect with consumers across a diverse series of segments and maximize Google’s tools and technologies to bring their stories to life online. \n \n Account Executive Google July 2011  –  September 2014  (3 years 3 months) san francisco bay area Health Services industry with a focus on Dental, Nutrition and Fitness Account Executive Google July 2011  –  September 2014  (3 years 3 months) san francisco bay area Health Services industry with a focus on Dental, Nutrition and Fitness Midwest Sales Manager- Men's Health and Women's Health Rodale August 2010  –  July 2011  (1 year) Men's Health & Women's Health \nwww.menshealth.com \nwww.womenshealthmag.com Midwest Sales Manager- Men's Health and Women's Health Rodale August 2010  –  July 2011  (1 year) Men's Health & Women's Health \nwww.menshealth.com \nwww.womenshealthmag.com Midwest Sales Manager- Prevention Rodale September 2008  –  August 2010  (2 years) Prevention Magazine & Prevention.com Midwest Sales Manager- Prevention Rodale September 2008  –  August 2010  (2 years) Prevention Magazine & Prevention.com Contact Activation Supervisor Starcom August 2007  –  August 2008  (1 year 1 month) P&G Print AOR- Full Portfolio Contact Activation Supervisor Starcom August 2007  –  August 2008  (1 year 1 month) P&G Print AOR- Full Portfolio Client Activation Associate Starcom November 2006  –  August 2007  (10 months) P&G Print AOR- APDO/PCC, Fem Care, Snack/Beverage Client Activation Associate Starcom November 2006  –  August 2007  (10 months) P&G Print AOR- APDO/PCC, Fem Care, Snack/Beverage Communications Strategy Associate Starcom Mediavest Group July 2005  –  November 2006  (1 year 5 months) SMG United- P&G/Tampax Communications Strategy Associate Starcom Mediavest Group July 2005  –  November 2006  (1 year 5 months) SMG United- P&G/Tampax Skills Skills     ", "Summary *Practiced IT professional with true enterprise experience (i.e. administrator of mainframe, server, and desktop systems) \n \n*Proficient technical author (e.g. proposal development, white papers, customized training curriculum, process documentation) \n \n*Seasoned customer interface (e.g. task order performance, briefings, marketing calls, technical demonstrations) \n \n*More than just a “techie” – can identify a customer need, design a creative solution to meet complex requirements, author a winning proposal, plan and perform hands-on implementation, and prepare the new environment for continuous improvement. \n \nI help customers maximize the usefulness of their computing environments to drive business success. Specialties:Evolving legacy computing environments into modern, cost-effective technology platforms and architectures. Summary *Practiced IT professional with true enterprise experience (i.e. administrator of mainframe, server, and desktop systems) \n \n*Proficient technical author (e.g. proposal development, white papers, customized training curriculum, process documentation) \n \n*Seasoned customer interface (e.g. task order performance, briefings, marketing calls, technical demonstrations) \n \n*More than just a “techie” – can identify a customer need, design a creative solution to meet complex requirements, author a winning proposal, plan and perform hands-on implementation, and prepare the new environment for continuous improvement. \n \nI help customers maximize the usefulness of their computing environments to drive business success. Specialties:Evolving legacy computing environments into modern, cost-effective technology platforms and architectures. *Practiced IT professional with true enterprise experience (i.e. administrator of mainframe, server, and desktop systems) \n \n*Proficient technical author (e.g. proposal development, white papers, customized training curriculum, process documentation) \n \n*Seasoned customer interface (e.g. task order performance, briefings, marketing calls, technical demonstrations) \n \n*More than just a “techie” – can identify a customer need, design a creative solution to meet complex requirements, author a winning proposal, plan and perform hands-on implementation, and prepare the new environment for continuous improvement. \n \nI help customers maximize the usefulness of their computing environments to drive business success. Specialties:Evolving legacy computing environments into modern, cost-effective technology platforms and architectures. *Practiced IT professional with true enterprise experience (i.e. administrator of mainframe, server, and desktop systems) \n \n*Proficient technical author (e.g. proposal development, white papers, customized training curriculum, process documentation) \n \n*Seasoned customer interface (e.g. task order performance, briefings, marketing calls, technical demonstrations) \n \n*More than just a “techie” – can identify a customer need, design a creative solution to meet complex requirements, author a winning proposal, plan and perform hands-on implementation, and prepare the new environment for continuous improvement. \n \nI help customers maximize the usefulness of their computing environments to drive business success. Specialties:Evolving legacy computing environments into modern, cost-effective technology platforms and architectures. Experience Product Strategist and Sales Engineer, Google Apps Google June 2010  – Present (5 years 3 months) Senior Enterprise Systems Engineer SAIC July 1994  –  June 2010  (16 years) Senior Systems Programmer LexisNexis May 1990  –  July 1994  (4 years 3 months) Systems & Applications Programmer/Analyst Johns Hopkins University Applied Physics Laboratory June 1983  –  May 1990  (7 years) Product Strategist and Sales Engineer, Google Apps Google June 2010  – Present (5 years 3 months) Product Strategist and Sales Engineer, Google Apps Google June 2010  – Present (5 years 3 months) Senior Enterprise Systems Engineer SAIC July 1994  –  June 2010  (16 years) Senior Enterprise Systems Engineer SAIC July 1994  –  June 2010  (16 years) Senior Systems Programmer LexisNexis May 1990  –  July 1994  (4 years 3 months) Senior Systems Programmer LexisNexis May 1990  –  July 1994  (4 years 3 months) Systems & Applications Programmer/Analyst Johns Hopkins University Applied Physics Laboratory June 1983  –  May 1990  (7 years) Systems & Applications Programmer/Analyst Johns Hopkins University Applied Physics Laboratory June 1983  –  May 1990  (7 years) Skills Cloud Computing SaaS Enterprise Architecture Enterprise Software Virtualization CRM Strategy Integration Data Center Security Program Management Requirements Analysis Professional Services Strategic Partnerships Product Management Skills  Cloud Computing SaaS Enterprise Architecture Enterprise Software Virtualization CRM Strategy Integration Data Center Security Program Management Requirements Analysis Professional Services Strategic Partnerships Product Management Cloud Computing SaaS Enterprise Architecture Enterprise Software Virtualization CRM Strategy Integration Data Center Security Program Management Requirements Analysis Professional Services Strategic Partnerships Product Management Cloud Computing SaaS Enterprise Architecture Enterprise Software Virtualization CRM Strategy Integration Data Center Security Program Management Requirements Analysis Professional Services Strategic Partnerships Product Management Education The Johns Hopkins University M.S. 1985  – 1987 Indiana University—Purdue University Fort Wayne B.S. 1979  – 1983 The Johns Hopkins University M.S. 1985  – 1987 The Johns Hopkins University M.S. 1985  – 1987 The Johns Hopkins University M.S. 1985  – 1987 Indiana University—Purdue University Fort Wayne B.S. 1979  – 1983 Indiana University—Purdue University Fort Wayne B.S. 1979  – 1983 Indiana University—Purdue University Fort Wayne B.S. 1979  – 1983 ", "Summary Digital product and brand marketing leader with experience at techology start-ups (digital media and biotech) and Google.  \n \nEndlessly curious, perpetually learning journalist, writer and leader of lean teams. A passion for: \n \nBranding and content-driven storytelling...digital and social audience engagement...go-to-market strategy...technology- and data-driven marketing mix management...start-ups...education technology...sports marketing...B2B and partnership marketing...small business \n \nAlways interested in reconnecting with Weatherhead, Graziadio and AW students and alumni, Google and EBSI colleagues, entrepreneurs and others with common interests in marketing, media and communications, soccer, and social entrepreneurship. \n \nAn optimist. Summary Digital product and brand marketing leader with experience at techology start-ups (digital media and biotech) and Google.  \n \nEndlessly curious, perpetually learning journalist, writer and leader of lean teams. A passion for: \n \nBranding and content-driven storytelling...digital and social audience engagement...go-to-market strategy...technology- and data-driven marketing mix management...start-ups...education technology...sports marketing...B2B and partnership marketing...small business \n \nAlways interested in reconnecting with Weatherhead, Graziadio and AW students and alumni, Google and EBSI colleagues, entrepreneurs and others with common interests in marketing, media and communications, soccer, and social entrepreneurship. \n \nAn optimist. Digital product and brand marketing leader with experience at techology start-ups (digital media and biotech) and Google.  \n \nEndlessly curious, perpetually learning journalist, writer and leader of lean teams. A passion for: \n \nBranding and content-driven storytelling...digital and social audience engagement...go-to-market strategy...technology- and data-driven marketing mix management...start-ups...education technology...sports marketing...B2B and partnership marketing...small business \n \nAlways interested in reconnecting with Weatherhead, Graziadio and AW students and alumni, Google and EBSI colleagues, entrepreneurs and others with common interests in marketing, media and communications, soccer, and social entrepreneurship. \n \nAn optimist. Digital product and brand marketing leader with experience at techology start-ups (digital media and biotech) and Google.  \n \nEndlessly curious, perpetually learning journalist, writer and leader of lean teams. A passion for: \n \nBranding and content-driven storytelling...digital and social audience engagement...go-to-market strategy...technology- and data-driven marketing mix management...start-ups...education technology...sports marketing...B2B and partnership marketing...small business \n \nAlways interested in reconnecting with Weatherhead, Graziadio and AW students and alumni, Google and EBSI colleagues, entrepreneurs and others with common interests in marketing, media and communications, soccer, and social entrepreneurship. \n \nAn optimist. Experience Brand Product Strategist, BrandLab Google May 2013  – Present (2 years 4 months) San Bruno, CA Working with Google's largest advertising customers and emerging brands on digital content strategy, mobile advertising and measurement, and technology-driven brand storytelling across YouTube, mobile and social channels. Founder FCearth September 2008  – Present (7 years) Incubating a brand of eco-friendly, culturally informative soccer gear and apparel with a mission: Play Soccer. Change the World. Start-up Marketing Advisor The Optimist Company January 2006  – Present (9 years 8 months) Boulder, CO Hands-on marketing advisor focused on customer acquisition, go-to-market strategy, communications, social & community engagement, and marketing campaign strategy (traditional and digital). Projects include Use My Benefits, Wellhire, Streamweaver, Boingo Wireless, OleOle, PrimaHealth Credit, Streamweaver, Soundwall, IndispensablePeople, marketRFP and more. Director of Marketing Votigo, Inc. April 2011  –  February 2013  (1 year 11 months) Boulder, CO Full stack marketing (demand generation, CRM, Customer Success, Partner Activation, & Industry Repositioning) for leading SaaS provider of social marketing software. Chairman Graziadio Alumni Network, Orange County January 2007  –  July 2011  (4 years 7 months) Director of Partner Services Brand Affinity Technologies September 2009  –  March 2011  (1 year 7 months) Cultivating partnerships and serving channel resellers for BAT's digital, traditional and social media endorsement service and other platform technologies. Marketing Manager- Google Audio Google September 2006  –  May 2009  (2 years 9 months) -Planned and executed strategic marketing initiatives (from blogs and case studies to events and client-direct communications) for emerging media platform within Google's advertising ecosystem \n-Managed sales operations and helped build Account Services team \n-Delivered a range of metrics (from revenue reporting to product performance) to internal audiences \n-Worked with key clients and partners on strategic projects \n-Worked with Product & Engineering teams to study platform effectiveness MBA Student Pepperdine University August 2005  –  August 2006  (1 year 1 month) MBA student with entrepreneurial marketing focus \nMemberships: M (Marketing Society), Net Impact, Entrepreneurship Club \nCo-Founder, The Values-Centered Leadership Lab (The Lab), a student-driven organization focused on developing ethical and socially responsibility leadership Business/Marketing Analyst Emergent BioSolutions November 2002  –  July 2005  (2 years 9 months) Diverse role including market and competitive research on products, disease targets and competitors; co-author and edit strategic plan; develop relationships with potential partners; write various internal and external communications; & project management for two product development programs. IPO research helped in preparation for EBS' successful 2006 NYSE offering. Business Analyst BioPort Corporation November 2002  –  January 2004  (1 year 3 months) Legal Dept / Still Photography Assistant Fox April 2002  –  July 2002  (4 months) Right after graduating, I toured through various short-term assignments on the Fox lot. What an experience! Editorial Assistant Inside Business magazine January 2000  –  February 2002  (2 years 2 months) Interviewing, editing, researching, and writing articles about leading business trends, companies and personalities in Ohio for IB and its sister publication, Ohio Business. Contributed free-lance articles until Dec. 2003. An unbelievably valuable experience that took me from unpaid intern to published writer and more importantly helped me grow comfortable talking to anyone in any setting, and then telling a story about it. Brand Product Strategist, BrandLab Google May 2013  – Present (2 years 4 months) San Bruno, CA Working with Google's largest advertising customers and emerging brands on digital content strategy, mobile advertising and measurement, and technology-driven brand storytelling across YouTube, mobile and social channels. Brand Product Strategist, BrandLab Google May 2013  – Present (2 years 4 months) San Bruno, CA Working with Google's largest advertising customers and emerging brands on digital content strategy, mobile advertising and measurement, and technology-driven brand storytelling across YouTube, mobile and social channels. Founder FCearth September 2008  – Present (7 years) Incubating a brand of eco-friendly, culturally informative soccer gear and apparel with a mission: Play Soccer. Change the World. Founder FCearth September 2008  – Present (7 years) Incubating a brand of eco-friendly, culturally informative soccer gear and apparel with a mission: Play Soccer. Change the World. Start-up Marketing Advisor The Optimist Company January 2006  – Present (9 years 8 months) Boulder, CO Hands-on marketing advisor focused on customer acquisition, go-to-market strategy, communications, social & community engagement, and marketing campaign strategy (traditional and digital). Projects include Use My Benefits, Wellhire, Streamweaver, Boingo Wireless, OleOle, PrimaHealth Credit, Streamweaver, Soundwall, IndispensablePeople, marketRFP and more. Start-up Marketing Advisor The Optimist Company January 2006  – Present (9 years 8 months) Boulder, CO Hands-on marketing advisor focused on customer acquisition, go-to-market strategy, communications, social & community engagement, and marketing campaign strategy (traditional and digital). Projects include Use My Benefits, Wellhire, Streamweaver, Boingo Wireless, OleOle, PrimaHealth Credit, Streamweaver, Soundwall, IndispensablePeople, marketRFP and more. Director of Marketing Votigo, Inc. April 2011  –  February 2013  (1 year 11 months) Boulder, CO Full stack marketing (demand generation, CRM, Customer Success, Partner Activation, & Industry Repositioning) for leading SaaS provider of social marketing software. Director of Marketing Votigo, Inc. April 2011  –  February 2013  (1 year 11 months) Boulder, CO Full stack marketing (demand generation, CRM, Customer Success, Partner Activation, & Industry Repositioning) for leading SaaS provider of social marketing software. Chairman Graziadio Alumni Network, Orange County January 2007  –  July 2011  (4 years 7 months) Chairman Graziadio Alumni Network, Orange County January 2007  –  July 2011  (4 years 7 months) Director of Partner Services Brand Affinity Technologies September 2009  –  March 2011  (1 year 7 months) Cultivating partnerships and serving channel resellers for BAT's digital, traditional and social media endorsement service and other platform technologies. Director of Partner Services Brand Affinity Technologies September 2009  –  March 2011  (1 year 7 months) Cultivating partnerships and serving channel resellers for BAT's digital, traditional and social media endorsement service and other platform technologies. Marketing Manager- Google Audio Google September 2006  –  May 2009  (2 years 9 months) -Planned and executed strategic marketing initiatives (from blogs and case studies to events and client-direct communications) for emerging media platform within Google's advertising ecosystem \n-Managed sales operations and helped build Account Services team \n-Delivered a range of metrics (from revenue reporting to product performance) to internal audiences \n-Worked with key clients and partners on strategic projects \n-Worked with Product & Engineering teams to study platform effectiveness Marketing Manager- Google Audio Google September 2006  –  May 2009  (2 years 9 months) -Planned and executed strategic marketing initiatives (from blogs and case studies to events and client-direct communications) for emerging media platform within Google's advertising ecosystem \n-Managed sales operations and helped build Account Services team \n-Delivered a range of metrics (from revenue reporting to product performance) to internal audiences \n-Worked with key clients and partners on strategic projects \n-Worked with Product & Engineering teams to study platform effectiveness MBA Student Pepperdine University August 2005  –  August 2006  (1 year 1 month) MBA student with entrepreneurial marketing focus \nMemberships: M (Marketing Society), Net Impact, Entrepreneurship Club \nCo-Founder, The Values-Centered Leadership Lab (The Lab), a student-driven organization focused on developing ethical and socially responsibility leadership MBA Student Pepperdine University August 2005  –  August 2006  (1 year 1 month) MBA student with entrepreneurial marketing focus \nMemberships: M (Marketing Society), Net Impact, Entrepreneurship Club \nCo-Founder, The Values-Centered Leadership Lab (The Lab), a student-driven organization focused on developing ethical and socially responsibility leadership Business/Marketing Analyst Emergent BioSolutions November 2002  –  July 2005  (2 years 9 months) Diverse role including market and competitive research on products, disease targets and competitors; co-author and edit strategic plan; develop relationships with potential partners; write various internal and external communications; & project management for two product development programs. IPO research helped in preparation for EBS' successful 2006 NYSE offering. Business/Marketing Analyst Emergent BioSolutions November 2002  –  July 2005  (2 years 9 months) Diverse role including market and competitive research on products, disease targets and competitors; co-author and edit strategic plan; develop relationships with potential partners; write various internal and external communications; & project management for two product development programs. IPO research helped in preparation for EBS' successful 2006 NYSE offering. Business Analyst BioPort Corporation November 2002  –  January 2004  (1 year 3 months) Business Analyst BioPort Corporation November 2002  –  January 2004  (1 year 3 months) Legal Dept / Still Photography Assistant Fox April 2002  –  July 2002  (4 months) Right after graduating, I toured through various short-term assignments on the Fox lot. What an experience! Legal Dept / Still Photography Assistant Fox April 2002  –  July 2002  (4 months) Right after graduating, I toured through various short-term assignments on the Fox lot. What an experience! Editorial Assistant Inside Business magazine January 2000  –  February 2002  (2 years 2 months) Interviewing, editing, researching, and writing articles about leading business trends, companies and personalities in Ohio for IB and its sister publication, Ohio Business. Contributed free-lance articles until Dec. 2003. An unbelievably valuable experience that took me from unpaid intern to published writer and more importantly helped me grow comfortable talking to anyone in any setting, and then telling a story about it. Editorial Assistant Inside Business magazine January 2000  –  February 2002  (2 years 2 months) Interviewing, editing, researching, and writing articles about leading business trends, companies and personalities in Ohio for IB and its sister publication, Ohio Business. Contributed free-lance articles until Dec. 2003. An unbelievably valuable experience that took me from unpaid intern to published writer and more importantly helped me grow comfortable talking to anyone in any setting, and then telling a story about it. Skills Strategic Partnerships Strategy Integrated Marketing CRM Entrepreneurship Product Management Marketing Business Development Leadership SaaS Advertising Management Social Media Blogging Strategic Planning Skills  Strategic Partnerships Strategy Integrated Marketing CRM Entrepreneurship Product Management Marketing Business Development Leadership SaaS Advertising Management Social Media Blogging Strategic Planning Strategic Partnerships Strategy Integrated Marketing CRM Entrepreneurship Product Management Marketing Business Development Leadership SaaS Advertising Management Social Media Blogging Strategic Planning Strategic Partnerships Strategy Integrated Marketing CRM Entrepreneurship Product Management Marketing Business Development Leadership SaaS Advertising Management Social Media Blogging Strategic Planning Education Pepperdine University MBA,  Business Management , Marketing August 2005  – August 2006 Activities and Societies:  Graziadio Student Marketing Associates\nMarketing ,  Entrepreneurship Professional Groups Case Western Reserve University BS,  Management , Entrepreneurship,  English August 1998  – December 2001 My experience at CWRU was a fascinating one. Ask me about it sometime- the school, and my time there. Activities and Societies:  Presidential Scholar\nDean's List\nCWRU Observer (Newspaper)\nBusiness Plan\nCum Laude Anthony Wayne HS 1994  – 1998 Pepperdine University MBA,  Business Management , Marketing August 2005  – August 2006 Activities and Societies:  Graziadio Student Marketing Associates\nMarketing ,  Entrepreneurship Professional Groups Pepperdine University MBA,  Business Management , Marketing August 2005  – August 2006 Activities and Societies:  Graziadio Student Marketing Associates\nMarketing ,  Entrepreneurship Professional Groups Pepperdine University MBA,  Business Management , Marketing August 2005  – August 2006 Activities and Societies:  Graziadio Student Marketing Associates\nMarketing ,  Entrepreneurship Professional Groups Case Western Reserve University BS,  Management , Entrepreneurship,  English August 1998  – December 2001 My experience at CWRU was a fascinating one. Ask me about it sometime- the school, and my time there. Activities and Societies:  Presidential Scholar\nDean's List\nCWRU Observer (Newspaper)\nBusiness Plan\nCum Laude Case Western Reserve University BS,  Management , Entrepreneurship,  English August 1998  – December 2001 My experience at CWRU was a fascinating one. Ask me about it sometime- the school, and my time there. Activities and Societies:  Presidential Scholar\nDean's List\nCWRU Observer (Newspaper)\nBusiness Plan\nCum Laude Case Western Reserve University BS,  Management , Entrepreneurship,  English August 1998  – December 2001 My experience at CWRU was a fascinating one. Ask me about it sometime- the school, and my time there. Activities and Societies:  Presidential Scholar\nDean's List\nCWRU Observer (Newspaper)\nBusiness Plan\nCum Laude Anthony Wayne HS 1994  – 1998 Anthony Wayne HS 1994  – 1998 Anthony Wayne HS 1994  – 1998 ", "Skills Strategy Analytics Competitive Analysis User Research User Experience Leadership Management Consulting User Interface Design Leadership Development Organizational... Strategic Enterprise... Product Management Organizational... Cross-functional Team... Market Research Business Strategy See 1+     See less Skills  Strategy Analytics Competitive Analysis User Research User Experience Leadership Management Consulting User Interface Design Leadership Development Organizational... Strategic Enterprise... Product Management Organizational... Cross-functional Team... Market Research Business Strategy See 1+     See less Strategy Analytics Competitive Analysis User Research User Experience Leadership Management Consulting User Interface Design Leadership Development Organizational... Strategic Enterprise... Product Management Organizational... Cross-functional Team... Market Research Business Strategy See 1+     See less Strategy Analytics Competitive Analysis User Research User Experience Leadership Management Consulting User Interface Design Leadership Development Organizational... Strategic Enterprise... Product Management Organizational... Cross-functional Team... Market Research Business Strategy See 1+     See less ", "Summary I am a Product Strategist for Google Apps for Work & Education focusing on Security, Privacy, and Legal Compliance. In this role I work with the greater Security and Compliance Teams at Google, I have authored platform white papers, and present at international industry conferences.  \n \nPreviously, I was an Amsterdam based Sales Engineering Manager for Google Enterprise specializing in Google Apps for Enterprise, Google Message Security, and Chrome OS, in addition to serving as Security and Compliance Lead for EMEA.  \n \nI have extensive experience as a Program Manager / Integration Project Manager -- with twelve years of experience in supporting product development, designing and implementing integration solutions on national and international engagements. As a Program Manager at Microsoft, I have worked directly with Customers to validate product features and requirements and successfully related these findings to software development teams. As an Integration Project Manager at Accenture, I have played several instrumental roles including Account Management, Business Analyst (Business Process Definition, Functional Requirements Gathering), Solution Architect, Solution Engineer and Team Lead for cross-platform business integration solutions. I have led integration teams across multiple geographies with a strong track record of delivering solutions on time and on budget. \nI am a well rounded technologist with a focus on middleware technologies (BizTalk, webMethods, and Vitria) with implementation experience spanning all phases of the software development lifecycle. I have deep industry experience in cellular telecommunications, pharmaceutical, and the financial services industries. I possess strong analytical skills, am detail oriented, and quickly learn new technologies. \n \nSpecialties: EAI, SOA, Integration, webMethods, BizTalk, Java, .NET, Google Search Appliance, Google Apps for Enterprise, ChromeOS, and Google Message Security (Postini) Summary I am a Product Strategist for Google Apps for Work & Education focusing on Security, Privacy, and Legal Compliance. In this role I work with the greater Security and Compliance Teams at Google, I have authored platform white papers, and present at international industry conferences.  \n \nPreviously, I was an Amsterdam based Sales Engineering Manager for Google Enterprise specializing in Google Apps for Enterprise, Google Message Security, and Chrome OS, in addition to serving as Security and Compliance Lead for EMEA.  \n \nI have extensive experience as a Program Manager / Integration Project Manager -- with twelve years of experience in supporting product development, designing and implementing integration solutions on national and international engagements. As a Program Manager at Microsoft, I have worked directly with Customers to validate product features and requirements and successfully related these findings to software development teams. As an Integration Project Manager at Accenture, I have played several instrumental roles including Account Management, Business Analyst (Business Process Definition, Functional Requirements Gathering), Solution Architect, Solution Engineer and Team Lead for cross-platform business integration solutions. I have led integration teams across multiple geographies with a strong track record of delivering solutions on time and on budget. \nI am a well rounded technologist with a focus on middleware technologies (BizTalk, webMethods, and Vitria) with implementation experience spanning all phases of the software development lifecycle. I have deep industry experience in cellular telecommunications, pharmaceutical, and the financial services industries. I possess strong analytical skills, am detail oriented, and quickly learn new technologies. \n \nSpecialties: EAI, SOA, Integration, webMethods, BizTalk, Java, .NET, Google Search Appliance, Google Apps for Enterprise, ChromeOS, and Google Message Security (Postini) I am a Product Strategist for Google Apps for Work & Education focusing on Security, Privacy, and Legal Compliance. In this role I work with the greater Security and Compliance Teams at Google, I have authored platform white papers, and present at international industry conferences.  \n \nPreviously, I was an Amsterdam based Sales Engineering Manager for Google Enterprise specializing in Google Apps for Enterprise, Google Message Security, and Chrome OS, in addition to serving as Security and Compliance Lead for EMEA.  \n \nI have extensive experience as a Program Manager / Integration Project Manager -- with twelve years of experience in supporting product development, designing and implementing integration solutions on national and international engagements. As a Program Manager at Microsoft, I have worked directly with Customers to validate product features and requirements and successfully related these findings to software development teams. As an Integration Project Manager at Accenture, I have played several instrumental roles including Account Management, Business Analyst (Business Process Definition, Functional Requirements Gathering), Solution Architect, Solution Engineer and Team Lead for cross-platform business integration solutions. I have led integration teams across multiple geographies with a strong track record of delivering solutions on time and on budget. \nI am a well rounded technologist with a focus on middleware technologies (BizTalk, webMethods, and Vitria) with implementation experience spanning all phases of the software development lifecycle. I have deep industry experience in cellular telecommunications, pharmaceutical, and the financial services industries. I possess strong analytical skills, am detail oriented, and quickly learn new technologies. \n \nSpecialties: EAI, SOA, Integration, webMethods, BizTalk, Java, .NET, Google Search Appliance, Google Apps for Enterprise, ChromeOS, and Google Message Security (Postini) I am a Product Strategist for Google Apps for Work & Education focusing on Security, Privacy, and Legal Compliance. In this role I work with the greater Security and Compliance Teams at Google, I have authored platform white papers, and present at international industry conferences.  \n \nPreviously, I was an Amsterdam based Sales Engineering Manager for Google Enterprise specializing in Google Apps for Enterprise, Google Message Security, and Chrome OS, in addition to serving as Security and Compliance Lead for EMEA.  \n \nI have extensive experience as a Program Manager / Integration Project Manager -- with twelve years of experience in supporting product development, designing and implementing integration solutions on national and international engagements. As a Program Manager at Microsoft, I have worked directly with Customers to validate product features and requirements and successfully related these findings to software development teams. As an Integration Project Manager at Accenture, I have played several instrumental roles including Account Management, Business Analyst (Business Process Definition, Functional Requirements Gathering), Solution Architect, Solution Engineer and Team Lead for cross-platform business integration solutions. I have led integration teams across multiple geographies with a strong track record of delivering solutions on time and on budget. \nI am a well rounded technologist with a focus on middleware technologies (BizTalk, webMethods, and Vitria) with implementation experience spanning all phases of the software development lifecycle. I have deep industry experience in cellular telecommunications, pharmaceutical, and the financial services industries. I possess strong analytical skills, am detail oriented, and quickly learn new technologies. \n \nSpecialties: EAI, SOA, Integration, webMethods, BizTalk, Java, .NET, Google Search Appliance, Google Apps for Enterprise, ChromeOS, and Google Message Security (Postini) Experience Google Apps Product Strategist Google December 2012  – Present (2 years 9 months) Mountain View California Focusing on Product Development, Improvement, Integration, and Compliance for Enterprise customers Enterprise Security and Compliance - EMEA Google January 2011  –  December 2012  (2 years) Amsterdam Area, Netherlands Sales Engineer and EMEA Security and Compliance for Google Enterprise specializing in Google Apps for Business, ChromeOS, and Google Platform Offerings. I am currently responsible supporting pre and post sales support for customers and partners in EMEA. Enterprise Sales Engineer Google September 2008  –  January 2011  (2 years 5 months) Amsterdam Area, Netherlands I specializing in Enterprise Search, Google Apps for Enterprise, Google Message Security, and Geospatial. I am currently responsible for pre and post technical sales support for customers and partners in the Netherlands, Belgium, and Luxembourg. \n \nJames Snow’s Specialties: \nGoogle Search Appliance, Google Apps for Enterprise, Google Postini for Enterprise EAI Solution Architect TMNS June 2007  –  September 2008  (1 year 4 months) The Hague Area, Netherlands Account Manager/Solution Architect, webMethods Integration Practice \n \nResponsible for Client Account Management including project sales. Primary Sales Contact – generation, acceptance, and delivery of 10 project contracts \n \nIntegration Architect / Project Manager responsible for all projects at client site leading a team of seven engineers. All projects delivered on schedule and on budget \n \nCompany career councilor responsible for support and career development of junior colleagues. Currently responsible for a team of four.  \n \nResponsible for translating business \nneeds to technical. Commercial insight, high level solutions knowledge and well developed communication skills. Expected \nto lead teams or manage small projects, perform QA and develop further sales opportunities. \n \nwebMethods \nBizTalk  \nVitria Program Manager Microsoft December 2005  –  June 2007  (1 year 7 months) Greater Seattle Area Program Manager, BizTalk Product Group \n•\tResponsible for Customer Early Adoption Programs for BizTalk Integration Solution as part of the software development process (managed 45 partners / customers) \n•\tKey feature areas included WS-* Web Service Compatibility (WCF), integration with Oracle Databases, SAP (BAPI, RFC, iDoc), Siebel, DB2, and MQ Series. \n•\tDevelopment and Presentation of Training material for new integration technologies Consultant Accenture January 2001  –  December 2005  (5 years) Greater Seattle Area Principal Integration Consultant \n•\tExperienced in all phases of the software development lifecycle \n•\tMember of elite Global Integration Group specializing in SOA \n•\tExtensive experience with Fortune 500 clients \n•\tDeep Order Management, Business Process Automation, and Enterprise Architecture experience \n•\tWell-rounded technologist with experience spanning EAI, architecture design, object-oriented design and development, data modeling, UI development, and XML-based technologies Google Apps Product Strategist Google December 2012  – Present (2 years 9 months) Mountain View California Focusing on Product Development, Improvement, Integration, and Compliance for Enterprise customers Google Apps Product Strategist Google December 2012  – Present (2 years 9 months) Mountain View California Focusing on Product Development, Improvement, Integration, and Compliance for Enterprise customers Enterprise Security and Compliance - EMEA Google January 2011  –  December 2012  (2 years) Amsterdam Area, Netherlands Sales Engineer and EMEA Security and Compliance for Google Enterprise specializing in Google Apps for Business, ChromeOS, and Google Platform Offerings. I am currently responsible supporting pre and post sales support for customers and partners in EMEA. Enterprise Security and Compliance - EMEA Google January 2011  –  December 2012  (2 years) Amsterdam Area, Netherlands Sales Engineer and EMEA Security and Compliance for Google Enterprise specializing in Google Apps for Business, ChromeOS, and Google Platform Offerings. I am currently responsible supporting pre and post sales support for customers and partners in EMEA. Enterprise Sales Engineer Google September 2008  –  January 2011  (2 years 5 months) Amsterdam Area, Netherlands I specializing in Enterprise Search, Google Apps for Enterprise, Google Message Security, and Geospatial. I am currently responsible for pre and post technical sales support for customers and partners in the Netherlands, Belgium, and Luxembourg. \n \nJames Snow’s Specialties: \nGoogle Search Appliance, Google Apps for Enterprise, Google Postini for Enterprise Enterprise Sales Engineer Google September 2008  –  January 2011  (2 years 5 months) Amsterdam Area, Netherlands I specializing in Enterprise Search, Google Apps for Enterprise, Google Message Security, and Geospatial. I am currently responsible for pre and post technical sales support for customers and partners in the Netherlands, Belgium, and Luxembourg. \n \nJames Snow’s Specialties: \nGoogle Search Appliance, Google Apps for Enterprise, Google Postini for Enterprise EAI Solution Architect TMNS June 2007  –  September 2008  (1 year 4 months) The Hague Area, Netherlands Account Manager/Solution Architect, webMethods Integration Practice \n \nResponsible for Client Account Management including project sales. Primary Sales Contact – generation, acceptance, and delivery of 10 project contracts \n \nIntegration Architect / Project Manager responsible for all projects at client site leading a team of seven engineers. All projects delivered on schedule and on budget \n \nCompany career councilor responsible for support and career development of junior colleagues. Currently responsible for a team of four.  \n \nResponsible for translating business \nneeds to technical. Commercial insight, high level solutions knowledge and well developed communication skills. Expected \nto lead teams or manage small projects, perform QA and develop further sales opportunities. \n \nwebMethods \nBizTalk  \nVitria EAI Solution Architect TMNS June 2007  –  September 2008  (1 year 4 months) The Hague Area, Netherlands Account Manager/Solution Architect, webMethods Integration Practice \n \nResponsible for Client Account Management including project sales. Primary Sales Contact – generation, acceptance, and delivery of 10 project contracts \n \nIntegration Architect / Project Manager responsible for all projects at client site leading a team of seven engineers. All projects delivered on schedule and on budget \n \nCompany career councilor responsible for support and career development of junior colleagues. Currently responsible for a team of four.  \n \nResponsible for translating business \nneeds to technical. Commercial insight, high level solutions knowledge and well developed communication skills. Expected \nto lead teams or manage small projects, perform QA and develop further sales opportunities. \n \nwebMethods \nBizTalk  \nVitria Program Manager Microsoft December 2005  –  June 2007  (1 year 7 months) Greater Seattle Area Program Manager, BizTalk Product Group \n•\tResponsible for Customer Early Adoption Programs for BizTalk Integration Solution as part of the software development process (managed 45 partners / customers) \n•\tKey feature areas included WS-* Web Service Compatibility (WCF), integration with Oracle Databases, SAP (BAPI, RFC, iDoc), Siebel, DB2, and MQ Series. \n•\tDevelopment and Presentation of Training material for new integration technologies Program Manager Microsoft December 2005  –  June 2007  (1 year 7 months) Greater Seattle Area Program Manager, BizTalk Product Group \n•\tResponsible for Customer Early Adoption Programs for BizTalk Integration Solution as part of the software development process (managed 45 partners / customers) \n•\tKey feature areas included WS-* Web Service Compatibility (WCF), integration with Oracle Databases, SAP (BAPI, RFC, iDoc), Siebel, DB2, and MQ Series. \n•\tDevelopment and Presentation of Training material for new integration technologies Consultant Accenture January 2001  –  December 2005  (5 years) Greater Seattle Area Principal Integration Consultant \n•\tExperienced in all phases of the software development lifecycle \n•\tMember of elite Global Integration Group specializing in SOA \n•\tExtensive experience with Fortune 500 clients \n•\tDeep Order Management, Business Process Automation, and Enterprise Architecture experience \n•\tWell-rounded technologist with experience spanning EAI, architecture design, object-oriented design and development, data modeling, UI development, and XML-based technologies Consultant Accenture January 2001  –  December 2005  (5 years) Greater Seattle Area Principal Integration Consultant \n•\tExperienced in all phases of the software development lifecycle \n•\tMember of elite Global Integration Group specializing in SOA \n•\tExtensive experience with Fortune 500 clients \n•\tDeep Order Management, Business Process Automation, and Enterprise Architecture experience \n•\tWell-rounded technologist with experience spanning EAI, architecture design, object-oriented design and development, data modeling, UI development, and XML-based technologies Skills SOA EAI Integration Java .NET BizTalk Google Search Appliance Enterprise Software Enterprise Architecture Cloud Computing Google Apps Google App Engine Chrome OS SaaS Pre-sales PaaS Oracle Middleware Web Services Business Process SDLC Enterprise architecture See 7+     See less Skills  SOA EAI Integration Java .NET BizTalk Google Search Appliance Enterprise Software Enterprise Architecture Cloud Computing Google Apps Google App Engine Chrome OS SaaS Pre-sales PaaS Oracle Middleware Web Services Business Process SDLC Enterprise architecture See 7+     See less SOA EAI Integration Java .NET BizTalk Google Search Appliance Enterprise Software Enterprise Architecture Cloud Computing Google Apps Google App Engine Chrome OS SaaS Pre-sales PaaS Oracle Middleware Web Services Business Process SDLC Enterprise architecture See 7+     See less SOA EAI Integration Java .NET BizTalk Google Search Appliance Enterprise Software Enterprise Architecture Cloud Computing Google Apps Google App Engine Chrome OS SaaS Pre-sales PaaS Oracle Middleware Web Services Business Process SDLC Enterprise architecture See 7+     See less Education James Madison University Bachelor of Business Administration (B.B.A.),  Computer Information Systems 1997  – 2000 Old Dominion University James Madison University Bachelor of Business Administration (B.B.A.),  Computer Information Systems 1997  – 2000 James Madison University Bachelor of Business Administration (B.B.A.),  Computer Information Systems 1997  – 2000 James Madison University Bachelor of Business Administration (B.B.A.),  Computer Information Systems 1997  – 2000 Old Dominion University Old Dominion University Old Dominion University ", "Summary 20 years of experience building innovative and successful platforms that make users' lives easier by delivering the data & services they need in the way they need it -- Knowledge Graph in Google Search, Freebase for open data in applications, PointCast with personalized news, and Grand Central with cloud-based application integration. Summary 20 years of experience building innovative and successful platforms that make users' lives easier by delivering the data & services they need in the way they need it -- Knowledge Graph in Google Search, Freebase for open data in applications, PointCast with personalized news, and Grand Central with cloud-based application integration. 20 years of experience building innovative and successful platforms that make users' lives easier by delivering the data & services they need in the way they need it -- Knowledge Graph in Google Search, Freebase for open data in applications, PointCast with personalized news, and Grand Central with cloud-based application integration. 20 years of experience building innovative and successful platforms that make users' lives easier by delivering the data & services they need in the way they need it -- Knowledge Graph in Google Search, Freebase for open data in applications, PointCast with personalized news, and Grand Central with cloud-based application integration. Experience Group Product Manager - Knowledge Graph Platform Google October 2012  – Present (2 years 11 months) After establishing the Knowledge Graph within Google, I've focused on making it possible for developers to integrate with Knowledge Graph features (http://developers.google.com/structured-data).  \n* Started by helping launch http://schema.org and then, through internal and external evangelism, established it as a standard for semantically structuring data.  \n* Launched entity actions (e.g., play music in subscription services from Search) \n* Converted Rich Snippets to schema.org \n* Worked with Gmail & Now to enable structured markup in email for flight reservations, package delivery notifications, etc. \n* Built infrastructure for extracting and processing this structured data that is now used across many Google products (Search, Local, GMail, G+, etc.). Group Product Manager - Knowledge Graph Platform Google October 2012  – Present (2 years 11 months) After establishing the Knowledge Graph within Google, I've focused on making it possible for developers to integrate with Knowledge Graph features (http://developers.google.com/structured-data).  \n* Started by helping launch http://schema.org and then, through internal and external evangelism, established it as a standard for semantically structuring data.  \n* Launched entity actions (e.g., play music in subscription services from Search) \n* Converted Rich Snippets to schema.org \n* Worked with Gmail & Now to enable structured markup in email for flight reservations, package delivery notifications, etc. \n* Built infrastructure for extracting and processing this structured data that is now used across many Google products (Search, Local, GMail, G+, etc.). Group Product Manager - Knowledge Graph Platform Google October 2012  – Present (2 years 11 months) After establishing the Knowledge Graph within Google, I've focused on making it possible for developers to integrate with Knowledge Graph features (http://developers.google.com/structured-data).  \n* Started by helping launch http://schema.org and then, through internal and external evangelism, established it as a standard for semantically structuring data.  \n* Launched entity actions (e.g., play music in subscription services from Search) \n* Converted Rich Snippets to schema.org \n* Worked with Gmail & Now to enable structured markup in email for flight reservations, package delivery notifications, etc. \n* Built infrastructure for extracting and processing this structured data that is now used across many Google products (Search, Local, GMail, G+, etc.). Skills Product Management Product Development Management Mobile Devices Start-ups User Experience Mobile Applications Web Services Personalization Skills  Product Management Product Development Management Mobile Devices Start-ups User Experience Mobile Applications Web Services Personalization Product Management Product Development Management Mobile Devices Start-ups User Experience Mobile Applications Web Services Personalization Product Management Product Development Management Mobile Devices Start-ups User Experience Mobile Applications Web Services Personalization Education Yale University BA 1988  – 1992 Yale University BA 1988  – 1992 Yale University BA 1988  – 1992 Yale University BA 1988  – 1992 ", "Summary Chief Scientist, Product Strategist, Software Architect. Design and oversee development of cutting-edge software systems and solutions. Specialist in Semantic tools and data, search, information retrieval, and recommendation technology. Looking for a position where agile translation of customer business requirements into innovative software solutions is a key component in the company’s strategy for beating their competition. Interested in start-ups, or in larger companies seeking to maintain their edge. Specialties:Agile Software Architectures, Technology Assessment, Product Innovation, Semantic Web, Knowledge Management, Search, Navigation, Competitive Intelligence, Collaborative Research, Personal Information Management Summary Chief Scientist, Product Strategist, Software Architect. Design and oversee development of cutting-edge software systems and solutions. Specialist in Semantic tools and data, search, information retrieval, and recommendation technology. Looking for a position where agile translation of customer business requirements into innovative software solutions is a key component in the company’s strategy for beating their competition. Interested in start-ups, or in larger companies seeking to maintain their edge. Specialties:Agile Software Architectures, Technology Assessment, Product Innovation, Semantic Web, Knowledge Management, Search, Navigation, Competitive Intelligence, Collaborative Research, Personal Information Management Chief Scientist, Product Strategist, Software Architect. Design and oversee development of cutting-edge software systems and solutions. Specialist in Semantic tools and data, search, information retrieval, and recommendation technology. Looking for a position where agile translation of customer business requirements into innovative software solutions is a key component in the company’s strategy for beating their competition. Interested in start-ups, or in larger companies seeking to maintain their edge. Specialties:Agile Software Architectures, Technology Assessment, Product Innovation, Semantic Web, Knowledge Management, Search, Navigation, Competitive Intelligence, Collaborative Research, Personal Information Management Chief Scientist, Product Strategist, Software Architect. Design and oversee development of cutting-edge software systems and solutions. Specialist in Semantic tools and data, search, information retrieval, and recommendation technology. Looking for a position where agile translation of customer business requirements into innovative software solutions is a key component in the company’s strategy for beating their competition. Interested in start-ups, or in larger companies seeking to maintain their edge. Specialties:Agile Software Architectures, Technology Assessment, Product Innovation, Semantic Web, Knowledge Management, Search, Navigation, Competitive Intelligence, Collaborative Research, Personal Information Management Skills Knowledge Management Semantic Web Competitive Intelligence Navigation Search Ontologies RDF Linked Data Knowledge Representation Big Data Python Artificial Intelligence Algorithms Java REST Scalability Agile Methodologies See 2+     See less Skills  Knowledge Management Semantic Web Competitive Intelligence Navigation Search Ontologies RDF Linked Data Knowledge Representation Big Data Python Artificial Intelligence Algorithms Java REST Scalability Agile Methodologies See 2+     See less Knowledge Management Semantic Web Competitive Intelligence Navigation Search Ontologies RDF Linked Data Knowledge Representation Big Data Python Artificial Intelligence Algorithms Java REST Scalability Agile Methodologies See 2+     See less Knowledge Management Semantic Web Competitive Intelligence Navigation Search Ontologies RDF Linked Data Knowledge Representation Big Data Python Artificial Intelligence Algorithms Java REST Scalability Agile Methodologies See 2+     See less Honors & Awards ", "Summary I design how things look and work. I think whole picture, balancing system and process with bold and creative thinking.  \n \nI'm currently working with sales and product teams at Google to help some of the world's most recognized brands connect with audiences. After hours, I build out my own ideas and help smaller teams tackle tough problems around brand and purpose. Summary I design how things look and work. I think whole picture, balancing system and process with bold and creative thinking.  \n \nI'm currently working with sales and product teams at Google to help some of the world's most recognized brands connect with audiences. After hours, I build out my own ideas and help smaller teams tackle tough problems around brand and purpose. I design how things look and work. I think whole picture, balancing system and process with bold and creative thinking.  \n \nI'm currently working with sales and product teams at Google to help some of the world's most recognized brands connect with audiences. After hours, I build out my own ideas and help smaller teams tackle tough problems around brand and purpose. I design how things look and work. I think whole picture, balancing system and process with bold and creative thinking.  \n \nI'm currently working with sales and product teams at Google to help some of the world's most recognized brands connect with audiences. After hours, I build out my own ideas and help smaller teams tackle tough problems around brand and purpose. Experience Product & Process Lead Google October 2014  – Present (11 months) Greater New York City Area Lead process design for a global payment platform transformation impacting major brand and agency advertisers. Build dashboards, reports, and workflows to improve Collections and Suspensions processes. Create knowledge management tools and frameworks to expedite payment product onboarding and expertise development.  Product Strategist Google August 2013  –  September 2014  (1 year 2 months) Greater New York City Area Meditated accounts receivables disputes with major brand advertisers. Leveraged billing product expertise and cross-functional relationships to provide dedicated operational support and consulting to a global portfolio of major brand and agency advertisers. Wrote javascript macros to automate bulk and complex processes. Designer Washington University in St. Louis November 2011  –  March 2014  (2 years 5 months) Greater St. Louis Area Designed logos, posters, programs, and guides for University-affiliated programs, events, and offices. Redesigned and co-copyedited Bear Facts, Washington University's new student welcome book. Teaching Assistant Rutgers University January 2013  –  March 2013  (3 months) Greater New York City Area Prepared quiz, exam, and recordkeeping for Ethics, Business, and Society (part of the Rutgers Business School MBA curriculum). Strategy Intern SYPartners September 2012  –  December 2012  (4 months) San Francisco Bay Area Co-authored tools and exercises to help leadership teams distill vision and purpose in market-changing organizations. Partnered with designers and strategists to research and create human-centered processes and workflows for use by companies in times of transformation. First Year Center Chair Washington University in St. Louis December 2010  –  May 2012  (1 year 6 months) Greater St. Louis Area Created digital communication plans to prepare students for their arrival on campus. Mentored peers serving as year-long ambassadors to new students. Partnered with campus partners to revive weekly seminar programs and newsletters. Residential Career Peer Washington University in St. Louis March 2010  –  May 2012  (2 years 3 months) Greater St. Louis Area Coached peers to improve resumes and cover letters. Connected students with professional counselors and resources on campus based on their personal interests and career goals. Piloted programming and advising initiative within the University’s residential community. Production Intern Cheree Berry Paper September 2011  –  December 2011  (4 months) Greater St. Louis Area Worked with senior designers to provide custom paper products to an expansive client base, including Kate Spade, Jonathan Adler, and Dylan’s Candy Bar. Assisted with the assembly, quality assurance, and delivery of finished products. Global Marketing Intern Bloomberg June 2011  –  August 2011  (3 months) Greater New York City Area Concepted and initiated execution of the firm’s brand presence at upcoming events. Designed and pitched improved branded collateral creation processes between Marketing and Sales. Analyzed survey data from major internal and external events to provide recommendations to senior and executive leadership. Student Project Manager Washington University in St. Louis February 2010  –  December 2010  (11 months) Greater St. Louis Area Developed and improved digital applications supporting University departments and services. Wrote help documentation for academically-critical tools. Drafted redesign of undergraduate portal. Sales & Analytics Intern Bloomberg June 2010  –  August 2010  (3 months) Greater New York City Area Leveraged Bloomberg products and MS Excel macros to build dashboards for internal and industry players. Pitched process transformation to improve customer experience with misrouted support requests. Completed intensive market and Bloomberg product competency training. Founder, Managing Director Equintium April 2005  –  July 2010  (5 years 4 months) Greater Boston Area Created an online game offering 45,000 users across the globe the ability to care for simulated pets. Built and maintained automated gameplay using PHP, MySQL, HTML, and CSS. Managed teams and initiatives around marketing, customer service, and community moderating. Summer Intern BGC Partners August 2005  –  August 2007  (2 years 1 month) Greater New York City Area Monitored market feeds using the Bloomberg Professional Service for various trading desks. Reported trade ticket receipts over the Reuters network. Product & Process Lead Google October 2014  – Present (11 months) Greater New York City Area Lead process design for a global payment platform transformation impacting major brand and agency advertisers. Build dashboards, reports, and workflows to improve Collections and Suspensions processes. Create knowledge management tools and frameworks to expedite payment product onboarding and expertise development.  Product & Process Lead Google October 2014  – Present (11 months) Greater New York City Area Lead process design for a global payment platform transformation impacting major brand and agency advertisers. Build dashboards, reports, and workflows to improve Collections and Suspensions processes. Create knowledge management tools and frameworks to expedite payment product onboarding and expertise development.  Product Strategist Google August 2013  –  September 2014  (1 year 2 months) Greater New York City Area Meditated accounts receivables disputes with major brand advertisers. Leveraged billing product expertise and cross-functional relationships to provide dedicated operational support and consulting to a global portfolio of major brand and agency advertisers. Wrote javascript macros to automate bulk and complex processes. Product Strategist Google August 2013  –  September 2014  (1 year 2 months) Greater New York City Area Meditated accounts receivables disputes with major brand advertisers. Leveraged billing product expertise and cross-functional relationships to provide dedicated operational support and consulting to a global portfolio of major brand and agency advertisers. Wrote javascript macros to automate bulk and complex processes. Designer Washington University in St. Louis November 2011  –  March 2014  (2 years 5 months) Greater St. Louis Area Designed logos, posters, programs, and guides for University-affiliated programs, events, and offices. Redesigned and co-copyedited Bear Facts, Washington University's new student welcome book. Designer Washington University in St. Louis November 2011  –  March 2014  (2 years 5 months) Greater St. Louis Area Designed logos, posters, programs, and guides for University-affiliated programs, events, and offices. Redesigned and co-copyedited Bear Facts, Washington University's new student welcome book. Teaching Assistant Rutgers University January 2013  –  March 2013  (3 months) Greater New York City Area Prepared quiz, exam, and recordkeeping for Ethics, Business, and Society (part of the Rutgers Business School MBA curriculum). Teaching Assistant Rutgers University January 2013  –  March 2013  (3 months) Greater New York City Area Prepared quiz, exam, and recordkeeping for Ethics, Business, and Society (part of the Rutgers Business School MBA curriculum). Strategy Intern SYPartners September 2012  –  December 2012  (4 months) San Francisco Bay Area Co-authored tools and exercises to help leadership teams distill vision and purpose in market-changing organizations. Partnered with designers and strategists to research and create human-centered processes and workflows for use by companies in times of transformation. Strategy Intern SYPartners September 2012  –  December 2012  (4 months) San Francisco Bay Area Co-authored tools and exercises to help leadership teams distill vision and purpose in market-changing organizations. Partnered with designers and strategists to research and create human-centered processes and workflows for use by companies in times of transformation. First Year Center Chair Washington University in St. Louis December 2010  –  May 2012  (1 year 6 months) Greater St. Louis Area Created digital communication plans to prepare students for their arrival on campus. Mentored peers serving as year-long ambassadors to new students. Partnered with campus partners to revive weekly seminar programs and newsletters. First Year Center Chair Washington University in St. Louis December 2010  –  May 2012  (1 year 6 months) Greater St. Louis Area Created digital communication plans to prepare students for their arrival on campus. Mentored peers serving as year-long ambassadors to new students. Partnered with campus partners to revive weekly seminar programs and newsletters. Residential Career Peer Washington University in St. Louis March 2010  –  May 2012  (2 years 3 months) Greater St. Louis Area Coached peers to improve resumes and cover letters. Connected students with professional counselors and resources on campus based on their personal interests and career goals. Piloted programming and advising initiative within the University’s residential community. Residential Career Peer Washington University in St. Louis March 2010  –  May 2012  (2 years 3 months) Greater St. Louis Area Coached peers to improve resumes and cover letters. Connected students with professional counselors and resources on campus based on their personal interests and career goals. Piloted programming and advising initiative within the University’s residential community. Production Intern Cheree Berry Paper September 2011  –  December 2011  (4 months) Greater St. Louis Area Worked with senior designers to provide custom paper products to an expansive client base, including Kate Spade, Jonathan Adler, and Dylan’s Candy Bar. Assisted with the assembly, quality assurance, and delivery of finished products. Production Intern Cheree Berry Paper September 2011  –  December 2011  (4 months) Greater St. Louis Area Worked with senior designers to provide custom paper products to an expansive client base, including Kate Spade, Jonathan Adler, and Dylan’s Candy Bar. Assisted with the assembly, quality assurance, and delivery of finished products. Global Marketing Intern Bloomberg June 2011  –  August 2011  (3 months) Greater New York City Area Concepted and initiated execution of the firm’s brand presence at upcoming events. Designed and pitched improved branded collateral creation processes between Marketing and Sales. Analyzed survey data from major internal and external events to provide recommendations to senior and executive leadership. Global Marketing Intern Bloomberg June 2011  –  August 2011  (3 months) Greater New York City Area Concepted and initiated execution of the firm’s brand presence at upcoming events. Designed and pitched improved branded collateral creation processes between Marketing and Sales. Analyzed survey data from major internal and external events to provide recommendations to senior and executive leadership. Student Project Manager Washington University in St. Louis February 2010  –  December 2010  (11 months) Greater St. Louis Area Developed and improved digital applications supporting University departments and services. Wrote help documentation for academically-critical tools. Drafted redesign of undergraduate portal. Student Project Manager Washington University in St. Louis February 2010  –  December 2010  (11 months) Greater St. Louis Area Developed and improved digital applications supporting University departments and services. Wrote help documentation for academically-critical tools. Drafted redesign of undergraduate portal. Sales & Analytics Intern Bloomberg June 2010  –  August 2010  (3 months) Greater New York City Area Leveraged Bloomberg products and MS Excel macros to build dashboards for internal and industry players. Pitched process transformation to improve customer experience with misrouted support requests. Completed intensive market and Bloomberg product competency training. Sales & Analytics Intern Bloomberg June 2010  –  August 2010  (3 months) Greater New York City Area Leveraged Bloomberg products and MS Excel macros to build dashboards for internal and industry players. Pitched process transformation to improve customer experience with misrouted support requests. Completed intensive market and Bloomberg product competency training. Founder, Managing Director Equintium April 2005  –  July 2010  (5 years 4 months) Greater Boston Area Created an online game offering 45,000 users across the globe the ability to care for simulated pets. Built and maintained automated gameplay using PHP, MySQL, HTML, and CSS. Managed teams and initiatives around marketing, customer service, and community moderating. Founder, Managing Director Equintium April 2005  –  July 2010  (5 years 4 months) Greater Boston Area Created an online game offering 45,000 users across the globe the ability to care for simulated pets. Built and maintained automated gameplay using PHP, MySQL, HTML, and CSS. Managed teams and initiatives around marketing, customer service, and community moderating. Summer Intern BGC Partners August 2005  –  August 2007  (2 years 1 month) Greater New York City Area Monitored market feeds using the Bloomberg Professional Service for various trading desks. Reported trade ticket receipts over the Reuters network. Summer Intern BGC Partners August 2005  –  August 2007  (2 years 1 month) Greater New York City Area Monitored market feeds using the Bloomberg Professional Service for various trading desks. Reported trade ticket receipts over the Reuters network. Languages English Native or bilingual proficiency French Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Leadership Adobe Creative Suite Project Management Web Design Graphic Design HTML Microsoft Office Research Marketing Bloomberg PHP CSS Entrepreneurship Branding & Identity Strategic Planning Social Media Marketing OS X Advertising Quality Assurance Communication Customer Service Mentoring Relationship Management MySQL Sales Career Counseling Writing Copy Editing See 13+     See less Skills  Leadership Adobe Creative Suite Project Management Web Design Graphic Design HTML Microsoft Office Research Marketing Bloomberg PHP CSS Entrepreneurship Branding & Identity Strategic Planning Social Media Marketing OS X Advertising Quality Assurance Communication Customer Service Mentoring Relationship Management MySQL Sales Career Counseling Writing Copy Editing See 13+     See less Leadership Adobe Creative Suite Project Management Web Design Graphic Design HTML Microsoft Office Research Marketing Bloomberg PHP CSS Entrepreneurship Branding & Identity Strategic Planning Social Media Marketing OS X Advertising Quality Assurance Communication Customer Service Mentoring Relationship Management MySQL Sales Career Counseling Writing Copy Editing See 13+     See less Leadership Adobe Creative Suite Project Management Web Design Graphic Design HTML Microsoft Office Research Marketing Bloomberg PHP CSS Entrepreneurship Branding & Identity Strategic Planning Social Media Marketing OS X Advertising Quality Assurance Communication Customer Service Mentoring Relationship Management MySQL Sales Career Counseling Writing Copy Editing See 13+     See less Education Washington University in St. Louis Bachelor of Arts (BA),  Economics ,  Communication Design 2009  – 2012 Activities and Societies:  First Year Center ,  Beta Theta Pi Fraternity ,  The Washington University Pikers ,  Junior Class Council ,  Mr. Wash. U. ,  The Career Center ,  Student Technology Advisory Committee ,  Performing Arts Department ,  Information Services & Technology ,  Congress of the South 40 The Derryfield School High School Diploma,  College Preperatory School 2001  – 2008 Clifford R. Nyquist Memorial Scholarship Recipient, 2008 \nRichard Crafts Scholarship Recipient, 2007 Washington University in St. Louis Bachelor of Arts (BA),  Economics ,  Communication Design 2009  – 2012 Activities and Societies:  First Year Center ,  Beta Theta Pi Fraternity ,  The Washington University Pikers ,  Junior Class Council ,  Mr. Wash. U. ,  The Career Center ,  Student Technology Advisory Committee ,  Performing Arts Department ,  Information Services & Technology ,  Congress of the South 40 Washington University in St. Louis Bachelor of Arts (BA),  Economics ,  Communication Design 2009  – 2012 Activities and Societies:  First Year Center ,  Beta Theta Pi Fraternity ,  The Washington University Pikers ,  Junior Class Council ,  Mr. Wash. U. ,  The Career Center ,  Student Technology Advisory Committee ,  Performing Arts Department ,  Information Services & Technology ,  Congress of the South 40 Washington University in St. Louis Bachelor of Arts (BA),  Economics ,  Communication Design 2009  – 2012 Activities and Societies:  First Year Center ,  Beta Theta Pi Fraternity ,  The Washington University Pikers ,  Junior Class Council ,  Mr. Wash. U. ,  The Career Center ,  Student Technology Advisory Committee ,  Performing Arts Department ,  Information Services & Technology ,  Congress of the South 40 The Derryfield School High School Diploma,  College Preperatory School 2001  – 2008 Clifford R. Nyquist Memorial Scholarship Recipient, 2008 \nRichard Crafts Scholarship Recipient, 2007 The Derryfield School High School Diploma,  College Preperatory School 2001  – 2008 Clifford R. Nyquist Memorial Scholarship Recipient, 2008 \nRichard Crafts Scholarship Recipient, 2007 The Derryfield School High School Diploma,  College Preperatory School 2001  – 2008 Clifford R. Nyquist Memorial Scholarship Recipient, 2008 \nRichard Crafts Scholarship Recipient, 2007 Honors & Awards ", "Summary My focus is the design ethics of digital technologies, especially as it relates to questions of user attention, distraction, and persuasion. \n \nI'm interested in finding new ways of designing technology to be more respectful of users' time, & more supportive of their deeper human goals. Summary My focus is the design ethics of digital technologies, especially as it relates to questions of user attention, distraction, and persuasion. \n \nI'm interested in finding new ways of designing technology to be more respectful of users' time, & more supportive of their deeper human goals. My focus is the design ethics of digital technologies, especially as it relates to questions of user attention, distraction, and persuasion. \n \nI'm interested in finding new ways of designing technology to be more respectful of users' time, & more supportive of their deeper human goals. My focus is the design ethics of digital technologies, especially as it relates to questions of user attention, distraction, and persuasion. \n \nI'm interested in finding new ways of designing technology to be more respectful of users' time, & more supportive of their deeper human goals. Experience Special Projects Google January 2012  – Present (3 years 8 months) Director Oxford Data Experience Lab May 2013  – Present (2 years 4 months) The Data Experience Lab (DXL) is an experimental effort that develops new solutions to large-scale data visualization challenges via the use of virtual- and augmented-reality technologies. Global Search Lead Google January 2011  –  December 2011  (1 year) Developed core metrics framework & analysis strategy for Google's global search advertising business. Analyst Google April 2009  –  December 2010  (1 year 9 months) Product Strategist Google October 2008  –  March 2009  (6 months) Account Strategist Google November 2005  –  September 2008  (2 years 11 months) Special Projects Google January 2012  – Present (3 years 8 months) Special Projects Google January 2012  – Present (3 years 8 months) Director Oxford Data Experience Lab May 2013  – Present (2 years 4 months) The Data Experience Lab (DXL) is an experimental effort that develops new solutions to large-scale data visualization challenges via the use of virtual- and augmented-reality technologies. Director Oxford Data Experience Lab May 2013  – Present (2 years 4 months) The Data Experience Lab (DXL) is an experimental effort that develops new solutions to large-scale data visualization challenges via the use of virtual- and augmented-reality technologies. Global Search Lead Google January 2011  –  December 2011  (1 year) Developed core metrics framework & analysis strategy for Google's global search advertising business. Global Search Lead Google January 2011  –  December 2011  (1 year) Developed core metrics framework & analysis strategy for Google's global search advertising business. Analyst Google April 2009  –  December 2010  (1 year 9 months) Analyst Google April 2009  –  December 2010  (1 year 9 months) Product Strategist Google October 2008  –  March 2009  (6 months) Product Strategist Google October 2008  –  March 2009  (6 months) Account Strategist Google November 2005  –  September 2008  (2 years 11 months) Account Strategist Google November 2005  –  September 2008  (2 years 11 months) Languages Spanish French Limited working proficiency Romanian Limited working proficiency Spanish French Limited working proficiency Romanian Limited working proficiency Spanish French Limited working proficiency Romanian Limited working proficiency Limited working proficiency Limited working proficiency Skills Analytics Web Analytics SEM Google Adwords Google Analytics PPC Mobile Advertising Online Advertising E-commerce User Experience Digital Marketing Product Management Digital Media Mobile Devices User Interface Design Usability Search Advertising Philosophy Of Technology Persuasion Public Speaking Ethics Diplomacy Writing Narrative Puns See 10+     See less Skills  Analytics Web Analytics SEM Google Adwords Google Analytics PPC Mobile Advertising Online Advertising E-commerce User Experience Digital Marketing Product Management Digital Media Mobile Devices User Interface Design Usability Search Advertising Philosophy Of Technology Persuasion Public Speaking Ethics Diplomacy Writing Narrative Puns See 10+     See less Analytics Web Analytics SEM Google Adwords Google Analytics PPC Mobile Advertising Online Advertising E-commerce User Experience Digital Marketing Product Management Digital Media Mobile Devices User Interface Design Usability Search Advertising Philosophy Of Technology Persuasion Public Speaking Ethics Diplomacy Writing Narrative Puns See 10+     See less Analytics Web Analytics SEM Google Adwords Google Analytics PPC Mobile Advertising Online Advertising E-commerce User Experience Digital Marketing Product Management Digital Media Mobile Devices User Interface Design Usability Search Advertising Philosophy Of Technology Persuasion Public Speaking Ethics Diplomacy Writing Narrative Puns See 10+     See less Education University of Oxford PhD,  Information ,  Communication ,  & the Social Sciences 2011  – 2015 DPhil Candidate, Oxford Internet Institute \nVisiting Student, Uehiro Centre for Practical Ethics \nDirector, Oxford Data Experience Lab \nMember of Balliol College \nTeaching: Internet Technology & Regulation; Philosophy & Technology Seminar \n \nDoctoral thesis supervisor: Prof. Luciano Floridi \nThesis title: 'Freedom & Persuasion in the Attention Economy' University of Washington M.S.,  Human-Centered Design & Engineering 2006  – 2008 Focus: Hardware & software design for wearable \"quantified self\" systems (i.e. measurement & analytics of personal data). University of Washington Certificate,  User-Centered Design 2006  – 2008 Seattle Pacific University B.A.,  English Literature (Latin minor) 2003  – 2005 Activities and Societies:  Philosophy seminar group ,  campus literary journal ,  webmaster/writer for national literary journal University of Oxford PhD,  Information ,  Communication ,  & the Social Sciences 2011  – 2015 DPhil Candidate, Oxford Internet Institute \nVisiting Student, Uehiro Centre for Practical Ethics \nDirector, Oxford Data Experience Lab \nMember of Balliol College \nTeaching: Internet Technology & Regulation; Philosophy & Technology Seminar \n \nDoctoral thesis supervisor: Prof. Luciano Floridi \nThesis title: 'Freedom & Persuasion in the Attention Economy' University of Oxford PhD,  Information ,  Communication ,  & the Social Sciences 2011  – 2015 DPhil Candidate, Oxford Internet Institute \nVisiting Student, Uehiro Centre for Practical Ethics \nDirector, Oxford Data Experience Lab \nMember of Balliol College \nTeaching: Internet Technology & Regulation; Philosophy & Technology Seminar \n \nDoctoral thesis supervisor: Prof. Luciano Floridi \nThesis title: 'Freedom & Persuasion in the Attention Economy' University of Oxford PhD,  Information ,  Communication ,  & the Social Sciences 2011  – 2015 DPhil Candidate, Oxford Internet Institute \nVisiting Student, Uehiro Centre for Practical Ethics \nDirector, Oxford Data Experience Lab \nMember of Balliol College \nTeaching: Internet Technology & Regulation; Philosophy & Technology Seminar \n \nDoctoral thesis supervisor: Prof. Luciano Floridi \nThesis title: 'Freedom & Persuasion in the Attention Economy' University of Washington M.S.,  Human-Centered Design & Engineering 2006  – 2008 Focus: Hardware & software design for wearable \"quantified self\" systems (i.e. measurement & analytics of personal data). University of Washington M.S.,  Human-Centered Design & Engineering 2006  – 2008 Focus: Hardware & software design for wearable \"quantified self\" systems (i.e. measurement & analytics of personal data). University of Washington M.S.,  Human-Centered Design & Engineering 2006  – 2008 Focus: Hardware & software design for wearable \"quantified self\" systems (i.e. measurement & analytics of personal data). University of Washington Certificate,  User-Centered Design 2006  – 2008 University of Washington Certificate,  User-Centered Design 2006  – 2008 University of Washington Certificate,  User-Centered Design 2006  – 2008 Seattle Pacific University B.A.,  English Literature (Latin minor) 2003  – 2005 Activities and Societies:  Philosophy seminar group ,  campus literary journal ,  webmaster/writer for national literary journal Seattle Pacific University B.A.,  English Literature (Latin minor) 2003  – 2005 Activities and Societies:  Philosophy seminar group ,  campus literary journal ,  webmaster/writer for national literary journal Seattle Pacific University B.A.,  English Literature (Latin minor) 2003  – 2005 Activities and Societies:  Philosophy seminar group ,  campus literary journal ,  webmaster/writer for national literary journal Honors & Awards Additional Honors & Awards Google Founder's Award, 2009 Additional Honors & Awards Google Founder's Award, 2009 Additional Honors & Awards Google Founder's Award, 2009 Additional Honors & Awards Google Founder's Award, 2009 ", "Summary One foot in operation strategy, one foot in product development, my job is to create solutions for improved productivity via infrastructure improvements. I diagnose & prioritize, then mobilize around an opportunity and run its deployment. Innovations and ideas are all over the place, I match them to operational issues to turn them into revenue. Specialties:project management, product management, innovation, audit, internet, online marketing, operation strategy Summary One foot in operation strategy, one foot in product development, my job is to create solutions for improved productivity via infrastructure improvements. I diagnose & prioritize, then mobilize around an opportunity and run its deployment. Innovations and ideas are all over the place, I match them to operational issues to turn them into revenue. Specialties:project management, product management, innovation, audit, internet, online marketing, operation strategy One foot in operation strategy, one foot in product development, my job is to create solutions for improved productivity via infrastructure improvements. I diagnose & prioritize, then mobilize around an opportunity and run its deployment. Innovations and ideas are all over the place, I match them to operational issues to turn them into revenue. Specialties:project management, product management, innovation, audit, internet, online marketing, operation strategy One foot in operation strategy, one foot in product development, my job is to create solutions for improved productivity via infrastructure improvements. I diagnose & prioritize, then mobilize around an opportunity and run its deployment. Innovations and ideas are all over the place, I match them to operational issues to turn them into revenue. Specialties:project management, product management, innovation, audit, internet, online marketing, operation strategy Experience AdExchange Monetization & Yield Management, Strategy and Operations Specialist for SEEMEA Google November 2013  – Present (1 year 10 months) Paris Area, France Product development and deployment for large publishers \nOperations and strategy: objective setting for the team, prioritizing leads and opportunities \nCoordination of training activities \nYield management revenue consultancy across all publishing solutions for Tier 1 publishers Sales Operations / Decision Platform Google March 2012  – Present (3 years 6 months) Paris Determine better ways to work tomorrow, suggest designs, test them then roll them out. \nAs part of the Sales Operation team, I cover the product and infrastructure part of the sales strategy for the SEEMEA region: \n- Integration of internal tools and sales processes for improved productivity \n- Assessing business needs & guiding product management / engineering \n- Rolling out solutions at scale \n- Alignment with the global strategy New Products and Media Platform Specialist for FR Google December 2011  –  March 2012  (4 months) Dublin In line with my previous position, I am taking on a more senior role in the conception and deployment of media advertising solutions for France. Head of Online Media Solutions for France Google November 2010  –  December 2011  (1 year 2 months) Dublin I lead the team of product commercialization specialists and internal consultants in charge of growing display advertising revenue (Google Display Network, YouTube, Mobile, Google TV, social). Identified revenue opportunities, built solution packages and business plans, pilot deployment of those solutions to sales. Product Strategist Google March 2007  –  November 2010  (3 years 9 months) Project Manager for EMEA : Interest Based Advertising (Remarking and Interest Category Marketing). \nReceived a Google Platinum Award for Exceptional performance. \nProduct specialist on Ad Planner, Ad Exchange, 3rd Party Ad Serving, Display Ad Builder and more Founder, Co-owner and Director R2 SARL April 2005  –  July 2006  (1 year 4 months) Market analysis, product definition, raising funds with private investors and banks, finding a subcontracting development company in eastern europe, simply running the business AdExchange Monetization & Yield Management, Strategy and Operations Specialist for SEEMEA Google November 2013  – Present (1 year 10 months) Paris Area, France Product development and deployment for large publishers \nOperations and strategy: objective setting for the team, prioritizing leads and opportunities \nCoordination of training activities \nYield management revenue consultancy across all publishing solutions for Tier 1 publishers AdExchange Monetization & Yield Management, Strategy and Operations Specialist for SEEMEA Google November 2013  – Present (1 year 10 months) Paris Area, France Product development and deployment for large publishers \nOperations and strategy: objective setting for the team, prioritizing leads and opportunities \nCoordination of training activities \nYield management revenue consultancy across all publishing solutions for Tier 1 publishers Sales Operations / Decision Platform Google March 2012  – Present (3 years 6 months) Paris Determine better ways to work tomorrow, suggest designs, test them then roll them out. \nAs part of the Sales Operation team, I cover the product and infrastructure part of the sales strategy for the SEEMEA region: \n- Integration of internal tools and sales processes for improved productivity \n- Assessing business needs & guiding product management / engineering \n- Rolling out solutions at scale \n- Alignment with the global strategy Sales Operations / Decision Platform Google March 2012  – Present (3 years 6 months) Paris Determine better ways to work tomorrow, suggest designs, test them then roll them out. \nAs part of the Sales Operation team, I cover the product and infrastructure part of the sales strategy for the SEEMEA region: \n- Integration of internal tools and sales processes for improved productivity \n- Assessing business needs & guiding product management / engineering \n- Rolling out solutions at scale \n- Alignment with the global strategy New Products and Media Platform Specialist for FR Google December 2011  –  March 2012  (4 months) Dublin In line with my previous position, I am taking on a more senior role in the conception and deployment of media advertising solutions for France. New Products and Media Platform Specialist for FR Google December 2011  –  March 2012  (4 months) Dublin In line with my previous position, I am taking on a more senior role in the conception and deployment of media advertising solutions for France. Head of Online Media Solutions for France Google November 2010  –  December 2011  (1 year 2 months) Dublin I lead the team of product commercialization specialists and internal consultants in charge of growing display advertising revenue (Google Display Network, YouTube, Mobile, Google TV, social). Identified revenue opportunities, built solution packages and business plans, pilot deployment of those solutions to sales. Head of Online Media Solutions for France Google November 2010  –  December 2011  (1 year 2 months) Dublin I lead the team of product commercialization specialists and internal consultants in charge of growing display advertising revenue (Google Display Network, YouTube, Mobile, Google TV, social). Identified revenue opportunities, built solution packages and business plans, pilot deployment of those solutions to sales. Product Strategist Google March 2007  –  November 2010  (3 years 9 months) Project Manager for EMEA : Interest Based Advertising (Remarking and Interest Category Marketing). \nReceived a Google Platinum Award for Exceptional performance. \nProduct specialist on Ad Planner, Ad Exchange, 3rd Party Ad Serving, Display Ad Builder and more Product Strategist Google March 2007  –  November 2010  (3 years 9 months) Project Manager for EMEA : Interest Based Advertising (Remarking and Interest Category Marketing). \nReceived a Google Platinum Award for Exceptional performance. \nProduct specialist on Ad Planner, Ad Exchange, 3rd Party Ad Serving, Display Ad Builder and more Founder, Co-owner and Director R2 SARL April 2005  –  July 2006  (1 year 4 months) Market analysis, product definition, raising funds with private investors and banks, finding a subcontracting development company in eastern europe, simply running the business Founder, Co-owner and Director R2 SARL April 2005  –  July 2006  (1 year 4 months) Market analysis, product definition, raising funds with private investors and banks, finding a subcontracting development company in eastern europe, simply running the business Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management People Management Business Analysis Online Marketing Product Management Product Development Google Adwords Display Advertising Mobile Devices Advertising Marketing Strategy Account Management Business Strategy Market Research Strategy New Business Development Sales Leadership SEM Social Media Online Advertising Business Development Strategic Planning Ad Serving Digital Marketing E-commerce See 11+     See less Skills  Project Management People Management Business Analysis Online Marketing Product Management Product Development Google Adwords Display Advertising Mobile Devices Advertising Marketing Strategy Account Management Business Strategy Market Research Strategy New Business Development Sales Leadership SEM Social Media Online Advertising Business Development Strategic Planning Ad Serving Digital Marketing E-commerce See 11+     See less Project Management People Management Business Analysis Online Marketing Product Management Product Development Google Adwords Display Advertising Mobile Devices Advertising Marketing Strategy Account Management Business Strategy Market Research Strategy New Business Development Sales Leadership SEM Social Media Online Advertising Business Development Strategic Planning Ad Serving Digital Marketing E-commerce See 11+     See less Project Management People Management Business Analysis Online Marketing Product Management Product Development Google Adwords Display Advertising Mobile Devices Advertising Marketing Strategy Account Management Business Strategy Market Research Strategy New Business Development Sales Leadership SEM Social Media Online Advertising Business Development Strategic Planning Ad Serving Digital Marketing E-commerce See 11+     See less Education Ecole de Management de Lyon DEA Strategy & Management of Innovation 2003  – 2004 University of Minnesota-Twin Cities undergraduate,  business 2002  – 2003 Major in entreprenership and management of innovation, minor in marketing Ecole de Management de Lyon DEA Strategy & Management of Innovation 2003  – 2004 Ecole de Management de Lyon DEA Strategy & Management of Innovation 2003  – 2004 Ecole de Management de Lyon DEA Strategy & Management of Innovation 2003  – 2004 University of Minnesota-Twin Cities undergraduate,  business 2002  – 2003 Major in entreprenership and management of innovation, minor in marketing University of Minnesota-Twin Cities undergraduate,  business 2002  – 2003 Major in entreprenership and management of innovation, minor in marketing University of Minnesota-Twin Cities undergraduate,  business 2002  – 2003 Major in entreprenership and management of innovation, minor in marketing Honors & Awards Additional Honors & Awards Several Google internal bonuses, platinum award for outstanding job impacting the organization beyond the limits of my team and market. Additional Honors & Awards Several Google internal bonuses, platinum award for outstanding job impacting the organization beyond the limits of my team and market. Additional Honors & Awards Several Google internal bonuses, platinum award for outstanding job impacting the organization beyond the limits of my team and market. Additional Honors & Awards Several Google internal bonuses, platinum award for outstanding job impacting the organization beyond the limits of my team and market. ", "Experience Product Strategist at Google Google October 2014  – Present (11 months) São Paulo Area, Brazil SMB Online Specialist Google April 2012  –  October 2014  (2 years 7 months) São Paulo Area, Brazil - Online Specialist on searching best solutions to our small and medium customers. \n- Development of project to communicate to customer at scale. \n- AdWords Training. \n- Coordinating and Negotiating strategy efforts with vendors and internal marketing team. Client Service Universo Online September 2011  –  March 2012  (7 months) São Paulo Area, Brazil - Preparation and analysis of reports. \n- Follow-up of campaigns performance with clients. \n- Consultant of products and services to customers recommending new solutions. Sales Executive Jokerman Non Traditional Media June 2010  –  July 2011  (1 year 2 months) São Paulo Area, Brazil - Provided assistance to the main direct customers (Disney, Bureau of Quebec, Tele Cine) and advertising agencies (Ogilvy, Almap, Africa, Fnazca, Publicis). \n- Prospection of new market opportunities. \n- Monitoring and analysis of projects. \n- Executed and developed new products with the customer Bacardi Inc. \n- Benchmarking of competitors strategies in Brazil. Vice President of Sales Project (NGO) AIESEC no Brasil July 2008  –  December 2009  (1 year 6 months) São Paulo Area, Brazil - Management and development of a sales team. \n- Strategic Planning - Using the BSC (Balanced Scorecard). \n- Trained sales team in effective sales techniques. \n- Developed career plans and personal coach of members. Marketing Internship Club ESL & Discover Canada Tours November 2007  –  January 2008  (3 months) Vancouver, Canada Area - Creation of sales project for the Brazilian tourism market. \n- Presentation of the company in events on ESL schools. \n- Contact with the public for package sales.  \n- Negotiation with agencies in Brazil. Product Strategist at Google Google October 2014  – Present (11 months) São Paulo Area, Brazil Product Strategist at Google Google October 2014  – Present (11 months) São Paulo Area, Brazil SMB Online Specialist Google April 2012  –  October 2014  (2 years 7 months) São Paulo Area, Brazil - Online Specialist on searching best solutions to our small and medium customers. \n- Development of project to communicate to customer at scale. \n- AdWords Training. \n- Coordinating and Negotiating strategy efforts with vendors and internal marketing team. SMB Online Specialist Google April 2012  –  October 2014  (2 years 7 months) São Paulo Area, Brazil - Online Specialist on searching best solutions to our small and medium customers. \n- Development of project to communicate to customer at scale. \n- AdWords Training. \n- Coordinating and Negotiating strategy efforts with vendors and internal marketing team. Client Service Universo Online September 2011  –  March 2012  (7 months) São Paulo Area, Brazil - Preparation and analysis of reports. \n- Follow-up of campaigns performance with clients. \n- Consultant of products and services to customers recommending new solutions. Client Service Universo Online September 2011  –  March 2012  (7 months) São Paulo Area, Brazil - Preparation and analysis of reports. \n- Follow-up of campaigns performance with clients. \n- Consultant of products and services to customers recommending new solutions. Sales Executive Jokerman Non Traditional Media June 2010  –  July 2011  (1 year 2 months) São Paulo Area, Brazil - Provided assistance to the main direct customers (Disney, Bureau of Quebec, Tele Cine) and advertising agencies (Ogilvy, Almap, Africa, Fnazca, Publicis). \n- Prospection of new market opportunities. \n- Monitoring and analysis of projects. \n- Executed and developed new products with the customer Bacardi Inc. \n- Benchmarking of competitors strategies in Brazil. Sales Executive Jokerman Non Traditional Media June 2010  –  July 2011  (1 year 2 months) São Paulo Area, Brazil - Provided assistance to the main direct customers (Disney, Bureau of Quebec, Tele Cine) and advertising agencies (Ogilvy, Almap, Africa, Fnazca, Publicis). \n- Prospection of new market opportunities. \n- Monitoring and analysis of projects. \n- Executed and developed new products with the customer Bacardi Inc. \n- Benchmarking of competitors strategies in Brazil. Vice President of Sales Project (NGO) AIESEC no Brasil July 2008  –  December 2009  (1 year 6 months) São Paulo Area, Brazil - Management and development of a sales team. \n- Strategic Planning - Using the BSC (Balanced Scorecard). \n- Trained sales team in effective sales techniques. \n- Developed career plans and personal coach of members. Vice President of Sales Project (NGO) AIESEC no Brasil July 2008  –  December 2009  (1 year 6 months) São Paulo Area, Brazil - Management and development of a sales team. \n- Strategic Planning - Using the BSC (Balanced Scorecard). \n- Trained sales team in effective sales techniques. \n- Developed career plans and personal coach of members. Marketing Internship Club ESL & Discover Canada Tours November 2007  –  January 2008  (3 months) Vancouver, Canada Area - Creation of sales project for the Brazilian tourism market. \n- Presentation of the company in events on ESL schools. \n- Contact with the public for package sales.  \n- Negotiation with agencies in Brazil. Marketing Internship Club ESL & Discover Canada Tours November 2007  –  January 2008  (3 months) Vancouver, Canada Area - Creation of sales project for the Brazilian tourism market. \n- Presentation of the company in events on ESL schools. \n- Contact with the public for package sales.  \n- Negotiation with agencies in Brazil. Languages English Native or bilingual proficiency French Limited working proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Native or bilingual proficiency Skills Strategic Planning Team Leadership Social Media Marketing Strategy Marketing Communications English Microsoft Office Teamwork Marketing Business Strategy Market Research Leadership Development Public Relations Leadership Project Management Brazilian Portuguese Internet Entrepreneur Sales Process See 3+     See less Skills  Strategic Planning Team Leadership Social Media Marketing Strategy Marketing Communications English Microsoft Office Teamwork Marketing Business Strategy Market Research Leadership Development Public Relations Leadership Project Management Brazilian Portuguese Internet Entrepreneur Sales Process See 3+     See less Strategic Planning Team Leadership Social Media Marketing Strategy Marketing Communications English Microsoft Office Teamwork Marketing Business Strategy Market Research Leadership Development Public Relations Leadership Project Management Brazilian Portuguese Internet Entrepreneur Sales Process See 3+     See less Strategic Planning Team Leadership Social Media Marketing Strategy Marketing Communications English Microsoft Office Teamwork Marketing Business Strategy Market Research Leadership Development Public Relations Leadership Project Management Brazilian Portuguese Internet Entrepreneur Sales Process See 3+     See less Education Escola Superior de Propaganda e Marketing Bachelor of Marketing and Advertising,  Business , Management, Marketing, and Related Support Services 2005  – 2010 Insper Postgradutation Business Administration,  Finance ,  Project Management and Leadership. Vancouver English Center Escola Superior de Propaganda e Marketing Bachelor of Marketing and Advertising,  Business , Management, Marketing, and Related Support Services 2005  – 2010 Escola Superior de Propaganda e Marketing Bachelor of Marketing and Advertising,  Business , Management, Marketing, and Related Support Services 2005  – 2010 Escola Superior de Propaganda e Marketing Bachelor of Marketing and Advertising,  Business , Management, Marketing, and Related Support Services 2005  – 2010 Insper Postgradutation Business Administration,  Finance ,  Project Management and Leadership. Insper Postgradutation Business Administration,  Finance ,  Project Management and Leadership. Insper Postgradutation Business Administration,  Finance ,  Project Management and Leadership. Vancouver English Center Vancouver English Center Vancouver English Center Honors & Awards 2nd Place on National L'Oréal Brandstorm Marketing Competion Loreal March 2008 National Competition where, with my team, we developed a new product to Maybeline Brand. This competition really helped on developing entrepreneur skills and disruptive innovation. 2nd Place on National L'Oréal Brandstorm Marketing Competion Loreal March 2008 National Competition where, with my team, we developed a new product to Maybeline Brand. This competition really helped on developing entrepreneur skills and disruptive innovation. 2nd Place on National L'Oréal Brandstorm Marketing Competion Loreal March 2008 National Competition where, with my team, we developed a new product to Maybeline Brand. This competition really helped on developing entrepreneur skills and disruptive innovation. 2nd Place on National L'Oréal Brandstorm Marketing Competion Loreal March 2008 National Competition where, with my team, we developed a new product to Maybeline Brand. This competition really helped on developing entrepreneur skills and disruptive innovation. ", "Skills Social Media Online Advertising Industry Research Public Speaking Strategy Google Adwords Data Analysis Start-ups PPC Web Analytics Healthcare Consulting Digital Media Analytics Marketing Market Research Entrepreneurship Medical Tourism Integrated Marketing Business Strategy Google Analytics E-commerce Digital Strategy Online Marketing See 8+     See less Skills  Social Media Online Advertising Industry Research Public Speaking Strategy Google Adwords Data Analysis Start-ups PPC Web Analytics Healthcare Consulting Digital Media Analytics Marketing Market Research Entrepreneurship Medical Tourism Integrated Marketing Business Strategy Google Analytics E-commerce Digital Strategy Online Marketing See 8+     See less Social Media Online Advertising Industry Research Public Speaking Strategy Google Adwords Data Analysis Start-ups PPC Web Analytics Healthcare Consulting Digital Media Analytics Marketing Market Research Entrepreneurship Medical Tourism Integrated Marketing Business Strategy Google Analytics E-commerce Digital Strategy Online Marketing See 8+     See less Social Media Online Advertising Industry Research Public Speaking Strategy Google Adwords Data Analysis Start-ups PPC Web Analytics Healthcare Consulting Digital Media Analytics Marketing Market Research Entrepreneurship Medical Tourism Integrated Marketing Business Strategy Google Analytics E-commerce Digital Strategy Online Marketing See 8+     See less ", "Summary Online marketing and strategy manager with specific knowledge of conversion oriented goals. Expertise knowledge of Google Adwords, Google Analytics, Omniture tracking. Specialties:direct sales, e-mail marketing, SEO, SEM, display marketing, SMM Summary Online marketing and strategy manager with specific knowledge of conversion oriented goals. Expertise knowledge of Google Adwords, Google Analytics, Omniture tracking. Specialties:direct sales, e-mail marketing, SEO, SEM, display marketing, SMM Online marketing and strategy manager with specific knowledge of conversion oriented goals. Expertise knowledge of Google Adwords, Google Analytics, Omniture tracking. Specialties:direct sales, e-mail marketing, SEO, SEM, display marketing, SMM Online marketing and strategy manager with specific knowledge of conversion oriented goals. Expertise knowledge of Google Adwords, Google Analytics, Omniture tracking. Specialties:direct sales, e-mail marketing, SEO, SEM, display marketing, SMM Experience Industry Manager Google February 2013  – Present (2 years 7 months) Zagreb, Croatia Product Strategist Google November 2011  –  February 2013  (1 year 4 months) Zagreb, Croatia As Product Strategist daily work includes working with clients \nfrom Travel, Telco and Finance verticals on developing their online strategy. In \nmore detail, this includes continuous talk on setting up online goals with clients, \ntracking their results and showing potential on the market with Google products in \nmind (Youtube, AdWords). Web and Social Media Director Inventa digital agency April 2011  –  November 2011  (8 months) Zagreb, Croatia Direct sales and marketing manager Valamar February 2010  –  March 2011  (1 year 2 months) •\tJob description: As Direct sales and marketing manager for Valamar Hotels and Resorts my daily work includes finding best possible campaigns that increase hotel bookings and at the same time maintaining good ROI.  \n•\tResponsibilities: Search engine marketing (Google AdWords), e-mail marketing, Social media marketing (Twitter, Facebook), CRM and online reputation management. . Furthermore, key responsibilities also included setting budgets, monitoring sales and developing online strategy.  \n•\tKey goals: Increasing bookings, maintaining good ROI, lowering CPO and increasing quality of visitors to www.Valamar.com (using Google Analytics and Omniture) Internet manager for Croatia Studio Moderna January 2008  –  February 2010  (2 years 2 months) •\tJob description: Handling overall operations of Internet department that was in charge of three websites (www.topshop.com.hr, www.dormeo.com.hr and www.kosmodisk.com.hr).  \n•\tResponsibilities: Search engine marketing (Google Adwords), e-mail marketing, Social media marketing (Facebook), backorder management, display advertising \n•\tKey goals: Increasing sales, maintaining low CPO, developing online strategy and finding media partnerships in Croatia.  \n•\tTeam: Head of Internet department team of four full-time and three part-time members. Product Marketing Manager BLITZ May 2007  –  December 2007  (8 months) •\tJob description: Everyday work included creating TV and radio spots, websites, but also finding potential partners for each movie. \n•\tResponsibilities: creating marketing strategies for some of the biggest blockbusters, but also independent movies. Key goals: creating strong marketing campaigns prior to opening of each movie. Online product manager T-Com September 2005  –  May 2007  (1 year 9 months) •\tJob description: Working on T-Portal (www.tportal.hr) included being in charge of all marketing activities related to most visited Croatian news portal. \n•\tResponsibilities: e-mail marketing, display advertising, creating marketing strategy, managing marketing budgets. \n•\tKey goals: Increasing number of visitors to T-Portal, preparing marketing campaigns for each new project. \n•\tTeam: Promotions coordinator in a team of three. Industry Manager Google February 2013  – Present (2 years 7 months) Zagreb, Croatia Industry Manager Google February 2013  – Present (2 years 7 months) Zagreb, Croatia Product Strategist Google November 2011  –  February 2013  (1 year 4 months) Zagreb, Croatia As Product Strategist daily work includes working with clients \nfrom Travel, Telco and Finance verticals on developing their online strategy. In \nmore detail, this includes continuous talk on setting up online goals with clients, \ntracking their results and showing potential on the market with Google products in \nmind (Youtube, AdWords). Product Strategist Google November 2011  –  February 2013  (1 year 4 months) Zagreb, Croatia As Product Strategist daily work includes working with clients \nfrom Travel, Telco and Finance verticals on developing their online strategy. In \nmore detail, this includes continuous talk on setting up online goals with clients, \ntracking their results and showing potential on the market with Google products in \nmind (Youtube, AdWords). Web and Social Media Director Inventa digital agency April 2011  –  November 2011  (8 months) Zagreb, Croatia Web and Social Media Director Inventa digital agency April 2011  –  November 2011  (8 months) Zagreb, Croatia Direct sales and marketing manager Valamar February 2010  –  March 2011  (1 year 2 months) •\tJob description: As Direct sales and marketing manager for Valamar Hotels and Resorts my daily work includes finding best possible campaigns that increase hotel bookings and at the same time maintaining good ROI.  \n•\tResponsibilities: Search engine marketing (Google AdWords), e-mail marketing, Social media marketing (Twitter, Facebook), CRM and online reputation management. . Furthermore, key responsibilities also included setting budgets, monitoring sales and developing online strategy.  \n•\tKey goals: Increasing bookings, maintaining good ROI, lowering CPO and increasing quality of visitors to www.Valamar.com (using Google Analytics and Omniture) Direct sales and marketing manager Valamar February 2010  –  March 2011  (1 year 2 months) •\tJob description: As Direct sales and marketing manager for Valamar Hotels and Resorts my daily work includes finding best possible campaigns that increase hotel bookings and at the same time maintaining good ROI.  \n•\tResponsibilities: Search engine marketing (Google AdWords), e-mail marketing, Social media marketing (Twitter, Facebook), CRM and online reputation management. . Furthermore, key responsibilities also included setting budgets, monitoring sales and developing online strategy.  \n•\tKey goals: Increasing bookings, maintaining good ROI, lowering CPO and increasing quality of visitors to www.Valamar.com (using Google Analytics and Omniture) Internet manager for Croatia Studio Moderna January 2008  –  February 2010  (2 years 2 months) •\tJob description: Handling overall operations of Internet department that was in charge of three websites (www.topshop.com.hr, www.dormeo.com.hr and www.kosmodisk.com.hr).  \n•\tResponsibilities: Search engine marketing (Google Adwords), e-mail marketing, Social media marketing (Facebook), backorder management, display advertising \n•\tKey goals: Increasing sales, maintaining low CPO, developing online strategy and finding media partnerships in Croatia.  \n•\tTeam: Head of Internet department team of four full-time and three part-time members. Internet manager for Croatia Studio Moderna January 2008  –  February 2010  (2 years 2 months) •\tJob description: Handling overall operations of Internet department that was in charge of three websites (www.topshop.com.hr, www.dormeo.com.hr and www.kosmodisk.com.hr).  \n•\tResponsibilities: Search engine marketing (Google Adwords), e-mail marketing, Social media marketing (Facebook), backorder management, display advertising \n•\tKey goals: Increasing sales, maintaining low CPO, developing online strategy and finding media partnerships in Croatia.  \n•\tTeam: Head of Internet department team of four full-time and three part-time members. Product Marketing Manager BLITZ May 2007  –  December 2007  (8 months) •\tJob description: Everyday work included creating TV and radio spots, websites, but also finding potential partners for each movie. \n•\tResponsibilities: creating marketing strategies for some of the biggest blockbusters, but also independent movies. Key goals: creating strong marketing campaigns prior to opening of each movie. Product Marketing Manager BLITZ May 2007  –  December 2007  (8 months) •\tJob description: Everyday work included creating TV and radio spots, websites, but also finding potential partners for each movie. \n•\tResponsibilities: creating marketing strategies for some of the biggest blockbusters, but also independent movies. Key goals: creating strong marketing campaigns prior to opening of each movie. Online product manager T-Com September 2005  –  May 2007  (1 year 9 months) •\tJob description: Working on T-Portal (www.tportal.hr) included being in charge of all marketing activities related to most visited Croatian news portal. \n•\tResponsibilities: e-mail marketing, display advertising, creating marketing strategy, managing marketing budgets. \n•\tKey goals: Increasing number of visitors to T-Portal, preparing marketing campaigns for each new project. \n•\tTeam: Promotions coordinator in a team of three. Online product manager T-Com September 2005  –  May 2007  (1 year 9 months) •\tJob description: Working on T-Portal (www.tportal.hr) included being in charge of all marketing activities related to most visited Croatian news portal. \n•\tResponsibilities: e-mail marketing, display advertising, creating marketing strategy, managing marketing budgets. \n•\tKey goals: Increasing number of visitors to T-Portal, preparing marketing campaigns for each new project. \n•\tTeam: Promotions coordinator in a team of three. Skills SEM SEO Email Marketing Social Media Marketing Online Marketing PPC Web Analytics Google Adwords Social Media Google Analytics Digital Marketing Online Advertising E-commerce Facebook Mobile Marketing Lead Generation SMO Website Development Digital Strategy Social Networking Marketing Strategy Omniture Analytics Marketing Management Conversion Optimization Market Research Internet Strategy Direct Marketing Marketing Web Project Management Marketing Communications Web Marketing Digital Media Product Marketing Search Advertising Strategy Management Online Reputation... Display Advertising YouTube Affiliate Marketing Mobile Advertising Media Planning New Media Landing Page... Community Management User Experience Integrated Marketing Mobile Devices CRM See 35+     See less Skills  SEM SEO Email Marketing Social Media Marketing Online Marketing PPC Web Analytics Google Adwords Social Media Google Analytics Digital Marketing Online Advertising E-commerce Facebook Mobile Marketing Lead Generation SMO Website Development Digital Strategy Social Networking Marketing Strategy Omniture Analytics Marketing Management Conversion Optimization Market Research Internet Strategy Direct Marketing Marketing Web Project Management Marketing Communications Web Marketing Digital Media Product Marketing Search Advertising Strategy Management Online Reputation... Display Advertising YouTube Affiliate Marketing Mobile Advertising Media Planning New Media Landing Page... Community Management User Experience Integrated Marketing Mobile Devices CRM See 35+     See less SEM SEO Email Marketing Social Media Marketing Online Marketing PPC Web Analytics Google Adwords Social Media Google Analytics Digital Marketing Online Advertising E-commerce Facebook Mobile Marketing Lead Generation SMO Website Development Digital Strategy Social Networking Marketing Strategy Omniture Analytics Marketing Management Conversion Optimization Market Research Internet Strategy Direct Marketing Marketing Web Project Management Marketing Communications Web Marketing Digital Media Product Marketing Search Advertising Strategy Management Online Reputation... Display Advertising YouTube Affiliate Marketing Mobile Advertising Media Planning New Media Landing Page... Community Management User Experience Integrated Marketing Mobile Devices CRM See 35+     See less SEM SEO Email Marketing Social Media Marketing Online Marketing PPC Web Analytics Google Adwords Social Media Google Analytics Digital Marketing Online Advertising E-commerce Facebook Mobile Marketing Lead Generation SMO Website Development Digital Strategy Social Networking Marketing Strategy Omniture Analytics Marketing Management Conversion Optimization Market Research Internet Strategy Direct Marketing Marketing Web Project Management Marketing Communications Web Marketing Digital Media Product Marketing Search Advertising Strategy Management Online Reputation... Display Advertising YouTube Affiliate Marketing Mobile Advertising Media Planning New Media Landing Page... Community Management User Experience Integrated Marketing Mobile Devices CRM See 35+     See less Education Duke University Duke Corporate Education 2014  – 2015 Empire State College, State University BS,  Business Administration 1998  – 2002 Graduated with top honors Activities and Societies:  Basketball team Duke University Duke Corporate Education 2014  – 2015 Duke University Duke Corporate Education 2014  – 2015 Duke University Duke Corporate Education 2014  – 2015 Empire State College, State University BS,  Business Administration 1998  – 2002 Graduated with top honors Activities and Societies:  Basketball team Empire State College, State University BS,  Business Administration 1998  – 2002 Graduated with top honors Activities and Societies:  Basketball team Empire State College, State University BS,  Business Administration 1998  – 2002 Graduated with top honors Activities and Societies:  Basketball team Honors & Awards ", "Summary Thinker and tinker. Summary Thinker and tinker. Thinker and tinker. Thinker and tinker. Experience Technical Program Manager, Network Content Distribution Google October 2011  – Present (3 years 11 months) Mountain View, CA - Scale Google's global network infrastructure. \n- Deliver Google's traffic in a cost-effective way. \n- Provide analytical insights to improve Google's CDN. Senior Product Strategist, Tech Leadership Team Alcatel-Lucent March 2009  –  February 2011  (2 years) Greater Vancouver, Canada Research Associate Susquehanna International Group, LLP (SIG) November 2007  –  December 2008  (1 year 2 months) San Francisco Deputy Director, Planning Division China Telecom/NTBU May 2002  –  July 2006  (4 years 3 months) Beijing Chief Engineer, Internet Product Division China Telecom/DCB May 1999  –  April 2002  (3 years) Beijing Technical Program Manager, Network Content Distribution Google October 2011  – Present (3 years 11 months) Mountain View, CA - Scale Google's global network infrastructure. \n- Deliver Google's traffic in a cost-effective way. \n- Provide analytical insights to improve Google's CDN. Technical Program Manager, Network Content Distribution Google October 2011  – Present (3 years 11 months) Mountain View, CA - Scale Google's global network infrastructure. \n- Deliver Google's traffic in a cost-effective way. \n- Provide analytical insights to improve Google's CDN. Senior Product Strategist, Tech Leadership Team Alcatel-Lucent March 2009  –  February 2011  (2 years) Greater Vancouver, Canada Senior Product Strategist, Tech Leadership Team Alcatel-Lucent March 2009  –  February 2011  (2 years) Greater Vancouver, Canada Research Associate Susquehanna International Group, LLP (SIG) November 2007  –  December 2008  (1 year 2 months) San Francisco Research Associate Susquehanna International Group, LLP (SIG) November 2007  –  December 2008  (1 year 2 months) San Francisco Deputy Director, Planning Division China Telecom/NTBU May 2002  –  July 2006  (4 years 3 months) Beijing Deputy Director, Planning Division China Telecom/NTBU May 2002  –  July 2006  (4 years 3 months) Beijing Chief Engineer, Internet Product Division China Telecom/DCB May 1999  –  April 2002  (3 years) Beijing Chief Engineer, Internet Product Division China Telecom/DCB May 1999  –  April 2002  (3 years) Beijing Languages   Skills Analytics Market Research Financial Modeling Leadership Product Management Cloud Computing Mobile Devices Telecommunications Wireless IP Start-ups Mobile Applications Management Product Development Networking Business Strategy See 1+     See less Skills  Analytics Market Research Financial Modeling Leadership Product Management Cloud Computing Mobile Devices Telecommunications Wireless IP Start-ups Mobile Applications Management Product Development Networking Business Strategy See 1+     See less Analytics Market Research Financial Modeling Leadership Product Management Cloud Computing Mobile Devices Telecommunications Wireless IP Start-ups Mobile Applications Management Product Development Networking Business Strategy See 1+     See less Analytics Market Research Financial Modeling Leadership Product Management Cloud Computing Mobile Devices Telecommunications Wireless IP Start-ups Mobile Applications Management Product Development Networking Business Strategy See 1+     See less Education University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.) 2006  – 2008 BI Norwegian Business School 2003  – 2005 Beijing University of Posts and Telecommunications Master's Degree 1996  – 1999 Southeast University Bachelor's Degree 1992  – 1996 University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.) 2006  – 2008 University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.) 2006  – 2008 University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.) 2006  – 2008 BI Norwegian Business School 2003  – 2005 BI Norwegian Business School 2003  – 2005 BI Norwegian Business School 2003  – 2005 Beijing University of Posts and Telecommunications Master's Degree 1996  – 1999 Beijing University of Posts and Telecommunications Master's Degree 1996  – 1999 Beijing University of Posts and Telecommunications Master's Degree 1996  – 1999 Southeast University Bachelor's Degree 1992  – 1996 Southeast University Bachelor's Degree 1992  – 1996 Southeast University Bachelor's Degree 1992  – 1996 ", "Experience Display Sales Operations Analyst Google March 2010  – Present (5 years 6 months) Developing analysis models based on internal data \nLeading a cross-functional analyst team to build sales-facing data analysis tools Product Strategist Google September 2009  –  March 2010  (7 months) Cross-Media Analyst Google March 2009  –  October 2009  (8 months) Pilot cross-media and search impact experiments with large advertisers \nPrioritize and scale advertiser research initiatives \nWork with Product to build advertiser research tools Product Strategist Google July 2008  –  March 2009  (9 months) Develop and scale custom business solutions for large clients \nWork with Product Team to implement tool improvements and develop new products \nCoordinate business analysts and internal resources to roll out new client strategy initiatives. Director of Marketing Statistical Innovations Inc. October 2002  –  June 2006  (3 years 9 months) Research Services & Marketing Coordinator Adams Harkness July 2000  –  August 2002  (2 years 2 months) Display Sales Operations Analyst Google March 2010  – Present (5 years 6 months) Developing analysis models based on internal data \nLeading a cross-functional analyst team to build sales-facing data analysis tools Display Sales Operations Analyst Google March 2010  – Present (5 years 6 months) Developing analysis models based on internal data \nLeading a cross-functional analyst team to build sales-facing data analysis tools Product Strategist Google September 2009  –  March 2010  (7 months) Product Strategist Google September 2009  –  March 2010  (7 months) Cross-Media Analyst Google March 2009  –  October 2009  (8 months) Pilot cross-media and search impact experiments with large advertisers \nPrioritize and scale advertiser research initiatives \nWork with Product to build advertiser research tools Cross-Media Analyst Google March 2009  –  October 2009  (8 months) Pilot cross-media and search impact experiments with large advertisers \nPrioritize and scale advertiser research initiatives \nWork with Product to build advertiser research tools Product Strategist Google July 2008  –  March 2009  (9 months) Develop and scale custom business solutions for large clients \nWork with Product Team to implement tool improvements and develop new products \nCoordinate business analysts and internal resources to roll out new client strategy initiatives. Product Strategist Google July 2008  –  March 2009  (9 months) Develop and scale custom business solutions for large clients \nWork with Product Team to implement tool improvements and develop new products \nCoordinate business analysts and internal resources to roll out new client strategy initiatives. Director of Marketing Statistical Innovations Inc. October 2002  –  June 2006  (3 years 9 months) Director of Marketing Statistical Innovations Inc. October 2002  –  June 2006  (3 years 9 months) Research Services & Marketing Coordinator Adams Harkness July 2000  –  August 2002  (2 years 2 months) Research Services & Marketing Coordinator Adams Harkness July 2000  –  August 2002  (2 years 2 months) Skills Analytics Cross-functional Team... Process Improvement Data Analysis Marketing Strategy Competitive Analysis Product Management Business Analysis Marketing Strategy Management Consulting Analysis Market Research E-commerce Financial Analysis Financial Modeling Online Advertising See 2+     See less Skills  Analytics Cross-functional Team... Process Improvement Data Analysis Marketing Strategy Competitive Analysis Product Management Business Analysis Marketing Strategy Management Consulting Analysis Market Research E-commerce Financial Analysis Financial Modeling Online Advertising See 2+     See less Analytics Cross-functional Team... Process Improvement Data Analysis Marketing Strategy Competitive Analysis Product Management Business Analysis Marketing Strategy Management Consulting Analysis Market Research E-commerce Financial Analysis Financial Modeling Online Advertising See 2+     See less Analytics Cross-functional Team... Process Improvement Data Analysis Marketing Strategy Competitive Analysis Product Management Business Analysis Marketing Strategy Management Consulting Analysis Market Research E-commerce Financial Analysis Financial Modeling Online Advertising See 2+     See less Education Boston College - Wallace E. Carroll Graduate School of Management MBA,  Management 2006  – 2008 Tufts University BS,  Economics 1996  – 2000 Boston College - Wallace E. Carroll Graduate School of Management MBA,  Management 2006  – 2008 Boston College - Wallace E. Carroll Graduate School of Management MBA,  Management 2006  – 2008 Boston College - Wallace E. Carroll Graduate School of Management MBA,  Management 2006  – 2008 Tufts University BS,  Economics 1996  – 2000 Tufts University BS,  Economics 1996  – 2000 Tufts University BS,  Economics 1996  – 2000 ", "Experience Marketing Manager - Creative Lab Google September 2013  – Present (2 years) Greater New York City Area Product Strategist Big Spaceship January 2013  –  September 2013  (9 months) Brooklyn, NY A hybrid role including product definition, feature development, business analysis and user research. \n \n• Define product visions through version plans and product roadmaps \n• Establish product features and business needs through stakeholder interviews and user research \n• Develop visual articulations of product features through collaborative design sessions + wireframing \n• Discover new opportunities to evolve or extend products over time \n• Partner with technologist to implement sensible development solutions \n• Lead brainstorming and collaborative design sessions \n• Responsible for the following deliverables and more: \n–\tUser stories, feature specifications, and product backlog \n–\tStrategic positioning \n–\tProduct roadmap  \n–\tMeasurement framework \n–\tHigh-level wireframes, occasionally created in-tandem with lead designer Producer Big Spaceship October 2010  –  December 2012  (2 years 3 months) Brooklyn, NY • Principal project manager and client partner for Finish Line, Lucasfilm, Wrigley, Absolut and others \n• Responsible for day-to-day activities, while uncovering future relationship opportunities \n• Project lead for concept, management and iteration of client initiatives \n• Strategic partner and UX-focused design voice within product-focused projects \n• Produced projects from inception to execution with a multi-disciplinary team, including definition and management of budget, scope and schedule. Project Manager, Designer SCVNGR June 2010  –  September 2010  (4 months) VP of Interactive Services AdLab Boston University May 2009  –  May 2010  (1 year 1 month) Web Design/Computer Programmer Boston University Networked Information Services September 2007  –  May 2010  (2 years 9 months) Promotions Director WTBU Boston University May 2009  –  December 2009  (8 months) Publicist Magnum PR May 2009  –  August 2009  (4 months) Marketing/PR Intern Academy Music Group October 2008  –  December 2008  (3 months) Entrepreneur Nooklear Enterprises January 2001  –  January 2006  (5 years 1 month) Started and ran a self-run mobile deejaying business. Provided entertainment for hundreds of clients in central Indiana. Marketing Manager - Creative Lab Google September 2013  – Present (2 years) Greater New York City Area Marketing Manager - Creative Lab Google September 2013  – Present (2 years) Greater New York City Area Product Strategist Big Spaceship January 2013  –  September 2013  (9 months) Brooklyn, NY A hybrid role including product definition, feature development, business analysis and user research. \n \n• Define product visions through version plans and product roadmaps \n• Establish product features and business needs through stakeholder interviews and user research \n• Develop visual articulations of product features through collaborative design sessions + wireframing \n• Discover new opportunities to evolve or extend products over time \n• Partner with technologist to implement sensible development solutions \n• Lead brainstorming and collaborative design sessions \n• Responsible for the following deliverables and more: \n–\tUser stories, feature specifications, and product backlog \n–\tStrategic positioning \n–\tProduct roadmap  \n–\tMeasurement framework \n–\tHigh-level wireframes, occasionally created in-tandem with lead designer Product Strategist Big Spaceship January 2013  –  September 2013  (9 months) Brooklyn, NY A hybrid role including product definition, feature development, business analysis and user research. \n \n• Define product visions through version plans and product roadmaps \n• Establish product features and business needs through stakeholder interviews and user research \n• Develop visual articulations of product features through collaborative design sessions + wireframing \n• Discover new opportunities to evolve or extend products over time \n• Partner with technologist to implement sensible development solutions \n• Lead brainstorming and collaborative design sessions \n• Responsible for the following deliverables and more: \n–\tUser stories, feature specifications, and product backlog \n–\tStrategic positioning \n–\tProduct roadmap  \n–\tMeasurement framework \n–\tHigh-level wireframes, occasionally created in-tandem with lead designer Producer Big Spaceship October 2010  –  December 2012  (2 years 3 months) Brooklyn, NY • Principal project manager and client partner for Finish Line, Lucasfilm, Wrigley, Absolut and others \n• Responsible for day-to-day activities, while uncovering future relationship opportunities \n• Project lead for concept, management and iteration of client initiatives \n• Strategic partner and UX-focused design voice within product-focused projects \n• Produced projects from inception to execution with a multi-disciplinary team, including definition and management of budget, scope and schedule. Producer Big Spaceship October 2010  –  December 2012  (2 years 3 months) Brooklyn, NY • Principal project manager and client partner for Finish Line, Lucasfilm, Wrigley, Absolut and others \n• Responsible for day-to-day activities, while uncovering future relationship opportunities \n• Project lead for concept, management and iteration of client initiatives \n• Strategic partner and UX-focused design voice within product-focused projects \n• Produced projects from inception to execution with a multi-disciplinary team, including definition and management of budget, scope and schedule. Project Manager, Designer SCVNGR June 2010  –  September 2010  (4 months) Project Manager, Designer SCVNGR June 2010  –  September 2010  (4 months) VP of Interactive Services AdLab Boston University May 2009  –  May 2010  (1 year 1 month) VP of Interactive Services AdLab Boston University May 2009  –  May 2010  (1 year 1 month) Web Design/Computer Programmer Boston University Networked Information Services September 2007  –  May 2010  (2 years 9 months) Web Design/Computer Programmer Boston University Networked Information Services September 2007  –  May 2010  (2 years 9 months) Promotions Director WTBU Boston University May 2009  –  December 2009  (8 months) Promotions Director WTBU Boston University May 2009  –  December 2009  (8 months) Publicist Magnum PR May 2009  –  August 2009  (4 months) Publicist Magnum PR May 2009  –  August 2009  (4 months) Marketing/PR Intern Academy Music Group October 2008  –  December 2008  (3 months) Marketing/PR Intern Academy Music Group October 2008  –  December 2008  (3 months) Entrepreneur Nooklear Enterprises January 2001  –  January 2006  (5 years 1 month) Started and ran a self-run mobile deejaying business. Provided entertainment for hundreds of clients in central Indiana. Entrepreneur Nooklear Enterprises January 2001  –  January 2006  (5 years 1 month) Started and ran a self-run mobile deejaying business. Provided entertainment for hundreds of clients in central Indiana. Skills Digital Strategy Advertising Web Design Interactive Advertising User Experience Digital Production Web Development User Interface Project Management Facebook Social Media Social Media Marketing Copywriting Digital Marketing Wordpress Content Strategy Creative Direction Entrepreneurship Digital Media E-commerce Integrated Marketing Strategy Mobile Devices Google Analytics WordPress See 10+     See less Skills  Digital Strategy Advertising Web Design Interactive Advertising User Experience Digital Production Web Development User Interface Project Management Facebook Social Media Social Media Marketing Copywriting Digital Marketing Wordpress Content Strategy Creative Direction Entrepreneurship Digital Media E-commerce Integrated Marketing Strategy Mobile Devices Google Analytics WordPress See 10+     See less Digital Strategy Advertising Web Design Interactive Advertising User Experience Digital Production Web Development User Interface Project Management Facebook Social Media Social Media Marketing Copywriting Digital Marketing Wordpress Content Strategy Creative Direction Entrepreneurship Digital Media E-commerce Integrated Marketing Strategy Mobile Devices Google Analytics WordPress See 10+     See less Digital Strategy Advertising Web Design Interactive Advertising User Experience Digital Production Web Development User Interface Project Management Facebook Social Media Social Media Marketing Copywriting Digital Marketing Wordpress Content Strategy Creative Direction Entrepreneurship Digital Media E-commerce Integrated Marketing Strategy Mobile Devices Google Analytics WordPress See 10+     See less Education Boston University B.S.,  Advertising ,  History , Cum Laude 2006  – 2010 Activities and Societies:  AdLab ,  AdClub ,  WTBU ,  NIS Boston University B.S.,  Advertising ,  History , Cum Laude 2006  – 2010 Activities and Societies:  AdLab ,  AdClub ,  WTBU ,  NIS Boston University B.S.,  Advertising ,  History , Cum Laude 2006  – 2010 Activities and Societies:  AdLab ,  AdClub ,  WTBU ,  NIS Boston University B.S.,  Advertising ,  History , Cum Laude 2006  – 2010 Activities and Societies:  AdLab ,  AdClub ,  WTBU ,  NIS Honors & Awards Cum Laude May 2010 Forbes 30 Under 30, 2015 – Marketing and Advertising Forbes Magazine January 2015 Listed as one of Forbe's top 30 under 30 in marketing and advertising.  \n \nFull coverage: http://www.forbes.com/pictures/eihl45jfje/nooka-jones-26/?ss=cmo-network Additional Honors & Awards Dean's List Cum Laude May 2010 Cum Laude May 2010 Cum Laude May 2010 Forbes 30 Under 30, 2015 – Marketing and Advertising Forbes Magazine January 2015 Listed as one of Forbe's top 30 under 30 in marketing and advertising.  \n \nFull coverage: http://www.forbes.com/pictures/eihl45jfje/nooka-jones-26/?ss=cmo-network Forbes 30 Under 30, 2015 – Marketing and Advertising Forbes Magazine January 2015 Listed as one of Forbe's top 30 under 30 in marketing and advertising.  \n \nFull coverage: http://www.forbes.com/pictures/eihl45jfje/nooka-jones-26/?ss=cmo-network Forbes 30 Under 30, 2015 – Marketing and Advertising Forbes Magazine January 2015 Listed as one of Forbe's top 30 under 30 in marketing and advertising.  \n \nFull coverage: http://www.forbes.com/pictures/eihl45jfje/nooka-jones-26/?ss=cmo-network Additional Honors & Awards Dean's List Additional Honors & Awards Dean's List Additional Honors & Awards Dean's List ", "Experience Industry manager, IT-advertisers Google October 2012  – Present (2 years 11 months) Ukraine Helping Ukrainian IT companies grow their business using Google advertising products. Product Strategist Google April 2011  –  November 2012  (1 year 8 months) Kiev,Ukraine Consult biggest UA advertisers on Google ad services \nDevelop educational programs for UA advertisers \nIncrease ad product adoption Account Strategist Google March 2010  –  April 2011  (1 year 2 months) Kiev, Ukraine Develop accounts of biggest UA advertisers E-commerce engineer Ukraine International Airlines September 2006  –  March 2010  (3 years 7 months) www.flyUIA.com and related projects: \n- Project management \n- Additional development \n- Maintanence \n- Web analytics \n- CPC advertising Industry manager, IT-advertisers Google October 2012  – Present (2 years 11 months) Ukraine Helping Ukrainian IT companies grow their business using Google advertising products. Industry manager, IT-advertisers Google October 2012  – Present (2 years 11 months) Ukraine Helping Ukrainian IT companies grow their business using Google advertising products. Product Strategist Google April 2011  –  November 2012  (1 year 8 months) Kiev,Ukraine Consult biggest UA advertisers on Google ad services \nDevelop educational programs for UA advertisers \nIncrease ad product adoption Product Strategist Google April 2011  –  November 2012  (1 year 8 months) Kiev,Ukraine Consult biggest UA advertisers on Google ad services \nDevelop educational programs for UA advertisers \nIncrease ad product adoption Account Strategist Google March 2010  –  April 2011  (1 year 2 months) Kiev, Ukraine Develop accounts of biggest UA advertisers Account Strategist Google March 2010  –  April 2011  (1 year 2 months) Kiev, Ukraine Develop accounts of biggest UA advertisers E-commerce engineer Ukraine International Airlines September 2006  –  March 2010  (3 years 7 months) www.flyUIA.com and related projects: \n- Project management \n- Additional development \n- Maintanence \n- Web analytics \n- CPC advertising E-commerce engineer Ukraine International Airlines September 2006  –  March 2010  (3 years 7 months) www.flyUIA.com and related projects: \n- Project management \n- Additional development \n- Maintanence \n- Web analytics \n- CPC advertising Skills Web Analytics PPC E-commerce Mobile Marketing Google Analytics Online Advertising SEM Marketing Strategy Google Adwords Online Marketing Digital Marketing Advertising Mobile Applications Business Development Digital Strategy Analytics Mobile Advertising Affiliate Marketing Search Advertising Product Management SEO Entrepreneurship Social Media Marketing Competitive Analysis User Experience Display Advertising Product Marketing Marketing Management Strategic Partnerships Strategy Web Marketing Start-ups Lead Generation Landing Page... B2B Digital Media Market Research Mobile Devices Conversion Optimization Email Marketing B2B Marketing Monetization See 27+     See less Skills  Web Analytics PPC E-commerce Mobile Marketing Google Analytics Online Advertising SEM Marketing Strategy Google Adwords Online Marketing Digital Marketing Advertising Mobile Applications Business Development Digital Strategy Analytics Mobile Advertising Affiliate Marketing Search Advertising Product Management SEO Entrepreneurship Social Media Marketing Competitive Analysis User Experience Display Advertising Product Marketing Marketing Management Strategic Partnerships Strategy Web Marketing Start-ups Lead Generation Landing Page... B2B Digital Media Market Research Mobile Devices Conversion Optimization Email Marketing B2B Marketing Monetization See 27+     See less Web Analytics PPC E-commerce Mobile Marketing Google Analytics Online Advertising SEM Marketing Strategy Google Adwords Online Marketing Digital Marketing Advertising Mobile Applications Business Development Digital Strategy Analytics Mobile Advertising Affiliate Marketing Search Advertising Product Management SEO Entrepreneurship Social Media Marketing Competitive Analysis User Experience Display Advertising Product Marketing Marketing Management Strategic Partnerships Strategy Web Marketing Start-ups Lead Generation Landing Page... B2B Digital Media Market Research Mobile Devices Conversion Optimization Email Marketing B2B Marketing Monetization See 27+     See less Web Analytics PPC E-commerce Mobile Marketing Google Analytics Online Advertising SEM Marketing Strategy Google Adwords Online Marketing Digital Marketing Advertising Mobile Applications Business Development Digital Strategy Analytics Mobile Advertising Affiliate Marketing Search Advertising Product Management SEO Entrepreneurship Social Media Marketing Competitive Analysis User Experience Display Advertising Product Marketing Marketing Management Strategic Partnerships Strategy Web Marketing Start-ups Lead Generation Landing Page... B2B Digital Media Market Research Mobile Devices Conversion Optimization Email Marketing B2B Marketing Monetization See 27+     See less Education National Aviation University master,  aircraft control systems 2000  – 2006 KROK University Bachelor's degree,  Entrepreneurship/Entrepreneurial Studies 2006  – 2008 National Aviation University master,  aircraft control systems 2000  – 2006 National Aviation University master,  aircraft control systems 2000  – 2006 National Aviation University master,  aircraft control systems 2000  – 2006 KROK University Bachelor's degree,  Entrepreneurship/Entrepreneurial Studies 2006  – 2008 KROK University Bachelor's degree,  Entrepreneurship/Entrepreneurial Studies 2006  – 2008 KROK University Bachelor's degree,  Entrepreneurship/Entrepreneurial Studies 2006  – 2008 ", "Experience Director of Digital Marketing Global Analytics September 2011  – Present (4 years) San Diego, CA Sr. Analyst & Web Analytics Evangelist Digitaria Interactive November 2010  –  September 2011  (11 months) San Diego, CA - Created behavioral analytics models and visitor segmentation strategies \n- Provided 1:1 consultation for executives at Fortune 100 brands to improve online marketing and site performance \n- Translated the business needs of Fortune 100 clients into web strategies and an appropriate measurement framework. \n- Developed analytics service offerings. \n- Panelist at 2011 OMMA Behavioral Conference: Behavior Meets Brand Analyst, Site Optimization Provide Commerce November 2009  –  November 2010  (1 year 1 month) - Managed the portfolio of website tests across all Provide-commerce web properties including: ProFlowers, RedEnvelope, Shari’s Berries & Cherry Moon Farms \n- Designed and implemented tests that enhanced website visitor experiences and increased profitability \n- Conducted deep analysis of test results with advanced web analytics tools \n- Improved customer dialogue through the adoption of social commerce technologies Online Marketing Consultant / Web Analyst Google August 2008  –  September 2009  (1 year 2 months) - Coached Fortune 1000 advertisers to improve their online marketing performance. Clients included: 1-800-Flowers, Barclays, Fox Interactive, Supervalu, US Franchise Systems, & Warner Brothers \n- Developed customer segments and identified new advertising opportunities in search and content targeting \n- Implemented A/B and multivariate testing strategies to improve website performance \n- Managed a team of technical specialists to deliver business insights for newly installed clients \n- Regular presenter for C-level executive briefings, tradeshows, and panel interviews \n- Conducted webinars, agency workshops, and a featured speaker at Google’s Conversion University \n- Produced training content for the Google Analytics Individual Qualification program Product Strategist - Google Analytics & Website Optimizer Google July 2006  –  July 2008  (2 years 1 month) - Sold and implemented Google Analytics & Website Optimizer on over 60 websites for F1000 advertisers \n- Responded to RFP’s and negotiated product installation with legal teams \n- Developed a sales effectiveness dashboard for internal stakeholders with 3rd party developers \n- Organized 23 “meet the client” interviews with top analytics clients to escalate bugs and new product features to engineering teams. Clients included: E-Loan, J&J, REI, Orbitz, & Universal Music \n- Championed engineering efforts to address feature shortcomings for auto-tagging, account linking, and goal creation Account Strategist - Ad Sales Google May 2004  –  July 2006  (2 years 3 months) - Executed search marketing campaigns for top entertainment clients including: EA, Fox, Geffen Records, & Paramount \n- Wrote advertising copy and generated keywords that optimized click-through rate \n- Built a 6M+ keyword campaign for Yahoo! Music that doubled quarterly ad spend \n- Programmed keyword tools that reduced the time needed to build new search campaigns by 80% Advertising Account Manager GameSpy September 2003  –  March 2004  (7 months) - Managed campaigns in excess of $1.2 million on the GameSpy network \n- Optimized advertisement placement and response; analyzed ad delivery and solved technical issues \n- Composed weekly client reports and calculated end of month billing information for accounting \n- Developed contests, special promotions, newsletter mailings, and direct marketing communications \n- Forecasted monthly revenue for booked campaigns and identified key delivery issues affecting revenue \n- Coordinated all ad campaign projects between internal departments (engineering, editorial, creative services),  \nsales representatives, client, and/or agency Director of Digital Marketing Global Analytics September 2011  – Present (4 years) San Diego, CA Director of Digital Marketing Global Analytics September 2011  – Present (4 years) San Diego, CA Sr. Analyst & Web Analytics Evangelist Digitaria Interactive November 2010  –  September 2011  (11 months) San Diego, CA - Created behavioral analytics models and visitor segmentation strategies \n- Provided 1:1 consultation for executives at Fortune 100 brands to improve online marketing and site performance \n- Translated the business needs of Fortune 100 clients into web strategies and an appropriate measurement framework. \n- Developed analytics service offerings. \n- Panelist at 2011 OMMA Behavioral Conference: Behavior Meets Brand Sr. Analyst & Web Analytics Evangelist Digitaria Interactive November 2010  –  September 2011  (11 months) San Diego, CA - Created behavioral analytics models and visitor segmentation strategies \n- Provided 1:1 consultation for executives at Fortune 100 brands to improve online marketing and site performance \n- Translated the business needs of Fortune 100 clients into web strategies and an appropriate measurement framework. \n- Developed analytics service offerings. \n- Panelist at 2011 OMMA Behavioral Conference: Behavior Meets Brand Analyst, Site Optimization Provide Commerce November 2009  –  November 2010  (1 year 1 month) - Managed the portfolio of website tests across all Provide-commerce web properties including: ProFlowers, RedEnvelope, Shari’s Berries & Cherry Moon Farms \n- Designed and implemented tests that enhanced website visitor experiences and increased profitability \n- Conducted deep analysis of test results with advanced web analytics tools \n- Improved customer dialogue through the adoption of social commerce technologies Analyst, Site Optimization Provide Commerce November 2009  –  November 2010  (1 year 1 month) - Managed the portfolio of website tests across all Provide-commerce web properties including: ProFlowers, RedEnvelope, Shari’s Berries & Cherry Moon Farms \n- Designed and implemented tests that enhanced website visitor experiences and increased profitability \n- Conducted deep analysis of test results with advanced web analytics tools \n- Improved customer dialogue through the adoption of social commerce technologies Online Marketing Consultant / Web Analyst Google August 2008  –  September 2009  (1 year 2 months) - Coached Fortune 1000 advertisers to improve their online marketing performance. Clients included: 1-800-Flowers, Barclays, Fox Interactive, Supervalu, US Franchise Systems, & Warner Brothers \n- Developed customer segments and identified new advertising opportunities in search and content targeting \n- Implemented A/B and multivariate testing strategies to improve website performance \n- Managed a team of technical specialists to deliver business insights for newly installed clients \n- Regular presenter for C-level executive briefings, tradeshows, and panel interviews \n- Conducted webinars, agency workshops, and a featured speaker at Google’s Conversion University \n- Produced training content for the Google Analytics Individual Qualification program Online Marketing Consultant / Web Analyst Google August 2008  –  September 2009  (1 year 2 months) - Coached Fortune 1000 advertisers to improve their online marketing performance. Clients included: 1-800-Flowers, Barclays, Fox Interactive, Supervalu, US Franchise Systems, & Warner Brothers \n- Developed customer segments and identified new advertising opportunities in search and content targeting \n- Implemented A/B and multivariate testing strategies to improve website performance \n- Managed a team of technical specialists to deliver business insights for newly installed clients \n- Regular presenter for C-level executive briefings, tradeshows, and panel interviews \n- Conducted webinars, agency workshops, and a featured speaker at Google’s Conversion University \n- Produced training content for the Google Analytics Individual Qualification program Product Strategist - Google Analytics & Website Optimizer Google July 2006  –  July 2008  (2 years 1 month) - Sold and implemented Google Analytics & Website Optimizer on over 60 websites for F1000 advertisers \n- Responded to RFP’s and negotiated product installation with legal teams \n- Developed a sales effectiveness dashboard for internal stakeholders with 3rd party developers \n- Organized 23 “meet the client” interviews with top analytics clients to escalate bugs and new product features to engineering teams. Clients included: E-Loan, J&J, REI, Orbitz, & Universal Music \n- Championed engineering efforts to address feature shortcomings for auto-tagging, account linking, and goal creation Product Strategist - Google Analytics & Website Optimizer Google July 2006  –  July 2008  (2 years 1 month) - Sold and implemented Google Analytics & Website Optimizer on over 60 websites for F1000 advertisers \n- Responded to RFP’s and negotiated product installation with legal teams \n- Developed a sales effectiveness dashboard for internal stakeholders with 3rd party developers \n- Organized 23 “meet the client” interviews with top analytics clients to escalate bugs and new product features to engineering teams. Clients included: E-Loan, J&J, REI, Orbitz, & Universal Music \n- Championed engineering efforts to address feature shortcomings for auto-tagging, account linking, and goal creation Account Strategist - Ad Sales Google May 2004  –  July 2006  (2 years 3 months) - Executed search marketing campaigns for top entertainment clients including: EA, Fox, Geffen Records, & Paramount \n- Wrote advertising copy and generated keywords that optimized click-through rate \n- Built a 6M+ keyword campaign for Yahoo! Music that doubled quarterly ad spend \n- Programmed keyword tools that reduced the time needed to build new search campaigns by 80% Account Strategist - Ad Sales Google May 2004  –  July 2006  (2 years 3 months) - Executed search marketing campaigns for top entertainment clients including: EA, Fox, Geffen Records, & Paramount \n- Wrote advertising copy and generated keywords that optimized click-through rate \n- Built a 6M+ keyword campaign for Yahoo! Music that doubled quarterly ad spend \n- Programmed keyword tools that reduced the time needed to build new search campaigns by 80% Advertising Account Manager GameSpy September 2003  –  March 2004  (7 months) - Managed campaigns in excess of $1.2 million on the GameSpy network \n- Optimized advertisement placement and response; analyzed ad delivery and solved technical issues \n- Composed weekly client reports and calculated end of month billing information for accounting \n- Developed contests, special promotions, newsletter mailings, and direct marketing communications \n- Forecasted monthly revenue for booked campaigns and identified key delivery issues affecting revenue \n- Coordinated all ad campaign projects between internal departments (engineering, editorial, creative services),  \nsales representatives, client, and/or agency Advertising Account Manager GameSpy September 2003  –  March 2004  (7 months) - Managed campaigns in excess of $1.2 million on the GameSpy network \n- Optimized advertisement placement and response; analyzed ad delivery and solved technical issues \n- Composed weekly client reports and calculated end of month billing information for accounting \n- Developed contests, special promotions, newsletter mailings, and direct marketing communications \n- Forecasted monthly revenue for booked campaigns and identified key delivery issues affecting revenue \n- Coordinated all ad campaign projects between internal departments (engineering, editorial, creative services),  \nsales representatives, client, and/or agency Languages Italian Limited working proficiency Spanish Limited working proficiency Italian Limited working proficiency Spanish Limited working proficiency Italian Limited working proficiency Spanish Limited working proficiency Limited working proficiency Limited working proficiency Skills SEM Web Analytics Online Marketing Google Analytics Digital Marketing SEO Online Advertising Email Marketing Strategy Analytics Product Development Advertising Google Adwords Cross-functional Team... Omniture Strategic Partnerships Copywriting Marketing PPC See 4+     See less Skills  SEM Web Analytics Online Marketing Google Analytics Digital Marketing SEO Online Advertising Email Marketing Strategy Analytics Product Development Advertising Google Adwords Cross-functional Team... Omniture Strategic Partnerships Copywriting Marketing PPC See 4+     See less SEM Web Analytics Online Marketing Google Analytics Digital Marketing SEO Online Advertising Email Marketing Strategy Analytics Product Development Advertising Google Adwords Cross-functional Team... Omniture Strategic Partnerships Copywriting Marketing PPC See 4+     See less SEM Web Analytics Online Marketing Google Analytics Digital Marketing SEO Online Advertising Email Marketing Strategy Analytics Product Development Advertising Google Adwords Cross-functional Team... Omniture Strategic Partnerships Copywriting Marketing PPC See 4+     See less Education University of California, San Diego - The Rady School of Management MBA,  Business Administration 2010  – 2013 California Polytechnic State University-San Luis Obispo BS,  MIS ,  Marketing 1999  – 2003 Cum Laude Graduate Activities and Societies:  President of a professional business fraternity ,  Alpha Kappa Psi University of California, San Diego - The Rady School of Management MBA,  Business Administration 2010  – 2013 University of California, San Diego - The Rady School of Management MBA,  Business Administration 2010  – 2013 University of California, San Diego - The Rady School of Management MBA,  Business Administration 2010  – 2013 California Polytechnic State University-San Luis Obispo BS,  MIS ,  Marketing 1999  – 2003 Cum Laude Graduate Activities and Societies:  President of a professional business fraternity ,  Alpha Kappa Psi California Polytechnic State University-San Luis Obispo BS,  MIS ,  Marketing 1999  – 2003 Cum Laude Graduate Activities and Societies:  President of a professional business fraternity ,  Alpha Kappa Psi California Polytechnic State University-San Luis Obispo BS,  MIS ,  Marketing 1999  – 2003 Cum Laude Graduate Activities and Societies:  President of a professional business fraternity ,  Alpha Kappa Psi ", "Summary I'm at the intersection of building industry-leading software and thinking about revenue. Functionally, my experience includes product strategy, sales and go-to-market strategies, and product commercialization. I'm at Google, leading working on a new product in Google for Work. Previously, I was at Ayasdi, a startup backed by Kleiner Perkins and other top VCs where I led the go-to-market for Ayasdi's software in Healthcare into Fortune 500 customers. My team started value selling for Ayasdi and engrained it into the company's DNA :) \n \nMy personal endeavors are in Integral Coaching (ping me if you're interested in a coach!), Yoga, Meditation, and Nutrition. Summary I'm at the intersection of building industry-leading software and thinking about revenue. Functionally, my experience includes product strategy, sales and go-to-market strategies, and product commercialization. I'm at Google, leading working on a new product in Google for Work. Previously, I was at Ayasdi, a startup backed by Kleiner Perkins and other top VCs where I led the go-to-market for Ayasdi's software in Healthcare into Fortune 500 customers. My team started value selling for Ayasdi and engrained it into the company's DNA :) \n \nMy personal endeavors are in Integral Coaching (ping me if you're interested in a coach!), Yoga, Meditation, and Nutrition. I'm at the intersection of building industry-leading software and thinking about revenue. Functionally, my experience includes product strategy, sales and go-to-market strategies, and product commercialization. I'm at Google, leading working on a new product in Google for Work. Previously, I was at Ayasdi, a startup backed by Kleiner Perkins and other top VCs where I led the go-to-market for Ayasdi's software in Healthcare into Fortune 500 customers. My team started value selling for Ayasdi and engrained it into the company's DNA :) \n \nMy personal endeavors are in Integral Coaching (ping me if you're interested in a coach!), Yoga, Meditation, and Nutrition. I'm at the intersection of building industry-leading software and thinking about revenue. Functionally, my experience includes product strategy, sales and go-to-market strategies, and product commercialization. I'm at Google, leading working on a new product in Google for Work. Previously, I was at Ayasdi, a startup backed by Kleiner Perkins and other top VCs where I led the go-to-market for Ayasdi's software in Healthcare into Fortune 500 customers. My team started value selling for Ayasdi and engrained it into the company's DNA :) \n \nMy personal endeavors are in Integral Coaching (ping me if you're interested in a coach!), Yoga, Meditation, and Nutrition. Experience Product Strategist Google June 2015  – Present (3 months) Mountain View, CA I'm at Google leading the strategy for a new product in Google for Work. Our enterprise products today include Gmail, Drive, Sheets, Slides, Docs, Search, Google+, Calendar, Hangouts, Vault, and Sites. Director, Customer Value Ayasdi 2013  –  2015  (2 years) Menlo Park, CA Management Consultant Strategy&, part of the PwC network (formerly Booz & Company) June 2012  –  December 2013  (1 year 7 months) San Francisco Bay Area Investor Physic Ventures May 2011  –  August 2011  (4 months) San Francisco Bay Area Chief of Staff to CFO Pro Mujer September 2009  –  May 2010  (9 months) New York, NY Senior Analyst Leerink Partners LLC July 2008  –  August 2009  (1 year 2 months) New York, NY Investment Banking Analyst Goldman Sachs July 2006  –  July 2008  (2 years 1 month) Greater New York City Area Product Strategist Google June 2015  – Present (3 months) Mountain View, CA I'm at Google leading the strategy for a new product in Google for Work. Our enterprise products today include Gmail, Drive, Sheets, Slides, Docs, Search, Google+, Calendar, Hangouts, Vault, and Sites. Product Strategist Google June 2015  – Present (3 months) Mountain View, CA I'm at Google leading the strategy for a new product in Google for Work. Our enterprise products today include Gmail, Drive, Sheets, Slides, Docs, Search, Google+, Calendar, Hangouts, Vault, and Sites. Director, Customer Value Ayasdi 2013  –  2015  (2 years) Menlo Park, CA Director, Customer Value Ayasdi 2013  –  2015  (2 years) Menlo Park, CA Management Consultant Strategy&, part of the PwC network (formerly Booz & Company) June 2012  –  December 2013  (1 year 7 months) San Francisco Bay Area Management Consultant Strategy&, part of the PwC network (formerly Booz & Company) June 2012  –  December 2013  (1 year 7 months) San Francisco Bay Area Investor Physic Ventures May 2011  –  August 2011  (4 months) San Francisco Bay Area Investor Physic Ventures May 2011  –  August 2011  (4 months) San Francisco Bay Area Chief of Staff to CFO Pro Mujer September 2009  –  May 2010  (9 months) New York, NY Chief of Staff to CFO Pro Mujer September 2009  –  May 2010  (9 months) New York, NY Senior Analyst Leerink Partners LLC July 2008  –  August 2009  (1 year 2 months) New York, NY Senior Analyst Leerink Partners LLC July 2008  –  August 2009  (1 year 2 months) New York, NY Investment Banking Analyst Goldman Sachs July 2006  –  July 2008  (2 years 1 month) Greater New York City Area Investment Banking Analyst Goldman Sachs July 2006  –  July 2008  (2 years 1 month) Greater New York City Area Languages   Skills Skills     Education University of Pennsylvania - The Wharton School Master of Business Administration (MBA) Duke University Bachelor's Degree Duke University Associate's Degree General Assembly 2013  – 2013 University of Pennsylvania - The Wharton School Master of Business Administration (MBA) University of Pennsylvania - The Wharton School Master of Business Administration (MBA) University of Pennsylvania - The Wharton School Master of Business Administration (MBA) Duke University Bachelor's Degree Duke University Bachelor's Degree Duke University Bachelor's Degree Duke University Associate's Degree Duke University Associate's Degree Duke University Associate's Degree General Assembly 2013  – 2013 General Assembly 2013  – 2013 General Assembly 2013  – 2013 Honors & Awards TEDMED Front Line Scholar 2013 June 2013 TEDMED Front Line Scholar 2013 June 2013 TEDMED Front Line Scholar 2013 June 2013 TEDMED Front Line Scholar 2013 June 2013 ", "Languages English Full professional proficiency Hindi Professional working proficiency Telugu Native or bilingual proficiency Bengali Limited working proficiency English Full professional proficiency Hindi Professional working proficiency Telugu Native or bilingual proficiency Bengali Limited working proficiency English Full professional proficiency Hindi Professional working proficiency Telugu Native or bilingual proficiency Bengali Limited working proficiency Full professional proficiency Professional working proficiency Native or bilingual proficiency Limited working proficiency Skills Enterprise Product... eDiscovery Enterprise Software ITIL Enterprise Architecture Lotus Domino Cloud Computing Infrastructure Messaging Lotus Notes Data Migration Strategy PMP IT Strategy Websphere SOA Google Apps IT Management Microsoft Exchange IT Operations SSO IT Service Management Virtualization Integration Architecture Competitive Intelligence Technical Leadership Disaster Recovery Application Architecture IT Outsourcing Data Center SDLC Identity Management LDAP Information Governance Messaging Systems Google Apps Vault Enterprise Single Sign... Messaging Security Product Go-To-Market... See 24+     See less Skills  Enterprise Product... eDiscovery Enterprise Software ITIL Enterprise Architecture Lotus Domino Cloud Computing Infrastructure Messaging Lotus Notes Data Migration Strategy PMP IT Strategy Websphere SOA Google Apps IT Management Microsoft Exchange IT Operations SSO IT Service Management Virtualization Integration Architecture Competitive Intelligence Technical Leadership Disaster Recovery Application Architecture IT Outsourcing Data Center SDLC Identity Management LDAP Information Governance Messaging Systems Google Apps Vault Enterprise Single Sign... Messaging Security Product Go-To-Market... See 24+     See less Enterprise Product... eDiscovery Enterprise Software ITIL Enterprise Architecture Lotus Domino Cloud Computing Infrastructure Messaging Lotus Notes Data Migration Strategy PMP IT Strategy Websphere SOA Google Apps IT Management Microsoft Exchange IT Operations SSO IT Service Management Virtualization Integration Architecture Competitive Intelligence Technical Leadership Disaster Recovery Application Architecture IT Outsourcing Data Center SDLC Identity Management LDAP Information Governance Messaging Systems Google Apps Vault Enterprise Single Sign... Messaging Security Product Go-To-Market... See 24+     See less Enterprise Product... eDiscovery Enterprise Software ITIL Enterprise Architecture Lotus Domino Cloud Computing Infrastructure Messaging Lotus Notes Data Migration Strategy PMP IT Strategy Websphere SOA Google Apps IT Management Microsoft Exchange IT Operations SSO IT Service Management Virtualization Integration Architecture Competitive Intelligence Technical Leadership Disaster Recovery Application Architecture IT Outsourcing Data Center SDLC Identity Management LDAP Information Governance Messaging Systems Google Apps Vault Enterprise Single Sign... Messaging Security Product Go-To-Market... See 24+     See less Honors & Awards ", "Experience Team Lead, Project Glass Google 2013  – Present (2 years) Product Strategist Google June 2011  –  June 2013  (2 years 1 month) Sales Google January 2007  –  June 2011  (4 years 6 months) Operations & Development Team National Kidney Foundation January 2005  –  January 2007  (2 years 1 month) Supported the COO to help improve internal operations at the NKF as well as maintain daily operation Team Lead, Project Glass Google 2013  – Present (2 years) Team Lead, Project Glass Google 2013  – Present (2 years) Product Strategist Google June 2011  –  June 2013  (2 years 1 month) Product Strategist Google June 2011  –  June 2013  (2 years 1 month) Sales Google January 2007  –  June 2011  (4 years 6 months) Sales Google January 2007  –  June 2011  (4 years 6 months) Operations & Development Team National Kidney Foundation January 2005  –  January 2007  (2 years 1 month) Supported the COO to help improve internal operations at the NKF as well as maintain daily operation Operations & Development Team National Kidney Foundation January 2005  –  January 2007  (2 years 1 month) Supported the COO to help improve internal operations at the NKF as well as maintain daily operation Skills Online Advertising Digital Strategy Mobile Advertising Digital Marketing SEM User Experience Mobile Marketing Google Analytics Digital Media Skills  Online Advertising Digital Strategy Mobile Advertising Digital Marketing SEM User Experience Mobile Marketing Google Analytics Digital Media Online Advertising Digital Strategy Mobile Advertising Digital Marketing SEM User Experience Mobile Marketing Google Analytics Digital Media Online Advertising Digital Strategy Mobile Advertising Digital Marketing SEM User Experience Mobile Marketing Google Analytics Digital Media Education Texas A&M University 1998  – 2002 Texas A&M University 1998  – 2002 Texas A&M University 1998  – 2002 Texas A&M University 1998  – 2002 ", "Summary I excel in fast-paced, team oriented work environments and thrive on hitting deadlines; always looking for the next challenge but never looking past the task at hand until my customer is completely satisfied. \n \nFeel free to reach out to me if you have any questions! Summary I excel in fast-paced, team oriented work environments and thrive on hitting deadlines; always looking for the next challenge but never looking past the task at hand until my customer is completely satisfied. \n \nFeel free to reach out to me if you have any questions! I excel in fast-paced, team oriented work environments and thrive on hitting deadlines; always looking for the next challenge but never looking past the task at hand until my customer is completely satisfied. \n \nFeel free to reach out to me if you have any questions! I excel in fast-paced, team oriented work environments and thrive on hitting deadlines; always looking for the next challenge but never looking past the task at hand until my customer is completely satisfied. \n \nFeel free to reach out to me if you have any questions! Experience Program Manager Google July 2015  – Present (2 months) Working to make Google Maps better. Product Strategist Google August 2014  –  July 2015  (1 year) New York City Working on finding the best cat videos on Youtube. Information Technology Leadership Program (ITLP) GE July 2012  –  August 2014  (2 years 2 months) Stamford, CT ITLP is a two-year rotational program consisting of four six-month rotations in different areas of IT within multiple GE Capital business units. The program places a strong emphasis on technical and project management skills and provides high exposure to IT leaders across the business. \n \nPositions Held: \nSolution Architect for the build of GE Capital Retail Deposits Servicing Application. (Rotation 4) \n● Resolve Web certificates issues \n● Lead project manager for implementation of an automated Risk Fraud Engine \n● Facilitate middleware service reviews  \n● Monitor build and design to ensure scalability \n● Assist in development of SLA’s for Automated Testing Framework \n \nInfrastructure Lead to GE Retail Finance (Rotation 3) \n● Developed and facilitated monthly business operating review \n● Led development on design award winning ITLP hackathon \n● Identified and advanced new service offerings to the client business, resulting in savings  \n● Monitored incidents and resolutions in relation to agreed SLA’s \n● Collaborated and completed divestiture activities \n \nProgram Management Lead (Rotation 2) \n● Lead project manager for new PMO tool \n● Successfully built dynamic iPad project status management dashboard \n● Facilitated bi-weekly conference with Retail Finance process champions \n● Developed a standardized format and process for monthly project reporting \n \nMobile Systems Engineer (Rotation 1) \n● Built a responsive design framework used in production \n● Taught and managed responsive design to onshore and offshore teams \n● Identify and implemented collaborative services business wide to grow innovation. Assitant System Administrator University of Maryland Baltimore County January 2009  –  August 2012  (3 years 8 months) Baltimore Managed over 300 lab machines across multiple platforms. \n \n● Learned and built .vbs script to manage lab open hours and access. \n● Installation, configuration, and troubleshooting software (UNIX, Linux, Windows) on Dell & Apple workstations, and servers. Prepared backups on multiplatform’s and provide support to critical data.  \n●Lead in direct contact with Dell technical team for installation and troubleshooting. Oversaw the completion of Dell technicians work. \n●In charge of daily duties of 300+ desktops in the labs and professor offices. IT Intern GE June 2011  –  August 2011  (3 months) Norwalk, CT •Generated requirements and began analysis of ETL automation process \n•Assisted with Vendor Negotiations to purchase software \n•Built Reports and Dashboards using OBIEEg \n•Consolidated test defects on priority Monthly Risk Reporting Project \n•Collaborated on assignments alongside business and technical teams  \n•Completed Data Validation and User Acceptance Testing Undergraduate Research Assistant University of Maryland Baltimore County May 2010  –  June 2011  (1 year 2 months) Baltimore, Maryland Area •Monitor and perform experiments for Assessing Team Performance on a Cooperative Task \n•Published researcher in scientific journal Assistant Team Lead Montgomery County Public Schools June 2010  –  August 2010  (3 months) Bethesda, MD Lead a team of 4 in Montgomery Technology refresh program. Tech Support V8 Montgomery County Public Schools June 2009  –  August 2009  (3 months) •Performs hardware, software and network upgrades for all 200 MCPS schools, through 2 groups of 2. \n•Responsible for checking the servers and troubleshooting any problems that may slow down the system \n•Analyzes information to determine, recommend, and plan layout for type of computers and peripheral equipment modifications to existing systems. Web Developer Intern National Institutes of Health May 2008  –  August 2008  (4 months) Bethesda, MD Program Manager Google July 2015  – Present (2 months) Working to make Google Maps better. Program Manager Google July 2015  – Present (2 months) Working to make Google Maps better. Product Strategist Google August 2014  –  July 2015  (1 year) New York City Working on finding the best cat videos on Youtube. Product Strategist Google August 2014  –  July 2015  (1 year) New York City Working on finding the best cat videos on Youtube. Information Technology Leadership Program (ITLP) GE July 2012  –  August 2014  (2 years 2 months) Stamford, CT ITLP is a two-year rotational program consisting of four six-month rotations in different areas of IT within multiple GE Capital business units. The program places a strong emphasis on technical and project management skills and provides high exposure to IT leaders across the business. \n \nPositions Held: \nSolution Architect for the build of GE Capital Retail Deposits Servicing Application. (Rotation 4) \n● Resolve Web certificates issues \n● Lead project manager for implementation of an automated Risk Fraud Engine \n● Facilitate middleware service reviews  \n● Monitor build and design to ensure scalability \n● Assist in development of SLA’s for Automated Testing Framework \n \nInfrastructure Lead to GE Retail Finance (Rotation 3) \n● Developed and facilitated monthly business operating review \n● Led development on design award winning ITLP hackathon \n● Identified and advanced new service offerings to the client business, resulting in savings  \n● Monitored incidents and resolutions in relation to agreed SLA’s \n● Collaborated and completed divestiture activities \n \nProgram Management Lead (Rotation 2) \n● Lead project manager for new PMO tool \n● Successfully built dynamic iPad project status management dashboard \n● Facilitated bi-weekly conference with Retail Finance process champions \n● Developed a standardized format and process for monthly project reporting \n \nMobile Systems Engineer (Rotation 1) \n● Built a responsive design framework used in production \n● Taught and managed responsive design to onshore and offshore teams \n● Identify and implemented collaborative services business wide to grow innovation. Information Technology Leadership Program (ITLP) GE July 2012  –  August 2014  (2 years 2 months) Stamford, CT ITLP is a two-year rotational program consisting of four six-month rotations in different areas of IT within multiple GE Capital business units. The program places a strong emphasis on technical and project management skills and provides high exposure to IT leaders across the business. \n \nPositions Held: \nSolution Architect for the build of GE Capital Retail Deposits Servicing Application. (Rotation 4) \n● Resolve Web certificates issues \n● Lead project manager for implementation of an automated Risk Fraud Engine \n● Facilitate middleware service reviews  \n● Monitor build and design to ensure scalability \n● Assist in development of SLA’s for Automated Testing Framework \n \nInfrastructure Lead to GE Retail Finance (Rotation 3) \n● Developed and facilitated monthly business operating review \n● Led development on design award winning ITLP hackathon \n● Identified and advanced new service offerings to the client business, resulting in savings  \n● Monitored incidents and resolutions in relation to agreed SLA’s \n● Collaborated and completed divestiture activities \n \nProgram Management Lead (Rotation 2) \n● Lead project manager for new PMO tool \n● Successfully built dynamic iPad project status management dashboard \n● Facilitated bi-weekly conference with Retail Finance process champions \n● Developed a standardized format and process for monthly project reporting \n \nMobile Systems Engineer (Rotation 1) \n● Built a responsive design framework used in production \n● Taught and managed responsive design to onshore and offshore teams \n● Identify and implemented collaborative services business wide to grow innovation. Assitant System Administrator University of Maryland Baltimore County January 2009  –  August 2012  (3 years 8 months) Baltimore Managed over 300 lab machines across multiple platforms. \n \n● Learned and built .vbs script to manage lab open hours and access. \n● Installation, configuration, and troubleshooting software (UNIX, Linux, Windows) on Dell & Apple workstations, and servers. Prepared backups on multiplatform’s and provide support to critical data.  \n●Lead in direct contact with Dell technical team for installation and troubleshooting. Oversaw the completion of Dell technicians work. \n●In charge of daily duties of 300+ desktops in the labs and professor offices. Assitant System Administrator University of Maryland Baltimore County January 2009  –  August 2012  (3 years 8 months) Baltimore Managed over 300 lab machines across multiple platforms. \n \n● Learned and built .vbs script to manage lab open hours and access. \n● Installation, configuration, and troubleshooting software (UNIX, Linux, Windows) on Dell & Apple workstations, and servers. Prepared backups on multiplatform’s and provide support to critical data.  \n●Lead in direct contact with Dell technical team for installation and troubleshooting. Oversaw the completion of Dell technicians work. \n●In charge of daily duties of 300+ desktops in the labs and professor offices. IT Intern GE June 2011  –  August 2011  (3 months) Norwalk, CT •Generated requirements and began analysis of ETL automation process \n•Assisted with Vendor Negotiations to purchase software \n•Built Reports and Dashboards using OBIEEg \n•Consolidated test defects on priority Monthly Risk Reporting Project \n•Collaborated on assignments alongside business and technical teams  \n•Completed Data Validation and User Acceptance Testing IT Intern GE June 2011  –  August 2011  (3 months) Norwalk, CT •Generated requirements and began analysis of ETL automation process \n•Assisted with Vendor Negotiations to purchase software \n•Built Reports and Dashboards using OBIEEg \n•Consolidated test defects on priority Monthly Risk Reporting Project \n•Collaborated on assignments alongside business and technical teams  \n•Completed Data Validation and User Acceptance Testing Undergraduate Research Assistant University of Maryland Baltimore County May 2010  –  June 2011  (1 year 2 months) Baltimore, Maryland Area •Monitor and perform experiments for Assessing Team Performance on a Cooperative Task \n•Published researcher in scientific journal Undergraduate Research Assistant University of Maryland Baltimore County May 2010  –  June 2011  (1 year 2 months) Baltimore, Maryland Area •Monitor and perform experiments for Assessing Team Performance on a Cooperative Task \n•Published researcher in scientific journal Assistant Team Lead Montgomery County Public Schools June 2010  –  August 2010  (3 months) Bethesda, MD Lead a team of 4 in Montgomery Technology refresh program. Assistant Team Lead Montgomery County Public Schools June 2010  –  August 2010  (3 months) Bethesda, MD Lead a team of 4 in Montgomery Technology refresh program. Tech Support V8 Montgomery County Public Schools June 2009  –  August 2009  (3 months) •Performs hardware, software and network upgrades for all 200 MCPS schools, through 2 groups of 2. \n•Responsible for checking the servers and troubleshooting any problems that may slow down the system \n•Analyzes information to determine, recommend, and plan layout for type of computers and peripheral equipment modifications to existing systems. Tech Support V8 Montgomery County Public Schools June 2009  –  August 2009  (3 months) •Performs hardware, software and network upgrades for all 200 MCPS schools, through 2 groups of 2. \n•Responsible for checking the servers and troubleshooting any problems that may slow down the system \n•Analyzes information to determine, recommend, and plan layout for type of computers and peripheral equipment modifications to existing systems. Web Developer Intern National Institutes of Health May 2008  –  August 2008  (4 months) Bethesda, MD Web Developer Intern National Institutes of Health May 2008  –  August 2008  (4 months) Bethesda, MD Languages Amharic Spanish Amharic Spanish Amharic Spanish Skills Responsive Web Design HTML 5 CSS OS X Troubleshooting JavaScript Java Social Media Project Management SQL SDLC Cloud Computing Web Design Databases Testing Active Directory Windows Unix Access IT Management Networking Linux PHP Visio Visual Basic Web Applications MySQL SharePoint HTML Web Development XML Microsoft SQL Server Analysis Operating Systems Windows 7 Programming Oracle Hardware Mobile Applications See 24+     See less Skills  Responsive Web Design HTML 5 CSS OS X Troubleshooting JavaScript Java Social Media Project Management SQL SDLC Cloud Computing Web Design Databases Testing Active Directory Windows Unix Access IT Management Networking Linux PHP Visio Visual Basic Web Applications MySQL SharePoint HTML Web Development XML Microsoft SQL Server Analysis Operating Systems Windows 7 Programming Oracle Hardware Mobile Applications See 24+     See less Responsive Web Design HTML 5 CSS OS X Troubleshooting JavaScript Java Social Media Project Management SQL SDLC Cloud Computing Web Design Databases Testing Active Directory Windows Unix Access IT Management Networking Linux PHP Visio Visual Basic Web Applications MySQL SharePoint HTML Web Development XML Microsoft SQL Server Analysis Operating Systems Windows 7 Programming Oracle Hardware Mobile Applications See 24+     See less Responsive Web Design HTML 5 CSS OS X Troubleshooting JavaScript Java Social Media Project Management SQL SDLC Cloud Computing Web Design Databases Testing Active Directory Windows Unix Access IT Management Networking Linux PHP Visio Visual Basic Web Applications MySQL SharePoint HTML Web Development XML Microsoft SQL Server Analysis Operating Systems Windows 7 Programming Oracle Hardware Mobile Applications See 24+     See less Education Georgetown University Master's Degree,  Technology Management University of Maryland Baltimore County BS,  Information Systems 2008  – 2012 Accepted into UMBC Combined Bachelor of Science/Master of Science in Information Systems. For undergraduate students whose academic performance shows readiness and motivation for graduate study. Activities and Societies:  Information Systems Counsel of Majors Georgetown University Master's Degree,  Technology Management Georgetown University Master's Degree,  Technology Management Georgetown University Master's Degree,  Technology Management University of Maryland Baltimore County BS,  Information Systems 2008  – 2012 Accepted into UMBC Combined Bachelor of Science/Master of Science in Information Systems. For undergraduate students whose academic performance shows readiness and motivation for graduate study. Activities and Societies:  Information Systems Counsel of Majors University of Maryland Baltimore County BS,  Information Systems 2008  – 2012 Accepted into UMBC Combined Bachelor of Science/Master of Science in Information Systems. For undergraduate students whose academic performance shows readiness and motivation for graduate study. Activities and Societies:  Information Systems Counsel of Majors University of Maryland Baltimore County BS,  Information Systems 2008  – 2012 Accepted into UMBC Combined Bachelor of Science/Master of Science in Information Systems. For undergraduate students whose academic performance shows readiness and motivation for graduate study. Activities and Societies:  Information Systems Counsel of Majors Honors & Awards GE Expertise - Above and Beyond Award GE Capital Retail Finance June 2014 Awarded by the GE Capital Deposit business for resolving issues and providing overall support on their servicing application build. \n GE Capital Marketing Campaign GE Capital June 2014 Top 4 finalist across GE Capital, selected as one of the best ads for explaining why “Customers choose GE Capital” Best Design GE Capital November 2013 2014 Hackathon winner of best design for a geo-spatial responsive web-application \n GE Imagination & Courage Above Award GE Corporate August 2013 Awarded for leading the ITLP Global Initiatives Committee. GE Expertise Above and Beyond Award Retail Finance CEO - Margaret Keane June 2013 Awarded for providing technical expertise during Develop U week. GE Clear Thinker Above and Beyond Award GE Retail Finance PMO April 2013 Awarded by the GE Capital PMO for developing training materials and presenting to 80+ IT PMs on the new project update process \n GE ITLP Tech Tiger award GE Corporate July 2012 For helping teammates and class members in learning and building a database application in a GE training course Additional Honors & Awards Deans List 2011 \nPresidents List 2011 \nNational Honor Student 2008 GE Expertise - Above and Beyond Award GE Capital Retail Finance June 2014 Awarded by the GE Capital Deposit business for resolving issues and providing overall support on their servicing application build. \n GE Expertise - Above and Beyond Award GE Capital Retail Finance June 2014 Awarded by the GE Capital Deposit business for resolving issues and providing overall support on their servicing application build. \n GE Expertise - Above and Beyond Award GE Capital Retail Finance June 2014 Awarded by the GE Capital Deposit business for resolving issues and providing overall support on their servicing application build. \n GE Capital Marketing Campaign GE Capital June 2014 Top 4 finalist across GE Capital, selected as one of the best ads for explaining why “Customers choose GE Capital” GE Capital Marketing Campaign GE Capital June 2014 Top 4 finalist across GE Capital, selected as one of the best ads for explaining why “Customers choose GE Capital” GE Capital Marketing Campaign GE Capital June 2014 Top 4 finalist across GE Capital, selected as one of the best ads for explaining why “Customers choose GE Capital” Best Design GE Capital November 2013 2014 Hackathon winner of best design for a geo-spatial responsive web-application \n Best Design GE Capital November 2013 2014 Hackathon winner of best design for a geo-spatial responsive web-application \n Best Design GE Capital November 2013 2014 Hackathon winner of best design for a geo-spatial responsive web-application \n GE Imagination & Courage Above Award GE Corporate August 2013 Awarded for leading the ITLP Global Initiatives Committee. GE Imagination & Courage Above Award GE Corporate August 2013 Awarded for leading the ITLP Global Initiatives Committee. GE Imagination & Courage Above Award GE Corporate August 2013 Awarded for leading the ITLP Global Initiatives Committee. GE Expertise Above and Beyond Award Retail Finance CEO - Margaret Keane June 2013 Awarded for providing technical expertise during Develop U week. GE Expertise Above and Beyond Award Retail Finance CEO - Margaret Keane June 2013 Awarded for providing technical expertise during Develop U week. GE Expertise Above and Beyond Award Retail Finance CEO - Margaret Keane June 2013 Awarded for providing technical expertise during Develop U week. GE Clear Thinker Above and Beyond Award GE Retail Finance PMO April 2013 Awarded by the GE Capital PMO for developing training materials and presenting to 80+ IT PMs on the new project update process \n GE Clear Thinker Above and Beyond Award GE Retail Finance PMO April 2013 Awarded by the GE Capital PMO for developing training materials and presenting to 80+ IT PMs on the new project update process \n GE Clear Thinker Above and Beyond Award GE Retail Finance PMO April 2013 Awarded by the GE Capital PMO for developing training materials and presenting to 80+ IT PMs on the new project update process \n GE ITLP Tech Tiger award GE Corporate July 2012 For helping teammates and class members in learning and building a database application in a GE training course GE ITLP Tech Tiger award GE Corporate July 2012 For helping teammates and class members in learning and building a database application in a GE training course GE ITLP Tech Tiger award GE Corporate July 2012 For helping teammates and class members in learning and building a database application in a GE training course Additional Honors & Awards Deans List 2011 \nPresidents List 2011 \nNational Honor Student 2008 Additional Honors & Awards Deans List 2011 \nPresidents List 2011 \nNational Honor Student 2008 Additional Honors & Awards Deans List 2011 \nPresidents List 2011 \nNational Honor Student 2008 ", "Summary Collaborative management style that focuses on delighting the customer to build long term product line revenue and competitive advantage. Ability to prioritize within a spending envelope, lead or contribute to team development, and build credibility with thought leaders and partners. Experience in leading teams with and without direct authority. Passion for coaching and developing talented individuals achieve their career goals. \n \nBlue chip product management and business development experience in several market segments: IaaS, PaaS, enterprise productivity apps, application & WAN acceleration, enterprise networking (switch/route/wireless), and UX.  \n \nExpertise in enterprise and partner go to market (GTM) including sales enablement & training, product marketing programs, customer references, vertical strategies, and channels. \n \nStrong experience in user centered design (UCD), human centered design (HCD) and traditional primary market research. Expertise in prioritizing product roadmaps from 1-N making painful tradeoffs in both run rate and emerging markets. \n \nAbility and willingness to break through red tape to get the job done using an entrepreneurial spirit. Demonstrated passion for the voice of the customer and elimination of customer pain.  \n \nClosed partnership deals with projected revenue in the $B range. Integrative negotiator highly focused on aligned incentives and durable deals. Summary Collaborative management style that focuses on delighting the customer to build long term product line revenue and competitive advantage. Ability to prioritize within a spending envelope, lead or contribute to team development, and build credibility with thought leaders and partners. Experience in leading teams with and without direct authority. Passion for coaching and developing talented individuals achieve their career goals. \n \nBlue chip product management and business development experience in several market segments: IaaS, PaaS, enterprise productivity apps, application & WAN acceleration, enterprise networking (switch/route/wireless), and UX.  \n \nExpertise in enterprise and partner go to market (GTM) including sales enablement & training, product marketing programs, customer references, vertical strategies, and channels. \n \nStrong experience in user centered design (UCD), human centered design (HCD) and traditional primary market research. Expertise in prioritizing product roadmaps from 1-N making painful tradeoffs in both run rate and emerging markets. \n \nAbility and willingness to break through red tape to get the job done using an entrepreneurial spirit. Demonstrated passion for the voice of the customer and elimination of customer pain.  \n \nClosed partnership deals with projected revenue in the $B range. Integrative negotiator highly focused on aligned incentives and durable deals. Collaborative management style that focuses on delighting the customer to build long term product line revenue and competitive advantage. Ability to prioritize within a spending envelope, lead or contribute to team development, and build credibility with thought leaders and partners. Experience in leading teams with and without direct authority. Passion for coaching and developing talented individuals achieve their career goals. \n \nBlue chip product management and business development experience in several market segments: IaaS, PaaS, enterprise productivity apps, application & WAN acceleration, enterprise networking (switch/route/wireless), and UX.  \n \nExpertise in enterprise and partner go to market (GTM) including sales enablement & training, product marketing programs, customer references, vertical strategies, and channels. \n \nStrong experience in user centered design (UCD), human centered design (HCD) and traditional primary market research. Expertise in prioritizing product roadmaps from 1-N making painful tradeoffs in both run rate and emerging markets. \n \nAbility and willingness to break through red tape to get the job done using an entrepreneurial spirit. Demonstrated passion for the voice of the customer and elimination of customer pain.  \n \nClosed partnership deals with projected revenue in the $B range. Integrative negotiator highly focused on aligned incentives and durable deals. Collaborative management style that focuses on delighting the customer to build long term product line revenue and competitive advantage. Ability to prioritize within a spending envelope, lead or contribute to team development, and build credibility with thought leaders and partners. Experience in leading teams with and without direct authority. Passion for coaching and developing talented individuals achieve their career goals. \n \nBlue chip product management and business development experience in several market segments: IaaS, PaaS, enterprise productivity apps, application & WAN acceleration, enterprise networking (switch/route/wireless), and UX.  \n \nExpertise in enterprise and partner go to market (GTM) including sales enablement & training, product marketing programs, customer references, vertical strategies, and channels. \n \nStrong experience in user centered design (UCD), human centered design (HCD) and traditional primary market research. Expertise in prioritizing product roadmaps from 1-N making painful tradeoffs in both run rate and emerging markets. \n \nAbility and willingness to break through red tape to get the job done using an entrepreneurial spirit. Demonstrated passion for the voice of the customer and elimination of customer pain.  \n \nClosed partnership deals with projected revenue in the $B range. Integrative negotiator highly focused on aligned incentives and durable deals. Experience Platform Product Strategist - Google Apps for Work Google April 2015  – Present (5 months) Mountain View, CA Product Management and Business Development for Google for Work. I help Google and ISV partners build magical integrations. Responsible for identifying partners, defining ideal integrations, providing technical and UX guidance, and providing GTM support for ISVs. Prioritize and develop business case for API and extensibility features across the Google for Work suite: Gmail, Drive, Sheets, Slides, Docs, Search, Google+, Calendar, Hangouts, Vault, and Sites. Sr. Manager, Product Management & Business Development - Amazon WorkDocs Amazon Web Services July 2014  –  April 2015  (10 months) Palo Alto, CA AWS is the world leader in cloud computing. As customers ask us to move more of their business's workloads to the cloud we develop exciting applications that take advantage of AWS's infrastructure and platform offerings. Amazon WorkDocs is one such application. Amazon WorkDocs is a rapidly growing fully managed enterprise file sync and share (EFSS) platform and application that runs on AWS services. WorkDocs allows enterprise users to securely store files in the cloud, collaborate with each other, and share with users inside and outside of the company. Documents can be accessed via any device, anywhere, securely over the internet. \n \nResponsible for product roadmap, product strategy and planning, adjacencies, partner management, go to market, pricing, and sales enablement with particular focus on the enterprise marketplace.  \n \nExpanded product management team to increase quality and velocity. \nDeveloped platform strategy and pricing for strategic customers. \nSource, qualify and manage partnerships and corporate development/strategic options. \nBuilt vertical strategy around healthcare, retail, financial services and federal accounts. \nResponsible for global GTM strategy and management of execution team. \nContributed to integration between WorkDocs and WorkMail, the AWS email service. Sr. Product and Business Development Manager Cisco August 2013  –  July 2014  (1 year) San Jose, CA Responsible for business development and product management for Akamai Connect WAN optimization partnership from incubation to productization.  \n \nBuilt pipeline resulting in multi million dollar first quarter revenue. Wins at major retailers like Louis Vuitton, Bose and Target. \n \nAkamai Connect delivers the ability to leverage the internet as a business critical application delivery option and an alternative to MPLS. \n \nAkamai connect integrates optimization and acceleration technologies from Cisco and Akamai into the branch router, potentially reaching up to 85% of the world's branch offices. The solution includes: \n \n-Application visibility and routing \n-Application based Quality of Service \n-WAN Acceleration and Optimization \n-Transparent Caching for internet traffic \n-Connected Caching for content delivered by the Akamai Intelligent Platform \n-Content pre-positioning \n-Cloud based management Sr. Business Development Manager Cisco Systems December 2012  –  October 2013  (11 months) San Jose, CA Business development manager for Cisco's $150M Application Platforms: ISR/ASR Application Experience Routers, WAAS, Software Modules, and UCS-E. \n \nResponsible for: \n1) Leading a worldwide sales, marketing, product and technical team responsible for 50% YOY Application Platforms revenue growth \n2) Worldwide Application management (APM/NPM/ANPM) partnership ecosystem development and go to market for Cisco Application Visibility and Control (AVC) \n3) Investments, contract negotiation \n \n1) Revenue Growth: \n-Create strategy, and execute plan to drive 50% YOY revenue growth across Cisco's $150M Application Platforms \n-Build awareness across Cisco generalist sales organization  \n-Create and distribute field \"how to sell\" collateral \n-Engage and leverage Cisco central marketing for demand gen and awareness \n-Prioritize Cisco technical resources for whitepapers, solution guides \n \n2) Technology Partnerships & Ecosystem - Application Visibility and Control (AVC):  \n-Drove AVC support from 0% to 55% via application/network performance management partner ecosystem and prioritized engagements \n-Led a team responsible for joint-GTM with IBM, CA, Compuware, Actionpacked! Networks, Plixer International, Infovista, etc.  \n-Engaged in co-selling with top 30 Cisco global accounts  \n-Engagements at 50% of worldwide tier one service providers \n-Worldwide Cisco Sales and Channel Partner briefings, collateral, EBC, etc. \n-Briefed analysts on the convergence of APM and NPM technologies \n-Generated externally referenced wins to serve as lighthouse accounts \n-Using blogs, webinars and events generated >2,000 enterprise leads \n \n3) Investments, contract negotiation: \n-Completed $100M risk-reward deal redefining the makeup of a global Cisco business \n-Investigated and advised on NRE and Corp. Dev. opportunities with startups \n-Lead negotiator on C-Level relationship with direct competitor \n-Exited relationships when needed Senior Product Manager Cisco Systems September 2011  –  December 2012  (1 year 4 months) San Jose, CA Responsible for driving the network management strategy, Cloud/SaaS management strategy and planning for a $7B product family - Cisco Catalyst 2xxx, 3xxx, and 4xxx product lines. Successfully led software projects as differentiators for the Catalyst switching line. Developed roadmap and user stories & requirements by using Human Centered Design (HCD) and rigorous primary market research. Collaborated with the Cisco network management group to drive differentiation and customer adoption. Product Manager Cisco Systems August 2010  –  September 2011  (1 year 2 months) San Jose, CA Owned the network management strategy for the Cisco Catalyst 2960 and 3750 platforms including Cisco Prime Infrastructure and all of Cisco's free management tools. Successfully instrumented these toosl to provide realtime customer usage patterns on an at-will basis. Developed business case for cloud connected switching products. McCombs MBA ENHANCE program team leader Federal Bureau of Investigation - San Antonio Field Office 2009  –  September 2010  (1 year) San Antonio, Texas Area In conjunction with two teammates from the McCombs school of business at the University of Texas at Austin, performed a three month engagement to determine new recruiting strategies to attract critically skilled applicants for FBI special agent positions. Critical skills include engineering/sciences, and eastern languages. Digital circuit design (VLSI) IBM January 2002  –  June 2010  (8 years 6 months) Austin, Texas Area •\tDeveloped custom digital circuits for Sony and Microsoft game consoles, DARPA supercomputing project, and IBM leading edge chips  \n•\tSolved complex engineering problems often requiring invention \n•\tExcelled in a global virtual team, even while working on projects for direct competitors \n•\tFeatured in IEEE Hot Chips 20 conference & IBM Journal of R&D: PowerXCell 8i: A Cell broadband engine architecture for supercomputing applications  \n•\tProduced seven patents, several publications and 20 disclosures \n•\tWon two IBM patent value honors awards (top 10%) & IBM early tenure inventor award Head rowing coach University of Texas Crew August 2008  –  August 2009  (1 year 1 month) Austin, Texas Area •\tManaged eight coaches, 60-100 athletes and $250k budget, with racing success across USA \n•\tSuccessfully responded to 2008 financial crisis resulting in budget surplus \n•\tImplemented unique recruiting strategy securing competitive advantage Operations lead, advanced microprocessor development IBM June 2008  –  December 2008  (7 months) Performed expense analysis, tracking and audit for 250 full time employees covering $50M in development expense. Platform Product Strategist - Google Apps for Work Google April 2015  – Present (5 months) Mountain View, CA Product Management and Business Development for Google for Work. I help Google and ISV partners build magical integrations. Responsible for identifying partners, defining ideal integrations, providing technical and UX guidance, and providing GTM support for ISVs. Prioritize and develop business case for API and extensibility features across the Google for Work suite: Gmail, Drive, Sheets, Slides, Docs, Search, Google+, Calendar, Hangouts, Vault, and Sites. Platform Product Strategist - Google Apps for Work Google April 2015  – Present (5 months) Mountain View, CA Product Management and Business Development for Google for Work. I help Google and ISV partners build magical integrations. Responsible for identifying partners, defining ideal integrations, providing technical and UX guidance, and providing GTM support for ISVs. Prioritize and develop business case for API and extensibility features across the Google for Work suite: Gmail, Drive, Sheets, Slides, Docs, Search, Google+, Calendar, Hangouts, Vault, and Sites. Sr. Manager, Product Management & Business Development - Amazon WorkDocs Amazon Web Services July 2014  –  April 2015  (10 months) Palo Alto, CA AWS is the world leader in cloud computing. As customers ask us to move more of their business's workloads to the cloud we develop exciting applications that take advantage of AWS's infrastructure and platform offerings. Amazon WorkDocs is one such application. Amazon WorkDocs is a rapidly growing fully managed enterprise file sync and share (EFSS) platform and application that runs on AWS services. WorkDocs allows enterprise users to securely store files in the cloud, collaborate with each other, and share with users inside and outside of the company. Documents can be accessed via any device, anywhere, securely over the internet. \n \nResponsible for product roadmap, product strategy and planning, adjacencies, partner management, go to market, pricing, and sales enablement with particular focus on the enterprise marketplace.  \n \nExpanded product management team to increase quality and velocity. \nDeveloped platform strategy and pricing for strategic customers. \nSource, qualify and manage partnerships and corporate development/strategic options. \nBuilt vertical strategy around healthcare, retail, financial services and federal accounts. \nResponsible for global GTM strategy and management of execution team. \nContributed to integration between WorkDocs and WorkMail, the AWS email service. Sr. Manager, Product Management & Business Development - Amazon WorkDocs Amazon Web Services July 2014  –  April 2015  (10 months) Palo Alto, CA AWS is the world leader in cloud computing. As customers ask us to move more of their business's workloads to the cloud we develop exciting applications that take advantage of AWS's infrastructure and platform offerings. Amazon WorkDocs is one such application. Amazon WorkDocs is a rapidly growing fully managed enterprise file sync and share (EFSS) platform and application that runs on AWS services. WorkDocs allows enterprise users to securely store files in the cloud, collaborate with each other, and share with users inside and outside of the company. Documents can be accessed via any device, anywhere, securely over the internet. \n \nResponsible for product roadmap, product strategy and planning, adjacencies, partner management, go to market, pricing, and sales enablement with particular focus on the enterprise marketplace.  \n \nExpanded product management team to increase quality and velocity. \nDeveloped platform strategy and pricing for strategic customers. \nSource, qualify and manage partnerships and corporate development/strategic options. \nBuilt vertical strategy around healthcare, retail, financial services and federal accounts. \nResponsible for global GTM strategy and management of execution team. \nContributed to integration between WorkDocs and WorkMail, the AWS email service. Sr. Product and Business Development Manager Cisco August 2013  –  July 2014  (1 year) San Jose, CA Responsible for business development and product management for Akamai Connect WAN optimization partnership from incubation to productization.  \n \nBuilt pipeline resulting in multi million dollar first quarter revenue. Wins at major retailers like Louis Vuitton, Bose and Target. \n \nAkamai Connect delivers the ability to leverage the internet as a business critical application delivery option and an alternative to MPLS. \n \nAkamai connect integrates optimization and acceleration technologies from Cisco and Akamai into the branch router, potentially reaching up to 85% of the world's branch offices. The solution includes: \n \n-Application visibility and routing \n-Application based Quality of Service \n-WAN Acceleration and Optimization \n-Transparent Caching for internet traffic \n-Connected Caching for content delivered by the Akamai Intelligent Platform \n-Content pre-positioning \n-Cloud based management Sr. Product and Business Development Manager Cisco August 2013  –  July 2014  (1 year) San Jose, CA Responsible for business development and product management for Akamai Connect WAN optimization partnership from incubation to productization.  \n \nBuilt pipeline resulting in multi million dollar first quarter revenue. Wins at major retailers like Louis Vuitton, Bose and Target. \n \nAkamai Connect delivers the ability to leverage the internet as a business critical application delivery option and an alternative to MPLS. \n \nAkamai connect integrates optimization and acceleration technologies from Cisco and Akamai into the branch router, potentially reaching up to 85% of the world's branch offices. The solution includes: \n \n-Application visibility and routing \n-Application based Quality of Service \n-WAN Acceleration and Optimization \n-Transparent Caching for internet traffic \n-Connected Caching for content delivered by the Akamai Intelligent Platform \n-Content pre-positioning \n-Cloud based management Sr. Business Development Manager Cisco Systems December 2012  –  October 2013  (11 months) San Jose, CA Business development manager for Cisco's $150M Application Platforms: ISR/ASR Application Experience Routers, WAAS, Software Modules, and UCS-E. \n \nResponsible for: \n1) Leading a worldwide sales, marketing, product and technical team responsible for 50% YOY Application Platforms revenue growth \n2) Worldwide Application management (APM/NPM/ANPM) partnership ecosystem development and go to market for Cisco Application Visibility and Control (AVC) \n3) Investments, contract negotiation \n \n1) Revenue Growth: \n-Create strategy, and execute plan to drive 50% YOY revenue growth across Cisco's $150M Application Platforms \n-Build awareness across Cisco generalist sales organization  \n-Create and distribute field \"how to sell\" collateral \n-Engage and leverage Cisco central marketing for demand gen and awareness \n-Prioritize Cisco technical resources for whitepapers, solution guides \n \n2) Technology Partnerships & Ecosystem - Application Visibility and Control (AVC):  \n-Drove AVC support from 0% to 55% via application/network performance management partner ecosystem and prioritized engagements \n-Led a team responsible for joint-GTM with IBM, CA, Compuware, Actionpacked! Networks, Plixer International, Infovista, etc.  \n-Engaged in co-selling with top 30 Cisco global accounts  \n-Engagements at 50% of worldwide tier one service providers \n-Worldwide Cisco Sales and Channel Partner briefings, collateral, EBC, etc. \n-Briefed analysts on the convergence of APM and NPM technologies \n-Generated externally referenced wins to serve as lighthouse accounts \n-Using blogs, webinars and events generated >2,000 enterprise leads \n \n3) Investments, contract negotiation: \n-Completed $100M risk-reward deal redefining the makeup of a global Cisco business \n-Investigated and advised on NRE and Corp. Dev. opportunities with startups \n-Lead negotiator on C-Level relationship with direct competitor \n-Exited relationships when needed Sr. Business Development Manager Cisco Systems December 2012  –  October 2013  (11 months) San Jose, CA Business development manager for Cisco's $150M Application Platforms: ISR/ASR Application Experience Routers, WAAS, Software Modules, and UCS-E. \n \nResponsible for: \n1) Leading a worldwide sales, marketing, product and technical team responsible for 50% YOY Application Platforms revenue growth \n2) Worldwide Application management (APM/NPM/ANPM) partnership ecosystem development and go to market for Cisco Application Visibility and Control (AVC) \n3) Investments, contract negotiation \n \n1) Revenue Growth: \n-Create strategy, and execute plan to drive 50% YOY revenue growth across Cisco's $150M Application Platforms \n-Build awareness across Cisco generalist sales organization  \n-Create and distribute field \"how to sell\" collateral \n-Engage and leverage Cisco central marketing for demand gen and awareness \n-Prioritize Cisco technical resources for whitepapers, solution guides \n \n2) Technology Partnerships & Ecosystem - Application Visibility and Control (AVC):  \n-Drove AVC support from 0% to 55% via application/network performance management partner ecosystem and prioritized engagements \n-Led a team responsible for joint-GTM with IBM, CA, Compuware, Actionpacked! Networks, Plixer International, Infovista, etc.  \n-Engaged in co-selling with top 30 Cisco global accounts  \n-Engagements at 50% of worldwide tier one service providers \n-Worldwide Cisco Sales and Channel Partner briefings, collateral, EBC, etc. \n-Briefed analysts on the convergence of APM and NPM technologies \n-Generated externally referenced wins to serve as lighthouse accounts \n-Using blogs, webinars and events generated >2,000 enterprise leads \n \n3) Investments, contract negotiation: \n-Completed $100M risk-reward deal redefining the makeup of a global Cisco business \n-Investigated and advised on NRE and Corp. Dev. opportunities with startups \n-Lead negotiator on C-Level relationship with direct competitor \n-Exited relationships when needed Senior Product Manager Cisco Systems September 2011  –  December 2012  (1 year 4 months) San Jose, CA Responsible for driving the network management strategy, Cloud/SaaS management strategy and planning for a $7B product family - Cisco Catalyst 2xxx, 3xxx, and 4xxx product lines. Successfully led software projects as differentiators for the Catalyst switching line. Developed roadmap and user stories & requirements by using Human Centered Design (HCD) and rigorous primary market research. Collaborated with the Cisco network management group to drive differentiation and customer adoption. Senior Product Manager Cisco Systems September 2011  –  December 2012  (1 year 4 months) San Jose, CA Responsible for driving the network management strategy, Cloud/SaaS management strategy and planning for a $7B product family - Cisco Catalyst 2xxx, 3xxx, and 4xxx product lines. Successfully led software projects as differentiators for the Catalyst switching line. Developed roadmap and user stories & requirements by using Human Centered Design (HCD) and rigorous primary market research. Collaborated with the Cisco network management group to drive differentiation and customer adoption. Product Manager Cisco Systems August 2010  –  September 2011  (1 year 2 months) San Jose, CA Owned the network management strategy for the Cisco Catalyst 2960 and 3750 platforms including Cisco Prime Infrastructure and all of Cisco's free management tools. Successfully instrumented these toosl to provide realtime customer usage patterns on an at-will basis. Developed business case for cloud connected switching products. Product Manager Cisco Systems August 2010  –  September 2011  (1 year 2 months) San Jose, CA Owned the network management strategy for the Cisco Catalyst 2960 and 3750 platforms including Cisco Prime Infrastructure and all of Cisco's free management tools. Successfully instrumented these toosl to provide realtime customer usage patterns on an at-will basis. Developed business case for cloud connected switching products. McCombs MBA ENHANCE program team leader Federal Bureau of Investigation - San Antonio Field Office 2009  –  September 2010  (1 year) San Antonio, Texas Area In conjunction with two teammates from the McCombs school of business at the University of Texas at Austin, performed a three month engagement to determine new recruiting strategies to attract critically skilled applicants for FBI special agent positions. Critical skills include engineering/sciences, and eastern languages. McCombs MBA ENHANCE program team leader Federal Bureau of Investigation - San Antonio Field Office 2009  –  September 2010  (1 year) San Antonio, Texas Area In conjunction with two teammates from the McCombs school of business at the University of Texas at Austin, performed a three month engagement to determine new recruiting strategies to attract critically skilled applicants for FBI special agent positions. Critical skills include engineering/sciences, and eastern languages. Digital circuit design (VLSI) IBM January 2002  –  June 2010  (8 years 6 months) Austin, Texas Area •\tDeveloped custom digital circuits for Sony and Microsoft game consoles, DARPA supercomputing project, and IBM leading edge chips  \n•\tSolved complex engineering problems often requiring invention \n•\tExcelled in a global virtual team, even while working on projects for direct competitors \n•\tFeatured in IEEE Hot Chips 20 conference & IBM Journal of R&D: PowerXCell 8i: A Cell broadband engine architecture for supercomputing applications  \n•\tProduced seven patents, several publications and 20 disclosures \n•\tWon two IBM patent value honors awards (top 10%) & IBM early tenure inventor award Digital circuit design (VLSI) IBM January 2002  –  June 2010  (8 years 6 months) Austin, Texas Area •\tDeveloped custom digital circuits for Sony and Microsoft game consoles, DARPA supercomputing project, and IBM leading edge chips  \n•\tSolved complex engineering problems often requiring invention \n•\tExcelled in a global virtual team, even while working on projects for direct competitors \n•\tFeatured in IEEE Hot Chips 20 conference & IBM Journal of R&D: PowerXCell 8i: A Cell broadband engine architecture for supercomputing applications  \n•\tProduced seven patents, several publications and 20 disclosures \n•\tWon two IBM patent value honors awards (top 10%) & IBM early tenure inventor award Head rowing coach University of Texas Crew August 2008  –  August 2009  (1 year 1 month) Austin, Texas Area •\tManaged eight coaches, 60-100 athletes and $250k budget, with racing success across USA \n•\tSuccessfully responded to 2008 financial crisis resulting in budget surplus \n•\tImplemented unique recruiting strategy securing competitive advantage Head rowing coach University of Texas Crew August 2008  –  August 2009  (1 year 1 month) Austin, Texas Area •\tManaged eight coaches, 60-100 athletes and $250k budget, with racing success across USA \n•\tSuccessfully responded to 2008 financial crisis resulting in budget surplus \n•\tImplemented unique recruiting strategy securing competitive advantage Operations lead, advanced microprocessor development IBM June 2008  –  December 2008  (7 months) Performed expense analysis, tracking and audit for 250 full time employees covering $50M in development expense. Operations lead, advanced microprocessor development IBM June 2008  –  December 2008  (7 months) Performed expense analysis, tracking and audit for 250 full time employees covering $50M in development expense. Languages German German German Skills Cisco Catalyst Switches Agile Contract Negotiation Deal Structure Cloud Computing Network Management... Market Analysis Wireless Networking Wired Networking VLSI Financial Modeling Offshore Management Offshore Software... Strategic Partnerships Pricing Patentability Cisco Prime Cloud Software CiscoWorks Market Research Human Centered Design User Interface Design User Experience User-centered Design Internet of Everything Agile Methodologies Program Management SaaS Integration Competitive Analysis Business Development Product Marketing Product Management Go-to-market Strategy Enterprise Software Strategy Security Network Administration Cisco Technologies Management Demand Generation Sales Enablement Leadership Routing QoS Product Lifecycle... Cross-functional Team... Networking See 33+     See less Skills  Cisco Catalyst Switches Agile Contract Negotiation Deal Structure Cloud Computing Network Management... Market Analysis Wireless Networking Wired Networking VLSI Financial Modeling Offshore Management Offshore Software... Strategic Partnerships Pricing Patentability Cisco Prime Cloud Software CiscoWorks Market Research Human Centered Design User Interface Design User Experience User-centered Design Internet of Everything Agile Methodologies Program Management SaaS Integration Competitive Analysis Business Development Product Marketing Product Management Go-to-market Strategy Enterprise Software Strategy Security Network Administration Cisco Technologies Management Demand Generation Sales Enablement Leadership Routing QoS Product Lifecycle... Cross-functional Team... Networking See 33+     See less Cisco Catalyst Switches Agile Contract Negotiation Deal Structure Cloud Computing Network Management... Market Analysis Wireless Networking Wired Networking VLSI Financial Modeling Offshore Management Offshore Software... Strategic Partnerships Pricing Patentability Cisco Prime Cloud Software CiscoWorks Market Research Human Centered Design User Interface Design User Experience User-centered Design Internet of Everything Agile Methodologies Program Management SaaS Integration Competitive Analysis Business Development Product Marketing Product Management Go-to-market Strategy Enterprise Software Strategy Security Network Administration Cisco Technologies Management Demand Generation Sales Enablement Leadership Routing QoS Product Lifecycle... Cross-functional Team... Networking See 33+     See less Cisco Catalyst Switches Agile Contract Negotiation Deal Structure Cloud Computing Network Management... Market Analysis Wireless Networking Wired Networking VLSI Financial Modeling Offshore Management Offshore Software... Strategic Partnerships Pricing Patentability Cisco Prime Cloud Software CiscoWorks Market Research Human Centered Design User Interface Design User Experience User-centered Design Internet of Everything Agile Methodologies Program Management SaaS Integration Competitive Analysis Business Development Product Marketing Product Management Go-to-market Strategy Enterprise Software Strategy Security Network Administration Cisco Technologies Management Demand Generation Sales Enablement Leadership Routing QoS Product Lifecycle... Cross-functional Team... Networking See 33+     See less Education The University of Texas at Austin - The Red McCombs School of Business MBA,  General management 2008  – 2010 University of Michigan BSE,  Electrical Engineering 1997  – 2001 Won Arlen R. Helwarth award; highest undergraduate leadership award at Michigan Engineering Activities and Societies:  President of engineering student government ,  Michigan marching band The University of Texas at Austin - The Red McCombs School of Business MBA,  General management 2008  – 2010 The University of Texas at Austin - The Red McCombs School of Business MBA,  General management 2008  – 2010 The University of Texas at Austin - The Red McCombs School of Business MBA,  General management 2008  – 2010 University of Michigan BSE,  Electrical Engineering 1997  – 2001 Won Arlen R. Helwarth award; highest undergraduate leadership award at Michigan Engineering Activities and Societies:  President of engineering student government ,  Michigan marching band University of Michigan BSE,  Electrical Engineering 1997  – 2001 Won Arlen R. Helwarth award; highest undergraduate leadership award at Michigan Engineering Activities and Societies:  President of engineering student government ,  Michigan marching band University of Michigan BSE,  Electrical Engineering 1997  – 2001 Won Arlen R. Helwarth award; highest undergraduate leadership award at Michigan Engineering Activities and Societies:  President of engineering student government ,  Michigan marching band Honors & Awards ", "Languages English, Hindi, Punjabi, Japanese English, Hindi, Punjabi, Japanese English, Hindi, Punjabi, Japanese Skills Software Project... Requirements Analysis Agile Methodologies Cloud Computing Cross-functional Team... Product Development Market Research SDLC Program Management Business Analysis Business Intelligence Product Management Team Management Software Development Testing Security See 1+     See less Skills  Software Project... Requirements Analysis Agile Methodologies Cloud Computing Cross-functional Team... Product Development Market Research SDLC Program Management Business Analysis Business Intelligence Product Management Team Management Software Development Testing Security See 1+     See less Software Project... Requirements Analysis Agile Methodologies Cloud Computing Cross-functional Team... Product Development Market Research SDLC Program Management Business Analysis Business Intelligence Product Management Team Management Software Development Testing Security See 1+     See less Software Project... Requirements Analysis Agile Methodologies Cloud Computing Cross-functional Team... Product Development Market Research SDLC Program Management Business Analysis Business Intelligence Product Management Team Management Software Development Testing Security See 1+     See less "]}