{"position": "Hardware Engineer", "company": "Google", "profiles": ["Summary Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Summary Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Experience Hardware Engineer Google June 2013  – Present (2 years 3 months) Mountain View, CA Designing systems to support Google's mission to organize the world's information and make it universally accessible and useful. Graduate Research Assistant University of California at San Diego September 2010  –  June 2013  (2 years 10 months) Validating NAND flash memory power and latency models for SLC and MLC chips. Discovering and exploiting flash memory characteristics to improve solid-state disk performance. Developing an improved flash memory test bench for further research opportunities. Designing a high-performance flash controller for use in embedded systems and large storage arrays. Platforms Engineering Intern Google June 2011  –  September 2011  (4 months) Mountain View, CA Extended functionality of built-in self-test module for on-board DRAM. Developed, validated, and verified an SMBus slave module for host communication. Added support for CRC calculation in a high-performance storage system. Optimizations to storage system improved throughput by up to 3.72%. Student Technical Assistant MIT Lincoln Laboratory March 2010  –  August 2010  (6 months) Developed high-performance and customizable digital signal processing algorithms for FPGAs. Designed software tools to allow easy customization and generation of hardware implementations. Project Coordinator The Church of Jesus Christ of Latter-day Saints January 2010  –  February 2010  (2 months) Assisted Project Managers in working directly with customers in identifying requirements and setting expectations to maintain a high level of customer trust and confidence. Tracked and reported on project schedule, scope and budget aspects. Built and maintained project and operational reports. Teaching Assistant Brigham Young University November 2009  –  December 2009  (2 months) Updated and defined interface for operating system design class project. Designing operating system to mirror true functionality, including separation of kernel and user modes. Developing reference solution for test benches. Hardware Engineer Intern National Instruments June 2009  –  August 2009  (3 months) Received own assignment to design an in-house circuit board used to test PXI-Express signals. Generated, proposed, and selected concept alternatives. Performed research on alternative parts including meeting with representatives from major chip manufacturers. Designed board using Computer-Aided Design schematic tool. Assisted Layout Engineer with board stack-up, placement, and routing. Verified functionality of another board through comprehensive signal integrity tests. Repair Technician Vantage Controls January 2008  –  August 2008  (8 months) Diagnosed damaged circuit boards by reading schematics and testing. Repaired damaged circuit boards through part replacement and soldering. Wrote and compiled comprehensive board testing and repair manuals. Research Assistant Brigham Young University November 2006  –  October 2007  (1 year) Research Assistant – Brigham Young University, Chemistry Dept. \nPerformed simulations and testing of Virtual ChemLab and Virtual Physical Science, a virtual laboratory software tools developed by Dr. Brian Woodfield at BYU to assist students in laboratory experience. Wrote comprehensive help files and manuals for Virtual ChemLab and Virtual Physical Science Hardware Engineer Google June 2013  – Present (2 years 3 months) Mountain View, CA Designing systems to support Google's mission to organize the world's information and make it universally accessible and useful. Hardware Engineer Google June 2013  – Present (2 years 3 months) Mountain View, CA Designing systems to support Google's mission to organize the world's information and make it universally accessible and useful. Graduate Research Assistant University of California at San Diego September 2010  –  June 2013  (2 years 10 months) Validating NAND flash memory power and latency models for SLC and MLC chips. Discovering and exploiting flash memory characteristics to improve solid-state disk performance. Developing an improved flash memory test bench for further research opportunities. Designing a high-performance flash controller for use in embedded systems and large storage arrays. Graduate Research Assistant University of California at San Diego September 2010  –  June 2013  (2 years 10 months) Validating NAND flash memory power and latency models for SLC and MLC chips. Discovering and exploiting flash memory characteristics to improve solid-state disk performance. Developing an improved flash memory test bench for further research opportunities. Designing a high-performance flash controller for use in embedded systems and large storage arrays. Platforms Engineering Intern Google June 2011  –  September 2011  (4 months) Mountain View, CA Extended functionality of built-in self-test module for on-board DRAM. Developed, validated, and verified an SMBus slave module for host communication. Added support for CRC calculation in a high-performance storage system. Optimizations to storage system improved throughput by up to 3.72%. Platforms Engineering Intern Google June 2011  –  September 2011  (4 months) Mountain View, CA Extended functionality of built-in self-test module for on-board DRAM. Developed, validated, and verified an SMBus slave module for host communication. Added support for CRC calculation in a high-performance storage system. Optimizations to storage system improved throughput by up to 3.72%. Student Technical Assistant MIT Lincoln Laboratory March 2010  –  August 2010  (6 months) Developed high-performance and customizable digital signal processing algorithms for FPGAs. Designed software tools to allow easy customization and generation of hardware implementations. Student Technical Assistant MIT Lincoln Laboratory March 2010  –  August 2010  (6 months) Developed high-performance and customizable digital signal processing algorithms for FPGAs. Designed software tools to allow easy customization and generation of hardware implementations. Project Coordinator The Church of Jesus Christ of Latter-day Saints January 2010  –  February 2010  (2 months) Assisted Project Managers in working directly with customers in identifying requirements and setting expectations to maintain a high level of customer trust and confidence. Tracked and reported on project schedule, scope and budget aspects. Built and maintained project and operational reports. Project Coordinator The Church of Jesus Christ of Latter-day Saints January 2010  –  February 2010  (2 months) Assisted Project Managers in working directly with customers in identifying requirements and setting expectations to maintain a high level of customer trust and confidence. Tracked and reported on project schedule, scope and budget aspects. Built and maintained project and operational reports. Teaching Assistant Brigham Young University November 2009  –  December 2009  (2 months) Updated and defined interface for operating system design class project. Designing operating system to mirror true functionality, including separation of kernel and user modes. Developing reference solution for test benches. Teaching Assistant Brigham Young University November 2009  –  December 2009  (2 months) Updated and defined interface for operating system design class project. Designing operating system to mirror true functionality, including separation of kernel and user modes. Developing reference solution for test benches. Hardware Engineer Intern National Instruments June 2009  –  August 2009  (3 months) Received own assignment to design an in-house circuit board used to test PXI-Express signals. Generated, proposed, and selected concept alternatives. Performed research on alternative parts including meeting with representatives from major chip manufacturers. Designed board using Computer-Aided Design schematic tool. Assisted Layout Engineer with board stack-up, placement, and routing. Verified functionality of another board through comprehensive signal integrity tests. Hardware Engineer Intern National Instruments June 2009  –  August 2009  (3 months) Received own assignment to design an in-house circuit board used to test PXI-Express signals. Generated, proposed, and selected concept alternatives. Performed research on alternative parts including meeting with representatives from major chip manufacturers. Designed board using Computer-Aided Design schematic tool. Assisted Layout Engineer with board stack-up, placement, and routing. Verified functionality of another board through comprehensive signal integrity tests. Repair Technician Vantage Controls January 2008  –  August 2008  (8 months) Diagnosed damaged circuit boards by reading schematics and testing. Repaired damaged circuit boards through part replacement and soldering. Wrote and compiled comprehensive board testing and repair manuals. Repair Technician Vantage Controls January 2008  –  August 2008  (8 months) Diagnosed damaged circuit boards by reading schematics and testing. Repaired damaged circuit boards through part replacement and soldering. Wrote and compiled comprehensive board testing and repair manuals. Research Assistant Brigham Young University November 2006  –  October 2007  (1 year) Research Assistant – Brigham Young University, Chemistry Dept. \nPerformed simulations and testing of Virtual ChemLab and Virtual Physical Science, a virtual laboratory software tools developed by Dr. Brian Woodfield at BYU to assist students in laboratory experience. Wrote comprehensive help files and manuals for Virtual ChemLab and Virtual Physical Science Research Assistant Brigham Young University November 2006  –  October 2007  (1 year) Research Assistant – Brigham Young University, Chemistry Dept. \nPerformed simulations and testing of Virtual ChemLab and Virtual Physical Science, a virtual laboratory software tools developed by Dr. Brian Woodfield at BYU to assist students in laboratory experience. Wrote comprehensive help files and manuals for Virtual ChemLab and Virtual Physical Science Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Digital System Design Computer Architecture FPGA prototyping Verilog VHDL Xilinx ISE Altera Quartus NAND Flash Flash Drives C C++ UVM SystemVerilog Digital IC Design Static Timing Analysis Embedded Systems ARM Cortex-M3 Vim NCSim Eagle Scout Programming FPGA Simulations See 8+     See less Skills  Digital System Design Computer Architecture FPGA prototyping Verilog VHDL Xilinx ISE Altera Quartus NAND Flash Flash Drives C C++ UVM SystemVerilog Digital IC Design Static Timing Analysis Embedded Systems ARM Cortex-M3 Vim NCSim Eagle Scout Programming FPGA Simulations See 8+     See less Digital System Design Computer Architecture FPGA prototyping Verilog VHDL Xilinx ISE Altera Quartus NAND Flash Flash Drives C C++ UVM SystemVerilog Digital IC Design Static Timing Analysis Embedded Systems ARM Cortex-M3 Vim NCSim Eagle Scout Programming FPGA Simulations See 8+     See less Digital System Design Computer Architecture FPGA prototyping Verilog VHDL Xilinx ISE Altera Quartus NAND Flash Flash Drives C C++ UVM SystemVerilog Digital IC Design Static Timing Analysis Embedded Systems ARM Cortex-M3 Vim NCSim Eagle Scout Programming FPGA Simulations See 8+     See less Education University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key Honors & Awards ", "Summary - Hardware design leader/engineer with twenty years of proven track record in circuit board and system level hardware design \n- Expert in LTE, CDMA, WiMAX base station, design and development \n- Hands on expertise with analog, very high speed digital, FPGA and electrical hardware logic design \n- Experienced in complete product design from conception to delivery that includes, design, development, test, DFT, DFM, and manufacturing \n- Designed the first Enterprise Femtocell product that was delivered and deployed in Sprint Network Summary - Hardware design leader/engineer with twenty years of proven track record in circuit board and system level hardware design \n- Expert in LTE, CDMA, WiMAX base station, design and development \n- Hands on expertise with analog, very high speed digital, FPGA and electrical hardware logic design \n- Experienced in complete product design from conception to delivery that includes, design, development, test, DFT, DFM, and manufacturing \n- Designed the first Enterprise Femtocell product that was delivered and deployed in Sprint Network - Hardware design leader/engineer with twenty years of proven track record in circuit board and system level hardware design \n- Expert in LTE, CDMA, WiMAX base station, design and development \n- Hands on expertise with analog, very high speed digital, FPGA and electrical hardware logic design \n- Experienced in complete product design from conception to delivery that includes, design, development, test, DFT, DFM, and manufacturing \n- Designed the first Enterprise Femtocell product that was delivered and deployed in Sprint Network - Hardware design leader/engineer with twenty years of proven track record in circuit board and system level hardware design \n- Expert in LTE, CDMA, WiMAX base station, design and development \n- Hands on expertise with analog, very high speed digital, FPGA and electrical hardware logic design \n- Experienced in complete product design from conception to delivery that includes, design, development, test, DFT, DFM, and manufacturing \n- Designed the first Enterprise Femtocell product that was delivered and deployed in Sprint Network Experience Hardware Engineer Adecco at Google September 2014  – Present (1 year) Mountain View, CA • Perform measurements of devices, operate test equipment, run scripts, collect and organize data. \n• Write automation scripts as needed for testing support or equipment operation using Python. \n• Designing voltage and current source and measurement unit to test devices down to pico-ampere level. Sr. Hardware Engineer Ubee-AirWalk February 2012  –  February 2014  (2 years 1 month) Richardson, TX Responsible for hardware product development of 3G/4G (LTE)/Wi-Fi small cell wireless products  \n• Design and develop the Consumer FEMTO hardware for CDMA and LTE Small Cell product to comply with 3GPP, 3GPP2, other industry standards and regulations using Qualcomm CDMA, Qualcomm Atheros, TI and Broadcom chipset solutions performing circuit, thermal design, digital and RF signal integrity in CDMA, LTE and WIFI technologies \n• Support and test CDMA Enterprise FEMTO units RMA and various site issues \n• Manage and supervise a hardware team for the product development Sr. Hardware Engineer AirWalk Communications November 2009  –  February 2012  (2 years 4 months) Richardson, TX • Led, designed and developed CDMA Enterprise FEMTO and Pico base station hardware platform from conceptual design to site deployment stage in full production cycle using Freescale PowerPC for host processor and backhaul interface, Qualcomm CSM5025, CSM6825 and TI DSP TMS320TCI6482 for CDMA 1xRTT and EV-DO processing, Xilinx Spartan FPGA for base band signal processing, Lime microsystems LMS6002D for RF transceiver, and additional RF power amplifier. \n• Performed circuit board design, FPGA logic development and system level integration \n• Supported Enterprise FEMTO with testing, RMA, site and field supporting Principal Design Engineer Juni America April 2009  –  November 2009  (8 months) Seattle, WA Designed and Developed WiMAX Femtocell, Picocell system, board hardware and FPGA logic from conceptual design to product release stage. Principal Design Engineer Springfield Electronic Design July 2008  –  March 2009  (9 months) Fremont, CA Designed 10G Ethernet Switch board in part selection and schematic drawing with Broadcom 10G switch, Cavium Octeon network processor, Xilinx Virtex-5 FPGA and DDR2 memory using SFP, XFP Modules, XFI, XAUI, SerDes interfaces and PCI Express. Sr. Staff Engineer URI Tech June 2007  –  June 2008  (1 year 1 month) San Jose, CA Designed a wireless ASIC emulation board Sr. Hardware Engineer Posdata America September 2004  –  May 2007  (2 years 9 months) Santa Clara, CA Designed WiMax MODEM FPGA, board and system hardware Principal Engineer AirWalk Communications October 2002  –  August 2004  (1 year 11 months) Richardson, TX Designed CDMA wireless base station circuit board and system Hardware Staff Engineer Unicess Networks February 2001  –  September 2002  (1 year 8 months) Richardson, TX xDSL FPGA, board and system design and development Sr. Hardware Engineer Samsung Electronics January 1989  –  June 2000  (11 years 6 months) Seoul, Korea - Designed and developed CDMA MODEM board and system, ATM Switch System and PSTN Hardware Engineer Adecco at Google September 2014  – Present (1 year) Mountain View, CA • Perform measurements of devices, operate test equipment, run scripts, collect and organize data. \n• Write automation scripts as needed for testing support or equipment operation using Python. \n• Designing voltage and current source and measurement unit to test devices down to pico-ampere level. Hardware Engineer Adecco at Google September 2014  – Present (1 year) Mountain View, CA • Perform measurements of devices, operate test equipment, run scripts, collect and organize data. \n• Write automation scripts as needed for testing support or equipment operation using Python. \n• Designing voltage and current source and measurement unit to test devices down to pico-ampere level. Sr. Hardware Engineer Ubee-AirWalk February 2012  –  February 2014  (2 years 1 month) Richardson, TX Responsible for hardware product development of 3G/4G (LTE)/Wi-Fi small cell wireless products  \n• Design and develop the Consumer FEMTO hardware for CDMA and LTE Small Cell product to comply with 3GPP, 3GPP2, other industry standards and regulations using Qualcomm CDMA, Qualcomm Atheros, TI and Broadcom chipset solutions performing circuit, thermal design, digital and RF signal integrity in CDMA, LTE and WIFI technologies \n• Support and test CDMA Enterprise FEMTO units RMA and various site issues \n• Manage and supervise a hardware team for the product development Sr. Hardware Engineer Ubee-AirWalk February 2012  –  February 2014  (2 years 1 month) Richardson, TX Responsible for hardware product development of 3G/4G (LTE)/Wi-Fi small cell wireless products  \n• Design and develop the Consumer FEMTO hardware for CDMA and LTE Small Cell product to comply with 3GPP, 3GPP2, other industry standards and regulations using Qualcomm CDMA, Qualcomm Atheros, TI and Broadcom chipset solutions performing circuit, thermal design, digital and RF signal integrity in CDMA, LTE and WIFI technologies \n• Support and test CDMA Enterprise FEMTO units RMA and various site issues \n• Manage and supervise a hardware team for the product development Sr. Hardware Engineer AirWalk Communications November 2009  –  February 2012  (2 years 4 months) Richardson, TX • Led, designed and developed CDMA Enterprise FEMTO and Pico base station hardware platform from conceptual design to site deployment stage in full production cycle using Freescale PowerPC for host processor and backhaul interface, Qualcomm CSM5025, CSM6825 and TI DSP TMS320TCI6482 for CDMA 1xRTT and EV-DO processing, Xilinx Spartan FPGA for base band signal processing, Lime microsystems LMS6002D for RF transceiver, and additional RF power amplifier. \n• Performed circuit board design, FPGA logic development and system level integration \n• Supported Enterprise FEMTO with testing, RMA, site and field supporting Sr. Hardware Engineer AirWalk Communications November 2009  –  February 2012  (2 years 4 months) Richardson, TX • Led, designed and developed CDMA Enterprise FEMTO and Pico base station hardware platform from conceptual design to site deployment stage in full production cycle using Freescale PowerPC for host processor and backhaul interface, Qualcomm CSM5025, CSM6825 and TI DSP TMS320TCI6482 for CDMA 1xRTT and EV-DO processing, Xilinx Spartan FPGA for base band signal processing, Lime microsystems LMS6002D for RF transceiver, and additional RF power amplifier. \n• Performed circuit board design, FPGA logic development and system level integration \n• Supported Enterprise FEMTO with testing, RMA, site and field supporting Principal Design Engineer Juni America April 2009  –  November 2009  (8 months) Seattle, WA Designed and Developed WiMAX Femtocell, Picocell system, board hardware and FPGA logic from conceptual design to product release stage. Principal Design Engineer Juni America April 2009  –  November 2009  (8 months) Seattle, WA Designed and Developed WiMAX Femtocell, Picocell system, board hardware and FPGA logic from conceptual design to product release stage. Principal Design Engineer Springfield Electronic Design July 2008  –  March 2009  (9 months) Fremont, CA Designed 10G Ethernet Switch board in part selection and schematic drawing with Broadcom 10G switch, Cavium Octeon network processor, Xilinx Virtex-5 FPGA and DDR2 memory using SFP, XFP Modules, XFI, XAUI, SerDes interfaces and PCI Express. Principal Design Engineer Springfield Electronic Design July 2008  –  March 2009  (9 months) Fremont, CA Designed 10G Ethernet Switch board in part selection and schematic drawing with Broadcom 10G switch, Cavium Octeon network processor, Xilinx Virtex-5 FPGA and DDR2 memory using SFP, XFP Modules, XFI, XAUI, SerDes interfaces and PCI Express. Sr. Staff Engineer URI Tech June 2007  –  June 2008  (1 year 1 month) San Jose, CA Designed a wireless ASIC emulation board Sr. Staff Engineer URI Tech June 2007  –  June 2008  (1 year 1 month) San Jose, CA Designed a wireless ASIC emulation board Sr. Hardware Engineer Posdata America September 2004  –  May 2007  (2 years 9 months) Santa Clara, CA Designed WiMax MODEM FPGA, board and system hardware Sr. Hardware Engineer Posdata America September 2004  –  May 2007  (2 years 9 months) Santa Clara, CA Designed WiMax MODEM FPGA, board and system hardware Principal Engineer AirWalk Communications October 2002  –  August 2004  (1 year 11 months) Richardson, TX Designed CDMA wireless base station circuit board and system Principal Engineer AirWalk Communications October 2002  –  August 2004  (1 year 11 months) Richardson, TX Designed CDMA wireless base station circuit board and system Hardware Staff Engineer Unicess Networks February 2001  –  September 2002  (1 year 8 months) Richardson, TX xDSL FPGA, board and system design and development Hardware Staff Engineer Unicess Networks February 2001  –  September 2002  (1 year 8 months) Richardson, TX xDSL FPGA, board and system design and development Sr. Hardware Engineer Samsung Electronics January 1989  –  June 2000  (11 years 6 months) Seoul, Korea - Designed and developed CDMA MODEM board and system, ATM Switch System and PSTN Sr. Hardware Engineer Samsung Electronics January 1989  –  June 2000  (11 years 6 months) Seoul, Korea - Designed and developed CDMA MODEM board and system, ATM Switch System and PSTN Languages Engilish Korean Engilish Korean Engilish Korean Skills Electronics Hardware... High speed digital... Analog Circuit Design PCB design FPGA Xilinx Embedded Systems Wireless LTE ASIC WiMAX WiFi Ethernet CDMA Telecommunications Wireless Networking Microprocessors Microcontrollers Hardware See 4+     See less Skills  Electronics Hardware... High speed digital... Analog Circuit Design PCB design FPGA Xilinx Embedded Systems Wireless LTE ASIC WiMAX WiFi Ethernet CDMA Telecommunications Wireless Networking Microprocessors Microcontrollers Hardware See 4+     See less Electronics Hardware... High speed digital... Analog Circuit Design PCB design FPGA Xilinx Embedded Systems Wireless LTE ASIC WiMAX WiFi Ethernet CDMA Telecommunications Wireless Networking Microprocessors Microcontrollers Hardware See 4+     See less Electronics Hardware... High speed digital... Analog Circuit Design PCB design FPGA Xilinx Embedded Systems Wireless LTE ASIC WiMAX WiFi Ethernet CDMA Telecommunications Wireless Networking Microprocessors Microcontrollers Hardware See 4+     See less Education Sogang University Bachelor of Science (BS),  Electrical Engineering 1985  – 1989 Activities and Societies:  Basketball Team Sogang University Bachelor of Science (BS),  Electrical Engineering 1985  – 1989 Activities and Societies:  Basketball Team Sogang University Bachelor of Science (BS),  Electrical Engineering 1985  – 1989 Activities and Societies:  Basketball Team Sogang University Bachelor of Science (BS),  Electrical Engineering 1985  – 1989 Activities and Societies:  Basketball Team ", "Experience Hardware Engineer Google August 2014  – Present (1 year 1 month) Portland, Oregon Area Senior Platform Engineer NVIDIA June 2010  –  May 2014  (4 years) Beaverton, OR Platform Engineering Manager NVIDIA July 2006  –  June 2010  (4 years) Beaverton, OR Senior Platform Engineer NVIDIA July 2001  –  July 2006  (5 years 1 month) Beaverton, OR Lead Hardware Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Hillsboro, OR Staff Hardware Engineer Intel Corporation January 1998  –  January 2000  (2 years 1 month) Hillsboro, OR Hardware Engineer Intel Corporation May 1995  –  January 1998  (2 years 9 months) Hillsboro, OR Hardware Engineer Google August 2014  – Present (1 year 1 month) Portland, Oregon Area Hardware Engineer Google August 2014  – Present (1 year 1 month) Portland, Oregon Area Senior Platform Engineer NVIDIA June 2010  –  May 2014  (4 years) Beaverton, OR Senior Platform Engineer NVIDIA June 2010  –  May 2014  (4 years) Beaverton, OR Platform Engineering Manager NVIDIA July 2006  –  June 2010  (4 years) Beaverton, OR Platform Engineering Manager NVIDIA July 2006  –  June 2010  (4 years) Beaverton, OR Senior Platform Engineer NVIDIA July 2001  –  July 2006  (5 years 1 month) Beaverton, OR Senior Platform Engineer NVIDIA July 2001  –  July 2006  (5 years 1 month) Beaverton, OR Lead Hardware Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Hillsboro, OR Lead Hardware Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Hillsboro, OR Staff Hardware Engineer Intel Corporation January 1998  –  January 2000  (2 years 1 month) Hillsboro, OR Staff Hardware Engineer Intel Corporation January 1998  –  January 2000  (2 years 1 month) Hillsboro, OR Hardware Engineer Intel Corporation May 1995  –  January 1998  (2 years 9 months) Hillsboro, OR Hardware Engineer Intel Corporation May 1995  –  January 1998  (2 years 9 months) Hillsboro, OR Skills Processors ASIC Debugging Hardware Computer Architecture PCIe SoC Signal Integrity Hardware Architecture ARM Microprocessors USB X86 PCB design Skills  Processors ASIC Debugging Hardware Computer Architecture PCIe SoC Signal Integrity Hardware Architecture ARM Microprocessors USB X86 PCB design Processors ASIC Debugging Hardware Computer Architecture PCIe SoC Signal Integrity Hardware Architecture ARM Microprocessors USB X86 PCB design Processors ASIC Debugging Hardware Computer Architecture PCIe SoC Signal Integrity Hardware Architecture ARM Microprocessors USB X86 PCB design Education University of Portland BSEE University of Portland BSEE University of Portland BSEE University of Portland BSEE ", "Summary Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Summary Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Experience Staff Hardware Engineer Google November 2010  – Present (4 years 10 months) Mountain View, California Staff Hardware Engineer Google November 2010  – Present (4 years 10 months) Mountain View, California Staff Hardware Engineer Google November 2010  – Present (4 years 10 months) Mountain View, California Languages English Mandarin Hokkien Malay Cantonese Teochew English Mandarin Hokkien Malay Cantonese Teochew English Mandarin Hokkien Malay Cantonese Teochew Skills Audio hardware Embedded Systems Audio Engineering EMC design System Architecture Vendor Relationships Floorplanning Debugging Consumer Electronics Hardware Architecture Digital Signal... Semiconductors Electronics Hardware Sound PCB design Testing Engineering Cross-functional Team... Integration Analog RF Processors ARM ASIC FPGA System Design Embedded Software SoC Manufacturing PCB Design Systems Design See 17+     See less Skills  Audio hardware Embedded Systems Audio Engineering EMC design System Architecture Vendor Relationships Floorplanning Debugging Consumer Electronics Hardware Architecture Digital Signal... Semiconductors Electronics Hardware Sound PCB design Testing Engineering Cross-functional Team... Integration Analog RF Processors ARM ASIC FPGA System Design Embedded Software SoC Manufacturing PCB Design Systems Design See 17+     See less Audio hardware Embedded Systems Audio Engineering EMC design System Architecture Vendor Relationships Floorplanning Debugging Consumer Electronics Hardware Architecture Digital Signal... Semiconductors Electronics Hardware Sound PCB design Testing Engineering Cross-functional Team... Integration Analog RF Processors ARM ASIC FPGA System Design Embedded Software SoC Manufacturing PCB Design Systems Design See 17+     See less Audio hardware Embedded Systems Audio Engineering EMC design System Architecture Vendor Relationships Floorplanning Debugging Consumer Electronics Hardware Architecture Digital Signal... Semiconductors Electronics Hardware Sound PCB design Testing Engineering Cross-functional Team... Integration Analog RF Processors ARM ASIC FPGA System Design Embedded Software SoC Manufacturing PCB Design Systems Design See 17+     See less ", "Summary A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design Summary A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design Experience Senior Hardware Engineer Google October 2012  – Present (2 years 11 months) Manager, Hardware Engineering Cisco Systems December 2010  –  September 2012  (1 year 10 months) Responsible for development and sustaining activities for all of the Media Experience and Analytics Business Unit’s hardware deliverables, including the MXE-5600 modular chassis platform and multiple Intel-based appliance platforms. Technical Leader, Hardware Engineering Cisco Systems January 2008  –  December 2010  (3 years) Joined small startup-like Business Unit to architect, design and deliver the new MXE-5600 Media Processing Platform. Principal Hardware Engineer Ditech Networks / Altamar Networks August 2000  –  January 2008  (7 years 6 months) Adaptable team member serving, as needed, the roles of project manager, architect and board designer. Senior Hardware Engineer Atmosphere Networks March 1999  –  July 2000  (1 year 5 months) Quickly became a valuable contributor to an international hardware development team. Senior Research & Development Engineer Space Systems / Loral October 1993  –  March 1999  (5 years 6 months) Rapidly promoted to position of responsibility for the specification, design, and testing of digital circuits for use in satellite processor subsystems. Senior Hardware Engineer Google October 2012  – Present (2 years 11 months) Senior Hardware Engineer Google October 2012  – Present (2 years 11 months) Manager, Hardware Engineering Cisco Systems December 2010  –  September 2012  (1 year 10 months) Responsible for development and sustaining activities for all of the Media Experience and Analytics Business Unit’s hardware deliverables, including the MXE-5600 modular chassis platform and multiple Intel-based appliance platforms. Manager, Hardware Engineering Cisco Systems December 2010  –  September 2012  (1 year 10 months) Responsible for development and sustaining activities for all of the Media Experience and Analytics Business Unit’s hardware deliverables, including the MXE-5600 modular chassis platform and multiple Intel-based appliance platforms. Technical Leader, Hardware Engineering Cisco Systems January 2008  –  December 2010  (3 years) Joined small startup-like Business Unit to architect, design and deliver the new MXE-5600 Media Processing Platform. Technical Leader, Hardware Engineering Cisco Systems January 2008  –  December 2010  (3 years) Joined small startup-like Business Unit to architect, design and deliver the new MXE-5600 Media Processing Platform. Principal Hardware Engineer Ditech Networks / Altamar Networks August 2000  –  January 2008  (7 years 6 months) Adaptable team member serving, as needed, the roles of project manager, architect and board designer. Principal Hardware Engineer Ditech Networks / Altamar Networks August 2000  –  January 2008  (7 years 6 months) Adaptable team member serving, as needed, the roles of project manager, architect and board designer. Senior Hardware Engineer Atmosphere Networks March 1999  –  July 2000  (1 year 5 months) Quickly became a valuable contributor to an international hardware development team. Senior Hardware Engineer Atmosphere Networks March 1999  –  July 2000  (1 year 5 months) Quickly became a valuable contributor to an international hardware development team. Senior Research & Development Engineer Space Systems / Loral October 1993  –  March 1999  (5 years 6 months) Rapidly promoted to position of responsibility for the specification, design, and testing of digital circuits for use in satellite processor subsystems. Senior Research & Development Engineer Space Systems / Loral October 1993  –  March 1999  (5 years 6 months) Rapidly promoted to position of responsibility for the specification, design, and testing of digital circuits for use in satellite processor subsystems. Skills Ethernet Embedded Systems Firmware FPGA Telecommunications Digital Signal... Perl TCP/IP Hardware TCL VoIP Product Development Switches ATM networks ATCA AMC PCB design Signal Integrity Offshore Outsourcing Video Conferencing Technical Leadership Engineering Management Embedded Software System Architecture Hardware Architecture See 10+     See less Skills  Ethernet Embedded Systems Firmware FPGA Telecommunications Digital Signal... Perl TCP/IP Hardware TCL VoIP Product Development Switches ATM networks ATCA AMC PCB design Signal Integrity Offshore Outsourcing Video Conferencing Technical Leadership Engineering Management Embedded Software System Architecture Hardware Architecture See 10+     See less Ethernet Embedded Systems Firmware FPGA Telecommunications Digital Signal... Perl TCP/IP Hardware TCL VoIP Product Development Switches ATM networks ATCA AMC PCB design Signal Integrity Offshore Outsourcing Video Conferencing Technical Leadership Engineering Management Embedded Software System Architecture Hardware Architecture See 10+     See less Ethernet Embedded Systems Firmware FPGA Telecommunications Digital Signal... Perl TCP/IP Hardware TCL VoIP Product Development Switches ATM networks ATCA AMC PCB design Signal Integrity Offshore Outsourcing Video Conferencing Technical Leadership Engineering Management Embedded Software System Architecture Hardware Architecture See 10+     See less Education California Polytechnic State University-San Luis Obispo BSEE Santa Clara University MSEE California Polytechnic State University-San Luis Obispo BSEE California Polytechnic State University-San Luis Obispo BSEE California Polytechnic State University-San Luis Obispo BSEE Santa Clara University MSEE Santa Clara University MSEE Santa Clara University MSEE ", "Experience Hardware Engineer Google February 2014  – Present (1 year 7 months) Hardware Engineer Intel Corporation May 2012  –  February 2014  (1 year 10 months) Hardware Engineer Cray Inc. November 2008  –  May 2012  (3 years 7 months) Austin, Texas Area MTS Design Engineer Advanced Micro Devices November 2005  –  November 2008  (3 years 1 month) Hardware Engineer Cray Inc. February 1999  –  October 2005  (6 years 9 months) Hardware Engineer Google February 2014  – Present (1 year 7 months) Hardware Engineer Google February 2014  – Present (1 year 7 months) Hardware Engineer Intel Corporation May 2012  –  February 2014  (1 year 10 months) Hardware Engineer Intel Corporation May 2012  –  February 2014  (1 year 10 months) Hardware Engineer Cray Inc. November 2008  –  May 2012  (3 years 7 months) Austin, Texas Area Hardware Engineer Cray Inc. November 2008  –  May 2012  (3 years 7 months) Austin, Texas Area MTS Design Engineer Advanced Micro Devices November 2005  –  November 2008  (3 years 1 month) MTS Design Engineer Advanced Micro Devices November 2005  –  November 2008  (3 years 1 month) Hardware Engineer Cray Inc. February 1999  –  October 2005  (6 years 9 months) Hardware Engineer Cray Inc. February 1999  –  October 2005  (6 years 9 months) Skills SystemVerilog Computer Architecture Verilog High Performance... Functional Verification Hardware Architecture Hardware Debugging ASIC Processors SoC RTL design FPGA Microprocessors Logic Design Skills  SystemVerilog Computer Architecture Verilog High Performance... Functional Verification Hardware Architecture Hardware Debugging ASIC Processors SoC RTL design FPGA Microprocessors Logic Design SystemVerilog Computer Architecture Verilog High Performance... Functional Verification Hardware Architecture Hardware Debugging ASIC Processors SoC RTL design FPGA Microprocessors Logic Design SystemVerilog Computer Architecture Verilog High Performance... Functional Verification Hardware Architecture Hardware Debugging ASIC Processors SoC RTL design FPGA Microprocessors Logic Design Education University of Illinois at Urbana-Champaign Computer Engineering University of Illinois at Urbana-Champaign Computer Engineering University of Illinois at Urbana-Champaign Computer Engineering University of Illinois at Urbana-Champaign Computer Engineering ", "Experience Staff Network Engineer Google September 2011  – Present (4 years) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Staff Network Engineer Google September 2011  – Present (4 years) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Staff Network Engineer Google September 2011  – Present (4 years) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Skills Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Skills  Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Education UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE Peking University BS,  Electronics 1999  – 2003 UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE Peking University BS,  Electronics 1999  – 2003 Peking University BS,  Electronics 1999  – 2003 Peking University BS,  Electronics 1999  – 2003 ", "Summary Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Summary Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Experience Sr. Hardware Engineer Google [x] July 2015  – Present (2 months) Hardware Test Engineer Google [x] January 2014  –  June 2015  (1 year 6 months) Mountain View, CA Hardware Engineer SEAKR Engineering November 2010  –  August 2013  (2 years 10 months) Centennial, CO DSP/Systems Engineer SAIC June 2007  –  January 2011  (3 years 8 months) Sr. Electrical Engineer Lockheed-Martin November 2003  –  May 2007  (3 years 7 months) Technical Staff Member Jet Propulsion Laboratory August 2000  –  September 2003  (3 years 2 months) Sr. Communications Technician Raytheon Polar Services Co. August 2001  –  November 2002  (1 year 4 months) Sr. Hardware Engineer Google [x] July 2015  – Present (2 months) Sr. Hardware Engineer Google [x] July 2015  – Present (2 months) Hardware Test Engineer Google [x] January 2014  –  June 2015  (1 year 6 months) Mountain View, CA Hardware Test Engineer Google [x] January 2014  –  June 2015  (1 year 6 months) Mountain View, CA Hardware Engineer SEAKR Engineering November 2010  –  August 2013  (2 years 10 months) Centennial, CO Hardware Engineer SEAKR Engineering November 2010  –  August 2013  (2 years 10 months) Centennial, CO DSP/Systems Engineer SAIC June 2007  –  January 2011  (3 years 8 months) DSP/Systems Engineer SAIC June 2007  –  January 2011  (3 years 8 months) Sr. Electrical Engineer Lockheed-Martin November 2003  –  May 2007  (3 years 7 months) Sr. Electrical Engineer Lockheed-Martin November 2003  –  May 2007  (3 years 7 months) Technical Staff Member Jet Propulsion Laboratory August 2000  –  September 2003  (3 years 2 months) Technical Staff Member Jet Propulsion Laboratory August 2000  –  September 2003  (3 years 2 months) Sr. Communications Technician Raytheon Polar Services Co. August 2001  –  November 2002  (1 year 4 months) Sr. Communications Technician Raytheon Polar Services Co. August 2001  –  November 2002  (1 year 4 months) Skills DSP FPGA Communication Systems Labview Software Defined Radio Synplify DSP Xilinx System Generator Matlab STK Simulink Security Clearance Network Analyzer Spectrum Analyzer Digital Signal... Verilog VHDL Systems Engineering Digital Signal... RF Testing Sensors PCB design Simulations Xilinx Hardware Test Equipment Algorithms Electrical Engineering Embedded Systems LabVIEW PCB Design See 16+     See less Skills  DSP FPGA Communication Systems Labview Software Defined Radio Synplify DSP Xilinx System Generator Matlab STK Simulink Security Clearance Network Analyzer Spectrum Analyzer Digital Signal... Verilog VHDL Systems Engineering Digital Signal... RF Testing Sensors PCB design Simulations Xilinx Hardware Test Equipment Algorithms Electrical Engineering Embedded Systems LabVIEW PCB Design See 16+     See less DSP FPGA Communication Systems Labview Software Defined Radio Synplify DSP Xilinx System Generator Matlab STK Simulink Security Clearance Network Analyzer Spectrum Analyzer Digital Signal... Verilog VHDL Systems Engineering Digital Signal... RF Testing Sensors PCB design Simulations Xilinx Hardware Test Equipment Algorithms Electrical Engineering Embedded Systems LabVIEW PCB Design See 16+     See less DSP FPGA Communication Systems Labview Software Defined Radio Synplify DSP Xilinx System Generator Matlab STK Simulink Security Clearance Network Analyzer Spectrum Analyzer Digital Signal... Verilog VHDL Systems Engineering Digital Signal... RF Testing Sensors PCB design Simulations Xilinx Hardware Test Equipment Algorithms Electrical Engineering Embedded Systems LabVIEW PCB Design See 16+     See less Education University of Michigan MSEng 1998  – 2000 Michigan Technological University BS 1990  – 1994 University of Michigan MSEng 1998  – 2000 University of Michigan MSEng 1998  – 2000 University of Michigan MSEng 1998  – 2000 Michigan Technological University BS 1990  – 1994 Michigan Technological University BS 1990  – 1994 Michigan Technological University BS 1990  – 1994 ", "Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Simulations Algorithms Testing Digital Signal... Perl Python Semiconductors Matlab Machine Learning Mobile Devices Analog Acoustics Acoustic Measurement Acoustic Modeling Electronics Hardware Sensors Verilog Physics Embedded Systems Biochemistry Molecular Biology Physiology of hearing Production line... Polymer Chemistry Surface Chemistry Electrochemistry Electroplating MEMS Microfabrication Analog Circuit Design See 16+     See less Skills  Simulations Algorithms Testing Digital Signal... Perl Python Semiconductors Matlab Machine Learning Mobile Devices Analog Acoustics Acoustic Measurement Acoustic Modeling Electronics Hardware Sensors Verilog Physics Embedded Systems Biochemistry Molecular Biology Physiology of hearing Production line... Polymer Chemistry Surface Chemistry Electrochemistry Electroplating MEMS Microfabrication Analog Circuit Design See 16+     See less Simulations Algorithms Testing Digital Signal... Perl Python Semiconductors Matlab Machine Learning Mobile Devices Analog Acoustics Acoustic Measurement Acoustic Modeling Electronics Hardware Sensors Verilog Physics Embedded Systems Biochemistry Molecular Biology Physiology of hearing Production line... Polymer Chemistry Surface Chemistry Electrochemistry Electroplating MEMS Microfabrication Analog Circuit Design See 16+     See less Simulations Algorithms Testing Digital Signal... Perl Python Semiconductors Matlab Machine Learning Mobile Devices Analog Acoustics Acoustic Measurement Acoustic Modeling Electronics Hardware Sensors Verilog Physics Embedded Systems Biochemistry Molecular Biology Physiology of hearing Production line... Polymer Chemistry Surface Chemistry Electrochemistry Electroplating MEMS Microfabrication Analog Circuit Design See 16+     See less ", "Skills Verilog Logic Analyzer Firmware ASIC Ethernet I2C Fibre Channel Embedded Systems Board Bring-up SystemVerilog FPGA Switches Storage Skills  Verilog Logic Analyzer Firmware ASIC Ethernet I2C Fibre Channel Embedded Systems Board Bring-up SystemVerilog FPGA Switches Storage Verilog Logic Analyzer Firmware ASIC Ethernet I2C Fibre Channel Embedded Systems Board Bring-up SystemVerilog FPGA Switches Storage Verilog Logic Analyzer Firmware ASIC Ethernet I2C Fibre Channel Embedded Systems Board Bring-up SystemVerilog FPGA Switches Storage ", "Languages German Dutch German Dutch German Dutch Skills ASIC FPGA SoC RTL design Timing Closure Verilog Hardware Architecture Processors Low-power Design Perl Emulation SystemVerilog Xilinx ISE Hardware RTL Design Debugging See 1+     See less Skills  ASIC FPGA SoC RTL design Timing Closure Verilog Hardware Architecture Processors Low-power Design Perl Emulation SystemVerilog Xilinx ISE Hardware RTL Design Debugging See 1+     See less ASIC FPGA SoC RTL design Timing Closure Verilog Hardware Architecture Processors Low-power Design Perl Emulation SystemVerilog Xilinx ISE Hardware RTL Design Debugging See 1+     See less ASIC FPGA SoC RTL design Timing Closure Verilog Hardware Architecture Processors Low-power Design Perl Emulation SystemVerilog Xilinx ISE Hardware RTL Design Debugging See 1+     See less ", "Experience Staff Hardware Engineer Google May 2014  – Present (1 year 4 months) Staff Hardware Engineer Google May 2014  – Present (1 year 4 months) Staff Hardware Engineer Google May 2014  – Present (1 year 4 months) Skills Fiber Optics Optics Optical Fiber Telecommunications DWDM Semiconductors Optical Communications Systems Engineering Simulations FTTx Photonics Optoelectronics Optical Engineering Skills  Fiber Optics Optics Optical Fiber Telecommunications DWDM Semiconductors Optical Communications Systems Engineering Simulations FTTx Photonics Optoelectronics Optical Engineering Fiber Optics Optics Optical Fiber Telecommunications DWDM Semiconductors Optical Communications Systems Engineering Simulations FTTx Photonics Optoelectronics Optical Engineering Fiber Optics Optics Optical Fiber Telecommunications DWDM Semiconductors Optical Communications Systems Engineering Simulations FTTx Photonics Optoelectronics Optical Engineering Education University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 Huazhong University of Science and Technology BS University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 Huazhong University of Science and Technology BS Huazhong University of Science and Technology BS Huazhong University of Science and Technology BS ", "Experience Hardware Engineer Google[x] October 2014  – Present (11 months) Mountain View, CA Project Loon Hardware Engineer Google June 2014  –  October 2014  (5 months) Mountain View Google Access, internet for everybody Lead Engineer on the Linduino Linear Technology June 2013  –  June 2014  (1 year 1 month) Milpitas Head of the LTC Linduino Project, LTC's version of the Arduino that includes a fully isolated power supply to protect USB ports while working with high powered applications. \n \nLinduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  \n \nSelect and manage Linduino Projects to showcase LTC products and capabilities. Write and revise contributed firmware to be included in Linduino Firmware Library. Applications Engineer Linear Technology June 2007  –  June 2014  (7 years 1 month) Supported customers on mixed signal products, specialize in high resolution mixed signal products as well as battery management systems. Lab Supervisor Berkeley ESG 2006  –  2007  (1 year) Hardware Engineer Google[x] October 2014  – Present (11 months) Mountain View, CA Project Loon Hardware Engineer Google[x] October 2014  – Present (11 months) Mountain View, CA Project Loon Hardware Engineer Google June 2014  –  October 2014  (5 months) Mountain View Google Access, internet for everybody Hardware Engineer Google June 2014  –  October 2014  (5 months) Mountain View Google Access, internet for everybody Lead Engineer on the Linduino Linear Technology June 2013  –  June 2014  (1 year 1 month) Milpitas Head of the LTC Linduino Project, LTC's version of the Arduino that includes a fully isolated power supply to protect USB ports while working with high powered applications. \n \nLinduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  \n \nSelect and manage Linduino Projects to showcase LTC products and capabilities. Write and revise contributed firmware to be included in Linduino Firmware Library. Lead Engineer on the Linduino Linear Technology June 2013  –  June 2014  (1 year 1 month) Milpitas Head of the LTC Linduino Project, LTC's version of the Arduino that includes a fully isolated power supply to protect USB ports while working with high powered applications. \n \nLinduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  \n \nSelect and manage Linduino Projects to showcase LTC products and capabilities. Write and revise contributed firmware to be included in Linduino Firmware Library. Applications Engineer Linear Technology June 2007  –  June 2014  (7 years 1 month) Supported customers on mixed signal products, specialize in high resolution mixed signal products as well as battery management systems. Applications Engineer Linear Technology June 2007  –  June 2014  (7 years 1 month) Supported customers on mixed signal products, specialize in high resolution mixed signal products as well as battery management systems. Lab Supervisor Berkeley ESG 2006  –  2007  (1 year) Lab Supervisor Berkeley ESG 2006  –  2007  (1 year) Languages English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Mixed Signal Analog Circuit Design Analog Embedded C Product Engineering Power Management Battery Management... Power Electronics Firmware CMOS IC Visual C# Semiconductor Industry ASIC USB Circuit Design Electrical Engineering Semiconductors See 3+     See less Skills  Mixed Signal Analog Circuit Design Analog Embedded C Product Engineering Power Management Battery Management... Power Electronics Firmware CMOS IC Visual C# Semiconductor Industry ASIC USB Circuit Design Electrical Engineering Semiconductors See 3+     See less Mixed Signal Analog Circuit Design Analog Embedded C Product Engineering Power Management Battery Management... Power Electronics Firmware CMOS IC Visual C# Semiconductor Industry ASIC USB Circuit Design Electrical Engineering Semiconductors See 3+     See less Mixed Signal Analog Circuit Design Analog Embedded C Product Engineering Power Management Battery Management... Power Electronics Firmware CMOS IC Visual C# Semiconductor Industry ASIC USB Circuit Design Electrical Engineering Semiconductors See 3+     See less Education University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG ", "Experience Staff Hardware Engineer Google[x] December 2013  – Present (1 year 9 months) EE Team Lead on Project Loon. Hardware Engineer Google[x] March 2013  –  December 2013  (10 months) EE Lead on Project Loon. Electrical Engineer Entanglement Technologies November 2012  –  March 2013  (5 months) San Francisco Bay Area Systems Engineering Consultant Cobham Sensor Systems October 2011  –  October 2012  (1 year 1 month) Design of high current, low voltage power supplies \nSystem design and bring up of radio platform with ARM DM3730 processor and Altera FPGA \nLi-Ion battery charger design \nLinux kernel configuration, custom device drivers and u-boot configuration Co-founder and Lead Embedded Systems Engineer BioMimetic Systems Inc November 2006  –  January 2012  (5 years 3 months) Led hardware team in developing a low-power acoustic sensor platform for gunshot detection and vehicle tracking for DARPA \nDesigned multiple generations of PCBs that contained ARM processors, FPGAs, DSPs, low-noise audio inputs, MEMS sensors, interconnects and firmware \nTranslated floating point signal processing models to fixed point in Verilog and C \nOwned FPGA design and implementation with Xilinx Virtex4, Virtex5, and Spartan6 devices. \nManaged vendor selection, testing, BOM tracking and manufacturing schedules \n9-axis MEMS orientation sensor design and code for tracking movement and spatial orientation. Component Design Engineer Intel Corporation April 2004  –  October 2006  (2 years 7 months) Micro-architecture validation of i7 architecture memory and interconnect \nOwned logic validation of Pentium 4 Memory Unit \nDeveloped software tools for validation automation Research Assistant Boston University VLSI LAB January 2002  –  March 2004  (2 years 3 months) Developed a smart acoustic sensor for DARPA \nDesign, submission and test of digital asynchronous IC for acoustic feature extraction \n \n \n \nSpecific Skills and Projects: \n \nAcoustic Gunshot Detector: Developed Matlab signal processing models, modeled algorithms and translated to fixed-point implementations in Verilog and implemented algorithms in a Xilinx FPGA. Designed embedded system with OMAP3503 and Spartan6 FPGA, 3-axis gyro, 3-axis accelerometer, u-blox GPS and high-bandwidth recording interface. Laid out PCBs in Altium Designer and managed process of manufacturing and assembly. Lead board bring up, Linux configuration and custom ARM to FPGA interface and driver. Wrote low-level C routines to optimize software performance. Multiple generations of systems were fielded by various groups in the US Military for evaluation. \n \n \nHardware Knowledge: FPGA and SoC prototyping and board bring up - PCB design and layout with Altium, Orcad & Mentor tools – USB, Serial, SPI, Ethernet, I2C, Wishbone, Bluetooth, and WiFi communication interfaces - Power supply design and low-noise analog design and layout - DFM and environmental testing - Custom driver development for hardware – Lab tools and equipment  \n \nSoftware Languages and Tools: C, Matlab, Ruby, Perl, Java, TCL, Verilog and VHDL programming languages - Altium Designer, Mentor, Xilinx ISE, Altium Quartus design software – Linux and Microsoft Operating Systems - Microsoft Office productivity tools Staff Hardware Engineer Google[x] December 2013  – Present (1 year 9 months) EE Team Lead on Project Loon. Staff Hardware Engineer Google[x] December 2013  – Present (1 year 9 months) EE Team Lead on Project Loon. Hardware Engineer Google[x] March 2013  –  December 2013  (10 months) EE Lead on Project Loon. Hardware Engineer Google[x] March 2013  –  December 2013  (10 months) EE Lead on Project Loon. Electrical Engineer Entanglement Technologies November 2012  –  March 2013  (5 months) San Francisco Bay Area Electrical Engineer Entanglement Technologies November 2012  –  March 2013  (5 months) San Francisco Bay Area Systems Engineering Consultant Cobham Sensor Systems October 2011  –  October 2012  (1 year 1 month) Design of high current, low voltage power supplies \nSystem design and bring up of radio platform with ARM DM3730 processor and Altera FPGA \nLi-Ion battery charger design \nLinux kernel configuration, custom device drivers and u-boot configuration Systems Engineering Consultant Cobham Sensor Systems October 2011  –  October 2012  (1 year 1 month) Design of high current, low voltage power supplies \nSystem design and bring up of radio platform with ARM DM3730 processor and Altera FPGA \nLi-Ion battery charger design \nLinux kernel configuration, custom device drivers and u-boot configuration Co-founder and Lead Embedded Systems Engineer BioMimetic Systems Inc November 2006  –  January 2012  (5 years 3 months) Led hardware team in developing a low-power acoustic sensor platform for gunshot detection and vehicle tracking for DARPA \nDesigned multiple generations of PCBs that contained ARM processors, FPGAs, DSPs, low-noise audio inputs, MEMS sensors, interconnects and firmware \nTranslated floating point signal processing models to fixed point in Verilog and C \nOwned FPGA design and implementation with Xilinx Virtex4, Virtex5, and Spartan6 devices. \nManaged vendor selection, testing, BOM tracking and manufacturing schedules \n9-axis MEMS orientation sensor design and code for tracking movement and spatial orientation. Co-founder and Lead Embedded Systems Engineer BioMimetic Systems Inc November 2006  –  January 2012  (5 years 3 months) Led hardware team in developing a low-power acoustic sensor platform for gunshot detection and vehicle tracking for DARPA \nDesigned multiple generations of PCBs that contained ARM processors, FPGAs, DSPs, low-noise audio inputs, MEMS sensors, interconnects and firmware \nTranslated floating point signal processing models to fixed point in Verilog and C \nOwned FPGA design and implementation with Xilinx Virtex4, Virtex5, and Spartan6 devices. \nManaged vendor selection, testing, BOM tracking and manufacturing schedules \n9-axis MEMS orientation sensor design and code for tracking movement and spatial orientation. Component Design Engineer Intel Corporation April 2004  –  October 2006  (2 years 7 months) Micro-architecture validation of i7 architecture memory and interconnect \nOwned logic validation of Pentium 4 Memory Unit \nDeveloped software tools for validation automation Component Design Engineer Intel Corporation April 2004  –  October 2006  (2 years 7 months) Micro-architecture validation of i7 architecture memory and interconnect \nOwned logic validation of Pentium 4 Memory Unit \nDeveloped software tools for validation automation Research Assistant Boston University VLSI LAB January 2002  –  March 2004  (2 years 3 months) Developed a smart acoustic sensor for DARPA \nDesign, submission and test of digital asynchronous IC for acoustic feature extraction \n \n \n \nSpecific Skills and Projects: \n \nAcoustic Gunshot Detector: Developed Matlab signal processing models, modeled algorithms and translated to fixed-point implementations in Verilog and implemented algorithms in a Xilinx FPGA. Designed embedded system with OMAP3503 and Spartan6 FPGA, 3-axis gyro, 3-axis accelerometer, u-blox GPS and high-bandwidth recording interface. Laid out PCBs in Altium Designer and managed process of manufacturing and assembly. Lead board bring up, Linux configuration and custom ARM to FPGA interface and driver. Wrote low-level C routines to optimize software performance. Multiple generations of systems were fielded by various groups in the US Military for evaluation. \n \n \nHardware Knowledge: FPGA and SoC prototyping and board bring up - PCB design and layout with Altium, Orcad & Mentor tools – USB, Serial, SPI, Ethernet, I2C, Wishbone, Bluetooth, and WiFi communication interfaces - Power supply design and low-noise analog design and layout - DFM and environmental testing - Custom driver development for hardware – Lab tools and equipment  \n \nSoftware Languages and Tools: C, Matlab, Ruby, Perl, Java, TCL, Verilog and VHDL programming languages - Altium Designer, Mentor, Xilinx ISE, Altium Quartus design software – Linux and Microsoft Operating Systems - Microsoft Office productivity tools Research Assistant Boston University VLSI LAB January 2002  –  March 2004  (2 years 3 months) Developed a smart acoustic sensor for DARPA \nDesign, submission and test of digital asynchronous IC for acoustic feature extraction \n \n \n \nSpecific Skills and Projects: \n \nAcoustic Gunshot Detector: Developed Matlab signal processing models, modeled algorithms and translated to fixed-point implementations in Verilog and implemented algorithms in a Xilinx FPGA. Designed embedded system with OMAP3503 and Spartan6 FPGA, 3-axis gyro, 3-axis accelerometer, u-blox GPS and high-bandwidth recording interface. Laid out PCBs in Altium Designer and managed process of manufacturing and assembly. Lead board bring up, Linux configuration and custom ARM to FPGA interface and driver. Wrote low-level C routines to optimize software performance. Multiple generations of systems were fielded by various groups in the US Military for evaluation. \n \n \nHardware Knowledge: FPGA and SoC prototyping and board bring up - PCB design and layout with Altium, Orcad & Mentor tools – USB, Serial, SPI, Ethernet, I2C, Wishbone, Bluetooth, and WiFi communication interfaces - Power supply design and low-noise analog design and layout - DFM and environmental testing - Custom driver development for hardware – Lab tools and equipment  \n \nSoftware Languages and Tools: C, Matlab, Ruby, Perl, Java, TCL, Verilog and VHDL programming languages - Altium Designer, Mentor, Xilinx ISE, Altium Quartus design software – Linux and Microsoft Operating Systems - Microsoft Office productivity tools Languages Spanish Spanish Spanish Skills Signal Processing Embedded Systems System Design Matlab Electronics Biomedical Engineering Engineering C++ Verilog VHDL PCB design C Python Analog Linux Programming Software Development Digital Audio Kernel Debugging Debugging USB Ethernet Audio Engineering I2C FPGA prototyping CPLD ARM Sensor Fusion Power Supplies OMAP Sensors FPGA Validation See 18+     See less Skills  Signal Processing Embedded Systems System Design Matlab Electronics Biomedical Engineering Engineering C++ Verilog VHDL PCB design C Python Analog Linux Programming Software Development Digital Audio Kernel Debugging Debugging USB Ethernet Audio Engineering I2C FPGA prototyping CPLD ARM Sensor Fusion Power Supplies OMAP Sensors FPGA Validation See 18+     See less Signal Processing Embedded Systems System Design Matlab Electronics Biomedical Engineering Engineering C++ Verilog VHDL PCB design C Python Analog Linux Programming Software Development Digital Audio Kernel Debugging Debugging USB Ethernet Audio Engineering I2C FPGA prototyping CPLD ARM Sensor Fusion Power Supplies OMAP Sensors FPGA Validation See 18+     See less Signal Processing Embedded Systems System Design Matlab Electronics Biomedical Engineering Engineering C++ Verilog VHDL PCB design C Python Analog Linux Programming Software Development Digital Audio Kernel Debugging Debugging USB Ethernet Audio Engineering I2C FPGA prototyping CPLD ARM Sensor Fusion Power Supplies OMAP Sensors FPGA Validation See 18+     See less Education Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 La Center High School 1996  – 1999 Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 La Center High School 1996  – 1999 La Center High School 1996  – 1999 La Center High School 1996  – 1999 ", "Experience Senior Physicist and Electrical Engineer Google [x], Google Life Sciences November 2014  – Present (10 months) Physicist and Electrical Engineer Google [x] May 2013  –  November 2014  (1 year 7 months) Consulting Hardware Engineer Google [x] October 2012  –  May 2013  (8 months) Senior Physicist and Electrical Engineer Google [x], Google Life Sciences November 2014  – Present (10 months) Senior Physicist and Electrical Engineer Google [x], Google Life Sciences November 2014  – Present (10 months) Physicist and Electrical Engineer Google [x] May 2013  –  November 2014  (1 year 7 months) Physicist and Electrical Engineer Google [x] May 2013  –  November 2014  (1 year 7 months) Consulting Hardware Engineer Google [x] October 2012  –  May 2013  (8 months) Consulting Hardware Engineer Google [x] October 2012  –  May 2013  (8 months) Languages English Hebrew English Hebrew English Hebrew Skills Physics Solar Energy Nanotechnology Optics LaTeX Renewable Energy Characterization Quantum Optics Matlab R&D Materials Science Simulations Mathematical Modeling Mathematica Numerical Analysis Scientific Computing Algorithms Research Theoretical Physics Quantum Field Theory Radiative Cooling Heat Transfer Grant Writing TikZ/PGF Plots Signal Processing Machine Learning Monte Carlo Simulation Semiconductors Applied Mathematics Optimization Digital Signal... Modeling Hyperspectral Imaging Electrical Engineering C++ Python See 21+     See less Skills  Physics Solar Energy Nanotechnology Optics LaTeX Renewable Energy Characterization Quantum Optics Matlab R&D Materials Science Simulations Mathematical Modeling Mathematica Numerical Analysis Scientific Computing Algorithms Research Theoretical Physics Quantum Field Theory Radiative Cooling Heat Transfer Grant Writing TikZ/PGF Plots Signal Processing Machine Learning Monte Carlo Simulation Semiconductors Applied Mathematics Optimization Digital Signal... Modeling Hyperspectral Imaging Electrical Engineering C++ Python See 21+     See less Physics Solar Energy Nanotechnology Optics LaTeX Renewable Energy Characterization Quantum Optics Matlab R&D Materials Science Simulations Mathematical Modeling Mathematica Numerical Analysis Scientific Computing Algorithms Research Theoretical Physics Quantum Field Theory Radiative Cooling Heat Transfer Grant Writing TikZ/PGF Plots Signal Processing Machine Learning Monte Carlo Simulation Semiconductors Applied Mathematics Optimization Digital Signal... Modeling Hyperspectral Imaging Electrical Engineering C++ Python See 21+     See less Physics Solar Energy Nanotechnology Optics LaTeX Renewable Energy Characterization Quantum Optics Matlab R&D Materials Science Simulations Mathematical Modeling Mathematica Numerical Analysis Scientific Computing Algorithms Research Theoretical Physics Quantum Field Theory Radiative Cooling Heat Transfer Grant Writing TikZ/PGF Plots Signal Processing Machine Learning Monte Carlo Simulation Semiconductors Applied Mathematics Optimization Digital Signal... Modeling Hyperspectral Imaging Electrical Engineering C++ Python See 21+     See less Education Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Honors & Awards William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Additional Honors & Awards Stanford Graduate Fellowship (SGF) William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Additional Honors & Awards Stanford Graduate Fellowship (SGF) Additional Honors & Awards Stanford Graduate Fellowship (SGF) Additional Honors & Awards Stanford Graduate Fellowship (SGF) ", "Skills Strategy Project Management Business Strategy Online Advertising Cross-functional Team... Process Improvement Management Change Management Advertising Team Management Digital Marketing Product Launch Digital Media Product Management Digital Strategy Google Adwords Marketing Online Marketing Display Advertising Troubleshooting See 5+     See less Skills  Strategy Project Management Business Strategy Online Advertising Cross-functional Team... Process Improvement Management Change Management Advertising Team Management Digital Marketing Product Launch Digital Media Product Management Digital Strategy Google Adwords Marketing Online Marketing Display Advertising Troubleshooting See 5+     See less Strategy Project Management Business Strategy Online Advertising Cross-functional Team... Process Improvement Management Change Management Advertising Team Management Digital Marketing Product Launch Digital Media Product Management Digital Strategy Google Adwords Marketing Online Marketing Display Advertising Troubleshooting See 5+     See less Strategy Project Management Business Strategy Online Advertising Cross-functional Team... Process Improvement Management Change Management Advertising Team Management Digital Marketing Product Launch Digital Media Product Management Digital Strategy Google Adwords Marketing Online Marketing Display Advertising Troubleshooting See 5+     See less ", "Languages English Native or bilingual proficiency Chinese Limited working proficiency German Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency German Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency German Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Verilog C C++ Python Matlab Unix Java Network Administration PHP Microsoft Office Microsoft Excel PowerPoint Microsoft Word Photoshop Customer Service HTML Social Media Windows SQL Perl Teamwork Mac OS X English Public Speaking Research Signal Processing Circuit Design Machine Learning Computer Hardware FPGA Medical Devices Network Security Android Development Medical Imaging Image Processing Databases Web Development Software Development Algorithms Computer Science See 25+     See less Skills  Verilog C C++ Python Matlab Unix Java Network Administration PHP Microsoft Office Microsoft Excel PowerPoint Microsoft Word Photoshop Customer Service HTML Social Media Windows SQL Perl Teamwork Mac OS X English Public Speaking Research Signal Processing Circuit Design Machine Learning Computer Hardware FPGA Medical Devices Network Security Android Development Medical Imaging Image Processing Databases Web Development Software Development Algorithms Computer Science See 25+     See less Verilog C C++ Python Matlab Unix Java Network Administration PHP Microsoft Office Microsoft Excel PowerPoint Microsoft Word Photoshop Customer Service HTML Social Media Windows SQL Perl Teamwork Mac OS X English Public Speaking Research Signal Processing Circuit Design Machine Learning Computer Hardware FPGA Medical Devices Network Security Android Development Medical Imaging Image Processing Databases Web Development Software Development Algorithms Computer Science See 25+     See less Verilog C C++ Python Matlab Unix Java Network Administration PHP Microsoft Office Microsoft Excel PowerPoint Microsoft Word Photoshop Customer Service HTML Social Media Windows SQL Perl Teamwork Mac OS X English Public Speaking Research Signal Processing Circuit Design Machine Learning Computer Hardware FPGA Medical Devices Network Security Android Development Medical Imaging Image Processing Databases Web Development Software Development Algorithms Computer Science See 25+     See less Honors & Awards ", "Experience Hardware Engineer Google December 2013  – Present (1 year 9 months) Power engineer for consumer electronics, including adapter, battery management and POL. Hardware Engineer Google May 2011  –  December 2013  (2 years 8 months) Power Engineer for data center, power architecture and power capping Sr. Application Engineer Monolithic Power Systems May 2009  –  May 2011  (2 years 1 month) Define controller and design DC/DC converters Electrical Engineer Celestica Power Supply Division (Presently Murata Power Solutions) June 2003  –  August 2003  (3 months) Hardware Engineer Google December 2013  – Present (1 year 9 months) Power engineer for consumer electronics, including adapter, battery management and POL. Hardware Engineer Google December 2013  – Present (1 year 9 months) Power engineer for consumer electronics, including adapter, battery management and POL. Hardware Engineer Google May 2011  –  December 2013  (2 years 8 months) Power Engineer for data center, power architecture and power capping Hardware Engineer Google May 2011  –  December 2013  (2 years 8 months) Power Engineer for data center, power architecture and power capping Sr. Application Engineer Monolithic Power Systems May 2009  –  May 2011  (2 years 1 month) Define controller and design DC/DC converters Sr. Application Engineer Monolithic Power Systems May 2009  –  May 2011  (2 years 1 month) Define controller and design DC/DC converters Electrical Engineer Celestica Power Supply Division (Presently Murata Power Solutions) June 2003  –  August 2003  (3 months) Electrical Engineer Celestica Power Supply Division (Presently Murata Power Solutions) June 2003  –  August 2003  (3 months) Skills Power Electronics Power Supplies Power Management Analog Skills  Power Electronics Power Supplies Power Management Analog Power Electronics Power Supplies Power Management Analog Power Electronics Power Supplies Power Management Analog Education Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 South China University of Technology M.S.,  Power Electronics 2000  – 2003 Xi'an Jiaotong University B.S. 1994  – 1998 Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 South China University of Technology M.S.,  Power Electronics 2000  – 2003 South China University of Technology M.S.,  Power Electronics 2000  – 2003 South China University of Technology M.S.,  Power Electronics 2000  – 2003 Xi'an Jiaotong University B.S. 1994  – 1998 Xi'an Jiaotong University B.S. 1994  – 1998 Xi'an Jiaotong University B.S. 1994  – 1998 ", "Summary Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Summary Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Experience Staff Hardware Engineer Google September 2013  – Present (2 years) Mountain View, CA Architecture and design of hardware products for Google's datacenters. \n \nGoogle's representative on NVM Express organization. CEO / CTO Indra Networks, Inc. August 2012  –  August 2013  (1 year 1 month) Sr. Hardware Engineer Google, Inc. December 2011  –  August 2012  (9 months) Mountain View, CA Architecture and design of hardware infrastructure for Google's datacenters. Founder & CEO Indra Networks January 2001  –  November 2011  (10 years 11 months) President Ascent Software February 1998  –  December 2000  (2 years 11 months) Engineer / Scientist Hewlett Packard Company October 1984  –  January 1998  (13 years 4 months) Staff Hardware Engineer Google September 2013  – Present (2 years) Mountain View, CA Architecture and design of hardware products for Google's datacenters. \n \nGoogle's representative on NVM Express organization. Staff Hardware Engineer Google September 2013  – Present (2 years) Mountain View, CA Architecture and design of hardware products for Google's datacenters. \n \nGoogle's representative on NVM Express organization. CEO / CTO Indra Networks, Inc. August 2012  –  August 2013  (1 year 1 month) CEO / CTO Indra Networks, Inc. August 2012  –  August 2013  (1 year 1 month) Sr. Hardware Engineer Google, Inc. December 2011  –  August 2012  (9 months) Mountain View, CA Architecture and design of hardware infrastructure for Google's datacenters. Sr. Hardware Engineer Google, Inc. December 2011  –  August 2012  (9 months) Mountain View, CA Architecture and design of hardware infrastructure for Google's datacenters. Founder & CEO Indra Networks January 2001  –  November 2011  (10 years 11 months) Founder & CEO Indra Networks January 2001  –  November 2011  (10 years 11 months) President Ascent Software February 1998  –  December 2000  (2 years 11 months) President Ascent Software February 1998  –  December 2000  (2 years 11 months) Engineer / Scientist Hewlett Packard Company October 1984  –  January 1998  (13 years 4 months) Engineer / Scientist Hewlett Packard Company October 1984  –  January 1998  (13 years 4 months) Languages Hindi Gujarati Hindi Gujarati Hindi Gujarati Skills System Architecture Hardware Development FPGA Hardware Architecture ASIC Verilog Debugging Device Drivers Skills  System Architecture Hardware Development FPGA Hardware Architecture ASIC Verilog Debugging Device Drivers System Architecture Hardware Development FPGA Hardware Architecture ASIC Verilog Debugging Device Drivers System Architecture Hardware Development FPGA Hardware Architecture ASIC Verilog Debugging Device Drivers Education Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 ", "Experience Hardware Engineer Google June 2015  – Present (3 months) Mountain View, CA Hardware Engineer Hewlett Packard April 2013  –  June 2015  (2 years 3 months) Fremont, CA Senior Hardware Engineer Lockheed Martin July 2001  –  March 2013  (11 years 9 months) Hardware Engineer Applied Signal Technology 1998  –  2001  (3 years) Hardware Engineer Larus 1995  –  1998  (3 years) Hardware Engineer Google June 2015  – Present (3 months) Mountain View, CA Hardware Engineer Google June 2015  – Present (3 months) Mountain View, CA Hardware Engineer Hewlett Packard April 2013  –  June 2015  (2 years 3 months) Fremont, CA Hardware Engineer Hewlett Packard April 2013  –  June 2015  (2 years 3 months) Fremont, CA Senior Hardware Engineer Lockheed Martin July 2001  –  March 2013  (11 years 9 months) Senior Hardware Engineer Lockheed Martin July 2001  –  March 2013  (11 years 9 months) Hardware Engineer Applied Signal Technology 1998  –  2001  (3 years) Hardware Engineer Applied Signal Technology 1998  –  2001  (3 years) Hardware Engineer Larus 1995  –  1998  (3 years) Hardware Engineer Larus 1995  –  1998  (3 years) Skills Earned Value Management Embedded Systems Engineering Management FPGA Hardware Hardware Architecture Integration Requirements Management Simulations System Architecture System Design Systems Design Systems Engineering Testing Program Management Aerospace See 1+     See less Skills  Earned Value Management Embedded Systems Engineering Management FPGA Hardware Hardware Architecture Integration Requirements Management Simulations System Architecture System Design Systems Design Systems Engineering Testing Program Management Aerospace See 1+     See less Earned Value Management Embedded Systems Engineering Management FPGA Hardware Hardware Architecture Integration Requirements Management Simulations System Architecture System Design Systems Design Systems Engineering Testing Program Management Aerospace See 1+     See less Earned Value Management Embedded Systems Engineering Management FPGA Hardware Hardware Architecture Integration Requirements Management Simulations System Architecture System Design Systems Design Systems Engineering Testing Program Management Aerospace See 1+     See less Education California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 ", "Summary Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Summary Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Experience Staff Hardware Engineer Google May 2014  – Present (1 year 4 months) Japan Supplier Development & Quality \nAdvanced Technology Research \nGoogle [X] Senior Hardware Engineer Google December 2012  –  May 2014  (1 year 6 months) Mountain View, CA Supplier Development & Quality Engineering \nGoogle Glass - Google [X] Supply Chain Quality Assurance Tesla Motors March 2012  –  November 2012  (9 months) Palo Alto, CA Model S - Body & Exterior - Supplier Quality Engineering Senior Manager, Quality Engineering Plastikon Industries May 2011  –  March 2012  (11 months) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding Quality Engineering Manager / Engineering Manager Plastikon Industries May 2006  –  May 2011  (5 years 1 month) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding \n \nQuality Develoment - Interior & Exterior Injection molding product for 2008 Toyota Corolla Senior Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) November 2004  –  May 2006  (1 year 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2006 Toyota FJ Cruiser Senior Manufacturing & Supplier Quality Engineer Toyota Motor Corporation November 2002  –  October 2004  (2 years) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2004 Toyota Tacoma (Nummi and TMMBC) Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) April 1999  –  October 2002  (3 years 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for Toyota 4 Runner, Hilux and Dyna/Dutro Staff Hardware Engineer Google May 2014  – Present (1 year 4 months) Japan Supplier Development & Quality \nAdvanced Technology Research \nGoogle [X] Staff Hardware Engineer Google May 2014  – Present (1 year 4 months) Japan Supplier Development & Quality \nAdvanced Technology Research \nGoogle [X] Senior Hardware Engineer Google December 2012  –  May 2014  (1 year 6 months) Mountain View, CA Supplier Development & Quality Engineering \nGoogle Glass - Google [X] Senior Hardware Engineer Google December 2012  –  May 2014  (1 year 6 months) Mountain View, CA Supplier Development & Quality Engineering \nGoogle Glass - Google [X] Supply Chain Quality Assurance Tesla Motors March 2012  –  November 2012  (9 months) Palo Alto, CA Model S - Body & Exterior - Supplier Quality Engineering Supply Chain Quality Assurance Tesla Motors March 2012  –  November 2012  (9 months) Palo Alto, CA Model S - Body & Exterior - Supplier Quality Engineering Senior Manager, Quality Engineering Plastikon Industries May 2011  –  March 2012  (11 months) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding Senior Manager, Quality Engineering Plastikon Industries May 2011  –  March 2012  (11 months) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding Quality Engineering Manager / Engineering Manager Plastikon Industries May 2006  –  May 2011  (5 years 1 month) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding \n \nQuality Develoment - Interior & Exterior Injection molding product for 2008 Toyota Corolla Quality Engineering Manager / Engineering Manager Plastikon Industries May 2006  –  May 2011  (5 years 1 month) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding \n \nQuality Develoment - Interior & Exterior Injection molding product for 2008 Toyota Corolla Senior Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) November 2004  –  May 2006  (1 year 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2006 Toyota FJ Cruiser Senior Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) November 2004  –  May 2006  (1 year 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2006 Toyota FJ Cruiser Senior Manufacturing & Supplier Quality Engineer Toyota Motor Corporation November 2002  –  October 2004  (2 years) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2004 Toyota Tacoma (Nummi and TMMBC) Senior Manufacturing & Supplier Quality Engineer Toyota Motor Corporation November 2002  –  October 2004  (2 years) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2004 Toyota Tacoma (Nummi and TMMBC) Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) April 1999  –  October 2002  (3 years 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for Toyota 4 Runner, Hilux and Dyna/Dutro Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) April 1999  –  October 2002  (3 years 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for Toyota 4 Runner, Hilux and Dyna/Dutro Languages   Skills Toyota Production System PPAP SPC APQP Kaizen TS16949 DFMEA GD&T Design for Manufacturing Six Sigma PFMEA IQ/OQ/PQ Design Review NPI Management Value Engineering Supply Chain Management Risk Assessment Fixture Design Measurement System... Super DOE QMS audit Process/Product audit Continuous Improvement Lean Manufacturing Hoshin Kanri Logical Approach Problem Solving Visual Management Risk Management Resource Management Quality System Minitab Engineering Quality Management Injection Molding Automotive ISO Engineering Management 5S Quality Assurance Cross-functional Team... Manufacturing Product Development Quality Control Root Cause Analysis TQM Kanban FMEA Iso 9000 JIT See 35+     See less Skills  Toyota Production System PPAP SPC APQP Kaizen TS16949 DFMEA GD&T Design for Manufacturing Six Sigma PFMEA IQ/OQ/PQ Design Review NPI Management Value Engineering Supply Chain Management Risk Assessment Fixture Design Measurement System... Super DOE QMS audit Process/Product audit Continuous Improvement Lean Manufacturing Hoshin Kanri Logical Approach Problem Solving Visual Management Risk Management Resource Management Quality System Minitab Engineering Quality Management Injection Molding Automotive ISO Engineering Management 5S Quality Assurance Cross-functional Team... Manufacturing Product Development Quality Control Root Cause Analysis TQM Kanban FMEA Iso 9000 JIT See 35+     See less Toyota Production System PPAP SPC APQP Kaizen TS16949 DFMEA GD&T Design for Manufacturing Six Sigma PFMEA IQ/OQ/PQ Design Review NPI Management Value Engineering Supply Chain Management Risk Assessment Fixture Design Measurement System... Super DOE QMS audit Process/Product audit Continuous Improvement Lean Manufacturing Hoshin Kanri Logical Approach Problem Solving Visual Management Risk Management Resource Management Quality System Minitab Engineering Quality Management Injection Molding Automotive ISO Engineering Management 5S Quality Assurance Cross-functional Team... Manufacturing Product Development Quality Control Root Cause Analysis TQM Kanban FMEA Iso 9000 JIT See 35+     See less Toyota Production System PPAP SPC APQP Kaizen TS16949 DFMEA GD&T Design for Manufacturing Six Sigma PFMEA IQ/OQ/PQ Design Review NPI Management Value Engineering Supply Chain Management Risk Assessment Fixture Design Measurement System... Super DOE QMS audit Process/Product audit Continuous Improvement Lean Manufacturing Hoshin Kanri Logical Approach Problem Solving Visual Management Risk Management Resource Management Quality System Minitab Engineering Quality Management Injection Molding Automotive ISO Engineering Management 5S Quality Assurance Cross-functional Team... Manufacturing Product Development Quality Control Root Cause Analysis TQM Kanban FMEA Iso 9000 JIT See 35+     See less Education Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering , Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering , Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering , Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering , Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Honors & Awards "]}