{"position": "Hardware Interface Designer", "company": "Google", "profiles": ["Summary I emphasize in user interface, interaction design, and user experience and have worked for large corporations and successful startups. Prior to arriving in the Bay Area I spent seven years at the Rhode Island School of Design where I received an undergraduate degree in Industrial Design and a master's degree in Graphic Design. In my free time I enjoy collecting wood type and making colorful things by hand. Summary I emphasize in user interface, interaction design, and user experience and have worked for large corporations and successful startups. Prior to arriving in the Bay Area I spent seven years at the Rhode Island School of Design where I received an undergraduate degree in Industrial Design and a master's degree in Graphic Design. In my free time I enjoy collecting wood type and making colorful things by hand. I emphasize in user interface, interaction design, and user experience and have worked for large corporations and successful startups. Prior to arriving in the Bay Area I spent seven years at the Rhode Island School of Design where I received an undergraduate degree in Industrial Design and a master's degree in Graphic Design. In my free time I enjoy collecting wood type and making colorful things by hand. I emphasize in user interface, interaction design, and user experience and have worked for large corporations and successful startups. Prior to arriving in the Bay Area I spent seven years at the Rhode Island School of Design where I received an undergraduate degree in Industrial Design and a master's degree in Graphic Design. In my free time I enjoy collecting wood type and making colorful things by hand. Experience Senior UX Designer Google May 2015  – Present (4 months) Designer at Google[x] Google February 2014  –  June 2015  (1 year 5 months) UI Designer Airbnb July 2013  –  September 2013  (3 months) User Interface Designer Apple July 2009  –  July 2013  (4 years 1 month) User Interface Design Intern Apple May 2008  –  August 2008  (4 months) Exhibit Design Intern Smithsonian Institution January 2006  –  February 2006  (2 months) Senior UX Designer Google May 2015  – Present (4 months) Senior UX Designer Google May 2015  – Present (4 months) Designer at Google[x] Google February 2014  –  June 2015  (1 year 5 months) Designer at Google[x] Google February 2014  –  June 2015  (1 year 5 months) UI Designer Airbnb July 2013  –  September 2013  (3 months) UI Designer Airbnb July 2013  –  September 2013  (3 months) User Interface Designer Apple July 2009  –  July 2013  (4 years 1 month) User Interface Designer Apple July 2009  –  July 2013  (4 years 1 month) User Interface Design Intern Apple May 2008  –  August 2008  (4 months) User Interface Design Intern Apple May 2008  –  August 2008  (4 months) Exhibit Design Intern Smithsonian Institution January 2006  –  February 2006  (2 months) Exhibit Design Intern Smithsonian Institution January 2006  –  February 2006  (2 months) Skills User Interface Design Interaction Design Industrial Design Visual Design Graphic Design Typography User Experience Design OS X iOS Icon Design Mobile Applications Mobile Design Android iPhone Skills  User Interface Design Interaction Design Industrial Design Visual Design Graphic Design Typography User Experience Design OS X iOS Icon Design Mobile Applications Mobile Design Android iPhone User Interface Design Interaction Design Industrial Design Visual Design Graphic Design Typography User Experience Design OS X iOS Icon Design Mobile Applications Mobile Design Android iPhone User Interface Design Interaction Design Industrial Design Visual Design Graphic Design Typography User Experience Design OS X iOS Icon Design Mobile Applications Mobile Design Android iPhone Education Rhode Island School of Design MFA,  Graphic Design 2006  – 2009 Rhode Island School of Design BFA,  Industrial Design 2002  – 2006 Brown University Liberal Arts Studies summer course 2004  – 2004 Parsons School of Design Product Design summer course 2003  – 2003 Rhode Island School of Design MFA,  Graphic Design 2006  – 2009 Rhode Island School of Design MFA,  Graphic Design 2006  – 2009 Rhode Island School of Design MFA,  Graphic Design 2006  – 2009 Rhode Island School of Design BFA,  Industrial Design 2002  – 2006 Rhode Island School of Design BFA,  Industrial Design 2002  – 2006 Rhode Island School of Design BFA,  Industrial Design 2002  – 2006 Brown University Liberal Arts Studies summer course 2004  – 2004 Brown University Liberal Arts Studies summer course 2004  – 2004 Brown University Liberal Arts Studies summer course 2004  – 2004 Parsons School of Design Product Design summer course 2003  – 2003 Parsons School of Design Product Design summer course 2003  – 2003 Parsons School of Design Product Design summer course 2003  – 2003 ", "Summary Specialties:Interaction Design and User Experience in the automotive context Summary Specialties:Interaction Design and User Experience in the automotive context Specialties:Interaction Design and User Experience in the automotive context Specialties:Interaction Design and User Experience in the automotive context Experience Senior UX Designer - Google Maps Google July 2013  – Present (2 years 2 months) Mountain View, California I work as a user experience and user interface designer on Google Maps UI/UX Designer- Google [x] Self Driving Car Google October 2011  –  July 2013  (1 year 10 months) Mountain View California UI/UX designer at Google [x] for the Self Driving Car project. HMI Concept Engineer Ford Motor Company March 2010  –  September 2011  (1 year 7 months) Cologne Area, Germany Worked within the global HMI Team as an engineer and interaction designer. Working on developing new interaction concepts for upcoming carlines as well as specifying functionalities, behavior and visual appearance.  \n \nRole of project lead for several projects to guide HMI development with other departments and external partners. Project Engineer Bertrandt AG March 2010  –  September 2011  (1 year 7 months) Cologne Area, Germany contract worker at Ford Motor Company at Cologne development center Graduate interaction design BMW April 2009  –  December 2009  (9 months) Developing new concepts for the head-up display interface. Researching the usefulness of 3D information on the Head-Up Display designer modesi 2006  –  February 2009  (3 years) Industrial Designer Modesi March 2007  –  September 2008  (1 year 7 months) Part time job at Modesi, where I mainly focussed on Webdesign and Communication Materials like folders and flyers. Next to that Design work, like CAD and development Student Graduate DTI Automotive Mechatronics February 2006  –  October 2006  (9 months) Bachelor graduation project to develop and design of a gearshift controller to control shift by wire patterns, as well operating in‐car interfaces. Design and development of an interaction method and screen interface. Usability testing to verify usability of the interface within an experimental design. Senior UX Designer - Google Maps Google July 2013  – Present (2 years 2 months) Mountain View, California I work as a user experience and user interface designer on Google Maps Senior UX Designer - Google Maps Google July 2013  – Present (2 years 2 months) Mountain View, California I work as a user experience and user interface designer on Google Maps UI/UX Designer- Google [x] Self Driving Car Google October 2011  –  July 2013  (1 year 10 months) Mountain View California UI/UX designer at Google [x] for the Self Driving Car project. UI/UX Designer- Google [x] Self Driving Car Google October 2011  –  July 2013  (1 year 10 months) Mountain View California UI/UX designer at Google [x] for the Self Driving Car project. HMI Concept Engineer Ford Motor Company March 2010  –  September 2011  (1 year 7 months) Cologne Area, Germany Worked within the global HMI Team as an engineer and interaction designer. Working on developing new interaction concepts for upcoming carlines as well as specifying functionalities, behavior and visual appearance.  \n \nRole of project lead for several projects to guide HMI development with other departments and external partners. HMI Concept Engineer Ford Motor Company March 2010  –  September 2011  (1 year 7 months) Cologne Area, Germany Worked within the global HMI Team as an engineer and interaction designer. Working on developing new interaction concepts for upcoming carlines as well as specifying functionalities, behavior and visual appearance.  \n \nRole of project lead for several projects to guide HMI development with other departments and external partners. Project Engineer Bertrandt AG March 2010  –  September 2011  (1 year 7 months) Cologne Area, Germany contract worker at Ford Motor Company at Cologne development center Project Engineer Bertrandt AG March 2010  –  September 2011  (1 year 7 months) Cologne Area, Germany contract worker at Ford Motor Company at Cologne development center Graduate interaction design BMW April 2009  –  December 2009  (9 months) Developing new concepts for the head-up display interface. Researching the usefulness of 3D information on the Head-Up Display Graduate interaction design BMW April 2009  –  December 2009  (9 months) Developing new concepts for the head-up display interface. Researching the usefulness of 3D information on the Head-Up Display designer modesi 2006  –  February 2009  (3 years) designer modesi 2006  –  February 2009  (3 years) Industrial Designer Modesi March 2007  –  September 2008  (1 year 7 months) Part time job at Modesi, where I mainly focussed on Webdesign and Communication Materials like folders and flyers. Next to that Design work, like CAD and development Industrial Designer Modesi March 2007  –  September 2008  (1 year 7 months) Part time job at Modesi, where I mainly focussed on Webdesign and Communication Materials like folders and flyers. Next to that Design work, like CAD and development Student Graduate DTI Automotive Mechatronics February 2006  –  October 2006  (9 months) Bachelor graduation project to develop and design of a gearshift controller to control shift by wire patterns, as well operating in‐car interfaces. Design and development of an interaction method and screen interface. Usability testing to verify usability of the interface within an experimental design. Student Graduate DTI Automotive Mechatronics February 2006  –  October 2006  (9 months) Bachelor graduation project to develop and design of a gearshift controller to control shift by wire patterns, as well operating in‐car interfaces. Design and development of an interaction method and screen interface. Usability testing to verify usability of the interface within an experimental design. Skills Industrial Design CAD Design Thinking User-centered Design User Interface Interaction Design Automotive User Experience Product Development Rapid Prototyping Usability Software Development Product Design Web Design Concept Development Design Strategy Experience Design Usability Testing See 3+     See less Skills  Industrial Design CAD Design Thinking User-centered Design User Interface Interaction Design Automotive User Experience Product Development Rapid Prototyping Usability Software Development Product Design Web Design Concept Development Design Strategy Experience Design Usability Testing See 3+     See less Industrial Design CAD Design Thinking User-centered Design User Interface Interaction Design Automotive User Experience Product Development Rapid Prototyping Usability Software Development Product Design Web Design Concept Development Design Strategy Experience Design Usability Testing See 3+     See less Industrial Design CAD Design Thinking User-centered Design User Interface Interaction Design Automotive User Experience Product Development Rapid Prototyping Usability Software Development Product Design Web Design Concept Development Design Strategy Experience Design Usability Testing See 3+     See less Education Delft University of Technology MSc,  Industrial Design , Cum Laude 2007  – 2009 Design for Interaction Master Eindhoven University of Technology BA,  Industrial Design 2003  – 2007 Delft University of Technology MSc,  Industrial Design , Cum Laude 2007  – 2009 Design for Interaction Master Delft University of Technology MSc,  Industrial Design , Cum Laude 2007  – 2009 Design for Interaction Master Delft University of Technology MSc,  Industrial Design , Cum Laude 2007  – 2009 Design for Interaction Master Eindhoven University of Technology BA,  Industrial Design 2003  – 2007 Eindhoven University of Technology BA,  Industrial Design 2003  – 2007 Eindhoven University of Technology BA,  Industrial Design 2003  – 2007 ", "Summary I care deeply about designing for meaningful outcomes. Not all problems are created equal so it’s important we identify opportunities that produce value for our customers. Through research and analysis, explorations and experiments I help businesses build things that matter. \n \nAt a Glance \n• I practice user-centered design and I am a product management geek. \n• I help teams think through complex problems and build alignment toward common goals. \n• My design process is forever evolving as I learn new things and work within new environments. \n• I lean on years of personal expertise and user research to ask beautiful questions. \n• I lead design conversations through sketches, mock-ups, user flows, wireframes and prototypes. \n• I'm a user experience designer amused by human behavior and how it informs behavioral design. \n \nAreas of Interest \n• User-centered Design \n• Interaction Design \n• Behavioral Design \n• Visual Design \n• Information Architecture \n• UX Strategy \n• User Testing and Analysis \n• Agile / Lean Methodologies \n• Product Strategy \n• Product Management \n• Design Leadership Summary I care deeply about designing for meaningful outcomes. Not all problems are created equal so it’s important we identify opportunities that produce value for our customers. Through research and analysis, explorations and experiments I help businesses build things that matter. \n \nAt a Glance \n• I practice user-centered design and I am a product management geek. \n• I help teams think through complex problems and build alignment toward common goals. \n• My design process is forever evolving as I learn new things and work within new environments. \n• I lean on years of personal expertise and user research to ask beautiful questions. \n• I lead design conversations through sketches, mock-ups, user flows, wireframes and prototypes. \n• I'm a user experience designer amused by human behavior and how it informs behavioral design. \n \nAreas of Interest \n• User-centered Design \n• Interaction Design \n• Behavioral Design \n• Visual Design \n• Information Architecture \n• UX Strategy \n• User Testing and Analysis \n• Agile / Lean Methodologies \n• Product Strategy \n• Product Management \n• Design Leadership I care deeply about designing for meaningful outcomes. Not all problems are created equal so it’s important we identify opportunities that produce value for our customers. Through research and analysis, explorations and experiments I help businesses build things that matter. \n \nAt a Glance \n• I practice user-centered design and I am a product management geek. \n• I help teams think through complex problems and build alignment toward common goals. \n• My design process is forever evolving as I learn new things and work within new environments. \n• I lean on years of personal expertise and user research to ask beautiful questions. \n• I lead design conversations through sketches, mock-ups, user flows, wireframes and prototypes. \n• I'm a user experience designer amused by human behavior and how it informs behavioral design. \n \nAreas of Interest \n• User-centered Design \n• Interaction Design \n• Behavioral Design \n• Visual Design \n• Information Architecture \n• UX Strategy \n• User Testing and Analysis \n• Agile / Lean Methodologies \n• Product Strategy \n• Product Management \n• Design Leadership I care deeply about designing for meaningful outcomes. Not all problems are created equal so it’s important we identify opportunities that produce value for our customers. Through research and analysis, explorations and experiments I help businesses build things that matter. \n \nAt a Glance \n• I practice user-centered design and I am a product management geek. \n• I help teams think through complex problems and build alignment toward common goals. \n• My design process is forever evolving as I learn new things and work within new environments. \n• I lean on years of personal expertise and user research to ask beautiful questions. \n• I lead design conversations through sketches, mock-ups, user flows, wireframes and prototypes. \n• I'm a user experience designer amused by human behavior and how it informs behavioral design. \n \nAreas of Interest \n• User-centered Design \n• Interaction Design \n• Behavioral Design \n• Visual Design \n• Information Architecture \n• UX Strategy \n• User Testing and Analysis \n• Agile / Lean Methodologies \n• Product Strategy \n• Product Management \n• Design Leadership Experience Senior UX Designer Scripps Networks Interactive January 2013  – Present (2 years 8 months) San Francisco •\tProvide design leadership throughout Ulive. \n•\tIdentify product opportunities to increase video engagement. \n•\tLead redesign of Video Playlist and Player Configuration workflow for ULN Client Portal. \n•\tDesigned ulive.com grid and baseline for faster and more accurate translation of design to code. \n•\tEstablished Lean UX/Agile development processes to increase efficiency of product development. \n•\tEstablished usability and a/b testing as integral component to inform product decisions. Senior UX Designer ClairMail November 2011  –  November 2012  (1 year 1 month) San Rafael, CA •\tLead redesign of Clairmail Mobile Banking App 5.0. \n•\tDesigned and facilitated product design workshop for Clairmail 2012 Kick-Off with 140 employees. UX Designer (Consultant) Google July 2011  –  October 2011  (4 months) San Francisco •\tDesign “Deal of the Day” emails and collaborate with designers on Google Offers website.  \n•\tCollaborate with product managers to design merchant-side create and reporting workflows. UX Designer (Consultant) Wells Fargo March 2010  –  July 2011  (1 year 5 months) San Francisco •\tLead redesign of CEO Mobile Web and ACH payments workflow. \n•\tDesign and deliver new features and user interface enhancements for CEO Portal. UX Designer Help Each Other May 2008  –  January 2010  (1 year 9 months) •\tResponsible for leading all design efforts and taking HEO from concept to beta. \n•\tHired and lead a distributed team of contract copywriters, illustrators and engineers. Presentation Specialist Gameloft July 2007  –  March 2008  (9 months) •\tLead presentation designer for NYC and Paris executives, producers and product managers. \n•\tDesigned presentation for GDC Mobile 2008 keynote for CEO Michel Guillemot. Senior Designer Vonage 2001  –  2007  (6 years) •\tDesigned sign-up flows, landing pages and user consoles for consumer facing website. \n•\tDesigned fund-raising pitch books for rounds A through IPO. \n•\tPresentation designer for all United States, Europe and Canada offices\u2028. \n•\tManage vendor relationships to deliver marketing collateral. \n•\tDirector of “Vonage 1 Million Customers Celebration” party for 800+ employees ($50,000 budget). Founder Parade ATW 2004  –  2005  (1 year) •\tDesigned and lead the development of Parade ATW from concept to beta. \n•\tLead a distributed team of writers, developers, and photographers. \n•\tPhotographed thousands of photos for parties, performances, patrons, and special events. \n•\tPublished hundreds of stories, party reviews and artist interviews (including the Beastie Boys). \n•\tDirected on-location video shoots for Parade ATW original “on-location” shorts. Graphic Designer nVision NYC April 2000  –  April 2001  (1 year 1 month) NYC •\tDesigned presentations for Fortune 500 companies, including Forbes and Tommy Hilfiger.\u2028 \n•\tPhotographed products for client websites. \n•\tDesigned web sites and print collateral. Senior UX Designer Scripps Networks Interactive January 2013  – Present (2 years 8 months) San Francisco •\tProvide design leadership throughout Ulive. \n•\tIdentify product opportunities to increase video engagement. \n•\tLead redesign of Video Playlist and Player Configuration workflow for ULN Client Portal. \n•\tDesigned ulive.com grid and baseline for faster and more accurate translation of design to code. \n•\tEstablished Lean UX/Agile development processes to increase efficiency of product development. \n•\tEstablished usability and a/b testing as integral component to inform product decisions. Senior UX Designer Scripps Networks Interactive January 2013  – Present (2 years 8 months) San Francisco •\tProvide design leadership throughout Ulive. \n•\tIdentify product opportunities to increase video engagement. \n•\tLead redesign of Video Playlist and Player Configuration workflow for ULN Client Portal. \n•\tDesigned ulive.com grid and baseline for faster and more accurate translation of design to code. \n•\tEstablished Lean UX/Agile development processes to increase efficiency of product development. \n•\tEstablished usability and a/b testing as integral component to inform product decisions. Senior UX Designer ClairMail November 2011  –  November 2012  (1 year 1 month) San Rafael, CA •\tLead redesign of Clairmail Mobile Banking App 5.0. \n•\tDesigned and facilitated product design workshop for Clairmail 2012 Kick-Off with 140 employees. Senior UX Designer ClairMail November 2011  –  November 2012  (1 year 1 month) San Rafael, CA •\tLead redesign of Clairmail Mobile Banking App 5.0. \n•\tDesigned and facilitated product design workshop for Clairmail 2012 Kick-Off with 140 employees. UX Designer (Consultant) Google July 2011  –  October 2011  (4 months) San Francisco •\tDesign “Deal of the Day” emails and collaborate with designers on Google Offers website.  \n•\tCollaborate with product managers to design merchant-side create and reporting workflows. UX Designer (Consultant) Google July 2011  –  October 2011  (4 months) San Francisco •\tDesign “Deal of the Day” emails and collaborate with designers on Google Offers website.  \n•\tCollaborate with product managers to design merchant-side create and reporting workflows. UX Designer (Consultant) Wells Fargo March 2010  –  July 2011  (1 year 5 months) San Francisco •\tLead redesign of CEO Mobile Web and ACH payments workflow. \n•\tDesign and deliver new features and user interface enhancements for CEO Portal. UX Designer (Consultant) Wells Fargo March 2010  –  July 2011  (1 year 5 months) San Francisco •\tLead redesign of CEO Mobile Web and ACH payments workflow. \n•\tDesign and deliver new features and user interface enhancements for CEO Portal. UX Designer Help Each Other May 2008  –  January 2010  (1 year 9 months) •\tResponsible for leading all design efforts and taking HEO from concept to beta. \n•\tHired and lead a distributed team of contract copywriters, illustrators and engineers. UX Designer Help Each Other May 2008  –  January 2010  (1 year 9 months) •\tResponsible for leading all design efforts and taking HEO from concept to beta. \n•\tHired and lead a distributed team of contract copywriters, illustrators and engineers. Presentation Specialist Gameloft July 2007  –  March 2008  (9 months) •\tLead presentation designer for NYC and Paris executives, producers and product managers. \n•\tDesigned presentation for GDC Mobile 2008 keynote for CEO Michel Guillemot. Presentation Specialist Gameloft July 2007  –  March 2008  (9 months) •\tLead presentation designer for NYC and Paris executives, producers and product managers. \n•\tDesigned presentation for GDC Mobile 2008 keynote for CEO Michel Guillemot. Senior Designer Vonage 2001  –  2007  (6 years) •\tDesigned sign-up flows, landing pages and user consoles for consumer facing website. \n•\tDesigned fund-raising pitch books for rounds A through IPO. \n•\tPresentation designer for all United States, Europe and Canada offices\u2028. \n•\tManage vendor relationships to deliver marketing collateral. \n•\tDirector of “Vonage 1 Million Customers Celebration” party for 800+ employees ($50,000 budget). Senior Designer Vonage 2001  –  2007  (6 years) •\tDesigned sign-up flows, landing pages and user consoles for consumer facing website. \n•\tDesigned fund-raising pitch books for rounds A through IPO. \n•\tPresentation designer for all United States, Europe and Canada offices\u2028. \n•\tManage vendor relationships to deliver marketing collateral. \n•\tDirector of “Vonage 1 Million Customers Celebration” party for 800+ employees ($50,000 budget). Founder Parade ATW 2004  –  2005  (1 year) •\tDesigned and lead the development of Parade ATW from concept to beta. \n•\tLead a distributed team of writers, developers, and photographers. \n•\tPhotographed thousands of photos for parties, performances, patrons, and special events. \n•\tPublished hundreds of stories, party reviews and artist interviews (including the Beastie Boys). \n•\tDirected on-location video shoots for Parade ATW original “on-location” shorts. Founder Parade ATW 2004  –  2005  (1 year) •\tDesigned and lead the development of Parade ATW from concept to beta. \n•\tLead a distributed team of writers, developers, and photographers. \n•\tPhotographed thousands of photos for parties, performances, patrons, and special events. \n•\tPublished hundreds of stories, party reviews and artist interviews (including the Beastie Boys). \n•\tDirected on-location video shoots for Parade ATW original “on-location” shorts. Graphic Designer nVision NYC April 2000  –  April 2001  (1 year 1 month) NYC •\tDesigned presentations for Fortune 500 companies, including Forbes and Tommy Hilfiger.\u2028 \n•\tPhotographed products for client websites. \n•\tDesigned web sites and print collateral. Graphic Designer nVision NYC April 2000  –  April 2001  (1 year 1 month) NYC •\tDesigned presentations for Fortune 500 companies, including Forbes and Tommy Hilfiger.\u2028 \n•\tPhotographed products for client websites. \n•\tDesigned web sites and print collateral. Skills User Experience Mobile Applications Web Design Information Architecture Mobile Devices User Interface Design Interaction Design User Experience Design CSS Adobe Creative Suite Usability Testing HTML Music Production Product Development User Interface Web Development User-centered Design Agile Methodologies Product Management Start-ups Usability Wireframes Thought Leadership Team Leadership Visual Design User Scenarios Heuristic Evaluation User Research Mobile Design OmniGraffle OptimalWorkshop Sketch App Verify App InVision SurveyMonkey Lean Thinking Strategic Planning Card Sorting See 23+     See less Skills  User Experience Mobile Applications Web Design Information Architecture Mobile Devices User Interface Design Interaction Design User Experience Design CSS Adobe Creative Suite Usability Testing HTML Music Production Product Development User Interface Web Development User-centered Design Agile Methodologies Product Management Start-ups Usability Wireframes Thought Leadership Team Leadership Visual Design User Scenarios Heuristic Evaluation User Research Mobile Design OmniGraffle OptimalWorkshop Sketch App Verify App InVision SurveyMonkey Lean Thinking Strategic Planning Card Sorting See 23+     See less User Experience Mobile Applications Web Design Information Architecture Mobile Devices User Interface Design Interaction Design User Experience Design CSS Adobe Creative Suite Usability Testing HTML Music Production Product Development User Interface Web Development User-centered Design Agile Methodologies Product Management Start-ups Usability Wireframes Thought Leadership Team Leadership Visual Design User Scenarios Heuristic Evaluation User Research Mobile Design OmniGraffle OptimalWorkshop Sketch App Verify App InVision SurveyMonkey Lean Thinking Strategic Planning Card Sorting See 23+     See less User Experience Mobile Applications Web Design Information Architecture Mobile Devices User Interface Design Interaction Design User Experience Design CSS Adobe Creative Suite Usability Testing HTML Music Production Product Development User Interface Web Development User-centered Design Agile Methodologies Product Management Start-ups Usability Wireframes Thought Leadership Team Leadership Visual Design User Scenarios Heuristic Evaluation User Research Mobile Design OmniGraffle OptimalWorkshop Sketch App Verify App InVision SurveyMonkey Lean Thinking Strategic Planning Card Sorting See 23+     See less Education Full Sail University Associates,  Recording Engineering 1996  – 1997 Full Sail University Associates,  Recording Engineering 1996  – 1997 Full Sail University Associates,  Recording Engineering 1996  – 1997 Full Sail University Associates,  Recording Engineering 1996  – 1997 ", "Skills CSS Usability Testing PHP User-centered Design Heuristic Evaluation Interaction Design Paper Prototyping User Interface XHTML User Research User Interface Design Contextual Inquiry User Experience User Experience Design Human Computer... Usability Engineering Persona Usability See 3+     See less Skills  CSS Usability Testing PHP User-centered Design Heuristic Evaluation Interaction Design Paper Prototyping User Interface XHTML User Research User Interface Design Contextual Inquiry User Experience User Experience Design Human Computer... Usability Engineering Persona Usability See 3+     See less CSS Usability Testing PHP User-centered Design Heuristic Evaluation Interaction Design Paper Prototyping User Interface XHTML User Research User Interface Design Contextual Inquiry User Experience User Experience Design Human Computer... Usability Engineering Persona Usability See 3+     See less CSS Usability Testing PHP User-centered Design Heuristic Evaluation Interaction Design Paper Prototyping User Interface XHTML User Research User Interface Design Contextual Inquiry User Experience User Experience Design Human Computer... Usability Engineering Persona Usability See 3+     See less ", "Experience Senior UX Designer Google January 2013  – Present (2 years 8 months) Mountain View, CA Senior UX Designer Google January 2013  – Present (2 years 8 months) Mountain View, CA Senior UX Designer Google January 2013  – Present (2 years 8 months) Mountain View, CA Skills Google Analytics Usability Testing Human Computer... User Research User-centered Design User Experience User Interface Design HTML CSS Information Architecture Design Management Product Design Wireframes Interaction Design Data Analysis Persona User Interface Task Analysis Product Management Paper Prototyping Information... Visual Design Wire Framing User Experience Design Web Development Usability Heuristic Evaluation People Development A/B testing Contextual Inquiry Usability Engineering Mobile Design Card Sorting Experience Design Front-end OmniGraffle User Scenarios Information Design Rapid Prototyping Mockups See 25+     See less Skills  Google Analytics Usability Testing Human Computer... User Research User-centered Design User Experience User Interface Design HTML CSS Information Architecture Design Management Product Design Wireframes Interaction Design Data Analysis Persona User Interface Task Analysis Product Management Paper Prototyping Information... Visual Design Wire Framing User Experience Design Web Development Usability Heuristic Evaluation People Development A/B testing Contextual Inquiry Usability Engineering Mobile Design Card Sorting Experience Design Front-end OmniGraffle User Scenarios Information Design Rapid Prototyping Mockups See 25+     See less Google Analytics Usability Testing Human Computer... User Research User-centered Design User Experience User Interface Design HTML CSS Information Architecture Design Management Product Design Wireframes Interaction Design Data Analysis Persona User Interface Task Analysis Product Management Paper Prototyping Information... Visual Design Wire Framing User Experience Design Web Development Usability Heuristic Evaluation People Development A/B testing Contextual Inquiry Usability Engineering Mobile Design Card Sorting Experience Design Front-end OmniGraffle User Scenarios Information Design Rapid Prototyping Mockups See 25+     See less Google Analytics Usability Testing Human Computer... User Research User-centered Design User Experience User Interface Design HTML CSS Information Architecture Design Management Product Design Wireframes Interaction Design Data Analysis Persona User Interface Task Analysis Product Management Paper Prototyping Information... Visual Design Wire Framing User Experience Design Web Development Usability Heuristic Evaluation People Development A/B testing Contextual Inquiry Usability Engineering Mobile Design Card Sorting Experience Design Front-end OmniGraffle User Scenarios Information Design Rapid Prototyping Mockups See 25+     See less ", "Experience Senior Interaction Designer Google April 2014  – Present (1 year 5 months) Senior UX Designer (contract) Google August 2013  –  April 2014  (9 months) New York, NY Senior UX Designer Case Commons, Inc. September 2011  –  June 2013  (1 year 10 months) New York, NY Senior UX Designer Scholastic August 2010  –  September 2011  (1 year 2 months) New York, NY Senior Information Architect Barnes & Noble.com October 2007  –  July 2010  (2 years 10 months) New York, NY Interaction Designer Independent Consulting February 2003  –  October 2007  (4 years 9 months) San Francisco, CA & New York, NY Senior Designer & Project Manager Media Pro Inc. February 2000  –  July 2005  (5 years 6 months) San Francisco, CA Senior Interaction Designer Google April 2014  – Present (1 year 5 months) Senior Interaction Designer Google April 2014  – Present (1 year 5 months) Senior UX Designer (contract) Google August 2013  –  April 2014  (9 months) New York, NY Senior UX Designer (contract) Google August 2013  –  April 2014  (9 months) New York, NY Senior UX Designer Case Commons, Inc. September 2011  –  June 2013  (1 year 10 months) New York, NY Senior UX Designer Case Commons, Inc. September 2011  –  June 2013  (1 year 10 months) New York, NY Senior UX Designer Scholastic August 2010  –  September 2011  (1 year 2 months) New York, NY Senior UX Designer Scholastic August 2010  –  September 2011  (1 year 2 months) New York, NY Senior Information Architect Barnes & Noble.com October 2007  –  July 2010  (2 years 10 months) New York, NY Senior Information Architect Barnes & Noble.com October 2007  –  July 2010  (2 years 10 months) New York, NY Interaction Designer Independent Consulting February 2003  –  October 2007  (4 years 9 months) San Francisco, CA & New York, NY Interaction Designer Independent Consulting February 2003  –  October 2007  (4 years 9 months) San Francisco, CA & New York, NY Senior Designer & Project Manager Media Pro Inc. February 2000  –  July 2005  (5 years 6 months) San Francisco, CA Senior Designer & Project Manager Media Pro Inc. February 2000  –  July 2005  (5 years 6 months) San Francisco, CA Skills Interaction Design User Interface Design User Experience Information Architecture User-centered Design User Experience Design Experience Design User Interface Usability Information Design Web Design Usability Testing Creative Direction Site Maps Rapid Prototyping Wireframes Mobile Devices Accessibility Design Strategy Mobile Design OmniGraffle Wire Framing Heuristic Evaluation Visual Design User Research Usability Engineering See 11+     See less Skills  Interaction Design User Interface Design User Experience Information Architecture User-centered Design User Experience Design Experience Design User Interface Usability Information Design Web Design Usability Testing Creative Direction Site Maps Rapid Prototyping Wireframes Mobile Devices Accessibility Design Strategy Mobile Design OmniGraffle Wire Framing Heuristic Evaluation Visual Design User Research Usability Engineering See 11+     See less Interaction Design User Interface Design User Experience Information Architecture User-centered Design User Experience Design Experience Design User Interface Usability Information Design Web Design Usability Testing Creative Direction Site Maps Rapid Prototyping Wireframes Mobile Devices Accessibility Design Strategy Mobile Design OmniGraffle Wire Framing Heuristic Evaluation Visual Design User Research Usability Engineering See 11+     See less Interaction Design User Interface Design User Experience Information Architecture User-centered Design User Experience Design Experience Design User Interface Usability Information Design Web Design Usability Testing Creative Direction Site Maps Rapid Prototyping Wireframes Mobile Devices Accessibility Design Strategy Mobile Design OmniGraffle Wire Framing Heuristic Evaluation Visual Design User Research Usability Engineering See 11+     See less Education New York University MPS 2005  – 2007 San Francisco State University BA 1995  – 2000 New York University MPS 2005  – 2007 New York University MPS 2005  – 2007 New York University MPS 2005  – 2007 San Francisco State University BA 1995  – 2000 San Francisco State University BA 1995  – 2000 San Francisco State University BA 1995  – 2000 ", "Summary Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Summary Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Experience Senior Product Designer Google Android Wear February 2015  – Present (7 months) Mountain View, CA Android Wear + Google Now \n• Platform lead designer working at the nexus of Android Wear and Google Now.  \n• Exploring next generation experiences (wearable and voice interactions) for Google Now in Wear platform.  Senior UX Designer Google Android February 2014  – Present (1 year 7 months) Mountain View, CA Google Now \n• Understanding users and creating helpful/predictive experiences that help users the most, in the moment.  \n• Design for Google Now content cards and \"Ok Google\" voice interactions. Senior Product Designer Google Android Wear February 2015  – Present (7 months) Mountain View, CA Android Wear + Google Now \n• Platform lead designer working at the nexus of Android Wear and Google Now.  \n• Exploring next generation experiences (wearable and voice interactions) for Google Now in Wear platform.  Senior Product Designer Google Android Wear February 2015  – Present (7 months) Mountain View, CA Android Wear + Google Now \n• Platform lead designer working at the nexus of Android Wear and Google Now.  \n• Exploring next generation experiences (wearable and voice interactions) for Google Now in Wear platform.  Senior UX Designer Google Android February 2014  – Present (1 year 7 months) Mountain View, CA Google Now \n• Understanding users and creating helpful/predictive experiences that help users the most, in the moment.  \n• Design for Google Now content cards and \"Ok Google\" voice interactions. Senior UX Designer Google Android February 2014  – Present (1 year 7 months) Mountain View, CA Google Now \n• Understanding users and creating helpful/predictive experiences that help users the most, in the moment.  \n• Design for Google Now content cards and \"Ok Google\" voice interactions. Skills Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Skills  Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Education Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 ", "Summary Specialties:Interface concept generation and development, Rapid Prototyping, Designing for CSS, Producing wireframes and specification documents, Facilitating brainstorms, Planning and running user testing, Managing stakeholders, Working in multidisciplinary teams Summary Specialties:Interface concept generation and development, Rapid Prototyping, Designing for CSS, Producing wireframes and specification documents, Facilitating brainstorms, Planning and running user testing, Managing stakeholders, Working in multidisciplinary teams Specialties:Interface concept generation and development, Rapid Prototyping, Designing for CSS, Producing wireframes and specification documents, Facilitating brainstorms, Planning and running user testing, Managing stakeholders, Working in multidisciplinary teams Specialties:Interface concept generation and development, Rapid Prototyping, Designing for CSS, Producing wireframes and specification documents, Facilitating brainstorms, Planning and running user testing, Managing stakeholders, Working in multidisciplinary teams Experience Senior UX Designer Google January 2015  – Present (8 months) San Francisco Bay Area Still Google Maps! Senior UX Designer Google January 2012  –  December 2014  (3 years) Sydney Area, Australia Google Maps! UX Lead Google August 2011  –  December 2011  (5 months) London, United Kingdom UX Lead on Google Art Project Senior Designer BBC Audio & Music Interactive August 2006  –  August 2011  (5 years 1 month) London, United Kingdom Designer BBC Children's Interactive April 2003  –  August 2006  (3 years 5 months) Junior Designer BBC New Media August 2002  –  April 2003  (9 months) Senior UX Designer Google January 2015  – Present (8 months) San Francisco Bay Area Still Google Maps! Senior UX Designer Google January 2015  – Present (8 months) San Francisco Bay Area Still Google Maps! Senior UX Designer Google January 2012  –  December 2014  (3 years) Sydney Area, Australia Google Maps! Senior UX Designer Google January 2012  –  December 2014  (3 years) Sydney Area, Australia Google Maps! UX Lead Google August 2011  –  December 2011  (5 months) London, United Kingdom UX Lead on Google Art Project UX Lead Google August 2011  –  December 2011  (5 months) London, United Kingdom UX Lead on Google Art Project Senior Designer BBC Audio & Music Interactive August 2006  –  August 2011  (5 years 1 month) London, United Kingdom Senior Designer BBC Audio & Music Interactive August 2006  –  August 2011  (5 years 1 month) London, United Kingdom Designer BBC Children's Interactive April 2003  –  August 2006  (3 years 5 months) Designer BBC Children's Interactive April 2003  –  August 2006  (3 years 5 months) Junior Designer BBC New Media August 2002  –  April 2003  (9 months) Junior Designer BBC New Media August 2002  –  April 2003  (9 months) Languages   Skills User Experience Concept Generation User Interface Design Rapid Prototyping Usability Testing User-centered Design Digital Media Information Architecture Wire Framing Sketching Research Art Direction Team Leadership Interaction Design CSS Visual Design User Experience Design Wireframes User Research Experience Design Information Design User Interface OmniGraffle Mobile Design Service Design Usability Accessibility Design Strategy User Scenarios Web Standards Usability Engineering See 16+     See less Skills  User Experience Concept Generation User Interface Design Rapid Prototyping Usability Testing User-centered Design Digital Media Information Architecture Wire Framing Sketching Research Art Direction Team Leadership Interaction Design CSS Visual Design User Experience Design Wireframes User Research Experience Design Information Design User Interface OmniGraffle Mobile Design Service Design Usability Accessibility Design Strategy User Scenarios Web Standards Usability Engineering See 16+     See less User Experience Concept Generation User Interface Design Rapid Prototyping Usability Testing User-centered Design Digital Media Information Architecture Wire Framing Sketching Research Art Direction Team Leadership Interaction Design CSS Visual Design User Experience Design Wireframes User Research Experience Design Information Design User Interface OmniGraffle Mobile Design Service Design Usability Accessibility Design Strategy User Scenarios Web Standards Usability Engineering See 16+     See less User Experience Concept Generation User Interface Design Rapid Prototyping Usability Testing User-centered Design Digital Media Information Architecture Wire Framing Sketching Research Art Direction Team Leadership Interaction Design CSS Visual Design User Experience Design Wireframes User Research Experience Design Information Design User Interface OmniGraffle Mobile Design Service Design Usability Accessibility Design Strategy User Scenarios Web Standards Usability Engineering See 16+     See less Education De Montfort University BA,  Multimedia Design 1999  – 2002 De Montfort University BA,  Multimedia Design 1999  – 2002 De Montfort University BA,  Multimedia Design 1999  – 2002 De Montfort University BA,  Multimedia Design 1999  – 2002 Honors & Awards Additional Honors & Awards 2012 \nWebby (People's Voice Winner, Art) - Google Art Project \nSONY (Bronze, Best Use of Multiplatform) - BBC Radio1 \n \n2011 \nSONY (Bronze, Best Use of Multiplatform) - History Of The World \nWebby (nominated, Radio) - History Of The World \nBroadcast Digital (nominated, Best Use of Interactive) - History Of The World \n \n2010 \nBIMA (nominated, Arts & Culture) - History Of The World \nPrix Europa (special commendation, Emerging Media) - History Of The World \n \n2006 \nBAFTA (nominated, Interactive) - CBeebies Springwatch \n \n2002 \nBBC Vision Design Award Additional Honors & Awards 2012 \nWebby (People's Voice Winner, Art) - Google Art Project \nSONY (Bronze, Best Use of Multiplatform) - BBC Radio1 \n \n2011 \nSONY (Bronze, Best Use of Multiplatform) - History Of The World \nWebby (nominated, Radio) - History Of The World \nBroadcast Digital (nominated, Best Use of Interactive) - History Of The World \n \n2010 \nBIMA (nominated, Arts & Culture) - History Of The World \nPrix Europa (special commendation, Emerging Media) - History Of The World \n \n2006 \nBAFTA (nominated, Interactive) - CBeebies Springwatch \n \n2002 \nBBC Vision Design Award Additional Honors & Awards 2012 \nWebby (People's Voice Winner, Art) - Google Art Project \nSONY (Bronze, Best Use of Multiplatform) - BBC Radio1 \n \n2011 \nSONY (Bronze, Best Use of Multiplatform) - History Of The World \nWebby (nominated, Radio) - History Of The World \nBroadcast Digital (nominated, Best Use of Interactive) - History Of The World \n \n2010 \nBIMA (nominated, Arts & Culture) - History Of The World \nPrix Europa (special commendation, Emerging Media) - History Of The World \n \n2006 \nBAFTA (nominated, Interactive) - CBeebies Springwatch \n \n2002 \nBBC Vision Design Award Additional Honors & Awards 2012 \nWebby (People's Voice Winner, Art) - Google Art Project \nSONY (Bronze, Best Use of Multiplatform) - BBC Radio1 \n \n2011 \nSONY (Bronze, Best Use of Multiplatform) - History Of The World \nWebby (nominated, Radio) - History Of The World \nBroadcast Digital (nominated, Best Use of Interactive) - History Of The World \n \n2010 \nBIMA (nominated, Arts & Culture) - History Of The World \nPrix Europa (special commendation, Emerging Media) - History Of The World \n \n2006 \nBAFTA (nominated, Interactive) - CBeebies Springwatch \n \n2002 \nBBC Vision Design Award ", "Experience Senior UX Designer - Payments - Emerging Markets Google November 2014  – Present (10 months) San Francisco Bay Area Senior UX Designer - Google Glass Google June 2012  –  November 2014  (2 years 6 months) Mountain View, CA Principal / Founder JLo Design June 2010  –  June 2012  (2 years 1 month) Recent work: One Kings Lane, eBay, Intuit, Project Slice, WebPFM, Susie Fox and more. Senior Interaction Designer & Manager eBay June 2008  –  July 2010  (2 years 2 months) San Francisco Bay Area Information Architecture / User Experience MTV.com 2006  –  2008  (2 years) Producer, Video Music Awards MTV.com May 2006  –  September 2006  (5 months) Interactive Art Director DCTV April 2003  –  May 2006  (3 years 2 months) P.A., Research + Copywriting P.O.V. Interactive / American Documentary June 2002  –  February 2003  (9 months) Senior UX Designer - Payments - Emerging Markets Google November 2014  – Present (10 months) San Francisco Bay Area Senior UX Designer - Payments - Emerging Markets Google November 2014  – Present (10 months) San Francisco Bay Area Senior UX Designer - Google Glass Google June 2012  –  November 2014  (2 years 6 months) Mountain View, CA Senior UX Designer - Google Glass Google June 2012  –  November 2014  (2 years 6 months) Mountain View, CA Principal / Founder JLo Design June 2010  –  June 2012  (2 years 1 month) Recent work: One Kings Lane, eBay, Intuit, Project Slice, WebPFM, Susie Fox and more. Principal / Founder JLo Design June 2010  –  June 2012  (2 years 1 month) Recent work: One Kings Lane, eBay, Intuit, Project Slice, WebPFM, Susie Fox and more. Senior Interaction Designer & Manager eBay June 2008  –  July 2010  (2 years 2 months) San Francisco Bay Area Senior Interaction Designer & Manager eBay June 2008  –  July 2010  (2 years 2 months) San Francisco Bay Area Information Architecture / User Experience MTV.com 2006  –  2008  (2 years) Information Architecture / User Experience MTV.com 2006  –  2008  (2 years) Producer, Video Music Awards MTV.com May 2006  –  September 2006  (5 months) Producer, Video Music Awards MTV.com May 2006  –  September 2006  (5 months) Interactive Art Director DCTV April 2003  –  May 2006  (3 years 2 months) Interactive Art Director DCTV April 2003  –  May 2006  (3 years 2 months) P.A., Research + Copywriting P.O.V. Interactive / American Documentary June 2002  –  February 2003  (9 months) P.A., Research + Copywriting P.O.V. Interactive / American Documentary June 2002  –  February 2003  (9 months) Skills User Interface Design Interaction Design Information Architecture Competitive Analysis User Experience Visual Design Mobile Design CSS Usability User Experience Design User Research Web Design Typography E-commerce HTML User-centered Design See 1+     See less Skills  User Interface Design Interaction Design Information Architecture Competitive Analysis User Experience Visual Design Mobile Design CSS Usability User Experience Design User Research Web Design Typography E-commerce HTML User-centered Design See 1+     See less User Interface Design Interaction Design Information Architecture Competitive Analysis User Experience Visual Design Mobile Design CSS Usability User Experience Design User Research Web Design Typography E-commerce HTML User-centered Design See 1+     See less User Interface Design Interaction Design Information Architecture Competitive Analysis User Experience Visual Design Mobile Design CSS Usability User Experience Design User Research Web Design Typography E-commerce HTML User-centered Design See 1+     See less Education University of California, Santa Cruz BA,  Anthropology Activities and Societies:  CalPIRG Università di Bologna Anthropology University of California, Santa Cruz BA,  Anthropology Activities and Societies:  CalPIRG University of California, Santa Cruz BA,  Anthropology Activities and Societies:  CalPIRG University of California, Santa Cruz BA,  Anthropology Activities and Societies:  CalPIRG Università di Bologna Anthropology Università di Bologna Anthropology Università di Bologna Anthropology Honors & Awards ", "Skills Interaction Design User Experience Software User Interface User Interface Design Wireframes Web Design Flash User-centered Design Information Architecture Animation Flash Animation User Experience Design Information Design Graphics Usability Engineering Mobile Applications Web Development Usability Testing Agile Methodologies See 5+     See less Skills  Interaction Design User Experience Software User Interface User Interface Design Wireframes Web Design Flash User-centered Design Information Architecture Animation Flash Animation User Experience Design Information Design Graphics Usability Engineering Mobile Applications Web Development Usability Testing Agile Methodologies See 5+     See less Interaction Design User Experience Software User Interface User Interface Design Wireframes Web Design Flash User-centered Design Information Architecture Animation Flash Animation User Experience Design Information Design Graphics Usability Engineering Mobile Applications Web Development Usability Testing Agile Methodologies See 5+     See less Interaction Design User Experience Software User Interface User Interface Design Wireframes Web Design Flash User-centered Design Information Architecture Animation Flash Animation User Experience Design Information Design Graphics Usability Engineering Mobile Applications Web Development Usability Testing Agile Methodologies See 5+     See less Honors & Awards ", "Skills Interaction Design Visual Design Mobile Design User Experience Design User Experience User Interface User Interface Design Skills  Interaction Design Visual Design Mobile Design User Experience Design User Experience User Interface User Interface Design Interaction Design Visual Design Mobile Design User Experience Design User Experience User Interface User Interface Design Interaction Design Visual Design Mobile Design User Experience Design User Experience User Interface User Interface Design ", "Summary I’m a seasoned user experience and interaction designer with hands-on experience in working closely with some of the largest international, US and Australian brands on high profile projects.  \n \nI have a strong background in design for multi-platform and emerging technologies, such as mobile, tablets, connected TV and inflight entertainment. I am passionate about the intersect of the physical and the digital, the relationship between hardware and software, and I love exploring the extension of experience design beyond the interface. \n \nI am a natural leader with strong stakeholder management skills with creative flair and a keen eye for balancing innovation and business strategy with real user needs. \n \nPortfolio available on request. Summary I’m a seasoned user experience and interaction designer with hands-on experience in working closely with some of the largest international, US and Australian brands on high profile projects.  \n \nI have a strong background in design for multi-platform and emerging technologies, such as mobile, tablets, connected TV and inflight entertainment. I am passionate about the intersect of the physical and the digital, the relationship between hardware and software, and I love exploring the extension of experience design beyond the interface. \n \nI am a natural leader with strong stakeholder management skills with creative flair and a keen eye for balancing innovation and business strategy with real user needs. \n \nPortfolio available on request. I’m a seasoned user experience and interaction designer with hands-on experience in working closely with some of the largest international, US and Australian brands on high profile projects.  \n \nI have a strong background in design for multi-platform and emerging technologies, such as mobile, tablets, connected TV and inflight entertainment. I am passionate about the intersect of the physical and the digital, the relationship between hardware and software, and I love exploring the extension of experience design beyond the interface. \n \nI am a natural leader with strong stakeholder management skills with creative flair and a keen eye for balancing innovation and business strategy with real user needs. \n \nPortfolio available on request. I’m a seasoned user experience and interaction designer with hands-on experience in working closely with some of the largest international, US and Australian brands on high profile projects.  \n \nI have a strong background in design for multi-platform and emerging technologies, such as mobile, tablets, connected TV and inflight entertainment. I am passionate about the intersect of the physical and the digital, the relationship between hardware and software, and I love exploring the extension of experience design beyond the interface. \n \nI am a natural leader with strong stakeholder management skills with creative flair and a keen eye for balancing innovation and business strategy with real user needs. \n \nPortfolio available on request. Experience Senior UX Designer Hootsuite Media Inc. August 2015  – Present (1 month) Vancouver, Canada Area Senior UX Designer Google November 2014  –  June 2015  (8 months) Mountain View, CA During this time, I worked on Human-Machine Interaction Design (HMI) on the Google Robotics team. \n \nCollaborating closely with a small team of Roboticists and Engineers, I helped design magical and novel ways to interact meaningfully with Robots. UX Designer III Google October 2013  –  November 2014  (1 year 2 months) Mountain View, CA During my first year at Google, I worked on the Identity and Authentication team, leading the user experience design for complex, cross-product projects with a very high impact and visibility on Google and Google's user base. In addition to launching a redesign of the Android Sign In/Sign Up flow, I helped empower the Identity design team by improving their design process, collaboration skills, and helping mentor team members. Senior Interaction Designer frog January 2013  –  September 2013  (9 months) San Francisco Bay Area As a Senior Interaction Designer at frog, I worked in small teams of amazing designers and strategists to deliver magical and effective solutions for our clients. I focused on building strong, trusted working relationships with our clients through inclusive workshops, and tight feedback loops, resulting in some amazing outcomes for projects such as: \n- a future vision for a flagship mobile product for a major OEM \n- A complete site redesign and long term business strategy for a beloved brand Yellow Pages, alongside their digital rebrand to YP.com  \n- product positioning strategy and user experience vision concepts for Verizon Communications & Messaging across multiple platforms, focusing on mobile \n \nClients included: \nA major OEM, Verizon, Westfield, Yellow Pages (YP.COM) Senior Interaction Designer frog April 2012  –  October 2012  (7 months) Sydney Area, Australia I led the user experience design for several high profile projects during frog’s long-term engagement with Telstra - a major telecommunications company in Australia. Working on-site with Telstra, we helped reimagine the online shopping experience for Telstra’s diverse range of phone, mobile, internet, and television products and services. Integrating closely with their internal development teams, I helped instill and foster a strong Agile development culture at Telstra that included design thinking in the process. Principal UX Architect Massive Interactive July 2011  –  February 2012  (8 months) Sydney, Australia I led the UX team in Sydney to drive innovative and effective solutions for our clients. I was involved closely up-front with client and stakeholder management, strategy and concept design. For key projects, I worked end to end whilst delegating tasks and overseeing a large range of other projects across the team. I closely mentored and outlined professional development plans for UX team members to ensure our process was constantly growing and evolving to suit the ever-changing design problem space. In addition, I was involved in creative pitches for new business, most of which were successful in winning high profile work, such as with the BBC. \n \nSpeaking: \nCo-presented \"Shaping the future of BBC News for the connected Home\" at UX Australia 2011 \nPresented \"The Upside of Stakeholder Involvement (10 min talk)\" at UX Australia 2011 \n \nClients included: \nEmirates, Panasonic Avionics, Iberia, Telstra, TAB Senior UX Architect Massive Interactive July 2009  –  July 2011  (2 years 1 month) Sydney, Australia During my time as a Senior UX Architect, I was the UX lead for many key projects, running the project end to end from discover, concept through to detailed specifications. In particular, the strength of the work produced and strong client relationships built with Telstra led to many further project opportunities for Massive. As a senior, I took on the responsibility of mentoring, training and often overseeing the work of UX team members. \n \nHighlight Projects: \n- Telstra T-Box \n- Sky NZ Online Media Platform \n \nClients included: \nTelstra, BT Vision, Sky NZ, Panasonic Avionics, Massive Internal Products Solution Designer Massive Interactive August 2007  –  July 2009  (2 years) Entering Massive as a graduate of Design Computing, I initially started out as a ‘Solution Designer’ and assisted Massive to develop its Interaction Design and User Experience focussed processes, moving away from a heavily producer/visual design and “over the wall” style workflow. \n \nHighlight Projects: \n- Vodafone Site redesign \n- Hillross Extranet \n- Reserve Bank redesign \n \nClients included: \nPanasonic Avionics, VAustralia, Qantas, Vodafone, Community Engine, Hillross, AMP, Reserve Bank of Australia Senior UX Designer Hootsuite Media Inc. August 2015  – Present (1 month) Vancouver, Canada Area Senior UX Designer Hootsuite Media Inc. August 2015  – Present (1 month) Vancouver, Canada Area Senior UX Designer Google November 2014  –  June 2015  (8 months) Mountain View, CA During this time, I worked on Human-Machine Interaction Design (HMI) on the Google Robotics team. \n \nCollaborating closely with a small team of Roboticists and Engineers, I helped design magical and novel ways to interact meaningfully with Robots. Senior UX Designer Google November 2014  –  June 2015  (8 months) Mountain View, CA During this time, I worked on Human-Machine Interaction Design (HMI) on the Google Robotics team. \n \nCollaborating closely with a small team of Roboticists and Engineers, I helped design magical and novel ways to interact meaningfully with Robots. UX Designer III Google October 2013  –  November 2014  (1 year 2 months) Mountain View, CA During my first year at Google, I worked on the Identity and Authentication team, leading the user experience design for complex, cross-product projects with a very high impact and visibility on Google and Google's user base. In addition to launching a redesign of the Android Sign In/Sign Up flow, I helped empower the Identity design team by improving their design process, collaboration skills, and helping mentor team members. UX Designer III Google October 2013  –  November 2014  (1 year 2 months) Mountain View, CA During my first year at Google, I worked on the Identity and Authentication team, leading the user experience design for complex, cross-product projects with a very high impact and visibility on Google and Google's user base. In addition to launching a redesign of the Android Sign In/Sign Up flow, I helped empower the Identity design team by improving their design process, collaboration skills, and helping mentor team members. Senior Interaction Designer frog January 2013  –  September 2013  (9 months) San Francisco Bay Area As a Senior Interaction Designer at frog, I worked in small teams of amazing designers and strategists to deliver magical and effective solutions for our clients. I focused on building strong, trusted working relationships with our clients through inclusive workshops, and tight feedback loops, resulting in some amazing outcomes for projects such as: \n- a future vision for a flagship mobile product for a major OEM \n- A complete site redesign and long term business strategy for a beloved brand Yellow Pages, alongside their digital rebrand to YP.com  \n- product positioning strategy and user experience vision concepts for Verizon Communications & Messaging across multiple platforms, focusing on mobile \n \nClients included: \nA major OEM, Verizon, Westfield, Yellow Pages (YP.COM) Senior Interaction Designer frog January 2013  –  September 2013  (9 months) San Francisco Bay Area As a Senior Interaction Designer at frog, I worked in small teams of amazing designers and strategists to deliver magical and effective solutions for our clients. I focused on building strong, trusted working relationships with our clients through inclusive workshops, and tight feedback loops, resulting in some amazing outcomes for projects such as: \n- a future vision for a flagship mobile product for a major OEM \n- A complete site redesign and long term business strategy for a beloved brand Yellow Pages, alongside their digital rebrand to YP.com  \n- product positioning strategy and user experience vision concepts for Verizon Communications & Messaging across multiple platforms, focusing on mobile \n \nClients included: \nA major OEM, Verizon, Westfield, Yellow Pages (YP.COM) Senior Interaction Designer frog April 2012  –  October 2012  (7 months) Sydney Area, Australia I led the user experience design for several high profile projects during frog’s long-term engagement with Telstra - a major telecommunications company in Australia. Working on-site with Telstra, we helped reimagine the online shopping experience for Telstra’s diverse range of phone, mobile, internet, and television products and services. Integrating closely with their internal development teams, I helped instill and foster a strong Agile development culture at Telstra that included design thinking in the process. Senior Interaction Designer frog April 2012  –  October 2012  (7 months) Sydney Area, Australia I led the user experience design for several high profile projects during frog’s long-term engagement with Telstra - a major telecommunications company in Australia. Working on-site with Telstra, we helped reimagine the online shopping experience for Telstra’s diverse range of phone, mobile, internet, and television products and services. Integrating closely with their internal development teams, I helped instill and foster a strong Agile development culture at Telstra that included design thinking in the process. Principal UX Architect Massive Interactive July 2011  –  February 2012  (8 months) Sydney, Australia I led the UX team in Sydney to drive innovative and effective solutions for our clients. I was involved closely up-front with client and stakeholder management, strategy and concept design. For key projects, I worked end to end whilst delegating tasks and overseeing a large range of other projects across the team. I closely mentored and outlined professional development plans for UX team members to ensure our process was constantly growing and evolving to suit the ever-changing design problem space. In addition, I was involved in creative pitches for new business, most of which were successful in winning high profile work, such as with the BBC. \n \nSpeaking: \nCo-presented \"Shaping the future of BBC News for the connected Home\" at UX Australia 2011 \nPresented \"The Upside of Stakeholder Involvement (10 min talk)\" at UX Australia 2011 \n \nClients included: \nEmirates, Panasonic Avionics, Iberia, Telstra, TAB Principal UX Architect Massive Interactive July 2011  –  February 2012  (8 months) Sydney, Australia I led the UX team in Sydney to drive innovative and effective solutions for our clients. I was involved closely up-front with client and stakeholder management, strategy and concept design. For key projects, I worked end to end whilst delegating tasks and overseeing a large range of other projects across the team. I closely mentored and outlined professional development plans for UX team members to ensure our process was constantly growing and evolving to suit the ever-changing design problem space. In addition, I was involved in creative pitches for new business, most of which were successful in winning high profile work, such as with the BBC. \n \nSpeaking: \nCo-presented \"Shaping the future of BBC News for the connected Home\" at UX Australia 2011 \nPresented \"The Upside of Stakeholder Involvement (10 min talk)\" at UX Australia 2011 \n \nClients included: \nEmirates, Panasonic Avionics, Iberia, Telstra, TAB Senior UX Architect Massive Interactive July 2009  –  July 2011  (2 years 1 month) Sydney, Australia During my time as a Senior UX Architect, I was the UX lead for many key projects, running the project end to end from discover, concept through to detailed specifications. In particular, the strength of the work produced and strong client relationships built with Telstra led to many further project opportunities for Massive. As a senior, I took on the responsibility of mentoring, training and often overseeing the work of UX team members. \n \nHighlight Projects: \n- Telstra T-Box \n- Sky NZ Online Media Platform \n \nClients included: \nTelstra, BT Vision, Sky NZ, Panasonic Avionics, Massive Internal Products Senior UX Architect Massive Interactive July 2009  –  July 2011  (2 years 1 month) Sydney, Australia During my time as a Senior UX Architect, I was the UX lead for many key projects, running the project end to end from discover, concept through to detailed specifications. In particular, the strength of the work produced and strong client relationships built with Telstra led to many further project opportunities for Massive. As a senior, I took on the responsibility of mentoring, training and often overseeing the work of UX team members. \n \nHighlight Projects: \n- Telstra T-Box \n- Sky NZ Online Media Platform \n \nClients included: \nTelstra, BT Vision, Sky NZ, Panasonic Avionics, Massive Internal Products Solution Designer Massive Interactive August 2007  –  July 2009  (2 years) Entering Massive as a graduate of Design Computing, I initially started out as a ‘Solution Designer’ and assisted Massive to develop its Interaction Design and User Experience focussed processes, moving away from a heavily producer/visual design and “over the wall” style workflow. \n \nHighlight Projects: \n- Vodafone Site redesign \n- Hillross Extranet \n- Reserve Bank redesign \n \nClients included: \nPanasonic Avionics, VAustralia, Qantas, Vodafone, Community Engine, Hillross, AMP, Reserve Bank of Australia Solution Designer Massive Interactive August 2007  –  July 2009  (2 years) Entering Massive as a graduate of Design Computing, I initially started out as a ‘Solution Designer’ and assisted Massive to develop its Interaction Design and User Experience focussed processes, moving away from a heavily producer/visual design and “over the wall” style workflow. \n \nHighlight Projects: \n- Vodafone Site redesign \n- Hillross Extranet \n- Reserve Bank redesign \n \nClients included: \nPanasonic Avionics, VAustralia, Qantas, Vodafone, Community Engine, Hillross, AMP, Reserve Bank of Australia Skills Personas User Journeys Requirements Gathering Wire Framing Rapid Prototyping Adobe Creative Suite User Stories Concept Development Usability Testing Functional... Mentoring Of Staff Paper Prototyping HTML CSS XML JavaScript Flex Interaction Design Information Architecture User-centered Design User Experience Persona HTML 5 Mobile Devices User Interface User Interface Design User Experience Design Usability Experience Design Web Design Awesomeness Human Computer... Wireframes User Research Service Design Mobile Design Visual Design Mobile Applications Digital Strategy Graphic Design Creative Direction See 26+     See less Skills  Personas User Journeys Requirements Gathering Wire Framing Rapid Prototyping Adobe Creative Suite User Stories Concept Development Usability Testing Functional... Mentoring Of Staff Paper Prototyping HTML CSS XML JavaScript Flex Interaction Design Information Architecture User-centered Design User Experience Persona HTML 5 Mobile Devices User Interface User Interface Design User Experience Design Usability Experience Design Web Design Awesomeness Human Computer... Wireframes User Research Service Design Mobile Design Visual Design Mobile Applications Digital Strategy Graphic Design Creative Direction See 26+     See less Personas User Journeys Requirements Gathering Wire Framing Rapid Prototyping Adobe Creative Suite User Stories Concept Development Usability Testing Functional... Mentoring Of Staff Paper Prototyping HTML CSS XML JavaScript Flex Interaction Design Information Architecture User-centered Design User Experience Persona HTML 5 Mobile Devices User Interface User Interface Design User Experience Design Usability Experience Design Web Design Awesomeness Human Computer... Wireframes User Research Service Design Mobile Design Visual Design Mobile Applications Digital Strategy Graphic Design Creative Direction See 26+     See less Personas User Journeys Requirements Gathering Wire Framing Rapid Prototyping Adobe Creative Suite User Stories Concept Development Usability Testing Functional... Mentoring Of Staff Paper Prototyping HTML CSS XML JavaScript Flex Interaction Design Information Architecture User-centered Design User Experience Persona HTML 5 Mobile Devices User Interface User Interface Design User Experience Design Usability Experience Design Web Design Awesomeness Human Computer... Wireframes User Research Service Design Mobile Design Visual Design Mobile Applications Digital Strategy Graphic Design Creative Direction See 26+     See less Education University of Sydney Bachelor of Design Computing 2005  – 2007 Subjects included: \nPersuasive technology \nInformation visualisation \nInteraction Design (HCI) \nPhysical Computing \nMobile Computing \nGenerative Design \nData Modelling & Management \nSoftware Development \n3D Modelling & Photorealism \n3D Animation \nInformation Architecture \nGraphic Design \nSound Design & Sonification \nWeb Design \nReal Time 3D Multimedia \nCollaborative Virtual Environments Activities and Societies:  OZCHI Student Volunteer November 2006\nFounding President Capoeira Society 2003-2005\nPhotography Society 2005-2007 University of Sydney Bachelor of Design (Architecture) 2003  – 2005 Transferred to Bachelor of Design Computing Fort Street High School Higher School Certificate,  4 Units English , 4 Units Mathematics, 2 Units Chemistry,  2 Units Computer Studies (Accelerated) , UAI 98.5 1997  – 2002 University of Sydney Bachelor of Design Computing 2005  – 2007 Subjects included: \nPersuasive technology \nInformation visualisation \nInteraction Design (HCI) \nPhysical Computing \nMobile Computing \nGenerative Design \nData Modelling & Management \nSoftware Development \n3D Modelling & Photorealism \n3D Animation \nInformation Architecture \nGraphic Design \nSound Design & Sonification \nWeb Design \nReal Time 3D Multimedia \nCollaborative Virtual Environments Activities and Societies:  OZCHI Student Volunteer November 2006\nFounding President Capoeira Society 2003-2005\nPhotography Society 2005-2007 University of Sydney Bachelor of Design Computing 2005  – 2007 Subjects included: \nPersuasive technology \nInformation visualisation \nInteraction Design (HCI) \nPhysical Computing \nMobile Computing \nGenerative Design \nData Modelling & Management \nSoftware Development \n3D Modelling & Photorealism \n3D Animation \nInformation Architecture \nGraphic Design \nSound Design & Sonification \nWeb Design \nReal Time 3D Multimedia \nCollaborative Virtual Environments Activities and Societies:  OZCHI Student Volunteer November 2006\nFounding President Capoeira Society 2003-2005\nPhotography Society 2005-2007 University of Sydney Bachelor of Design Computing 2005  – 2007 Subjects included: \nPersuasive technology \nInformation visualisation \nInteraction Design (HCI) \nPhysical Computing \nMobile Computing \nGenerative Design \nData Modelling & Management \nSoftware Development \n3D Modelling & Photorealism \n3D Animation \nInformation Architecture \nGraphic Design \nSound Design & Sonification \nWeb Design \nReal Time 3D Multimedia \nCollaborative Virtual Environments Activities and Societies:  OZCHI Student Volunteer November 2006\nFounding President Capoeira Society 2003-2005\nPhotography Society 2005-2007 University of Sydney Bachelor of Design (Architecture) 2003  – 2005 Transferred to Bachelor of Design Computing University of Sydney Bachelor of Design (Architecture) 2003  – 2005 Transferred to Bachelor of Design Computing University of Sydney Bachelor of Design (Architecture) 2003  – 2005 Transferred to Bachelor of Design Computing Fort Street High School Higher School Certificate,  4 Units English , 4 Units Mathematics, 2 Units Chemistry,  2 Units Computer Studies (Accelerated) , UAI 98.5 1997  – 2002 Fort Street High School Higher School Certificate,  4 Units English , 4 Units Mathematics, 2 Units Chemistry,  2 Units Computer Studies (Accelerated) , UAI 98.5 1997  – 2002 Fort Street High School Higher School Certificate,  4 Units English , 4 Units Mathematics, 2 Units Chemistry,  2 Units Computer Studies (Accelerated) , UAI 98.5 1997  – 2002 Honors & Awards The Dean's Merit Scholarship for Entry into Bachelor of Design University of Sydney March 2003 The Dean's List of Excellence in Academic Perfomance (B. Design Year 2) University of Sydney March 2004 The Henry J Cowan Prize in Architectural Science The University of Sydney March 2004 The Dean's Merit Scholarship for Entry into Bachelor of Design Computing The University of Sydney March 2005 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 1/2) The University of Sydney March 2006 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 3) The University of Sydney March 2006 Less Than Three Design Award The University of Sydney November 2006 Design Computing Prize (Undergraduate) The University of Sydney March 2006 Awarded to the top student in the graduating class University of Sydney Honours Scholarship University of Sydney March 2007 Apple University Consortium Honours Scholarship Apple University Consortium 2007 The Dean's Merit Scholarship for Entry into Bachelor of Design University of Sydney March 2003 The Dean's Merit Scholarship for Entry into Bachelor of Design University of Sydney March 2003 The Dean's Merit Scholarship for Entry into Bachelor of Design University of Sydney March 2003 The Dean's List of Excellence in Academic Perfomance (B. Design Year 2) University of Sydney March 2004 The Dean's List of Excellence in Academic Perfomance (B. Design Year 2) University of Sydney March 2004 The Dean's List of Excellence in Academic Perfomance (B. Design Year 2) University of Sydney March 2004 The Henry J Cowan Prize in Architectural Science The University of Sydney March 2004 The Henry J Cowan Prize in Architectural Science The University of Sydney March 2004 The Henry J Cowan Prize in Architectural Science The University of Sydney March 2004 The Dean's Merit Scholarship for Entry into Bachelor of Design Computing The University of Sydney March 2005 The Dean's Merit Scholarship for Entry into Bachelor of Design Computing The University of Sydney March 2005 The Dean's Merit Scholarship for Entry into Bachelor of Design Computing The University of Sydney March 2005 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 1/2) The University of Sydney March 2006 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 1/2) The University of Sydney March 2006 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 1/2) The University of Sydney March 2006 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 3) The University of Sydney March 2006 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 3) The University of Sydney March 2006 The Dean's List of Excellence in Academic Performance (B. Des Comp Year 3) The University of Sydney March 2006 Less Than Three Design Award The University of Sydney November 2006 Less Than Three Design Award The University of Sydney November 2006 Less Than Three Design Award The University of Sydney November 2006 Design Computing Prize (Undergraduate) The University of Sydney March 2006 Awarded to the top student in the graduating class Design Computing Prize (Undergraduate) The University of Sydney March 2006 Awarded to the top student in the graduating class Design Computing Prize (Undergraduate) The University of Sydney March 2006 Awarded to the top student in the graduating class University of Sydney Honours Scholarship University of Sydney March 2007 University of Sydney Honours Scholarship University of Sydney March 2007 University of Sydney Honours Scholarship University of Sydney March 2007 Apple University Consortium Honours Scholarship Apple University Consortium 2007 Apple University Consortium Honours Scholarship Apple University Consortium 2007 Apple University Consortium Honours Scholarship Apple University Consortium 2007 ", "Summary Zhou Bailiang has been working as a professional user experience designer since 2000. From a web multimedia designer back to 2000 in Munich to Senior UX designer at Google, he has been involved in all aspects of the design process. He is specialized in complex Information visualization and creating beautiful design works. His design works have won multiple prizes by international design awards. Summary Zhou Bailiang has been working as a professional user experience designer since 2000. From a web multimedia designer back to 2000 in Munich to Senior UX designer at Google, he has been involved in all aspects of the design process. He is specialized in complex Information visualization and creating beautiful design works. His design works have won multiple prizes by international design awards. Zhou Bailiang has been working as a professional user experience designer since 2000. From a web multimedia designer back to 2000 in Munich to Senior UX designer at Google, he has been involved in all aspects of the design process. He is specialized in complex Information visualization and creating beautiful design works. His design works have won multiple prizes by international design awards. Zhou Bailiang has been working as a professional user experience designer since 2000. From a web multimedia designer back to 2000 in Munich to Senior UX designer at Google, he has been involved in all aspects of the design process. He is specialized in complex Information visualization and creating beautiful design works. His design works have won multiple prizes by international design awards. Experience Senior Designer Google Senior UX Designer Google July 2010  – Present (5 years 2 months) Sydney Area, Australia Senior designer Google January 2007  –  July 2010  (3 years 7 months) Beijing City, China User Interface Designer Siemens September 2004  –  December 2006  (2 years 4 months) Beijing City, China User Interface Designer Spirit Link April 2002  –  March 2004  (2 years) Erlangen Area, Germany Web Designer (Intern and Contractor) Cable & Wireless Diego Garcia February 2000  –  October 2000  (9 months) Munich Area, Germany Senior Designer Google Senior Designer Google Senior UX Designer Google July 2010  – Present (5 years 2 months) Sydney Area, Australia Senior UX Designer Google July 2010  – Present (5 years 2 months) Sydney Area, Australia Senior designer Google January 2007  –  July 2010  (3 years 7 months) Beijing City, China Senior designer Google January 2007  –  July 2010  (3 years 7 months) Beijing City, China User Interface Designer Siemens September 2004  –  December 2006  (2 years 4 months) Beijing City, China User Interface Designer Siemens September 2004  –  December 2006  (2 years 4 months) Beijing City, China User Interface Designer Spirit Link April 2002  –  March 2004  (2 years) Erlangen Area, Germany User Interface Designer Spirit Link April 2002  –  March 2004  (2 years) Erlangen Area, Germany Web Designer (Intern and Contractor) Cable & Wireless Diego Garcia February 2000  –  October 2000  (9 months) Munich Area, Germany Web Designer (Intern and Contractor) Cable & Wireless Diego Garcia February 2000  –  October 2000  (9 months) Munich Area, Germany Languages English Full professional proficiency German Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency German Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency German Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills Information... User Experience Typography User Interface Design Interaction Design Data Visualization Illustration User-centered Design color expert User Experience Design Skills  Information... User Experience Typography User Interface Design Interaction Design Data Visualization Illustration User-centered Design color expert User Experience Design Information... User Experience Typography User Interface Design Interaction Design Data Visualization Illustration User-centered Design color expert User Experience Design Information... User Experience Typography User Interface Design Interaction Design Data Visualization Illustration User-centered Design color expert User Experience Design Education Fachhochschule für Gestaltung Schwäbisch Gmünd Diplom Designer,  Information und Medien Design 1998  – 2002 Hochschule für Gestaltung Schwäbisch Gmünd Master's Degree,  Information and Media Design 1998  – 2002 Fachhochschule für Gestaltung Schwäbisch Gmünd Diplom Designer,  Information und Medien Design 1998  – 2002 Fachhochschule für Gestaltung Schwäbisch Gmünd Diplom Designer,  Information und Medien Design 1998  – 2002 Fachhochschule für Gestaltung Schwäbisch Gmünd Diplom Designer,  Information und Medien Design 1998  – 2002 Hochschule für Gestaltung Schwäbisch Gmünd Master's Degree,  Information and Media Design 1998  – 2002 Hochschule für Gestaltung Schwäbisch Gmünd Master's Degree,  Information and Media Design 1998  – 2002 Hochschule für Gestaltung Schwäbisch Gmünd Master's Degree,  Information and Media Design 1998  – 2002 Honors & Awards Good Design Award 2011 - Google Maps Japan Good Design Award Good Design Award 2011 November 2011 The Google Japan map tile design is intended to provide users with a readable, beautiful map that also helps people quickly find the geographic information they seek. The design has the goal of providing more relevant information to users, while at the same time making the map clearer and visually easier to read. We refined the visual language used to present multi-faceted information on the map, and also defined the typography, colors, iconography, and line elements to reflect the needs of both local and international users IF communication Design Award 2005 - Website for MaLiLian Furniture IF Design Germany September 2005 http://exhibition.ifdesign.de/entrydetails_en.html?beitrag_id=21439 \n \nObjective: MaLiLian one-off furniture is positioned as “Art for Living” and caters to a global cosmopolitan clientele. Therefore, the company’s “catalogue” is web-based and needs to visualize the products in a very upscale fashion. In addition, exhibitions and events shall be published. Result: www.malilian.com provides a fully functional communications channel between MaLiLian, professional partners e.g. architects, media and customers. At the same time the site provides the emotional backdrop for the product philosophy. www.malilian.com has delivered a strong interest in the furniture pieces resulting in numerous sales. Design: MaLiLian’s expressive design asked for a sophisticated and very reduced graphic design. Playful exploration: One of the key features of the site is the user’s easy and playful navigation in discovering the furniture objects. The site mirrors the quest for interaction posed by MaLiLian objects in real life. The user is able to discover them via different avenues such as the themes defined by surfaces and materials as well as by the shapes and functions of the furniture pieces. At the same time such path of discovery can be changed at any time of the exploration. IF Design Award 2006 - Siemens Home Entertainment System IF Design Germany September 2006 http://exhibition.ifdesign.de/entrydetails_de?beitrag_id=27526 \n \nDie gesamte Bedienung der Siemens Home Entertainment Dienste erfolgt durch Menüs und Bedienelemente auf dem Fernsehschirm, die mit Hilfe einer Fernbedienung gesteuert werden. Diese eingeschränkte Interaktionsweise erfordert es, bei der Gestaltung der Screenlayouts in hohem Maße auf Benutzerfreundlichkeit und Bedienkomfort zu achten. Typografie und Farbdesign wurden hinsichtlich Lesbarkeit auf dem Fernsehschirm optimiert. Die systematische Anwendung von Farbkombinationen und -kontrasten unterstützt eine klare Trennung zwischen den Bedien- und Anzeigeelementen und den vielschichtigen Informationen. Good Design Award 2011 - Google Maps Japan Good Design Award Good Design Award 2011 November 2011 The Google Japan map tile design is intended to provide users with a readable, beautiful map that also helps people quickly find the geographic information they seek. The design has the goal of providing more relevant information to users, while at the same time making the map clearer and visually easier to read. We refined the visual language used to present multi-faceted information on the map, and also defined the typography, colors, iconography, and line elements to reflect the needs of both local and international users Good Design Award 2011 - Google Maps Japan Good Design Award Good Design Award 2011 November 2011 The Google Japan map tile design is intended to provide users with a readable, beautiful map that also helps people quickly find the geographic information they seek. The design has the goal of providing more relevant information to users, while at the same time making the map clearer and visually easier to read. We refined the visual language used to present multi-faceted information on the map, and also defined the typography, colors, iconography, and line elements to reflect the needs of both local and international users Good Design Award 2011 - Google Maps Japan Good Design Award Good Design Award 2011 November 2011 The Google Japan map tile design is intended to provide users with a readable, beautiful map that also helps people quickly find the geographic information they seek. The design has the goal of providing more relevant information to users, while at the same time making the map clearer and visually easier to read. We refined the visual language used to present multi-faceted information on the map, and also defined the typography, colors, iconography, and line elements to reflect the needs of both local and international users IF communication Design Award 2005 - Website for MaLiLian Furniture IF Design Germany September 2005 http://exhibition.ifdesign.de/entrydetails_en.html?beitrag_id=21439 \n \nObjective: MaLiLian one-off furniture is positioned as “Art for Living” and caters to a global cosmopolitan clientele. Therefore, the company’s “catalogue” is web-based and needs to visualize the products in a very upscale fashion. In addition, exhibitions and events shall be published. Result: www.malilian.com provides a fully functional communications channel between MaLiLian, professional partners e.g. architects, media and customers. At the same time the site provides the emotional backdrop for the product philosophy. www.malilian.com has delivered a strong interest in the furniture pieces resulting in numerous sales. Design: MaLiLian’s expressive design asked for a sophisticated and very reduced graphic design. Playful exploration: One of the key features of the site is the user’s easy and playful navigation in discovering the furniture objects. The site mirrors the quest for interaction posed by MaLiLian objects in real life. The user is able to discover them via different avenues such as the themes defined by surfaces and materials as well as by the shapes and functions of the furniture pieces. At the same time such path of discovery can be changed at any time of the exploration. IF communication Design Award 2005 - Website for MaLiLian Furniture IF Design Germany September 2005 http://exhibition.ifdesign.de/entrydetails_en.html?beitrag_id=21439 \n \nObjective: MaLiLian one-off furniture is positioned as “Art for Living” and caters to a global cosmopolitan clientele. Therefore, the company’s “catalogue” is web-based and needs to visualize the products in a very upscale fashion. In addition, exhibitions and events shall be published. Result: www.malilian.com provides a fully functional communications channel between MaLiLian, professional partners e.g. architects, media and customers. At the same time the site provides the emotional backdrop for the product philosophy. www.malilian.com has delivered a strong interest in the furniture pieces resulting in numerous sales. Design: MaLiLian’s expressive design asked for a sophisticated and very reduced graphic design. Playful exploration: One of the key features of the site is the user’s easy and playful navigation in discovering the furniture objects. The site mirrors the quest for interaction posed by MaLiLian objects in real life. The user is able to discover them via different avenues such as the themes defined by surfaces and materials as well as by the shapes and functions of the furniture pieces. At the same time such path of discovery can be changed at any time of the exploration. IF communication Design Award 2005 - Website for MaLiLian Furniture IF Design Germany September 2005 http://exhibition.ifdesign.de/entrydetails_en.html?beitrag_id=21439 \n \nObjective: MaLiLian one-off furniture is positioned as “Art for Living” and caters to a global cosmopolitan clientele. Therefore, the company’s “catalogue” is web-based and needs to visualize the products in a very upscale fashion. In addition, exhibitions and events shall be published. Result: www.malilian.com provides a fully functional communications channel between MaLiLian, professional partners e.g. architects, media and customers. At the same time the site provides the emotional backdrop for the product philosophy. www.malilian.com has delivered a strong interest in the furniture pieces resulting in numerous sales. Design: MaLiLian’s expressive design asked for a sophisticated and very reduced graphic design. Playful exploration: One of the key features of the site is the user’s easy and playful navigation in discovering the furniture objects. The site mirrors the quest for interaction posed by MaLiLian objects in real life. The user is able to discover them via different avenues such as the themes defined by surfaces and materials as well as by the shapes and functions of the furniture pieces. At the same time such path of discovery can be changed at any time of the exploration. IF Design Award 2006 - Siemens Home Entertainment System IF Design Germany September 2006 http://exhibition.ifdesign.de/entrydetails_de?beitrag_id=27526 \n \nDie gesamte Bedienung der Siemens Home Entertainment Dienste erfolgt durch Menüs und Bedienelemente auf dem Fernsehschirm, die mit Hilfe einer Fernbedienung gesteuert werden. Diese eingeschränkte Interaktionsweise erfordert es, bei der Gestaltung der Screenlayouts in hohem Maße auf Benutzerfreundlichkeit und Bedienkomfort zu achten. Typografie und Farbdesign wurden hinsichtlich Lesbarkeit auf dem Fernsehschirm optimiert. Die systematische Anwendung von Farbkombinationen und -kontrasten unterstützt eine klare Trennung zwischen den Bedien- und Anzeigeelementen und den vielschichtigen Informationen. IF Design Award 2006 - Siemens Home Entertainment System IF Design Germany September 2006 http://exhibition.ifdesign.de/entrydetails_de?beitrag_id=27526 \n \nDie gesamte Bedienung der Siemens Home Entertainment Dienste erfolgt durch Menüs und Bedienelemente auf dem Fernsehschirm, die mit Hilfe einer Fernbedienung gesteuert werden. Diese eingeschränkte Interaktionsweise erfordert es, bei der Gestaltung der Screenlayouts in hohem Maße auf Benutzerfreundlichkeit und Bedienkomfort zu achten. Typografie und Farbdesign wurden hinsichtlich Lesbarkeit auf dem Fernsehschirm optimiert. Die systematische Anwendung von Farbkombinationen und -kontrasten unterstützt eine klare Trennung zwischen den Bedien- und Anzeigeelementen und den vielschichtigen Informationen. IF Design Award 2006 - Siemens Home Entertainment System IF Design Germany September 2006 http://exhibition.ifdesign.de/entrydetails_de?beitrag_id=27526 \n \nDie gesamte Bedienung der Siemens Home Entertainment Dienste erfolgt durch Menüs und Bedienelemente auf dem Fernsehschirm, die mit Hilfe einer Fernbedienung gesteuert werden. Diese eingeschränkte Interaktionsweise erfordert es, bei der Gestaltung der Screenlayouts in hohem Maße auf Benutzerfreundlichkeit und Bedienkomfort zu achten. Typografie und Farbdesign wurden hinsichtlich Lesbarkeit auf dem Fernsehschirm optimiert. Die systematische Anwendung von Farbkombinationen und -kontrasten unterstützt eine klare Trennung zwischen den Bedien- und Anzeigeelementen und den vielschichtigen Informationen. ", "Skills User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design Skills  User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design ", "Skills Information Architecture User Interface Design Interaction Design User Experience User-centered Design Design Management Wireframes Design Strategy User Experience Design User Interface Web Design CSS Paper Prototyping Product Design Mockups HTML JavaScript See 2+     See less Skills  Information Architecture User Interface Design Interaction Design User Experience User-centered Design Design Management Wireframes Design Strategy User Experience Design User Interface Web Design CSS Paper Prototyping Product Design Mockups HTML JavaScript See 2+     See less Information Architecture User Interface Design Interaction Design User Experience User-centered Design Design Management Wireframes Design Strategy User Experience Design User Interface Web Design CSS Paper Prototyping Product Design Mockups HTML JavaScript See 2+     See less Information Architecture User Interface Design Interaction Design User Experience User-centered Design Design Management Wireframes Design Strategy User Experience Design User Interface Web Design CSS Paper Prototyping Product Design Mockups HTML JavaScript See 2+     See less ", "Skills User Experience Interaction Design User Experience Design Visual Design Experience Design User-centered Design User Interface Design User Interface User Research Information Architecture User Scenarios Mobile Devices Usability Testing Wireframes Design Strategy Information Design Mobile Design Art Direction Product Design Visual Communication See 5+     See less Skills  User Experience Interaction Design User Experience Design Visual Design Experience Design User-centered Design User Interface Design User Interface User Research Information Architecture User Scenarios Mobile Devices Usability Testing Wireframes Design Strategy Information Design Mobile Design Art Direction Product Design Visual Communication See 5+     See less User Experience Interaction Design User Experience Design Visual Design Experience Design User-centered Design User Interface Design User Interface User Research Information Architecture User Scenarios Mobile Devices Usability Testing Wireframes Design Strategy Information Design Mobile Design Art Direction Product Design Visual Communication See 5+     See less User Experience Interaction Design User Experience Design Visual Design Experience Design User-centered Design User Interface Design User Interface User Research Information Architecture User Scenarios Mobile Devices Usability Testing Wireframes Design Strategy Information Design Mobile Design Art Direction Product Design Visual Communication See 5+     See less ", "Languages Chinese English Chinese English Chinese English Skills Interaction Design User Interface Design User Experience Usability Testing User Interface Design Research Product Innovation Skills  Interaction Design User Interface Design User Experience Usability Testing User Interface Design Research Product Innovation Interaction Design User Interface Design User Experience Usability Testing User Interface Design Research Product Innovation Interaction Design User Interface Design User Experience Usability Testing User Interface Design Research Product Innovation ", "Experience Senior UX Designer Google August 2010  – Present (5 years 1 month) San Francisco Bay Area UX Writer & Editor Insight Books, Acorn Publishing March 2008  –  August 2010  (2 years 6 months) Seoul, Korea UX Designer SakaiProject.org September 2009  –  April 2010  (8 months) Greater Detroit Area UX Design Intern IDEO May 2009  –  August 2009  (4 months) San Francisco Bay Area UX Designer/Researcher NHN February 2005  –  May 2008  (3 years 4 months) Gangnam-gu, Seoul, Korea Senior UX Designer Google August 2010  – Present (5 years 1 month) San Francisco Bay Area Senior UX Designer Google August 2010  – Present (5 years 1 month) San Francisco Bay Area UX Writer & Editor Insight Books, Acorn Publishing March 2008  –  August 2010  (2 years 6 months) Seoul, Korea UX Writer & Editor Insight Books, Acorn Publishing March 2008  –  August 2010  (2 years 6 months) Seoul, Korea UX Designer SakaiProject.org September 2009  –  April 2010  (8 months) Greater Detroit Area UX Designer SakaiProject.org September 2009  –  April 2010  (8 months) Greater Detroit Area UX Design Intern IDEO May 2009  –  August 2009  (4 months) San Francisco Bay Area UX Design Intern IDEO May 2009  –  August 2009  (4 months) San Francisco Bay Area UX Designer/Researcher NHN February 2005  –  May 2008  (3 years 4 months) Gangnam-gu, Seoul, Korea UX Designer/Researcher NHN February 2005  –  May 2008  (3 years 4 months) Gangnam-gu, Seoul, Korea Languages   Skills Interaction Design User Experience Human-computer... User-centered Design Human Computer... Design Management User Experience Design Usability Testing User Scenarios Heuristic Evaluation Paper Prototyping Information Architecture Contextual Inquiry Wireframes Persona User Research See 1+     See less Skills  Interaction Design User Experience Human-computer... User-centered Design Human Computer... Design Management User Experience Design Usability Testing User Scenarios Heuristic Evaluation Paper Prototyping Information Architecture Contextual Inquiry Wireframes Persona User Research See 1+     See less Interaction Design User Experience Human-computer... User-centered Design Human Computer... Design Management User Experience Design Usability Testing User Scenarios Heuristic Evaluation Paper Prototyping Information Architecture Contextual Inquiry Wireframes Persona User Research See 1+     See less Interaction Design User Experience Human-computer... User-centered Design Human Computer... Design Management User Experience Design Usability Testing User Scenarios Heuristic Evaluation Paper Prototyping Information Architecture Contextual Inquiry Wireframes Persona User Research See 1+     See less Education University of Michigan - School of Information Master of Science (M.S.),  Human Computer Interaction 2008  – 2010 Korea Advanced Institute of Science and Technology Bachelor of Science (B.S.),  Interaction Design 2000  – 2004 Institut national des Sciences appliquées de Lyon Interaction Design 2002  – 2003 University of Michigan - School of Information Master of Science (M.S.),  Human Computer Interaction 2008  – 2010 University of Michigan - School of Information Master of Science (M.S.),  Human Computer Interaction 2008  – 2010 University of Michigan - School of Information Master of Science (M.S.),  Human Computer Interaction 2008  – 2010 Korea Advanced Institute of Science and Technology Bachelor of Science (B.S.),  Interaction Design 2000  – 2004 Korea Advanced Institute of Science and Technology Bachelor of Science (B.S.),  Interaction Design 2000  – 2004 Korea Advanced Institute of Science and Technology Bachelor of Science (B.S.),  Interaction Design 2000  – 2004 Institut national des Sciences appliquées de Lyon Interaction Design 2002  – 2003 Institut national des Sciences appliquées de Lyon Interaction Design 2002  – 2003 Institut national des Sciences appliquées de Lyon Interaction Design 2002  – 2003 Honors & Awards ", "Experience Senior UX Designer Google March 2008  – Present (7 years 6 months) UX Lead DoubleClick 2007  –  2008  (1 year) UX Lead Tangozebra 2003  –  2007  (4 years) Senior UX Designer Google March 2008  – Present (7 years 6 months) Senior UX Designer Google March 2008  – Present (7 years 6 months) UX Lead DoubleClick 2007  –  2008  (1 year) UX Lead DoubleClick 2007  –  2008  (1 year) UX Lead Tangozebra 2003  –  2007  (4 years) UX Lead Tangozebra 2003  –  2007  (4 years) Languages English Full professional proficiency Macedonian Native or bilingual proficiency English Full professional proficiency Macedonian Native or bilingual proficiency English Full professional proficiency Macedonian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills User Interface Design User Experience User Experience Design User-centered Design Interaction Design Wireframes Usability Information Architecture Experience Design Human Computer... HTML 5 Web Standards Digital Strategy JavaScript Rapid Prototyping HTML Usability Testing Web Project Management Mobile Applications Mobile Design Wire Framing User Interface Accessibility Front-end Information Design See 10+     See less Skills  User Interface Design User Experience User Experience Design User-centered Design Interaction Design Wireframes Usability Information Architecture Experience Design Human Computer... HTML 5 Web Standards Digital Strategy JavaScript Rapid Prototyping HTML Usability Testing Web Project Management Mobile Applications Mobile Design Wire Framing User Interface Accessibility Front-end Information Design See 10+     See less User Interface Design User Experience User Experience Design User-centered Design Interaction Design Wireframes Usability Information Architecture Experience Design Human Computer... HTML 5 Web Standards Digital Strategy JavaScript Rapid Prototyping HTML Usability Testing Web Project Management Mobile Applications Mobile Design Wire Framing User Interface Accessibility Front-end Information Design See 10+     See less User Interface Design User Experience User Experience Design User-centered Design Interaction Design Wireframes Usability Information Architecture Experience Design Human Computer... HTML 5 Web Standards Digital Strategy JavaScript Rapid Prototyping HTML Usability Testing Web Project Management Mobile Applications Mobile Design Wire Framing User Interface Accessibility Front-end Information Design See 10+     See less ", "Summary • 20+ years of experience initiating and implementing user-centered design \n• Excellent conceptualization skills; adept at turning insights from user research data into business opportunities and product features \n• Excellent information architecture and task flow design skills \n• Flexible and nimble in an agile environment \n• Outstanding team player with exceptional adaptability; self-driven and motivated Summary • 20+ years of experience initiating and implementing user-centered design \n• Excellent conceptualization skills; adept at turning insights from user research data into business opportunities and product features \n• Excellent information architecture and task flow design skills \n• Flexible and nimble in an agile environment \n• Outstanding team player with exceptional adaptability; self-driven and motivated • 20+ years of experience initiating and implementing user-centered design \n• Excellent conceptualization skills; adept at turning insights from user research data into business opportunities and product features \n• Excellent information architecture and task flow design skills \n• Flexible and nimble in an agile environment \n• Outstanding team player with exceptional adaptability; self-driven and motivated • 20+ years of experience initiating and implementing user-centered design \n• Excellent conceptualization skills; adept at turning insights from user research data into business opportunities and product features \n• Excellent information architecture and task flow design skills \n• Flexible and nimble in an agile environment \n• Outstanding team player with exceptional adaptability; self-driven and motivated Experience Senior UX Designer Microsoft Cloud and Enterprise group, Server and Management Studios May 2014  – Present (1 year 4 months) Redmond, WA Senior UX Designer Microsoft June 2013  –  May 2014  (1 year) Bellevue, WA Microsoft, Applications and Services Group (ASG), Information Platform Senior User Experience Lead Microsoft (China) October 2011  –  May 2013  (1 year 8 months) Shanghai, China Leading and cultivating a UX team of 5 to 10 members, supporting Windows Server, SQL Server, and Commerce platform through various design and research projects: \n• Windows Azure.com Chinese edition \n• Windows vNext “Designed for China” storyboards \n• HPC Azure concept \n• Windows Server Essential 2012 (a.k.a. Small Business Server) \n• SQL Server Information Service Data Movement (code name: Eldorado) \n• Commerce Platform – Billing Account Management (BAM), Barnes & Noble and Microsoft cobrand purchase experience design, Microsoft Wallet concept, Commerce Management Agent Tool (CMAT), Monitoring Alerting Reporting Service (MARS) \n• China IT Pros user research in the context of cloud (landing Azure in China) \n• China in-car infotainment system research Senior User Experience Designer Microsoft, Server and Tools Business March 2008  –  September 2011  (3 years 7 months) Redmond, WA Lead UX designer driving UX design and research for SQL Server Reporting Services, Power View, Report Builder, and Master Data Services. Interaction Designer Google April 2007  –  February 2008  (11 months) Kirkland, WA Contract position designing AdWords features enabling users effectively manage their keywords and get the most out of their investment. User Experience Design Manager Envision Telephony, Inc. July 2004  –  August 2006  (2 years 2 months) Seattle, WA Conducted customer interviews and user research; partnered with Product Managers and VP of Marketing & Sales to identify customer and business goals; redesigned information architecture by consolidating four stand-alone apps into one enterprise system that supports over 250,000 call center agents. Senior UX Designer Microsoft Cloud and Enterprise group, Server and Management Studios May 2014  – Present (1 year 4 months) Redmond, WA Senior UX Designer Microsoft Cloud and Enterprise group, Server and Management Studios May 2014  – Present (1 year 4 months) Redmond, WA Senior UX Designer Microsoft June 2013  –  May 2014  (1 year) Bellevue, WA Microsoft, Applications and Services Group (ASG), Information Platform Senior UX Designer Microsoft June 2013  –  May 2014  (1 year) Bellevue, WA Microsoft, Applications and Services Group (ASG), Information Platform Senior User Experience Lead Microsoft (China) October 2011  –  May 2013  (1 year 8 months) Shanghai, China Leading and cultivating a UX team of 5 to 10 members, supporting Windows Server, SQL Server, and Commerce platform through various design and research projects: \n• Windows Azure.com Chinese edition \n• Windows vNext “Designed for China” storyboards \n• HPC Azure concept \n• Windows Server Essential 2012 (a.k.a. Small Business Server) \n• SQL Server Information Service Data Movement (code name: Eldorado) \n• Commerce Platform – Billing Account Management (BAM), Barnes & Noble and Microsoft cobrand purchase experience design, Microsoft Wallet concept, Commerce Management Agent Tool (CMAT), Monitoring Alerting Reporting Service (MARS) \n• China IT Pros user research in the context of cloud (landing Azure in China) \n• China in-car infotainment system research Senior User Experience Lead Microsoft (China) October 2011  –  May 2013  (1 year 8 months) Shanghai, China Leading and cultivating a UX team of 5 to 10 members, supporting Windows Server, SQL Server, and Commerce platform through various design and research projects: \n• Windows Azure.com Chinese edition \n• Windows vNext “Designed for China” storyboards \n• HPC Azure concept \n• Windows Server Essential 2012 (a.k.a. Small Business Server) \n• SQL Server Information Service Data Movement (code name: Eldorado) \n• Commerce Platform – Billing Account Management (BAM), Barnes & Noble and Microsoft cobrand purchase experience design, Microsoft Wallet concept, Commerce Management Agent Tool (CMAT), Monitoring Alerting Reporting Service (MARS) \n• China IT Pros user research in the context of cloud (landing Azure in China) \n• China in-car infotainment system research Senior User Experience Designer Microsoft, Server and Tools Business March 2008  –  September 2011  (3 years 7 months) Redmond, WA Lead UX designer driving UX design and research for SQL Server Reporting Services, Power View, Report Builder, and Master Data Services. Senior User Experience Designer Microsoft, Server and Tools Business March 2008  –  September 2011  (3 years 7 months) Redmond, WA Lead UX designer driving UX design and research for SQL Server Reporting Services, Power View, Report Builder, and Master Data Services. Interaction Designer Google April 2007  –  February 2008  (11 months) Kirkland, WA Contract position designing AdWords features enabling users effectively manage their keywords and get the most out of their investment. Interaction Designer Google April 2007  –  February 2008  (11 months) Kirkland, WA Contract position designing AdWords features enabling users effectively manage their keywords and get the most out of their investment. User Experience Design Manager Envision Telephony, Inc. July 2004  –  August 2006  (2 years 2 months) Seattle, WA Conducted customer interviews and user research; partnered with Product Managers and VP of Marketing & Sales to identify customer and business goals; redesigned information architecture by consolidating four stand-alone apps into one enterprise system that supports over 250,000 call center agents. User Experience Design Manager Envision Telephony, Inc. July 2004  –  August 2006  (2 years 2 months) Seattle, WA Conducted customer interviews and user research; partnered with Product Managers and VP of Marketing & Sales to identify customer and business goals; redesigned information architecture by consolidating four stand-alone apps into one enterprise system that supports over 250,000 call center agents. Languages English Chinese English Chinese English Chinese Skills User Experience User Research Usability Testing Heuristic Evaluation User-centered Design Human Computer... User Interface Design Information Architecture Usability Engineering Task Analysis Interaction Design Experience Design Persona Wire Framing User Scenarios User Experience Design Agile Methodologies Mobile Applications User Interface See 4+     See less Skills  User Experience User Research Usability Testing Heuristic Evaluation User-centered Design Human Computer... User Interface Design Information Architecture Usability Engineering Task Analysis Interaction Design Experience Design Persona Wire Framing User Scenarios User Experience Design Agile Methodologies Mobile Applications User Interface See 4+     See less User Experience User Research Usability Testing Heuristic Evaluation User-centered Design Human Computer... User Interface Design Information Architecture Usability Engineering Task Analysis Interaction Design Experience Design Persona Wire Framing User Scenarios User Experience Design Agile Methodologies Mobile Applications User Interface See 4+     See less User Experience User Research Usability Testing Heuristic Evaluation User-centered Design Human Computer... User Interface Design Information Architecture Usability Engineering Task Analysis Interaction Design Experience Design Persona Wire Framing User Scenarios User Experience Design Agile Methodologies Mobile Applications User Interface See 4+     See less Education University of Washington User-Centered Design certificate,  Graduate study 2007  – 2008 Art Center College of Design Bachelor of Fine Arts (BFA),  Graphics and Packaging 1989  – 1991 University of Washington User-Centered Design certificate,  Graduate study 2007  – 2008 University of Washington User-Centered Design certificate,  Graduate study 2007  – 2008 University of Washington User-Centered Design certificate,  Graduate study 2007  – 2008 Art Center College of Design Bachelor of Fine Arts (BFA),  Graphics and Packaging 1989  – 1991 Art Center College of Design Bachelor of Fine Arts (BFA),  Graphics and Packaging 1989  – 1991 Art Center College of Design Bachelor of Fine Arts (BFA),  Graphics and Packaging 1989  – 1991 ", "Summary DESIGN + CODE --- Create amazing experiences. BUILD INSPIRE TEACH \n \nSpécialités : \n \nUser Experience Design \nSoftware & Hardware Prototyping \nMotion Design \nSound Design \nTeaching: Coding, Electronics \n3D Summary DESIGN + CODE --- Create amazing experiences. BUILD INSPIRE TEACH \n \nSpécialités : \n \nUser Experience Design \nSoftware & Hardware Prototyping \nMotion Design \nSound Design \nTeaching: Coding, Electronics \n3D DESIGN + CODE --- Create amazing experiences. BUILD INSPIRE TEACH \n \nSpécialités : \n \nUser Experience Design \nSoftware & Hardware Prototyping \nMotion Design \nSound Design \nTeaching: Coding, Electronics \n3D DESIGN + CODE --- Create amazing experiences. BUILD INSPIRE TEACH \n \nSpécialités : \n \nUser Experience Design \nSoftware & Hardware Prototyping \nMotion Design \nSound Design \nTeaching: Coding, Electronics \n3D Experience Senior UX Designer Google May 2011  – Present (4 years 4 months) Mountain View, CA - Cardboard Virtual Reality \n \n- Chrome OS \n- Chrome Android + Apple iOS \n- Material Motion Design - Google-wide \n \n- Self-Driving Cars \n \n20% Projects: \n \n- UI Sound Design across Google - YouTube, Chrome OS, Google.com Doodles! \n- Google Glass physical prototyping \n \n \n- Public speaking, representing Google at events \n- Organized and hosted a popular weekly User Experience Workshops (Google-wide) Founder and Teacher Code Breakers Society ORG February 2013  –  July 2014  (1 year 6 months) Felton, CA Touching the future! \nTeaching kids 10 years old and up! \n \n- Programming (HTML5, CSS3, Javascript) \n- Physical computing & electronics (Arduino, Raspberry Pi, soldering) \n- Linux OS / web hosting \n \nWEBSITE \nhttp://codebreakerssociety.org User Experience Designer Microsoft December 2001  –  May 2011  (9 years 6 months) Worked on: \n \nWindows 8 \nWindows 7 \nWindows Live (multiple releases) \nWindows Incubation Projects \nExpression Blend \"Sparkle\" Founder FutureProducers.com September 1999  –  October 2008  (9 years 2 months) Music production community, articles and educational content publication. Over the years, Future Producers (\"FP\") has become one of the top music production sites in the world. I launched and developed, produced and published content, for hundreds of thousands of registered users. Founder Mano1.com User Experience Consultancy January 1998  –  August 2003  (5 years 8 months) France, USA UX Design and Development \n \nCLIENTS: \n \nMicrosoft, Native Instruments (Germany), Florida State Department of Health (USA), Crispin Porter & Bogusky (USA), TRUTH Anti-Tobacco (USA), Gooey (Israel), Electric Rain / SWIFT 3D (USA), President Jacques Chirac (France), Lynda Weinmann Lynda.com (USA) \n \nSPEAKER, CONFERENCES: \n \n. Keynote Speaker, Expression Around The Clock (2007, Seoul, KOREA) \n. Flash Forward (6 conferences, San Francisco, New York, London) \n. Internet.com Flash Kit Conference (2001, Los Angeles, USA) \n. Macromedia Web World (2002, San Francisco) Senior UX Designer Google May 2011  – Present (4 years 4 months) Mountain View, CA - Cardboard Virtual Reality \n \n- Chrome OS \n- Chrome Android + Apple iOS \n- Material Motion Design - Google-wide \n \n- Self-Driving Cars \n \n20% Projects: \n \n- UI Sound Design across Google - YouTube, Chrome OS, Google.com Doodles! \n- Google Glass physical prototyping \n \n \n- Public speaking, representing Google at events \n- Organized and hosted a popular weekly User Experience Workshops (Google-wide) Senior UX Designer Google May 2011  – Present (4 years 4 months) Mountain View, CA - Cardboard Virtual Reality \n \n- Chrome OS \n- Chrome Android + Apple iOS \n- Material Motion Design - Google-wide \n \n- Self-Driving Cars \n \n20% Projects: \n \n- UI Sound Design across Google - YouTube, Chrome OS, Google.com Doodles! \n- Google Glass physical prototyping \n \n \n- Public speaking, representing Google at events \n- Organized and hosted a popular weekly User Experience Workshops (Google-wide) Founder and Teacher Code Breakers Society ORG February 2013  –  July 2014  (1 year 6 months) Felton, CA Touching the future! \nTeaching kids 10 years old and up! \n \n- Programming (HTML5, CSS3, Javascript) \n- Physical computing & electronics (Arduino, Raspberry Pi, soldering) \n- Linux OS / web hosting \n \nWEBSITE \nhttp://codebreakerssociety.org Founder and Teacher Code Breakers Society ORG February 2013  –  July 2014  (1 year 6 months) Felton, CA Touching the future! \nTeaching kids 10 years old and up! \n \n- Programming (HTML5, CSS3, Javascript) \n- Physical computing & electronics (Arduino, Raspberry Pi, soldering) \n- Linux OS / web hosting \n \nWEBSITE \nhttp://codebreakerssociety.org User Experience Designer Microsoft December 2001  –  May 2011  (9 years 6 months) Worked on: \n \nWindows 8 \nWindows 7 \nWindows Live (multiple releases) \nWindows Incubation Projects \nExpression Blend \"Sparkle\" User Experience Designer Microsoft December 2001  –  May 2011  (9 years 6 months) Worked on: \n \nWindows 8 \nWindows 7 \nWindows Live (multiple releases) \nWindows Incubation Projects \nExpression Blend \"Sparkle\" Founder FutureProducers.com September 1999  –  October 2008  (9 years 2 months) Music production community, articles and educational content publication. Over the years, Future Producers (\"FP\") has become one of the top music production sites in the world. I launched and developed, produced and published content, for hundreds of thousands of registered users. Founder FutureProducers.com September 1999  –  October 2008  (9 years 2 months) Music production community, articles and educational content publication. Over the years, Future Producers (\"FP\") has become one of the top music production sites in the world. I launched and developed, produced and published content, for hundreds of thousands of registered users. Founder Mano1.com User Experience Consultancy January 1998  –  August 2003  (5 years 8 months) France, USA UX Design and Development \n \nCLIENTS: \n \nMicrosoft, Native Instruments (Germany), Florida State Department of Health (USA), Crispin Porter & Bogusky (USA), TRUTH Anti-Tobacco (USA), Gooey (Israel), Electric Rain / SWIFT 3D (USA), President Jacques Chirac (France), Lynda Weinmann Lynda.com (USA) \n \nSPEAKER, CONFERENCES: \n \n. Keynote Speaker, Expression Around The Clock (2007, Seoul, KOREA) \n. Flash Forward (6 conferences, San Francisco, New York, London) \n. Internet.com Flash Kit Conference (2001, Los Angeles, USA) \n. Macromedia Web World (2002, San Francisco) Founder Mano1.com User Experience Consultancy January 1998  –  August 2003  (5 years 8 months) France, USA UX Design and Development \n \nCLIENTS: \n \nMicrosoft, Native Instruments (Germany), Florida State Department of Health (USA), Crispin Porter & Bogusky (USA), TRUTH Anti-Tobacco (USA), Gooey (Israel), Electric Rain / SWIFT 3D (USA), President Jacques Chirac (France), Lynda Weinmann Lynda.com (USA) \n \nSPEAKER, CONFERENCES: \n \n. Keynote Speaker, Expression Around The Clock (2007, Seoul, KOREA) \n. Flash Forward (6 conferences, San Francisco, New York, London) \n. Internet.com Flash Kit Conference (2001, Los Angeles, USA) \n. Macromedia Web World (2002, San Francisco) Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Virtual Reality User Experience Prototyping User Interface User-centered Design Unity3D User Interface Design Interaction Design Flash Experience Design Expression Blend Human Computer... CSS Rapid Prototyping Wireframes Prototype Usability Testing Wire Framing Visual Design ActionScript C# User Scenarios Music Production Audio Design HTML5 Paper Prototyping Android Information Design Physical Computing Public Speaking Arduino WPF Silverlight Video Production Photography Adobe Creative Suite 3D SketchUp Photoshop Human-computer... Visual CAD Modo Wing Chun PHP jQuery Android Development Maya See 33+     See less Skills  Virtual Reality User Experience Prototyping User Interface User-centered Design Unity3D User Interface Design Interaction Design Flash Experience Design Expression Blend Human Computer... CSS Rapid Prototyping Wireframes Prototype Usability Testing Wire Framing Visual Design ActionScript C# User Scenarios Music Production Audio Design HTML5 Paper Prototyping Android Information Design Physical Computing Public Speaking Arduino WPF Silverlight Video Production Photography Adobe Creative Suite 3D SketchUp Photoshop Human-computer... Visual CAD Modo Wing Chun PHP jQuery Android Development Maya See 33+     See less Virtual Reality User Experience Prototyping User Interface User-centered Design Unity3D User Interface Design Interaction Design Flash Experience Design Expression Blend Human Computer... CSS Rapid Prototyping Wireframes Prototype Usability Testing Wire Framing Visual Design ActionScript C# User Scenarios Music Production Audio Design HTML5 Paper Prototyping Android Information Design Physical Computing Public Speaking Arduino WPF Silverlight Video Production Photography Adobe Creative Suite 3D SketchUp Photoshop Human-computer... Visual CAD Modo Wing Chun PHP jQuery Android Development Maya See 33+     See less Virtual Reality User Experience Prototyping User Interface User-centered Design Unity3D User Interface Design Interaction Design Flash Experience Design Expression Blend Human Computer... CSS Rapid Prototyping Wireframes Prototype Usability Testing Wire Framing Visual Design ActionScript C# User Scenarios Music Production Audio Design HTML5 Paper Prototyping Android Information Design Physical Computing Public Speaking Arduino WPF Silverlight Video Production Photography Adobe Creative Suite 3D SketchUp Photoshop Human-computer... Visual CAD Modo Wing Chun PHP jQuery Android Development Maya See 33+     See less Honors & Awards Macromedia SOD Award (x3) Macromedia I've received three Macromedia SSOD and SOD awards as early as 1998 France Telecom NET D'OR France Telecom January 2000 Website honoring the city of Marseille, France Flash Film Festival Nomination February 2001 TRUTH anti-tobacco campaign website nominated Macromedia SOD Award (x3) Macromedia I've received three Macromedia SSOD and SOD awards as early as 1998 Macromedia SOD Award (x3) Macromedia I've received three Macromedia SSOD and SOD awards as early as 1998 Macromedia SOD Award (x3) Macromedia I've received three Macromedia SSOD and SOD awards as early as 1998 France Telecom NET D'OR France Telecom January 2000 Website honoring the city of Marseille, France France Telecom NET D'OR France Telecom January 2000 Website honoring the city of Marseille, France France Telecom NET D'OR France Telecom January 2000 Website honoring the city of Marseille, France Flash Film Festival Nomination February 2001 TRUTH anti-tobacco campaign website nominated Flash Film Festival Nomination February 2001 TRUTH anti-tobacco campaign website nominated Flash Film Festival Nomination February 2001 TRUTH anti-tobacco campaign website nominated ", "Experience Head of Design, Living Room Experiences Hulu April 2015  – Present (5 months) Greater Seattle Area Principal UX Designer, Global Product Expedia, Inc. September 2013  –  April 2015  (1 year 8 months) Bellevue, WA Senior UX Designer, Google Cloud Platform Google January 2013  –  August 2013  (8 months) Greater Seattle Area Products: BigQuery, Cloud SQL, Cloud Datastore, Cloud Storage, Google IO '13: Cloud Demo App Senior UX Designer, Google+ Hangouts Google March 2012  –  January 2013  (11 months) Kirkland, WA Products: Hangout Apps, Audience Participation, Stream Posts Senior UX Designer, Google+ Games Google December 2011  –  October 2012  (11 months) Mountain View, CA Products: Mobile Match Creation, Hangout Game Integration, Desktop to Mobile UI Senior UX Designer, Google+ Mobile Google October 2011  –  March 2012  (6 months) Mountain View, CA Google+ iPad App: Compose Post, Stream Posts, Photo Backup, Events Camera UX Designer, Google+ Mobile Google July 2011  –  October 2011  (4 months) Mountain View, CA Google+ iPhone App: Photos (incl. Auto-Upload), Profiles, Post Comments, Circles Curation UX Designer, Google+ Photos Google November 2010  –  July 2011  (9 months) Seattle, WA Products: Google+ Photos, Photo Editor UX Designer, Amazon Mobile Amazon.com April 2010  –  November 2010  (8 months) Seattle, WA Products: Amazon Price Check, Amazon Windowshop, Amazon App UX Designer, Amazon.com Amazon.com July 2009  –  April 2010  (10 months) Seattle, WA Products: Amazon Windowshop, Amazon Bestsellers, Amazon (footer) Lead UI Designer RealNetworks March 2009  –  July 2009  (5 months) Seattle, WA Products: (Stealth Product) - Living Room Conceptual UI, Second-screen Mobile UX/UI Lead UX Designer Infospace April 2008  –  December 2008  (9 months) Bellevue, WA Products: Meta-search Product, Browser Toolbars (MS Silverlight), Desktop Widgets (Yahoo!) Design Director Eddie Bauer March 2007  –  April 2008  (1 year 2 months) Bellevue, WA Art Director Eddie Bauer March 2004  –  March 2007  (3 years 1 month) Redmond, WA UI Designer / IA Eddie Bauer May 1999  –  March 2004  (4 years 11 months) Redmond, WA Head of Design, Living Room Experiences Hulu April 2015  – Present (5 months) Greater Seattle Area Head of Design, Living Room Experiences Hulu April 2015  – Present (5 months) Greater Seattle Area Principal UX Designer, Global Product Expedia, Inc. September 2013  –  April 2015  (1 year 8 months) Bellevue, WA Principal UX Designer, Global Product Expedia, Inc. September 2013  –  April 2015  (1 year 8 months) Bellevue, WA Senior UX Designer, Google Cloud Platform Google January 2013  –  August 2013  (8 months) Greater Seattle Area Products: BigQuery, Cloud SQL, Cloud Datastore, Cloud Storage, Google IO '13: Cloud Demo App Senior UX Designer, Google Cloud Platform Google January 2013  –  August 2013  (8 months) Greater Seattle Area Products: BigQuery, Cloud SQL, Cloud Datastore, Cloud Storage, Google IO '13: Cloud Demo App Senior UX Designer, Google+ Hangouts Google March 2012  –  January 2013  (11 months) Kirkland, WA Products: Hangout Apps, Audience Participation, Stream Posts Senior UX Designer, Google+ Hangouts Google March 2012  –  January 2013  (11 months) Kirkland, WA Products: Hangout Apps, Audience Participation, Stream Posts Senior UX Designer, Google+ Games Google December 2011  –  October 2012  (11 months) Mountain View, CA Products: Mobile Match Creation, Hangout Game Integration, Desktop to Mobile UI Senior UX Designer, Google+ Games Google December 2011  –  October 2012  (11 months) Mountain View, CA Products: Mobile Match Creation, Hangout Game Integration, Desktop to Mobile UI Senior UX Designer, Google+ Mobile Google October 2011  –  March 2012  (6 months) Mountain View, CA Google+ iPad App: Compose Post, Stream Posts, Photo Backup, Events Camera Senior UX Designer, Google+ Mobile Google October 2011  –  March 2012  (6 months) Mountain View, CA Google+ iPad App: Compose Post, Stream Posts, Photo Backup, Events Camera UX Designer, Google+ Mobile Google July 2011  –  October 2011  (4 months) Mountain View, CA Google+ iPhone App: Photos (incl. Auto-Upload), Profiles, Post Comments, Circles Curation UX Designer, Google+ Mobile Google July 2011  –  October 2011  (4 months) Mountain View, CA Google+ iPhone App: Photos (incl. Auto-Upload), Profiles, Post Comments, Circles Curation UX Designer, Google+ Photos Google November 2010  –  July 2011  (9 months) Seattle, WA Products: Google+ Photos, Photo Editor UX Designer, Google+ Photos Google November 2010  –  July 2011  (9 months) Seattle, WA Products: Google+ Photos, Photo Editor UX Designer, Amazon Mobile Amazon.com April 2010  –  November 2010  (8 months) Seattle, WA Products: Amazon Price Check, Amazon Windowshop, Amazon App UX Designer, Amazon Mobile Amazon.com April 2010  –  November 2010  (8 months) Seattle, WA Products: Amazon Price Check, Amazon Windowshop, Amazon App UX Designer, Amazon.com Amazon.com July 2009  –  April 2010  (10 months) Seattle, WA Products: Amazon Windowshop, Amazon Bestsellers, Amazon (footer) UX Designer, Amazon.com Amazon.com July 2009  –  April 2010  (10 months) Seattle, WA Products: Amazon Windowshop, Amazon Bestsellers, Amazon (footer) Lead UI Designer RealNetworks March 2009  –  July 2009  (5 months) Seattle, WA Products: (Stealth Product) - Living Room Conceptual UI, Second-screen Mobile UX/UI Lead UI Designer RealNetworks March 2009  –  July 2009  (5 months) Seattle, WA Products: (Stealth Product) - Living Room Conceptual UI, Second-screen Mobile UX/UI Lead UX Designer Infospace April 2008  –  December 2008  (9 months) Bellevue, WA Products: Meta-search Product, Browser Toolbars (MS Silverlight), Desktop Widgets (Yahoo!) Lead UX Designer Infospace April 2008  –  December 2008  (9 months) Bellevue, WA Products: Meta-search Product, Browser Toolbars (MS Silverlight), Desktop Widgets (Yahoo!) Design Director Eddie Bauer March 2007  –  April 2008  (1 year 2 months) Bellevue, WA Design Director Eddie Bauer March 2007  –  April 2008  (1 year 2 months) Bellevue, WA Art Director Eddie Bauer March 2004  –  March 2007  (3 years 1 month) Redmond, WA Art Director Eddie Bauer March 2004  –  March 2007  (3 years 1 month) Redmond, WA UI Designer / IA Eddie Bauer May 1999  –  March 2004  (4 years 11 months) Redmond, WA UI Designer / IA Eddie Bauer May 1999  –  March 2004  (4 years 11 months) Redmond, WA Skills WebRTC iOS Design Android Design HTML 5 JavaScript Mobile Design Interactive TV User Interface Design User Experience Tablet App Design Real Time Communications Social Network Design Social Game Development Information Architecture User-centered Design Interaction Design E-commerce Creative Direction CSS Wire Framing User Experience Design User Research Graphic Design Mobile Devices Visual Design HTML5 See 11+     See less Skills  WebRTC iOS Design Android Design HTML 5 JavaScript Mobile Design Interactive TV User Interface Design User Experience Tablet App Design Real Time Communications Social Network Design Social Game Development Information Architecture User-centered Design Interaction Design E-commerce Creative Direction CSS Wire Framing User Experience Design User Research Graphic Design Mobile Devices Visual Design HTML5 See 11+     See less WebRTC iOS Design Android Design HTML 5 JavaScript Mobile Design Interactive TV User Interface Design User Experience Tablet App Design Real Time Communications Social Network Design Social Game Development Information Architecture User-centered Design Interaction Design E-commerce Creative Direction CSS Wire Framing User Experience Design User Research Graphic Design Mobile Devices Visual Design HTML5 See 11+     See less WebRTC iOS Design Android Design HTML 5 JavaScript Mobile Design Interactive TV User Interface Design User Experience Tablet App Design Real Time Communications Social Network Design Social Game Development Information Architecture User-centered Design Interaction Design E-commerce Creative Direction CSS Wire Framing User Experience Design User Research Graphic Design Mobile Devices Visual Design HTML5 See 11+     See less ", "Summary A lead UX designer with over ten years’ experience creating exceptional experiences across mobile, tablet, web, TV, and wearable platforms. \n \nFluent in a human-centered design thinking process emphasizing customer insights, scenario shaping, concept development, prototyping and iteration.  \n \nProven ability to successfully partner with brand, marketing, product management, engineering, and executive leadership stakeholders. \n \nPassionate about creating extraordinary products and services that solve real human problems. Summary A lead UX designer with over ten years’ experience creating exceptional experiences across mobile, tablet, web, TV, and wearable platforms. \n \nFluent in a human-centered design thinking process emphasizing customer insights, scenario shaping, concept development, prototyping and iteration.  \n \nProven ability to successfully partner with brand, marketing, product management, engineering, and executive leadership stakeholders. \n \nPassionate about creating extraordinary products and services that solve real human problems. A lead UX designer with over ten years’ experience creating exceptional experiences across mobile, tablet, web, TV, and wearable platforms. \n \nFluent in a human-centered design thinking process emphasizing customer insights, scenario shaping, concept development, prototyping and iteration.  \n \nProven ability to successfully partner with brand, marketing, product management, engineering, and executive leadership stakeholders. \n \nPassionate about creating extraordinary products and services that solve real human problems. A lead UX designer with over ten years’ experience creating exceptional experiences across mobile, tablet, web, TV, and wearable platforms. \n \nFluent in a human-centered design thinking process emphasizing customer insights, scenario shaping, concept development, prototyping and iteration.  \n \nProven ability to successfully partner with brand, marketing, product management, engineering, and executive leadership stakeholders. \n \nPassionate about creating extraordinary products and services that solve real human problems. Experience Senior UX Designer Google October 2012  – Present (2 years 11 months) Zürich Area, Switzerland Led interaction and visual design for iOS and Android apps, from early concept through execution \n \nDrove product and design alignment within the larger Google ecosystem, working closely with globally-distributed design and engineering teams \n \nTeamed with brand and marketing teams to shape product positioning and messaging \n \nCollaborated closely with engineering and user researchers to prototype, test and iterate designs \n \nCreated compelling, insights-driven user stories, communicating an experience point-of-view to stakeholders \n \nDeveloped Google-wide coursework on approaches to creating exceptional user experiences  User Experience Designer, HoloLens Wearable Project Microsoft February 2012  –  September 2012  (8 months) Seattle, United States Designer on creative team responsible for early concept development of Microsoft HoloLens \n \nCreated user experience vision stories to frame opportunities for executive sponsors \n \nPrototyped and iterated on experimental input models User Experience Designer, Windows Phone Microsoft March 2009  –  February 2012  (3 years) Seattle, United States Led the design of the search, maps, and location-based experiences on Windows Phone, driving designs from vision through to completion  \n \nEnsured full integration of brand, interaction design, visual design, usability, and business objectives in my feature areas \n \nCreated full range of design deliverables including: wireframes, schematics, logic flows, information architecture diagrams, UI mockups, presentations, and prototypes \n \nManaged the design process, including resource allocations, schedule, and deliverables across multiple simultaneous workstreams User Experience Program Manager, Windows Media Center Microsoft August 2006  –  March 2009  (2 years 8 months) Seattle, United States Created digital media entertainment experiences for set top boxes and internet-connected televisions, working with third-party manufacturers including Sony, Cisco-Linksys, Hewlett-Packard, and Samsung \n \nGathered requirements including technical and competitive investigations as well as created interaction design documentation including logic flows and wireframes \n \nUtilized sketching, wireframing, and rapid prototyping extensively to evaluate and iterate on a broad range of solutions when exploring concepts for future releases \n \nTranslated user research to make immediately tangible product changes as well as create personas and scenarios for future product innovation Design Intern Xoom Corporation December 2004  –  March 2005  (4 months) San Francisco Bay Area Collaborated on improvements to the xoom.com website to improve navigation and transaction efficiency \n \nImplemented a user testing program of an international online-to-cashpoint money transfer service beta \n \nSynthesized user feedback for product managers and executives, recommending pre-launch modifications to the service Senior UX Designer Google October 2012  – Present (2 years 11 months) Zürich Area, Switzerland Led interaction and visual design for iOS and Android apps, from early concept through execution \n \nDrove product and design alignment within the larger Google ecosystem, working closely with globally-distributed design and engineering teams \n \nTeamed with brand and marketing teams to shape product positioning and messaging \n \nCollaborated closely with engineering and user researchers to prototype, test and iterate designs \n \nCreated compelling, insights-driven user stories, communicating an experience point-of-view to stakeholders \n \nDeveloped Google-wide coursework on approaches to creating exceptional user experiences  Senior UX Designer Google October 2012  – Present (2 years 11 months) Zürich Area, Switzerland Led interaction and visual design for iOS and Android apps, from early concept through execution \n \nDrove product and design alignment within the larger Google ecosystem, working closely with globally-distributed design and engineering teams \n \nTeamed with brand and marketing teams to shape product positioning and messaging \n \nCollaborated closely with engineering and user researchers to prototype, test and iterate designs \n \nCreated compelling, insights-driven user stories, communicating an experience point-of-view to stakeholders \n \nDeveloped Google-wide coursework on approaches to creating exceptional user experiences  User Experience Designer, HoloLens Wearable Project Microsoft February 2012  –  September 2012  (8 months) Seattle, United States Designer on creative team responsible for early concept development of Microsoft HoloLens \n \nCreated user experience vision stories to frame opportunities for executive sponsors \n \nPrototyped and iterated on experimental input models User Experience Designer, HoloLens Wearable Project Microsoft February 2012  –  September 2012  (8 months) Seattle, United States Designer on creative team responsible for early concept development of Microsoft HoloLens \n \nCreated user experience vision stories to frame opportunities for executive sponsors \n \nPrototyped and iterated on experimental input models User Experience Designer, Windows Phone Microsoft March 2009  –  February 2012  (3 years) Seattle, United States Led the design of the search, maps, and location-based experiences on Windows Phone, driving designs from vision through to completion  \n \nEnsured full integration of brand, interaction design, visual design, usability, and business objectives in my feature areas \n \nCreated full range of design deliverables including: wireframes, schematics, logic flows, information architecture diagrams, UI mockups, presentations, and prototypes \n \nManaged the design process, including resource allocations, schedule, and deliverables across multiple simultaneous workstreams User Experience Designer, Windows Phone Microsoft March 2009  –  February 2012  (3 years) Seattle, United States Led the design of the search, maps, and location-based experiences on Windows Phone, driving designs from vision through to completion  \n \nEnsured full integration of brand, interaction design, visual design, usability, and business objectives in my feature areas \n \nCreated full range of design deliverables including: wireframes, schematics, logic flows, information architecture diagrams, UI mockups, presentations, and prototypes \n \nManaged the design process, including resource allocations, schedule, and deliverables across multiple simultaneous workstreams User Experience Program Manager, Windows Media Center Microsoft August 2006  –  March 2009  (2 years 8 months) Seattle, United States Created digital media entertainment experiences for set top boxes and internet-connected televisions, working with third-party manufacturers including Sony, Cisco-Linksys, Hewlett-Packard, and Samsung \n \nGathered requirements including technical and competitive investigations as well as created interaction design documentation including logic flows and wireframes \n \nUtilized sketching, wireframing, and rapid prototyping extensively to evaluate and iterate on a broad range of solutions when exploring concepts for future releases \n \nTranslated user research to make immediately tangible product changes as well as create personas and scenarios for future product innovation User Experience Program Manager, Windows Media Center Microsoft August 2006  –  March 2009  (2 years 8 months) Seattle, United States Created digital media entertainment experiences for set top boxes and internet-connected televisions, working with third-party manufacturers including Sony, Cisco-Linksys, Hewlett-Packard, and Samsung \n \nGathered requirements including technical and competitive investigations as well as created interaction design documentation including logic flows and wireframes \n \nUtilized sketching, wireframing, and rapid prototyping extensively to evaluate and iterate on a broad range of solutions when exploring concepts for future releases \n \nTranslated user research to make immediately tangible product changes as well as create personas and scenarios for future product innovation Design Intern Xoom Corporation December 2004  –  March 2005  (4 months) San Francisco Bay Area Collaborated on improvements to the xoom.com website to improve navigation and transaction efficiency \n \nImplemented a user testing program of an international online-to-cashpoint money transfer service beta \n \nSynthesized user feedback for product managers and executives, recommending pre-launch modifications to the service Design Intern Xoom Corporation December 2004  –  March 2005  (4 months) San Francisco Bay Area Collaborated on improvements to the xoom.com website to improve navigation and transaction efficiency \n \nImplemented a user testing program of an international online-to-cashpoint money transfer service beta \n \nSynthesized user feedback for product managers and executives, recommending pre-launch modifications to the service Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills User Experience Interaction Design User Interface Design Mobile Design Usability User Interface Design Thinking Experience Design Information Architecture Mobile Devices User Scenarios Mobile Technology Location Based Services Design Strategy Ethnography Product Design User Experience Design Mobile Applications Rapid Prototyping User Stories Design Management Visual Arts Brand Development Mobile Application... Interactive TV Customer Insight Product Incubation Visual Communication Wearables See 14+     See less Skills  User Experience Interaction Design User Interface Design Mobile Design Usability User Interface Design Thinking Experience Design Information Architecture Mobile Devices User Scenarios Mobile Technology Location Based Services Design Strategy Ethnography Product Design User Experience Design Mobile Applications Rapid Prototyping User Stories Design Management Visual Arts Brand Development Mobile Application... Interactive TV Customer Insight Product Incubation Visual Communication Wearables See 14+     See less User Experience Interaction Design User Interface Design Mobile Design Usability User Interface Design Thinking Experience Design Information Architecture Mobile Devices User Scenarios Mobile Technology Location Based Services Design Strategy Ethnography Product Design User Experience Design Mobile Applications Rapid Prototyping User Stories Design Management Visual Arts Brand Development Mobile Application... Interactive TV Customer Insight Product Incubation Visual Communication Wearables See 14+     See less User Experience Interaction Design User Interface Design Mobile Design Usability User Interface Design Thinking Experience Design Information Architecture Mobile Devices User Scenarios Mobile Technology Location Based Services Design Strategy Ethnography Product Design User Experience Design Mobile Applications Rapid Prototyping User Stories Design Management Visual Arts Brand Development Mobile Application... Interactive TV Customer Insight Product Incubation Visual Communication Wearables See 14+     See less Education Stanford University Bachelor of Science,  Engineering - Product Design 2003  – 2006 Project Highlights \n \n6/2006  \nRenée, a Cafetière \n \nDesigned and fabricated a cafetière that simplifies operation and delivers a superior cup of coffee while preserving the ritual of manually brewing coffee \n \nPerformed an in-depth analysis of the coffee preparation experience, including user observation, competitive analysis, and market trends, followed by ideation, extensive prototyping, and testing to validate the design’s improvements \n \n \n3/2006 \nNeedfinding Research for Nike \n \nConducted extensive research of children age 7-9, looking for unmet needs and ways in which Nike could innovate and connect with children beyond footwear solutions \n \nProposed solutions to Nike to enhance its brand and unite children with common sports interests in an online community Activities and Societies:  Product Design Student Association (PDSA) University of California, San Diego 2001  – 2003 Studied Studio Art and Art History The College Preparatory School Secondary School Diploma 1997  – 2001 Stanford University Bachelor of Science,  Engineering - Product Design 2003  – 2006 Project Highlights \n \n6/2006  \nRenée, a Cafetière \n \nDesigned and fabricated a cafetière that simplifies operation and delivers a superior cup of coffee while preserving the ritual of manually brewing coffee \n \nPerformed an in-depth analysis of the coffee preparation experience, including user observation, competitive analysis, and market trends, followed by ideation, extensive prototyping, and testing to validate the design’s improvements \n \n \n3/2006 \nNeedfinding Research for Nike \n \nConducted extensive research of children age 7-9, looking for unmet needs and ways in which Nike could innovate and connect with children beyond footwear solutions \n \nProposed solutions to Nike to enhance its brand and unite children with common sports interests in an online community Activities and Societies:  Product Design Student Association (PDSA) Stanford University Bachelor of Science,  Engineering - Product Design 2003  – 2006 Project Highlights \n \n6/2006  \nRenée, a Cafetière \n \nDesigned and fabricated a cafetière that simplifies operation and delivers a superior cup of coffee while preserving the ritual of manually brewing coffee \n \nPerformed an in-depth analysis of the coffee preparation experience, including user observation, competitive analysis, and market trends, followed by ideation, extensive prototyping, and testing to validate the design’s improvements \n \n \n3/2006 \nNeedfinding Research for Nike \n \nConducted extensive research of children age 7-9, looking for unmet needs and ways in which Nike could innovate and connect with children beyond footwear solutions \n \nProposed solutions to Nike to enhance its brand and unite children with common sports interests in an online community Activities and Societies:  Product Design Student Association (PDSA) Stanford University Bachelor of Science,  Engineering - Product Design 2003  – 2006 Project Highlights \n \n6/2006  \nRenée, a Cafetière \n \nDesigned and fabricated a cafetière that simplifies operation and delivers a superior cup of coffee while preserving the ritual of manually brewing coffee \n \nPerformed an in-depth analysis of the coffee preparation experience, including user observation, competitive analysis, and market trends, followed by ideation, extensive prototyping, and testing to validate the design’s improvements \n \n \n3/2006 \nNeedfinding Research for Nike \n \nConducted extensive research of children age 7-9, looking for unmet needs and ways in which Nike could innovate and connect with children beyond footwear solutions \n \nProposed solutions to Nike to enhance its brand and unite children with common sports interests in an online community Activities and Societies:  Product Design Student Association (PDSA) University of California, San Diego 2001  – 2003 Studied Studio Art and Art History University of California, San Diego 2001  – 2003 Studied Studio Art and Art History University of California, San Diego 2001  – 2003 Studied Studio Art and Art History The College Preparatory School Secondary School Diploma 1997  – 2001 The College Preparatory School Secondary School Diploma 1997  – 2001 The College Preparatory School Secondary School Diploma 1997  – 2001 ", "Experience Senior UX Designer Google June 2012  – Present (3 years 3 months) Mountain View CA UX Project Manager Samsung Electronics January 2009  –  June 2012  (3 years 6 months) UX Designer Motorola June 2008  –  December 2009  (1 year 7 months) Senior UX Designer Google June 2012  – Present (3 years 3 months) Mountain View CA Senior UX Designer Google June 2012  – Present (3 years 3 months) Mountain View CA UX Project Manager Samsung Electronics January 2009  –  June 2012  (3 years 6 months) UX Project Manager Samsung Electronics January 2009  –  June 2012  (3 years 6 months) UX Designer Motorola June 2008  –  December 2009  (1 year 7 months) UX Designer Motorola June 2008  –  December 2009  (1 year 7 months) Skills Graphic Design Web Development Web Services Android SDK Skills  Graphic Design Web Development Web Services Android SDK Graphic Design Web Development Web Services Android SDK Graphic Design Web Development Web Services Android SDK Education Carnegie Mellon University MA,  Interaction Design 2006  – 2008 D.J Sanghvi College of Engineering Bachelor's degree,  Computer Science 2002  – 2006 Ruparel College of Science Computer Science 2000  – 2002 St Ann's Convent School , Mumbai 1990  – 2000 Carnegie Mellon University MA,  Interaction Design 2006  – 2008 Carnegie Mellon University MA,  Interaction Design 2006  – 2008 Carnegie Mellon University MA,  Interaction Design 2006  – 2008 D.J Sanghvi College of Engineering Bachelor's degree,  Computer Science 2002  – 2006 D.J Sanghvi College of Engineering Bachelor's degree,  Computer Science 2002  – 2006 D.J Sanghvi College of Engineering Bachelor's degree,  Computer Science 2002  – 2006 Ruparel College of Science Computer Science 2000  – 2002 Ruparel College of Science Computer Science 2000  – 2002 Ruparel College of Science Computer Science 2000  – 2002 St Ann's Convent School , Mumbai 1990  – 2000 St Ann's Convent School , Mumbai 1990  – 2000 St Ann's Convent School , Mumbai 1990  – 2000 ", "Skills CSS jQuery User Experience User Interface Design JavaScript Agile Methodologies HTML 5 XML XHTML Usability Testing XSLT JSON User Interface Interaction Design Web Applications User Experience Design See 1+     See less Skills  CSS jQuery User Experience User Interface Design JavaScript Agile Methodologies HTML 5 XML XHTML Usability Testing XSLT JSON User Interface Interaction Design Web Applications User Experience Design See 1+     See less CSS jQuery User Experience User Interface Design JavaScript Agile Methodologies HTML 5 XML XHTML Usability Testing XSLT JSON User Interface Interaction Design Web Applications User Experience Design See 1+     See less CSS jQuery User Experience User Interface Design JavaScript Agile Methodologies HTML 5 XML XHTML Usability Testing XSLT JSON User Interface Interaction Design Web Applications User Experience Design See 1+     See less "]}