{"position": "Industrial Designer", "company": "Google", "profiles": ["Summary Putting an immense amount of care and craftsmanship into the products and teams I build. Summary Putting an immense amount of care and craftsmanship into the products and teams I build. Putting an immense amount of care and craftsmanship into the products and teams I build. Putting an immense amount of care and craftsmanship into the products and teams I build. Experience Product Designer Facebook August 2015  – Present (1 month) Menlo Park, CA Design Lead Coatue 2013  –  2015  (2 years) Menlo Park, CA Design Lead Google 2012  –  2013  (1 year) Mountain View, CA Brought on to lead the Profiles, Pages and Platform (PPP) design team, my major challenge was to develop a creative strategy for unifying all of Google's products into a single integrated platform. Additionally, this required a redesigned and unified identity across all Google products and platforms, with a strong emphasis on design parity between desktop and mobile platforms. Revamped our entire mobile process and design documentation on both iOS and Android. Elected member of a visual design team to redefine the design language of Google. Head of Product Design Pagemodo 2010  –  2012  (2 years) Washington D.C. Metro Area In an effort to pioneer social presence and marketing efforts of SMBs, we founded Pagemodo, a custom facebook fan page creation tool, created by myself and two engineers. We underwent three major iterations: tailoring the product for timeline, launching cover photo designer and engagement tools. We were a member of the Preferred Marketing Developer (PMD) Program at Facebook. By the end of the first year, Pagemodo metrics showed rapid growth: 12 million MAUs, over 500k+ Facebook pages created, 13 million user page views, and were a Top-10 App on Facebook, generating over $250k in monthly revenue. \n \nPagemodo was acquired by Vistaprint, Inc. in December 2011. Senior Product Designer Webs 2009  –  2012  (3 years) Washington D.C. Metro Area Webs is one of the largest DIY website creation platforms on the Web, servicing over 60 million users worldwide. While at Webs, my tasks included providing art direction and product vision for Webs' SiteBuilder tools, founding new products and managing junior/mid-level designers. Webs provided me a unique experience, working side-by-side with (and reported directly to) its CEO, Haroon Mokhtarzada, whose experience and insight had a lasting and invaluable impact on me. \n \nWebs was acquired by Vistaprint, Inc. in December 2011. Head of Product Design ContactMe 2009  –  2010  (1 year) Washington D.C. Metro Area ContactMe is a lightweight CRM tailored for small businesses that’s linked to easy entry-point buttons and forms that are placed anywhere on the Web. ContactMe’s form builder is the number one form plugin on Wordpress, and one of the most popular on the Web. \n \nContactMe was acquired by Webs, Inc. in 2009. Product Designer Facebook August 2015  – Present (1 month) Menlo Park, CA Product Designer Facebook August 2015  – Present (1 month) Menlo Park, CA Design Lead Coatue 2013  –  2015  (2 years) Menlo Park, CA Design Lead Coatue 2013  –  2015  (2 years) Menlo Park, CA Design Lead Google 2012  –  2013  (1 year) Mountain View, CA Brought on to lead the Profiles, Pages and Platform (PPP) design team, my major challenge was to develop a creative strategy for unifying all of Google's products into a single integrated platform. Additionally, this required a redesigned and unified identity across all Google products and platforms, with a strong emphasis on design parity between desktop and mobile platforms. Revamped our entire mobile process and design documentation on both iOS and Android. Elected member of a visual design team to redefine the design language of Google. Design Lead Google 2012  –  2013  (1 year) Mountain View, CA Brought on to lead the Profiles, Pages and Platform (PPP) design team, my major challenge was to develop a creative strategy for unifying all of Google's products into a single integrated platform. Additionally, this required a redesigned and unified identity across all Google products and platforms, with a strong emphasis on design parity between desktop and mobile platforms. Revamped our entire mobile process and design documentation on both iOS and Android. Elected member of a visual design team to redefine the design language of Google. Head of Product Design Pagemodo 2010  –  2012  (2 years) Washington D.C. Metro Area In an effort to pioneer social presence and marketing efforts of SMBs, we founded Pagemodo, a custom facebook fan page creation tool, created by myself and two engineers. We underwent three major iterations: tailoring the product for timeline, launching cover photo designer and engagement tools. We were a member of the Preferred Marketing Developer (PMD) Program at Facebook. By the end of the first year, Pagemodo metrics showed rapid growth: 12 million MAUs, over 500k+ Facebook pages created, 13 million user page views, and were a Top-10 App on Facebook, generating over $250k in monthly revenue. \n \nPagemodo was acquired by Vistaprint, Inc. in December 2011. Head of Product Design Pagemodo 2010  –  2012  (2 years) Washington D.C. Metro Area In an effort to pioneer social presence and marketing efforts of SMBs, we founded Pagemodo, a custom facebook fan page creation tool, created by myself and two engineers. We underwent three major iterations: tailoring the product for timeline, launching cover photo designer and engagement tools. We were a member of the Preferred Marketing Developer (PMD) Program at Facebook. By the end of the first year, Pagemodo metrics showed rapid growth: 12 million MAUs, over 500k+ Facebook pages created, 13 million user page views, and were a Top-10 App on Facebook, generating over $250k in monthly revenue. \n \nPagemodo was acquired by Vistaprint, Inc. in December 2011. Senior Product Designer Webs 2009  –  2012  (3 years) Washington D.C. Metro Area Webs is one of the largest DIY website creation platforms on the Web, servicing over 60 million users worldwide. While at Webs, my tasks included providing art direction and product vision for Webs' SiteBuilder tools, founding new products and managing junior/mid-level designers. Webs provided me a unique experience, working side-by-side with (and reported directly to) its CEO, Haroon Mokhtarzada, whose experience and insight had a lasting and invaluable impact on me. \n \nWebs was acquired by Vistaprint, Inc. in December 2011. Senior Product Designer Webs 2009  –  2012  (3 years) Washington D.C. Metro Area Webs is one of the largest DIY website creation platforms on the Web, servicing over 60 million users worldwide. While at Webs, my tasks included providing art direction and product vision for Webs' SiteBuilder tools, founding new products and managing junior/mid-level designers. Webs provided me a unique experience, working side-by-side with (and reported directly to) its CEO, Haroon Mokhtarzada, whose experience and insight had a lasting and invaluable impact on me. \n \nWebs was acquired by Vistaprint, Inc. in December 2011. Head of Product Design ContactMe 2009  –  2010  (1 year) Washington D.C. Metro Area ContactMe is a lightweight CRM tailored for small businesses that’s linked to easy entry-point buttons and forms that are placed anywhere on the Web. ContactMe’s form builder is the number one form plugin on Wordpress, and one of the most popular on the Web. \n \nContactMe was acquired by Webs, Inc. in 2009. Head of Product Design ContactMe 2009  –  2010  (1 year) Washington D.C. Metro Area ContactMe is a lightweight CRM tailored for small businesses that’s linked to easy entry-point buttons and forms that are placed anywhere on the Web. ContactMe’s form builder is the number one form plugin on Wordpress, and one of the most popular on the Web. \n \nContactMe was acquired by Webs, Inc. in 2009. Skills Information Architecture User Experience Design Interaction Design User Interface Design Mobile Design Web Design Usability Testing User Interface Front-end Digital Strategy CMS Mobile Applications HTML 5 WordPress Art Direction Illustrator See 1+     See less Skills  Information Architecture User Experience Design Interaction Design User Interface Design Mobile Design Web Design Usability Testing User Interface Front-end Digital Strategy CMS Mobile Applications HTML 5 WordPress Art Direction Illustrator See 1+     See less Information Architecture User Experience Design Interaction Design User Interface Design Mobile Design Web Design Usability Testing User Interface Front-end Digital Strategy CMS Mobile Applications HTML 5 WordPress Art Direction Illustrator See 1+     See less Information Architecture User Experience Design Interaction Design User Interface Design Mobile Design Web Design Usability Testing User Interface Front-end Digital Strategy CMS Mobile Applications HTML 5 WordPress Art Direction Illustrator See 1+     See less Education George Mason University B.F.A.,  Art & Visual Technology 2004  – 2009 Design Course TA, Applied Information Technology Department Volunteer, STAR Lab Instructor Activities and Societies:  AIGA ,  Pi Kappa Alpha George Mason University B.F.A.,  Art & Visual Technology 2004  – 2009 Design Course TA, Applied Information Technology Department Volunteer, STAR Lab Instructor Activities and Societies:  AIGA ,  Pi Kappa Alpha George Mason University B.F.A.,  Art & Visual Technology 2004  – 2009 Design Course TA, Applied Information Technology Department Volunteer, STAR Lab Instructor Activities and Societies:  AIGA ,  Pi Kappa Alpha George Mason University B.F.A.,  Art & Visual Technology 2004  – 2009 Design Course TA, Applied Information Technology Department Volunteer, STAR Lab Instructor Activities and Societies:  AIGA ,  Pi Kappa Alpha Honors & Awards Additional Honors & Awards Have won mulitple Webby Awards, WebAwards, Addy Awards, Davey Awards, Communicator Awards and IMA Awards in design and usability. Additional Honors & Awards Have won mulitple Webby Awards, WebAwards, Addy Awards, Davey Awards, Communicator Awards and IMA Awards in design and usability. Additional Honors & Awards Have won mulitple Webby Awards, WebAwards, Addy Awards, Davey Awards, Communicator Awards and IMA Awards in design and usability. Additional Honors & Awards Have won mulitple Webby Awards, WebAwards, Addy Awards, Davey Awards, Communicator Awards and IMA Awards in design and usability. ", "Experience Senior Product Designer Postmates May 2015  – Present (4 months) Founder Flying the Sun September 2013  –  May 2015  (1 year 9 months) San Francisco, CA Flying the Sun is an independent product company focused on mobile apps for iOS. I'm currently working on building our first product offerings, as well as overall marketing and business strategy. Contract Product Designer Quora May 2013  –  April 2015  (2 years) San Francisco, CA Contract member of the product design team working mainly on projects relating to the core web product. Product Designer Quora January 2011  –  May 2013  (2 years 5 months) Mountain View, CA Product designer focused on mobile, responsible for both design and front-end development in Python, HTML/CSS/JS, and Objective-C. Led the development and deployment of Quora's official Android and iPhone apps. User Experience Lead Inkling September 2009  –  February 2011  (1 year 6 months) San Francisco, CA Worked with the founding team on product and UX/UI design for the first version of Inkling for iPad. Contributed to all aspects of product development including many key decisions about the platform and client applications. Webmaster Google January 2007  –  January 2009  (2 years 1 month) Designed and created static web pages for many of Google's consumer-facing products, including iGoogle, Chrome, and Desktop. Web Specialist The University of Texas at Dallas July 2005  –  May 2006  (11 months) Worked with University Web Services, UTD’s web publishing team. Responsibilities included content management, site architecture, web application development, and web design. Web Developer University of Illinois at Urbana-Champaign September 2004  –  June 2005  (10 months) Maintained the departmental website of International Programs and Studies. Developed a web-based reservation calendar in PHP/MySQL for internal use by department staff. Senior Product Designer Postmates May 2015  – Present (4 months) Senior Product Designer Postmates May 2015  – Present (4 months) Founder Flying the Sun September 2013  –  May 2015  (1 year 9 months) San Francisco, CA Flying the Sun is an independent product company focused on mobile apps for iOS. I'm currently working on building our first product offerings, as well as overall marketing and business strategy. Founder Flying the Sun September 2013  –  May 2015  (1 year 9 months) San Francisco, CA Flying the Sun is an independent product company focused on mobile apps for iOS. I'm currently working on building our first product offerings, as well as overall marketing and business strategy. Contract Product Designer Quora May 2013  –  April 2015  (2 years) San Francisco, CA Contract member of the product design team working mainly on projects relating to the core web product. Contract Product Designer Quora May 2013  –  April 2015  (2 years) San Francisco, CA Contract member of the product design team working mainly on projects relating to the core web product. Product Designer Quora January 2011  –  May 2013  (2 years 5 months) Mountain View, CA Product designer focused on mobile, responsible for both design and front-end development in Python, HTML/CSS/JS, and Objective-C. Led the development and deployment of Quora's official Android and iPhone apps. Product Designer Quora January 2011  –  May 2013  (2 years 5 months) Mountain View, CA Product designer focused on mobile, responsible for both design and front-end development in Python, HTML/CSS/JS, and Objective-C. Led the development and deployment of Quora's official Android and iPhone apps. User Experience Lead Inkling September 2009  –  February 2011  (1 year 6 months) San Francisco, CA Worked with the founding team on product and UX/UI design for the first version of Inkling for iPad. Contributed to all aspects of product development including many key decisions about the platform and client applications. User Experience Lead Inkling September 2009  –  February 2011  (1 year 6 months) San Francisco, CA Worked with the founding team on product and UX/UI design for the first version of Inkling for iPad. Contributed to all aspects of product development including many key decisions about the platform and client applications. Webmaster Google January 2007  –  January 2009  (2 years 1 month) Designed and created static web pages for many of Google's consumer-facing products, including iGoogle, Chrome, and Desktop. Webmaster Google January 2007  –  January 2009  (2 years 1 month) Designed and created static web pages for many of Google's consumer-facing products, including iGoogle, Chrome, and Desktop. Web Specialist The University of Texas at Dallas July 2005  –  May 2006  (11 months) Worked with University Web Services, UTD’s web publishing team. Responsibilities included content management, site architecture, web application development, and web design. Web Specialist The University of Texas at Dallas July 2005  –  May 2006  (11 months) Worked with University Web Services, UTD’s web publishing team. Responsibilities included content management, site architecture, web application development, and web design. Web Developer University of Illinois at Urbana-Champaign September 2004  –  June 2005  (10 months) Maintained the departmental website of International Programs and Studies. Developed a web-based reservation calendar in PHP/MySQL for internal use by department staff. Web Developer University of Illinois at Urbana-Champaign September 2004  –  June 2005  (10 months) Maintained the departmental website of International Programs and Studies. Developed a web-based reservation calendar in PHP/MySQL for internal use by department staff. Languages   Skills Skills     ", "Summary Officially, I’m a user experience engineer. At Google, that means I prototype hundreds of ideas, evaluate them, and toss the bad ones. My teammates and I take what’s left and build them into real products that make people powerful. \n \nBut most of what I do is about communication. \n \nI joined the industry around the time the first iPhone was introduced. Much has changed since then, and our devices have become exponentially more capable. A lot of people, especially those living in countries like Mexico or India, use mobile devices exclusively. Some run small businesses off tablets, others keep digital currencies on their phones. As we continue to expect more from technology, our design tools need to keep up to deliver intuitive and powerful experiences. It’s no longer good enough to make something visually appealing; our products need to *feel* right too. \n \nBut \"feel\" is both intangible and ambiguous. The factors that make our products delightful – eg. user needs and visual polish – often get lost in translation from concept to design to implementation. This is where I come in with my prototypes. I bridge gaps in communication between visual design, product management, and software engineering to make sure execution isn’t compromised. Ideas are cheap, execution is everything. \n \nPrior to joining Google, I developed web-based products for Inkling and designed Venmo’s mobile payment apps. I've done product-level thinking, information architecture, visual design, and front-end engineering. It takes a loose mixture of them all to do what I do best: take an idea from seedling to prototype to execution. Summary Officially, I’m a user experience engineer. At Google, that means I prototype hundreds of ideas, evaluate them, and toss the bad ones. My teammates and I take what’s left and build them into real products that make people powerful. \n \nBut most of what I do is about communication. \n \nI joined the industry around the time the first iPhone was introduced. Much has changed since then, and our devices have become exponentially more capable. A lot of people, especially those living in countries like Mexico or India, use mobile devices exclusively. Some run small businesses off tablets, others keep digital currencies on their phones. As we continue to expect more from technology, our design tools need to keep up to deliver intuitive and powerful experiences. It’s no longer good enough to make something visually appealing; our products need to *feel* right too. \n \nBut \"feel\" is both intangible and ambiguous. The factors that make our products delightful – eg. user needs and visual polish – often get lost in translation from concept to design to implementation. This is where I come in with my prototypes. I bridge gaps in communication between visual design, product management, and software engineering to make sure execution isn’t compromised. Ideas are cheap, execution is everything. \n \nPrior to joining Google, I developed web-based products for Inkling and designed Venmo’s mobile payment apps. I've done product-level thinking, information architecture, visual design, and front-end engineering. It takes a loose mixture of them all to do what I do best: take an idea from seedling to prototype to execution. Officially, I’m a user experience engineer. At Google, that means I prototype hundreds of ideas, evaluate them, and toss the bad ones. My teammates and I take what’s left and build them into real products that make people powerful. \n \nBut most of what I do is about communication. \n \nI joined the industry around the time the first iPhone was introduced. Much has changed since then, and our devices have become exponentially more capable. A lot of people, especially those living in countries like Mexico or India, use mobile devices exclusively. Some run small businesses off tablets, others keep digital currencies on their phones. As we continue to expect more from technology, our design tools need to keep up to deliver intuitive and powerful experiences. It’s no longer good enough to make something visually appealing; our products need to *feel* right too. \n \nBut \"feel\" is both intangible and ambiguous. The factors that make our products delightful – eg. user needs and visual polish – often get lost in translation from concept to design to implementation. This is where I come in with my prototypes. I bridge gaps in communication between visual design, product management, and software engineering to make sure execution isn’t compromised. Ideas are cheap, execution is everything. \n \nPrior to joining Google, I developed web-based products for Inkling and designed Venmo’s mobile payment apps. I've done product-level thinking, information architecture, visual design, and front-end engineering. It takes a loose mixture of them all to do what I do best: take an idea from seedling to prototype to execution. Officially, I’m a user experience engineer. At Google, that means I prototype hundreds of ideas, evaluate them, and toss the bad ones. My teammates and I take what’s left and build them into real products that make people powerful. \n \nBut most of what I do is about communication. \n \nI joined the industry around the time the first iPhone was introduced. Much has changed since then, and our devices have become exponentially more capable. A lot of people, especially those living in countries like Mexico or India, use mobile devices exclusively. Some run small businesses off tablets, others keep digital currencies on their phones. As we continue to expect more from technology, our design tools need to keep up to deliver intuitive and powerful experiences. It’s no longer good enough to make something visually appealing; our products need to *feel* right too. \n \nBut \"feel\" is both intangible and ambiguous. The factors that make our products delightful – eg. user needs and visual polish – often get lost in translation from concept to design to implementation. This is where I come in with my prototypes. I bridge gaps in communication between visual design, product management, and software engineering to make sure execution isn’t compromised. Ideas are cheap, execution is everything. \n \nPrior to joining Google, I developed web-based products for Inkling and designed Venmo’s mobile payment apps. I've done product-level thinking, information architecture, visual design, and front-end engineering. It takes a loose mixture of them all to do what I do best: take an idea from seedling to prototype to execution. Experience Interaction Designer Google January 2013  – Present (2 years 8 months) Sydney Area, Australia Prototype the future. User Experience Design Intern Google June 2012  –  October 2012  (5 months) New York, NY Worked with the Google Drive team on designing future products. Constructed prototypes across various fidelities, with an emphasis on speed. Product Designer Venmo October 2011  –  June 2012  (9 months) New York, NY Venmo allows users to pay or charge friends without touching anything but your phone. I singularly researched, sketched, wireframed in Illustrator, prototyped on iPhone, and redesigned in Photoshop (in that order) their upcoming mobile apps with an emphasis on simplifying top use cases. I was the sole member of the mobile design team on this project, and worked directly with the product manager, Android, iPhone, and Web engineers. Resident Assistant Carnegie Mellon University August 2010  –  June 2012  (1 year 11 months) Pittsburgh, PA Carnegie Mellon freshman residents in campus housing. Act as a vital information resource for campus opportunities in various roles as a peer advisor, educator, and community role model. Deal with unexpected situations and uncooperative residents in a position as an emergency responder and administrator. User Experience Intern Inkling May 2011  –  August 2011  (4 months) San Francisco, CA Inkling produces a platform for digital textbooks and an award-winning iPad app used in several Ivy League schools. I conducted contextual inquiries to wireframe an internal textbook- management tool. I wireframed and explored possible interactions for a brand new desktop browser-based product, rapidly prototyping workflows and interactions in HTML/jQuery. I also built their current homepage at inkling.com. Summer Intern Arc90 May 2010  –  August 2010  (4 months) Designed & developed (from start to finish) an internal time-tracking tool “Slices” in HTML, CSS, JavaScript, using CouchDB on backend. Converted existing static site to WordPress CMS (kindlingapp.com). Conducted research on potential viability of iPhone application ideas. Created Photoshop compositions of an in- development webapp. Played an awful running back for their football team. Publicity Director Carnegie Mellon University Rowing Club February 2009  –  January 2010  (1 year) • Contacted various outlets to publicize Crew team's races and fundraisers. \n• Headed development of bi-annual alumni newsletter, \"The Rower's Oar\" \n• Created a consistent visual identity on flyers, websites, business cards. \n• Developed an online order form for team's annual Rose Sale Fundraiser by capitalizing on knowledge of HTML, MySQL, PHP, and C languages. \n• Designed and implemented a team recruitment website (joincrew.org), coded using HTML, jQuery, CSS, and PHP. 200+ visits in first day. \n• Organized a print and guerilla marketing campaign to accompany site. Co-Founder Quik Notes February 2007  –  October 2007  (9 months) • Company is now defunct. \n• Established a school support network where students could purchase and view study guides developed by Quik Notes (and approved by teachers). \n• Developed an online site to handle transactions and delivery of guides. \n• Offered an online forum where students could collaborate on projects. Interaction Designer Google January 2013  – Present (2 years 8 months) Sydney Area, Australia Prototype the future. Interaction Designer Google January 2013  – Present (2 years 8 months) Sydney Area, Australia Prototype the future. User Experience Design Intern Google June 2012  –  October 2012  (5 months) New York, NY Worked with the Google Drive team on designing future products. Constructed prototypes across various fidelities, with an emphasis on speed. User Experience Design Intern Google June 2012  –  October 2012  (5 months) New York, NY Worked with the Google Drive team on designing future products. Constructed prototypes across various fidelities, with an emphasis on speed. Product Designer Venmo October 2011  –  June 2012  (9 months) New York, NY Venmo allows users to pay or charge friends without touching anything but your phone. I singularly researched, sketched, wireframed in Illustrator, prototyped on iPhone, and redesigned in Photoshop (in that order) their upcoming mobile apps with an emphasis on simplifying top use cases. I was the sole member of the mobile design team on this project, and worked directly with the product manager, Android, iPhone, and Web engineers. Product Designer Venmo October 2011  –  June 2012  (9 months) New York, NY Venmo allows users to pay or charge friends without touching anything but your phone. I singularly researched, sketched, wireframed in Illustrator, prototyped on iPhone, and redesigned in Photoshop (in that order) their upcoming mobile apps with an emphasis on simplifying top use cases. I was the sole member of the mobile design team on this project, and worked directly with the product manager, Android, iPhone, and Web engineers. Resident Assistant Carnegie Mellon University August 2010  –  June 2012  (1 year 11 months) Pittsburgh, PA Carnegie Mellon freshman residents in campus housing. Act as a vital information resource for campus opportunities in various roles as a peer advisor, educator, and community role model. Deal with unexpected situations and uncooperative residents in a position as an emergency responder and administrator. Resident Assistant Carnegie Mellon University August 2010  –  June 2012  (1 year 11 months) Pittsburgh, PA Carnegie Mellon freshman residents in campus housing. Act as a vital information resource for campus opportunities in various roles as a peer advisor, educator, and community role model. Deal with unexpected situations and uncooperative residents in a position as an emergency responder and administrator. User Experience Intern Inkling May 2011  –  August 2011  (4 months) San Francisco, CA Inkling produces a platform for digital textbooks and an award-winning iPad app used in several Ivy League schools. I conducted contextual inquiries to wireframe an internal textbook- management tool. I wireframed and explored possible interactions for a brand new desktop browser-based product, rapidly prototyping workflows and interactions in HTML/jQuery. I also built their current homepage at inkling.com. User Experience Intern Inkling May 2011  –  August 2011  (4 months) San Francisco, CA Inkling produces a platform for digital textbooks and an award-winning iPad app used in several Ivy League schools. I conducted contextual inquiries to wireframe an internal textbook- management tool. I wireframed and explored possible interactions for a brand new desktop browser-based product, rapidly prototyping workflows and interactions in HTML/jQuery. I also built their current homepage at inkling.com. Summer Intern Arc90 May 2010  –  August 2010  (4 months) Designed & developed (from start to finish) an internal time-tracking tool “Slices” in HTML, CSS, JavaScript, using CouchDB on backend. Converted existing static site to WordPress CMS (kindlingapp.com). Conducted research on potential viability of iPhone application ideas. Created Photoshop compositions of an in- development webapp. Played an awful running back for their football team. Summer Intern Arc90 May 2010  –  August 2010  (4 months) Designed & developed (from start to finish) an internal time-tracking tool “Slices” in HTML, CSS, JavaScript, using CouchDB on backend. Converted existing static site to WordPress CMS (kindlingapp.com). Conducted research on potential viability of iPhone application ideas. Created Photoshop compositions of an in- development webapp. Played an awful running back for their football team. Publicity Director Carnegie Mellon University Rowing Club February 2009  –  January 2010  (1 year) • Contacted various outlets to publicize Crew team's races and fundraisers. \n• Headed development of bi-annual alumni newsletter, \"The Rower's Oar\" \n• Created a consistent visual identity on flyers, websites, business cards. \n• Developed an online order form for team's annual Rose Sale Fundraiser by capitalizing on knowledge of HTML, MySQL, PHP, and C languages. \n• Designed and implemented a team recruitment website (joincrew.org), coded using HTML, jQuery, CSS, and PHP. 200+ visits in first day. \n• Organized a print and guerilla marketing campaign to accompany site. Publicity Director Carnegie Mellon University Rowing Club February 2009  –  January 2010  (1 year) • Contacted various outlets to publicize Crew team's races and fundraisers. \n• Headed development of bi-annual alumni newsletter, \"The Rower's Oar\" \n• Created a consistent visual identity on flyers, websites, business cards. \n• Developed an online order form for team's annual Rose Sale Fundraiser by capitalizing on knowledge of HTML, MySQL, PHP, and C languages. \n• Designed and implemented a team recruitment website (joincrew.org), coded using HTML, jQuery, CSS, and PHP. 200+ visits in first day. \n• Organized a print and guerilla marketing campaign to accompany site. Co-Founder Quik Notes February 2007  –  October 2007  (9 months) • Company is now defunct. \n• Established a school support network where students could purchase and view study guides developed by Quik Notes (and approved by teachers). \n• Developed an online site to handle transactions and delivery of guides. \n• Offered an online forum where students could collaborate on projects. Co-Founder Quik Notes February 2007  –  October 2007  (9 months) • Company is now defunct. \n• Established a school support network where students could purchase and view study guides developed by Quik Notes (and approved by teachers). \n• Developed an online site to handle transactions and delivery of guides. \n• Offered an online forum where students could collaborate on projects. Languages Korean English Korean English Korean English Skills Contextual Inquiry Wireframing CSS User Experience Design Branding & Identity Research Mobile Applications User Experience HTML User Interface Design JavaScript Adobe Creative Suite Web Design Flash Photoshop Interaction Design Web Development Illustrator Wireframes Rapid Prototyping Paper Prototyping jQuery Front-end See 8+     See less Skills  Contextual Inquiry Wireframing CSS User Experience Design Branding & Identity Research Mobile Applications User Experience HTML User Interface Design JavaScript Adobe Creative Suite Web Design Flash Photoshop Interaction Design Web Development Illustrator Wireframes Rapid Prototyping Paper Prototyping jQuery Front-end See 8+     See less Contextual Inquiry Wireframing CSS User Experience Design Branding & Identity Research Mobile Applications User Experience HTML User Interface Design JavaScript Adobe Creative Suite Web Design Flash Photoshop Interaction Design Web Development Illustrator Wireframes Rapid Prototyping Paper Prototyping jQuery Front-end See 8+     See less Contextual Inquiry Wireframing CSS User Experience Design Branding & Identity Research Mobile Applications User Experience HTML User Interface Design JavaScript Adobe Creative Suite Web Design Flash Photoshop Interaction Design Web Development Illustrator Wireframes Rapid Prototyping Paper Prototyping jQuery Front-end See 8+     See less Education Carnegie Mellon University Bachelor of Science,  Information Systems 2008  – 2012 Carnegie Mellon Freshman Resident Assistant \n• 2010 - 2011 School Year \n• Encourage academic development of 30+ freshmen \n• Act as a vital information resource for campus opportunities \n• Resolve individual and organizational issues among students \n• Work with a staff of 4 and a campus housefellow \n \nSigma Alpha Epsilon, Pennsylvania Phi Chapter \n• Philanthropy & Service Chairman, Spring 2011 - Present \n• Eminent Recorder (Secretary), Dec 2009 - Jan 2010 \n• Assistant Rush Chairman, Fall 2009 - Spring 2010 \n \nCarnegie Mellon Rowing Club \n• Publicity Director, Spring 2009 - Spring 2010 \n• Varsity Team Member & Coxswain, Fall 2008 - Spring 2010 \n \nThe Tartan (Student Newspaper) \n• Layout Designer, Fall 2008 - Spring 2009 \n \nMiscellaneous Activities/Honors \n• Freshman Orientation Counselor \n• H&SS Connect Visual Identity & Branding \n• Student Dormitory House Council Newsletter Editor Montville Township High School 2004  – 2008 Carnegie Mellon University Bachelor of Science,  Information Systems 2008  – 2012 Carnegie Mellon Freshman Resident Assistant \n• 2010 - 2011 School Year \n• Encourage academic development of 30+ freshmen \n• Act as a vital information resource for campus opportunities \n• Resolve individual and organizational issues among students \n• Work with a staff of 4 and a campus housefellow \n \nSigma Alpha Epsilon, Pennsylvania Phi Chapter \n• Philanthropy & Service Chairman, Spring 2011 - Present \n• Eminent Recorder (Secretary), Dec 2009 - Jan 2010 \n• Assistant Rush Chairman, Fall 2009 - Spring 2010 \n \nCarnegie Mellon Rowing Club \n• Publicity Director, Spring 2009 - Spring 2010 \n• Varsity Team Member & Coxswain, Fall 2008 - Spring 2010 \n \nThe Tartan (Student Newspaper) \n• Layout Designer, Fall 2008 - Spring 2009 \n \nMiscellaneous Activities/Honors \n• Freshman Orientation Counselor \n• H&SS Connect Visual Identity & Branding \n• Student Dormitory House Council Newsletter Editor Carnegie Mellon University Bachelor of Science,  Information Systems 2008  – 2012 Carnegie Mellon Freshman Resident Assistant \n• 2010 - 2011 School Year \n• Encourage academic development of 30+ freshmen \n• Act as a vital information resource for campus opportunities \n• Resolve individual and organizational issues among students \n• Work with a staff of 4 and a campus housefellow \n \nSigma Alpha Epsilon, Pennsylvania Phi Chapter \n• Philanthropy & Service Chairman, Spring 2011 - Present \n• Eminent Recorder (Secretary), Dec 2009 - Jan 2010 \n• Assistant Rush Chairman, Fall 2009 - Spring 2010 \n \nCarnegie Mellon Rowing Club \n• Publicity Director, Spring 2009 - Spring 2010 \n• Varsity Team Member & Coxswain, Fall 2008 - Spring 2010 \n \nThe Tartan (Student Newspaper) \n• Layout Designer, Fall 2008 - Spring 2009 \n \nMiscellaneous Activities/Honors \n• Freshman Orientation Counselor \n• H&SS Connect Visual Identity & Branding \n• Student Dormitory House Council Newsletter Editor Carnegie Mellon University Bachelor of Science,  Information Systems 2008  – 2012 Carnegie Mellon Freshman Resident Assistant \n• 2010 - 2011 School Year \n• Encourage academic development of 30+ freshmen \n• Act as a vital information resource for campus opportunities \n• Resolve individual and organizational issues among students \n• Work with a staff of 4 and a campus housefellow \n \nSigma Alpha Epsilon, Pennsylvania Phi Chapter \n• Philanthropy & Service Chairman, Spring 2011 - Present \n• Eminent Recorder (Secretary), Dec 2009 - Jan 2010 \n• Assistant Rush Chairman, Fall 2009 - Spring 2010 \n \nCarnegie Mellon Rowing Club \n• Publicity Director, Spring 2009 - Spring 2010 \n• Varsity Team Member & Coxswain, Fall 2008 - Spring 2010 \n \nThe Tartan (Student Newspaper) \n• Layout Designer, Fall 2008 - Spring 2009 \n \nMiscellaneous Activities/Honors \n• Freshman Orientation Counselor \n• H&SS Connect Visual Identity & Branding \n• Student Dormitory House Council Newsletter Editor Montville Township High School 2004  – 2008 Montville Township High School 2004  – 2008 Montville Township High School 2004  – 2008 ", "Summary Super outdated portfolio can be found at : wayjaywang.com Summary Super outdated portfolio can be found at : wayjaywang.com Super outdated portfolio can be found at : wayjaywang.com Super outdated portfolio can be found at : wayjaywang.com Experience UX Designer Google October 2014  – Present (11 months) Greater New York City Area User experience designer on the Google Classroom team. Previously worked on Google Wallet. UX Designer (Contract) Google November 2013  –  October 2014  (1 year) Greater New York City Area User experience design contractor on Google Wallet. Designer / Facebook Insights Analyst Varsity Studios Inc. April 2013  –  November 2013  (8 months) greater new york city area Design Intern Lippincott January 2013  –  April 2013  (4 months) Contributed to the visualization and relization of branding, strategy,  \nand interaction design projects. Product Designer (Contract) Facebook August 2012  –  November 2012  (4 months) Menlo Park, CA Worked on the graph search product and framework under the Facebook brand. Bachelor of Design, Visual Communication Design University of Washington September 2007  –  June 2012  (4 years 10 months) Greater Seattle Area B. DES, University of Washington, 2012 High School Coordinator University of Washington Dream Project March 2011  –  January 2012  (11 months) Greater Seattle Area Responsible for planning the curriculum and organizing weekly visits to local high schools. Worked closely with low income students on the college application process. Design Intern FiftyThree, Inc. July 2011  –  August 2011  (2 months) Greater New York City Area Conducted user interviews and assisted on developing brand platform and identity. Also worked on visuals for iPad application. Senior Teller Bank of America July 2007  –  April 2011  (3 years 10 months) Greater Seattle Area Responsible for cash handling and referrals. Recognized by market management team for exceptional customer service. UX Designer Google October 2014  – Present (11 months) Greater New York City Area User experience designer on the Google Classroom team. Previously worked on Google Wallet. UX Designer Google October 2014  – Present (11 months) Greater New York City Area User experience designer on the Google Classroom team. Previously worked on Google Wallet. UX Designer (Contract) Google November 2013  –  October 2014  (1 year) Greater New York City Area User experience design contractor on Google Wallet. UX Designer (Contract) Google November 2013  –  October 2014  (1 year) Greater New York City Area User experience design contractor on Google Wallet. Designer / Facebook Insights Analyst Varsity Studios Inc. April 2013  –  November 2013  (8 months) greater new york city area Designer / Facebook Insights Analyst Varsity Studios Inc. April 2013  –  November 2013  (8 months) greater new york city area Design Intern Lippincott January 2013  –  April 2013  (4 months) Contributed to the visualization and relization of branding, strategy,  \nand interaction design projects. Design Intern Lippincott January 2013  –  April 2013  (4 months) Contributed to the visualization and relization of branding, strategy,  \nand interaction design projects. Product Designer (Contract) Facebook August 2012  –  November 2012  (4 months) Menlo Park, CA Worked on the graph search product and framework under the Facebook brand. Product Designer (Contract) Facebook August 2012  –  November 2012  (4 months) Menlo Park, CA Worked on the graph search product and framework under the Facebook brand. Bachelor of Design, Visual Communication Design University of Washington September 2007  –  June 2012  (4 years 10 months) Greater Seattle Area B. DES, University of Washington, 2012 Bachelor of Design, Visual Communication Design University of Washington September 2007  –  June 2012  (4 years 10 months) Greater Seattle Area B. DES, University of Washington, 2012 High School Coordinator University of Washington Dream Project March 2011  –  January 2012  (11 months) Greater Seattle Area Responsible for planning the curriculum and organizing weekly visits to local high schools. Worked closely with low income students on the college application process. High School Coordinator University of Washington Dream Project March 2011  –  January 2012  (11 months) Greater Seattle Area Responsible for planning the curriculum and organizing weekly visits to local high schools. Worked closely with low income students on the college application process. Design Intern FiftyThree, Inc. July 2011  –  August 2011  (2 months) Greater New York City Area Conducted user interviews and assisted on developing brand platform and identity. Also worked on visuals for iPad application. Design Intern FiftyThree, Inc. July 2011  –  August 2011  (2 months) Greater New York City Area Conducted user interviews and assisted on developing brand platform and identity. Also worked on visuals for iPad application. Senior Teller Bank of America July 2007  –  April 2011  (3 years 10 months) Greater Seattle Area Responsible for cash handling and referrals. Recognized by market management team for exceptional customer service. Senior Teller Bank of America July 2007  –  April 2011  (3 years 10 months) Greater Seattle Area Responsible for cash handling and referrals. Recognized by market management team for exceptional customer service. Languages Chinese Chinese Chinese Skills Adobe Creative Suite Information Design InDesign Illustrator Social Media Public Speaking Research Photoshop Web Design Graphic Design Customer Service Interaction Design User Interface Design Visual Communication User Experience User Experience Design Typography Branding & Identity Facebook Concept Development Information Architecture See 6+     See less Skills  Adobe Creative Suite Information Design InDesign Illustrator Social Media Public Speaking Research Photoshop Web Design Graphic Design Customer Service Interaction Design User Interface Design Visual Communication User Experience User Experience Design Typography Branding & Identity Facebook Concept Development Information Architecture See 6+     See less Adobe Creative Suite Information Design InDesign Illustrator Social Media Public Speaking Research Photoshop Web Design Graphic Design Customer Service Interaction Design User Interface Design Visual Communication User Experience User Experience Design Typography Branding & Identity Facebook Concept Development Information Architecture See 6+     See less Adobe Creative Suite Information Design InDesign Illustrator Social Media Public Speaking Research Photoshop Web Design Graphic Design Customer Service Interaction Design User Interface Design Visual Communication User Experience User Experience Design Typography Branding & Identity Facebook Concept Development Information Architecture See 6+     See less Education University of Washington Bachelor of Design,  Visual Communication Design , Senior 2007  – 2012 Activities and Societies:  AIGA ,  IxDA University of Washington Bachelor of Design,  Visual Communication Design , Senior 2007  – 2012 Activities and Societies:  AIGA ,  IxDA University of Washington Bachelor of Design,  Visual Communication Design , Senior 2007  – 2012 Activities and Societies:  AIGA ,  IxDA University of Washington Bachelor of Design,  Visual Communication Design , Senior 2007  – 2012 Activities and Societies:  AIGA ,  IxDA ", "Summary Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Summary Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Product Designer \nInteraction and User Experience Designer \nSoftware Engineer \nAdvanced Research Experience Senior Product Designer Google Android Wear February 2015  – Present (7 months) Mountain View, CA Android Wear + Google Now \n• Platform lead designer working at the nexus of Android Wear and Google Now.  \n• Exploring next generation experiences (wearable and voice interactions) for Google Now in Wear platform.  Senior UX Designer Google Android February 2014  – Present (1 year 7 months) Mountain View, CA Google Now \n• Understanding users and creating helpful/predictive experiences that help users the most, in the moment.  \n• Design for Google Now content cards and \"Ok Google\" voice interactions. Senior Product Designer Google Android Wear February 2015  – Present (7 months) Mountain View, CA Android Wear + Google Now \n• Platform lead designer working at the nexus of Android Wear and Google Now.  \n• Exploring next generation experiences (wearable and voice interactions) for Google Now in Wear platform.  Senior Product Designer Google Android Wear February 2015  – Present (7 months) Mountain View, CA Android Wear + Google Now \n• Platform lead designer working at the nexus of Android Wear and Google Now.  \n• Exploring next generation experiences (wearable and voice interactions) for Google Now in Wear platform.  Senior UX Designer Google Android February 2014  – Present (1 year 7 months) Mountain View, CA Google Now \n• Understanding users and creating helpful/predictive experiences that help users the most, in the moment.  \n• Design for Google Now content cards and \"Ok Google\" voice interactions. Senior UX Designer Google Android February 2014  – Present (1 year 7 months) Mountain View, CA Google Now \n• Understanding users and creating helpful/predictive experiences that help users the most, in the moment.  \n• Design for Google Now content cards and \"Ok Google\" voice interactions. Skills Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Skills  Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Interaction Design Product Design Rapid Prototyping User Experience Design User-centered Design Human Computer... User Experience Information Architecture User Interface Design User Interface Experience Design Visual Design Paper Prototyping Wireframes User Scenarios Usability Engineering Design Strategy See 2+     See less Education Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 Carnegie Mellon University Masters,  Human Computer Interaction 2005  – 2006 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 University of California, Berkeley Bachelors of Science,  Computer Science ,  Bioengineering 1997  – 2001 ", "Summary Portfolio: http://www.grantagold.com Summary Portfolio: http://www.grantagold.com Portfolio: http://www.grantagold.com Portfolio: http://www.grantagold.com Experience Product Designer The New York Times October 2013  – Present (1 year 11 months) Greater New York City Area Senior Product Designer Rdio June 2012  –  September 2013  (1 year 4 months) San Francisco Bay Area Designed Rdio's full suite of mobile products (iPhone, iPad, Android) and more. Lead Product Designer Squarespace September 2011  –  July 2012  (11 months) Greater New York City Area Designed the Portfolio and Note iOS apps. Designer Google June 2010  –  September 2011  (1 year 4 months) Greater New York City Area 2011 \"Kennedy Project\"​ Redesigning Google’s core products (Search, Gmail, Maps, Docs, and Calendar). \n \nCreative Director: Chris Wiggins \nLead Engineer: Nicholas Jitkoff \n \nMore info here: http://www.theverge.com/2013/1/24/3904134/google-redesign-how-larry-page-engineered-beautiful-revolution Product Designer The New York Times October 2013  – Present (1 year 11 months) Greater New York City Area Product Designer The New York Times October 2013  – Present (1 year 11 months) Greater New York City Area Senior Product Designer Rdio June 2012  –  September 2013  (1 year 4 months) San Francisco Bay Area Designed Rdio's full suite of mobile products (iPhone, iPad, Android) and more. Senior Product Designer Rdio June 2012  –  September 2013  (1 year 4 months) San Francisco Bay Area Designed Rdio's full suite of mobile products (iPhone, iPad, Android) and more. Lead Product Designer Squarespace September 2011  –  July 2012  (11 months) Greater New York City Area Designed the Portfolio and Note iOS apps. Lead Product Designer Squarespace September 2011  –  July 2012  (11 months) Greater New York City Area Designed the Portfolio and Note iOS apps. Designer Google June 2010  –  September 2011  (1 year 4 months) Greater New York City Area 2011 \"Kennedy Project\"​ Redesigning Google’s core products (Search, Gmail, Maps, Docs, and Calendar). \n \nCreative Director: Chris Wiggins \nLead Engineer: Nicholas Jitkoff \n \nMore info here: http://www.theverge.com/2013/1/24/3904134/google-redesign-how-larry-page-engineered-beautiful-revolution Designer Google June 2010  –  September 2011  (1 year 4 months) Greater New York City Area 2011 \"Kennedy Project\"​ Redesigning Google’s core products (Search, Gmail, Maps, Docs, and Calendar). \n \nCreative Director: Chris Wiggins \nLead Engineer: Nicholas Jitkoff \n \nMore info here: http://www.theverge.com/2013/1/24/3904134/google-redesign-how-larry-page-engineered-beautiful-revolution Languages French French French Skills Web Design Interaction Design User Interface Design Mobile Applications Product Design User Experience Design Adobe Creative Suite User Experience User Interface Typography Illustrator Photoshop Layout Information Architecture User-centered Design Objective-C See 1+     See less Skills  Web Design Interaction Design User Interface Design Mobile Applications Product Design User Experience Design Adobe Creative Suite User Experience User Interface Typography Illustrator Photoshop Layout Information Architecture User-centered Design Objective-C See 1+     See less Web Design Interaction Design User Interface Design Mobile Applications Product Design User Experience Design Adobe Creative Suite User Experience User Interface Typography Illustrator Photoshop Layout Information Architecture User-centered Design Objective-C See 1+     See less Web Design Interaction Design User Interface Design Mobile Applications Product Design User Experience Design Adobe Creative Suite User Experience User Interface Typography Illustrator Photoshop Layout Information Architecture User-centered Design Objective-C See 1+     See less Education School of Visual Arts BFA,  Graphic Design 2007  – 2010 School of Visual Arts BFA,  Graphic Design 2007  – 2010 School of Visual Arts BFA,  Graphic Design 2007  – 2010 School of Visual Arts BFA,  Graphic Design 2007  – 2010 Honors & Awards Additional Honors & Awards Type Director's Club Scholarship \nBlumenthal Scholarship \nPublished in the 2010 Typography Annual (#31) \nPublished in the 2011 Typography Annual (#32) Additional Honors & Awards Type Director's Club Scholarship \nBlumenthal Scholarship \nPublished in the 2010 Typography Annual (#31) \nPublished in the 2011 Typography Annual (#32) Additional Honors & Awards Type Director's Club Scholarship \nBlumenthal Scholarship \nPublished in the 2010 Typography Annual (#31) \nPublished in the 2011 Typography Annual (#32) Additional Honors & Awards Type Director's Club Scholarship \nBlumenthal Scholarship \nPublished in the 2010 Typography Annual (#31) \nPublished in the 2011 Typography Annual (#32) ", "Summary I'm a graduate of the Rhode Island School of Design and a Product Designer at IFTTT. My studies in Industrial Design emphasized the importance of the process to the product. Ever since, I've been constantly improving on my own. \n \nI believe that the best user experiences are not found in products that overbear themselves with features, but those that tirelessly refine their vision to excel at one particular thing. Summary I'm a graduate of the Rhode Island School of Design and a Product Designer at IFTTT. My studies in Industrial Design emphasized the importance of the process to the product. Ever since, I've been constantly improving on my own. \n \nI believe that the best user experiences are not found in products that overbear themselves with features, but those that tirelessly refine their vision to excel at one particular thing. I'm a graduate of the Rhode Island School of Design and a Product Designer at IFTTT. My studies in Industrial Design emphasized the importance of the process to the product. Ever since, I've been constantly improving on my own. \n \nI believe that the best user experiences are not found in products that overbear themselves with features, but those that tirelessly refine their vision to excel at one particular thing. I'm a graduate of the Rhode Island School of Design and a Product Designer at IFTTT. My studies in Industrial Design emphasized the importance of the process to the product. Ever since, I've been constantly improving on my own. \n \nI believe that the best user experiences are not found in products that overbear themselves with features, but those that tirelessly refine their vision to excel at one particular thing. Experience Product Designer Uber March 2015  – Present (6 months) San Francisco Bay Area Product Designer IFTTT December 2013  –  March 2015  (1 year 4 months) San Francisco, CA Product Designer across all surfaces that IFTTT appears. Product deep dives, brainstorming, and wire framing into UI/UX and prototypes. \n \nDesigned IFTTT for iPad, developer tools, and Android. Currently designing IFTTT on the web and future projects. Freelance Product Designer HVF October 2013  –  November 2013  (2 months) San Francisco, CA Worked with Max Levchin at his incubator to prototype new product directions. Designed prototypes that focused on productivity, explored home mortgaging redesigns, and contributed to products int he HVF portfolio. Product Designer Facebook July 2013  –  October 2013  (4 months) Menlo Park, CA Product Designer on the Privacy team. UI/UX and prototypes for Privacy settings on Newsfeed and Timeline. UI/UX for internal development and content publishing tools. UX Design Intern Google Maps June 2012  –  September 2012  (4 months) Mountain View Intern on Google Mobile Maps design team. Product and UI/UX Design. Wireframed onboarding experience for web, and designed UI for Offline Maps on Android. Product Designer Uber March 2015  – Present (6 months) San Francisco Bay Area Product Designer Uber March 2015  – Present (6 months) San Francisco Bay Area Product Designer IFTTT December 2013  –  March 2015  (1 year 4 months) San Francisco, CA Product Designer across all surfaces that IFTTT appears. Product deep dives, brainstorming, and wire framing into UI/UX and prototypes. \n \nDesigned IFTTT for iPad, developer tools, and Android. Currently designing IFTTT on the web and future projects. Product Designer IFTTT December 2013  –  March 2015  (1 year 4 months) San Francisco, CA Product Designer across all surfaces that IFTTT appears. Product deep dives, brainstorming, and wire framing into UI/UX and prototypes. \n \nDesigned IFTTT for iPad, developer tools, and Android. Currently designing IFTTT on the web and future projects. Freelance Product Designer HVF October 2013  –  November 2013  (2 months) San Francisco, CA Worked with Max Levchin at his incubator to prototype new product directions. Designed prototypes that focused on productivity, explored home mortgaging redesigns, and contributed to products int he HVF portfolio. Freelance Product Designer HVF October 2013  –  November 2013  (2 months) San Francisco, CA Worked with Max Levchin at his incubator to prototype new product directions. Designed prototypes that focused on productivity, explored home mortgaging redesigns, and contributed to products int he HVF portfolio. Product Designer Facebook July 2013  –  October 2013  (4 months) Menlo Park, CA Product Designer on the Privacy team. UI/UX and prototypes for Privacy settings on Newsfeed and Timeline. UI/UX for internal development and content publishing tools. Product Designer Facebook July 2013  –  October 2013  (4 months) Menlo Park, CA Product Designer on the Privacy team. UI/UX and prototypes for Privacy settings on Newsfeed and Timeline. UI/UX for internal development and content publishing tools. UX Design Intern Google Maps June 2012  –  September 2012  (4 months) Mountain View Intern on Google Mobile Maps design team. Product and UI/UX Design. Wireframed onboarding experience for web, and designed UI for Offline Maps on Android. UX Design Intern Google Maps June 2012  –  September 2012  (4 months) Mountain View Intern on Google Mobile Maps design team. Product and UI/UX Design. Wireframed onboarding experience for web, and designed UI for Offline Maps on Android. Languages   Skills User Interaction User Experience User Interface Product Design 2D & 3D Design Prototype & Modelmaking CNC manufacturing Laser Cutting 3D Printing Woodworking Metalworking Manufacturer... Adobe Creative Suite After Effects Final Cut Pro Solidworks Rhino Maxwell Render Design Strategy Design Thinking Rendering Concept Design Drawing Rapid Prototyping User-centered Design Experience Design Concept Development Briefcases Interaction Design Industrial Design User Research User Interface Design Sketching User Experience Design See 19+     See less Skills  User Interaction User Experience User Interface Product Design 2D & 3D Design Prototype & Modelmaking CNC manufacturing Laser Cutting 3D Printing Woodworking Metalworking Manufacturer... Adobe Creative Suite After Effects Final Cut Pro Solidworks Rhino Maxwell Render Design Strategy Design Thinking Rendering Concept Design Drawing Rapid Prototyping User-centered Design Experience Design Concept Development Briefcases Interaction Design Industrial Design User Research User Interface Design Sketching User Experience Design See 19+     See less User Interaction User Experience User Interface Product Design 2D & 3D Design Prototype & Modelmaking CNC manufacturing Laser Cutting 3D Printing Woodworking Metalworking Manufacturer... Adobe Creative Suite After Effects Final Cut Pro Solidworks Rhino Maxwell Render Design Strategy Design Thinking Rendering Concept Design Drawing Rapid Prototyping User-centered Design Experience Design Concept Development Briefcases Interaction Design Industrial Design User Research User Interface Design Sketching User Experience Design See 19+     See less User Interaction User Experience User Interface Product Design 2D & 3D Design Prototype & Modelmaking CNC manufacturing Laser Cutting 3D Printing Woodworking Metalworking Manufacturer... Adobe Creative Suite After Effects Final Cut Pro Solidworks Rhino Maxwell Render Design Strategy Design Thinking Rendering Concept Design Drawing Rapid Prototyping User-centered Design Experience Design Concept Development Briefcases Interaction Design Industrial Design User Research User Interface Design Sketching User Experience Design See 19+     See less Education Rhode Island School of Design Bachelor of Fine Arts (BFA),  Industrial Design 2009  – 2013 with Honors Activities and Societies:  RISD 2nd Life ,  Take A Break Music Festival Brown University Interdisciplinary Studies,  History ,  Economics ,  and Computer Science 2010  – 2013 Activities and Societies:  Brown Trap & Skeet ,  Brown Investment Group Rhode Island School of Design Bachelor of Fine Arts (BFA),  Industrial Design 2009  – 2013 with Honors Activities and Societies:  RISD 2nd Life ,  Take A Break Music Festival Rhode Island School of Design Bachelor of Fine Arts (BFA),  Industrial Design 2009  – 2013 with Honors Activities and Societies:  RISD 2nd Life ,  Take A Break Music Festival Rhode Island School of Design Bachelor of Fine Arts (BFA),  Industrial Design 2009  – 2013 with Honors Activities and Societies:  RISD 2nd Life ,  Take A Break Music Festival Brown University Interdisciplinary Studies,  History ,  Economics ,  and Computer Science 2010  – 2013 Activities and Societies:  Brown Trap & Skeet ,  Brown Investment Group Brown University Interdisciplinary Studies,  History ,  Economics ,  and Computer Science 2010  – 2013 Activities and Societies:  Brown Trap & Skeet ,  Brown Investment Group Brown University Interdisciplinary Studies,  History ,  Economics ,  and Computer Science 2010  – 2013 Activities and Societies:  Brown Trap & Skeet ,  Brown Investment Group Honors & Awards Kairos Global Fellow Kairos Society January 2011 Attended the Global Summit in New York City hosted at the NYSE and United Nations. Kairos Global Fellow Kairos Society January 2011 Attended the Global Summit in New York City hosted at the NYSE and United Nations. Kairos Global Fellow Kairos Society January 2011 Attended the Global Summit in New York City hosted at the NYSE and United Nations. Kairos Global Fellow Kairos Society January 2011 Attended the Global Summit in New York City hosted at the NYSE and United Nations. ", "Summary Accomplished designer and UX leader with a track record for building innovative teams, identifying new product opportunities, and launching successful mobile-first solutions in enterprise, advertising, and consumer products reaching hundreds of millions of users around the world. \n \nI have a passion for design excellence and solutions that tap into the social graph to connect people with experiences, people, and products they love. \n \nI quickly see through complex problems, thrive on working collaboratively to lead teams towards optimal solutions and produce beautiful pixel-perfect solutions for a wide range of platforms and devices. \n \n \nGOOGLE (8+ years) \nDesign lead for Google Translate and previously on various ads, consumer apps, mobile, and enterprise products, new B2B platforms, international markets (UK, Japan, China) with a focus on connected business-consumer mobile and tablet solutions. \n \nGOOGLE TRANSLATE \nLead designer for Google Translate on mobile, tablet, & desktop. \n1B+ translations per day, top 3 app download worldwide, 500M+ mobile installs. \n \nADVERTISING & PUBLISHING PLATFORMS \nLead designer for two new ads platform with product solutions in the UK, US, and China. \n \nLOCAL/TRAVEL/COMMERCE \nLead designer for travel, hotels, and flights. \nSocial solutions for tablet-based shopping apps (Google Catalogs). \n \nENTERPRISE \nUX lead for multiple products in Google's enterprise services family of products.  \n \nPOSTINI (enterprise, security) \nHead of user experience design & research at Postini, Inc. (2005 to 2007) acquired by Google in 2007 for $625M. \n \nSF DESIGN ASSOCIATES \nCreative Director managing client relations, contracts, and product strategy in multiple industries. \n \nBERKELEY INSTITUTE OF DESIGN \nBuilt industry partnerships between HP, Macromedia, UC Berkeley \nDeveloped a real-time video sharing, peer interaction, mobile-first collaboration platform. \n \nPh.D. Learning Technology (UC Berkeley) \nNSF Fellow Cognitive Science (UC Berkeley) \nB.A. Computer Science (Dartmouth). Specialties:- Social media, interaction, technology design \n- Design strategy, branding, product positioning \n- Creating simple & powerful consumer product solutions \n- Innovation & product differentiation in competitive markets \n- Customer-centered design \n- Managing client relationships \n- Building high-performance design and engineering teams \n \nExpertise in  \n- Social media \n- Advertising platforms \n- Consumer apps (web/mobile/tablet), shopping \n- International markets \n- Local & travel-related apps and services Summary Accomplished designer and UX leader with a track record for building innovative teams, identifying new product opportunities, and launching successful mobile-first solutions in enterprise, advertising, and consumer products reaching hundreds of millions of users around the world. \n \nI have a passion for design excellence and solutions that tap into the social graph to connect people with experiences, people, and products they love. \n \nI quickly see through complex problems, thrive on working collaboratively to lead teams towards optimal solutions and produce beautiful pixel-perfect solutions for a wide range of platforms and devices. \n \n \nGOOGLE (8+ years) \nDesign lead for Google Translate and previously on various ads, consumer apps, mobile, and enterprise products, new B2B platforms, international markets (UK, Japan, China) with a focus on connected business-consumer mobile and tablet solutions. \n \nGOOGLE TRANSLATE \nLead designer for Google Translate on mobile, tablet, & desktop. \n1B+ translations per day, top 3 app download worldwide, 500M+ mobile installs. \n \nADVERTISING & PUBLISHING PLATFORMS \nLead designer for two new ads platform with product solutions in the UK, US, and China. \n \nLOCAL/TRAVEL/COMMERCE \nLead designer for travel, hotels, and flights. \nSocial solutions for tablet-based shopping apps (Google Catalogs). \n \nENTERPRISE \nUX lead for multiple products in Google's enterprise services family of products.  \n \nPOSTINI (enterprise, security) \nHead of user experience design & research at Postini, Inc. (2005 to 2007) acquired by Google in 2007 for $625M. \n \nSF DESIGN ASSOCIATES \nCreative Director managing client relations, contracts, and product strategy in multiple industries. \n \nBERKELEY INSTITUTE OF DESIGN \nBuilt industry partnerships between HP, Macromedia, UC Berkeley \nDeveloped a real-time video sharing, peer interaction, mobile-first collaboration platform. \n \nPh.D. Learning Technology (UC Berkeley) \nNSF Fellow Cognitive Science (UC Berkeley) \nB.A. Computer Science (Dartmouth). Specialties:- Social media, interaction, technology design \n- Design strategy, branding, product positioning \n- Creating simple & powerful consumer product solutions \n- Innovation & product differentiation in competitive markets \n- Customer-centered design \n- Managing client relationships \n- Building high-performance design and engineering teams \n \nExpertise in  \n- Social media \n- Advertising platforms \n- Consumer apps (web/mobile/tablet), shopping \n- International markets \n- Local & travel-related apps and services Accomplished designer and UX leader with a track record for building innovative teams, identifying new product opportunities, and launching successful mobile-first solutions in enterprise, advertising, and consumer products reaching hundreds of millions of users around the world. \n \nI have a passion for design excellence and solutions that tap into the social graph to connect people with experiences, people, and products they love. \n \nI quickly see through complex problems, thrive on working collaboratively to lead teams towards optimal solutions and produce beautiful pixel-perfect solutions for a wide range of platforms and devices. \n \n \nGOOGLE (8+ years) \nDesign lead for Google Translate and previously on various ads, consumer apps, mobile, and enterprise products, new B2B platforms, international markets (UK, Japan, China) with a focus on connected business-consumer mobile and tablet solutions. \n \nGOOGLE TRANSLATE \nLead designer for Google Translate on mobile, tablet, & desktop. \n1B+ translations per day, top 3 app download worldwide, 500M+ mobile installs. \n \nADVERTISING & PUBLISHING PLATFORMS \nLead designer for two new ads platform with product solutions in the UK, US, and China. \n \nLOCAL/TRAVEL/COMMERCE \nLead designer for travel, hotels, and flights. \nSocial solutions for tablet-based shopping apps (Google Catalogs). \n \nENTERPRISE \nUX lead for multiple products in Google's enterprise services family of products.  \n \nPOSTINI (enterprise, security) \nHead of user experience design & research at Postini, Inc. (2005 to 2007) acquired by Google in 2007 for $625M. \n \nSF DESIGN ASSOCIATES \nCreative Director managing client relations, contracts, and product strategy in multiple industries. \n \nBERKELEY INSTITUTE OF DESIGN \nBuilt industry partnerships between HP, Macromedia, UC Berkeley \nDeveloped a real-time video sharing, peer interaction, mobile-first collaboration platform. \n \nPh.D. Learning Technology (UC Berkeley) \nNSF Fellow Cognitive Science (UC Berkeley) \nB.A. Computer Science (Dartmouth). Specialties:- Social media, interaction, technology design \n- Design strategy, branding, product positioning \n- Creating simple & powerful consumer product solutions \n- Innovation & product differentiation in competitive markets \n- Customer-centered design \n- Managing client relationships \n- Building high-performance design and engineering teams \n \nExpertise in  \n- Social media \n- Advertising platforms \n- Consumer apps (web/mobile/tablet), shopping \n- International markets \n- Local & travel-related apps and services Accomplished designer and UX leader with a track record for building innovative teams, identifying new product opportunities, and launching successful mobile-first solutions in enterprise, advertising, and consumer products reaching hundreds of millions of users around the world. \n \nI have a passion for design excellence and solutions that tap into the social graph to connect people with experiences, people, and products they love. \n \nI quickly see through complex problems, thrive on working collaboratively to lead teams towards optimal solutions and produce beautiful pixel-perfect solutions for a wide range of platforms and devices. \n \n \nGOOGLE (8+ years) \nDesign lead for Google Translate and previously on various ads, consumer apps, mobile, and enterprise products, new B2B platforms, international markets (UK, Japan, China) with a focus on connected business-consumer mobile and tablet solutions. \n \nGOOGLE TRANSLATE \nLead designer for Google Translate on mobile, tablet, & desktop. \n1B+ translations per day, top 3 app download worldwide, 500M+ mobile installs. \n \nADVERTISING & PUBLISHING PLATFORMS \nLead designer for two new ads platform with product solutions in the UK, US, and China. \n \nLOCAL/TRAVEL/COMMERCE \nLead designer for travel, hotels, and flights. \nSocial solutions for tablet-based shopping apps (Google Catalogs). \n \nENTERPRISE \nUX lead for multiple products in Google's enterprise services family of products.  \n \nPOSTINI (enterprise, security) \nHead of user experience design & research at Postini, Inc. (2005 to 2007) acquired by Google in 2007 for $625M. \n \nSF DESIGN ASSOCIATES \nCreative Director managing client relations, contracts, and product strategy in multiple industries. \n \nBERKELEY INSTITUTE OF DESIGN \nBuilt industry partnerships between HP, Macromedia, UC Berkeley \nDeveloped a real-time video sharing, peer interaction, mobile-first collaboration platform. \n \nPh.D. Learning Technology (UC Berkeley) \nNSF Fellow Cognitive Science (UC Berkeley) \nB.A. Computer Science (Dartmouth). Specialties:- Social media, interaction, technology design \n- Design strategy, branding, product positioning \n- Creating simple & powerful consumer product solutions \n- Innovation & product differentiation in competitive markets \n- Customer-centered design \n- Managing client relationships \n- Building high-performance design and engineering teams \n \nExpertise in  \n- Social media \n- Advertising platforms \n- Consumer apps (web/mobile/tablet), shopping \n- International markets \n- Local & travel-related apps and services Experience Senior Product Designer Google, Inc. 2013  – Present (2 years) Mountain View, Ca Design lead for Google Translate on mobile, tablet, and desktop. \n \nTop 10 mobile app download worldwide (top 3 in many countries). \n1B+ translations per day with over 90% originating outside the U.S. Senior User Experience Designer Google, Inc. September 2007  –  2012  (5 years) Mountain View, CA & Shanghai, China - Create a vision for how Google's advertising & publishing products will look in 3-5 years. \n- Develop insights into the core needs of our business customers across market segments. \n- Create simple and powerful solutions for consumers & advertisers that leverage Google's unique strengths. \n- Design mobile/web/tablet-based solutions with a focus on new product offerings. \n- Define UX experience for advertiser-facing products for Google advisor (a new leadgen platform) for the UK & US. \n- Manage Lonely Planet strategic partnership and suite of products for mobile/web travel apps \n- Drive UX product strategy & design for emerging consumer-facing verticals in the US and international markets. \n- Formulate sharing/social strategy for experimental mobile & tablet-based apps. Senior User Experience Engineer Postini, Inc. July 2005  –  August 2007  (2 years 2 months) Head of user experience responsible for product design, usability research, and customer experience across the product line. Created and implemented design processes to guide product development, assembled a usability research team, contributed to the acceptance of rapid, iterative design linked with agile development processes. Launched products to 10% of Fortune 500 plus international markets with 40M end-users. Creative Director SF Design Associates March 2004  –  January 2006  (1 year 11 months) Creative Director providing information architecture and development services for projects ranging from business transformation products and financial optimization packages to enterprise-level process-management systems.  \n \nProducts: Product strategy analysis, expert design reviews, user experience maps, customer profiling strategies, storyboards, requirements documents, functional specs, business process logic diagrams, data/presentation models, wireframes, site maps, navigation models, concept maps, interactive prototypes, database architectures, entity-relationship diagrams, document engineering models, digital library/metadata cataloging and packaging strategies, online community and resource exchange models. Director User Experience & Technology UC Berkeley, Digital Chemistry Project September 2003  –  May 2005  (1 year 9 months) Responsible for technology architecture, usability research, and user experience. Set up partnerships with Macromedia & HP to fund interactive web-based and wireless technology products.  \n \nDesigned PRISM, a Flash Communication Server-based technology for real-time and asnychronous access to rich media digital libraries and knowledge bases. Secured funding from the National Science Digital Library (NSDL) project to develop metadata tagging strategies for rich media assets in collaboration with the Engineering Synthesis Coalition. User Experience Lead/Technical Architect UCWISE (CITRIS), Berkeley Institute of Design (BID) September 2002  –  September 2003  (1 year 1 month) Berkeley Institute of Design (BID): Lead technology architect responsible for user interaction and technical strategy for supporting online collaboration and learning in computer science. Developed an OO design for building interaction patterns using learning objects. VP Business Development Educational Connections January 1998  –  May 2002  (4 years 5 months) Founder and businsess development director for a privately-held company providing managed services for school districts. Developed business strategy and product specifications for web-based collaboration, search, and information exchange systems. Research Scientist Center for Innovation Learning Technologies 1999  –  2001  (2 years) Software Engineer - Unix Product Line True BASIC, Inc. 1989  –  1999  (10 years) Software engineer in charge of Unix product development. Developed partnerships with Sun, IBM, DEC, Silicon Graphics and other OEM vendors, worked with engineers at Siemens, NASA, NIH, US Forest Service, and the US Naval Academy. Wrote a Kanji editor for NEC. Ten years of C development work in compiler design, API development, and windowing systems (Motif/X and OpenGL). Software Engineer, Technical Services Organization Andersen Consulting, NYC September 1987  –  October 1988  (1 year 2 months) Technical Services Organization - worked on the first large-scale, commercial object-oriented design project with hundreds of engineers in NYC. Senior Product Designer Google, Inc. 2013  – Present (2 years) Mountain View, Ca Design lead for Google Translate on mobile, tablet, and desktop. \n \nTop 10 mobile app download worldwide (top 3 in many countries). \n1B+ translations per day with over 90% originating outside the U.S. Senior Product Designer Google, Inc. 2013  – Present (2 years) Mountain View, Ca Design lead for Google Translate on mobile, tablet, and desktop. \n \nTop 10 mobile app download worldwide (top 3 in many countries). \n1B+ translations per day with over 90% originating outside the U.S. Senior User Experience Designer Google, Inc. September 2007  –  2012  (5 years) Mountain View, CA & Shanghai, China - Create a vision for how Google's advertising & publishing products will look in 3-5 years. \n- Develop insights into the core needs of our business customers across market segments. \n- Create simple and powerful solutions for consumers & advertisers that leverage Google's unique strengths. \n- Design mobile/web/tablet-based solutions with a focus on new product offerings. \n- Define UX experience for advertiser-facing products for Google advisor (a new leadgen platform) for the UK & US. \n- Manage Lonely Planet strategic partnership and suite of products for mobile/web travel apps \n- Drive UX product strategy & design for emerging consumer-facing verticals in the US and international markets. \n- Formulate sharing/social strategy for experimental mobile & tablet-based apps. Senior User Experience Designer Google, Inc. September 2007  –  2012  (5 years) Mountain View, CA & Shanghai, China - Create a vision for how Google's advertising & publishing products will look in 3-5 years. \n- Develop insights into the core needs of our business customers across market segments. \n- Create simple and powerful solutions for consumers & advertisers that leverage Google's unique strengths. \n- Design mobile/web/tablet-based solutions with a focus on new product offerings. \n- Define UX experience for advertiser-facing products for Google advisor (a new leadgen platform) for the UK & US. \n- Manage Lonely Planet strategic partnership and suite of products for mobile/web travel apps \n- Drive UX product strategy & design for emerging consumer-facing verticals in the US and international markets. \n- Formulate sharing/social strategy for experimental mobile & tablet-based apps. Senior User Experience Engineer Postini, Inc. July 2005  –  August 2007  (2 years 2 months) Head of user experience responsible for product design, usability research, and customer experience across the product line. Created and implemented design processes to guide product development, assembled a usability research team, contributed to the acceptance of rapid, iterative design linked with agile development processes. Launched products to 10% of Fortune 500 plus international markets with 40M end-users. Senior User Experience Engineer Postini, Inc. July 2005  –  August 2007  (2 years 2 months) Head of user experience responsible for product design, usability research, and customer experience across the product line. Created and implemented design processes to guide product development, assembled a usability research team, contributed to the acceptance of rapid, iterative design linked with agile development processes. Launched products to 10% of Fortune 500 plus international markets with 40M end-users. Creative Director SF Design Associates March 2004  –  January 2006  (1 year 11 months) Creative Director providing information architecture and development services for projects ranging from business transformation products and financial optimization packages to enterprise-level process-management systems.  \n \nProducts: Product strategy analysis, expert design reviews, user experience maps, customer profiling strategies, storyboards, requirements documents, functional specs, business process logic diagrams, data/presentation models, wireframes, site maps, navigation models, concept maps, interactive prototypes, database architectures, entity-relationship diagrams, document engineering models, digital library/metadata cataloging and packaging strategies, online community and resource exchange models. Creative Director SF Design Associates March 2004  –  January 2006  (1 year 11 months) Creative Director providing information architecture and development services for projects ranging from business transformation products and financial optimization packages to enterprise-level process-management systems.  \n \nProducts: Product strategy analysis, expert design reviews, user experience maps, customer profiling strategies, storyboards, requirements documents, functional specs, business process logic diagrams, data/presentation models, wireframes, site maps, navigation models, concept maps, interactive prototypes, database architectures, entity-relationship diagrams, document engineering models, digital library/metadata cataloging and packaging strategies, online community and resource exchange models. Director User Experience & Technology UC Berkeley, Digital Chemistry Project September 2003  –  May 2005  (1 year 9 months) Responsible for technology architecture, usability research, and user experience. Set up partnerships with Macromedia & HP to fund interactive web-based and wireless technology products.  \n \nDesigned PRISM, a Flash Communication Server-based technology for real-time and asnychronous access to rich media digital libraries and knowledge bases. Secured funding from the National Science Digital Library (NSDL) project to develop metadata tagging strategies for rich media assets in collaboration with the Engineering Synthesis Coalition. Director User Experience & Technology UC Berkeley, Digital Chemistry Project September 2003  –  May 2005  (1 year 9 months) Responsible for technology architecture, usability research, and user experience. Set up partnerships with Macromedia & HP to fund interactive web-based and wireless technology products.  \n \nDesigned PRISM, a Flash Communication Server-based technology for real-time and asnychronous access to rich media digital libraries and knowledge bases. Secured funding from the National Science Digital Library (NSDL) project to develop metadata tagging strategies for rich media assets in collaboration with the Engineering Synthesis Coalition. User Experience Lead/Technical Architect UCWISE (CITRIS), Berkeley Institute of Design (BID) September 2002  –  September 2003  (1 year 1 month) Berkeley Institute of Design (BID): Lead technology architect responsible for user interaction and technical strategy for supporting online collaboration and learning in computer science. Developed an OO design for building interaction patterns using learning objects. User Experience Lead/Technical Architect UCWISE (CITRIS), Berkeley Institute of Design (BID) September 2002  –  September 2003  (1 year 1 month) Berkeley Institute of Design (BID): Lead technology architect responsible for user interaction and technical strategy for supporting online collaboration and learning in computer science. Developed an OO design for building interaction patterns using learning objects. VP Business Development Educational Connections January 1998  –  May 2002  (4 years 5 months) Founder and businsess development director for a privately-held company providing managed services for school districts. Developed business strategy and product specifications for web-based collaboration, search, and information exchange systems. VP Business Development Educational Connections January 1998  –  May 2002  (4 years 5 months) Founder and businsess development director for a privately-held company providing managed services for school districts. Developed business strategy and product specifications for web-based collaboration, search, and information exchange systems. Research Scientist Center for Innovation Learning Technologies 1999  –  2001  (2 years) Research Scientist Center for Innovation Learning Technologies 1999  –  2001  (2 years) Software Engineer - Unix Product Line True BASIC, Inc. 1989  –  1999  (10 years) Software engineer in charge of Unix product development. Developed partnerships with Sun, IBM, DEC, Silicon Graphics and other OEM vendors, worked with engineers at Siemens, NASA, NIH, US Forest Service, and the US Naval Academy. Wrote a Kanji editor for NEC. Ten years of C development work in compiler design, API development, and windowing systems (Motif/X and OpenGL). Software Engineer - Unix Product Line True BASIC, Inc. 1989  –  1999  (10 years) Software engineer in charge of Unix product development. Developed partnerships with Sun, IBM, DEC, Silicon Graphics and other OEM vendors, worked with engineers at Siemens, NASA, NIH, US Forest Service, and the US Naval Academy. Wrote a Kanji editor for NEC. Ten years of C development work in compiler design, API development, and windowing systems (Motif/X and OpenGL). Software Engineer, Technical Services Organization Andersen Consulting, NYC September 1987  –  October 1988  (1 year 2 months) Technical Services Organization - worked on the first large-scale, commercial object-oriented design project with hundreds of engineers in NYC. Software Engineer, Technical Services Organization Andersen Consulting, NYC September 1987  –  October 1988  (1 year 2 months) Technical Services Organization - worked on the first large-scale, commercial object-oriented design project with hundreds of engineers in NYC. Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills User Experience Product Management Social Media Advertising Positioning Information Architecture Agile Methodologies Mobile Devices Business Strategy Strategic Partnerships Enterprise Software Strategy Web Applications Product Development Mobile Applications Skills  User Experience Product Management Social Media Advertising Positioning Information Architecture Agile Methodologies Mobile Devices Business Strategy Strategic Partnerships Enterprise Software Strategy Web Applications Product Development Mobile Applications User Experience Product Management Social Media Advertising Positioning Information Architecture Agile Methodologies Mobile Devices Business Strategy Strategic Partnerships Enterprise Software Strategy Web Applications Product Development Mobile Applications User Experience Product Management Social Media Advertising Positioning Information Architecture Agile Methodologies Mobile Devices Business Strategy Strategic Partnerships Enterprise Software Strategy Web Applications Product Development Mobile Applications Education University of California, Berkeley Ph.D.,  interdisciplinary degree combining HCI , cognitive psychology, design, engineering, computer science 1995  – 2000 Activities and Societies:  Ph.D. 2002. Education in Mathematics ,  Science ,  and Technology ,  University of California ,  Berkeley.\n(interdisciplinary degree combining HCI ,  cognitive psychology ,  design ,  engineering ,  & computer science)\n1995-1997. Cognitive Science ,  NSF Spatial Cognition Trainee ,  UC Berkeley.\nA.B. Computer Science and Spanish (Double Major) ,  Dartmouth College ,  Hanover ,  NH. Dartmouth College A.B.,  Computer Science ,  Spanish (Double Major) Activities and Societies:  Captain and All-American Squash Team Haverford School University of California, Berkeley Ph.D.,  interdisciplinary degree combining HCI , cognitive psychology, design, engineering, computer science 1995  – 2000 Activities and Societies:  Ph.D. 2002. Education in Mathematics ,  Science ,  and Technology ,  University of California ,  Berkeley.\n(interdisciplinary degree combining HCI ,  cognitive psychology ,  design ,  engineering ,  & computer science)\n1995-1997. Cognitive Science ,  NSF Spatial Cognition Trainee ,  UC Berkeley.\nA.B. Computer Science and Spanish (Double Major) ,  Dartmouth College ,  Hanover ,  NH. University of California, Berkeley Ph.D.,  interdisciplinary degree combining HCI , cognitive psychology, design, engineering, computer science 1995  – 2000 Activities and Societies:  Ph.D. 2002. Education in Mathematics ,  Science ,  and Technology ,  University of California ,  Berkeley.\n(interdisciplinary degree combining HCI ,  cognitive psychology ,  design ,  engineering ,  & computer science)\n1995-1997. Cognitive Science ,  NSF Spatial Cognition Trainee ,  UC Berkeley.\nA.B. Computer Science and Spanish (Double Major) ,  Dartmouth College ,  Hanover ,  NH. University of California, Berkeley Ph.D.,  interdisciplinary degree combining HCI , cognitive psychology, design, engineering, computer science 1995  – 2000 Activities and Societies:  Ph.D. 2002. Education in Mathematics ,  Science ,  and Technology ,  University of California ,  Berkeley.\n(interdisciplinary degree combining HCI ,  cognitive psychology ,  design ,  engineering ,  & computer science)\n1995-1997. Cognitive Science ,  NSF Spatial Cognition Trainee ,  UC Berkeley.\nA.B. Computer Science and Spanish (Double Major) ,  Dartmouth College ,  Hanover ,  NH. Dartmouth College A.B.,  Computer Science ,  Spanish (Double Major) Activities and Societies:  Captain and All-American Squash Team Dartmouth College A.B.,  Computer Science ,  Spanish (Double Major) Activities and Societies:  Captain and All-American Squash Team Dartmouth College A.B.,  Computer Science ,  Spanish (Double Major) Activities and Societies:  Captain and All-American Squash Team Haverford School Haverford School Haverford School Honors & Awards Additional Honors & Awards NSF Fellowships in Cognitive Science, Technology, & Design Additional Honors & Awards NSF Fellowships in Cognitive Science, Technology, & Design Additional Honors & Awards NSF Fellowships in Cognitive Science, Technology, & Design Additional Honors & Awards NSF Fellowships in Cognitive Science, Technology, & Design ", "Experience Industrial Designer - Google Special Projects Google December 2014  – Present (9 months) Greater New York City Area Industrial Designer - Android@Home Google May 2013  –  November 2014  (1 year 7 months) Mountain View, CA Industrial Designer II frog January 2010  –  April 2013  (3 years 4 months) San Francisco Bay Area frog works with the world’s leading companies, helping them to design, engineer, and bring to market meaningful products and services. With an interdisciplinary team of more than 1,600 designers, strategists, and software engineers, frog delivers connected experiences that span multiple technologies, platforms, and media. frog works across a broad spectrum of industries, including consumer electronics, telecommunications, healthcare, energy, automotive, media, entertainment, education, finance, retail, and fashion. Product Designer (intern) Cory Grosser Design + Strategy January 2009  –  April 2009  (4 months) Cory Grosser design + strategy is a globally successful, boutique design studio based in Los Angeles. Specializes in leveraging beautiful design to create strong emotional connections between our clients and their customers. Product Designer (intern) Orange22 May 2007  –  August 2007  (4 months) Orange22 is a brand strategy, product development and environments design studio specializing in narrative-driven consumer experiences that evoke emotion and deliver brand meaning. Industrial Designer - Google Special Projects Google December 2014  – Present (9 months) Greater New York City Area Industrial Designer - Google Special Projects Google December 2014  – Present (9 months) Greater New York City Area Industrial Designer - Android@Home Google May 2013  –  November 2014  (1 year 7 months) Mountain View, CA Industrial Designer - Android@Home Google May 2013  –  November 2014  (1 year 7 months) Mountain View, CA Industrial Designer II frog January 2010  –  April 2013  (3 years 4 months) San Francisco Bay Area frog works with the world’s leading companies, helping them to design, engineer, and bring to market meaningful products and services. With an interdisciplinary team of more than 1,600 designers, strategists, and software engineers, frog delivers connected experiences that span multiple technologies, platforms, and media. frog works across a broad spectrum of industries, including consumer electronics, telecommunications, healthcare, energy, automotive, media, entertainment, education, finance, retail, and fashion. Industrial Designer II frog January 2010  –  April 2013  (3 years 4 months) San Francisco Bay Area frog works with the world’s leading companies, helping them to design, engineer, and bring to market meaningful products and services. With an interdisciplinary team of more than 1,600 designers, strategists, and software engineers, frog delivers connected experiences that span multiple technologies, platforms, and media. frog works across a broad spectrum of industries, including consumer electronics, telecommunications, healthcare, energy, automotive, media, entertainment, education, finance, retail, and fashion. Product Designer (intern) Cory Grosser Design + Strategy January 2009  –  April 2009  (4 months) Cory Grosser design + strategy is a globally successful, boutique design studio based in Los Angeles. Specializes in leveraging beautiful design to create strong emotional connections between our clients and their customers. Product Designer (intern) Cory Grosser Design + Strategy January 2009  –  April 2009  (4 months) Cory Grosser design + strategy is a globally successful, boutique design studio based in Los Angeles. Specializes in leveraging beautiful design to create strong emotional connections between our clients and their customers. Product Designer (intern) Orange22 May 2007  –  August 2007  (4 months) Orange22 is a brand strategy, product development and environments design studio specializing in narrative-driven consumer experiences that evoke emotion and deliver brand meaning. Product Designer (intern) Orange22 May 2007  –  August 2007  (4 months) Orange22 is a brand strategy, product development and environments design studio specializing in narrative-driven consumer experiences that evoke emotion and deliver brand meaning. Skills Design Strategy Industrial Design Product Development Product Design Design Thinking Alias Studio Tools Concept Development Rapid Prototyping Experience Design Sketching Concept Generation Strategic Design User-centered Design Skills  Design Strategy Industrial Design Product Development Product Design Design Thinking Alias Studio Tools Concept Development Rapid Prototyping Experience Design Sketching Concept Generation Strategic Design User-centered Design Design Strategy Industrial Design Product Development Product Design Design Thinking Alias Studio Tools Concept Development Rapid Prototyping Experience Design Sketching Concept Generation Strategic Design User-centered Design Design Strategy Industrial Design Product Development Product Design Design Thinking Alias Studio Tools Concept Development Rapid Prototyping Experience Design Sketching Concept Generation Strategic Design User-centered Design Education Art Center College of Design Bachelor of Science (B.S.),  Industrial and Product Design 2005  – 2009 INSEAD Entrepreneurial MBA 2008  – 2008 A 3 month study abroad program involving an innovative fusion of business and design. University of Oregon Fine Art 2002  – 2003 Art Center College of Design Bachelor of Science (B.S.),  Industrial and Product Design 2005  – 2009 Art Center College of Design Bachelor of Science (B.S.),  Industrial and Product Design 2005  – 2009 Art Center College of Design Bachelor of Science (B.S.),  Industrial and Product Design 2005  – 2009 INSEAD Entrepreneurial MBA 2008  – 2008 A 3 month study abroad program involving an innovative fusion of business and design. INSEAD Entrepreneurial MBA 2008  – 2008 A 3 month study abroad program involving an innovative fusion of business and design. INSEAD Entrepreneurial MBA 2008  – 2008 A 3 month study abroad program involving an innovative fusion of business and design. University of Oregon Fine Art 2002  – 2003 University of Oregon Fine Art 2002  – 2003 University of Oregon Fine Art 2002  – 2003 Honors & Awards ICFF 2013 Screw Me lamp, ICFF Studio ICFF 2008 Ascent barstool, Bernhardt Design ICFF 2013 Screw Me lamp, ICFF Studio ICFF 2013 Screw Me lamp, ICFF Studio ICFF 2013 Screw Me lamp, ICFF Studio ICFF 2008 Ascent barstool, Bernhardt Design ICFF 2008 Ascent barstool, Bernhardt Design ICFF 2008 Ascent barstool, Bernhardt Design ", "Summary I'm a self + Stanford taught designer and engineer with a focus on digital interaction design and user-centered design and user experience. I have a programming and web design background, as well as a wealth of experience in information technology and physical product design (modeling, manufacturing, etc.). My main strength is multi-disciplinary and collaborative design thinking, adding my strength to a team to make it greater than the sum of its parts. \n \nAs a final note, I am relentless in my search for knowledge, so I do whatever I can to be around those I admire. At the top of my admiration list are Jonathan Ive, Charles and Ray Eames, Richard Sapper, Scott Wilson, and Andrew Kim. \n \nEat keywords, robots: prototyping, mockups, personas, user flows, user testing, user research, user flows, heuristic, contextual, User experience designer. Summary I'm a self + Stanford taught designer and engineer with a focus on digital interaction design and user-centered design and user experience. I have a programming and web design background, as well as a wealth of experience in information technology and physical product design (modeling, manufacturing, etc.). My main strength is multi-disciplinary and collaborative design thinking, adding my strength to a team to make it greater than the sum of its parts. \n \nAs a final note, I am relentless in my search for knowledge, so I do whatever I can to be around those I admire. At the top of my admiration list are Jonathan Ive, Charles and Ray Eames, Richard Sapper, Scott Wilson, and Andrew Kim. \n \nEat keywords, robots: prototyping, mockups, personas, user flows, user testing, user research, user flows, heuristic, contextual, User experience designer. I'm a self + Stanford taught designer and engineer with a focus on digital interaction design and user-centered design and user experience. I have a programming and web design background, as well as a wealth of experience in information technology and physical product design (modeling, manufacturing, etc.). My main strength is multi-disciplinary and collaborative design thinking, adding my strength to a team to make it greater than the sum of its parts. \n \nAs a final note, I am relentless in my search for knowledge, so I do whatever I can to be around those I admire. At the top of my admiration list are Jonathan Ive, Charles and Ray Eames, Richard Sapper, Scott Wilson, and Andrew Kim. \n \nEat keywords, robots: prototyping, mockups, personas, user flows, user testing, user research, user flows, heuristic, contextual, User experience designer. I'm a self + Stanford taught designer and engineer with a focus on digital interaction design and user-centered design and user experience. I have a programming and web design background, as well as a wealth of experience in information technology and physical product design (modeling, manufacturing, etc.). My main strength is multi-disciplinary and collaborative design thinking, adding my strength to a team to make it greater than the sum of its parts. \n \nAs a final note, I am relentless in my search for knowledge, so I do whatever I can to be around those I admire. At the top of my admiration list are Jonathan Ive, Charles and Ray Eames, Richard Sapper, Scott Wilson, and Andrew Kim. \n \nEat keywords, robots: prototyping, mockups, personas, user flows, user testing, user research, user flows, heuristic, contextual, User experience designer. Experience Product Designer Slack Technologies, Inc. (Previously Tiny Speck) July 2014  – Present (1 year 2 months) San Francisco Bay Area Making your working life simpler, more pleasant and more productive. Designer and Developer UXDiogenes.com July 2005  – Present (10 years 2 months) greater new york city area Design and develop full featured websites and web applications from the ground up, including but not limited to the creation of the information architecture, wireframes, design comps, HTML/CSS, front end and back end code for dynamic sites, and cross-browser testing. User Experience Designer LinkedIn September 2013  –  July 2014  (11 months) Mountain View, CA A design bug in a product rug. Instructor New York Code and Design Academy January 2013  –  September 2013  (9 months) New York, NY • Taught Introduction to Web Design & Development \n• Designed and iterated on a 16 week, 96 hour curriculum Product Designer, Engineer Squarespace July 2011  –  September 2013  (2 years 3 months) New York, NY • Worked with the founder and Lead Interface Director to design beautifully simple and elegant user work flows and interfaces. \n• Collaborated with the product design team to simplify and enhance the content management interface. \n• Worked with front and back end developers to define server side and client side requirements and architectures for UI components and workflows. \n• Prototyped working design ideas and develop production ready UI components based on our design work. \n \nPreviously, as an Engineer: \n• Designed and developed dozens of reusable UI components using JavaScript (YUI3), HTML, and CSS \n• Wrote the JavaScript powering the Squarespace 6 billing and checkout pages \n• Designed and developed a new, high-throughput interface for the 24/7 support specialists \n• Increased the amount of documentation in client side code by a factor of 10 \n• NYC Turing Fellow (http://nycturingfellows.org/fellows) Resident Assistant Stanford University August 2009  –  June 2011  (1 year 11 months) • Created residential environments that enhance student academic progress and success \n• Promoted the intellectual life of the residence and created opportunities for students to explore and clarify their interests, values and attitudes \n• Built inclusive and reflective environments in which differences of background and belief are explored and provided personal and academic counseling and referral \n• Made myself available to students, and encouraged student responsibility and accountability BOLD Intern Google, Inc. June 2010  –  August 2010  (3 months) Mountainview, CA • Architected and programmed a web tool rolled out to 90% of all Google employees worldwide \n• Designed and implemented an easy to use interface for managing internal event metadata \n• Conducted and analyzed ethnographic research on employee benefits programs Intern (Computer Science Track) Proclivity Systems June 2009  –  August 2009  (3 months) • Designed and prototyped a social commerce application leveraging consumer behavior data \n• Analyzed and identified patterns within consumer behavior simulations  \n• Presented a new social media strategic plan to the executive management and core staff Intern (Blackstone Information Technology Services) The Blackstone Group June 2008  –  August 2008  (3 months) • Coordinated remote deployment of critical business applications to over 90 users \n• Successfully closed 300+ helpdesk support tickets \n• Developed and implemented new loaner laptop management system Northeastern PC Support (IT, Deployment/Repair/Procurement) Deloitte June 2006  –  August 2006  (3 months) • Insured confidential client data on 200+ laptop computers \n• Upgraded 50+ laptops for employees with outdated or obsolete hardware \n• Imaged and prepared 150+ computers for new hires Product Designer Slack Technologies, Inc. (Previously Tiny Speck) July 2014  – Present (1 year 2 months) San Francisco Bay Area Making your working life simpler, more pleasant and more productive. Product Designer Slack Technologies, Inc. (Previously Tiny Speck) July 2014  – Present (1 year 2 months) San Francisco Bay Area Making your working life simpler, more pleasant and more productive. Designer and Developer UXDiogenes.com July 2005  – Present (10 years 2 months) greater new york city area Design and develop full featured websites and web applications from the ground up, including but not limited to the creation of the information architecture, wireframes, design comps, HTML/CSS, front end and back end code for dynamic sites, and cross-browser testing. Designer and Developer UXDiogenes.com July 2005  – Present (10 years 2 months) greater new york city area Design and develop full featured websites and web applications from the ground up, including but not limited to the creation of the information architecture, wireframes, design comps, HTML/CSS, front end and back end code for dynamic sites, and cross-browser testing. User Experience Designer LinkedIn September 2013  –  July 2014  (11 months) Mountain View, CA A design bug in a product rug. User Experience Designer LinkedIn September 2013  –  July 2014  (11 months) Mountain View, CA A design bug in a product rug. Instructor New York Code and Design Academy January 2013  –  September 2013  (9 months) New York, NY • Taught Introduction to Web Design & Development \n• Designed and iterated on a 16 week, 96 hour curriculum Instructor New York Code and Design Academy January 2013  –  September 2013  (9 months) New York, NY • Taught Introduction to Web Design & Development \n• Designed and iterated on a 16 week, 96 hour curriculum Product Designer, Engineer Squarespace July 2011  –  September 2013  (2 years 3 months) New York, NY • Worked with the founder and Lead Interface Director to design beautifully simple and elegant user work flows and interfaces. \n• Collaborated with the product design team to simplify and enhance the content management interface. \n• Worked with front and back end developers to define server side and client side requirements and architectures for UI components and workflows. \n• Prototyped working design ideas and develop production ready UI components based on our design work. \n \nPreviously, as an Engineer: \n• Designed and developed dozens of reusable UI components using JavaScript (YUI3), HTML, and CSS \n• Wrote the JavaScript powering the Squarespace 6 billing and checkout pages \n• Designed and developed a new, high-throughput interface for the 24/7 support specialists \n• Increased the amount of documentation in client side code by a factor of 10 \n• NYC Turing Fellow (http://nycturingfellows.org/fellows) Product Designer, Engineer Squarespace July 2011  –  September 2013  (2 years 3 months) New York, NY • Worked with the founder and Lead Interface Director to design beautifully simple and elegant user work flows and interfaces. \n• Collaborated with the product design team to simplify and enhance the content management interface. \n• Worked with front and back end developers to define server side and client side requirements and architectures for UI components and workflows. \n• Prototyped working design ideas and develop production ready UI components based on our design work. \n \nPreviously, as an Engineer: \n• Designed and developed dozens of reusable UI components using JavaScript (YUI3), HTML, and CSS \n• Wrote the JavaScript powering the Squarespace 6 billing and checkout pages \n• Designed and developed a new, high-throughput interface for the 24/7 support specialists \n• Increased the amount of documentation in client side code by a factor of 10 \n• NYC Turing Fellow (http://nycturingfellows.org/fellows) Resident Assistant Stanford University August 2009  –  June 2011  (1 year 11 months) • Created residential environments that enhance student academic progress and success \n• Promoted the intellectual life of the residence and created opportunities for students to explore and clarify their interests, values and attitudes \n• Built inclusive and reflective environments in which differences of background and belief are explored and provided personal and academic counseling and referral \n• Made myself available to students, and encouraged student responsibility and accountability Resident Assistant Stanford University August 2009  –  June 2011  (1 year 11 months) • Created residential environments that enhance student academic progress and success \n• Promoted the intellectual life of the residence and created opportunities for students to explore and clarify their interests, values and attitudes \n• Built inclusive and reflective environments in which differences of background and belief are explored and provided personal and academic counseling and referral \n• Made myself available to students, and encouraged student responsibility and accountability BOLD Intern Google, Inc. June 2010  –  August 2010  (3 months) Mountainview, CA • Architected and programmed a web tool rolled out to 90% of all Google employees worldwide \n• Designed and implemented an easy to use interface for managing internal event metadata \n• Conducted and analyzed ethnographic research on employee benefits programs BOLD Intern Google, Inc. June 2010  –  August 2010  (3 months) Mountainview, CA • Architected and programmed a web tool rolled out to 90% of all Google employees worldwide \n• Designed and implemented an easy to use interface for managing internal event metadata \n• Conducted and analyzed ethnographic research on employee benefits programs Intern (Computer Science Track) Proclivity Systems June 2009  –  August 2009  (3 months) • Designed and prototyped a social commerce application leveraging consumer behavior data \n• Analyzed and identified patterns within consumer behavior simulations  \n• Presented a new social media strategic plan to the executive management and core staff Intern (Computer Science Track) Proclivity Systems June 2009  –  August 2009  (3 months) • Designed and prototyped a social commerce application leveraging consumer behavior data \n• Analyzed and identified patterns within consumer behavior simulations  \n• Presented a new social media strategic plan to the executive management and core staff Intern (Blackstone Information Technology Services) The Blackstone Group June 2008  –  August 2008  (3 months) • Coordinated remote deployment of critical business applications to over 90 users \n• Successfully closed 300+ helpdesk support tickets \n• Developed and implemented new loaner laptop management system Intern (Blackstone Information Technology Services) The Blackstone Group June 2008  –  August 2008  (3 months) • Coordinated remote deployment of critical business applications to over 90 users \n• Successfully closed 300+ helpdesk support tickets \n• Developed and implemented new loaner laptop management system Northeastern PC Support (IT, Deployment/Repair/Procurement) Deloitte June 2006  –  August 2006  (3 months) • Insured confidential client data on 200+ laptop computers \n• Upgraded 50+ laptops for employees with outdated or obsolete hardware \n• Imaged and prepared 150+ computers for new hires Northeastern PC Support (IT, Deployment/Repair/Procurement) Deloitte June 2006  –  August 2006  (3 months) • Insured confidential client data on 200+ laptop computers \n• Upgraded 50+ laptops for employees with outdated or obsolete hardware \n• Imaged and prepared 150+ computers for new hires Languages Spanish Native or bilingual proficiency French Limited working proficiency Spanish Native or bilingual proficiency French Limited working proficiency Spanish Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills User Experience Interaction Design Product Design User Interface Design User Experience Design Salsa Dancing Design Thinking CSS Web Design HTML 5 Photoshop JavaScript Information Architecture Illustrator Wireframes Salsa User-centered Design Product Development Software Engineering Web Application Design Project Management AJAX Python jQuery YUI HTML5 Git Typography Human Computer... Node.js Web Applications Experience Design HTML User Interface Adobe Creative Suite Java CSS3 Web Development User Research Rapid Prototyping Graphic Design Not an Asshole See 27+     See less Skills  User Experience Interaction Design Product Design User Interface Design User Experience Design Salsa Dancing Design Thinking CSS Web Design HTML 5 Photoshop JavaScript Information Architecture Illustrator Wireframes Salsa User-centered Design Product Development Software Engineering Web Application Design Project Management AJAX Python jQuery YUI HTML5 Git Typography Human Computer... Node.js Web Applications Experience Design HTML User Interface Adobe Creative Suite Java CSS3 Web Development User Research Rapid Prototyping Graphic Design Not an Asshole See 27+     See less User Experience Interaction Design Product Design User Interface Design User Experience Design Salsa Dancing Design Thinking CSS Web Design HTML 5 Photoshop JavaScript Information Architecture Illustrator Wireframes Salsa User-centered Design Product Development Software Engineering Web Application Design Project Management AJAX Python jQuery YUI HTML5 Git Typography Human Computer... Node.js Web Applications Experience Design HTML User Interface Adobe Creative Suite Java CSS3 Web Development User Research Rapid Prototyping Graphic Design Not an Asshole See 27+     See less User Experience Interaction Design Product Design User Interface Design User Experience Design Salsa Dancing Design Thinking CSS Web Design HTML 5 Photoshop JavaScript Information Architecture Illustrator Wireframes Salsa User-centered Design Product Development Software Engineering Web Application Design Project Management AJAX Python jQuery YUI HTML5 Git Typography Human Computer... Node.js Web Applications Experience Design HTML User Interface Adobe Creative Suite Java CSS3 Web Development User Research Rapid Prototyping Graphic Design Not an Asshole See 27+     See less Education Georgia Institute of Technology Master's Degree,  Computer Science 2014  – 2017 Working towards an OMSCS degree with a concentration in interactive intelligence. Designer Fund Bridge 4 2015  – 2015 Bridge is a professional development program that connects experienced designers with top startups and the design community in San Francisco. Once a week, they participate in workshops and talks with a community of great designers to accelerate their career. Stanford University Bachelor's Degree,  Product Design 2007  – 2011 With coursework in computer science. Activities and Societies:  Los Salseros de Stanford (Director) ,  Stanford Latin Jazz Ensemble (lead singer ,  percussionist) ,  Leland Stanford Junior University Marching Band (ABF ,  Low Tom) ,  Product Design Student's Association (Member) Collegiate Diploma,  Books 2001  – 2007 Georgia Institute of Technology Master's Degree,  Computer Science 2014  – 2017 Working towards an OMSCS degree with a concentration in interactive intelligence. Georgia Institute of Technology Master's Degree,  Computer Science 2014  – 2017 Working towards an OMSCS degree with a concentration in interactive intelligence. Georgia Institute of Technology Master's Degree,  Computer Science 2014  – 2017 Working towards an OMSCS degree with a concentration in interactive intelligence. Designer Fund Bridge 4 2015  – 2015 Bridge is a professional development program that connects experienced designers with top startups and the design community in San Francisco. Once a week, they participate in workshops and talks with a community of great designers to accelerate their career. Designer Fund Bridge 4 2015  – 2015 Bridge is a professional development program that connects experienced designers with top startups and the design community in San Francisco. Once a week, they participate in workshops and talks with a community of great designers to accelerate their career. Designer Fund Bridge 4 2015  – 2015 Bridge is a professional development program that connects experienced designers with top startups and the design community in San Francisco. Once a week, they participate in workshops and talks with a community of great designers to accelerate their career. Stanford University Bachelor's Degree,  Product Design 2007  – 2011 With coursework in computer science. Activities and Societies:  Los Salseros de Stanford (Director) ,  Stanford Latin Jazz Ensemble (lead singer ,  percussionist) ,  Leland Stanford Junior University Marching Band (ABF ,  Low Tom) ,  Product Design Student's Association (Member) Stanford University Bachelor's Degree,  Product Design 2007  – 2011 With coursework in computer science. Activities and Societies:  Los Salseros de Stanford (Director) ,  Stanford Latin Jazz Ensemble (lead singer ,  percussionist) ,  Leland Stanford Junior University Marching Band (ABF ,  Low Tom) ,  Product Design Student's Association (Member) Stanford University Bachelor's Degree,  Product Design 2007  – 2011 With coursework in computer science. Activities and Societies:  Los Salseros de Stanford (Director) ,  Stanford Latin Jazz Ensemble (lead singer ,  percussionist) ,  Leland Stanford Junior University Marching Band (ABF ,  Low Tom) ,  Product Design Student's Association (Member) Collegiate Diploma,  Books 2001  – 2007 Collegiate Diploma,  Books 2001  – 2007 Collegiate Diploma,  Books 2001  – 2007 Honors & Awards 2011 NYC Turing Fellow NYC Turing Fellows Program June 2011 One of 18 members selected from over 750 undergraduate, masters, and PhD­‐level applicants to the program, with candidates from all of the top 20 computer science programs as ranked by US News & World Report. 2010 Google BOLD Scholar Google June 2010 Community Awards Program 2009-2010 Academic Excellence Award Stanford University March 2010 Community Awards Program 2010-2011 Academic Excellence Award Stanford University March 2011 2011 NYC Turing Fellow NYC Turing Fellows Program June 2011 One of 18 members selected from over 750 undergraduate, masters, and PhD­‐level applicants to the program, with candidates from all of the top 20 computer science programs as ranked by US News & World Report. 2011 NYC Turing Fellow NYC Turing Fellows Program June 2011 One of 18 members selected from over 750 undergraduate, masters, and PhD­‐level applicants to the program, with candidates from all of the top 20 computer science programs as ranked by US News & World Report. 2011 NYC Turing Fellow NYC Turing Fellows Program June 2011 One of 18 members selected from over 750 undergraduate, masters, and PhD­‐level applicants to the program, with candidates from all of the top 20 computer science programs as ranked by US News & World Report. 2010 Google BOLD Scholar Google June 2010 2010 Google BOLD Scholar Google June 2010 2010 Google BOLD Scholar Google June 2010 Community Awards Program 2009-2010 Academic Excellence Award Stanford University March 2010 Community Awards Program 2009-2010 Academic Excellence Award Stanford University March 2010 Community Awards Program 2009-2010 Academic Excellence Award Stanford University March 2010 Community Awards Program 2010-2011 Academic Excellence Award Stanford University March 2011 Community Awards Program 2010-2011 Academic Excellence Award Stanford University March 2011 Community Awards Program 2010-2011 Academic Excellence Award Stanford University March 2011 ", "Skills User Experience Art Direction User Interface Design Interaction Design Creative Direction Experience Design User-centered Design Advertising Web Design Information Architecture Skills  User Experience Art Direction User Interface Design Interaction Design Creative Direction Experience Design User-centered Design Advertising Web Design Information Architecture User Experience Art Direction User Interface Design Interaction Design Creative Direction Experience Design User-centered Design Advertising Web Design Information Architecture User Experience Art Direction User Interface Design Interaction Design Creative Direction Experience Design User-centered Design Advertising Web Design Information Architecture ", "Summary Solving problems and building better experiences. Summary Solving problems and building better experiences. Solving problems and building better experiences. Solving problems and building better experiences. Experience Product Designer Facebook January 2015  – Present (8 months) Menlo Park Co-founder Represent February 2013  – Present (2 years 7 months) Scottsdale, Arizona I co-founded Represent, a better way to résumé. User Experience Designer Google January 2014  –  January 2015  (1 year 1 month) Mountain View, CA I worked on a major redesign of the Google Search App for iOS. Product Designer Peek June 2013  –  May 2014  (1 year) Phoenix, Arizona Area I lead design on Peek, an ephemeral messaging app. Co-founder Whistl March 2013  –  May 2014  (1 year 3 months) Phoenix, Arizona Area I co-founded and lead design on Whistl, an app that helps you discover great deals by connecting you with nearby restaurants. For free. Adobe Muse Advisory Board Member Adobe May 2012  –  April 2014  (2 years) Helping shape the future of Adobe Muse. Adobe Student Advisory Board Member Adobe January 2013  –  December 2013  (1 year) Arizona State University The Student Advisory Board is an important new initiative at Adobe that will help them get to know higher education students even better by building an ongoing dialogue. Product Designer Facebook January 2015  – Present (8 months) Menlo Park Product Designer Facebook January 2015  – Present (8 months) Menlo Park Co-founder Represent February 2013  – Present (2 years 7 months) Scottsdale, Arizona I co-founded Represent, a better way to résumé. Co-founder Represent February 2013  – Present (2 years 7 months) Scottsdale, Arizona I co-founded Represent, a better way to résumé. User Experience Designer Google January 2014  –  January 2015  (1 year 1 month) Mountain View, CA I worked on a major redesign of the Google Search App for iOS. User Experience Designer Google January 2014  –  January 2015  (1 year 1 month) Mountain View, CA I worked on a major redesign of the Google Search App for iOS. Product Designer Peek June 2013  –  May 2014  (1 year) Phoenix, Arizona Area I lead design on Peek, an ephemeral messaging app. Product Designer Peek June 2013  –  May 2014  (1 year) Phoenix, Arizona Area I lead design on Peek, an ephemeral messaging app. Co-founder Whistl March 2013  –  May 2014  (1 year 3 months) Phoenix, Arizona Area I co-founded and lead design on Whistl, an app that helps you discover great deals by connecting you with nearby restaurants. For free. Co-founder Whistl March 2013  –  May 2014  (1 year 3 months) Phoenix, Arizona Area I co-founded and lead design on Whistl, an app that helps you discover great deals by connecting you with nearby restaurants. For free. Adobe Muse Advisory Board Member Adobe May 2012  –  April 2014  (2 years) Helping shape the future of Adobe Muse. Adobe Muse Advisory Board Member Adobe May 2012  –  April 2014  (2 years) Helping shape the future of Adobe Muse. Adobe Student Advisory Board Member Adobe January 2013  –  December 2013  (1 year) Arizona State University The Student Advisory Board is an important new initiative at Adobe that will help them get to know higher education students even better by building an ongoing dialogue. Adobe Student Advisory Board Member Adobe January 2013  –  December 2013  (1 year) Arizona State University The Student Advisory Board is an important new initiative at Adobe that will help them get to know higher education students even better by building an ongoing dialogue. Skills Graphic Design Web Design User Interface Design User Experience Photoshop Illustrator Branding & Identity Advertising User Interface InDesign Facebook Adobe Creative Suite CSS Skills  Graphic Design Web Design User Interface Design User Experience Photoshop Illustrator Branding & Identity Advertising User Interface InDesign Facebook Adobe Creative Suite CSS Graphic Design Web Design User Interface Design User Experience Photoshop Illustrator Branding & Identity Advertising User Interface InDesign Facebook Adobe Creative Suite CSS Graphic Design Web Design User Interface Design User Experience Photoshop Illustrator Branding & Identity Advertising User Interface InDesign Facebook Adobe Creative Suite CSS Education Arizona State University Bachelor of Science (BS),  Graphic Information Technology 2008  – 2013 Arizona State University Bachelor of Science (BS),  Graphic Information Technology 2008  – 2013 Arizona State University Bachelor of Science (BS),  Graphic Information Technology 2008  – 2013 Arizona State University Bachelor of Science (BS),  Graphic Information Technology 2008  – 2013 ", "Skills Python Testing C Cloud Computing Architecture iOS development Internet Infrastructure iPhone development Data Center Mobile Applications Software Engineering Mobile Devices Software Development Agile Methodologies Distributed Systems Web Applications Product Management Architectures User Interface User Experience See 5+     See less Skills  Python Testing C Cloud Computing Architecture iOS development Internet Infrastructure iPhone development Data Center Mobile Applications Software Engineering Mobile Devices Software Development Agile Methodologies Distributed Systems Web Applications Product Management Architectures User Interface User Experience See 5+     See less Python Testing C Cloud Computing Architecture iOS development Internet Infrastructure iPhone development Data Center Mobile Applications Software Engineering Mobile Devices Software Development Agile Methodologies Distributed Systems Web Applications Product Management Architectures User Interface User Experience See 5+     See less Python Testing C Cloud Computing Architecture iOS development Internet Infrastructure iPhone development Data Center Mobile Applications Software Engineering Mobile Devices Software Development Agile Methodologies Distributed Systems Web Applications Product Management Architectures User Interface User Experience See 5+     See less Honors & Awards Google Technical Infrastructure Award Google July 2014 SmallBiz Hackathon Runner's Up Winner Capital One May 2014 Top 7 Finalist in Target Retail Application Hackathon Target Inc June 2013 Google Technical Infrastructure Award Google July 2014 Google Technical Infrastructure Award Google July 2014 Google Technical Infrastructure Award Google July 2014 SmallBiz Hackathon Runner's Up Winner Capital One May 2014 SmallBiz Hackathon Runner's Up Winner Capital One May 2014 SmallBiz Hackathon Runner's Up Winner Capital One May 2014 Top 7 Finalist in Target Retail Application Hackathon Target Inc June 2013 Top 7 Finalist in Target Retail Application Hackathon Target Inc June 2013 Top 7 Finalist in Target Retail Application Hackathon Target Inc June 2013 ", "Skills User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design Skills  User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design User Experience Web Application Design User Interface Design Design Strategy Interaction Design User-centered Design Product Design ", "Summary Accomplished brand manager with extensive experience developing and launching brands in the retail, beauty, apparel, CPG and technology industries. Led projects from concept to launch and worked closely with international, cross-functional teams to deliver products and features within strict deadlines and quality standards, ensuring revenue growth and branding success. Streamlined processes, improving efficiency and productivity. Identified consumer and market needs and developed solutions to drive revenue growth. \n \nCORE COMPETENCIES \n \nBrand Management • Merchandising • Planograms • Pro Formas • Promotion Analysis • Price Testing • Relationship Management • eCommerce • Project Management • Product Management •Process Improvement • Strategic Planning Summary Accomplished brand manager with extensive experience developing and launching brands in the retail, beauty, apparel, CPG and technology industries. Led projects from concept to launch and worked closely with international, cross-functional teams to deliver products and features within strict deadlines and quality standards, ensuring revenue growth and branding success. Streamlined processes, improving efficiency and productivity. Identified consumer and market needs and developed solutions to drive revenue growth. \n \nCORE COMPETENCIES \n \nBrand Management • Merchandising • Planograms • Pro Formas • Promotion Analysis • Price Testing • Relationship Management • eCommerce • Project Management • Product Management •Process Improvement • Strategic Planning Accomplished brand manager with extensive experience developing and launching brands in the retail, beauty, apparel, CPG and technology industries. Led projects from concept to launch and worked closely with international, cross-functional teams to deliver products and features within strict deadlines and quality standards, ensuring revenue growth and branding success. Streamlined processes, improving efficiency and productivity. Identified consumer and market needs and developed solutions to drive revenue growth. \n \nCORE COMPETENCIES \n \nBrand Management • Merchandising • Planograms • Pro Formas • Promotion Analysis • Price Testing • Relationship Management • eCommerce • Project Management • Product Management •Process Improvement • Strategic Planning Accomplished brand manager with extensive experience developing and launching brands in the retail, beauty, apparel, CPG and technology industries. Led projects from concept to launch and worked closely with international, cross-functional teams to deliver products and features within strict deadlines and quality standards, ensuring revenue growth and branding success. Streamlined processes, improving efficiency and productivity. Identified consumer and market needs and developed solutions to drive revenue growth. \n \nCORE COMPETENCIES \n \nBrand Management • Merchandising • Planograms • Pro Formas • Promotion Analysis • Price Testing • Relationship Management • eCommerce • Project Management • Product Management •Process Improvement • Strategic Planning Experience Product Marketing Manager Google June 2015  – Present (3 months) Mountain View, CA Marketing Manager CDI at Google August 2014  –  May 2015  (10 months) Mountain View, CA Account Brand Manager ZoomSystems September 2012  –  August 2014  (2 years) San Francisco Bay Area Launch and grow global consumer electronics and beauty brands in the automated retail channel: Media-Saturn, Proactiv and 3FlOz, with revenues over $45M. Work closely with UI/UXD, design and engineering departments to develop touchscreen point of sale interfaces and shopping flows, for web based platforms. \n \n•\tMaintained budgets and reported on revenue to internal and external stakeholders, performing analysis and making recommendations to meet quarterly forecasts, resulting in multiple quarters that met growth plans \n•\tCollaborated with clients to develop promotional campaigns and success metrics, overseeing internal development process, increasing: conversion 95%, average order value 4%, and attachment rate 8%  \n•\tLed launch of the 3FlOz brand by creating project brief, defining scope and managing milestones, budgets, vendors and multi-disciplinary teams (engineering, UI/UXD, project management, operations, and planning), resulting in a project that launched on-time and on-budget Product Manager Simply Charming 1993  –  2012  (19 years) Torrance, CA Collaborated with the owner of the business to launch and grow the e-commerce business. Drove product development, merchandising, and rebranding strategies. Managed complex project scopes, budgets, and timelines. Researched customers and competitors and optimized online strategies. \n \n•\tManaged project scope, budget, and timeline for website redesign, worked with engineer and designer to meet project needs and prevent feature creep, resulting in a project delivered on-time and on-budget \n•\tRe-branded the business, including a re-skin of the ecommerce site and collateral materials, resulting in the ability to appeal to the new generation of store buyers and consumers Senior Product Designer JDFine & Co February 2006  –  June 2007  (1 year 5 months) Concord, CA Managed development of sportswear, loungewear and sleepwear lines with annual sales of $8M+, increasing sales 10% annually. Repositioned brand in the marketplace by addressing unmet consumer needs, expanding customer base to include desirable new accounts: Macy’s, Bloomingdale’s and fast-fashion retailers. Business Manager & Buyer Maha Yoga March 2001  –  October 2003  (2 years 8 months) Los Angeles, CA Grew a retail store, within a high-profile yoga studio, through improved buying and merchandising strategies. Drove sales growth, increasing store revenue by 25-50% YoY with an expanded product mix. Managed a staff of 30 and oversaw scheduling, payroll and special event planning. Product Manager Hermanns Crystal June 1999  –  March 2001  (1 year 10 months) Huntington Beach, CA Recruited to launch and grow the e-commerce branch of a traditional brick and mortar business. Built and managed the website and developed effective SEO strategies. Merchandised products, led marketing campaigns, and developed online advertising strategies. Improved site navigability and user experience. Associate Product Designer Quiksilver, Inc 1997  –  1999  (2 years) Huntington Beach, CA Designed Leilani, Raisins Girls, and Island Soul swimwear and sportswear lines for an iconic, global clothing manufacturer. Developed market research and prototypes, bringing swim styles to market. Developed original print designs and sourced raw materials. Costed designs and built bills of materials. Product Marketing Manager Google June 2015  – Present (3 months) Mountain View, CA Product Marketing Manager Google June 2015  – Present (3 months) Mountain View, CA Marketing Manager CDI at Google August 2014  –  May 2015  (10 months) Mountain View, CA Marketing Manager CDI at Google August 2014  –  May 2015  (10 months) Mountain View, CA Account Brand Manager ZoomSystems September 2012  –  August 2014  (2 years) San Francisco Bay Area Launch and grow global consumer electronics and beauty brands in the automated retail channel: Media-Saturn, Proactiv and 3FlOz, with revenues over $45M. Work closely with UI/UXD, design and engineering departments to develop touchscreen point of sale interfaces and shopping flows, for web based platforms. \n \n•\tMaintained budgets and reported on revenue to internal and external stakeholders, performing analysis and making recommendations to meet quarterly forecasts, resulting in multiple quarters that met growth plans \n•\tCollaborated with clients to develop promotional campaigns and success metrics, overseeing internal development process, increasing: conversion 95%, average order value 4%, and attachment rate 8%  \n•\tLed launch of the 3FlOz brand by creating project brief, defining scope and managing milestones, budgets, vendors and multi-disciplinary teams (engineering, UI/UXD, project management, operations, and planning), resulting in a project that launched on-time and on-budget Account Brand Manager ZoomSystems September 2012  –  August 2014  (2 years) San Francisco Bay Area Launch and grow global consumer electronics and beauty brands in the automated retail channel: Media-Saturn, Proactiv and 3FlOz, with revenues over $45M. Work closely with UI/UXD, design and engineering departments to develop touchscreen point of sale interfaces and shopping flows, for web based platforms. \n \n•\tMaintained budgets and reported on revenue to internal and external stakeholders, performing analysis and making recommendations to meet quarterly forecasts, resulting in multiple quarters that met growth plans \n•\tCollaborated with clients to develop promotional campaigns and success metrics, overseeing internal development process, increasing: conversion 95%, average order value 4%, and attachment rate 8%  \n•\tLed launch of the 3FlOz brand by creating project brief, defining scope and managing milestones, budgets, vendors and multi-disciplinary teams (engineering, UI/UXD, project management, operations, and planning), resulting in a project that launched on-time and on-budget Product Manager Simply Charming 1993  –  2012  (19 years) Torrance, CA Collaborated with the owner of the business to launch and grow the e-commerce business. Drove product development, merchandising, and rebranding strategies. Managed complex project scopes, budgets, and timelines. Researched customers and competitors and optimized online strategies. \n \n•\tManaged project scope, budget, and timeline for website redesign, worked with engineer and designer to meet project needs and prevent feature creep, resulting in a project delivered on-time and on-budget \n•\tRe-branded the business, including a re-skin of the ecommerce site and collateral materials, resulting in the ability to appeal to the new generation of store buyers and consumers Product Manager Simply Charming 1993  –  2012  (19 years) Torrance, CA Collaborated with the owner of the business to launch and grow the e-commerce business. Drove product development, merchandising, and rebranding strategies. Managed complex project scopes, budgets, and timelines. Researched customers and competitors and optimized online strategies. \n \n•\tManaged project scope, budget, and timeline for website redesign, worked with engineer and designer to meet project needs and prevent feature creep, resulting in a project delivered on-time and on-budget \n•\tRe-branded the business, including a re-skin of the ecommerce site and collateral materials, resulting in the ability to appeal to the new generation of store buyers and consumers Senior Product Designer JDFine & Co February 2006  –  June 2007  (1 year 5 months) Concord, CA Managed development of sportswear, loungewear and sleepwear lines with annual sales of $8M+, increasing sales 10% annually. Repositioned brand in the marketplace by addressing unmet consumer needs, expanding customer base to include desirable new accounts: Macy’s, Bloomingdale’s and fast-fashion retailers. Senior Product Designer JDFine & Co February 2006  –  June 2007  (1 year 5 months) Concord, CA Managed development of sportswear, loungewear and sleepwear lines with annual sales of $8M+, increasing sales 10% annually. Repositioned brand in the marketplace by addressing unmet consumer needs, expanding customer base to include desirable new accounts: Macy’s, Bloomingdale’s and fast-fashion retailers. Business Manager & Buyer Maha Yoga March 2001  –  October 2003  (2 years 8 months) Los Angeles, CA Grew a retail store, within a high-profile yoga studio, through improved buying and merchandising strategies. Drove sales growth, increasing store revenue by 25-50% YoY with an expanded product mix. Managed a staff of 30 and oversaw scheduling, payroll and special event planning. Business Manager & Buyer Maha Yoga March 2001  –  October 2003  (2 years 8 months) Los Angeles, CA Grew a retail store, within a high-profile yoga studio, through improved buying and merchandising strategies. Drove sales growth, increasing store revenue by 25-50% YoY with an expanded product mix. Managed a staff of 30 and oversaw scheduling, payroll and special event planning. Product Manager Hermanns Crystal June 1999  –  March 2001  (1 year 10 months) Huntington Beach, CA Recruited to launch and grow the e-commerce branch of a traditional brick and mortar business. Built and managed the website and developed effective SEO strategies. Merchandised products, led marketing campaigns, and developed online advertising strategies. Improved site navigability and user experience. Product Manager Hermanns Crystal June 1999  –  March 2001  (1 year 10 months) Huntington Beach, CA Recruited to launch and grow the e-commerce branch of a traditional brick and mortar business. Built and managed the website and developed effective SEO strategies. Merchandised products, led marketing campaigns, and developed online advertising strategies. Improved site navigability and user experience. Associate Product Designer Quiksilver, Inc 1997  –  1999  (2 years) Huntington Beach, CA Designed Leilani, Raisins Girls, and Island Soul swimwear and sportswear lines for an iconic, global clothing manufacturer. Developed market research and prototypes, bringing swim styles to market. Developed original print designs and sourced raw materials. Costed designs and built bills of materials. Associate Product Designer Quiksilver, Inc 1997  –  1999  (2 years) Huntington Beach, CA Designed Leilani, Raisins Girls, and Island Soul swimwear and sportswear lines for an iconic, global clothing manufacturer. Developed market research and prototypes, bringing swim styles to market. Developed original print designs and sourced raw materials. Costed designs and built bills of materials. Languages   Skills Product Management E-commerce Project Planning Product Development Marketing Strategy Sales Merchandising Wholesale Retail Entrepreneurship Fashion User Interface Design Start-ups Marketing Brand Management Product Marketing Strategy See 2+     See less Skills  Product Management E-commerce Project Planning Product Development Marketing Strategy Sales Merchandising Wholesale Retail Entrepreneurship Fashion User Interface Design Start-ups Marketing Brand Management Product Marketing Strategy See 2+     See less Product Management E-commerce Project Planning Product Development Marketing Strategy Sales Merchandising Wholesale Retail Entrepreneurship Fashion User Interface Design Start-ups Marketing Brand Management Product Marketing Strategy See 2+     See less Product Management E-commerce Project Planning Product Development Marketing Strategy Sales Merchandising Wholesale Retail Entrepreneurship Fashion User Interface Design Start-ups Marketing Brand Management Product Marketing Strategy See 2+     See less Education University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration Graduation Distinction: Honors Activities and Societies:  Berkeley Women In Business\nYoung Entrepreneurs At Haas University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration Graduation Distinction: Honors Activities and Societies:  Berkeley Women In Business\nYoung Entrepreneurs At Haas University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration Graduation Distinction: Honors Activities and Societies:  Berkeley Women In Business\nYoung Entrepreneurs At Haas University of California, Berkeley - Walter A. Haas School of Business Bachelor of Science,  Business Administration Graduation Distinction: Honors Activities and Societies:  Berkeley Women In Business\nYoung Entrepreneurs At Haas Honors & Awards ", "Languages German German German Skills Product Management Product Development Product Strategy Product Marketing Team Leadership Product Launch Product Life Cycle... Cross-functional Team... iPhone development Product Lifecycle... Telecommunications Marketing iOS development Mobile Devices Strategy Management Program Management Project Management Consulting Business Strategy User Experience See 6+     See less Skills  Product Management Product Development Product Strategy Product Marketing Team Leadership Product Launch Product Life Cycle... Cross-functional Team... iPhone development Product Lifecycle... Telecommunications Marketing iOS development Mobile Devices Strategy Management Program Management Project Management Consulting Business Strategy User Experience See 6+     See less Product Management Product Development Product Strategy Product Marketing Team Leadership Product Launch Product Life Cycle... Cross-functional Team... iPhone development Product Lifecycle... Telecommunications Marketing iOS development Mobile Devices Strategy Management Program Management Project Management Consulting Business Strategy User Experience See 6+     See less Product Management Product Development Product Strategy Product Marketing Team Leadership Product Launch Product Life Cycle... Cross-functional Team... iPhone development Product Lifecycle... Telecommunications Marketing iOS development Mobile Devices Strategy Management Program Management Project Management Consulting Business Strategy User Experience See 6+     See less Honors & Awards ", "Summary I’ve designed websites for some of the world’s biggest brands, created award-winning video games, crafted mobile apps for Android and iOS, and have played a role in 14 different startups. I excel at leading agile teams with a focus on user testing and data driven iteration. I'm equally at home launching new brands, iterating on existing products and managing agile software projects. \n \nIn 2006 I received a Masters Degree from the Entertainment Technology Center at Carnegie Mellon in Pittsburgh. I love working with others who believe in the transformative power of great design. \n \nPast Projects: ↳ http://rosspw.com/work Summary I’ve designed websites for some of the world’s biggest brands, created award-winning video games, crafted mobile apps for Android and iOS, and have played a role in 14 different startups. I excel at leading agile teams with a focus on user testing and data driven iteration. I'm equally at home launching new brands, iterating on existing products and managing agile software projects. \n \nIn 2006 I received a Masters Degree from the Entertainment Technology Center at Carnegie Mellon in Pittsburgh. I love working with others who believe in the transformative power of great design. \n \nPast Projects: ↳ http://rosspw.com/work I’ve designed websites for some of the world’s biggest brands, created award-winning video games, crafted mobile apps for Android and iOS, and have played a role in 14 different startups. I excel at leading agile teams with a focus on user testing and data driven iteration. I'm equally at home launching new brands, iterating on existing products and managing agile software projects. \n \nIn 2006 I received a Masters Degree from the Entertainment Technology Center at Carnegie Mellon in Pittsburgh. I love working with others who believe in the transformative power of great design. \n \nPast Projects: ↳ http://rosspw.com/work I’ve designed websites for some of the world’s biggest brands, created award-winning video games, crafted mobile apps for Android and iOS, and have played a role in 14 different startups. I excel at leading agile teams with a focus on user testing and data driven iteration. I'm equally at home launching new brands, iterating on existing products and managing agile software projects. \n \nIn 2006 I received a Masters Degree from the Entertainment Technology Center at Carnegie Mellon in Pittsburgh. I love working with others who believe in the transformative power of great design. \n \nPast Projects: ↳ http://rosspw.com/work Experience Adjunct Faculty School of Visual Arts January 2015  – Present (8 months) Teaching the basics of digital product and UX design to undergrads. Interaction Designer Google July 2014  – Present (1 year 2 months) Greater New York City Area Part of the new product design team within Google Search. Part design team, part design incubator, we make awesome. Freelance UX/UI Designer RossPW.com November 2011  – Present (3 years 10 months) Working Remote, USA human-centered interface design for new products big and small UX Designer (Contract) Google (Creative Lab) April 2014  –  July 2014  (4 months) Greater New York City Area New product development as part of the Creative Lab. Head of Product, Founding Team Buy With Fetch September 2013  –  March 2014  (7 months) Working Remote, USA BuyWithFetch.com -- Fetch is a personal assistant for buying anything you want, powered by a customer service team. Use the app and just tell us what you need - with a text, photo, or voice memo - and let us take care of the rest. Responsible for leading all product efforts, and taking Fetch from concept to beta. Managed internal and external design and tech resources to simultaneously develop on iOS, Android, web, and Google Glass. UX Design Lead (Contract) Matchbox, Inc. October 2012  –  December 2012  (3 months) Greater Boston Area • Designed web apps suite for college admissions departments, working directly alongside CEO \n• Created wireframes, personas and user scenarios, and conducted user research \n• Prototyped new product features directly with development team \n• Developed product and feature roadmap Co-founder, Head of Product The Tin Fox Company February 2012  –  September 2012  (8 months) Greater New York City Area Tin Fox was an e-commerce platform for craftspeople and designers to promote and sell new products. I was responsible for overall product vision, UX/UI design, and web development. Manager, User Experience SapientNitro September 2011  –  August 2012  (1 year) Greater New York City Area • Responsible for leading design teams of 3-8 contributors staffed with IAs, UX and visual designers. \n• Led digital design efforts for Target.com to improve overal site IA, product findabiluty, and navigation. Senior Interaction Designer, Mobile and Social R/GA September 2009  –  September 2011  (2 years 1 month) Greater New York City Area • UX Lead evangelizing mobile and social design best practices across the agency. \n• Contributed to 65+ projects and pitches for multiple clients including MasterCard, Nike, Nokia, L’Oreal, Chanel, Microsoft and Verizon. \n• Redesigned Nike iOS apps like Nike+ and Boom to increase re-engagement. \n• Led UX on multi-million dollar redesign effort for Nike.com’s e-commerce experiences. Director of User Experience Modernista! June 2008  –  September 2009  (1 year 4 months) Greater New York City Area Modernista! was an ambitious and independent Boston-based agency. \n• Championed digital concepts, acting as an internal change agent to shift from traditional to digital design \n• Built pitches from the ground up, successfully bringing in new digital-focused business, including the first social media strategy and management responsibilities for the agency \n• Led the agency's first digital product design engagement by creating the first-use tutorial experience for the Palm Pre and WebOS Researcher/Author, Customer Experience Forrester Research June 2006  –  June 2008  (2 years 1 month) Greater New York City Area • Speaker, Consultant and Author of client-facing research covering User Experience Design, Young Consumers and Social media, and Digital Brand Strategy. \n• Published some of the most widely-read research reports including the \"Gen Y Design\" report, which made it to #3 in readership across the entire company for two months.  \n• Presented Gen Y and Social Media thinking to client executives at Forrester’s 2007 Consumer Forum. \n• Conducted 50+ heuristic reviews and usability evaluations for clients ranging from major banks to hotels. Game Designer Harmonix Music Systems May 2005  –  June 2006  (1 year 2 months) • Game and Audio Designer on single and multiplayer experiences for Guitar Hero I and Rock Band I. \n• Prototyped new music-driven product concepts for portable game devices and the iPod jog wheel. Co-founder, Product Designer PeaceMaker September 2004  –  May 2005  (9 months) Greater Pittsburgh Area PeaceMaker is an educational video game simulation of the Israeli-Palestinian conflict. Responsible for ideas, POCs, pitching for funding, and making coffee. Adjunct Faculty School of Visual Arts January 2015  – Present (8 months) Teaching the basics of digital product and UX design to undergrads. Adjunct Faculty School of Visual Arts January 2015  – Present (8 months) Teaching the basics of digital product and UX design to undergrads. Interaction Designer Google July 2014  – Present (1 year 2 months) Greater New York City Area Part of the new product design team within Google Search. Part design team, part design incubator, we make awesome. Interaction Designer Google July 2014  – Present (1 year 2 months) Greater New York City Area Part of the new product design team within Google Search. Part design team, part design incubator, we make awesome. Freelance UX/UI Designer RossPW.com November 2011  – Present (3 years 10 months) Working Remote, USA human-centered interface design for new products big and small Freelance UX/UI Designer RossPW.com November 2011  – Present (3 years 10 months) Working Remote, USA human-centered interface design for new products big and small UX Designer (Contract) Google (Creative Lab) April 2014  –  July 2014  (4 months) Greater New York City Area New product development as part of the Creative Lab. UX Designer (Contract) Google (Creative Lab) April 2014  –  July 2014  (4 months) Greater New York City Area New product development as part of the Creative Lab. Head of Product, Founding Team Buy With Fetch September 2013  –  March 2014  (7 months) Working Remote, USA BuyWithFetch.com -- Fetch is a personal assistant for buying anything you want, powered by a customer service team. Use the app and just tell us what you need - with a text, photo, or voice memo - and let us take care of the rest. Responsible for leading all product efforts, and taking Fetch from concept to beta. Managed internal and external design and tech resources to simultaneously develop on iOS, Android, web, and Google Glass. Head of Product, Founding Team Buy With Fetch September 2013  –  March 2014  (7 months) Working Remote, USA BuyWithFetch.com -- Fetch is a personal assistant for buying anything you want, powered by a customer service team. Use the app and just tell us what you need - with a text, photo, or voice memo - and let us take care of the rest. Responsible for leading all product efforts, and taking Fetch from concept to beta. Managed internal and external design and tech resources to simultaneously develop on iOS, Android, web, and Google Glass. UX Design Lead (Contract) Matchbox, Inc. October 2012  –  December 2012  (3 months) Greater Boston Area • Designed web apps suite for college admissions departments, working directly alongside CEO \n• Created wireframes, personas and user scenarios, and conducted user research \n• Prototyped new product features directly with development team \n• Developed product and feature roadmap UX Design Lead (Contract) Matchbox, Inc. October 2012  –  December 2012  (3 months) Greater Boston Area • Designed web apps suite for college admissions departments, working directly alongside CEO \n• Created wireframes, personas and user scenarios, and conducted user research \n• Prototyped new product features directly with development team \n• Developed product and feature roadmap Co-founder, Head of Product The Tin Fox Company February 2012  –  September 2012  (8 months) Greater New York City Area Tin Fox was an e-commerce platform for craftspeople and designers to promote and sell new products. I was responsible for overall product vision, UX/UI design, and web development. Co-founder, Head of Product The Tin Fox Company February 2012  –  September 2012  (8 months) Greater New York City Area Tin Fox was an e-commerce platform for craftspeople and designers to promote and sell new products. I was responsible for overall product vision, UX/UI design, and web development. Manager, User Experience SapientNitro September 2011  –  August 2012  (1 year) Greater New York City Area • Responsible for leading design teams of 3-8 contributors staffed with IAs, UX and visual designers. \n• Led digital design efforts for Target.com to improve overal site IA, product findabiluty, and navigation. Manager, User Experience SapientNitro September 2011  –  August 2012  (1 year) Greater New York City Area • Responsible for leading design teams of 3-8 contributors staffed with IAs, UX and visual designers. \n• Led digital design efforts for Target.com to improve overal site IA, product findabiluty, and navigation. Senior Interaction Designer, Mobile and Social R/GA September 2009  –  September 2011  (2 years 1 month) Greater New York City Area • UX Lead evangelizing mobile and social design best practices across the agency. \n• Contributed to 65+ projects and pitches for multiple clients including MasterCard, Nike, Nokia, L’Oreal, Chanel, Microsoft and Verizon. \n• Redesigned Nike iOS apps like Nike+ and Boom to increase re-engagement. \n• Led UX on multi-million dollar redesign effort for Nike.com’s e-commerce experiences. Senior Interaction Designer, Mobile and Social R/GA September 2009  –  September 2011  (2 years 1 month) Greater New York City Area • UX Lead evangelizing mobile and social design best practices across the agency. \n• Contributed to 65+ projects and pitches for multiple clients including MasterCard, Nike, Nokia, L’Oreal, Chanel, Microsoft and Verizon. \n• Redesigned Nike iOS apps like Nike+ and Boom to increase re-engagement. \n• Led UX on multi-million dollar redesign effort for Nike.com’s e-commerce experiences. Director of User Experience Modernista! June 2008  –  September 2009  (1 year 4 months) Greater New York City Area Modernista! was an ambitious and independent Boston-based agency. \n• Championed digital concepts, acting as an internal change agent to shift from traditional to digital design \n• Built pitches from the ground up, successfully bringing in new digital-focused business, including the first social media strategy and management responsibilities for the agency \n• Led the agency's first digital product design engagement by creating the first-use tutorial experience for the Palm Pre and WebOS Director of User Experience Modernista! June 2008  –  September 2009  (1 year 4 months) Greater New York City Area Modernista! was an ambitious and independent Boston-based agency. \n• Championed digital concepts, acting as an internal change agent to shift from traditional to digital design \n• Built pitches from the ground up, successfully bringing in new digital-focused business, including the first social media strategy and management responsibilities for the agency \n• Led the agency's first digital product design engagement by creating the first-use tutorial experience for the Palm Pre and WebOS Researcher/Author, Customer Experience Forrester Research June 2006  –  June 2008  (2 years 1 month) Greater New York City Area • Speaker, Consultant and Author of client-facing research covering User Experience Design, Young Consumers and Social media, and Digital Brand Strategy. \n• Published some of the most widely-read research reports including the \"Gen Y Design\" report, which made it to #3 in readership across the entire company for two months.  \n• Presented Gen Y and Social Media thinking to client executives at Forrester’s 2007 Consumer Forum. \n• Conducted 50+ heuristic reviews and usability evaluations for clients ranging from major banks to hotels. Researcher/Author, Customer Experience Forrester Research June 2006  –  June 2008  (2 years 1 month) Greater New York City Area • Speaker, Consultant and Author of client-facing research covering User Experience Design, Young Consumers and Social media, and Digital Brand Strategy. \n• Published some of the most widely-read research reports including the \"Gen Y Design\" report, which made it to #3 in readership across the entire company for two months.  \n• Presented Gen Y and Social Media thinking to client executives at Forrester’s 2007 Consumer Forum. \n• Conducted 50+ heuristic reviews and usability evaluations for clients ranging from major banks to hotels. Game Designer Harmonix Music Systems May 2005  –  June 2006  (1 year 2 months) • Game and Audio Designer on single and multiplayer experiences for Guitar Hero I and Rock Band I. \n• Prototyped new music-driven product concepts for portable game devices and the iPod jog wheel. Game Designer Harmonix Music Systems May 2005  –  June 2006  (1 year 2 months) • Game and Audio Designer on single and multiplayer experiences for Guitar Hero I and Rock Band I. \n• Prototyped new music-driven product concepts for portable game devices and the iPod jog wheel. Co-founder, Product Designer PeaceMaker September 2004  –  May 2005  (9 months) Greater Pittsburgh Area PeaceMaker is an educational video game simulation of the Israeli-Palestinian conflict. Responsible for ideas, POCs, pitching for funding, and making coffee. Co-founder, Product Designer PeaceMaker September 2004  –  May 2005  (9 months) Greater Pittsburgh Area PeaceMaker is an educational video game simulation of the Israeli-Palestinian conflict. Responsible for ideas, POCs, pitching for funding, and making coffee. Languages   Skills User Experience Interaction Design Wireframes User Experience Design Experience Design Information Architecture User-centered Design Mobile Applications User Interface Design Visual Design Mobile Design Rapid Prototyping Usability Human Computer... User Scenarios User Interface Contextual Inquiry Card Sorting Information Design CSS Usability Testing Web Development Heuristic Evaluation Agile Methodologies OmniGraffle Paper Prototyping User Research Sketching iOS Design Android Game Design Entertainment Technology Scrum Agile Project Management Product Management Human Centered Design Persona Design Touch & Gesture... Computer Vision Systems Voice User Interface... virtual reality Human Factors Analysis Big Data See 28+     See less Skills  User Experience Interaction Design Wireframes User Experience Design Experience Design Information Architecture User-centered Design Mobile Applications User Interface Design Visual Design Mobile Design Rapid Prototyping Usability Human Computer... User Scenarios User Interface Contextual Inquiry Card Sorting Information Design CSS Usability Testing Web Development Heuristic Evaluation Agile Methodologies OmniGraffle Paper Prototyping User Research Sketching iOS Design Android Game Design Entertainment Technology Scrum Agile Project Management Product Management Human Centered Design Persona Design Touch & Gesture... Computer Vision Systems Voice User Interface... virtual reality Human Factors Analysis Big Data See 28+     See less User Experience Interaction Design Wireframes User Experience Design Experience Design Information Architecture User-centered Design Mobile Applications User Interface Design Visual Design Mobile Design Rapid Prototyping Usability Human Computer... User Scenarios User Interface Contextual Inquiry Card Sorting Information Design CSS Usability Testing Web Development Heuristic Evaluation Agile Methodologies OmniGraffle Paper Prototyping User Research Sketching iOS Design Android Game Design Entertainment Technology Scrum Agile Project Management Product Management Human Centered Design Persona Design Touch & Gesture... Computer Vision Systems Voice User Interface... virtual reality Human Factors Analysis Big Data See 28+     See less User Experience Interaction Design Wireframes User Experience Design Experience Design Information Architecture User-centered Design Mobile Applications User Interface Design Visual Design Mobile Design Rapid Prototyping Usability Human Computer... User Scenarios User Interface Contextual Inquiry Card Sorting Information Design CSS Usability Testing Web Development Heuristic Evaluation Agile Methodologies OmniGraffle Paper Prototyping User Research Sketching iOS Design Android Game Design Entertainment Technology Scrum Agile Project Management Product Management Human Centered Design Persona Design Touch & Gesture... Computer Vision Systems Voice User Interface... virtual reality Human Factors Analysis Big Data See 28+     See less Education Carnegie Mellon University MS (MET),  Entertainment Technology 2004  – 2006 Masters degree in interactive design. Studies in storytelling and narrative, rapid prototyping, project management, and designing for emerging media. New England Conservatory of Music BA,  Computer Music and Composition 1999  – 2003 Activities and Societies:  Minor in Music Education. Focus on composition ,  conducting ,  and computer music. Carnegie Mellon University MS (MET),  Entertainment Technology 2004  – 2006 Masters degree in interactive design. Studies in storytelling and narrative, rapid prototyping, project management, and designing for emerging media. Carnegie Mellon University MS (MET),  Entertainment Technology 2004  – 2006 Masters degree in interactive design. Studies in storytelling and narrative, rapid prototyping, project management, and designing for emerging media. Carnegie Mellon University MS (MET),  Entertainment Technology 2004  – 2006 Masters degree in interactive design. Studies in storytelling and narrative, rapid prototyping, project management, and designing for emerging media. New England Conservatory of Music BA,  Computer Music and Composition 1999  – 2003 Activities and Societies:  Minor in Music Education. Focus on composition ,  conducting ,  and computer music. New England Conservatory of Music BA,  Computer Music and Composition 1999  – 2003 Activities and Societies:  Minor in Music Education. Focus on composition ,  conducting ,  and computer music. New England Conservatory of Music BA,  Computer Music and Composition 1999  – 2003 Activities and Societies:  Minor in Music Education. Focus on composition ,  conducting ,  and computer music. Honors & Awards Additional Honors & Awards * ONE Show Interactive – Bronze – Websites & Microsites /E-commerce (NIKE Gear Up, 2010) \n \n* 2009 Ad Age, Agencies of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Year, R/GA  \n \n* Best Marketing and Strategy Research Report, Q3 2007: Forrester Research (\"Desirable Online Experiences”) \n \n* Best Audio: Game Developer's Choice Awards (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Family Game of the Year (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Outstanding Achievement in Game Design (Guitar Hero) 2006 Additional Honors & Awards * ONE Show Interactive – Bronze – Websites & Microsites /E-commerce (NIKE Gear Up, 2010) \n \n* 2009 Ad Age, Agencies of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Year, R/GA  \n \n* Best Marketing and Strategy Research Report, Q3 2007: Forrester Research (\"Desirable Online Experiences”) \n \n* Best Audio: Game Developer's Choice Awards (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Family Game of the Year (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Outstanding Achievement in Game Design (Guitar Hero) 2006 Additional Honors & Awards * ONE Show Interactive – Bronze – Websites & Microsites /E-commerce (NIKE Gear Up, 2010) \n \n* 2009 Ad Age, Agencies of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Year, R/GA  \n \n* Best Marketing and Strategy Research Report, Q3 2007: Forrester Research (\"Desirable Online Experiences”) \n \n* Best Audio: Game Developer's Choice Awards (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Family Game of the Year (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Outstanding Achievement in Game Design (Guitar Hero) 2006 Additional Honors & Awards * ONE Show Interactive – Bronze – Websites & Microsites /E-commerce (NIKE Gear Up, 2010) \n \n* 2009 Ad Age, Agencies of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Decade, R/GA  \n* 2009 Adweek, Digital Agency of the Year, R/GA  \n \n* Best Marketing and Strategy Research Report, Q3 2007: Forrester Research (\"Desirable Online Experiences”) \n \n* Best Audio: Game Developer's Choice Awards (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Family Game of the Year (Guitar Hero) 2006 \n \n* Academy of Interactive Arts & Sciences, Outstanding Achievement in Game Design (Guitar Hero) 2006 ", "Skills Skills     Honors & Awards ", "Summary Web Portfolio: www.vpgraphicx.com \n \nSpecialties: UI/UX Design  \n \nLead interaction design and architecture direction at all phases of the project life cycle, from the discovery phases to a finish product. \n \nWorking hands-on as well as leading UX meetings/projects and managing junior interaction designers. \n \nCreated workflows, sitemaps and high fidelity prototypes. \n \nConduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes. \n \nSpecialties: Mobile iOs and Responsive Web Summary Web Portfolio: www.vpgraphicx.com \n \nSpecialties: UI/UX Design  \n \nLead interaction design and architecture direction at all phases of the project life cycle, from the discovery phases to a finish product. \n \nWorking hands-on as well as leading UX meetings/projects and managing junior interaction designers. \n \nCreated workflows, sitemaps and high fidelity prototypes. \n \nConduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes. \n \nSpecialties: Mobile iOs and Responsive Web Web Portfolio: www.vpgraphicx.com \n \nSpecialties: UI/UX Design  \n \nLead interaction design and architecture direction at all phases of the project life cycle, from the discovery phases to a finish product. \n \nWorking hands-on as well as leading UX meetings/projects and managing junior interaction designers. \n \nCreated workflows, sitemaps and high fidelity prototypes. \n \nConduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes. \n \nSpecialties: Mobile iOs and Responsive Web Web Portfolio: www.vpgraphicx.com \n \nSpecialties: UI/UX Design  \n \nLead interaction design and architecture direction at all phases of the project life cycle, from the discovery phases to a finish product. \n \nWorking hands-on as well as leading UX meetings/projects and managing junior interaction designers. \n \nCreated workflows, sitemaps and high fidelity prototypes. \n \nConduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes. \n \nSpecialties: Mobile iOs and Responsive Web Experience UI/UX Designer (Contract) Google May 2015  – Present (4 months) Google Shopping Product Listing Apps UI/UX Graduate Instructor (Part Time) Academy of Art University June 2011  – Present (4 years 3 months) San Francisco Bay Area • Lead graduate students on developing ideas for web, mobile and tablet UX/UI designs on best practices and responsive web. \n \n• Write lesson plans, organize activities and agendas to teach MFA graduate students on developing their final thesis for graduation.  \n \n• User experience lessons includes: Infographics, how to represent complex information visually, design sketch exploration, low fidelity wireframes, high fidelity prototypes, writing annotations/specs, sitemaps, workflows, user task scenarios, writing moderator guides for user testing and guiding students to make design decisions based on UX industry best practices. \n \nhttp://www.academyart.edu/ Product Designer (Contract) Comcast Silicon Valley Innovation Center March 2015  –  May 2015  (3 months) Sunnyvale, CA • Wireframing Xfinity 1 enhanced content television platform \n• Produce concepts, sketches, wireframes, user flows and comps \n• Present work to various stakeholders on an ongoing basis \n• Projects: Jurassic World, Food Network, Fast and Furious 7, Music Choice UI/UX Designer (Contract) YouTube October 2014  –  March 2015  (6 months) San Bruno, CA • Designed visual info graphics analytics for web and mobile  \n• Designed search history features for web and mobile \n• Mentor new junior designers & worked on production process recommendations UI/UX Designer (Contract) Google April 2014  –  October 2014  (7 months) Mountain View, CA Ads & Commerce \n \n• Designed interactive mobile template ads for advertisers to easily customize and scale their message to their target audiences \n \n• Designed several engaging interactive display ad formats launching next quarter \n \n• Collaborated with project managers and engineers on new solutions for display ads Senior UI/UX Product Designer (Contract) Samsung February 2014  –  April 2014  (3 months) Palo Alto, CA •\tContributed to visual design and user testing for tablet and Gear 2 wearables  \n•\tUser research on users that wear watches & fitness wearables  \n•\tUser research on meaningful animations/transitions for mobile devices \n•\tContributed to concept on tutorial animation for Android app \n•\tContributed to interaction and visual concepts for Milk music web player \n \nhttp://www.samsung.com/us/showcase/milk/ Senior UI/UX Mobile Designer (Emerging Products) Yahoo! August 2012  –  January 2014  (1 year 6 months) Sunnyvale, CA • Yahoo Time Traveler for iPhone 5 - Optimizing, UI/UX  \n \n• Designing mobile consumer facing user interaction models, workflows and user interfaces \n \n• Helping to define the user model and user interface for new and existing products Developing high level and/or detailed storyboards, create mockups and prototypes to effectively communicate interaction \n \n• Translating usability and field research findings into design improvements \n \n• Collaborating with other Yahoo! product teams to develop cross-product standards both inside of Search and across the Yahoo!  \n \nSoftware: Adobe, HTML, CSS Design. \n \nProject: Yahoo! Time Traveler  \nhttps://itunes.apple.com/us/app/yahoo!-timetraveler/id527349170?mt=8 \n \n★ Featured by Apple in \"On The Town\", \"City Guides\", \"Summer Travel Essentials\", \"Plan Your Vacation\" and \"New & Noteworthy\" (twice)! ★ \n \n★ “With TimeTraveler, I’d have had a much better chance of seeing the best of Amsterdam that fit in my 6-hour slice.” - VentureBeat ★ \n \n★ \"Yahoo TimeTraveler, a free iPhone offering, offers some nifty features of its own - helping users plan their itineraries for trips in 29 major cities around the world.” – Macworld ★ \n \nProject: Yahoo Autos & Travel (responsive web) Lead UI/UX Interaction Designer Wells Fargo Bank September 2010  –  August 2012  (2 years) San Francisco Bay Area • Wholesales and Treasury Applications: Hands on design and lead design directions for the foreign exchange online application, merging Wachovia and Wells Fargo features.  \n \n• Conduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes \n \n• Optimize large scale web platforms to tablet and mobile devices  \n \n• Design data and flexible user interface for tablet and mobile devices \n \n• Collaborate and present with a team of 40 people, which includes the business team, business analysts, engineers, QA and content writers to develop an online application. \n \n• Lead and manage junior/mid level designers work tasks and project direction. \n \n• Facilitate project communication across a multidisciplinary team through all phases and product lifecycle, from initial explorations through final design. \n \n• Collaborate and organize UX team building meetings \n \n• Software: Adobe CS5, Fireworks, HTML, CSS, Javascript Web Prototyper/Designer (UI/UX) Kaiser Permanente June 2009  –  August 2010  (1 year 3 months) Oakland, CA • Create high fidelity prototypes and simulation mockups to communicate with stakeholders and usability testing. \n \n• Consulting on prototyping for best practices & standard guidelines for employees. \n \n• Collaborated and contributed to the design pattern library. \n \n• Collaborate with interaction designers, stakeholders, product managers on stages of product cycle. \n \n• Create wireframes and prototypes using widget-based applications in iRise \n \n• Create consumer templates for prototyping and user testing \n \n• Prototype Projects: Profile & preferences, shipping portlet, parallel production, drug encyclopedia, my medical records, proxy setup, my health plan documents, messaging center \n \n• Software: iRise, Visio, Morae \n \n \nhttps://www.kaiserpermanente.org/ Web/Graphic Designer Consultant (Freelance) VPgraphicx May 2005  –  August 2010  (5 years 4 months) San Francisco Bay Area Client List Contracts: \n \nFoundHealth: http://www.foundhealth.com/ (Sunnyvale, CA) \n•\tCreate Axure mockups that translate service and business processes into user friendly User Interface flows \n•\tDefining look and feel, information flow, navigation structure and style guide \n•\tUser testing evaluation to ensure workflows and user’s experience \n•\tSoftware: Photoshop, InDesign \n \nJuice Beauty: http://www.juicebeauty.com/ (San Rafael, CA) \n•\tDefine e-commerce strategies and functionality for organic beauty solutions website \n•\tTrack and define e-commerce conversion rates in Google Analytics \n•\tDesign user interface, look and feel of the website \n•\tSoftware: Photoshop, InDesign \n \nTaproot Foundation http://www.huckleberryyouth.org (San Francisco, CA) \n•\tProjects: Huckleberry Youth Programs – (UI Designer/Information Architecture) Episcopal Community Services \n•\tDesign branding and advanced user interface website \n•\tSoftware: Photoshop, Illustrator \n \nEssay Admissions: http://www.eliteadmissions.net/ (San Francisco, CA) \n•\tDesigned UI interface \n•\tSoftware: Photoshop \n \nSan Francisco Garden Club http://www.sanfranciscogardenclub.org/ (San Francisco, CA)  \n•\tDesigned graphic monthly newsletter layout for print \n•\tSoftware: Photoshop, InDesign \n \nAustin Oaks Hospital (Austin, TX) \n•\tCreated branding identity \n•\tSoftware: Illustrator \n \nSenior Home Care, Synergy Home Care & Med Tech Services (Orlando, FL) \n•\tCreate information architecture, sitemap \n•\tDesigned user interface and flash banners \n•\tSoftware: Flash, Dreamweaver, Illustrator, Photoshop, InDesign, Omnigraffle \n \nA.C. Lewis YMCA (Baton Rouge, Louisiana) \n•\tCreated design layouts for facility renovation \n•\tSoftware: Illustrator \n \nSouthern University National Alumni (Baton Rouge, LA) \n•\tDesigned university annual alumni booklets \n•\tSoftware: Illustrator, Photoshop, InDesign \n \nBeacon Behavioral Health (Baton Rouge, LA) \n•\tDesigned branding identity \n•\tSoftware: Illustrator Graphic Designer (Contractor) San Francisco Garden Club January 2007  –  November 2009  (2 years 11 months) San Francisco Bay Area Designed graphic newsletter layout for print UI/UX Designer (Volunteer Project) Taproot Foundation January 2009  –  October 2009  (10 months) Design advance user website interface for nonprofit \nhttp://www.huckleberryyouth.org/home.html Production Artist (Part Time) Lightmaker San Francisco February 2008  –  October 2008  (9 months) San Francisco Bay Area • Competitive Analysis, personas, marketing research reports \n \n• Created visual mockup prototypes, information architecture, wireframes, sitemap, workflows, user case scenarios \n \n• Evaluated functionality through usability testing, reporting and analysis \n \n• Poster layouts, create online style guides and branding bible  \n \n• Projects Include: PeLiMe, The StoryChest, Adobe, AdMeld, ATP Tennis \n \n• Software: Flash, Illustrator, Photoshop, InDesign Graphic & Web Designer Synergy Healthcare January 2006  –  January 2007  (1 year 1 month) Designed/Developed corporate identity, screensavers, trade show displays, HR newspaper publication ads, website and other promotional and printed materials. UI/UX Designer (Contract) Google May 2015  – Present (4 months) Google Shopping Product Listing Apps UI/UX Designer (Contract) Google May 2015  – Present (4 months) Google Shopping Product Listing Apps UI/UX Graduate Instructor (Part Time) Academy of Art University June 2011  – Present (4 years 3 months) San Francisco Bay Area • Lead graduate students on developing ideas for web, mobile and tablet UX/UI designs on best practices and responsive web. \n \n• Write lesson plans, organize activities and agendas to teach MFA graduate students on developing their final thesis for graduation.  \n \n• User experience lessons includes: Infographics, how to represent complex information visually, design sketch exploration, low fidelity wireframes, high fidelity prototypes, writing annotations/specs, sitemaps, workflows, user task scenarios, writing moderator guides for user testing and guiding students to make design decisions based on UX industry best practices. \n \nhttp://www.academyart.edu/ UI/UX Graduate Instructor (Part Time) Academy of Art University June 2011  – Present (4 years 3 months) San Francisco Bay Area • Lead graduate students on developing ideas for web, mobile and tablet UX/UI designs on best practices and responsive web. \n \n• Write lesson plans, organize activities and agendas to teach MFA graduate students on developing their final thesis for graduation.  \n \n• User experience lessons includes: Infographics, how to represent complex information visually, design sketch exploration, low fidelity wireframes, high fidelity prototypes, writing annotations/specs, sitemaps, workflows, user task scenarios, writing moderator guides for user testing and guiding students to make design decisions based on UX industry best practices. \n \nhttp://www.academyart.edu/ Product Designer (Contract) Comcast Silicon Valley Innovation Center March 2015  –  May 2015  (3 months) Sunnyvale, CA • Wireframing Xfinity 1 enhanced content television platform \n• Produce concepts, sketches, wireframes, user flows and comps \n• Present work to various stakeholders on an ongoing basis \n• Projects: Jurassic World, Food Network, Fast and Furious 7, Music Choice Product Designer (Contract) Comcast Silicon Valley Innovation Center March 2015  –  May 2015  (3 months) Sunnyvale, CA • Wireframing Xfinity 1 enhanced content television platform \n• Produce concepts, sketches, wireframes, user flows and comps \n• Present work to various stakeholders on an ongoing basis \n• Projects: Jurassic World, Food Network, Fast and Furious 7, Music Choice UI/UX Designer (Contract) YouTube October 2014  –  March 2015  (6 months) San Bruno, CA • Designed visual info graphics analytics for web and mobile  \n• Designed search history features for web and mobile \n• Mentor new junior designers & worked on production process recommendations UI/UX Designer (Contract) YouTube October 2014  –  March 2015  (6 months) San Bruno, CA • Designed visual info graphics analytics for web and mobile  \n• Designed search history features for web and mobile \n• Mentor new junior designers & worked on production process recommendations UI/UX Designer (Contract) Google April 2014  –  October 2014  (7 months) Mountain View, CA Ads & Commerce \n \n• Designed interactive mobile template ads for advertisers to easily customize and scale their message to their target audiences \n \n• Designed several engaging interactive display ad formats launching next quarter \n \n• Collaborated with project managers and engineers on new solutions for display ads UI/UX Designer (Contract) Google April 2014  –  October 2014  (7 months) Mountain View, CA Ads & Commerce \n \n• Designed interactive mobile template ads for advertisers to easily customize and scale their message to their target audiences \n \n• Designed several engaging interactive display ad formats launching next quarter \n \n• Collaborated with project managers and engineers on new solutions for display ads Senior UI/UX Product Designer (Contract) Samsung February 2014  –  April 2014  (3 months) Palo Alto, CA •\tContributed to visual design and user testing for tablet and Gear 2 wearables  \n•\tUser research on users that wear watches & fitness wearables  \n•\tUser research on meaningful animations/transitions for mobile devices \n•\tContributed to concept on tutorial animation for Android app \n•\tContributed to interaction and visual concepts for Milk music web player \n \nhttp://www.samsung.com/us/showcase/milk/ Senior UI/UX Product Designer (Contract) Samsung February 2014  –  April 2014  (3 months) Palo Alto, CA •\tContributed to visual design and user testing for tablet and Gear 2 wearables  \n•\tUser research on users that wear watches & fitness wearables  \n•\tUser research on meaningful animations/transitions for mobile devices \n•\tContributed to concept on tutorial animation for Android app \n•\tContributed to interaction and visual concepts for Milk music web player \n \nhttp://www.samsung.com/us/showcase/milk/ Senior UI/UX Mobile Designer (Emerging Products) Yahoo! August 2012  –  January 2014  (1 year 6 months) Sunnyvale, CA • Yahoo Time Traveler for iPhone 5 - Optimizing, UI/UX  \n \n• Designing mobile consumer facing user interaction models, workflows and user interfaces \n \n• Helping to define the user model and user interface for new and existing products Developing high level and/or detailed storyboards, create mockups and prototypes to effectively communicate interaction \n \n• Translating usability and field research findings into design improvements \n \n• Collaborating with other Yahoo! product teams to develop cross-product standards both inside of Search and across the Yahoo!  \n \nSoftware: Adobe, HTML, CSS Design. \n \nProject: Yahoo! Time Traveler  \nhttps://itunes.apple.com/us/app/yahoo!-timetraveler/id527349170?mt=8 \n \n★ Featured by Apple in \"On The Town\", \"City Guides\", \"Summer Travel Essentials\", \"Plan Your Vacation\" and \"New & Noteworthy\" (twice)! ★ \n \n★ “With TimeTraveler, I’d have had a much better chance of seeing the best of Amsterdam that fit in my 6-hour slice.” - VentureBeat ★ \n \n★ \"Yahoo TimeTraveler, a free iPhone offering, offers some nifty features of its own - helping users plan their itineraries for trips in 29 major cities around the world.” – Macworld ★ \n \nProject: Yahoo Autos & Travel (responsive web) Senior UI/UX Mobile Designer (Emerging Products) Yahoo! August 2012  –  January 2014  (1 year 6 months) Sunnyvale, CA • Yahoo Time Traveler for iPhone 5 - Optimizing, UI/UX  \n \n• Designing mobile consumer facing user interaction models, workflows and user interfaces \n \n• Helping to define the user model and user interface for new and existing products Developing high level and/or detailed storyboards, create mockups and prototypes to effectively communicate interaction \n \n• Translating usability and field research findings into design improvements \n \n• Collaborating with other Yahoo! product teams to develop cross-product standards both inside of Search and across the Yahoo!  \n \nSoftware: Adobe, HTML, CSS Design. \n \nProject: Yahoo! Time Traveler  \nhttps://itunes.apple.com/us/app/yahoo!-timetraveler/id527349170?mt=8 \n \n★ Featured by Apple in \"On The Town\", \"City Guides\", \"Summer Travel Essentials\", \"Plan Your Vacation\" and \"New & Noteworthy\" (twice)! ★ \n \n★ “With TimeTraveler, I’d have had a much better chance of seeing the best of Amsterdam that fit in my 6-hour slice.” - VentureBeat ★ \n \n★ \"Yahoo TimeTraveler, a free iPhone offering, offers some nifty features of its own - helping users plan their itineraries for trips in 29 major cities around the world.” – Macworld ★ \n \nProject: Yahoo Autos & Travel (responsive web) Lead UI/UX Interaction Designer Wells Fargo Bank September 2010  –  August 2012  (2 years) San Francisco Bay Area • Wholesales and Treasury Applications: Hands on design and lead design directions for the foreign exchange online application, merging Wachovia and Wells Fargo features.  \n \n• Conduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes \n \n• Optimize large scale web platforms to tablet and mobile devices  \n \n• Design data and flexible user interface for tablet and mobile devices \n \n• Collaborate and present with a team of 40 people, which includes the business team, business analysts, engineers, QA and content writers to develop an online application. \n \n• Lead and manage junior/mid level designers work tasks and project direction. \n \n• Facilitate project communication across a multidisciplinary team through all phases and product lifecycle, from initial explorations through final design. \n \n• Collaborate and organize UX team building meetings \n \n• Software: Adobe CS5, Fireworks, HTML, CSS, Javascript Lead UI/UX Interaction Designer Wells Fargo Bank September 2010  –  August 2012  (2 years) San Francisco Bay Area • Wholesales and Treasury Applications: Hands on design and lead design directions for the foreign exchange online application, merging Wachovia and Wells Fargo features.  \n \n• Conduct heuristic evaluations and usability testing on low/high fidelity prototypes, card sorting and paper prototypes \n \n• Optimize large scale web platforms to tablet and mobile devices  \n \n• Design data and flexible user interface for tablet and mobile devices \n \n• Collaborate and present with a team of 40 people, which includes the business team, business analysts, engineers, QA and content writers to develop an online application. \n \n• Lead and manage junior/mid level designers work tasks and project direction. \n \n• Facilitate project communication across a multidisciplinary team through all phases and product lifecycle, from initial explorations through final design. \n \n• Collaborate and organize UX team building meetings \n \n• Software: Adobe CS5, Fireworks, HTML, CSS, Javascript Web Prototyper/Designer (UI/UX) Kaiser Permanente June 2009  –  August 2010  (1 year 3 months) Oakland, CA • Create high fidelity prototypes and simulation mockups to communicate with stakeholders and usability testing. \n \n• Consulting on prototyping for best practices & standard guidelines for employees. \n \n• Collaborated and contributed to the design pattern library. \n \n• Collaborate with interaction designers, stakeholders, product managers on stages of product cycle. \n \n• Create wireframes and prototypes using widget-based applications in iRise \n \n• Create consumer templates for prototyping and user testing \n \n• Prototype Projects: Profile & preferences, shipping portlet, parallel production, drug encyclopedia, my medical records, proxy setup, my health plan documents, messaging center \n \n• Software: iRise, Visio, Morae \n \n \nhttps://www.kaiserpermanente.org/ Web Prototyper/Designer (UI/UX) Kaiser Permanente June 2009  –  August 2010  (1 year 3 months) Oakland, CA • Create high fidelity prototypes and simulation mockups to communicate with stakeholders and usability testing. \n \n• Consulting on prototyping for best practices & standard guidelines for employees. \n \n• Collaborated and contributed to the design pattern library. \n \n• Collaborate with interaction designers, stakeholders, product managers on stages of product cycle. \n \n• Create wireframes and prototypes using widget-based applications in iRise \n \n• Create consumer templates for prototyping and user testing \n \n• Prototype Projects: Profile & preferences, shipping portlet, parallel production, drug encyclopedia, my medical records, proxy setup, my health plan documents, messaging center \n \n• Software: iRise, Visio, Morae \n \n \nhttps://www.kaiserpermanente.org/ Web/Graphic Designer Consultant (Freelance) VPgraphicx May 2005  –  August 2010  (5 years 4 months) San Francisco Bay Area Client List Contracts: \n \nFoundHealth: http://www.foundhealth.com/ (Sunnyvale, CA) \n•\tCreate Axure mockups that translate service and business processes into user friendly User Interface flows \n•\tDefining look and feel, information flow, navigation structure and style guide \n•\tUser testing evaluation to ensure workflows and user’s experience \n•\tSoftware: Photoshop, InDesign \n \nJuice Beauty: http://www.juicebeauty.com/ (San Rafael, CA) \n•\tDefine e-commerce strategies and functionality for organic beauty solutions website \n•\tTrack and define e-commerce conversion rates in Google Analytics \n•\tDesign user interface, look and feel of the website \n•\tSoftware: Photoshop, InDesign \n \nTaproot Foundation http://www.huckleberryyouth.org (San Francisco, CA) \n•\tProjects: Huckleberry Youth Programs – (UI Designer/Information Architecture) Episcopal Community Services \n•\tDesign branding and advanced user interface website \n•\tSoftware: Photoshop, Illustrator \n \nEssay Admissions: http://www.eliteadmissions.net/ (San Francisco, CA) \n•\tDesigned UI interface \n•\tSoftware: Photoshop \n \nSan Francisco Garden Club http://www.sanfranciscogardenclub.org/ (San Francisco, CA)  \n•\tDesigned graphic monthly newsletter layout for print \n•\tSoftware: Photoshop, InDesign \n \nAustin Oaks Hospital (Austin, TX) \n•\tCreated branding identity \n•\tSoftware: Illustrator \n \nSenior Home Care, Synergy Home Care & Med Tech Services (Orlando, FL) \n•\tCreate information architecture, sitemap \n•\tDesigned user interface and flash banners \n•\tSoftware: Flash, Dreamweaver, Illustrator, Photoshop, InDesign, Omnigraffle \n \nA.C. Lewis YMCA (Baton Rouge, Louisiana) \n•\tCreated design layouts for facility renovation \n•\tSoftware: Illustrator \n \nSouthern University National Alumni (Baton Rouge, LA) \n•\tDesigned university annual alumni booklets \n•\tSoftware: Illustrator, Photoshop, InDesign \n \nBeacon Behavioral Health (Baton Rouge, LA) \n•\tDesigned branding identity \n•\tSoftware: Illustrator Web/Graphic Designer Consultant (Freelance) VPgraphicx May 2005  –  August 2010  (5 years 4 months) San Francisco Bay Area Client List Contracts: \n \nFoundHealth: http://www.foundhealth.com/ (Sunnyvale, CA) \n•\tCreate Axure mockups that translate service and business processes into user friendly User Interface flows \n•\tDefining look and feel, information flow, navigation structure and style guide \n•\tUser testing evaluation to ensure workflows and user’s experience \n•\tSoftware: Photoshop, InDesign \n \nJuice Beauty: http://www.juicebeauty.com/ (San Rafael, CA) \n•\tDefine e-commerce strategies and functionality for organic beauty solutions website \n•\tTrack and define e-commerce conversion rates in Google Analytics \n•\tDesign user interface, look and feel of the website \n•\tSoftware: Photoshop, InDesign \n \nTaproot Foundation http://www.huckleberryyouth.org (San Francisco, CA) \n•\tProjects: Huckleberry Youth Programs – (UI Designer/Information Architecture) Episcopal Community Services \n•\tDesign branding and advanced user interface website \n•\tSoftware: Photoshop, Illustrator \n \nEssay Admissions: http://www.eliteadmissions.net/ (San Francisco, CA) \n•\tDesigned UI interface \n•\tSoftware: Photoshop \n \nSan Francisco Garden Club http://www.sanfranciscogardenclub.org/ (San Francisco, CA)  \n•\tDesigned graphic monthly newsletter layout for print \n•\tSoftware: Photoshop, InDesign \n \nAustin Oaks Hospital (Austin, TX) \n•\tCreated branding identity \n•\tSoftware: Illustrator \n \nSenior Home Care, Synergy Home Care & Med Tech Services (Orlando, FL) \n•\tCreate information architecture, sitemap \n•\tDesigned user interface and flash banners \n•\tSoftware: Flash, Dreamweaver, Illustrator, Photoshop, InDesign, Omnigraffle \n \nA.C. Lewis YMCA (Baton Rouge, Louisiana) \n•\tCreated design layouts for facility renovation \n•\tSoftware: Illustrator \n \nSouthern University National Alumni (Baton Rouge, LA) \n•\tDesigned university annual alumni booklets \n•\tSoftware: Illustrator, Photoshop, InDesign \n \nBeacon Behavioral Health (Baton Rouge, LA) \n•\tDesigned branding identity \n•\tSoftware: Illustrator Graphic Designer (Contractor) San Francisco Garden Club January 2007  –  November 2009  (2 years 11 months) San Francisco Bay Area Designed graphic newsletter layout for print Graphic Designer (Contractor) San Francisco Garden Club January 2007  –  November 2009  (2 years 11 months) San Francisco Bay Area Designed graphic newsletter layout for print UI/UX Designer (Volunteer Project) Taproot Foundation January 2009  –  October 2009  (10 months) Design advance user website interface for nonprofit \nhttp://www.huckleberryyouth.org/home.html UI/UX Designer (Volunteer Project) Taproot Foundation January 2009  –  October 2009  (10 months) Design advance user website interface for nonprofit \nhttp://www.huckleberryyouth.org/home.html Production Artist (Part Time) Lightmaker San Francisco February 2008  –  October 2008  (9 months) San Francisco Bay Area • Competitive Analysis, personas, marketing research reports \n \n• Created visual mockup prototypes, information architecture, wireframes, sitemap, workflows, user case scenarios \n \n• Evaluated functionality through usability testing, reporting and analysis \n \n• Poster layouts, create online style guides and branding bible  \n \n• Projects Include: PeLiMe, The StoryChest, Adobe, AdMeld, ATP Tennis \n \n• Software: Flash, Illustrator, Photoshop, InDesign Production Artist (Part Time) Lightmaker San Francisco February 2008  –  October 2008  (9 months) San Francisco Bay Area • Competitive Analysis, personas, marketing research reports \n \n• Created visual mockup prototypes, information architecture, wireframes, sitemap, workflows, user case scenarios \n \n• Evaluated functionality through usability testing, reporting and analysis \n \n• Poster layouts, create online style guides and branding bible  \n \n• Projects Include: PeLiMe, The StoryChest, Adobe, AdMeld, ATP Tennis \n \n• Software: Flash, Illustrator, Photoshop, InDesign Graphic & Web Designer Synergy Healthcare January 2006  –  January 2007  (1 year 1 month) Designed/Developed corporate identity, screensavers, trade show displays, HR newspaper publication ads, website and other promotional and printed materials. Graphic & Web Designer Synergy Healthcare January 2006  –  January 2007  (1 year 1 month) Designed/Developed corporate identity, screensavers, trade show displays, HR newspaper publication ads, website and other promotional and printed materials. Skills Wireframes OmniGraffle Adobe Fireworks Dreamweaver Flash Illustrator InDesign ActionScript CSS QuarkXPress Keynote HTML Photoshop Visio XML User Experience User Interface Design Web Design Interaction Design Information Architecture User-centered Design User Interface Adobe Creative Suite User Experience Design Usability Testing Creative Direction Web Development Usability Heuristic Evaluation E-commerce Graphic Design See 16+     See less Skills  Wireframes OmniGraffle Adobe Fireworks Dreamweaver Flash Illustrator InDesign ActionScript CSS QuarkXPress Keynote HTML Photoshop Visio XML User Experience User Interface Design Web Design Interaction Design Information Architecture User-centered Design User Interface Adobe Creative Suite User Experience Design Usability Testing Creative Direction Web Development Usability Heuristic Evaluation E-commerce Graphic Design See 16+     See less Wireframes OmniGraffle Adobe Fireworks Dreamweaver Flash Illustrator InDesign ActionScript CSS QuarkXPress Keynote HTML Photoshop Visio XML User Experience User Interface Design Web Design Interaction Design Information Architecture User-centered Design User Interface Adobe Creative Suite User Experience Design Usability Testing Creative Direction Web Development Usability Heuristic Evaluation E-commerce Graphic Design See 16+     See less Wireframes OmniGraffle Adobe Fireworks Dreamweaver Flash Illustrator InDesign ActionScript CSS QuarkXPress Keynote HTML Photoshop Visio XML User Experience User Interface Design Web Design Interaction Design Information Architecture User-centered Design User Interface Adobe Creative Suite User Experience Design Usability Testing Creative Direction Web Development Usability Heuristic Evaluation E-commerce Graphic Design See 16+     See less Education UC Berkeley Extension Course,  Cognitive Tools for Interaction Design 2010  – 2010 Course topics include user-centered design, mental models, object-action interaction models, information architecture, user personas, designing for errors, and usability. Academy of Art University MFA,  Web Design and New Media , 3.7 2006  – 2008 http://www.academyart.edu/ Louisiana State University BFA,  Studio Art ,  Graphic Design 2001  – 2006 Fielding Graduate University UC Berkeley Extension Course,  Cognitive Tools for Interaction Design 2010  – 2010 Course topics include user-centered design, mental models, object-action interaction models, information architecture, user personas, designing for errors, and usability. UC Berkeley Extension Course,  Cognitive Tools for Interaction Design 2010  – 2010 Course topics include user-centered design, mental models, object-action interaction models, information architecture, user personas, designing for errors, and usability. UC Berkeley Extension Course,  Cognitive Tools for Interaction Design 2010  – 2010 Course topics include user-centered design, mental models, object-action interaction models, information architecture, user personas, designing for errors, and usability. Academy of Art University MFA,  Web Design and New Media , 3.7 2006  – 2008 http://www.academyart.edu/ Academy of Art University MFA,  Web Design and New Media , 3.7 2006  – 2008 http://www.academyart.edu/ Academy of Art University MFA,  Web Design and New Media , 3.7 2006  – 2008 http://www.academyart.edu/ Louisiana State University BFA,  Studio Art ,  Graphic Design 2001  – 2006 Louisiana State University BFA,  Studio Art ,  Graphic Design 2001  – 2006 Louisiana State University BFA,  Studio Art ,  Graphic Design 2001  – 2006 Fielding Graduate University Fielding Graduate University Fielding Graduate University Honors & Awards ", "Summary Hi, I'm Marty Moore. Currently, I'm a design manager & product design lead at Google. \n \nI led the UX of Google Wallet for the launches of person-to-person payments from Google, the Google Wallet debit card, and multiple iOS and Android Wallet app releases. I love leading design teams to build products that solve people’s problems and hopefully make them happier.  \n \nSpecialties:  \nUX design for mobile, Information Architecture, Storyboarding, Prototyping, User research & testing  Summary Hi, I'm Marty Moore. Currently, I'm a design manager & product design lead at Google. \n \nI led the UX of Google Wallet for the launches of person-to-person payments from Google, the Google Wallet debit card, and multiple iOS and Android Wallet app releases. I love leading design teams to build products that solve people’s problems and hopefully make them happier.  \n \nSpecialties:  \nUX design for mobile, Information Architecture, Storyboarding, Prototyping, User research & testing  Hi, I'm Marty Moore. Currently, I'm a design manager & product design lead at Google. \n \nI led the UX of Google Wallet for the launches of person-to-person payments from Google, the Google Wallet debit card, and multiple iOS and Android Wallet app releases. I love leading design teams to build products that solve people’s problems and hopefully make them happier.  \n \nSpecialties:  \nUX design for mobile, Information Architecture, Storyboarding, Prototyping, User research & testing  Hi, I'm Marty Moore. Currently, I'm a design manager & product design lead at Google. \n \nI led the UX of Google Wallet for the launches of person-to-person payments from Google, the Google Wallet debit card, and multiple iOS and Android Wallet app releases. I love leading design teams to build products that solve people’s problems and hopefully make them happier.  \n \nSpecialties:  \nUX design for mobile, Information Architecture, Storyboarding, Prototyping, User research & testing  Experience Design Lead - Google Sheets Google April 2015  – Present (5 months) Greater New York City Area Making spreadsheets awesome for mobile devices. Design Lead - Google Wallet Google September 2013  –  March 2015  (1 year 7 months) Greater New York City Area Led UX team across multiple sites to launch multiple updated Google Wallet apps for Android and iOS & launch the Google Wallet debit card experience. Senior Designer - Google Wallet Google November 2011  –  August 2013  (1 year 10 months) Greater New York City Area Design lead for Google's first person-to-person payment system (pay by gmail). Redesigned wallet.google.com to be a responsive web solution. Design Lead, Mobile Collaboration Team IBM February 2011  –  November 2011  (10 months) New York, NY Currently leading the design team that is making mobile web and native apps for IBM's collaborative tools. Design Lead, Project Vulcan IBM September 2009  –  January 2011  (1 year 5 months) New York, NY Designed and implemented a series of interactive prototypes demonstrating an integrated UI for IBM's collaboration software. Published an internal series of design principles and patterns. This work was introduced at IBM's Lotusphere conference in 2010 as IBM Project Vulcan. Senior Product Designer, IBM Connections IBM July 2006  –  September 2009  (3 years 3 months) Westford, MA Led all aspects of user experience for key parts of IBM's first social software offering, IBM Connections. Performed user research, created early vision stories and defined product requirements while collaborating with project management and development. Personally created numerous design patterns that are now collected as company-wide design guidelines called Lotus OneUI. Project resulted in the most successful new software product introduction in IBM's history. Senior Product Designer, Lotus Notes Redesign IBM January 2006  –  June 2006  (6 months) Westford, MA Led a small team dedicated to radically updating the Lotus Notes e-mail client interface. Transformed the aging client into a streamlined, contemporary mail client, greatly reducing the number of unnecessary features in favor of providing a better user experience. Product Designer, Lotus Workplace IBM October 2002  –  January 2006  (3 years 4 months) Westford, MA Designed the user experience for 3 major releases of Lotus Workplace, a collaboration suite that combines web-based team rooms, instant messaging, and web conferencing. Performed usability studies, developed design specifications, and directed a global development team in Cambridge, Israel, and China. Product Designer, IBM Data Backup & Recovery IBM January 2001  –  October 2002  (1 year 10 months) San Jose, CA Designed a simplified interface for enterprise administrators and line of business workers to perform backup and recovery. Conducted numerous interviews with workers in many different roles to define product requirements. Visual Designer IBM Tivoli Software January 1999  –  January 2001  (2 years 1 month) Raleigh-Durham, NC Developed Tivoli's first cross-product interface guidelines, enabling administrators to easily switch between different tools without having to retrain or learn a new set of interaction patterns. Design Intern IBM United Kingdom Ltd January 1998  –  December 1999  (2 years) Designed and implemented a variety of internal web sites and conducted a series of international customer feedback sessions. Design Lead - Google Sheets Google April 2015  – Present (5 months) Greater New York City Area Making spreadsheets awesome for mobile devices. Design Lead - Google Sheets Google April 2015  – Present (5 months) Greater New York City Area Making spreadsheets awesome for mobile devices. Design Lead - Google Wallet Google September 2013  –  March 2015  (1 year 7 months) Greater New York City Area Led UX team across multiple sites to launch multiple updated Google Wallet apps for Android and iOS & launch the Google Wallet debit card experience. Design Lead - Google Wallet Google September 2013  –  March 2015  (1 year 7 months) Greater New York City Area Led UX team across multiple sites to launch multiple updated Google Wallet apps for Android and iOS & launch the Google Wallet debit card experience. Senior Designer - Google Wallet Google November 2011  –  August 2013  (1 year 10 months) Greater New York City Area Design lead for Google's first person-to-person payment system (pay by gmail). Redesigned wallet.google.com to be a responsive web solution. Senior Designer - Google Wallet Google November 2011  –  August 2013  (1 year 10 months) Greater New York City Area Design lead for Google's first person-to-person payment system (pay by gmail). Redesigned wallet.google.com to be a responsive web solution. Design Lead, Mobile Collaboration Team IBM February 2011  –  November 2011  (10 months) New York, NY Currently leading the design team that is making mobile web and native apps for IBM's collaborative tools. Design Lead, Mobile Collaboration Team IBM February 2011  –  November 2011  (10 months) New York, NY Currently leading the design team that is making mobile web and native apps for IBM's collaborative tools. Design Lead, Project Vulcan IBM September 2009  –  January 2011  (1 year 5 months) New York, NY Designed and implemented a series of interactive prototypes demonstrating an integrated UI for IBM's collaboration software. Published an internal series of design principles and patterns. This work was introduced at IBM's Lotusphere conference in 2010 as IBM Project Vulcan. Design Lead, Project Vulcan IBM September 2009  –  January 2011  (1 year 5 months) New York, NY Designed and implemented a series of interactive prototypes demonstrating an integrated UI for IBM's collaboration software. Published an internal series of design principles and patterns. This work was introduced at IBM's Lotusphere conference in 2010 as IBM Project Vulcan. Senior Product Designer, IBM Connections IBM July 2006  –  September 2009  (3 years 3 months) Westford, MA Led all aspects of user experience for key parts of IBM's first social software offering, IBM Connections. Performed user research, created early vision stories and defined product requirements while collaborating with project management and development. Personally created numerous design patterns that are now collected as company-wide design guidelines called Lotus OneUI. Project resulted in the most successful new software product introduction in IBM's history. Senior Product Designer, IBM Connections IBM July 2006  –  September 2009  (3 years 3 months) Westford, MA Led all aspects of user experience for key parts of IBM's first social software offering, IBM Connections. Performed user research, created early vision stories and defined product requirements while collaborating with project management and development. Personally created numerous design patterns that are now collected as company-wide design guidelines called Lotus OneUI. Project resulted in the most successful new software product introduction in IBM's history. Senior Product Designer, Lotus Notes Redesign IBM January 2006  –  June 2006  (6 months) Westford, MA Led a small team dedicated to radically updating the Lotus Notes e-mail client interface. Transformed the aging client into a streamlined, contemporary mail client, greatly reducing the number of unnecessary features in favor of providing a better user experience. Senior Product Designer, Lotus Notes Redesign IBM January 2006  –  June 2006  (6 months) Westford, MA Led a small team dedicated to radically updating the Lotus Notes e-mail client interface. Transformed the aging client into a streamlined, contemporary mail client, greatly reducing the number of unnecessary features in favor of providing a better user experience. Product Designer, Lotus Workplace IBM October 2002  –  January 2006  (3 years 4 months) Westford, MA Designed the user experience for 3 major releases of Lotus Workplace, a collaboration suite that combines web-based team rooms, instant messaging, and web conferencing. Performed usability studies, developed design specifications, and directed a global development team in Cambridge, Israel, and China. Product Designer, Lotus Workplace IBM October 2002  –  January 2006  (3 years 4 months) Westford, MA Designed the user experience for 3 major releases of Lotus Workplace, a collaboration suite that combines web-based team rooms, instant messaging, and web conferencing. Performed usability studies, developed design specifications, and directed a global development team in Cambridge, Israel, and China. Product Designer, IBM Data Backup & Recovery IBM January 2001  –  October 2002  (1 year 10 months) San Jose, CA Designed a simplified interface for enterprise administrators and line of business workers to perform backup and recovery. Conducted numerous interviews with workers in many different roles to define product requirements. Product Designer, IBM Data Backup & Recovery IBM January 2001  –  October 2002  (1 year 10 months) San Jose, CA Designed a simplified interface for enterprise administrators and line of business workers to perform backup and recovery. Conducted numerous interviews with workers in many different roles to define product requirements. Visual Designer IBM Tivoli Software January 1999  –  January 2001  (2 years 1 month) Raleigh-Durham, NC Developed Tivoli's first cross-product interface guidelines, enabling administrators to easily switch between different tools without having to retrain or learn a new set of interaction patterns. Visual Designer IBM Tivoli Software January 1999  –  January 2001  (2 years 1 month) Raleigh-Durham, NC Developed Tivoli's first cross-product interface guidelines, enabling administrators to easily switch between different tools without having to retrain or learn a new set of interaction patterns. Design Intern IBM United Kingdom Ltd January 1998  –  December 1999  (2 years) Designed and implemented a variety of internal web sites and conducted a series of international customer feedback sessions. Design Intern IBM United Kingdom Ltd January 1998  –  December 1999  (2 years) Designed and implemented a variety of internal web sites and conducted a series of international customer feedback sessions. Education North Carolina State University Bachelor's Degree,  Graphic Design 1993  – 1997 North Carolina State University Bachelor's Degree,  Graphic Design 1993  – 1997 North Carolina State University Bachelor's Degree,  Graphic Design 1993  – 1997 North Carolina State University Bachelor's Degree,  Graphic Design 1993  – 1997 ", "Skills User Research Contextual Inquiry User-centered Design Usability Testing Human Computer... User Experience Design Information Architecture User Interface Skills  User Research Contextual Inquiry User-centered Design Usability Testing Human Computer... User Experience Design Information Architecture User Interface User Research Contextual Inquiry User-centered Design Usability Testing Human Computer... User Experience Design Information Architecture User Interface User Research Contextual Inquiry User-centered Design Usability Testing Human Computer... User Experience Design Information Architecture User Interface ", "Experience Software Engineer, Safe Browsing Google September 2014  – Present (1 year) Mountain View, CA Anti-Abuse Engineer, Product Quality Operations Google June 2013  –  September 2014  (1 year 4 months) Mountain View, CA Search Quality Analyst, Product Quality Operations Google August 2011  –  May 2013  (1 year 10 months) Mountain View, CA Summer Researcher, Quantitative Web Search University of Michigan College of Engineering May 2011  –  July 2011  (3 months) Ann Arbor, MI Intern - REWS Google June 2010  –  August 2010  (3 months) Mountain View, CA Web Development/Production Intern Intersect May 2009  –  August 2009  (4 months) Ann Arbor, MI Lead Product Designer Project Freestyle 2008  –  2009  (1 year) Ann Arbor, MI Software Engineer, Safe Browsing Google September 2014  – Present (1 year) Mountain View, CA Software Engineer, Safe Browsing Google September 2014  – Present (1 year) Mountain View, CA Anti-Abuse Engineer, Product Quality Operations Google June 2013  –  September 2014  (1 year 4 months) Mountain View, CA Anti-Abuse Engineer, Product Quality Operations Google June 2013  –  September 2014  (1 year 4 months) Mountain View, CA Search Quality Analyst, Product Quality Operations Google August 2011  –  May 2013  (1 year 10 months) Mountain View, CA Search Quality Analyst, Product Quality Operations Google August 2011  –  May 2013  (1 year 10 months) Mountain View, CA Summer Researcher, Quantitative Web Search University of Michigan College of Engineering May 2011  –  July 2011  (3 months) Ann Arbor, MI Summer Researcher, Quantitative Web Search University of Michigan College of Engineering May 2011  –  July 2011  (3 months) Ann Arbor, MI Intern - REWS Google June 2010  –  August 2010  (3 months) Mountain View, CA Intern - REWS Google June 2010  –  August 2010  (3 months) Mountain View, CA Web Development/Production Intern Intersect May 2009  –  August 2009  (4 months) Ann Arbor, MI Web Development/Production Intern Intersect May 2009  –  August 2009  (4 months) Ann Arbor, MI Lead Product Designer Project Freestyle 2008  –  2009  (1 year) Ann Arbor, MI Lead Product Designer Project Freestyle 2008  –  2009  (1 year) Ann Arbor, MI Languages German German German Skills Skills     Education University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration With High Distinction,  Computer Science Minor 2007  – 2011 Livonia Stevenson High School 2003  – 2007 Activities and Societies:  Varsity Soccer University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration With High Distinction,  Computer Science Minor 2007  – 2011 University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration With High Distinction,  Computer Science Minor 2007  – 2011 University of Michigan - Stephen M. Ross School of Business Bachelor of Business Administration With High Distinction,  Computer Science Minor 2007  – 2011 Livonia Stevenson High School 2003  – 2007 Activities and Societies:  Varsity Soccer Livonia Stevenson High School 2003  – 2007 Activities and Societies:  Varsity Soccer Livonia Stevenson High School 2003  – 2007 Activities and Societies:  Varsity Soccer ", "Experience Staff User Experience Designer Google September 2010  – Present (5 years) Sr. Interaction Designer Yahoo! June 2009  –  August 2010  (1 year 3 months) User Experience Consultant Self Employed November 2007  –  May 2009  (1 year 7 months) User Experience Designer Google January 2006  –  October 2007  (1 year 10 months) Co-Founder & Chief Creative Officer Phatbits October 2004  –  December 2005  (1 year 3 months) Product Designer, UX Program Manager Microsoft January 2002  –  September 2004  (2 years 9 months) User Interface Designer I-Media November 1996  –  August 1998  (1 year 10 months) Marketing Manager Samsung Entertainment 1996  –  1996  (less than a year) Staff User Experience Designer Google September 2010  – Present (5 years) Staff User Experience Designer Google September 2010  – Present (5 years) Sr. Interaction Designer Yahoo! June 2009  –  August 2010  (1 year 3 months) Sr. Interaction Designer Yahoo! June 2009  –  August 2010  (1 year 3 months) User Experience Consultant Self Employed November 2007  –  May 2009  (1 year 7 months) User Experience Consultant Self Employed November 2007  –  May 2009  (1 year 7 months) User Experience Designer Google January 2006  –  October 2007  (1 year 10 months) User Experience Designer Google January 2006  –  October 2007  (1 year 10 months) Co-Founder & Chief Creative Officer Phatbits October 2004  –  December 2005  (1 year 3 months) Co-Founder & Chief Creative Officer Phatbits October 2004  –  December 2005  (1 year 3 months) Product Designer, UX Program Manager Microsoft January 2002  –  September 2004  (2 years 9 months) Product Designer, UX Program Manager Microsoft January 2002  –  September 2004  (2 years 9 months) User Interface Designer I-Media November 1996  –  August 1998  (1 year 10 months) User Interface Designer I-Media November 1996  –  August 1998  (1 year 10 months) Marketing Manager Samsung Entertainment 1996  –  1996  (less than a year) Marketing Manager Samsung Entertainment 1996  –  1996  (less than a year) Skills Skills     Honors & Awards ", "Summary Passionate about designing and launching amazing consumer-facing user experiences. A decade of experience generating new product and service ideas, and leading teams to build them. Summary Passionate about designing and launching amazing consumer-facing user experiences. A decade of experience generating new product and service ideas, and leading teams to build them. Passionate about designing and launching amazing consumer-facing user experiences. A decade of experience generating new product and service ideas, and leading teams to build them. Passionate about designing and launching amazing consumer-facing user experiences. A decade of experience generating new product and service ideas, and leading teams to build them. Experience Product Manager on Inbox Google February 2013  – Present (2 years 7 months) Mountain View, ca - Key member of the initial launch team for Inbox, Gmail’s new email app, which launched in Oct 2014 on iOS, Android and web. \n- Launched Bundles, Inbox’s unification of some of the most beloved Gmail features: Labels, Filters, Categories & Priority Inbox. \n- Launched Inbox’s mail triage features - Snooze, Pin, & Done. \n Product Manager on Gmail Google July 2011  –  January 2013  (1 year 7 months) Mountain View, CA - Launched the ability to attach money to an email.  \n- Launched the ability to attach Google Drive files to emails, with automatic permission fixing on Send.  \n- Launched a completely redesigned compose & reply experience, the most prominent new Gmail feature in 2012, and migrated all Gmail users over to it. \n Senior Product Designer & Design Team Lead IDEO June 2006  –  June 2011  (5 years 1 month) Pala Alto, CA - Directed design engagements for Fortune 500 clients in wide variety of industries, with combined budgets of ~$1.5 million \n- Led design teams to generate and prototype new products and services such as: \n* a new suite of intelligence analysis tools for a US intelligence agency \n* the web services offering of a prominent HR outsourcing firm \n* a family of mobile devices for a global consumer electronics company \n Product Designer IDEO June 2003  –  June 2006  (3 years 1 month) - Led design and prototyping on multiple projects in the consumer electronics, healthcare and consumer packaged goods industries Product Manager on Inbox Google February 2013  – Present (2 years 7 months) Mountain View, ca - Key member of the initial launch team for Inbox, Gmail’s new email app, which launched in Oct 2014 on iOS, Android and web. \n- Launched Bundles, Inbox’s unification of some of the most beloved Gmail features: Labels, Filters, Categories & Priority Inbox. \n- Launched Inbox’s mail triage features - Snooze, Pin, & Done. \n Product Manager on Inbox Google February 2013  – Present (2 years 7 months) Mountain View, ca - Key member of the initial launch team for Inbox, Gmail’s new email app, which launched in Oct 2014 on iOS, Android and web. \n- Launched Bundles, Inbox’s unification of some of the most beloved Gmail features: Labels, Filters, Categories & Priority Inbox. \n- Launched Inbox’s mail triage features - Snooze, Pin, & Done. \n Product Manager on Gmail Google July 2011  –  January 2013  (1 year 7 months) Mountain View, CA - Launched the ability to attach money to an email.  \n- Launched the ability to attach Google Drive files to emails, with automatic permission fixing on Send.  \n- Launched a completely redesigned compose & reply experience, the most prominent new Gmail feature in 2012, and migrated all Gmail users over to it. \n Product Manager on Gmail Google July 2011  –  January 2013  (1 year 7 months) Mountain View, CA - Launched the ability to attach money to an email.  \n- Launched the ability to attach Google Drive files to emails, with automatic permission fixing on Send.  \n- Launched a completely redesigned compose & reply experience, the most prominent new Gmail feature in 2012, and migrated all Gmail users over to it. \n Senior Product Designer & Design Team Lead IDEO June 2006  –  June 2011  (5 years 1 month) Pala Alto, CA - Directed design engagements for Fortune 500 clients in wide variety of industries, with combined budgets of ~$1.5 million \n- Led design teams to generate and prototype new products and services such as: \n* a new suite of intelligence analysis tools for a US intelligence agency \n* the web services offering of a prominent HR outsourcing firm \n* a family of mobile devices for a global consumer electronics company \n Senior Product Designer & Design Team Lead IDEO June 2006  –  June 2011  (5 years 1 month) Pala Alto, CA - Directed design engagements for Fortune 500 clients in wide variety of industries, with combined budgets of ~$1.5 million \n- Led design teams to generate and prototype new products and services such as: \n* a new suite of intelligence analysis tools for a US intelligence agency \n* the web services offering of a prominent HR outsourcing firm \n* a family of mobile devices for a global consumer electronics company \n Product Designer IDEO June 2003  –  June 2006  (3 years 1 month) - Led design and prototyping on multiple projects in the consumer electronics, healthcare and consumer packaged goods industries Product Designer IDEO June 2003  –  June 2006  (3 years 1 month) - Led design and prototyping on multiple projects in the consumer electronics, healthcare and consumer packaged goods industries Languages English English English Skills Product Management User Experience Design Product Design User Research Rapid Prototyping User-centered Design Design Strategy Design Thinking User Interface Human Computer... Mobile Devices User Experience Product Innovation Entrepreneurship User Interface Design Interaction Design Leadership Experience Design Service Design Usability Testing Mobile Applications Industrial Design See 7+     See less Skills  Product Management User Experience Design Product Design User Research Rapid Prototyping User-centered Design Design Strategy Design Thinking User Interface Human Computer... Mobile Devices User Experience Product Innovation Entrepreneurship User Interface Design Interaction Design Leadership Experience Design Service Design Usability Testing Mobile Applications Industrial Design See 7+     See less Product Management User Experience Design Product Design User Research Rapid Prototyping User-centered Design Design Strategy Design Thinking User Interface Human Computer... Mobile Devices User Experience Product Innovation Entrepreneurship User Interface Design Interaction Design Leadership Experience Design Service Design Usability Testing Mobile Applications Industrial Design See 7+     See less Product Management User Experience Design Product Design User Research Rapid Prototyping User-centered Design Design Strategy Design Thinking User Interface Human Computer... Mobile Devices User Experience Product Innovation Entrepreneurship User Interface Design Interaction Design Leadership Experience Design Service Design Usability Testing Mobile Applications Industrial Design See 7+     See less Education Stanford University MS,  Management Science & Engineering 2001  – 2004 - Interdisciplinary focus on Innovation, Management and Entrepreneurship \n- Awarded School of Engineering Fellowship Stanford University MS,  Mechanical Engineering 2001  – 2004 - Focused on New Product Design and Development University of Utah BS, magna cum laude,  Mechanical Engineering ,  Minor in Computer Science 1997  – 2001 - Awarded 10 scholarships from university & professional societies Stanford University MS,  Management Science & Engineering 2001  – 2004 - Interdisciplinary focus on Innovation, Management and Entrepreneurship \n- Awarded School of Engineering Fellowship Stanford University MS,  Management Science & Engineering 2001  – 2004 - Interdisciplinary focus on Innovation, Management and Entrepreneurship \n- Awarded School of Engineering Fellowship Stanford University MS,  Management Science & Engineering 2001  – 2004 - Interdisciplinary focus on Innovation, Management and Entrepreneurship \n- Awarded School of Engineering Fellowship Stanford University MS,  Mechanical Engineering 2001  – 2004 - Focused on New Product Design and Development Stanford University MS,  Mechanical Engineering 2001  – 2004 - Focused on New Product Design and Development Stanford University MS,  Mechanical Engineering 2001  – 2004 - Focused on New Product Design and Development University of Utah BS, magna cum laude,  Mechanical Engineering ,  Minor in Computer Science 1997  – 2001 - Awarded 10 scholarships from university & professional societies University of Utah BS, magna cum laude,  Mechanical Engineering ,  Minor in Computer Science 1997  – 2001 - Awarded 10 scholarships from university & professional societies University of Utah BS, magna cum laude,  Mechanical Engineering ,  Minor in Computer Science 1997  – 2001 - Awarded 10 scholarships from university & professional societies ", "Summary I build and brand digital products. I specialize in projects that involve data visualization. \nMy portfolio: http://www.mikemake.com Summary I build and brand digital products. I specialize in projects that involve data visualization. \nMy portfolio: http://www.mikemake.com I build and brand digital products. I specialize in projects that involve data visualization. \nMy portfolio: http://www.mikemake.com I build and brand digital products. I specialize in projects that involve data visualization. \nMy portfolio: http://www.mikemake.com Experience Product Designer Splice.com December 2014  – Present (9 months) New York, NY Design Director Mike Deal Design May 2009  – Present (6 years 4 months) Some highlights: \n \n• Designed visual identity for Pinterest, the ~20th most trafficked site on earth. Awarded HOW Magazine’s Best Logotype of 2011, and a Type Directors Club Certification of Excellence \n \n• Redesigned the Billboard charts system, guiding client to update text-based tables to include photo content, while simplifying information architecture. \n \n• Consulted at Bloomberg Businessweek, directing the research and design of editorial graphics across a special retrospective issue on the financial crisis. \n \n• Invented for Umbro a repurposable system for visualizing soccer matches, which spread as their highest trafficked blog post yet \n \n• Invented a graphic notation system for whale song, covered in the New York Times. \n \n• Designed and illustrated \"Pollen\", 132-page magazine Co-Founder, Chief Designer Scorecast August 2014  – Present (1 year 1 month) Co-founded with Dan Chaparian and Geoff Beck \n \n• Designed and developed data product that uses predictive algorithms to project outcomes of sports games and recommend players for daily fantasy lineups. Co-Founder, Chief Designer Statlas April 2014  – Present (1 year 5 months) Co-founded with Dan Chaparian and Geoff Beck \n \n• Launched sports news platform bringing fans real-time infographic game reports \n• Designed system to convert baseball game data into visual box scores, highlighting top plays of every game, every day. \n• Contextualized game graphics with crowd-sourced annotations and algorithmically generated textual explanations \n• Presented product at Y-Combinator in April 2014 \n \n“The prettiest MLB box scores you can find” -Deadspin \n\"Statlas's ultimate feat is that it reveals the supple statistical beauty that orchestrates every baseball game, all through the power of design\" -Fast Company Freelance Product Designer Google Creative Lab November 2011  –  November 2012  (1 year 1 month) New York, NY • Collaborated with product teams to invent features for Chrome and Search \n• Worked on small team to develop brand for Project Loon (Google’s network of internet balloons) \n• Designed visual analytics for Google users’ personal data \n• Developed design concepts for algorithmic YouTube music videos \n• Conceived Google-branded campaigns and projects Interaction Designer Local Projects March 2011  –  November 2011  (9 months) New York, NY • Designed interactive experiences for permanent museum exhibitions and other physical spaces. Graphic Information Designer Pentagram January 2010  –  March 2011  (1 year 3 months) New York, NY • Worked with Lisa Strausfeld and team to design websites and permanent interactive museum exhibitions to help users navigate rich information spaces \n• Designed on Household Energy Calculator project for GE, which was awarded by AIGA and the Type Director's Club, selected for AIGA's Design Archives, and exhibited in the Museum of Modern Art \n• Formulated information design strategy for McDonald’s menu boards \n• Designed interactive presentation for the United States’ bids for 2018/2022 World Cup Design Intern Alphabet Arm May 2009  –  August 2009  (4 months) Boston, MA Identity design, graphic design Design Intern Squad June 2008  –  September 2008  (4 months) Seattle, WA Web design Product Designer Splice.com December 2014  – Present (9 months) New York, NY Product Designer Splice.com December 2014  – Present (9 months) New York, NY Design Director Mike Deal Design May 2009  – Present (6 years 4 months) Some highlights: \n \n• Designed visual identity for Pinterest, the ~20th most trafficked site on earth. Awarded HOW Magazine’s Best Logotype of 2011, and a Type Directors Club Certification of Excellence \n \n• Redesigned the Billboard charts system, guiding client to update text-based tables to include photo content, while simplifying information architecture. \n \n• Consulted at Bloomberg Businessweek, directing the research and design of editorial graphics across a special retrospective issue on the financial crisis. \n \n• Invented for Umbro a repurposable system for visualizing soccer matches, which spread as their highest trafficked blog post yet \n \n• Invented a graphic notation system for whale song, covered in the New York Times. \n \n• Designed and illustrated \"Pollen\", 132-page magazine Design Director Mike Deal Design May 2009  – Present (6 years 4 months) Some highlights: \n \n• Designed visual identity for Pinterest, the ~20th most trafficked site on earth. Awarded HOW Magazine’s Best Logotype of 2011, and a Type Directors Club Certification of Excellence \n \n• Redesigned the Billboard charts system, guiding client to update text-based tables to include photo content, while simplifying information architecture. \n \n• Consulted at Bloomberg Businessweek, directing the research and design of editorial graphics across a special retrospective issue on the financial crisis. \n \n• Invented for Umbro a repurposable system for visualizing soccer matches, which spread as their highest trafficked blog post yet \n \n• Invented a graphic notation system for whale song, covered in the New York Times. \n \n• Designed and illustrated \"Pollen\", 132-page magazine Co-Founder, Chief Designer Scorecast August 2014  – Present (1 year 1 month) Co-founded with Dan Chaparian and Geoff Beck \n \n• Designed and developed data product that uses predictive algorithms to project outcomes of sports games and recommend players for daily fantasy lineups. Co-Founder, Chief Designer Scorecast August 2014  – Present (1 year 1 month) Co-founded with Dan Chaparian and Geoff Beck \n \n• Designed and developed data product that uses predictive algorithms to project outcomes of sports games and recommend players for daily fantasy lineups. Co-Founder, Chief Designer Statlas April 2014  – Present (1 year 5 months) Co-founded with Dan Chaparian and Geoff Beck \n \n• Launched sports news platform bringing fans real-time infographic game reports \n• Designed system to convert baseball game data into visual box scores, highlighting top plays of every game, every day. \n• Contextualized game graphics with crowd-sourced annotations and algorithmically generated textual explanations \n• Presented product at Y-Combinator in April 2014 \n \n“The prettiest MLB box scores you can find” -Deadspin \n\"Statlas's ultimate feat is that it reveals the supple statistical beauty that orchestrates every baseball game, all through the power of design\" -Fast Company Co-Founder, Chief Designer Statlas April 2014  – Present (1 year 5 months) Co-founded with Dan Chaparian and Geoff Beck \n \n• Launched sports news platform bringing fans real-time infographic game reports \n• Designed system to convert baseball game data into visual box scores, highlighting top plays of every game, every day. \n• Contextualized game graphics with crowd-sourced annotations and algorithmically generated textual explanations \n• Presented product at Y-Combinator in April 2014 \n \n“The prettiest MLB box scores you can find” -Deadspin \n\"Statlas's ultimate feat is that it reveals the supple statistical beauty that orchestrates every baseball game, all through the power of design\" -Fast Company Freelance Product Designer Google Creative Lab November 2011  –  November 2012  (1 year 1 month) New York, NY • Collaborated with product teams to invent features for Chrome and Search \n• Worked on small team to develop brand for Project Loon (Google’s network of internet balloons) \n• Designed visual analytics for Google users’ personal data \n• Developed design concepts for algorithmic YouTube music videos \n• Conceived Google-branded campaigns and projects Freelance Product Designer Google Creative Lab November 2011  –  November 2012  (1 year 1 month) New York, NY • Collaborated with product teams to invent features for Chrome and Search \n• Worked on small team to develop brand for Project Loon (Google’s network of internet balloons) \n• Designed visual analytics for Google users’ personal data \n• Developed design concepts for algorithmic YouTube music videos \n• Conceived Google-branded campaigns and projects Interaction Designer Local Projects March 2011  –  November 2011  (9 months) New York, NY • Designed interactive experiences for permanent museum exhibitions and other physical spaces. Interaction Designer Local Projects March 2011  –  November 2011  (9 months) New York, NY • Designed interactive experiences for permanent museum exhibitions and other physical spaces. Graphic Information Designer Pentagram January 2010  –  March 2011  (1 year 3 months) New York, NY • Worked with Lisa Strausfeld and team to design websites and permanent interactive museum exhibitions to help users navigate rich information spaces \n• Designed on Household Energy Calculator project for GE, which was awarded by AIGA and the Type Director's Club, selected for AIGA's Design Archives, and exhibited in the Museum of Modern Art \n• Formulated information design strategy for McDonald’s menu boards \n• Designed interactive presentation for the United States’ bids for 2018/2022 World Cup Graphic Information Designer Pentagram January 2010  –  March 2011  (1 year 3 months) New York, NY • Worked with Lisa Strausfeld and team to design websites and permanent interactive museum exhibitions to help users navigate rich information spaces \n• Designed on Household Energy Calculator project for GE, which was awarded by AIGA and the Type Director's Club, selected for AIGA's Design Archives, and exhibited in the Museum of Modern Art \n• Formulated information design strategy for McDonald’s menu boards \n• Designed interactive presentation for the United States’ bids for 2018/2022 World Cup Design Intern Alphabet Arm May 2009  –  August 2009  (4 months) Boston, MA Identity design, graphic design Design Intern Alphabet Arm May 2009  –  August 2009  (4 months) Boston, MA Identity design, graphic design Design Intern Squad June 2008  –  September 2008  (4 months) Seattle, WA Web design Design Intern Squad June 2008  –  September 2008  (4 months) Seattle, WA Web design Skills Creative Direction Product Design User Experience Data Visualization Information Design Graphic Design Branding & Identity Logo Design Front-end Design Front-end Development Interaction Design Web Design d3.js JavaScript Ruby Web Development Adobe Creative Suite Art Direction Typography Graphics Information Architecture User Interface Design User Experience Design Design Direction Ruby on Rails Backbone.js jQuery Agile Methodologies Lean Startup Content Marketing See 15+     See less Skills  Creative Direction Product Design User Experience Data Visualization Information Design Graphic Design Branding & Identity Logo Design Front-end Design Front-end Development Interaction Design Web Design d3.js JavaScript Ruby Web Development Adobe Creative Suite Art Direction Typography Graphics Information Architecture User Interface Design User Experience Design Design Direction Ruby on Rails Backbone.js jQuery Agile Methodologies Lean Startup Content Marketing See 15+     See less Creative Direction Product Design User Experience Data Visualization Information Design Graphic Design Branding & Identity Logo Design Front-end Design Front-end Development Interaction Design Web Design d3.js JavaScript Ruby Web Development Adobe Creative Suite Art Direction Typography Graphics Information Architecture User Interface Design User Experience Design Design Direction Ruby on Rails Backbone.js jQuery Agile Methodologies Lean Startup Content Marketing See 15+     See less Creative Direction Product Design User Experience Data Visualization Information Design Graphic Design Branding & Identity Logo Design Front-end Design Front-end Development Interaction Design Web Design d3.js JavaScript Ruby Web Development Adobe Creative Suite Art Direction Typography Graphics Information Architecture User Interface Design User Experience Design Design Direction Ruby on Rails Backbone.js jQuery Agile Methodologies Lean Startup Content Marketing See 15+     See less Education General Assembly Web Development Immersive,  Full time web development training 2013  – 2014 Boston University Bachelor of Fine Arts (BFA),  Graphic Design 2005  – 2009 General Assembly Web Development Immersive,  Full time web development training 2013  – 2014 General Assembly Web Development Immersive,  Full time web development training 2013  – 2014 General Assembly Web Development Immersive,  Full time web development training 2013  – 2014 Boston University Bachelor of Fine Arts (BFA),  Graphic Design 2005  – 2009 Boston University Bachelor of Fine Arts (BFA),  Graphic Design 2005  – 2009 Boston University Bachelor of Fine Arts (BFA),  Graphic Design 2005  – 2009 "]}