{"position": "Manager, Recruiting", "company": "Google", "profiles": ["Skills Skills     ", "Experience Technical Recruiter - Channels Specialist at Google Google November 2014  – Present (10 months) Dealer Development TrueCar, Inc. June 2014  –  November 2014  (6 months) Austin, Texas Area Technical Sourcer Google September 2013  –  June 2014  (10 months) austin, texas area Sr. Billing and Payments Specialist uShip.com May 2012  –  September 2013  (1 year 5 months) Billing and Payments Specialist uShip.com November 2011  –  May 2012  (7 months) Austin, TX Oversee all chargebacks received and effectively present proof to authenticate transactions \nAnalyze chargeback data and reporting to present quarterly adjustments to upper management \nManage relationships with third-party payment processors to ensure quality transactions \nCreate invoices and bill customers \nWork closely with our accounting department to assure all database entries reconcile with bank statements Athlete University of Notre Dame 2007  –  2011  (4 years) South Bend, Indiana Area Technical Recruiter - Channels Specialist at Google Google November 2014  – Present (10 months) Technical Recruiter - Channels Specialist at Google Google November 2014  – Present (10 months) Dealer Development TrueCar, Inc. June 2014  –  November 2014  (6 months) Austin, Texas Area Dealer Development TrueCar, Inc. June 2014  –  November 2014  (6 months) Austin, Texas Area Technical Sourcer Google September 2013  –  June 2014  (10 months) austin, texas area Technical Sourcer Google September 2013  –  June 2014  (10 months) austin, texas area Sr. Billing and Payments Specialist uShip.com May 2012  –  September 2013  (1 year 5 months) Sr. Billing and Payments Specialist uShip.com May 2012  –  September 2013  (1 year 5 months) Billing and Payments Specialist uShip.com November 2011  –  May 2012  (7 months) Austin, TX Oversee all chargebacks received and effectively present proof to authenticate transactions \nAnalyze chargeback data and reporting to present quarterly adjustments to upper management \nManage relationships with third-party payment processors to ensure quality transactions \nCreate invoices and bill customers \nWork closely with our accounting department to assure all database entries reconcile with bank statements Billing and Payments Specialist uShip.com November 2011  –  May 2012  (7 months) Austin, TX Oversee all chargebacks received and effectively present proof to authenticate transactions \nAnalyze chargeback data and reporting to present quarterly adjustments to upper management \nManage relationships with third-party payment processors to ensure quality transactions \nCreate invoices and bill customers \nWork closely with our accounting department to assure all database entries reconcile with bank statements Athlete University of Notre Dame 2007  –  2011  (4 years) South Bend, Indiana Area Athlete University of Notre Dame 2007  –  2011  (4 years) South Bend, Indiana Area Skills Sales Business Development Sourcing Technical Recruiting Analysis Data Analysis Start-ups Market Research Event Planning Microsoft Excel Social Media Marketing Public Speaking Research SQL Customer Service Skills  Sales Business Development Sourcing Technical Recruiting Analysis Data Analysis Start-ups Market Research Event Planning Microsoft Excel Social Media Marketing Public Speaking Research SQL Customer Service Sales Business Development Sourcing Technical Recruiting Analysis Data Analysis Start-ups Market Research Event Planning Microsoft Excel Social Media Marketing Public Speaking Research SQL Customer Service Sales Business Development Sourcing Technical Recruiting Analysis Data Analysis Start-ups Market Research Event Planning Microsoft Excel Social Media Marketing Public Speaking Research SQL Customer Service Education The University of Texas at Austin Continuing: Master's degree,  Advertising 2011  – 2012 University of Notre Dame Bachelor of Business Administration (B.B.A.),  Marketing 2007  – 2011 The University of Texas at Austin Continuing: Master's degree,  Advertising 2011  – 2012 The University of Texas at Austin Continuing: Master's degree,  Advertising 2011  – 2012 The University of Texas at Austin Continuing: Master's degree,  Advertising 2011  – 2012 University of Notre Dame Bachelor of Business Administration (B.B.A.),  Marketing 2007  – 2011 University of Notre Dame Bachelor of Business Administration (B.B.A.),  Marketing 2007  – 2011 University of Notre Dame Bachelor of Business Administration (B.B.A.),  Marketing 2007  – 2011 ", "Experience Technical Sourcing - Recruiter at Google (Nelson) Google September 2014  – Present (1 year) Google - Mountain View California Working as a Technical Sourcer for Google recruiting team, sourcing and screening software engineering professionals. Conduct screening to include sourcing and networking for passive candidates, candidate screening and qualification. Utilizing network and sourcing strategies to find uncovered and passive candidates for all positions. Responsible for supporting the recruiting team by creating an active flow of prospects and candidates by utilizing advanced internet searching, cold calling and networking. Technical Recruiter Volt Workforce Solutions March 2013  –  September 2014  (1 year 7 months) Peoria, Illinois Area Volt Workforce Solutions has become a premier global staffing resource by remembering that hiring is, in essence, matchmaking. We take an inherently challenging process — finding the right person for each job — and make it more efficient and successful for everyone involved. Over the past 50 years, we’ve developed capabilities and services for every aspect of staffing. Whether you’re a job-seeker or an employer, we can find the right fit for you. \n \nVolt believes that the strength of any company depends on the quality of its workforce. Since 1950, we have maintained our ranking and reputation as an industry leader by employing talented, motivated people who share our commitment to quality service and innovative thinking. Technical Recruiter Johnson Service Group, Inc February 2012  –  February 2013  (1 year 1 month) 475 Frontage Road suite 103 Burr Ridge, IL. Responsible for sourcing, screening, and selecting candidates to fill positions for our client companies. Following placement, responsible for maintaining the relationship with those individuals. Account Executive Greenerdealz October 2010  –  January 2012  (1 year 4 months) Greater Chicago Area GreenerDealz offers environmentally-conscious consumers a daily introduction to local sustainable businesses who provide green products and services to their communities. \n \nGreenerDealz wants to make going green accessible to everyone. By introducing you to earth-friendly alternatives in your city, we want to help you do better things for your body, your family, and your planet. Technical Sourcing - Recruiter at Google (Nelson) Google September 2014  – Present (1 year) Google - Mountain View California Working as a Technical Sourcer for Google recruiting team, sourcing and screening software engineering professionals. Conduct screening to include sourcing and networking for passive candidates, candidate screening and qualification. Utilizing network and sourcing strategies to find uncovered and passive candidates for all positions. Responsible for supporting the recruiting team by creating an active flow of prospects and candidates by utilizing advanced internet searching, cold calling and networking. Technical Sourcing - Recruiter at Google (Nelson) Google September 2014  – Present (1 year) Google - Mountain View California Working as a Technical Sourcer for Google recruiting team, sourcing and screening software engineering professionals. Conduct screening to include sourcing and networking for passive candidates, candidate screening and qualification. Utilizing network and sourcing strategies to find uncovered and passive candidates for all positions. Responsible for supporting the recruiting team by creating an active flow of prospects and candidates by utilizing advanced internet searching, cold calling and networking. Technical Recruiter Volt Workforce Solutions March 2013  –  September 2014  (1 year 7 months) Peoria, Illinois Area Volt Workforce Solutions has become a premier global staffing resource by remembering that hiring is, in essence, matchmaking. We take an inherently challenging process — finding the right person for each job — and make it more efficient and successful for everyone involved. Over the past 50 years, we’ve developed capabilities and services for every aspect of staffing. Whether you’re a job-seeker or an employer, we can find the right fit for you. \n \nVolt believes that the strength of any company depends on the quality of its workforce. Since 1950, we have maintained our ranking and reputation as an industry leader by employing talented, motivated people who share our commitment to quality service and innovative thinking. Technical Recruiter Volt Workforce Solutions March 2013  –  September 2014  (1 year 7 months) Peoria, Illinois Area Volt Workforce Solutions has become a premier global staffing resource by remembering that hiring is, in essence, matchmaking. We take an inherently challenging process — finding the right person for each job — and make it more efficient and successful for everyone involved. Over the past 50 years, we’ve developed capabilities and services for every aspect of staffing. Whether you’re a job-seeker or an employer, we can find the right fit for you. \n \nVolt believes that the strength of any company depends on the quality of its workforce. Since 1950, we have maintained our ranking and reputation as an industry leader by employing talented, motivated people who share our commitment to quality service and innovative thinking. Technical Recruiter Johnson Service Group, Inc February 2012  –  February 2013  (1 year 1 month) 475 Frontage Road suite 103 Burr Ridge, IL. Responsible for sourcing, screening, and selecting candidates to fill positions for our client companies. Following placement, responsible for maintaining the relationship with those individuals. Technical Recruiter Johnson Service Group, Inc February 2012  –  February 2013  (1 year 1 month) 475 Frontage Road suite 103 Burr Ridge, IL. Responsible for sourcing, screening, and selecting candidates to fill positions for our client companies. Following placement, responsible for maintaining the relationship with those individuals. Account Executive Greenerdealz October 2010  –  January 2012  (1 year 4 months) Greater Chicago Area GreenerDealz offers environmentally-conscious consumers a daily introduction to local sustainable businesses who provide green products and services to their communities. \n \nGreenerDealz wants to make going green accessible to everyone. By introducing you to earth-friendly alternatives in your city, we want to help you do better things for your body, your family, and your planet. Account Executive Greenerdealz October 2010  –  January 2012  (1 year 4 months) Greater Chicago Area GreenerDealz offers environmentally-conscious consumers a daily introduction to local sustainable businesses who provide green products and services to their communities. \n \nGreenerDealz wants to make going green accessible to everyone. By introducing you to earth-friendly alternatives in your city, we want to help you do better things for your body, your family, and your planet. Languages English English English Skills Sourcing Temporary Placement Recruiting Technical Recruiting Leadership Engineering Human Resources Contract Recruitment Applicant Tracking... Screening Staff Augmentation Screening Resumes Manufacturing Microsoft Office Microsoft Excel Sales Talent Acquisition PowerPoint Staffing Services Internet Recruiting Six Sigma New Business Development Lean Manufacturing Hiring Business Development Quality Assurance Engineers Cold Calling College Recruiting Temporary Staffing Permanent Placement Fun At Work Spoken Word Fact Finding See 19+     See less Skills  Sourcing Temporary Placement Recruiting Technical Recruiting Leadership Engineering Human Resources Contract Recruitment Applicant Tracking... Screening Staff Augmentation Screening Resumes Manufacturing Microsoft Office Microsoft Excel Sales Talent Acquisition PowerPoint Staffing Services Internet Recruiting Six Sigma New Business Development Lean Manufacturing Hiring Business Development Quality Assurance Engineers Cold Calling College Recruiting Temporary Staffing Permanent Placement Fun At Work Spoken Word Fact Finding See 19+     See less Sourcing Temporary Placement Recruiting Technical Recruiting Leadership Engineering Human Resources Contract Recruitment Applicant Tracking... Screening Staff Augmentation Screening Resumes Manufacturing Microsoft Office Microsoft Excel Sales Talent Acquisition PowerPoint Staffing Services Internet Recruiting Six Sigma New Business Development Lean Manufacturing Hiring Business Development Quality Assurance Engineers Cold Calling College Recruiting Temporary Staffing Permanent Placement Fun At Work Spoken Word Fact Finding See 19+     See less Sourcing Temporary Placement Recruiting Technical Recruiting Leadership Engineering Human Resources Contract Recruitment Applicant Tracking... Screening Staff Augmentation Screening Resumes Manufacturing Microsoft Office Microsoft Excel Sales Talent Acquisition PowerPoint Staffing Services Internet Recruiting Six Sigma New Business Development Lean Manufacturing Hiring Business Development Quality Assurance Engineers Cold Calling College Recruiting Temporary Staffing Permanent Placement Fun At Work Spoken Word Fact Finding See 19+     See less Education Illinois State University Bachelors,  Science. Kinesiology and Recreation 2006  – 2010 College of DuPage Associates 2005  – 2006 Illinois State University Bachelors,  Science. Kinesiology and Recreation 2006  – 2010 Illinois State University Bachelors,  Science. Kinesiology and Recreation 2006  – 2010 Illinois State University Bachelors,  Science. Kinesiology and Recreation 2006  – 2010 College of DuPage Associates 2005  – 2006 College of DuPage Associates 2005  – 2006 College of DuPage Associates 2005  – 2006 Honors & Awards Additional Honors & Awards Former Rugby state champion Additional Honors & Awards Former Rugby state champion Additional Honors & Awards Former Rugby state champion Additional Honors & Awards Former Rugby state champion ", "Summary moonshot --> build --> share  \n \nGoogle[x] \n \nwww.solveforx.com Summary moonshot --> build --> share  \n \nGoogle[x] \n \nwww.solveforx.com moonshot --> build --> share  \n \nGoogle[x] \n \nwww.solveforx.com moonshot --> build --> share  \n \nGoogle[x] \n \nwww.solveforx.com Experience Google[x] Recruiter/Sourcer Google April 2012  – Present (3 years 5 months) Mountain View, CA Recruit hardware engineers, program managers, and designers for Google[x]. \n \nSelf-Driving Car / Smart Contact Lens / Glass / Project Loon / Makani / Project Wing Design Recruiter/Sourcer Google 2010  –  2012  (2 years) Mountain View, CA Primary sourcer for the following roles: \nInteraction Designer \nVisual Designer \nUser Experience Researcher  \nUX Prototyper \nUX Producer \n \nAdditional roles: network engineers, software engineers, hardware engineers Sr. Technical Recruiter OUTSOURCE Consulting Services, Inc. September 2009  –  April 2010  (8 months) VP of Recruiting Ferrato Information Technology, HR (FIT HR) April 2007  –  August 2009  (2 years 5 months) FIT HR LLC is a technical recruiting firm servicing local companies in the San Francisco Bay Area. Responsible for managing the entire recruiting function for the start-up consulting firm. Senior Technical Recruiter All Star Consulting August 2005  –  April 2007  (1 year 9 months) All Star Consulting was established in 1982, and has become the premiere Woman-Owned IT and business consulting firm servicing the San Francisco Bay Area and nationally. Staffing Program Manager Pacific Gas and Electric Company September 2003  –  August 2005  (2 years) San Francisco Bay Area Managed the engineering staffing vendors for PG&E. Technical Recruiter International Programming & Systems, Inc. September 2000  –  August 2003  (3 years) San Mateo, CA Google[x] Recruiter/Sourcer Google April 2012  – Present (3 years 5 months) Mountain View, CA Recruit hardware engineers, program managers, and designers for Google[x]. \n \nSelf-Driving Car / Smart Contact Lens / Glass / Project Loon / Makani / Project Wing Google[x] Recruiter/Sourcer Google April 2012  – Present (3 years 5 months) Mountain View, CA Recruit hardware engineers, program managers, and designers for Google[x]. \n \nSelf-Driving Car / Smart Contact Lens / Glass / Project Loon / Makani / Project Wing Design Recruiter/Sourcer Google 2010  –  2012  (2 years) Mountain View, CA Primary sourcer for the following roles: \nInteraction Designer \nVisual Designer \nUser Experience Researcher  \nUX Prototyper \nUX Producer \n \nAdditional roles: network engineers, software engineers, hardware engineers Design Recruiter/Sourcer Google 2010  –  2012  (2 years) Mountain View, CA Primary sourcer for the following roles: \nInteraction Designer \nVisual Designer \nUser Experience Researcher  \nUX Prototyper \nUX Producer \n \nAdditional roles: network engineers, software engineers, hardware engineers Sr. Technical Recruiter OUTSOURCE Consulting Services, Inc. September 2009  –  April 2010  (8 months) Sr. Technical Recruiter OUTSOURCE Consulting Services, Inc. September 2009  –  April 2010  (8 months) VP of Recruiting Ferrato Information Technology, HR (FIT HR) April 2007  –  August 2009  (2 years 5 months) FIT HR LLC is a technical recruiting firm servicing local companies in the San Francisco Bay Area. Responsible for managing the entire recruiting function for the start-up consulting firm. VP of Recruiting Ferrato Information Technology, HR (FIT HR) April 2007  –  August 2009  (2 years 5 months) FIT HR LLC is a technical recruiting firm servicing local companies in the San Francisco Bay Area. Responsible for managing the entire recruiting function for the start-up consulting firm. Senior Technical Recruiter All Star Consulting August 2005  –  April 2007  (1 year 9 months) All Star Consulting was established in 1982, and has become the premiere Woman-Owned IT and business consulting firm servicing the San Francisco Bay Area and nationally. Senior Technical Recruiter All Star Consulting August 2005  –  April 2007  (1 year 9 months) All Star Consulting was established in 1982, and has become the premiere Woman-Owned IT and business consulting firm servicing the San Francisco Bay Area and nationally. Staffing Program Manager Pacific Gas and Electric Company September 2003  –  August 2005  (2 years) San Francisco Bay Area Managed the engineering staffing vendors for PG&E. Staffing Program Manager Pacific Gas and Electric Company September 2003  –  August 2005  (2 years) San Francisco Bay Area Managed the engineering staffing vendors for PG&E. Technical Recruiter International Programming & Systems, Inc. September 2000  –  August 2003  (3 years) San Mateo, CA Technical Recruiter International Programming & Systems, Inc. September 2000  –  August 2003  (3 years) San Mateo, CA Skills Technical Recruiting User Experience Sourcing Mentoring Search Social Media Project Management Business Analysis Business Intelligence Java C++ Python .NET Network Engineering Negotiation Contract Negotiation Salary Review See 2+     See less Skills  Technical Recruiting User Experience Sourcing Mentoring Search Social Media Project Management Business Analysis Business Intelligence Java C++ Python .NET Network Engineering Negotiation Contract Negotiation Salary Review See 2+     See less Technical Recruiting User Experience Sourcing Mentoring Search Social Media Project Management Business Analysis Business Intelligence Java C++ Python .NET Network Engineering Negotiation Contract Negotiation Salary Review See 2+     See less Technical Recruiting User Experience Sourcing Mentoring Search Social Media Project Management Business Analysis Business Intelligence Java C++ Python .NET Network Engineering Negotiation Contract Negotiation Salary Review See 2+     See less Education University of California, Berkeley Bachelors,  Sociology 1996  – 2000 University of California, Berkeley Bachelors,  Sociology 1996  – 2000 University of California, Berkeley Bachelors,  Sociology 1996  – 2000 University of California, Berkeley Bachelors,  Sociology 1996  – 2000 ", "Skills Volunteer Coordination Non-profits Youth Development Event Planning Teaching Community Relations Volunteer Management Program Management Skills  Volunteer Coordination Non-profits Youth Development Event Planning Teaching Community Relations Volunteer Management Program Management Volunteer Coordination Non-profits Youth Development Event Planning Teaching Community Relations Volunteer Management Program Management Volunteer Coordination Non-profits Youth Development Event Planning Teaching Community Relations Volunteer Management Program Management ", "Summary Technical Recruiter on site at Google in Mountain View, CA. Summary Technical Recruiter on site at Google in Mountain View, CA. Technical Recruiter on site at Google in Mountain View, CA. Technical Recruiter on site at Google in Mountain View, CA. Experience Recruiter - Google (Adecco) Google November 2014  – Present (10 months) Mountain View Google's software engineers develop the next-generation technologies that change how millions of users connect, explore, and interact with information and one another. Our ambitions reach far beyond just Search. Our products need to handle information at the the scale of the web. We're looking for ideas from every area of computer science, including information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, and user interface design; the list goes on and is growing every day. As a software engineer, you work on a small team and can switch teams and projects as our fast-paced business grows and evolves. We need our engineers to be versatile and passionate to tackle new problems as we continue to push technology forward. \n \nInterested? https://www.google.com/about/careers/search#!t=jo&jid=41935001& Recruiter Grit Matters July 2014  –  October 2014  (4 months) Client Services Manager Agero, Inc. November 2011  –  July 2014  (2 years 9 months) Digital Media & Creative Staffing Manager Winter Wyman July 2010  –  November 2011  (1 year 5 months) Technical Recruiter TEKsystems July 2007  –  June 2010  (3 years) Retail Store Manager Starbucks Coffee Company March 1998  –  July 2007  (9 years 5 months) Recruiter - Google (Adecco) Google November 2014  – Present (10 months) Mountain View Google's software engineers develop the next-generation technologies that change how millions of users connect, explore, and interact with information and one another. Our ambitions reach far beyond just Search. Our products need to handle information at the the scale of the web. We're looking for ideas from every area of computer science, including information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, and user interface design; the list goes on and is growing every day. As a software engineer, you work on a small team and can switch teams and projects as our fast-paced business grows and evolves. We need our engineers to be versatile and passionate to tackle new problems as we continue to push technology forward. \n \nInterested? https://www.google.com/about/careers/search#!t=jo&jid=41935001& Recruiter - Google (Adecco) Google November 2014  – Present (10 months) Mountain View Google's software engineers develop the next-generation technologies that change how millions of users connect, explore, and interact with information and one another. Our ambitions reach far beyond just Search. Our products need to handle information at the the scale of the web. We're looking for ideas from every area of computer science, including information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, and user interface design; the list goes on and is growing every day. As a software engineer, you work on a small team and can switch teams and projects as our fast-paced business grows and evolves. We need our engineers to be versatile and passionate to tackle new problems as we continue to push technology forward. \n \nInterested? https://www.google.com/about/careers/search#!t=jo&jid=41935001& Recruiter Grit Matters July 2014  –  October 2014  (4 months) Recruiter Grit Matters July 2014  –  October 2014  (4 months) Client Services Manager Agero, Inc. November 2011  –  July 2014  (2 years 9 months) Client Services Manager Agero, Inc. November 2011  –  July 2014  (2 years 9 months) Digital Media & Creative Staffing Manager Winter Wyman July 2010  –  November 2011  (1 year 5 months) Digital Media & Creative Staffing Manager Winter Wyman July 2010  –  November 2011  (1 year 5 months) Technical Recruiter TEKsystems July 2007  –  June 2010  (3 years) Technical Recruiter TEKsystems July 2007  –  June 2010  (3 years) Retail Store Manager Starbucks Coffee Company March 1998  –  July 2007  (9 years 5 months) Retail Store Manager Starbucks Coffee Company March 1998  –  July 2007  (9 years 5 months) Skills Account Management Performance Reporting Cognos Microsoft Dynamics Customer Service Customer Experience Salesforce.com Microsoft Excel Talent Acquisition Applicant Tracking... Recruiting Cold Calling Technical Recruiting Problem Solving Skills  Account Management Performance Reporting Cognos Microsoft Dynamics Customer Service Customer Experience Salesforce.com Microsoft Excel Talent Acquisition Applicant Tracking... Recruiting Cold Calling Technical Recruiting Problem Solving Account Management Performance Reporting Cognos Microsoft Dynamics Customer Service Customer Experience Salesforce.com Microsoft Excel Talent Acquisition Applicant Tracking... Recruiting Cold Calling Technical Recruiting Problem Solving Account Management Performance Reporting Cognos Microsoft Dynamics Customer Service Customer Experience Salesforce.com Microsoft Excel Talent Acquisition Applicant Tracking... Recruiting Cold Calling Technical Recruiting Problem Solving Education Holyoke Community College Liberal Arts Holyoke Community College Liberal Arts Holyoke Community College Liberal Arts Holyoke Community College Liberal Arts ", "Experience Engineering Recruiter Google January 2015  – Present (8 months) Greater Pittsburgh Area Helping the Google engineering group in Pittsburgh grow! If you're a developer interested in opportunities within this particular office, feel free to reach out.  \n \nYou can find out more about our teams and openings in Pittsburgh by following this link... \nhttp://www.google.com/about/careers/locations/pittsburgh/ \n \n Organizer Pittsburgh Recruiter Meetup March 2014  – Present (1 year 6 months) Greater Pittsburgh Area Our next meetup is on June 26, 2015 and is sponsored by Uber. Check it out! \n \nhttp://www.meetup.com/Pittsburgh-Recruiters-Meetup/events/221164748/ \n Senior Engineering Recruitment Amazon (via Search Wizards) May 2014  –  January 2015  (9 months) Greater Pittsburgh Area Recruitment Programs & Operations Spotify March 2013  –  December 2013  (10 months) New York, NY Responsible for employer branding, conference/career fair participation and diversity initiatives for Spotify! Tech Recruiting Manager Spotify September 2011  –  March 2013  (1 year 7 months) New York, NY Lead all technical, product and operations recruiting efforts for Spotify in the U.S. while being responsible for the success of the tech recruiting team. Hosting culture workshops to foster a positive working environment and bringing awareness to the mission and mantras of Spotify. Conducting interview training focused on behavioral and situational interviews to improve the quality of the interview process. Engineering Recruiter Google February 2010  –  September 2011  (1 year 8 months) New York, NY -Sole Recruiter for Software Engineer in Test and Test Engineer openings for NYC. \n-Also recruiting general Software Engineers,Site Reliability Engineers and Front End Engineers for New York. \n-100% acceptance rate  \n-Work with other recruiters to share best practices, challenges and new avenues to recruit test candidates. \n-Led three dedicated sourcers in developing a test candidate pipeline. Responding to their questions about potential candidates. Giving direction on the best way to approach and move candidates through the test interview process. Diversity Technical Recruiter Microsoft June 2007  –  February 2010  (2 years 9 months) Recruited diverse engineers for software engineering roles. Contract Technical Recruiter Cisco Systems February 2006  –  June 2007  (1 year 5 months) Greater Pittsburgh Area Recruited software engineers and operations engineers into Cisco offices around the globe. CEO/Founder Top Talent Executive Search Group 2002  –  2006  (4 years) Greater Atlanta Area Stepped out on faith and started my own company after realizing I could do this recruiting stuff on my own with the connections that I made. Did well enough to pull me and my wife out of \"Corporate America\" and travel the country for four years. We lived in 3 cities in a span of four years. Good times... Recruiter HRworks December 2000  –  July 2002  (1 year 8 months) Greater Atlanta Area Finding Store Manager candidates for The Home Depot's Store Leadership Program. Recruiter DHR International May 2000  –  December 2000  (8 months) Greater Atlanta Area This is where I cut my teeth as a Recruiter...and the rest is history! Engineering Recruiter Google January 2015  – Present (8 months) Greater Pittsburgh Area Helping the Google engineering group in Pittsburgh grow! If you're a developer interested in opportunities within this particular office, feel free to reach out.  \n \nYou can find out more about our teams and openings in Pittsburgh by following this link... \nhttp://www.google.com/about/careers/locations/pittsburgh/ \n \n Engineering Recruiter Google January 2015  – Present (8 months) Greater Pittsburgh Area Helping the Google engineering group in Pittsburgh grow! If you're a developer interested in opportunities within this particular office, feel free to reach out.  \n \nYou can find out more about our teams and openings in Pittsburgh by following this link... \nhttp://www.google.com/about/careers/locations/pittsburgh/ \n \n Organizer Pittsburgh Recruiter Meetup March 2014  – Present (1 year 6 months) Greater Pittsburgh Area Our next meetup is on June 26, 2015 and is sponsored by Uber. Check it out! \n \nhttp://www.meetup.com/Pittsburgh-Recruiters-Meetup/events/221164748/ \n Organizer Pittsburgh Recruiter Meetup March 2014  – Present (1 year 6 months) Greater Pittsburgh Area Our next meetup is on June 26, 2015 and is sponsored by Uber. Check it out! \n \nhttp://www.meetup.com/Pittsburgh-Recruiters-Meetup/events/221164748/ \n Senior Engineering Recruitment Amazon (via Search Wizards) May 2014  –  January 2015  (9 months) Greater Pittsburgh Area Senior Engineering Recruitment Amazon (via Search Wizards) May 2014  –  January 2015  (9 months) Greater Pittsburgh Area Recruitment Programs & Operations Spotify March 2013  –  December 2013  (10 months) New York, NY Responsible for employer branding, conference/career fair participation and diversity initiatives for Spotify! Recruitment Programs & Operations Spotify March 2013  –  December 2013  (10 months) New York, NY Responsible for employer branding, conference/career fair participation and diversity initiatives for Spotify! Tech Recruiting Manager Spotify September 2011  –  March 2013  (1 year 7 months) New York, NY Lead all technical, product and operations recruiting efforts for Spotify in the U.S. while being responsible for the success of the tech recruiting team. Hosting culture workshops to foster a positive working environment and bringing awareness to the mission and mantras of Spotify. Conducting interview training focused on behavioral and situational interviews to improve the quality of the interview process. Tech Recruiting Manager Spotify September 2011  –  March 2013  (1 year 7 months) New York, NY Lead all technical, product and operations recruiting efforts for Spotify in the U.S. while being responsible for the success of the tech recruiting team. Hosting culture workshops to foster a positive working environment and bringing awareness to the mission and mantras of Spotify. Conducting interview training focused on behavioral and situational interviews to improve the quality of the interview process. Engineering Recruiter Google February 2010  –  September 2011  (1 year 8 months) New York, NY -Sole Recruiter for Software Engineer in Test and Test Engineer openings for NYC. \n-Also recruiting general Software Engineers,Site Reliability Engineers and Front End Engineers for New York. \n-100% acceptance rate  \n-Work with other recruiters to share best practices, challenges and new avenues to recruit test candidates. \n-Led three dedicated sourcers in developing a test candidate pipeline. Responding to their questions about potential candidates. Giving direction on the best way to approach and move candidates through the test interview process. Engineering Recruiter Google February 2010  –  September 2011  (1 year 8 months) New York, NY -Sole Recruiter for Software Engineer in Test and Test Engineer openings for NYC. \n-Also recruiting general Software Engineers,Site Reliability Engineers and Front End Engineers for New York. \n-100% acceptance rate  \n-Work with other recruiters to share best practices, challenges and new avenues to recruit test candidates. \n-Led three dedicated sourcers in developing a test candidate pipeline. Responding to their questions about potential candidates. Giving direction on the best way to approach and move candidates through the test interview process. Diversity Technical Recruiter Microsoft June 2007  –  February 2010  (2 years 9 months) Recruited diverse engineers for software engineering roles. Diversity Technical Recruiter Microsoft June 2007  –  February 2010  (2 years 9 months) Recruited diverse engineers for software engineering roles. Contract Technical Recruiter Cisco Systems February 2006  –  June 2007  (1 year 5 months) Greater Pittsburgh Area Recruited software engineers and operations engineers into Cisco offices around the globe. Contract Technical Recruiter Cisco Systems February 2006  –  June 2007  (1 year 5 months) Greater Pittsburgh Area Recruited software engineers and operations engineers into Cisco offices around the globe. CEO/Founder Top Talent Executive Search Group 2002  –  2006  (4 years) Greater Atlanta Area Stepped out on faith and started my own company after realizing I could do this recruiting stuff on my own with the connections that I made. Did well enough to pull me and my wife out of \"Corporate America\" and travel the country for four years. We lived in 3 cities in a span of four years. Good times... CEO/Founder Top Talent Executive Search Group 2002  –  2006  (4 years) Greater Atlanta Area Stepped out on faith and started my own company after realizing I could do this recruiting stuff on my own with the connections that I made. Did well enough to pull me and my wife out of \"Corporate America\" and travel the country for four years. We lived in 3 cities in a span of four years. Good times... Recruiter HRworks December 2000  –  July 2002  (1 year 8 months) Greater Atlanta Area Finding Store Manager candidates for The Home Depot's Store Leadership Program. Recruiter HRworks December 2000  –  July 2002  (1 year 8 months) Greater Atlanta Area Finding Store Manager candidates for The Home Depot's Store Leadership Program. Recruiter DHR International May 2000  –  December 2000  (8 months) Greater Atlanta Area This is where I cut my teeth as a Recruiter...and the rest is history! Recruiter DHR International May 2000  –  December 2000  (8 months) Greater Atlanta Area This is where I cut my teeth as a Recruiter...and the rest is history! Skills Technical Recruiting Team Leadership Sourcing Candidate Generation Passive Candidate... Passive Candidate... Applicant Tracking... Internet Recruiting Business Networking Hiring SDLC Recruiting Staff Augmentation Executive Search Screening Resumes Employer Branding Human Resources Talent Acquisition Search Benefits Negotiation College Recruiting Screening Staffing Services Recruitment Advertising IT Recruitment Talent Management Employee Relations Contract Recruitment Temporary Placement Interviews Permanent Placement Onboarding Management Building Relationships Program Management Resume Writing Cold Calling Personnel Management CRM HRIS See 25+     See less Skills  Technical Recruiting Team Leadership Sourcing Candidate Generation Passive Candidate... Passive Candidate... Applicant Tracking... Internet Recruiting Business Networking Hiring SDLC Recruiting Staff Augmentation Executive Search Screening Resumes Employer Branding Human Resources Talent Acquisition Search Benefits Negotiation College Recruiting Screening Staffing Services Recruitment Advertising IT Recruitment Talent Management Employee Relations Contract Recruitment Temporary Placement Interviews Permanent Placement Onboarding Management Building Relationships Program Management Resume Writing Cold Calling Personnel Management CRM HRIS See 25+     See less Technical Recruiting Team Leadership Sourcing Candidate Generation Passive Candidate... Passive Candidate... Applicant Tracking... Internet Recruiting Business Networking Hiring SDLC Recruiting Staff Augmentation Executive Search Screening Resumes Employer Branding Human Resources Talent Acquisition Search Benefits Negotiation College Recruiting Screening Staffing Services Recruitment Advertising IT Recruitment Talent Management Employee Relations Contract Recruitment Temporary Placement Interviews Permanent Placement Onboarding Management Building Relationships Program Management Resume Writing Cold Calling Personnel Management CRM HRIS See 25+     See less Technical Recruiting Team Leadership Sourcing Candidate Generation Passive Candidate... Passive Candidate... Applicant Tracking... Internet Recruiting Business Networking Hiring SDLC Recruiting Staff Augmentation Executive Search Screening Resumes Employer Branding Human Resources Talent Acquisition Search Benefits Negotiation College Recruiting Screening Staffing Services Recruitment Advertising IT Recruitment Talent Management Employee Relations Contract Recruitment Temporary Placement Interviews Permanent Placement Onboarding Management Building Relationships Program Management Resume Writing Cold Calling Personnel Management CRM HRIS See 25+     See less Education Emory University BA,  Psychology and Sociology 1996  – 2000 Activities and Societies:  Alpha Phi Alpha Fraternity ,  Inc. Emory University BA,  Psychology and Sociology 1996  – 2000 Activities and Societies:  Alpha Phi Alpha Fraternity ,  Inc. Emory University BA,  Psychology and Sociology 1996  – 2000 Activities and Societies:  Alpha Phi Alpha Fraternity ,  Inc. Emory University BA,  Psychology and Sociology 1996  – 2000 Activities and Societies:  Alpha Phi Alpha Fraternity ,  Inc. ", "Summary I am an Executive Recruiter and Business Development professional with several years of recruiting experience on a high level for companies all over the US. I am anxious to help employers with any critical hiring needs they have in the areas of Construction, Mining, Engineering, Energy, and Manufacturing. I have many years of experience with recruiting and sales and I am looking to connect with candidates that are looking for direct placements and employers that have tough recruiting needs. I am always looking for others to network with in order to facilitate successful recruiting, marketing, and sales. I will work hard for you and do what it takes to get the job done! \n \nSpecialties: I specialize in Construction,Engineering, Mining, Energy and Manufacturing.  \n \nIf you are looking for a Recruiter with heart, that will give you personal attention and go the extra mile...call me and I will get the job done! Summary I am an Executive Recruiter and Business Development professional with several years of recruiting experience on a high level for companies all over the US. I am anxious to help employers with any critical hiring needs they have in the areas of Construction, Mining, Engineering, Energy, and Manufacturing. I have many years of experience with recruiting and sales and I am looking to connect with candidates that are looking for direct placements and employers that have tough recruiting needs. I am always looking for others to network with in order to facilitate successful recruiting, marketing, and sales. I will work hard for you and do what it takes to get the job done! \n \nSpecialties: I specialize in Construction,Engineering, Mining, Energy and Manufacturing.  \n \nIf you are looking for a Recruiter with heart, that will give you personal attention and go the extra mile...call me and I will get the job done! I am an Executive Recruiter and Business Development professional with several years of recruiting experience on a high level for companies all over the US. I am anxious to help employers with any critical hiring needs they have in the areas of Construction, Mining, Engineering, Energy, and Manufacturing. I have many years of experience with recruiting and sales and I am looking to connect with candidates that are looking for direct placements and employers that have tough recruiting needs. I am always looking for others to network with in order to facilitate successful recruiting, marketing, and sales. I will work hard for you and do what it takes to get the job done! \n \nSpecialties: I specialize in Construction,Engineering, Mining, Energy and Manufacturing.  \n \nIf you are looking for a Recruiter with heart, that will give you personal attention and go the extra mile...call me and I will get the job done! I am an Executive Recruiter and Business Development professional with several years of recruiting experience on a high level for companies all over the US. I am anxious to help employers with any critical hiring needs they have in the areas of Construction, Mining, Engineering, Energy, and Manufacturing. I have many years of experience with recruiting and sales and I am looking to connect with candidates that are looking for direct placements and employers that have tough recruiting needs. I am always looking for others to network with in order to facilitate successful recruiting, marketing, and sales. I will work hard for you and do what it takes to get the job done! \n \nSpecialties: I specialize in Construction,Engineering, Mining, Energy and Manufacturing.  \n \nIf you are looking for a Recruiter with heart, that will give you personal attention and go the extra mile...call me and I will get the job done! Skills Technical Recruiting Helping Others Succeed Passion for Helping... Executive Search Cold Calling Business Development Sales Architecture Internet Recruiting Contract Recruitment College Recruiting Applicant Tracking... Permanent Placement Human Resources Temporary Placement Resume Writing Benefits Negotiation Employee Relations Interviews Strategic Sourcing Talent Management Networking Industrial Sector Screening Resumes Training Onboarding Screening Business Networking Building Relationships CRM Hiring Performance Management Employee Engagement Organizational... Leadership Employee Training Staffing Services See 22+     See less Skills  Technical Recruiting Helping Others Succeed Passion for Helping... Executive Search Cold Calling Business Development Sales Architecture Internet Recruiting Contract Recruitment College Recruiting Applicant Tracking... Permanent Placement Human Resources Temporary Placement Resume Writing Benefits Negotiation Employee Relations Interviews Strategic Sourcing Talent Management Networking Industrial Sector Screening Resumes Training Onboarding Screening Business Networking Building Relationships CRM Hiring Performance Management Employee Engagement Organizational... Leadership Employee Training Staffing Services See 22+     See less Technical Recruiting Helping Others Succeed Passion for Helping... Executive Search Cold Calling Business Development Sales Architecture Internet Recruiting Contract Recruitment College Recruiting Applicant Tracking... Permanent Placement Human Resources Temporary Placement Resume Writing Benefits Negotiation Employee Relations Interviews Strategic Sourcing Talent Management Networking Industrial Sector Screening Resumes Training Onboarding Screening Business Networking Building Relationships CRM Hiring Performance Management Employee Engagement Organizational... Leadership Employee Training Staffing Services See 22+     See less Technical Recruiting Helping Others Succeed Passion for Helping... Executive Search Cold Calling Business Development Sales Architecture Internet Recruiting Contract Recruitment College Recruiting Applicant Tracking... Permanent Placement Human Resources Temporary Placement Resume Writing Benefits Negotiation Employee Relations Interviews Strategic Sourcing Talent Management Networking Industrial Sector Screening Resumes Training Onboarding Screening Business Networking Building Relationships CRM Hiring Performance Management Employee Engagement Organizational... Leadership Employee Training Staffing Services See 22+     See less Honors & Awards ", "Summary * A multifaceted HR professional  \n* Partner with business on workforce planning, succession planning, and skills assessment \n* Focus on recruiting best in the IT industry ... technology hiring! \n* Partner with managers to retain, develop and motivate people to achieve their fullest potential. \n* Working with business groups to assess, create and implement innovative solutions for a variety of employee engagement initiatives within client group \n* Hard working and committed to the organization’s as well as own growth and empowerment. \n* Ability to influence and partner with different levels of the organization to achieve results \n* Strong business and HR acumen, including strong problem solving skills, critical thinking, and self-initiative \n* Proven ability to successfully work as a team member and to build and maintain a positive work environment across the network \n* Experience working in an entrepreneurial environment requiring strong multi-tasking abilities \n* Proven ability to use initiative in carrying out tasks \n* Proven ability to prioritize tasks and to organize workload to assure that short timelines are met while having frequent interruptions \n* Proven understanding of the role and functions of a human resource office within an operations structure \n* Excellent people and communication skills Summary * A multifaceted HR professional  \n* Partner with business on workforce planning, succession planning, and skills assessment \n* Focus on recruiting best in the IT industry ... technology hiring! \n* Partner with managers to retain, develop and motivate people to achieve their fullest potential. \n* Working with business groups to assess, create and implement innovative solutions for a variety of employee engagement initiatives within client group \n* Hard working and committed to the organization’s as well as own growth and empowerment. \n* Ability to influence and partner with different levels of the organization to achieve results \n* Strong business and HR acumen, including strong problem solving skills, critical thinking, and self-initiative \n* Proven ability to successfully work as a team member and to build and maintain a positive work environment across the network \n* Experience working in an entrepreneurial environment requiring strong multi-tasking abilities \n* Proven ability to use initiative in carrying out tasks \n* Proven ability to prioritize tasks and to organize workload to assure that short timelines are met while having frequent interruptions \n* Proven understanding of the role and functions of a human resource office within an operations structure \n* Excellent people and communication skills * A multifaceted HR professional  \n* Partner with business on workforce planning, succession planning, and skills assessment \n* Focus on recruiting best in the IT industry ... technology hiring! \n* Partner with managers to retain, develop and motivate people to achieve their fullest potential. \n* Working with business groups to assess, create and implement innovative solutions for a variety of employee engagement initiatives within client group \n* Hard working and committed to the organization’s as well as own growth and empowerment. \n* Ability to influence and partner with different levels of the organization to achieve results \n* Strong business and HR acumen, including strong problem solving skills, critical thinking, and self-initiative \n* Proven ability to successfully work as a team member and to build and maintain a positive work environment across the network \n* Experience working in an entrepreneurial environment requiring strong multi-tasking abilities \n* Proven ability to use initiative in carrying out tasks \n* Proven ability to prioritize tasks and to organize workload to assure that short timelines are met while having frequent interruptions \n* Proven understanding of the role and functions of a human resource office within an operations structure \n* Excellent people and communication skills * A multifaceted HR professional  \n* Partner with business on workforce planning, succession planning, and skills assessment \n* Focus on recruiting best in the IT industry ... technology hiring! \n* Partner with managers to retain, develop and motivate people to achieve their fullest potential. \n* Working with business groups to assess, create and implement innovative solutions for a variety of employee engagement initiatives within client group \n* Hard working and committed to the organization’s as well as own growth and empowerment. \n* Ability to influence and partner with different levels of the organization to achieve results \n* Strong business and HR acumen, including strong problem solving skills, critical thinking, and self-initiative \n* Proven ability to successfully work as a team member and to build and maintain a positive work environment across the network \n* Experience working in an entrepreneurial environment requiring strong multi-tasking abilities \n* Proven ability to use initiative in carrying out tasks \n* Proven ability to prioritize tasks and to organize workload to assure that short timelines are met while having frequent interruptions \n* Proven understanding of the role and functions of a human resource office within an operations structure \n* Excellent people and communication skills Languages French English Full professional proficiency French English Full professional proficiency French English Full professional proficiency Full professional proficiency Skills Employee Engagement HRIS Talent Acquisition Employee Relations Sourcing Technical Recruiting Compensation & Benefit Onboarding Induction Program Team Leadership Recruiting Training Recruitments Talent Intelligence Business Networking Executive Search Data Analysis Strategic Sourcing Interviews Human Resources HR Policies Team Management Vendor Management Screening Employee Training Succession Planning Management Job Descriptions IT Recruitment Benefits Negotiation Performance Appraisal Payroll Talent Management Organizational... Performance Management Internet Recruiting Compensation & Benefits See 22+     See less Skills  Employee Engagement HRIS Talent Acquisition Employee Relations Sourcing Technical Recruiting Compensation & Benefit Onboarding Induction Program Team Leadership Recruiting Training Recruitments Talent Intelligence Business Networking Executive Search Data Analysis Strategic Sourcing Interviews Human Resources HR Policies Team Management Vendor Management Screening Employee Training Succession Planning Management Job Descriptions IT Recruitment Benefits Negotiation Performance Appraisal Payroll Talent Management Organizational... Performance Management Internet Recruiting Compensation & Benefits See 22+     See less Employee Engagement HRIS Talent Acquisition Employee Relations Sourcing Technical Recruiting Compensation & Benefit Onboarding Induction Program Team Leadership Recruiting Training Recruitments Talent Intelligence Business Networking Executive Search Data Analysis Strategic Sourcing Interviews Human Resources HR Policies Team Management Vendor Management Screening Employee Training Succession Planning Management Job Descriptions IT Recruitment Benefits Negotiation Performance Appraisal Payroll Talent Management Organizational... Performance Management Internet Recruiting Compensation & Benefits See 22+     See less Employee Engagement HRIS Talent Acquisition Employee Relations Sourcing Technical Recruiting Compensation & Benefit Onboarding Induction Program Team Leadership Recruiting Training Recruitments Talent Intelligence Business Networking Executive Search Data Analysis Strategic Sourcing Interviews Human Resources HR Policies Team Management Vendor Management Screening Employee Training Succession Planning Management Job Descriptions IT Recruitment Benefits Negotiation Performance Appraisal Payroll Talent Management Organizational... Performance Management Internet Recruiting Compensation & Benefits See 22+     See less Education Amity Business School MBA 2008  – 2010 Banasthali Vidyapith B.Sc 2005  – 2008 City Montessori School ISC 2002  – 2004 Amity Business School MBA 2008  – 2010 Amity Business School MBA 2008  – 2010 Amity Business School MBA 2008  – 2010 Banasthali Vidyapith B.Sc 2005  – 2008 Banasthali Vidyapith B.Sc 2005  – 2008 Banasthali Vidyapith B.Sc 2005  – 2008 City Montessori School ISC 2002  – 2004 City Montessori School ISC 2002  – 2004 City Montessori School ISC 2002  – 2004 Honors & Awards Special Recognition Pitney Bowes India 2012 Received special recognition award in town hall meetings for contribution towards setting up R&D center in Pune @ Pitney Bowes India Appreciation Award for Exemplary performance Pitney Bowes India 2012 Received Appreciation Award for Exemplary performance @ Pitney Bowes India Rising Star Award Makemytrip October 2013 Received Rising star Award for efforts leading to fruitful results @ Makemytrip Special Recognition Pitney Bowes India 2012 Received special recognition award in town hall meetings for contribution towards setting up R&D center in Pune @ Pitney Bowes India Special Recognition Pitney Bowes India 2012 Received special recognition award in town hall meetings for contribution towards setting up R&D center in Pune @ Pitney Bowes India Special Recognition Pitney Bowes India 2012 Received special recognition award in town hall meetings for contribution towards setting up R&D center in Pune @ Pitney Bowes India Appreciation Award for Exemplary performance Pitney Bowes India 2012 Received Appreciation Award for Exemplary performance @ Pitney Bowes India Appreciation Award for Exemplary performance Pitney Bowes India 2012 Received Appreciation Award for Exemplary performance @ Pitney Bowes India Appreciation Award for Exemplary performance Pitney Bowes India 2012 Received Appreciation Award for Exemplary performance @ Pitney Bowes India Rising Star Award Makemytrip October 2013 Received Rising star Award for efforts leading to fruitful results @ Makemytrip Rising Star Award Makemytrip October 2013 Received Rising star Award for efforts leading to fruitful results @ Makemytrip Rising Star Award Makemytrip October 2013 Received Rising star Award for efforts leading to fruitful results @ Makemytrip ", "Experience Recruiter, Google Access Google December 2013  – Present (1 year 9 months) San Francisco Bay Area Currently supporting full-cycle recruitment for multiple business units across Google Access. Campus Recruiter Accenture May 2013  –  December 2013  (8 months) San Francisco Bay Area Perform full-cycle recruitment for Northern California (San Francisco, San Jose, Sacramento) and Seattle offices in line with client requirements, HR and business to fill approved open positions in alignment with business objectives  \n \nSource and pre-qualify candidates that match client requirements, primarily by leveraging technical backgrounds \n \nAssist with the communication and execution of recruiting strategies and marketing efforts for colleges/universities to campus teams/stakeholders \n \nBuild relationships and serve as the lead for Accenture campus teams, career center personnel, college faculty, and diverse student organizations \n \nResponsible for entry level consulting recruiting at University of California, Berkeley and University of Washington  \n \nPlan, coordinate and execute all logistical elements for on-campus marketing efforts (i.e., information sessions, career fairs) and interviewing efforts (i.e., establish interviewing dates, solicit and schedule interviewers, prepare interviewing materials) \n \nReview resumes and interview candidates to assess against entry-level profile; make next step decisions Lead College Recruiter Ross Stores, Inc. July 2011  –  May 2013  (1 year 11 months) San Francisco Bay Area Responsible for full-cycle college recruitment for over 1,200 Ross Dress for Less and dd's Discount stores nationwide and corporate candidates including attraction, selection, on-boarding, review and program analysis for all college hires and interns  \n \nSupport and implement college recruiting efforts for Management Trainee Program, Assistant Store Manager Internship Program, Corporate Internship Program and Loss Prevention Internship Program  \n \nPartner with college recruiting team and hiring managers to define and develop key strategies to build a pipeline of talent and brand awareness at universities nationwide  \n \nExecute against strategies and increased year-over-year growth by over 200%  \n \nDevelop and build relationships with over 75 universities nationwide including career centers, professors, and diverse clubs \n \nOn-board all corporate and stores college hires, conduct reviews, compile program analysis and proposal for management to measure results and review process improvements to continually hit hiring goals  \n \nPlan, coordinate and travel to campus events, on-campus interviews, information sessions, orientations, and workshops  \n \nReport program results and strategy changes with the College Recruiting Manager and Director of Talent Acquisition to the College Recruitment Steering Committee including the President/COO, EVP of Stores, and various senior executives \n \nPresent and train hiring managers on college recruiting processes, conduct manager and interviewer trainings, facilitate orientation and best practices to manage college hires and interns at annual college recruiting kick offs \n \nControl $300K college recruitment budget while maintaining brand and momentum on campuses  \n \nCollaborate with Employee Relations, Travel, Relocation and Legal to provide accurate information and services to candidates and hiring managers based on program parameters Staffing Consultant Randstad July 2010  –  July 2011  (1 year 1 month) Sacramento, California Area Proactively develop new business through a high volume of outbound calls and client meetings with decision makers and managers for the purpose of prospecting new business and identifying key project needs \n \nRecruit, interview and match skilled professionals with clients’ projects, temporary assignments and permanent opportunities \n \nServe as a liaison between candidates and clients in negotiating and setting bill rates and budgets \n \nAct as a consultant to candidates and clients on market trends in hiring, salary expectations and employee retention strategies \n \nProvide executive strategic sourcing techniques to include a variety of resources such as internet, advertising, employee referrals, direct sourcing and job fairs \n \nManage Human Resources of staff on temporary assignments (120+) from on-boarding through termination \n \nSolidifying Randstad’s presence in the local market through consistent participation in networking organizations and events Executive Assistant Wells Fargo Business Payroll Services December 2009  –  April 2010  (5 months) Greater San Diego Area Recruiter, Google Access Google December 2013  – Present (1 year 9 months) San Francisco Bay Area Currently supporting full-cycle recruitment for multiple business units across Google Access. Recruiter, Google Access Google December 2013  – Present (1 year 9 months) San Francisco Bay Area Currently supporting full-cycle recruitment for multiple business units across Google Access. Campus Recruiter Accenture May 2013  –  December 2013  (8 months) San Francisco Bay Area Perform full-cycle recruitment for Northern California (San Francisco, San Jose, Sacramento) and Seattle offices in line with client requirements, HR and business to fill approved open positions in alignment with business objectives  \n \nSource and pre-qualify candidates that match client requirements, primarily by leveraging technical backgrounds \n \nAssist with the communication and execution of recruiting strategies and marketing efforts for colleges/universities to campus teams/stakeholders \n \nBuild relationships and serve as the lead for Accenture campus teams, career center personnel, college faculty, and diverse student organizations \n \nResponsible for entry level consulting recruiting at University of California, Berkeley and University of Washington  \n \nPlan, coordinate and execute all logistical elements for on-campus marketing efforts (i.e., information sessions, career fairs) and interviewing efforts (i.e., establish interviewing dates, solicit and schedule interviewers, prepare interviewing materials) \n \nReview resumes and interview candidates to assess against entry-level profile; make next step decisions Campus Recruiter Accenture May 2013  –  December 2013  (8 months) San Francisco Bay Area Perform full-cycle recruitment for Northern California (San Francisco, San Jose, Sacramento) and Seattle offices in line with client requirements, HR and business to fill approved open positions in alignment with business objectives  \n \nSource and pre-qualify candidates that match client requirements, primarily by leveraging technical backgrounds \n \nAssist with the communication and execution of recruiting strategies and marketing efforts for colleges/universities to campus teams/stakeholders \n \nBuild relationships and serve as the lead for Accenture campus teams, career center personnel, college faculty, and diverse student organizations \n \nResponsible for entry level consulting recruiting at University of California, Berkeley and University of Washington  \n \nPlan, coordinate and execute all logistical elements for on-campus marketing efforts (i.e., information sessions, career fairs) and interviewing efforts (i.e., establish interviewing dates, solicit and schedule interviewers, prepare interviewing materials) \n \nReview resumes and interview candidates to assess against entry-level profile; make next step decisions Lead College Recruiter Ross Stores, Inc. July 2011  –  May 2013  (1 year 11 months) San Francisco Bay Area Responsible for full-cycle college recruitment for over 1,200 Ross Dress for Less and dd's Discount stores nationwide and corporate candidates including attraction, selection, on-boarding, review and program analysis for all college hires and interns  \n \nSupport and implement college recruiting efforts for Management Trainee Program, Assistant Store Manager Internship Program, Corporate Internship Program and Loss Prevention Internship Program  \n \nPartner with college recruiting team and hiring managers to define and develop key strategies to build a pipeline of talent and brand awareness at universities nationwide  \n \nExecute against strategies and increased year-over-year growth by over 200%  \n \nDevelop and build relationships with over 75 universities nationwide including career centers, professors, and diverse clubs \n \nOn-board all corporate and stores college hires, conduct reviews, compile program analysis and proposal for management to measure results and review process improvements to continually hit hiring goals  \n \nPlan, coordinate and travel to campus events, on-campus interviews, information sessions, orientations, and workshops  \n \nReport program results and strategy changes with the College Recruiting Manager and Director of Talent Acquisition to the College Recruitment Steering Committee including the President/COO, EVP of Stores, and various senior executives \n \nPresent and train hiring managers on college recruiting processes, conduct manager and interviewer trainings, facilitate orientation and best practices to manage college hires and interns at annual college recruiting kick offs \n \nControl $300K college recruitment budget while maintaining brand and momentum on campuses  \n \nCollaborate with Employee Relations, Travel, Relocation and Legal to provide accurate information and services to candidates and hiring managers based on program parameters Lead College Recruiter Ross Stores, Inc. July 2011  –  May 2013  (1 year 11 months) San Francisco Bay Area Responsible for full-cycle college recruitment for over 1,200 Ross Dress for Less and dd's Discount stores nationwide and corporate candidates including attraction, selection, on-boarding, review and program analysis for all college hires and interns  \n \nSupport and implement college recruiting efforts for Management Trainee Program, Assistant Store Manager Internship Program, Corporate Internship Program and Loss Prevention Internship Program  \n \nPartner with college recruiting team and hiring managers to define and develop key strategies to build a pipeline of talent and brand awareness at universities nationwide  \n \nExecute against strategies and increased year-over-year growth by over 200%  \n \nDevelop and build relationships with over 75 universities nationwide including career centers, professors, and diverse clubs \n \nOn-board all corporate and stores college hires, conduct reviews, compile program analysis and proposal for management to measure results and review process improvements to continually hit hiring goals  \n \nPlan, coordinate and travel to campus events, on-campus interviews, information sessions, orientations, and workshops  \n \nReport program results and strategy changes with the College Recruiting Manager and Director of Talent Acquisition to the College Recruitment Steering Committee including the President/COO, EVP of Stores, and various senior executives \n \nPresent and train hiring managers on college recruiting processes, conduct manager and interviewer trainings, facilitate orientation and best practices to manage college hires and interns at annual college recruiting kick offs \n \nControl $300K college recruitment budget while maintaining brand and momentum on campuses  \n \nCollaborate with Employee Relations, Travel, Relocation and Legal to provide accurate information and services to candidates and hiring managers based on program parameters Staffing Consultant Randstad July 2010  –  July 2011  (1 year 1 month) Sacramento, California Area Proactively develop new business through a high volume of outbound calls and client meetings with decision makers and managers for the purpose of prospecting new business and identifying key project needs \n \nRecruit, interview and match skilled professionals with clients’ projects, temporary assignments and permanent opportunities \n \nServe as a liaison between candidates and clients in negotiating and setting bill rates and budgets \n \nAct as a consultant to candidates and clients on market trends in hiring, salary expectations and employee retention strategies \n \nProvide executive strategic sourcing techniques to include a variety of resources such as internet, advertising, employee referrals, direct sourcing and job fairs \n \nManage Human Resources of staff on temporary assignments (120+) from on-boarding through termination \n \nSolidifying Randstad’s presence in the local market through consistent participation in networking organizations and events Staffing Consultant Randstad July 2010  –  July 2011  (1 year 1 month) Sacramento, California Area Proactively develop new business through a high volume of outbound calls and client meetings with decision makers and managers for the purpose of prospecting new business and identifying key project needs \n \nRecruit, interview and match skilled professionals with clients’ projects, temporary assignments and permanent opportunities \n \nServe as a liaison between candidates and clients in negotiating and setting bill rates and budgets \n \nAct as a consultant to candidates and clients on market trends in hiring, salary expectations and employee retention strategies \n \nProvide executive strategic sourcing techniques to include a variety of resources such as internet, advertising, employee referrals, direct sourcing and job fairs \n \nManage Human Resources of staff on temporary assignments (120+) from on-boarding through termination \n \nSolidifying Randstad’s presence in the local market through consistent participation in networking organizations and events Executive Assistant Wells Fargo Business Payroll Services December 2009  –  April 2010  (5 months) Greater San Diego Area Executive Assistant Wells Fargo Business Payroll Services December 2009  –  April 2010  (5 months) Greater San Diego Area Skills Microsoft Office Expenses Business Travel... Screening Resumes Calendaring Onboarding Process Improvement College Recruiting Human Resources Recruiting Employee Relations Talent Acquisition Applicant Tracking... Customer Service Hiring Retail Training Management New Hire Orientations Taleo BrassRing Technical Recruiting See 7+     See less Skills  Microsoft Office Expenses Business Travel... Screening Resumes Calendaring Onboarding Process Improvement College Recruiting Human Resources Recruiting Employee Relations Talent Acquisition Applicant Tracking... Customer Service Hiring Retail Training Management New Hire Orientations Taleo BrassRing Technical Recruiting See 7+     See less Microsoft Office Expenses Business Travel... Screening Resumes Calendaring Onboarding Process Improvement College Recruiting Human Resources Recruiting Employee Relations Talent Acquisition Applicant Tracking... Customer Service Hiring Retail Training Management New Hire Orientations Taleo BrassRing Technical Recruiting See 7+     See less Microsoft Office Expenses Business Travel... Screening Resumes Calendaring Onboarding Process Improvement College Recruiting Human Resources Recruiting Employee Relations Talent Acquisition Applicant Tracking... Customer Service Hiring Retail Training Management New Hire Orientations Taleo BrassRing Technical Recruiting See 7+     See less Education California Polytechnic State University-San Luis Obispo California Multiple Subject Teaching Credential, Education 2008  – 2009 California Polytechnic State University-San Luis Obispo Bachelor of Science,  Liberal Studies with an Art Education emphasis 2004  – 2009 Dean's List multiple quarters \nCal Poly London Study Abroad Program Activities and Societies:  Alpha Chi Omega California Polytechnic State University-San Luis Obispo California Multiple Subject Teaching Credential, Education 2008  – 2009 California Polytechnic State University-San Luis Obispo California Multiple Subject Teaching Credential, Education 2008  – 2009 California Polytechnic State University-San Luis Obispo California Multiple Subject Teaching Credential, Education 2008  – 2009 California Polytechnic State University-San Luis Obispo Bachelor of Science,  Liberal Studies with an Art Education emphasis 2004  – 2009 Dean's List multiple quarters \nCal Poly London Study Abroad Program Activities and Societies:  Alpha Chi Omega California Polytechnic State University-San Luis Obispo Bachelor of Science,  Liberal Studies with an Art Education emphasis 2004  – 2009 Dean's List multiple quarters \nCal Poly London Study Abroad Program Activities and Societies:  Alpha Chi Omega California Polytechnic State University-San Luis Obispo Bachelor of Science,  Liberal Studies with an Art Education emphasis 2004  – 2009 Dean's List multiple quarters \nCal Poly London Study Abroad Program Activities and Societies:  Alpha Chi Omega ", "Honors & Awards Leaders Club/President's Club-2011 Leaders Club/President's Club-2011 Leaders Club/President's Club-2011 Leaders Club/President's Club-2011 ", "Skills Recruiting Human Resources Marketing Mobile Devices Market Research Temporary Placement Public Relations Hiring Customer Satisfaction Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Talent Management Onboarding Skills  Recruiting Human Resources Marketing Mobile Devices Market Research Temporary Placement Public Relations Hiring Customer Satisfaction Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Talent Management Onboarding Recruiting Human Resources Marketing Mobile Devices Market Research Temporary Placement Public Relations Hiring Customer Satisfaction Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Talent Management Onboarding Recruiting Human Resources Marketing Mobile Devices Market Research Temporary Placement Public Relations Hiring Customer Satisfaction Applicant Tracking... Talent Acquisition Technical Recruiting Internet Recruiting Talent Management Onboarding ", "Summary Silicon Valley is not just a place, it's a state of mind... \n \nWith a deep pool of talent in my continuously growing network and an eye towards technical innovation, I'm consistently helping make connections that change the direction of companies and individuals alike. Always open to conversations that lead to mutually beneficial relationships and compelling career opportunities. How can we help each other today? \n \nI've helped build teams for some of the hottest startups around and am constantly working on developing software and technical tools that change the way we do business. I hire great people but I also write clean code and push the envelope of technical innovation with a desire to be the best. Way before I became a recruiter, I taught myself how to code in various languages such as Python, Objective-C, C#, etc. and helped create cutting edge technical tools. I then decided I also wanted to help build great teams and change businesses dynamically in more ways than one, so I decided to learn recruiting from some of the best in the business.  \n \nConnect with me if you want to witness the true power of networking and relationship building. \n \n* Expert Linkedin user who is well connected with thousands of global connections \n* Excellent writer and communicator with top notch references \n* Outstanding ability to find and hire passive talent while quickly filtering through active candidates \n* Expert boolean search and algorithm analysis skills \n* Computer science knowledge and strong engineering background \n* Absolutely unflappable under pressure with the ability to stand tall under any and all circumstances \n \nAs one of the most connected people on Linkedin, I'm always building upon my substantial network of professionals and companies. Whether you are a fellow recruiter/HR person, a job seeker, an employer seeking help or a product marketer looking to innovate the recruiting space, reach out to me if you feel that we can add value to our respective networks and goals. Specialties:★ Recruiting, Marketing, Human Resources, Strategic Sourcing, Talent Acquisition, Project and Process Management, Customer Service, Salary Negotiation, Management Training, Team Building, Advanced Boolean Search, Process Improvement, Staffing, Behavioral Interviewing, ATS Management, System Administration, Motivational Strategy, Market Research, Innovation, Social Media, Facebook, LinkedIn, Twitter, Blogging, HTML5, Human Capital Management, High Tech, Talent Mining, Semantic Search, Google Summary Silicon Valley is not just a place, it's a state of mind... \n \nWith a deep pool of talent in my continuously growing network and an eye towards technical innovation, I'm consistently helping make connections that change the direction of companies and individuals alike. Always open to conversations that lead to mutually beneficial relationships and compelling career opportunities. How can we help each other today? \n \nI've helped build teams for some of the hottest startups around and am constantly working on developing software and technical tools that change the way we do business. I hire great people but I also write clean code and push the envelope of technical innovation with a desire to be the best. Way before I became a recruiter, I taught myself how to code in various languages such as Python, Objective-C, C#, etc. and helped create cutting edge technical tools. I then decided I also wanted to help build great teams and change businesses dynamically in more ways than one, so I decided to learn recruiting from some of the best in the business.  \n \nConnect with me if you want to witness the true power of networking and relationship building. \n \n* Expert Linkedin user who is well connected with thousands of global connections \n* Excellent writer and communicator with top notch references \n* Outstanding ability to find and hire passive talent while quickly filtering through active candidates \n* Expert boolean search and algorithm analysis skills \n* Computer science knowledge and strong engineering background \n* Absolutely unflappable under pressure with the ability to stand tall under any and all circumstances \n \nAs one of the most connected people on Linkedin, I'm always building upon my substantial network of professionals and companies. Whether you are a fellow recruiter/HR person, a job seeker, an employer seeking help or a product marketer looking to innovate the recruiting space, reach out to me if you feel that we can add value to our respective networks and goals. Specialties:★ Recruiting, Marketing, Human Resources, Strategic Sourcing, Talent Acquisition, Project and Process Management, Customer Service, Salary Negotiation, Management Training, Team Building, Advanced Boolean Search, Process Improvement, Staffing, Behavioral Interviewing, ATS Management, System Administration, Motivational Strategy, Market Research, Innovation, Social Media, Facebook, LinkedIn, Twitter, Blogging, HTML5, Human Capital Management, High Tech, Talent Mining, Semantic Search, Google Silicon Valley is not just a place, it's a state of mind... \n \nWith a deep pool of talent in my continuously growing network and an eye towards technical innovation, I'm consistently helping make connections that change the direction of companies and individuals alike. Always open to conversations that lead to mutually beneficial relationships and compelling career opportunities. How can we help each other today? \n \nI've helped build teams for some of the hottest startups around and am constantly working on developing software and technical tools that change the way we do business. I hire great people but I also write clean code and push the envelope of technical innovation with a desire to be the best. Way before I became a recruiter, I taught myself how to code in various languages such as Python, Objective-C, C#, etc. and helped create cutting edge technical tools. I then decided I also wanted to help build great teams and change businesses dynamically in more ways than one, so I decided to learn recruiting from some of the best in the business.  \n \nConnect with me if you want to witness the true power of networking and relationship building. \n \n* Expert Linkedin user who is well connected with thousands of global connections \n* Excellent writer and communicator with top notch references \n* Outstanding ability to find and hire passive talent while quickly filtering through active candidates \n* Expert boolean search and algorithm analysis skills \n* Computer science knowledge and strong engineering background \n* Absolutely unflappable under pressure with the ability to stand tall under any and all circumstances \n \nAs one of the most connected people on Linkedin, I'm always building upon my substantial network of professionals and companies. Whether you are a fellow recruiter/HR person, a job seeker, an employer seeking help or a product marketer looking to innovate the recruiting space, reach out to me if you feel that we can add value to our respective networks and goals. Specialties:★ Recruiting, Marketing, Human Resources, Strategic Sourcing, Talent Acquisition, Project and Process Management, Customer Service, Salary Negotiation, Management Training, Team Building, Advanced Boolean Search, Process Improvement, Staffing, Behavioral Interviewing, ATS Management, System Administration, Motivational Strategy, Market Research, Innovation, Social Media, Facebook, LinkedIn, Twitter, Blogging, HTML5, Human Capital Management, High Tech, Talent Mining, Semantic Search, Google Silicon Valley is not just a place, it's a state of mind... \n \nWith a deep pool of talent in my continuously growing network and an eye towards technical innovation, I'm consistently helping make connections that change the direction of companies and individuals alike. Always open to conversations that lead to mutually beneficial relationships and compelling career opportunities. How can we help each other today? \n \nI've helped build teams for some of the hottest startups around and am constantly working on developing software and technical tools that change the way we do business. I hire great people but I also write clean code and push the envelope of technical innovation with a desire to be the best. Way before I became a recruiter, I taught myself how to code in various languages such as Python, Objective-C, C#, etc. and helped create cutting edge technical tools. I then decided I also wanted to help build great teams and change businesses dynamically in more ways than one, so I decided to learn recruiting from some of the best in the business.  \n \nConnect with me if you want to witness the true power of networking and relationship building. \n \n* Expert Linkedin user who is well connected with thousands of global connections \n* Excellent writer and communicator with top notch references \n* Outstanding ability to find and hire passive talent while quickly filtering through active candidates \n* Expert boolean search and algorithm analysis skills \n* Computer science knowledge and strong engineering background \n* Absolutely unflappable under pressure with the ability to stand tall under any and all circumstances \n \nAs one of the most connected people on Linkedin, I'm always building upon my substantial network of professionals and companies. Whether you are a fellow recruiter/HR person, a job seeker, an employer seeking help or a product marketer looking to innovate the recruiting space, reach out to me if you feel that we can add value to our respective networks and goals. Specialties:★ Recruiting, Marketing, Human Resources, Strategic Sourcing, Talent Acquisition, Project and Process Management, Customer Service, Salary Negotiation, Management Training, Team Building, Advanced Boolean Search, Process Improvement, Staffing, Behavioral Interviewing, ATS Management, System Administration, Motivational Strategy, Market Research, Innovation, Social Media, Facebook, LinkedIn, Twitter, Blogging, HTML5, Human Capital Management, High Tech, Talent Mining, Semantic Search, Google Experience ★ Revolutionary Recruiter, Android and Google Play Google 2014  – Present (1 year) Mountain View, Ca I was brought on at Google to build teams globally and strategically and develop process improvements while recruiting for difficult high priority roles within the fastest growing teams. I also mentor and train junior recruiters and sourcers on advanced strategies. I'm responsible for creating opportunities and growing the Android (Google Play, Google Shopping Express) segment of the business and welcome the opportunity to connect and chat with talented individuals in this rapidly growing space. \n \nGoogle has continuously been recognized as the best place to work for many reasons and I get to experience it every day. My goal is to help attract even more great talent to help further the already globally powerful brand and build upon the foundation that makes Google the world leader in technological innovation. \n \nWant to work on a small team with a startup type of environment? The teams I'm building within Google operate as unique units with lots of room for growth and a chance to have immediate sustainable impact. Think, small agile teams that allow you plenty of freedom to be creative and work dynamically with all the resources and branding that goes with being a member of Google. I work everyday on products that hundreds of millions of people use worldwide! \n \nGlobally growing the Android, Google Play and Google Shopping Express teams.  \n \n- Global Merchandising Lead, Google Play Kids \n- Operations Manager, Google Play Gift Cards \n- Product Specialist, Google Play \n- Developer Product Marketing Manager (Google Play) \n- Newsstand, Executive Producer(Google Play) \n- Product Marketing Manager, Google Play ★ Revolutionary Recruiter The Hottest Startups and Businesses in Silicon Valley January 2009  – Present (6 years 8 months) Mountain View, CA Bridging the gap between top tech talent and the needs of clients. I utilize intricate boolean searches as well as social media, networking and leveraging information systems to identify potential candidates and help pair them with career opportunities that make sense for all parties involved. I am currently looking to match my skills and passion for recruiting with an organization that values great communication and embraces emerging technologies. \n \nNeed an edge in this talent war? I've got a proven track record of achieving corporate goals as well as helping startups ramp up in their most desperate times of need. I have a passion for what I do and it shows with my results. \n \nAlso, I'm a dedicated technologist. I not only understand the technical terms that are prevalent in the high tech world, but I engage in the communities (Stack Overflow, GitHub, Quora, etc.) where engineers hang out and have written code with various languages. I have expertly worked in cross platform environments including Windows, Mac, Linux, iOS and Android and can navigate them easily. I have mastery of ATS such as Jobvite and can learn any software faster than you can imagine due to my technical background.  \n \nI have experience sourcing and hiring for the following high tech positions: Software Engineers (Front End, Back End), Java Developer, Systems Architect, Sr. System Administrator, Oracle PL/SQL Developer, Python, Ruby on Rails, C++ Programmers, Perl and many more. \n \nI am a research expert who is constantly searching for innovative ways to do business. Acquiring new skills and methodologies is only part of my repertoire. The way we do sourcing and recruiting is changing and I embrace that change. \n \nContact me if you think we could do great business together. I plan to help lead the next recruiting revolution! CEO/ Innovative Software Engineer Dark Matter January 2000  – Present (15 years 8 months) Mountain View, CA Developing algorithms for optimal information retrieval and penetrating systems. I create software that is designed to be elegant, user friendly, intuitive and secure.  \n \nCurrently working on mobile and console game development and system architecture. I use Python to run scripts on the back-end and Swift for mobile. \n \nI have developed mobile apps, desktop applications, and software security modules in addition to website development for clients of all shapes and sizes. I write clean code and challenge all those around me to be their best. (Python, RoR, JavaScript, Java, Objective-C,etc.) ★ Revolutionary Recruiter Nok Nok Labs June 2012  –  February 2013  (9 months) Palo Alto, CA As the first true recruiting expert, I successfully built the engineering and product teams and closed critical positions under a stealth banner without the benefit of branding, a website, or being able to share much product info. The challenge was incredible but the results remained the same, I did exactly what I was brought in to do. \n \nI was solely responsible for developing recruiting processes and strategies while effectively managing the talent pipeline using the Jobvite applicant tracking system. I also managed Jobvite training and taught managers and employees how to utilize the system. \n \nAdditionally, I quickly hired top quality interns and entry level engineering talent by utilizing university recruiting strategies and leveraging all available resources to ensure the staff had all the support they needed. \n \n \nPositions I filled so far:  \n \nDirector of Engineering \nSr. QA Engineers  \nSr. Software Engineers (C++ and Windows) \nSr. Java Developers \nProduct Marketing Manager \nLead Architect \nPHP Developer \nInterns (Client, Server, QA, Advanced Technology Group) \nEntry Level Engineers (C++ and Java) Sr. Recruiter Aeria Games & Entertainment September 2011  –  February 2012  (6 months) San Francisco Bay Area Social gaming is one of the most competitive industries in the world. As the first in house recruiter, I was responsible for establishing recruiting best practices and helping build teams across the organization. I successfully attracted candidates from top gaming companies such as Electronic Arts, Zynga, Gala Net, Kabam, Digital Chocolate, RockYou, Ubisoft and more. I successfully helped the business grow with the right talent in the incredibly competitive and fast growing social gaming space. \n \nBuilding upon a true understanding of the candidate experience, I attracted and hired top talent using every available tool in the book and established a positive employment brand in a competitive industry.  \n \nIn addition, I utilized a proprietary customized search engine to dig deep into the massive resources of the Internet and produced quality candidates that were otherwise unattainable using common tactics. \n \n \n► Hired Web Developers, Executive Producer, Release Associate,Release Team Assistant,Product Manager, Senior Business Intelligence Manager, Sr. Software Engineers, Technical Operations Manager, Desktop Support Tech, etc. Sr. Technical Recruiter (Contract) Egnyte March 2011  –  August 2011  (6 months) San Francisco Bay Area As the sole recruiting resource at this fast paced cloud storage startup, I helped build the engineering and marketing teams from the ground up under intense pressure and fierce competition. Egnyte only had 24 employees when I joined and that number now sits near 50. \n \nI hired people for the following positions: Lead Cloud Architect, Sr. Engineers (Java and Python), Operations Engineer, Mac Engineer, Technical Support Engineer, Product Marketing Manager, Sr. Web Designer, Sr. Product Manager and more. \n \n*Proven ability to poach and attract top talent from competitors and start-ups as well as big companies. \n \nI'm proud of the work I've done and the fact that I've helped change people's lives for the better. Now I'm seeking the next challenge and a great career opportunity where I can continue doing work that makes a big impact. Senior Technical Recruiter / Engineer Zax 2009  –  January 2011  (2 years) San Francisco Bay Area Managing and facilitating the recruitment process alongside HR functions and payroll. Created resource list for team of recruiters to facilitate the search of qualified candidates. Recruiting numerous software positions in the IT sector including Project Managers, Engineers and other software related positions for Fortune 500 companies. \n \nTrained and led a team of recruiters while delivering highly productive sourcing solutions to find and draw top talent worldwide. \n \n• Recruiter of the year for 2009 and 2010 Recruiter Thermo Fisher Scientific June 2007  –  October 2008  (1 year 5 months) San Jose, CA Quickly accelerated job responsibilities based on ability to consistently deliver highly desirable results and work with a sense of urgency. Facilitated an effective recruitment process by maintaining excellent communication and taking a proactive approach to problem solving and understanding business needs. \n \n \n• Sourced and recruited all levels of positions including Marketing, Software Engineers, Interns, Director Level, Finance, Operations and Scientists in a fast paced and challenging corporate setting \n \n• Partnered with recruiters and hiring managers to leverage resources, generate ideas and establish reliable lines of communication \n \n• Owned full cycle recruiting efforts from sourcing candidates, interviewing, preparing offer letters and closing requisitions while ensuring best matches for hiring managers and candidates \n \n• Drove initiative to effectively implement employee referral program which helped generate more prospects and engaged employees in active recruiting efforts across the division \n \n• Promoted positive energy within the workplace by taking the pulse of the environment and being approachable as well as affable in communication \n \n• As system administrator for applicant tracking system for entire corporate group, trained over 100 hiring managers on its usage and managed data accurately and consistently \n \n• Directed and assisted employees in regards to questions about benefits, job opportunities and various HR functions \n \n• Completed courses in process improvement and helped champion efforts to cut costs by nearly 20% for demo labs and improve business efficiency, saving over $50,000 within first six months \n \n• Managed job description database and posted jobs to job boards as well as the internal system Technical Sourcer/Recruiter and Web Developer CIQ January 2006  –  December 2006  (1 year) Worked effectively and efficiently performing sourcing/recruitment duties in filling IT and other technical positions in a fast paced startup environment by completing work accurately and according to timelines. Gained client confidence by going beyond the standard and providing an exceptional experience. \n \nOn the web dev side, I created mockups using Balsamiq and Mockingbird and wrote scripts using Python to help deliver web services. HR Manager Peninsula Ford of Palo Alto 2003  –  2005  (2 years) Supported business leaders in day to day operations while proving to be reliable and efficient. Provided excellent customer service and helped install a new business model that emphasized dependable communication and attention to detail. \n \n \n• Led efforts to run an effective HR business model by recruiting and identifying opportunities for effective project management with an emphasis on customer service and minimizing redundancy \n \n• Responsible for recruiting talent to fill priority positions on a consistent basis \n \n• Managed service records and audited confidential files for accuracy and completion \n \n• Acted as gate keeper for executives to help expedite the flow of work from their office \n \n• Reviewed documentation and distributed correspondence for entire office as needed \n \n• Performed critical administrative duties such as scheduling meetings, maintaining files, greeting customers and preparing presentations for crucial business meetings ★ Revolutionary Recruiter, Android and Google Play Google 2014  – Present (1 year) Mountain View, Ca I was brought on at Google to build teams globally and strategically and develop process improvements while recruiting for difficult high priority roles within the fastest growing teams. I also mentor and train junior recruiters and sourcers on advanced strategies. I'm responsible for creating opportunities and growing the Android (Google Play, Google Shopping Express) segment of the business and welcome the opportunity to connect and chat with talented individuals in this rapidly growing space. \n \nGoogle has continuously been recognized as the best place to work for many reasons and I get to experience it every day. My goal is to help attract even more great talent to help further the already globally powerful brand and build upon the foundation that makes Google the world leader in technological innovation. \n \nWant to work on a small team with a startup type of environment? The teams I'm building within Google operate as unique units with lots of room for growth and a chance to have immediate sustainable impact. Think, small agile teams that allow you plenty of freedom to be creative and work dynamically with all the resources and branding that goes with being a member of Google. I work everyday on products that hundreds of millions of people use worldwide! \n \nGlobally growing the Android, Google Play and Google Shopping Express teams.  \n \n- Global Merchandising Lead, Google Play Kids \n- Operations Manager, Google Play Gift Cards \n- Product Specialist, Google Play \n- Developer Product Marketing Manager (Google Play) \n- Newsstand, Executive Producer(Google Play) \n- Product Marketing Manager, Google Play ★ Revolutionary Recruiter, Android and Google Play Google 2014  – Present (1 year) Mountain View, Ca I was brought on at Google to build teams globally and strategically and develop process improvements while recruiting for difficult high priority roles within the fastest growing teams. I also mentor and train junior recruiters and sourcers on advanced strategies. I'm responsible for creating opportunities and growing the Android (Google Play, Google Shopping Express) segment of the business and welcome the opportunity to connect and chat with talented individuals in this rapidly growing space. \n \nGoogle has continuously been recognized as the best place to work for many reasons and I get to experience it every day. My goal is to help attract even more great talent to help further the already globally powerful brand and build upon the foundation that makes Google the world leader in technological innovation. \n \nWant to work on a small team with a startup type of environment? The teams I'm building within Google operate as unique units with lots of room for growth and a chance to have immediate sustainable impact. Think, small agile teams that allow you plenty of freedom to be creative and work dynamically with all the resources and branding that goes with being a member of Google. I work everyday on products that hundreds of millions of people use worldwide! \n \nGlobally growing the Android, Google Play and Google Shopping Express teams.  \n \n- Global Merchandising Lead, Google Play Kids \n- Operations Manager, Google Play Gift Cards \n- Product Specialist, Google Play \n- Developer Product Marketing Manager (Google Play) \n- Newsstand, Executive Producer(Google Play) \n- Product Marketing Manager, Google Play ★ Revolutionary Recruiter The Hottest Startups and Businesses in Silicon Valley January 2009  – Present (6 years 8 months) Mountain View, CA Bridging the gap between top tech talent and the needs of clients. I utilize intricate boolean searches as well as social media, networking and leveraging information systems to identify potential candidates and help pair them with career opportunities that make sense for all parties involved. I am currently looking to match my skills and passion for recruiting with an organization that values great communication and embraces emerging technologies. \n \nNeed an edge in this talent war? I've got a proven track record of achieving corporate goals as well as helping startups ramp up in their most desperate times of need. I have a passion for what I do and it shows with my results. \n \nAlso, I'm a dedicated technologist. I not only understand the technical terms that are prevalent in the high tech world, but I engage in the communities (Stack Overflow, GitHub, Quora, etc.) where engineers hang out and have written code with various languages. I have expertly worked in cross platform environments including Windows, Mac, Linux, iOS and Android and can navigate them easily. I have mastery of ATS such as Jobvite and can learn any software faster than you can imagine due to my technical background.  \n \nI have experience sourcing and hiring for the following high tech positions: Software Engineers (Front End, Back End), Java Developer, Systems Architect, Sr. System Administrator, Oracle PL/SQL Developer, Python, Ruby on Rails, C++ Programmers, Perl and many more. \n \nI am a research expert who is constantly searching for innovative ways to do business. Acquiring new skills and methodologies is only part of my repertoire. The way we do sourcing and recruiting is changing and I embrace that change. \n \nContact me if you think we could do great business together. I plan to help lead the next recruiting revolution! ★ Revolutionary Recruiter The Hottest Startups and Businesses in Silicon Valley January 2009  – Present (6 years 8 months) Mountain View, CA Bridging the gap between top tech talent and the needs of clients. I utilize intricate boolean searches as well as social media, networking and leveraging information systems to identify potential candidates and help pair them with career opportunities that make sense for all parties involved. I am currently looking to match my skills and passion for recruiting with an organization that values great communication and embraces emerging technologies. \n \nNeed an edge in this talent war? I've got a proven track record of achieving corporate goals as well as helping startups ramp up in their most desperate times of need. I have a passion for what I do and it shows with my results. \n \nAlso, I'm a dedicated technologist. I not only understand the technical terms that are prevalent in the high tech world, but I engage in the communities (Stack Overflow, GitHub, Quora, etc.) where engineers hang out and have written code with various languages. I have expertly worked in cross platform environments including Windows, Mac, Linux, iOS and Android and can navigate them easily. I have mastery of ATS such as Jobvite and can learn any software faster than you can imagine due to my technical background.  \n \nI have experience sourcing and hiring for the following high tech positions: Software Engineers (Front End, Back End), Java Developer, Systems Architect, Sr. System Administrator, Oracle PL/SQL Developer, Python, Ruby on Rails, C++ Programmers, Perl and many more. \n \nI am a research expert who is constantly searching for innovative ways to do business. Acquiring new skills and methodologies is only part of my repertoire. The way we do sourcing and recruiting is changing and I embrace that change. \n \nContact me if you think we could do great business together. I plan to help lead the next recruiting revolution! CEO/ Innovative Software Engineer Dark Matter January 2000  – Present (15 years 8 months) Mountain View, CA Developing algorithms for optimal information retrieval and penetrating systems. I create software that is designed to be elegant, user friendly, intuitive and secure.  \n \nCurrently working on mobile and console game development and system architecture. I use Python to run scripts on the back-end and Swift for mobile. \n \nI have developed mobile apps, desktop applications, and software security modules in addition to website development for clients of all shapes and sizes. I write clean code and challenge all those around me to be their best. (Python, RoR, JavaScript, Java, Objective-C,etc.) CEO/ Innovative Software Engineer Dark Matter January 2000  – Present (15 years 8 months) Mountain View, CA Developing algorithms for optimal information retrieval and penetrating systems. I create software that is designed to be elegant, user friendly, intuitive and secure.  \n \nCurrently working on mobile and console game development and system architecture. I use Python to run scripts on the back-end and Swift for mobile. \n \nI have developed mobile apps, desktop applications, and software security modules in addition to website development for clients of all shapes and sizes. I write clean code and challenge all those around me to be their best. (Python, RoR, JavaScript, Java, Objective-C,etc.) ★ Revolutionary Recruiter Nok Nok Labs June 2012  –  February 2013  (9 months) Palo Alto, CA As the first true recruiting expert, I successfully built the engineering and product teams and closed critical positions under a stealth banner without the benefit of branding, a website, or being able to share much product info. The challenge was incredible but the results remained the same, I did exactly what I was brought in to do. \n \nI was solely responsible for developing recruiting processes and strategies while effectively managing the talent pipeline using the Jobvite applicant tracking system. I also managed Jobvite training and taught managers and employees how to utilize the system. \n \nAdditionally, I quickly hired top quality interns and entry level engineering talent by utilizing university recruiting strategies and leveraging all available resources to ensure the staff had all the support they needed. \n \n \nPositions I filled so far:  \n \nDirector of Engineering \nSr. QA Engineers  \nSr. Software Engineers (C++ and Windows) \nSr. Java Developers \nProduct Marketing Manager \nLead Architect \nPHP Developer \nInterns (Client, Server, QA, Advanced Technology Group) \nEntry Level Engineers (C++ and Java) ★ Revolutionary Recruiter Nok Nok Labs June 2012  –  February 2013  (9 months) Palo Alto, CA As the first true recruiting expert, I successfully built the engineering and product teams and closed critical positions under a stealth banner without the benefit of branding, a website, or being able to share much product info. The challenge was incredible but the results remained the same, I did exactly what I was brought in to do. \n \nI was solely responsible for developing recruiting processes and strategies while effectively managing the talent pipeline using the Jobvite applicant tracking system. I also managed Jobvite training and taught managers and employees how to utilize the system. \n \nAdditionally, I quickly hired top quality interns and entry level engineering talent by utilizing university recruiting strategies and leveraging all available resources to ensure the staff had all the support they needed. \n \n \nPositions I filled so far:  \n \nDirector of Engineering \nSr. QA Engineers  \nSr. Software Engineers (C++ and Windows) \nSr. Java Developers \nProduct Marketing Manager \nLead Architect \nPHP Developer \nInterns (Client, Server, QA, Advanced Technology Group) \nEntry Level Engineers (C++ and Java) Sr. Recruiter Aeria Games & Entertainment September 2011  –  February 2012  (6 months) San Francisco Bay Area Social gaming is one of the most competitive industries in the world. As the first in house recruiter, I was responsible for establishing recruiting best practices and helping build teams across the organization. I successfully attracted candidates from top gaming companies such as Electronic Arts, Zynga, Gala Net, Kabam, Digital Chocolate, RockYou, Ubisoft and more. I successfully helped the business grow with the right talent in the incredibly competitive and fast growing social gaming space. \n \nBuilding upon a true understanding of the candidate experience, I attracted and hired top talent using every available tool in the book and established a positive employment brand in a competitive industry.  \n \nIn addition, I utilized a proprietary customized search engine to dig deep into the massive resources of the Internet and produced quality candidates that were otherwise unattainable using common tactics. \n \n \n► Hired Web Developers, Executive Producer, Release Associate,Release Team Assistant,Product Manager, Senior Business Intelligence Manager, Sr. Software Engineers, Technical Operations Manager, Desktop Support Tech, etc. Sr. Recruiter Aeria Games & Entertainment September 2011  –  February 2012  (6 months) San Francisco Bay Area Social gaming is one of the most competitive industries in the world. As the first in house recruiter, I was responsible for establishing recruiting best practices and helping build teams across the organization. I successfully attracted candidates from top gaming companies such as Electronic Arts, Zynga, Gala Net, Kabam, Digital Chocolate, RockYou, Ubisoft and more. I successfully helped the business grow with the right talent in the incredibly competitive and fast growing social gaming space. \n \nBuilding upon a true understanding of the candidate experience, I attracted and hired top talent using every available tool in the book and established a positive employment brand in a competitive industry.  \n \nIn addition, I utilized a proprietary customized search engine to dig deep into the massive resources of the Internet and produced quality candidates that were otherwise unattainable using common tactics. \n \n \n► Hired Web Developers, Executive Producer, Release Associate,Release Team Assistant,Product Manager, Senior Business Intelligence Manager, Sr. Software Engineers, Technical Operations Manager, Desktop Support Tech, etc. Sr. Technical Recruiter (Contract) Egnyte March 2011  –  August 2011  (6 months) San Francisco Bay Area As the sole recruiting resource at this fast paced cloud storage startup, I helped build the engineering and marketing teams from the ground up under intense pressure and fierce competition. Egnyte only had 24 employees when I joined and that number now sits near 50. \n \nI hired people for the following positions: Lead Cloud Architect, Sr. Engineers (Java and Python), Operations Engineer, Mac Engineer, Technical Support Engineer, Product Marketing Manager, Sr. Web Designer, Sr. Product Manager and more. \n \n*Proven ability to poach and attract top talent from competitors and start-ups as well as big companies. \n \nI'm proud of the work I've done and the fact that I've helped change people's lives for the better. Now I'm seeking the next challenge and a great career opportunity where I can continue doing work that makes a big impact. Sr. Technical Recruiter (Contract) Egnyte March 2011  –  August 2011  (6 months) San Francisco Bay Area As the sole recruiting resource at this fast paced cloud storage startup, I helped build the engineering and marketing teams from the ground up under intense pressure and fierce competition. Egnyte only had 24 employees when I joined and that number now sits near 50. \n \nI hired people for the following positions: Lead Cloud Architect, Sr. Engineers (Java and Python), Operations Engineer, Mac Engineer, Technical Support Engineer, Product Marketing Manager, Sr. Web Designer, Sr. Product Manager and more. \n \n*Proven ability to poach and attract top talent from competitors and start-ups as well as big companies. \n \nI'm proud of the work I've done and the fact that I've helped change people's lives for the better. Now I'm seeking the next challenge and a great career opportunity where I can continue doing work that makes a big impact. Senior Technical Recruiter / Engineer Zax 2009  –  January 2011  (2 years) San Francisco Bay Area Managing and facilitating the recruitment process alongside HR functions and payroll. Created resource list for team of recruiters to facilitate the search of qualified candidates. Recruiting numerous software positions in the IT sector including Project Managers, Engineers and other software related positions for Fortune 500 companies. \n \nTrained and led a team of recruiters while delivering highly productive sourcing solutions to find and draw top talent worldwide. \n \n• Recruiter of the year for 2009 and 2010 Senior Technical Recruiter / Engineer Zax 2009  –  January 2011  (2 years) San Francisco Bay Area Managing and facilitating the recruitment process alongside HR functions and payroll. Created resource list for team of recruiters to facilitate the search of qualified candidates. Recruiting numerous software positions in the IT sector including Project Managers, Engineers and other software related positions for Fortune 500 companies. \n \nTrained and led a team of recruiters while delivering highly productive sourcing solutions to find and draw top talent worldwide. \n \n• Recruiter of the year for 2009 and 2010 Recruiter Thermo Fisher Scientific June 2007  –  October 2008  (1 year 5 months) San Jose, CA Quickly accelerated job responsibilities based on ability to consistently deliver highly desirable results and work with a sense of urgency. Facilitated an effective recruitment process by maintaining excellent communication and taking a proactive approach to problem solving and understanding business needs. \n \n \n• Sourced and recruited all levels of positions including Marketing, Software Engineers, Interns, Director Level, Finance, Operations and Scientists in a fast paced and challenging corporate setting \n \n• Partnered with recruiters and hiring managers to leverage resources, generate ideas and establish reliable lines of communication \n \n• Owned full cycle recruiting efforts from sourcing candidates, interviewing, preparing offer letters and closing requisitions while ensuring best matches for hiring managers and candidates \n \n• Drove initiative to effectively implement employee referral program which helped generate more prospects and engaged employees in active recruiting efforts across the division \n \n• Promoted positive energy within the workplace by taking the pulse of the environment and being approachable as well as affable in communication \n \n• As system administrator for applicant tracking system for entire corporate group, trained over 100 hiring managers on its usage and managed data accurately and consistently \n \n• Directed and assisted employees in regards to questions about benefits, job opportunities and various HR functions \n \n• Completed courses in process improvement and helped champion efforts to cut costs by nearly 20% for demo labs and improve business efficiency, saving over $50,000 within first six months \n \n• Managed job description database and posted jobs to job boards as well as the internal system Recruiter Thermo Fisher Scientific June 2007  –  October 2008  (1 year 5 months) San Jose, CA Quickly accelerated job responsibilities based on ability to consistently deliver highly desirable results and work with a sense of urgency. Facilitated an effective recruitment process by maintaining excellent communication and taking a proactive approach to problem solving and understanding business needs. \n \n \n• Sourced and recruited all levels of positions including Marketing, Software Engineers, Interns, Director Level, Finance, Operations and Scientists in a fast paced and challenging corporate setting \n \n• Partnered with recruiters and hiring managers to leverage resources, generate ideas and establish reliable lines of communication \n \n• Owned full cycle recruiting efforts from sourcing candidates, interviewing, preparing offer letters and closing requisitions while ensuring best matches for hiring managers and candidates \n \n• Drove initiative to effectively implement employee referral program which helped generate more prospects and engaged employees in active recruiting efforts across the division \n \n• Promoted positive energy within the workplace by taking the pulse of the environment and being approachable as well as affable in communication \n \n• As system administrator for applicant tracking system for entire corporate group, trained over 100 hiring managers on its usage and managed data accurately and consistently \n \n• Directed and assisted employees in regards to questions about benefits, job opportunities and various HR functions \n \n• Completed courses in process improvement and helped champion efforts to cut costs by nearly 20% for demo labs and improve business efficiency, saving over $50,000 within first six months \n \n• Managed job description database and posted jobs to job boards as well as the internal system Technical Sourcer/Recruiter and Web Developer CIQ January 2006  –  December 2006  (1 year) Worked effectively and efficiently performing sourcing/recruitment duties in filling IT and other technical positions in a fast paced startup environment by completing work accurately and according to timelines. Gained client confidence by going beyond the standard and providing an exceptional experience. \n \nOn the web dev side, I created mockups using Balsamiq and Mockingbird and wrote scripts using Python to help deliver web services. Technical Sourcer/Recruiter and Web Developer CIQ January 2006  –  December 2006  (1 year) Worked effectively and efficiently performing sourcing/recruitment duties in filling IT and other technical positions in a fast paced startup environment by completing work accurately and according to timelines. Gained client confidence by going beyond the standard and providing an exceptional experience. \n \nOn the web dev side, I created mockups using Balsamiq and Mockingbird and wrote scripts using Python to help deliver web services. HR Manager Peninsula Ford of Palo Alto 2003  –  2005  (2 years) Supported business leaders in day to day operations while proving to be reliable and efficient. Provided excellent customer service and helped install a new business model that emphasized dependable communication and attention to detail. \n \n \n• Led efforts to run an effective HR business model by recruiting and identifying opportunities for effective project management with an emphasis on customer service and minimizing redundancy \n \n• Responsible for recruiting talent to fill priority positions on a consistent basis \n \n• Managed service records and audited confidential files for accuracy and completion \n \n• Acted as gate keeper for executives to help expedite the flow of work from their office \n \n• Reviewed documentation and distributed correspondence for entire office as needed \n \n• Performed critical administrative duties such as scheduling meetings, maintaining files, greeting customers and preparing presentations for crucial business meetings HR Manager Peninsula Ford of Palo Alto 2003  –  2005  (2 years) Supported business leaders in day to day operations while proving to be reliable and efficient. Provided excellent customer service and helped install a new business model that emphasized dependable communication and attention to detail. \n \n \n• Led efforts to run an effective HR business model by recruiting and identifying opportunities for effective project management with an emphasis on customer service and minimizing redundancy \n \n• Responsible for recruiting talent to fill priority positions on a consistent basis \n \n• Managed service records and audited confidential files for accuracy and completion \n \n• Acted as gate keeper for executives to help expedite the flow of work from their office \n \n• Reviewed documentation and distributed correspondence for entire office as needed \n \n• Performed critical administrative duties such as scheduling meetings, maintaining files, greeting customers and preparing presentations for crucial business meetings Languages English Native or bilingual proficiency Vietnamese Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Vietnamese Native or bilingual proficiency Spanish Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills Technical Recruiting Talent Acquisition Sourcing Customer Satisfaction Internet Research Data Mining Strategic Sourcing Microsoft Office Social Networking Applicant Tracking... Team Building LinkedIn Google Twitter Facebook Social Media Boolean Search Salary Negotiation Closing Team Leadership Career Development Algorithms Web Design Web Development HTML 5 jQuery CSS Python Java Dog Training Security Benefits Negotiation Brazilian Jiu-Jitsu Shotokan Karate Muay Thai iOS Windows Mac OS X iPhone iPad OS X Leadership Recruiting Interviews Temporary Placement College Recruiting Talent Management Human Resources Start-ups Strategy See 35+     See less Skills  Technical Recruiting Talent Acquisition Sourcing Customer Satisfaction Internet Research Data Mining Strategic Sourcing Microsoft Office Social Networking Applicant Tracking... Team Building LinkedIn Google Twitter Facebook Social Media Boolean Search Salary Negotiation Closing Team Leadership Career Development Algorithms Web Design Web Development HTML 5 jQuery CSS Python Java Dog Training Security Benefits Negotiation Brazilian Jiu-Jitsu Shotokan Karate Muay Thai iOS Windows Mac OS X iPhone iPad OS X Leadership Recruiting Interviews Temporary Placement College Recruiting Talent Management Human Resources Start-ups Strategy See 35+     See less Technical Recruiting Talent Acquisition Sourcing Customer Satisfaction Internet Research Data Mining Strategic Sourcing Microsoft Office Social Networking Applicant Tracking... Team Building LinkedIn Google Twitter Facebook Social Media Boolean Search Salary Negotiation Closing Team Leadership Career Development Algorithms Web Design Web Development HTML 5 jQuery CSS Python Java Dog Training Security Benefits Negotiation Brazilian Jiu-Jitsu Shotokan Karate Muay Thai iOS Windows Mac OS X iPhone iPad OS X Leadership Recruiting Interviews Temporary Placement College Recruiting Talent Management Human Resources Start-ups Strategy See 35+     See less Technical Recruiting Talent Acquisition Sourcing Customer Satisfaction Internet Research Data Mining Strategic Sourcing Microsoft Office Social Networking Applicant Tracking... Team Building LinkedIn Google Twitter Facebook Social Media Boolean Search Salary Negotiation Closing Team Leadership Career Development Algorithms Web Design Web Development HTML 5 jQuery CSS Python Java Dog Training Security Benefits Negotiation Brazilian Jiu-Jitsu Shotokan Karate Muay Thai iOS Windows Mac OS X iPhone iPad OS X Leadership Recruiting Interviews Temporary Placement College Recruiting Talent Management Human Resources Start-ups Strategy See 35+     See less Education De Anza College Business Administration/Human Resources De Anza College Computer Science De Anza College Business Administration/Human Resources De Anza College Business Administration/Human Resources De Anza College Business Administration/Human Resources De Anza College Computer Science De Anza College Computer Science De Anza College Computer Science Honors & Awards ", "Summary YouTube is seeking strong engineering managers who have the technical chops to provide leadership on major projects and who can effectively manage an engineering team. Summary YouTube is seeking strong engineering managers who have the technical chops to provide leadership on major projects and who can effectively manage an engineering team. YouTube is seeking strong engineering managers who have the technical chops to provide leadership on major projects and who can effectively manage an engineering team. YouTube is seeking strong engineering managers who have the technical chops to provide leadership on major projects and who can effectively manage an engineering team. Experience Staffing Lead & Leadership Recruiter - YouTube & Google Google October 2012  – Present (2 years 11 months) San Bruno , Senior Recruiter - YouTube & Google Fiber Google April 2011  –  September 2012  (1 year 6 months) Mountain View Founder/President TAO Associates July 2009  –  April 2011  (1 year 10 months) Finance Practice Leader - Executive Search Management Search September 2008  –  July 2009  (11 months) Founder/President Inspiring Homes 2001  –  2008  (7 years) Assistant Vice President Merrill Lynch 1989  –  2001  (12 years) Staffing Lead & Leadership Recruiter - YouTube & Google Google October 2012  – Present (2 years 11 months) San Bruno , Staffing Lead & Leadership Recruiter - YouTube & Google Google October 2012  – Present (2 years 11 months) San Bruno , Senior Recruiter - YouTube & Google Fiber Google April 2011  –  September 2012  (1 year 6 months) Mountain View Senior Recruiter - YouTube & Google Fiber Google April 2011  –  September 2012  (1 year 6 months) Mountain View Founder/President TAO Associates July 2009  –  April 2011  (1 year 10 months) Founder/President TAO Associates July 2009  –  April 2011  (1 year 10 months) Finance Practice Leader - Executive Search Management Search September 2008  –  July 2009  (11 months) Finance Practice Leader - Executive Search Management Search September 2008  –  July 2009  (11 months) Founder/President Inspiring Homes 2001  –  2008  (7 years) Founder/President Inspiring Homes 2001  –  2008  (7 years) Assistant Vice President Merrill Lynch 1989  –  2001  (12 years) Assistant Vice President Merrill Lynch 1989  –  2001  (12 years) Skills Sourcing Negotiation Coaching Technical Recruiting Talent Acquisition Skills  Sourcing Negotiation Coaching Technical Recruiting Talent Acquisition Sourcing Negotiation Coaching Technical Recruiting Talent Acquisition Sourcing Negotiation Coaching Technical Recruiting Talent Acquisition Education John Carroll University BSBA,  Finance ,  Spanish John Carroll University BSBA,  Finance ,  Spanish John Carroll University BSBA,  Finance ,  Spanish John Carroll University BSBA,  Finance ,  Spanish ", "Experience University Tech Recruiter, Nelson at Google Google July 2015  – Present (2 months) San Francisco Bay Area Proactively working with hiring managers and a queue of 100+ candidates during peak recruitment season to hire and onboard for roles including: Software Engineer, Software Engineer in Tools and Infrastructure and Site Reliability Engineer. In addition, I manage the offer process to include extending offers, salary negotiations, generating offer letters and closing\u2028 candidates.  \n \n National Staffing Coordinator Eastridge Workforce Solutions May 2015  –  July 2015  (3 months) Greater San Diego Area Managed high volume staffing, recruiting and on-boarding for our Solar Construction projects across the country. Recruiter | Corporate Eastridge Workforce Solutions October 2014  –  May 2015  (8 months) Greater San Diego Area Responsible for the full cycle recruitment process for internal positions within the company including administrative, sales and management based roles. Recruitment Assistant San Diego State University August 2012  –  August 2014  (2 years 1 month) Greater San Diego Area San Diego State University receives over 78,000 applications for admission every year. As a Student Recruitment Assistant for the Office of Admissions, I worked on many aspects of the recruitment process for our Out of State, International and Presidential Scholar students. One of my main responsibilities was serving as a point of contact for our prospective students and their families to ensure the application and transition process was smooth and efficient. I worked directly with these families from the moment they expressed interest in SDSU to the day I greeted them at their New Student Orientation. I also worked to plan our prospective/admitted student receptions, Explore SDSU workshops and many university events. Lead Ambassador San Diego State University December 2011  –  August 2014  (2 years 9 months) Greater San Diego Area Served as an official university student representative, tour guide, and orientation leader for the Office of New Student and Parent Programs. I facilitated official university events, presented new student workshops, maintained office hours and hosted weekly family and prospective student tours. Event Organizer TED Conferences May 2012  –  April 2013  (1 year) KPBS Broadcasting Studio Organized the 2013 TEDxSDSU event held at the KPBS Broadcasting Studio. Had 8 inspiring speakers come together spread ideas about how they \"Illuminated their Futures\". The event planning process included leading a 13 person committee, catering for the event, printing and designing brochures, speaker line up, technical set up for the event and the rigorous process of raising over $5,000 to host the event. Guest Experience Server BJ's Restaurants, Inc. May 2010  –  April 2013  (3 years) Greater San Diego Area BJ's Restaurants serve quality food and fresh, handcrafted beers in a casual, high-energy atmosphere. Our restaurant team members exude a warm, friendly and energetic spirit that conveys a sense of honest value and a commitment to exceed the expectations of our guests. We're just a high-energy, casual dining restaurant that offers quality food and handcrafted beer at a good value to our guests. Quality, flavor, value, moderate prices and sincere service remain distinct attributes of the BJ's experience. BJ's is popular with all ages – kids, families, young adults, \"baby boomers\" and senior citizens – and all income levels. Our average check per guest is about the same (or less) than what you would pay for an average experience at one of the \"mass market\" casual dining restaurants. The difference is that at BJ's we believe you get much more for your money! Account Services Coordinator Coast to Coast Building Services June 2008  –  August 2010  (2 years 3 months) Greater San Diego Area Assisted the sales and account managers with client relations, data analysis, proposals and all client inquiries regarding their accounts. University Tech Recruiter, Nelson at Google Google July 2015  – Present (2 months) San Francisco Bay Area Proactively working with hiring managers and a queue of 100+ candidates during peak recruitment season to hire and onboard for roles including: Software Engineer, Software Engineer in Tools and Infrastructure and Site Reliability Engineer. In addition, I manage the offer process to include extending offers, salary negotiations, generating offer letters and closing\u2028 candidates.  \n \n University Tech Recruiter, Nelson at Google Google July 2015  – Present (2 months) San Francisco Bay Area Proactively working with hiring managers and a queue of 100+ candidates during peak recruitment season to hire and onboard for roles including: Software Engineer, Software Engineer in Tools and Infrastructure and Site Reliability Engineer. In addition, I manage the offer process to include extending offers, salary negotiations, generating offer letters and closing\u2028 candidates.  \n \n National Staffing Coordinator Eastridge Workforce Solutions May 2015  –  July 2015  (3 months) Greater San Diego Area Managed high volume staffing, recruiting and on-boarding for our Solar Construction projects across the country. National Staffing Coordinator Eastridge Workforce Solutions May 2015  –  July 2015  (3 months) Greater San Diego Area Managed high volume staffing, recruiting and on-boarding for our Solar Construction projects across the country. Recruiter | Corporate Eastridge Workforce Solutions October 2014  –  May 2015  (8 months) Greater San Diego Area Responsible for the full cycle recruitment process for internal positions within the company including administrative, sales and management based roles. Recruiter | Corporate Eastridge Workforce Solutions October 2014  –  May 2015  (8 months) Greater San Diego Area Responsible for the full cycle recruitment process for internal positions within the company including administrative, sales and management based roles. Recruitment Assistant San Diego State University August 2012  –  August 2014  (2 years 1 month) Greater San Diego Area San Diego State University receives over 78,000 applications for admission every year. As a Student Recruitment Assistant for the Office of Admissions, I worked on many aspects of the recruitment process for our Out of State, International and Presidential Scholar students. One of my main responsibilities was serving as a point of contact for our prospective students and their families to ensure the application and transition process was smooth and efficient. I worked directly with these families from the moment they expressed interest in SDSU to the day I greeted them at their New Student Orientation. I also worked to plan our prospective/admitted student receptions, Explore SDSU workshops and many university events. Recruitment Assistant San Diego State University August 2012  –  August 2014  (2 years 1 month) Greater San Diego Area San Diego State University receives over 78,000 applications for admission every year. As a Student Recruitment Assistant for the Office of Admissions, I worked on many aspects of the recruitment process for our Out of State, International and Presidential Scholar students. One of my main responsibilities was serving as a point of contact for our prospective students and their families to ensure the application and transition process was smooth and efficient. I worked directly with these families from the moment they expressed interest in SDSU to the day I greeted them at their New Student Orientation. I also worked to plan our prospective/admitted student receptions, Explore SDSU workshops and many university events. Lead Ambassador San Diego State University December 2011  –  August 2014  (2 years 9 months) Greater San Diego Area Served as an official university student representative, tour guide, and orientation leader for the Office of New Student and Parent Programs. I facilitated official university events, presented new student workshops, maintained office hours and hosted weekly family and prospective student tours. Lead Ambassador San Diego State University December 2011  –  August 2014  (2 years 9 months) Greater San Diego Area Served as an official university student representative, tour guide, and orientation leader for the Office of New Student and Parent Programs. I facilitated official university events, presented new student workshops, maintained office hours and hosted weekly family and prospective student tours. Event Organizer TED Conferences May 2012  –  April 2013  (1 year) KPBS Broadcasting Studio Organized the 2013 TEDxSDSU event held at the KPBS Broadcasting Studio. Had 8 inspiring speakers come together spread ideas about how they \"Illuminated their Futures\". The event planning process included leading a 13 person committee, catering for the event, printing and designing brochures, speaker line up, technical set up for the event and the rigorous process of raising over $5,000 to host the event. Event Organizer TED Conferences May 2012  –  April 2013  (1 year) KPBS Broadcasting Studio Organized the 2013 TEDxSDSU event held at the KPBS Broadcasting Studio. Had 8 inspiring speakers come together spread ideas about how they \"Illuminated their Futures\". The event planning process included leading a 13 person committee, catering for the event, printing and designing brochures, speaker line up, technical set up for the event and the rigorous process of raising over $5,000 to host the event. Guest Experience Server BJ's Restaurants, Inc. May 2010  –  April 2013  (3 years) Greater San Diego Area BJ's Restaurants serve quality food and fresh, handcrafted beers in a casual, high-energy atmosphere. Our restaurant team members exude a warm, friendly and energetic spirit that conveys a sense of honest value and a commitment to exceed the expectations of our guests. We're just a high-energy, casual dining restaurant that offers quality food and handcrafted beer at a good value to our guests. Quality, flavor, value, moderate prices and sincere service remain distinct attributes of the BJ's experience. BJ's is popular with all ages – kids, families, young adults, \"baby boomers\" and senior citizens – and all income levels. Our average check per guest is about the same (or less) than what you would pay for an average experience at one of the \"mass market\" casual dining restaurants. The difference is that at BJ's we believe you get much more for your money! Guest Experience Server BJ's Restaurants, Inc. May 2010  –  April 2013  (3 years) Greater San Diego Area BJ's Restaurants serve quality food and fresh, handcrafted beers in a casual, high-energy atmosphere. Our restaurant team members exude a warm, friendly and energetic spirit that conveys a sense of honest value and a commitment to exceed the expectations of our guests. We're just a high-energy, casual dining restaurant that offers quality food and handcrafted beer at a good value to our guests. Quality, flavor, value, moderate prices and sincere service remain distinct attributes of the BJ's experience. BJ's is popular with all ages – kids, families, young adults, \"baby boomers\" and senior citizens – and all income levels. Our average check per guest is about the same (or less) than what you would pay for an average experience at one of the \"mass market\" casual dining restaurants. The difference is that at BJ's we believe you get much more for your money! Account Services Coordinator Coast to Coast Building Services June 2008  –  August 2010  (2 years 3 months) Greater San Diego Area Assisted the sales and account managers with client relations, data analysis, proposals and all client inquiries regarding their accounts. Account Services Coordinator Coast to Coast Building Services June 2008  –  August 2010  (2 years 3 months) Greater San Diego Area Assisted the sales and account managers with client relations, data analysis, proposals and all client inquiries regarding their accounts. Languages   Skills Time Management Leadership Public Speaking Sales Management Customer Service Facebook Social Networking Social Media Recruiting Microsoft Office Social Media Marketing Microsoft Excel Public Relations Event Management Research PowerPoint Microsoft Word Business Development Communication Full-life Cycle... See 6+     See less Skills  Time Management Leadership Public Speaking Sales Management Customer Service Facebook Social Networking Social Media Recruiting Microsoft Office Social Media Marketing Microsoft Excel Public Relations Event Management Research PowerPoint Microsoft Word Business Development Communication Full-life Cycle... See 6+     See less Time Management Leadership Public Speaking Sales Management Customer Service Facebook Social Networking Social Media Recruiting Microsoft Office Social Media Marketing Microsoft Excel Public Relations Event Management Research PowerPoint Microsoft Word Business Development Communication Full-life Cycle... See 6+     See less Time Management Leadership Public Speaking Sales Management Customer Service Facebook Social Networking Social Media Recruiting Microsoft Office Social Media Marketing Microsoft Excel Public Relations Event Management Research PowerPoint Microsoft Word Business Development Communication Full-life Cycle... See 6+     See less Education San Diego State University-California State University Bachelor's Degree,  Communication 2014 Rotaract - President (2013-14), Social Chair (2012-13) \nPhi Delta Theta - Director of Membership (2014), Director of Internal Affairs (2013) \nInterFraternity Council - Director of Public Relations (2013-14) \nSDSU Ambassadors - Morale Officer (2014), Lead Ambassador (2012) \nAlpha Kappa Psi Business Organization- Warden (2014), Director of Public Relations (2012-13) \nProfessional & Service Student Council - President and Founder (2012-14) \nAssociated Students: Student Body Government - Awards Committee Member (2013-14), Elections Committee Member (2013-14), External Relations Board Member (2013-14), ASUB Member (2013) and Green Love Sustainability Board Member (2012-13). Activities and Societies:  Alpha Kappa Psi Professional Business Fraternity ,  Phi Delta Theta Fraternity ,  Rotaract Community Service Organization ,  SDSU Ambassadors ,  Inter Fraternity Council ,  Associated Students - Student Government ,  Professional &Service Student Council San Diego State University-California State University Bachelor's Degree,  Communication 2014 Rotaract - President (2013-14), Social Chair (2012-13) \nPhi Delta Theta - Director of Membership (2014), Director of Internal Affairs (2013) \nInterFraternity Council - Director of Public Relations (2013-14) \nSDSU Ambassadors - Morale Officer (2014), Lead Ambassador (2012) \nAlpha Kappa Psi Business Organization- Warden (2014), Director of Public Relations (2012-13) \nProfessional & Service Student Council - President and Founder (2012-14) \nAssociated Students: Student Body Government - Awards Committee Member (2013-14), Elections Committee Member (2013-14), External Relations Board Member (2013-14), ASUB Member (2013) and Green Love Sustainability Board Member (2012-13). Activities and Societies:  Alpha Kappa Psi Professional Business Fraternity ,  Phi Delta Theta Fraternity ,  Rotaract Community Service Organization ,  SDSU Ambassadors ,  Inter Fraternity Council ,  Associated Students - Student Government ,  Professional &Service Student Council San Diego State University-California State University Bachelor's Degree,  Communication 2014 Rotaract - President (2013-14), Social Chair (2012-13) \nPhi Delta Theta - Director of Membership (2014), Director of Internal Affairs (2013) \nInterFraternity Council - Director of Public Relations (2013-14) \nSDSU Ambassadors - Morale Officer (2014), Lead Ambassador (2012) \nAlpha Kappa Psi Business Organization- Warden (2014), Director of Public Relations (2012-13) \nProfessional & Service Student Council - President and Founder (2012-14) \nAssociated Students: Student Body Government - Awards Committee Member (2013-14), Elections Committee Member (2013-14), External Relations Board Member (2013-14), ASUB Member (2013) and Green Love Sustainability Board Member (2012-13). Activities and Societies:  Alpha Kappa Psi Professional Business Fraternity ,  Phi Delta Theta Fraternity ,  Rotaract Community Service Organization ,  SDSU Ambassadors ,  Inter Fraternity Council ,  Associated Students - Student Government ,  Professional &Service Student Council San Diego State University-California State University Bachelor's Degree,  Communication 2014 Rotaract - President (2013-14), Social Chair (2012-13) \nPhi Delta Theta - Director of Membership (2014), Director of Internal Affairs (2013) \nInterFraternity Council - Director of Public Relations (2013-14) \nSDSU Ambassadors - Morale Officer (2014), Lead Ambassador (2012) \nAlpha Kappa Psi Business Organization- Warden (2014), Director of Public Relations (2012-13) \nProfessional & Service Student Council - President and Founder (2012-14) \nAssociated Students: Student Body Government - Awards Committee Member (2013-14), Elections Committee Member (2013-14), External Relations Board Member (2013-14), ASUB Member (2013) and Green Love Sustainability Board Member (2012-13). Activities and Societies:  Alpha Kappa Psi Professional Business Fraternity ,  Phi Delta Theta Fraternity ,  Rotaract Community Service Organization ,  SDSU Ambassadors ,  Inter Fraternity Council ,  Associated Students - Student Government ,  Professional &Service Student Council Honors & Awards Graham S. Lockhart \"Outstanding Alumni of the Year\" Phi Delta Theta May 2015 Awarded annually to one alumni who has demonstrated outstanding service and commitment to the chapter through guidance and active participation with the chapter.  Daniel P. Goodrich Award Recipient Associated Students, SDSU April 2014 The Daniel P. Goodrich award is awarded to one outstanding senior who has made an impact on the SDSU community through their leadership and involvement in extra curricular activities.  Energizer Award Rotary District 5340 April 2014 The District Energizer Award is awarded by the District Governor during his club visits to one club member who has gone about his/her Rotary work with the most vigor and enthusiasm.  Mr. Rotaract Rotaract Club of SDSU May 2014 This award is given to one male member per year who has exemplified the values of Rotaract and lives the motto of \"service above self\".  Delta Award Recipent Phi Delta Theta Fraternity May 2014 Award given to one member who has unconditionally committed themselves to the betterment of membership, recruitment, service and external relations. Recipient is a member who has gone above and beyond to better the organization and assist in the advancement of all members.  Homecoming Court King Nominee San Diego State University October 2013 Selected as one of seven men to represent SDSU on the Homecoming Court. Selection is based on academics, extra curricular involvement, leadership and community engagement.  Chris Nichols Memorial Scholarship Recipient San Diego State University August 2013 Star Rookie Award SDSU Ambassadors May 2012 This honor is awarded to the individual who constantly went above and beyond for the organization. This included extra campus tours, working University events beyond what is required, taking the lead within the rookie class and always inspiring their peers.  Additional Honors & Awards 2011 Team Member of the Year - BJ's Restaurant \n2007 Most Inspirational Member - So Cal Elite All Star Cheer Graham S. Lockhart \"Outstanding Alumni of the Year\" Phi Delta Theta May 2015 Awarded annually to one alumni who has demonstrated outstanding service and commitment to the chapter through guidance and active participation with the chapter.  Graham S. Lockhart \"Outstanding Alumni of the Year\" Phi Delta Theta May 2015 Awarded annually to one alumni who has demonstrated outstanding service and commitment to the chapter through guidance and active participation with the chapter.  Graham S. Lockhart \"Outstanding Alumni of the Year\" Phi Delta Theta May 2015 Awarded annually to one alumni who has demonstrated outstanding service and commitment to the chapter through guidance and active participation with the chapter.  Daniel P. Goodrich Award Recipient Associated Students, SDSU April 2014 The Daniel P. Goodrich award is awarded to one outstanding senior who has made an impact on the SDSU community through their leadership and involvement in extra curricular activities.  Daniel P. Goodrich Award Recipient Associated Students, SDSU April 2014 The Daniel P. Goodrich award is awarded to one outstanding senior who has made an impact on the SDSU community through their leadership and involvement in extra curricular activities.  Daniel P. Goodrich Award Recipient Associated Students, SDSU April 2014 The Daniel P. Goodrich award is awarded to one outstanding senior who has made an impact on the SDSU community through their leadership and involvement in extra curricular activities.  Energizer Award Rotary District 5340 April 2014 The District Energizer Award is awarded by the District Governor during his club visits to one club member who has gone about his/her Rotary work with the most vigor and enthusiasm.  Energizer Award Rotary District 5340 April 2014 The District Energizer Award is awarded by the District Governor during his club visits to one club member who has gone about his/her Rotary work with the most vigor and enthusiasm.  Energizer Award Rotary District 5340 April 2014 The District Energizer Award is awarded by the District Governor during his club visits to one club member who has gone about his/her Rotary work with the most vigor and enthusiasm.  Mr. Rotaract Rotaract Club of SDSU May 2014 This award is given to one male member per year who has exemplified the values of Rotaract and lives the motto of \"service above self\".  Mr. Rotaract Rotaract Club of SDSU May 2014 This award is given to one male member per year who has exemplified the values of Rotaract and lives the motto of \"service above self\".  Mr. Rotaract Rotaract Club of SDSU May 2014 This award is given to one male member per year who has exemplified the values of Rotaract and lives the motto of \"service above self\".  Delta Award Recipent Phi Delta Theta Fraternity May 2014 Award given to one member who has unconditionally committed themselves to the betterment of membership, recruitment, service and external relations. Recipient is a member who has gone above and beyond to better the organization and assist in the advancement of all members.  Delta Award Recipent Phi Delta Theta Fraternity May 2014 Award given to one member who has unconditionally committed themselves to the betterment of membership, recruitment, service and external relations. Recipient is a member who has gone above and beyond to better the organization and assist in the advancement of all members.  Delta Award Recipent Phi Delta Theta Fraternity May 2014 Award given to one member who has unconditionally committed themselves to the betterment of membership, recruitment, service and external relations. Recipient is a member who has gone above and beyond to better the organization and assist in the advancement of all members.  Homecoming Court King Nominee San Diego State University October 2013 Selected as one of seven men to represent SDSU on the Homecoming Court. Selection is based on academics, extra curricular involvement, leadership and community engagement.  Homecoming Court King Nominee San Diego State University October 2013 Selected as one of seven men to represent SDSU on the Homecoming Court. Selection is based on academics, extra curricular involvement, leadership and community engagement.  Homecoming Court King Nominee San Diego State University October 2013 Selected as one of seven men to represent SDSU on the Homecoming Court. Selection is based on academics, extra curricular involvement, leadership and community engagement.  Chris Nichols Memorial Scholarship Recipient San Diego State University August 2013 Chris Nichols Memorial Scholarship Recipient San Diego State University August 2013 Chris Nichols Memorial Scholarship Recipient San Diego State University August 2013 Star Rookie Award SDSU Ambassadors May 2012 This honor is awarded to the individual who constantly went above and beyond for the organization. This included extra campus tours, working University events beyond what is required, taking the lead within the rookie class and always inspiring their peers.  Star Rookie Award SDSU Ambassadors May 2012 This honor is awarded to the individual who constantly went above and beyond for the organization. This included extra campus tours, working University events beyond what is required, taking the lead within the rookie class and always inspiring their peers.  Star Rookie Award SDSU Ambassadors May 2012 This honor is awarded to the individual who constantly went above and beyond for the organization. This included extra campus tours, working University events beyond what is required, taking the lead within the rookie class and always inspiring their peers.  Additional Honors & Awards 2011 Team Member of the Year - BJ's Restaurant \n2007 Most Inspirational Member - So Cal Elite All Star Cheer Additional Honors & Awards 2011 Team Member of the Year - BJ's Restaurant \n2007 Most Inspirational Member - So Cal Elite All Star Cheer Additional Honors & Awards 2011 Team Member of the Year - BJ's Restaurant \n2007 Most Inspirational Member - So Cal Elite All Star Cheer ", "Summary Having consistently been in a career field centered around helping people, the transition into technical recruiting was a logical move. Internationally, I have taught professionalism courses, alongside partnering established businesses with start-ups as a social enterprise investment. My drive to not only help people continually succeed, but also find a solid and mutually beneficial match professionally is where technical recruiting comes into play. An eagerness to be a reliable and authentic resource to clients and candidates is the impetus behind my every day work. Summary Having consistently been in a career field centered around helping people, the transition into technical recruiting was a logical move. Internationally, I have taught professionalism courses, alongside partnering established businesses with start-ups as a social enterprise investment. My drive to not only help people continually succeed, but also find a solid and mutually beneficial match professionally is where technical recruiting comes into play. An eagerness to be a reliable and authentic resource to clients and candidates is the impetus behind my every day work. Having consistently been in a career field centered around helping people, the transition into technical recruiting was a logical move. Internationally, I have taught professionalism courses, alongside partnering established businesses with start-ups as a social enterprise investment. My drive to not only help people continually succeed, but also find a solid and mutually beneficial match professionally is where technical recruiting comes into play. An eagerness to be a reliable and authentic resource to clients and candidates is the impetus behind my every day work. Having consistently been in a career field centered around helping people, the transition into technical recruiting was a logical move. Internationally, I have taught professionalism courses, alongside partnering established businesses with start-ups as a social enterprise investment. My drive to not only help people continually succeed, but also find a solid and mutually beneficial match professionally is where technical recruiting comes into play. An eagerness to be a reliable and authentic resource to clients and candidates is the impetus behind my every day work. Experience Software Engineering Recruiter for Google Los Angeles and Irvine Google October 2013  – Present (1 year 11 months) Greater Los Angeles Area Google Los Angeles and Irvine are rapidly growing, and many Southern Californians aren't aware we are right at their back door. Both locations are large development centers and are looking for software engineers to join our mission. \n \nOur mission is to organize the world‘s information and make it universally accessible and useful. In order to do that, we need smart, driven software engineers. We have positions ranging from traditional software engineers to front-end and mobile software engineers.  Technical Recruiter Boon Staffing Solutions, Inc. 2012  –  October 2013  (1 year) Greater Los Angeles Area Boon Staffing Solutions, Inc. is a provider of Technical Personnel for IT and Marketing/Creative Departments seeking either Full-Time or Contract Professionals. Our company is made up of two key divisions designed to serve your technical professional needs, BOON Technology and BOON Interactive. These divisions are focused on making sure you are able to attract the best available talent having the skills consistent with your ongoing project and program needs. \n \nBOON is also a provider of Consulting Services. Our company is able to identify and manage project teams that will ultimately deliver upon a scope consistent with your overall Project Goals. \n \nBOON Technology - a provider of Information Technology Professionals within Applications Development, Network Infrastructure and ERP systems. \n \nBOON Interactive - a provider of Technical Professionals that work within Marketing, Creative and Gaming divisions. \n \nboon (boon) n. \n1. A benefit bestowed, especially one bestowed in response to a request. \n2. A timely blessing or favor. Administrative Assitant & Infant Care Provider Shepherd's Keep Home for Abandoned Babies February 2011  –  December 2011  (11 months) Durban Area, South Africa •\tMaintained communication with funders, donors, and volunteers \n•\tManaged the day shift staff and demonstrated effective infant communication and play strategies \n•\tCorresponded with social workers regarding the placement of babies \n•\tMonitored the babies health and relayed progress back to Shepherd’s Keep owner Assistant Project Leader Indlela, NPO South Africa 2011  –  2011  (less than a year) Durban Area, South Africa •\tServed as township liaison between Indlela’s management team and crèche (pre-school) owners and teachers \n•\tOrganized training events for crèche owners and teachers in early childhood education \n•\tAssessed and monitored crèche staff to ensure teaching strategies aligned with training standards \n•\tConducted crèche audits in order to partner crèches with businesses interested in social enterprise development \n•\tWrote grants alongside the chairman, and sought out funders for the program \n•\tCreated a database for the program with detailed information on each partnering crèche \n•\tCreated and taught a Life Skills/Professionalism course for Zulu field workers  \n•\tCorresponded with KwaZulu-Natal government on crèche health/safety regulations and registration processes Corps Member Jumpstart January 2010  –  June 2010  (6 months) Los Angeles •\tMentored preschool children in a low-income community, focusing on early literacy  \n•\tPartnered with families to offer support through regular progress reports, meetings, and family event nights \n•\tAssisted head teacher in daily planning and special events \n•\tReceived training on early childhood development, classroom strategies, and family communication Volunteer Community Care Project of Pietermaritzburg, South Africa July 2009  –  December 2009  (6 months) Pietermaritzburg Area, South Africa •\tAssisted in educating middle and high school students on HIV/Aids curriculum  \n•\tFiled detailed case reports on students and families affected by HIV/Aids  \n•\tAided in the implementation of community gatherings and community support activities \n•\tConducted a questionnaire with over 300 students assessing the effectiveness of CCP’s HIV/Aids program In-Home Instructor Head of the Class 2007  –  2009  (2 years) Los Angeles •\tWrote a manual for incoming instructors on early childhood education and development  \n•\tPlanned individual curricula and taught reading, writing and math according to each child’s special needs \n•\tWorked with parents and teachers to develop suitable teaching strategies and evaluations of student progres Youth Leader Dash Student Ministries January 2005  –  2005  (less than a year) Los Angeles •\tCoordinated, directed, and performed staff skits correlating with each summer camp theme for students \n•\tMet with camp staff to discuss student progress and quality of scheduling  \n•\tCounseled and coached students regarding the implementation of newly learned skills to achieve their goals Software Engineering Recruiter for Google Los Angeles and Irvine Google October 2013  – Present (1 year 11 months) Greater Los Angeles Area Google Los Angeles and Irvine are rapidly growing, and many Southern Californians aren't aware we are right at their back door. Both locations are large development centers and are looking for software engineers to join our mission. \n \nOur mission is to organize the world‘s information and make it universally accessible and useful. In order to do that, we need smart, driven software engineers. We have positions ranging from traditional software engineers to front-end and mobile software engineers.  Software Engineering Recruiter for Google Los Angeles and Irvine Google October 2013  – Present (1 year 11 months) Greater Los Angeles Area Google Los Angeles and Irvine are rapidly growing, and many Southern Californians aren't aware we are right at their back door. Both locations are large development centers and are looking for software engineers to join our mission. \n \nOur mission is to organize the world‘s information and make it universally accessible and useful. In order to do that, we need smart, driven software engineers. We have positions ranging from traditional software engineers to front-end and mobile software engineers.  Technical Recruiter Boon Staffing Solutions, Inc. 2012  –  October 2013  (1 year) Greater Los Angeles Area Boon Staffing Solutions, Inc. is a provider of Technical Personnel for IT and Marketing/Creative Departments seeking either Full-Time or Contract Professionals. Our company is made up of two key divisions designed to serve your technical professional needs, BOON Technology and BOON Interactive. These divisions are focused on making sure you are able to attract the best available talent having the skills consistent with your ongoing project and program needs. \n \nBOON is also a provider of Consulting Services. Our company is able to identify and manage project teams that will ultimately deliver upon a scope consistent with your overall Project Goals. \n \nBOON Technology - a provider of Information Technology Professionals within Applications Development, Network Infrastructure and ERP systems. \n \nBOON Interactive - a provider of Technical Professionals that work within Marketing, Creative and Gaming divisions. \n \nboon (boon) n. \n1. A benefit bestowed, especially one bestowed in response to a request. \n2. A timely blessing or favor. Technical Recruiter Boon Staffing Solutions, Inc. 2012  –  October 2013  (1 year) Greater Los Angeles Area Boon Staffing Solutions, Inc. is a provider of Technical Personnel for IT and Marketing/Creative Departments seeking either Full-Time or Contract Professionals. Our company is made up of two key divisions designed to serve your technical professional needs, BOON Technology and BOON Interactive. These divisions are focused on making sure you are able to attract the best available talent having the skills consistent with your ongoing project and program needs. \n \nBOON is also a provider of Consulting Services. Our company is able to identify and manage project teams that will ultimately deliver upon a scope consistent with your overall Project Goals. \n \nBOON Technology - a provider of Information Technology Professionals within Applications Development, Network Infrastructure and ERP systems. \n \nBOON Interactive - a provider of Technical Professionals that work within Marketing, Creative and Gaming divisions. \n \nboon (boon) n. \n1. A benefit bestowed, especially one bestowed in response to a request. \n2. A timely blessing or favor. Administrative Assitant & Infant Care Provider Shepherd's Keep Home for Abandoned Babies February 2011  –  December 2011  (11 months) Durban Area, South Africa •\tMaintained communication with funders, donors, and volunteers \n•\tManaged the day shift staff and demonstrated effective infant communication and play strategies \n•\tCorresponded with social workers regarding the placement of babies \n•\tMonitored the babies health and relayed progress back to Shepherd’s Keep owner Administrative Assitant & Infant Care Provider Shepherd's Keep Home for Abandoned Babies February 2011  –  December 2011  (11 months) Durban Area, South Africa •\tMaintained communication with funders, donors, and volunteers \n•\tManaged the day shift staff and demonstrated effective infant communication and play strategies \n•\tCorresponded with social workers regarding the placement of babies \n•\tMonitored the babies health and relayed progress back to Shepherd’s Keep owner Assistant Project Leader Indlela, NPO South Africa 2011  –  2011  (less than a year) Durban Area, South Africa •\tServed as township liaison between Indlela’s management team and crèche (pre-school) owners and teachers \n•\tOrganized training events for crèche owners and teachers in early childhood education \n•\tAssessed and monitored crèche staff to ensure teaching strategies aligned with training standards \n•\tConducted crèche audits in order to partner crèches with businesses interested in social enterprise development \n•\tWrote grants alongside the chairman, and sought out funders for the program \n•\tCreated a database for the program with detailed information on each partnering crèche \n•\tCreated and taught a Life Skills/Professionalism course for Zulu field workers  \n•\tCorresponded with KwaZulu-Natal government on crèche health/safety regulations and registration processes Assistant Project Leader Indlela, NPO South Africa 2011  –  2011  (less than a year) Durban Area, South Africa •\tServed as township liaison between Indlela’s management team and crèche (pre-school) owners and teachers \n•\tOrganized training events for crèche owners and teachers in early childhood education \n•\tAssessed and monitored crèche staff to ensure teaching strategies aligned with training standards \n•\tConducted crèche audits in order to partner crèches with businesses interested in social enterprise development \n•\tWrote grants alongside the chairman, and sought out funders for the program \n•\tCreated a database for the program with detailed information on each partnering crèche \n•\tCreated and taught a Life Skills/Professionalism course for Zulu field workers  \n•\tCorresponded with KwaZulu-Natal government on crèche health/safety regulations and registration processes Corps Member Jumpstart January 2010  –  June 2010  (6 months) Los Angeles •\tMentored preschool children in a low-income community, focusing on early literacy  \n•\tPartnered with families to offer support through regular progress reports, meetings, and family event nights \n•\tAssisted head teacher in daily planning and special events \n•\tReceived training on early childhood development, classroom strategies, and family communication Corps Member Jumpstart January 2010  –  June 2010  (6 months) Los Angeles •\tMentored preschool children in a low-income community, focusing on early literacy  \n•\tPartnered with families to offer support through regular progress reports, meetings, and family event nights \n•\tAssisted head teacher in daily planning and special events \n•\tReceived training on early childhood development, classroom strategies, and family communication Volunteer Community Care Project of Pietermaritzburg, South Africa July 2009  –  December 2009  (6 months) Pietermaritzburg Area, South Africa •\tAssisted in educating middle and high school students on HIV/Aids curriculum  \n•\tFiled detailed case reports on students and families affected by HIV/Aids  \n•\tAided in the implementation of community gatherings and community support activities \n•\tConducted a questionnaire with over 300 students assessing the effectiveness of CCP’s HIV/Aids program Volunteer Community Care Project of Pietermaritzburg, South Africa July 2009  –  December 2009  (6 months) Pietermaritzburg Area, South Africa •\tAssisted in educating middle and high school students on HIV/Aids curriculum  \n•\tFiled detailed case reports on students and families affected by HIV/Aids  \n•\tAided in the implementation of community gatherings and community support activities \n•\tConducted a questionnaire with over 300 students assessing the effectiveness of CCP’s HIV/Aids program In-Home Instructor Head of the Class 2007  –  2009  (2 years) Los Angeles •\tWrote a manual for incoming instructors on early childhood education and development  \n•\tPlanned individual curricula and taught reading, writing and math according to each child’s special needs \n•\tWorked with parents and teachers to develop suitable teaching strategies and evaluations of student progres In-Home Instructor Head of the Class 2007  –  2009  (2 years) Los Angeles •\tWrote a manual for incoming instructors on early childhood education and development  \n•\tPlanned individual curricula and taught reading, writing and math according to each child’s special needs \n•\tWorked with parents and teachers to develop suitable teaching strategies and evaluations of student progres Youth Leader Dash Student Ministries January 2005  –  2005  (less than a year) Los Angeles •\tCoordinated, directed, and performed staff skits correlating with each summer camp theme for students \n•\tMet with camp staff to discuss student progress and quality of scheduling  \n•\tCounseled and coached students regarding the implementation of newly learned skills to achieve their goals Youth Leader Dash Student Ministries January 2005  –  2005  (less than a year) Los Angeles •\tCoordinated, directed, and performed staff skits correlating with each summer camp theme for students \n•\tMet with camp staff to discuss student progress and quality of scheduling  \n•\tCounseled and coached students regarding the implementation of newly learned skills to achieve their goals Languages French French French Skills Running Education Conversational French Social Services Non-profits Grant Writing Fundraising Psychology Program Evaluation SPSS Volunteer Recruiting Event Planning Case Managment Public Speaking Technical Recruiting Internet Recruiting Talent Acquisition Temporary Staffing Sourcing Building Relationships Talent Management Resume Writing See 7+     See less Skills  Running Education Conversational French Social Services Non-profits Grant Writing Fundraising Psychology Program Evaluation SPSS Volunteer Recruiting Event Planning Case Managment Public Speaking Technical Recruiting Internet Recruiting Talent Acquisition Temporary Staffing Sourcing Building Relationships Talent Management Resume Writing See 7+     See less Running Education Conversational French Social Services Non-profits Grant Writing Fundraising Psychology Program Evaluation SPSS Volunteer Recruiting Event Planning Case Managment Public Speaking Technical Recruiting Internet Recruiting Talent Acquisition Temporary Staffing Sourcing Building Relationships Talent Management Resume Writing See 7+     See less Running Education Conversational French Social Services Non-profits Grant Writing Fundraising Psychology Program Evaluation SPSS Volunteer Recruiting Event Planning Case Managment Public Speaking Technical Recruiting Internet Recruiting Talent Acquisition Temporary Staffing Sourcing Building Relationships Talent Management Resume Writing See 7+     See less Education University of California, Los Angeles B.A.,  Psychology 2008  – 2010 Activities and Societies:  Alumni Scholars Club ,  Psi Chi ,  Research Assistant for Intimate Relationships Lab: Dr. Benjamin Karney ,  Research Assistant UCLA’s Children’s Media Digital Center lab: Dr. Patricia Greenfield University of KwaZulu-Natal Psychology 2009  – 2009 Activities and Societies:  Community Care Volunteer Member-PMB ,  Gilman Scholarship Recepient University of California, Los Angeles B.A.,  Psychology 2008  – 2010 Activities and Societies:  Alumni Scholars Club ,  Psi Chi ,  Research Assistant for Intimate Relationships Lab: Dr. Benjamin Karney ,  Research Assistant UCLA’s Children’s Media Digital Center lab: Dr. Patricia Greenfield University of California, Los Angeles B.A.,  Psychology 2008  – 2010 Activities and Societies:  Alumni Scholars Club ,  Psi Chi ,  Research Assistant for Intimate Relationships Lab: Dr. Benjamin Karney ,  Research Assistant UCLA’s Children’s Media Digital Center lab: Dr. Patricia Greenfield University of California, Los Angeles B.A.,  Psychology 2008  – 2010 Activities and Societies:  Alumni Scholars Club ,  Psi Chi ,  Research Assistant for Intimate Relationships Lab: Dr. Benjamin Karney ,  Research Assistant UCLA’s Children’s Media Digital Center lab: Dr. Patricia Greenfield University of KwaZulu-Natal Psychology 2009  – 2009 Activities and Societies:  Community Care Volunteer Member-PMB ,  Gilman Scholarship Recepient University of KwaZulu-Natal Psychology 2009  – 2009 Activities and Societies:  Community Care Volunteer Member-PMB ,  Gilman Scholarship Recepient University of KwaZulu-Natal Psychology 2009  – 2009 Activities and Societies:  Community Care Volunteer Member-PMB ,  Gilman Scholarship Recepient ", "Experience Recruiter for Nelson Consulting at Google Google August 2014  – Present (1 year 1 month) Mountain View, CA • Build and maintain relationships with 200+ SWE intern candidates, guiding them through the internship process; acting as an advisor and guide to ensure candidate preparedness during the interview process. \n• Coordinate and partner internally with a number of key stakeholders to assess academic needs and goals to ensure a positive candidate and host experience. \n• Maintain strong organization and time management to ensure active communication and prompt responses to candidates and referrers in order to preserve strong relationships, keep everyone informed, and on track. \n• Own individual hiring target to contribute to the goal while implement staffing strategies to provide a qualified and diverse pool. \n Communications and Alumni Chair New Leaders Council August 2014  – Present (1 year 1 month) San Francisco Bay Area Training and building a community of passionate young progressive leaders in San Francisco. Chief of Staff to Dean Kamen DEKA Research & Development December 2012  –  August 2014  (1 year 9 months) Manchester, NH • Built relationships with customers, partners and stakeholders, including senior leadership of businesses, NGOs, and government, for inventor and entrepreneur Dean Kamen. \n• Served as liaison for Kamen at FIRST - his STEM nonprofit working to get more K-12 students interested in STEM – by managing relationships, organizing event opportunities, conducting research and managing media contacts and opportunities. \n• Conducted extensive student outreach at FIRST events around the country, providing students with information and services and acting as a resource and support for volunteers, mentors, parents, and organizers. \n• Organized and maintained information and databases on people, accounts and contacts for business development opportunities, events and long- and short-term goals. \n• Created media documents and disseminated informational materials with company information and data for clients and stakeholders. \n• Participated in a range of meetings around the country with senior leadership of businesses, NGOs, and government. Fellow New Leaders Council, Boston Chapter January 2014  –  June 2014  (6 months) Greater Boston Area One of 20 candidate accepted into a five-month institute on progressive leadership development. NLC works to build entrepreneurship, communications, fundraising, political strategy, and management skills for tomorrow's leaders. Legislative Aide California Secretary of State December 2011  –  December 2012  (1 year 1 month) Sacramento, California Area • Researched and drafted legislation sponsored by the Secretary of State – including expanding voting access for military and overseas voters and improving the Safe at Home program, a confidential mail service for victims of domestic violence and stalking.  \n• Tracked 200-300 legislative bills per session in areas of interest, and kept organized analysis impact on \nthe agency. • Advocated on legislation and negotiate amendments with various stakeholders.  \n• Wrote background information and talking points for the Secretary, and staffed her at events throughout the state. Project Aide Delta Conservancy, California Natural Resources Agency December 2011  –  June 2012  (7 months) Sacramento, California Area • Consulted for the Delta Conservancy on short-term and long-term objectives for the agency to analyze current programs and identify issues of law enforcement in the Sacramento-San Joaquin Delta Region.  \n• Conducted interviews with law enforcement in the 5 Delta counties.  \n• Drafted transcripts, wrote summaries and collected data on current organizational practices, policies and procedures.  \n• Analyzed data, verbal testimony and ongoing concerns from law enforcement and local residents of the Delta and provided short-term and long-term goals and steps necessary to meet future program needs.  \n• Produced a 25 page report on law enforcement issues in the Delta.  External Relations Intern The Education Trust - West June 2011  –  February 2012  (9 months) Oakland, CA • Crafted and implemented a social-media plan that grew the organization’s online presence three-fold.  \n• Utilized social media and CRM software to promote the company - including a book release party for the Senior Advisor.  \n• Reformatted and rewrote HTML code for the organization’s website to improve their online image.  \n• Drafted a 75-page opposition research document allowing the firm to better position themselves on legislation and policy.  \n• Wrote and edited press releases. Student Manager - Information Technology Services Smith College August 2008  –  July 2011  (3 years) Smith College, Northampton, MA • Utilized self taught skills to define problems with school technology to repair computers and trouble-shoot software.  \n• Managed 30 student workers as they interacted with students and staff to meet classroom support needs and goals. Attended and assisted staff training programs for student workers. \n• Implemented courses of action and monitored results to provide on-going feedback to my supervisor on concerns and issues that occurred and ways to address issues with student workers.  \n• Coordinated with faculty, staff and students on emergency and ongoing classroom support. Analyzed classroom support techniques and services to determine impacts. Congressional Intern Congresswoman Nancy Pelosi May 2010  –  August 2010  (4 months) San Francisco Bay Area Congressional Intern Office of Congresswoman Tammy Baldwin June 2009  –  December 2009  (7 months) Washington D.C. Metro Area Recruiter for Nelson Consulting at Google Google August 2014  – Present (1 year 1 month) Mountain View, CA • Build and maintain relationships with 200+ SWE intern candidates, guiding them through the internship process; acting as an advisor and guide to ensure candidate preparedness during the interview process. \n• Coordinate and partner internally with a number of key stakeholders to assess academic needs and goals to ensure a positive candidate and host experience. \n• Maintain strong organization and time management to ensure active communication and prompt responses to candidates and referrers in order to preserve strong relationships, keep everyone informed, and on track. \n• Own individual hiring target to contribute to the goal while implement staffing strategies to provide a qualified and diverse pool. \n Recruiter for Nelson Consulting at Google Google August 2014  – Present (1 year 1 month) Mountain View, CA • Build and maintain relationships with 200+ SWE intern candidates, guiding them through the internship process; acting as an advisor and guide to ensure candidate preparedness during the interview process. \n• Coordinate and partner internally with a number of key stakeholders to assess academic needs and goals to ensure a positive candidate and host experience. \n• Maintain strong organization and time management to ensure active communication and prompt responses to candidates and referrers in order to preserve strong relationships, keep everyone informed, and on track. \n• Own individual hiring target to contribute to the goal while implement staffing strategies to provide a qualified and diverse pool. \n Communications and Alumni Chair New Leaders Council August 2014  – Present (1 year 1 month) San Francisco Bay Area Training and building a community of passionate young progressive leaders in San Francisco. Communications and Alumni Chair New Leaders Council August 2014  – Present (1 year 1 month) San Francisco Bay Area Training and building a community of passionate young progressive leaders in San Francisco. Chief of Staff to Dean Kamen DEKA Research & Development December 2012  –  August 2014  (1 year 9 months) Manchester, NH • Built relationships with customers, partners and stakeholders, including senior leadership of businesses, NGOs, and government, for inventor and entrepreneur Dean Kamen. \n• Served as liaison for Kamen at FIRST - his STEM nonprofit working to get more K-12 students interested in STEM – by managing relationships, organizing event opportunities, conducting research and managing media contacts and opportunities. \n• Conducted extensive student outreach at FIRST events around the country, providing students with information and services and acting as a resource and support for volunteers, mentors, parents, and organizers. \n• Organized and maintained information and databases on people, accounts and contacts for business development opportunities, events and long- and short-term goals. \n• Created media documents and disseminated informational materials with company information and data for clients and stakeholders. \n• Participated in a range of meetings around the country with senior leadership of businesses, NGOs, and government. Chief of Staff to Dean Kamen DEKA Research & Development December 2012  –  August 2014  (1 year 9 months) Manchester, NH • Built relationships with customers, partners and stakeholders, including senior leadership of businesses, NGOs, and government, for inventor and entrepreneur Dean Kamen. \n• Served as liaison for Kamen at FIRST - his STEM nonprofit working to get more K-12 students interested in STEM – by managing relationships, organizing event opportunities, conducting research and managing media contacts and opportunities. \n• Conducted extensive student outreach at FIRST events around the country, providing students with information and services and acting as a resource and support for volunteers, mentors, parents, and organizers. \n• Organized and maintained information and databases on people, accounts and contacts for business development opportunities, events and long- and short-term goals. \n• Created media documents and disseminated informational materials with company information and data for clients and stakeholders. \n• Participated in a range of meetings around the country with senior leadership of businesses, NGOs, and government. Fellow New Leaders Council, Boston Chapter January 2014  –  June 2014  (6 months) Greater Boston Area One of 20 candidate accepted into a five-month institute on progressive leadership development. NLC works to build entrepreneurship, communications, fundraising, political strategy, and management skills for tomorrow's leaders. Fellow New Leaders Council, Boston Chapter January 2014  –  June 2014  (6 months) Greater Boston Area One of 20 candidate accepted into a five-month institute on progressive leadership development. NLC works to build entrepreneurship, communications, fundraising, political strategy, and management skills for tomorrow's leaders. Legislative Aide California Secretary of State December 2011  –  December 2012  (1 year 1 month) Sacramento, California Area • Researched and drafted legislation sponsored by the Secretary of State – including expanding voting access for military and overseas voters and improving the Safe at Home program, a confidential mail service for victims of domestic violence and stalking.  \n• Tracked 200-300 legislative bills per session in areas of interest, and kept organized analysis impact on \nthe agency. • Advocated on legislation and negotiate amendments with various stakeholders.  \n• Wrote background information and talking points for the Secretary, and staffed her at events throughout the state. Legislative Aide California Secretary of State December 2011  –  December 2012  (1 year 1 month) Sacramento, California Area • Researched and drafted legislation sponsored by the Secretary of State – including expanding voting access for military and overseas voters and improving the Safe at Home program, a confidential mail service for victims of domestic violence and stalking.  \n• Tracked 200-300 legislative bills per session in areas of interest, and kept organized analysis impact on \nthe agency. • Advocated on legislation and negotiate amendments with various stakeholders.  \n• Wrote background information and talking points for the Secretary, and staffed her at events throughout the state. Project Aide Delta Conservancy, California Natural Resources Agency December 2011  –  June 2012  (7 months) Sacramento, California Area • Consulted for the Delta Conservancy on short-term and long-term objectives for the agency to analyze current programs and identify issues of law enforcement in the Sacramento-San Joaquin Delta Region.  \n• Conducted interviews with law enforcement in the 5 Delta counties.  \n• Drafted transcripts, wrote summaries and collected data on current organizational practices, policies and procedures.  \n• Analyzed data, verbal testimony and ongoing concerns from law enforcement and local residents of the Delta and provided short-term and long-term goals and steps necessary to meet future program needs.  \n• Produced a 25 page report on law enforcement issues in the Delta.  Project Aide Delta Conservancy, California Natural Resources Agency December 2011  –  June 2012  (7 months) Sacramento, California Area • Consulted for the Delta Conservancy on short-term and long-term objectives for the agency to analyze current programs and identify issues of law enforcement in the Sacramento-San Joaquin Delta Region.  \n• Conducted interviews with law enforcement in the 5 Delta counties.  \n• Drafted transcripts, wrote summaries and collected data on current organizational practices, policies and procedures.  \n• Analyzed data, verbal testimony and ongoing concerns from law enforcement and local residents of the Delta and provided short-term and long-term goals and steps necessary to meet future program needs.  \n• Produced a 25 page report on law enforcement issues in the Delta.  External Relations Intern The Education Trust - West June 2011  –  February 2012  (9 months) Oakland, CA • Crafted and implemented a social-media plan that grew the organization’s online presence three-fold.  \n• Utilized social media and CRM software to promote the company - including a book release party for the Senior Advisor.  \n• Reformatted and rewrote HTML code for the organization’s website to improve their online image.  \n• Drafted a 75-page opposition research document allowing the firm to better position themselves on legislation and policy.  \n• Wrote and edited press releases. External Relations Intern The Education Trust - West June 2011  –  February 2012  (9 months) Oakland, CA • Crafted and implemented a social-media plan that grew the organization’s online presence three-fold.  \n• Utilized social media and CRM software to promote the company - including a book release party for the Senior Advisor.  \n• Reformatted and rewrote HTML code for the organization’s website to improve their online image.  \n• Drafted a 75-page opposition research document allowing the firm to better position themselves on legislation and policy.  \n• Wrote and edited press releases. Student Manager - Information Technology Services Smith College August 2008  –  July 2011  (3 years) Smith College, Northampton, MA • Utilized self taught skills to define problems with school technology to repair computers and trouble-shoot software.  \n• Managed 30 student workers as they interacted with students and staff to meet classroom support needs and goals. Attended and assisted staff training programs for student workers. \n• Implemented courses of action and monitored results to provide on-going feedback to my supervisor on concerns and issues that occurred and ways to address issues with student workers.  \n• Coordinated with faculty, staff and students on emergency and ongoing classroom support. Analyzed classroom support techniques and services to determine impacts. Student Manager - Information Technology Services Smith College August 2008  –  July 2011  (3 years) Smith College, Northampton, MA • Utilized self taught skills to define problems with school technology to repair computers and trouble-shoot software.  \n• Managed 30 student workers as they interacted with students and staff to meet classroom support needs and goals. Attended and assisted staff training programs for student workers. \n• Implemented courses of action and monitored results to provide on-going feedback to my supervisor on concerns and issues that occurred and ways to address issues with student workers.  \n• Coordinated with faculty, staff and students on emergency and ongoing classroom support. Analyzed classroom support techniques and services to determine impacts. Congressional Intern Congresswoman Nancy Pelosi May 2010  –  August 2010  (4 months) San Francisco Bay Area Congressional Intern Congresswoman Nancy Pelosi May 2010  –  August 2010  (4 months) San Francisco Bay Area Congressional Intern Office of Congresswoman Tammy Baldwin June 2009  –  December 2009  (7 months) Washington D.C. Metro Area Congressional Intern Office of Congresswoman Tammy Baldwin June 2009  –  December 2009  (7 months) Washington D.C. Metro Area Education Smith College BA 2007  – 2011 University of Edinburgh Bachelor of Arts (B.A.) 2010  – 2010 Alameda High School Smith College BA 2007  – 2011 Smith College BA 2007  – 2011 Smith College BA 2007  – 2011 University of Edinburgh Bachelor of Arts (B.A.) 2010  – 2010 University of Edinburgh Bachelor of Arts (B.A.) 2010  – 2010 University of Edinburgh Bachelor of Arts (B.A.) 2010  – 2010 Alameda High School Alameda High School Alameda High School ", "Summary Responsible for 360° recruitment across APAC, working in close partnership with the business to find the best and the brightest. I focus on understanding both the candidate and business needs and discovering how best the two would intersect. \n \nExperience: over 15 years in Japan with 10 years experience in both in-house and agency recruitment of IT, Pharmaceutical, and Semiconductor/HI. Management and leadership experience, devising and driving talent acquisition strategy for Japan/APAC region. \n \nCurrently the APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ \n \nFluent in Japanese, English Summary Responsible for 360° recruitment across APAC, working in close partnership with the business to find the best and the brightest. I focus on understanding both the candidate and business needs and discovering how best the two would intersect. \n \nExperience: over 15 years in Japan with 10 years experience in both in-house and agency recruitment of IT, Pharmaceutical, and Semiconductor/HI. Management and leadership experience, devising and driving talent acquisition strategy for Japan/APAC region. \n \nCurrently the APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ \n \nFluent in Japanese, English Responsible for 360° recruitment across APAC, working in close partnership with the business to find the best and the brightest. I focus on understanding both the candidate and business needs and discovering how best the two would intersect. \n \nExperience: over 15 years in Japan with 10 years experience in both in-house and agency recruitment of IT, Pharmaceutical, and Semiconductor/HI. Management and leadership experience, devising and driving talent acquisition strategy for Japan/APAC region. \n \nCurrently the APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ \n \nFluent in Japanese, English Responsible for 360° recruitment across APAC, working in close partnership with the business to find the best and the brightest. I focus on understanding both the candidate and business needs and discovering how best the two would intersect. \n \nExperience: over 15 years in Japan with 10 years experience in both in-house and agency recruitment of IT, Pharmaceutical, and Semiconductor/HI. Management and leadership experience, devising and driving talent acquisition strategy for Japan/APAC region. \n \nCurrently the APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ \n \nFluent in Japanese, English Experience Recruiter, APAC Lead for Google for Work Google December 2013  – Present (1 year 9 months) Tokyo, Japan APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ Recruiter, APAC Lead for Google for Work Google December 2013  – Present (1 year 9 months) Tokyo, Japan APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ Recruiter, APAC Lead for Google for Work Google December 2013  – Present (1 year 9 months) Tokyo, Japan APAC POC (Point of Contact) Recruiter for Google for Work. Responsible for recruitment of all key sales and technical roles across APAC for Google's enterprise solutions division. Solutions range from SaaS (Google Apps) to IaaS, PaaS, Storage (Google Cloud Platform) to Devices to Geospatial to Emerging technologies and more.  \n \nHelping bring the best of Google, now for work. \nhttps://www.google.com/work/ Languages Japanese Native or bilingual proficiency English Native or bilingual proficiency Japanese Native or bilingual proficiency English Native or bilingual proficiency Japanese Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Talent Partnering Talent Acquisition Talent Scouting Executive Search IT Recruitment Bilingual... Japanese fluency Japanese market Japanese Bilingual Omniture Content Management Automotive Business Development Recruiting Technical Recruiting Contract Recruitment Sourcing Talent Management Search Employer Branding Internet Recruiting Leadership Social Networking Vendor Management Human Resources CRM Sales Consulting Applicant Tracking... E-commerce Management Recruitment Advertising Digital Marketing Interviews Screening Resumes Information Technology Benefits Negotiation Career Counseling HR Consulting Employee Engagement Screening Personnel Management Onboarding Hiring Employee Relations Performance Management SEO HRIS Employee Benefits See 35+     See less Skills  Talent Partnering Talent Acquisition Talent Scouting Executive Search IT Recruitment Bilingual... Japanese fluency Japanese market Japanese Bilingual Omniture Content Management Automotive Business Development Recruiting Technical Recruiting Contract Recruitment Sourcing Talent Management Search Employer Branding Internet Recruiting Leadership Social Networking Vendor Management Human Resources CRM Sales Consulting Applicant Tracking... E-commerce Management Recruitment Advertising Digital Marketing Interviews Screening Resumes Information Technology Benefits Negotiation Career Counseling HR Consulting Employee Engagement Screening Personnel Management Onboarding Hiring Employee Relations Performance Management SEO HRIS Employee Benefits See 35+     See less Talent Partnering Talent Acquisition Talent Scouting Executive Search IT Recruitment Bilingual... Japanese fluency Japanese market Japanese Bilingual Omniture Content Management Automotive Business Development Recruiting Technical Recruiting Contract Recruitment Sourcing Talent Management Search Employer Branding Internet Recruiting Leadership Social Networking Vendor Management Human Resources CRM Sales Consulting Applicant Tracking... E-commerce Management Recruitment Advertising Digital Marketing Interviews Screening Resumes Information Technology Benefits Negotiation Career Counseling HR Consulting Employee Engagement Screening Personnel Management Onboarding Hiring Employee Relations Performance Management SEO HRIS Employee Benefits See 35+     See less Talent Partnering Talent Acquisition Talent Scouting Executive Search IT Recruitment Bilingual... Japanese fluency Japanese market Japanese Bilingual Omniture Content Management Automotive Business Development Recruiting Technical Recruiting Contract Recruitment Sourcing Talent Management Search Employer Branding Internet Recruiting Leadership Social Networking Vendor Management Human Resources CRM Sales Consulting Applicant Tracking... E-commerce Management Recruitment Advertising Digital Marketing Interviews Screening Resumes Information Technology Benefits Negotiation Career Counseling HR Consulting Employee Engagement Screening Personnel Management Onboarding Hiring Employee Relations Performance Management SEO HRIS Employee Benefits See 35+     See less Education University of Victoria Bachelors,  Linguistics 2000  – 2004 University of Victoria Bachelors,  Linguistics 2000  – 2004 University of Victoria Bachelors,  Linguistics 2000  – 2004 University of Victoria Bachelors,  Linguistics 2000  – 2004 ", "Summary Leadership/executive recruiting and sourcing in the areas of engineering and technology Summary Leadership/executive recruiting and sourcing in the areas of engineering and technology Leadership/executive recruiting and sourcing in the areas of engineering and technology Leadership/executive recruiting and sourcing in the areas of engineering and technology Experience Google Recruiter- IT and Technology Google February 2014  – Present (1 year 7 months) Austin, Texas Area My focus is on providing opportunities to leadership-level candidates across all of Corporate Engineering and Technology Infrastructure at Google \n \nWhat we look for: Hands on technical leaders/executives in the areas of Knowledge, Ads and Commerce, Mobile, Social, Chrome and Apps, Technical Infrastructure, YouTube and X. Ability to lead the strategy, the roadmap and develop a team is a plus.  \n \nCurrently recruiting for: Leaders across SDN Networking, Product Management Leaders who are highly technical, Corporate Engineering Leaders who are hands on, and technical Supply Chain Leaders Executive Recruiter Dell November 2006  –  February 2014  (7 years 4 months) Areas of Focus: \n \nSharing dynamic executive-level roles across all business units with top talent HR Project Management Dell May 2005  –  June 2006  (1 year 2 months) Areas of experience include: \n \nVendor Neutral Program, VNP, Staffing Processes, Customer Satisfaction, Vendor Management, Metrics and Reporting Recruiter Pfizer Pharmaceuticals October 2002  –  February 2005  (2 years 5 months) Recruiting for Sales, Marketing and Research Professionals for US operations. In this role I was presented with the opportunity to develop, roll-out and manage a full recruiting program for Pfizer sales. Recruiter Datek Online/ Ameritrade March 2002  –  October 2002  (8 months) Area of Focus: Financial Services \n \nBuilding and Delivering our Outplacement Program, Career Coaching & Career Transition Google Recruiter- IT and Technology Google February 2014  – Present (1 year 7 months) Austin, Texas Area My focus is on providing opportunities to leadership-level candidates across all of Corporate Engineering and Technology Infrastructure at Google \n \nWhat we look for: Hands on technical leaders/executives in the areas of Knowledge, Ads and Commerce, Mobile, Social, Chrome and Apps, Technical Infrastructure, YouTube and X. Ability to lead the strategy, the roadmap and develop a team is a plus.  \n \nCurrently recruiting for: Leaders across SDN Networking, Product Management Leaders who are highly technical, Corporate Engineering Leaders who are hands on, and technical Supply Chain Leaders Google Recruiter- IT and Technology Google February 2014  – Present (1 year 7 months) Austin, Texas Area My focus is on providing opportunities to leadership-level candidates across all of Corporate Engineering and Technology Infrastructure at Google \n \nWhat we look for: Hands on technical leaders/executives in the areas of Knowledge, Ads and Commerce, Mobile, Social, Chrome and Apps, Technical Infrastructure, YouTube and X. Ability to lead the strategy, the roadmap and develop a team is a plus.  \n \nCurrently recruiting for: Leaders across SDN Networking, Product Management Leaders who are highly technical, Corporate Engineering Leaders who are hands on, and technical Supply Chain Leaders Executive Recruiter Dell November 2006  –  February 2014  (7 years 4 months) Areas of Focus: \n \nSharing dynamic executive-level roles across all business units with top talent Executive Recruiter Dell November 2006  –  February 2014  (7 years 4 months) Areas of Focus: \n \nSharing dynamic executive-level roles across all business units with top talent HR Project Management Dell May 2005  –  June 2006  (1 year 2 months) Areas of experience include: \n \nVendor Neutral Program, VNP, Staffing Processes, Customer Satisfaction, Vendor Management, Metrics and Reporting HR Project Management Dell May 2005  –  June 2006  (1 year 2 months) Areas of experience include: \n \nVendor Neutral Program, VNP, Staffing Processes, Customer Satisfaction, Vendor Management, Metrics and Reporting Recruiter Pfizer Pharmaceuticals October 2002  –  February 2005  (2 years 5 months) Recruiting for Sales, Marketing and Research Professionals for US operations. In this role I was presented with the opportunity to develop, roll-out and manage a full recruiting program for Pfizer sales. Recruiter Pfizer Pharmaceuticals October 2002  –  February 2005  (2 years 5 months) Recruiting for Sales, Marketing and Research Professionals for US operations. In this role I was presented with the opportunity to develop, roll-out and manage a full recruiting program for Pfizer sales. Recruiter Datek Online/ Ameritrade March 2002  –  October 2002  (8 months) Area of Focus: Financial Services \n \nBuilding and Delivering our Outplacement Program, Career Coaching & Career Transition Recruiter Datek Online/ Ameritrade March 2002  –  October 2002  (8 months) Area of Focus: Financial Services \n \nBuilding and Delivering our Outplacement Program, Career Coaching & Career Transition Skills Talent Acquisition Sourcing Recruiting Executive Search Technical Recruiting Direct Sourcing Applicant Tracking... Finance Candidate Assessment Interviews Skills  Talent Acquisition Sourcing Recruiting Executive Search Technical Recruiting Direct Sourcing Applicant Tracking... Finance Candidate Assessment Interviews Talent Acquisition Sourcing Recruiting Executive Search Technical Recruiting Direct Sourcing Applicant Tracking... Finance Candidate Assessment Interviews Talent Acquisition Sourcing Recruiting Executive Search Technical Recruiting Direct Sourcing Applicant Tracking... Finance Candidate Assessment Interviews Education Texas Tech University 1994  – 1997 Texas Tech University 1994  – 1997 Texas Tech University 1994  – 1997 Texas Tech University 1994  – 1997 Honors & Awards Additional Honors & Awards Dell HR Platinum Award \nRecognized by Stanley Marcus for Outstanding Customer Service Additional Honors & Awards Dell HR Platinum Award \nRecognized by Stanley Marcus for Outstanding Customer Service Additional Honors & Awards Dell HR Platinum Award \nRecognized by Stanley Marcus for Outstanding Customer Service Additional Honors & Awards Dell HR Platinum Award \nRecognized by Stanley Marcus for Outstanding Customer Service ", "Summary Recruiter turned entrepreneur with experience hiring in both corporate and agency environments. Summary Recruiter turned entrepreneur with experience hiring in both corporate and agency environments. Recruiter turned entrepreneur with experience hiring in both corporate and agency environments. Recruiter turned entrepreneur with experience hiring in both corporate and agency environments. Experience University Recruiter (Contract via Nelson Staffing) Google September 2014  – Present (1 year) Mountain View, CA Facilitate the hiring process for Software Engineers graduating from universities nationwide \nEducate candidates about the hiring process and partner with internal clients to obtain feedback and move the hiring process forward Owner / CEO Inside Recruiter April 2013  – Present (2 years 5 months) You can visit our website for more information www.insiderecruiter.com \n \nInside Recruiter helps individuals highlight the right skill-set and experience for their career path; ensure they are not ruled out due to improper formatting and small errors; and make the best first impression with employers. \n \nInside Recruiter offers personalized, in-depth phone consultations with every client to fully understand their specific experience, strengths, skills, and career path. There are many resume writing services available, but Inside Recruiter strives to produce the best quality. Each service is tailored to the individual and templates are not used. \n \nServices Include: Resumes, LinkedIn Profiles, Interview Preparation, and Speaking Engagements Recruiter/Junior Account Manager Altegra Health June 2012  –  July 2014  (2 years 2 months) Greater Los Angeles Area Earned over $500,000 in revenue during first year with an average margin of 54% \nReviewed resumes and phone screened candidates in the HIM industry including medical coders, auditors, and nurses; placed candidates at leading hospitals nationwide \n \nAltegra Health was formed through the merger of five “best in breed” companies including The Coding Source, LLC and Sinaiko Healthcare Consulting. We have been operating since 1990 out of six regional offices with over 1,000 employees nationwide to serve our clients. Senior Corporate Recruiter Internet Brands February 2010  –  June 2012  (2 years 5 months) Greater Los Angeles Area Hired 10 employees in one month and over 100 employees while at the company. \nCreated and facilitated training for on-boarding new recruiters and recruiting interns, mentored new employees \n \nPositions Filled: Sales Manager, Inside Advertising Sales Reps for various departments (e.g. - Travel, Auto, Health, Shopping), Java Developers, District Managers in various territories nationwide, Product/Business Analyst, Finance Manager, Accounting Manager, Marketing Intern, Corporate Recruiters, Accounts Receivable Specialists, Ad Service Coordinators. \n \nInternet Brands is a new media company that operates online media, community, and e-commerce websites in vertical markets. The company also develops and licenses Internet software and social media applications. In its Consumer Internet Division, Internet Brands owns and operates more than 200 principal websites in seven categories. University Recruiter (Contract via Nelson Staffing) Google September 2014  – Present (1 year) Mountain View, CA Facilitate the hiring process for Software Engineers graduating from universities nationwide \nEducate candidates about the hiring process and partner with internal clients to obtain feedback and move the hiring process forward University Recruiter (Contract via Nelson Staffing) Google September 2014  – Present (1 year) Mountain View, CA Facilitate the hiring process for Software Engineers graduating from universities nationwide \nEducate candidates about the hiring process and partner with internal clients to obtain feedback and move the hiring process forward Owner / CEO Inside Recruiter April 2013  – Present (2 years 5 months) You can visit our website for more information www.insiderecruiter.com \n \nInside Recruiter helps individuals highlight the right skill-set and experience for their career path; ensure they are not ruled out due to improper formatting and small errors; and make the best first impression with employers. \n \nInside Recruiter offers personalized, in-depth phone consultations with every client to fully understand their specific experience, strengths, skills, and career path. There are many resume writing services available, but Inside Recruiter strives to produce the best quality. Each service is tailored to the individual and templates are not used. \n \nServices Include: Resumes, LinkedIn Profiles, Interview Preparation, and Speaking Engagements Owner / CEO Inside Recruiter April 2013  – Present (2 years 5 months) You can visit our website for more information www.insiderecruiter.com \n \nInside Recruiter helps individuals highlight the right skill-set and experience for their career path; ensure they are not ruled out due to improper formatting and small errors; and make the best first impression with employers. \n \nInside Recruiter offers personalized, in-depth phone consultations with every client to fully understand their specific experience, strengths, skills, and career path. There are many resume writing services available, but Inside Recruiter strives to produce the best quality. Each service is tailored to the individual and templates are not used. \n \nServices Include: Resumes, LinkedIn Profiles, Interview Preparation, and Speaking Engagements Recruiter/Junior Account Manager Altegra Health June 2012  –  July 2014  (2 years 2 months) Greater Los Angeles Area Earned over $500,000 in revenue during first year with an average margin of 54% \nReviewed resumes and phone screened candidates in the HIM industry including medical coders, auditors, and nurses; placed candidates at leading hospitals nationwide \n \nAltegra Health was formed through the merger of five “best in breed” companies including The Coding Source, LLC and Sinaiko Healthcare Consulting. We have been operating since 1990 out of six regional offices with over 1,000 employees nationwide to serve our clients. Recruiter/Junior Account Manager Altegra Health June 2012  –  July 2014  (2 years 2 months) Greater Los Angeles Area Earned over $500,000 in revenue during first year with an average margin of 54% \nReviewed resumes and phone screened candidates in the HIM industry including medical coders, auditors, and nurses; placed candidates at leading hospitals nationwide \n \nAltegra Health was formed through the merger of five “best in breed” companies including The Coding Source, LLC and Sinaiko Healthcare Consulting. We have been operating since 1990 out of six regional offices with over 1,000 employees nationwide to serve our clients. Senior Corporate Recruiter Internet Brands February 2010  –  June 2012  (2 years 5 months) Greater Los Angeles Area Hired 10 employees in one month and over 100 employees while at the company. \nCreated and facilitated training for on-boarding new recruiters and recruiting interns, mentored new employees \n \nPositions Filled: Sales Manager, Inside Advertising Sales Reps for various departments (e.g. - Travel, Auto, Health, Shopping), Java Developers, District Managers in various territories nationwide, Product/Business Analyst, Finance Manager, Accounting Manager, Marketing Intern, Corporate Recruiters, Accounts Receivable Specialists, Ad Service Coordinators. \n \nInternet Brands is a new media company that operates online media, community, and e-commerce websites in vertical markets. The company also develops and licenses Internet software and social media applications. In its Consumer Internet Division, Internet Brands owns and operates more than 200 principal websites in seven categories. Senior Corporate Recruiter Internet Brands February 2010  –  June 2012  (2 years 5 months) Greater Los Angeles Area Hired 10 employees in one month and over 100 employees while at the company. \nCreated and facilitated training for on-boarding new recruiters and recruiting interns, mentored new employees \n \nPositions Filled: Sales Manager, Inside Advertising Sales Reps for various departments (e.g. - Travel, Auto, Health, Shopping), Java Developers, District Managers in various territories nationwide, Product/Business Analyst, Finance Manager, Accounting Manager, Marketing Intern, Corporate Recruiters, Accounts Receivable Specialists, Ad Service Coordinators. \n \nInternet Brands is a new media company that operates online media, community, and e-commerce websites in vertical markets. The company also develops and licenses Internet software and social media applications. In its Consumer Internet Division, Internet Brands owns and operates more than 200 principal websites in seven categories. Languages   Skills Recruiting Interviews Applicant Tracking... Talent Acquisition Human Resources Screening Resumes Leadership Resume Writing HRIS Social Media Training Marketing Talent Management Onboarding Employee Relations Taleo Contract Recruitment Full-life Cycle... Corporate Recruiting Salesforce.com Strategy Qualifying Candidates College Recruiting Candidate Generation New Hire Orientations Temporary Placement Hiring Technical Recruiting Internet Recruiting Staffing Services Search Time Management Telephone Interviewing Sourcing Closing Candidates Coaching Benefits Negotiation Recruitment Advertising Permanent Placement Executive Search Screening Job Fairs Building Relationships Sales Recruitment Organizing Communication Jobscience See 32+     See less Skills  Recruiting Interviews Applicant Tracking... Talent Acquisition Human Resources Screening Resumes Leadership Resume Writing HRIS Social Media Training Marketing Talent Management Onboarding Employee Relations Taleo Contract Recruitment Full-life Cycle... Corporate Recruiting Salesforce.com Strategy Qualifying Candidates College Recruiting Candidate Generation New Hire Orientations Temporary Placement Hiring Technical Recruiting Internet Recruiting Staffing Services Search Time Management Telephone Interviewing Sourcing Closing Candidates Coaching Benefits Negotiation Recruitment Advertising Permanent Placement Executive Search Screening Job Fairs Building Relationships Sales Recruitment Organizing Communication Jobscience See 32+     See less Recruiting Interviews Applicant Tracking... Talent Acquisition Human Resources Screening Resumes Leadership Resume Writing HRIS Social Media Training Marketing Talent Management Onboarding Employee Relations Taleo Contract Recruitment Full-life Cycle... Corporate Recruiting Salesforce.com Strategy Qualifying Candidates College Recruiting Candidate Generation New Hire Orientations Temporary Placement Hiring Technical Recruiting Internet Recruiting Staffing Services Search Time Management Telephone Interviewing Sourcing Closing Candidates Coaching Benefits Negotiation Recruitment Advertising Permanent Placement Executive Search Screening Job Fairs Building Relationships Sales Recruitment Organizing Communication Jobscience See 32+     See less Recruiting Interviews Applicant Tracking... Talent Acquisition Human Resources Screening Resumes Leadership Resume Writing HRIS Social Media Training Marketing Talent Management Onboarding Employee Relations Taleo Contract Recruitment Full-life Cycle... Corporate Recruiting Salesforce.com Strategy Qualifying Candidates College Recruiting Candidate Generation New Hire Orientations Temporary Placement Hiring Technical Recruiting Internet Recruiting Staffing Services Search Time Management Telephone Interviewing Sourcing Closing Candidates Coaching Benefits Negotiation Recruitment Advertising Permanent Placement Executive Search Screening Job Fairs Building Relationships Sales Recruitment Organizing Communication Jobscience See 32+     See less Education California State Polytechnic University-Pomona Bachelors of Science,  Business Administration ,  Human Resources 2006  – 2010 BUS492 – worked with a safety training company on marketing opportunities and created a strategic promotional plan to increase the company’s customer base and revenues Activities and Societies:  PIHRA ,  Alpha Lambda Delta Academic Honor Society ,  United Business Student Senate California State Polytechnic University-Pomona Bachelors of Science,  Business Administration ,  Human Resources 2006  – 2010 BUS492 – worked with a safety training company on marketing opportunities and created a strategic promotional plan to increase the company’s customer base and revenues Activities and Societies:  PIHRA ,  Alpha Lambda Delta Academic Honor Society ,  United Business Student Senate California State Polytechnic University-Pomona Bachelors of Science,  Business Administration ,  Human Resources 2006  – 2010 BUS492 – worked with a safety training company on marketing opportunities and created a strategic promotional plan to increase the company’s customer base and revenues Activities and Societies:  PIHRA ,  Alpha Lambda Delta Academic Honor Society ,  United Business Student Senate California State Polytechnic University-Pomona Bachelors of Science,  Business Administration ,  Human Resources 2006  – 2010 BUS492 – worked with a safety training company on marketing opportunities and created a strategic promotional plan to increase the company’s customer base and revenues Activities and Societies:  PIHRA ,  Alpha Lambda Delta Academic Honor Society ,  United Business Student Senate Honors & Awards ", "Summary Tech Recruiter Extraordinaire: \n \nI specialize in placing the world's best New Grad talent within the following fields: \n \nNew Grad (BS, MS, or PHD) Software Engineer/Site Reliability Engineer/Software Engineers in Test, Infrastructure \n \nFor more information please visit: \n \nhttp://www.google.com/about/careers/students/ \n \n•\tStrong track record of consistently exceeding sales goals and quotas in both consultative and solution-based environments. \n•\tUse exceptional communication skills to cold call and network appointments, establish trust, create urgency, and close sales. \n•\tBuild long term relationships that result in high levels of customer retention and numerous referrals. \n•\tAble to quickly assimilate new analytic software into marketing strategies, and the latest hardware into sales presentations. \n•\tAdept at absorbing a large volume of product information, translating features into benefits that are specific to the identified needs of prospective customers. \n•\tRecruit, hire, train, supervise, evaluate, discipline, and terminate sales, management, and administrative support personnel. \n•\tInteract with corporate executives to set goals and forecast upcoming months, quarters, and years. Summary Tech Recruiter Extraordinaire: \n \nI specialize in placing the world's best New Grad talent within the following fields: \n \nNew Grad (BS, MS, or PHD) Software Engineer/Site Reliability Engineer/Software Engineers in Test, Infrastructure \n \nFor more information please visit: \n \nhttp://www.google.com/about/careers/students/ \n \n•\tStrong track record of consistently exceeding sales goals and quotas in both consultative and solution-based environments. \n•\tUse exceptional communication skills to cold call and network appointments, establish trust, create urgency, and close sales. \n•\tBuild long term relationships that result in high levels of customer retention and numerous referrals. \n•\tAble to quickly assimilate new analytic software into marketing strategies, and the latest hardware into sales presentations. \n•\tAdept at absorbing a large volume of product information, translating features into benefits that are specific to the identified needs of prospective customers. \n•\tRecruit, hire, train, supervise, evaluate, discipline, and terminate sales, management, and administrative support personnel. \n•\tInteract with corporate executives to set goals and forecast upcoming months, quarters, and years. Tech Recruiter Extraordinaire: \n \nI specialize in placing the world's best New Grad talent within the following fields: \n \nNew Grad (BS, MS, or PHD) Software Engineer/Site Reliability Engineer/Software Engineers in Test, Infrastructure \n \nFor more information please visit: \n \nhttp://www.google.com/about/careers/students/ \n \n•\tStrong track record of consistently exceeding sales goals and quotas in both consultative and solution-based environments. \n•\tUse exceptional communication skills to cold call and network appointments, establish trust, create urgency, and close sales. \n•\tBuild long term relationships that result in high levels of customer retention and numerous referrals. \n•\tAble to quickly assimilate new analytic software into marketing strategies, and the latest hardware into sales presentations. \n•\tAdept at absorbing a large volume of product information, translating features into benefits that are specific to the identified needs of prospective customers. \n•\tRecruit, hire, train, supervise, evaluate, discipline, and terminate sales, management, and administrative support personnel. \n•\tInteract with corporate executives to set goals and forecast upcoming months, quarters, and years. Tech Recruiter Extraordinaire: \n \nI specialize in placing the world's best New Grad talent within the following fields: \n \nNew Grad (BS, MS, or PHD) Software Engineer/Site Reliability Engineer/Software Engineers in Test, Infrastructure \n \nFor more information please visit: \n \nhttp://www.google.com/about/careers/students/ \n \n•\tStrong track record of consistently exceeding sales goals and quotas in both consultative and solution-based environments. \n•\tUse exceptional communication skills to cold call and network appointments, establish trust, create urgency, and close sales. \n•\tBuild long term relationships that result in high levels of customer retention and numerous referrals. \n•\tAble to quickly assimilate new analytic software into marketing strategies, and the latest hardware into sales presentations. \n•\tAdept at absorbing a large volume of product information, translating features into benefits that are specific to the identified needs of prospective customers. \n•\tRecruit, hire, train, supervise, evaluate, discipline, and terminate sales, management, and administrative support personnel. \n•\tInteract with corporate executives to set goals and forecast upcoming months, quarters, and years. Experience Tech Recruiter with Nelson Staffing at Google Google November 2014  – Present (10 months) Mountain View, CA \tManage recruitment and full-cycle candidate experience with Google, ensuring a smooth and positive experience.  \n\tWorking with new grad Bachelors, Masters, and PHD candidates for Software Engineering, Software Engineering in Test, and Site Reliability Engineers roles. \n\tProactively and efficiently manage a queue of 200+ candidates during peak recruitment season, utilizing effective organizational, communication and multitasking skills. \n\tPartner with hiring managers and engineers to understand skills and background required for each role. Then proceeding to prep and educate candidates before technical phone interviews and onsite interviews. \n\tDrive offer process including extending offers, salary negotiations, generating offer letters and closing\u2028 candidates resulting in reaching 100% close ratio in Q1 & Q2 of 2015. Tech Recruiter Kforce Inc July 2014  –  November 2014  (5 months) Greater San Diego Area Lead Account Manager Mogl January 2014  –  July 2014  (7 months) Greater San Diego Area I was recruited to fill the first Inside Account Manager position at Mogl and charged with writing the \"playbook\" on how to manage the vast variety of accounts from the inside. Although originally intended to be a customer service point of contact, I quickly evolved in my role as the professional business consultant by building relationships with restaurant owners, providing training on staff engagement, and advising new clients on successfully integrating the Mogl platform in their restaurants. I became an expert on ROI, trend analysis, forecasting profit margins, data analysis, and overall loyalty rewards marketing.  \n \nI facilitated weekly meetings with other Inside Account Managers to discuss, evaluate, and create best practices to achieve objectives and overcome obstacles in this new role. I successfully completed business travel to Arizona, visiting 45 accounts in a span of 4 days to educate, train, develop, and grow the market in the state.  \n \nI was an integral part in creating the Inside Sales Coordinator role by showcasing the need and the revenue growth potential for the future success of Mogl. I also assisted in the initial recruiting, screening, and hiring of the Inside Sales Coordinators. University Recruiter Bridgepoint Education September 2012  –  January 2014  (1 year 5 months) Greater San Diego Area Recruiting and enrolling prospective online students for undergraduate degree programs through effective rapport building. Retaining students at a high rate and ensuring their success in college by proper follow up and guidance. Tasks include making outbound phone calls and being a live chat operator for prospective and current students who expressed interest or are already enrolled in Ashford University’s degree programs. Admissions Manager Bridgepoint Education January 2012  –  January 2014  (2 years 1 month) ashford university As an Admissions Manager I supervised and managed up to 15 Admissions Counselors. My role also required me to lead, coach, develop, train and inspire a diverse team to meet every student's needs and concerns about going back to school. Met with counselors and set out weekly and monthly goals for their business. Developed, planned, and created innovative ways of reaching their quantitative goals. Created initiatives such as effective call strategies, voice mail and email scripts, database management concepts, retention tracking best practices, team building breakouts, referral generation trainings, and provided additional trainings in all areas to increase business. Met with managers, directors, and divisional vice presidents in regards to forecasting total business and frequently exceeded expectations and budgets set out at the beginning of the week and months. Admissions Recruiter Bridgepoint Education 2011  –  2012  (1 year) Made over 300 outbound dials a day calling prospective students and engaging them in conversations about their educational and career goals through effective rapport building communication. Personal Banker Wells Fargo 2008  –  2010  (2 years) San Jose Performed intermediate duties and support related to branch operational activities and financial services; processed all new account transactions; assisted customers in their selection of various accounts and financial services. Became an expert in cross-selling the Bank's products and services; opened, maintained and closed all account types. Promoted and generated business for the branch by maintaining good customer relations and referring customers to appropriate staff for new services. I was fully knowledgeable and skilled in the areas of teller operations, vault, safe deposit, processing and boarding DDA lines of credit, discussing and accepting credit applications. I provided leadership, training, and support to less experienced personal bankers and other branch staff members. \n \nAccomplishments: \n- Ranked top producer as a full-time personal banker in the Santa Clara district in quarter one in 2010 in overall sale \n- Received perfect 'WOW' scores customer service surveys for the year in 2009 \n- Contributed to increasing the branch’s profit in deposit base from the previous quarter in 2009 from 84% to 89% by averaging a daily profit proxy $600 . \n- Awarded “Star Teammate” in area matrix for the highest percentage in product sales, generating highest daily profit proxy, and having the most partner referrals in the Santa Clara district.  \n- Received the “Top PB Rock Star” award from the East Hills District for quarter 2 in 2010 Tech Recruiter with Nelson Staffing at Google Google November 2014  – Present (10 months) Mountain View, CA \tManage recruitment and full-cycle candidate experience with Google, ensuring a smooth and positive experience.  \n\tWorking with new grad Bachelors, Masters, and PHD candidates for Software Engineering, Software Engineering in Test, and Site Reliability Engineers roles. \n\tProactively and efficiently manage a queue of 200+ candidates during peak recruitment season, utilizing effective organizational, communication and multitasking skills. \n\tPartner with hiring managers and engineers to understand skills and background required for each role. Then proceeding to prep and educate candidates before technical phone interviews and onsite interviews. \n\tDrive offer process including extending offers, salary negotiations, generating offer letters and closing\u2028 candidates resulting in reaching 100% close ratio in Q1 & Q2 of 2015. Tech Recruiter with Nelson Staffing at Google Google November 2014  – Present (10 months) Mountain View, CA \tManage recruitment and full-cycle candidate experience with Google, ensuring a smooth and positive experience.  \n\tWorking with new grad Bachelors, Masters, and PHD candidates for Software Engineering, Software Engineering in Test, and Site Reliability Engineers roles. \n\tProactively and efficiently manage a queue of 200+ candidates during peak recruitment season, utilizing effective organizational, communication and multitasking skills. \n\tPartner with hiring managers and engineers to understand skills and background required for each role. Then proceeding to prep and educate candidates before technical phone interviews and onsite interviews. \n\tDrive offer process including extending offers, salary negotiations, generating offer letters and closing\u2028 candidates resulting in reaching 100% close ratio in Q1 & Q2 of 2015. Tech Recruiter Kforce Inc July 2014  –  November 2014  (5 months) Greater San Diego Area Tech Recruiter Kforce Inc July 2014  –  November 2014  (5 months) Greater San Diego Area Lead Account Manager Mogl January 2014  –  July 2014  (7 months) Greater San Diego Area I was recruited to fill the first Inside Account Manager position at Mogl and charged with writing the \"playbook\" on how to manage the vast variety of accounts from the inside. Although originally intended to be a customer service point of contact, I quickly evolved in my role as the professional business consultant by building relationships with restaurant owners, providing training on staff engagement, and advising new clients on successfully integrating the Mogl platform in their restaurants. I became an expert on ROI, trend analysis, forecasting profit margins, data analysis, and overall loyalty rewards marketing.  \n \nI facilitated weekly meetings with other Inside Account Managers to discuss, evaluate, and create best practices to achieve objectives and overcome obstacles in this new role. I successfully completed business travel to Arizona, visiting 45 accounts in a span of 4 days to educate, train, develop, and grow the market in the state.  \n \nI was an integral part in creating the Inside Sales Coordinator role by showcasing the need and the revenue growth potential for the future success of Mogl. I also assisted in the initial recruiting, screening, and hiring of the Inside Sales Coordinators. Lead Account Manager Mogl January 2014  –  July 2014  (7 months) Greater San Diego Area I was recruited to fill the first Inside Account Manager position at Mogl and charged with writing the \"playbook\" on how to manage the vast variety of accounts from the inside. Although originally intended to be a customer service point of contact, I quickly evolved in my role as the professional business consultant by building relationships with restaurant owners, providing training on staff engagement, and advising new clients on successfully integrating the Mogl platform in their restaurants. I became an expert on ROI, trend analysis, forecasting profit margins, data analysis, and overall loyalty rewards marketing.  \n \nI facilitated weekly meetings with other Inside Account Managers to discuss, evaluate, and create best practices to achieve objectives and overcome obstacles in this new role. I successfully completed business travel to Arizona, visiting 45 accounts in a span of 4 days to educate, train, develop, and grow the market in the state.  \n \nI was an integral part in creating the Inside Sales Coordinator role by showcasing the need and the revenue growth potential for the future success of Mogl. I also assisted in the initial recruiting, screening, and hiring of the Inside Sales Coordinators. University Recruiter Bridgepoint Education September 2012  –  January 2014  (1 year 5 months) Greater San Diego Area Recruiting and enrolling prospective online students for undergraduate degree programs through effective rapport building. Retaining students at a high rate and ensuring their success in college by proper follow up and guidance. Tasks include making outbound phone calls and being a live chat operator for prospective and current students who expressed interest or are already enrolled in Ashford University’s degree programs. University Recruiter Bridgepoint Education September 2012  –  January 2014  (1 year 5 months) Greater San Diego Area Recruiting and enrolling prospective online students for undergraduate degree programs through effective rapport building. Retaining students at a high rate and ensuring their success in college by proper follow up and guidance. Tasks include making outbound phone calls and being a live chat operator for prospective and current students who expressed interest or are already enrolled in Ashford University’s degree programs. Admissions Manager Bridgepoint Education January 2012  –  January 2014  (2 years 1 month) ashford university As an Admissions Manager I supervised and managed up to 15 Admissions Counselors. My role also required me to lead, coach, develop, train and inspire a diverse team to meet every student's needs and concerns about going back to school. Met with counselors and set out weekly and monthly goals for their business. Developed, planned, and created innovative ways of reaching their quantitative goals. Created initiatives such as effective call strategies, voice mail and email scripts, database management concepts, retention tracking best practices, team building breakouts, referral generation trainings, and provided additional trainings in all areas to increase business. Met with managers, directors, and divisional vice presidents in regards to forecasting total business and frequently exceeded expectations and budgets set out at the beginning of the week and months. Admissions Manager Bridgepoint Education January 2012  –  January 2014  (2 years 1 month) ashford university As an Admissions Manager I supervised and managed up to 15 Admissions Counselors. My role also required me to lead, coach, develop, train and inspire a diverse team to meet every student's needs and concerns about going back to school. Met with counselors and set out weekly and monthly goals for their business. Developed, planned, and created innovative ways of reaching their quantitative goals. Created initiatives such as effective call strategies, voice mail and email scripts, database management concepts, retention tracking best practices, team building breakouts, referral generation trainings, and provided additional trainings in all areas to increase business. Met with managers, directors, and divisional vice presidents in regards to forecasting total business and frequently exceeded expectations and budgets set out at the beginning of the week and months. Admissions Recruiter Bridgepoint Education 2011  –  2012  (1 year) Made over 300 outbound dials a day calling prospective students and engaging them in conversations about their educational and career goals through effective rapport building communication. Admissions Recruiter Bridgepoint Education 2011  –  2012  (1 year) Made over 300 outbound dials a day calling prospective students and engaging them in conversations about their educational and career goals through effective rapport building communication. Personal Banker Wells Fargo 2008  –  2010  (2 years) San Jose Performed intermediate duties and support related to branch operational activities and financial services; processed all new account transactions; assisted customers in their selection of various accounts and financial services. Became an expert in cross-selling the Bank's products and services; opened, maintained and closed all account types. Promoted and generated business for the branch by maintaining good customer relations and referring customers to appropriate staff for new services. I was fully knowledgeable and skilled in the areas of teller operations, vault, safe deposit, processing and boarding DDA lines of credit, discussing and accepting credit applications. I provided leadership, training, and support to less experienced personal bankers and other branch staff members. \n \nAccomplishments: \n- Ranked top producer as a full-time personal banker in the Santa Clara district in quarter one in 2010 in overall sale \n- Received perfect 'WOW' scores customer service surveys for the year in 2009 \n- Contributed to increasing the branch’s profit in deposit base from the previous quarter in 2009 from 84% to 89% by averaging a daily profit proxy $600 . \n- Awarded “Star Teammate” in area matrix for the highest percentage in product sales, generating highest daily profit proxy, and having the most partner referrals in the Santa Clara district.  \n- Received the “Top PB Rock Star” award from the East Hills District for quarter 2 in 2010 Personal Banker Wells Fargo 2008  –  2010  (2 years) San Jose Performed intermediate duties and support related to branch operational activities and financial services; processed all new account transactions; assisted customers in their selection of various accounts and financial services. Became an expert in cross-selling the Bank's products and services; opened, maintained and closed all account types. Promoted and generated business for the branch by maintaining good customer relations and referring customers to appropriate staff for new services. I was fully knowledgeable and skilled in the areas of teller operations, vault, safe deposit, processing and boarding DDA lines of credit, discussing and accepting credit applications. I provided leadership, training, and support to less experienced personal bankers and other branch staff members. \n \nAccomplishments: \n- Ranked top producer as a full-time personal banker in the Santa Clara district in quarter one in 2010 in overall sale \n- Received perfect 'WOW' scores customer service surveys for the year in 2009 \n- Contributed to increasing the branch’s profit in deposit base from the previous quarter in 2009 from 84% to 89% by averaging a daily profit proxy $600 . \n- Awarded “Star Teammate” in area matrix for the highest percentage in product sales, generating highest daily profit proxy, and having the most partner referrals in the Santa Clara district.  \n- Received the “Top PB Rock Star” award from the East Hills District for quarter 2 in 2010 Skills Customer Retention Sales Sales Management... Higher Education Customer Service... Student Recruiting Retail Banking Branch Banking Job Coaching Career Counseling Account Executives Building Clientele College Recruiting Internet Recruiting Consulting Technology Recruitment Interviews Relationship Building Social Networking Leadership Recruiting Microsoft Office Management Human Resources Marketing Customer Service Training See 12+     See less Skills  Customer Retention Sales Sales Management... Higher Education Customer Service... Student Recruiting Retail Banking Branch Banking Job Coaching Career Counseling Account Executives Building Clientele College Recruiting Internet Recruiting Consulting Technology Recruitment Interviews Relationship Building Social Networking Leadership Recruiting Microsoft Office Management Human Resources Marketing Customer Service Training See 12+     See less Customer Retention Sales Sales Management... Higher Education Customer Service... Student Recruiting Retail Banking Branch Banking Job Coaching Career Counseling Account Executives Building Clientele College Recruiting Internet Recruiting Consulting Technology Recruitment Interviews Relationship Building Social Networking Leadership Recruiting Microsoft Office Management Human Resources Marketing Customer Service Training See 12+     See less Customer Retention Sales Sales Management... Higher Education Customer Service... Student Recruiting Retail Banking Branch Banking Job Coaching Career Counseling Account Executives Building Clientele College Recruiting Internet Recruiting Consulting Technology Recruitment Interviews Relationship Building Social Networking Leadership Recruiting Microsoft Office Management Human Resources Marketing Customer Service Training See 12+     See less Education University of California, San Diego Bachelor's degree,  Communication and Media Studies Activities and Societies:  Provost Honors University of California, San Diego Bachelor's degree,  Communication and Media Studies Activities and Societies:  Provost Honors University of California, San Diego Bachelor's degree,  Communication and Media Studies Activities and Societies:  Provost Honors University of California, San Diego Bachelor's degree,  Communication and Media Studies Activities and Societies:  Provost Honors ", "Summary Experienced University Recruiting professional with a passion for building strategic campus relationships and enhancing the candidate experience. Summary Experienced University Recruiting professional with a passion for building strategic campus relationships and enhancing the candidate experience. Experienced University Recruiting professional with a passion for building strategic campus relationships and enhancing the candidate experience. Experienced University Recruiting professional with a passion for building strategic campus relationships and enhancing the candidate experience. Experience New Grad Recruiter @ Adecco on assignment at Google Google August 2015  – Present (1 month) Sr. Associate University Recruiter Workday January 2014  –  July 2015  (1 year 7 months) Pleasanton, California University Relations Associate Sony Computer Entertainment America April 2013  –  January 2014  (10 months) Recruiting Coordinator Sony Computer Entertainment America LLC June 2012  –  July 2013  (1 year 2 months) Recruiter Aerotek June 2011  –  June 2012  (1 year 1 month) Operations/Account Management Lavante, Inc. December 2010  –  June 2011  (7 months) Server/Trainer Gordon Biersch Restaurant August 2006  –  June 2011  (4 years 11 months) San Jose New Grad Recruiter @ Adecco on assignment at Google Google August 2015  – Present (1 month) New Grad Recruiter @ Adecco on assignment at Google Google August 2015  – Present (1 month) Sr. Associate University Recruiter Workday January 2014  –  July 2015  (1 year 7 months) Pleasanton, California Sr. Associate University Recruiter Workday January 2014  –  July 2015  (1 year 7 months) Pleasanton, California University Relations Associate Sony Computer Entertainment America April 2013  –  January 2014  (10 months) University Relations Associate Sony Computer Entertainment America April 2013  –  January 2014  (10 months) Recruiting Coordinator Sony Computer Entertainment America LLC June 2012  –  July 2013  (1 year 2 months) Recruiting Coordinator Sony Computer Entertainment America LLC June 2012  –  July 2013  (1 year 2 months) Recruiter Aerotek June 2011  –  June 2012  (1 year 1 month) Recruiter Aerotek June 2011  –  June 2012  (1 year 1 month) Operations/Account Management Lavante, Inc. December 2010  –  June 2011  (7 months) Operations/Account Management Lavante, Inc. December 2010  –  June 2011  (7 months) Server/Trainer Gordon Biersch Restaurant August 2006  –  June 2011  (4 years 11 months) San Jose Server/Trainer Gordon Biersch Restaurant August 2006  –  June 2011  (4 years 11 months) San Jose Languages English Full professional proficiency Spanish Elementary proficiency Portuguese Elementary proficiency English Full professional proficiency Spanish Elementary proficiency Portuguese Elementary proficiency English Full professional proficiency Spanish Elementary proficiency Portuguese Elementary proficiency Full professional proficiency Elementary proficiency Elementary proficiency Skills Excel Word Outlook Social Networking Sourcing Scheduling Negotiation Customer Service Onboarding Recruiting Human Resources Applicant Tracking... Account Management Screening PowerPoint Screening Resumes Access Contract Recruitment Talent Acquisition Interviews College Recruiting Hiring Training Job Fairs Taleo Business Networking See 11+     See less Skills  Excel Word Outlook Social Networking Sourcing Scheduling Negotiation Customer Service Onboarding Recruiting Human Resources Applicant Tracking... Account Management Screening PowerPoint Screening Resumes Access Contract Recruitment Talent Acquisition Interviews College Recruiting Hiring Training Job Fairs Taleo Business Networking See 11+     See less Excel Word Outlook Social Networking Sourcing Scheduling Negotiation Customer Service Onboarding Recruiting Human Resources Applicant Tracking... Account Management Screening PowerPoint Screening Resumes Access Contract Recruitment Talent Acquisition Interviews College Recruiting Hiring Training Job Fairs Taleo Business Networking See 11+     See less Excel Word Outlook Social Networking Sourcing Scheduling Negotiation Customer Service Onboarding Recruiting Human Resources Applicant Tracking... Account Management Screening PowerPoint Screening Resumes Access Contract Recruitment Talent Acquisition Interviews College Recruiting Hiring Training Job Fairs Taleo Business Networking See 11+     See less Education San Francisco State University Bachelor of Science 2007  – 2010 San Francisco State University Bachelor of Science 2007  – 2010 San Francisco State University Bachelor of Science 2007  – 2010 San Francisco State University Bachelor of Science 2007  – 2010 ", "Skills Applicant Tracking... Benefits Negotiation Boolean Searching College Recruiting Contract Recruitment Employee Relations Executive Search Hiring Human Resources Internet Recruiting Interviews Management Onboarding Recruiting SaaS Salesforce.com Screening Screening Resumes Search Sourcing Staffing Services Talent Acquisition Talent Management Technical Recruiting Temporary Placement Vendor Management Taleo Staff Augmentation See 13+     See less Skills  Applicant Tracking... Benefits Negotiation Boolean Searching College Recruiting Contract Recruitment Employee Relations Executive Search Hiring Human Resources Internet Recruiting Interviews Management Onboarding Recruiting SaaS Salesforce.com Screening Screening Resumes Search Sourcing Staffing Services Talent Acquisition Talent Management Technical Recruiting Temporary Placement Vendor Management Taleo Staff Augmentation See 13+     See less Applicant Tracking... Benefits Negotiation Boolean Searching College Recruiting Contract Recruitment Employee Relations Executive Search Hiring Human Resources Internet Recruiting Interviews Management Onboarding Recruiting SaaS Salesforce.com Screening Screening Resumes Search Sourcing Staffing Services Talent Acquisition Talent Management Technical Recruiting Temporary Placement Vendor Management Taleo Staff Augmentation See 13+     See less Applicant Tracking... Benefits Negotiation Boolean Searching College Recruiting Contract Recruitment Employee Relations Executive Search Hiring Human Resources Internet Recruiting Interviews Management Onboarding Recruiting SaaS Salesforce.com Screening Screening Resumes Search Sourcing Staffing Services Talent Acquisition Talent Management Technical Recruiting Temporary Placement Vendor Management Taleo Staff Augmentation See 13+     See less ", "Summary • Accomplished, results-driven leader with 8+ years of extensive experience in brand marketing, managing client relationships to meet business objectives, and leading teams to successful project execution. \n• Collaborative manager inspiring teams to design solutions and exceed client expectations in the delivery of strategic programs and online experiences with measurable success. \n• Relationship-focused, quick learner experienced in navigating new industries and technologies to assess needs and obtain results from diverse stakeholders. \n• Experience in training and facilitation; developing proficiency, enhancing skills, knowledge and  \nperformance with individuals and teams. \n \nSpecialties: Account management, creative development, vendor management, branding & storytelling, digital marketing, client services Summary • Accomplished, results-driven leader with 8+ years of extensive experience in brand marketing, managing client relationships to meet business objectives, and leading teams to successful project execution. \n• Collaborative manager inspiring teams to design solutions and exceed client expectations in the delivery of strategic programs and online experiences with measurable success. \n• Relationship-focused, quick learner experienced in navigating new industries and technologies to assess needs and obtain results from diverse stakeholders. \n• Experience in training and facilitation; developing proficiency, enhancing skills, knowledge and  \nperformance with individuals and teams. \n \nSpecialties: Account management, creative development, vendor management, branding & storytelling, digital marketing, client services • Accomplished, results-driven leader with 8+ years of extensive experience in brand marketing, managing client relationships to meet business objectives, and leading teams to successful project execution. \n• Collaborative manager inspiring teams to design solutions and exceed client expectations in the delivery of strategic programs and online experiences with measurable success. \n• Relationship-focused, quick learner experienced in navigating new industries and technologies to assess needs and obtain results from diverse stakeholders. \n• Experience in training and facilitation; developing proficiency, enhancing skills, knowledge and  \nperformance with individuals and teams. \n \nSpecialties: Account management, creative development, vendor management, branding & storytelling, digital marketing, client services • Accomplished, results-driven leader with 8+ years of extensive experience in brand marketing, managing client relationships to meet business objectives, and leading teams to successful project execution. \n• Collaborative manager inspiring teams to design solutions and exceed client expectations in the delivery of strategic programs and online experiences with measurable success. \n• Relationship-focused, quick learner experienced in navigating new industries and technologies to assess needs and obtain results from diverse stakeholders. \n• Experience in training and facilitation; developing proficiency, enhancing skills, knowledge and  \nperformance with individuals and teams. \n \nSpecialties: Account management, creative development, vendor management, branding & storytelling, digital marketing, client services Experience Recruiter - Marketing at Google Google September 2013  – Present (2 years) Mountain View, CA Product Marketing Manager, Google.org Google October 2012  –  September 2013  (1 year) Mountain View, CA Product Marketing Manager focused on developing campaigns around Google's Energy & Sustainability initiatives. Account Solutions Manager Google August 2008  –  October 2012  (4 years 3 months) Greater New York City Area Assistant Manager, Digital Marketing Turner Broadcasting June 2007  –  August 2008  (1 year 3 months) Assistant Manager, Consumer Marketing Turner Broadcasting January 2007  –  June 2007  (6 months) Coordinator, TBS Branding Turner Broadcasting July 2005  –  December 2006  (1 year 6 months) Recruiter - Marketing at Google Google September 2013  – Present (2 years) Mountain View, CA Recruiter - Marketing at Google Google September 2013  – Present (2 years) Mountain View, CA Product Marketing Manager, Google.org Google October 2012  –  September 2013  (1 year) Mountain View, CA Product Marketing Manager focused on developing campaigns around Google's Energy & Sustainability initiatives. Product Marketing Manager, Google.org Google October 2012  –  September 2013  (1 year) Mountain View, CA Product Marketing Manager focused on developing campaigns around Google's Energy & Sustainability initiatives. Account Solutions Manager Google August 2008  –  October 2012  (4 years 3 months) Greater New York City Area Account Solutions Manager Google August 2008  –  October 2012  (4 years 3 months) Greater New York City Area Assistant Manager, Digital Marketing Turner Broadcasting June 2007  –  August 2008  (1 year 3 months) Assistant Manager, Digital Marketing Turner Broadcasting June 2007  –  August 2008  (1 year 3 months) Assistant Manager, Consumer Marketing Turner Broadcasting January 2007  –  June 2007  (6 months) Assistant Manager, Consumer Marketing Turner Broadcasting January 2007  –  June 2007  (6 months) Coordinator, TBS Branding Turner Broadcasting July 2005  –  December 2006  (1 year 6 months) Coordinator, TBS Branding Turner Broadcasting July 2005  –  December 2006  (1 year 6 months) Skills Digital Marketing Creative Direction Account Management Digital Media Digital Strategy Media Planning Advertising Integrated Marketing Social Media Marketing Online Advertising Social Media New Media Mobile Marketing Content Strategy Facebook SEM See 1+     See less Skills  Digital Marketing Creative Direction Account Management Digital Media Digital Strategy Media Planning Advertising Integrated Marketing Social Media Marketing Online Advertising Social Media New Media Mobile Marketing Content Strategy Facebook SEM See 1+     See less Digital Marketing Creative Direction Account Management Digital Media Digital Strategy Media Planning Advertising Integrated Marketing Social Media Marketing Online Advertising Social Media New Media Mobile Marketing Content Strategy Facebook SEM See 1+     See less Digital Marketing Creative Direction Account Management Digital Media Digital Strategy Media Planning Advertising Integrated Marketing Social Media Marketing Online Advertising Social Media New Media Mobile Marketing Content Strategy Facebook SEM See 1+     See less Education University of North Carolina at Chapel Hill BA, Journalism & Mass Communication,  Advertising 2002  – 2005 Georgia Institute of Technology 2001  – 2002 University of North Carolina at Chapel Hill BA, Journalism & Mass Communication,  Advertising 2002  – 2005 University of North Carolina at Chapel Hill BA, Journalism & Mass Communication,  Advertising 2002  – 2005 University of North Carolina at Chapel Hill BA, Journalism & Mass Communication,  Advertising 2002  – 2005 Georgia Institute of Technology 2001  – 2002 Georgia Institute of Technology 2001  – 2002 Georgia Institute of Technology 2001  – 2002 "]}