{"position": "Mechanical Engineering Intern - Monthly", "company": "Google", "profiles": ["Experience Engineering Intern BMW Group March 2015  – Present (6 months) Mountain View Engineering intern in the AppCenter team, responsible for smartphone integrations on the BMW Connected platform. Mechanical Engineering Intern Applied Materials June 2014  –  September 2014  (4 months) Santa Clara, CA Mechanical engineer in the atmospheric platforms group, responsible for the development and testing of wafer handling assemblies. Designed sheet metal parts in UGNX. Performed force testing on next-generation swirl gripper blades. Collected and analyzed nitrogen purging data. Characterized wafer vibration and tilt using accelerometers. Systems Engineering Intern Hospira June 2013  –  August 2013  (3 months) San Jose, CA Completed root cause analysis for electromechanical medical infusion pumps. Lab duties included high-speed video camera tests, tolerance tests, force and torque gauge tests, and mechanical inspection. Wrote MATLAB scripts for generating motor torque profiles and calculating tolerance stacks. Engineering Intern Gudeng Precision Industrial Co. June 2012  –  September 2012  (4 months) Taipei, Taiwan Performance testing of next-generation 450mm front-opening unified pods (FOUP). Collaborated with students from National Taiwan University. Visited manufacturing sites in Shulin and Tainan to oversee injection molding process. Business travel to Shanghai with CEO for new site launch. Evaluated Silicon Valley expansion opportunities for the company. Undergraduate Researcher SLAC National Accelerator Laboratory June 2011  –  August 2011  (3 months) Menlo Park, CA Measured the performance of Cherenkov-based energy spectrometers for the plasma wakefield acceleration group. Wrote MATLAB scripts for simulating electron beamline trajectory profiles. Engineering Intern QuesTek Innovations LLC June 2009  –  September 2009  (4 months) Evanston, IL Characterized material microstructures using serial sectioning methods. Lab duties included hot mounting, grinding, polishing, and etching material samples, and analysis using optical microscopy. Created 3D tomographic reconstructions using IDL. Performed hardness and ductility tests. Used local electrode atom probe (LEAP) at Northwestern University for analysis of material nanostructure. Engineering Intern BMW Group March 2015  – Present (6 months) Mountain View Engineering intern in the AppCenter team, responsible for smartphone integrations on the BMW Connected platform. Engineering Intern BMW Group March 2015  – Present (6 months) Mountain View Engineering intern in the AppCenter team, responsible for smartphone integrations on the BMW Connected platform. Mechanical Engineering Intern Applied Materials June 2014  –  September 2014  (4 months) Santa Clara, CA Mechanical engineer in the atmospheric platforms group, responsible for the development and testing of wafer handling assemblies. Designed sheet metal parts in UGNX. Performed force testing on next-generation swirl gripper blades. Collected and analyzed nitrogen purging data. Characterized wafer vibration and tilt using accelerometers. Mechanical Engineering Intern Applied Materials June 2014  –  September 2014  (4 months) Santa Clara, CA Mechanical engineer in the atmospheric platforms group, responsible for the development and testing of wafer handling assemblies. Designed sheet metal parts in UGNX. Performed force testing on next-generation swirl gripper blades. Collected and analyzed nitrogen purging data. Characterized wafer vibration and tilt using accelerometers. Systems Engineering Intern Hospira June 2013  –  August 2013  (3 months) San Jose, CA Completed root cause analysis for electromechanical medical infusion pumps. Lab duties included high-speed video camera tests, tolerance tests, force and torque gauge tests, and mechanical inspection. Wrote MATLAB scripts for generating motor torque profiles and calculating tolerance stacks. Systems Engineering Intern Hospira June 2013  –  August 2013  (3 months) San Jose, CA Completed root cause analysis for electromechanical medical infusion pumps. Lab duties included high-speed video camera tests, tolerance tests, force and torque gauge tests, and mechanical inspection. Wrote MATLAB scripts for generating motor torque profiles and calculating tolerance stacks. Engineering Intern Gudeng Precision Industrial Co. June 2012  –  September 2012  (4 months) Taipei, Taiwan Performance testing of next-generation 450mm front-opening unified pods (FOUP). Collaborated with students from National Taiwan University. Visited manufacturing sites in Shulin and Tainan to oversee injection molding process. Business travel to Shanghai with CEO for new site launch. Evaluated Silicon Valley expansion opportunities for the company. Engineering Intern Gudeng Precision Industrial Co. June 2012  –  September 2012  (4 months) Taipei, Taiwan Performance testing of next-generation 450mm front-opening unified pods (FOUP). Collaborated with students from National Taiwan University. Visited manufacturing sites in Shulin and Tainan to oversee injection molding process. Business travel to Shanghai with CEO for new site launch. Evaluated Silicon Valley expansion opportunities for the company. Undergraduate Researcher SLAC National Accelerator Laboratory June 2011  –  August 2011  (3 months) Menlo Park, CA Measured the performance of Cherenkov-based energy spectrometers for the plasma wakefield acceleration group. Wrote MATLAB scripts for simulating electron beamline trajectory profiles. Undergraduate Researcher SLAC National Accelerator Laboratory June 2011  –  August 2011  (3 months) Menlo Park, CA Measured the performance of Cherenkov-based energy spectrometers for the plasma wakefield acceleration group. Wrote MATLAB scripts for simulating electron beamline trajectory profiles. Engineering Intern QuesTek Innovations LLC June 2009  –  September 2009  (4 months) Evanston, IL Characterized material microstructures using serial sectioning methods. Lab duties included hot mounting, grinding, polishing, and etching material samples, and analysis using optical microscopy. Created 3D tomographic reconstructions using IDL. Performed hardness and ductility tests. Used local electrode atom probe (LEAP) at Northwestern University for analysis of material nanostructure. Engineering Intern QuesTek Innovations LLC June 2009  –  September 2009  (4 months) Evanston, IL Characterized material microstructures using serial sectioning methods. Lab duties included hot mounting, grinding, polishing, and etching material samples, and analysis using optical microscopy. Created 3D tomographic reconstructions using IDL. Performed hardness and ductility tests. Used local electrode atom probe (LEAP) at Northwestern University for analysis of material nanostructure. Skills Matlab Solidworks Fluid Mechanics Thermodynamics Experimentation Physics C++ C Milling Arduino Testing Skills  Matlab Solidworks Fluid Mechanics Thermodynamics Experimentation Physics C++ C Milling Arduino Testing Matlab Solidworks Fluid Mechanics Thermodynamics Experimentation Physics C++ C Milling Arduino Testing Matlab Solidworks Fluid Mechanics Thermodynamics Experimentation Physics C++ C Milling Arduino Testing Education Stanford University M.S.,  Mechanical Engineering 2013  – 2015 Stanford University B.S.,  Mechanical Engineering 2009  – 2013 Glenbrook North High School High School Diploma 2005  – 2009 Stanford University M.S.,  Mechanical Engineering 2013  – 2015 Stanford University M.S.,  Mechanical Engineering 2013  – 2015 Stanford University M.S.,  Mechanical Engineering 2013  – 2015 Stanford University B.S.,  Mechanical Engineering 2009  – 2013 Stanford University B.S.,  Mechanical Engineering 2009  – 2013 Stanford University B.S.,  Mechanical Engineering 2009  – 2013 Glenbrook North High School High School Diploma 2005  – 2009 Glenbrook North High School High School Diploma 2005  – 2009 Glenbrook North High School High School Diploma 2005  – 2009 ", "Experience Structural Engineering Intern KNA Consulting Engineers June 2015  – Present (3 months) Irvine, CA Alumni Relations Cal Poly American Society of Civil Engineer's (ASCE) June 2015  – Present (3 months) Coordinate and maintain the Cal Poly Civil Engineering Alumni in tune with what the ASCE student chapter is presently involved in. Civil/Structural Engineering Student Cal Poly State University September 2011  – Present (4 years) San Luis Obispo, California Area Grade 8 Competitive Soccer Referee USSF January 2007  – Present (8 years 8 months) San Diego, CA Learned to keep calm when in high stress situations and resolve issues appropriately and accordingly. I referee soccer nearly every weekend over summers. President Cal Poly American Society of Civil Engineer's (ASCE) May 2014  –  June 2015  (1 year 2 months) I maintained the quality of the Cal Poly ASCE Student Chapter of roughly 275 members and 17 officers. My roles as President were to: Oversee and manage all chapter events and activities, officers (17), and members (275+). Act as the liaison between the student chapter, local YMF, and local Professional ASCE Branch. Lastly, I was fortunate to have gotten to attend ASCE’s Global Conference in Panama City, Panama in which I was able to communicate with professional engineer’s from around the world. Land Development Engineering Intern RBF Consulting, a Company of Michael Baker International June 2014  –  December 2014  (7 months) Carlsbad, CA Worked on 10 design projects between land development, transportation, and water/wastewater. Efficient in modeling streetscape alternatives, created cost estimates, crosswalks and ADA pedestrian ramp feasibility analyses. Tested sight and speed distance surveys in the field. Treasurer Cal Poly American Society of Civil Engineer's (ASCE) June 2013  –  May 2014  (1 year) San Luis Obispo, California Area I manage our chapter's budget, student reimbursements, tax information, club donations, and all club transactions. Construction Engineering Intern Flatiron Construction June 2013  –  September 2013  (4 months) Greater San Diego Area I worked in the field office of a $22 million Caltrans Bridge Rehab / Interchange Project at I-15/Hwy 76. I managed concrete pours, laid out approach slabs and joint seal assemblies, ran quantity take offs, and led weekly safety meetings. Additionally, I assisted the Project Manager with budget monitoring and reviewed project invoices. I learned how to correspond with the owner through meetings, letters, submittals, and RFI’s, and effective communication with laborers, subcontractors, suppliers, and colleagues. Social Director Cal Poly American Society of Civil Engineer's (ASCE) April 2012  –  June 2013  (1 year 3 months) San Luis Obispo, California Area I organize and plan the entirety of the 1st general meeting (BBQ) and the last general meeting (Off Campus Banquet). I must budget accordingly for the entire year and determine the proper quantities of food and drink for each of the ASCE officer's events. Engineering Intern Rainbow Municipal Water District June 2012  –  January 2013  (8 months) I was fortunate to experience both the office and field aspects of Water/Wastewater Engineering. I plan checked large developments and pipeline layouts against District specifications, utilized AutoCAD to generate Reservoir Drawings and a Hydraulic Schematic for field use. Furthermore, I collected and tested water samples, tested CADwelds, and ran flow monitoring calculations. Engineering Intern CarrierComm June 2011  –  September 2011  (4 months) Encinitas, CA I worked in a team of five to identify chip failure points when run through bug and temperature tests. I reorganized the inventory system to prevent material shortages while minimizing on-hand inventory, assisted in the programming of Software Defined IDUs, and reviewed parts lists and drawings for accuracy. Cashier/Shift Manager Yogurt Self Serve Shack March 2011  –  September 2011  (7 months) I practiced effective time management skills. I set priorities while working during crowded hours and improved my communication skills by talking to a wide variety of people. Structural Engineering Intern KNA Consulting Engineers June 2015  – Present (3 months) Irvine, CA Structural Engineering Intern KNA Consulting Engineers June 2015  – Present (3 months) Irvine, CA Alumni Relations Cal Poly American Society of Civil Engineer's (ASCE) June 2015  – Present (3 months) Coordinate and maintain the Cal Poly Civil Engineering Alumni in tune with what the ASCE student chapter is presently involved in. Alumni Relations Cal Poly American Society of Civil Engineer's (ASCE) June 2015  – Present (3 months) Coordinate and maintain the Cal Poly Civil Engineering Alumni in tune with what the ASCE student chapter is presently involved in. Civil/Structural Engineering Student Cal Poly State University September 2011  – Present (4 years) San Luis Obispo, California Area Civil/Structural Engineering Student Cal Poly State University September 2011  – Present (4 years) San Luis Obispo, California Area Grade 8 Competitive Soccer Referee USSF January 2007  – Present (8 years 8 months) San Diego, CA Learned to keep calm when in high stress situations and resolve issues appropriately and accordingly. I referee soccer nearly every weekend over summers. Grade 8 Competitive Soccer Referee USSF January 2007  – Present (8 years 8 months) San Diego, CA Learned to keep calm when in high stress situations and resolve issues appropriately and accordingly. I referee soccer nearly every weekend over summers. President Cal Poly American Society of Civil Engineer's (ASCE) May 2014  –  June 2015  (1 year 2 months) I maintained the quality of the Cal Poly ASCE Student Chapter of roughly 275 members and 17 officers. My roles as President were to: Oversee and manage all chapter events and activities, officers (17), and members (275+). Act as the liaison between the student chapter, local YMF, and local Professional ASCE Branch. Lastly, I was fortunate to have gotten to attend ASCE’s Global Conference in Panama City, Panama in which I was able to communicate with professional engineer’s from around the world. President Cal Poly American Society of Civil Engineer's (ASCE) May 2014  –  June 2015  (1 year 2 months) I maintained the quality of the Cal Poly ASCE Student Chapter of roughly 275 members and 17 officers. My roles as President were to: Oversee and manage all chapter events and activities, officers (17), and members (275+). Act as the liaison between the student chapter, local YMF, and local Professional ASCE Branch. Lastly, I was fortunate to have gotten to attend ASCE’s Global Conference in Panama City, Panama in which I was able to communicate with professional engineer’s from around the world. Land Development Engineering Intern RBF Consulting, a Company of Michael Baker International June 2014  –  December 2014  (7 months) Carlsbad, CA Worked on 10 design projects between land development, transportation, and water/wastewater. Efficient in modeling streetscape alternatives, created cost estimates, crosswalks and ADA pedestrian ramp feasibility analyses. Tested sight and speed distance surveys in the field. Land Development Engineering Intern RBF Consulting, a Company of Michael Baker International June 2014  –  December 2014  (7 months) Carlsbad, CA Worked on 10 design projects between land development, transportation, and water/wastewater. Efficient in modeling streetscape alternatives, created cost estimates, crosswalks and ADA pedestrian ramp feasibility analyses. Tested sight and speed distance surveys in the field. Treasurer Cal Poly American Society of Civil Engineer's (ASCE) June 2013  –  May 2014  (1 year) San Luis Obispo, California Area I manage our chapter's budget, student reimbursements, tax information, club donations, and all club transactions. Treasurer Cal Poly American Society of Civil Engineer's (ASCE) June 2013  –  May 2014  (1 year) San Luis Obispo, California Area I manage our chapter's budget, student reimbursements, tax information, club donations, and all club transactions. Construction Engineering Intern Flatiron Construction June 2013  –  September 2013  (4 months) Greater San Diego Area I worked in the field office of a $22 million Caltrans Bridge Rehab / Interchange Project at I-15/Hwy 76. I managed concrete pours, laid out approach slabs and joint seal assemblies, ran quantity take offs, and led weekly safety meetings. Additionally, I assisted the Project Manager with budget monitoring and reviewed project invoices. I learned how to correspond with the owner through meetings, letters, submittals, and RFI’s, and effective communication with laborers, subcontractors, suppliers, and colleagues. Construction Engineering Intern Flatiron Construction June 2013  –  September 2013  (4 months) Greater San Diego Area I worked in the field office of a $22 million Caltrans Bridge Rehab / Interchange Project at I-15/Hwy 76. I managed concrete pours, laid out approach slabs and joint seal assemblies, ran quantity take offs, and led weekly safety meetings. Additionally, I assisted the Project Manager with budget monitoring and reviewed project invoices. I learned how to correspond with the owner through meetings, letters, submittals, and RFI’s, and effective communication with laborers, subcontractors, suppliers, and colleagues. Social Director Cal Poly American Society of Civil Engineer's (ASCE) April 2012  –  June 2013  (1 year 3 months) San Luis Obispo, California Area I organize and plan the entirety of the 1st general meeting (BBQ) and the last general meeting (Off Campus Banquet). I must budget accordingly for the entire year and determine the proper quantities of food and drink for each of the ASCE officer's events. Social Director Cal Poly American Society of Civil Engineer's (ASCE) April 2012  –  June 2013  (1 year 3 months) San Luis Obispo, California Area I organize and plan the entirety of the 1st general meeting (BBQ) and the last general meeting (Off Campus Banquet). I must budget accordingly for the entire year and determine the proper quantities of food and drink for each of the ASCE officer's events. Engineering Intern Rainbow Municipal Water District June 2012  –  January 2013  (8 months) I was fortunate to experience both the office and field aspects of Water/Wastewater Engineering. I plan checked large developments and pipeline layouts against District specifications, utilized AutoCAD to generate Reservoir Drawings and a Hydraulic Schematic for field use. Furthermore, I collected and tested water samples, tested CADwelds, and ran flow monitoring calculations. Engineering Intern Rainbow Municipal Water District June 2012  –  January 2013  (8 months) I was fortunate to experience both the office and field aspects of Water/Wastewater Engineering. I plan checked large developments and pipeline layouts against District specifications, utilized AutoCAD to generate Reservoir Drawings and a Hydraulic Schematic for field use. Furthermore, I collected and tested water samples, tested CADwelds, and ran flow monitoring calculations. Engineering Intern CarrierComm June 2011  –  September 2011  (4 months) Encinitas, CA I worked in a team of five to identify chip failure points when run through bug and temperature tests. I reorganized the inventory system to prevent material shortages while minimizing on-hand inventory, assisted in the programming of Software Defined IDUs, and reviewed parts lists and drawings for accuracy. Engineering Intern CarrierComm June 2011  –  September 2011  (4 months) Encinitas, CA I worked in a team of five to identify chip failure points when run through bug and temperature tests. I reorganized the inventory system to prevent material shortages while minimizing on-hand inventory, assisted in the programming of Software Defined IDUs, and reviewed parts lists and drawings for accuracy. Cashier/Shift Manager Yogurt Self Serve Shack March 2011  –  September 2011  (7 months) I practiced effective time management skills. I set priorities while working during crowded hours and improved my communication skills by talking to a wide variety of people. Cashier/Shift Manager Yogurt Self Serve Shack March 2011  –  September 2011  (7 months) I practiced effective time management skills. I set priorities while working during crowded hours and improved my communication skills by talking to a wide variety of people. Languages Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Microsoft Excel PowerPoint Microsoft Word Customer Service Research HTML Public Speaking Teamwork Windows English AutoCAD Technical Writing Budgets Engineering Management Skills  Microsoft Excel PowerPoint Microsoft Word Customer Service Research HTML Public Speaking Teamwork Windows English AutoCAD Technical Writing Budgets Engineering Management Microsoft Excel PowerPoint Microsoft Word Customer Service Research HTML Public Speaking Teamwork Windows English AutoCAD Technical Writing Budgets Engineering Management Microsoft Excel PowerPoint Microsoft Word Customer Service Research HTML Public Speaking Teamwork Windows English AutoCAD Technical Writing Budgets Engineering Management Education California Polytechnic State University-San Luis Obispo Master’s Degree,  Structural Engineering 2015  – 2016 California Polytechnic State University-San Luis Obispo Bachelor’s Degree,  Civil Engineering 2011  – 2015 California Polytechnic State University-San Luis Obispo Master’s Degree,  Structural Engineering 2015  – 2016 California Polytechnic State University-San Luis Obispo Master’s Degree,  Structural Engineering 2015  – 2016 California Polytechnic State University-San Luis Obispo Master’s Degree,  Structural Engineering 2015  – 2016 California Polytechnic State University-San Luis Obispo Bachelor’s Degree,  Civil Engineering 2011  – 2015 California Polytechnic State University-San Luis Obispo Bachelor’s Degree,  Civil Engineering 2011  – 2015 California Polytechnic State University-San Luis Obispo Bachelor’s Degree,  Civil Engineering 2011  – 2015 Honors & Awards ", "Summary I am interested in medical devices and technology, brain-controlled devices, and biomedical engineering. I have a strong background in biotechnology, engineering, programming and design. I am passionate about medical technology and biomedical research and my goal is to better integrate computer science and engineering into all aspects of healthcare. Summary I am interested in medical devices and technology, brain-controlled devices, and biomedical engineering. I have a strong background in biotechnology, engineering, programming and design. I am passionate about medical technology and biomedical research and my goal is to better integrate computer science and engineering into all aspects of healthcare. I am interested in medical devices and technology, brain-controlled devices, and biomedical engineering. I have a strong background in biotechnology, engineering, programming and design. I am passionate about medical technology and biomedical research and my goal is to better integrate computer science and engineering into all aspects of healthcare. I am interested in medical devices and technology, brain-controlled devices, and biomedical engineering. I have a strong background in biotechnology, engineering, programming and design. I am passionate about medical technology and biomedical research and my goal is to better integrate computer science and engineering into all aspects of healthcare. Experience Software Engineering Intern, XBOX R&D Microsoft June 2015  – Present (3 months) Redmond, WA Developed specification/architecture for a new feature to customize the experience on the XBOX console and mobile app.  \n \nI am currently working to architect and program this feature. Teaching Assistant (TA) - Anatomy for Bioengineers (BIOE 51) Stanford University March 2015  –  June 2015  (4 months) Stanford University School of Medicine Engineering Intern Care Innovations™, an Intel-GE Company July 2014  –  December 2014  (6 months) Roseville, CA Software Engineering Intern Intel Corporation July 2013  –  September 2013  (3 months) Folsom, CA Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Folsom, CA Engineering Intern Kelly Services (for Intel Corporation) May 2011  –  September 2011  (5 months) Folsom, CA Engineering Intern Kelly Services (for Intel Corporation) June 2010  –  August 2010  (3 months) Folsom, CA Software Engineering Intern, XBOX R&D Microsoft June 2015  – Present (3 months) Redmond, WA Developed specification/architecture for a new feature to customize the experience on the XBOX console and mobile app.  \n \nI am currently working to architect and program this feature. Software Engineering Intern, XBOX R&D Microsoft June 2015  – Present (3 months) Redmond, WA Developed specification/architecture for a new feature to customize the experience on the XBOX console and mobile app.  \n \nI am currently working to architect and program this feature. Teaching Assistant (TA) - Anatomy for Bioengineers (BIOE 51) Stanford University March 2015  –  June 2015  (4 months) Stanford University School of Medicine Teaching Assistant (TA) - Anatomy for Bioengineers (BIOE 51) Stanford University March 2015  –  June 2015  (4 months) Stanford University School of Medicine Engineering Intern Care Innovations™, an Intel-GE Company July 2014  –  December 2014  (6 months) Roseville, CA Engineering Intern Care Innovations™, an Intel-GE Company July 2014  –  December 2014  (6 months) Roseville, CA Software Engineering Intern Intel Corporation July 2013  –  September 2013  (3 months) Folsom, CA Software Engineering Intern Intel Corporation July 2013  –  September 2013  (3 months) Folsom, CA Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Folsom, CA Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Folsom, CA Engineering Intern Kelly Services (for Intel Corporation) May 2011  –  September 2011  (5 months) Folsom, CA Engineering Intern Kelly Services (for Intel Corporation) May 2011  –  September 2011  (5 months) Folsom, CA Engineering Intern Kelly Services (for Intel Corporation) June 2010  –  August 2010  (3 months) Folsom, CA Engineering Intern Kelly Services (for Intel Corporation) June 2010  –  August 2010  (3 months) Folsom, CA Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Python Software Engineering Matlab C++ C Research Molecular Biology Human Anatomy Brain-computer... Arduino Microsoft Visual Studio... Java Computational Biology Laboratory Skills JavaScript Bioinformatics Solidworks Test Automation Product Marketing Teaching Performance Benchmarking Technical Presentations Marketing Communications See 8+     See less Skills  Python Software Engineering Matlab C++ C Research Molecular Biology Human Anatomy Brain-computer... Arduino Microsoft Visual Studio... Java Computational Biology Laboratory Skills JavaScript Bioinformatics Solidworks Test Automation Product Marketing Teaching Performance Benchmarking Technical Presentations Marketing Communications See 8+     See less Python Software Engineering Matlab C++ C Research Molecular Biology Human Anatomy Brain-computer... Arduino Microsoft Visual Studio... Java Computational Biology Laboratory Skills JavaScript Bioinformatics Solidworks Test Automation Product Marketing Teaching Performance Benchmarking Technical Presentations Marketing Communications See 8+     See less Python Software Engineering Matlab C++ C Research Molecular Biology Human Anatomy Brain-computer... Arduino Microsoft Visual Studio... Java Computational Biology Laboratory Skills JavaScript Bioinformatics Solidworks Test Automation Product Marketing Teaching Performance Benchmarking Technical Presentations Marketing Communications See 8+     See less Education Stanford University Master of Science (M.S.),  Computer Science 2015  – 2016 Specializing in artificial intelligence, human-computer interaction and design Stanford University Bachelor of Science (BS),  Bioengineering 2011  – 2015 Activities and Societies:  Brain-controlled devices research ,  Stanford Splash - Website and Technology Chair & Instructor ,  Junior Class Cabinet ,  Stanford Biomedical Engineering Society ,  Society for Biological Engineering ,  AIChE Folsom High School High School 2007  – 2011 Intel International Science and Engineering Fair Finalist (2010): Co-developed prototype algae-based biofuel. Won 1st place at the Sacramento Region Science Fair, the California EPA Air Resources Board award, Sacramento Green Chemistry award, and a special award from the US Army.  \n \nNational AP Scholar, 2011. Academic Decathlon Super Decathlete, 2009. \n \nWon several awards at Sacramento County History Day and advanced to the California State competition during each year of high school. \n \nPlayed trumpet in marching band. Activities and Societies:  National Science Bowl team captain ,  California Scholarship Federation Life Member ,  World Language Scholars Society ,  Science Club officer ,  History Club officer ,  Marching Band Stanford University Master of Science (M.S.),  Computer Science 2015  – 2016 Specializing in artificial intelligence, human-computer interaction and design Stanford University Master of Science (M.S.),  Computer Science 2015  – 2016 Specializing in artificial intelligence, human-computer interaction and design Stanford University Master of Science (M.S.),  Computer Science 2015  – 2016 Specializing in artificial intelligence, human-computer interaction and design Stanford University Bachelor of Science (BS),  Bioengineering 2011  – 2015 Activities and Societies:  Brain-controlled devices research ,  Stanford Splash - Website and Technology Chair & Instructor ,  Junior Class Cabinet ,  Stanford Biomedical Engineering Society ,  Society for Biological Engineering ,  AIChE Stanford University Bachelor of Science (BS),  Bioengineering 2011  – 2015 Activities and Societies:  Brain-controlled devices research ,  Stanford Splash - Website and Technology Chair & Instructor ,  Junior Class Cabinet ,  Stanford Biomedical Engineering Society ,  Society for Biological Engineering ,  AIChE Stanford University Bachelor of Science (BS),  Bioengineering 2011  – 2015 Activities and Societies:  Brain-controlled devices research ,  Stanford Splash - Website and Technology Chair & Instructor ,  Junior Class Cabinet ,  Stanford Biomedical Engineering Society ,  Society for Biological Engineering ,  AIChE Folsom High School High School 2007  – 2011 Intel International Science and Engineering Fair Finalist (2010): Co-developed prototype algae-based biofuel. Won 1st place at the Sacramento Region Science Fair, the California EPA Air Resources Board award, Sacramento Green Chemistry award, and a special award from the US Army.  \n \nNational AP Scholar, 2011. Academic Decathlon Super Decathlete, 2009. \n \nWon several awards at Sacramento County History Day and advanced to the California State competition during each year of high school. \n \nPlayed trumpet in marching band. Activities and Societies:  National Science Bowl team captain ,  California Scholarship Federation Life Member ,  World Language Scholars Society ,  Science Club officer ,  History Club officer ,  Marching Band Folsom High School High School 2007  – 2011 Intel International Science and Engineering Fair Finalist (2010): Co-developed prototype algae-based biofuel. Won 1st place at the Sacramento Region Science Fair, the California EPA Air Resources Board award, Sacramento Green Chemistry award, and a special award from the US Army.  \n \nNational AP Scholar, 2011. Academic Decathlon Super Decathlete, 2009. \n \nWon several awards at Sacramento County History Day and advanced to the California State competition during each year of high school. \n \nPlayed trumpet in marching band. Activities and Societies:  National Science Bowl team captain ,  California Scholarship Federation Life Member ,  World Language Scholars Society ,  Science Club officer ,  History Club officer ,  Marching Band Folsom High School High School 2007  – 2011 Intel International Science and Engineering Fair Finalist (2010): Co-developed prototype algae-based biofuel. Won 1st place at the Sacramento Region Science Fair, the California EPA Air Resources Board award, Sacramento Green Chemistry award, and a special award from the US Army.  \n \nNational AP Scholar, 2011. Academic Decathlon Super Decathlete, 2009. \n \nWon several awards at Sacramento County History Day and advanced to the California State competition during each year of high school. \n \nPlayed trumpet in marching band. Activities and Societies:  National Science Bowl team captain ,  California Scholarship Federation Life Member ,  World Language Scholars Society ,  Science Club officer ,  History Club officer ,  Marching Band Honors & Awards ", "Experience Quality Engineering Intern Bell Helicopter May 2015  – Present (4 months) Fort Worth, Texas Engineering Intern The City of Columbia September 2014  – Present (1 year) Columbia, Missouri Area • Assist with the implementation of the GetAbout Columbia initiative; improving city infrastructure to better accommodate commuting via cycling. Mechanic CycleX March 2014  –  May 2015  (1 year 3 months) Columbia, Missouri Area Quality Engineering Intern Bell Helicopter May 2014  –  August 2014  (4 months) Fort Worth, Texas •\tWorked with the inspection reduction team in order to eliminate and restructure quality inspections at the Drive Systems Center. \n•\tFormulated business cases to present to management in order to receive approval to remove non value added inspections. \n•\tSupported quality by creating Root Cause/Corrective Action reports. Assembly Engineering Intern Volkswagen of America, Inc August 2013  –  December 2013  (5 months) Chattanooga, Tennessee Area •\tAssisted both the quality and production teams through the use of lean manufacturing initiatives at the Chattanooga, Tennessee manufacturing facility. \n•\tUsed root cause analysis to identify, diagnose, and solve quality related production issues.  \n•\tConducted quality checks on the line to make sure vehicle parts are in spec. \n•\tBuilt and generated production and quality reports in order to help support manufacturing with production issues. Manufacturing Engineering Intern Schneider Electric August 2012  –  August 2013  (1 year 1 month) Columbia, Missouri Area •\tUsed lean manufacturing, six sigma and 5S initiatives to solve problems on product manufacturing lines. \n•\tConducted manufacturing time studies in order to establish value added/non-value added processes as well as developed possible solutions to streamline manufacturing processes. \n•\tUsed SAP to create/modify BOMs as well as routings. Mechanic/Sales Associate Tryathletics May 2012  –  August 2013  (1 year 4 months) Columbia, Missouri Area •\tAssembled bicycles and used problem solving strategies to diagnose and solve issues with customers’ bikes.  \n•\tAssisted and educated customers on various running, swimming and cycling products. Intern Foliotek September 2011  –  August 2012  (1 year) Columbia, Missouri Area •\tManaged support and assist clients and customers with the Foliotek e-portfolio system. \n•\tDesigned and coded Rosewater e-forms. \n•\tTested and debugged new features for the e-portfolio system. \n•\tUncovered, tested, and submited defects on the system to development team. Product Development ShowMeCables August 2008  –  January 2012  (3 years 6 months) Chesterfield, MO •\tOverhauled and edited existing products as well as creating new ones on our e-commerce website. \n•\tEdited and published product photos through the use of Photoshop, Lightroom and GIMP. \n•\tWorked in a team to collaborate effective mediums of marketing and product exposure. Quality Engineering Intern Bell Helicopter May 2015  – Present (4 months) Fort Worth, Texas Quality Engineering Intern Bell Helicopter May 2015  – Present (4 months) Fort Worth, Texas Engineering Intern The City of Columbia September 2014  – Present (1 year) Columbia, Missouri Area • Assist with the implementation of the GetAbout Columbia initiative; improving city infrastructure to better accommodate commuting via cycling. Engineering Intern The City of Columbia September 2014  – Present (1 year) Columbia, Missouri Area • Assist with the implementation of the GetAbout Columbia initiative; improving city infrastructure to better accommodate commuting via cycling. Mechanic CycleX March 2014  –  May 2015  (1 year 3 months) Columbia, Missouri Area Mechanic CycleX March 2014  –  May 2015  (1 year 3 months) Columbia, Missouri Area Quality Engineering Intern Bell Helicopter May 2014  –  August 2014  (4 months) Fort Worth, Texas •\tWorked with the inspection reduction team in order to eliminate and restructure quality inspections at the Drive Systems Center. \n•\tFormulated business cases to present to management in order to receive approval to remove non value added inspections. \n•\tSupported quality by creating Root Cause/Corrective Action reports. Quality Engineering Intern Bell Helicopter May 2014  –  August 2014  (4 months) Fort Worth, Texas •\tWorked with the inspection reduction team in order to eliminate and restructure quality inspections at the Drive Systems Center. \n•\tFormulated business cases to present to management in order to receive approval to remove non value added inspections. \n•\tSupported quality by creating Root Cause/Corrective Action reports. Assembly Engineering Intern Volkswagen of America, Inc August 2013  –  December 2013  (5 months) Chattanooga, Tennessee Area •\tAssisted both the quality and production teams through the use of lean manufacturing initiatives at the Chattanooga, Tennessee manufacturing facility. \n•\tUsed root cause analysis to identify, diagnose, and solve quality related production issues.  \n•\tConducted quality checks on the line to make sure vehicle parts are in spec. \n•\tBuilt and generated production and quality reports in order to help support manufacturing with production issues. Assembly Engineering Intern Volkswagen of America, Inc August 2013  –  December 2013  (5 months) Chattanooga, Tennessee Area •\tAssisted both the quality and production teams through the use of lean manufacturing initiatives at the Chattanooga, Tennessee manufacturing facility. \n•\tUsed root cause analysis to identify, diagnose, and solve quality related production issues.  \n•\tConducted quality checks on the line to make sure vehicle parts are in spec. \n•\tBuilt and generated production and quality reports in order to help support manufacturing with production issues. Manufacturing Engineering Intern Schneider Electric August 2012  –  August 2013  (1 year 1 month) Columbia, Missouri Area •\tUsed lean manufacturing, six sigma and 5S initiatives to solve problems on product manufacturing lines. \n•\tConducted manufacturing time studies in order to establish value added/non-value added processes as well as developed possible solutions to streamline manufacturing processes. \n•\tUsed SAP to create/modify BOMs as well as routings. Manufacturing Engineering Intern Schneider Electric August 2012  –  August 2013  (1 year 1 month) Columbia, Missouri Area •\tUsed lean manufacturing, six sigma and 5S initiatives to solve problems on product manufacturing lines. \n•\tConducted manufacturing time studies in order to establish value added/non-value added processes as well as developed possible solutions to streamline manufacturing processes. \n•\tUsed SAP to create/modify BOMs as well as routings. Mechanic/Sales Associate Tryathletics May 2012  –  August 2013  (1 year 4 months) Columbia, Missouri Area •\tAssembled bicycles and used problem solving strategies to diagnose and solve issues with customers’ bikes.  \n•\tAssisted and educated customers on various running, swimming and cycling products. Mechanic/Sales Associate Tryathletics May 2012  –  August 2013  (1 year 4 months) Columbia, Missouri Area •\tAssembled bicycles and used problem solving strategies to diagnose and solve issues with customers’ bikes.  \n•\tAssisted and educated customers on various running, swimming and cycling products. Intern Foliotek September 2011  –  August 2012  (1 year) Columbia, Missouri Area •\tManaged support and assist clients and customers with the Foliotek e-portfolio system. \n•\tDesigned and coded Rosewater e-forms. \n•\tTested and debugged new features for the e-portfolio system. \n•\tUncovered, tested, and submited defects on the system to development team. Intern Foliotek September 2011  –  August 2012  (1 year) Columbia, Missouri Area •\tManaged support and assist clients and customers with the Foliotek e-portfolio system. \n•\tDesigned and coded Rosewater e-forms. \n•\tTested and debugged new features for the e-portfolio system. \n•\tUncovered, tested, and submited defects on the system to development team. Product Development ShowMeCables August 2008  –  January 2012  (3 years 6 months) Chesterfield, MO •\tOverhauled and edited existing products as well as creating new ones on our e-commerce website. \n•\tEdited and published product photos through the use of Photoshop, Lightroom and GIMP. \n•\tWorked in a team to collaborate effective mediums of marketing and product exposure. Product Development ShowMeCables August 2008  –  January 2012  (3 years 6 months) Chesterfield, MO •\tOverhauled and edited existing products as well as creating new ones on our e-commerce website. \n•\tEdited and published product photos through the use of Photoshop, Lightroom and GIMP. \n•\tWorked in a team to collaborate effective mediums of marketing and product exposure. Languages Spanish Spanish Spanish Skills HTML Lean Manufacturing Six Sigma Minitab Manufacturing AutoCAD 5S Quality Management APQP SAP Root Cause Analysis Access Database Solidworks FMEA MIS Quality Auditing JavaScript CSS MES CAD/CAM Sales Wordpress Microsoft Office Ergonomics Matlab IDEF PHP SQL Microsoft Excel Manufacturing... Product Development Automotive Quality Control Troubleshooting Engineering See 20+     See less Skills  HTML Lean Manufacturing Six Sigma Minitab Manufacturing AutoCAD 5S Quality Management APQP SAP Root Cause Analysis Access Database Solidworks FMEA MIS Quality Auditing JavaScript CSS MES CAD/CAM Sales Wordpress Microsoft Office Ergonomics Matlab IDEF PHP SQL Microsoft Excel Manufacturing... Product Development Automotive Quality Control Troubleshooting Engineering See 20+     See less HTML Lean Manufacturing Six Sigma Minitab Manufacturing AutoCAD 5S Quality Management APQP SAP Root Cause Analysis Access Database Solidworks FMEA MIS Quality Auditing JavaScript CSS MES CAD/CAM Sales Wordpress Microsoft Office Ergonomics Matlab IDEF PHP SQL Microsoft Excel Manufacturing... Product Development Automotive Quality Control Troubleshooting Engineering See 20+     See less HTML Lean Manufacturing Six Sigma Minitab Manufacturing AutoCAD 5S Quality Management APQP SAP Root Cause Analysis Access Database Solidworks FMEA MIS Quality Auditing JavaScript CSS MES CAD/CAM Sales Wordpress Microsoft Office Ergonomics Matlab IDEF PHP SQL Microsoft Excel Manufacturing... Product Development Automotive Quality Control Troubleshooting Engineering See 20+     See less Education University of Missouri-Columbia Bachelor of Science (B.S.),  Industrial and Manufacturing Systems Engineering 2010  – 2016 Activities and Societies:  University of Missouri Cycling Team ,  Institute of Industrial Engineers ,  Society of Manufacturing Engineers Eureka High School 2006  – 2010 University of Missouri-Columbia Bachelor of Science (B.S.),  Industrial and Manufacturing Systems Engineering 2010  – 2016 Activities and Societies:  University of Missouri Cycling Team ,  Institute of Industrial Engineers ,  Society of Manufacturing Engineers University of Missouri-Columbia Bachelor of Science (B.S.),  Industrial and Manufacturing Systems Engineering 2010  – 2016 Activities and Societies:  University of Missouri Cycling Team ,  Institute of Industrial Engineers ,  Society of Manufacturing Engineers University of Missouri-Columbia Bachelor of Science (B.S.),  Industrial and Manufacturing Systems Engineering 2010  – 2016 Activities and Societies:  University of Missouri Cycling Team ,  Institute of Industrial Engineers ,  Society of Manufacturing Engineers Eureka High School 2006  – 2010 Eureka High School 2006  – 2010 Eureka High School 2006  – 2010 ", "Experience Part-Time Engineering Intern University of Michigan Plant Operations January 2015  – Present (8 months) Ann Arbor, MI Thermal Systems Engineering Intern Tesla Motors September 2014  –  December 2014  (4 months) Fremont, CA Systems Engineering Intern Gates Corporation May 2014  –  August 2014  (4 months) Rochester Hills, Michigan Part-Time Engineering Intern University of Michigan Plant Operations January 2014  –  April 2014  (4 months) Ann Arbor, Michigan Systems Engineering Intern Gates Corporation May 2013  –  August 2013  (4 months) Rochester Hills, Michigan Thermal Systems Engineering Intern Tesla Motors May 2012  –  July 2012  (3 months) Palo Alto, CA Part-Time Engineering Intern University of Michigan Plant Operations January 2015  – Present (8 months) Ann Arbor, MI Part-Time Engineering Intern University of Michigan Plant Operations January 2015  – Present (8 months) Ann Arbor, MI Thermal Systems Engineering Intern Tesla Motors September 2014  –  December 2014  (4 months) Fremont, CA Thermal Systems Engineering Intern Tesla Motors September 2014  –  December 2014  (4 months) Fremont, CA Systems Engineering Intern Gates Corporation May 2014  –  August 2014  (4 months) Rochester Hills, Michigan Systems Engineering Intern Gates Corporation May 2014  –  August 2014  (4 months) Rochester Hills, Michigan Part-Time Engineering Intern University of Michigan Plant Operations January 2014  –  April 2014  (4 months) Ann Arbor, Michigan Part-Time Engineering Intern University of Michigan Plant Operations January 2014  –  April 2014  (4 months) Ann Arbor, Michigan Systems Engineering Intern Gates Corporation May 2013  –  August 2013  (4 months) Rochester Hills, Michigan Systems Engineering Intern Gates Corporation May 2013  –  August 2013  (4 months) Rochester Hills, Michigan Thermal Systems Engineering Intern Tesla Motors May 2012  –  July 2012  (3 months) Palo Alto, CA Thermal Systems Engineering Intern Tesla Motors May 2012  –  July 2012  (3 months) Palo Alto, CA Languages   Skills Testing Car Maintenance CATIA Solidworks AutoCAD Skills  Testing Car Maintenance CATIA Solidworks AutoCAD Testing Car Maintenance CATIA Solidworks AutoCAD Testing Car Maintenance CATIA Solidworks AutoCAD Education University of Michigan Bachelor of Science (B.S.),  Mechanical Engineering with a specialization in Sustainability 2013  – 2016 University of Michigan-Flint Mechanical Engineering 2011  – 2013 Clarkston High School 2007  – 2011 Activities and Societies:  Drumline Section Leader (Marching Band) ,  Symphonic Wind Ensemble ,  Track & Field. University of Michigan Bachelor of Science (B.S.),  Mechanical Engineering with a specialization in Sustainability 2013  – 2016 University of Michigan Bachelor of Science (B.S.),  Mechanical Engineering with a specialization in Sustainability 2013  – 2016 University of Michigan Bachelor of Science (B.S.),  Mechanical Engineering with a specialization in Sustainability 2013  – 2016 University of Michigan-Flint Mechanical Engineering 2011  – 2013 University of Michigan-Flint Mechanical Engineering 2011  – 2013 University of Michigan-Flint Mechanical Engineering 2011  – 2013 Clarkston High School 2007  – 2011 Activities and Societies:  Drumline Section Leader (Marching Band) ,  Symphonic Wind Ensemble ,  Track & Field. Clarkston High School 2007  – 2011 Activities and Societies:  Drumline Section Leader (Marching Band) ,  Symphonic Wind Ensemble ,  Track & Field. Clarkston High School 2007  – 2011 Activities and Societies:  Drumline Section Leader (Marching Band) ,  Symphonic Wind Ensemble ,  Track & Field. Honors & Awards ", "Summary My aim of life, \"Do not do the work, or do it perfectly.\" Summary My aim of life, \"Do not do the work, or do it perfectly.\" My aim of life, \"Do not do the work, or do it perfectly.\" My aim of life, \"Do not do the work, or do it perfectly.\" Experience Engineering Intern Lafarge Iraq August 2015  – Present (1 month) HSE Trained \nSite Engineer Engineering Intern Bezhan Bazian Petroleum Refinery July 2015  –  July 2015  (1 month) HSE trained \nSite engineer \nEngineering trained Engineering Intern Schlumberger August 2014  –  August 2014  (1 month) Erbil Drilling Tools and Remedial Engineer \nSite Engineer \nHSE Trained Engineering Intern Kelkan Contracting Limited July 2014  –  July 2014  (1 month) Sulaymaniyah AutoCAD Designer \nContractor Assistant \nHSE trained \nSite Engineer Member Lafarge Employability & Workshop December 2013  –  December 2013  (1 month) Sulaimaniyah Strengthened my leadership ability \nLearned how to do multitasking \nLearned how to overcome dissficult situations during work \nPromoted to work individually and in group Engineering Intern Palkana Company for Construction Management November 2013  –  November 2013  (1 month) Sulaymaniyah Accountant Assistant \nRecruiting Assistant \nSite Engineer \nMarketing Participant Startup Weekend Sulaimani August 2013  –  August 2013  (1 month) Sulaimaniyah Invented new business idea over the course of 54 hours Part-Time English Instructor The English Club Language Institute June 2013  –  August 2013  (3 months) Sulaimaniyah Taught Advanced English \nTaught Pre-Intermediate English Part-Time English Instructor Oprah English Language Institute June 2013  –  August 2013  (3 months) Sulaimaniyah Taught Pre-Intermediate English Co-founder 6D Cinema Bowling Center June 2008  –  August 2013  (5 years 3 months) Sulaymaniyah Installer of the Theater \nMechanical Chairs Maintenance \nIT Maintenance \nCustomer Services \nMarketing \nCashier Volunteer Sulaimani Chorus April 2013  –  April 2013  (1 month) Sulaimaniyah Organizing audiences \nSelling tickets \nTranslator (English to Kurdish and Arabic) Engineering Intern Bzhar Company for Manufactoring Tiles and Feldspar June 2012  –  August 2012  (3 months) Sulaimaniyah Mechanical Technician  \nProject Manager Assistant \nDoubled company's income \nTranslator Competiter AUI-S Business Plan Across Borders June 2012  –  June 2012  (1 month) Sulaimaniyah Runner-up \nInvented new business plan for Iraq Accounting Assistant Nawroz Tourism Park June 2011  –  August 2011  (3 months) Sulaimaniyah Accounting Assistant \nMarketing \nCustomer Services \nTranslator(Kurdish to English and Arabic) Member AUI-S Voice September 2010  –  December 2010  (4 months) Sulaimaniyah Reporter \nDesigner Team Member The orphanage Summer School Refugees June 2010  –  August 2010  (3 months) Sulaimaniyah Social Motivator \nEnglish Instructor Section Leader Peer Supporter at AUI-S September 2009  –  June 2010  (10 months) Sulaimaniyah Analyzed and solved students' problems \nActivated the relationship among AUI-S students Participant Environment Week at AUI-S March 2010  –  March 2010  (1 month) Sulaimaniyah Analyzed environmental problems in Iraq \nProposed specific solutions Engineering Intern Lafarge Iraq August 2015  – Present (1 month) HSE Trained \nSite Engineer Engineering Intern Lafarge Iraq August 2015  – Present (1 month) HSE Trained \nSite Engineer Engineering Intern Bezhan Bazian Petroleum Refinery July 2015  –  July 2015  (1 month) HSE trained \nSite engineer \nEngineering trained Engineering Intern Bezhan Bazian Petroleum Refinery July 2015  –  July 2015  (1 month) HSE trained \nSite engineer \nEngineering trained Engineering Intern Schlumberger August 2014  –  August 2014  (1 month) Erbil Drilling Tools and Remedial Engineer \nSite Engineer \nHSE Trained Engineering Intern Schlumberger August 2014  –  August 2014  (1 month) Erbil Drilling Tools and Remedial Engineer \nSite Engineer \nHSE Trained Engineering Intern Kelkan Contracting Limited July 2014  –  July 2014  (1 month) Sulaymaniyah AutoCAD Designer \nContractor Assistant \nHSE trained \nSite Engineer Engineering Intern Kelkan Contracting Limited July 2014  –  July 2014  (1 month) Sulaymaniyah AutoCAD Designer \nContractor Assistant \nHSE trained \nSite Engineer Member Lafarge Employability & Workshop December 2013  –  December 2013  (1 month) Sulaimaniyah Strengthened my leadership ability \nLearned how to do multitasking \nLearned how to overcome dissficult situations during work \nPromoted to work individually and in group Member Lafarge Employability & Workshop December 2013  –  December 2013  (1 month) Sulaimaniyah Strengthened my leadership ability \nLearned how to do multitasking \nLearned how to overcome dissficult situations during work \nPromoted to work individually and in group Engineering Intern Palkana Company for Construction Management November 2013  –  November 2013  (1 month) Sulaymaniyah Accountant Assistant \nRecruiting Assistant \nSite Engineer \nMarketing Engineering Intern Palkana Company for Construction Management November 2013  –  November 2013  (1 month) Sulaymaniyah Accountant Assistant \nRecruiting Assistant \nSite Engineer \nMarketing Participant Startup Weekend Sulaimani August 2013  –  August 2013  (1 month) Sulaimaniyah Invented new business idea over the course of 54 hours Participant Startup Weekend Sulaimani August 2013  –  August 2013  (1 month) Sulaimaniyah Invented new business idea over the course of 54 hours Part-Time English Instructor The English Club Language Institute June 2013  –  August 2013  (3 months) Sulaimaniyah Taught Advanced English \nTaught Pre-Intermediate English Part-Time English Instructor The English Club Language Institute June 2013  –  August 2013  (3 months) Sulaimaniyah Taught Advanced English \nTaught Pre-Intermediate English Part-Time English Instructor Oprah English Language Institute June 2013  –  August 2013  (3 months) Sulaimaniyah Taught Pre-Intermediate English Part-Time English Instructor Oprah English Language Institute June 2013  –  August 2013  (3 months) Sulaimaniyah Taught Pre-Intermediate English Co-founder 6D Cinema Bowling Center June 2008  –  August 2013  (5 years 3 months) Sulaymaniyah Installer of the Theater \nMechanical Chairs Maintenance \nIT Maintenance \nCustomer Services \nMarketing \nCashier Co-founder 6D Cinema Bowling Center June 2008  –  August 2013  (5 years 3 months) Sulaymaniyah Installer of the Theater \nMechanical Chairs Maintenance \nIT Maintenance \nCustomer Services \nMarketing \nCashier Volunteer Sulaimani Chorus April 2013  –  April 2013  (1 month) Sulaimaniyah Organizing audiences \nSelling tickets \nTranslator (English to Kurdish and Arabic) Volunteer Sulaimani Chorus April 2013  –  April 2013  (1 month) Sulaimaniyah Organizing audiences \nSelling tickets \nTranslator (English to Kurdish and Arabic) Engineering Intern Bzhar Company for Manufactoring Tiles and Feldspar June 2012  –  August 2012  (3 months) Sulaimaniyah Mechanical Technician  \nProject Manager Assistant \nDoubled company's income \nTranslator Engineering Intern Bzhar Company for Manufactoring Tiles and Feldspar June 2012  –  August 2012  (3 months) Sulaimaniyah Mechanical Technician  \nProject Manager Assistant \nDoubled company's income \nTranslator Competiter AUI-S Business Plan Across Borders June 2012  –  June 2012  (1 month) Sulaimaniyah Runner-up \nInvented new business plan for Iraq Competiter AUI-S Business Plan Across Borders June 2012  –  June 2012  (1 month) Sulaimaniyah Runner-up \nInvented new business plan for Iraq Accounting Assistant Nawroz Tourism Park June 2011  –  August 2011  (3 months) Sulaimaniyah Accounting Assistant \nMarketing \nCustomer Services \nTranslator(Kurdish to English and Arabic) Accounting Assistant Nawroz Tourism Park June 2011  –  August 2011  (3 months) Sulaimaniyah Accounting Assistant \nMarketing \nCustomer Services \nTranslator(Kurdish to English and Arabic) Member AUI-S Voice September 2010  –  December 2010  (4 months) Sulaimaniyah Reporter \nDesigner Member AUI-S Voice September 2010  –  December 2010  (4 months) Sulaimaniyah Reporter \nDesigner Team Member The orphanage Summer School Refugees June 2010  –  August 2010  (3 months) Sulaimaniyah Social Motivator \nEnglish Instructor Team Member The orphanage Summer School Refugees June 2010  –  August 2010  (3 months) Sulaimaniyah Social Motivator \nEnglish Instructor Section Leader Peer Supporter at AUI-S September 2009  –  June 2010  (10 months) Sulaimaniyah Analyzed and solved students' problems \nActivated the relationship among AUI-S students Section Leader Peer Supporter at AUI-S September 2009  –  June 2010  (10 months) Sulaimaniyah Analyzed and solved students' problems \nActivated the relationship among AUI-S students Participant Environment Week at AUI-S March 2010  –  March 2010  (1 month) Sulaimaniyah Analyzed environmental problems in Iraq \nProposed specific solutions Participant Environment Week at AUI-S March 2010  –  March 2010  (1 month) Sulaimaniyah Analyzed environmental problems in Iraq \nProposed specific solutions Languages Kurdish Native or bilingual proficiency English Full professional proficiency Arabic Limited working proficiency Persian Limited working proficiency Kurdish Native or bilingual proficiency English Full professional proficiency Arabic Limited working proficiency Persian Limited working proficiency Kurdish Native or bilingual proficiency English Full professional proficiency Arabic Limited working proficiency Persian Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Limited working proficiency Skills Oil & Gas Petroleum Upstream Drilling Energy Petroleum Engineering Oil  Energy Industry Oilfield Onshore Completion Engineering Reservoir Management Skills  Oil & Gas Petroleum Upstream Drilling Energy Petroleum Engineering Oil  Energy Industry Oilfield Onshore Completion Engineering Reservoir Management Oil & Gas Petroleum Upstream Drilling Energy Petroleum Engineering Oil  Energy Industry Oilfield Onshore Completion Engineering Reservoir Management Oil & Gas Petroleum Upstream Drilling Energy Petroleum Engineering Oil  Energy Industry Oilfield Onshore Completion Engineering Reservoir Management Education The American University of Iraq, Sulaimani Bachelor of Engineering (B.Eng.),  Engineering Department of Energy and Thermal-Fluid Systems/Petroleum , AUI-S Alumni 2010  – 2015 Selected Engineering Course Work: Computer Science and IT Applications. Statistics. Principles and History of Economic Thought. Calculus I. Physics I. Chemistry I. Calculus I. Engineering Computing. Physical Geology. Physics Lab2.Chemistry Lab2. Chemistry2. Physics2. Calculus III. Circuits Thermodynamics. Measurement Labs. Differential Equations. Engineering Drawing (AutoCAD & Solid Works). Statics. Soil Mechanics. Mechanics of Materials. Dynamics. Renewable Energy. Transport Phenomena. ENGR Laboratory (PLC, Construction, Fabrication). Project Management. Engineering Drilling of the Oil Well. Oil Well Reservoir. Production of Petroleum. Hoisting System (Capstone Project). The American University of Iraq, Sulaimani Bachelor of Engineering (B.Eng.),  Engineering Department of Energy and Thermal-Fluid Systems/Petroleum , AUI-S Alumni 2010  – 2015 Selected Engineering Course Work: Computer Science and IT Applications. Statistics. Principles and History of Economic Thought. Calculus I. Physics I. Chemistry I. Calculus I. Engineering Computing. Physical Geology. Physics Lab2.Chemistry Lab2. Chemistry2. Physics2. Calculus III. Circuits Thermodynamics. Measurement Labs. Differential Equations. Engineering Drawing (AutoCAD & Solid Works). Statics. Soil Mechanics. Mechanics of Materials. Dynamics. Renewable Energy. Transport Phenomena. ENGR Laboratory (PLC, Construction, Fabrication). Project Management. Engineering Drilling of the Oil Well. Oil Well Reservoir. Production of Petroleum. Hoisting System (Capstone Project). The American University of Iraq, Sulaimani Bachelor of Engineering (B.Eng.),  Engineering Department of Energy and Thermal-Fluid Systems/Petroleum , AUI-S Alumni 2010  – 2015 Selected Engineering Course Work: Computer Science and IT Applications. Statistics. Principles and History of Economic Thought. Calculus I. Physics I. Chemistry I. Calculus I. Engineering Computing. Physical Geology. Physics Lab2.Chemistry Lab2. Chemistry2. Physics2. Calculus III. Circuits Thermodynamics. Measurement Labs. Differential Equations. Engineering Drawing (AutoCAD & Solid Works). Statics. Soil Mechanics. Mechanics of Materials. Dynamics. Renewable Energy. Transport Phenomena. ENGR Laboratory (PLC, Construction, Fabrication). Project Management. Engineering Drilling of the Oil Well. Oil Well Reservoir. Production of Petroleum. Hoisting System (Capstone Project). The American University of Iraq, Sulaimani Bachelor of Engineering (B.Eng.),  Engineering Department of Energy and Thermal-Fluid Systems/Petroleum , AUI-S Alumni 2010  – 2015 Selected Engineering Course Work: Computer Science and IT Applications. Statistics. Principles and History of Economic Thought. Calculus I. Physics I. Chemistry I. Calculus I. Engineering Computing. Physical Geology. Physics Lab2.Chemistry Lab2. Chemistry2. Physics2. Calculus III. Circuits Thermodynamics. Measurement Labs. Differential Equations. Engineering Drawing (AutoCAD & Solid Works). Statics. Soil Mechanics. Mechanics of Materials. Dynamics. Renewable Energy. Transport Phenomena. ENGR Laboratory (PLC, Construction, Fabrication). Project Management. Engineering Drilling of the Oil Well. Oil Well Reservoir. Production of Petroleum. Hoisting System (Capstone Project). ", "Summary I am currently a senior at the University of Michigan Ann Arbor and I am pursuing a B.S.E. degree in Industrial and Operations Engineering with a minor in the Environment. Summary I am currently a senior at the University of Michigan Ann Arbor and I am pursuing a B.S.E. degree in Industrial and Operations Engineering with a minor in the Environment. I am currently a senior at the University of Michigan Ann Arbor and I am pursuing a B.S.E. degree in Industrial and Operations Engineering with a minor in the Environment. I am currently a senior at the University of Michigan Ann Arbor and I am pursuing a B.S.E. degree in Industrial and Operations Engineering with a minor in the Environment. Experience Industrial Engineering Intern Boeing May 2015  – Present (4 months) Everett, Washington Instructor University of Michigan Tauber Institute Operations Leadership Factory September 2014  –  April 2015  (8 months) Ann Arbor, Michigan Lead teams of customers through learning lean manufacturing culture \n \n· Develop best practices for mock turbo charger lean manufacturing \n \n· Manufacture parts to be used in lessons Design and Release Engineering Intern Ford Motor Company May 2014  –  August 2014  (4 months) Dearborn, Michigan •\tGained experience with CATIA and VisMockup during 100% \ncompliance check of Design Rules for D544 program \n•\tCompleted many design-test-build cycles of ICA parts for  \nS550 AIMS issues \n•\tFacilitated with suppliers mutual completion of part delivery and  \n900 door panel reworks Engineering Intern ADP January 2014  –  August 2014  (8 months) Ann Arbor, Michigan Food Service Coordinator University of Michigan Dining Halls February 2012  –  January 2014  (2 years) Ann Arbor Michigan •\tFacilitated student food services during dining hall operations \n•\tSupervised 20-25 students per dinning shift \n•\tTaught students proper food service skills, safety, and etiquette Quality Engineering Intern Johnson Controls May 2013  –  August 2013  (4 months) Holland Michigan •\tUpdate Supplier Assessment Survey (SAS) database for 100% supplier  \ncompliance and gap closure \n•\tSolicit and facilitate 119 new SAS and upload to WebTop global database \n•\tCreate month end report of supplier quality metrics;  \nsolicit top 5 suppliers by highest PPM, and conduct root cause analysis \n•\tDevelop and assist newly sourced suppliers with time study and  \noperational analysis. Engineering Intern Durr Systems, Inc. May 2012  –  August 2012  (4 months) Plymouth, Michigan •\tGained experience with Title V Air Permits and finding use of  \nthermal oxidizers as VOC emissions control \n•\tProject leader who developed and maintained air permit database of  \n10,000+ permits \n•\tUpdated and enhanced efficiency of cost analysis forms for  \nregenerative thermal oxidizer (RTO) systems Industrial Engineering Intern Boeing May 2015  – Present (4 months) Everett, Washington Industrial Engineering Intern Boeing May 2015  – Present (4 months) Everett, Washington Instructor University of Michigan Tauber Institute Operations Leadership Factory September 2014  –  April 2015  (8 months) Ann Arbor, Michigan Lead teams of customers through learning lean manufacturing culture \n \n· Develop best practices for mock turbo charger lean manufacturing \n \n· Manufacture parts to be used in lessons Instructor University of Michigan Tauber Institute Operations Leadership Factory September 2014  –  April 2015  (8 months) Ann Arbor, Michigan Lead teams of customers through learning lean manufacturing culture \n \n· Develop best practices for mock turbo charger lean manufacturing \n \n· Manufacture parts to be used in lessons Design and Release Engineering Intern Ford Motor Company May 2014  –  August 2014  (4 months) Dearborn, Michigan •\tGained experience with CATIA and VisMockup during 100% \ncompliance check of Design Rules for D544 program \n•\tCompleted many design-test-build cycles of ICA parts for  \nS550 AIMS issues \n•\tFacilitated with suppliers mutual completion of part delivery and  \n900 door panel reworks Design and Release Engineering Intern Ford Motor Company May 2014  –  August 2014  (4 months) Dearborn, Michigan •\tGained experience with CATIA and VisMockup during 100% \ncompliance check of Design Rules for D544 program \n•\tCompleted many design-test-build cycles of ICA parts for  \nS550 AIMS issues \n•\tFacilitated with suppliers mutual completion of part delivery and  \n900 door panel reworks Engineering Intern ADP January 2014  –  August 2014  (8 months) Ann Arbor, Michigan Engineering Intern ADP January 2014  –  August 2014  (8 months) Ann Arbor, Michigan Food Service Coordinator University of Michigan Dining Halls February 2012  –  January 2014  (2 years) Ann Arbor Michigan •\tFacilitated student food services during dining hall operations \n•\tSupervised 20-25 students per dinning shift \n•\tTaught students proper food service skills, safety, and etiquette Food Service Coordinator University of Michigan Dining Halls February 2012  –  January 2014  (2 years) Ann Arbor Michigan •\tFacilitated student food services during dining hall operations \n•\tSupervised 20-25 students per dinning shift \n•\tTaught students proper food service skills, safety, and etiquette Quality Engineering Intern Johnson Controls May 2013  –  August 2013  (4 months) Holland Michigan •\tUpdate Supplier Assessment Survey (SAS) database for 100% supplier  \ncompliance and gap closure \n•\tSolicit and facilitate 119 new SAS and upload to WebTop global database \n•\tCreate month end report of supplier quality metrics;  \nsolicit top 5 suppliers by highest PPM, and conduct root cause analysis \n•\tDevelop and assist newly sourced suppliers with time study and  \noperational analysis. Quality Engineering Intern Johnson Controls May 2013  –  August 2013  (4 months) Holland Michigan •\tUpdate Supplier Assessment Survey (SAS) database for 100% supplier  \ncompliance and gap closure \n•\tSolicit and facilitate 119 new SAS and upload to WebTop global database \n•\tCreate month end report of supplier quality metrics;  \nsolicit top 5 suppliers by highest PPM, and conduct root cause analysis \n•\tDevelop and assist newly sourced suppliers with time study and  \noperational analysis. Engineering Intern Durr Systems, Inc. May 2012  –  August 2012  (4 months) Plymouth, Michigan •\tGained experience with Title V Air Permits and finding use of  \nthermal oxidizers as VOC emissions control \n•\tProject leader who developed and maintained air permit database of  \n10,000+ permits \n•\tUpdated and enhanced efficiency of cost analysis forms for  \nregenerative thermal oxidizer (RTO) systems Engineering Intern Durr Systems, Inc. May 2012  –  August 2012  (4 months) Plymouth, Michigan •\tGained experience with Title V Air Permits and finding use of  \nthermal oxidizers as VOC emissions control \n•\tProject leader who developed and maintained air permit database of  \n10,000+ permits \n•\tUpdated and enhanced efficiency of cost analysis forms for  \nregenerative thermal oxidizer (RTO) systems Skills Microsoft Office Microsoft Excel C++ English Engineering Project Planning Technical Communication Creative Problem Solving Visual Basic SQL Root Cause Analysis Skills  Microsoft Office Microsoft Excel C++ English Engineering Project Planning Technical Communication Creative Problem Solving Visual Basic SQL Root Cause Analysis Microsoft Office Microsoft Excel C++ English Engineering Project Planning Technical Communication Creative Problem Solving Visual Basic SQL Root Cause Analysis Microsoft Office Microsoft Excel C++ English Engineering Project Planning Technical Communication Creative Problem Solving Visual Basic SQL Root Cause Analysis Education University of Michigan College of Engineering Master of Science (M.S.),  Industrial and Operations Engineering 2015  – 2016 University of Michigan Bachelor of Science (B.S.),  Industrial and Operations Engineering 2011  – 2015 Magna Cum Laude Activities and Societies:  Alpha Pi Mu (APM) ,  Michigan Running Club (Mrun) ,  Better Living Using Engineering Lab (BLUElab) University of Michigan College of Engineering Master of Science (M.S.),  Industrial and Operations Engineering 2015  – 2016 University of Michigan College of Engineering Master of Science (M.S.),  Industrial and Operations Engineering 2015  – 2016 University of Michigan College of Engineering Master of Science (M.S.),  Industrial and Operations Engineering 2015  – 2016 University of Michigan Bachelor of Science (B.S.),  Industrial and Operations Engineering 2011  – 2015 Magna Cum Laude Activities and Societies:  Alpha Pi Mu (APM) ,  Michigan Running Club (Mrun) ,  Better Living Using Engineering Lab (BLUElab) University of Michigan Bachelor of Science (B.S.),  Industrial and Operations Engineering 2011  – 2015 Magna Cum Laude Activities and Societies:  Alpha Pi Mu (APM) ,  Michigan Running Club (Mrun) ,  Better Living Using Engineering Lab (BLUElab) University of Michigan Bachelor of Science (B.S.),  Industrial and Operations Engineering 2011  – 2015 Magna Cum Laude Activities and Societies:  Alpha Pi Mu (APM) ,  Michigan Running Club (Mrun) ,  Better Living Using Engineering Lab (BLUElab) Honors & Awards Eagle Scout 2008 Dean's List: Fall/Winter 2011, 2012, 2013 University Honors: Fall/Winter 2011, 2012, 2013 Yazaki Scholarship 2011 Eagle Scout 2008 Eagle Scout 2008 Eagle Scout 2008 Dean's List: Fall/Winter 2011, 2012, 2013 Dean's List: Fall/Winter 2011, 2012, 2013 Dean's List: Fall/Winter 2011, 2012, 2013 University Honors: Fall/Winter 2011, 2012, 2013 University Honors: Fall/Winter 2011, 2012, 2013 University Honors: Fall/Winter 2011, 2012, 2013 Yazaki Scholarship 2011 Yazaki Scholarship 2011 Yazaki Scholarship 2011 ", "Experience Engineering Intern Fortescue Metals Group June 2015  – Present (3 months) Port Hedland, Western Australia, Australia Engineering Intern Heat Trap Solar February 2015  – Present (7 months) Perth, Australia CEED Scholarship Student Defence Science and Technology Organisation August 2013  –  June 2014  (11 months) Perth Area, Australia Co-operative Education for Enterprise Development (CEED) \nFinal Year Honours Project Event Manager Society of Petroleum Engineers (UWA Student Chapter) June 2011  –  June 2014  (3 years 1 month) University of Western Australia Engineering Intern Hydra Energy March 2014  –  May 2014  (3 months) Perth Area, Australia Vice President - Education University Engineers' Club March 2013  –  January 2014  (11 months) University of Western Australia Engineering Intern Wood Group Integrity Management November 2010  –  November 2013  (3 years 1 month) Perth Area, Australia Dreamcatcher Competition Finalist Dreamfit Foundation August 2010  –  December 2010  (5 months) Perth Area, Australia UWA Mechanical Engineering Project \nSponsored and mentored by Wood Group Integrity Management Engineering Intern Fortescue Metals Group June 2015  – Present (3 months) Port Hedland, Western Australia, Australia Engineering Intern Fortescue Metals Group June 2015  – Present (3 months) Port Hedland, Western Australia, Australia Engineering Intern Heat Trap Solar February 2015  – Present (7 months) Perth, Australia Engineering Intern Heat Trap Solar February 2015  – Present (7 months) Perth, Australia CEED Scholarship Student Defence Science and Technology Organisation August 2013  –  June 2014  (11 months) Perth Area, Australia Co-operative Education for Enterprise Development (CEED) \nFinal Year Honours Project CEED Scholarship Student Defence Science and Technology Organisation August 2013  –  June 2014  (11 months) Perth Area, Australia Co-operative Education for Enterprise Development (CEED) \nFinal Year Honours Project Event Manager Society of Petroleum Engineers (UWA Student Chapter) June 2011  –  June 2014  (3 years 1 month) University of Western Australia Event Manager Society of Petroleum Engineers (UWA Student Chapter) June 2011  –  June 2014  (3 years 1 month) University of Western Australia Engineering Intern Hydra Energy March 2014  –  May 2014  (3 months) Perth Area, Australia Engineering Intern Hydra Energy March 2014  –  May 2014  (3 months) Perth Area, Australia Vice President - Education University Engineers' Club March 2013  –  January 2014  (11 months) University of Western Australia Vice President - Education University Engineers' Club March 2013  –  January 2014  (11 months) University of Western Australia Engineering Intern Wood Group Integrity Management November 2010  –  November 2013  (3 years 1 month) Perth Area, Australia Engineering Intern Wood Group Integrity Management November 2010  –  November 2013  (3 years 1 month) Perth Area, Australia Dreamcatcher Competition Finalist Dreamfit Foundation August 2010  –  December 2010  (5 months) Perth Area, Australia UWA Mechanical Engineering Project \nSponsored and mentored by Wood Group Integrity Management Dreamcatcher Competition Finalist Dreamfit Foundation August 2010  –  December 2010  (5 months) Perth Area, Australia UWA Mechanical Engineering Project \nSponsored and mentored by Wood Group Integrity Management Skills Skills     Education The University of Western Australia Bachelor of Engineering (BEng),  Mechanical Engineering Activities and Societies:  Engineers Australia ,  Asset Management Council ,  UWA Study Abroad ,  University Engineers' Club ,  Society of Petroleum Engineers (UWA Student Chapter) The University of Western Australia Bachelor of Engineering (BEng),  Mechanical Engineering Activities and Societies:  Engineers Australia ,  Asset Management Council ,  UWA Study Abroad ,  University Engineers' Club ,  Society of Petroleum Engineers (UWA Student Chapter) The University of Western Australia Bachelor of Engineering (BEng),  Mechanical Engineering Activities and Societies:  Engineers Australia ,  Asset Management Council ,  UWA Study Abroad ,  University Engineers' Club ,  Society of Petroleum Engineers (UWA Student Chapter) The University of Western Australia Bachelor of Engineering (BEng),  Mechanical Engineering Activities and Societies:  Engineers Australia ,  Asset Management Council ,  UWA Study Abroad ,  University Engineers' Club ,  Society of Petroleum Engineers (UWA Student Chapter) ", "Experience Software Engineering Intern Google May 2015  – Present (4 months) New York, New York Software Engineering Intern IFTTT February 2015  – Present (7 months) San Francisco Bay Area Fellow 2014 HackNY May 2014  – Present (1 year 4 months) New York At HackNY, I lived and worked in New York for a summer, hanging out with an amazing set of people and mentors. It was a fantastic experience, and I'd do it again in a heartbeat. \n \nBasically we did awesome stuff for 10 weeks straight. Mentor hackNY April 2015  –  July 2015  (4 months) New York, New York Software Engineering Intern Magnetic May 2014  –  August 2014  (4 months) Greater New York City Area Another intern and I built out a new method of gleaning context from pageviews. Relevant information is automatically harvested when a user loads the page, massively increasing the amount and quality of information Magnetic can use to do intelligent ad bidding. Fellow hackNY April 2014  –  July 2014  (4 months) New York, New York Software Engineering Intern Grooveshark August 2013  –  October 2013  (3 months) Gainesville, Florida Area I managed and developed a user-friendly analytics dashboard that allows non-technical teams to efficiently query a complex set of MySQL tables and receive pretty line graphs that can be exported as csv, pdf, or png. Software Engineering Intern Google May 2015  – Present (4 months) New York, New York Software Engineering Intern Google May 2015  – Present (4 months) New York, New York Software Engineering Intern IFTTT February 2015  – Present (7 months) San Francisco Bay Area Software Engineering Intern IFTTT February 2015  – Present (7 months) San Francisco Bay Area Fellow 2014 HackNY May 2014  – Present (1 year 4 months) New York At HackNY, I lived and worked in New York for a summer, hanging out with an amazing set of people and mentors. It was a fantastic experience, and I'd do it again in a heartbeat. \n \nBasically we did awesome stuff for 10 weeks straight. Fellow 2014 HackNY May 2014  – Present (1 year 4 months) New York At HackNY, I lived and worked in New York for a summer, hanging out with an amazing set of people and mentors. It was a fantastic experience, and I'd do it again in a heartbeat. \n \nBasically we did awesome stuff for 10 weeks straight. Mentor hackNY April 2015  –  July 2015  (4 months) New York, New York Mentor hackNY April 2015  –  July 2015  (4 months) New York, New York Software Engineering Intern Magnetic May 2014  –  August 2014  (4 months) Greater New York City Area Another intern and I built out a new method of gleaning context from pageviews. Relevant information is automatically harvested when a user loads the page, massively increasing the amount and quality of information Magnetic can use to do intelligent ad bidding. Software Engineering Intern Magnetic May 2014  –  August 2014  (4 months) Greater New York City Area Another intern and I built out a new method of gleaning context from pageviews. Relevant information is automatically harvested when a user loads the page, massively increasing the amount and quality of information Magnetic can use to do intelligent ad bidding. Fellow hackNY April 2014  –  July 2014  (4 months) New York, New York Fellow hackNY April 2014  –  July 2014  (4 months) New York, New York Software Engineering Intern Grooveshark August 2013  –  October 2013  (3 months) Gainesville, Florida Area I managed and developed a user-friendly analytics dashboard that allows non-technical teams to efficiently query a complex set of MySQL tables and receive pretty line graphs that can be exported as csv, pdf, or png. Software Engineering Intern Grooveshark August 2013  –  October 2013  (3 months) Gainesville, Florida Area I managed and developed a user-friendly analytics dashboard that allows non-technical teams to efficiently query a complex set of MySQL tables and receive pretty line graphs that can be exported as csv, pdf, or png. Skills Research Photoshop HTML Editing JavaScript JavaScript Libraries iOS development JavaScriptMVC Programming Skills  Research Photoshop HTML Editing JavaScript JavaScript Libraries iOS development JavaScriptMVC Programming Research Photoshop HTML Editing JavaScript JavaScript Libraries iOS development JavaScriptMVC Programming Research Photoshop HTML Editing JavaScript JavaScript Libraries iOS development JavaScriptMVC Programming ", "Summary Graduate research assistant working in the International Center for Air Transportation (ICAT) Lab and pursuing a MS in Aeronautical and Astronautical Engineering at the Massachusetts Institute of Technology. Research has a focus on predictive modeling for airports in the northeastern US region. Models will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time.  \n \n \nHas a particular interest in entrepreneurship, and works with early stage startups out of the Martin Trust Center for MIT Entrepreneurship. Currently, founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \n \nGraduated with a BS in Mechanical Engineering at the University of Illinois at Urbana-Champaign with Highest Honors. Industry experience includes engineering work for Boeing Defense, Space, & Security (BDS), Boeing Commercial Airplanes (BCA), GE Aviation Systems, and Marathon Petroleum Company. \n \n \n \nSpecialties:  \nThe Thermal Fluid Sciences, Predictive Modeling, Project Management, Team Management, Thermal Modeling \n \n \nRelevant Coursework:  \nAdvanced Fluid Mechanics, Advanced Heat and Mass Transfer, Gas Dynamics, Thermodynamics, Aircraft Propulsion Systems, Energy Systems, Flight Vehicle Aerodynamics, Demand Modeling, and Disciplined Entrepreneurship. Summary Graduate research assistant working in the International Center for Air Transportation (ICAT) Lab and pursuing a MS in Aeronautical and Astronautical Engineering at the Massachusetts Institute of Technology. Research has a focus on predictive modeling for airports in the northeastern US region. Models will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time.  \n \n \nHas a particular interest in entrepreneurship, and works with early stage startups out of the Martin Trust Center for MIT Entrepreneurship. Currently, founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \n \nGraduated with a BS in Mechanical Engineering at the University of Illinois at Urbana-Champaign with Highest Honors. Industry experience includes engineering work for Boeing Defense, Space, & Security (BDS), Boeing Commercial Airplanes (BCA), GE Aviation Systems, and Marathon Petroleum Company. \n \n \n \nSpecialties:  \nThe Thermal Fluid Sciences, Predictive Modeling, Project Management, Team Management, Thermal Modeling \n \n \nRelevant Coursework:  \nAdvanced Fluid Mechanics, Advanced Heat and Mass Transfer, Gas Dynamics, Thermodynamics, Aircraft Propulsion Systems, Energy Systems, Flight Vehicle Aerodynamics, Demand Modeling, and Disciplined Entrepreneurship. Graduate research assistant working in the International Center for Air Transportation (ICAT) Lab and pursuing a MS in Aeronautical and Astronautical Engineering at the Massachusetts Institute of Technology. Research has a focus on predictive modeling for airports in the northeastern US region. Models will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time.  \n \n \nHas a particular interest in entrepreneurship, and works with early stage startups out of the Martin Trust Center for MIT Entrepreneurship. Currently, founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \n \nGraduated with a BS in Mechanical Engineering at the University of Illinois at Urbana-Champaign with Highest Honors. Industry experience includes engineering work for Boeing Defense, Space, & Security (BDS), Boeing Commercial Airplanes (BCA), GE Aviation Systems, and Marathon Petroleum Company. \n \n \n \nSpecialties:  \nThe Thermal Fluid Sciences, Predictive Modeling, Project Management, Team Management, Thermal Modeling \n \n \nRelevant Coursework:  \nAdvanced Fluid Mechanics, Advanced Heat and Mass Transfer, Gas Dynamics, Thermodynamics, Aircraft Propulsion Systems, Energy Systems, Flight Vehicle Aerodynamics, Demand Modeling, and Disciplined Entrepreneurship. Graduate research assistant working in the International Center for Air Transportation (ICAT) Lab and pursuing a MS in Aeronautical and Astronautical Engineering at the Massachusetts Institute of Technology. Research has a focus on predictive modeling for airports in the northeastern US region. Models will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time.  \n \n \nHas a particular interest in entrepreneurship, and works with early stage startups out of the Martin Trust Center for MIT Entrepreneurship. Currently, founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \n \nGraduated with a BS in Mechanical Engineering at the University of Illinois at Urbana-Champaign with Highest Honors. Industry experience includes engineering work for Boeing Defense, Space, & Security (BDS), Boeing Commercial Airplanes (BCA), GE Aviation Systems, and Marathon Petroleum Company. \n \n \n \nSpecialties:  \nThe Thermal Fluid Sciences, Predictive Modeling, Project Management, Team Management, Thermal Modeling \n \n \nRelevant Coursework:  \nAdvanced Fluid Mechanics, Advanced Heat and Mass Transfer, Gas Dynamics, Thermodynamics, Aircraft Propulsion Systems, Energy Systems, Flight Vehicle Aerodynamics, Demand Modeling, and Disciplined Entrepreneurship. Experience Engineering Intern Boeing Defense, Space, & Security March 2014  – Present (1 year 6 months) Phoenix, Arizona Area Acted as an Aerothermal Engineer for the Boeing Flight Technology department. Work included developing and implementing thermal tests, and modeling aircraft components. Modeling was accomplished with thermal modeling software, design calculators, and thermal-fluid theory. My work directly affected production, customer support, and design for the Apache attack helicopters in Mesa, and the Phantom Swift X-plane in Philadelphia. Co-founder GradAdvisor January 2014  – Present (1 year 8 months) Founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \nWe are growing quickly and have been helping graduate students across the nation succeed academically since the beginning of 2014. \n \nwww.grad-advisor.com Graduate Research Assistant Massachusetts Institute of Technology (MIT) August 2013  – Present (2 years 1 month) Research focuses on developing algorithms to accurately model the runway configuration selection process for air traffic control personnel using a discrete choice framework commonly used in traffic demand scenarios.  \n \nModels will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time. Engineering Intern - Thermal Center of Excellence Boeing Commercial Airplanes June 2013  – Present (2 years 3 months) Seattle, WA Supported overall thermal analysis, flow analysis, and pressure relief on the Boeing 737MAX using computational fluid dynamic software, thermal modeling software, advanced controls and system simulation, and theoretical hand calculations. Results are driving final design of the 737MAX nacelle, strut, and engine buildup components. Intern Thyme Labs Incorporated January 2014  –  May 2014  (5 months) Cambridge, MA Design Engineering Intern GE May 2012  –  August 2012  (4 months) Loves Park, IL Led thermal analysis of A320neo Nacelle Anti-Ice Valve (NAIV) consisting of theoretical hand calculations and confirmations via advanced analytical software.  \nLed research on preliminary A320neo NAIV design to determine if thermal lifecycle degradation requirements were met. Experiment required component design and manufacturing, a formal test plan, hands-on lab work, data reduction, and solution proposals. Project Engineering Intern Marathon Petroleum Company June 2011  –  August 2011  (3 months) Robinson, IL Managed 30 engineering projects throughout refinery, improving on economic, environmental, and safety conditions while communicating across multiple departments and coordinating with contracting companies. All project packages were approved, saving MPC approximately $50,000 annually. Engineering Intern Boeing Defense, Space, & Security March 2014  – Present (1 year 6 months) Phoenix, Arizona Area Acted as an Aerothermal Engineer for the Boeing Flight Technology department. Work included developing and implementing thermal tests, and modeling aircraft components. Modeling was accomplished with thermal modeling software, design calculators, and thermal-fluid theory. My work directly affected production, customer support, and design for the Apache attack helicopters in Mesa, and the Phantom Swift X-plane in Philadelphia. Engineering Intern Boeing Defense, Space, & Security March 2014  – Present (1 year 6 months) Phoenix, Arizona Area Acted as an Aerothermal Engineer for the Boeing Flight Technology department. Work included developing and implementing thermal tests, and modeling aircraft components. Modeling was accomplished with thermal modeling software, design calculators, and thermal-fluid theory. My work directly affected production, customer support, and design for the Apache attack helicopters in Mesa, and the Phantom Swift X-plane in Philadelphia. Co-founder GradAdvisor January 2014  – Present (1 year 8 months) Founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \nWe are growing quickly and have been helping graduate students across the nation succeed academically since the beginning of 2014. \n \nwww.grad-advisor.com Co-founder GradAdvisor January 2014  – Present (1 year 8 months) Founded a company called GradAdvisor that helps graduate students reach both their academic and research goals and requirements.  \n \nWe are growing quickly and have been helping graduate students across the nation succeed academically since the beginning of 2014. \n \nwww.grad-advisor.com Graduate Research Assistant Massachusetts Institute of Technology (MIT) August 2013  – Present (2 years 1 month) Research focuses on developing algorithms to accurately model the runway configuration selection process for air traffic control personnel using a discrete choice framework commonly used in traffic demand scenarios.  \n \nModels will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time. Graduate Research Assistant Massachusetts Institute of Technology (MIT) August 2013  – Present (2 years 1 month) Research focuses on developing algorithms to accurately model the runway configuration selection process for air traffic control personnel using a discrete choice framework commonly used in traffic demand scenarios.  \n \nModels will be integrated with tactical decision-support tools, used to set Airport Arrival Rates (AARs), and used to evaluate inter-aircraft spacing on runways in real-time. Engineering Intern - Thermal Center of Excellence Boeing Commercial Airplanes June 2013  – Present (2 years 3 months) Seattle, WA Supported overall thermal analysis, flow analysis, and pressure relief on the Boeing 737MAX using computational fluid dynamic software, thermal modeling software, advanced controls and system simulation, and theoretical hand calculations. Results are driving final design of the 737MAX nacelle, strut, and engine buildup components. Engineering Intern - Thermal Center of Excellence Boeing Commercial Airplanes June 2013  – Present (2 years 3 months) Seattle, WA Supported overall thermal analysis, flow analysis, and pressure relief on the Boeing 737MAX using computational fluid dynamic software, thermal modeling software, advanced controls and system simulation, and theoretical hand calculations. Results are driving final design of the 737MAX nacelle, strut, and engine buildup components. Intern Thyme Labs Incorporated January 2014  –  May 2014  (5 months) Cambridge, MA Intern Thyme Labs Incorporated January 2014  –  May 2014  (5 months) Cambridge, MA Design Engineering Intern GE May 2012  –  August 2012  (4 months) Loves Park, IL Led thermal analysis of A320neo Nacelle Anti-Ice Valve (NAIV) consisting of theoretical hand calculations and confirmations via advanced analytical software.  \nLed research on preliminary A320neo NAIV design to determine if thermal lifecycle degradation requirements were met. Experiment required component design and manufacturing, a formal test plan, hands-on lab work, data reduction, and solution proposals. Design Engineering Intern GE May 2012  –  August 2012  (4 months) Loves Park, IL Led thermal analysis of A320neo Nacelle Anti-Ice Valve (NAIV) consisting of theoretical hand calculations and confirmations via advanced analytical software.  \nLed research on preliminary A320neo NAIV design to determine if thermal lifecycle degradation requirements were met. Experiment required component design and manufacturing, a formal test plan, hands-on lab work, data reduction, and solution proposals. Project Engineering Intern Marathon Petroleum Company June 2011  –  August 2011  (3 months) Robinson, IL Managed 30 engineering projects throughout refinery, improving on economic, environmental, and safety conditions while communicating across multiple departments and coordinating with contracting companies. All project packages were approved, saving MPC approximately $50,000 annually. Project Engineering Intern Marathon Petroleum Company June 2011  –  August 2011  (3 months) Robinson, IL Managed 30 engineering projects throughout refinery, improving on economic, environmental, and safety conditions while communicating across multiple departments and coordinating with contracting companies. All project packages were approved, saving MPC approximately $50,000 annually. Skills Project Engineering Heat Exchangers Turbines Piping Fluid Mechanics Execution of Business... Business Development Entrepreneurship Project Management Predictive Modeling Thermodynamic Modeling ANSYS CFDesign AMESim Flowmaster Matlab Gas Dynamics Aircraft Propulsion Heat Transfer Mechanical Engineering Aerospace Engineering Aeronautics Aerodynamics Thermodynamics Thermal Thermal Analysis Engineering Design Engineering See 13+     See less Skills  Project Engineering Heat Exchangers Turbines Piping Fluid Mechanics Execution of Business... Business Development Entrepreneurship Project Management Predictive Modeling Thermodynamic Modeling ANSYS CFDesign AMESim Flowmaster Matlab Gas Dynamics Aircraft Propulsion Heat Transfer Mechanical Engineering Aerospace Engineering Aeronautics Aerodynamics Thermodynamics Thermal Thermal Analysis Engineering Design Engineering See 13+     See less Project Engineering Heat Exchangers Turbines Piping Fluid Mechanics Execution of Business... Business Development Entrepreneurship Project Management Predictive Modeling Thermodynamic Modeling ANSYS CFDesign AMESim Flowmaster Matlab Gas Dynamics Aircraft Propulsion Heat Transfer Mechanical Engineering Aerospace Engineering Aeronautics Aerodynamics Thermodynamics Thermal Thermal Analysis Engineering Design Engineering See 13+     See less Project Engineering Heat Exchangers Turbines Piping Fluid Mechanics Execution of Business... Business Development Entrepreneurship Project Management Predictive Modeling Thermodynamic Modeling ANSYS CFDesign AMESim Flowmaster Matlab Gas Dynamics Aircraft Propulsion Heat Transfer Mechanical Engineering Aerospace Engineering Aeronautics Aerodynamics Thermodynamics Thermal Thermal Analysis Engineering Design Engineering See 13+     See less Education Massachusetts Institute of Technology Aerospace and Aeronautical Engineering 2013  – 2015 University of Illinois at Urbana-Champaign Bachelor's Degree,  Mechanical Engineering 2009  – 2013 Massachusetts Institute of Technology Aerospace and Aeronautical Engineering 2013  – 2015 Massachusetts Institute of Technology Aerospace and Aeronautical Engineering 2013  – 2015 Massachusetts Institute of Technology Aerospace and Aeronautical Engineering 2013  – 2015 University of Illinois at Urbana-Champaign Bachelor's Degree,  Mechanical Engineering 2009  – 2013 University of Illinois at Urbana-Champaign Bachelor's Degree,  Mechanical Engineering 2009  – 2013 University of Illinois at Urbana-Champaign Bachelor's Degree,  Mechanical Engineering 2009  – 2013 ", "Summary As a software engineer in function and an aspiring entrepreneur at heart, I set high goals for myself with practical means to achieve them. My current passions reside in the development of excellent application software and the harmony between refining my craft and broadening my breadth of knowledge. Summary As a software engineer in function and an aspiring entrepreneur at heart, I set high goals for myself with practical means to achieve them. My current passions reside in the development of excellent application software and the harmony between refining my craft and broadening my breadth of knowledge. As a software engineer in function and an aspiring entrepreneur at heart, I set high goals for myself with practical means to achieve them. My current passions reside in the development of excellent application software and the harmony between refining my craft and broadening my breadth of knowledge. As a software engineer in function and an aspiring entrepreneur at heart, I set high goals for myself with practical means to achieve them. My current passions reside in the development of excellent application software and the harmony between refining my craft and broadening my breadth of knowledge. Experience Software Engineering Intern LinkedIn May 2015  – Present (4 months) San Francisco Bay Area As an intern on the Site Speed team, my responsibility was to develop internal performance tracking for LinkedIn. My work was primarily full-stack, with the backend involving Kafka, Pig processing in HDFS, and the frontend involving an Ember app backed by Flask. Software Engineering Intern in Quality salesforce.com May 2014  –  August 2014  (4 months) San Francisco Bay Area On the Forecasting Team in the Sales Cloud Organization, I was in charge of redesigning the API and UI test infrastructure. Specifically, my responsibilities were focused around the test utility classes and how to optimize the readability and functionality of these classes. This involved deleting redundant methods, simplifying the test automation process, refactoring over 300 test suites, and writing documentation for the entire test infrastructure. \n \nIn addition to work, I also raised $1,000 for Stop Hunger Now by holding a Sales Cloud organization-wide charity event. Engineering Intern POPSUGAR September 2013  –  December 2013  (4 months) San Francisco Bay Area As a developer on the Growth team, I headed on a project that studied user activity on emails. I also worked with the mrjob framework to gather organized user data. Quality Engineering Intern salesforce.com May 2013  –  August 2013  (4 months) San Francisco Bay Area On the Customer Service Infrastructure Team, I migrated legacy UI tests from Selenium RC API to the newer, Selenium Webdriver API. While at first a strictly iterative project, I developed my work into a research project as to how to efficiently convert these tests. I eventually influenced the entire Service Cloud organization's way of moving to the new Webdriver API and migrated around 400 UI tests. Engineering Intern POPSUGAR May 2012  –  May 2013  (1 year 1 month) San Francisco Bay Area P✪PSUGAR is a global media platform catered to women and has offices in SF, LA, NY, and London. As a software engineering intern on the Circle of Moms Team, I work on projects with end-to-end components on both mobile and desktop platforms. Lab Assistant UC Berkeley College of Engineering January 2012  –  May 2012  (5 months) Berkeley, CA Worked with TA to assist students enrolled in The Beauty and Joy of Computer Science (CS10) with their lab assignments. Software Engineering Intern LinkedIn May 2015  – Present (4 months) San Francisco Bay Area As an intern on the Site Speed team, my responsibility was to develop internal performance tracking for LinkedIn. My work was primarily full-stack, with the backend involving Kafka, Pig processing in HDFS, and the frontend involving an Ember app backed by Flask. Software Engineering Intern LinkedIn May 2015  – Present (4 months) San Francisco Bay Area As an intern on the Site Speed team, my responsibility was to develop internal performance tracking for LinkedIn. My work was primarily full-stack, with the backend involving Kafka, Pig processing in HDFS, and the frontend involving an Ember app backed by Flask. Software Engineering Intern in Quality salesforce.com May 2014  –  August 2014  (4 months) San Francisco Bay Area On the Forecasting Team in the Sales Cloud Organization, I was in charge of redesigning the API and UI test infrastructure. Specifically, my responsibilities were focused around the test utility classes and how to optimize the readability and functionality of these classes. This involved deleting redundant methods, simplifying the test automation process, refactoring over 300 test suites, and writing documentation for the entire test infrastructure. \n \nIn addition to work, I also raised $1,000 for Stop Hunger Now by holding a Sales Cloud organization-wide charity event. Software Engineering Intern in Quality salesforce.com May 2014  –  August 2014  (4 months) San Francisco Bay Area On the Forecasting Team in the Sales Cloud Organization, I was in charge of redesigning the API and UI test infrastructure. Specifically, my responsibilities were focused around the test utility classes and how to optimize the readability and functionality of these classes. This involved deleting redundant methods, simplifying the test automation process, refactoring over 300 test suites, and writing documentation for the entire test infrastructure. \n \nIn addition to work, I also raised $1,000 for Stop Hunger Now by holding a Sales Cloud organization-wide charity event. Engineering Intern POPSUGAR September 2013  –  December 2013  (4 months) San Francisco Bay Area As a developer on the Growth team, I headed on a project that studied user activity on emails. I also worked with the mrjob framework to gather organized user data. Engineering Intern POPSUGAR September 2013  –  December 2013  (4 months) San Francisco Bay Area As a developer on the Growth team, I headed on a project that studied user activity on emails. I also worked with the mrjob framework to gather organized user data. Quality Engineering Intern salesforce.com May 2013  –  August 2013  (4 months) San Francisco Bay Area On the Customer Service Infrastructure Team, I migrated legacy UI tests from Selenium RC API to the newer, Selenium Webdriver API. While at first a strictly iterative project, I developed my work into a research project as to how to efficiently convert these tests. I eventually influenced the entire Service Cloud organization's way of moving to the new Webdriver API and migrated around 400 UI tests. Quality Engineering Intern salesforce.com May 2013  –  August 2013  (4 months) San Francisco Bay Area On the Customer Service Infrastructure Team, I migrated legacy UI tests from Selenium RC API to the newer, Selenium Webdriver API. While at first a strictly iterative project, I developed my work into a research project as to how to efficiently convert these tests. I eventually influenced the entire Service Cloud organization's way of moving to the new Webdriver API and migrated around 400 UI tests. Engineering Intern POPSUGAR May 2012  –  May 2013  (1 year 1 month) San Francisco Bay Area P✪PSUGAR is a global media platform catered to women and has offices in SF, LA, NY, and London. As a software engineering intern on the Circle of Moms Team, I work on projects with end-to-end components on both mobile and desktop platforms. Engineering Intern POPSUGAR May 2012  –  May 2013  (1 year 1 month) San Francisco Bay Area P✪PSUGAR is a global media platform catered to women and has offices in SF, LA, NY, and London. As a software engineering intern on the Circle of Moms Team, I work on projects with end-to-end components on both mobile and desktop platforms. Lab Assistant UC Berkeley College of Engineering January 2012  –  May 2012  (5 months) Berkeley, CA Worked with TA to assist students enrolled in The Beauty and Joy of Computer Science (CS10) with their lab assignments. Lab Assistant UC Berkeley College of Engineering January 2012  –  May 2012  (5 months) Berkeley, CA Worked with TA to assist students enrolled in The Beauty and Joy of Computer Science (CS10) with their lab assignments. Languages   Skills Java Python PHP MySQL CSS Smarty Eclipse HTML C JavaScript jQuery Solr Redis Programming Ruby Git Microsoft Office See 2+     See less Skills  Java Python PHP MySQL CSS Smarty Eclipse HTML C JavaScript jQuery Solr Redis Programming Ruby Git Microsoft Office See 2+     See less Java Python PHP MySQL CSS Smarty Eclipse HTML C JavaScript jQuery Solr Redis Programming Ruby Git Microsoft Office See 2+     See less Java Python PHP MySQL CSS Smarty Eclipse HTML C JavaScript jQuery Solr Redis Programming Ruby Git Microsoft Office See 2+     See less Education University of California, Berkeley Bachelor of Arts (B.A.),  Computer Science and Economics 2011  – 2015 Activities and Societies:  Acacia San Rafael High School 2007  – 2011 Activities and Societies:  Captain - Varsity Cross Country ,  Captain - Track & Field ,  First Chair Pianist - Jazz Band ,  First Chair Clarinet - Wind Ensemble ,  National Math Honors Society ,  National French Honors Society University of California, Berkeley Bachelor of Arts (B.A.),  Computer Science and Economics 2011  – 2015 Activities and Societies:  Acacia University of California, Berkeley Bachelor of Arts (B.A.),  Computer Science and Economics 2011  – 2015 Activities and Societies:  Acacia University of California, Berkeley Bachelor of Arts (B.A.),  Computer Science and Economics 2011  – 2015 Activities and Societies:  Acacia San Rafael High School 2007  – 2011 Activities and Societies:  Captain - Varsity Cross Country ,  Captain - Track & Field ,  First Chair Pianist - Jazz Band ,  First Chair Clarinet - Wind Ensemble ,  National Math Honors Society ,  National French Honors Society San Rafael High School 2007  – 2011 Activities and Societies:  Captain - Varsity Cross Country ,  Captain - Track & Field ,  First Chair Pianist - Jazz Band ,  First Chair Clarinet - Wind Ensemble ,  National Math Honors Society ,  National French Honors Society San Rafael High School 2007  – 2011 Activities and Societies:  Captain - Varsity Cross Country ,  Captain - Track & Field ,  First Chair Pianist - Jazz Band ,  First Chair Clarinet - Wind Ensemble ,  National Math Honors Society ,  National French Honors Society Honors & Awards ", "Experience Mechanical Engineering Intern Special Aerospace Services April 2012  – Present (3 years 5 months) Began design of motion simulator cockpit to simulate the flight of the “Dream Chaser,” \na crewed VTHL lifting-body spacecraft under development by the Sierra Nevada \nCorporation. Developed skills in project management, project presentation, cost \nanalysis, etc. with emphasis on CAD modeling using SolidWorks. \n- Conducted research on the safety and environmental records of oil, gas, and coal \nindustries operating throughout the Rocky Mountain, Canadian Rocky Mountain, and \nNorthwestern Midwest regions to begin subsidiary of SAS, Special Energy Services, a \ncompany that will provide system safety analysis consulting to large oil, gas, and coal \nindustries in the region. \n- Modeled parts and conducted advanced DOD research into the use of alternative jet fuels for use as rocket propellant. Engineering Intern Alpha Natural ResourcesDickenson County, VA April 2011  – Present (4 years 5 months) Learned the systems, equipment, processes and skills involved in coal mining \noperations. \n- Assisted underground coal electricians and mechanics in daily work. \n- Performed mining jobs such as roof bolting, scoop work and brattice building. Engineering Intern Special Aerospace Services June 2012  –  August 2012  (3 months) Engineering Intern Alpha Natural Resources May 2011  –  August 2011  (4 months) Swim Coach Alex Bulk January 2008  –  January 2010  (2 years 1 month) Coached the Ashburn Farm Swim Team, a community team for children who wish to \nswim at a competitive level. Lifeguard Ashburn Village Sports Pavilion March 2007  –  August 2009  (2 years 6 months) Mechanical Engineering Intern Special Aerospace Services April 2012  – Present (3 years 5 months) Began design of motion simulator cockpit to simulate the flight of the “Dream Chaser,” \na crewed VTHL lifting-body spacecraft under development by the Sierra Nevada \nCorporation. Developed skills in project management, project presentation, cost \nanalysis, etc. with emphasis on CAD modeling using SolidWorks. \n- Conducted research on the safety and environmental records of oil, gas, and coal \nindustries operating throughout the Rocky Mountain, Canadian Rocky Mountain, and \nNorthwestern Midwest regions to begin subsidiary of SAS, Special Energy Services, a \ncompany that will provide system safety analysis consulting to large oil, gas, and coal \nindustries in the region. \n- Modeled parts and conducted advanced DOD research into the use of alternative jet fuels for use as rocket propellant. Mechanical Engineering Intern Special Aerospace Services April 2012  – Present (3 years 5 months) Began design of motion simulator cockpit to simulate the flight of the “Dream Chaser,” \na crewed VTHL lifting-body spacecraft under development by the Sierra Nevada \nCorporation. Developed skills in project management, project presentation, cost \nanalysis, etc. with emphasis on CAD modeling using SolidWorks. \n- Conducted research on the safety and environmental records of oil, gas, and coal \nindustries operating throughout the Rocky Mountain, Canadian Rocky Mountain, and \nNorthwestern Midwest regions to begin subsidiary of SAS, Special Energy Services, a \ncompany that will provide system safety analysis consulting to large oil, gas, and coal \nindustries in the region. \n- Modeled parts and conducted advanced DOD research into the use of alternative jet fuels for use as rocket propellant. Engineering Intern Alpha Natural ResourcesDickenson County, VA April 2011  – Present (4 years 5 months) Learned the systems, equipment, processes and skills involved in coal mining \noperations. \n- Assisted underground coal electricians and mechanics in daily work. \n- Performed mining jobs such as roof bolting, scoop work and brattice building. Engineering Intern Alpha Natural ResourcesDickenson County, VA April 2011  – Present (4 years 5 months) Learned the systems, equipment, processes and skills involved in coal mining \noperations. \n- Assisted underground coal electricians and mechanics in daily work. \n- Performed mining jobs such as roof bolting, scoop work and brattice building. Engineering Intern Special Aerospace Services June 2012  –  August 2012  (3 months) Engineering Intern Special Aerospace Services June 2012  –  August 2012  (3 months) Engineering Intern Alpha Natural Resources May 2011  –  August 2011  (4 months) Engineering Intern Alpha Natural Resources May 2011  –  August 2011  (4 months) Swim Coach Alex Bulk January 2008  –  January 2010  (2 years 1 month) Coached the Ashburn Farm Swim Team, a community team for children who wish to \nswim at a competitive level. Swim Coach Alex Bulk January 2008  –  January 2010  (2 years 1 month) Coached the Ashburn Farm Swim Team, a community team for children who wish to \nswim at a competitive level. Lifeguard Ashburn Village Sports Pavilion March 2007  –  August 2009  (2 years 6 months) Lifeguard Ashburn Village Sports Pavilion March 2007  –  August 2009  (2 years 6 months) Skills CAD Solidworks Skills  CAD Solidworks CAD Solidworks CAD Solidworks Education Virginia Tech Bachelor of Science (BS),  Mechanical Engineering 2009  – 2014 Virginia Polytechnic Institute and State University B.S,  Mechanical Engineering Virginia Tech Bachelor of Science (BS),  Mechanical Engineering 2009  – 2014 Virginia Tech Bachelor of Science (BS),  Mechanical Engineering 2009  – 2014 Virginia Tech Bachelor of Science (BS),  Mechanical Engineering 2009  – 2014 Virginia Polytechnic Institute and State University B.S,  Mechanical Engineering Virginia Polytechnic Institute and State University B.S,  Mechanical Engineering Virginia Polytechnic Institute and State University B.S,  Mechanical Engineering ", "Experience Mechanical Engineering Intern Lockheed Martin May 2015  – Present (4 months) Mechanical Engineering Intern LyondellBasell January 2015  – Present (8 months) Mansfield, Texas Mechanical Engineering Intern AAF International (American Air Filter) June 2014  –  December 2014  (7 months) Fayetteville, Arkansas Mechanical Engineering Intern Lockheed Martin January 2014  –  June 2014  (6 months) Camden, Arkansas Mechanical Engineering Intern Lockheed Martin May 2015  – Present (4 months) Mechanical Engineering Intern Lockheed Martin May 2015  – Present (4 months) Mechanical Engineering Intern LyondellBasell January 2015  – Present (8 months) Mansfield, Texas Mechanical Engineering Intern LyondellBasell January 2015  – Present (8 months) Mansfield, Texas Mechanical Engineering Intern AAF International (American Air Filter) June 2014  –  December 2014  (7 months) Fayetteville, Arkansas Mechanical Engineering Intern AAF International (American Air Filter) June 2014  –  December 2014  (7 months) Fayetteville, Arkansas Mechanical Engineering Intern Lockheed Martin January 2014  –  June 2014  (6 months) Camden, Arkansas Mechanical Engineering Intern Lockheed Martin January 2014  –  June 2014  (6 months) Camden, Arkansas Skills Microsoft Office Customer Service Microsoft Word PowerPoint Public Speaking Project Management Leadership Mechanical Engineering Engineering Manufacturing SolidWorks Matlab CAD AutoCAD PTC Creo Project Engineering Lean Manufacturing Project Planning Machining See 4+     See less Skills  Microsoft Office Customer Service Microsoft Word PowerPoint Public Speaking Project Management Leadership Mechanical Engineering Engineering Manufacturing SolidWorks Matlab CAD AutoCAD PTC Creo Project Engineering Lean Manufacturing Project Planning Machining See 4+     See less Microsoft Office Customer Service Microsoft Word PowerPoint Public Speaking Project Management Leadership Mechanical Engineering Engineering Manufacturing SolidWorks Matlab CAD AutoCAD PTC Creo Project Engineering Lean Manufacturing Project Planning Machining See 4+     See less Microsoft Office Customer Service Microsoft Word PowerPoint Public Speaking Project Management Leadership Mechanical Engineering Engineering Manufacturing SolidWorks Matlab CAD AutoCAD PTC Creo Project Engineering Lean Manufacturing Project Planning Machining See 4+     See less Education University of Arkansas Mechanical Engineering,  Mechanical Engineering 2010  – 2016 University of Arkansas Mechanical Engineering,  Mechanical Engineering 2010  – 2016 University of Arkansas Mechanical Engineering,  Mechanical Engineering 2010  – 2016 University of Arkansas Mechanical Engineering,  Mechanical Engineering 2010  – 2016 ", "Experience Software Engineering Intern Apple May 2015  – Present (4 months) Cupertino, California Cloud Infrastructure Engineering Software Engineering Intern Google February 2015  –  May 2015  (4 months) Mountain View, CA Network Systems \n \nhttp://www.grpc.io \nhttps://github.com/grpc/grpc-java Google Summer of Code with Netty @twitter Google Summer of Code June 2014  –  August 2014  (3 months) Munich Area, Germany Software Engineering Intern Microsoft September 2013  –  December 2013  (4 months) Dublin, Ireland Office International Publishing Group Software Engineering Intern KNAPP AG August 2012  –  October 2012  (3 months) Graz, Austria Software Engineering Intern KNAPP AG March 2012  –  April 2012  (2 months) Graz, Austria Software Engineering Intern Infonova February 2011  –  July 2011  (6 months) Graz, Austria Software Engineering Intern Apple May 2015  – Present (4 months) Cupertino, California Cloud Infrastructure Engineering Software Engineering Intern Apple May 2015  – Present (4 months) Cupertino, California Cloud Infrastructure Engineering Software Engineering Intern Google February 2015  –  May 2015  (4 months) Mountain View, CA Network Systems \n \nhttp://www.grpc.io \nhttps://github.com/grpc/grpc-java Software Engineering Intern Google February 2015  –  May 2015  (4 months) Mountain View, CA Network Systems \n \nhttp://www.grpc.io \nhttps://github.com/grpc/grpc-java Google Summer of Code with Netty @twitter Google Summer of Code June 2014  –  August 2014  (3 months) Munich Area, Germany Google Summer of Code with Netty @twitter Google Summer of Code June 2014  –  August 2014  (3 months) Munich Area, Germany Software Engineering Intern Microsoft September 2013  –  December 2013  (4 months) Dublin, Ireland Office International Publishing Group Software Engineering Intern Microsoft September 2013  –  December 2013  (4 months) Dublin, Ireland Office International Publishing Group Software Engineering Intern KNAPP AG August 2012  –  October 2012  (3 months) Graz, Austria Software Engineering Intern KNAPP AG August 2012  –  October 2012  (3 months) Graz, Austria Software Engineering Intern KNAPP AG March 2012  –  April 2012  (2 months) Graz, Austria Software Engineering Intern KNAPP AG March 2012  –  April 2012  (2 months) Graz, Austria Software Engineering Intern Infonova February 2011  –  July 2011  (6 months) Graz, Austria Software Engineering Intern Infonova February 2011  –  July 2011  (6 months) Graz, Austria Skills Software Engineering Skills  Software Engineering Software Engineering Software Engineering Education Technische Universität München Bachelor of Science (B.Sc.),  Computer Science 2011  – 2015 Technische Universität München Bachelor of Science (B.Sc.),  Computer Science 2011  – 2015 Technische Universität München Bachelor of Science (B.Sc.),  Computer Science 2011  – 2015 Technische Universität München Bachelor of Science (B.Sc.),  Computer Science 2011  – 2015 ", "Experience Mechanical Engineering Intern ASRC Federal April 2015  – Present (5 months) West Virginia Robotic Technology Center, Whitehall, WV Mechanical Engineering Intern supporting the West Virginia Robotic Technology Center through Goddard Space Flight Center's Satellite Servicing Capabilities Office. Project Support, Robot Operations, Metrology and Interferometry, Software Engineering.  Mechanical Engineering Intern LUSA Associates November 2013  –  April 2015  (1 year 6 months) West Virginia Robotic Technology Center, Whitehall, WV/NASA-GSFC, Greenbelt, MD Mechanical Engineering Intern supporting Goddard Space Flight Center's Satellite Servicing Capabilities Office and West Virginia Robotic Technology Center.  Mechanical Engineering Intern TRAX International Corporation May 2013  –  November 2013  (7 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Logistics, Robot Operations, Metrology and Interferometry.  Mechanical Engineering Intern TRAX International Corporation May 2012  –  August 2012  (4 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Robot Operations, Metrology and Interferometry.  Mechanical Engineering Intern TRAX International Corporation March 2011  –  August 2011  (6 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Logistics, Robot Operations, Metrology and Interferometry Intern/Volunteer Volunteer - NASA - GSFC - Hubble Space Telescope Flight Systems and Servicing June 2008  –  June 2009  (1 year 1 month) Greenbelt, MD Volunteer for Goddard Space Flight Center's Hubble Space Telescope Flight Systems and Servicing. I provided project and logistic support.  Mechanical Engineering Intern ASRC Federal April 2015  – Present (5 months) West Virginia Robotic Technology Center, Whitehall, WV Mechanical Engineering Intern supporting the West Virginia Robotic Technology Center through Goddard Space Flight Center's Satellite Servicing Capabilities Office. Project Support, Robot Operations, Metrology and Interferometry, Software Engineering.  Mechanical Engineering Intern ASRC Federal April 2015  – Present (5 months) West Virginia Robotic Technology Center, Whitehall, WV Mechanical Engineering Intern supporting the West Virginia Robotic Technology Center through Goddard Space Flight Center's Satellite Servicing Capabilities Office. Project Support, Robot Operations, Metrology and Interferometry, Software Engineering.  Mechanical Engineering Intern LUSA Associates November 2013  –  April 2015  (1 year 6 months) West Virginia Robotic Technology Center, Whitehall, WV/NASA-GSFC, Greenbelt, MD Mechanical Engineering Intern supporting Goddard Space Flight Center's Satellite Servicing Capabilities Office and West Virginia Robotic Technology Center.  Mechanical Engineering Intern LUSA Associates November 2013  –  April 2015  (1 year 6 months) West Virginia Robotic Technology Center, Whitehall, WV/NASA-GSFC, Greenbelt, MD Mechanical Engineering Intern supporting Goddard Space Flight Center's Satellite Servicing Capabilities Office and West Virginia Robotic Technology Center.  Mechanical Engineering Intern TRAX International Corporation May 2013  –  November 2013  (7 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Logistics, Robot Operations, Metrology and Interferometry.  Mechanical Engineering Intern TRAX International Corporation May 2013  –  November 2013  (7 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Logistics, Robot Operations, Metrology and Interferometry.  Mechanical Engineering Intern TRAX International Corporation May 2012  –  August 2012  (4 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Robot Operations, Metrology and Interferometry.  Mechanical Engineering Intern TRAX International Corporation May 2012  –  August 2012  (4 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Robot Operations, Metrology and Interferometry.  Mechanical Engineering Intern TRAX International Corporation March 2011  –  August 2011  (6 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Logistics, Robot Operations, Metrology and Interferometry Mechanical Engineering Intern TRAX International Corporation March 2011  –  August 2011  (6 months) NASA Goddard Space Flight Center, Greenbelt, MD, 20771 Project Support, Logistics, Robot Operations, Metrology and Interferometry Intern/Volunteer Volunteer - NASA - GSFC - Hubble Space Telescope Flight Systems and Servicing June 2008  –  June 2009  (1 year 1 month) Greenbelt, MD Volunteer for Goddard Space Flight Center's Hubble Space Telescope Flight Systems and Servicing. I provided project and logistic support.  Intern/Volunteer Volunteer - NASA - GSFC - Hubble Space Telescope Flight Systems and Servicing June 2008  –  June 2009  (1 year 1 month) Greenbelt, MD Volunteer for Goddard Space Flight Center's Hubble Space Telescope Flight Systems and Servicing. I provided project and logistic support.  Skills Interferometry Metrology Windows Linux Spatial Analyzer SolidWorks MatLab Matlab Mechanical Engineering Skills  Interferometry Metrology Windows Linux Spatial Analyzer SolidWorks MatLab Matlab Mechanical Engineering Interferometry Metrology Windows Linux Spatial Analyzer SolidWorks MatLab Matlab Mechanical Engineering Interferometry Metrology Windows Linux Spatial Analyzer SolidWorks MatLab Matlab Mechanical Engineering Education West Virginia University Mechanical and Aerospace Engineering 2011  – 2016 Four year trumpet player in The Pride of West Virginia Mountaineer Marching Band.  Activities and Societies:  WVU Pride of West Virginia Marching Band ,  WVU Formula SAE Race Team ,  AIAA WVU Chapter West Virginia University Mechanical and Aerospace Engineering 2011  – 2016 Four year trumpet player in The Pride of West Virginia Mountaineer Marching Band.  Activities and Societies:  WVU Pride of West Virginia Marching Band ,  WVU Formula SAE Race Team ,  AIAA WVU Chapter West Virginia University Mechanical and Aerospace Engineering 2011  – 2016 Four year trumpet player in The Pride of West Virginia Mountaineer Marching Band.  Activities and Societies:  WVU Pride of West Virginia Marching Band ,  WVU Formula SAE Race Team ,  AIAA WVU Chapter West Virginia University Mechanical and Aerospace Engineering 2011  – 2016 Four year trumpet player in The Pride of West Virginia Mountaineer Marching Band.  Activities and Societies:  WVU Pride of West Virginia Marching Band ,  WVU Formula SAE Race Team ,  AIAA WVU Chapter ", "Experience Electrical Engineering Intern LPA Inc. June 2015  – Present (3 months) Electrical Engineering Intern Q3 Inc June 2014  –  August 2014  (3 months) Huntington Beach, California - Completed multiple design projects in a team environment setting with strict deadlines. \n- Calculated power loads and created panel schedules, single-line diagrams, and electrical plans. \n- Created preliminary fire alarm design for a twenty story high-rise apartment building. \n- Researched standards and codes within the industry such as the NEC and LAFD fire alarm codes. CAD Design Intern PlanNet Consulting June 2014  –  August 2014  (3 months) Brea, California - Collaborated closely with CAD team and consultants to adhere by project deadlines. \n- Completed IT designs that incorporated low-voltage, telecom, security, and audio-visual devices for universities, corporations, and city entities. Electrical Engineering Intern American RENOLIT Corporation January 2014  –  June 2014  (6 months) - Analyzed the power distribution of the facility and proposed possible design improvements. \n- Organized meetings with several contractors for project proposals upwards of $380K. \n- Explored energy saving solutions to mitigate the company’s $1 million annual energy costs. \n- Implemented cost-effective strategies after multiple meetings with Southern California Edison.  \n- Presented LED retrofit project with an estimated annual savings of $50K to VP of Operations. Assistant to Administrative Manager USC Department of Molecular and Computational Biology August 2012  –  December 2013  (1 year 5 months) Electrical Engineering Intern P2S Engineering, Inc. May 2013  –  August 2013  (4 months) -Worked on a team with a project manager and other group members \n-Completed panel schedules and calculated power loads using Excel \n-Helped ensure compliance with Title 24 electrical code based on floor  \nplans and cut sheets  \n-Created floor plans of lighting and power from architectural drawings  \nusing AutoCAD \n-Completed project specifications based on client needs to be sent to the  \ncontractor Peer Tutor Marymount California University August 2011  –  May 2012  (10 months) - Assisted students with math up to Calculus II, Physics and Chemistry \n- Helped manage front reception desk \n- Proctored exams for students with learning disabilities Tutor Boys & Girls Club April 2010  –  June 2011  (1 year 3 months) -Assisted high school students with math and science \n-Helped inner-city students learn about college bound programs and how to apply to college Engineering Intern Black & Veatch July 2010  –  August 2010  (2 months) -Worked with other interns to analyze data of current company projects \n-Researched challenges in the field and presented possible solutions to the office Electrical Engineering Intern LPA Inc. June 2015  – Present (3 months) Electrical Engineering Intern LPA Inc. June 2015  – Present (3 months) Electrical Engineering Intern Q3 Inc June 2014  –  August 2014  (3 months) Huntington Beach, California - Completed multiple design projects in a team environment setting with strict deadlines. \n- Calculated power loads and created panel schedules, single-line diagrams, and electrical plans. \n- Created preliminary fire alarm design for a twenty story high-rise apartment building. \n- Researched standards and codes within the industry such as the NEC and LAFD fire alarm codes. Electrical Engineering Intern Q3 Inc June 2014  –  August 2014  (3 months) Huntington Beach, California - Completed multiple design projects in a team environment setting with strict deadlines. \n- Calculated power loads and created panel schedules, single-line diagrams, and electrical plans. \n- Created preliminary fire alarm design for a twenty story high-rise apartment building. \n- Researched standards and codes within the industry such as the NEC and LAFD fire alarm codes. CAD Design Intern PlanNet Consulting June 2014  –  August 2014  (3 months) Brea, California - Collaborated closely with CAD team and consultants to adhere by project deadlines. \n- Completed IT designs that incorporated low-voltage, telecom, security, and audio-visual devices for universities, corporations, and city entities. CAD Design Intern PlanNet Consulting June 2014  –  August 2014  (3 months) Brea, California - Collaborated closely with CAD team and consultants to adhere by project deadlines. \n- Completed IT designs that incorporated low-voltage, telecom, security, and audio-visual devices for universities, corporations, and city entities. Electrical Engineering Intern American RENOLIT Corporation January 2014  –  June 2014  (6 months) - Analyzed the power distribution of the facility and proposed possible design improvements. \n- Organized meetings with several contractors for project proposals upwards of $380K. \n- Explored energy saving solutions to mitigate the company’s $1 million annual energy costs. \n- Implemented cost-effective strategies after multiple meetings with Southern California Edison.  \n- Presented LED retrofit project with an estimated annual savings of $50K to VP of Operations. Electrical Engineering Intern American RENOLIT Corporation January 2014  –  June 2014  (6 months) - Analyzed the power distribution of the facility and proposed possible design improvements. \n- Organized meetings with several contractors for project proposals upwards of $380K. \n- Explored energy saving solutions to mitigate the company’s $1 million annual energy costs. \n- Implemented cost-effective strategies after multiple meetings with Southern California Edison.  \n- Presented LED retrofit project with an estimated annual savings of $50K to VP of Operations. Assistant to Administrative Manager USC Department of Molecular and Computational Biology August 2012  –  December 2013  (1 year 5 months) Assistant to Administrative Manager USC Department of Molecular and Computational Biology August 2012  –  December 2013  (1 year 5 months) Electrical Engineering Intern P2S Engineering, Inc. May 2013  –  August 2013  (4 months) -Worked on a team with a project manager and other group members \n-Completed panel schedules and calculated power loads using Excel \n-Helped ensure compliance with Title 24 electrical code based on floor  \nplans and cut sheets  \n-Created floor plans of lighting and power from architectural drawings  \nusing AutoCAD \n-Completed project specifications based on client needs to be sent to the  \ncontractor Electrical Engineering Intern P2S Engineering, Inc. May 2013  –  August 2013  (4 months) -Worked on a team with a project manager and other group members \n-Completed panel schedules and calculated power loads using Excel \n-Helped ensure compliance with Title 24 electrical code based on floor  \nplans and cut sheets  \n-Created floor plans of lighting and power from architectural drawings  \nusing AutoCAD \n-Completed project specifications based on client needs to be sent to the  \ncontractor Peer Tutor Marymount California University August 2011  –  May 2012  (10 months) - Assisted students with math up to Calculus II, Physics and Chemistry \n- Helped manage front reception desk \n- Proctored exams for students with learning disabilities Peer Tutor Marymount California University August 2011  –  May 2012  (10 months) - Assisted students with math up to Calculus II, Physics and Chemistry \n- Helped manage front reception desk \n- Proctored exams for students with learning disabilities Tutor Boys & Girls Club April 2010  –  June 2011  (1 year 3 months) -Assisted high school students with math and science \n-Helped inner-city students learn about college bound programs and how to apply to college Tutor Boys & Girls Club April 2010  –  June 2011  (1 year 3 months) -Assisted high school students with math and science \n-Helped inner-city students learn about college bound programs and how to apply to college Engineering Intern Black & Veatch July 2010  –  August 2010  (2 months) -Worked with other interns to analyze data of current company projects \n-Researched challenges in the field and presented possible solutions to the office Engineering Intern Black & Veatch July 2010  –  August 2010  (2 months) -Worked with other interns to analyze data of current company projects \n-Researched challenges in the field and presented possible solutions to the office Languages Spanish Professional working proficiency Spanish Professional working proficiency Spanish Professional working proficiency Professional working proficiency Skills Microsoft Excel PowerPoint Microsoft Word Teamwork Windows Microsoft Office Matlab AutoCAD Xilinx Data Analysis C Public Speaking VHDL Tutoring ModelSim C++ Linux Ubuntu VMware VirtualBox FPGA Logic Design Leadership Social Media Engineering MEP Design Power Generation Power Distribution Social Networking Editing See 15+     See less Skills  Microsoft Excel PowerPoint Microsoft Word Teamwork Windows Microsoft Office Matlab AutoCAD Xilinx Data Analysis C Public Speaking VHDL Tutoring ModelSim C++ Linux Ubuntu VMware VirtualBox FPGA Logic Design Leadership Social Media Engineering MEP Design Power Generation Power Distribution Social Networking Editing See 15+     See less Microsoft Excel PowerPoint Microsoft Word Teamwork Windows Microsoft Office Matlab AutoCAD Xilinx Data Analysis C Public Speaking VHDL Tutoring ModelSim C++ Linux Ubuntu VMware VirtualBox FPGA Logic Design Leadership Social Media Engineering MEP Design Power Generation Power Distribution Social Networking Editing See 15+     See less Microsoft Excel PowerPoint Microsoft Word Teamwork Windows Microsoft Office Matlab AutoCAD Xilinx Data Analysis C Public Speaking VHDL Tutoring ModelSim C++ Linux Ubuntu VMware VirtualBox FPGA Logic Design Leadership Social Media Engineering MEP Design Power Generation Power Distribution Social Networking Editing See 15+     See less Education University of Southern California Bachelor's Degree,  Electrical Engineering 2012  – 2015 Activities and Societies:  SHPE Comittee of Community Outreach ,  IEEE ,  SWE Marymount California University 2010  – 2012 Activities and Societies:  Vice President of Rotaract Club ,  Treasurer of Black Student Union ,  Student Orientation Staff Leader University of Southern California Bachelor's Degree,  Electrical Engineering 2012  – 2015 Activities and Societies:  SHPE Comittee of Community Outreach ,  IEEE ,  SWE University of Southern California Bachelor's Degree,  Electrical Engineering 2012  – 2015 Activities and Societies:  SHPE Comittee of Community Outreach ,  IEEE ,  SWE University of Southern California Bachelor's Degree,  Electrical Engineering 2012  – 2015 Activities and Societies:  SHPE Comittee of Community Outreach ,  IEEE ,  SWE Marymount California University 2010  – 2012 Activities and Societies:  Vice President of Rotaract Club ,  Treasurer of Black Student Union ,  Student Orientation Staff Leader Marymount California University 2010  – 2012 Activities and Societies:  Vice President of Rotaract Club ,  Treasurer of Black Student Union ,  Student Orientation Staff Leader Marymount California University 2010  – 2012 Activities and Societies:  Vice President of Rotaract Club ,  Treasurer of Black Student Union ,  Student Orientation Staff Leader ", "Summary Passionate, self-motivated software engineer with a drive to create innovative and high-quality solutions for all types of technical challenges. Summary Passionate, self-motivated software engineer with a drive to create innovative and high-quality solutions for all types of technical challenges. Passionate, self-motivated software engineer with a drive to create innovative and high-quality solutions for all types of technical challenges. Passionate, self-motivated software engineer with a drive to create innovative and high-quality solutions for all types of technical challenges. Experience Software Engineering Intern Microsoft May 2015  – Present (4 months) Redmond, WA Research Assistant University of North Carolina at Chapel Hill May 2014  – Present (1 year 4 months) Chapel Hill, NC • Worked with Dr. Kevin Jeffay and Dr. Jay Aikat to investigate active queue management strategies and their effects on Internet traffic \n• Designed and implemented experiments in both a university lab setting and as a part of the nationwide GENI research network \n• Wrote software to help analyze experimental data and draw meaningful conclusions Software Engineering Intern Netsertive May 2013  –  August 2013  (4 months) •\tResolved minor to highly complex defects and enhancements related to production-level PHP/JavaScript code, including priority 1 issues \n•\tDesigned Java applications to extract and analyze data from MySQL databases \n•\tRe-factored models, redesigned the UI, and improved SQL queries of internal software that experiences over 50,000 page views per day, enabling easier maintenance of future software updates and dramatically improving the performance and usability of the application \n•\tDesigned multiple database schemas \n•\tUtilized scrum methodology to support, communicate, and track project progress between multiple development and QA teams \n•\tLed architecture meetings to discuss and demo new code and features \n•\tGathered feature/user requirements, confirmed details with product owners, and presented new features and updates to management and the engineering team \n•\tReduced business violation errors from several hundred per day to 0 \n•\tTrained users on new features and acted as a liaison between the engineering, QA, product owners, sales, and account management teams \n•\tAssisted a client with the configuration of their Drupal website \n•\tWrote test cases and performed quality assurance tests across multiple platforms, browsers, and devices Software Engineering Intern Netsertive May 2012  –  August 2012  (4 months) Raleigh, NC • Wrote Java applications to pull and analyze data from MySQL databases \n• Participated in weekly architecture reviews and gathered requirements \n• Designed and presented user preferences and session handling features to the engineering team. These features were ultimately added and pushed to the production environment.  \n• Resolved minor to highly complex defects and enhancements related to production-level PHP/JavaScript code \n• Designed multiple database schemas \n• Wrote test cases and performed quality assurance tests \n \nSkills used: Ajax, Apache, Bugzilla, CodeIgniter Framework, CSS, Eclipse, HTML, Java, JavaScript, JQuery, JSON, Linux, Mac OS X, MVC, MySQL, PHP, SVN, Windows 7 Co-Founder and CTO Hubble November 2011  –  March 2012  (5 months) Chapel Hill, NC • Co-founded Hubble, an online healthcare information and application hub \n• Established a relationship between Hubble and the North Carolina Health Information Exchange \n• Established a relationship between Hubble and healthcare/fitness content providers \n \nSkills Used: Database Design Co-founder and CEO Tracon Technologies August 2007  –  August 2011  (4 years 1 month) NC • Co-founded Tracon Technologies \n• Developed Windows applications in C++ and QT4  \n• Developed Mac OS X applications in Objective-C, C++, and QT4 \n• Developed SearchAll, an all-in-one search utility, for iOS in Objective-C \n \nSkills Used: C++, iOS, Mac OS X, Objective-C, QT4, Windows Vista Software Engineering Intern OptoSonics, Inc. June 2010  –  August 2010  (3 months) Oriental, NC • Created and tested GPU-accelerated image processing applications. The functions of these applications ranged from applying false coloring to gray scale images to generating 3-dimensional movies from 2-dimensional image stacks. \n• Co-authored “Photoacoustic Angiography of the Breast,” published by Medical Physics on November 1, 2010 http://dx.doi.org/10.1118/1.3497677 \n \nSkills used: CUDA, Java, JCUDA, SVN, Visual Studio, Windows (XP, 7) Software Engineering Intern OptoSonics, Inc. June 2009  –  August 2009  (3 months) Oriental, NC •\tCreated and tested image processing applications that were demoed at a conference in San Francisco. The functions of these applications ranged from applying false coloring to gray scale images to generating 3-dimensional movies from 2-dimensional image stacks that could be rotated and examined for signs of cancer. \n \nSkills Used: Java, SVN, Visual Studio, Windows XP Software Engineering Intern Microsoft May 2015  – Present (4 months) Redmond, WA Software Engineering Intern Microsoft May 2015  – Present (4 months) Redmond, WA Research Assistant University of North Carolina at Chapel Hill May 2014  – Present (1 year 4 months) Chapel Hill, NC • Worked with Dr. Kevin Jeffay and Dr. Jay Aikat to investigate active queue management strategies and their effects on Internet traffic \n• Designed and implemented experiments in both a university lab setting and as a part of the nationwide GENI research network \n• Wrote software to help analyze experimental data and draw meaningful conclusions Research Assistant University of North Carolina at Chapel Hill May 2014  – Present (1 year 4 months) Chapel Hill, NC • Worked with Dr. Kevin Jeffay and Dr. Jay Aikat to investigate active queue management strategies and their effects on Internet traffic \n• Designed and implemented experiments in both a university lab setting and as a part of the nationwide GENI research network \n• Wrote software to help analyze experimental data and draw meaningful conclusions Software Engineering Intern Netsertive May 2013  –  August 2013  (4 months) •\tResolved minor to highly complex defects and enhancements related to production-level PHP/JavaScript code, including priority 1 issues \n•\tDesigned Java applications to extract and analyze data from MySQL databases \n•\tRe-factored models, redesigned the UI, and improved SQL queries of internal software that experiences over 50,000 page views per day, enabling easier maintenance of future software updates and dramatically improving the performance and usability of the application \n•\tDesigned multiple database schemas \n•\tUtilized scrum methodology to support, communicate, and track project progress between multiple development and QA teams \n•\tLed architecture meetings to discuss and demo new code and features \n•\tGathered feature/user requirements, confirmed details with product owners, and presented new features and updates to management and the engineering team \n•\tReduced business violation errors from several hundred per day to 0 \n•\tTrained users on new features and acted as a liaison between the engineering, QA, product owners, sales, and account management teams \n•\tAssisted a client with the configuration of their Drupal website \n•\tWrote test cases and performed quality assurance tests across multiple platforms, browsers, and devices Software Engineering Intern Netsertive May 2013  –  August 2013  (4 months) •\tResolved minor to highly complex defects and enhancements related to production-level PHP/JavaScript code, including priority 1 issues \n•\tDesigned Java applications to extract and analyze data from MySQL databases \n•\tRe-factored models, redesigned the UI, and improved SQL queries of internal software that experiences over 50,000 page views per day, enabling easier maintenance of future software updates and dramatically improving the performance and usability of the application \n•\tDesigned multiple database schemas \n•\tUtilized scrum methodology to support, communicate, and track project progress between multiple development and QA teams \n•\tLed architecture meetings to discuss and demo new code and features \n•\tGathered feature/user requirements, confirmed details with product owners, and presented new features and updates to management and the engineering team \n•\tReduced business violation errors from several hundred per day to 0 \n•\tTrained users on new features and acted as a liaison between the engineering, QA, product owners, sales, and account management teams \n•\tAssisted a client with the configuration of their Drupal website \n•\tWrote test cases and performed quality assurance tests across multiple platforms, browsers, and devices Software Engineering Intern Netsertive May 2012  –  August 2012  (4 months) Raleigh, NC • Wrote Java applications to pull and analyze data from MySQL databases \n• Participated in weekly architecture reviews and gathered requirements \n• Designed and presented user preferences and session handling features to the engineering team. These features were ultimately added and pushed to the production environment.  \n• Resolved minor to highly complex defects and enhancements related to production-level PHP/JavaScript code \n• Designed multiple database schemas \n• Wrote test cases and performed quality assurance tests \n \nSkills used: Ajax, Apache, Bugzilla, CodeIgniter Framework, CSS, Eclipse, HTML, Java, JavaScript, JQuery, JSON, Linux, Mac OS X, MVC, MySQL, PHP, SVN, Windows 7 Software Engineering Intern Netsertive May 2012  –  August 2012  (4 months) Raleigh, NC • Wrote Java applications to pull and analyze data from MySQL databases \n• Participated in weekly architecture reviews and gathered requirements \n• Designed and presented user preferences and session handling features to the engineering team. These features were ultimately added and pushed to the production environment.  \n• Resolved minor to highly complex defects and enhancements related to production-level PHP/JavaScript code \n• Designed multiple database schemas \n• Wrote test cases and performed quality assurance tests \n \nSkills used: Ajax, Apache, Bugzilla, CodeIgniter Framework, CSS, Eclipse, HTML, Java, JavaScript, JQuery, JSON, Linux, Mac OS X, MVC, MySQL, PHP, SVN, Windows 7 Co-Founder and CTO Hubble November 2011  –  March 2012  (5 months) Chapel Hill, NC • Co-founded Hubble, an online healthcare information and application hub \n• Established a relationship between Hubble and the North Carolina Health Information Exchange \n• Established a relationship between Hubble and healthcare/fitness content providers \n \nSkills Used: Database Design Co-Founder and CTO Hubble November 2011  –  March 2012  (5 months) Chapel Hill, NC • Co-founded Hubble, an online healthcare information and application hub \n• Established a relationship between Hubble and the North Carolina Health Information Exchange \n• Established a relationship between Hubble and healthcare/fitness content providers \n \nSkills Used: Database Design Co-founder and CEO Tracon Technologies August 2007  –  August 2011  (4 years 1 month) NC • Co-founded Tracon Technologies \n• Developed Windows applications in C++ and QT4  \n• Developed Mac OS X applications in Objective-C, C++, and QT4 \n• Developed SearchAll, an all-in-one search utility, for iOS in Objective-C \n \nSkills Used: C++, iOS, Mac OS X, Objective-C, QT4, Windows Vista Co-founder and CEO Tracon Technologies August 2007  –  August 2011  (4 years 1 month) NC • Co-founded Tracon Technologies \n• Developed Windows applications in C++ and QT4  \n• Developed Mac OS X applications in Objective-C, C++, and QT4 \n• Developed SearchAll, an all-in-one search utility, for iOS in Objective-C \n \nSkills Used: C++, iOS, Mac OS X, Objective-C, QT4, Windows Vista Software Engineering Intern OptoSonics, Inc. June 2010  –  August 2010  (3 months) Oriental, NC • Created and tested GPU-accelerated image processing applications. The functions of these applications ranged from applying false coloring to gray scale images to generating 3-dimensional movies from 2-dimensional image stacks. \n• Co-authored “Photoacoustic Angiography of the Breast,” published by Medical Physics on November 1, 2010 http://dx.doi.org/10.1118/1.3497677 \n \nSkills used: CUDA, Java, JCUDA, SVN, Visual Studio, Windows (XP, 7) Software Engineering Intern OptoSonics, Inc. June 2010  –  August 2010  (3 months) Oriental, NC • Created and tested GPU-accelerated image processing applications. The functions of these applications ranged from applying false coloring to gray scale images to generating 3-dimensional movies from 2-dimensional image stacks. \n• Co-authored “Photoacoustic Angiography of the Breast,” published by Medical Physics on November 1, 2010 http://dx.doi.org/10.1118/1.3497677 \n \nSkills used: CUDA, Java, JCUDA, SVN, Visual Studio, Windows (XP, 7) Software Engineering Intern OptoSonics, Inc. June 2009  –  August 2009  (3 months) Oriental, NC •\tCreated and tested image processing applications that were demoed at a conference in San Francisco. The functions of these applications ranged from applying false coloring to gray scale images to generating 3-dimensional movies from 2-dimensional image stacks that could be rotated and examined for signs of cancer. \n \nSkills Used: Java, SVN, Visual Studio, Windows XP Software Engineering Intern OptoSonics, Inc. June 2009  –  August 2009  (3 months) Oriental, NC •\tCreated and tested image processing applications that were demoed at a conference in San Francisco. The functions of these applications ranged from applying false coloring to gray scale images to generating 3-dimensional movies from 2-dimensional image stacks that could be rotated and examined for signs of cancer. \n \nSkills Used: Java, SVN, Visual Studio, Windows XP Skills Apache Java AJAX jQuery PHP JavaScript CodeIgniter CSS HTML JSON Linux Software Development C Python OS X C++ MVC Architecture Objective-C Ruby on Rails XHTML XML Eclipse MySQL CUDA JCUDA LaTeX QT4 Unix Bash Scripts JIRA Agile Methodologies Object Oriented Design Scrum SVN Architecture Review Database Schema Design Quality Assurance User Training Requirements Gathering Feature Design Test Case Design See 25+     See less Skills  Apache Java AJAX jQuery PHP JavaScript CodeIgniter CSS HTML JSON Linux Software Development C Python OS X C++ MVC Architecture Objective-C Ruby on Rails XHTML XML Eclipse MySQL CUDA JCUDA LaTeX QT4 Unix Bash Scripts JIRA Agile Methodologies Object Oriented Design Scrum SVN Architecture Review Database Schema Design Quality Assurance User Training Requirements Gathering Feature Design Test Case Design See 25+     See less Apache Java AJAX jQuery PHP JavaScript CodeIgniter CSS HTML JSON Linux Software Development C Python OS X C++ MVC Architecture Objective-C Ruby on Rails XHTML XML Eclipse MySQL CUDA JCUDA LaTeX QT4 Unix Bash Scripts JIRA Agile Methodologies Object Oriented Design Scrum SVN Architecture Review Database Schema Design Quality Assurance User Training Requirements Gathering Feature Design Test Case Design See 25+     See less Apache Java AJAX jQuery PHP JavaScript CodeIgniter CSS HTML JSON Linux Software Development C Python OS X C++ MVC Architecture Objective-C Ruby on Rails XHTML XML Eclipse MySQL CUDA JCUDA LaTeX QT4 Unix Bash Scripts JIRA Agile Methodologies Object Oriented Design Scrum SVN Architecture Review Database Schema Design Quality Assurance User Training Requirements Gathering Feature Design Test Case Design See 25+     See less Education University of North Carolina at Chapel Hill BS in Computer Science,  Computer Science 2011  – 2015 North Carolina School of Science and Mathematics General Education,  Computer Science 2009  – 2011 University of North Carolina at Chapel Hill BS in Computer Science,  Computer Science 2011  – 2015 University of North Carolina at Chapel Hill BS in Computer Science,  Computer Science 2011  – 2015 University of North Carolina at Chapel Hill BS in Computer Science,  Computer Science 2011  – 2015 North Carolina School of Science and Mathematics General Education,  Computer Science 2009  – 2011 North Carolina School of Science and Mathematics General Education,  Computer Science 2009  – 2011 North Carolina School of Science and Mathematics General Education,  Computer Science 2009  – 2011 Honors & Awards Eagle Scout Boy Scout Troop 13 • Member of the Order of the Arrow, Boy Scout's only nationally recognized honor society, and earned my Eagle Scout through Troop 13 in New Bern, NC \n \n• Eagle Scout project consisted of building four 12 foot by 12 foot shade structures for my local YMCA Published In Medical Physics Medical Physics November 2010 • Co-authored \"Photoacoustic Angiography of the Breast.\" The paper was published in Medical Physics and the abstract can be found here: http://dx.doi.org/10.1118/1.3497677. Department of Applied Sciences Award North Carolina School of Science and Mathematics May 2011 • Received this departmental award for my dedication to, and success in, applied sciences courses at the North Carolina School of Science and Mathematics List of Commended Students National Merit Scholarship Program 2009 • Appointed to the National Merit Scholarship Program's List of Commended Students in 2009 2nd Place at Regional Speech Competition American Legion National High School Oratorical Contest February 2008 • Delivered a 10 minute speech on the U.S. Constitution from memory \n \n• Spoke for 5 minutes on a randomly selected prompt 3rd Degree Black Belt American Taekwondo Association 2005 • Practiced martial arts with the American Taekwondo Association for 7.5 years and achieved the rank of 3rd Degree Black Belt by age 12 Department of Applied Sciences Award from the North Carolina School of Science and Mathematics North Carolina School of Science and Mathematics 2011 • Received the Department of Applied Sciences Award for my academic and extracurricular achievements in the areas of computer science and engineering Eagle Scout Boy Scout Troop 13 • Member of the Order of the Arrow, Boy Scout's only nationally recognized honor society, and earned my Eagle Scout through Troop 13 in New Bern, NC \n \n• Eagle Scout project consisted of building four 12 foot by 12 foot shade structures for my local YMCA Eagle Scout Boy Scout Troop 13 • Member of the Order of the Arrow, Boy Scout's only nationally recognized honor society, and earned my Eagle Scout through Troop 13 in New Bern, NC \n \n• Eagle Scout project consisted of building four 12 foot by 12 foot shade structures for my local YMCA Eagle Scout Boy Scout Troop 13 • Member of the Order of the Arrow, Boy Scout's only nationally recognized honor society, and earned my Eagle Scout through Troop 13 in New Bern, NC \n \n• Eagle Scout project consisted of building four 12 foot by 12 foot shade structures for my local YMCA Published In Medical Physics Medical Physics November 2010 • Co-authored \"Photoacoustic Angiography of the Breast.\" The paper was published in Medical Physics and the abstract can be found here: http://dx.doi.org/10.1118/1.3497677. Published In Medical Physics Medical Physics November 2010 • Co-authored \"Photoacoustic Angiography of the Breast.\" The paper was published in Medical Physics and the abstract can be found here: http://dx.doi.org/10.1118/1.3497677. Published In Medical Physics Medical Physics November 2010 • Co-authored \"Photoacoustic Angiography of the Breast.\" The paper was published in Medical Physics and the abstract can be found here: http://dx.doi.org/10.1118/1.3497677. Department of Applied Sciences Award North Carolina School of Science and Mathematics May 2011 • Received this departmental award for my dedication to, and success in, applied sciences courses at the North Carolina School of Science and Mathematics Department of Applied Sciences Award North Carolina School of Science and Mathematics May 2011 • Received this departmental award for my dedication to, and success in, applied sciences courses at the North Carolina School of Science and Mathematics Department of Applied Sciences Award North Carolina School of Science and Mathematics May 2011 • Received this departmental award for my dedication to, and success in, applied sciences courses at the North Carolina School of Science and Mathematics List of Commended Students National Merit Scholarship Program 2009 • Appointed to the National Merit Scholarship Program's List of Commended Students in 2009 List of Commended Students National Merit Scholarship Program 2009 • Appointed to the National Merit Scholarship Program's List of Commended Students in 2009 List of Commended Students National Merit Scholarship Program 2009 • Appointed to the National Merit Scholarship Program's List of Commended Students in 2009 2nd Place at Regional Speech Competition American Legion National High School Oratorical Contest February 2008 • Delivered a 10 minute speech on the U.S. Constitution from memory \n \n• Spoke for 5 minutes on a randomly selected prompt 2nd Place at Regional Speech Competition American Legion National High School Oratorical Contest February 2008 • Delivered a 10 minute speech on the U.S. Constitution from memory \n \n• Spoke for 5 minutes on a randomly selected prompt 2nd Place at Regional Speech Competition American Legion National High School Oratorical Contest February 2008 • Delivered a 10 minute speech on the U.S. Constitution from memory \n \n• Spoke for 5 minutes on a randomly selected prompt 3rd Degree Black Belt American Taekwondo Association 2005 • Practiced martial arts with the American Taekwondo Association for 7.5 years and achieved the rank of 3rd Degree Black Belt by age 12 3rd Degree Black Belt American Taekwondo Association 2005 • Practiced martial arts with the American Taekwondo Association for 7.5 years and achieved the rank of 3rd Degree Black Belt by age 12 3rd Degree Black Belt American Taekwondo Association 2005 • Practiced martial arts with the American Taekwondo Association for 7.5 years and achieved the rank of 3rd Degree Black Belt by age 12 Department of Applied Sciences Award from the North Carolina School of Science and Mathematics North Carolina School of Science and Mathematics 2011 • Received the Department of Applied Sciences Award for my academic and extracurricular achievements in the areas of computer science and engineering Department of Applied Sciences Award from the North Carolina School of Science and Mathematics North Carolina School of Science and Mathematics 2011 • Received the Department of Applied Sciences Award for my academic and extracurricular achievements in the areas of computer science and engineering Department of Applied Sciences Award from the North Carolina School of Science and Mathematics North Carolina School of Science and Mathematics 2011 • Received the Department of Applied Sciences Award for my academic and extracurricular achievements in the areas of computer science and engineering ", "Experience Software Engineering Intern Facebook June 2015  – Present (3 months) Software Engineering Intern MongoDB June 2014  –  August 2014  (3 months) Palo Alto Software Engineering Intern Google May 2013  –  August 2013  (4 months) MountainView Associate Developer Intern KIXEYE June 2012  –  October 2012  (5 months) Software Engineering Intern ON24 June 2011  –  August 2011  (3 months) Software Engineering Intern Key Curriculum June 2011  –  August 2011  (3 months) Software Engineering Intern ON24 June 2010  –  August 2010  (3 months) Software Engineering Intern Facebook June 2015  – Present (3 months) Software Engineering Intern Facebook June 2015  – Present (3 months) Software Engineering Intern MongoDB June 2014  –  August 2014  (3 months) Palo Alto Software Engineering Intern MongoDB June 2014  –  August 2014  (3 months) Palo Alto Software Engineering Intern Google May 2013  –  August 2013  (4 months) MountainView Software Engineering Intern Google May 2013  –  August 2013  (4 months) MountainView Associate Developer Intern KIXEYE June 2012  –  October 2012  (5 months) Associate Developer Intern KIXEYE June 2012  –  October 2012  (5 months) Software Engineering Intern ON24 June 2011  –  August 2011  (3 months) Software Engineering Intern ON24 June 2011  –  August 2011  (3 months) Software Engineering Intern Key Curriculum June 2011  –  August 2011  (3 months) Software Engineering Intern Key Curriculum June 2011  –  August 2011  (3 months) Software Engineering Intern ON24 June 2010  –  August 2010  (3 months) Software Engineering Intern ON24 June 2010  –  August 2010  (3 months) Skills Software Engineering Java ActionScript Game Development C++ JavaScript C# MySQL Android Development PHP Eclipse CSS Ruby on Rails Skills  Software Engineering Java ActionScript Game Development C++ JavaScript C# MySQL Android Development PHP Eclipse CSS Ruby on Rails Software Engineering Java ActionScript Game Development C++ JavaScript C# MySQL Android Development PHP Eclipse CSS Ruby on Rails Software Engineering Java ActionScript Game Development C++ JavaScript C# MySQL Android Development PHP Eclipse CSS Ruby on Rails Education University Of Illinois at Urbana-Champaign Computer Science 2012  – 2016 Lick-Wilmerding High School 2008  – 2012 University Of Illinois at Urbana-Champaign Computer Science 2012  – 2016 University Of Illinois at Urbana-Champaign Computer Science 2012  – 2016 University Of Illinois at Urbana-Champaign Computer Science 2012  – 2016 Lick-Wilmerding High School 2008  – 2012 Lick-Wilmerding High School 2008  – 2012 Lick-Wilmerding High School 2008  – 2012 ", "Experience Structural Engineering Intern II WSP | Parsons Brinckerhoff May 2015  – Present (4 months) Structural Engineering Intern WSP | Parsons Brinckerhoff May 2015  – Present (4 months) Structural Engineering Intern HNTB December 2014  –  January 2015  (2 months) Greater Boston Area Duties: \n-Participated in the inspection of complex bridges.  \n-Assembled bridge inspection and rating reports. \n-Drafted various bridge details. \n-Reviewed bridge erection calculations and methods. Structural Engineering Intern HNTB May 2014  –  September 2014  (5 months) Duties: \n-Participated in the inspection of complex bridges.  \n-Assembled bridge inspection and rating reports. \n-Drafted various bridge details. \n-Reviewed bridge erection calculations and methods. QA Analyst Autodesk June 2013  –  September 2013  (4 months) Greater Boston Area •\tProduced maps for incorporation into the released version of the software “Infraworks”.  \n•\tTested software functionalities and provided feedback to the user experience team. \n•\tMade presentations/recommendations regarding the project goals and objectives to executives. Structural Engineering Intern II WSP | Parsons Brinckerhoff May 2015  – Present (4 months) Structural Engineering Intern II WSP | Parsons Brinckerhoff May 2015  – Present (4 months) Structural Engineering Intern WSP | Parsons Brinckerhoff May 2015  – Present (4 months) Structural Engineering Intern WSP | Parsons Brinckerhoff May 2015  – Present (4 months) Structural Engineering Intern HNTB December 2014  –  January 2015  (2 months) Greater Boston Area Duties: \n-Participated in the inspection of complex bridges.  \n-Assembled bridge inspection and rating reports. \n-Drafted various bridge details. \n-Reviewed bridge erection calculations and methods. Structural Engineering Intern HNTB December 2014  –  January 2015  (2 months) Greater Boston Area Duties: \n-Participated in the inspection of complex bridges.  \n-Assembled bridge inspection and rating reports. \n-Drafted various bridge details. \n-Reviewed bridge erection calculations and methods. Structural Engineering Intern HNTB May 2014  –  September 2014  (5 months) Duties: \n-Participated in the inspection of complex bridges.  \n-Assembled bridge inspection and rating reports. \n-Drafted various bridge details. \n-Reviewed bridge erection calculations and methods. Structural Engineering Intern HNTB May 2014  –  September 2014  (5 months) Duties: \n-Participated in the inspection of complex bridges.  \n-Assembled bridge inspection and rating reports. \n-Drafted various bridge details. \n-Reviewed bridge erection calculations and methods. QA Analyst Autodesk June 2013  –  September 2013  (4 months) Greater Boston Area •\tProduced maps for incorporation into the released version of the software “Infraworks”.  \n•\tTested software functionalities and provided feedback to the user experience team. \n•\tMade presentations/recommendations regarding the project goals and objectives to executives. QA Analyst Autodesk June 2013  –  September 2013  (4 months) Greater Boston Area •\tProduced maps for incorporation into the released version of the software “Infraworks”.  \n•\tTested software functionalities and provided feedback to the user experience team. \n•\tMade presentations/recommendations regarding the project goals and objectives to executives. Languages English Native or bilingual proficiency Greek Native or bilingual proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency English Native or bilingual proficiency Greek Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Quality Assurance Software Quality... Test Automation Test Planning Test Cases Agile Methodologies Scrum Manual Testing AutoCAD Civil 3D AutoCAD Structural Analysis Bridge Civil Engineering CAD Structural Engineering Skills  Quality Assurance Software Quality... Test Automation Test Planning Test Cases Agile Methodologies Scrum Manual Testing AutoCAD Civil 3D AutoCAD Structural Analysis Bridge Civil Engineering CAD Structural Engineering Quality Assurance Software Quality... Test Automation Test Planning Test Cases Agile Methodologies Scrum Manual Testing AutoCAD Civil 3D AutoCAD Structural Analysis Bridge Civil Engineering CAD Structural Engineering Quality Assurance Software Quality... Test Automation Test Planning Test Cases Agile Methodologies Scrum Manual Testing AutoCAD Civil 3D AutoCAD Structural Analysis Bridge Civil Engineering CAD Structural Engineering Education University of Massachusetts, Amherst Bachelor of Science (B.S.),  Civil Engineering 2012  – 2016 Experience: Drafting various bridge details, Inspection of complex bridges, Quantity Calculations, Review of Construction Calculations/Methods, and assembly of rating and inspection reports for bridges \n \nEngineering classes: Intro to Engineering, Surveying and Measurements, Statics, Strength of Materials, Structural Analysis, Concrete Design, Fluid Mechanics, Transportation \nEngineering, Geometric Design of Roadways, Soil Mechanics Activities and Societies:  Commonwealth Honors College University of Massachusetts, Amherst Bachelor of Science (B.S.),  Civil Engineering 2012  – 2016 Experience: Drafting various bridge details, Inspection of complex bridges, Quantity Calculations, Review of Construction Calculations/Methods, and assembly of rating and inspection reports for bridges \n \nEngineering classes: Intro to Engineering, Surveying and Measurements, Statics, Strength of Materials, Structural Analysis, Concrete Design, Fluid Mechanics, Transportation \nEngineering, Geometric Design of Roadways, Soil Mechanics Activities and Societies:  Commonwealth Honors College University of Massachusetts, Amherst Bachelor of Science (B.S.),  Civil Engineering 2012  – 2016 Experience: Drafting various bridge details, Inspection of complex bridges, Quantity Calculations, Review of Construction Calculations/Methods, and assembly of rating and inspection reports for bridges \n \nEngineering classes: Intro to Engineering, Surveying and Measurements, Statics, Strength of Materials, Structural Analysis, Concrete Design, Fluid Mechanics, Transportation \nEngineering, Geometric Design of Roadways, Soil Mechanics Activities and Societies:  Commonwealth Honors College University of Massachusetts, Amherst Bachelor of Science (B.S.),  Civil Engineering 2012  – 2016 Experience: Drafting various bridge details, Inspection of complex bridges, Quantity Calculations, Review of Construction Calculations/Methods, and assembly of rating and inspection reports for bridges \n \nEngineering classes: Intro to Engineering, Surveying and Measurements, Statics, Strength of Materials, Structural Analysis, Concrete Design, Fluid Mechanics, Transportation \nEngineering, Geometric Design of Roadways, Soil Mechanics Activities and Societies:  Commonwealth Honors College ", "Experience Test Engineering Intern Texas Instruments June 2015  – Present (3 months) Santa Clara, California Electrical Engineering Intern Univ. of Virginia Center for Advanced Self-Powered Systems of Integrated Sensors and Technologies May 2014  –  July 2014  (3 months) Charlottesville, Virginia Area My research project involved analyzing various existing algorithms to derive respiratory rate from a PPG Signal for hardware implementation. Collected PPG signal data and contributed to implementing algorithm in Matlab to be used in a pulse oximeter. Electrical Engineering Intern California NanoSystems Institute at University of California Santa Barbara May 2013  –  July 2013  (3 months) Santa Barbara, California Area My research project involved modifying the internal control circuitry of an infusion-only syringe pump to allow for both infusion and withdrawal of fluids.The modifications involved replacing some of the existing control circuitry with a Texas Instruments MSP430 microcontroller, programmed the microcontroller, integrated the new microcontroller into the existing system syringe pump, and tested the new system. Gateway Math Tutor Santa Barbara City College September 2012  –  December 2012  (4 months) •\tTutoring for any math level from basic math to multivariable calculus Peer Advisor Santa Barbara City College/ EOPS DEPARTMENT June 2010  –  October 2012  (2 years 5 months) •\tWork with new students and inform them of the college’s resources \n•\tOutreach peer advisor in summer bridges program \n•\tRecognized for providing “Above and Beyond” Service to EOPS Students \n•\tOrganized files for the office Electrical Engineering Intern UC Berkeley Center for Energy Efficient Electronics Science August 2012  –  August 2012  (1 month) Berkeley, CA Received lectures on Electronic Circuits, Capacitors Signals, Semiconductors and applications. \nLearned soldering techniques and how to use specialized electrical equipment.  \nAssembled an audio power amplifier and took first place in a robot building competition. \nIntroduced to the mission and goals of the Center for Energy Efficient Electronics Science research projects. Electrical Engineering Intern UCLA Robotics Boot Camp and Competition February 2012  –  February 2012  (1 month) Greater Los Angeles Area Selected to participate in Robotics Bootcamp Workshop and Competition at UCLA where I received introductory lectures on Robotics. I assisted with assembly, wiring and programming of robot using BASIC STAMP. Phi Theta Kapa member SBCC 2009  –  2012  (3 years) Santa Barbara, California Area Test Engineering Intern Texas Instruments June 2015  – Present (3 months) Santa Clara, California Test Engineering Intern Texas Instruments June 2015  – Present (3 months) Santa Clara, California Electrical Engineering Intern Univ. of Virginia Center for Advanced Self-Powered Systems of Integrated Sensors and Technologies May 2014  –  July 2014  (3 months) Charlottesville, Virginia Area My research project involved analyzing various existing algorithms to derive respiratory rate from a PPG Signal for hardware implementation. Collected PPG signal data and contributed to implementing algorithm in Matlab to be used in a pulse oximeter. Electrical Engineering Intern Univ. of Virginia Center for Advanced Self-Powered Systems of Integrated Sensors and Technologies May 2014  –  July 2014  (3 months) Charlottesville, Virginia Area My research project involved analyzing various existing algorithms to derive respiratory rate from a PPG Signal for hardware implementation. Collected PPG signal data and contributed to implementing algorithm in Matlab to be used in a pulse oximeter. Electrical Engineering Intern California NanoSystems Institute at University of California Santa Barbara May 2013  –  July 2013  (3 months) Santa Barbara, California Area My research project involved modifying the internal control circuitry of an infusion-only syringe pump to allow for both infusion and withdrawal of fluids.The modifications involved replacing some of the existing control circuitry with a Texas Instruments MSP430 microcontroller, programmed the microcontroller, integrated the new microcontroller into the existing system syringe pump, and tested the new system. Electrical Engineering Intern California NanoSystems Institute at University of California Santa Barbara May 2013  –  July 2013  (3 months) Santa Barbara, California Area My research project involved modifying the internal control circuitry of an infusion-only syringe pump to allow for both infusion and withdrawal of fluids.The modifications involved replacing some of the existing control circuitry with a Texas Instruments MSP430 microcontroller, programmed the microcontroller, integrated the new microcontroller into the existing system syringe pump, and tested the new system. Gateway Math Tutor Santa Barbara City College September 2012  –  December 2012  (4 months) •\tTutoring for any math level from basic math to multivariable calculus Gateway Math Tutor Santa Barbara City College September 2012  –  December 2012  (4 months) •\tTutoring for any math level from basic math to multivariable calculus Peer Advisor Santa Barbara City College/ EOPS DEPARTMENT June 2010  –  October 2012  (2 years 5 months) •\tWork with new students and inform them of the college’s resources \n•\tOutreach peer advisor in summer bridges program \n•\tRecognized for providing “Above and Beyond” Service to EOPS Students \n•\tOrganized files for the office Peer Advisor Santa Barbara City College/ EOPS DEPARTMENT June 2010  –  October 2012  (2 years 5 months) •\tWork with new students and inform them of the college’s resources \n•\tOutreach peer advisor in summer bridges program \n•\tRecognized for providing “Above and Beyond” Service to EOPS Students \n•\tOrganized files for the office Electrical Engineering Intern UC Berkeley Center for Energy Efficient Electronics Science August 2012  –  August 2012  (1 month) Berkeley, CA Received lectures on Electronic Circuits, Capacitors Signals, Semiconductors and applications. \nLearned soldering techniques and how to use specialized electrical equipment.  \nAssembled an audio power amplifier and took first place in a robot building competition. \nIntroduced to the mission and goals of the Center for Energy Efficient Electronics Science research projects. Electrical Engineering Intern UC Berkeley Center for Energy Efficient Electronics Science August 2012  –  August 2012  (1 month) Berkeley, CA Received lectures on Electronic Circuits, Capacitors Signals, Semiconductors and applications. \nLearned soldering techniques and how to use specialized electrical equipment.  \nAssembled an audio power amplifier and took first place in a robot building competition. \nIntroduced to the mission and goals of the Center for Energy Efficient Electronics Science research projects. Electrical Engineering Intern UCLA Robotics Boot Camp and Competition February 2012  –  February 2012  (1 month) Greater Los Angeles Area Selected to participate in Robotics Bootcamp Workshop and Competition at UCLA where I received introductory lectures on Robotics. I assisted with assembly, wiring and programming of robot using BASIC STAMP. Electrical Engineering Intern UCLA Robotics Boot Camp and Competition February 2012  –  February 2012  (1 month) Greater Los Angeles Area Selected to participate in Robotics Bootcamp Workshop and Competition at UCLA where I received introductory lectures on Robotics. I assisted with assembly, wiring and programming of robot using BASIC STAMP. Phi Theta Kapa member SBCC 2009  –  2012  (3 years) Santa Barbara, California Area Phi Theta Kapa member SBCC 2009  –  2012  (3 years) Santa Barbara, California Area Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Research Community Outreach PowerPoint Tutoring Electronics Matlab Teamwork Teaching Social Media Leadership Event Planning Skills  Research Community Outreach PowerPoint Tutoring Electronics Matlab Teamwork Teaching Social Media Leadership Event Planning Research Community Outreach PowerPoint Tutoring Electronics Matlab Teamwork Teaching Social Media Leadership Event Planning Research Community Outreach PowerPoint Tutoring Electronics Matlab Teamwork Teaching Social Media Leadership Event Planning Education California Polytechnic State University-San Luis Obispo Bachelor's Degree,  Electrical and Electronics Engineering 2014  – 2017 Santa Barbara City College Associate of Science (A.S.),  Mathematics 2009  – 2014 •\tPresident’s Honor Roll: Fall Semester 2010 and 2011 Activities and Societies:  The Society of Hispanic Professional Engineers California Polytechnic State University-San Luis Obispo Bachelor's Degree,  Electrical and Electronics Engineering 2014  – 2017 California Polytechnic State University-San Luis Obispo Bachelor's Degree,  Electrical and Electronics Engineering 2014  – 2017 California Polytechnic State University-San Luis Obispo Bachelor's Degree,  Electrical and Electronics Engineering 2014  – 2017 Santa Barbara City College Associate of Science (A.S.),  Mathematics 2009  – 2014 •\tPresident’s Honor Roll: Fall Semester 2010 and 2011 Activities and Societies:  The Society of Hispanic Professional Engineers Santa Barbara City College Associate of Science (A.S.),  Mathematics 2009  – 2014 •\tPresident’s Honor Roll: Fall Semester 2010 and 2011 Activities and Societies:  The Society of Hispanic Professional Engineers Santa Barbara City College Associate of Science (A.S.),  Mathematics 2009  – 2014 •\tPresident’s Honor Roll: Fall Semester 2010 and 2011 Activities and Societies:  The Society of Hispanic Professional Engineers Honors & Awards Santa Barbara City College Service to the College Award Santa Barbara City College May 2013 Santa Barbara City College Outstanding Engineering Student of the Year Award Santa Barbara City College May 2013 Santa Barbara City College Student Representative at the 2013 Aspen Awards for Community College Excellence The Aspen Institute March 2013 Certificate of Participation UCLA Center for Excellence in Engineering and Diversity February 2012 Awarded Certificate of Participation for successfully completing the Robotics Bootcamp. National Institute for Leadership Advancement (NILA) Diploma of Graduation The Society of Hispanic Professional Engineers (SHPE) August 2011 Santa Barbara City College Service to the College Award Santa Barbara City College May 2013 Santa Barbara City College Service to the College Award Santa Barbara City College May 2013 Santa Barbara City College Service to the College Award Santa Barbara City College May 2013 Santa Barbara City College Outstanding Engineering Student of the Year Award Santa Barbara City College May 2013 Santa Barbara City College Outstanding Engineering Student of the Year Award Santa Barbara City College May 2013 Santa Barbara City College Outstanding Engineering Student of the Year Award Santa Barbara City College May 2013 Santa Barbara City College Student Representative at the 2013 Aspen Awards for Community College Excellence The Aspen Institute March 2013 Santa Barbara City College Student Representative at the 2013 Aspen Awards for Community College Excellence The Aspen Institute March 2013 Santa Barbara City College Student Representative at the 2013 Aspen Awards for Community College Excellence The Aspen Institute March 2013 Certificate of Participation UCLA Center for Excellence in Engineering and Diversity February 2012 Awarded Certificate of Participation for successfully completing the Robotics Bootcamp. Certificate of Participation UCLA Center for Excellence in Engineering and Diversity February 2012 Awarded Certificate of Participation for successfully completing the Robotics Bootcamp. Certificate of Participation UCLA Center for Excellence in Engineering and Diversity February 2012 Awarded Certificate of Participation for successfully completing the Robotics Bootcamp. National Institute for Leadership Advancement (NILA) Diploma of Graduation The Society of Hispanic Professional Engineers (SHPE) August 2011 National Institute for Leadership Advancement (NILA) Diploma of Graduation The Society of Hispanic Professional Engineers (SHPE) August 2011 National Institute for Leadership Advancement (NILA) Diploma of Graduation The Society of Hispanic Professional Engineers (SHPE) August 2011 ", "Summary > Current computer engineering student at the University of Utah. \n> Projected BS / MS degree in Computer Engineering in spring 2017 ( combined degree track ) \n> Maintained a number of industry-related work experiences while still in school. \n> Aiming for a career in engineering, focusing on project management, and hopefully my own company one day. \n> Interested in a number of engineering fields: energy, aeronautics, consumer electronics, and more. Summary > Current computer engineering student at the University of Utah. \n> Projected BS / MS degree in Computer Engineering in spring 2017 ( combined degree track ) \n> Maintained a number of industry-related work experiences while still in school. \n> Aiming for a career in engineering, focusing on project management, and hopefully my own company one day. \n> Interested in a number of engineering fields: energy, aeronautics, consumer electronics, and more. > Current computer engineering student at the University of Utah. \n> Projected BS / MS degree in Computer Engineering in spring 2017 ( combined degree track ) \n> Maintained a number of industry-related work experiences while still in school. \n> Aiming for a career in engineering, focusing on project management, and hopefully my own company one day. \n> Interested in a number of engineering fields: energy, aeronautics, consumer electronics, and more. > Current computer engineering student at the University of Utah. \n> Projected BS / MS degree in Computer Engineering in spring 2017 ( combined degree track ) \n> Maintained a number of industry-related work experiences while still in school. \n> Aiming for a career in engineering, focusing on project management, and hopefully my own company one day. \n> Interested in a number of engineering fields: energy, aeronautics, consumer electronics, and more. Experience Electrical Engineering Intern Coda Octopus Colmek April 2015  – Present (5 months) Salt Lake City Software Engineering Intern Panasonic Research and Development Company of America January 2015  –  March 2015  (3 months) Salt Lake City Spring internship. Programming in C and Java in preparation for the open-source release of the OpenDOF project. Created test files and fulfilled various assignments assigned by supervisors as part of product development. Electrical Engineering Intern Moog Inc. December 2012  –  May 2014  (1 year 6 months) Salt Lake City General support to engineering staff working on internationally respected and IEC-60601 compliant enteral feeding pumps, compiled and analyzed data for internal and customer-released studies and reports, wrote and conducted internal engineering studies under manger supervision, engineering project documentation, circuit simulation, and component research and purchasing. Electrical Engineering Intern T.D. Williamson May 2012  –  August 2012  (4 months) Summer internship, worked in a team documenting wiring diagrams for oil pipeline inspection tools using basic Altium tools, basic soldering and electronics testing, learned and implemented federally-compliant documentation and versioning practices. Engineering Intern HARMAN International July 2009  –  February 2010  (8 months) Tested industry-leading professional audio signal processing products, created test cases, tracked and recorded product observations and bugs, used basic technical documentation methods, audio and signal analysis, user end product testing through automated test cases and unscripted usage. Manager African Ice April 2007  –  July 2009  (2 years 4 months) Managed one location and directly supervised 3 employees, handled inventory and stocking for 4 \nshaved ice locations \nServer – Handled general cleanliness, inventories, store opening and closing, money deposits Electrical Engineering Intern Coda Octopus Colmek April 2015  – Present (5 months) Salt Lake City Electrical Engineering Intern Coda Octopus Colmek April 2015  – Present (5 months) Salt Lake City Software Engineering Intern Panasonic Research and Development Company of America January 2015  –  March 2015  (3 months) Salt Lake City Spring internship. Programming in C and Java in preparation for the open-source release of the OpenDOF project. Created test files and fulfilled various assignments assigned by supervisors as part of product development. Software Engineering Intern Panasonic Research and Development Company of America January 2015  –  March 2015  (3 months) Salt Lake City Spring internship. Programming in C and Java in preparation for the open-source release of the OpenDOF project. Created test files and fulfilled various assignments assigned by supervisors as part of product development. Electrical Engineering Intern Moog Inc. December 2012  –  May 2014  (1 year 6 months) Salt Lake City General support to engineering staff working on internationally respected and IEC-60601 compliant enteral feeding pumps, compiled and analyzed data for internal and customer-released studies and reports, wrote and conducted internal engineering studies under manger supervision, engineering project documentation, circuit simulation, and component research and purchasing. Electrical Engineering Intern Moog Inc. December 2012  –  May 2014  (1 year 6 months) Salt Lake City General support to engineering staff working on internationally respected and IEC-60601 compliant enteral feeding pumps, compiled and analyzed data for internal and customer-released studies and reports, wrote and conducted internal engineering studies under manger supervision, engineering project documentation, circuit simulation, and component research and purchasing. Electrical Engineering Intern T.D. Williamson May 2012  –  August 2012  (4 months) Summer internship, worked in a team documenting wiring diagrams for oil pipeline inspection tools using basic Altium tools, basic soldering and electronics testing, learned and implemented federally-compliant documentation and versioning practices. Electrical Engineering Intern T.D. Williamson May 2012  –  August 2012  (4 months) Summer internship, worked in a team documenting wiring diagrams for oil pipeline inspection tools using basic Altium tools, basic soldering and electronics testing, learned and implemented federally-compliant documentation and versioning practices. Engineering Intern HARMAN International July 2009  –  February 2010  (8 months) Tested industry-leading professional audio signal processing products, created test cases, tracked and recorded product observations and bugs, used basic technical documentation methods, audio and signal analysis, user end product testing through automated test cases and unscripted usage. Engineering Intern HARMAN International July 2009  –  February 2010  (8 months) Tested industry-leading professional audio signal processing products, created test cases, tracked and recorded product observations and bugs, used basic technical documentation methods, audio and signal analysis, user end product testing through automated test cases and unscripted usage. Manager African Ice April 2007  –  July 2009  (2 years 4 months) Managed one location and directly supervised 3 employees, handled inventory and stocking for 4 \nshaved ice locations \nServer – Handled general cleanliness, inventories, store opening and closing, money deposits Manager African Ice April 2007  –  July 2009  (2 years 4 months) Managed one location and directly supervised 3 employees, handled inventory and stocking for 4 \nshaved ice locations \nServer – Handled general cleanliness, inventories, store opening and closing, money deposits Languages English Native or bilingual proficiency Romanian Professional working proficiency English Native or bilingual proficiency Romanian Professional working proficiency English Native or bilingual proficiency Romanian Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Electronics Acoustics Networking Soldering C  Xilinx Debugging Electrical Engineering Testing C Technical Communication Technical Writing Skills  Electronics Acoustics Networking Soldering C  Xilinx Debugging Electrical Engineering Testing C Technical Communication Technical Writing Electronics Acoustics Networking Soldering C  Xilinx Debugging Electrical Engineering Testing C Technical Communication Technical Writing Electronics Acoustics Networking Soldering C  Xilinx Debugging Electrical Engineering Testing C Technical Communication Technical Writing Education University of Utah Bachelor's degree,  Computer Engineering , 3.640 (continuing) 2010  – 2016 Activities and Societies:  Undergraduate Student Advisory Council Olympus High School High School Diploma , 3.95 / 4.0 GPA 2006  – 2009 Passed tests for 6 AP courses Activities and Societies:  National Honors Society University of Utah Bachelor's degree,  Computer Engineering , 3.640 (continuing) 2010  – 2016 Activities and Societies:  Undergraduate Student Advisory Council University of Utah Bachelor's degree,  Computer Engineering , 3.640 (continuing) 2010  – 2016 Activities and Societies:  Undergraduate Student Advisory Council University of Utah Bachelor's degree,  Computer Engineering , 3.640 (continuing) 2010  – 2016 Activities and Societies:  Undergraduate Student Advisory Council Olympus High School High School Diploma , 3.95 / 4.0 GPA 2006  – 2009 Passed tests for 6 AP courses Activities and Societies:  National Honors Society Olympus High School High School Diploma , 3.95 / 4.0 GPA 2006  – 2009 Passed tests for 6 AP courses Activities and Societies:  National Honors Society Olympus High School High School Diploma , 3.95 / 4.0 GPA 2006  – 2009 Passed tests for 6 AP courses Activities and Societies:  National Honors Society Honors & Awards ", "Summary My goals as a civil engineer include obtaining a masters degree which focuses on structural engineering and using my education and experience to be employed by a Lafayette, Louisiana engineering firm. Summary My goals as a civil engineer include obtaining a masters degree which focuses on structural engineering and using my education and experience to be employed by a Lafayette, Louisiana engineering firm. My goals as a civil engineer include obtaining a masters degree which focuses on structural engineering and using my education and experience to be employed by a Lafayette, Louisiana engineering firm. My goals as a civil engineer include obtaining a masters degree which focuses on structural engineering and using my education and experience to be employed by a Lafayette, Louisiana engineering firm. Experience Civil Engineering Intern Huval & Associates January 2015  – Present (8 months) Lafayette, LA Undergraduate Research Assistant University of Louisiana at Lafayette August 2010  –  December 2014  (4 years 5 months) Lafayette, Louisiana As an undergraduate research assistant I have worked for Dr. Chris Carroll. My duties include assisting grad students during concrete pours by making test cylinders and promoting quality control. I also work with my professor on concrete related research. I have performed literature reviews and conduct individual research. \n \nMy individual research pertains to concrete and grout mix design using recycled crumb rubber and fibers. I have created a mix procedure, mixed grout, and poured test cylinder and beams. \n \nBefore graduation, I will use the data I have collected through compression cylinder tests, flexure test on beams and strain tests to write a paper and submit it to an academic journal. Throughout the research process I have given two technical presentations at undergraduate research conferences. Summer Engineering Intern Huval & Associates May 2014  –  August 2014  (4 months) Lafayette, LA Undergraduate Student University of Louisiana at Lafayette August 2010  –  May 2014  (3 years 10 months) As an undergraduate student, I completed the required civil engineering curriculum as well as participated in extracurricular clubs such as The American Society of Civil Engineers (ASCE), Chi Epsilon (civil engineering honors society), The Louisiana Engineering Society (LES), and The American Concrete Institute (ACI). Student Engineering Intern Meyer, Meyer, LaCroix & Hixson May 2013  –  June 2013  (2 months) Alexandria, Louisiana As a student engineering intern, I performed basic hydrologic design which included pipe sizing, runoff quantities, time of concentration calculations and hydrologic routing. I also performed basic site grading for an industrial plant to be constructed. I performed checks on a simple steel beam design and performed steel frame analysis using computer software. Finally, I helped complete a project portfolio which outlined project scope, community impact, government agencies involved, and land use. Student Engineering Intern City of Alexandria, LA Engineering Office June 2012  –  July 2012  (2 months) Student Engineering Intern City of Alexandria, LA Engineering Office June 2011  –  July 2011  (2 months) As a student engineering inter at the City of Alexandria Engineering Office, I performed basic plan drafting using AutoCAD. I assisted in note taking during meetings. I also created an electronically accessible specifications manual. Finally, I designed and drafted plans for a residential drainage improvement project. Civil Engineering Intern Huval & Associates January 2015  – Present (8 months) Lafayette, LA Civil Engineering Intern Huval & Associates January 2015  – Present (8 months) Lafayette, LA Undergraduate Research Assistant University of Louisiana at Lafayette August 2010  –  December 2014  (4 years 5 months) Lafayette, Louisiana As an undergraduate research assistant I have worked for Dr. Chris Carroll. My duties include assisting grad students during concrete pours by making test cylinders and promoting quality control. I also work with my professor on concrete related research. I have performed literature reviews and conduct individual research. \n \nMy individual research pertains to concrete and grout mix design using recycled crumb rubber and fibers. I have created a mix procedure, mixed grout, and poured test cylinder and beams. \n \nBefore graduation, I will use the data I have collected through compression cylinder tests, flexure test on beams and strain tests to write a paper and submit it to an academic journal. Throughout the research process I have given two technical presentations at undergraduate research conferences. Undergraduate Research Assistant University of Louisiana at Lafayette August 2010  –  December 2014  (4 years 5 months) Lafayette, Louisiana As an undergraduate research assistant I have worked for Dr. Chris Carroll. My duties include assisting grad students during concrete pours by making test cylinders and promoting quality control. I also work with my professor on concrete related research. I have performed literature reviews and conduct individual research. \n \nMy individual research pertains to concrete and grout mix design using recycled crumb rubber and fibers. I have created a mix procedure, mixed grout, and poured test cylinder and beams. \n \nBefore graduation, I will use the data I have collected through compression cylinder tests, flexure test on beams and strain tests to write a paper and submit it to an academic journal. Throughout the research process I have given two technical presentations at undergraduate research conferences. Summer Engineering Intern Huval & Associates May 2014  –  August 2014  (4 months) Lafayette, LA Summer Engineering Intern Huval & Associates May 2014  –  August 2014  (4 months) Lafayette, LA Undergraduate Student University of Louisiana at Lafayette August 2010  –  May 2014  (3 years 10 months) As an undergraduate student, I completed the required civil engineering curriculum as well as participated in extracurricular clubs such as The American Society of Civil Engineers (ASCE), Chi Epsilon (civil engineering honors society), The Louisiana Engineering Society (LES), and The American Concrete Institute (ACI). Undergraduate Student University of Louisiana at Lafayette August 2010  –  May 2014  (3 years 10 months) As an undergraduate student, I completed the required civil engineering curriculum as well as participated in extracurricular clubs such as The American Society of Civil Engineers (ASCE), Chi Epsilon (civil engineering honors society), The Louisiana Engineering Society (LES), and The American Concrete Institute (ACI). Student Engineering Intern Meyer, Meyer, LaCroix & Hixson May 2013  –  June 2013  (2 months) Alexandria, Louisiana As a student engineering intern, I performed basic hydrologic design which included pipe sizing, runoff quantities, time of concentration calculations and hydrologic routing. I also performed basic site grading for an industrial plant to be constructed. I performed checks on a simple steel beam design and performed steel frame analysis using computer software. Finally, I helped complete a project portfolio which outlined project scope, community impact, government agencies involved, and land use. Student Engineering Intern Meyer, Meyer, LaCroix & Hixson May 2013  –  June 2013  (2 months) Alexandria, Louisiana As a student engineering intern, I performed basic hydrologic design which included pipe sizing, runoff quantities, time of concentration calculations and hydrologic routing. I also performed basic site grading for an industrial plant to be constructed. I performed checks on a simple steel beam design and performed steel frame analysis using computer software. Finally, I helped complete a project portfolio which outlined project scope, community impact, government agencies involved, and land use. Student Engineering Intern City of Alexandria, LA Engineering Office June 2012  –  July 2012  (2 months) Student Engineering Intern City of Alexandria, LA Engineering Office June 2012  –  July 2012  (2 months) Student Engineering Intern City of Alexandria, LA Engineering Office June 2011  –  July 2011  (2 months) As a student engineering inter at the City of Alexandria Engineering Office, I performed basic plan drafting using AutoCAD. I assisted in note taking during meetings. I also created an electronically accessible specifications manual. Finally, I designed and drafted plans for a residential drainage improvement project. Student Engineering Intern City of Alexandria, LA Engineering Office June 2011  –  July 2011  (2 months) As a student engineering inter at the City of Alexandria Engineering Office, I performed basic plan drafting using AutoCAD. I assisted in note taking during meetings. I also created an electronically accessible specifications manual. Finally, I designed and drafted plans for a residential drainage improvement project. Education University of Louisiana at Lafayette 2010  – 2014 University of Louisiana at Lafayette 2010  – 2014 University of Louisiana at Lafayette 2010  – 2014 University of Louisiana at Lafayette 2010  – 2014 ", "Experience Software Engineering Intern Pinterest January 2015  –  April 2015  (4 months) San Francisco Bay Area Discovery! Software Engineering Intern TellApart May 2014  –  August 2014  (4 months) Ember.js Software Engineering Intern TellApart September 2013  –  December 2013  (4 months) Hyperloglog, python and java Software Engineering Intern Chango January 2013  –  April 2013  (4 months) sql and scikit learn Quality Assurance Intern NexJ Systems May 2012  –  August 2012  (4 months) Clicking buttons... Software Engineering Intern Pinterest January 2015  –  April 2015  (4 months) San Francisco Bay Area Discovery! Software Engineering Intern Pinterest January 2015  –  April 2015  (4 months) San Francisco Bay Area Discovery! Software Engineering Intern TellApart May 2014  –  August 2014  (4 months) Ember.js Software Engineering Intern TellApart May 2014  –  August 2014  (4 months) Ember.js Software Engineering Intern TellApart September 2013  –  December 2013  (4 months) Hyperloglog, python and java Software Engineering Intern TellApart September 2013  –  December 2013  (4 months) Hyperloglog, python and java Software Engineering Intern Chango January 2013  –  April 2013  (4 months) sql and scikit learn Software Engineering Intern Chango January 2013  –  April 2013  (4 months) sql and scikit learn Quality Assurance Intern NexJ Systems May 2012  –  August 2012  (4 months) Clicking buttons... Quality Assurance Intern NexJ Systems May 2012  –  August 2012  (4 months) Clicking buttons... Education University of Waterloo Bachelor of Mathematics (Computer Science),  Computer Science , 3.7 2011  – 2016 Richmond Hill High School 2007  – 2011 University of Waterloo Bachelor of Mathematics (Computer Science),  Computer Science , 3.7 2011  – 2016 University of Waterloo Bachelor of Mathematics (Computer Science),  Computer Science , 3.7 2011  – 2016 University of Waterloo Bachelor of Mathematics (Computer Science),  Computer Science , 3.7 2011  – 2016 Richmond Hill High School 2007  – 2011 Richmond Hill High School 2007  – 2011 Richmond Hill High School 2007  – 2011 ", "Experience Research Engineering Intern Naval Surface Warfare Center Crane June 2015  – Present (3 months) CEO Pivot Engineering LLC June 2014  – Present (1 year 3 months) Thermoforming Engineering Intern Berry Plastics October 2012  –  May 2014  (1 year 8 months) Engineering Intern Case Engineering October 2011  –  August 2012  (11 months) Engineering Intern Current Engineering May 2011  –  August 2011  (4 months) Engineering Intern Alcoa January 2011  –  May 2011  (5 months) Built HMI screens and helped develop a mobile application for screens. Research Engineering Intern Naval Surface Warfare Center Crane June 2015  – Present (3 months) Research Engineering Intern Naval Surface Warfare Center Crane June 2015  – Present (3 months) CEO Pivot Engineering LLC June 2014  – Present (1 year 3 months) CEO Pivot Engineering LLC June 2014  – Present (1 year 3 months) Thermoforming Engineering Intern Berry Plastics October 2012  –  May 2014  (1 year 8 months) Thermoforming Engineering Intern Berry Plastics October 2012  –  May 2014  (1 year 8 months) Engineering Intern Case Engineering October 2011  –  August 2012  (11 months) Engineering Intern Case Engineering October 2011  –  August 2012  (11 months) Engineering Intern Current Engineering May 2011  –  August 2011  (4 months) Engineering Intern Current Engineering May 2011  –  August 2011  (4 months) Engineering Intern Alcoa January 2011  –  May 2011  (5 months) Built HMI screens and helped develop a mobile application for screens. Engineering Intern Alcoa January 2011  –  May 2011  (5 months) Built HMI screens and helped develop a mobile application for screens. Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint Plastics Manufacturing Engineering Research Solidworks Event Planning Fundraising Leadership Public Relations Negotiation Six Sigma Social Networking Process Improvement Lean Manufacturing See 3+     See less Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint Plastics Manufacturing Engineering Research Solidworks Event Planning Fundraising Leadership Public Relations Negotiation Six Sigma Social Networking Process Improvement Lean Manufacturing See 3+     See less Microsoft Office Microsoft Excel Microsoft Word PowerPoint Plastics Manufacturing Engineering Research Solidworks Event Planning Fundraising Leadership Public Relations Negotiation Six Sigma Social Networking Process Improvement Lean Manufacturing See 3+     See less Microsoft Office Microsoft Excel Microsoft Word PowerPoint Plastics Manufacturing Engineering Research Solidworks Event Planning Fundraising Leadership Public Relations Negotiation Six Sigma Social Networking Process Improvement Lean Manufacturing See 3+     See less Education University of Southern Indiana Electrical Engineering 2011  – 2015 University of Southern Indiana Economics 2011  – 2015 University of Southern Indiana Electrical Engineering 2011  – 2015 University of Southern Indiana Electrical Engineering 2011  – 2015 University of Southern Indiana Electrical Engineering 2011  – 2015 University of Southern Indiana Economics 2011  – 2015 University of Southern Indiana Economics 2011  – 2015 University of Southern Indiana Economics 2011  – 2015 ", "Summary I am currently working in the Projects & Project Controls Group at Alyeska Pipeline Service Company as a project coordinator (since May 2014). Summary I am currently working in the Projects & Project Controls Group at Alyeska Pipeline Service Company as a project coordinator (since May 2014). I am currently working in the Projects & Project Controls Group at Alyeska Pipeline Service Company as a project coordinator (since May 2014). I am currently working in the Projects & Project Controls Group at Alyeska Pipeline Service Company as a project coordinator (since May 2014). Experience Project Coordinator Alyeska Pipeline Service Company August 2015  – Present (1 month) Anchorage, Alaska Area Projects & Project Controls Engineering Intern Alyeska Pipeline Service Company March 2015  – Present (6 months) Anchorage, Alaska Area Support Project Managers and Project Engineers in various projects with quality standards and the production of expected deliverables during all phases of the project life cycle. Oil Movements/Measurements Engineering Intern Alyeska Pipeline Service Company May 2014  – Present (1 year 4 months) Anchorage, Alaska Area Oil Measurements \n• Complication and issue minor modification packages \n• Coordinate purchasing and support work for projects \n• Create and presentation of AutoCAD drawings for fabrication of materials \n• Calculation and purchasing of critical spare parts necessary for oil measurements \n• Evaluate and assist the meter proving calibrations and certifications Mechanical/ Process Engineering Intern CH2M May 2012  –  September 2013  (1 year 5 months) Alaska • Independent and team analysis of diverse stages of CH2M HILL and client’s projects \n• Authorized for using Auto Pipe and AutoCAD programs \n• Responsible for technical skills needed for the design of well-tie in project \n• Pipe stress using AutoPIPE and pipe analysis using Aspen HYSYS Programs \n• Inventory of critical spare parts, necessary for operations; investigate involved extensive use of P&ID drawings, client's (CPAI: well-tie ins program) data bases and vendor specs documents Engineering Intern Alaska Interstate Construction May 2011  –  August 2011  (4 months) 301 W Northern Lights Blvd Anchorage, AK 99503 • Communicate take-off calculations and specs analysis at bid meetings \n• Designated for using auto cad, heavy bid estimating, and earthworks  \n• Investigated of permitting and rate quotes for projects Flight Operations UPS Supply Chain Solutions February 2008  –  July 2008  (6 months) • Collaborated with flight operations team for UPS at the Anchorage airport \n• Weighed & balanced aircraft to ensure safe flights and deliveries  \n• Communicated policies and standards of operating procedures for flight operations Human Aging Research Lab, Microbiology, Biotech Lab Assistant/Technician University of Idaho January 2001  –  August 2003  (2 years 8 months) Moscow, Idaho • Independent and team investigation of new protocols and procedures \n• Maintained inventory control and conducting laboratory experiments resulting in Publications: Spatiotemporal expression pattern of the retinoid receptor RXR alpha, Aging and the evolutionary consequences of domestication Human Aging Process Project Coordinator Alyeska Pipeline Service Company August 2015  – Present (1 month) Anchorage, Alaska Area Project Coordinator Alyeska Pipeline Service Company August 2015  – Present (1 month) Anchorage, Alaska Area Projects & Project Controls Engineering Intern Alyeska Pipeline Service Company March 2015  – Present (6 months) Anchorage, Alaska Area Support Project Managers and Project Engineers in various projects with quality standards and the production of expected deliverables during all phases of the project life cycle. Projects & Project Controls Engineering Intern Alyeska Pipeline Service Company March 2015  – Present (6 months) Anchorage, Alaska Area Support Project Managers and Project Engineers in various projects with quality standards and the production of expected deliverables during all phases of the project life cycle. Oil Movements/Measurements Engineering Intern Alyeska Pipeline Service Company May 2014  – Present (1 year 4 months) Anchorage, Alaska Area Oil Measurements \n• Complication and issue minor modification packages \n• Coordinate purchasing and support work for projects \n• Create and presentation of AutoCAD drawings for fabrication of materials \n• Calculation and purchasing of critical spare parts necessary for oil measurements \n• Evaluate and assist the meter proving calibrations and certifications Oil Movements/Measurements Engineering Intern Alyeska Pipeline Service Company May 2014  – Present (1 year 4 months) Anchorage, Alaska Area Oil Measurements \n• Complication and issue minor modification packages \n• Coordinate purchasing and support work for projects \n• Create and presentation of AutoCAD drawings for fabrication of materials \n• Calculation and purchasing of critical spare parts necessary for oil measurements \n• Evaluate and assist the meter proving calibrations and certifications Mechanical/ Process Engineering Intern CH2M May 2012  –  September 2013  (1 year 5 months) Alaska • Independent and team analysis of diverse stages of CH2M HILL and client’s projects \n• Authorized for using Auto Pipe and AutoCAD programs \n• Responsible for technical skills needed for the design of well-tie in project \n• Pipe stress using AutoPIPE and pipe analysis using Aspen HYSYS Programs \n• Inventory of critical spare parts, necessary for operations; investigate involved extensive use of P&ID drawings, client's (CPAI: well-tie ins program) data bases and vendor specs documents Mechanical/ Process Engineering Intern CH2M May 2012  –  September 2013  (1 year 5 months) Alaska • Independent and team analysis of diverse stages of CH2M HILL and client’s projects \n• Authorized for using Auto Pipe and AutoCAD programs \n• Responsible for technical skills needed for the design of well-tie in project \n• Pipe stress using AutoPIPE and pipe analysis using Aspen HYSYS Programs \n• Inventory of critical spare parts, necessary for operations; investigate involved extensive use of P&ID drawings, client's (CPAI: well-tie ins program) data bases and vendor specs documents Engineering Intern Alaska Interstate Construction May 2011  –  August 2011  (4 months) 301 W Northern Lights Blvd Anchorage, AK 99503 • Communicate take-off calculations and specs analysis at bid meetings \n• Designated for using auto cad, heavy bid estimating, and earthworks  \n• Investigated of permitting and rate quotes for projects Engineering Intern Alaska Interstate Construction May 2011  –  August 2011  (4 months) 301 W Northern Lights Blvd Anchorage, AK 99503 • Communicate take-off calculations and specs analysis at bid meetings \n• Designated for using auto cad, heavy bid estimating, and earthworks  \n• Investigated of permitting and rate quotes for projects Flight Operations UPS Supply Chain Solutions February 2008  –  July 2008  (6 months) • Collaborated with flight operations team for UPS at the Anchorage airport \n• Weighed & balanced aircraft to ensure safe flights and deliveries  \n• Communicated policies and standards of operating procedures for flight operations Flight Operations UPS Supply Chain Solutions February 2008  –  July 2008  (6 months) • Collaborated with flight operations team for UPS at the Anchorage airport \n• Weighed & balanced aircraft to ensure safe flights and deliveries  \n• Communicated policies and standards of operating procedures for flight operations Human Aging Research Lab, Microbiology, Biotech Lab Assistant/Technician University of Idaho January 2001  –  August 2003  (2 years 8 months) Moscow, Idaho • Independent and team investigation of new protocols and procedures \n• Maintained inventory control and conducting laboratory experiments resulting in Publications: Spatiotemporal expression pattern of the retinoid receptor RXR alpha, Aging and the evolutionary consequences of domestication Human Aging Process Human Aging Research Lab, Microbiology, Biotech Lab Assistant/Technician University of Idaho January 2001  –  August 2003  (2 years 8 months) Moscow, Idaho • Independent and team investigation of new protocols and procedures \n• Maintained inventory control and conducting laboratory experiments resulting in Publications: Spatiotemporal expression pattern of the retinoid receptor RXR alpha, Aging and the evolutionary consequences of domestication Human Aging Process Languages Thai Native or bilingual proficiency English Native or bilingual proficiency Thai Native or bilingual proficiency English Native or bilingual proficiency Thai Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Mechanical Engineering Process Engineering AutoPIPE Microsoft Excel AutoCAD Solidworks Engineering Program Management Analysis Energy CAD MS Project Petroleum Piping Project Engineering SolidWorks Microsoft Project P Microsoft Office Project Planning Oil  Materials See 7+     See less Skills  Mechanical Engineering Process Engineering AutoPIPE Microsoft Excel AutoCAD Solidworks Engineering Program Management Analysis Energy CAD MS Project Petroleum Piping Project Engineering SolidWorks Microsoft Project P Microsoft Office Project Planning Oil  Materials See 7+     See less Mechanical Engineering Process Engineering AutoPIPE Microsoft Excel AutoCAD Solidworks Engineering Program Management Analysis Energy CAD MS Project Petroleum Piping Project Engineering SolidWorks Microsoft Project P Microsoft Office Project Planning Oil  Materials See 7+     See less Mechanical Engineering Process Engineering AutoPIPE Microsoft Excel AutoCAD Solidworks Engineering Program Management Analysis Energy CAD MS Project Petroleum Piping Project Engineering SolidWorks Microsoft Project P Microsoft Office Project Planning Oil  Materials See 7+     See less Education University of Alaska Anchorage Bachelor’s Degree,  Major Mechanical Engineering ,  Minor Mathematics , Graduated 2010  – 2015 Scholarships: NACE International Alaska Section/BP Scholarship 2012 & 2014, SPE Society of  \nPetroleum Engineers Scholarship 2013 & 2014, BP Scholarship 2012, 2013 & 2014, Alaska Power Associations:  \nHank Nikkels Scholarship 2013 \nUAA Scholarships: Summer 2014, Fall 2014 Activities and Societies:  Student Chapter Chair of NACE (National Association of Corrosion Engineers) ,  ANSEP (Alaskan Native Science & Engineering Program) ,  ISA (The International Society of Automation) ,  SWE (The Society of Women Engineers) ,  SPE (Society of Petroleum Engineers) ,  ASHRAE (American Society of Heating ,  Refrigerating and Air Conditioning Engineers) ,  Baja 2015 Senior Design Team and Baja SAE Club (Secretary/Treasurer) ,  Dean's List University of Idaho Bachelor of Science (BS),  Majored Biology ,  Minored Psychology , Graduated 1998  – 2003 Activities and Societies:  U of I Tennis Team 1998 ,  Phi Sigma Society (scholarship recipient 2002-2003) ,  U of I Honors Program ,  U of I Tennis League ,  Women's Tennis League ,  Intramural: Basketball ,  Swimming ,  Soccer ,  Tennis ,  U of I Student Association Off-Campus Representative ,  U of I Election Campaign Volunteer ,  U of I Advertisement Campaign ,  Dean's List ,  Circle K Hospital Volunteer ,  International Student's Buddy Program ,  Thail Student Organization Officer The University of British Columbia Bachelor of Science (BS),  Biology , General , Exchange program 2000  – 2000 University of Alaska Anchorage Bachelor’s Degree,  Major Mechanical Engineering ,  Minor Mathematics , Graduated 2010  – 2015 Scholarships: NACE International Alaska Section/BP Scholarship 2012 & 2014, SPE Society of  \nPetroleum Engineers Scholarship 2013 & 2014, BP Scholarship 2012, 2013 & 2014, Alaska Power Associations:  \nHank Nikkels Scholarship 2013 \nUAA Scholarships: Summer 2014, Fall 2014 Activities and Societies:  Student Chapter Chair of NACE (National Association of Corrosion Engineers) ,  ANSEP (Alaskan Native Science & Engineering Program) ,  ISA (The International Society of Automation) ,  SWE (The Society of Women Engineers) ,  SPE (Society of Petroleum Engineers) ,  ASHRAE (American Society of Heating ,  Refrigerating and Air Conditioning Engineers) ,  Baja 2015 Senior Design Team and Baja SAE Club (Secretary/Treasurer) ,  Dean's List University of Alaska Anchorage Bachelor’s Degree,  Major Mechanical Engineering ,  Minor Mathematics , Graduated 2010  – 2015 Scholarships: NACE International Alaska Section/BP Scholarship 2012 & 2014, SPE Society of  \nPetroleum Engineers Scholarship 2013 & 2014, BP Scholarship 2012, 2013 & 2014, Alaska Power Associations:  \nHank Nikkels Scholarship 2013 \nUAA Scholarships: Summer 2014, Fall 2014 Activities and Societies:  Student Chapter Chair of NACE (National Association of Corrosion Engineers) ,  ANSEP (Alaskan Native Science & Engineering Program) ,  ISA (The International Society of Automation) ,  SWE (The Society of Women Engineers) ,  SPE (Society of Petroleum Engineers) ,  ASHRAE (American Society of Heating ,  Refrigerating and Air Conditioning Engineers) ,  Baja 2015 Senior Design Team and Baja SAE Club (Secretary/Treasurer) ,  Dean's List University of Alaska Anchorage Bachelor’s Degree,  Major Mechanical Engineering ,  Minor Mathematics , Graduated 2010  – 2015 Scholarships: NACE International Alaska Section/BP Scholarship 2012 & 2014, SPE Society of  \nPetroleum Engineers Scholarship 2013 & 2014, BP Scholarship 2012, 2013 & 2014, Alaska Power Associations:  \nHank Nikkels Scholarship 2013 \nUAA Scholarships: Summer 2014, Fall 2014 Activities and Societies:  Student Chapter Chair of NACE (National Association of Corrosion Engineers) ,  ANSEP (Alaskan Native Science & Engineering Program) ,  ISA (The International Society of Automation) ,  SWE (The Society of Women Engineers) ,  SPE (Society of Petroleum Engineers) ,  ASHRAE (American Society of Heating ,  Refrigerating and Air Conditioning Engineers) ,  Baja 2015 Senior Design Team and Baja SAE Club (Secretary/Treasurer) ,  Dean's List University of Idaho Bachelor of Science (BS),  Majored Biology ,  Minored Psychology , Graduated 1998  – 2003 Activities and Societies:  U of I Tennis Team 1998 ,  Phi Sigma Society (scholarship recipient 2002-2003) ,  U of I Honors Program ,  U of I Tennis League ,  Women's Tennis League ,  Intramural: Basketball ,  Swimming ,  Soccer ,  Tennis ,  U of I Student Association Off-Campus Representative ,  U of I Election Campaign Volunteer ,  U of I Advertisement Campaign ,  Dean's List ,  Circle K Hospital Volunteer ,  International Student's Buddy Program ,  Thail Student Organization Officer University of Idaho Bachelor of Science (BS),  Majored Biology ,  Minored Psychology , Graduated 1998  – 2003 Activities and Societies:  U of I Tennis Team 1998 ,  Phi Sigma Society (scholarship recipient 2002-2003) ,  U of I Honors Program ,  U of I Tennis League ,  Women's Tennis League ,  Intramural: Basketball ,  Swimming ,  Soccer ,  Tennis ,  U of I Student Association Off-Campus Representative ,  U of I Election Campaign Volunteer ,  U of I Advertisement Campaign ,  Dean's List ,  Circle K Hospital Volunteer ,  International Student's Buddy Program ,  Thail Student Organization Officer University of Idaho Bachelor of Science (BS),  Majored Biology ,  Minored Psychology , Graduated 1998  – 2003 Activities and Societies:  U of I Tennis Team 1998 ,  Phi Sigma Society (scholarship recipient 2002-2003) ,  U of I Honors Program ,  U of I Tennis League ,  Women's Tennis League ,  Intramural: Basketball ,  Swimming ,  Soccer ,  Tennis ,  U of I Student Association Off-Campus Representative ,  U of I Election Campaign Volunteer ,  U of I Advertisement Campaign ,  Dean's List ,  Circle K Hospital Volunteer ,  International Student's Buddy Program ,  Thail Student Organization Officer The University of British Columbia Bachelor of Science (BS),  Biology , General , Exchange program 2000  – 2000 The University of British Columbia Bachelor of Science (BS),  Biology , General , Exchange program 2000  – 2000 The University of British Columbia Bachelor of Science (BS),  Biology , General , Exchange program 2000  – 2000 "]}