{"position": "Network Systems Analyst", "company": "Google", "profiles": ["Skills Juniper Network Architecture Data Center MPLS VPN Cloud Computing Network Design VoIP Cisco Technologies Switches TCP/IP IP Linux OSPF Security QoS MPLS Firewalls Routing Telecommunications BGP IPv6 Network Security Virtualization ITIL VPN See 10+     See less Skills  Juniper Network Architecture Data Center MPLS VPN Cloud Computing Network Design VoIP Cisco Technologies Switches TCP/IP IP Linux OSPF Security QoS MPLS Firewalls Routing Telecommunications BGP IPv6 Network Security Virtualization ITIL VPN See 10+     See less Juniper Network Architecture Data Center MPLS VPN Cloud Computing Network Design VoIP Cisco Technologies Switches TCP/IP IP Linux OSPF Security QoS MPLS Firewalls Routing Telecommunications BGP IPv6 Network Security Virtualization ITIL VPN See 10+     See less Juniper Network Architecture Data Center MPLS VPN Cloud Computing Network Design VoIP Cisco Technologies Switches TCP/IP IP Linux OSPF Security QoS MPLS Firewalls Routing Telecommunications BGP IPv6 Network Security Virtualization ITIL VPN See 10+     See less ", "Summary I have spent the last 20 years immersed in the telecommunications and data communications industries. My experience spans network operations, engineering and architecture as well as protocol design and testing for ISPs, access and content providers and equipment vendors. In my tenure at Google I have primarily focused on the design and integration of novel network and protocol architectures focused on massively and cost-effectively scaling machine network interconnect within and between data centers. Summary I have spent the last 20 years immersed in the telecommunications and data communications industries. My experience spans network operations, engineering and architecture as well as protocol design and testing for ISPs, access and content providers and equipment vendors. In my tenure at Google I have primarily focused on the design and integration of novel network and protocol architectures focused on massively and cost-effectively scaling machine network interconnect within and between data centers. I have spent the last 20 years immersed in the telecommunications and data communications industries. My experience spans network operations, engineering and architecture as well as protocol design and testing for ISPs, access and content providers and equipment vendors. In my tenure at Google I have primarily focused on the design and integration of novel network and protocol architectures focused on massively and cost-effectively scaling machine network interconnect within and between data centers. I have spent the last 20 years immersed in the telecommunications and data communications industries. My experience spans network operations, engineering and architecture as well as protocol design and testing for ISPs, access and content providers and equipment vendors. In my tenure at Google I have primarily focused on the design and integration of novel network and protocol architectures focused on massively and cost-effectively scaling machine network interconnect within and between data centers. Experience Senior Staff Network Engineer Google November 2011  – Present (3 years 10 months) Staff Network Engineer Google November 2008  –  November 2011  (3 years 1 month) Senior Network Engineer Google May 2003  –  November 2008  (5 years 7 months) Senior Network Engineer Routescience Technologies October 2001  –  December 2003  (2 years 3 months) Senior IP Network Engineer Northpoint Communications May 2001  –  October 2001  (6 months) Manager, Network Systems Engineering Yipes Communications December 2000  –  May 2001  (6 months) Network Engineer Pacific Bell Internet Services October 1997  –  December 2000  (3 years 3 months) Network Engineer CRL Network Services May 1996  –  October 1997  (1 year 6 months) Senior Staff Network Engineer Google November 2011  – Present (3 years 10 months) Senior Staff Network Engineer Google November 2011  – Present (3 years 10 months) Staff Network Engineer Google November 2008  –  November 2011  (3 years 1 month) Staff Network Engineer Google November 2008  –  November 2011  (3 years 1 month) Senior Network Engineer Google May 2003  –  November 2008  (5 years 7 months) Senior Network Engineer Google May 2003  –  November 2008  (5 years 7 months) Senior Network Engineer Routescience Technologies October 2001  –  December 2003  (2 years 3 months) Senior Network Engineer Routescience Technologies October 2001  –  December 2003  (2 years 3 months) Senior IP Network Engineer Northpoint Communications May 2001  –  October 2001  (6 months) Senior IP Network Engineer Northpoint Communications May 2001  –  October 2001  (6 months) Manager, Network Systems Engineering Yipes Communications December 2000  –  May 2001  (6 months) Manager, Network Systems Engineering Yipes Communications December 2000  –  May 2001  (6 months) Network Engineer Pacific Bell Internet Services October 1997  –  December 2000  (3 years 3 months) Network Engineer Pacific Bell Internet Services October 1997  –  December 2000  (3 years 3 months) Network Engineer CRL Network Services May 1996  –  October 1997  (1 year 6 months) Network Engineer CRL Network Services May 1996  –  October 1997  (1 year 6 months) Skills Capacity Planning Wireshark Juniper OSPF BGP High Availability Vendor Management ISIS Network Architecture IS-IS MPLS Integration JUNOS Network Security Routing Network Design Networking MPLS VPN Data Center Network Engineering Cisco Technologies Routing Protocols Computer Network... Telecommunications Load Balancing QoS IPv6 TCP/IP Cisco IOS WAN Switches IPSec Routers Juniper Technologies See 19+     See less Skills  Capacity Planning Wireshark Juniper OSPF BGP High Availability Vendor Management ISIS Network Architecture IS-IS MPLS Integration JUNOS Network Security Routing Network Design Networking MPLS VPN Data Center Network Engineering Cisco Technologies Routing Protocols Computer Network... Telecommunications Load Balancing QoS IPv6 TCP/IP Cisco IOS WAN Switches IPSec Routers Juniper Technologies See 19+     See less Capacity Planning Wireshark Juniper OSPF BGP High Availability Vendor Management ISIS Network Architecture IS-IS MPLS Integration JUNOS Network Security Routing Network Design Networking MPLS VPN Data Center Network Engineering Cisco Technologies Routing Protocols Computer Network... Telecommunications Load Balancing QoS IPv6 TCP/IP Cisco IOS WAN Switches IPSec Routers Juniper Technologies See 19+     See less Capacity Planning Wireshark Juniper OSPF BGP High Availability Vendor Management ISIS Network Architecture IS-IS MPLS Integration JUNOS Network Security Routing Network Design Networking MPLS VPN Data Center Network Engineering Cisco Technologies Routing Protocols Computer Network... Telecommunications Load Balancing QoS IPv6 TCP/IP Cisco IOS WAN Switches IPSec Routers Juniper Technologies See 19+     See less Education San Francisco State University 1990  – 1995 The Urban School of San Francisco High School 1986  – 1990 San Francisco State University 1990  – 1995 San Francisco State University 1990  – 1995 San Francisco State University 1990  – 1995 The Urban School of San Francisco High School 1986  – 1990 The Urban School of San Francisco High School 1986  – 1990 The Urban School of San Francisco High School 1986  – 1990 ", "Summary In June of 1997, I joined the tech support group at Ultranet. In 1998, we were purchased by RCN. I rose through the ranks of the NOC to become a Network Engineer with RCN. Im February of 2002, I was downsized. \n \nAfter a year of unemployment, I began working at Pollak in February of 2003 focusing more on network security and plan to increase my knowledge of firewalls, VPNs, wireless network security and IDS. In February of 2006, due to management changes, I left Pollak. \n \nI heard of an opening at ITA Software from a former co-worker and friend from my RCN days. In May of 2006, I joined the NetOps group at ITA Software working with two former Ultranet employees and a refugee from Genuity. \n \nSince that time, the department has grown adding engineers from Tufts and additional former Ultranet and RCN employees among others. In April 2011, ITA Software was purchased by Google, Inc. and I've been working for them since. \n \nIn 2013 I joined the Google Acquisitions Network Operations team as part of a reorganization. The focus was taken off of ITA Software and more toward various non-standard networks which did not have adequate network support. I have spent my time in Acq NetOps redesigning and supporting a variety of networks from small to large. \n \nIn March 2015, we were reorganized under Corporate NetOps, mostly doing the same work but likely expanding responsibility into other areas. \n \nSpecialties: Dynamic routing protocols, Cisco, Juniper and Foundry routers, switches and load balancers, wireless networking, Checkpoint and Netscreen firewalls, Unix, Linux Summary In June of 1997, I joined the tech support group at Ultranet. In 1998, we were purchased by RCN. I rose through the ranks of the NOC to become a Network Engineer with RCN. Im February of 2002, I was downsized. \n \nAfter a year of unemployment, I began working at Pollak in February of 2003 focusing more on network security and plan to increase my knowledge of firewalls, VPNs, wireless network security and IDS. In February of 2006, due to management changes, I left Pollak. \n \nI heard of an opening at ITA Software from a former co-worker and friend from my RCN days. In May of 2006, I joined the NetOps group at ITA Software working with two former Ultranet employees and a refugee from Genuity. \n \nSince that time, the department has grown adding engineers from Tufts and additional former Ultranet and RCN employees among others. In April 2011, ITA Software was purchased by Google, Inc. and I've been working for them since. \n \nIn 2013 I joined the Google Acquisitions Network Operations team as part of a reorganization. The focus was taken off of ITA Software and more toward various non-standard networks which did not have adequate network support. I have spent my time in Acq NetOps redesigning and supporting a variety of networks from small to large. \n \nIn March 2015, we were reorganized under Corporate NetOps, mostly doing the same work but likely expanding responsibility into other areas. \n \nSpecialties: Dynamic routing protocols, Cisco, Juniper and Foundry routers, switches and load balancers, wireless networking, Checkpoint and Netscreen firewalls, Unix, Linux In June of 1997, I joined the tech support group at Ultranet. In 1998, we were purchased by RCN. I rose through the ranks of the NOC to become a Network Engineer with RCN. Im February of 2002, I was downsized. \n \nAfter a year of unemployment, I began working at Pollak in February of 2003 focusing more on network security and plan to increase my knowledge of firewalls, VPNs, wireless network security and IDS. In February of 2006, due to management changes, I left Pollak. \n \nI heard of an opening at ITA Software from a former co-worker and friend from my RCN days. In May of 2006, I joined the NetOps group at ITA Software working with two former Ultranet employees and a refugee from Genuity. \n \nSince that time, the department has grown adding engineers from Tufts and additional former Ultranet and RCN employees among others. In April 2011, ITA Software was purchased by Google, Inc. and I've been working for them since. \n \nIn 2013 I joined the Google Acquisitions Network Operations team as part of a reorganization. The focus was taken off of ITA Software and more toward various non-standard networks which did not have adequate network support. I have spent my time in Acq NetOps redesigning and supporting a variety of networks from small to large. \n \nIn March 2015, we were reorganized under Corporate NetOps, mostly doing the same work but likely expanding responsibility into other areas. \n \nSpecialties: Dynamic routing protocols, Cisco, Juniper and Foundry routers, switches and load balancers, wireless networking, Checkpoint and Netscreen firewalls, Unix, Linux In June of 1997, I joined the tech support group at Ultranet. In 1998, we were purchased by RCN. I rose through the ranks of the NOC to become a Network Engineer with RCN. Im February of 2002, I was downsized. \n \nAfter a year of unemployment, I began working at Pollak in February of 2003 focusing more on network security and plan to increase my knowledge of firewalls, VPNs, wireless network security and IDS. In February of 2006, due to management changes, I left Pollak. \n \nI heard of an opening at ITA Software from a former co-worker and friend from my RCN days. In May of 2006, I joined the NetOps group at ITA Software working with two former Ultranet employees and a refugee from Genuity. \n \nSince that time, the department has grown adding engineers from Tufts and additional former Ultranet and RCN employees among others. In April 2011, ITA Software was purchased by Google, Inc. and I've been working for them since. \n \nIn 2013 I joined the Google Acquisitions Network Operations team as part of a reorganization. The focus was taken off of ITA Software and more toward various non-standard networks which did not have adequate network support. I have spent my time in Acq NetOps redesigning and supporting a variety of networks from small to large. \n \nIn March 2015, we were reorganized under Corporate NetOps, mostly doing the same work but likely expanding responsibility into other areas. \n \nSpecialties: Dynamic routing protocols, Cisco, Juniper and Foundry routers, switches and load balancers, wireless networking, Checkpoint and Netscreen firewalls, Unix, Linux Experience Network Engineer III / L4 Google, Inc. August 2013  – Present (2 years 1 month) Cambridge, MA Merging into the Acquisition Network Operations group, I am continuing working with the ITA Software network but adding other acquisition networks into my realm of responsibility. Using proprietary version management tools. More Cisco and Juniper experience. Adding more fun with Arista. Building and maintaining several small networks geographically dispersed throughout the globe. \n \nAs of March 2015, Acquisition Network Operations is now part of Corporate Network Operations. Network Engineer II / 3 ITA Software by Google, Inc. April 2011  –  August 2013  (2 years 5 months) Cambridge, MA Continuing work from ITA Software, Inc but now as a division of Google. Added experience in this position includes Fortinet firewalls, A10 load balancers, Arista switches. Protocols include various multicast components such as PIM, IGMP and MSDP. Troubleshooting higher speed connections over fiber up to 10Gbps. Independent Performer Paragon Jousting September 2002  –  October 2011  (9 years 2 months) I perform with a traveling joust troupe. Our website is http://www.paragonjousting.com \n \nI really only added this because I was writing a recommendation for another performer and Seth the performer holds more weight in that area than Seth the Network Engineer. Network Engineer ITA Software May 2006  –  April 2011  (5 years) Firewall, router, switch and load balancer updates. Includes Netscreen Firewalls, Cisco and Juniper routers. Extreme switches. And Foundry switches and load balancers. \nPlan, design and build out of data centers for the purpose of housing customer server farms. \nWork with systems administrators and other network engineers to plan out best practices for the data centers. \nResearch and recommend networking hardware. \nWork with customers to turn up new data connections to the data centers. \nHandle escalations from the Software Operations Center (SOC) regarding network outages and issues. Performer/Staff Autumn Tree Productions, LLC April 2001  –  October 2009  (8 years 7 months) Performed as part of The Good, The Bad and The Ugly (GBU) \nPerformed as part of Autumn Tree Combat Company (ATACC) \nFormer webmaster for ATACC and assisted with ATP website. \nCurrent webmaster for GBU \nFormer Fight Captain \nFormer Fight Director Network Admin Pollak February 2003  –  February 2006  (3 years 1 month) Manage VPNs, firewall policy and Websense integration on a Nokia IPSO firewall appliance running Check Point FW‑1/VPN‑1 NG with Application Intelligence. Includes backing up and auditing daily firewall logs. \nManage Websense content filtering server and service \nManage and secure VLANs on Cisco Catalyst switches \nPhysical and logical maintenance, troubleshooting and standardization of Cisco routers and switches running static, RIP and EIGRP routing protocols across T1 and frame-relay circuits. Included both wired and wireless networks, running on Lucent/Orinoco 802.11b WAP, using TCP/IP and WEP \nManage Debian Linux servers running NMS software including MRTG, Nessus, RANCID. Also managed the configuration for What’s Up Gold! Running on a Windows server. \nManage Solaris servers and workstations to run Unix CAD applications, Pro Engineer, Ideas/C3P, Unigraphics, Catia, Windchill/PDMLink. \nResolution and escalation of issues through the TrackIt help desk ticketing system. Network Administrator Stoneridge February 2003  –  February 2006  (3 years 1 month) Same as Pollak above. Pollak was owned by Stoneridge. Indy Contractor Arcus 2004  –  2004  (less than a year) Network Engineer RCN June 1997  –  February 2002  (4 years 9 months) Physical and logical maintenance, troubleshooting and standardization of Cisco and Extreme routers and switches using BGP4, ISIS, OSPF and RIP routing protocols. Additional exposure to Juniper routers and CPE including Open Route/Proteon and Ascend routers. \nPerform router configuration changes as needed for improved performance across the internet backbone and ingress/egress points. Turning up, tearing down, and troubleshooting peers, transit providers, customers and high speed circuits. ISDN, Frame-relay, ATM, T1, DS3, OC3, OC48, Point-to-Point, Packet Over Sonet, TCP/IP. 802.11b wireless networking using Lucent/Orinoco wireless gear. Network Operator Ultranet June 1997  –  February 2002  (4 years 9 months) Manage NMS software running on Solaris and Debian Linux servers: MRTG, tkined, HP Open View, Netcool, Nervecenter, NOCOL \nService administration on DEC Unix: POP3, SMTP, HTTP, FTP, DNS, NNTP, NTP, SNMP \nResolution and escalation of trouble tickets through the “req” ticketing system.  \nRotating 24x7 primary on-call schedule as well as being secondary on-call escalation for three our of four weeks and performing off-hours maintenance.  \nTelephone support for dial-up users on most major operating systems. Support for most major Internet clients. First support member to pass the PC Product Support Specialist test at Ultranet. Network Engineer III / L4 Google, Inc. August 2013  – Present (2 years 1 month) Cambridge, MA Merging into the Acquisition Network Operations group, I am continuing working with the ITA Software network but adding other acquisition networks into my realm of responsibility. Using proprietary version management tools. More Cisco and Juniper experience. Adding more fun with Arista. Building and maintaining several small networks geographically dispersed throughout the globe. \n \nAs of March 2015, Acquisition Network Operations is now part of Corporate Network Operations. Network Engineer III / L4 Google, Inc. August 2013  – Present (2 years 1 month) Cambridge, MA Merging into the Acquisition Network Operations group, I am continuing working with the ITA Software network but adding other acquisition networks into my realm of responsibility. Using proprietary version management tools. More Cisco and Juniper experience. Adding more fun with Arista. Building and maintaining several small networks geographically dispersed throughout the globe. \n \nAs of March 2015, Acquisition Network Operations is now part of Corporate Network Operations. Network Engineer II / 3 ITA Software by Google, Inc. April 2011  –  August 2013  (2 years 5 months) Cambridge, MA Continuing work from ITA Software, Inc but now as a division of Google. Added experience in this position includes Fortinet firewalls, A10 load balancers, Arista switches. Protocols include various multicast components such as PIM, IGMP and MSDP. Troubleshooting higher speed connections over fiber up to 10Gbps. Network Engineer II / 3 ITA Software by Google, Inc. April 2011  –  August 2013  (2 years 5 months) Cambridge, MA Continuing work from ITA Software, Inc but now as a division of Google. Added experience in this position includes Fortinet firewalls, A10 load balancers, Arista switches. Protocols include various multicast components such as PIM, IGMP and MSDP. Troubleshooting higher speed connections over fiber up to 10Gbps. Independent Performer Paragon Jousting September 2002  –  October 2011  (9 years 2 months) I perform with a traveling joust troupe. Our website is http://www.paragonjousting.com \n \nI really only added this because I was writing a recommendation for another performer and Seth the performer holds more weight in that area than Seth the Network Engineer. Independent Performer Paragon Jousting September 2002  –  October 2011  (9 years 2 months) I perform with a traveling joust troupe. Our website is http://www.paragonjousting.com \n \nI really only added this because I was writing a recommendation for another performer and Seth the performer holds more weight in that area than Seth the Network Engineer. Network Engineer ITA Software May 2006  –  April 2011  (5 years) Firewall, router, switch and load balancer updates. Includes Netscreen Firewalls, Cisco and Juniper routers. Extreme switches. And Foundry switches and load balancers. \nPlan, design and build out of data centers for the purpose of housing customer server farms. \nWork with systems administrators and other network engineers to plan out best practices for the data centers. \nResearch and recommend networking hardware. \nWork with customers to turn up new data connections to the data centers. \nHandle escalations from the Software Operations Center (SOC) regarding network outages and issues. Network Engineer ITA Software May 2006  –  April 2011  (5 years) Firewall, router, switch and load balancer updates. Includes Netscreen Firewalls, Cisco and Juniper routers. Extreme switches. And Foundry switches and load balancers. \nPlan, design and build out of data centers for the purpose of housing customer server farms. \nWork with systems administrators and other network engineers to plan out best practices for the data centers. \nResearch and recommend networking hardware. \nWork with customers to turn up new data connections to the data centers. \nHandle escalations from the Software Operations Center (SOC) regarding network outages and issues. Performer/Staff Autumn Tree Productions, LLC April 2001  –  October 2009  (8 years 7 months) Performed as part of The Good, The Bad and The Ugly (GBU) \nPerformed as part of Autumn Tree Combat Company (ATACC) \nFormer webmaster for ATACC and assisted with ATP website. \nCurrent webmaster for GBU \nFormer Fight Captain \nFormer Fight Director Performer/Staff Autumn Tree Productions, LLC April 2001  –  October 2009  (8 years 7 months) Performed as part of The Good, The Bad and The Ugly (GBU) \nPerformed as part of Autumn Tree Combat Company (ATACC) \nFormer webmaster for ATACC and assisted with ATP website. \nCurrent webmaster for GBU \nFormer Fight Captain \nFormer Fight Director Network Admin Pollak February 2003  –  February 2006  (3 years 1 month) Manage VPNs, firewall policy and Websense integration on a Nokia IPSO firewall appliance running Check Point FW‑1/VPN‑1 NG with Application Intelligence. Includes backing up and auditing daily firewall logs. \nManage Websense content filtering server and service \nManage and secure VLANs on Cisco Catalyst switches \nPhysical and logical maintenance, troubleshooting and standardization of Cisco routers and switches running static, RIP and EIGRP routing protocols across T1 and frame-relay circuits. Included both wired and wireless networks, running on Lucent/Orinoco 802.11b WAP, using TCP/IP and WEP \nManage Debian Linux servers running NMS software including MRTG, Nessus, RANCID. Also managed the configuration for What’s Up Gold! Running on a Windows server. \nManage Solaris servers and workstations to run Unix CAD applications, Pro Engineer, Ideas/C3P, Unigraphics, Catia, Windchill/PDMLink. \nResolution and escalation of issues through the TrackIt help desk ticketing system. Network Admin Pollak February 2003  –  February 2006  (3 years 1 month) Manage VPNs, firewall policy and Websense integration on a Nokia IPSO firewall appliance running Check Point FW‑1/VPN‑1 NG with Application Intelligence. Includes backing up and auditing daily firewall logs. \nManage Websense content filtering server and service \nManage and secure VLANs on Cisco Catalyst switches \nPhysical and logical maintenance, troubleshooting and standardization of Cisco routers and switches running static, RIP and EIGRP routing protocols across T1 and frame-relay circuits. Included both wired and wireless networks, running on Lucent/Orinoco 802.11b WAP, using TCP/IP and WEP \nManage Debian Linux servers running NMS software including MRTG, Nessus, RANCID. Also managed the configuration for What’s Up Gold! Running on a Windows server. \nManage Solaris servers and workstations to run Unix CAD applications, Pro Engineer, Ideas/C3P, Unigraphics, Catia, Windchill/PDMLink. \nResolution and escalation of issues through the TrackIt help desk ticketing system. Network Administrator Stoneridge February 2003  –  February 2006  (3 years 1 month) Same as Pollak above. Pollak was owned by Stoneridge. Network Administrator Stoneridge February 2003  –  February 2006  (3 years 1 month) Same as Pollak above. Pollak was owned by Stoneridge. Indy Contractor Arcus 2004  –  2004  (less than a year) Indy Contractor Arcus 2004  –  2004  (less than a year) Network Engineer RCN June 1997  –  February 2002  (4 years 9 months) Physical and logical maintenance, troubleshooting and standardization of Cisco and Extreme routers and switches using BGP4, ISIS, OSPF and RIP routing protocols. Additional exposure to Juniper routers and CPE including Open Route/Proteon and Ascend routers. \nPerform router configuration changes as needed for improved performance across the internet backbone and ingress/egress points. Turning up, tearing down, and troubleshooting peers, transit providers, customers and high speed circuits. ISDN, Frame-relay, ATM, T1, DS3, OC3, OC48, Point-to-Point, Packet Over Sonet, TCP/IP. 802.11b wireless networking using Lucent/Orinoco wireless gear. Network Engineer RCN June 1997  –  February 2002  (4 years 9 months) Physical and logical maintenance, troubleshooting and standardization of Cisco and Extreme routers and switches using BGP4, ISIS, OSPF and RIP routing protocols. Additional exposure to Juniper routers and CPE including Open Route/Proteon and Ascend routers. \nPerform router configuration changes as needed for improved performance across the internet backbone and ingress/egress points. Turning up, tearing down, and troubleshooting peers, transit providers, customers and high speed circuits. ISDN, Frame-relay, ATM, T1, DS3, OC3, OC48, Point-to-Point, Packet Over Sonet, TCP/IP. 802.11b wireless networking using Lucent/Orinoco wireless gear. Network Operator Ultranet June 1997  –  February 2002  (4 years 9 months) Manage NMS software running on Solaris and Debian Linux servers: MRTG, tkined, HP Open View, Netcool, Nervecenter, NOCOL \nService administration on DEC Unix: POP3, SMTP, HTTP, FTP, DNS, NNTP, NTP, SNMP \nResolution and escalation of trouble tickets through the “req” ticketing system.  \nRotating 24x7 primary on-call schedule as well as being secondary on-call escalation for three our of four weeks and performing off-hours maintenance.  \nTelephone support for dial-up users on most major operating systems. Support for most major Internet clients. First support member to pass the PC Product Support Specialist test at Ultranet. Network Operator Ultranet June 1997  –  February 2002  (4 years 9 months) Manage NMS software running on Solaris and Debian Linux servers: MRTG, tkined, HP Open View, Netcool, Nervecenter, NOCOL \nService administration on DEC Unix: POP3, SMTP, HTTP, FTP, DNS, NNTP, NTP, SNMP \nResolution and escalation of trouble tickets through the “req” ticketing system.  \nRotating 24x7 primary on-call schedule as well as being secondary on-call escalation for three our of four weeks and performing off-hours maintenance.  \nTelephone support for dial-up users on most major operating systems. Support for most major Internet clients. First support member to pass the PC Product Support Specialist test at Ultranet. Skills Unix Linux Cisco Technologies Wireless Networking DNS TCP/IP Network Architecture Perl BGP Network Engineering Apache Switches Network Security OSPF MSDP IGMP IP Multicast Arista Juniper Brocade Foundry A10 Unix Shell Scripting Foundry Management VLAN SNMP Data Center Routing Protocols Routers Solaris Troubleshooting Firewalls Network Administration EIGRP Operating Systems Computer Network... Windows Server QoS Catalyst Switches Load Balancing Cisco Routers RIP Routing Cisco IOS Servers Cisco Nexus Product Information... IPv6 VPN Theoretical Particle... See 35+     See less Skills  Unix Linux Cisco Technologies Wireless Networking DNS TCP/IP Network Architecture Perl BGP Network Engineering Apache Switches Network Security OSPF MSDP IGMP IP Multicast Arista Juniper Brocade Foundry A10 Unix Shell Scripting Foundry Management VLAN SNMP Data Center Routing Protocols Routers Solaris Troubleshooting Firewalls Network Administration EIGRP Operating Systems Computer Network... Windows Server QoS Catalyst Switches Load Balancing Cisco Routers RIP Routing Cisco IOS Servers Cisco Nexus Product Information... IPv6 VPN Theoretical Particle... See 35+     See less Unix Linux Cisco Technologies Wireless Networking DNS TCP/IP Network Architecture Perl BGP Network Engineering Apache Switches Network Security OSPF MSDP IGMP IP Multicast Arista Juniper Brocade Foundry A10 Unix Shell Scripting Foundry Management VLAN SNMP Data Center Routing Protocols Routers Solaris Troubleshooting Firewalls Network Administration EIGRP Operating Systems Computer Network... Windows Server QoS Catalyst Switches Load Balancing Cisco Routers RIP Routing Cisco IOS Servers Cisco Nexus Product Information... IPv6 VPN Theoretical Particle... See 35+     See less Unix Linux Cisco Technologies Wireless Networking DNS TCP/IP Network Architecture Perl BGP Network Engineering Apache Switches Network Security OSPF MSDP IGMP IP Multicast Arista Juniper Brocade Foundry A10 Unix Shell Scripting Foundry Management VLAN SNMP Data Center Routing Protocols Routers Solaris Troubleshooting Firewalls Network Administration EIGRP Operating Systems Computer Network... Windows Server QoS Catalyst Switches Load Balancing Cisco Routers RIP Routing Cisco IOS Servers Cisco Nexus Product Information... IPv6 VPN Theoretical Particle... See 35+     See less Education Rensselaer Polytechnic Institute Computer Science 1989  – 1993 Activities and Societies:  WRPI Rensselaer Polytechnic Institute Computer Science 1989  – 1993 Activities and Societies:  WRPI Rensselaer Polytechnic Institute Computer Science 1989  – 1993 Activities and Societies:  WRPI Rensselaer Polytechnic Institute Computer Science 1989  – 1993 Activities and Societies:  WRPI ", "Experience Network Engineer II Google May 2015  – Present (4 months) Lenoir, NC Network Engineer I Google September 2013  –  May 2015  (1 year 9 months) Lenoir, NC Operations Engineer II Google September 2012  –  September 2013  (1 year 1 month) Lenoir, NC Operations Technician III Google September 2010  –  September 2012  (2 years 1 month) Lenoir, NC Operations Technician II Google January 2008  –  September 2010  (2 years 9 months) Lenoir, NC Operations Technician I Google February 2007  –  December 2007  (11 months) Atlanta, GA IT Services Coordinator TractManager August 2003  –  August 2006  (3 years 1 month) Chattanooga, TN PBS Systems Specialist Chattanooga Times Free Press 1999  –  2000  (1 year) Chattanooga, TN Network Engineer II Google May 2015  – Present (4 months) Lenoir, NC Network Engineer II Google May 2015  – Present (4 months) Lenoir, NC Network Engineer I Google September 2013  –  May 2015  (1 year 9 months) Lenoir, NC Network Engineer I Google September 2013  –  May 2015  (1 year 9 months) Lenoir, NC Operations Engineer II Google September 2012  –  September 2013  (1 year 1 month) Lenoir, NC Operations Engineer II Google September 2012  –  September 2013  (1 year 1 month) Lenoir, NC Operations Technician III Google September 2010  –  September 2012  (2 years 1 month) Lenoir, NC Operations Technician III Google September 2010  –  September 2012  (2 years 1 month) Lenoir, NC Operations Technician II Google January 2008  –  September 2010  (2 years 9 months) Lenoir, NC Operations Technician II Google January 2008  –  September 2010  (2 years 9 months) Lenoir, NC Operations Technician I Google February 2007  –  December 2007  (11 months) Atlanta, GA Operations Technician I Google February 2007  –  December 2007  (11 months) Atlanta, GA IT Services Coordinator TractManager August 2003  –  August 2006  (3 years 1 month) Chattanooga, TN IT Services Coordinator TractManager August 2003  –  August 2006  (3 years 1 month) Chattanooga, TN PBS Systems Specialist Chattanooga Times Free Press 1999  –  2000  (1 year) Chattanooga, TN PBS Systems Specialist Chattanooga Times Free Press 1999  –  2000  (1 year) Chattanooga, TN Skills Linux Data Center TCP/IP System Administration Cloud Computing Fiber Optics Outside Plant Python Project Management Linux System... Windows Servers Computer Hardware Networking DNS OS X System Deployment Apache Unix C# Network Deployment AutoCAD See 7+     See less Skills  Linux Data Center TCP/IP System Administration Cloud Computing Fiber Optics Outside Plant Python Project Management Linux System... Windows Servers Computer Hardware Networking DNS OS X System Deployment Apache Unix C# Network Deployment AutoCAD See 7+     See less Linux Data Center TCP/IP System Administration Cloud Computing Fiber Optics Outside Plant Python Project Management Linux System... Windows Servers Computer Hardware Networking DNS OS X System Deployment Apache Unix C# Network Deployment AutoCAD See 7+     See less Linux Data Center TCP/IP System Administration Cloud Computing Fiber Optics Outside Plant Python Project Management Linux System... Windows Servers Computer Hardware Networking DNS OS X System Deployment Apache Unix C# Network Deployment AutoCAD See 7+     See less Education East Carolina University Information Computer Technology 2010  – 2014 Chattanooga State Technical Community College Associate of Applied Science,  Information Systems/Network Management 2000  – 2003 East Carolina University Information Computer Technology 2010  – 2014 East Carolina University Information Computer Technology 2010  – 2014 East Carolina University Information Computer Technology 2010  – 2014 Chattanooga State Technical Community College Associate of Applied Science,  Information Systems/Network Management 2000  – 2003 Chattanooga State Technical Community College Associate of Applied Science,  Information Systems/Network Management 2000  – 2003 Chattanooga State Technical Community College Associate of Applied Science,  Information Systems/Network Management 2000  – 2003 ", "Skills MPLS Routing DWDM Network Architecture Networking BGP Network Engineering Switching Data Center CCIE IP Cisco Technologies Network Design IS-IS Python IPv6 Juniper OSPF Routing Protocols MPLS VPN QoS MySQL Internetworking JUNOS Cisco IOS Django Load Balancing Network Capacity... Network Data Analysis See 14+     See less Skills  MPLS Routing DWDM Network Architecture Networking BGP Network Engineering Switching Data Center CCIE IP Cisco Technologies Network Design IS-IS Python IPv6 Juniper OSPF Routing Protocols MPLS VPN QoS MySQL Internetworking JUNOS Cisco IOS Django Load Balancing Network Capacity... Network Data Analysis See 14+     See less MPLS Routing DWDM Network Architecture Networking BGP Network Engineering Switching Data Center CCIE IP Cisco Technologies Network Design IS-IS Python IPv6 Juniper OSPF Routing Protocols MPLS VPN QoS MySQL Internetworking JUNOS Cisco IOS Django Load Balancing Network Capacity... Network Data Analysis See 14+     See less MPLS Routing DWDM Network Architecture Networking BGP Network Engineering Switching Data Center CCIE IP Cisco Technologies Network Design IS-IS Python IPv6 Juniper OSPF Routing Protocols MPLS VPN QoS MySQL Internetworking JUNOS Cisco IOS Django Load Balancing Network Capacity... Network Data Analysis See 14+     See less ", "Skills Cloud Computing SaaS Go-to-market Strategy Strategic Partnerships Scalability Product Management Program Management Enterprise Software Data Center Networking Security E-commerce Analytics Cross-functional Team... Strategy Mobile Applications Start-ups Management Partner Management Integration Mobile Devices Virtualization Agile Methodologies Software Development See 9+     See less Skills  Cloud Computing SaaS Go-to-market Strategy Strategic Partnerships Scalability Product Management Program Management Enterprise Software Data Center Networking Security E-commerce Analytics Cross-functional Team... Strategy Mobile Applications Start-ups Management Partner Management Integration Mobile Devices Virtualization Agile Methodologies Software Development See 9+     See less Cloud Computing SaaS Go-to-market Strategy Strategic Partnerships Scalability Product Management Program Management Enterprise Software Data Center Networking Security E-commerce Analytics Cross-functional Team... Strategy Mobile Applications Start-ups Management Partner Management Integration Mobile Devices Virtualization Agile Methodologies Software Development See 9+     See less Cloud Computing SaaS Go-to-market Strategy Strategic Partnerships Scalability Product Management Program Management Enterprise Software Data Center Networking Security E-commerce Analytics Cross-functional Team... Strategy Mobile Applications Start-ups Management Partner Management Integration Mobile Devices Virtualization Agile Methodologies Software Development See 9+     See less ", "Summary Due to a high volume of inquires, please read this to better understand my objectives: \n \n1) > 95% telecommute: Full-time or part-time, I will consider contract/term projects. \n(telecommuting from Maui, Hawaii) \n \n2) Full-time in Maui \nRelocation considered only for extremely compelling opportunities; I am willing and able to relocate outside of the US. \n \nI would be very excited to be part of an effort to bring broadband (fiber specifically) to more US households. I would consider donating my time as a consultant (no engineering work) to help educate government officials on the technology and define technical requirements for such a project. My vision is an open access municipal fiber network. \n \nI am interested in projects that involve being part of a team creating a product/service that provides a meaningful value to society. This product/service will further promote the usage and value of the Internet. I am looking to be in a role that also allows me to contribute to the larger vision of the project. \n \nCompany type: Technology, communications, education, entertainment. The company must involve the Internet as part of its core product/service and must embrace the Internet culture, character and philosophy. \n \nResponsibilities: I bring >10 years experience with network operations and maintenance. My focus now is on design and testing (>5 years). I bring experience with large production networks (15+ million subscribers) to a start-up project (Google Fiber) to a private communications backbone. \n \nPersonality: Motivated professional. I am curious, inquisitive and have a sense of adventure. Engineering style: Open-minded, flexible, prefer open standards and look for simplicity in design and operation. The better you understand your subject matter, objective and can define your requirements, the better decisions and design you will have. Summary Due to a high volume of inquires, please read this to better understand my objectives: \n \n1) > 95% telecommute: Full-time or part-time, I will consider contract/term projects. \n(telecommuting from Maui, Hawaii) \n \n2) Full-time in Maui \nRelocation considered only for extremely compelling opportunities; I am willing and able to relocate outside of the US. \n \nI would be very excited to be part of an effort to bring broadband (fiber specifically) to more US households. I would consider donating my time as a consultant (no engineering work) to help educate government officials on the technology and define technical requirements for such a project. My vision is an open access municipal fiber network. \n \nI am interested in projects that involve being part of a team creating a product/service that provides a meaningful value to society. This product/service will further promote the usage and value of the Internet. I am looking to be in a role that also allows me to contribute to the larger vision of the project. \n \nCompany type: Technology, communications, education, entertainment. The company must involve the Internet as part of its core product/service and must embrace the Internet culture, character and philosophy. \n \nResponsibilities: I bring >10 years experience with network operations and maintenance. My focus now is on design and testing (>5 years). I bring experience with large production networks (15+ million subscribers) to a start-up project (Google Fiber) to a private communications backbone. \n \nPersonality: Motivated professional. I am curious, inquisitive and have a sense of adventure. Engineering style: Open-minded, flexible, prefer open standards and look for simplicity in design and operation. The better you understand your subject matter, objective and can define your requirements, the better decisions and design you will have. Due to a high volume of inquires, please read this to better understand my objectives: \n \n1) > 95% telecommute: Full-time or part-time, I will consider contract/term projects. \n(telecommuting from Maui, Hawaii) \n \n2) Full-time in Maui \nRelocation considered only for extremely compelling opportunities; I am willing and able to relocate outside of the US. \n \nI would be very excited to be part of an effort to bring broadband (fiber specifically) to more US households. I would consider donating my time as a consultant (no engineering work) to help educate government officials on the technology and define technical requirements for such a project. My vision is an open access municipal fiber network. \n \nI am interested in projects that involve being part of a team creating a product/service that provides a meaningful value to society. This product/service will further promote the usage and value of the Internet. I am looking to be in a role that also allows me to contribute to the larger vision of the project. \n \nCompany type: Technology, communications, education, entertainment. The company must involve the Internet as part of its core product/service and must embrace the Internet culture, character and philosophy. \n \nResponsibilities: I bring >10 years experience with network operations and maintenance. My focus now is on design and testing (>5 years). I bring experience with large production networks (15+ million subscribers) to a start-up project (Google Fiber) to a private communications backbone. \n \nPersonality: Motivated professional. I am curious, inquisitive and have a sense of adventure. Engineering style: Open-minded, flexible, prefer open standards and look for simplicity in design and operation. The better you understand your subject matter, objective and can define your requirements, the better decisions and design you will have. Due to a high volume of inquires, please read this to better understand my objectives: \n \n1) > 95% telecommute: Full-time or part-time, I will consider contract/term projects. \n(telecommuting from Maui, Hawaii) \n \n2) Full-time in Maui \nRelocation considered only for extremely compelling opportunities; I am willing and able to relocate outside of the US. \n \nI would be very excited to be part of an effort to bring broadband (fiber specifically) to more US households. I would consider donating my time as a consultant (no engineering work) to help educate government officials on the technology and define technical requirements for such a project. My vision is an open access municipal fiber network. \n \nI am interested in projects that involve being part of a team creating a product/service that provides a meaningful value to society. This product/service will further promote the usage and value of the Internet. I am looking to be in a role that also allows me to contribute to the larger vision of the project. \n \nCompany type: Technology, communications, education, entertainment. The company must involve the Internet as part of its core product/service and must embrace the Internet culture, character and philosophy. \n \nResponsibilities: I bring >10 years experience with network operations and maintenance. My focus now is on design and testing (>5 years). I bring experience with large production networks (15+ million subscribers) to a start-up project (Google Fiber) to a private communications backbone. \n \nPersonality: Motivated professional. I am curious, inquisitive and have a sense of adventure. Engineering style: Open-minded, flexible, prefer open standards and look for simplicity in design and operation. The better you understand your subject matter, objective and can define your requirements, the better decisions and design you will have. Experience Principal Network Engineer, Consultant, CEO EI Services, LLC April 2014  – Present (1 year 5 months) Maui, Hawaii I am working on private projects and considering fixed contracts within Hawaii (Maui preferred) or remotelyvia VPN (telecommute). \n \nMy strengths start with a strong BGP background; interconnection policy, peering and traffic engineering. I have a strong operations experience, skilled with troubleshooting, debugging and performing network maintenance. I am also skilled with ISIS, OSPF, QoS, in both Cisco and Juniper networks. I've worked with many other vendors at the access layer (eg, DOCSIS, GPON) as well. I am very passionate about Internet technologies and broadband and other service providers. I also have data cabling and data center experience. Senior Network Engineer IntelePeer Cloud Communications Inc March 2014  – Present (1 year 6 months) Greater Denver Area and Maui, Hawaii Network design and administration. Data centers, backbone, peering. \nScaling the network and deploying new services. Network Engineer, Operations & Escalations Google / Google Fiber January 2012  –  March 2014  (2 years 3 months) Mountain View, CA Network Operations Engineer, Google Fiber (AS16591) \n \nGoogle Fiber project. Senior/Lead Operations and Escalations Engineer. \nHelped develop/build the network from the ground up (and work out early bugs in the product). Established NOC processes and protocols, documentation and lead/implement network maintenance. Plenty of on-call. Lots of learning, and lots of sharing what I've learned (and had previously learned). Helped build the team (so many interviews). Worked on all layers of the network, access, core, edge. \n \nI continue to be fortunate; I have been able to observe and learn from some excellent talent over the last 5 years, from Comcast to Google Fiber. \n \nGoogle Fiber is hiring (Engineering and NOC positions) - so if you're looking and are a talented IP professional, you're welcome to message me. Must relocate to Mountain View, CA for these positions. IP Engineer IntelePeer, Inc June 2010  –  January 2012  (1 year 8 months) Denver IntelePeer (AS32385) has been a great opportunity. I am in a very small group and my primary responsibility is to architect/design for the production IP network... to support our voice service and products. I also split my time on operational issues. I attend to all needs of the IP network. We operate a US backbone with 5 peering locations (exchange points / data centers), and I largely focus on most of our BGP design and routing policy. My peer and I manage the office networks too - including their Internet and connectivity to our backbone. In my first year, I've done a lot to improve upon and expand/grow the network. Senior Network Engineer Comcast Cable April 2010  –  June 2010  (3 months) Comcast Media Center (CMC) Network Operations \nThere were two parts to this network, one was general building and office connectivity, but the production/service network was a high-availability network that carried highly critical data and services. The latter was my focus/assignment. This was a small purpose-built network that connected to the backbone and distributed content nationally. The CMC is a major national data center for Comcast, focusing on its video offering. \n \nI wasn't here long, when IntelePeer found me and the opportunity was too good to pass (it was a near perfect match in my skills and their needs). The timing was right. Senior Network Engineer, Backbone Operations Comcast Cable January 2009  –  April 2010  (1 year 4 months) This is an extension/continuation of my \"Network Engineer\" title and description below..... \n \nAs a Senior Engineer (Comcast Backbone, AS 7922), I was the escalation point on high-profile projects, outages and other issues. I was on-call, would work maintenance windows and attend meetings to technically represent our team/desk. I would review, approve and implement network changes/maintenance, as well as author MOP's/write processes and develop configuration templates. I was generally focused/tasked on network audits, BGP peering policy and new peering interconnections/activations. I was 'lead' on our 'SIP peering' (VoIP exchange). I was involved with most/all major BGP related issues or changes, and managed many of our traffic engineering needs. I worked with a small team to create and maintain policy - BGP/routing/peering, QoS and security. \n \nI was highly-skilled and experienced with our design, operation and the associated technologies of the CRAN and backbone networks. Comcast had >25 CRAN's (markets) at peak, but has started to consolidate the networks, each of which would peer with the backbone in a fully-redundant model. The backbone was near Tier1 in size and operation, and growing quite fast commercially. There was also a \"CBONE\" or private backbone to carry specific services between Comcast markets and data centers. Prior to working on the backbone full-time+, I was assigned to as many as 10 different CRAN's also. I believe we were at 20 million cable modem subscribers also. I would work on circuits ranging from T1, GigE, TenGig to 40G/OC768. \n \nI love the Internet and the concept of it... independent networks peering and interconnecting with each other. A GLOBAL system of thousands of interconnected networks, each in theory independent and owned by separate powers and groups or individuals. I enjoy being part of the community, a small piece of the Internet. Network Engineer (Operations) Comcast April 2004  –  December 2008  (4 years 9 months) I started as a \"NOC Analyst,\" quickly moving into a senior role and then into engineering. I am skilled at troubleshooting (investigation & analysis); finding and resolving all types of network problems. I started with the Comcast \"West NOC\" (Denver Tech Center), as they were developing their own platform (moving off of @Home). I was involved with some of the initial/early RAN and WAN designs and deployments, and eventually a full North American IP backbone (almost a Tier1). \n \nI spent a large portion of my early time working overnight, performing network maintenance. That provided a LOT of hands on experience and learning opportunities. This led to doing more complex work and maintenances, promotions and a natural evolution into engineering (also reading lots of books and building an impressive home lab). \n \nI started on the CMTS / DOCSIS edge, but always had a focus and skill on the IP side. Comcast deployed and operated many \"CRAN\" (Converged Regional Area Network) - providing data, voice and video (unicast and multicast) services over a common IP network. Each CRAN has many 'hubs' (data centers), running largely OSPF, ISIS and iBGP (limited RIP on the CMTS), then aggregating to edge routers, which provided (e)BGP connectivity to the Internet (first other ISP's, then the Comcast backbone). I'd work with all types of protocols and network technologies (layer 1-3)... Fiber, Cat5/6, Ethernet, ARP, STP, vlans, 802.1Q, HSRP/VRRP, Multicast, QoS, RIP, OSPF, ISIS, BGP, ACL, VPN, GRE, IPSec, IPv6 and more. I am well-skilled with the design and operation of HA (high-availability) networks. \n \nThe environment was mostly Cisco; I primarily worked with Cisco 6500/7600 and CRS platforms (IOS & IOS-XR). I had some exposure to Juniper MX series and Junos. I have limited MPLS experience, mostly in configuring LDP to establish adjacency and exchange basic label info to establish MPLS pseudowires. Internet Security Specialist Comcast May 2000  –  April 2004  (4 years) I was split between the Network Abuse desk/role and an Internet Security Specialist role in the risk management department. Over the four years in this position, the responsibilities and duties evolved quite significantly. My duties ranged from policy enforcement issues (network abuse: copyright violations, spam, phishing, hijacking, DoS, hacking and incident response) to a few cases of systems forensics (EnCase) and other various cases, some of which required law enforcement interaction (subpoena support, legal orders, etc). I assisted with AUP revisions and separately internal and external network risk assessments/analysis, disaster recovery planning and incident response drills. \n \nIn the 'early days' of network abuse there were a fair amount of legitimate hacking cases that were fun to investigate, in the end viruses/worms/Trojans took over, and Spam was out of control at the time. The Comcast purchase of AT&T Broadband provided what proved out to be a wonderful career opportunity and change - I changed my focus to IP Network operations and engineering. Comcast moved abuse (and security) to the east coast and the function largely became a customer support function. NOC Analyst Comcast Cable November 1998  –  May 2000  (1 year 7 months) I started with MediaOne (which became AT&T Broadband, and then Comcast) while living in Minnesota as a technical support specialist, just as the first (one-way) cable modems were being deployed (beta) in the Twin Cities area. I then moved to the local NOC (/management center) as data and voice services were beginning to be launched. This was an exciting time of growth, both personally, professionally and in the industry. I was a lead IP technician in both the sales/support and NOC roles. In the NOC, we monitored both the HFC (hybrid coax-fiber) plant and IP network. Principal Network Engineer, Consultant, CEO EI Services, LLC April 2014  – Present (1 year 5 months) Maui, Hawaii I am working on private projects and considering fixed contracts within Hawaii (Maui preferred) or remotelyvia VPN (telecommute). \n \nMy strengths start with a strong BGP background; interconnection policy, peering and traffic engineering. I have a strong operations experience, skilled with troubleshooting, debugging and performing network maintenance. I am also skilled with ISIS, OSPF, QoS, in both Cisco and Juniper networks. I've worked with many other vendors at the access layer (eg, DOCSIS, GPON) as well. I am very passionate about Internet technologies and broadband and other service providers. I also have data cabling and data center experience. Principal Network Engineer, Consultant, CEO EI Services, LLC April 2014  – Present (1 year 5 months) Maui, Hawaii I am working on private projects and considering fixed contracts within Hawaii (Maui preferred) or remotelyvia VPN (telecommute). \n \nMy strengths start with a strong BGP background; interconnection policy, peering and traffic engineering. I have a strong operations experience, skilled with troubleshooting, debugging and performing network maintenance. I am also skilled with ISIS, OSPF, QoS, in both Cisco and Juniper networks. I've worked with many other vendors at the access layer (eg, DOCSIS, GPON) as well. I am very passionate about Internet technologies and broadband and other service providers. I also have data cabling and data center experience. Senior Network Engineer IntelePeer Cloud Communications Inc March 2014  – Present (1 year 6 months) Greater Denver Area and Maui, Hawaii Network design and administration. Data centers, backbone, peering. \nScaling the network and deploying new services. Senior Network Engineer IntelePeer Cloud Communications Inc March 2014  – Present (1 year 6 months) Greater Denver Area and Maui, Hawaii Network design and administration. Data centers, backbone, peering. \nScaling the network and deploying new services. Network Engineer, Operations & Escalations Google / Google Fiber January 2012  –  March 2014  (2 years 3 months) Mountain View, CA Network Operations Engineer, Google Fiber (AS16591) \n \nGoogle Fiber project. Senior/Lead Operations and Escalations Engineer. \nHelped develop/build the network from the ground up (and work out early bugs in the product). Established NOC processes and protocols, documentation and lead/implement network maintenance. Plenty of on-call. Lots of learning, and lots of sharing what I've learned (and had previously learned). Helped build the team (so many interviews). Worked on all layers of the network, access, core, edge. \n \nI continue to be fortunate; I have been able to observe and learn from some excellent talent over the last 5 years, from Comcast to Google Fiber. \n \nGoogle Fiber is hiring (Engineering and NOC positions) - so if you're looking and are a talented IP professional, you're welcome to message me. Must relocate to Mountain View, CA for these positions. Network Engineer, Operations & Escalations Google / Google Fiber January 2012  –  March 2014  (2 years 3 months) Mountain View, CA Network Operations Engineer, Google Fiber (AS16591) \n \nGoogle Fiber project. Senior/Lead Operations and Escalations Engineer. \nHelped develop/build the network from the ground up (and work out early bugs in the product). Established NOC processes and protocols, documentation and lead/implement network maintenance. Plenty of on-call. Lots of learning, and lots of sharing what I've learned (and had previously learned). Helped build the team (so many interviews). Worked on all layers of the network, access, core, edge. \n \nI continue to be fortunate; I have been able to observe and learn from some excellent talent over the last 5 years, from Comcast to Google Fiber. \n \nGoogle Fiber is hiring (Engineering and NOC positions) - so if you're looking and are a talented IP professional, you're welcome to message me. Must relocate to Mountain View, CA for these positions. IP Engineer IntelePeer, Inc June 2010  –  January 2012  (1 year 8 months) Denver IntelePeer (AS32385) has been a great opportunity. I am in a very small group and my primary responsibility is to architect/design for the production IP network... to support our voice service and products. I also split my time on operational issues. I attend to all needs of the IP network. We operate a US backbone with 5 peering locations (exchange points / data centers), and I largely focus on most of our BGP design and routing policy. My peer and I manage the office networks too - including their Internet and connectivity to our backbone. In my first year, I've done a lot to improve upon and expand/grow the network. IP Engineer IntelePeer, Inc June 2010  –  January 2012  (1 year 8 months) Denver IntelePeer (AS32385) has been a great opportunity. I am in a very small group and my primary responsibility is to architect/design for the production IP network... to support our voice service and products. I also split my time on operational issues. I attend to all needs of the IP network. We operate a US backbone with 5 peering locations (exchange points / data centers), and I largely focus on most of our BGP design and routing policy. My peer and I manage the office networks too - including their Internet and connectivity to our backbone. In my first year, I've done a lot to improve upon and expand/grow the network. Senior Network Engineer Comcast Cable April 2010  –  June 2010  (3 months) Comcast Media Center (CMC) Network Operations \nThere were two parts to this network, one was general building and office connectivity, but the production/service network was a high-availability network that carried highly critical data and services. The latter was my focus/assignment. This was a small purpose-built network that connected to the backbone and distributed content nationally. The CMC is a major national data center for Comcast, focusing on its video offering. \n \nI wasn't here long, when IntelePeer found me and the opportunity was too good to pass (it was a near perfect match in my skills and their needs). The timing was right. Senior Network Engineer Comcast Cable April 2010  –  June 2010  (3 months) Comcast Media Center (CMC) Network Operations \nThere were two parts to this network, one was general building and office connectivity, but the production/service network was a high-availability network that carried highly critical data and services. The latter was my focus/assignment. This was a small purpose-built network that connected to the backbone and distributed content nationally. The CMC is a major national data center for Comcast, focusing on its video offering. \n \nI wasn't here long, when IntelePeer found me and the opportunity was too good to pass (it was a near perfect match in my skills and their needs). The timing was right. Senior Network Engineer, Backbone Operations Comcast Cable January 2009  –  April 2010  (1 year 4 months) This is an extension/continuation of my \"Network Engineer\" title and description below..... \n \nAs a Senior Engineer (Comcast Backbone, AS 7922), I was the escalation point on high-profile projects, outages and other issues. I was on-call, would work maintenance windows and attend meetings to technically represent our team/desk. I would review, approve and implement network changes/maintenance, as well as author MOP's/write processes and develop configuration templates. I was generally focused/tasked on network audits, BGP peering policy and new peering interconnections/activations. I was 'lead' on our 'SIP peering' (VoIP exchange). I was involved with most/all major BGP related issues or changes, and managed many of our traffic engineering needs. I worked with a small team to create and maintain policy - BGP/routing/peering, QoS and security. \n \nI was highly-skilled and experienced with our design, operation and the associated technologies of the CRAN and backbone networks. Comcast had >25 CRAN's (markets) at peak, but has started to consolidate the networks, each of which would peer with the backbone in a fully-redundant model. The backbone was near Tier1 in size and operation, and growing quite fast commercially. There was also a \"CBONE\" or private backbone to carry specific services between Comcast markets and data centers. Prior to working on the backbone full-time+, I was assigned to as many as 10 different CRAN's also. I believe we were at 20 million cable modem subscribers also. I would work on circuits ranging from T1, GigE, TenGig to 40G/OC768. \n \nI love the Internet and the concept of it... independent networks peering and interconnecting with each other. A GLOBAL system of thousands of interconnected networks, each in theory independent and owned by separate powers and groups or individuals. I enjoy being part of the community, a small piece of the Internet. Senior Network Engineer, Backbone Operations Comcast Cable January 2009  –  April 2010  (1 year 4 months) This is an extension/continuation of my \"Network Engineer\" title and description below..... \n \nAs a Senior Engineer (Comcast Backbone, AS 7922), I was the escalation point on high-profile projects, outages and other issues. I was on-call, would work maintenance windows and attend meetings to technically represent our team/desk. I would review, approve and implement network changes/maintenance, as well as author MOP's/write processes and develop configuration templates. I was generally focused/tasked on network audits, BGP peering policy and new peering interconnections/activations. I was 'lead' on our 'SIP peering' (VoIP exchange). I was involved with most/all major BGP related issues or changes, and managed many of our traffic engineering needs. I worked with a small team to create and maintain policy - BGP/routing/peering, QoS and security. \n \nI was highly-skilled and experienced with our design, operation and the associated technologies of the CRAN and backbone networks. Comcast had >25 CRAN's (markets) at peak, but has started to consolidate the networks, each of which would peer with the backbone in a fully-redundant model. The backbone was near Tier1 in size and operation, and growing quite fast commercially. There was also a \"CBONE\" or private backbone to carry specific services between Comcast markets and data centers. Prior to working on the backbone full-time+, I was assigned to as many as 10 different CRAN's also. I believe we were at 20 million cable modem subscribers also. I would work on circuits ranging from T1, GigE, TenGig to 40G/OC768. \n \nI love the Internet and the concept of it... independent networks peering and interconnecting with each other. A GLOBAL system of thousands of interconnected networks, each in theory independent and owned by separate powers and groups or individuals. I enjoy being part of the community, a small piece of the Internet. Network Engineer (Operations) Comcast April 2004  –  December 2008  (4 years 9 months) I started as a \"NOC Analyst,\" quickly moving into a senior role and then into engineering. I am skilled at troubleshooting (investigation & analysis); finding and resolving all types of network problems. I started with the Comcast \"West NOC\" (Denver Tech Center), as they were developing their own platform (moving off of @Home). I was involved with some of the initial/early RAN and WAN designs and deployments, and eventually a full North American IP backbone (almost a Tier1). \n \nI spent a large portion of my early time working overnight, performing network maintenance. That provided a LOT of hands on experience and learning opportunities. This led to doing more complex work and maintenances, promotions and a natural evolution into engineering (also reading lots of books and building an impressive home lab). \n \nI started on the CMTS / DOCSIS edge, but always had a focus and skill on the IP side. Comcast deployed and operated many \"CRAN\" (Converged Regional Area Network) - providing data, voice and video (unicast and multicast) services over a common IP network. Each CRAN has many 'hubs' (data centers), running largely OSPF, ISIS and iBGP (limited RIP on the CMTS), then aggregating to edge routers, which provided (e)BGP connectivity to the Internet (first other ISP's, then the Comcast backbone). I'd work with all types of protocols and network technologies (layer 1-3)... Fiber, Cat5/6, Ethernet, ARP, STP, vlans, 802.1Q, HSRP/VRRP, Multicast, QoS, RIP, OSPF, ISIS, BGP, ACL, VPN, GRE, IPSec, IPv6 and more. I am well-skilled with the design and operation of HA (high-availability) networks. \n \nThe environment was mostly Cisco; I primarily worked with Cisco 6500/7600 and CRS platforms (IOS & IOS-XR). I had some exposure to Juniper MX series and Junos. I have limited MPLS experience, mostly in configuring LDP to establish adjacency and exchange basic label info to establish MPLS pseudowires. Network Engineer (Operations) Comcast April 2004  –  December 2008  (4 years 9 months) I started as a \"NOC Analyst,\" quickly moving into a senior role and then into engineering. I am skilled at troubleshooting (investigation & analysis); finding and resolving all types of network problems. I started with the Comcast \"West NOC\" (Denver Tech Center), as they were developing their own platform (moving off of @Home). I was involved with some of the initial/early RAN and WAN designs and deployments, and eventually a full North American IP backbone (almost a Tier1). \n \nI spent a large portion of my early time working overnight, performing network maintenance. That provided a LOT of hands on experience and learning opportunities. This led to doing more complex work and maintenances, promotions and a natural evolution into engineering (also reading lots of books and building an impressive home lab). \n \nI started on the CMTS / DOCSIS edge, but always had a focus and skill on the IP side. Comcast deployed and operated many \"CRAN\" (Converged Regional Area Network) - providing data, voice and video (unicast and multicast) services over a common IP network. Each CRAN has many 'hubs' (data centers), running largely OSPF, ISIS and iBGP (limited RIP on the CMTS), then aggregating to edge routers, which provided (e)BGP connectivity to the Internet (first other ISP's, then the Comcast backbone). I'd work with all types of protocols and network technologies (layer 1-3)... Fiber, Cat5/6, Ethernet, ARP, STP, vlans, 802.1Q, HSRP/VRRP, Multicast, QoS, RIP, OSPF, ISIS, BGP, ACL, VPN, GRE, IPSec, IPv6 and more. I am well-skilled with the design and operation of HA (high-availability) networks. \n \nThe environment was mostly Cisco; I primarily worked with Cisco 6500/7600 and CRS platforms (IOS & IOS-XR). I had some exposure to Juniper MX series and Junos. I have limited MPLS experience, mostly in configuring LDP to establish adjacency and exchange basic label info to establish MPLS pseudowires. Internet Security Specialist Comcast May 2000  –  April 2004  (4 years) I was split between the Network Abuse desk/role and an Internet Security Specialist role in the risk management department. Over the four years in this position, the responsibilities and duties evolved quite significantly. My duties ranged from policy enforcement issues (network abuse: copyright violations, spam, phishing, hijacking, DoS, hacking and incident response) to a few cases of systems forensics (EnCase) and other various cases, some of which required law enforcement interaction (subpoena support, legal orders, etc). I assisted with AUP revisions and separately internal and external network risk assessments/analysis, disaster recovery planning and incident response drills. \n \nIn the 'early days' of network abuse there were a fair amount of legitimate hacking cases that were fun to investigate, in the end viruses/worms/Trojans took over, and Spam was out of control at the time. The Comcast purchase of AT&T Broadband provided what proved out to be a wonderful career opportunity and change - I changed my focus to IP Network operations and engineering. Comcast moved abuse (and security) to the east coast and the function largely became a customer support function. Internet Security Specialist Comcast May 2000  –  April 2004  (4 years) I was split between the Network Abuse desk/role and an Internet Security Specialist role in the risk management department. Over the four years in this position, the responsibilities and duties evolved quite significantly. My duties ranged from policy enforcement issues (network abuse: copyright violations, spam, phishing, hijacking, DoS, hacking and incident response) to a few cases of systems forensics (EnCase) and other various cases, some of which required law enforcement interaction (subpoena support, legal orders, etc). I assisted with AUP revisions and separately internal and external network risk assessments/analysis, disaster recovery planning and incident response drills. \n \nIn the 'early days' of network abuse there were a fair amount of legitimate hacking cases that were fun to investigate, in the end viruses/worms/Trojans took over, and Spam was out of control at the time. The Comcast purchase of AT&T Broadband provided what proved out to be a wonderful career opportunity and change - I changed my focus to IP Network operations and engineering. Comcast moved abuse (and security) to the east coast and the function largely became a customer support function. NOC Analyst Comcast Cable November 1998  –  May 2000  (1 year 7 months) I started with MediaOne (which became AT&T Broadband, and then Comcast) while living in Minnesota as a technical support specialist, just as the first (one-way) cable modems were being deployed (beta) in the Twin Cities area. I then moved to the local NOC (/management center) as data and voice services were beginning to be launched. This was an exciting time of growth, both personally, professionally and in the industry. I was a lead IP technician in both the sales/support and NOC roles. In the NOC, we monitored both the HFC (hybrid coax-fiber) plant and IP network. NOC Analyst Comcast Cable November 1998  –  May 2000  (1 year 7 months) I started with MediaOne (which became AT&T Broadband, and then Comcast) while living in Minnesota as a technical support specialist, just as the first (one-way) cable modems were being deployed (beta) in the Twin Cities area. I then moved to the local NOC (/management center) as data and voice services were beginning to be launched. This was an exciting time of growth, both personally, professionally and in the industry. I was a lead IP technician in both the sales/support and NOC roles. In the NOC, we monitored both the HFC (hybrid coax-fiber) plant and IP network. Skills BGP Cisco IOS Juniper OSPF IPSec Cisco CRS Cisco IOS-XR Cisco 7600 ISIS IP Multicast IPTV VoIP SIP Peering TCP/IP Network Engineering Network Design Network Administration Co-location Netflow Computer Network... IPv6 DNS HSRP VRRP VPN Technology Change... Network Maintenance Network Abuse QoS FreeBSD Linux Unix Shell Scripting IOS-XR Cisco Technologies CCIP Data Center Routers Ethernet VLAN Routing MPLS IP WAN RIP SIP Juniper Technologies See 31+     See less Skills  BGP Cisco IOS Juniper OSPF IPSec Cisco CRS Cisco IOS-XR Cisco 7600 ISIS IP Multicast IPTV VoIP SIP Peering TCP/IP Network Engineering Network Design Network Administration Co-location Netflow Computer Network... IPv6 DNS HSRP VRRP VPN Technology Change... Network Maintenance Network Abuse QoS FreeBSD Linux Unix Shell Scripting IOS-XR Cisco Technologies CCIP Data Center Routers Ethernet VLAN Routing MPLS IP WAN RIP SIP Juniper Technologies See 31+     See less BGP Cisco IOS Juniper OSPF IPSec Cisco CRS Cisco IOS-XR Cisco 7600 ISIS IP Multicast IPTV VoIP SIP Peering TCP/IP Network Engineering Network Design Network Administration Co-location Netflow Computer Network... IPv6 DNS HSRP VRRP VPN Technology Change... Network Maintenance Network Abuse QoS FreeBSD Linux Unix Shell Scripting IOS-XR Cisco Technologies CCIP Data Center Routers Ethernet VLAN Routing MPLS IP WAN RIP SIP Juniper Technologies See 31+     See less BGP Cisco IOS Juniper OSPF IPSec Cisco CRS Cisco IOS-XR Cisco 7600 ISIS IP Multicast IPTV VoIP SIP Peering TCP/IP Network Engineering Network Design Network Administration Co-location Netflow Computer Network... IPv6 DNS HSRP VRRP VPN Technology Change... Network Maintenance Network Abuse QoS FreeBSD Linux Unix Shell Scripting IOS-XR Cisco Technologies CCIP Data Center Routers Ethernet VLAN Routing MPLS IP WAN RIP SIP Juniper Technologies See 31+     See less ", "Summary Network Engineer with broad experience in designing, operating and troubleshooting large telecommunication / service provider networks. \n \nI have a strong interest in efficient traffic engineering and network security. \n \nSpecialties: Multiple Vendor IP routing & switching experience across Cisco, Juniper, Aruba & Redback \nJuniper SRX firewall management \nIP Interconnect and Peering \nPython & Perl scripting for network automation Summary Network Engineer with broad experience in designing, operating and troubleshooting large telecommunication / service provider networks. \n \nI have a strong interest in efficient traffic engineering and network security. \n \nSpecialties: Multiple Vendor IP routing & switching experience across Cisco, Juniper, Aruba & Redback \nJuniper SRX firewall management \nIP Interconnect and Peering \nPython & Perl scripting for network automation Network Engineer with broad experience in designing, operating and troubleshooting large telecommunication / service provider networks. \n \nI have a strong interest in efficient traffic engineering and network security. \n \nSpecialties: Multiple Vendor IP routing & switching experience across Cisco, Juniper, Aruba & Redback \nJuniper SRX firewall management \nIP Interconnect and Peering \nPython & Perl scripting for network automation Network Engineer with broad experience in designing, operating and troubleshooting large telecommunication / service provider networks. \n \nI have a strong interest in efficient traffic engineering and network security. \n \nSpecialties: Multiple Vendor IP routing & switching experience across Cisco, Juniper, Aruba & Redback \nJuniper SRX firewall management \nIP Interconnect and Peering \nPython & Perl scripting for network automation Experience Network Engineer Google November 2013  – Present (1 year 10 months) Sydney Network Surveillance Team Network Deployment Engineer Google May 2013  –  October 2013  (6 months) Sydney Area, Australia As a deploy engineer, I was responsible for new network builds on the corporate Google network, along with expansions to the existing network, with a primary focus on the APAC region. \n \nI was also tasked with improving current processes along with designing & implementing new network technologies, while working with partner teams to improve current network designs. Network Engineer Google July 2012  –  April 2013  (10 months) Sydney Area, Australia Member of a global team looking after day to day operations of the Google Corporate network, and acting as an escalation point for network related faults and issues. \n \nWorking on a network spanning numerous countries, my daily role involved: \n \n- Improving network resiliency \n- Executing planned network changes for internal stakeholders \n- Developing efficient operational designs and improving standard processes \n- Mentoring junior team members \n \nMy core focus areas were LAN/WAN routing, wireless and network security across a multi-vendor environment (Juniper / Cisco / Aruba) Network Engineer iiNet December 2010  –  June 2012  (1 year 7 months) Perth Area, Australia My role involved designing & deploying iiNet's core network, and acting as an escalation point for network related faults. \n \n- IP Interconnect and peering with external parties \n- Design and deployment of networks for internal and external stakeholders \n- Network security administration \n- 24/7 on-call fault escalation and resolution \n- QoS and TE optimization for consistent end user experience \n \nMy core focus areas were EBGP Peering, MPLS TE & DSL Subscriber Management. Network Administrator - Voice Engineering iiNet April 2010  –  December 2010  (9 months) Daily role included conceptual design and development of new products (VoIP Network Focused), in addition to network maintenance & troubleshooting. \n \nHad experience with: \n \n- Voice protocols such as SIP, MGCP & SS7 \n- Broadsoft Broadworks Voice Applications \n- Juniper CTP (TDM over IP) \n- Cisco ITP (SS7 over IP) \n- AcmePacket SBC's \n- Solaris & Unix Server Administration Network Administrator iiNet January 2009  –  February 2010  (1 year 2 months) As part of the iiNet Graduate intake, I spent a year across three teams: \n \n- Network Design & Deployment : conceptual design & delivery of future products \n- Network Operations Center : tier0 support for network & system faults \n- Network Operations Team: day to day management (including deployment) & troubleshooting of iiNet's core network Sales Person Harvey Norman August 2007  –  December 2008  (1 year 5 months) Computer & I.T related sales / support Network Engineer Google November 2013  – Present (1 year 10 months) Sydney Network Surveillance Team Network Engineer Google November 2013  – Present (1 year 10 months) Sydney Network Surveillance Team Network Deployment Engineer Google May 2013  –  October 2013  (6 months) Sydney Area, Australia As a deploy engineer, I was responsible for new network builds on the corporate Google network, along with expansions to the existing network, with a primary focus on the APAC region. \n \nI was also tasked with improving current processes along with designing & implementing new network technologies, while working with partner teams to improve current network designs. Network Deployment Engineer Google May 2013  –  October 2013  (6 months) Sydney Area, Australia As a deploy engineer, I was responsible for new network builds on the corporate Google network, along with expansions to the existing network, with a primary focus on the APAC region. \n \nI was also tasked with improving current processes along with designing & implementing new network technologies, while working with partner teams to improve current network designs. Network Engineer Google July 2012  –  April 2013  (10 months) Sydney Area, Australia Member of a global team looking after day to day operations of the Google Corporate network, and acting as an escalation point for network related faults and issues. \n \nWorking on a network spanning numerous countries, my daily role involved: \n \n- Improving network resiliency \n- Executing planned network changes for internal stakeholders \n- Developing efficient operational designs and improving standard processes \n- Mentoring junior team members \n \nMy core focus areas were LAN/WAN routing, wireless and network security across a multi-vendor environment (Juniper / Cisco / Aruba) Network Engineer Google July 2012  –  April 2013  (10 months) Sydney Area, Australia Member of a global team looking after day to day operations of the Google Corporate network, and acting as an escalation point for network related faults and issues. \n \nWorking on a network spanning numerous countries, my daily role involved: \n \n- Improving network resiliency \n- Executing planned network changes for internal stakeholders \n- Developing efficient operational designs and improving standard processes \n- Mentoring junior team members \n \nMy core focus areas were LAN/WAN routing, wireless and network security across a multi-vendor environment (Juniper / Cisco / Aruba) Network Engineer iiNet December 2010  –  June 2012  (1 year 7 months) Perth Area, Australia My role involved designing & deploying iiNet's core network, and acting as an escalation point for network related faults. \n \n- IP Interconnect and peering with external parties \n- Design and deployment of networks for internal and external stakeholders \n- Network security administration \n- 24/7 on-call fault escalation and resolution \n- QoS and TE optimization for consistent end user experience \n \nMy core focus areas were EBGP Peering, MPLS TE & DSL Subscriber Management. Network Engineer iiNet December 2010  –  June 2012  (1 year 7 months) Perth Area, Australia My role involved designing & deploying iiNet's core network, and acting as an escalation point for network related faults. \n \n- IP Interconnect and peering with external parties \n- Design and deployment of networks for internal and external stakeholders \n- Network security administration \n- 24/7 on-call fault escalation and resolution \n- QoS and TE optimization for consistent end user experience \n \nMy core focus areas were EBGP Peering, MPLS TE & DSL Subscriber Management. Network Administrator - Voice Engineering iiNet April 2010  –  December 2010  (9 months) Daily role included conceptual design and development of new products (VoIP Network Focused), in addition to network maintenance & troubleshooting. \n \nHad experience with: \n \n- Voice protocols such as SIP, MGCP & SS7 \n- Broadsoft Broadworks Voice Applications \n- Juniper CTP (TDM over IP) \n- Cisco ITP (SS7 over IP) \n- AcmePacket SBC's \n- Solaris & Unix Server Administration Network Administrator - Voice Engineering iiNet April 2010  –  December 2010  (9 months) Daily role included conceptual design and development of new products (VoIP Network Focused), in addition to network maintenance & troubleshooting. \n \nHad experience with: \n \n- Voice protocols such as SIP, MGCP & SS7 \n- Broadsoft Broadworks Voice Applications \n- Juniper CTP (TDM over IP) \n- Cisco ITP (SS7 over IP) \n- AcmePacket SBC's \n- Solaris & Unix Server Administration Network Administrator iiNet January 2009  –  February 2010  (1 year 2 months) As part of the iiNet Graduate intake, I spent a year across three teams: \n \n- Network Design & Deployment : conceptual design & delivery of future products \n- Network Operations Center : tier0 support for network & system faults \n- Network Operations Team: day to day management (including deployment) & troubleshooting of iiNet's core network Network Administrator iiNet January 2009  –  February 2010  (1 year 2 months) As part of the iiNet Graduate intake, I spent a year across three teams: \n \n- Network Design & Deployment : conceptual design & delivery of future products \n- Network Operations Center : tier0 support for network & system faults \n- Network Operations Team: day to day management (including deployment) & troubleshooting of iiNet's core network Sales Person Harvey Norman August 2007  –  December 2008  (1 year 5 months) Computer & I.T related sales / support Sales Person Harvey Norman August 2007  –  December 2008  (1 year 5 months) Computer & I.T related sales / support Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency Malayalam English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency Malayalam English Native or bilingual proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency Malayalam Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Juniper Cisco Troubleshooting Routing Switches OSPF Network Security MPLS Network Design QoS DSL BGP Unix Cisco Technologies Routing Protocols LAN-WAN F5 BigIP Cisco Nexus Data Center WAN EIGRP IP Telecommunications Network Engineering Network Administration Firewalls VoIP SIP Networking Computer Network... TCP/IP Wireless Cisco IOS Linux See 19+     See less Skills  Juniper Cisco Troubleshooting Routing Switches OSPF Network Security MPLS Network Design QoS DSL BGP Unix Cisco Technologies Routing Protocols LAN-WAN F5 BigIP Cisco Nexus Data Center WAN EIGRP IP Telecommunications Network Engineering Network Administration Firewalls VoIP SIP Networking Computer Network... TCP/IP Wireless Cisco IOS Linux See 19+     See less Juniper Cisco Troubleshooting Routing Switches OSPF Network Security MPLS Network Design QoS DSL BGP Unix Cisco Technologies Routing Protocols LAN-WAN F5 BigIP Cisco Nexus Data Center WAN EIGRP IP Telecommunications Network Engineering Network Administration Firewalls VoIP SIP Networking Computer Network... TCP/IP Wireless Cisco IOS Linux See 19+     See less Juniper Cisco Troubleshooting Routing Switches OSPF Network Security MPLS Network Design QoS DSL BGP Unix Cisco Technologies Routing Protocols LAN-WAN F5 BigIP Cisco Nexus Data Center WAN EIGRP IP Telecommunications Network Engineering Network Administration Firewalls VoIP SIP Networking Computer Network... TCP/IP Wireless Cisco IOS Linux See 19+     See less Education Curtin University Bachelor of Technology,  Computer Systems & Networking 2006  – 2008 Designed and developed a portable computer, to be operated based on text to speech methods as an aid for the blind. \n \nBasic functions of the computer included: \n \n- Basic & Complex Artihmetic \n- Text to Speech based email client & RSS feed reader. Activities and Societies:  Curtin Student Ambassadors ,  Golden Key International Honor Society ,  Bronze Medalist - International Award for Young People Lakshmipat Singhania Academy, Kolkata High School 2001  – 2005 The Delta Study, Kochi 1992  – 2000 Curtin University Bachelor of Technology,  Computer Systems & Networking 2006  – 2008 Designed and developed a portable computer, to be operated based on text to speech methods as an aid for the blind. \n \nBasic functions of the computer included: \n \n- Basic & Complex Artihmetic \n- Text to Speech based email client & RSS feed reader. Activities and Societies:  Curtin Student Ambassadors ,  Golden Key International Honor Society ,  Bronze Medalist - International Award for Young People Curtin University Bachelor of Technology,  Computer Systems & Networking 2006  – 2008 Designed and developed a portable computer, to be operated based on text to speech methods as an aid for the blind. \n \nBasic functions of the computer included: \n \n- Basic & Complex Artihmetic \n- Text to Speech based email client & RSS feed reader. Activities and Societies:  Curtin Student Ambassadors ,  Golden Key International Honor Society ,  Bronze Medalist - International Award for Young People Curtin University Bachelor of Technology,  Computer Systems & Networking 2006  – 2008 Designed and developed a portable computer, to be operated based on text to speech methods as an aid for the blind. \n \nBasic functions of the computer included: \n \n- Basic & Complex Artihmetic \n- Text to Speech based email client & RSS feed reader. Activities and Societies:  Curtin Student Ambassadors ,  Golden Key International Honor Society ,  Bronze Medalist - International Award for Young People Lakshmipat Singhania Academy, Kolkata High School 2001  – 2005 Lakshmipat Singhania Academy, Kolkata High School 2001  – 2005 Lakshmipat Singhania Academy, Kolkata High School 2001  – 2005 The Delta Study, Kochi 1992  – 2000 The Delta Study, Kochi 1992  – 2000 The Delta Study, Kochi 1992  – 2000 ", "Experience Staff Network Engineer Google September 2011  – Present (4 years) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Staff Network Engineer Google September 2011  – Present (4 years) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Staff Network Engineer Google September 2011  – Present (4 years) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Skills Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Skills  Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Optical Communications Network Design Network Architecture Data Center Architecture Architecture Networking Testing Data Center Hardware Semiconductors Systems Engineering Ethernet Product Management Optical Fiber Routing IP Cloud Computing See 2+     See less Education UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE Peking University BS,  Electronics 1999  – 2003 UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE Peking University BS,  Electronics 1999  – 2003 Peking University BS,  Electronics 1999  – 2003 Peking University BS,  Electronics 1999  – 2003 ", "Skills Cisco Troubleshooting BGP Switches Routers OSPF Data Center Routing IP WAN Network Operations QoS IP Networking Routing Protocols Network Architecture TCP/IP MPLS VPN Multicast Network Design IPv6 Network Engineering VLAN VRRP Cisco IOS Ethernet HSRP JUNOS LAN Switching STP Wireshark RSTP IS-IS Cisco Technologies See 18+     See less Skills  Cisco Troubleshooting BGP Switches Routers OSPF Data Center Routing IP WAN Network Operations QoS IP Networking Routing Protocols Network Architecture TCP/IP MPLS VPN Multicast Network Design IPv6 Network Engineering VLAN VRRP Cisco IOS Ethernet HSRP JUNOS LAN Switching STP Wireshark RSTP IS-IS Cisco Technologies See 18+     See less Cisco Troubleshooting BGP Switches Routers OSPF Data Center Routing IP WAN Network Operations QoS IP Networking Routing Protocols Network Architecture TCP/IP MPLS VPN Multicast Network Design IPv6 Network Engineering VLAN VRRP Cisco IOS Ethernet HSRP JUNOS LAN Switching STP Wireshark RSTP IS-IS Cisco Technologies See 18+     See less Cisco Troubleshooting BGP Switches Routers OSPF Data Center Routing IP WAN Network Operations QoS IP Networking Routing Protocols Network Architecture TCP/IP MPLS VPN Multicast Network Design IPv6 Network Engineering VLAN VRRP Cisco IOS Ethernet HSRP JUNOS LAN Switching STP Wireshark RSTP IS-IS Cisco Technologies See 18+     See less ", "Experience Staff Network Engineer Google May 2015  – Present (4 months) Mountain View, Ca Senior Network Engineer Google September 2012  – Present (3 years) Mountain View, CA Tech Lead / Network Engineer Google January 2007  –  September 2012  (5 years 9 months) Dublin, Ireland IP Network Specialist GVT 2000  –  2006  (6 years) Staff Network Engineer Google May 2015  – Present (4 months) Mountain View, Ca Staff Network Engineer Google May 2015  – Present (4 months) Mountain View, Ca Senior Network Engineer Google September 2012  – Present (3 years) Mountain View, CA Senior Network Engineer Google September 2012  – Present (3 years) Mountain View, CA Tech Lead / Network Engineer Google January 2007  –  September 2012  (5 years 9 months) Dublin, Ireland Tech Lead / Network Engineer Google January 2007  –  September 2012  (5 years 9 months) Dublin, Ireland IP Network Specialist GVT 2000  –  2006  (6 years) IP Network Specialist GVT 2000  –  2006  (6 years) Languages Portuguese Portuguese Portuguese Skills Juniper Ethernet BGP OSPF MPLS IPv6 QoS Routing Routing Protocols IP TCP/IP Switches Network Design Cisco Technologies IPSec Network Architecture Routers RIP Cisco IOS JUNOS VPN SNMP See 7+     See less Skills  Juniper Ethernet BGP OSPF MPLS IPv6 QoS Routing Routing Protocols IP TCP/IP Switches Network Design Cisco Technologies IPSec Network Architecture Routers RIP Cisco IOS JUNOS VPN SNMP See 7+     See less Juniper Ethernet BGP OSPF MPLS IPv6 QoS Routing Routing Protocols IP TCP/IP Switches Network Design Cisco Technologies IPSec Network Architecture Routers RIP Cisco IOS JUNOS VPN SNMP See 7+     See less Juniper Ethernet BGP OSPF MPLS IPv6 QoS Routing Routing Protocols IP TCP/IP Switches Network Design Cisco Technologies IPSec Network Architecture Routers RIP Cisco IOS JUNOS VPN SNMP See 7+     See less Education UC Berkeley Master of Business Administration (MBA) 2013  – 2014 People's College Debating Society Debating Club 2010  – 2010 http://www.pcds.ie/ Activities and Societies:  Debating Society Dublin Business School Advanced Project Management 2008  – 2008 CEFET-PR MsC,  Telecommunications 1997  – 2000 PUC-PR Engenharia da Computacao,  Hardware 1992  – 1996 UC Berkeley Master of Business Administration (MBA) 2013  – 2014 UC Berkeley Master of Business Administration (MBA) 2013  – 2014 UC Berkeley Master of Business Administration (MBA) 2013  – 2014 People's College Debating Society Debating Club 2010  – 2010 http://www.pcds.ie/ Activities and Societies:  Debating Society People's College Debating Society Debating Club 2010  – 2010 http://www.pcds.ie/ Activities and Societies:  Debating Society People's College Debating Society Debating Club 2010  – 2010 http://www.pcds.ie/ Activities and Societies:  Debating Society Dublin Business School Advanced Project Management 2008  – 2008 Dublin Business School Advanced Project Management 2008  – 2008 Dublin Business School Advanced Project Management 2008  – 2008 CEFET-PR MsC,  Telecommunications 1997  – 2000 CEFET-PR MsC,  Telecommunications 1997  – 2000 CEFET-PR MsC,  Telecommunications 1997  – 2000 PUC-PR Engenharia da Computacao,  Hardware 1992  – 1996 PUC-PR Engenharia da Computacao,  Hardware 1992  – 1996 PUC-PR Engenharia da Computacao,  Hardware 1992  – 1996 Honors & Awards Additional Honors & Awards JNCIE #180 Additional Honors & Awards JNCIE #180 Additional Honors & Awards JNCIE #180 Additional Honors & Awards JNCIE #180 ", "Summary Experience in deployment of routing protocols in diverse environments. \n \nManagement of security and administration of systems using a wide range of operating systems. \n \nCCNA Certified \nJNCIA Certified \nJNCIS Certified \nJNCIP Certified \nLPIC-1 Certified \n>250 hours of CCIE/JNCIE lab study \n \nSpecialties: Wireless, Networking, Security, Network Design and Performance, Forensics, Unix/Windows Administration Summary Experience in deployment of routing protocols in diverse environments. \n \nManagement of security and administration of systems using a wide range of operating systems. \n \nCCNA Certified \nJNCIA Certified \nJNCIS Certified \nJNCIP Certified \nLPIC-1 Certified \n>250 hours of CCIE/JNCIE lab study \n \nSpecialties: Wireless, Networking, Security, Network Design and Performance, Forensics, Unix/Windows Administration Experience in deployment of routing protocols in diverse environments. \n \nManagement of security and administration of systems using a wide range of operating systems. \n \nCCNA Certified \nJNCIA Certified \nJNCIS Certified \nJNCIP Certified \nLPIC-1 Certified \n>250 hours of CCIE/JNCIE lab study \n \nSpecialties: Wireless, Networking, Security, Network Design and Performance, Forensics, Unix/Windows Administration Experience in deployment of routing protocols in diverse environments. \n \nManagement of security and administration of systems using a wide range of operating systems. \n \nCCNA Certified \nJNCIA Certified \nJNCIS Certified \nJNCIP Certified \nLPIC-1 Certified \n>250 hours of CCIE/JNCIE lab study \n \nSpecialties: Wireless, Networking, Security, Network Design and Performance, Forensics, Unix/Windows Administration Experience Corporate Network Engineer Google May 2013  – Present (2 years 4 months) Mountain View, CA • Troubleshooting and Maintenance of multiple vendor platforms (Cisco/Juniper/Aruba) \n• Participation in oncall rotation, serving as the main escalation point for all Global offices \n• Python development to automate and improve engineering processes \n• Ground up audits and redesign of enterprise protocol deployments \n• Lead for Juniper vendor, including case review and guiding direction of Resident Engineer \n• In-depth troubleshooting (IPv6/IPv4) of protocols OSPF, BGP, GRE, IPSEC, IGMP, 802.1x NOC Analyst - Google Fiber Google January 2013  –  May 2013  (5 months) Mountain View, CA •\tTroubleshooting, maintenance and configuration of Fiber To The Home technologies \n•\tMonitoring of ISP level multi-protocol networks from datacenter to home \n•\tPython development to automate and improve engineering processes \n•\tDiagnoses of end user hardware through pattern based low level log analysis Internal Technology Resident Google February 2011  –  January 2013  (2 years) Mountain View, CA •\tIdentify and troubleshoot wide variety of issues across Windows, Mac, Linux and Android \n•\tManage and assist user communication with numerous teams face to face \n•\tEscalation and debugging of complex enterprise system interactions \n•\tIdentification of areas for improvement with self-guided projects affecting global user base Network Operations Rotation - ITRP Google Inc October 2011  –  December 2011  (3 months) Mountain View, CA •\tManage escalation queue of global corporate network issues across various platforms \n•\tTroubleshooting of layer 2/3 network issues while observing SLA requirements \n•\tSelf-guided project work affecting thousands of devices globally \n•\tAudit and standardization of various protocol configurations \n•\tLayer 2 integration of network devices and end user systems \n•\tScript development to automate and improve engineering processes Field Technician Rochester Institute of Technology September 2006  –  January 2011  (4 years 5 months) Rochester, NY •\tDiagnose Software/Hardware issues across the domain both physically and remotely \n•\tDetermine issues with oracle related applications \n•\tIntegrate usability alongside strict security measures \n•\tDeploy new computers across campus and migrating user profiles \n•\tManagement and training of technical and non-technical student employees CALO Intern Cisco Systems March 2010  –  August 2010  (6 months) San Jose, CA •\tRecreation of network segments to aid in TAC troubleshooting \n•\tHands on experience with various Cisco equipment from ISRs to Nexus7k. \n•\tLayer 2 troubleshooting over copper and fiber Network Engineer Intern Fidelity Investments May 2009  –  August 2009  (4 months) Boston, MA •\tConfigure and deploy Juniper and Nortel VPN devices for large enterprise user base  \n•\tAnalyze and configure firewall devices to integrate into the Remote Access environment \n•\tUpgrade of the RA environment including certification, testing and recommendations \n•\tTroubleshoot user issues relating to the network and/or their specific configuration \n•\tAnalyze extranet and lab environments to ensure documentation and topologies are correct Student Manager Rochester Institute of Technology June 2008  –  August 2008  (3 months) Technical Support Usachoice Internet June 2004  –  August 2006  (2 years 3 months) Corporate Network Engineer Google May 2013  – Present (2 years 4 months) Mountain View, CA • Troubleshooting and Maintenance of multiple vendor platforms (Cisco/Juniper/Aruba) \n• Participation in oncall rotation, serving as the main escalation point for all Global offices \n• Python development to automate and improve engineering processes \n• Ground up audits and redesign of enterprise protocol deployments \n• Lead for Juniper vendor, including case review and guiding direction of Resident Engineer \n• In-depth troubleshooting (IPv6/IPv4) of protocols OSPF, BGP, GRE, IPSEC, IGMP, 802.1x Corporate Network Engineer Google May 2013  – Present (2 years 4 months) Mountain View, CA • Troubleshooting and Maintenance of multiple vendor platforms (Cisco/Juniper/Aruba) \n• Participation in oncall rotation, serving as the main escalation point for all Global offices \n• Python development to automate and improve engineering processes \n• Ground up audits and redesign of enterprise protocol deployments \n• Lead for Juniper vendor, including case review and guiding direction of Resident Engineer \n• In-depth troubleshooting (IPv6/IPv4) of protocols OSPF, BGP, GRE, IPSEC, IGMP, 802.1x NOC Analyst - Google Fiber Google January 2013  –  May 2013  (5 months) Mountain View, CA •\tTroubleshooting, maintenance and configuration of Fiber To The Home technologies \n•\tMonitoring of ISP level multi-protocol networks from datacenter to home \n•\tPython development to automate and improve engineering processes \n•\tDiagnoses of end user hardware through pattern based low level log analysis NOC Analyst - Google Fiber Google January 2013  –  May 2013  (5 months) Mountain View, CA •\tTroubleshooting, maintenance and configuration of Fiber To The Home technologies \n•\tMonitoring of ISP level multi-protocol networks from datacenter to home \n•\tPython development to automate and improve engineering processes \n•\tDiagnoses of end user hardware through pattern based low level log analysis Internal Technology Resident Google February 2011  –  January 2013  (2 years) Mountain View, CA •\tIdentify and troubleshoot wide variety of issues across Windows, Mac, Linux and Android \n•\tManage and assist user communication with numerous teams face to face \n•\tEscalation and debugging of complex enterprise system interactions \n•\tIdentification of areas for improvement with self-guided projects affecting global user base Internal Technology Resident Google February 2011  –  January 2013  (2 years) Mountain View, CA •\tIdentify and troubleshoot wide variety of issues across Windows, Mac, Linux and Android \n•\tManage and assist user communication with numerous teams face to face \n•\tEscalation and debugging of complex enterprise system interactions \n•\tIdentification of areas for improvement with self-guided projects affecting global user base Network Operations Rotation - ITRP Google Inc October 2011  –  December 2011  (3 months) Mountain View, CA •\tManage escalation queue of global corporate network issues across various platforms \n•\tTroubleshooting of layer 2/3 network issues while observing SLA requirements \n•\tSelf-guided project work affecting thousands of devices globally \n•\tAudit and standardization of various protocol configurations \n•\tLayer 2 integration of network devices and end user systems \n•\tScript development to automate and improve engineering processes Network Operations Rotation - ITRP Google Inc October 2011  –  December 2011  (3 months) Mountain View, CA •\tManage escalation queue of global corporate network issues across various platforms \n•\tTroubleshooting of layer 2/3 network issues while observing SLA requirements \n•\tSelf-guided project work affecting thousands of devices globally \n•\tAudit and standardization of various protocol configurations \n•\tLayer 2 integration of network devices and end user systems \n•\tScript development to automate and improve engineering processes Field Technician Rochester Institute of Technology September 2006  –  January 2011  (4 years 5 months) Rochester, NY •\tDiagnose Software/Hardware issues across the domain both physically and remotely \n•\tDetermine issues with oracle related applications \n•\tIntegrate usability alongside strict security measures \n•\tDeploy new computers across campus and migrating user profiles \n•\tManagement and training of technical and non-technical student employees Field Technician Rochester Institute of Technology September 2006  –  January 2011  (4 years 5 months) Rochester, NY •\tDiagnose Software/Hardware issues across the domain both physically and remotely \n•\tDetermine issues with oracle related applications \n•\tIntegrate usability alongside strict security measures \n•\tDeploy new computers across campus and migrating user profiles \n•\tManagement and training of technical and non-technical student employees CALO Intern Cisco Systems March 2010  –  August 2010  (6 months) San Jose, CA •\tRecreation of network segments to aid in TAC troubleshooting \n•\tHands on experience with various Cisco equipment from ISRs to Nexus7k. \n•\tLayer 2 troubleshooting over copper and fiber CALO Intern Cisco Systems March 2010  –  August 2010  (6 months) San Jose, CA •\tRecreation of network segments to aid in TAC troubleshooting \n•\tHands on experience with various Cisco equipment from ISRs to Nexus7k. \n•\tLayer 2 troubleshooting over copper and fiber Network Engineer Intern Fidelity Investments May 2009  –  August 2009  (4 months) Boston, MA •\tConfigure and deploy Juniper and Nortel VPN devices for large enterprise user base  \n•\tAnalyze and configure firewall devices to integrate into the Remote Access environment \n•\tUpgrade of the RA environment including certification, testing and recommendations \n•\tTroubleshoot user issues relating to the network and/or their specific configuration \n•\tAnalyze extranet and lab environments to ensure documentation and topologies are correct Network Engineer Intern Fidelity Investments May 2009  –  August 2009  (4 months) Boston, MA •\tConfigure and deploy Juniper and Nortel VPN devices for large enterprise user base  \n•\tAnalyze and configure firewall devices to integrate into the Remote Access environment \n•\tUpgrade of the RA environment including certification, testing and recommendations \n•\tTroubleshoot user issues relating to the network and/or their specific configuration \n•\tAnalyze extranet and lab environments to ensure documentation and topologies are correct Student Manager Rochester Institute of Technology June 2008  –  August 2008  (3 months) Student Manager Rochester Institute of Technology June 2008  –  August 2008  (3 months) Technical Support Usachoice Internet June 2004  –  August 2006  (2 years 3 months) Technical Support Usachoice Internet June 2004  –  August 2006  (2 years 3 months) Skills Security Networking Wireless Network Security Network Design Operating Systems Troubleshooting Wireless Networking Cisco IOS OSPF Routing Protocols Network Engineering Cisco Technologies DNS TCP/IP Juniper See 1+     See less Skills  Security Networking Wireless Network Security Network Design Operating Systems Troubleshooting Wireless Networking Cisco IOS OSPF Routing Protocols Network Engineering Cisco Technologies DNS TCP/IP Juniper See 1+     See less Security Networking Wireless Network Security Network Design Operating Systems Troubleshooting Wireless Networking Cisco IOS OSPF Routing Protocols Network Engineering Cisco Technologies DNS TCP/IP Juniper See 1+     See less Security Networking Wireless Network Security Network Design Operating Systems Troubleshooting Wireless Networking Cisco IOS OSPF Routing Protocols Network Engineering Cisco Technologies DNS TCP/IP Juniper See 1+     See less Education Rochester Institute of Technology Bachelor of Science,  Network Security and Systems Administration 2006  – 2010 Minor in Communication Activities and Societies:  Phi Kappa Tau Rochester Institute of Technology Bachelor of Science,  Network Security and Systems Administration 2006  – 2010 Minor in Communication Activities and Societies:  Phi Kappa Tau Rochester Institute of Technology Bachelor of Science,  Network Security and Systems Administration 2006  – 2010 Minor in Communication Activities and Societies:  Phi Kappa Tau Rochester Institute of Technology Bachelor of Science,  Network Security and Systems Administration 2006  – 2010 Minor in Communication Activities and Societies:  Phi Kappa Tau Honors & Awards Additional Honors & Awards Juniper Certified Internetwork Associate, Juniper Systems \n \nLinux Professional Institute Certification, Level 1 \n \nCisco Certified Network Associate, Cisco Systems \n \nDean’s List, RIT, 10/13 quarters Additional Honors & Awards Juniper Certified Internetwork Associate, Juniper Systems \n \nLinux Professional Institute Certification, Level 1 \n \nCisco Certified Network Associate, Cisco Systems \n \nDean’s List, RIT, 10/13 quarters Additional Honors & Awards Juniper Certified Internetwork Associate, Juniper Systems \n \nLinux Professional Institute Certification, Level 1 \n \nCisco Certified Network Associate, Cisco Systems \n \nDean’s List, RIT, 10/13 quarters Additional Honors & Awards Juniper Certified Internetwork Associate, Juniper Systems \n \nLinux Professional Institute Certification, Level 1 \n \nCisco Certified Network Associate, Cisco Systems \n \nDean’s List, RIT, 10/13 quarters ", "Experience Senior Network Engineer Google August 2012  – Present (3 years 1 month) London, United Kingdom Lead the planning and co-ordination of our field project management staff and the Network deployment engineers for all of the production Metro DWDM and Backbone based Network Deployments in the EMEA region. Network Engineer Google May 2008  –  August 2012  (4 years 4 months) Ireland Designed, planned and deployed a significant portion of Google's production network infrastructure throughout the EMEA based region. I ran the full life cycle of bill of materials production, network design, materials logistics, vendor co-ordination, field team leadership, rack and stack, execution of upgrades in the field, commissioning, post-deployment documentation, execution of upgrades between live production platforms, for Metro DWDM, Long Haul DWDM and Backbone and Edge based router builds. Operations Technician Google May 2006  –  May 2008  (2 years 1 month) Greater Atlanta Area I was a member of a team that built and maintained Google's quite large production Datacenters. Helped assemble and lead a team that were the first on the ground for building the central networking infrastructure rooms for four of the largest newer Datacenters. System Administrator National Net Hosting March 2004  –  May 2006  (2 years 3 months) Greater Atlanta Area Systems administration support for fully managed hosting clients: Apache, Bind, Sendmail, Postfix, Exim, MySQL, PHP, all primarily on Debian GNU/Linux. \n \nDeveloped a Linux based initramfs and Busybox PXE installer that served as the standard image installer for the NatNet server fleet. In addition, it would wget to ram and switch_root to a ~100MB Linux filesystem that allowed for much more complicated installation as well as a disaster recovery OS for all the production machines regardless of their primary operating system. Senior Network Engineer Google August 2012  – Present (3 years 1 month) London, United Kingdom Lead the planning and co-ordination of our field project management staff and the Network deployment engineers for all of the production Metro DWDM and Backbone based Network Deployments in the EMEA region. Senior Network Engineer Google August 2012  – Present (3 years 1 month) London, United Kingdom Lead the planning and co-ordination of our field project management staff and the Network deployment engineers for all of the production Metro DWDM and Backbone based Network Deployments in the EMEA region. Network Engineer Google May 2008  –  August 2012  (4 years 4 months) Ireland Designed, planned and deployed a significant portion of Google's production network infrastructure throughout the EMEA based region. I ran the full life cycle of bill of materials production, network design, materials logistics, vendor co-ordination, field team leadership, rack and stack, execution of upgrades in the field, commissioning, post-deployment documentation, execution of upgrades between live production platforms, for Metro DWDM, Long Haul DWDM and Backbone and Edge based router builds. Network Engineer Google May 2008  –  August 2012  (4 years 4 months) Ireland Designed, planned and deployed a significant portion of Google's production network infrastructure throughout the EMEA based region. I ran the full life cycle of bill of materials production, network design, materials logistics, vendor co-ordination, field team leadership, rack and stack, execution of upgrades in the field, commissioning, post-deployment documentation, execution of upgrades between live production platforms, for Metro DWDM, Long Haul DWDM and Backbone and Edge based router builds. Operations Technician Google May 2006  –  May 2008  (2 years 1 month) Greater Atlanta Area I was a member of a team that built and maintained Google's quite large production Datacenters. Helped assemble and lead a team that were the first on the ground for building the central networking infrastructure rooms for four of the largest newer Datacenters. Operations Technician Google May 2006  –  May 2008  (2 years 1 month) Greater Atlanta Area I was a member of a team that built and maintained Google's quite large production Datacenters. Helped assemble and lead a team that were the first on the ground for building the central networking infrastructure rooms for four of the largest newer Datacenters. System Administrator National Net Hosting March 2004  –  May 2006  (2 years 3 months) Greater Atlanta Area Systems administration support for fully managed hosting clients: Apache, Bind, Sendmail, Postfix, Exim, MySQL, PHP, all primarily on Debian GNU/Linux. \n \nDeveloped a Linux based initramfs and Busybox PXE installer that served as the standard image installer for the NatNet server fleet. In addition, it would wget to ram and switch_root to a ~100MB Linux filesystem that allowed for much more complicated installation as well as a disaster recovery OS for all the production machines regardless of their primary operating system. System Administrator National Net Hosting March 2004  –  May 2006  (2 years 3 months) Greater Atlanta Area Systems administration support for fully managed hosting clients: Apache, Bind, Sendmail, Postfix, Exim, MySQL, PHP, all primarily on Debian GNU/Linux. \n \nDeveloped a Linux based initramfs and Busybox PXE installer that served as the standard image installer for the NatNet server fleet. In addition, it would wget to ram and switch_root to a ~100MB Linux filesystem that allowed for much more complicated installation as well as a disaster recovery OS for all the production machines regardless of their primary operating system. Skills Data Center TCP/IP Cisco Technologies Linux JUNOS DWDM Skills  Data Center TCP/IP Cisco Technologies Linux JUNOS DWDM Data Center TCP/IP Cisco Technologies Linux JUNOS DWDM Data Center TCP/IP Cisco Technologies Linux JUNOS DWDM Education Auburn University Auburn University Auburn University Auburn University ", "Summary Network engineer focused on Service Providers and Metro Ethernet IP networks (routers, switches, firewalls, application systems...) Summary Network engineer focused on Service Providers and Metro Ethernet IP networks (routers, switches, firewalls, application systems...) Network engineer focused on Service Providers and Metro Ethernet IP networks (routers, switches, firewalls, application systems...) Network engineer focused on Service Providers and Metro Ethernet IP networks (routers, switches, firewalls, application systems...) Experience Network Engineer Google January 2013  – Present (2 years 8 months) Mountain View, CA Network Engineer Google June 2011  –  January 2013  (1 year 8 months) Dublin, Ireland Head IP Network Manager ANTIK Telecom November 2007  –  May 2011  (3 years 7 months) Team lead of IP department. \nDeveloping, designing, maintaining, and end-to-end administering of ANTIK IP/MPLS network and services. Providing consultancy for several other companies in the industry. Network Engineer ANTIK Telecom January 2003  –  October 2007  (4 years 10 months) Network Engineer Google January 2013  – Present (2 years 8 months) Mountain View, CA Network Engineer Google January 2013  – Present (2 years 8 months) Mountain View, CA Network Engineer Google June 2011  –  January 2013  (1 year 8 months) Dublin, Ireland Network Engineer Google June 2011  –  January 2013  (1 year 8 months) Dublin, Ireland Head IP Network Manager ANTIK Telecom November 2007  –  May 2011  (3 years 7 months) Team lead of IP department. \nDeveloping, designing, maintaining, and end-to-end administering of ANTIK IP/MPLS network and services. Providing consultancy for several other companies in the industry. Head IP Network Manager ANTIK Telecom November 2007  –  May 2011  (3 years 7 months) Team lead of IP department. \nDeveloping, designing, maintaining, and end-to-end administering of ANTIK IP/MPLS network and services. Providing consultancy for several other companies in the industry. Network Engineer ANTIK Telecom January 2003  –  October 2007  (4 years 10 months) Network Engineer ANTIK Telecom January 2003  –  October 2007  (4 years 10 months) Languages English Full professional proficiency German Limited working proficiency Slovak Native or bilingual proficiency Czech Native or bilingual proficiency English Full professional proficiency German Limited working proficiency Slovak Native or bilingual proficiency Czech Native or bilingual proficiency English Full professional proficiency German Limited working proficiency Slovak Native or bilingual proficiency Czech Native or bilingual proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Routing OSPF IP BGP Switches Routers Skills  Routing OSPF IP BGP Switches Routers Routing OSPF IP BGP Switches Routers Routing OSPF IP BGP Switches Routers Education Technická univerzita v Košiciach MSc (Ing.),  Informatics 2004  – 2009 Osemrocne gymnazium, Alejova 1, Kosice 1996  – 2004 Technická univerzita v Košiciach MSc (Ing.),  Informatics 2004  – 2009 Technická univerzita v Košiciach MSc (Ing.),  Informatics 2004  – 2009 Technická univerzita v Košiciach MSc (Ing.),  Informatics 2004  – 2009 Osemrocne gymnazium, Alejova 1, Kosice 1996  – 2004 Osemrocne gymnazium, Alejova 1, Kosice 1996  – 2004 Osemrocne gymnazium, Alejova 1, Kosice 1996  – 2004 ", "Summary Network Engineering. Protocols (OSPF/BGP/MPLS), - Layer 3 stuff. Specialties:Union negotiation Summary Network Engineering. Protocols (OSPF/BGP/MPLS), - Layer 3 stuff. Specialties:Union negotiation Network Engineering. Protocols (OSPF/BGP/MPLS), - Layer 3 stuff. Specialties:Union negotiation Network Engineering. Protocols (OSPF/BGP/MPLS), - Layer 3 stuff. Specialties:Union negotiation Experience Staff Network Engineer Google October 2012  – Present (2 years 11 months) Build some awesome internets Network Engineer Facebook November 2010  –  September 2012  (1 year 11 months) Network Engineering, Architecture. Protocols (BGP/MPLS/OSPF), Layer 3 stuff. Sr. Network Engineer Google September 2004  –  November 2010  (6 years 3 months) Network Engineering, Architecture. Protocols (BGP/MPLS/OSPF), Layer 3 stuff. Network Engineer Abovenet February 2001  –  August 2004  (3 years 7 months) Network Engineer Sitesmith December 1999  –  February 2001  (1 year 3 months) Staff Network Engineer Google October 2012  – Present (2 years 11 months) Build some awesome internets Staff Network Engineer Google October 2012  – Present (2 years 11 months) Build some awesome internets Network Engineer Facebook November 2010  –  September 2012  (1 year 11 months) Network Engineering, Architecture. Protocols (BGP/MPLS/OSPF), Layer 3 stuff. Network Engineer Facebook November 2010  –  September 2012  (1 year 11 months) Network Engineering, Architecture. Protocols (BGP/MPLS/OSPF), Layer 3 stuff. Sr. Network Engineer Google September 2004  –  November 2010  (6 years 3 months) Network Engineering, Architecture. Protocols (BGP/MPLS/OSPF), Layer 3 stuff. Sr. Network Engineer Google September 2004  –  November 2010  (6 years 3 months) Network Engineering, Architecture. Protocols (BGP/MPLS/OSPF), Layer 3 stuff. Network Engineer Abovenet February 2001  –  August 2004  (3 years 7 months) Network Engineer Abovenet February 2001  –  August 2004  (3 years 7 months) Network Engineer Sitesmith December 1999  –  February 2001  (1 year 3 months) Network Engineer Sitesmith December 1999  –  February 2001  (1 year 3 months) Skills Network Engineering OSPF BGP ISIS Juniper Network Architecture MPLS peering paragliding hang-gliding RSVP-TE JUNOS Cisco IOS Data Center Skills  Network Engineering OSPF BGP ISIS Juniper Network Architecture MPLS peering paragliding hang-gliding RSVP-TE JUNOS Cisco IOS Data Center Network Engineering OSPF BGP ISIS Juniper Network Architecture MPLS peering paragliding hang-gliding RSVP-TE JUNOS Cisco IOS Data Center Network Engineering OSPF BGP ISIS Juniper Network Architecture MPLS peering paragliding hang-gliding RSVP-TE JUNOS Cisco IOS Data Center ", "Experience Senior Network Engineer Google June 2012  – Present (3 years 3 months) Greater Atlanta Area Network Engineer Google May 2009  –  June 2012  (3 years 2 months) Greater Atlanta Area Operations Technician Google August 2007  –  May 2009  (1 year 10 months) Greater Atlanta Area Senior Network Engineer Google June 2012  – Present (3 years 3 months) Greater Atlanta Area Senior Network Engineer Google June 2012  – Present (3 years 3 months) Greater Atlanta Area Network Engineer Google May 2009  –  June 2012  (3 years 2 months) Greater Atlanta Area Network Engineer Google May 2009  –  June 2012  (3 years 2 months) Greater Atlanta Area Operations Technician Google August 2007  –  May 2009  (1 year 10 months) Greater Atlanta Area Operations Technician Google August 2007  –  May 2009  (1 year 10 months) Greater Atlanta Area Languages   Skills Python Google App Engine Programming Go Data Center Networking Network Design TCP/IP Network Engineering Linux Troubleshooting Fiber Optics Embedded Software Network Security JavaScript AngularJS See 1+     See less Skills  Python Google App Engine Programming Go Data Center Networking Network Design TCP/IP Network Engineering Linux Troubleshooting Fiber Optics Embedded Software Network Security JavaScript AngularJS See 1+     See less Python Google App Engine Programming Go Data Center Networking Network Design TCP/IP Network Engineering Linux Troubleshooting Fiber Optics Embedded Software Network Security JavaScript AngularJS See 1+     See less Python Google App Engine Programming Go Data Center Networking Network Design TCP/IP Network Engineering Linux Troubleshooting Fiber Optics Embedded Software Network Security JavaScript AngularJS See 1+     See less Education Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2000  – 2004 Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2000  – 2004 Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2000  – 2004 Georgia Institute of Technology Bachelor of Science (BS),  Computer Engineering 2000  – 2004 Honors & Awards 2013 Primetime Emmy Award Academy of Televison Arts & Sciences September 2013 YouTube/Google \n \n...Each month, a billion people watch more than 6 billion hours of video. Each minute, creators upload 100 more hours for the world to watch. To meet this fundamental engineering challenge, the YouTube team has created new, innovative ways to upload, store, manage and deliver all kinds of video programming to viewers the instant they want to watch it...YouTube's streaming infrastructure is a unique achievement that operates at unparalleled scale, globally. In the last year alone, their new \"live\" platform delivered coverage of 1,200 live events from the 2012 Summer Olympics and scaled to deliver over 8 million concurrent streams during the Red Bull Stratos Mission... 2013 Primetime Emmy Award Academy of Televison Arts & Sciences September 2013 YouTube/Google \n \n...Each month, a billion people watch more than 6 billion hours of video. Each minute, creators upload 100 more hours for the world to watch. To meet this fundamental engineering challenge, the YouTube team has created new, innovative ways to upload, store, manage and deliver all kinds of video programming to viewers the instant they want to watch it...YouTube's streaming infrastructure is a unique achievement that operates at unparalleled scale, globally. In the last year alone, their new \"live\" platform delivered coverage of 1,200 live events from the 2012 Summer Olympics and scaled to deliver over 8 million concurrent streams during the Red Bull Stratos Mission... 2013 Primetime Emmy Award Academy of Televison Arts & Sciences September 2013 YouTube/Google \n \n...Each month, a billion people watch more than 6 billion hours of video. Each minute, creators upload 100 more hours for the world to watch. To meet this fundamental engineering challenge, the YouTube team has created new, innovative ways to upload, store, manage and deliver all kinds of video programming to viewers the instant they want to watch it...YouTube's streaming infrastructure is a unique achievement that operates at unparalleled scale, globally. In the last year alone, their new \"live\" platform delivered coverage of 1,200 live events from the 2012 Summer Olympics and scaled to deliver over 8 million concurrent streams during the Red Bull Stratos Mission... 2013 Primetime Emmy Award Academy of Televison Arts & Sciences September 2013 YouTube/Google \n \n...Each month, a billion people watch more than 6 billion hours of video. Each minute, creators upload 100 more hours for the world to watch. To meet this fundamental engineering challenge, the YouTube team has created new, innovative ways to upload, store, manage and deliver all kinds of video programming to viewers the instant they want to watch it...YouTube's streaming infrastructure is a unique achievement that operates at unparalleled scale, globally. In the last year alone, their new \"live\" platform delivered coverage of 1,200 live events from the 2012 Summer Olympics and scaled to deliver over 8 million concurrent streams during the Red Bull Stratos Mission... ", "Summary JNCIE-SP #701 [December 2012] \nJNCIE M/T Series #701 [December 2010] - replaced by JNCIE-SP certification \nJNCIP M/T Series #917 [December 2009] \nJNCIS M/T Series [July 2009] \nJNCIA M/T Series [September 2008] \n \nJNCIS-ENT [July 2013] \nJNCIS-QF [July 2013] \n \nJNCIA-ER [November 2007] \nCCNA [July 2011] \n \nSpecialties: Layer 2 and Layer 3 VPNs (PW, L2VPN, VPLS and L3VPN), IP MPLS, Inter-AS, Routing/Switching (RIP/OSPF/ISIS/BGP), Firewall Systems, DHCP, DNS, F5 BIG-IP and provision systems (Incognito Software). Summary JNCIE-SP #701 [December 2012] \nJNCIE M/T Series #701 [December 2010] - replaced by JNCIE-SP certification \nJNCIP M/T Series #917 [December 2009] \nJNCIS M/T Series [July 2009] \nJNCIA M/T Series [September 2008] \n \nJNCIS-ENT [July 2013] \nJNCIS-QF [July 2013] \n \nJNCIA-ER [November 2007] \nCCNA [July 2011] \n \nSpecialties: Layer 2 and Layer 3 VPNs (PW, L2VPN, VPLS and L3VPN), IP MPLS, Inter-AS, Routing/Switching (RIP/OSPF/ISIS/BGP), Firewall Systems, DHCP, DNS, F5 BIG-IP and provision systems (Incognito Software). JNCIE-SP #701 [December 2012] \nJNCIE M/T Series #701 [December 2010] - replaced by JNCIE-SP certification \nJNCIP M/T Series #917 [December 2009] \nJNCIS M/T Series [July 2009] \nJNCIA M/T Series [September 2008] \n \nJNCIS-ENT [July 2013] \nJNCIS-QF [July 2013] \n \nJNCIA-ER [November 2007] \nCCNA [July 2011] \n \nSpecialties: Layer 2 and Layer 3 VPNs (PW, L2VPN, VPLS and L3VPN), IP MPLS, Inter-AS, Routing/Switching (RIP/OSPF/ISIS/BGP), Firewall Systems, DHCP, DNS, F5 BIG-IP and provision systems (Incognito Software). JNCIE-SP #701 [December 2012] \nJNCIE M/T Series #701 [December 2010] - replaced by JNCIE-SP certification \nJNCIP M/T Series #917 [December 2009] \nJNCIS M/T Series [July 2009] \nJNCIA M/T Series [September 2008] \n \nJNCIS-ENT [July 2013] \nJNCIS-QF [July 2013] \n \nJNCIA-ER [November 2007] \nCCNA [July 2011] \n \nSpecialties: Layer 2 and Layer 3 VPNs (PW, L2VPN, VPLS and L3VPN), IP MPLS, Inter-AS, Routing/Switching (RIP/OSPF/ISIS/BGP), Firewall Systems, DHCP, DNS, F5 BIG-IP and provision systems (Incognito Software). Experience Network Engineer Google January 2014  – Present (1 year 8 months) Dublin, Ireland CFTS - Technical Support Juniper Networks November 2012  –  December 2013  (1 year 2 months) Amsterdam Area, Netherlands Network Engineer Google October 2011  –  November 2012  (1 year 2 months) Network Engineer Nokia Siemens Networks March 2007  –  September 2011  (4 years 7 months) During my working days I spent my time executing various task, most of them related care activities (technical support, on-line support, upgrades, migrations and software/hardware homolation tests). Occasionally I also help the customer to test new features before those being deployed on the live network. \n \nI'm usually selected to pre-sales task (PoC) and integration on the Network Design and Audit teams (Mobile and Fixed Networks). Network Engineer Siemens Networks SA August 2006  –  February 2007  (7 months) Field Engineer in Siemens Networks, Carrier Services Group (SN CSS INS) - Network Integration (NIT). \n \nIn this group i had interact with customers and suppliers in live/lab scenarios with different equipments, this evolution made possible my participation in the Network Design of a Mobile Telecomunication Customer. Trainee Siemens PT February 2006  –  July 2006  (6 months) Trainee in Network Management Systems (NMS) at Siemens Portugal Carrier Services Group (IC CSS INS) - Fixed Integration (FIT). Network Engineer Google January 2014  – Present (1 year 8 months) Dublin, Ireland Network Engineer Google January 2014  – Present (1 year 8 months) Dublin, Ireland CFTS - Technical Support Juniper Networks November 2012  –  December 2013  (1 year 2 months) Amsterdam Area, Netherlands CFTS - Technical Support Juniper Networks November 2012  –  December 2013  (1 year 2 months) Amsterdam Area, Netherlands Network Engineer Google October 2011  –  November 2012  (1 year 2 months) Network Engineer Google October 2011  –  November 2012  (1 year 2 months) Network Engineer Nokia Siemens Networks March 2007  –  September 2011  (4 years 7 months) During my working days I spent my time executing various task, most of them related care activities (technical support, on-line support, upgrades, migrations and software/hardware homolation tests). Occasionally I also help the customer to test new features before those being deployed on the live network. \n \nI'm usually selected to pre-sales task (PoC) and integration on the Network Design and Audit teams (Mobile and Fixed Networks). Network Engineer Nokia Siemens Networks March 2007  –  September 2011  (4 years 7 months) During my working days I spent my time executing various task, most of them related care activities (technical support, on-line support, upgrades, migrations and software/hardware homolation tests). Occasionally I also help the customer to test new features before those being deployed on the live network. \n \nI'm usually selected to pre-sales task (PoC) and integration on the Network Design and Audit teams (Mobile and Fixed Networks). Network Engineer Siemens Networks SA August 2006  –  February 2007  (7 months) Field Engineer in Siemens Networks, Carrier Services Group (SN CSS INS) - Network Integration (NIT). \n \nIn this group i had interact with customers and suppliers in live/lab scenarios with different equipments, this evolution made possible my participation in the Network Design of a Mobile Telecomunication Customer. Network Engineer Siemens Networks SA August 2006  –  February 2007  (7 months) Field Engineer in Siemens Networks, Carrier Services Group (SN CSS INS) - Network Integration (NIT). \n \nIn this group i had interact with customers and suppliers in live/lab scenarios with different equipments, this evolution made possible my participation in the Network Design of a Mobile Telecomunication Customer. Trainee Siemens PT February 2006  –  July 2006  (6 months) Trainee in Network Management Systems (NMS) at Siemens Portugal Carrier Services Group (IC CSS INS) - Fixed Integration (FIT). Trainee Siemens PT February 2006  –  July 2006  (6 months) Trainee in Network Management Systems (NMS) at Siemens Portugal Carrier Services Group (IC CSS INS) - Fixed Integration (FIT). Skills DNS VPLS VPN MPLS Routing Layer 2 Layer 3 MPLS VPN IP Switches BGP Routers QoS OSPF F5 BigIP TCP/IP DHCP Juniper Ethernet LDP ISIS RIP IS-IS Multicast VLAN CCNA Load Balancing RSVP IPv6 NAT RSVP-TE Routing Protocols Network Design HSRP L2VPN Network Engineering STP Telecommunications Computer Network... Switching SNMP LAN-WAN GSM VRRP JUNOS LAN Switching Networking UMTS 3G Problem Solving See 35+     See less Skills  DNS VPLS VPN MPLS Routing Layer 2 Layer 3 MPLS VPN IP Switches BGP Routers QoS OSPF F5 BigIP TCP/IP DHCP Juniper Ethernet LDP ISIS RIP IS-IS Multicast VLAN CCNA Load Balancing RSVP IPv6 NAT RSVP-TE Routing Protocols Network Design HSRP L2VPN Network Engineering STP Telecommunications Computer Network... Switching SNMP LAN-WAN GSM VRRP JUNOS LAN Switching Networking UMTS 3G Problem Solving See 35+     See less DNS VPLS VPN MPLS Routing Layer 2 Layer 3 MPLS VPN IP Switches BGP Routers QoS OSPF F5 BigIP TCP/IP DHCP Juniper Ethernet LDP ISIS RIP IS-IS Multicast VLAN CCNA Load Balancing RSVP IPv6 NAT RSVP-TE Routing Protocols Network Design HSRP L2VPN Network Engineering STP Telecommunications Computer Network... Switching SNMP LAN-WAN GSM VRRP JUNOS LAN Switching Networking UMTS 3G Problem Solving See 35+     See less DNS VPLS VPN MPLS Routing Layer 2 Layer 3 MPLS VPN IP Switches BGP Routers QoS OSPF F5 BigIP TCP/IP DHCP Juniper Ethernet LDP ISIS RIP IS-IS Multicast VLAN CCNA Load Balancing RSVP IPv6 NAT RSVP-TE Routing Protocols Network Design HSRP L2VPN Network Engineering STP Telecommunications Computer Network... Switching SNMP LAN-WAN GSM VRRP JUNOS LAN Switching Networking UMTS 3G Problem Solving See 35+     See less Education Incognito Software Trainning Course for the Incognito Software Platform [ Vancouver - 20/4 till 24/4] 2009  – 2009 Juniper Networks Juniper Advanced Policy - Trainning Course [Amsterdam - 29/9 till 2/10] 2009  – 2009 Siemens Networks, SA 2007  – 2007 Juniper CJNR - Configuring Juniper Networks Routers [19/March to 26/March of 2007] Afina 2006  – 2006 BigIP - Local Traffic Manager 9.x Essentials [November 2006] \nBigIP - Local Traffic Manager 9.x Advanced [November 2006] Enterasys 2006  – 2006 ES Switching [July 2006] Siemens Networks, SA 2006  – 2006 Allot NetEnforcer - Bundle [December 2006] Universidade de Coimbra Communications and Multimedia - Branch of Internet Infra-Structures 2002  – 2006 The course was finished with 14 values (in 20). Activities and Societies:  Participation on the Management Group Lab by supervisioning/helping students group to organize classroom activities. These activities where later on evaluated by the Managment Group Lab and this information transmited to the class teacher.\nThe major activity was the WiMe 06 - \"Wireless Meeting 2006\" that count with 400 participants. Incognito Software Trainning Course for the Incognito Software Platform [ Vancouver - 20/4 till 24/4] 2009  – 2009 Incognito Software Trainning Course for the Incognito Software Platform [ Vancouver - 20/4 till 24/4] 2009  – 2009 Incognito Software Trainning Course for the Incognito Software Platform [ Vancouver - 20/4 till 24/4] 2009  – 2009 Juniper Networks Juniper Advanced Policy - Trainning Course [Amsterdam - 29/9 till 2/10] 2009  – 2009 Juniper Networks Juniper Advanced Policy - Trainning Course [Amsterdam - 29/9 till 2/10] 2009  – 2009 Juniper Networks Juniper Advanced Policy - Trainning Course [Amsterdam - 29/9 till 2/10] 2009  – 2009 Siemens Networks, SA 2007  – 2007 Juniper CJNR - Configuring Juniper Networks Routers [19/March to 26/March of 2007] Siemens Networks, SA 2007  – 2007 Juniper CJNR - Configuring Juniper Networks Routers [19/March to 26/March of 2007] Siemens Networks, SA 2007  – 2007 Juniper CJNR - Configuring Juniper Networks Routers [19/March to 26/March of 2007] Afina 2006  – 2006 BigIP - Local Traffic Manager 9.x Essentials [November 2006] \nBigIP - Local Traffic Manager 9.x Advanced [November 2006] Afina 2006  – 2006 BigIP - Local Traffic Manager 9.x Essentials [November 2006] \nBigIP - Local Traffic Manager 9.x Advanced [November 2006] Afina 2006  – 2006 BigIP - Local Traffic Manager 9.x Essentials [November 2006] \nBigIP - Local Traffic Manager 9.x Advanced [November 2006] Enterasys 2006  – 2006 ES Switching [July 2006] Enterasys 2006  – 2006 ES Switching [July 2006] Enterasys 2006  – 2006 ES Switching [July 2006] Siemens Networks, SA 2006  – 2006 Allot NetEnforcer - Bundle [December 2006] Siemens Networks, SA 2006  – 2006 Allot NetEnforcer - Bundle [December 2006] Siemens Networks, SA 2006  – 2006 Allot NetEnforcer - Bundle [December 2006] Universidade de Coimbra Communications and Multimedia - Branch of Internet Infra-Structures 2002  – 2006 The course was finished with 14 values (in 20). Activities and Societies:  Participation on the Management Group Lab by supervisioning/helping students group to organize classroom activities. These activities where later on evaluated by the Managment Group Lab and this information transmited to the class teacher.\nThe major activity was the WiMe 06 - \"Wireless Meeting 2006\" that count with 400 participants. Universidade de Coimbra Communications and Multimedia - Branch of Internet Infra-Structures 2002  – 2006 The course was finished with 14 values (in 20). Activities and Societies:  Participation on the Management Group Lab by supervisioning/helping students group to organize classroom activities. These activities where later on evaluated by the Managment Group Lab and this information transmited to the class teacher.\nThe major activity was the WiMe 06 - \"Wireless Meeting 2006\" that count with 400 participants. Universidade de Coimbra Communications and Multimedia - Branch of Internet Infra-Structures 2002  – 2006 The course was finished with 14 values (in 20). Activities and Societies:  Participation on the Management Group Lab by supervisioning/helping students group to organize classroom activities. These activities where later on evaluated by the Managment Group Lab and this information transmited to the class teacher.\nThe major activity was the WiMe 06 - \"Wireless Meeting 2006\" that count with 400 participants. ", "Summary Routing: MP-BGP, MPLS VPNs, BGP, EIGRP, OSPF, RIP, IPv6, Multicast, GRE tunnels, Cisco 800 to 7600 series routers, Juniper M series \n \nSwitching: VSS, HSRP, MST, Etherchannel, Cisco 2950 - 6500 series switches, Cisco Nexus 2000 - 5000 series \n \nSecurity: VPNs IPSec/SSL, Cisco Pix/ASA/FWSM, Juniper SRX, Netscreen ISG, Palo Alto, Checkpoint NG/NGX, Microsoft ISA 2006, OpenBSD PF, Cisco IPS, RSA SecurID Authentication Manager, Cisco ACS, Microsoft IAS \n \nLoad Balancing: Cisco CSS, F5 \n \nTelephony: Cisco Unified Communications Manager 4.x - 7x Cisco Call Manager Express, Nortel Meridian PABX, Nortel Symposium, Asterisk  \n \nWireless: Cisco Aironet, Ceragon, Motorola, Tsunami \n \nWan: WAAS, Frame Relay, DSL, ATM, ISDN, 3G, licensed radio, wireless, dialup \n \nOperating Systems: Windows, Debian Linux, Redhat Linux, FreeBSD, OpenBSD \n \nScripting: Python, Perl, Windows VBscript \n \n \nTRAINING COURSES \n \n* EME and RF (Electromagnetic Energy and Radio Frequency) awareness \n* Nortel Meridian PABX administration \n* Nortel Symposium administration \n* Ceragon licensed radio administration \n* Check Point Security Administration NGX I \n* Juniper SA SSL VPN \n* OH&S awareness \n* OH&S manual handling \n* Time Management Specialties:CCIE: Routing and Switching (#20577) \nCCVP \nCCSP \nCCDA \nJNCIA \nCCSA (Checkpoint NGX) \nMCSE:Security (Windows Server 2003) \nMCSA (Windows 2000) \nSecurity+ Summary Routing: MP-BGP, MPLS VPNs, BGP, EIGRP, OSPF, RIP, IPv6, Multicast, GRE tunnels, Cisco 800 to 7600 series routers, Juniper M series \n \nSwitching: VSS, HSRP, MST, Etherchannel, Cisco 2950 - 6500 series switches, Cisco Nexus 2000 - 5000 series \n \nSecurity: VPNs IPSec/SSL, Cisco Pix/ASA/FWSM, Juniper SRX, Netscreen ISG, Palo Alto, Checkpoint NG/NGX, Microsoft ISA 2006, OpenBSD PF, Cisco IPS, RSA SecurID Authentication Manager, Cisco ACS, Microsoft IAS \n \nLoad Balancing: Cisco CSS, F5 \n \nTelephony: Cisco Unified Communications Manager 4.x - 7x Cisco Call Manager Express, Nortel Meridian PABX, Nortel Symposium, Asterisk  \n \nWireless: Cisco Aironet, Ceragon, Motorola, Tsunami \n \nWan: WAAS, Frame Relay, DSL, ATM, ISDN, 3G, licensed radio, wireless, dialup \n \nOperating Systems: Windows, Debian Linux, Redhat Linux, FreeBSD, OpenBSD \n \nScripting: Python, Perl, Windows VBscript \n \n \nTRAINING COURSES \n \n* EME and RF (Electromagnetic Energy and Radio Frequency) awareness \n* Nortel Meridian PABX administration \n* Nortel Symposium administration \n* Ceragon licensed radio administration \n* Check Point Security Administration NGX I \n* Juniper SA SSL VPN \n* OH&S awareness \n* OH&S manual handling \n* Time Management Specialties:CCIE: Routing and Switching (#20577) \nCCVP \nCCSP \nCCDA \nJNCIA \nCCSA (Checkpoint NGX) \nMCSE:Security (Windows Server 2003) \nMCSA (Windows 2000) \nSecurity+ Routing: MP-BGP, MPLS VPNs, BGP, EIGRP, OSPF, RIP, IPv6, Multicast, GRE tunnels, Cisco 800 to 7600 series routers, Juniper M series \n \nSwitching: VSS, HSRP, MST, Etherchannel, Cisco 2950 - 6500 series switches, Cisco Nexus 2000 - 5000 series \n \nSecurity: VPNs IPSec/SSL, Cisco Pix/ASA/FWSM, Juniper SRX, Netscreen ISG, Palo Alto, Checkpoint NG/NGX, Microsoft ISA 2006, OpenBSD PF, Cisco IPS, RSA SecurID Authentication Manager, Cisco ACS, Microsoft IAS \n \nLoad Balancing: Cisco CSS, F5 \n \nTelephony: Cisco Unified Communications Manager 4.x - 7x Cisco Call Manager Express, Nortel Meridian PABX, Nortel Symposium, Asterisk  \n \nWireless: Cisco Aironet, Ceragon, Motorola, Tsunami \n \nWan: WAAS, Frame Relay, DSL, ATM, ISDN, 3G, licensed radio, wireless, dialup \n \nOperating Systems: Windows, Debian Linux, Redhat Linux, FreeBSD, OpenBSD \n \nScripting: Python, Perl, Windows VBscript \n \n \nTRAINING COURSES \n \n* EME and RF (Electromagnetic Energy and Radio Frequency) awareness \n* Nortel Meridian PABX administration \n* Nortel Symposium administration \n* Ceragon licensed radio administration \n* Check Point Security Administration NGX I \n* Juniper SA SSL VPN \n* OH&S awareness \n* OH&S manual handling \n* Time Management Specialties:CCIE: Routing and Switching (#20577) \nCCVP \nCCSP \nCCDA \nJNCIA \nCCSA (Checkpoint NGX) \nMCSE:Security (Windows Server 2003) \nMCSA (Windows 2000) \nSecurity+ Routing: MP-BGP, MPLS VPNs, BGP, EIGRP, OSPF, RIP, IPv6, Multicast, GRE tunnels, Cisco 800 to 7600 series routers, Juniper M series \n \nSwitching: VSS, HSRP, MST, Etherchannel, Cisco 2950 - 6500 series switches, Cisco Nexus 2000 - 5000 series \n \nSecurity: VPNs IPSec/SSL, Cisco Pix/ASA/FWSM, Juniper SRX, Netscreen ISG, Palo Alto, Checkpoint NG/NGX, Microsoft ISA 2006, OpenBSD PF, Cisco IPS, RSA SecurID Authentication Manager, Cisco ACS, Microsoft IAS \n \nLoad Balancing: Cisco CSS, F5 \n \nTelephony: Cisco Unified Communications Manager 4.x - 7x Cisco Call Manager Express, Nortel Meridian PABX, Nortel Symposium, Asterisk  \n \nWireless: Cisco Aironet, Ceragon, Motorola, Tsunami \n \nWan: WAAS, Frame Relay, DSL, ATM, ISDN, 3G, licensed radio, wireless, dialup \n \nOperating Systems: Windows, Debian Linux, Redhat Linux, FreeBSD, OpenBSD \n \nScripting: Python, Perl, Windows VBscript \n \n \nTRAINING COURSES \n \n* EME and RF (Electromagnetic Energy and Radio Frequency) awareness \n* Nortel Meridian PABX administration \n* Nortel Symposium administration \n* Ceragon licensed radio administration \n* Check Point Security Administration NGX I \n* Juniper SA SSL VPN \n* OH&S awareness \n* OH&S manual handling \n* Time Management Specialties:CCIE: Routing and Switching (#20577) \nCCVP \nCCSP \nCCDA \nJNCIA \nCCSA (Checkpoint NGX) \nMCSE:Security (Windows Server 2003) \nMCSA (Windows 2000) \nSecurity+ Experience Network Engineer Google December 2014  – Present (9 months) Zürich Area, Switzerland Network Engineer Google July 2011  –  December 2014  (3 years 6 months) Sydney Area, Australia Technical Specialist - IP Security Singtel Optus April 2011  –  July 2011  (4 months) Sydney Area, Australia Senior Network Engineer Gen-i October 2010  –  February 2011  (5 months) Sydney Area, Australia Key Achievements: \n* Wrote Perl script to collect statistics from every interface of all data centre switches \n \nResponsibilities: \n* Commonwealth Bank of Australia projects with primary focus on deployment of core banking modernisation servers and HP blade enclosures. \n* Deployment of new 6500 VSS pairs in CBA datacenter to provide additional capacity \n* Work with operations team to migrate CBA admin buildings and branch sites to Telstra. Senior Network Engineer Leighton Contractors March 2009  –  October 2010  (1 year 8 months) Sydney Area, Australia Key Achievements: \n* Designed and implemented connectivity to business partners using Cisco firewall services modules. \n* Designed and implemented new architecture for BGP to resolve asymmetric routing issues and to provide optimal failover via DR links. \n* Created security standards for password rotation, third party access and network separation via security zones. \n* Developed QoS architecture and templates to support voice, video conferencing, streaming video and business critical applications. \n* Wrote a provisioning application to generate device configurations for routers and switches including settings for telephony and WAAS. \n \nResponsibilities: \n* Technical mentor and escalation point for Unified Communications team. \n* Review change requests and represent Unified Communications team at Change Approval Board meetings. \n* Work with project managers to scope, design and deploy network infrastructure, IP telephony and video conferencing to project sites. \n* Write business cases to obtain funding and management support for new initiatives. Network Security Engineer Transfield Services September 2008  –  February 2009  (6 months) Sydney Area, Australia Key Achievements: \n* Carried out routing configuration changes for mergers of US child companies. \n* Used CiscoWorks to standardise spanning-tree, AAA, NTP, SNMP and syslog configuration. \n* Worked with WAN Service Provider and IT Architecture team on creation of QoS standards. \n* Created templates for configuration of new Cisco network devices. \n \nResponsibilities: \n* Migrated Sydney datacenters and head office 6500 and 3750 switches to rapid spanning-tree. \n* Configuration of Microsoft ISA proxy arrays for web browsing and load balancing of SAP netweaver servers. \n* Setup netflow server provide traffic analysis and to assist in troubleshooting network issues. \n* Liaised with phone system provider in deployment and troubleshooting of VOIP handsets. \n* Configuration of E1 trunks and T.38 IP faxing on Cisco routers. Network Support Specialist Macquarie Bank July 2008  –  September 2008  (3 months) Sydney Area, Australia Responsibilities: \n* Support of global enterprise network of over 2000 network devices. \n* Support and troubleshooting of WAN optimizers, proxies, Cisco ASA and Checkpoint firewalls, routers and switches. \n* Carried out changes according to change control and security policies. \n* Support of critical network infrastructure used by financial trading applications. \n* Configuration of CATOS and IOS switches with security features including dot1x, dynamic arp inspection, DHCP snooping and VACLs. Network Engineer Brennan IT July 2007  –  July 2008  (1 year 1 month) Sydney Area, Australia Key Achievements: \n* Designed and implemented load-balanced and redundant ASA firewall solution for customer. \n* Designed and built CCIE and CCNP lab environment. \n \nResponsibilities: \n* Supported over 5000 client connections in a MPLS VPN environment across Australia and the world over a variety of access methods including DSL, Frame Relay, ISDN, dialup, 3G, wireless, Ethernet, Co-location and IPSEC. \n* Implemented policy-based routing and QoS to support VoIP and customer SLAs \n* Configured IPSEC tunnels from Cisco routers and ASAs to a wide range of platforms including Cisco, Checkpoint, Netscreen, Sonicwall and Watchguard \n* Implementation of failover solutions for customer networks including configuration of BGP, EIGRP and HSRP. \n* Project work including migrations and cutovers to facilitate relocations and company mergers. \n* Technical mentor for 2nd and 1st level NOC engineers. \n* Secured customer internet connections using Netscreen ISG and Cisco IOS zone based firewalls. Network Support Officer Wyong Shire Council April 2007  –  July 2007  (4 months) Sydney Area, Australia * Setup switches and IP phones for 45 seat Newcastle and Central Coast flood disaster recovery call centre. \n* Planned and carried out implementation of new Cisco 6509 core switch.. \n* Administered Cisco ASA and Microsoft ISA firewalls. \n* Implemented 802.1x authentication for IT department. \n* Configured policy based routing on border router to reduce cost of internet connections. \n* Deployed site to site VPNs and Cisco IP handsets for remote sites. \n* Standardised network devices with NTP,SNMP, Syslog, SSH and RADIUS authentication Network Administrator Gosford City Council June 2002  –  April 2007  (4 years 11 months) Sydney Area, Australia Key Achievements: \n* Successfully managed migration of organisation wide IP address scheme. \n* Migrated internet firewalls from Checkpoint to Cisco ASA. \n* Implemented RSA SecurID Appliances for two factor VPN and wireless access. \n \nResponsibilities: \n* Responsible for Network Administration for an environment of 1400 users, 950 PCs, 1000 phones and 55 servers across 38 sites. \n* Liaised with PABX provider and microwave network provider during design and implementation phases of phone system upgrade. \n* Configured QoS for voice and disaster recovery traffic across WAN. \n* Responsible for antivirus, patch management, email filtering, web filtering and firewall administration. \n* Undertook project to remove users from the local administrators group on windows PCs. Created GUI frontend for runas to make management of PCs easier for the helpdesk. \n* Configured Linux servers and firewalls to use Active Directory authentication to reduce the number of passwords users need to remember. \n* Configured network monitoring for email and SMS notifications \n* Administrated several FreeBSD and Linux servers and configured Nagios, MRTG, Asterisk, Apache, Squid, Snort, SNMPD, NTPD, iptables and pf. \n* Carried out network troubleshooting using free tools including Nmap, Nessus, Ethereal, Netsumbler and Microsoft Baseline Security Analyzer. \n* Maintained network documentation including physical network diagrams, VLAN diagrams and connectivity troubleshooting workflows. Network Engineer Google December 2014  – Present (9 months) Zürich Area, Switzerland Network Engineer Google December 2014  – Present (9 months) Zürich Area, Switzerland Network Engineer Google July 2011  –  December 2014  (3 years 6 months) Sydney Area, Australia Network Engineer Google July 2011  –  December 2014  (3 years 6 months) Sydney Area, Australia Technical Specialist - IP Security Singtel Optus April 2011  –  July 2011  (4 months) Sydney Area, Australia Technical Specialist - IP Security Singtel Optus April 2011  –  July 2011  (4 months) Sydney Area, Australia Senior Network Engineer Gen-i October 2010  –  February 2011  (5 months) Sydney Area, Australia Key Achievements: \n* Wrote Perl script to collect statistics from every interface of all data centre switches \n \nResponsibilities: \n* Commonwealth Bank of Australia projects with primary focus on deployment of core banking modernisation servers and HP blade enclosures. \n* Deployment of new 6500 VSS pairs in CBA datacenter to provide additional capacity \n* Work with operations team to migrate CBA admin buildings and branch sites to Telstra. Senior Network Engineer Gen-i October 2010  –  February 2011  (5 months) Sydney Area, Australia Key Achievements: \n* Wrote Perl script to collect statistics from every interface of all data centre switches \n \nResponsibilities: \n* Commonwealth Bank of Australia projects with primary focus on deployment of core banking modernisation servers and HP blade enclosures. \n* Deployment of new 6500 VSS pairs in CBA datacenter to provide additional capacity \n* Work with operations team to migrate CBA admin buildings and branch sites to Telstra. Senior Network Engineer Leighton Contractors March 2009  –  October 2010  (1 year 8 months) Sydney Area, Australia Key Achievements: \n* Designed and implemented connectivity to business partners using Cisco firewall services modules. \n* Designed and implemented new architecture for BGP to resolve asymmetric routing issues and to provide optimal failover via DR links. \n* Created security standards for password rotation, third party access and network separation via security zones. \n* Developed QoS architecture and templates to support voice, video conferencing, streaming video and business critical applications. \n* Wrote a provisioning application to generate device configurations for routers and switches including settings for telephony and WAAS. \n \nResponsibilities: \n* Technical mentor and escalation point for Unified Communications team. \n* Review change requests and represent Unified Communications team at Change Approval Board meetings. \n* Work with project managers to scope, design and deploy network infrastructure, IP telephony and video conferencing to project sites. \n* Write business cases to obtain funding and management support for new initiatives. Senior Network Engineer Leighton Contractors March 2009  –  October 2010  (1 year 8 months) Sydney Area, Australia Key Achievements: \n* Designed and implemented connectivity to business partners using Cisco firewall services modules. \n* Designed and implemented new architecture for BGP to resolve asymmetric routing issues and to provide optimal failover via DR links. \n* Created security standards for password rotation, third party access and network separation via security zones. \n* Developed QoS architecture and templates to support voice, video conferencing, streaming video and business critical applications. \n* Wrote a provisioning application to generate device configurations for routers and switches including settings for telephony and WAAS. \n \nResponsibilities: \n* Technical mentor and escalation point for Unified Communications team. \n* Review change requests and represent Unified Communications team at Change Approval Board meetings. \n* Work with project managers to scope, design and deploy network infrastructure, IP telephony and video conferencing to project sites. \n* Write business cases to obtain funding and management support for new initiatives. Network Security Engineer Transfield Services September 2008  –  February 2009  (6 months) Sydney Area, Australia Key Achievements: \n* Carried out routing configuration changes for mergers of US child companies. \n* Used CiscoWorks to standardise spanning-tree, AAA, NTP, SNMP and syslog configuration. \n* Worked with WAN Service Provider and IT Architecture team on creation of QoS standards. \n* Created templates for configuration of new Cisco network devices. \n \nResponsibilities: \n* Migrated Sydney datacenters and head office 6500 and 3750 switches to rapid spanning-tree. \n* Configuration of Microsoft ISA proxy arrays for web browsing and load balancing of SAP netweaver servers. \n* Setup netflow server provide traffic analysis and to assist in troubleshooting network issues. \n* Liaised with phone system provider in deployment and troubleshooting of VOIP handsets. \n* Configuration of E1 trunks and T.38 IP faxing on Cisco routers. Network Security Engineer Transfield Services September 2008  –  February 2009  (6 months) Sydney Area, Australia Key Achievements: \n* Carried out routing configuration changes for mergers of US child companies. \n* Used CiscoWorks to standardise spanning-tree, AAA, NTP, SNMP and syslog configuration. \n* Worked with WAN Service Provider and IT Architecture team on creation of QoS standards. \n* Created templates for configuration of new Cisco network devices. \n \nResponsibilities: \n* Migrated Sydney datacenters and head office 6500 and 3750 switches to rapid spanning-tree. \n* Configuration of Microsoft ISA proxy arrays for web browsing and load balancing of SAP netweaver servers. \n* Setup netflow server provide traffic analysis and to assist in troubleshooting network issues. \n* Liaised with phone system provider in deployment and troubleshooting of VOIP handsets. \n* Configuration of E1 trunks and T.38 IP faxing on Cisco routers. Network Support Specialist Macquarie Bank July 2008  –  September 2008  (3 months) Sydney Area, Australia Responsibilities: \n* Support of global enterprise network of over 2000 network devices. \n* Support and troubleshooting of WAN optimizers, proxies, Cisco ASA and Checkpoint firewalls, routers and switches. \n* Carried out changes according to change control and security policies. \n* Support of critical network infrastructure used by financial trading applications. \n* Configuration of CATOS and IOS switches with security features including dot1x, dynamic arp inspection, DHCP snooping and VACLs. Network Support Specialist Macquarie Bank July 2008  –  September 2008  (3 months) Sydney Area, Australia Responsibilities: \n* Support of global enterprise network of over 2000 network devices. \n* Support and troubleshooting of WAN optimizers, proxies, Cisco ASA and Checkpoint firewalls, routers and switches. \n* Carried out changes according to change control and security policies. \n* Support of critical network infrastructure used by financial trading applications. \n* Configuration of CATOS and IOS switches with security features including dot1x, dynamic arp inspection, DHCP snooping and VACLs. Network Engineer Brennan IT July 2007  –  July 2008  (1 year 1 month) Sydney Area, Australia Key Achievements: \n* Designed and implemented load-balanced and redundant ASA firewall solution for customer. \n* Designed and built CCIE and CCNP lab environment. \n \nResponsibilities: \n* Supported over 5000 client connections in a MPLS VPN environment across Australia and the world over a variety of access methods including DSL, Frame Relay, ISDN, dialup, 3G, wireless, Ethernet, Co-location and IPSEC. \n* Implemented policy-based routing and QoS to support VoIP and customer SLAs \n* Configured IPSEC tunnels from Cisco routers and ASAs to a wide range of platforms including Cisco, Checkpoint, Netscreen, Sonicwall and Watchguard \n* Implementation of failover solutions for customer networks including configuration of BGP, EIGRP and HSRP. \n* Project work including migrations and cutovers to facilitate relocations and company mergers. \n* Technical mentor for 2nd and 1st level NOC engineers. \n* Secured customer internet connections using Netscreen ISG and Cisco IOS zone based firewalls. Network Engineer Brennan IT July 2007  –  July 2008  (1 year 1 month) Sydney Area, Australia Key Achievements: \n* Designed and implemented load-balanced and redundant ASA firewall solution for customer. \n* Designed and built CCIE and CCNP lab environment. \n \nResponsibilities: \n* Supported over 5000 client connections in a MPLS VPN environment across Australia and the world over a variety of access methods including DSL, Frame Relay, ISDN, dialup, 3G, wireless, Ethernet, Co-location and IPSEC. \n* Implemented policy-based routing and QoS to support VoIP and customer SLAs \n* Configured IPSEC tunnels from Cisco routers and ASAs to a wide range of platforms including Cisco, Checkpoint, Netscreen, Sonicwall and Watchguard \n* Implementation of failover solutions for customer networks including configuration of BGP, EIGRP and HSRP. \n* Project work including migrations and cutovers to facilitate relocations and company mergers. \n* Technical mentor for 2nd and 1st level NOC engineers. \n* Secured customer internet connections using Netscreen ISG and Cisco IOS zone based firewalls. Network Support Officer Wyong Shire Council April 2007  –  July 2007  (4 months) Sydney Area, Australia * Setup switches and IP phones for 45 seat Newcastle and Central Coast flood disaster recovery call centre. \n* Planned and carried out implementation of new Cisco 6509 core switch.. \n* Administered Cisco ASA and Microsoft ISA firewalls. \n* Implemented 802.1x authentication for IT department. \n* Configured policy based routing on border router to reduce cost of internet connections. \n* Deployed site to site VPNs and Cisco IP handsets for remote sites. \n* Standardised network devices with NTP,SNMP, Syslog, SSH and RADIUS authentication Network Support Officer Wyong Shire Council April 2007  –  July 2007  (4 months) Sydney Area, Australia * Setup switches and IP phones for 45 seat Newcastle and Central Coast flood disaster recovery call centre. \n* Planned and carried out implementation of new Cisco 6509 core switch.. \n* Administered Cisco ASA and Microsoft ISA firewalls. \n* Implemented 802.1x authentication for IT department. \n* Configured policy based routing on border router to reduce cost of internet connections. \n* Deployed site to site VPNs and Cisco IP handsets for remote sites. \n* Standardised network devices with NTP,SNMP, Syslog, SSH and RADIUS authentication Network Administrator Gosford City Council June 2002  –  April 2007  (4 years 11 months) Sydney Area, Australia Key Achievements: \n* Successfully managed migration of organisation wide IP address scheme. \n* Migrated internet firewalls from Checkpoint to Cisco ASA. \n* Implemented RSA SecurID Appliances for two factor VPN and wireless access. \n \nResponsibilities: \n* Responsible for Network Administration for an environment of 1400 users, 950 PCs, 1000 phones and 55 servers across 38 sites. \n* Liaised with PABX provider and microwave network provider during design and implementation phases of phone system upgrade. \n* Configured QoS for voice and disaster recovery traffic across WAN. \n* Responsible for antivirus, patch management, email filtering, web filtering and firewall administration. \n* Undertook project to remove users from the local administrators group on windows PCs. Created GUI frontend for runas to make management of PCs easier for the helpdesk. \n* Configured Linux servers and firewalls to use Active Directory authentication to reduce the number of passwords users need to remember. \n* Configured network monitoring for email and SMS notifications \n* Administrated several FreeBSD and Linux servers and configured Nagios, MRTG, Asterisk, Apache, Squid, Snort, SNMPD, NTPD, iptables and pf. \n* Carried out network troubleshooting using free tools including Nmap, Nessus, Ethereal, Netsumbler and Microsoft Baseline Security Analyzer. \n* Maintained network documentation including physical network diagrams, VLAN diagrams and connectivity troubleshooting workflows. Network Administrator Gosford City Council June 2002  –  April 2007  (4 years 11 months) Sydney Area, Australia Key Achievements: \n* Successfully managed migration of organisation wide IP address scheme. \n* Migrated internet firewalls from Checkpoint to Cisco ASA. \n* Implemented RSA SecurID Appliances for two factor VPN and wireless access. \n \nResponsibilities: \n* Responsible for Network Administration for an environment of 1400 users, 950 PCs, 1000 phones and 55 servers across 38 sites. \n* Liaised with PABX provider and microwave network provider during design and implementation phases of phone system upgrade. \n* Configured QoS for voice and disaster recovery traffic across WAN. \n* Responsible for antivirus, patch management, email filtering, web filtering and firewall administration. \n* Undertook project to remove users from the local administrators group on windows PCs. Created GUI frontend for runas to make management of PCs easier for the helpdesk. \n* Configured Linux servers and firewalls to use Active Directory authentication to reduce the number of passwords users need to remember. \n* Configured network monitoring for email and SMS notifications \n* Administrated several FreeBSD and Linux servers and configured Nagios, MRTG, Asterisk, Apache, Squid, Snort, SNMPD, NTPD, iptables and pf. \n* Carried out network troubleshooting using free tools including Nmap, Nessus, Ethereal, Netsumbler and Microsoft Baseline Security Analyzer. \n* Maintained network documentation including physical network diagrams, VLAN diagrams and connectivity troubleshooting workflows. Skills BGP Firewalls Cisco Technologies Routers VPN Switches RADIUS Juniper IT Service Management OSPF IP Multicast Active Directory CCIE Skills  BGP Firewalls Cisco Technologies Routers VPN Switches RADIUS Juniper IT Service Management OSPF IP Multicast Active Directory CCIE BGP Firewalls Cisco Technologies Routers VPN Switches RADIUS Juniper IT Service Management OSPF IP Multicast Active Directory CCIE BGP Firewalls Cisco Technologies Routers VPN Switches RADIUS Juniper IT Service Management OSPF IP Multicast Active Directory CCIE Education TAFE Information Technology - Certificate IV (Network Management) 2002  – 2003 Advanced Careers College Information Technology Certificate III (Network Administration) 2000  – 2001 TAFE Information Technology - Certificate IV (Network Management) 2002  – 2003 TAFE Information Technology - Certificate IV (Network Management) 2002  – 2003 TAFE Information Technology - Certificate IV (Network Management) 2002  – 2003 Advanced Careers College Information Technology Certificate III (Network Administration) 2000  – 2001 Advanced Careers College Information Technology Certificate III (Network Administration) 2000  – 2001 Advanced Careers College Information Technology Certificate III (Network Administration) 2000  – 2001 ", "Summary Main area of focus is IP routing and switching in large multi-vendor environment Summary Main area of focus is IP routing and switching in large multi-vendor environment Main area of focus is IP routing and switching in large multi-vendor environment Main area of focus is IP routing and switching in large multi-vendor environment Experience Network Engineer Google June 2014  – Present (1 year 3 months) Manager Reliance Jio Infocomm October 2013  –  June 2014  (9 months) Mumbai Area, India Network Engineer Google July 2011  –  October 2013  (2 years 4 months) Mountain View, CA Network Engineer Intrado February 2010  –  June 2011  (1 year 5 months) Longmont, Colorado Designing, implementing and maintaining critical networks required for delivering legacy and next-gen. 9-1-1 services NOC Intern Virtela Communications October 2009  –  February 2010  (5 months) Responsibilities include working along with NOC Engineers to solve customer trouble tickets that occur across diverse global network. Over the short period of intern, I was responsible for documenting information about the circuits and co-relating them with the other network information already present which would enable more smoother operations of their NOC. Student Assistant for Advanced Telecommunications Lab 2 University of Colorado at Boulder January 2009  –  October 2009  (10 months) Responsibilities: \n•\tHeld weekly lectures and labs for Masters Students \n•\tGraded weekly submissions of lab reports \n•\tDesigned and graded exams and quizzes for the students \n•\tHeld lab sessions for distance students over VoIP and VNC \n•\tTrained students to prepare for their CCNA/CCNP exams \n•\tFixed faulty equipments Lab Technician University of Colorado at Boulder July 2008  –  August 2009  (1 year 2 months) Responsibilities: \n• Setting up labs according to instructors needs for approx. 25 students \n• System administrator responsible for maintaining 40 Windows/Linux computers \n• Troubleshooting faulty equipments \n• Designing internal network for optimal performance Teaching Assistant for Telecomunication Systems University of Colorado at Boulder August 2008  –  May 2009  (10 months) Responsibilities: \n•\tGraded weekly submissions of assignments and lab reports \n• Held lab sessions for on-campus and distance students \n• Assisted professor in developing the course material Teaching Assistant for Data Communications 2 University of Colorado at Boulder January 2008  –  May 2009  (1 year 5 months) Responsibilities: \n• Graded weekly submissions of assignments \n• Evaluated Wireshark lab reports for students \n• Held lab sessions for on-campus students Network Engineer Google June 2014  – Present (1 year 3 months) Network Engineer Google June 2014  – Present (1 year 3 months) Manager Reliance Jio Infocomm October 2013  –  June 2014  (9 months) Mumbai Area, India Manager Reliance Jio Infocomm October 2013  –  June 2014  (9 months) Mumbai Area, India Network Engineer Google July 2011  –  October 2013  (2 years 4 months) Mountain View, CA Network Engineer Google July 2011  –  October 2013  (2 years 4 months) Mountain View, CA Network Engineer Intrado February 2010  –  June 2011  (1 year 5 months) Longmont, Colorado Designing, implementing and maintaining critical networks required for delivering legacy and next-gen. 9-1-1 services Network Engineer Intrado February 2010  –  June 2011  (1 year 5 months) Longmont, Colorado Designing, implementing and maintaining critical networks required for delivering legacy and next-gen. 9-1-1 services NOC Intern Virtela Communications October 2009  –  February 2010  (5 months) Responsibilities include working along with NOC Engineers to solve customer trouble tickets that occur across diverse global network. Over the short period of intern, I was responsible for documenting information about the circuits and co-relating them with the other network information already present which would enable more smoother operations of their NOC. NOC Intern Virtela Communications October 2009  –  February 2010  (5 months) Responsibilities include working along with NOC Engineers to solve customer trouble tickets that occur across diverse global network. Over the short period of intern, I was responsible for documenting information about the circuits and co-relating them with the other network information already present which would enable more smoother operations of their NOC. Student Assistant for Advanced Telecommunications Lab 2 University of Colorado at Boulder January 2009  –  October 2009  (10 months) Responsibilities: \n•\tHeld weekly lectures and labs for Masters Students \n•\tGraded weekly submissions of lab reports \n•\tDesigned and graded exams and quizzes for the students \n•\tHeld lab sessions for distance students over VoIP and VNC \n•\tTrained students to prepare for their CCNA/CCNP exams \n•\tFixed faulty equipments Student Assistant for Advanced Telecommunications Lab 2 University of Colorado at Boulder January 2009  –  October 2009  (10 months) Responsibilities: \n•\tHeld weekly lectures and labs for Masters Students \n•\tGraded weekly submissions of lab reports \n•\tDesigned and graded exams and quizzes for the students \n•\tHeld lab sessions for distance students over VoIP and VNC \n•\tTrained students to prepare for their CCNA/CCNP exams \n•\tFixed faulty equipments Lab Technician University of Colorado at Boulder July 2008  –  August 2009  (1 year 2 months) Responsibilities: \n• Setting up labs according to instructors needs for approx. 25 students \n• System administrator responsible for maintaining 40 Windows/Linux computers \n• Troubleshooting faulty equipments \n• Designing internal network for optimal performance Lab Technician University of Colorado at Boulder July 2008  –  August 2009  (1 year 2 months) Responsibilities: \n• Setting up labs according to instructors needs for approx. 25 students \n• System administrator responsible for maintaining 40 Windows/Linux computers \n• Troubleshooting faulty equipments \n• Designing internal network for optimal performance Teaching Assistant for Telecomunication Systems University of Colorado at Boulder August 2008  –  May 2009  (10 months) Responsibilities: \n•\tGraded weekly submissions of assignments and lab reports \n• Held lab sessions for on-campus and distance students \n• Assisted professor in developing the course material Teaching Assistant for Telecomunication Systems University of Colorado at Boulder August 2008  –  May 2009  (10 months) Responsibilities: \n•\tGraded weekly submissions of assignments and lab reports \n• Held lab sessions for on-campus and distance students \n• Assisted professor in developing the course material Teaching Assistant for Data Communications 2 University of Colorado at Boulder January 2008  –  May 2009  (1 year 5 months) Responsibilities: \n• Graded weekly submissions of assignments \n• Evaluated Wireshark lab reports for students \n• Held lab sessions for on-campus students Teaching Assistant for Data Communications 2 University of Colorado at Boulder January 2008  –  May 2009  (1 year 5 months) Responsibilities: \n• Graded weekly submissions of assignments \n• Evaluated Wireshark lab reports for students \n• Held lab sessions for on-campus students Languages Hindi Hindi Hindi Skills Routing Firewalls VPN Load Balancing Switching BGP Routing Protocols Network Design IP Troubleshooting Network Engineering MPLS Cisco Technologies Juniper TCP/IP OSPF Networking Wireshark IPSec IPv6 See 5+     See less Skills  Routing Firewalls VPN Load Balancing Switching BGP Routing Protocols Network Design IP Troubleshooting Network Engineering MPLS Cisco Technologies Juniper TCP/IP OSPF Networking Wireshark IPSec IPv6 See 5+     See less Routing Firewalls VPN Load Balancing Switching BGP Routing Protocols Network Design IP Troubleshooting Network Engineering MPLS Cisco Technologies Juniper TCP/IP OSPF Networking Wireshark IPSec IPv6 See 5+     See less Routing Firewalls VPN Load Balancing Switching BGP Routing Protocols Network Design IP Troubleshooting Network Engineering MPLS Cisco Technologies Juniper TCP/IP OSPF Networking Wireshark IPSec IPv6 See 5+     See less Education University of Colorado at Boulder Masters in Telecommunications,  Computer Systems Networking and Telecommunications 2007  – 2009 Courses: IP Network Design, Telecommunications Lab, IP Routing Protocols, Network Security Lab, Applied Network Security, Multimedia Networking Vivekanand Education Society's Institute of Technology B.E.,  Electronics and Telecommunications 2003  – 2007 National Education Society High School Vocational,  Telecommunications 2001  – 2003 University of Colorado at Boulder Masters in Telecommunications,  Computer Systems Networking and Telecommunications 2007  – 2009 Courses: IP Network Design, Telecommunications Lab, IP Routing Protocols, Network Security Lab, Applied Network Security, Multimedia Networking University of Colorado at Boulder Masters in Telecommunications,  Computer Systems Networking and Telecommunications 2007  – 2009 Courses: IP Network Design, Telecommunications Lab, IP Routing Protocols, Network Security Lab, Applied Network Security, Multimedia Networking University of Colorado at Boulder Masters in Telecommunications,  Computer Systems Networking and Telecommunications 2007  – 2009 Courses: IP Network Design, Telecommunications Lab, IP Routing Protocols, Network Security Lab, Applied Network Security, Multimedia Networking Vivekanand Education Society's Institute of Technology B.E.,  Electronics and Telecommunications 2003  – 2007 Vivekanand Education Society's Institute of Technology B.E.,  Electronics and Telecommunications 2003  – 2007 Vivekanand Education Society's Institute of Technology B.E.,  Electronics and Telecommunications 2003  – 2007 National Education Society High School Vocational,  Telecommunications 2001  – 2003 National Education Society High School Vocational,  Telecommunications 2001  – 2003 National Education Society High School Vocational,  Telecommunications 2001  – 2003 Honors & Awards Additional Honors & Awards Recipient of \"Outstanding Graduate Student\" in Interdisciplinary Telecommunications Program at University of Colorado, Boulder \n \nRecipient of Spring 2008 Merit Based Fellowship at University of Colorado, Boulder \n \nRecipient of Dhirubhai Ambani Scholarship for 4 consecutive years from 2003-2007 Additional Honors & Awards Recipient of \"Outstanding Graduate Student\" in Interdisciplinary Telecommunications Program at University of Colorado, Boulder \n \nRecipient of Spring 2008 Merit Based Fellowship at University of Colorado, Boulder \n \nRecipient of Dhirubhai Ambani Scholarship for 4 consecutive years from 2003-2007 Additional Honors & Awards Recipient of \"Outstanding Graduate Student\" in Interdisciplinary Telecommunications Program at University of Colorado, Boulder \n \nRecipient of Spring 2008 Merit Based Fellowship at University of Colorado, Boulder \n \nRecipient of Dhirubhai Ambani Scholarship for 4 consecutive years from 2003-2007 Additional Honors & Awards Recipient of \"Outstanding Graduate Student\" in Interdisciplinary Telecommunications Program at University of Colorado, Boulder \n \nRecipient of Spring 2008 Merit Based Fellowship at University of Colorado, Boulder \n \nRecipient of Dhirubhai Ambani Scholarship for 4 consecutive years from 2003-2007 ", "Summary I have in-depth experience in network designing, troubleshooting and implementation of an extensible large enterprise infrastructure and services. \n \nWide experience of implementing Optical gears and Wan technologies in large scale network deployments. Summary I have in-depth experience in network designing, troubleshooting and implementation of an extensible large enterprise infrastructure and services. \n \nWide experience of implementing Optical gears and Wan technologies in large scale network deployments. I have in-depth experience in network designing, troubleshooting and implementation of an extensible large enterprise infrastructure and services. \n \nWide experience of implementing Optical gears and Wan technologies in large scale network deployments. I have in-depth experience in network designing, troubleshooting and implementation of an extensible large enterprise infrastructure and services. \n \nWide experience of implementing Optical gears and Wan technologies in large scale network deployments. Experience Network Engineer Google November 2013  – Present (1 year 10 months) MTV, USA Network Designer and Project Manager Google January 2010  – Present (5 years 8 months) Gurgaon, India *Sound Technical Knowledge of Network Designing, Project management, Optical Networking and Juniper high end routers. \n*Building and Designing Major Google Backbone and Data center networks in APAC \n*Knowledge of project management principles and practices, defines and creates schedules, statements of work, directs and coordinates projects by establishing a work plan, arranging staffing, assigning duties, producing reports, and ensuring the progression and completion of the project. IT Lead - Gurgaon Google September 2006  –  January 2010  (3 years 5 months) IT Lead - Gurgaon Office \nPlaned and coordinated various activities from mid to large size IT infrastructure projects. \nImplemented assessments and recommendations for project deliverables. \nWorked with internal and external parties to organize the various components needed to initiate, run and conclude major projects. Network Engineer ICAI April 2004  –  August 2006  (2 years 5 months) Mohali Network Engineer CC&CD April 2003  –  April 2004  (1 year 1 month) Jalandhar Area, India Network Engineer Google November 2013  – Present (1 year 10 months) MTV, USA Network Engineer Google November 2013  – Present (1 year 10 months) MTV, USA Network Designer and Project Manager Google January 2010  – Present (5 years 8 months) Gurgaon, India *Sound Technical Knowledge of Network Designing, Project management, Optical Networking and Juniper high end routers. \n*Building and Designing Major Google Backbone and Data center networks in APAC \n*Knowledge of project management principles and practices, defines and creates schedules, statements of work, directs and coordinates projects by establishing a work plan, arranging staffing, assigning duties, producing reports, and ensuring the progression and completion of the project. Network Designer and Project Manager Google January 2010  – Present (5 years 8 months) Gurgaon, India *Sound Technical Knowledge of Network Designing, Project management, Optical Networking and Juniper high end routers. \n*Building and Designing Major Google Backbone and Data center networks in APAC \n*Knowledge of project management principles and practices, defines and creates schedules, statements of work, directs and coordinates projects by establishing a work plan, arranging staffing, assigning duties, producing reports, and ensuring the progression and completion of the project. IT Lead - Gurgaon Google September 2006  –  January 2010  (3 years 5 months) IT Lead - Gurgaon Office \nPlaned and coordinated various activities from mid to large size IT infrastructure projects. \nImplemented assessments and recommendations for project deliverables. \nWorked with internal and external parties to organize the various components needed to initiate, run and conclude major projects. IT Lead - Gurgaon Google September 2006  –  January 2010  (3 years 5 months) IT Lead - Gurgaon Office \nPlaned and coordinated various activities from mid to large size IT infrastructure projects. \nImplemented assessments and recommendations for project deliverables. \nWorked with internal and external parties to organize the various components needed to initiate, run and conclude major projects. Network Engineer ICAI April 2004  –  August 2006  (2 years 5 months) Mohali Network Engineer ICAI April 2004  –  August 2006  (2 years 5 months) Mohali Network Engineer CC&CD April 2003  –  April 2004  (1 year 1 month) Jalandhar Area, India Network Engineer CC&CD April 2003  –  April 2004  (1 year 1 month) Jalandhar Area, India Skills Cisco, Juniper, CCNA,... Data Center Network Design WAN Troubleshooting Networking Routers Firewalls Project Management Routing Juniper Technical Support Infrastructure BGP TCP/IP Juniper Technologies See 1+     See less Skills  Cisco, Juniper, CCNA,... Data Center Network Design WAN Troubleshooting Networking Routers Firewalls Project Management Routing Juniper Technical Support Infrastructure BGP TCP/IP Juniper Technologies See 1+     See less Cisco, Juniper, CCNA,... Data Center Network Design WAN Troubleshooting Networking Routers Firewalls Project Management Routing Juniper Technical Support Infrastructure BGP TCP/IP Juniper Technologies See 1+     See less Cisco, Juniper, CCNA,... Data Center Network Design WAN Troubleshooting Networking Routers Firewalls Project Management Routing Juniper Technical Support Infrastructure BGP TCP/IP Juniper Technologies See 1+     See less Education Maharshi Dayanand University MCA,  computers 2000  – 2003 Kurukshetra University B.com,  Commerce 1997  – 2000 Maharshi Dayanand University MCA,  computers 2000  – 2003 Maharshi Dayanand University MCA,  computers 2000  – 2003 Maharshi Dayanand University MCA,  computers 2000  – 2003 Kurukshetra University B.com,  Commerce 1997  – 2000 Kurukshetra University B.com,  Commerce 1997  – 2000 Kurukshetra University B.com,  Commerce 1997  – 2000 ", "Summary * An experienced network engineer and system administrator \n* A competent and persistent troubleshooter, able to tackle issues within high stress, production environments. \n* Proficient at multitasking and managing priorities with heavy workloads. \n* Able to efficiently communicate ideas verbally and in writing while being mindful of the audience, tailoring the delivery appropriately. \n* Able to quickly acclimate to custom environments. \n \nSpecialties:  \n* NETWORK/SYSTEMS ADMINISTRATION - Cisco, Juniper, OpenBSD, Linux, Solaris, Apache, BIND, MySQL, OpenSSH \n* PROTOCOLS - TCP/IP, Ethernet, SONET, SNMP, DNS, DHCP, HTTP, SSL, SSH, TACACS, FTP, TFTP \n* SOFTWARE DEVELOPMENT - Perl, UNIX Shell Script, PHP, HTML, CSS, Javascript, Subversion, CVS, git Summary * An experienced network engineer and system administrator \n* A competent and persistent troubleshooter, able to tackle issues within high stress, production environments. \n* Proficient at multitasking and managing priorities with heavy workloads. \n* Able to efficiently communicate ideas verbally and in writing while being mindful of the audience, tailoring the delivery appropriately. \n* Able to quickly acclimate to custom environments. \n \nSpecialties:  \n* NETWORK/SYSTEMS ADMINISTRATION - Cisco, Juniper, OpenBSD, Linux, Solaris, Apache, BIND, MySQL, OpenSSH \n* PROTOCOLS - TCP/IP, Ethernet, SONET, SNMP, DNS, DHCP, HTTP, SSL, SSH, TACACS, FTP, TFTP \n* SOFTWARE DEVELOPMENT - Perl, UNIX Shell Script, PHP, HTML, CSS, Javascript, Subversion, CVS, git * An experienced network engineer and system administrator \n* A competent and persistent troubleshooter, able to tackle issues within high stress, production environments. \n* Proficient at multitasking and managing priorities with heavy workloads. \n* Able to efficiently communicate ideas verbally and in writing while being mindful of the audience, tailoring the delivery appropriately. \n* Able to quickly acclimate to custom environments. \n \nSpecialties:  \n* NETWORK/SYSTEMS ADMINISTRATION - Cisco, Juniper, OpenBSD, Linux, Solaris, Apache, BIND, MySQL, OpenSSH \n* PROTOCOLS - TCP/IP, Ethernet, SONET, SNMP, DNS, DHCP, HTTP, SSL, SSH, TACACS, FTP, TFTP \n* SOFTWARE DEVELOPMENT - Perl, UNIX Shell Script, PHP, HTML, CSS, Javascript, Subversion, CVS, git * An experienced network engineer and system administrator \n* A competent and persistent troubleshooter, able to tackle issues within high stress, production environments. \n* Proficient at multitasking and managing priorities with heavy workloads. \n* Able to efficiently communicate ideas verbally and in writing while being mindful of the audience, tailoring the delivery appropriately. \n* Able to quickly acclimate to custom environments. \n \nSpecialties:  \n* NETWORK/SYSTEMS ADMINISTRATION - Cisco, Juniper, OpenBSD, Linux, Solaris, Apache, BIND, MySQL, OpenSSH \n* PROTOCOLS - TCP/IP, Ethernet, SONET, SNMP, DNS, DHCP, HTTP, SSL, SSH, TACACS, FTP, TFTP \n* SOFTWARE DEVELOPMENT - Perl, UNIX Shell Script, PHP, HTML, CSS, Javascript, Subversion, CVS, git Experience Network Engineer, Global Design Google November 2012  – Present (2 years 10 months) Mountain View, CA Network Engineer, Field Deployment Team Google October 2011  –  November 2012  (1 year 2 months) Reston, Virginia As a member of a field engineering team, I handled: \n \n- deployment of routing, switching and optical line systems. \n- working with vendors and contractors to troubleshoot deployment issues. \n- optical plant characterization. \n- extensive documentation of deployed network infrastructure. Senior Network Engineer Time Warner Cable August 2006  –  September 2011  (5 years 2 months) Kansas City, Missouri Design, implement and maintain network infrastructure supporting over 300,000 customers.  \n \nThe multi-tiered architecture consists of a DWDM system supporting Ethernet and SONET connectivity. On the Ethernet platform, I designed and implemented an H-VPLS service delivery architecture which supports L2 (Metro Ethernet) and L3 (IP Video, multicast) services. \n \nDevelop tools to monitor and manage network elements. Accomplished using open source packages and custom tools developed primarily in Perl/shell script. \n \nAdminister the Unix systems which host standard network services, as well as custom developed applications. Dedicated Access Specialist Time Warner Cable 2003  –  2006  (3 years) Kansas City, Missouri Drive implementation of Time Warner's Metro Ethernet service for the Kansas City metropolitan area.  \n \nDesigned solutions to support multiple customer configurations.  \n \nDeployed and supported services ranging from single Internet circuits to 50+ site Point-to-Multi-Point configurations. Business Class Specialist Time Warner Cable 2002  –  2003  (1 year) Kansas City, Missouri Provided over-the-phone and on-site support for TWC's commercial customers. \n \nHelped develop and implement new services, such as IP camera solutions and network monitoring systems. High Speed Specialist Time Warner Cable 2001  –  2002  (1 year) Kansas City, Missouri Provided over-the phone support for TWC residential Internet service customers. Technical Support Specialist H&R Block 2001  –  2001  (less than a year) Kansas City, Missouri Provided internal technical support for H&R block offices across the nation.  \n \nI specialized in supporting the \"Rapid Refund\" legacy software, which ran on PC's running DOS. I assisted non-technical staff with the configuration and maintenance of the PCs and the software. Network Engineer, Global Design Google November 2012  – Present (2 years 10 months) Mountain View, CA Network Engineer, Global Design Google November 2012  – Present (2 years 10 months) Mountain View, CA Network Engineer, Field Deployment Team Google October 2011  –  November 2012  (1 year 2 months) Reston, Virginia As a member of a field engineering team, I handled: \n \n- deployment of routing, switching and optical line systems. \n- working with vendors and contractors to troubleshoot deployment issues. \n- optical plant characterization. \n- extensive documentation of deployed network infrastructure. Network Engineer, Field Deployment Team Google October 2011  –  November 2012  (1 year 2 months) Reston, Virginia As a member of a field engineering team, I handled: \n \n- deployment of routing, switching and optical line systems. \n- working with vendors and contractors to troubleshoot deployment issues. \n- optical plant characterization. \n- extensive documentation of deployed network infrastructure. Senior Network Engineer Time Warner Cable August 2006  –  September 2011  (5 years 2 months) Kansas City, Missouri Design, implement and maintain network infrastructure supporting over 300,000 customers.  \n \nThe multi-tiered architecture consists of a DWDM system supporting Ethernet and SONET connectivity. On the Ethernet platform, I designed and implemented an H-VPLS service delivery architecture which supports L2 (Metro Ethernet) and L3 (IP Video, multicast) services. \n \nDevelop tools to monitor and manage network elements. Accomplished using open source packages and custom tools developed primarily in Perl/shell script. \n \nAdminister the Unix systems which host standard network services, as well as custom developed applications. Senior Network Engineer Time Warner Cable August 2006  –  September 2011  (5 years 2 months) Kansas City, Missouri Design, implement and maintain network infrastructure supporting over 300,000 customers.  \n \nThe multi-tiered architecture consists of a DWDM system supporting Ethernet and SONET connectivity. On the Ethernet platform, I designed and implemented an H-VPLS service delivery architecture which supports L2 (Metro Ethernet) and L3 (IP Video, multicast) services. \n \nDevelop tools to monitor and manage network elements. Accomplished using open source packages and custom tools developed primarily in Perl/shell script. \n \nAdminister the Unix systems which host standard network services, as well as custom developed applications. Dedicated Access Specialist Time Warner Cable 2003  –  2006  (3 years) Kansas City, Missouri Drive implementation of Time Warner's Metro Ethernet service for the Kansas City metropolitan area.  \n \nDesigned solutions to support multiple customer configurations.  \n \nDeployed and supported services ranging from single Internet circuits to 50+ site Point-to-Multi-Point configurations. Dedicated Access Specialist Time Warner Cable 2003  –  2006  (3 years) Kansas City, Missouri Drive implementation of Time Warner's Metro Ethernet service for the Kansas City metropolitan area.  \n \nDesigned solutions to support multiple customer configurations.  \n \nDeployed and supported services ranging from single Internet circuits to 50+ site Point-to-Multi-Point configurations. Business Class Specialist Time Warner Cable 2002  –  2003  (1 year) Kansas City, Missouri Provided over-the-phone and on-site support for TWC's commercial customers. \n \nHelped develop and implement new services, such as IP camera solutions and network monitoring systems. Business Class Specialist Time Warner Cable 2002  –  2003  (1 year) Kansas City, Missouri Provided over-the-phone and on-site support for TWC's commercial customers. \n \nHelped develop and implement new services, such as IP camera solutions and network monitoring systems. High Speed Specialist Time Warner Cable 2001  –  2002  (1 year) Kansas City, Missouri Provided over-the phone support for TWC residential Internet service customers. High Speed Specialist Time Warner Cable 2001  –  2002  (1 year) Kansas City, Missouri Provided over-the phone support for TWC residential Internet service customers. Technical Support Specialist H&R Block 2001  –  2001  (less than a year) Kansas City, Missouri Provided internal technical support for H&R block offices across the nation.  \n \nI specialized in supporting the \"Rapid Refund\" legacy software, which ran on PC's running DOS. I assisted non-technical staff with the configuration and maintenance of the PCs and the software. Technical Support Specialist H&R Block 2001  –  2001  (less than a year) Kansas City, Missouri Provided internal technical support for H&R block offices across the nation.  \n \nI specialized in supporting the \"Rapid Refund\" legacy software, which ran on PC's running DOS. I assisted non-technical staff with the configuration and maintenance of the PCs and the software. Skills Juniper Cisco Technologies Ethernet DNS IP Network Engineering CCNA DHCP Linux SNMP Unix Troubleshooting Apache DWDM Perl Solaris Metro Ethernet SDH Shell Scripting See 4+     See less Skills  Juniper Cisco Technologies Ethernet DNS IP Network Engineering CCNA DHCP Linux SNMP Unix Troubleshooting Apache DWDM Perl Solaris Metro Ethernet SDH Shell Scripting See 4+     See less Juniper Cisco Technologies Ethernet DNS IP Network Engineering CCNA DHCP Linux SNMP Unix Troubleshooting Apache DWDM Perl Solaris Metro Ethernet SDH Shell Scripting See 4+     See less Juniper Cisco Technologies Ethernet DNS IP Network Engineering CCNA DHCP Linux SNMP Unix Troubleshooting Apache DWDM Perl Solaris Metro Ethernet SDH Shell Scripting See 4+     See less Education Kemper Military School and Junior College 1997  – 1998 Rockhurst High School Kemper Military School and Junior College 1997  – 1998 Kemper Military School and Junior College 1997  – 1998 Kemper Military School and Junior College 1997  – 1998 Rockhurst High School Rockhurst High School Rockhurst High School ", "Experience Network Engineer Google February 2015  – Present (7 months) San Francisco Bay Area M&A integration; Implementation and Customer Engineering team. Mentor SparkLabKC January 2013  – Present (2 years 8 months) Kansas City, Missouri Area Mentors assist early stage startup companies accelerate success in the Kansas City area. http://sparklabkc.com/mentors/ IT Architect FishNet Security January 2013  –  February 2015  (2 years 2 months) Kansas City, Missouri Area Network Engineer Google April 2010  –  January 2013  (2 years 10 months) Mountain View, CA Enterprise IT Architect University of Kansas September 2009  –  April 2010  (8 months) Network Security Specialist University of Kansas March 2009  –  November 2009  (9 months) Network Administrator FishNet Security June 2008  –  March 2009  (10 months) Network Administrator Kansas Research and Education Network August 2006  –  June 2008  (1 year 11 months) Network Manager Jewelry Television January 2006  –  August 2006  (8 months) Network Architect University of Kansas March 2005  –  January 2006  (11 months) Networking Technician University of Kansas May 2001  –  March 2005  (3 years 11 months) Network Engineer Google February 2015  – Present (7 months) San Francisco Bay Area M&A integration; Implementation and Customer Engineering team. Network Engineer Google February 2015  – Present (7 months) San Francisco Bay Area M&A integration; Implementation and Customer Engineering team. Mentor SparkLabKC January 2013  – Present (2 years 8 months) Kansas City, Missouri Area Mentors assist early stage startup companies accelerate success in the Kansas City area. http://sparklabkc.com/mentors/ Mentor SparkLabKC January 2013  – Present (2 years 8 months) Kansas City, Missouri Area Mentors assist early stage startup companies accelerate success in the Kansas City area. http://sparklabkc.com/mentors/ IT Architect FishNet Security January 2013  –  February 2015  (2 years 2 months) Kansas City, Missouri Area IT Architect FishNet Security January 2013  –  February 2015  (2 years 2 months) Kansas City, Missouri Area Network Engineer Google April 2010  –  January 2013  (2 years 10 months) Mountain View, CA Network Engineer Google April 2010  –  January 2013  (2 years 10 months) Mountain View, CA Enterprise IT Architect University of Kansas September 2009  –  April 2010  (8 months) Enterprise IT Architect University of Kansas September 2009  –  April 2010  (8 months) Network Security Specialist University of Kansas March 2009  –  November 2009  (9 months) Network Security Specialist University of Kansas March 2009  –  November 2009  (9 months) Network Administrator FishNet Security June 2008  –  March 2009  (10 months) Network Administrator FishNet Security June 2008  –  March 2009  (10 months) Network Administrator Kansas Research and Education Network August 2006  –  June 2008  (1 year 11 months) Network Administrator Kansas Research and Education Network August 2006  –  June 2008  (1 year 11 months) Network Manager Jewelry Television January 2006  –  August 2006  (8 months) Network Manager Jewelry Television January 2006  –  August 2006  (8 months) Network Architect University of Kansas March 2005  –  January 2006  (11 months) Network Architect University of Kansas March 2005  –  January 2006  (11 months) Networking Technician University of Kansas May 2001  –  March 2005  (3 years 11 months) Networking Technician University of Kansas May 2001  –  March 2005  (3 years 11 months) Skills Skills     ", "Summary I have spent my professional life designing systems and solving problems for critical business requirements. During this amazing journey, I have been involved with a variety of business needs including mergers & acquisitions, data center designs, domestic as well as international remote sites. Each requirement needs a unique solution and I thrive on new challenges.  \n \nDesign thinking and management requires looking at the bigger picture and leading without formal authority. I have worked in smaller organizations as well as large multinationals. I am capable of owning an initiative from its inception and maturing it into a structured product/process. I have also managed a group of engineers.  \n \nMost of all, I am looking forward to taking on bigger roles with larger impact on the business. \n \nSpecialties: IT Network Infrastructure solutions, Product life-cycle management, Project Management, Process Engineering, Enterprise LAN/WAN Design, Wireless Technology, Data Center design. Summary I have spent my professional life designing systems and solving problems for critical business requirements. During this amazing journey, I have been involved with a variety of business needs including mergers & acquisitions, data center designs, domestic as well as international remote sites. Each requirement needs a unique solution and I thrive on new challenges.  \n \nDesign thinking and management requires looking at the bigger picture and leading without formal authority. I have worked in smaller organizations as well as large multinationals. I am capable of owning an initiative from its inception and maturing it into a structured product/process. I have also managed a group of engineers.  \n \nMost of all, I am looking forward to taking on bigger roles with larger impact on the business. \n \nSpecialties: IT Network Infrastructure solutions, Product life-cycle management, Project Management, Process Engineering, Enterprise LAN/WAN Design, Wireless Technology, Data Center design. I have spent my professional life designing systems and solving problems for critical business requirements. During this amazing journey, I have been involved with a variety of business needs including mergers & acquisitions, data center designs, domestic as well as international remote sites. Each requirement needs a unique solution and I thrive on new challenges.  \n \nDesign thinking and management requires looking at the bigger picture and leading without formal authority. I have worked in smaller organizations as well as large multinationals. I am capable of owning an initiative from its inception and maturing it into a structured product/process. I have also managed a group of engineers.  \n \nMost of all, I am looking forward to taking on bigger roles with larger impact on the business. \n \nSpecialties: IT Network Infrastructure solutions, Product life-cycle management, Project Management, Process Engineering, Enterprise LAN/WAN Design, Wireless Technology, Data Center design. I have spent my professional life designing systems and solving problems for critical business requirements. During this amazing journey, I have been involved with a variety of business needs including mergers & acquisitions, data center designs, domestic as well as international remote sites. Each requirement needs a unique solution and I thrive on new challenges.  \n \nDesign thinking and management requires looking at the bigger picture and leading without formal authority. I have worked in smaller organizations as well as large multinationals. I am capable of owning an initiative from its inception and maturing it into a structured product/process. I have also managed a group of engineers.  \n \nMost of all, I am looking forward to taking on bigger roles with larger impact on the business. \n \nSpecialties: IT Network Infrastructure solutions, Product life-cycle management, Project Management, Process Engineering, Enterprise LAN/WAN Design, Wireless Technology, Data Center design. Experience Lead Network Engineer Google July 2014  – Present (1 year 2 months) Mountain View, CA Network Engineer Google July 2011  –  June 2014  (3 years) Mountain View, CA Network Operations Engineer Google July 2010  –  June 2011  (1 year) Mountain View, CA Network Engineer Qwest Communications February 2009  –  July 2010  (1 year 6 months) Network Engineering Intern Connexion Technologies May 2008  –  August 2008  (4 months) Teaching Assistant NC State University January 2008  –  May 2008  (5 months) Consultant, Information Technology and Engineering Computer Services ITECS September 2007  –  May 2008  (9 months) Lead Network Engineer Google July 2014  – Present (1 year 2 months) Mountain View, CA Lead Network Engineer Google July 2014  – Present (1 year 2 months) Mountain View, CA Network Engineer Google July 2011  –  June 2014  (3 years) Mountain View, CA Network Engineer Google July 2011  –  June 2014  (3 years) Mountain View, CA Network Operations Engineer Google July 2010  –  June 2011  (1 year) Mountain View, CA Network Operations Engineer Google July 2010  –  June 2011  (1 year) Mountain View, CA Network Engineer Qwest Communications February 2009  –  July 2010  (1 year 6 months) Network Engineer Qwest Communications February 2009  –  July 2010  (1 year 6 months) Network Engineering Intern Connexion Technologies May 2008  –  August 2008  (4 months) Network Engineering Intern Connexion Technologies May 2008  –  August 2008  (4 months) Teaching Assistant NC State University January 2008  –  May 2008  (5 months) Teaching Assistant NC State University January 2008  –  May 2008  (5 months) Consultant, Information Technology and Engineering Computer Services ITECS September 2007  –  May 2008  (9 months) Consultant, Information Technology and Engineering Computer Services ITECS September 2007  –  May 2008  (9 months) Languages   Skills Switches Routers Network Design OSPF Network Engineering Network Security BGP IP Data Center LAN-WAN Routing Protocols TCP/IP Firewalls IPv6 Enterprise LAN/WAN... Wireless Technology Routing/Switching Network Optimization IP Networking Network Operations See 5+     See less Skills  Switches Routers Network Design OSPF Network Engineering Network Security BGP IP Data Center LAN-WAN Routing Protocols TCP/IP Firewalls IPv6 Enterprise LAN/WAN... Wireless Technology Routing/Switching Network Optimization IP Networking Network Operations See 5+     See less Switches Routers Network Design OSPF Network Engineering Network Security BGP IP Data Center LAN-WAN Routing Protocols TCP/IP Firewalls IPv6 Enterprise LAN/WAN... Wireless Technology Routing/Switching Network Optimization IP Networking Network Operations See 5+     See less Switches Routers Network Design OSPF Network Engineering Network Security BGP IP Data Center LAN-WAN Routing Protocols TCP/IP Firewalls IPv6 Enterprise LAN/WAN... Wireless Technology Routing/Switching Network Optimization IP Networking Network Operations See 5+     See less Education North Carolina State University Master's Degree 2007  – 2008 University of Mumbai Bachelor of Engineering 2002  – 2006 North Carolina State University Master's Degree 2007  – 2008 North Carolina State University Master's Degree 2007  – 2008 North Carolina State University Master's Degree 2007  – 2008 University of Mumbai Bachelor of Engineering 2002  – 2006 University of Mumbai Bachelor of Engineering 2002  – 2006 University of Mumbai Bachelor of Engineering 2002  – 2006 "]}