{"position": "Optimization Specialist - Hourly", "company": "Google", "profiles": ["Experience Programmatic Account Manager Google July 2015  – Present (1 month) Toronto, Canada Area Digital Media Manager Google February 2014  –  June 2015  (1 year 5 months) Toronto, Canada Area Optimization Specialist, Olive Audience Olive Media September 2013  –  February 2014  (6 months) Toronto, Canada Area Ad Operations Specialist Olive Media October 2012  –  August 2013  (11 months) • Scheduled, debugged, and managed national campaigns (CPCs, CPAs, CPMs), with an emphasis on Audience Targeting (data) and eCPA campaigns \n• Optimized campaigns to meet and exceed client ROI goals \n• Took on a technical role in the testing and productization of Dynamic Creative initiative in conjunction with Product Manager and Team Lead, Performance \n• Worked as a team with sales and account management personnel to align our goals with that of the client, ensure holistic campaign success \n• Continued to develop and iterate the automation tools, tackling more advanced gaps in the Performance workflow, also maintained the system as our business needs and structure changed \n• Received TorStar Digital Q4 2012 and Q1 2013 People's Choice Award (Open) 1 recommendation Jeremy Freedman Account Executive, Media Platforms at Google Since coming on as an intern in June of 2012 Kyle has had an immeasurable impact on Olive Media's Brand Response Team. Kyle's coding skills provided an avenue to go above and beyond his job description and he has delivered in every respect. The API... View Ad Operations Intern Olive Media June 2012  –  September 2012  (4 months) • Quickly learned and mastered the various technologies employed (AppNexus, AdTech) to support Ad Operations Specialists in their roles \n• Scheduled and debugged national performance campaigns (CPCs, CPAs, CPMs), layering in data where necessary to deliver on client ROI goals \n• Successfully passed AppNexus API Development onboarding, created a suite of revolutionary automation tools to improve efficiencies, optimize workflows, and reduce downtime \n• Received TorStar Digital Q3 2012 People's Choice Award Marketing Assistant (Co-op) Food Supplies May 2011  –  August 2011  (4 months) • Designed and coded custom email newsletter templates for use with ConstantContact  \n• Designed a product catalogue and streamlined the creation through Adobe InDesign and Microsoft Excel \n• Supported marketing and sales roles by providing feedback on product strategies, assisting with collateral, and lending a hand for last minute pushes Programmatic Account Manager Google July 2015  – Present (1 month) Toronto, Canada Area Programmatic Account Manager Google July 2015  – Present (1 month) Toronto, Canada Area Digital Media Manager Google February 2014  –  June 2015  (1 year 5 months) Toronto, Canada Area Digital Media Manager Google February 2014  –  June 2015  (1 year 5 months) Toronto, Canada Area Optimization Specialist, Olive Audience Olive Media September 2013  –  February 2014  (6 months) Toronto, Canada Area Optimization Specialist, Olive Audience Olive Media September 2013  –  February 2014  (6 months) Toronto, Canada Area Ad Operations Specialist Olive Media October 2012  –  August 2013  (11 months) • Scheduled, debugged, and managed national campaigns (CPCs, CPAs, CPMs), with an emphasis on Audience Targeting (data) and eCPA campaigns \n• Optimized campaigns to meet and exceed client ROI goals \n• Took on a technical role in the testing and productization of Dynamic Creative initiative in conjunction with Product Manager and Team Lead, Performance \n• Worked as a team with sales and account management personnel to align our goals with that of the client, ensure holistic campaign success \n• Continued to develop and iterate the automation tools, tackling more advanced gaps in the Performance workflow, also maintained the system as our business needs and structure changed \n• Received TorStar Digital Q4 2012 and Q1 2013 People's Choice Award (Open) 1 recommendation Jeremy Freedman Account Executive, Media Platforms at Google Since coming on as an intern in June of 2012 Kyle has had an immeasurable impact on Olive Media's Brand Response Team. Kyle's coding skills provided an avenue to go above and beyond his job description and he has delivered in every respect. The API... View Ad Operations Specialist Olive Media October 2012  –  August 2013  (11 months) • Scheduled, debugged, and managed national campaigns (CPCs, CPAs, CPMs), with an emphasis on Audience Targeting (data) and eCPA campaigns \n• Optimized campaigns to meet and exceed client ROI goals \n• Took on a technical role in the testing and productization of Dynamic Creative initiative in conjunction with Product Manager and Team Lead, Performance \n• Worked as a team with sales and account management personnel to align our goals with that of the client, ensure holistic campaign success \n• Continued to develop and iterate the automation tools, tackling more advanced gaps in the Performance workflow, also maintained the system as our business needs and structure changed \n• Received TorStar Digital Q4 2012 and Q1 2013 People's Choice Award (Open) 1 recommendation Jeremy Freedman Account Executive, Media Platforms at Google Since coming on as an intern in June of 2012 Kyle has had an immeasurable impact on Olive Media's Brand Response Team. Kyle's coding skills provided an avenue to go above and beyond his job description and he has delivered in every respect. The API... View Ad Operations Intern Olive Media June 2012  –  September 2012  (4 months) • Quickly learned and mastered the various technologies employed (AppNexus, AdTech) to support Ad Operations Specialists in their roles \n• Scheduled and debugged national performance campaigns (CPCs, CPAs, CPMs), layering in data where necessary to deliver on client ROI goals \n• Successfully passed AppNexus API Development onboarding, created a suite of revolutionary automation tools to improve efficiencies, optimize workflows, and reduce downtime \n• Received TorStar Digital Q3 2012 People's Choice Award Ad Operations Intern Olive Media June 2012  –  September 2012  (4 months) • Quickly learned and mastered the various technologies employed (AppNexus, AdTech) to support Ad Operations Specialists in their roles \n• Scheduled and debugged national performance campaigns (CPCs, CPAs, CPMs), layering in data where necessary to deliver on client ROI goals \n• Successfully passed AppNexus API Development onboarding, created a suite of revolutionary automation tools to improve efficiencies, optimize workflows, and reduce downtime \n• Received TorStar Digital Q3 2012 People's Choice Award Marketing Assistant (Co-op) Food Supplies May 2011  –  August 2011  (4 months) • Designed and coded custom email newsletter templates for use with ConstantContact  \n• Designed a product catalogue and streamlined the creation through Adobe InDesign and Microsoft Excel \n• Supported marketing and sales roles by providing feedback on product strategies, assisting with collateral, and lending a hand for last minute pushes Marketing Assistant (Co-op) Food Supplies May 2011  –  August 2011  (4 months) • Designed and coded custom email newsletter templates for use with ConstantContact  \n• Designed a product catalogue and streamlined the creation through Adobe InDesign and Microsoft Excel \n• Supported marketing and sales roles by providing feedback on product strategies, assisting with collateral, and lending a hand for last minute pushes Skills Top Skills 12 Advertising Operations 10 Ad Exchanges 9 Online Advertising 8 RTB 7 Digital Media 5 Performance Based... 4 CSS 4 HTML 3 PHP 3 APIs Kyle also knows about... 3 AppNexus 1 jQuery 1 JavaScript 1 MySQL 1 HTML 5 1 API Development 1 Digital Marketing 1 Online Marketing 1 Digital Strategy 1 Advertising 0 CSS3 Skills  Top Skills 12 Advertising Operations 10 Ad Exchanges 9 Online Advertising 8 RTB 7 Digital Media 5 Performance Based... 4 CSS 4 HTML 3 PHP 3 APIs Kyle also knows about... 3 AppNexus 1 jQuery 1 JavaScript 1 MySQL 1 HTML 5 1 API Development 1 Digital Marketing 1 Online Marketing 1 Digital Strategy 1 Advertising 0 CSS3 Top Skills 12 Advertising Operations 10 Ad Exchanges 9 Online Advertising 8 RTB 7 Digital Media 5 Performance Based... 4 CSS 4 HTML 3 PHP 3 APIs Kyle also knows about... 3 AppNexus 1 jQuery 1 JavaScript 1 MySQL 1 HTML 5 1 API Development 1 Digital Marketing 1 Online Marketing 1 Digital Strategy 1 Advertising 0 CSS3 Top Skills 12 Advertising Operations 10 Ad Exchanges 9 Online Advertising 8 RTB 7 Digital Media 5 Performance Based... 4 CSS 4 HTML 3 PHP 3 APIs Kyle also knows about... 3 AppNexus 1 jQuery 1 JavaScript 1 MySQL 1 HTML 5 1 API Development 1 Digital Marketing 1 Online Marketing 1 Digital Strategy 1 Advertising 0 CSS3                     3 AppNexus 1 jQuery 1 JavaScript 1 MySQL 1 HTML 5 1 API Development 1 Digital Marketing 1 Online Marketing 1 Digital Strategy 1 Advertising 0 CSS3 Education Humber College Bachelor of Commerce (BCom),  e-Business Marketing 2008  – 2012 Humber College Bachelor of Commerce (BCom),  e-Business Marketing 2008  – 2012 Humber College Bachelor of Commerce (BCom),  e-Business Marketing 2008  – 2012 Humber College Bachelor of Commerce (BCom),  e-Business Marketing 2008  – 2012 ", "Summary I develop tools, from workflow solutions to customer-facing applications, to increase the effectiveness of support operations. Building things that help to improve people's lives is my passion - right now, I help make the jobs of our support staff more pleasant. I've also developed applications to track group expenses and provide educational solutions. \n \nRegardless of my job role, I aim to always stay challenged and keep learning. As long as I'm making things, helping people, and learning a lot, I'm happy. Specialties:Developing web-based applications, mentoring junior team members, code quality Summary I develop tools, from workflow solutions to customer-facing applications, to increase the effectiveness of support operations. Building things that help to improve people's lives is my passion - right now, I help make the jobs of our support staff more pleasant. I've also developed applications to track group expenses and provide educational solutions. \n \nRegardless of my job role, I aim to always stay challenged and keep learning. As long as I'm making things, helping people, and learning a lot, I'm happy. Specialties:Developing web-based applications, mentoring junior team members, code quality I develop tools, from workflow solutions to customer-facing applications, to increase the effectiveness of support operations. Building things that help to improve people's lives is my passion - right now, I help make the jobs of our support staff more pleasant. I've also developed applications to track group expenses and provide educational solutions. \n \nRegardless of my job role, I aim to always stay challenged and keep learning. As long as I'm making things, helping people, and learning a lot, I'm happy. Specialties:Developing web-based applications, mentoring junior team members, code quality I develop tools, from workflow solutions to customer-facing applications, to increase the effectiveness of support operations. Building things that help to improve people's lives is my passion - right now, I help make the jobs of our support staff more pleasant. I've also developed applications to track group expenses and provide educational solutions. \n \nRegardless of my job role, I aim to always stay challenged and keep learning. As long as I'm making things, helping people, and learning a lot, I'm happy. Specialties:Developing web-based applications, mentoring junior team members, code quality Experience Support Tools Developer Google August 2007  – Present (8 years) Mountain View, CA I develop tools both for our internal support teams and for our customers, with the goal of improving workflow efficiency and customer experience. I work in Java and Python with a focus on web-based applications. (Open) 1 recommendation Josh Li Regional Business Lead, Google [X] for Asia Pacific (APAC) at Google Cathy is passionate about the gaming industry and has done a great job optimizing SEM account structures and keywords for our top gaming clients. In addition to search campaigns, she also creates very high quality optimizations for clients' display... View Optimization Specialist Google October 2007  –  April 2009  (1 year 7 months) Account Associate Google August 2007  –  April 2009  (1 year 9 months) Research Assisstant Pomona College January 2005  –  June 2005  (6 months) Worked with Professor Martin Hackl on eye-tracking studies to gain insight into syntactic processing. Support Tools Developer Google August 2007  – Present (8 years) Mountain View, CA I develop tools both for our internal support teams and for our customers, with the goal of improving workflow efficiency and customer experience. I work in Java and Python with a focus on web-based applications. (Open) 1 recommendation Josh Li Regional Business Lead, Google [X] for Asia Pacific (APAC) at Google Cathy is passionate about the gaming industry and has done a great job optimizing SEM account structures and keywords for our top gaming clients. In addition to search campaigns, she also creates very high quality optimizations for clients' display... View Support Tools Developer Google August 2007  – Present (8 years) Mountain View, CA I develop tools both for our internal support teams and for our customers, with the goal of improving workflow efficiency and customer experience. I work in Java and Python with a focus on web-based applications. (Open) 1 recommendation Josh Li Regional Business Lead, Google [X] for Asia Pacific (APAC) at Google Cathy is passionate about the gaming industry and has done a great job optimizing SEM account structures and keywords for our top gaming clients. In addition to search campaigns, she also creates very high quality optimizations for clients' display... View Optimization Specialist Google October 2007  –  April 2009  (1 year 7 months) Optimization Specialist Google October 2007  –  April 2009  (1 year 7 months) Account Associate Google August 2007  –  April 2009  (1 year 9 months) Account Associate Google August 2007  –  April 2009  (1 year 9 months) Research Assisstant Pomona College January 2005  –  June 2005  (6 months) Worked with Professor Martin Hackl on eye-tracking studies to gain insight into syntactic processing. Research Assisstant Pomona College January 2005  –  June 2005  (6 months) Worked with Professor Martin Hackl on eye-tracking studies to gain insight into syntactic processing. Languages Chinese French Chinese French Chinese French Skills 3 Python 2 User Experience 0 Google Analytics 0 Java 0 SQL Skills  3 Python 2 User Experience 0 Google Analytics 0 Java 0 SQL 3 Python 2 User Experience 0 Google Analytics 0 Java 0 SQL 3 Python 2 User Experience 0 Google Analytics 0 Java 0 SQL           Education Pomona College BA,  Linguistics & Cognitive Science 2003  – 2007 Wrote my senior thesis on language use and its representation of social groupings in World of Warcraft. Pomona College BA,  Linguistics & Cognitive Science 2003  – 2007 Wrote my senior thesis on language use and its representation of social groupings in World of Warcraft. Pomona College BA,  Linguistics & Cognitive Science 2003  – 2007 Wrote my senior thesis on language use and its representation of social groupings in World of Warcraft. Pomona College BA,  Linguistics & Cognitive Science 2003  – 2007 Wrote my senior thesis on language use and its representation of social groupings in World of Warcraft. ", "Summary More than 8 years commercial experience working with multinational organizations in Sri Lanka, Australia, India and Singapore \n \nSpecialize in Web Analytics, Search Engine Optimization and Online Advertising \n \nSpecialties: Search Engine Optimization, Pay- Per-Click(PPC) Advertising, Google Analytics, Google AdWords, Bing Ads, Facebook Ads, Data Visualization Google AdWords Certified Individual - Advance Search Edit Google Analytics Certified Individual Edit Summary More than 8 years commercial experience working with multinational organizations in Sri Lanka, Australia, India and Singapore \n \nSpecialize in Web Analytics, Search Engine Optimization and Online Advertising \n \nSpecialties: Search Engine Optimization, Pay- Per-Click(PPC) Advertising, Google Analytics, Google AdWords, Bing Ads, Facebook Ads, Data Visualization Google AdWords Certified Individual - Advance Search Edit Google Analytics Certified Individual Edit More than 8 years commercial experience working with multinational organizations in Sri Lanka, Australia, India and Singapore \n \nSpecialize in Web Analytics, Search Engine Optimization and Online Advertising \n \nSpecialties: Search Engine Optimization, Pay- Per-Click(PPC) Advertising, Google Analytics, Google AdWords, Bing Ads, Facebook Ads, Data Visualization More than 8 years commercial experience working with multinational organizations in Sri Lanka, Australia, India and Singapore \n \nSpecialize in Web Analytics, Search Engine Optimization and Online Advertising \n \nSpecialties: Search Engine Optimization, Pay- Per-Click(PPC) Advertising, Google Analytics, Google AdWords, Bing Ads, Facebook Ads, Data Visualization Google AdWords Certified Individual - Advance Search Edit Google Analytics Certified Individual Edit Google AdWords Certified Individual - Advance Search Edit Google Analytics Certified Individual Edit Google AdWords Certified Individual - Advance Search Edit Google AdWords Certified Individual - Advance Search  Google AdWords Certified Individual - Advance Search  Google Analytics Certified Individual Edit Google Analytics Certified Individual  Google Analytics Certified Individual  Experience Lead - SEO & Analytics Newbound June 2014  – Present (1 year 2 months) Sydney Area, Australia • Responsible for developing Online Marketing Strategies for company websites \n \n• Responsible for SEO, Paid Advertising and Web Analytics \n \n• Managing the online marketing team and ensuring the team is working efficiently, and providing high quality deliverables  \n \n• Managing PPC campaigns (AdWords, Bing Ads, FB Advertising), budgets and ROI objectives \n \n• Training team members \n \n• Implement A/B and Multivariate testing, using Optimizely to drive maximum conversions and ROI  \n \n• Support marketing team by driving pre-experiment hypothesis and measurement techniques and  \npost campaign result reviews which will include recommendations for future campaigns \n \n• Working with the marketing and sales team to provide proactive and interpretation and insightful  \nanalysis on business performance \n \n• Use monitoring of site performance metrics, including conversion rates and funnel analysis to  \nidentify new opportunities  \n \n \n Certified Trainer - Google Business Products Google Business Group, Colombo May 2014  – Present (1 year 3 months) Sri Lanka Working with Google Business Group Sri Lanka, engaging actively enriching the awareness of the Google brand across Sri Lanka through a variety of activities. \n \nSpecialized in Google Analytics, Google Adwords and Google webmaster tools. Google Business Group, Sri Lanka Edit Online Marketing Consultant / Trainer Isharashehan December 2013  – Present (1 year 8 months) Sri Lanka I coach people latest Online Marketing Strategies and provides Online Marketing Consultancy for local and overseas businesses. My main mission is to help businesses and website owners gain full success from their websites using various digital channels. \n \nSpecialise industries ; \n \n• Travel & Tourism \n• E-Commerce  \n \nMy services include ...... \n \n• Online Marketing consultancy for small and medium size agencies or companies \n \n• Online Marketing Training ( SEO, Google Adwords and Google Analytics) \n \n• PPC (Google Adwords, Bing Ads ) audits, analysis and campaign strategy formulation  \n \n• Advance Google Analytics configuration ( Custom Metrics/Dimensions, Goals, Funnels, etc.)  \n \n• Advance Google Adwords configuration ( Automated Rules, Scripts, Bid Strategy, etc.)  \n \n• Other ad hoc requirements (Conversation Tracking Setup,Custom Reports, SEO Audits, etc.)  (Open) 2 recommendations Lorraine Wickramasinghe Attended APIIT Mr. Ishara is a great teacher. He is capable of teaching to the point by using practical scenarios. Even if you are at zero... View Sandaruwan Silva TechnoPlus Automation I came across Ishara’s website while Googling for a SEO class. There are many Web marketing companies and gurus in Sri... View Senior Engineer – Specialist Virtusa May 2013  –  August 2014  (1 year 4 months) Sri Lanka Working for Virtusa global marketing team and I am responsible for: \n \n# Perform: keyword research to optimize existing content and uncover new opportunities related to Business objectives  \n \n# Provide: SEO analysis and recommendations in coordination with elements and structure of  \nwebsites and web pages  \n \n# Help: to create and support marketing content to socialize and use for social media  \n \n# Update: Social Media websites (LinkedIn, Google+, Facebook) \n \n# Implement: Split-Testing/Multi-Variable Testing  \n \n# Responsible for Implementing and running Pay Per Click campaigns (Google AdWords)  \n \n# Track: Marketing campaigns with monitoring and analyzing \n \n# Monitor and administer: web analytics dashboards, reports, insights and key reporting tools, point out key areas which impact company business objectives (Open) 1 project Virtusa corporate website View (Open) 1 recommendation Jeevaka Fernando Consultant Specialist at Virtusa Shehan is an individual who like to explore new things. While working with him I found out that he is passionate about web analytics. Even with the frequently changing / updating world of SEO, Shehan manages to keep up his speed and quickly grasp... View IT Consulting Outsourcing and Agile Software Development - Virtusa Edit E-commerce Analytics Expert Glotech Services March 2013  –  December 2013  (10 months) Australia Analyzing Web Analytics to identify the Customer Behaviors and Conversion Optimization. Search Engine Optimization Specialist Cyber LMJ January 2012  –  April 2013  (1 year 4 months) Colombo , Sri Lanka Responsible for all the SEO & Web Analytics activities belongs to LMJ Group.  \n \nCompanies and Projects  \n# Casa Colombo - Sri Lanka (www.casacolombo.com ) \n# Gonuts with Donuts - Sri Lanka (www..gonutswithdonuts.com) (Open) 2 projects Casa Colombo - Web Admin / SEO SEO, Developing and Updating the Casa Colombo website ( www.casacolombo.com).\nOptimizing the website for search engines\n#... View Gonuts with Donuts - Web Admin / SEO SEO, Developing and Updating the website.\nOptimizing the website for search engines to get the maximum revenue. View CyberLMJ (PVT) Ltd Edit Search Engine Optimization Specialist Elephanti January 2012  –  April 2013  (1 year 4 months) Singapore Designed and maintaining the unique algorithm which delivers a unique set of Meta data including Geo Targeting. The automated process provides each merchant and user to appear in search results base on his own specific Keywords, Title Tags and Meta Description.  \n \nIn addition, playing the role of Web Analyst and submitting reports and analysis's to the top management for decision making. Analyzing and visualizing data to understand the patterns of user behaviors for better conversions. (Open) 1 project Elephanti Elephanti is a revolutionary website and mobile App designed for people to connect with their favorite stores, venues and brands.\nElephanti goes beyond simply showing what's around, it enables people to follow, interact and build up a network of... View Search on Elephanti to find the products you need in stores nearby Edit IT Executive / Motion Graphic Designer Lankaequilities Group March 2008  –  December 2011  (3 years 10 months) Finance Executive Lankaequities.group February 2003  –  February 2008  (5 years 1 month) Web Designer Wizia (Pvt) Ltd September 2000  –  April 2001  (8 months) Lead - SEO & Analytics Newbound June 2014  – Present (1 year 2 months) Sydney Area, Australia • Responsible for developing Online Marketing Strategies for company websites \n \n• Responsible for SEO, Paid Advertising and Web Analytics \n \n• Managing the online marketing team and ensuring the team is working efficiently, and providing high quality deliverables  \n \n• Managing PPC campaigns (AdWords, Bing Ads, FB Advertising), budgets and ROI objectives \n \n• Training team members \n \n• Implement A/B and Multivariate testing, using Optimizely to drive maximum conversions and ROI  \n \n• Support marketing team by driving pre-experiment hypothesis and measurement techniques and  \npost campaign result reviews which will include recommendations for future campaigns \n \n• Working with the marketing and sales team to provide proactive and interpretation and insightful  \nanalysis on business performance \n \n• Use monitoring of site performance metrics, including conversion rates and funnel analysis to  \nidentify new opportunities  \n \n \n Lead - SEO & Analytics Newbound June 2014  – Present (1 year 2 months) Sydney Area, Australia • Responsible for developing Online Marketing Strategies for company websites \n \n• Responsible for SEO, Paid Advertising and Web Analytics \n \n• Managing the online marketing team and ensuring the team is working efficiently, and providing high quality deliverables  \n \n• Managing PPC campaigns (AdWords, Bing Ads, FB Advertising), budgets and ROI objectives \n \n• Training team members \n \n• Implement A/B and Multivariate testing, using Optimizely to drive maximum conversions and ROI  \n \n• Support marketing team by driving pre-experiment hypothesis and measurement techniques and  \npost campaign result reviews which will include recommendations for future campaigns \n \n• Working with the marketing and sales team to provide proactive and interpretation and insightful  \nanalysis on business performance \n \n• Use monitoring of site performance metrics, including conversion rates and funnel analysis to  \nidentify new opportunities  \n \n \n Certified Trainer - Google Business Products Google Business Group, Colombo May 2014  – Present (1 year 3 months) Sri Lanka Working with Google Business Group Sri Lanka, engaging actively enriching the awareness of the Google brand across Sri Lanka through a variety of activities. \n \nSpecialized in Google Analytics, Google Adwords and Google webmaster tools. Google Business Group, Sri Lanka Edit Certified Trainer - Google Business Products Google Business Group, Colombo May 2014  – Present (1 year 3 months) Sri Lanka Working with Google Business Group Sri Lanka, engaging actively enriching the awareness of the Google brand across Sri Lanka through a variety of activities. \n \nSpecialized in Google Analytics, Google Adwords and Google webmaster tools. Google Business Group, Sri Lanka Edit Google Business Group, Sri Lanka Edit Google Business Group, Sri Lanka Edit Google Business Group, Sri Lanka  Google Business Group, Sri Lanka  Online Marketing Consultant / Trainer Isharashehan December 2013  – Present (1 year 8 months) Sri Lanka I coach people latest Online Marketing Strategies and provides Online Marketing Consultancy for local and overseas businesses. My main mission is to help businesses and website owners gain full success from their websites using various digital channels. \n \nSpecialise industries ; \n \n• Travel & Tourism \n• E-Commerce  \n \nMy services include ...... \n \n• Online Marketing consultancy for small and medium size agencies or companies \n \n• Online Marketing Training ( SEO, Google Adwords and Google Analytics) \n \n• PPC (Google Adwords, Bing Ads ) audits, analysis and campaign strategy formulation  \n \n• Advance Google Analytics configuration ( Custom Metrics/Dimensions, Goals, Funnels, etc.)  \n \n• Advance Google Adwords configuration ( Automated Rules, Scripts, Bid Strategy, etc.)  \n \n• Other ad hoc requirements (Conversation Tracking Setup,Custom Reports, SEO Audits, etc.)  (Open) 2 recommendations Lorraine Wickramasinghe Attended APIIT Mr. Ishara is a great teacher. He is capable of teaching to the point by using practical scenarios. Even if you are at zero... View Sandaruwan Silva TechnoPlus Automation I came across Ishara’s website while Googling for a SEO class. There are many Web marketing companies and gurus in Sri... View Online Marketing Consultant / Trainer Isharashehan December 2013  – Present (1 year 8 months) Sri Lanka I coach people latest Online Marketing Strategies and provides Online Marketing Consultancy for local and overseas businesses. My main mission is to help businesses and website owners gain full success from their websites using various digital channels. \n \nSpecialise industries ; \n \n• Travel & Tourism \n• E-Commerce  \n \nMy services include ...... \n \n• Online Marketing consultancy for small and medium size agencies or companies \n \n• Online Marketing Training ( SEO, Google Adwords and Google Analytics) \n \n• PPC (Google Adwords, Bing Ads ) audits, analysis and campaign strategy formulation  \n \n• Advance Google Analytics configuration ( Custom Metrics/Dimensions, Goals, Funnels, etc.)  \n \n• Advance Google Adwords configuration ( Automated Rules, Scripts, Bid Strategy, etc.)  \n \n• Other ad hoc requirements (Conversation Tracking Setup,Custom Reports, SEO Audits, etc.)  (Open) 2 recommendations Lorraine Wickramasinghe Attended APIIT Mr. Ishara is a great teacher. He is capable of teaching to the point by using practical scenarios. Even if you are at zero... View Sandaruwan Silva TechnoPlus Automation I came across Ishara’s website while Googling for a SEO class. There are many Web marketing companies and gurus in Sri... View Senior Engineer – Specialist Virtusa May 2013  –  August 2014  (1 year 4 months) Sri Lanka Working for Virtusa global marketing team and I am responsible for: \n \n# Perform: keyword research to optimize existing content and uncover new opportunities related to Business objectives  \n \n# Provide: SEO analysis and recommendations in coordination with elements and structure of  \nwebsites and web pages  \n \n# Help: to create and support marketing content to socialize and use for social media  \n \n# Update: Social Media websites (LinkedIn, Google+, Facebook) \n \n# Implement: Split-Testing/Multi-Variable Testing  \n \n# Responsible for Implementing and running Pay Per Click campaigns (Google AdWords)  \n \n# Track: Marketing campaigns with monitoring and analyzing \n \n# Monitor and administer: web analytics dashboards, reports, insights and key reporting tools, point out key areas which impact company business objectives (Open) 1 project Virtusa corporate website View (Open) 1 recommendation Jeevaka Fernando Consultant Specialist at Virtusa Shehan is an individual who like to explore new things. While working with him I found out that he is passionate about web analytics. Even with the frequently changing / updating world of SEO, Shehan manages to keep up his speed and quickly grasp... View IT Consulting Outsourcing and Agile Software Development - Virtusa Edit Senior Engineer – Specialist Virtusa May 2013  –  August 2014  (1 year 4 months) Sri Lanka Working for Virtusa global marketing team and I am responsible for: \n \n# Perform: keyword research to optimize existing content and uncover new opportunities related to Business objectives  \n \n# Provide: SEO analysis and recommendations in coordination with elements and structure of  \nwebsites and web pages  \n \n# Help: to create and support marketing content to socialize and use for social media  \n \n# Update: Social Media websites (LinkedIn, Google+, Facebook) \n \n# Implement: Split-Testing/Multi-Variable Testing  \n \n# Responsible for Implementing and running Pay Per Click campaigns (Google AdWords)  \n \n# Track: Marketing campaigns with monitoring and analyzing \n \n# Monitor and administer: web analytics dashboards, reports, insights and key reporting tools, point out key areas which impact company business objectives (Open) 1 project Virtusa corporate website View (Open) 1 recommendation Jeevaka Fernando Consultant Specialist at Virtusa Shehan is an individual who like to explore new things. While working with him I found out that he is passionate about web analytics. Even with the frequently changing / updating world of SEO, Shehan manages to keep up his speed and quickly grasp... View IT Consulting Outsourcing and Agile Software Development - Virtusa Edit IT Consulting Outsourcing and Agile Software Development - Virtusa Edit IT Consulting Outsourcing and Agile Software Development - Virtusa Edit IT Consulting Outsourcing and Agile Software Development - Virtusa  IT Consulting Outsourcing and Agile Software Development - Virtusa  E-commerce Analytics Expert Glotech Services March 2013  –  December 2013  (10 months) Australia Analyzing Web Analytics to identify the Customer Behaviors and Conversion Optimization. E-commerce Analytics Expert Glotech Services March 2013  –  December 2013  (10 months) Australia Analyzing Web Analytics to identify the Customer Behaviors and Conversion Optimization. Search Engine Optimization Specialist Cyber LMJ January 2012  –  April 2013  (1 year 4 months) Colombo , Sri Lanka Responsible for all the SEO & Web Analytics activities belongs to LMJ Group.  \n \nCompanies and Projects  \n# Casa Colombo - Sri Lanka (www.casacolombo.com ) \n# Gonuts with Donuts - Sri Lanka (www..gonutswithdonuts.com) (Open) 2 projects Casa Colombo - Web Admin / SEO SEO, Developing and Updating the Casa Colombo website ( www.casacolombo.com).\nOptimizing the website for search engines\n#... View Gonuts with Donuts - Web Admin / SEO SEO, Developing and Updating the website.\nOptimizing the website for search engines to get the maximum revenue. View CyberLMJ (PVT) Ltd Edit Search Engine Optimization Specialist Cyber LMJ January 2012  –  April 2013  (1 year 4 months) Colombo , Sri Lanka Responsible for all the SEO & Web Analytics activities belongs to LMJ Group.  \n \nCompanies and Projects  \n# Casa Colombo - Sri Lanka (www.casacolombo.com ) \n# Gonuts with Donuts - Sri Lanka (www..gonutswithdonuts.com) (Open) 2 projects Casa Colombo - Web Admin / SEO SEO, Developing and Updating the Casa Colombo website ( www.casacolombo.com).\nOptimizing the website for search engines\n#... View Gonuts with Donuts - Web Admin / SEO SEO, Developing and Updating the website.\nOptimizing the website for search engines to get the maximum revenue. View CyberLMJ (PVT) Ltd Edit CyberLMJ (PVT) Ltd Edit CyberLMJ (PVT) Ltd Edit CyberLMJ (PVT) Ltd  CyberLMJ (PVT) Ltd  Search Engine Optimization Specialist Elephanti January 2012  –  April 2013  (1 year 4 months) Singapore Designed and maintaining the unique algorithm which delivers a unique set of Meta data including Geo Targeting. The automated process provides each merchant and user to appear in search results base on his own specific Keywords, Title Tags and Meta Description.  \n \nIn addition, playing the role of Web Analyst and submitting reports and analysis's to the top management for decision making. Analyzing and visualizing data to understand the patterns of user behaviors for better conversions. (Open) 1 project Elephanti Elephanti is a revolutionary website and mobile App designed for people to connect with their favorite stores, venues and brands.\nElephanti goes beyond simply showing what's around, it enables people to follow, interact and build up a network of... View Search on Elephanti to find the products you need in stores nearby Edit Search Engine Optimization Specialist Elephanti January 2012  –  April 2013  (1 year 4 months) Singapore Designed and maintaining the unique algorithm which delivers a unique set of Meta data including Geo Targeting. The automated process provides each merchant and user to appear in search results base on his own specific Keywords, Title Tags and Meta Description.  \n \nIn addition, playing the role of Web Analyst and submitting reports and analysis's to the top management for decision making. Analyzing and visualizing data to understand the patterns of user behaviors for better conversions. (Open) 1 project Elephanti Elephanti is a revolutionary website and mobile App designed for people to connect with their favorite stores, venues and brands.\nElephanti goes beyond simply showing what's around, it enables people to follow, interact and build up a network of... View Search on Elephanti to find the products you need in stores nearby Edit Search on Elephanti to find the products you need in stores nearby Edit Search on Elephanti to find the products you need in stores nearby Edit Search on Elephanti to find the products you need in stores nearby  Search on Elephanti to find the products you need in stores nearby  IT Executive / Motion Graphic Designer Lankaequilities Group March 2008  –  December 2011  (3 years 10 months) IT Executive / Motion Graphic Designer Lankaequilities Group March 2008  –  December 2011  (3 years 10 months) Finance Executive Lankaequities.group February 2003  –  February 2008  (5 years 1 month) Finance Executive Lankaequities.group February 2003  –  February 2008  (5 years 1 month) Web Designer Wizia (Pvt) Ltd September 2000  –  April 2001  (8 months) Web Designer Wizia (Pvt) Ltd September 2000  –  April 2001  (8 months) Languages Sinhalese Native or bilingual proficiency English Full professional proficiency Sinhalese Native or bilingual proficiency English Full professional proficiency Sinhalese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Top Skills 33 SEO 26 Web Analytics 21 Google Analytics 17 Google Adwords 15 PHP 14 Web Development 12 E-commerce 10 MySQL 9 Google Webmaster Tools 8 Conversion Optimization Ishara also knows about... 7 HTML 7 Analytics 6 Dreamweaver 6 Keyword Research 6 jQuery 6 CSS 5 JSON 5 PPC 4 Microsoft SQL Server 4 Visual Basic 4 Statistical Data... 4 Organic Search 4 Web Applications 4 SQL 4 User Interface 4 Social Media Marketing 3 PHP4/5 3 Microsoft Excel 3 Visual Studio 3 Data Visualization See 5+     See less Skills  Top Skills 33 SEO 26 Web Analytics 21 Google Analytics 17 Google Adwords 15 PHP 14 Web Development 12 E-commerce 10 MySQL 9 Google Webmaster Tools 8 Conversion Optimization Ishara also knows about... 7 HTML 7 Analytics 6 Dreamweaver 6 Keyword Research 6 jQuery 6 CSS 5 JSON 5 PPC 4 Microsoft SQL Server 4 Visual Basic 4 Statistical Data... 4 Organic Search 4 Web Applications 4 SQL 4 User Interface 4 Social Media Marketing 3 PHP4/5 3 Microsoft Excel 3 Visual Studio 3 Data Visualization See 5+     See less Top Skills 33 SEO 26 Web Analytics 21 Google Analytics 17 Google Adwords 15 PHP 14 Web Development 12 E-commerce 10 MySQL 9 Google Webmaster Tools 8 Conversion Optimization Ishara also knows about... 7 HTML 7 Analytics 6 Dreamweaver 6 Keyword Research 6 jQuery 6 CSS 5 JSON 5 PPC 4 Microsoft SQL Server 4 Visual Basic 4 Statistical Data... 4 Organic Search 4 Web Applications 4 SQL 4 User Interface 4 Social Media Marketing 3 PHP4/5 3 Microsoft Excel 3 Visual Studio 3 Data Visualization See 5+     See less Top Skills 33 SEO 26 Web Analytics 21 Google Analytics 17 Google Adwords 15 PHP 14 Web Development 12 E-commerce 10 MySQL 9 Google Webmaster Tools 8 Conversion Optimization Ishara also knows about... 7 HTML 7 Analytics 6 Dreamweaver 6 Keyword Research 6 jQuery 6 CSS 5 JSON 5 PPC 4 Microsoft SQL Server 4 Visual Basic 4 Statistical Data... 4 Organic Search 4 Web Applications 4 SQL 4 User Interface 4 Social Media Marketing 3 PHP4/5 3 Microsoft Excel 3 Visual Studio 3 Data Visualization See 5+     See less                     7 HTML 7 Analytics 6 Dreamweaver 6 Keyword Research 6 jQuery 6 CSS 5 JSON 5 PPC 4 Microsoft SQL Server 4 Visual Basic 4 Statistical Data... 4 Organic Search 4 Web Applications 4 SQL 4 User Interface 4 Social Media Marketing 3 PHP4/5 3 Microsoft Excel 3 Visual Studio 3 Data Visualization Education British Computer Society Diplomma, Information Technology BCS - The Chartered Institute for IT Edit St. Sebastian's College British Computer Society Diplomma, Information Technology BCS - The Chartered Institute for IT Edit British Computer Society Diplomma, Information Technology British Computer Society Diplomma, Information Technology BCS - The Chartered Institute for IT Edit BCS - The Chartered Institute for IT Edit BCS - The Chartered Institute for IT Edit BCS - The Chartered Institute for IT  BCS - The Chartered Institute for IT  St. Sebastian's College St. Sebastian's College St. Sebastian's College Honors & Awards Additional Honors & Awards •Awarded a Merit award by Growth Lanka (Pvt) LTD for Handling Treasury & finding alternative solutions for financial issues 2004-2005. Additional Honors & Awards •Awarded a Merit award by Growth Lanka (Pvt) LTD for Handling Treasury & finding alternative solutions for financial issues 2004-2005. Additional Honors & Awards •Awarded a Merit award by Growth Lanka (Pvt) LTD for Handling Treasury & finding alternative solutions for financial issues 2004-2005. Additional Honors & Awards •Awarded a Merit award by Growth Lanka (Pvt) LTD for Handling Treasury & finding alternative solutions for financial issues 2004-2005. ", "Experience Product Marketing Manager - DFP Google September 2014  – Present (11 months) Product Marketing Manager for the DoubleClick for Publisher platform, overseeing overall marketing strategy and go-to-market planning. Digital Marketing Manager Google July 2011  – Present (4 years 1 month) Senior member of the Digital Media Strategy group, focusing on driving development and evaluation of all digital media plans for all Google products, including SEM and Display strategies using both in-house and off-network platforms. \n•\tCurrently responsible for coordination of digital media planning across most major Google brands, including Google Nexus, Chrome, Google+ and AdWords.  \n•\tResponsible for developing and implementing Google Marketing standards and practices across all in house biddable media platforms, including Google Search, GDN, AdMob and InviteMedia.  \n•\tPrimary leadership of all Google Marketing Ad Operations activity and trafficking. \n•\tCore responsibilities also include external agency management and coordination and internal technical resource allocation, to ensure efficiency and workload structuring across products and priorities. Display Network Insights Specialist Google September 2008  –  September 2011  (3 years 1 month) Worked cross-functionally with the Engineering, Marketing, Training and Product teams to define the next generation of innovative optimization techniques for the Google Display network. Also worked with Engineering and Product teams to help develop and provide feedback on new GDN features, tools and products \n•\tCore focus on developing Display network sales materials and resources for both internal and external clients. \n•\tResponsible for all GDN product interaction with long tail advertisers, including planning sales programs, creating advertiser specific pitching resources and handling account escalations related to the Google Display network.  \n•\tWorked with several internal sales teams to create scalable Display network solutions for small, local businesses to refine and improve performance across the board. Dedicated Optimization Specialist Google December 2004  –  September 2008  (3 years 10 months) Managed relationships with Google’s top tier advertisers in the travel vertical (including Kayak.com, Mandarin Oriental Hotel Group and Westgate Resorts) to develop and implement online marketing strategies to improve campaign performance, increase ROI and meet their marketing objectives, including analyzing and assessing customer needs, competitive environments, industry trends and made recommendations to optimize website traffic \n•\tWorked with Sales and Engineering teams to develop new tools and strategies for optimization efficiency \n•\tResponsible for coordinating and running an organization-wide program for evaluating optimization and strategy solutions quality for all junior team members. Marketing & Promotions Supervisor Paramount's Great America March 2004  –  November 2004  (9 months) •\tResponsible for organizing and maintaining park related marketing and promotional activities, including all in-park radio and television promotions, print campaigns, and promotion events. \n•\tResponsible for planning, organizing and executing management of all park special events and concerts, including day-of logistics, park personnel management and attendee satisfaction. Assignment Desk Editor KRON-TV September 2003  –  March 2004  (7 months) •\tResponsible for all aspects of research and story development for the editorial assignment desk, including story aggregation, lead development, and reporter assignment logistics. \n•\tAlso responsible for cultivating and utilizing relationships with a wide variety of local and state governmental agencies, including local police, fire and disaster response agencies to develop resources and contacts for various reporting assignments. Product Marketing Manager - DFP Google September 2014  – Present (11 months) Product Marketing Manager for the DoubleClick for Publisher platform, overseeing overall marketing strategy and go-to-market planning. Product Marketing Manager - DFP Google September 2014  – Present (11 months) Product Marketing Manager for the DoubleClick for Publisher platform, overseeing overall marketing strategy and go-to-market planning. Digital Marketing Manager Google July 2011  – Present (4 years 1 month) Senior member of the Digital Media Strategy group, focusing on driving development and evaluation of all digital media plans for all Google products, including SEM and Display strategies using both in-house and off-network platforms. \n•\tCurrently responsible for coordination of digital media planning across most major Google brands, including Google Nexus, Chrome, Google+ and AdWords.  \n•\tResponsible for developing and implementing Google Marketing standards and practices across all in house biddable media platforms, including Google Search, GDN, AdMob and InviteMedia.  \n•\tPrimary leadership of all Google Marketing Ad Operations activity and trafficking. \n•\tCore responsibilities also include external agency management and coordination and internal technical resource allocation, to ensure efficiency and workload structuring across products and priorities. Digital Marketing Manager Google July 2011  – Present (4 years 1 month) Senior member of the Digital Media Strategy group, focusing on driving development and evaluation of all digital media plans for all Google products, including SEM and Display strategies using both in-house and off-network platforms. \n•\tCurrently responsible for coordination of digital media planning across most major Google brands, including Google Nexus, Chrome, Google+ and AdWords.  \n•\tResponsible for developing and implementing Google Marketing standards and practices across all in house biddable media platforms, including Google Search, GDN, AdMob and InviteMedia.  \n•\tPrimary leadership of all Google Marketing Ad Operations activity and trafficking. \n•\tCore responsibilities also include external agency management and coordination and internal technical resource allocation, to ensure efficiency and workload structuring across products and priorities. Display Network Insights Specialist Google September 2008  –  September 2011  (3 years 1 month) Worked cross-functionally with the Engineering, Marketing, Training and Product teams to define the next generation of innovative optimization techniques for the Google Display network. Also worked with Engineering and Product teams to help develop and provide feedback on new GDN features, tools and products \n•\tCore focus on developing Display network sales materials and resources for both internal and external clients. \n•\tResponsible for all GDN product interaction with long tail advertisers, including planning sales programs, creating advertiser specific pitching resources and handling account escalations related to the Google Display network.  \n•\tWorked with several internal sales teams to create scalable Display network solutions for small, local businesses to refine and improve performance across the board. Display Network Insights Specialist Google September 2008  –  September 2011  (3 years 1 month) Worked cross-functionally with the Engineering, Marketing, Training and Product teams to define the next generation of innovative optimization techniques for the Google Display network. Also worked with Engineering and Product teams to help develop and provide feedback on new GDN features, tools and products \n•\tCore focus on developing Display network sales materials and resources for both internal and external clients. \n•\tResponsible for all GDN product interaction with long tail advertisers, including planning sales programs, creating advertiser specific pitching resources and handling account escalations related to the Google Display network.  \n•\tWorked with several internal sales teams to create scalable Display network solutions for small, local businesses to refine and improve performance across the board. Dedicated Optimization Specialist Google December 2004  –  September 2008  (3 years 10 months) Managed relationships with Google’s top tier advertisers in the travel vertical (including Kayak.com, Mandarin Oriental Hotel Group and Westgate Resorts) to develop and implement online marketing strategies to improve campaign performance, increase ROI and meet their marketing objectives, including analyzing and assessing customer needs, competitive environments, industry trends and made recommendations to optimize website traffic \n•\tWorked with Sales and Engineering teams to develop new tools and strategies for optimization efficiency \n•\tResponsible for coordinating and running an organization-wide program for evaluating optimization and strategy solutions quality for all junior team members. Dedicated Optimization Specialist Google December 2004  –  September 2008  (3 years 10 months) Managed relationships with Google’s top tier advertisers in the travel vertical (including Kayak.com, Mandarin Oriental Hotel Group and Westgate Resorts) to develop and implement online marketing strategies to improve campaign performance, increase ROI and meet their marketing objectives, including analyzing and assessing customer needs, competitive environments, industry trends and made recommendations to optimize website traffic \n•\tWorked with Sales and Engineering teams to develop new tools and strategies for optimization efficiency \n•\tResponsible for coordinating and running an organization-wide program for evaluating optimization and strategy solutions quality for all junior team members. Marketing & Promotions Supervisor Paramount's Great America March 2004  –  November 2004  (9 months) •\tResponsible for organizing and maintaining park related marketing and promotional activities, including all in-park radio and television promotions, print campaigns, and promotion events. \n•\tResponsible for planning, organizing and executing management of all park special events and concerts, including day-of logistics, park personnel management and attendee satisfaction. Marketing & Promotions Supervisor Paramount's Great America March 2004  –  November 2004  (9 months) •\tResponsible for organizing and maintaining park related marketing and promotional activities, including all in-park radio and television promotions, print campaigns, and promotion events. \n•\tResponsible for planning, organizing and executing management of all park special events and concerts, including day-of logistics, park personnel management and attendee satisfaction. Assignment Desk Editor KRON-TV September 2003  –  March 2004  (7 months) •\tResponsible for all aspects of research and story development for the editorial assignment desk, including story aggregation, lead development, and reporter assignment logistics. \n•\tAlso responsible for cultivating and utilizing relationships with a wide variety of local and state governmental agencies, including local police, fire and disaster response agencies to develop resources and contacts for various reporting assignments. Assignment Desk Editor KRON-TV September 2003  –  March 2004  (7 months) •\tResponsible for all aspects of research and story development for the editorial assignment desk, including story aggregation, lead development, and reporter assignment logistics. \n•\tAlso responsible for cultivating and utilizing relationships with a wide variety of local and state governmental agencies, including local police, fire and disaster response agencies to develop resources and contacts for various reporting assignments. Skills Top Skills 25 Google Adwords 12 Advertising 11 Product Marketing 8 Digital Marketing 8 Marketing Strategy 6 Online Marketing 4 Strategy 4 Digital Strategy 3 Google Analytics 3 Digital Media Paul also knows about... 2 Social Media Marketing 1 Strategic Planning 1 DoubleClick 1 Digital Signal... 1 Marketing 1 SEM 1 Mobile Marketing 1 Online Advertising 0 DSP Skills  Top Skills 25 Google Adwords 12 Advertising 11 Product Marketing 8 Digital Marketing 8 Marketing Strategy 6 Online Marketing 4 Strategy 4 Digital Strategy 3 Google Analytics 3 Digital Media Paul also knows about... 2 Social Media Marketing 1 Strategic Planning 1 DoubleClick 1 Digital Signal... 1 Marketing 1 SEM 1 Mobile Marketing 1 Online Advertising 0 DSP Top Skills 25 Google Adwords 12 Advertising 11 Product Marketing 8 Digital Marketing 8 Marketing Strategy 6 Online Marketing 4 Strategy 4 Digital Strategy 3 Google Analytics 3 Digital Media Paul also knows about... 2 Social Media Marketing 1 Strategic Planning 1 DoubleClick 1 Digital Signal... 1 Marketing 1 SEM 1 Mobile Marketing 1 Online Advertising 0 DSP Top Skills 25 Google Adwords 12 Advertising 11 Product Marketing 8 Digital Marketing 8 Marketing Strategy 6 Online Marketing 4 Strategy 4 Digital Strategy 3 Google Analytics 3 Digital Media Paul also knows about... 2 Social Media Marketing 1 Strategic Planning 1 DoubleClick 1 Digital Signal... 1 Marketing 1 SEM 1 Mobile Marketing 1 Online Advertising 0 DSP                     2 Social Media Marketing 1 Strategic Planning 1 DoubleClick 1 Digital Signal... 1 Marketing 1 SEM 1 Mobile Marketing 1 Online Advertising 0 DSP Education San Jose State University B.S.,  Broadcast Journalism 1999  – 2004 San Jose State University B.S.,  Broadcast Journalism 1999  – 2004 San Jose State University B.S.,  Broadcast Journalism 1999  – 2004 San Jose State University B.S.,  Broadcast Journalism 1999  – 2004 Honors & Awards Additional Honors & Awards Online Sales & Operations Platinum Recognition Award \nVP of Online Sales & Operations Award \nGoogle OC Award Additional Honors & Awards Online Sales & Operations Platinum Recognition Award \nVP of Online Sales & Operations Award \nGoogle OC Award Additional Honors & Awards Online Sales & Operations Platinum Recognition Award \nVP of Online Sales & Operations Award \nGoogle OC Award Additional Honors & Awards Online Sales & Operations Platinum Recognition Award \nVP of Online Sales & Operations Award \nGoogle OC Award ", "Experience Senior Analytical Lead Google January 2013  – Present (2 years 7 months) Mountain View, CA (Open) 1 recommendation Sarah Travis Head of Industry - Google I directly managed Haley for almost five years at Google, and she’s one of the best, smartest, most flexible and reliable employees I’ve ever had the pleasure of working with. I’d gladly take her onto any team I lead.\nOne of Haley’s greatest... View Account Executive Google November 2010  –  December 2012  (2 years 2 months) Mountain View, CA AdWords Account Executive, Destination Tourism Optimization Specialist Google November 2006  –  November 2010  (4 years 1 month) Mountain View, CA Client Services Norcast Telecom Networks August 2003  –  October 2006  (3 years 3 months) Senior Analytical Lead Google January 2013  – Present (2 years 7 months) Mountain View, CA (Open) 1 recommendation Sarah Travis Head of Industry - Google I directly managed Haley for almost five years at Google, and she’s one of the best, smartest, most flexible and reliable employees I’ve ever had the pleasure of working with. I’d gladly take her onto any team I lead.\nOne of Haley’s greatest... View Senior Analytical Lead Google January 2013  – Present (2 years 7 months) Mountain View, CA (Open) 1 recommendation Sarah Travis Head of Industry - Google I directly managed Haley for almost five years at Google, and she’s one of the best, smartest, most flexible and reliable employees I’ve ever had the pleasure of working with. I’d gladly take her onto any team I lead.\nOne of Haley’s greatest... View Account Executive Google November 2010  –  December 2012  (2 years 2 months) Mountain View, CA AdWords Account Executive, Destination Tourism Account Executive Google November 2010  –  December 2012  (2 years 2 months) Mountain View, CA AdWords Account Executive, Destination Tourism Optimization Specialist Google November 2006  –  November 2010  (4 years 1 month) Mountain View, CA Optimization Specialist Google November 2006  –  November 2010  (4 years 1 month) Mountain View, CA Client Services Norcast Telecom Networks August 2003  –  October 2006  (3 years 3 months) Client Services Norcast Telecom Networks August 2003  –  October 2006  (3 years 3 months) Skills Top Skills 14 Google Adwords 13 Online Advertising 8 Display Advertising 7 Marketing Strategy 7 Search Advertising 6 Competitive Analysis 5 Digital Marketing 5 Google Analytics 5 SEM 5 PPC Haley also knows about... 4 Customer Service 4 Mobile Advertising 3 Microsoft Office 3 Project Management 3 Web Analytics 3 Mobile Marketing 3 Digital Strategy 2 Microsoft Excel 2 PowerPoint 2 Analytical Skills 2 Analytics 1 Microsoft Word 1 English 1 Windows 1 Sales Presentations 1 Experian Hitwise 1 Interviewing Skills 1 Team Mentoring 1 Data Analysis 1 Marketing 1 Ad Networks 1 SEO 1 Landing Page... See 8+     See less Skills  Top Skills 14 Google Adwords 13 Online Advertising 8 Display Advertising 7 Marketing Strategy 7 Search Advertising 6 Competitive Analysis 5 Digital Marketing 5 Google Analytics 5 SEM 5 PPC Haley also knows about... 4 Customer Service 4 Mobile Advertising 3 Microsoft Office 3 Project Management 3 Web Analytics 3 Mobile Marketing 3 Digital Strategy 2 Microsoft Excel 2 PowerPoint 2 Analytical Skills 2 Analytics 1 Microsoft Word 1 English 1 Windows 1 Sales Presentations 1 Experian Hitwise 1 Interviewing Skills 1 Team Mentoring 1 Data Analysis 1 Marketing 1 Ad Networks 1 SEO 1 Landing Page... See 8+     See less Top Skills 14 Google Adwords 13 Online Advertising 8 Display Advertising 7 Marketing Strategy 7 Search Advertising 6 Competitive Analysis 5 Digital Marketing 5 Google Analytics 5 SEM 5 PPC Haley also knows about... 4 Customer Service 4 Mobile Advertising 3 Microsoft Office 3 Project Management 3 Web Analytics 3 Mobile Marketing 3 Digital Strategy 2 Microsoft Excel 2 PowerPoint 2 Analytical Skills 2 Analytics 1 Microsoft Word 1 English 1 Windows 1 Sales Presentations 1 Experian Hitwise 1 Interviewing Skills 1 Team Mentoring 1 Data Analysis 1 Marketing 1 Ad Networks 1 SEO 1 Landing Page... See 8+     See less Top Skills 14 Google Adwords 13 Online Advertising 8 Display Advertising 7 Marketing Strategy 7 Search Advertising 6 Competitive Analysis 5 Digital Marketing 5 Google Analytics 5 SEM 5 PPC Haley also knows about... 4 Customer Service 4 Mobile Advertising 3 Microsoft Office 3 Project Management 3 Web Analytics 3 Mobile Marketing 3 Digital Strategy 2 Microsoft Excel 2 PowerPoint 2 Analytical Skills 2 Analytics 1 Microsoft Word 1 English 1 Windows 1 Sales Presentations 1 Experian Hitwise 1 Interviewing Skills 1 Team Mentoring 1 Data Analysis 1 Marketing 1 Ad Networks 1 SEO 1 Landing Page... See 8+     See less                     4 Customer Service 4 Mobile Advertising 3 Microsoft Office 3 Project Management 3 Web Analytics 3 Mobile Marketing 3 Digital Strategy 2 Microsoft Excel 2 PowerPoint 2 Analytical Skills 2 Analytics 1 Microsoft Word 1 English 1 Windows 1 Sales Presentations 1 Experian Hitwise 1 Interviewing Skills 1 Team Mentoring 1 Data Analysis 1 Marketing 1 Ad Networks 1 SEO 1 Landing Page... Education Cal Poly San Luis Obispo Bachelor of Science (BS),  Business Administration and Management ,  General , Magna Cum Laude 1999  – 2003 Concentrations: Marketing & Finance Activities and Societies:  Alpha Kappa Psi ,  American Marketing Association Cal Poly San Luis Obispo Bachelor of Science (BS),  Business Administration and Management ,  General , Magna Cum Laude 1999  – 2003 Concentrations: Marketing & Finance Activities and Societies:  Alpha Kappa Psi ,  American Marketing Association Cal Poly San Luis Obispo Bachelor of Science (BS),  Business Administration and Management ,  General , Magna Cum Laude 1999  – 2003 Concentrations: Marketing & Finance Activities and Societies:  Alpha Kappa Psi ,  American Marketing Association Cal Poly San Luis Obispo Bachelor of Science (BS),  Business Administration and Management ,  General , Magna Cum Laude 1999  – 2003 Concentrations: Marketing & Finance Activities and Societies:  Alpha Kappa Psi ,  American Marketing Association ", "Experience Business Analyst Google March 2013  – Present (2 years 5 months) Global Display Ads Lead Google February 2012  –  March 2013  (1 year 2 months) Mountain View, CA Display Advertising Optimization Specialist (APAC) Google January 2011  –  February 2012  (1 year 2 months) Tokyo, Japan Content Network Specialist Google October 2008  –  January 2011  (2 years 4 months) Account Strategist, AdSense Google, Inc. September 2005  –  October 2008  (3 years 2 months) Engineering Intern The Boeing Company May 2007  –  August 2007  (4 months) Business Analyst Google March 2013  – Present (2 years 5 months) Business Analyst Google March 2013  – Present (2 years 5 months) Global Display Ads Lead Google February 2012  –  March 2013  (1 year 2 months) Mountain View, CA Global Display Ads Lead Google February 2012  –  March 2013  (1 year 2 months) Mountain View, CA Display Advertising Optimization Specialist (APAC) Google January 2011  –  February 2012  (1 year 2 months) Tokyo, Japan Display Advertising Optimization Specialist (APAC) Google January 2011  –  February 2012  (1 year 2 months) Tokyo, Japan Content Network Specialist Google October 2008  –  January 2011  (2 years 4 months) Content Network Specialist Google October 2008  –  January 2011  (2 years 4 months) Account Strategist, AdSense Google, Inc. September 2005  –  October 2008  (3 years 2 months) Account Strategist, AdSense Google, Inc. September 2005  –  October 2008  (3 years 2 months) Engineering Intern The Boeing Company May 2007  –  August 2007  (4 months) Engineering Intern The Boeing Company May 2007  –  August 2007  (4 months) Skills Top Skills 17 Analytics 13 Web Analytics 12 Online Advertising 9 Google Analytics 9 Google Adwords 8 Digital Marketing 7 PPC 4 Project Management 4 E-commerce 4 Online Marketing Evan also knows about... 3 Product Management 3 Social Media 2 CRM 1 Data Analysis 0 Mobile Devices Skills  Top Skills 17 Analytics 13 Web Analytics 12 Online Advertising 9 Google Analytics 9 Google Adwords 8 Digital Marketing 7 PPC 4 Project Management 4 E-commerce 4 Online Marketing Evan also knows about... 3 Product Management 3 Social Media 2 CRM 1 Data Analysis 0 Mobile Devices Top Skills 17 Analytics 13 Web Analytics 12 Online Advertising 9 Google Analytics 9 Google Adwords 8 Digital Marketing 7 PPC 4 Project Management 4 E-commerce 4 Online Marketing Evan also knows about... 3 Product Management 3 Social Media 2 CRM 1 Data Analysis 0 Mobile Devices Top Skills 17 Analytics 13 Web Analytics 12 Online Advertising 9 Google Analytics 9 Google Adwords 8 Digital Marketing 7 PPC 4 Project Management 4 E-commerce 4 Online Marketing Evan also knows about... 3 Product Management 3 Social Media 2 CRM 1 Data Analysis 0 Mobile Devices                     3 Product Management 3 Social Media 2 CRM 1 Data Analysis 0 Mobile Devices Education Tufts University Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2005 Tufts University Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2005 Tufts University Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2005 Tufts University Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2005 ", "Experience Platform Management Specialist Google May 2014  – Present (1 year 3 months) Mountain View, California Platform Solutions Consultant Google August 2012  –  May 2014  (1 year 10 months) Mountain View, California Weblink Optimization Specialist OpenTable December 2010  –  August 2012  (1 year 9 months) San Francisco OpenTable Social Media tools Edit OpenTable Learning Center - Video tutorials for OpenTable Edit Social Media Intern Meg Whitman for Governor 2010 August 2010  –  November 2010  (4 months) Cupertino, California Meg Whitman for Governor 2010 - Social Media Content Redesign Edit Meg Whitman for Governor 2010 - Interactive Design Edit Production Assistant Nesting Newbies March 2010  –  October 2010  (8 months) (Open) 1 recommendation Jodi Murphy Founder NonProfit | Producer Autism Apps | Creative Director Autism Magazine | Writer | Autism Advocate Erin is the kind of team player we need when we are on a photo shoot for Nesting Newbies...even though we are very organized, there is always an element of chaos and unpredictability. She is a real go-getter and willing to pitch in and do whatever... View Online Marketing Associate Cookeatshare.com June 2008  –  September 2008  (4 months) San Mateo, California (Open) 1 recommendation Mihir Shah Co-Founder and CEO at Immersv, Inc. Erin was a joy to work with. We had just started our new social networking site for home cooks and professional chefs when she joined as an intern. Erin was able to understand the business model very quickly and was able to self-prioritize in... View Platform Management Specialist Google May 2014  – Present (1 year 3 months) Mountain View, California Platform Management Specialist Google May 2014  – Present (1 year 3 months) Mountain View, California Platform Solutions Consultant Google August 2012  –  May 2014  (1 year 10 months) Mountain View, California Platform Solutions Consultant Google August 2012  –  May 2014  (1 year 10 months) Mountain View, California Weblink Optimization Specialist OpenTable December 2010  –  August 2012  (1 year 9 months) San Francisco OpenTable Social Media tools Edit OpenTable Learning Center - Video tutorials for OpenTable Edit Weblink Optimization Specialist OpenTable December 2010  –  August 2012  (1 year 9 months) San Francisco OpenTable Social Media tools Edit OpenTable Learning Center - Video tutorials for OpenTable Edit OpenTable Social Media tools Edit OpenTable Learning Center - Video tutorials for OpenTable Edit OpenTable Social Media tools Edit OpenTable Social Media tools  OpenTable Social Media tools  OpenTable Learning Center - Video tutorials for OpenTable Edit OpenTable Learning Center - Video tutorials for OpenTable  OpenTable Learning Center - Video tutorials for OpenTable  Social Media Intern Meg Whitman for Governor 2010 August 2010  –  November 2010  (4 months) Cupertino, California Meg Whitman for Governor 2010 - Social Media Content Redesign Edit Meg Whitman for Governor 2010 - Interactive Design Edit Social Media Intern Meg Whitman for Governor 2010 August 2010  –  November 2010  (4 months) Cupertino, California Meg Whitman for Governor 2010 - Social Media Content Redesign Edit Meg Whitman for Governor 2010 - Interactive Design Edit Meg Whitman for Governor 2010 - Social Media Content Redesign Edit Meg Whitman for Governor 2010 - Interactive Design Edit Meg Whitman for Governor 2010 - Social Media Content Redesign Edit Meg Whitman for Governor 2010 - Social Media Content Redesign  Meg Whitman for Governor 2010 - Social Media Content Redesign  Meg Whitman for Governor 2010 - Interactive Design Edit Meg Whitman for Governor 2010 - Interactive Design  Meg Whitman for Governor 2010 - Interactive Design  Production Assistant Nesting Newbies March 2010  –  October 2010  (8 months) (Open) 1 recommendation Jodi Murphy Founder NonProfit | Producer Autism Apps | Creative Director Autism Magazine | Writer | Autism Advocate Erin is the kind of team player we need when we are on a photo shoot for Nesting Newbies...even though we are very organized, there is always an element of chaos and unpredictability. She is a real go-getter and willing to pitch in and do whatever... View Production Assistant Nesting Newbies March 2010  –  October 2010  (8 months) (Open) 1 recommendation Jodi Murphy Founder NonProfit | Producer Autism Apps | Creative Director Autism Magazine | Writer | Autism Advocate Erin is the kind of team player we need when we are on a photo shoot for Nesting Newbies...even though we are very organized, there is always an element of chaos and unpredictability. She is a real go-getter and willing to pitch in and do whatever... View Online Marketing Associate Cookeatshare.com June 2008  –  September 2008  (4 months) San Mateo, California (Open) 1 recommendation Mihir Shah Co-Founder and CEO at Immersv, Inc. Erin was a joy to work with. We had just started our new social networking site for home cooks and professional chefs when she joined as an intern. Erin was able to understand the business model very quickly and was able to self-prioritize in... View Online Marketing Associate Cookeatshare.com June 2008  –  September 2008  (4 months) San Mateo, California (Open) 1 recommendation Mihir Shah Co-Founder and CEO at Immersv, Inc. Erin was a joy to work with. We had just started our new social networking site for home cooks and professional chefs when she joined as an intern. Erin was able to understand the business model very quickly and was able to self-prioritize in... View Languages   Skills Top Skills 12 Facebook 10 Social Media 6 Social Media Marketing 4 Event Planning 4 SEO 4 Marketing 3 HTML 3 Social Networking 3 PowerPoint 2 Microsoft Office Erin also knows about... 2 Marketing Strategy 1 Time Management 1 WordPress 1 Press Releases 0 Wordpress 0 Google Adwords 0 Photoshop 0 Public Relations 0 Blogging 0 Microsoft Excel 0 Adobe Creative Suite 0 Eloqua Skills  Top Skills 12 Facebook 10 Social Media 6 Social Media Marketing 4 Event Planning 4 SEO 4 Marketing 3 HTML 3 Social Networking 3 PowerPoint 2 Microsoft Office Erin also knows about... 2 Marketing Strategy 1 Time Management 1 WordPress 1 Press Releases 0 Wordpress 0 Google Adwords 0 Photoshop 0 Public Relations 0 Blogging 0 Microsoft Excel 0 Adobe Creative Suite 0 Eloqua Top Skills 12 Facebook 10 Social Media 6 Social Media Marketing 4 Event Planning 4 SEO 4 Marketing 3 HTML 3 Social Networking 3 PowerPoint 2 Microsoft Office Erin also knows about... 2 Marketing Strategy 1 Time Management 1 WordPress 1 Press Releases 0 Wordpress 0 Google Adwords 0 Photoshop 0 Public Relations 0 Blogging 0 Microsoft Excel 0 Adobe Creative Suite 0 Eloqua Top Skills 12 Facebook 10 Social Media 6 Social Media Marketing 4 Event Planning 4 SEO 4 Marketing 3 HTML 3 Social Networking 3 PowerPoint 2 Microsoft Office Erin also knows about... 2 Marketing Strategy 1 Time Management 1 WordPress 1 Press Releases 0 Wordpress 0 Google Adwords 0 Photoshop 0 Public Relations 0 Blogging 0 Microsoft Excel 0 Adobe Creative Suite 0 Eloqua                     2 Marketing Strategy 1 Time Management 1 WordPress 1 Press Releases 0 Wordpress 0 Google Adwords 0 Photoshop 0 Public Relations 0 Blogging 0 Microsoft Excel 0 Adobe Creative Suite 0 Eloqua Education University of California, Los Angeles Extension Program 2013  – 2013 Kelham Vineyards Website Redesign Edit Cornell University Systems Engineering Certificate Program 2012  – 2012 California College of the Arts CCA Extension 2011  – 2011 Corporate Branding - craft coffee Edit Santa Clara University Bachelor of Science (B.S.), Bachelor of Arts (B.A.) 2006  – 2010 (Open) 1 recommendation Marco Marquez Instructor of Graphic Design at De Anza College Erin was an amazing student. Hard working, intelligent, and creative. I can only think of a hand full if students that were on par with her quality of work and level of professionalism.\nI would highly recommend her for any company or corporation... View Corporate Branding - Safari West Edit Poster Design Edit Rhode Island School of Design Institute for Graphic Design (Summer Studies) 2009  – 2009 Foundation of International Education Study Abroad 2008  – 2008 University of California, Los Angeles Extension Program 2013  – 2013 Kelham Vineyards Website Redesign Edit University of California, Los Angeles Extension Program 2013  – 2013 University of California, Los Angeles Extension Program 2013  – 2013 Kelham Vineyards Website Redesign Edit Kelham Vineyards Website Redesign Edit Kelham Vineyards Website Redesign Edit Kelham Vineyards Website Redesign  Kelham Vineyards Website Redesign  Cornell University Systems Engineering Certificate Program 2012  – 2012 Cornell University Systems Engineering Certificate Program 2012  – 2012 Cornell University Systems Engineering Certificate Program 2012  – 2012 California College of the Arts CCA Extension 2011  – 2011 Corporate Branding - craft coffee Edit California College of the Arts CCA Extension 2011  – 2011 California College of the Arts CCA Extension 2011  – 2011 Corporate Branding - craft coffee Edit Corporate Branding - craft coffee Edit Corporate Branding - craft coffee Edit Corporate Branding - craft coffee  Corporate Branding - craft coffee  Santa Clara University Bachelor of Science (B.S.), Bachelor of Arts (B.A.) 2006  – 2010 (Open) 1 recommendation Marco Marquez Instructor of Graphic Design at De Anza College Erin was an amazing student. Hard working, intelligent, and creative. I can only think of a hand full if students that were on par with her quality of work and level of professionalism.\nI would highly recommend her for any company or corporation... View Corporate Branding - Safari West Edit Poster Design Edit Santa Clara University Bachelor of Science (B.S.), Bachelor of Arts (B.A.) 2006  – 2010 (Open) 1 recommendation Marco Marquez Instructor of Graphic Design at De Anza College Erin was an amazing student. Hard working, intelligent, and creative. I can only think of a hand full if students that were on par with her quality of work and level of professionalism.\nI would highly recommend her for any company or corporation... View Santa Clara University Bachelor of Science (B.S.), Bachelor of Arts (B.A.) 2006  – 2010 (Open) 1 recommendation Marco Marquez Instructor of Graphic Design at De Anza College Erin was an amazing student. Hard working, intelligent, and creative. I can only think of a hand full if students that were on par with her quality of work and level of professionalism.\nI would highly recommend her for any company or corporation... View Corporate Branding - Safari West Edit Poster Design Edit Corporate Branding - Safari West Edit Poster Design Edit Corporate Branding - Safari West Edit Corporate Branding - Safari West  Corporate Branding - Safari West  Poster Design Edit Poster Design  Poster Design  Rhode Island School of Design Institute for Graphic Design (Summer Studies) 2009  – 2009 Rhode Island School of Design Institute for Graphic Design (Summer Studies) 2009  – 2009 Rhode Island School of Design Institute for Graphic Design (Summer Studies) 2009  – 2009 Foundation of International Education Study Abroad 2008  – 2008 Foundation of International Education Study Abroad 2008  – 2008 Foundation of International Education Study Abroad 2008  – 2008 Honors & Awards ", "Experience Localization Specialist at Google Google April 2015  – Present (4 months) Gurgaon, India I have recently moved to a new role at Google where I work along side marketing, product and other stake holders to make Google products as locally relevant as possible for users in India. YouTube Partner Manager, Online Partnerships YouTube, Google January 2011  – Present (4 years 7 months) As a YouTube Partner Manager, I would work on bringing new creators to the platform, helping existing creators make their online content strategies and sharing best practices/knowledge with the largest of YouTube creators in India at scale. Localization Specialist at Google Google April 2015  – Present (4 months) Gurgaon, India I have recently moved to a new role at Google where I work along side marketing, product and other stake holders to make Google products as locally relevant as possible for users in India. Localization Specialist at Google Google April 2015  – Present (4 months) Gurgaon, India I have recently moved to a new role at Google where I work along side marketing, product and other stake holders to make Google products as locally relevant as possible for users in India. YouTube Partner Manager, Online Partnerships YouTube, Google January 2011  – Present (4 years 7 months) As a YouTube Partner Manager, I would work on bringing new creators to the platform, helping existing creators make their online content strategies and sharing best practices/knowledge with the largest of YouTube creators in India at scale. YouTube Partner Manager, Online Partnerships YouTube, Google January 2011  – Present (4 years 7 months) As a YouTube Partner Manager, I would work on bringing new creators to the platform, helping existing creators make their online content strategies and sharing best practices/knowledge with the largest of YouTube creators in India at scale. Languages English Hindi English Hindi English Hindi Skills Top Skills 40 YouTube 8 Content Strategy 12 New Media 55 Google Adwords 5 Brand Management 2 Content Development 14 Digital Strategy 5 Content Management 40 Online Advertising 41 Digital Marketing Aditi also knows about... 24 Search Advertising 15 SEM 17 Digital Media 9 Analytics 11 Social Media Marketing 7 Google Analytics 7 PPC 7 Online Marketing 5 Web Analytics 5 Mobile Marketing 4 Business Strategy 4 Display Advertising 2 Mobile Advertising 1 Online Research 0 Media Planning 0 Web Marketing 0 Partner Management 0 Strategic Partner... 0 Creative Strategy 0 Strategic Consulting 0 Start-up Consulting See 6+     See less Skills  Top Skills 40 YouTube 8 Content Strategy 12 New Media 55 Google Adwords 5 Brand Management 2 Content Development 14 Digital Strategy 5 Content Management 40 Online Advertising 41 Digital Marketing Aditi also knows about... 24 Search Advertising 15 SEM 17 Digital Media 9 Analytics 11 Social Media Marketing 7 Google Analytics 7 PPC 7 Online Marketing 5 Web Analytics 5 Mobile Marketing 4 Business Strategy 4 Display Advertising 2 Mobile Advertising 1 Online Research 0 Media Planning 0 Web Marketing 0 Partner Management 0 Strategic Partner... 0 Creative Strategy 0 Strategic Consulting 0 Start-up Consulting See 6+     See less Top Skills 40 YouTube 8 Content Strategy 12 New Media 55 Google Adwords 5 Brand Management 2 Content Development 14 Digital Strategy 5 Content Management 40 Online Advertising 41 Digital Marketing Aditi also knows about... 24 Search Advertising 15 SEM 17 Digital Media 9 Analytics 11 Social Media Marketing 7 Google Analytics 7 PPC 7 Online Marketing 5 Web Analytics 5 Mobile Marketing 4 Business Strategy 4 Display Advertising 2 Mobile Advertising 1 Online Research 0 Media Planning 0 Web Marketing 0 Partner Management 0 Strategic Partner... 0 Creative Strategy 0 Strategic Consulting 0 Start-up Consulting See 6+     See less Top Skills 40 YouTube 8 Content Strategy 12 New Media 55 Google Adwords 5 Brand Management 2 Content Development 14 Digital Strategy 5 Content Management 40 Online Advertising 41 Digital Marketing Aditi also knows about... 24 Search Advertising 15 SEM 17 Digital Media 9 Analytics 11 Social Media Marketing 7 Google Analytics 7 PPC 7 Online Marketing 5 Web Analytics 5 Mobile Marketing 4 Business Strategy 4 Display Advertising 2 Mobile Advertising 1 Online Research 0 Media Planning 0 Web Marketing 0 Partner Management 0 Strategic Partner... 0 Creative Strategy 0 Strategic Consulting 0 Start-up Consulting See 6+     See less                     24 Search Advertising 15 SEM 17 Digital Media 9 Analytics 11 Social Media Marketing 7 Google Analytics 7 PPC 7 Online Marketing 5 Web Analytics 5 Mobile Marketing 4 Business Strategy 4 Display Advertising 2 Mobile Advertising 1 Online Research 0 Media Planning 0 Web Marketing 0 Partner Management 0 Strategic Partner... 0 Creative Strategy 0 Strategic Consulting 0 Start-up Consulting Education Delhi University BA (Hons),  English Literature 2003  – 2007 Activities and Societies:  President - English Deptt Lit Society ,  Manager - College Magazine ,  Organizer - College festival and Graduation Night ,  Choreographer - Annual dance event Hindu College BA (Hons.), English Literature,  English Literature 2003  – 2006 Activities and Societies:  Creative Writing ,  Poetry ,  Literary club ,  Was the secretary (in 2nd year) and president (in 3rd year) of the English department. Part of the organizing committee for the annual college fest Mecca and the departmental fest Bacchanalia. Delhi University BA (Hons),  English Literature 2003  – 2007 Activities and Societies:  President - English Deptt Lit Society ,  Manager - College Magazine ,  Organizer - College festival and Graduation Night ,  Choreographer - Annual dance event Delhi University BA (Hons),  English Literature 2003  – 2007 Activities and Societies:  President - English Deptt Lit Society ,  Manager - College Magazine ,  Organizer - College festival and Graduation Night ,  Choreographer - Annual dance event Delhi University BA (Hons),  English Literature 2003  – 2007 Activities and Societies:  President - English Deptt Lit Society ,  Manager - College Magazine ,  Organizer - College festival and Graduation Night ,  Choreographer - Annual dance event Hindu College BA (Hons.), English Literature,  English Literature 2003  – 2006 Activities and Societies:  Creative Writing ,  Poetry ,  Literary club ,  Was the secretary (in 2nd year) and president (in 3rd year) of the English department. Part of the organizing committee for the annual college fest Mecca and the departmental fest Bacchanalia. Hindu College BA (Hons.), English Literature,  English Literature 2003  – 2006 Activities and Societies:  Creative Writing ,  Poetry ,  Literary club ,  Was the secretary (in 2nd year) and president (in 3rd year) of the English department. Part of the organizing committee for the annual college fest Mecca and the departmental fest Bacchanalia. Hindu College BA (Hons.), English Literature,  English Literature 2003  – 2006 Activities and Societies:  Creative Writing ,  Poetry ,  Literary club ,  Was the secretary (in 2nd year) and president (in 3rd year) of the English department. Part of the organizing committee for the annual college fest Mecca and the departmental fest Bacchanalia. ", "Experience Sales Technical Operations Specialist Google 2013  – Present (2 years) Greater Los Angeles Area Account Manager Google 2012  –  2013  (1 year) Greater Los Angeles Area Account Planner Google 2011  –  January 2012  (1 year) Greater Los Angeles Area Product Quality Optimization Specialist II Yahoo! 2011  –  2011  (less than a year) Greater Los Angeles Area Account Manager Google 2006  –  2010  (4 years) Hong Kong (Open) 1 recommendation Mariela Stescobich Senior Partner Manager, Channel Management at Yahoo! I had the pleasure of working with Ashley during my last year at Cars.com.\nBesides being a very dedicated account manager, Ashley has been fantastic in giving us access to beta products to test and helping us continue growing our search engine... View Film Distribution Executive Golden Harvest Entertainment 2005  –  2006  (1 year) Hong Kong Sales Technical Operations Specialist Google 2013  – Present (2 years) Greater Los Angeles Area Sales Technical Operations Specialist Google 2013  – Present (2 years) Greater Los Angeles Area Account Manager Google 2012  –  2013  (1 year) Greater Los Angeles Area Account Manager Google 2012  –  2013  (1 year) Greater Los Angeles Area Account Planner Google 2011  –  January 2012  (1 year) Greater Los Angeles Area Account Planner Google 2011  –  January 2012  (1 year) Greater Los Angeles Area Product Quality Optimization Specialist II Yahoo! 2011  –  2011  (less than a year) Greater Los Angeles Area Product Quality Optimization Specialist II Yahoo! 2011  –  2011  (less than a year) Greater Los Angeles Area Account Manager Google 2006  –  2010  (4 years) Hong Kong (Open) 1 recommendation Mariela Stescobich Senior Partner Manager, Channel Management at Yahoo! I had the pleasure of working with Ashley during my last year at Cars.com.\nBesides being a very dedicated account manager, Ashley has been fantastic in giving us access to beta products to test and helping us continue growing our search engine... View Account Manager Google 2006  –  2010  (4 years) Hong Kong (Open) 1 recommendation Mariela Stescobich Senior Partner Manager, Channel Management at Yahoo! I had the pleasure of working with Ashley during my last year at Cars.com.\nBesides being a very dedicated account manager, Ashley has been fantastic in giving us access to beta products to test and helping us continue growing our search engine... View Film Distribution Executive Golden Harvest Entertainment 2005  –  2006  (1 year) Hong Kong Film Distribution Executive Golden Harvest Entertainment 2005  –  2006  (1 year) Hong Kong Skills 13 Search Advertising 13 SEM 7 Online Advertising 4 Google Adwords 4 PPC Skills  13 Search Advertising 13 SEM 7 Online Advertising 4 Google Adwords 4 PPC 13 Search Advertising 13 SEM 7 Online Advertising 4 Google Adwords 4 PPC 13 Search Advertising 13 SEM 7 Online Advertising 4 Google Adwords 4 PPC           Education The Chinese University of Hong Kong Bachelor of Arts (Hons),  Translation 2001  – 2005 University of California, Irvine Exchange Program,  Film and Media Studies 2003  – 2004 The Chinese University of Hong Kong Bachelor of Arts (Hons),  Translation 2001  – 2005 The Chinese University of Hong Kong Bachelor of Arts (Hons),  Translation 2001  – 2005 The Chinese University of Hong Kong Bachelor of Arts (Hons),  Translation 2001  – 2005 University of California, Irvine Exchange Program,  Film and Media Studies 2003  – 2004 University of California, Irvine Exchange Program,  Film and Media Studies 2003  – 2004 University of California, Irvine Exchange Program,  Film and Media Studies 2003  – 2004 ", "Experience Google Apps SMB Country Manager, APAC Google July 2011  – Present (4 years 1 month) Sydney, Australia Bringing Google Apps to SMBs in the Philippines, Indonesia, Sri Lanka, Thailand, Pakistan, Bangladesh, Afghanistan, Nepal and the Maldives. Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business Edit Epitome Travel Solutions achieves a synchronised work environment with Google Apps Edit Kaavian Systems migrates from hosted email to Google Apps Edit Google Apps Inside Sales, CA Google 2009  –  2011  (2 years) Mountain View, CA HÔM Real Estate Group - Why we switched to Google Apps Edit Mazda Raceway Laguna Seca Goes Google Edit Optimization Specialist, AdWords NA Google, Inc. 2004  –  2009  (5 years) Mountain View, CA Advised on strategy and executed Search and Content campaigns for online retailers such as SHOP.com and Backcountry.com. \n \nLaunched Optimization Team at Google India offices in Hyderabad and Gurgaon. Google Apps SMB Country Manager, APAC Google July 2011  – Present (4 years 1 month) Sydney, Australia Bringing Google Apps to SMBs in the Philippines, Indonesia, Sri Lanka, Thailand, Pakistan, Bangladesh, Afghanistan, Nepal and the Maldives. Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business Edit Epitome Travel Solutions achieves a synchronised work environment with Google Apps Edit Kaavian Systems migrates from hosted email to Google Apps Edit Google Apps SMB Country Manager, APAC Google July 2011  – Present (4 years 1 month) Sydney, Australia Bringing Google Apps to SMBs in the Philippines, Indonesia, Sri Lanka, Thailand, Pakistan, Bangladesh, Afghanistan, Nepal and the Maldives. Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business Edit Epitome Travel Solutions achieves a synchronised work environment with Google Apps Edit Kaavian Systems migrates from hosted email to Google Apps Edit Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business Edit Epitome Travel Solutions achieves a synchronised work environment with Google Apps Edit Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business Edit Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business  Kailash Healthcare Improves Efficiency By 40% With Google Apps For Business  Epitome Travel Solutions achieves a synchronised work environment with Google Apps Edit Epitome Travel Solutions achieves a synchronised work environment with Google Apps  Epitome Travel Solutions achieves a synchronised work environment with Google Apps  Kaavian Systems migrates from hosted email to Google Apps Edit Kaavian Systems migrates from hosted email to Google Apps Edit Kaavian Systems migrates from hosted email to Google Apps  Kaavian Systems migrates from hosted email to Google Apps  Google Apps Inside Sales, CA Google 2009  –  2011  (2 years) Mountain View, CA HÔM Real Estate Group - Why we switched to Google Apps Edit Mazda Raceway Laguna Seca Goes Google Edit Google Apps Inside Sales, CA Google 2009  –  2011  (2 years) Mountain View, CA HÔM Real Estate Group - Why we switched to Google Apps Edit Mazda Raceway Laguna Seca Goes Google Edit HÔM Real Estate Group - Why we switched to Google Apps Edit Mazda Raceway Laguna Seca Goes Google Edit HÔM Real Estate Group - Why we switched to Google Apps Edit HÔM Real Estate Group - Why we switched to Google Apps  HÔM Real Estate Group - Why we switched to Google Apps  Mazda Raceway Laguna Seca Goes Google Edit Mazda Raceway Laguna Seca Goes Google  Mazda Raceway Laguna Seca Goes Google  Optimization Specialist, AdWords NA Google, Inc. 2004  –  2009  (5 years) Mountain View, CA Advised on strategy and executed Search and Content campaigns for online retailers such as SHOP.com and Backcountry.com. \n \nLaunched Optimization Team at Google India offices in Hyderabad and Gurgaon. Optimization Specialist, AdWords NA Google, Inc. 2004  –  2009  (5 years) Mountain View, CA Advised on strategy and executed Search and Content campaigns for online retailers such as SHOP.com and Backcountry.com. \n \nLaunched Optimization Team at Google India offices in Hyderabad and Gurgaon. Skills Top Skills 30 Google Apps 24 Google Adwords 19 Enterprise Software 18 Strategy 11 SaaS 10 Selling 10 SEM 9 Cloud Computing 8 Salesforce.com 8 Online Advertising Anna also knows about... 8 Project Management 6 Pre-sales 6 Google Analytics 2 Telecommunications 1 Search Advertising Skills  Top Skills 30 Google Apps 24 Google Adwords 19 Enterprise Software 18 Strategy 11 SaaS 10 Selling 10 SEM 9 Cloud Computing 8 Salesforce.com 8 Online Advertising Anna also knows about... 8 Project Management 6 Pre-sales 6 Google Analytics 2 Telecommunications 1 Search Advertising Top Skills 30 Google Apps 24 Google Adwords 19 Enterprise Software 18 Strategy 11 SaaS 10 Selling 10 SEM 9 Cloud Computing 8 Salesforce.com 8 Online Advertising Anna also knows about... 8 Project Management 6 Pre-sales 6 Google Analytics 2 Telecommunications 1 Search Advertising Top Skills 30 Google Apps 24 Google Adwords 19 Enterprise Software 18 Strategy 11 SaaS 10 Selling 10 SEM 9 Cloud Computing 8 Salesforce.com 8 Online Advertising Anna also knows about... 8 Project Management 6 Pre-sales 6 Google Analytics 2 Telecommunications 1 Search Advertising                     8 Project Management 6 Pre-sales 6 Google Analytics 2 Telecommunications 1 Search Advertising Education California Polytechnic State University-San Luis Obispo BS,  Business Administration 1999  – 2003 Homestead High School 1999 California Polytechnic State University-San Luis Obispo BS,  Business Administration 1999  – 2003 California Polytechnic State University-San Luis Obispo BS,  Business Administration 1999  – 2003 California Polytechnic State University-San Luis Obispo BS,  Business Administration 1999  – 2003 Homestead High School 1999 Homestead High School 1999 Homestead High School 1999 ", "Summary Specialties:B2B Marketing, Online Marketing, Search Engine Marketing, Search Advertising, Display Advertising, Mobile Advertising Summary Specialties:B2B Marketing, Online Marketing, Search Engine Marketing, Search Advertising, Display Advertising, Mobile Advertising Specialties:B2B Marketing, Online Marketing, Search Engine Marketing, Search Advertising, Display Advertising, Mobile Advertising Specialties:B2B Marketing, Online Marketing, Search Engine Marketing, Search Advertising, Display Advertising, Mobile Advertising Experience AdWords Analytical Lead Google December 2011  – Present (3 years 8 months) AdWords Analytical Lead Google December 2011  – Present (3 years 8 months) AdWords Analytical Lead Google December 2011  – Present (3 years 8 months) Skills Top Skills 30 Google Adwords 22 SEM 14 Search Advertising 10 Digital Strategy 9 Online Advertising 7 Display Advertising 5 Mobile Advertising 4 PPC 3 B2B Marketing 2 Digital Marketing Ansel also knows about... 1 Product Development 1 YouTube 1 Strategic Partnerships 1 Product Marketing Skills  Top Skills 30 Google Adwords 22 SEM 14 Search Advertising 10 Digital Strategy 9 Online Advertising 7 Display Advertising 5 Mobile Advertising 4 PPC 3 B2B Marketing 2 Digital Marketing Ansel also knows about... 1 Product Development 1 YouTube 1 Strategic Partnerships 1 Product Marketing Top Skills 30 Google Adwords 22 SEM 14 Search Advertising 10 Digital Strategy 9 Online Advertising 7 Display Advertising 5 Mobile Advertising 4 PPC 3 B2B Marketing 2 Digital Marketing Ansel also knows about... 1 Product Development 1 YouTube 1 Strategic Partnerships 1 Product Marketing Top Skills 30 Google Adwords 22 SEM 14 Search Advertising 10 Digital Strategy 9 Online Advertising 7 Display Advertising 5 Mobile Advertising 4 PPC 3 B2B Marketing 2 Digital Marketing Ansel also knows about... 1 Product Development 1 YouTube 1 Strategic Partnerships 1 Product Marketing                     1 Product Development 1 YouTube 1 Strategic Partnerships 1 Product Marketing Education Harvard University BA,  Psychology 2002  – 2006 Activities and Societies:  Harvard Media Ventures ,  Let's Go ,  Lowell House Committee ,  Psychology Lab Research Assistant Harvard University BA,  Psychology 2002  – 2006 Activities and Societies:  Harvard Media Ventures ,  Let's Go ,  Lowell House Committee ,  Psychology Lab Research Assistant Harvard University BA,  Psychology 2002  – 2006 Activities and Societies:  Harvard Media Ventures ,  Let's Go ,  Lowell House Committee ,  Psychology Lab Research Assistant Harvard University BA,  Psychology 2002  – 2006 Activities and Societies:  Harvard Media Ventures ,  Let's Go ,  Lowell House Committee ,  Psychology Lab Research Assistant ", "Experience Principal Analytical Lead, Large Customer Sales Google May 2015  – Present (3 months) Mountain View, CA Senior Analytical Lead, Large Customer Sales Google January 2012  –  May 2015  (3 years 5 months) (Open) 3 honors and awards Gold Award for Innovation - Large Customer Sales, Americas Region View Pureplayer of the Month Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and... View Top Guru Award View AdWords Account Strategist, Online Sales - Retail Google April 2009  –  December 2011  (2 years 9 months) (Open) 1 honor or award Ben Franklin Innovation Award View AdWords Optimization Specialist, Technology B2B Google September 2007  –  March 2009  (1 year 7 months) Intern J.D. Power and Associates June 2006  –  August 2006  (3 months) Principal Analytical Lead, Large Customer Sales Google May 2015  – Present (3 months) Mountain View, CA Principal Analytical Lead, Large Customer Sales Google May 2015  – Present (3 months) Mountain View, CA Senior Analytical Lead, Large Customer Sales Google January 2012  –  May 2015  (3 years 5 months) (Open) 3 honors and awards Gold Award for Innovation - Large Customer Sales, Americas Region View Pureplayer of the Month Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and... View Top Guru Award View Senior Analytical Lead, Large Customer Sales Google January 2012  –  May 2015  (3 years 5 months) (Open) 3 honors and awards Gold Award for Innovation - Large Customer Sales, Americas Region View Pureplayer of the Month Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and... View Top Guru Award View AdWords Account Strategist, Online Sales - Retail Google April 2009  –  December 2011  (2 years 9 months) (Open) 1 honor or award Ben Franklin Innovation Award View AdWords Account Strategist, Online Sales - Retail Google April 2009  –  December 2011  (2 years 9 months) (Open) 1 honor or award Ben Franklin Innovation Award View AdWords Optimization Specialist, Technology B2B Google September 2007  –  March 2009  (1 year 7 months) AdWords Optimization Specialist, Technology B2B Google September 2007  –  March 2009  (1 year 7 months) Intern J.D. Power and Associates June 2006  –  August 2006  (3 months) Intern J.D. Power and Associates June 2006  –  August 2006  (3 months) Skills Top Skills 22 Google Adwords 13 Google Analytics 12 SEM 11 Online Advertising 5 Web Analytics 4 Microsoft Excel 4 Data Analysis 4 Online Marketing 4 Analytics 2 Mobile Advertising Andrew also knows about... 1 Data Visualization 1 Online Marketing... Skills  Top Skills 22 Google Adwords 13 Google Analytics 12 SEM 11 Online Advertising 5 Web Analytics 4 Microsoft Excel 4 Data Analysis 4 Online Marketing 4 Analytics 2 Mobile Advertising Andrew also knows about... 1 Data Visualization 1 Online Marketing... Top Skills 22 Google Adwords 13 Google Analytics 12 SEM 11 Online Advertising 5 Web Analytics 4 Microsoft Excel 4 Data Analysis 4 Online Marketing 4 Analytics 2 Mobile Advertising Andrew also knows about... 1 Data Visualization 1 Online Marketing... Top Skills 22 Google Adwords 13 Google Analytics 12 SEM 11 Online Advertising 5 Web Analytics 4 Microsoft Excel 4 Data Analysis 4 Online Marketing 4 Analytics 2 Mobile Advertising Andrew also knows about... 1 Data Visualization 1 Online Marketing...                     1 Data Visualization 1 Online Marketing... Education Connecticut College BA,  Government ,  Statistics 2003  – 2007 Activities and Societies:  Varsity Tennis - Singles and Doubles ,  The College Voice - Humor Columnist Connecticut College BA,  Government ,  Statistics 2003  – 2007 Activities and Societies:  Varsity Tennis - Singles and Doubles ,  The College Voice - Humor Columnist Connecticut College BA,  Government ,  Statistics 2003  – 2007 Activities and Societies:  Varsity Tennis - Singles and Doubles ,  The College Voice - Humor Columnist Connecticut College BA,  Government ,  Statistics 2003  – 2007 Activities and Societies:  Varsity Tennis - Singles and Doubles ,  The College Voice - Humor Columnist Honors & Awards Gold Award for Innovation - Large Customer Sales, Americas Region Google August 2012 Ben Franklin Innovation Award Google April 2010 Pureplayer of the Month Google March 2012 Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and beyond core job responsibilities to help out the rest of the team. Top Guru Award Google June 2012 Gold Award for Innovation - Large Customer Sales, Americas Region Google August 2012 Gold Award for Innovation - Large Customer Sales, Americas Region Google August 2012 Gold Award for Innovation - Large Customer Sales, Americas Region Google August 2012 Ben Franklin Innovation Award Google April 2010 Ben Franklin Innovation Award Google April 2010 Ben Franklin Innovation Award Google April 2010 Pureplayer of the Month Google March 2012 Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and beyond core job responsibilities to help out the rest of the team. Pureplayer of the Month Google March 2012 Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and beyond core job responsibilities to help out the rest of the team. Pureplayer of the Month Google March 2012 Winner of the first ever Pureplayer of the Month award, given to the Retail Pureplay team member who has gone above and beyond core job responsibilities to help out the rest of the team. Top Guru Award Google June 2012 Top Guru Award Google June 2012 Top Guru Award Google June 2012 ", "Experience Platform Solutions Consultant, DoubleClick Google June 2014  – Present (1 year 2 months) London, United Kingdom Lead Technical Services Analyst Marin Software March 2013  –  May 2014  (1 year 3 months) London, United Kingdom Technical Services Analyst Marin Software September 2010  –  March 2013  (2 years 7 months) London, United Kingdom AdWords Account Optimization Specialist Google October 2005  –  July 2008  (2 years 10 months) Carried out vertical & market research to strategise effective blueprints for advertisers' AdWords campaign.  \n \nStart to finish search and content optimisations for top revenue accounts across 9 verticals. \n \nHelped with the seamless functioning of various aspects of advertiser accounts such as campaign and ad management, conversion tracking, payment and billing cycle explanation, ad website optimization tools. Senior Analyst, Research and Adjustments Department Bank of America August 2004  –  September 2005  (1 year 2 months) Bank of America Co-opearation, Hyderabad, provide a full spectrum of consumer, commercial, and corporate banking services.  \n \nKey Responsibilities: \n \nInvolved in the collection and recovery of Bank of America's funds from various financial institutions in the United States. Platform Solutions Consultant, DoubleClick Google June 2014  – Present (1 year 2 months) London, United Kingdom Platform Solutions Consultant, DoubleClick Google June 2014  – Present (1 year 2 months) London, United Kingdom Lead Technical Services Analyst Marin Software March 2013  –  May 2014  (1 year 3 months) London, United Kingdom Lead Technical Services Analyst Marin Software March 2013  –  May 2014  (1 year 3 months) London, United Kingdom Technical Services Analyst Marin Software September 2010  –  March 2013  (2 years 7 months) London, United Kingdom Technical Services Analyst Marin Software September 2010  –  March 2013  (2 years 7 months) London, United Kingdom AdWords Account Optimization Specialist Google October 2005  –  July 2008  (2 years 10 months) Carried out vertical & market research to strategise effective blueprints for advertisers' AdWords campaign.  \n \nStart to finish search and content optimisations for top revenue accounts across 9 verticals. \n \nHelped with the seamless functioning of various aspects of advertiser accounts such as campaign and ad management, conversion tracking, payment and billing cycle explanation, ad website optimization tools. AdWords Account Optimization Specialist Google October 2005  –  July 2008  (2 years 10 months) Carried out vertical & market research to strategise effective blueprints for advertisers' AdWords campaign.  \n \nStart to finish search and content optimisations for top revenue accounts across 9 verticals. \n \nHelped with the seamless functioning of various aspects of advertiser accounts such as campaign and ad management, conversion tracking, payment and billing cycle explanation, ad website optimization tools. Senior Analyst, Research and Adjustments Department Bank of America August 2004  –  September 2005  (1 year 2 months) Bank of America Co-opearation, Hyderabad, provide a full spectrum of consumer, commercial, and corporate banking services.  \n \nKey Responsibilities: \n \nInvolved in the collection and recovery of Bank of America's funds from various financial institutions in the United States. Senior Analyst, Research and Adjustments Department Bank of America August 2004  –  September 2005  (1 year 2 months) Bank of America Co-opearation, Hyderabad, provide a full spectrum of consumer, commercial, and corporate banking services.  \n \nKey Responsibilities: \n \nInvolved in the collection and recovery of Bank of America's funds from various financial institutions in the United States. Skills Top Skills 30 Google Adwords 22 Online Advertising 12 SEO 12 PPC 12 Google Analytics 12 Web Analytics 9 SEM 8 Integrated Marketing 8 Display Advertising 7 Search Advertising Rahila also knows about... 6 Analytics 6 Advertising 5 Online Marketing 5 Mobile Marketing 2 Marketing 2 Social Media Marketing 2 Strategy 2 Market Research 2 Analytical Reasoning 1 Marketing Research Skills  Top Skills 30 Google Adwords 22 Online Advertising 12 SEO 12 PPC 12 Google Analytics 12 Web Analytics 9 SEM 8 Integrated Marketing 8 Display Advertising 7 Search Advertising Rahila also knows about... 6 Analytics 6 Advertising 5 Online Marketing 5 Mobile Marketing 2 Marketing 2 Social Media Marketing 2 Strategy 2 Market Research 2 Analytical Reasoning 1 Marketing Research Top Skills 30 Google Adwords 22 Online Advertising 12 SEO 12 PPC 12 Google Analytics 12 Web Analytics 9 SEM 8 Integrated Marketing 8 Display Advertising 7 Search Advertising Rahila also knows about... 6 Analytics 6 Advertising 5 Online Marketing 5 Mobile Marketing 2 Marketing 2 Social Media Marketing 2 Strategy 2 Market Research 2 Analytical Reasoning 1 Marketing Research Top Skills 30 Google Adwords 22 Online Advertising 12 SEO 12 PPC 12 Google Analytics 12 Web Analytics 9 SEM 8 Integrated Marketing 8 Display Advertising 7 Search Advertising Rahila also knows about... 6 Analytics 6 Advertising 5 Online Marketing 5 Mobile Marketing 2 Marketing 2 Social Media Marketing 2 Strategy 2 Market Research 2 Analytical Reasoning 1 Marketing Research                     6 Analytics 6 Advertising 5 Online Marketing 5 Mobile Marketing 2 Marketing 2 Social Media Marketing 2 Strategy 2 Market Research 2 Analytical Reasoning 1 Marketing Research Education Aston University MSc,  Marketing Management (2:1) 2008  – 2009 Key areas of study - services marketing, strategic management, marketing research & strategy, international marketing management, integrated marketing communications and marketing psychology.  \n \nResearch project analysing 'Competitor Orientation in the U.S Online Advertising Industry.' Lucknow University Bachelor of Arts 2001  – 2004 subjects - English Literature, Western History and Economics. Aston University MSc,  Marketing Management (2:1) 2008  – 2009 Key areas of study - services marketing, strategic management, marketing research & strategy, international marketing management, integrated marketing communications and marketing psychology.  \n \nResearch project analysing 'Competitor Orientation in the U.S Online Advertising Industry.' Aston University MSc,  Marketing Management (2:1) 2008  – 2009 Key areas of study - services marketing, strategic management, marketing research & strategy, international marketing management, integrated marketing communications and marketing psychology.  \n \nResearch project analysing 'Competitor Orientation in the U.S Online Advertising Industry.' Aston University MSc,  Marketing Management (2:1) 2008  – 2009 Key areas of study - services marketing, strategic management, marketing research & strategy, international marketing management, integrated marketing communications and marketing psychology.  \n \nResearch project analysing 'Competitor Orientation in the U.S Online Advertising Industry.' Lucknow University Bachelor of Arts 2001  – 2004 subjects - English Literature, Western History and Economics. Lucknow University Bachelor of Arts 2001  – 2004 subjects - English Literature, Western History and Economics. Lucknow University Bachelor of Arts 2001  – 2004 subjects - English Literature, Western History and Economics. ", "Summary Author of Oiseau, a children's novel set around a penguin from South America. See more about the story below! Oiseau The King Catcher Novel - Finalist to be on Shark Tank Edit Summary Author of Oiseau, a children's novel set around a penguin from South America. See more about the story below! Oiseau The King Catcher Novel - Finalist to be on Shark Tank Edit Author of Oiseau, a children's novel set around a penguin from South America. See more about the story below! Author of Oiseau, a children's novel set around a penguin from South America. See more about the story below! Oiseau The King Catcher Novel - Finalist to be on Shark Tank Edit Oiseau The King Catcher Novel - Finalist to be on Shark Tank Edit Oiseau The King Catcher Novel - Finalist to be on Shark Tank Edit Oiseau The King Catcher Novel - Finalist to be on Shark Tank  Oiseau The King Catcher Novel - Finalist to be on Shark Tank  Experience Optimization Specialist Google Express February 2015  – Present (6 months) Composing and Executing Testing.  \nDepartment Analysis.  \nProcess Improvement with a focus on speed, efficiency and cost Owner Oiseau Clothing Company December 2010  – Present (4 years 8 months) oakland Emerging creative clothing brand from the San Francisco Bay Area. Currently featured on the top site for teen and young adult wear. Check us out and if there's something you'd like us to check out we'll do the same. Thanks Welcome to Oiseau Edit SWAT Team Lead Google Express October 2014  –  February 2015  (5 months) 1010 Corporation Way, Palo Alto, CA Organize, oversee, schedule and train an escalations response team for Google project. Hub Lead + Store Lead Google Shopping Express February 2013  –  May 2014  (1 year 4 months) san francisco, california Store Lead: Managing Flow of In-Store Process regarding Fulfillment, Trouble Shooting, On-Site Process Improvements, Responsible for a team of 8-14 operators day to day, Liason for GSX store business partner. \n \nHub Lead:  \nResponsible for running the SF Hub (distribution facility for all of SF) with a team of 2-3 other co-leads where 90% of all volume for the project came through our building. Handling schedule adjustments for 70+ Operators day to day within the facility. Trouble shooting devices and helping to come up with workarounds for tech issues. A Point of contact for on-site visits. Responsible for helping to manage and oversee 24-32 operators per shift.  \n \nGreat Team! Great People! Co-writer/Co-producer Relationship Theatre Thursdays 2011  –  2011  (less than a year) Venue Management \nSecuring and Scheduling Talent \nScriptwriting Assistance \nSales \n Co-writer/Co-producer Single Husbands the Stage Play 2010  –  2010  (less than a year) Casting \nScript Analysis \nScript Writing + Revisions \nAssisted in Staff Hiring \nProduction Optimization Specialist Google Express February 2015  – Present (6 months) Composing and Executing Testing.  \nDepartment Analysis.  \nProcess Improvement with a focus on speed, efficiency and cost Optimization Specialist Google Express February 2015  – Present (6 months) Composing and Executing Testing.  \nDepartment Analysis.  \nProcess Improvement with a focus on speed, efficiency and cost Owner Oiseau Clothing Company December 2010  – Present (4 years 8 months) oakland Emerging creative clothing brand from the San Francisco Bay Area. Currently featured on the top site for teen and young adult wear. Check us out and if there's something you'd like us to check out we'll do the same. Thanks Welcome to Oiseau Edit Owner Oiseau Clothing Company December 2010  – Present (4 years 8 months) oakland Emerging creative clothing brand from the San Francisco Bay Area. Currently featured on the top site for teen and young adult wear. Check us out and if there's something you'd like us to check out we'll do the same. Thanks Welcome to Oiseau Edit Welcome to Oiseau Edit Welcome to Oiseau Edit Welcome to Oiseau  Welcome to Oiseau  SWAT Team Lead Google Express October 2014  –  February 2015  (5 months) 1010 Corporation Way, Palo Alto, CA Organize, oversee, schedule and train an escalations response team for Google project. SWAT Team Lead Google Express October 2014  –  February 2015  (5 months) 1010 Corporation Way, Palo Alto, CA Organize, oversee, schedule and train an escalations response team for Google project. Hub Lead + Store Lead Google Shopping Express February 2013  –  May 2014  (1 year 4 months) san francisco, california Store Lead: Managing Flow of In-Store Process regarding Fulfillment, Trouble Shooting, On-Site Process Improvements, Responsible for a team of 8-14 operators day to day, Liason for GSX store business partner. \n \nHub Lead:  \nResponsible for running the SF Hub (distribution facility for all of SF) with a team of 2-3 other co-leads where 90% of all volume for the project came through our building. Handling schedule adjustments for 70+ Operators day to day within the facility. Trouble shooting devices and helping to come up with workarounds for tech issues. A Point of contact for on-site visits. Responsible for helping to manage and oversee 24-32 operators per shift.  \n \nGreat Team! Great People! Hub Lead + Store Lead Google Shopping Express February 2013  –  May 2014  (1 year 4 months) san francisco, california Store Lead: Managing Flow of In-Store Process regarding Fulfillment, Trouble Shooting, On-Site Process Improvements, Responsible for a team of 8-14 operators day to day, Liason for GSX store business partner. \n \nHub Lead:  \nResponsible for running the SF Hub (distribution facility for all of SF) with a team of 2-3 other co-leads where 90% of all volume for the project came through our building. Handling schedule adjustments for 70+ Operators day to day within the facility. Trouble shooting devices and helping to come up with workarounds for tech issues. A Point of contact for on-site visits. Responsible for helping to manage and oversee 24-32 operators per shift.  \n \nGreat Team! Great People! Co-writer/Co-producer Relationship Theatre Thursdays 2011  –  2011  (less than a year) Venue Management \nSecuring and Scheduling Talent \nScriptwriting Assistance \nSales \n Co-writer/Co-producer Relationship Theatre Thursdays 2011  –  2011  (less than a year) Venue Management \nSecuring and Scheduling Talent \nScriptwriting Assistance \nSales \n Co-writer/Co-producer Single Husbands the Stage Play 2010  –  2010  (less than a year) Casting \nScript Analysis \nScript Writing + Revisions \nAssisted in Staff Hiring \nProduction Co-writer/Co-producer Single Husbands the Stage Play 2010  –  2010  (less than a year) Casting \nScript Analysis \nScript Writing + Revisions \nAssisted in Staff Hiring \nProduction Skills Top Skills 26 Social Media 22 Retail 20 Apparel 20 Social Networking 18 Graphic Design 17 Customer Service 14 Management 13 Microsoft Office 12 Fashion 11 Merchandising Jesse also knows about... 9 Marketing 9 Social Media Marketing 8 Leadership 8 Public Speaking 7 Online Marketing 6 Event Planning 6 Advertising 6 Sales 5 Event Management 5 Marketing Strategy 5 Public Relations 4 Strategic Planning 3 Sales Management 2 Sourcing 2 Fashion Shows 2 Microsoft Excel 2 PowerPoint 1 Textiles 1 Brand Development 1 Action Sports 1 Direct Sales 1 Fashion Design 1 Writing 0 Creative Writing See 9+     See less Skills  Top Skills 26 Social Media 22 Retail 20 Apparel 20 Social Networking 18 Graphic Design 17 Customer Service 14 Management 13 Microsoft Office 12 Fashion 11 Merchandising Jesse also knows about... 9 Marketing 9 Social Media Marketing 8 Leadership 8 Public Speaking 7 Online Marketing 6 Event Planning 6 Advertising 6 Sales 5 Event Management 5 Marketing Strategy 5 Public Relations 4 Strategic Planning 3 Sales Management 2 Sourcing 2 Fashion Shows 2 Microsoft Excel 2 PowerPoint 1 Textiles 1 Brand Development 1 Action Sports 1 Direct Sales 1 Fashion Design 1 Writing 0 Creative Writing See 9+     See less Top Skills 26 Social Media 22 Retail 20 Apparel 20 Social Networking 18 Graphic Design 17 Customer Service 14 Management 13 Microsoft Office 12 Fashion 11 Merchandising Jesse also knows about... 9 Marketing 9 Social Media Marketing 8 Leadership 8 Public Speaking 7 Online Marketing 6 Event Planning 6 Advertising 6 Sales 5 Event Management 5 Marketing Strategy 5 Public Relations 4 Strategic Planning 3 Sales Management 2 Sourcing 2 Fashion Shows 2 Microsoft Excel 2 PowerPoint 1 Textiles 1 Brand Development 1 Action Sports 1 Direct Sales 1 Fashion Design 1 Writing 0 Creative Writing See 9+     See less Top Skills 26 Social Media 22 Retail 20 Apparel 20 Social Networking 18 Graphic Design 17 Customer Service 14 Management 13 Microsoft Office 12 Fashion 11 Merchandising Jesse also knows about... 9 Marketing 9 Social Media Marketing 8 Leadership 8 Public Speaking 7 Online Marketing 6 Event Planning 6 Advertising 6 Sales 5 Event Management 5 Marketing Strategy 5 Public Relations 4 Strategic Planning 3 Sales Management 2 Sourcing 2 Fashion Shows 2 Microsoft Excel 2 PowerPoint 1 Textiles 1 Brand Development 1 Action Sports 1 Direct Sales 1 Fashion Design 1 Writing 0 Creative Writing See 9+     See less                     9 Marketing 9 Social Media Marketing 8 Leadership 8 Public Speaking 7 Online Marketing 6 Event Planning 6 Advertising 6 Sales 5 Event Management 5 Marketing Strategy 5 Public Relations 4 Strategic Planning 3 Sales Management 2 Sourcing 2 Fashion Shows 2 Microsoft Excel 2 PowerPoint 1 Textiles 1 Brand Development 1 Action Sports 1 Direct Sales 1 Fashion Design 1 Writing 0 Creative Writing Education UC Santa Barbara Bachelor's in Sociology,  Sociology 2007  – 2010 Activities and Societies:  UCSB Men's Basketball Team University of San Francisco 2 Years Of,  Business Marketing 2005  – 2007 Activities and Societies:  USF Men's Basketball Team Bishop O'Dowd High School Bishop O'Dowd High School UC Santa Barbara Bachelor's in Sociology,  Sociology 2007  – 2010 Activities and Societies:  UCSB Men's Basketball Team UC Santa Barbara Bachelor's in Sociology,  Sociology 2007  – 2010 Activities and Societies:  UCSB Men's Basketball Team UC Santa Barbara Bachelor's in Sociology,  Sociology 2007  – 2010 Activities and Societies:  UCSB Men's Basketball Team University of San Francisco 2 Years Of,  Business Marketing 2005  – 2007 Activities and Societies:  USF Men's Basketball Team University of San Francisco 2 Years Of,  Business Marketing 2005  – 2007 Activities and Societies:  USF Men's Basketball Team University of San Francisco 2 Years Of,  Business Marketing 2005  – 2007 Activities and Societies:  USF Men's Basketball Team Bishop O'Dowd High School Bishop O'Dowd High School Bishop O'Dowd High School Bishop O'Dowd High School Bishop O'Dowd High School Bishop O'Dowd High School Honors & Awards Additional Honors & Awards Clothing showcased on: \n \nFinalist for ABC's Shark Tank \n \nBET's 106 & Park Show \n \nKofy TV 20 - The Art of Dreaming Show \n \nChannel 2 News Bay Area \n \nDIME Magazine (both national and international) \n \nChannel 5 News Bay Area \n \nThe Karmaloop.com Kazbah Global Marketplace Additional Honors & Awards Clothing showcased on: \n \nFinalist for ABC's Shark Tank \n \nBET's 106 & Park Show \n \nKofy TV 20 - The Art of Dreaming Show \n \nChannel 2 News Bay Area \n \nDIME Magazine (both national and international) \n \nChannel 5 News Bay Area \n \nThe Karmaloop.com Kazbah Global Marketplace Additional Honors & Awards Clothing showcased on: \n \nFinalist for ABC's Shark Tank \n \nBET's 106 & Park Show \n \nKofy TV 20 - The Art of Dreaming Show \n \nChannel 2 News Bay Area \n \nDIME Magazine (both national and international) \n \nChannel 5 News Bay Area \n \nThe Karmaloop.com Kazbah Global Marketplace Additional Honors & Awards Clothing showcased on: \n \nFinalist for ABC's Shark Tank \n \nBET's 106 & Park Show \n \nKofy TV 20 - The Art of Dreaming Show \n \nChannel 2 News Bay Area \n \nDIME Magazine (both national and international) \n \nChannel 5 News Bay Area \n \nThe Karmaloop.com Kazbah Global Marketplace ", "Experience Industry Strategist Google May 2007  – Present (8 years 3 months) Mountain View, California, USA Online industry research. Google products pitch to healthcare clients. Hospitals and health care services industry research at the USA. Budget planning. Strategist & Optimization Specialist Google May 2007  –  April 2011  (4 years) Worked on Google's top product 'AdWords', Optimized ad placement of Google's financial services clients, Used research resources like Experian Hitwise, compete, Nielsen, MRI extensively to pitch google products to my clients. (Open) 1 recommendation Paul-Emile Dorsainvil Law Graduate, Entrepreneur, Sales and Account Management Saumil is a superstar! She brings a great spirit to every project she is assigned and really takes ownership of her tasks. She is not only very dependable, she is also hard working and a great member of each and every team she works with. Saumil has... View Account Planner Google 2007  –  2010  (3 years) Search engine optimization, marketing google products and research oriented at online industry Research Associate ISB December 2006  –  May 2007  (6 months) Study on Entrepreneurship and family businesses in the USA. Conducted a survey, collated and researched the data to determine factors affecting family business. Asst Professor GNITS 2006  –  2007  (1 year) Taught subjects like satellite communication, radar, electrical engg, communication engg. Lecturer D J Sanghvi College of Engg 2002  –  2006  (4 years) Taught subjects like satellite communication, radar and principles of communication, digital communication. Industry Strategist Google May 2007  – Present (8 years 3 months) Mountain View, California, USA Online industry research. Google products pitch to healthcare clients. Hospitals and health care services industry research at the USA. Budget planning. Industry Strategist Google May 2007  – Present (8 years 3 months) Mountain View, California, USA Online industry research. Google products pitch to healthcare clients. Hospitals and health care services industry research at the USA. Budget planning. Strategist & Optimization Specialist Google May 2007  –  April 2011  (4 years) Worked on Google's top product 'AdWords', Optimized ad placement of Google's financial services clients, Used research resources like Experian Hitwise, compete, Nielsen, MRI extensively to pitch google products to my clients. (Open) 1 recommendation Paul-Emile Dorsainvil Law Graduate, Entrepreneur, Sales and Account Management Saumil is a superstar! She brings a great spirit to every project she is assigned and really takes ownership of her tasks. She is not only very dependable, she is also hard working and a great member of each and every team she works with. Saumil has... View Strategist & Optimization Specialist Google May 2007  –  April 2011  (4 years) Worked on Google's top product 'AdWords', Optimized ad placement of Google's financial services clients, Used research resources like Experian Hitwise, compete, Nielsen, MRI extensively to pitch google products to my clients. (Open) 1 recommendation Paul-Emile Dorsainvil Law Graduate, Entrepreneur, Sales and Account Management Saumil is a superstar! She brings a great spirit to every project she is assigned and really takes ownership of her tasks. She is not only very dependable, she is also hard working and a great member of each and every team she works with. Saumil has... View Account Planner Google 2007  –  2010  (3 years) Search engine optimization, marketing google products and research oriented at online industry Account Planner Google 2007  –  2010  (3 years) Search engine optimization, marketing google products and research oriented at online industry Research Associate ISB December 2006  –  May 2007  (6 months) Study on Entrepreneurship and family businesses in the USA. Conducted a survey, collated and researched the data to determine factors affecting family business. Research Associate ISB December 2006  –  May 2007  (6 months) Study on Entrepreneurship and family businesses in the USA. Conducted a survey, collated and researched the data to determine factors affecting family business. Asst Professor GNITS 2006  –  2007  (1 year) Taught subjects like satellite communication, radar, electrical engg, communication engg. Asst Professor GNITS 2006  –  2007  (1 year) Taught subjects like satellite communication, radar, electrical engg, communication engg. Lecturer D J Sanghvi College of Engg 2002  –  2006  (4 years) Taught subjects like satellite communication, radar and principles of communication, digital communication. Lecturer D J Sanghvi College of Engg 2002  –  2006  (4 years) Taught subjects like satellite communication, radar and principles of communication, digital communication. Skills 4 Marketing 2 Online Advertising 2 Online Marketing 2 Market Research 2 E-commerce 0 Online Research 0 Healthcare Industry Skills  4 Marketing 2 Online Advertising 2 Online Marketing 2 Market Research 2 E-commerce 0 Online Research 0 Healthcare Industry 4 Marketing 2 Online Advertising 2 Online Marketing 2 Market Research 2 E-commerce 0 Online Research 0 Healthcare Industry 4 Marketing 2 Online Advertising 2 Online Marketing 2 Market Research 2 E-commerce 0 Online Research 0 Healthcare Industry               Education Laxmi Nrayan College of Engineering,Bhopal Bachelor of Science (BS),  Electrical ,  Electronics and Communications Engineering 1995  – 1999 Laxmi Nrayan College of Engineering,Bhopal Bachelor of Science (BS),  Electrical ,  Electronics and Communications Engineering 1995  – 1999 Laxmi Nrayan College of Engineering,Bhopal Bachelor of Science (BS),  Electrical ,  Electronics and Communications Engineering 1995  – 1999 Laxmi Nrayan College of Engineering,Bhopal Bachelor of Science (BS),  Electrical ,  Electronics and Communications Engineering 1995  – 1999 ", "Experience Global AdMob Commercialization Lead Google February 2014  – Present (1 year 6 months) San Francisco Bay Area (Open) 3 honors and awards Spot Bonus For hard work on a global offsite agenda.  View Spot Bonus For cross-functional work on the sunset of a legacy product used by key clients.  View Spot Bonus For “incredible” cross- functional communications in prepping an internal white paper.  View Writer, editor, designer www.beckybowman.net April 2007  – Present (8 years 4 months) Global AdMob Commercialization Lead Google February 2014  – Present (1 year 6 months) San Francisco Bay Area (Open) 3 honors and awards Spot Bonus For hard work on a global offsite agenda.  View Spot Bonus For cross-functional work on the sunset of a legacy product used by key clients.  View Spot Bonus For “incredible” cross- functional communications in prepping an internal white paper.  View Global AdMob Commercialization Lead Google February 2014  – Present (1 year 6 months) San Francisco Bay Area (Open) 3 honors and awards Spot Bonus For hard work on a global offsite agenda.  View Spot Bonus For cross-functional work on the sunset of a legacy product used by key clients.  View Spot Bonus For “incredible” cross- functional communications in prepping an internal white paper.  View Writer, editor, designer www.beckybowman.net April 2007  – Present (8 years 4 months) Writer, editor, designer www.beckybowman.net April 2007  – Present (8 years 4 months) Languages French (conversational) French (conversational) French (conversational) Skills Top Skills 40 Editing 20 SEM 19 Storytelling 16 Blogging 16 Display Advertising 16 Online Advertising 13 Digital Media 9 Content Strategy 9 Digital Marketing 7 Social Media Becky also knows about... 7 Copy Editing 5 Marketing 4 Copywriting 4 Google Adwords 3 Strategic Planning 3 Project Management 3 Newspapers 3 New Media 2 Creative Writing 2 Publishing 2 Online Marketing 2 Web Content 1 Online Display... 1 French 1 Publications 1 SEO 0 Consultative Sales 0 Sales Presentations 0 Reporting 0 Remaining calm in a... 0 SEM Optimization 0 Writing 0 Fact-checking See 8+     See less Skills  Top Skills 40 Editing 20 SEM 19 Storytelling 16 Blogging 16 Display Advertising 16 Online Advertising 13 Digital Media 9 Content Strategy 9 Digital Marketing 7 Social Media Becky also knows about... 7 Copy Editing 5 Marketing 4 Copywriting 4 Google Adwords 3 Strategic Planning 3 Project Management 3 Newspapers 3 New Media 2 Creative Writing 2 Publishing 2 Online Marketing 2 Web Content 1 Online Display... 1 French 1 Publications 1 SEO 0 Consultative Sales 0 Sales Presentations 0 Reporting 0 Remaining calm in a... 0 SEM Optimization 0 Writing 0 Fact-checking See 8+     See less Top Skills 40 Editing 20 SEM 19 Storytelling 16 Blogging 16 Display Advertising 16 Online Advertising 13 Digital Media 9 Content Strategy 9 Digital Marketing 7 Social Media Becky also knows about... 7 Copy Editing 5 Marketing 4 Copywriting 4 Google Adwords 3 Strategic Planning 3 Project Management 3 Newspapers 3 New Media 2 Creative Writing 2 Publishing 2 Online Marketing 2 Web Content 1 Online Display... 1 French 1 Publications 1 SEO 0 Consultative Sales 0 Sales Presentations 0 Reporting 0 Remaining calm in a... 0 SEM Optimization 0 Writing 0 Fact-checking See 8+     See less Top Skills 40 Editing 20 SEM 19 Storytelling 16 Blogging 16 Display Advertising 16 Online Advertising 13 Digital Media 9 Content Strategy 9 Digital Marketing 7 Social Media Becky also knows about... 7 Copy Editing 5 Marketing 4 Copywriting 4 Google Adwords 3 Strategic Planning 3 Project Management 3 Newspapers 3 New Media 2 Creative Writing 2 Publishing 2 Online Marketing 2 Web Content 1 Online Display... 1 French 1 Publications 1 SEO 0 Consultative Sales 0 Sales Presentations 0 Reporting 0 Remaining calm in a... 0 SEM Optimization 0 Writing 0 Fact-checking See 8+     See less                     7 Copy Editing 5 Marketing 4 Copywriting 4 Google Adwords 3 Strategic Planning 3 Project Management 3 Newspapers 3 New Media 2 Creative Writing 2 Publishing 2 Online Marketing 2 Web Content 1 Online Display... 1 French 1 Publications 1 SEO 0 Consultative Sales 0 Sales Presentations 0 Reporting 0 Remaining calm in a... 0 SEM Optimization 0 Writing 0 Fact-checking Honors & Awards Local Hero Oakland City Council February 2015 For time and energy to contributing positively to neighborhood and the city of Oakland.  Spot Bonus Google, Inc. October 2014 For hard work on a global offsite agenda.  Spot Bonus Google, Inc. September 2014 For cross-functional work on the sunset of a legacy product used by key clients.  Spot Bonus Google, Inc. May 2014 For “incredible” cross- functional communications in prepping an internal white paper.  Spot Bonus Google, Inc. August 2013 For work with the Product team to drive critical revenue on a new product. Impact Award Google Inc. November 2010 For strategic work on a cross-functional, analytical team on network safety. Texas Press Association January 2006 First place, Division Two Dailies, Better Newspaper Contest, for “Victimized vs. Romanticized,” an article focused on society’s perception of sex with a minor. Published in The Beaumont Enterprise. Hearst Honors March 2005 Third place, for “Learning Curve,” package of stories centered on adults living with developmental disabilities. Published in The Beaumont Enterprise. Local Hero Oakland City Council February 2015 For time and energy to contributing positively to neighborhood and the city of Oakland.  Local Hero Oakland City Council February 2015 For time and energy to contributing positively to neighborhood and the city of Oakland.  Local Hero Oakland City Council February 2015 For time and energy to contributing positively to neighborhood and the city of Oakland.  Spot Bonus Google, Inc. October 2014 For hard work on a global offsite agenda.  Spot Bonus Google, Inc. October 2014 For hard work on a global offsite agenda.  Spot Bonus Google, Inc. October 2014 For hard work on a global offsite agenda.  Spot Bonus Google, Inc. September 2014 For cross-functional work on the sunset of a legacy product used by key clients.  Spot Bonus Google, Inc. September 2014 For cross-functional work on the sunset of a legacy product used by key clients.  Spot Bonus Google, Inc. September 2014 For cross-functional work on the sunset of a legacy product used by key clients.  Spot Bonus Google, Inc. May 2014 For “incredible” cross- functional communications in prepping an internal white paper.  Spot Bonus Google, Inc. May 2014 For “incredible” cross- functional communications in prepping an internal white paper.  Spot Bonus Google, Inc. May 2014 For “incredible” cross- functional communications in prepping an internal white paper.  Spot Bonus Google, Inc. August 2013 For work with the Product team to drive critical revenue on a new product. Spot Bonus Google, Inc. August 2013 For work with the Product team to drive critical revenue on a new product. Spot Bonus Google, Inc. August 2013 For work with the Product team to drive critical revenue on a new product. Impact Award Google Inc. November 2010 For strategic work on a cross-functional, analytical team on network safety. Impact Award Google Inc. November 2010 For strategic work on a cross-functional, analytical team on network safety. Impact Award Google Inc. November 2010 For strategic work on a cross-functional, analytical team on network safety. Texas Press Association January 2006 First place, Division Two Dailies, Better Newspaper Contest, for “Victimized vs. Romanticized,” an article focused on society’s perception of sex with a minor. Published in The Beaumont Enterprise. Texas Press Association January 2006 First place, Division Two Dailies, Better Newspaper Contest, for “Victimized vs. Romanticized,” an article focused on society’s perception of sex with a minor. Published in The Beaumont Enterprise. Texas Press Association January 2006 First place, Division Two Dailies, Better Newspaper Contest, for “Victimized vs. Romanticized,” an article focused on society’s perception of sex with a minor. Published in The Beaumont Enterprise. Hearst Honors March 2005 Third place, for “Learning Curve,” package of stories centered on adults living with developmental disabilities. Published in The Beaumont Enterprise. Hearst Honors March 2005 Third place, for “Learning Curve,” package of stories centered on adults living with developmental disabilities. Published in The Beaumont Enterprise. Hearst Honors March 2005 Third place, for “Learning Curve,” package of stories centered on adults living with developmental disabilities. Published in The Beaumont Enterprise. ", "Experience Senior Program Manager, Google [x] Smart Contact Lens Google April 2013  – Present (2 years 4 months) Online Sales & Customer Care Manager, Google [x] Glass Google July 2012  –  April 2013  (10 months) User Operations Manager, Chrome Google June 2010  –  July 2012  (2 years 2 months) Senior Product Specialist, Chrome Google August 2008  –  June 2010  (1 year 11 months) Senior Optimization Specialist, AdWords Google July 2005  –  August 2008  (3 years 2 months) Account Coordinator, AdWords Google September 2004  –  July 2005  (11 months) Senior Program Manager, Google [x] Smart Contact Lens Google April 2013  – Present (2 years 4 months) Senior Program Manager, Google [x] Smart Contact Lens Google April 2013  – Present (2 years 4 months) Online Sales & Customer Care Manager, Google [x] Glass Google July 2012  –  April 2013  (10 months) Online Sales & Customer Care Manager, Google [x] Glass Google July 2012  –  April 2013  (10 months) User Operations Manager, Chrome Google June 2010  –  July 2012  (2 years 2 months) User Operations Manager, Chrome Google June 2010  –  July 2012  (2 years 2 months) Senior Product Specialist, Chrome Google August 2008  –  June 2010  (1 year 11 months) Senior Product Specialist, Chrome Google August 2008  –  June 2010  (1 year 11 months) Senior Optimization Specialist, AdWords Google July 2005  –  August 2008  (3 years 2 months) Senior Optimization Specialist, AdWords Google July 2005  –  August 2008  (3 years 2 months) Account Coordinator, AdWords Google September 2004  –  July 2005  (11 months) Account Coordinator, AdWords Google September 2004  –  July 2005  (11 months) Languages Chinese Chinese Chinese Skills Top Skills 2 Project Management 2 Strategy 1 Data Analysis 1 Online Advertising 1 Program Management 1 Analytics 1 Mobile Devices 0 Strategic Planning 0 Search Advertising 0 Strategic Partnerships Skills  Top Skills 2 Project Management 2 Strategy 1 Data Analysis 1 Online Advertising 1 Program Management 1 Analytics 1 Mobile Devices 0 Strategic Planning 0 Search Advertising 0 Strategic Partnerships Top Skills 2 Project Management 2 Strategy 1 Data Analysis 1 Online Advertising 1 Program Management 1 Analytics 1 Mobile Devices 0 Strategic Planning 0 Search Advertising 0 Strategic Partnerships Top Skills 2 Project Management 2 Strategy 1 Data Analysis 1 Online Advertising 1 Program Management 1 Analytics 1 Mobile Devices 0 Strategic Planning 0 Search Advertising 0 Strategic Partnerships                     Education University of California, Los Angeles Bachelor of Arts (B.A.),  International Economics 2000  – 2004 University of California, Los Angeles Bachelor of Arts (B.A.),  International Economics 2000  – 2004 University of California, Los Angeles Bachelor of Arts (B.A.),  International Economics 2000  – 2004 University of California, Los Angeles Bachelor of Arts (B.A.),  International Economics 2000  – 2004 ", "Experience Account Strategist Google September 2010  –  March 2012  (1 year 7 months) Account Strategist Google Inc December 2004  –  March 2012  (7 years 4 months) Worked as a an optimization specialist for about 120 small-medium sized clients in the tech industry; was responsible for supporting about $20 million in revenue per year \nProvided high level of customer service for clients, helping them attain long term AdWords goals through strategy recommendations and troubleshooting \nCommunicated proactively with clients on a daily, weekly, bi-weekly and as needed basis in order to maintain close relationships, and to achieve revenue and product goals \nTrained and mentored new members of the team \nManaged the coordination of workflow between Mountain View and offices in India Account Manager Google March 2009  –  August 2010  (1 year 6 months) -Provide high level of customer service for clients in the Tech B2B industry, helping them attain long term AdWords goals through strategy recommendations and troubleshooting \n-Communicate proactively with clients on a daily, weekly, bi-weekly and as needed basis in order to maintain close relationships AdWords Optimization Specialist Google January 2006  –  March 2009  (3 years 3 months) -Maintained relationships with top tier clients as an optimization specialist, providing ongoing, customized optimization support \n-Presented plans and recommendations during in person client visits and over the phone \n-Managed coordination of optimization workflow between Mountain View and offices in India \n-Provided on the spot, customized advice for AdWords advertisers at Real Estate Connect conference \n-Helped train new hires on optimization processes \n-Managed workflow from five to eight account managers at a time AdWords Account Associate Google January 2007  –  June 2007  (6 months) Maintained relationships with top tier clients as an optimization specialist, providing ongoing, customized optimization support  \nPresented plans and recommendations during in person client visits and over the phone, and helped to implement the suggestions within accounts \nHelped train new hires on optimization processes AdWords Account Coordinator Google January 2006  –  January 2007  (1 year 1 month) Provided customized optimization suggestions for advertisers based on their account goals as an optimization specialist \nCommunicated closely with advertisers via phone and email, as well as with AdWords account managers, to ensure that my suggestions fit advertisers' needs AdWords Account Representative (temp) Google April 2005  –  December 2005  (9 months) -Reviewed text ads, image ads, and keywords in the approval bin based on editorial and content policies; Provided suggestions for disapproved ads based on most current AdWords policies \n-Participated in Landing Page Test to categorize the quality of landing pages \n-Performed optimizations to improve advertisers’ account performance \n-Managed and optimized personal AdWords account to practice and learn the program firsthand AdSense Representative (temp) Google December 2004  –  December 2005  (1 year 1 month) -Reviewed incoming applications based on most current AdSense policies \n-Provided support to potential publishers in email support queues \n-Analyzed top 200 publisher sites and reported which optimization suggestions had been implemented Sales Manager Gottschalks March 2004  –  December 2004  (10 months) Directly responsible for all aspects of business in three departments, including product management, sales trends, visual presentation, monthly and annual business plans, over $3 million in annual sales, and a team of 12-15 sales associates \nActed as an on-call manager for all store associates three to five times per week \nAssisted in all store operations including store opening and closing, customer service, loss prevention, safety, hiring, training and management of employees Counter Manager Estee Lauder August 2003  –  March 2004  (8 months) Assisted clients with personalized product demonstrations; increased counter business by 15% \nGenerated weekly and monthly reports, such as stock concerns, adjustment to inventory, and productivity summaries; Communicated with Account Coordinator and Account Executive weekly Administrative Assistant Markkula Center September 2000  –  August 2003  (3 years) Provided front office support for the Center (located on the Santa Clara University campus), including greeting guests, answering incoming calls, filing, organizing, copying, faxing, and running errands \nProvided personal administrative support for six Center directors, operations manager, and executive assistant \nInteracted with other University departments and staff as well as external vendors to coordinate center events; Facilitated and organized logistics for Character Education Seminars \nConstructed and updated database for book review publication; corresponded with reviewers to ensure timely delivery of reviews Account Strategist Google September 2010  –  March 2012  (1 year 7 months) Account Strategist Google September 2010  –  March 2012  (1 year 7 months) Account Strategist Google Inc December 2004  –  March 2012  (7 years 4 months) Worked as a an optimization specialist for about 120 small-medium sized clients in the tech industry; was responsible for supporting about $20 million in revenue per year \nProvided high level of customer service for clients, helping them attain long term AdWords goals through strategy recommendations and troubleshooting \nCommunicated proactively with clients on a daily, weekly, bi-weekly and as needed basis in order to maintain close relationships, and to achieve revenue and product goals \nTrained and mentored new members of the team \nManaged the coordination of workflow between Mountain View and offices in India Account Strategist Google Inc December 2004  –  March 2012  (7 years 4 months) Worked as a an optimization specialist for about 120 small-medium sized clients in the tech industry; was responsible for supporting about $20 million in revenue per year \nProvided high level of customer service for clients, helping them attain long term AdWords goals through strategy recommendations and troubleshooting \nCommunicated proactively with clients on a daily, weekly, bi-weekly and as needed basis in order to maintain close relationships, and to achieve revenue and product goals \nTrained and mentored new members of the team \nManaged the coordination of workflow between Mountain View and offices in India Account Manager Google March 2009  –  August 2010  (1 year 6 months) -Provide high level of customer service for clients in the Tech B2B industry, helping them attain long term AdWords goals through strategy recommendations and troubleshooting \n-Communicate proactively with clients on a daily, weekly, bi-weekly and as needed basis in order to maintain close relationships Account Manager Google March 2009  –  August 2010  (1 year 6 months) -Provide high level of customer service for clients in the Tech B2B industry, helping them attain long term AdWords goals through strategy recommendations and troubleshooting \n-Communicate proactively with clients on a daily, weekly, bi-weekly and as needed basis in order to maintain close relationships AdWords Optimization Specialist Google January 2006  –  March 2009  (3 years 3 months) -Maintained relationships with top tier clients as an optimization specialist, providing ongoing, customized optimization support \n-Presented plans and recommendations during in person client visits and over the phone \n-Managed coordination of optimization workflow between Mountain View and offices in India \n-Provided on the spot, customized advice for AdWords advertisers at Real Estate Connect conference \n-Helped train new hires on optimization processes \n-Managed workflow from five to eight account managers at a time AdWords Optimization Specialist Google January 2006  –  March 2009  (3 years 3 months) -Maintained relationships with top tier clients as an optimization specialist, providing ongoing, customized optimization support \n-Presented plans and recommendations during in person client visits and over the phone \n-Managed coordination of optimization workflow between Mountain View and offices in India \n-Provided on the spot, customized advice for AdWords advertisers at Real Estate Connect conference \n-Helped train new hires on optimization processes \n-Managed workflow from five to eight account managers at a time AdWords Account Associate Google January 2007  –  June 2007  (6 months) Maintained relationships with top tier clients as an optimization specialist, providing ongoing, customized optimization support  \nPresented plans and recommendations during in person client visits and over the phone, and helped to implement the suggestions within accounts \nHelped train new hires on optimization processes AdWords Account Associate Google January 2007  –  June 2007  (6 months) Maintained relationships with top tier clients as an optimization specialist, providing ongoing, customized optimization support  \nPresented plans and recommendations during in person client visits and over the phone, and helped to implement the suggestions within accounts \nHelped train new hires on optimization processes AdWords Account Coordinator Google January 2006  –  January 2007  (1 year 1 month) Provided customized optimization suggestions for advertisers based on their account goals as an optimization specialist \nCommunicated closely with advertisers via phone and email, as well as with AdWords account managers, to ensure that my suggestions fit advertisers' needs AdWords Account Coordinator Google January 2006  –  January 2007  (1 year 1 month) Provided customized optimization suggestions for advertisers based on their account goals as an optimization specialist \nCommunicated closely with advertisers via phone and email, as well as with AdWords account managers, to ensure that my suggestions fit advertisers' needs AdWords Account Representative (temp) Google April 2005  –  December 2005  (9 months) -Reviewed text ads, image ads, and keywords in the approval bin based on editorial and content policies; Provided suggestions for disapproved ads based on most current AdWords policies \n-Participated in Landing Page Test to categorize the quality of landing pages \n-Performed optimizations to improve advertisers’ account performance \n-Managed and optimized personal AdWords account to practice and learn the program firsthand AdWords Account Representative (temp) Google April 2005  –  December 2005  (9 months) -Reviewed text ads, image ads, and keywords in the approval bin based on editorial and content policies; Provided suggestions for disapproved ads based on most current AdWords policies \n-Participated in Landing Page Test to categorize the quality of landing pages \n-Performed optimizations to improve advertisers’ account performance \n-Managed and optimized personal AdWords account to practice and learn the program firsthand AdSense Representative (temp) Google December 2004  –  December 2005  (1 year 1 month) -Reviewed incoming applications based on most current AdSense policies \n-Provided support to potential publishers in email support queues \n-Analyzed top 200 publisher sites and reported which optimization suggestions had been implemented AdSense Representative (temp) Google December 2004  –  December 2005  (1 year 1 month) -Reviewed incoming applications based on most current AdSense policies \n-Provided support to potential publishers in email support queues \n-Analyzed top 200 publisher sites and reported which optimization suggestions had been implemented Sales Manager Gottschalks March 2004  –  December 2004  (10 months) Directly responsible for all aspects of business in three departments, including product management, sales trends, visual presentation, monthly and annual business plans, over $3 million in annual sales, and a team of 12-15 sales associates \nActed as an on-call manager for all store associates three to five times per week \nAssisted in all store operations including store opening and closing, customer service, loss prevention, safety, hiring, training and management of employees Sales Manager Gottschalks March 2004  –  December 2004  (10 months) Directly responsible for all aspects of business in three departments, including product management, sales trends, visual presentation, monthly and annual business plans, over $3 million in annual sales, and a team of 12-15 sales associates \nActed as an on-call manager for all store associates three to five times per week \nAssisted in all store operations including store opening and closing, customer service, loss prevention, safety, hiring, training and management of employees Counter Manager Estee Lauder August 2003  –  March 2004  (8 months) Assisted clients with personalized product demonstrations; increased counter business by 15% \nGenerated weekly and monthly reports, such as stock concerns, adjustment to inventory, and productivity summaries; Communicated with Account Coordinator and Account Executive weekly Counter Manager Estee Lauder August 2003  –  March 2004  (8 months) Assisted clients with personalized product demonstrations; increased counter business by 15% \nGenerated weekly and monthly reports, such as stock concerns, adjustment to inventory, and productivity summaries; Communicated with Account Coordinator and Account Executive weekly Administrative Assistant Markkula Center September 2000  –  August 2003  (3 years) Provided front office support for the Center (located on the Santa Clara University campus), including greeting guests, answering incoming calls, filing, organizing, copying, faxing, and running errands \nProvided personal administrative support for six Center directors, operations manager, and executive assistant \nInteracted with other University departments and staff as well as external vendors to coordinate center events; Facilitated and organized logistics for Character Education Seminars \nConstructed and updated database for book review publication; corresponded with reviewers to ensure timely delivery of reviews Administrative Assistant Markkula Center September 2000  –  August 2003  (3 years) Provided front office support for the Center (located on the Santa Clara University campus), including greeting guests, answering incoming calls, filing, organizing, copying, faxing, and running errands \nProvided personal administrative support for six Center directors, operations manager, and executive assistant \nInteracted with other University departments and staff as well as external vendors to coordinate center events; Facilitated and organized logistics for Character Education Seminars \nConstructed and updated database for book review publication; corresponded with reviewers to ensure timely delivery of reviews Skills 3 Google Adwords Skills  3 Google Adwords 3 Google Adwords 3 Google Adwords   Education University of Southern California Master of Arts (MA),  Elementary Education and Teaching 2011  – 2013 Santa Clara University Bachelor of Science, Commerce,  Marketing 1999  – 2003 University of Southern California Master of Arts (MA),  Elementary Education and Teaching 2011  – 2013 University of Southern California Master of Arts (MA),  Elementary Education and Teaching 2011  – 2013 University of Southern California Master of Arts (MA),  Elementary Education and Teaching 2011  – 2013 Santa Clara University Bachelor of Science, Commerce,  Marketing 1999  – 2003 Santa Clara University Bachelor of Science, Commerce,  Marketing 1999  – 2003 Santa Clara University Bachelor of Science, Commerce,  Marketing 1999  – 2003 ", "Experience Founder Tad LLC June 2015  – Present (2 months) San Mateo, CA Digital Marketing Consultant, Account Executive Google December 2013  – Present (1 year 8 months) Mountain View, CA Account Executive, Health Services Google May 2012  –  December 2013  (1 year 8 months) Mountain View, CA Product Marketing Manager, DoubleClick Search Google March 2011  –  April 2012  (1 year 2 months) Mountain View Product Marketing Manager, AdWords Google June 2010  –  March 2011  (10 months) Account Executive, Business and Industrial Markets Google July 2009  –  June 2010  (1 year) Mountain View Optimization Specialist Google January 2006  –  June 2009  (3 years 6 months) Audit Associate KPMG LLP December 2004  –  May 2005  (6 months) Founder Tad LLC June 2015  – Present (2 months) San Mateo, CA Founder Tad LLC June 2015  – Present (2 months) San Mateo, CA Digital Marketing Consultant, Account Executive Google December 2013  – Present (1 year 8 months) Mountain View, CA Digital Marketing Consultant, Account Executive Google December 2013  – Present (1 year 8 months) Mountain View, CA Account Executive, Health Services Google May 2012  –  December 2013  (1 year 8 months) Mountain View, CA Account Executive, Health Services Google May 2012  –  December 2013  (1 year 8 months) Mountain View, CA Product Marketing Manager, DoubleClick Search Google March 2011  –  April 2012  (1 year 2 months) Mountain View Product Marketing Manager, DoubleClick Search Google March 2011  –  April 2012  (1 year 2 months) Mountain View Product Marketing Manager, AdWords Google June 2010  –  March 2011  (10 months) Product Marketing Manager, AdWords Google June 2010  –  March 2011  (10 months) Account Executive, Business and Industrial Markets Google July 2009  –  June 2010  (1 year) Mountain View Account Executive, Business and Industrial Markets Google July 2009  –  June 2010  (1 year) Mountain View Optimization Specialist Google January 2006  –  June 2009  (3 years 6 months) Optimization Specialist Google January 2006  –  June 2009  (3 years 6 months) Audit Associate KPMG LLP December 2004  –  May 2005  (6 months) Audit Associate KPMG LLP December 2004  –  May 2005  (6 months) Skills Top Skills 15 Google Adwords 8 Digital Marketing 7 Google Analytics 6 Online Advertising 6 SEM 5 Product Marketing 3 Marketing Strategy 3 Social Media Marketing 3 PPC 1 B2B Marketing Kit also knows about... 1 Strategy 0 Google Docs 0 B2B Marketing Strategy 0 Healthcare Skills  Top Skills 15 Google Adwords 8 Digital Marketing 7 Google Analytics 6 Online Advertising 6 SEM 5 Product Marketing 3 Marketing Strategy 3 Social Media Marketing 3 PPC 1 B2B Marketing Kit also knows about... 1 Strategy 0 Google Docs 0 B2B Marketing Strategy 0 Healthcare Top Skills 15 Google Adwords 8 Digital Marketing 7 Google Analytics 6 Online Advertising 6 SEM 5 Product Marketing 3 Marketing Strategy 3 Social Media Marketing 3 PPC 1 B2B Marketing Kit also knows about... 1 Strategy 0 Google Docs 0 B2B Marketing Strategy 0 Healthcare Top Skills 15 Google Adwords 8 Digital Marketing 7 Google Analytics 6 Online Advertising 6 SEM 5 Product Marketing 3 Marketing Strategy 3 Social Media Marketing 3 PPC 1 B2B Marketing Kit also knows about... 1 Strategy 0 Google Docs 0 B2B Marketing Strategy 0 Healthcare                     1 Strategy 0 Google Docs 0 B2B Marketing Strategy 0 Healthcare Education The University of Texas at Austin 2000  – 2004 The University of Texas at Austin Bachelor of Business Administration (B.B.A.),  Accounting and Finance 2000  – 2004 The University of Texas at Austin 2000  – 2004 The University of Texas at Austin 2000  – 2004 The University of Texas at Austin 2000  – 2004 The University of Texas at Austin Bachelor of Business Administration (B.B.A.),  Accounting and Finance 2000  – 2004 The University of Texas at Austin Bachelor of Business Administration (B.B.A.),  Accounting and Finance 2000  – 2004 The University of Texas at Austin Bachelor of Business Administration (B.B.A.),  Accounting and Finance 2000  – 2004 ", "Experience Associate Manager, AdWords Google July 2008  – Present (7 years 1 month) Optimization Specialist Google February 2004  –  July 2006  (2 years 6 months) Associate Manager, AdWords Google July 2008  – Present (7 years 1 month) Associate Manager, AdWords Google July 2008  – Present (7 years 1 month) Optimization Specialist Google February 2004  –  July 2006  (2 years 6 months) Optimization Specialist Google February 2004  –  July 2006  (2 years 6 months) Skills Skills     Education Santa Clara University 1999  – 2003 Santa Clara University 1999  – 2003 Santa Clara University 1999  – 2003 Santa Clara University 1999  – 2003 ", "Experience Technical Specialist, Shopping Google September 2013  – Present (1 year 11 months) San Francisco Bay Area I'm working on improving operations and processes in the Channel Intelligence front- and back end, making things faster, and more scalable. I'm here to \"weed the feed\": making data feeds work for US and international customers, helping them to get the most out of shopping engines around the web and our Google Display products. Display Specialist Google February 2013  –  August 2013  (7 months) Dublin, Ireland I maximized Display & YouTube spend of large customers across Media&Entertainment, Tech, and Local sectors. I focused on creating and implementing Remarketing strategies with our customers as well as improving Google's behavioural targeting product suite. Key Account Manager - Local Google May 2010  –  February 2013  (2 years 10 months) Dublin, Ireland - Driven strategic growth of a portfolio of 11 key accounts with a quarterly revenue of $55 Million \n- Focused on international couponing and dating customers \n- Pitched Google advertising solutions to C-Levels and agencies (Search, Display, Mobile, YouTube) \n- Organized and executed client events, spoke at external Google Marketing events \n- Delivered internal and external training on Search and Display optimization \n- Liaised with in-country Sales team to deepen client relations and to coordinate Sales pitches \n- Acted as pod expert on all Shopping/Commerce products via training and office hours \n- Project Management with all internal stakeholders (Marketing, Product, Engineering, Policy, Billing) Search Engine Optimization Specialist AutoAnything January 2009  –  December 2009  (1 year) Greater San Diego Area Responsible for creating and optimizing landing pages; Developing and executing Pay-per-Click campaigns, performing keyword research and market analysis, measuring and analysing web traffic and revenue. Writing content, supporting Social Media efforts, developing and applying link building strategies; Conducting weekly performance reports with Omniture, reporting to the Management Team; Supervising interns, conducting SEO Business Analytic Reports for several departments within the Company. (Open) 3 recommendations, including: Maria Haase, MBA Senior Online Marketing Manager, MBA Sebastian supports Market Your Startup, Inc. with his extensive knowledge about SEO and website development on various... View Craig Wheat Senior Marketing Channel Manager at AutoAnything Inc. (an AutoZone Company) Sebastian headed up the organization, development and implementation of a very large new paid search campaign we launched. ... View 1 more recommendation PR Account Coordinator JB Cumberland PR January 2008  –  August 2008  (8 months) Greater New York City Area Consultant Greater London Enterprise, London, UK 2007  –  2007  (less than a year) London, United Kingdom Researcher German Government / Deutscher Bundestag 2004  –  2005  (1 year) Berlin Area, Germany Technical Specialist, Shopping Google September 2013  – Present (1 year 11 months) San Francisco Bay Area I'm working on improving operations and processes in the Channel Intelligence front- and back end, making things faster, and more scalable. I'm here to \"weed the feed\": making data feeds work for US and international customers, helping them to get the most out of shopping engines around the web and our Google Display products. Technical Specialist, Shopping Google September 2013  – Present (1 year 11 months) San Francisco Bay Area I'm working on improving operations and processes in the Channel Intelligence front- and back end, making things faster, and more scalable. I'm here to \"weed the feed\": making data feeds work for US and international customers, helping them to get the most out of shopping engines around the web and our Google Display products. Display Specialist Google February 2013  –  August 2013  (7 months) Dublin, Ireland I maximized Display & YouTube spend of large customers across Media&Entertainment, Tech, and Local sectors. I focused on creating and implementing Remarketing strategies with our customers as well as improving Google's behavioural targeting product suite. Display Specialist Google February 2013  –  August 2013  (7 months) Dublin, Ireland I maximized Display & YouTube spend of large customers across Media&Entertainment, Tech, and Local sectors. I focused on creating and implementing Remarketing strategies with our customers as well as improving Google's behavioural targeting product suite. Key Account Manager - Local Google May 2010  –  February 2013  (2 years 10 months) Dublin, Ireland - Driven strategic growth of a portfolio of 11 key accounts with a quarterly revenue of $55 Million \n- Focused on international couponing and dating customers \n- Pitched Google advertising solutions to C-Levels and agencies (Search, Display, Mobile, YouTube) \n- Organized and executed client events, spoke at external Google Marketing events \n- Delivered internal and external training on Search and Display optimization \n- Liaised with in-country Sales team to deepen client relations and to coordinate Sales pitches \n- Acted as pod expert on all Shopping/Commerce products via training and office hours \n- Project Management with all internal stakeholders (Marketing, Product, Engineering, Policy, Billing) Key Account Manager - Local Google May 2010  –  February 2013  (2 years 10 months) Dublin, Ireland - Driven strategic growth of a portfolio of 11 key accounts with a quarterly revenue of $55 Million \n- Focused on international couponing and dating customers \n- Pitched Google advertising solutions to C-Levels and agencies (Search, Display, Mobile, YouTube) \n- Organized and executed client events, spoke at external Google Marketing events \n- Delivered internal and external training on Search and Display optimization \n- Liaised with in-country Sales team to deepen client relations and to coordinate Sales pitches \n- Acted as pod expert on all Shopping/Commerce products via training and office hours \n- Project Management with all internal stakeholders (Marketing, Product, Engineering, Policy, Billing) Search Engine Optimization Specialist AutoAnything January 2009  –  December 2009  (1 year) Greater San Diego Area Responsible for creating and optimizing landing pages; Developing and executing Pay-per-Click campaigns, performing keyword research and market analysis, measuring and analysing web traffic and revenue. Writing content, supporting Social Media efforts, developing and applying link building strategies; Conducting weekly performance reports with Omniture, reporting to the Management Team; Supervising interns, conducting SEO Business Analytic Reports for several departments within the Company. (Open) 3 recommendations, including: Maria Haase, MBA Senior Online Marketing Manager, MBA Sebastian supports Market Your Startup, Inc. with his extensive knowledge about SEO and website development on various... View Craig Wheat Senior Marketing Channel Manager at AutoAnything Inc. (an AutoZone Company) Sebastian headed up the organization, development and implementation of a very large new paid search campaign we launched. ... View 1 more recommendation Search Engine Optimization Specialist AutoAnything January 2009  –  December 2009  (1 year) Greater San Diego Area Responsible for creating and optimizing landing pages; Developing and executing Pay-per-Click campaigns, performing keyword research and market analysis, measuring and analysing web traffic and revenue. Writing content, supporting Social Media efforts, developing and applying link building strategies; Conducting weekly performance reports with Omniture, reporting to the Management Team; Supervising interns, conducting SEO Business Analytic Reports for several departments within the Company. (Open) 3 recommendations, including: Maria Haase, MBA Senior Online Marketing Manager, MBA Sebastian supports Market Your Startup, Inc. with his extensive knowledge about SEO and website development on various... View Craig Wheat Senior Marketing Channel Manager at AutoAnything Inc. (an AutoZone Company) Sebastian headed up the organization, development and implementation of a very large new paid search campaign we launched. ... View 1 more recommendation PR Account Coordinator JB Cumberland PR January 2008  –  August 2008  (8 months) Greater New York City Area PR Account Coordinator JB Cumberland PR January 2008  –  August 2008  (8 months) Greater New York City Area Consultant Greater London Enterprise, London, UK 2007  –  2007  (less than a year) London, United Kingdom Consultant Greater London Enterprise, London, UK 2007  –  2007  (less than a year) London, United Kingdom Researcher German Government / Deutscher Bundestag 2004  –  2005  (1 year) Berlin Area, Germany Researcher German Government / Deutscher Bundestag 2004  –  2005  (1 year) Berlin Area, Germany Languages English Full professional proficiency Russian Limited working proficiency German Native or bilingual proficiency Spanish Limited working proficiency English Full professional proficiency Russian Limited working proficiency German Native or bilingual proficiency Spanish Limited working proficiency English Full professional proficiency Russian Limited working proficiency German Native or bilingual proficiency Spanish Limited working proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Top Skills 20 Digital Marketing 18 PPC 17 Google Analytics 10 Display Advertising 7 Google Adwords... 6 Web Development 3 Adsense 3 Google+ 2 SEO 2 HTML 5 Sebastian also knows about... 0 Data Feeds 0 Google Shopping Skills  Top Skills 20 Digital Marketing 18 PPC 17 Google Analytics 10 Display Advertising 7 Google Adwords... 6 Web Development 3 Adsense 3 Google+ 2 SEO 2 HTML 5 Sebastian also knows about... 0 Data Feeds 0 Google Shopping Top Skills 20 Digital Marketing 18 PPC 17 Google Analytics 10 Display Advertising 7 Google Adwords... 6 Web Development 3 Adsense 3 Google+ 2 SEO 2 HTML 5 Sebastian also knows about... 0 Data Feeds 0 Google Shopping Top Skills 20 Digital Marketing 18 PPC 17 Google Analytics 10 Display Advertising 7 Google Adwords... 6 Web Development 3 Adsense 3 Google+ 2 SEO 2 HTML 5 Sebastian also knows about... 0 Data Feeds 0 Google Shopping                     0 Data Feeds 0 Google Shopping Education New York University Digital Media Marketing 2008  – 2008 (Open) 1 recommendation Gene De Libero Digital Business Transformation. Digital Business Management. Digital Transformation Strategy. Digital Marketing. Sebastian was a student in my Digital Marketing classes at NYU. His knowledge of the digital space is impressive as is his ability to learn new skills and quickly put them into practice. An astute strategist, Sebastian would make a positive addition... View King's College London European Studies 2006  – 2007 Freie Universität Berlin Dipl. Pol.,  Political Science 2001  – 2007 Main focus on Transatlantic Security Policy, Thesis: Counterterrorism in the European Union New York University Digital Media Marketing 2008  – 2008 (Open) 1 recommendation Gene De Libero Digital Business Transformation. Digital Business Management. Digital Transformation Strategy. Digital Marketing. Sebastian was a student in my Digital Marketing classes at NYU. His knowledge of the digital space is impressive as is his ability to learn new skills and quickly put them into practice. An astute strategist, Sebastian would make a positive addition... View New York University Digital Media Marketing 2008  – 2008 (Open) 1 recommendation Gene De Libero Digital Business Transformation. Digital Business Management. Digital Transformation Strategy. Digital Marketing. Sebastian was a student in my Digital Marketing classes at NYU. His knowledge of the digital space is impressive as is his ability to learn new skills and quickly put them into practice. An astute strategist, Sebastian would make a positive addition... View New York University Digital Media Marketing 2008  – 2008 (Open) 1 recommendation Gene De Libero Digital Business Transformation. Digital Business Management. Digital Transformation Strategy. Digital Marketing. Sebastian was a student in my Digital Marketing classes at NYU. His knowledge of the digital space is impressive as is his ability to learn new skills and quickly put them into practice. An astute strategist, Sebastian would make a positive addition... View King's College London European Studies 2006  – 2007 King's College London European Studies 2006  – 2007 King's College London European Studies 2006  – 2007 Freie Universität Berlin Dipl. Pol.,  Political Science 2001  – 2007 Main focus on Transatlantic Security Policy, Thesis: Counterterrorism in the European Union Freie Universität Berlin Dipl. Pol.,  Political Science 2001  – 2007 Main focus on Transatlantic Security Policy, Thesis: Counterterrorism in the European Union Freie Universität Berlin Dipl. Pol.,  Political Science 2001  – 2007 Main focus on Transatlantic Security Policy, Thesis: Counterterrorism in the European Union Honors & Awards Additional Honors & Awards Google AdWords Certified Individual 2010 Additional Honors & Awards Google AdWords Certified Individual 2010 Additional Honors & Awards Google AdWords Certified Individual 2010 Additional Honors & Awards Google AdWords Certified Individual 2010 ", "Experience Program Manager, Product Quality Operations Google January 2015  – Present (7 months) Dublin, Ireland Managing outsourced operations for anti-abuse team in Europe Analyst, Global Third Party Operations Google November 2011  –  December 2014  (3 years 2 months) India Develop and deliver strategy and infrastructure to enable world-class vendor operations across Google's Business Organization Online Advertising Sales Strategist Google December 2007  –  November 2011  (4 years) India Account Manager for Google AdWords Advertisers across NA, UK, Australia, New Zealand and South East Asia. Reporter/Journalist Headlines India 2007  –  2007  (less than a year) New Delhi Area, India Search Engine Optimization Specialist V2web Informatics Private Limited 2006  –  2007  (1 year) New Delhi Area, India Brand development, web site traffic growth, web site UI and advertising revenue. Program Manager, Product Quality Operations Google January 2015  – Present (7 months) Dublin, Ireland Managing outsourced operations for anti-abuse team in Europe Program Manager, Product Quality Operations Google January 2015  – Present (7 months) Dublin, Ireland Managing outsourced operations for anti-abuse team in Europe Analyst, Global Third Party Operations Google November 2011  –  December 2014  (3 years 2 months) India Develop and deliver strategy and infrastructure to enable world-class vendor operations across Google's Business Organization Analyst, Global Third Party Operations Google November 2011  –  December 2014  (3 years 2 months) India Develop and deliver strategy and infrastructure to enable world-class vendor operations across Google's Business Organization Online Advertising Sales Strategist Google December 2007  –  November 2011  (4 years) India Account Manager for Google AdWords Advertisers across NA, UK, Australia, New Zealand and South East Asia. Online Advertising Sales Strategist Google December 2007  –  November 2011  (4 years) India Account Manager for Google AdWords Advertisers across NA, UK, Australia, New Zealand and South East Asia. Reporter/Journalist Headlines India 2007  –  2007  (less than a year) New Delhi Area, India Reporter/Journalist Headlines India 2007  –  2007  (less than a year) New Delhi Area, India Search Engine Optimization Specialist V2web Informatics Private Limited 2006  –  2007  (1 year) New Delhi Area, India Brand development, web site traffic growth, web site UI and advertising revenue. Search Engine Optimization Specialist V2web Informatics Private Limited 2006  –  2007  (1 year) New Delhi Area, India Brand development, web site traffic growth, web site UI and advertising revenue. Skills Top Skills 34 Google Adwords 18 Search Advertising 13 Online Advertising 13 SEM 11 Advertising 10 PPC 6 Google Analytics 5 Keyword Advertising 4 Microsoft Office 4 Mobile Advertising Warren also knows about... 4 Keyword Research 3 Account Management 3 Web Analytics 3 Digital Strategy 3 Search Analysis 2 SEO 2 Conversion Optimization 2 Ad Serving 2 Analytics 2 Landing Page... 2 Ad Networks 1 Outsourcing Management 1 Vendor Management 1 Google Adwords... 0 MS Office Suite 0 Vendor Relationships 0 Vendor Contracts 0 Vendor Management Skills 0 Third Party Vendor... 0 Vendor Management... 0 Relationship Management 0 Business Relationship... See 7+     See less Skills  Top Skills 34 Google Adwords 18 Search Advertising 13 Online Advertising 13 SEM 11 Advertising 10 PPC 6 Google Analytics 5 Keyword Advertising 4 Microsoft Office 4 Mobile Advertising Warren also knows about... 4 Keyword Research 3 Account Management 3 Web Analytics 3 Digital Strategy 3 Search Analysis 2 SEO 2 Conversion Optimization 2 Ad Serving 2 Analytics 2 Landing Page... 2 Ad Networks 1 Outsourcing Management 1 Vendor Management 1 Google Adwords... 0 MS Office Suite 0 Vendor Relationships 0 Vendor Contracts 0 Vendor Management Skills 0 Third Party Vendor... 0 Vendor Management... 0 Relationship Management 0 Business Relationship... See 7+     See less Top Skills 34 Google Adwords 18 Search Advertising 13 Online Advertising 13 SEM 11 Advertising 10 PPC 6 Google Analytics 5 Keyword Advertising 4 Microsoft Office 4 Mobile Advertising Warren also knows about... 4 Keyword Research 3 Account Management 3 Web Analytics 3 Digital Strategy 3 Search Analysis 2 SEO 2 Conversion Optimization 2 Ad Serving 2 Analytics 2 Landing Page... 2 Ad Networks 1 Outsourcing Management 1 Vendor Management 1 Google Adwords... 0 MS Office Suite 0 Vendor Relationships 0 Vendor Contracts 0 Vendor Management Skills 0 Third Party Vendor... 0 Vendor Management... 0 Relationship Management 0 Business Relationship... See 7+     See less Top Skills 34 Google Adwords 18 Search Advertising 13 Online Advertising 13 SEM 11 Advertising 10 PPC 6 Google Analytics 5 Keyword Advertising 4 Microsoft Office 4 Mobile Advertising Warren also knows about... 4 Keyword Research 3 Account Management 3 Web Analytics 3 Digital Strategy 3 Search Analysis 2 SEO 2 Conversion Optimization 2 Ad Serving 2 Analytics 2 Landing Page... 2 Ad Networks 1 Outsourcing Management 1 Vendor Management 1 Google Adwords... 0 MS Office Suite 0 Vendor Relationships 0 Vendor Contracts 0 Vendor Management Skills 0 Third Party Vendor... 0 Vendor Management... 0 Relationship Management 0 Business Relationship... See 7+     See less                     4 Keyword Research 3 Account Management 3 Web Analytics 3 Digital Strategy 3 Search Analysis 2 SEO 2 Conversion Optimization 2 Ad Serving 2 Analytics 2 Landing Page... 2 Ad Networks 1 Outsourcing Management 1 Vendor Management 1 Google Adwords... 0 MS Office Suite 0 Vendor Relationships 0 Vendor Contracts 0 Vendor Management Skills 0 Third Party Vendor... 0 Vendor Management... 0 Relationship Management 0 Business Relationship... Education Guru Jambheshwar University of Science and Technology Communication ,  Journalism ,  and Related Programs 2004  – 2007 Jagan Institute Of Management Studies Mass Communication/Media Studies 2004  – 2007 Guru Jambheshwar University of Science and Technology Communication ,  Journalism ,  and Related Programs 2004  – 2007 Guru Jambheshwar University of Science and Technology Communication ,  Journalism ,  and Related Programs 2004  – 2007 Guru Jambheshwar University of Science and Technology Communication ,  Journalism ,  and Related Programs 2004  – 2007 Jagan Institute Of Management Studies Mass Communication/Media Studies 2004  – 2007 Jagan Institute Of Management Studies Mass Communication/Media Studies 2004  – 2007 Jagan Institute Of Management Studies Mass Communication/Media Studies 2004  – 2007 ", "Experience Channel Intelligence Retail Categorization Team Lead Google (Through HCL America) May 2015  – Present (3 months) Pittsburgh, PA Manage team of vendor operators for Channel Intelligence's Retail Categorization at Google Pittsburgh (under contract to HCL America). Optimize data using taxonomy for online shopping channels for International (French, Italian, Spanish and Portuguese) and Domestic Clients. Perform taxonomy pairings between Channel Intelligence's category tree and those of various other US/UK/French online shopping channels in the target language. Perform categorization based tasks for Google Shopping's Merlot Team. Private Italian Language Instructor Language Trainers August 2012  – Present (3 years) Greater Pittsburgh Area Optimization Specialist Akorbi at Google September 2013  –  April 2015  (1 year 8 months) Greater Pittsburgh Area Optimize data using taxonomy for online shopping channels for Channel Intelligence at Google Pittsburgh (under contract to Akorbi) for International (French, Italian, Spanish and Portuguese) and Domestic Clients. Perform taxonomy pairings between Channel Intelligence's category tree and those of various other French online shopping channels in the target language. Childcare Provider Jewish Community Center of Greater Pittsburgh May 2010  –  May 2013  (3 years 1 month) Pittsburgh, PA Italian Instructor/Adjunct Faculty CCAC 2012  –  2013  (1 year) English Language Teacher ACLE May 2012  –  August 2012  (4 months) San Remo, Italy Taught English Language at Immersion Camps for Italian children ages 5-18 throughout the Italian peninsula. Italian Language Instructor University of Pittsburgh August 2010  –  May 2012  (1 year 10 months) Greater Pittsburgh Area Channel Intelligence Retail Categorization Team Lead Google (Through HCL America) May 2015  – Present (3 months) Pittsburgh, PA Manage team of vendor operators for Channel Intelligence's Retail Categorization at Google Pittsburgh (under contract to HCL America). Optimize data using taxonomy for online shopping channels for International (French, Italian, Spanish and Portuguese) and Domestic Clients. Perform taxonomy pairings between Channel Intelligence's category tree and those of various other US/UK/French online shopping channels in the target language. Perform categorization based tasks for Google Shopping's Merlot Team. Channel Intelligence Retail Categorization Team Lead Google (Through HCL America) May 2015  – Present (3 months) Pittsburgh, PA Manage team of vendor operators for Channel Intelligence's Retail Categorization at Google Pittsburgh (under contract to HCL America). Optimize data using taxonomy for online shopping channels for International (French, Italian, Spanish and Portuguese) and Domestic Clients. Perform taxonomy pairings between Channel Intelligence's category tree and those of various other US/UK/French online shopping channels in the target language. Perform categorization based tasks for Google Shopping's Merlot Team. Private Italian Language Instructor Language Trainers August 2012  – Present (3 years) Greater Pittsburgh Area Private Italian Language Instructor Language Trainers August 2012  – Present (3 years) Greater Pittsburgh Area Optimization Specialist Akorbi at Google September 2013  –  April 2015  (1 year 8 months) Greater Pittsburgh Area Optimize data using taxonomy for online shopping channels for Channel Intelligence at Google Pittsburgh (under contract to Akorbi) for International (French, Italian, Spanish and Portuguese) and Domestic Clients. Perform taxonomy pairings between Channel Intelligence's category tree and those of various other French online shopping channels in the target language. Optimization Specialist Akorbi at Google September 2013  –  April 2015  (1 year 8 months) Greater Pittsburgh Area Optimize data using taxonomy for online shopping channels for Channel Intelligence at Google Pittsburgh (under contract to Akorbi) for International (French, Italian, Spanish and Portuguese) and Domestic Clients. Perform taxonomy pairings between Channel Intelligence's category tree and those of various other French online shopping channels in the target language. Childcare Provider Jewish Community Center of Greater Pittsburgh May 2010  –  May 2013  (3 years 1 month) Pittsburgh, PA Childcare Provider Jewish Community Center of Greater Pittsburgh May 2010  –  May 2013  (3 years 1 month) Pittsburgh, PA Italian Instructor/Adjunct Faculty CCAC 2012  –  2013  (1 year) Italian Instructor/Adjunct Faculty CCAC 2012  –  2013  (1 year) English Language Teacher ACLE May 2012  –  August 2012  (4 months) San Remo, Italy Taught English Language at Immersion Camps for Italian children ages 5-18 throughout the Italian peninsula. English Language Teacher ACLE May 2012  –  August 2012  (4 months) San Remo, Italy Taught English Language at Immersion Camps for Italian children ages 5-18 throughout the Italian peninsula. Italian Language Instructor University of Pittsburgh August 2010  –  May 2012  (1 year 10 months) Greater Pittsburgh Area Italian Language Instructor University of Pittsburgh August 2010  –  May 2012  (1 year 10 months) Greater Pittsburgh Area Languages English Native or bilingual proficiency Italian Native or bilingual proficiency French Full professional proficiency Spanish Elementary proficiency Portuguese Limited working proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency French Full professional proficiency Spanish Elementary proficiency Portuguese Limited working proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency French Full professional proficiency Spanish Elementary proficiency Portuguese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Limited working proficiency Skills Top Skills 7 Italian 3 Language Teaching 2 Foreign Languages 2 Intercultural... 2 Linguistics 2 Public Speaking 1 Travel 1 Tutoring 1 Research 0 French Amanda also knows about... 0 Spanish 0 Teaching 0 Editing 0 Higher Education Skills  Top Skills 7 Italian 3 Language Teaching 2 Foreign Languages 2 Intercultural... 2 Linguistics 2 Public Speaking 1 Travel 1 Tutoring 1 Research 0 French Amanda also knows about... 0 Spanish 0 Teaching 0 Editing 0 Higher Education Top Skills 7 Italian 3 Language Teaching 2 Foreign Languages 2 Intercultural... 2 Linguistics 2 Public Speaking 1 Travel 1 Tutoring 1 Research 0 French Amanda also knows about... 0 Spanish 0 Teaching 0 Editing 0 Higher Education Top Skills 7 Italian 3 Language Teaching 2 Foreign Languages 2 Intercultural... 2 Linguistics 2 Public Speaking 1 Travel 1 Tutoring 1 Research 0 French Amanda also knows about... 0 Spanish 0 Teaching 0 Editing 0 Higher Education                     0 Spanish 0 Teaching 0 Editing 0 Higher Education Education University of Pittsburgh Master of Arts (MA),  Italian Language and Literature 2010  – 2012 Penn State University Bachelor of Arts (BA),  French and Francophone Studies ,  Italian Studies ,  International Studies 2006  – 2010 University of Pittsburgh Master of Arts (MA),  Italian Language and Literature 2010  – 2012 University of Pittsburgh Master of Arts (MA),  Italian Language and Literature 2010  – 2012 University of Pittsburgh Master of Arts (MA),  Italian Language and Literature 2010  – 2012 Penn State University Bachelor of Arts (BA),  French and Francophone Studies ,  Italian Studies ,  International Studies 2006  – 2010 Penn State University Bachelor of Arts (BA),  French and Francophone Studies ,  Italian Studies ,  International Studies 2006  – 2010 Penn State University Bachelor of Arts (BA),  French and Francophone Studies ,  Italian Studies ,  International Studies 2006  – 2010 ", "Experience Product Technology Manager Google January 2013  – Present (2 years 7 months) New York, NY Advertising Operations Manager, Google Display Network Google October 2010  – Present (4 years 10 months) Mountain, View CA and New York, NY (Open) 1 honor or award OC Award: Ad Formats (3PAS) Annual award given to the teams that demonstrated the most impact and results at Google. View 3rd Party Ad Serving (3PAS) Specialist & Google Ad Manager Support Team Google 2008  –  2009  (1 year) Mountain View, CA (Open) 1 honor or award OC Award: Google Ad Manager Annual award given to the teams that demonstrated the most impact and results at Google. View Contextual Optimization Specialist Google 2006  –  2008  (2 years) Mountain View, CA Ad Operations Manager Advance Internet June 2005  –  October 2006  (1 year 5 months) Jersey City, NJ Ad Ops Manager Boston.com 2004  –  2005  (1 year) Boston, MA Technical Producer Boston.com 2003  –  2004  (1 year) Boston, MA Marketing Content Developer Boston.com 2000  –  2003  (3 years) Boston, MA (Open) 2 honors and awards Employee of the Year Award View Outstanding Team Performance of the Year Award: Sales Development Team View Product Technology Manager Google January 2013  – Present (2 years 7 months) New York, NY Product Technology Manager Google January 2013  – Present (2 years 7 months) New York, NY Advertising Operations Manager, Google Display Network Google October 2010  – Present (4 years 10 months) Mountain, View CA and New York, NY (Open) 1 honor or award OC Award: Ad Formats (3PAS) Annual award given to the teams that demonstrated the most impact and results at Google. View Advertising Operations Manager, Google Display Network Google October 2010  – Present (4 years 10 months) Mountain, View CA and New York, NY (Open) 1 honor or award OC Award: Ad Formats (3PAS) Annual award given to the teams that demonstrated the most impact and results at Google. View 3rd Party Ad Serving (3PAS) Specialist & Google Ad Manager Support Team Google 2008  –  2009  (1 year) Mountain View, CA (Open) 1 honor or award OC Award: Google Ad Manager Annual award given to the teams that demonstrated the most impact and results at Google. View 3rd Party Ad Serving (3PAS) Specialist & Google Ad Manager Support Team Google 2008  –  2009  (1 year) Mountain View, CA (Open) 1 honor or award OC Award: Google Ad Manager Annual award given to the teams that demonstrated the most impact and results at Google. View Contextual Optimization Specialist Google 2006  –  2008  (2 years) Mountain View, CA Contextual Optimization Specialist Google 2006  –  2008  (2 years) Mountain View, CA Ad Operations Manager Advance Internet June 2005  –  October 2006  (1 year 5 months) Jersey City, NJ Ad Operations Manager Advance Internet June 2005  –  October 2006  (1 year 5 months) Jersey City, NJ Ad Ops Manager Boston.com 2004  –  2005  (1 year) Boston, MA Ad Ops Manager Boston.com 2004  –  2005  (1 year) Boston, MA Technical Producer Boston.com 2003  –  2004  (1 year) Boston, MA Technical Producer Boston.com 2003  –  2004  (1 year) Boston, MA Marketing Content Developer Boston.com 2000  –  2003  (3 years) Boston, MA (Open) 2 honors and awards Employee of the Year Award View Outstanding Team Performance of the Year Award: Sales Development Team View Marketing Content Developer Boston.com 2000  –  2003  (3 years) Boston, MA (Open) 2 honors and awards Employee of the Year Award View Outstanding Team Performance of the Year Award: Sales Development Team View Languages French French French Skills Top Skills 14 Ad Serving 10 Display Advertising 7 Online Advertising 5 DoubleClick 5 Digital Media 4 Rich Media 3 Google Adwords 2 Banner Ads 2 Advertising Operations 2 Ad Networks Brandon also knows about... 2 Web Analytics 1 Targeted Advertising 1 Viral Marketing 1 Behavioral Targeting 1 Ad Exchanges 1 PPC 1 Digital Marketing 1 Digital Strategy 0 Mobile Advertising 0 SEM 0 Google Analytics 0 DFP 0 DART for Publishers 0 Atlas 0 JavaScript 0 Closure 0 MySQL See 2+     See less Skills  Top Skills 14 Ad Serving 10 Display Advertising 7 Online Advertising 5 DoubleClick 5 Digital Media 4 Rich Media 3 Google Adwords 2 Banner Ads 2 Advertising Operations 2 Ad Networks Brandon also knows about... 2 Web Analytics 1 Targeted Advertising 1 Viral Marketing 1 Behavioral Targeting 1 Ad Exchanges 1 PPC 1 Digital Marketing 1 Digital Strategy 0 Mobile Advertising 0 SEM 0 Google Analytics 0 DFP 0 DART for Publishers 0 Atlas 0 JavaScript 0 Closure 0 MySQL See 2+     See less Top Skills 14 Ad Serving 10 Display Advertising 7 Online Advertising 5 DoubleClick 5 Digital Media 4 Rich Media 3 Google Adwords 2 Banner Ads 2 Advertising Operations 2 Ad Networks Brandon also knows about... 2 Web Analytics 1 Targeted Advertising 1 Viral Marketing 1 Behavioral Targeting 1 Ad Exchanges 1 PPC 1 Digital Marketing 1 Digital Strategy 0 Mobile Advertising 0 SEM 0 Google Analytics 0 DFP 0 DART for Publishers 0 Atlas 0 JavaScript 0 Closure 0 MySQL See 2+     See less Top Skills 14 Ad Serving 10 Display Advertising 7 Online Advertising 5 DoubleClick 5 Digital Media 4 Rich Media 3 Google Adwords 2 Banner Ads 2 Advertising Operations 2 Ad Networks Brandon also knows about... 2 Web Analytics 1 Targeted Advertising 1 Viral Marketing 1 Behavioral Targeting 1 Ad Exchanges 1 PPC 1 Digital Marketing 1 Digital Strategy 0 Mobile Advertising 0 SEM 0 Google Analytics 0 DFP 0 DART for Publishers 0 Atlas 0 JavaScript 0 Closure 0 MySQL See 2+     See less                     2 Web Analytics 1 Targeted Advertising 1 Viral Marketing 1 Behavioral Targeting 1 Ad Exchanges 1 PPC 1 Digital Marketing 1 Digital Strategy 0 Mobile Advertising 0 SEM 0 Google Analytics 0 DFP 0 DART for Publishers 0 Atlas 0 JavaScript 0 Closure 0 MySQL Education Northeastern University Bachelors 1996  – 2000 Ecole supérieure de Commerce de Reims Bachelor of Science (BS) 1998  – 1999 Northeastern University Bachelors 1996  – 2000 Northeastern University Bachelors 1996  – 2000 Northeastern University Bachelors 1996  – 2000 Ecole supérieure de Commerce de Reims Bachelor of Science (BS) 1998  – 1999 Ecole supérieure de Commerce de Reims Bachelor of Science (BS) 1998  – 1999 Ecole supérieure de Commerce de Reims Bachelor of Science (BS) 1998  – 1999 Honors & Awards Employee of the Year Award Boston.com Executive Management Team December 2002 Outstanding Team Performance of the Year Award: Sales Development Team Boston.com Executive Management Team December 2001 OC Award: Google Ad Manager Google Executive Management Team December 2009 Annual award given to the teams that demonstrated the most impact and results at Google. OC Award: Ad Formats (3PAS) Google Executive Management Team December 2010 Annual award given to the teams that demonstrated the most impact and results at Google. Employee of the Year Award Boston.com Executive Management Team December 2002 Employee of the Year Award Boston.com Executive Management Team December 2002 Employee of the Year Award Boston.com Executive Management Team December 2002 Outstanding Team Performance of the Year Award: Sales Development Team Boston.com Executive Management Team December 2001 Outstanding Team Performance of the Year Award: Sales Development Team Boston.com Executive Management Team December 2001 Outstanding Team Performance of the Year Award: Sales Development Team Boston.com Executive Management Team December 2001 OC Award: Google Ad Manager Google Executive Management Team December 2009 Annual award given to the teams that demonstrated the most impact and results at Google. OC Award: Google Ad Manager Google Executive Management Team December 2009 Annual award given to the teams that demonstrated the most impact and results at Google. OC Award: Google Ad Manager Google Executive Management Team December 2009 Annual award given to the teams that demonstrated the most impact and results at Google. OC Award: Ad Formats (3PAS) Google Executive Management Team December 2010 Annual award given to the teams that demonstrated the most impact and results at Google. OC Award: Ad Formats (3PAS) Google Executive Management Team December 2010 Annual award given to the teams that demonstrated the most impact and results at Google. OC Award: Ad Formats (3PAS) Google Executive Management Team December 2010 Annual award given to the teams that demonstrated the most impact and results at Google. "]}