{"position": "Partner Operations Manager", "company": "Google", "profiles": ["Experience Senior Partner Operations Manager Google August 2013  – Present (2 years 1 month) Mountain View, CA Value Engineering Summer Associate SAP 2012  –  2012  (less than a year) Consultant Accenture June 2006  –  July 2011  (5 years 2 months) Senior Partner Operations Manager Google August 2013  – Present (2 years 1 month) Mountain View, CA Senior Partner Operations Manager Google August 2013  – Present (2 years 1 month) Mountain View, CA Value Engineering Summer Associate SAP 2012  –  2012  (less than a year) Value Engineering Summer Associate SAP 2012  –  2012  (less than a year) Consultant Accenture June 2006  –  July 2011  (5 years 2 months) Consultant Accenture June 2006  –  July 2011  (5 years 2 months) Education Columbia Business School MBA,  Marketing 2011  – 2013 Washington University in St. Louis 2003  – 2006 Columbia Business School MBA,  Marketing 2011  – 2013 Columbia Business School MBA,  Marketing 2011  – 2013 Columbia Business School MBA,  Marketing 2011  – 2013 Washington University in St. Louis 2003  – 2006 Washington University in St. Louis 2003  – 2006 Washington University in St. Louis 2003  – 2006 ", "Summary Strong growth mindset: http://www.brainpickings.org/index.php/2014/01/29/carol-dweck-mindset/ \n \nStrengths: Strategy & Innovation, Business Model Definition, Leadership, Start-Up's, General Management, Financial Management, Business Operations, Sales Operations, Sales, Business Development, Business Process Outsourcing, Team Building, Relationship Management, Coaching, EMEA Sales, Sales Organisation, Multi-Lingual, Controllership, Shared Service Centre, Finance Functions, Centralisation, Monthly Management Accounts, Cost Base, Call Centres, Sales Ops, Global Leader, GAAP Summary Strong growth mindset: http://www.brainpickings.org/index.php/2014/01/29/carol-dweck-mindset/ \n \nStrengths: Strategy & Innovation, Business Model Definition, Leadership, Start-Up's, General Management, Financial Management, Business Operations, Sales Operations, Sales, Business Development, Business Process Outsourcing, Team Building, Relationship Management, Coaching, EMEA Sales, Sales Organisation, Multi-Lingual, Controllership, Shared Service Centre, Finance Functions, Centralisation, Monthly Management Accounts, Cost Base, Call Centres, Sales Ops, Global Leader, GAAP Strong growth mindset: http://www.brainpickings.org/index.php/2014/01/29/carol-dweck-mindset/ \n \nStrengths: Strategy & Innovation, Business Model Definition, Leadership, Start-Up's, General Management, Financial Management, Business Operations, Sales Operations, Sales, Business Development, Business Process Outsourcing, Team Building, Relationship Management, Coaching, EMEA Sales, Sales Organisation, Multi-Lingual, Controllership, Shared Service Centre, Finance Functions, Centralisation, Monthly Management Accounts, Cost Base, Call Centres, Sales Ops, Global Leader, GAAP Strong growth mindset: http://www.brainpickings.org/index.php/2014/01/29/carol-dweck-mindset/ \n \nStrengths: Strategy & Innovation, Business Model Definition, Leadership, Start-Up's, General Management, Financial Management, Business Operations, Sales Operations, Sales, Business Development, Business Process Outsourcing, Team Building, Relationship Management, Coaching, EMEA Sales, Sales Organisation, Multi-Lingual, Controllership, Shared Service Centre, Finance Functions, Centralisation, Monthly Management Accounts, Cost Base, Call Centres, Sales Ops, Global Leader, GAAP Experience EMEIA Senior Partner Operations Manager, AppleCare Apple December 2014  – Present (9 months) Ireland Director Of Operations Voxpro October 2013  –  November 2014  (1 year 2 months) Ireland Responsibility for leading the operations of Voxpro Communications - a 500 person BPO and Contact Centre Company serving iconic technology brands such as Google, Nest & Airbnb, and many more. - delivering world class multi-lingual technical support and customer service solutions to international customers. GM EMEA, Director Global Business Operations - Consumer Business Unit Trend Micro July 2011  –  March 2013  (1 year 9 months) Ireland Led Trend Micro's Consumer Business in Europe - P&L accountability, Sales, Marketing, Product Marketing, e-Commerce, R&D & Operations. Also led Global Business Operations, focussing on strategy development, product innovation and business model definition. Sales Operations Director EMEA (Volume Business Unit) Trend Micro January 2010  –  June 2011  (1 year 6 months) Ireland Led Sales Operations for the 'start-up' EMEA Volume Business Unit within Trend Micro, incorporating renewal sales teams, telesales operations, consumer business unit & volume distribution. Role included planning, p&l management, compensation design & management, commercial deal oversight. Finance Director EMEA Trend Micro March 2009  –  January 2010  (11 months) Ireland Finance Business partner to EMEA Leadership team with responsibility for P&L management, planning and forecasting cycles and leading finance operations - Financial Reporting, FP&A, Receivables, Payables, Treasury, Payroll, Customer Service & Order Management, Logistics and Compliance. Managing Director, European Operations Centre Trend Micro October 2005  –  January 2010  (4 years 4 months) Ireland Responsibility for the strategic planning and development of scale and capabilities of Trend Micros' 200 person European Operations Headquarters. Partnered closely with agencies such as IDA Ireland and executive level Trend Micro Management on strategic development. Led a diverse team in Finance, Operations, Renewal Sales, Telesales, Technical Support, IT/IS, Project Management & HR. Operations Director EMEA Trend Micro December 2007  –  March 2009  (1 year 4 months) Ireland Project Manager on high impact initiatives across the EMEA region requiring significant change management and 'buy in' across the EMEA region. Projects ranged from facilities to tax restructuring. Financial Controller EMEA Trend Micro June 2004  –  December 2007  (3 years 7 months) Ireland Corporate Controller for the EMEA region with responsibility for Finance & Accounting functions - General Ledger, Receivables, Payables, Compliance, Treasury, Payroll, Audit and development agency engagement. Accounting Manager, Northern Europe Black & Decker 2002  –  2004  (2 years) Ireland Managed the accounting, control & financial reporting for 34 EMEA sales, marketing and corporate business units, including leadership of a multi-national team of qualified and part qualified accountants. Finance Specialist, UK & Ireland Black & Decker 2000  –  2002  (2 years) Ireland Financial Accounting Manager for the Irish, UK, European HQ and Tax Entities, with responsibility for accounting, control, reporting and accounts payable for the region. Financial Accountant Vantage Wholeslae 1999  –  2000  (1 year) Corporate Finance Horwath Bastow Charleton 1998  –  1998  (less than a year) Audit Senior Buckley & Co 1994  –  1998  (4 years) EMEIA Senior Partner Operations Manager, AppleCare Apple December 2014  – Present (9 months) Ireland EMEIA Senior Partner Operations Manager, AppleCare Apple December 2014  – Present (9 months) Ireland Director Of Operations Voxpro October 2013  –  November 2014  (1 year 2 months) Ireland Responsibility for leading the operations of Voxpro Communications - a 500 person BPO and Contact Centre Company serving iconic technology brands such as Google, Nest & Airbnb, and many more. - delivering world class multi-lingual technical support and customer service solutions to international customers. Director Of Operations Voxpro October 2013  –  November 2014  (1 year 2 months) Ireland Responsibility for leading the operations of Voxpro Communications - a 500 person BPO and Contact Centre Company serving iconic technology brands such as Google, Nest & Airbnb, and many more. - delivering world class multi-lingual technical support and customer service solutions to international customers. GM EMEA, Director Global Business Operations - Consumer Business Unit Trend Micro July 2011  –  March 2013  (1 year 9 months) Ireland Led Trend Micro's Consumer Business in Europe - P&L accountability, Sales, Marketing, Product Marketing, e-Commerce, R&D & Operations. Also led Global Business Operations, focussing on strategy development, product innovation and business model definition. GM EMEA, Director Global Business Operations - Consumer Business Unit Trend Micro July 2011  –  March 2013  (1 year 9 months) Ireland Led Trend Micro's Consumer Business in Europe - P&L accountability, Sales, Marketing, Product Marketing, e-Commerce, R&D & Operations. Also led Global Business Operations, focussing on strategy development, product innovation and business model definition. Sales Operations Director EMEA (Volume Business Unit) Trend Micro January 2010  –  June 2011  (1 year 6 months) Ireland Led Sales Operations for the 'start-up' EMEA Volume Business Unit within Trend Micro, incorporating renewal sales teams, telesales operations, consumer business unit & volume distribution. Role included planning, p&l management, compensation design & management, commercial deal oversight. Sales Operations Director EMEA (Volume Business Unit) Trend Micro January 2010  –  June 2011  (1 year 6 months) Ireland Led Sales Operations for the 'start-up' EMEA Volume Business Unit within Trend Micro, incorporating renewal sales teams, telesales operations, consumer business unit & volume distribution. Role included planning, p&l management, compensation design & management, commercial deal oversight. Finance Director EMEA Trend Micro March 2009  –  January 2010  (11 months) Ireland Finance Business partner to EMEA Leadership team with responsibility for P&L management, planning and forecasting cycles and leading finance operations - Financial Reporting, FP&A, Receivables, Payables, Treasury, Payroll, Customer Service & Order Management, Logistics and Compliance. Finance Director EMEA Trend Micro March 2009  –  January 2010  (11 months) Ireland Finance Business partner to EMEA Leadership team with responsibility for P&L management, planning and forecasting cycles and leading finance operations - Financial Reporting, FP&A, Receivables, Payables, Treasury, Payroll, Customer Service & Order Management, Logistics and Compliance. Managing Director, European Operations Centre Trend Micro October 2005  –  January 2010  (4 years 4 months) Ireland Responsibility for the strategic planning and development of scale and capabilities of Trend Micros' 200 person European Operations Headquarters. Partnered closely with agencies such as IDA Ireland and executive level Trend Micro Management on strategic development. Led a diverse team in Finance, Operations, Renewal Sales, Telesales, Technical Support, IT/IS, Project Management & HR. Managing Director, European Operations Centre Trend Micro October 2005  –  January 2010  (4 years 4 months) Ireland Responsibility for the strategic planning and development of scale and capabilities of Trend Micros' 200 person European Operations Headquarters. Partnered closely with agencies such as IDA Ireland and executive level Trend Micro Management on strategic development. Led a diverse team in Finance, Operations, Renewal Sales, Telesales, Technical Support, IT/IS, Project Management & HR. Operations Director EMEA Trend Micro December 2007  –  March 2009  (1 year 4 months) Ireland Project Manager on high impact initiatives across the EMEA region requiring significant change management and 'buy in' across the EMEA region. Projects ranged from facilities to tax restructuring. Operations Director EMEA Trend Micro December 2007  –  March 2009  (1 year 4 months) Ireland Project Manager on high impact initiatives across the EMEA region requiring significant change management and 'buy in' across the EMEA region. Projects ranged from facilities to tax restructuring. Financial Controller EMEA Trend Micro June 2004  –  December 2007  (3 years 7 months) Ireland Corporate Controller for the EMEA region with responsibility for Finance & Accounting functions - General Ledger, Receivables, Payables, Compliance, Treasury, Payroll, Audit and development agency engagement. Financial Controller EMEA Trend Micro June 2004  –  December 2007  (3 years 7 months) Ireland Corporate Controller for the EMEA region with responsibility for Finance & Accounting functions - General Ledger, Receivables, Payables, Compliance, Treasury, Payroll, Audit and development agency engagement. Accounting Manager, Northern Europe Black & Decker 2002  –  2004  (2 years) Ireland Managed the accounting, control & financial reporting for 34 EMEA sales, marketing and corporate business units, including leadership of a multi-national team of qualified and part qualified accountants. Accounting Manager, Northern Europe Black & Decker 2002  –  2004  (2 years) Ireland Managed the accounting, control & financial reporting for 34 EMEA sales, marketing and corporate business units, including leadership of a multi-national team of qualified and part qualified accountants. Finance Specialist, UK & Ireland Black & Decker 2000  –  2002  (2 years) Ireland Financial Accounting Manager for the Irish, UK, European HQ and Tax Entities, with responsibility for accounting, control, reporting and accounts payable for the region. Finance Specialist, UK & Ireland Black & Decker 2000  –  2002  (2 years) Ireland Financial Accounting Manager for the Irish, UK, European HQ and Tax Entities, with responsibility for accounting, control, reporting and accounts payable for the region. Financial Accountant Vantage Wholeslae 1999  –  2000  (1 year) Financial Accountant Vantage Wholeslae 1999  –  2000  (1 year) Corporate Finance Horwath Bastow Charleton 1998  –  1998  (less than a year) Corporate Finance Horwath Bastow Charleton 1998  –  1998  (less than a year) Audit Senior Buckley & Co 1994  –  1998  (4 years) Audit Senior Buckley & Co 1994  –  1998  (4 years) Languages English Native or bilingual proficiency Gaelic Limited working proficiency English Native or bilingual proficiency Gaelic Limited working proficiency English Native or bilingual proficiency Gaelic Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Revenue Recognition Sarbanes-Oxley Act Financial Reporting Accounting Forecasting E-commerce Financial Analysis Financial Audits Internal Controls US GAAP Hyperion Enterprise Business Planning Business Modeling Business Strategy Business Analysis New Business Development Strategic Planning Marketing Strategy Strategic Financial... Leadership Team Leadership Cloud Computing Cloud Security SaaS Consumer Products Operations Management Sales Operations Managerial Finance Start-ups Business Development Solution Selling Account Management Enterprise Software Go-to-market Strategy Management Finance Strategy Channel Partners Corporate Finance Executive Management EMEA Business Process... Cross-functional Team... Mergers & Acquisitions Team Building Process Improvement Strategic Partnerships Competitive Analysis Outsourcing ERP See 35+     See less Skills  Revenue Recognition Sarbanes-Oxley Act Financial Reporting Accounting Forecasting E-commerce Financial Analysis Financial Audits Internal Controls US GAAP Hyperion Enterprise Business Planning Business Modeling Business Strategy Business Analysis New Business Development Strategic Planning Marketing Strategy Strategic Financial... Leadership Team Leadership Cloud Computing Cloud Security SaaS Consumer Products Operations Management Sales Operations Managerial Finance Start-ups Business Development Solution Selling Account Management Enterprise Software Go-to-market Strategy Management Finance Strategy Channel Partners Corporate Finance Executive Management EMEA Business Process... Cross-functional Team... Mergers & Acquisitions Team Building Process Improvement Strategic Partnerships Competitive Analysis Outsourcing ERP See 35+     See less Revenue Recognition Sarbanes-Oxley Act Financial Reporting Accounting Forecasting E-commerce Financial Analysis Financial Audits Internal Controls US GAAP Hyperion Enterprise Business Planning Business Modeling Business Strategy Business Analysis New Business Development Strategic Planning Marketing Strategy Strategic Financial... Leadership Team Leadership Cloud Computing Cloud Security SaaS Consumer Products Operations Management Sales Operations Managerial Finance Start-ups Business Development Solution Selling Account Management Enterprise Software Go-to-market Strategy Management Finance Strategy Channel Partners Corporate Finance Executive Management EMEA Business Process... Cross-functional Team... Mergers & Acquisitions Team Building Process Improvement Strategic Partnerships Competitive Analysis Outsourcing ERP See 35+     See less Revenue Recognition Sarbanes-Oxley Act Financial Reporting Accounting Forecasting E-commerce Financial Analysis Financial Audits Internal Controls US GAAP Hyperion Enterprise Business Planning Business Modeling Business Strategy Business Analysis New Business Development Strategic Planning Marketing Strategy Strategic Financial... Leadership Team Leadership Cloud Computing Cloud Security SaaS Consumer Products Operations Management Sales Operations Managerial Finance Start-ups Business Development Solution Selling Account Management Enterprise Software Go-to-market Strategy Management Finance Strategy Channel Partners Corporate Finance Executive Management EMEA Business Process... Cross-functional Team... Mergers & Acquisitions Team Building Process Improvement Strategic Partnerships Competitive Analysis Outsourcing ERP See 35+     See less Education Association of Chartered Certified Accountants Fellow of the Association of Chartered Certified Accountants,  Accountancy 1991  – 1997 CIT FCCA,  Accounting 1991  – 1994 Cork Institute of Technology 1991  – 1994 Association of Chartered Certified Accountants Fellow of the Association of Chartered Certified Accountants,  Accountancy 1991  – 1997 Association of Chartered Certified Accountants Fellow of the Association of Chartered Certified Accountants,  Accountancy 1991  – 1997 Association of Chartered Certified Accountants Fellow of the Association of Chartered Certified Accountants,  Accountancy 1991  – 1997 CIT FCCA,  Accounting 1991  – 1994 CIT FCCA,  Accounting 1991  – 1994 CIT FCCA,  Accounting 1991  – 1994 Cork Institute of Technology 1991  – 1994 Cork Institute of Technology 1991  – 1994 Cork Institute of Technology 1991  – 1994 ", "Languages German German German Skills Cross-functional Team... Business Development Project Management Pricing Product Development Business Strategy Product Management Strategy Change Management Strategic Planning Management Consulting Market Research Entrepreneurship Business Planning Start-ups Sales Enterprise Software Outsourcing Management Team Management Analytics Go-to-market Strategy Project Planning Product Marketing SaaS Cloud Computing Consulting Competitive Analysis Program Management Marketing See 15+     See less Skills  Cross-functional Team... Business Development Project Management Pricing Product Development Business Strategy Product Management Strategy Change Management Strategic Planning Management Consulting Market Research Entrepreneurship Business Planning Start-ups Sales Enterprise Software Outsourcing Management Team Management Analytics Go-to-market Strategy Project Planning Product Marketing SaaS Cloud Computing Consulting Competitive Analysis Program Management Marketing See 15+     See less Cross-functional Team... Business Development Project Management Pricing Product Development Business Strategy Product Management Strategy Change Management Strategic Planning Management Consulting Market Research Entrepreneurship Business Planning Start-ups Sales Enterprise Software Outsourcing Management Team Management Analytics Go-to-market Strategy Project Planning Product Marketing SaaS Cloud Computing Consulting Competitive Analysis Program Management Marketing See 15+     See less Cross-functional Team... Business Development Project Management Pricing Product Development Business Strategy Product Management Strategy Change Management Strategic Planning Management Consulting Market Research Entrepreneurship Business Planning Start-ups Sales Enterprise Software Outsourcing Management Team Management Analytics Go-to-market Strategy Project Planning Product Marketing SaaS Cloud Computing Consulting Competitive Analysis Program Management Marketing See 15+     See less ", "Skills Cloud Computing Project Management SaaS Enterprise Architecture IT Strategy Enterprise Software Integration SQL Program Management Agile Project Management Business Analysis Linux Google Apps Business Intelligence Software Project... Solution Architecture PaaS See 2+     See less Skills  Cloud Computing Project Management SaaS Enterprise Architecture IT Strategy Enterprise Software Integration SQL Program Management Agile Project Management Business Analysis Linux Google Apps Business Intelligence Software Project... Solution Architecture PaaS See 2+     See less Cloud Computing Project Management SaaS Enterprise Architecture IT Strategy Enterprise Software Integration SQL Program Management Agile Project Management Business Analysis Linux Google Apps Business Intelligence Software Project... Solution Architecture PaaS See 2+     See less Cloud Computing Project Management SaaS Enterprise Architecture IT Strategy Enterprise Software Integration SQL Program Management Agile Project Management Business Analysis Linux Google Apps Business Intelligence Software Project... Solution Architecture PaaS See 2+     See less ", "Experience Director, Digital Marketing Wordbank LLC May 2015  – Present (4 months) Denver CO Director, Digital Marketing Wordbank LLC May 2015  – Present (4 months) Denver CO Director, Digital Marketing Wordbank LLC May 2015  – Present (4 months) Denver CO Skills Skills     ", "Experience Senior Partner Operations Manager Google October 2010  – Present (4 years 11 months) Software Reliability Engineer Medtronic June 2010  –  October 2010  (5 months) Rotational Program Medtronic January 2008  –  June 2010  (2 years 6 months) Software Engineer EDS Group September 2005  –  October 2006  (1 year 2 months) Senior Partner Operations Manager Google October 2010  – Present (4 years 11 months) Senior Partner Operations Manager Google October 2010  – Present (4 years 11 months) Software Reliability Engineer Medtronic June 2010  –  October 2010  (5 months) Software Reliability Engineer Medtronic June 2010  –  October 2010  (5 months) Rotational Program Medtronic January 2008  –  June 2010  (2 years 6 months) Rotational Program Medtronic January 2008  –  June 2010  (2 years 6 months) Software Engineer EDS Group September 2005  –  October 2006  (1 year 2 months) Software Engineer EDS Group September 2005  –  October 2006  (1 year 2 months) Skills Product Management Program Management Cross-functional Team... Enterprise Software Cloud Computing Strategy Product Development Skills  Product Management Program Management Cross-functional Team... Enterprise Software Cloud Computing Strategy Product Development Product Management Program Management Cross-functional Team... Enterprise Software Cloud Computing Strategy Product Development Product Management Program Management Cross-functional Team... Enterprise Software Cloud Computing Strategy Product Development Education Duke University Masters,  Management 2006  – 2008 CMR Institute Of Technology Duke University Masters,  Management 2006  – 2008 Duke University Masters,  Management 2006  – 2008 Duke University Masters,  Management 2006  – 2008 CMR Institute Of Technology CMR Institute Of Technology CMR Institute Of Technology ", "Experience Senior Partner Operations Manager Google October 2012  – Present (2 years 11 months) London, United Kingdom Deployment Project Manager Google May 2010  –  October 2012  (2 years 6 months) Project Manager Microsoft January 2007  –  May 2010  (3 years 5 months) Student Helsinki University of Technology September 2002  –  February 2010  (7 years 6 months) IT Consultant Synocus May 2006  –  August 2006  (4 months) Software developer Accenture May 2005  –  February 2006  (10 months) Senior Partner Operations Manager Google October 2012  – Present (2 years 11 months) London, United Kingdom Senior Partner Operations Manager Google October 2012  – Present (2 years 11 months) London, United Kingdom Deployment Project Manager Google May 2010  –  October 2012  (2 years 6 months) Deployment Project Manager Google May 2010  –  October 2012  (2 years 6 months) Project Manager Microsoft January 2007  –  May 2010  (3 years 5 months) Project Manager Microsoft January 2007  –  May 2010  (3 years 5 months) Student Helsinki University of Technology September 2002  –  February 2010  (7 years 6 months) Student Helsinki University of Technology September 2002  –  February 2010  (7 years 6 months) IT Consultant Synocus May 2006  –  August 2006  (4 months) IT Consultant Synocus May 2006  –  August 2006  (4 months) Software developer Accenture May 2005  –  February 2006  (10 months) Software developer Accenture May 2005  –  February 2006  (10 months) Skills Software Project... Cloud Computing Google Apps Enterprise Software Software Development Product Management Project Management IT Strategy SaaS Mobile Devices Integration Skills  Software Project... Cloud Computing Google Apps Enterprise Software Software Development Product Management Project Management IT Strategy SaaS Mobile Devices Integration Software Project... Cloud Computing Google Apps Enterprise Software Software Development Product Management Project Management IT Strategy SaaS Mobile Devices Integration Software Project... Cloud Computing Google Apps Enterprise Software Software Development Product Management Project Management IT Strategy SaaS Mobile Devices Integration Education Teknillinen korkeakoulu-Tekniska högskolan M. Sc. (Eng),  Industrial Engineering and Management: Project Management 2002  – 2010 Vasa övningsskola Teknillinen korkeakoulu-Tekniska högskolan M. Sc. (Eng),  Industrial Engineering and Management: Project Management 2002  – 2010 Teknillinen korkeakoulu-Tekniska högskolan M. Sc. (Eng),  Industrial Engineering and Management: Project Management 2002  – 2010 Teknillinen korkeakoulu-Tekniska högskolan M. Sc. (Eng),  Industrial Engineering and Management: Project Management 2002  – 2010 Vasa övningsskola Vasa övningsskola Vasa övningsskola ", "Experience Senior Partner Operations Manager T-Mobile January 2013  – Present (2 years 8 months) Bellevue, WA * Team lead for a talented team who’re operationally responsible for Wholesale partners that generate around $750 million of annual incremental revenue for T-Mobile USA, Inc. \n* Helped launch and manage billing platform that now supports 9 Wholesale companies \n* Managed project that automated Number Portability processes & reporting. This initiative resulted in reduction of 24 CSRs & savings of around $800k annually \n* Resident SME for both Network Engineering & IT. Essentially, I provide guidance & propose solutions that are in line with departmental policy and revenue goals while adhering to contractual obligations \n Senior Product Engineer T-Mobile September 2010  –  December 2012  (2 years 4 months) Bellevue, WA *Product ownership from PRD design to post launch management \n*Storefront service enhancement and design work owner  \n*Integrate Billing system with Self Help tools in an effort to empower customers with powerful self-help tools \n*Launched Google Play purchasing capability to control products which increased revenue by 20% \n*Manage Product Certification vendors for T-Mobile \noTrack and report vendor efficiencies \noConduct bimonthly meetings to resolve any production issues \noReview annual vendor performance with business stakeholders \n*Conduct operational management for top tier 3rd party content developers which generate over 20 million dollars per month \n*Third Party Gateway partner on boarding \n*Implemented Service Delivery Gateway system design to improve messaging platform to expand capabilities \n*Credit to the improvements I implemented for the Premium SMS provisioning systems and processes, Marketing (Value Added Services) generates additional increase revenue by 10% \n*Work with internal business partners (IT & Engineering) in an effort to improve customer experience by ensuring IT’s Usage System bills correctly by using the correct metadata Sr. Analyst/Program Manager T-Mobile 2008  –  2010  (2 years) * LNP, Numbering and Billing Systems SME \n* Industry projects \n* Billing Operations Strategy \n \nI was the industry representative for T-Mobile at Industry forums such as LNPA-WG and OBF. These industry platforms was where we developed industry requirements for Number Portability.  \n \nI internally managed LNP Operations for T-Mobile providing services to T-Mobile CARE org and other customer facing internal business customers. Additionally, I managed vendor relationships with Amdocs, NeuStar, Telcordia, and Syniverse Technologies. \n \nIn addition to the above, I managed onsite vendor staff that supported the Numbering & Portability Operations. Systems Analyst T-Mobile 2006  –  2008  (2 years) Bellevue, Wa *Manage Carrier/ WLNP Industry Relations for the WLNP team at T-Mobile \n*Took ownership of WLNP system issues and developed solutions through root cause analysis \n*Project lead for WLNP team testing efforts for Samson billing system upgrades \n*Arranged and conducted shakeout testing for billing upgrade events at T-Mobile with other industry service providers \n*Transitioned WLNP executive reporting responsibilities from former Office of Number Portability with Customer Care to Enterprise IT’s WLNP team \n*Developed and maintained the WLNP team website Project Manager (contractor) Microsoft 2001  –  2005  (4 years) Senior Partner Operations Manager T-Mobile January 2013  – Present (2 years 8 months) Bellevue, WA * Team lead for a talented team who’re operationally responsible for Wholesale partners that generate around $750 million of annual incremental revenue for T-Mobile USA, Inc. \n* Helped launch and manage billing platform that now supports 9 Wholesale companies \n* Managed project that automated Number Portability processes & reporting. This initiative resulted in reduction of 24 CSRs & savings of around $800k annually \n* Resident SME for both Network Engineering & IT. Essentially, I provide guidance & propose solutions that are in line with departmental policy and revenue goals while adhering to contractual obligations \n Senior Partner Operations Manager T-Mobile January 2013  – Present (2 years 8 months) Bellevue, WA * Team lead for a talented team who’re operationally responsible for Wholesale partners that generate around $750 million of annual incremental revenue for T-Mobile USA, Inc. \n* Helped launch and manage billing platform that now supports 9 Wholesale companies \n* Managed project that automated Number Portability processes & reporting. This initiative resulted in reduction of 24 CSRs & savings of around $800k annually \n* Resident SME for both Network Engineering & IT. Essentially, I provide guidance & propose solutions that are in line with departmental policy and revenue goals while adhering to contractual obligations \n Senior Product Engineer T-Mobile September 2010  –  December 2012  (2 years 4 months) Bellevue, WA *Product ownership from PRD design to post launch management \n*Storefront service enhancement and design work owner  \n*Integrate Billing system with Self Help tools in an effort to empower customers with powerful self-help tools \n*Launched Google Play purchasing capability to control products which increased revenue by 20% \n*Manage Product Certification vendors for T-Mobile \noTrack and report vendor efficiencies \noConduct bimonthly meetings to resolve any production issues \noReview annual vendor performance with business stakeholders \n*Conduct operational management for top tier 3rd party content developers which generate over 20 million dollars per month \n*Third Party Gateway partner on boarding \n*Implemented Service Delivery Gateway system design to improve messaging platform to expand capabilities \n*Credit to the improvements I implemented for the Premium SMS provisioning systems and processes, Marketing (Value Added Services) generates additional increase revenue by 10% \n*Work with internal business partners (IT & Engineering) in an effort to improve customer experience by ensuring IT’s Usage System bills correctly by using the correct metadata Senior Product Engineer T-Mobile September 2010  –  December 2012  (2 years 4 months) Bellevue, WA *Product ownership from PRD design to post launch management \n*Storefront service enhancement and design work owner  \n*Integrate Billing system with Self Help tools in an effort to empower customers with powerful self-help tools \n*Launched Google Play purchasing capability to control products which increased revenue by 20% \n*Manage Product Certification vendors for T-Mobile \noTrack and report vendor efficiencies \noConduct bimonthly meetings to resolve any production issues \noReview annual vendor performance with business stakeholders \n*Conduct operational management for top tier 3rd party content developers which generate over 20 million dollars per month \n*Third Party Gateway partner on boarding \n*Implemented Service Delivery Gateway system design to improve messaging platform to expand capabilities \n*Credit to the improvements I implemented for the Premium SMS provisioning systems and processes, Marketing (Value Added Services) generates additional increase revenue by 10% \n*Work with internal business partners (IT & Engineering) in an effort to improve customer experience by ensuring IT’s Usage System bills correctly by using the correct metadata Sr. Analyst/Program Manager T-Mobile 2008  –  2010  (2 years) * LNP, Numbering and Billing Systems SME \n* Industry projects \n* Billing Operations Strategy \n \nI was the industry representative for T-Mobile at Industry forums such as LNPA-WG and OBF. These industry platforms was where we developed industry requirements for Number Portability.  \n \nI internally managed LNP Operations for T-Mobile providing services to T-Mobile CARE org and other customer facing internal business customers. Additionally, I managed vendor relationships with Amdocs, NeuStar, Telcordia, and Syniverse Technologies. \n \nIn addition to the above, I managed onsite vendor staff that supported the Numbering & Portability Operations. Sr. Analyst/Program Manager T-Mobile 2008  –  2010  (2 years) * LNP, Numbering and Billing Systems SME \n* Industry projects \n* Billing Operations Strategy \n \nI was the industry representative for T-Mobile at Industry forums such as LNPA-WG and OBF. These industry platforms was where we developed industry requirements for Number Portability.  \n \nI internally managed LNP Operations for T-Mobile providing services to T-Mobile CARE org and other customer facing internal business customers. Additionally, I managed vendor relationships with Amdocs, NeuStar, Telcordia, and Syniverse Technologies. \n \nIn addition to the above, I managed onsite vendor staff that supported the Numbering & Portability Operations. Systems Analyst T-Mobile 2006  –  2008  (2 years) Bellevue, Wa *Manage Carrier/ WLNP Industry Relations for the WLNP team at T-Mobile \n*Took ownership of WLNP system issues and developed solutions through root cause analysis \n*Project lead for WLNP team testing efforts for Samson billing system upgrades \n*Arranged and conducted shakeout testing for billing upgrade events at T-Mobile with other industry service providers \n*Transitioned WLNP executive reporting responsibilities from former Office of Number Portability with Customer Care to Enterprise IT’s WLNP team \n*Developed and maintained the WLNP team website Systems Analyst T-Mobile 2006  –  2008  (2 years) Bellevue, Wa *Manage Carrier/ WLNP Industry Relations for the WLNP team at T-Mobile \n*Took ownership of WLNP system issues and developed solutions through root cause analysis \n*Project lead for WLNP team testing efforts for Samson billing system upgrades \n*Arranged and conducted shakeout testing for billing upgrade events at T-Mobile with other industry service providers \n*Transitioned WLNP executive reporting responsibilities from former Office of Number Portability with Customer Care to Enterprise IT’s WLNP team \n*Developed and maintained the WLNP team website Project Manager (contractor) Microsoft 2001  –  2005  (4 years) Project Manager (contractor) Microsoft 2001  –  2005  (4 years) Languages Somali Native or bilingual proficiency Arabic Full professional proficiency Somali Native or bilingual proficiency Arabic Full professional proficiency Somali Native or bilingual proficiency Arabic Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Product Development Program Management Operations Management Project Portfolio... Systems Engineering Contract Negotiation Requirements Analysis Testing Vendor Relations Billing Systems Product Management Product Requirements Vendor Management SDLC Mobile Telecommunications Systems Analysis Wireless Cross-functional Team... Business Analysis Product Strategy Solution Architecture Project Planning Competitive Analysis Team Leadership Process Improvement VAS Documentation Deployment Product Launch Requirements Management Process Development Contract Negotiations ITIL Product Life Cycle... Mobile Technology Mobile Applications Agile Methodologies Requirements Gathering Partner Management Product Planning Mobile Devices Enterprise Software Project Management See 29+     See less Skills  Product Development Program Management Operations Management Project Portfolio... Systems Engineering Contract Negotiation Requirements Analysis Testing Vendor Relations Billing Systems Product Management Product Requirements Vendor Management SDLC Mobile Telecommunications Systems Analysis Wireless Cross-functional Team... Business Analysis Product Strategy Solution Architecture Project Planning Competitive Analysis Team Leadership Process Improvement VAS Documentation Deployment Product Launch Requirements Management Process Development Contract Negotiations ITIL Product Life Cycle... Mobile Technology Mobile Applications Agile Methodologies Requirements Gathering Partner Management Product Planning Mobile Devices Enterprise Software Project Management See 29+     See less Product Development Program Management Operations Management Project Portfolio... Systems Engineering Contract Negotiation Requirements Analysis Testing Vendor Relations Billing Systems Product Management Product Requirements Vendor Management SDLC Mobile Telecommunications Systems Analysis Wireless Cross-functional Team... Business Analysis Product Strategy Solution Architecture Project Planning Competitive Analysis Team Leadership Process Improvement VAS Documentation Deployment Product Launch Requirements Management Process Development Contract Negotiations ITIL Product Life Cycle... Mobile Technology Mobile Applications Agile Methodologies Requirements Gathering Partner Management Product Planning Mobile Devices Enterprise Software Project Management See 29+     See less Product Development Program Management Operations Management Project Portfolio... Systems Engineering Contract Negotiation Requirements Analysis Testing Vendor Relations Billing Systems Product Management Product Requirements Vendor Management SDLC Mobile Telecommunications Systems Analysis Wireless Cross-functional Team... Business Analysis Product Strategy Solution Architecture Project Planning Competitive Analysis Team Leadership Process Improvement VAS Documentation Deployment Product Launch Requirements Management Process Development Contract Negotiations ITIL Product Life Cycle... Mobile Technology Mobile Applications Agile Methodologies Requirements Gathering Partner Management Product Planning Mobile Devices Enterprise Software Project Management See 29+     See less Honors & Awards Winner's Circle January 2014 Winner's Circle September 2014 2013 MVNO Product Operations Monster Award MVNO Product Operations Team June 2013 Winner's Circle January 2014 Winner's Circle January 2014 Winner's Circle January 2014 Winner's Circle September 2014 Winner's Circle September 2014 Winner's Circle September 2014 2013 MVNO Product Operations Monster Award MVNO Product Operations Team June 2013 2013 MVNO Product Operations Monster Award MVNO Product Operations Team June 2013 2013 MVNO Product Operations Monster Award MVNO Product Operations Team June 2013 "]}