{"position": "Policy Manager", "company": "Google", "profiles": ["Summary Develop and lead public policy and communications campaigns across a range of policy areas that impact Google and the web, including cybersecurity, surveillance, competition, and infrastructure and energy issues. Summary Develop and lead public policy and communications campaigns across a range of policy areas that impact Google and the web, including cybersecurity, surveillance, competition, and infrastructure and energy issues. Develop and lead public policy and communications campaigns across a range of policy areas that impact Google and the web, including cybersecurity, surveillance, competition, and infrastructure and energy issues. Develop and lead public policy and communications campaigns across a range of policy areas that impact Google and the web, including cybersecurity, surveillance, competition, and infrastructure and energy issues. Experience Public Policy Manager Google November 2014  – Present (10 months) Mountain View, CA Corporate Communications Manager, Policy Google September 2011  –  November 2014  (3 years 3 months) Mountain View, CA Special Assistant, Policy & International Affairs U.S. Department of Energy May 2009  –  July 2011  (2 years 3 months) Washington, DC Energy & Environment Research Assistant The Brookings Institution August 2008  –  May 2009  (10 months) Washington, DC Public Policy Manager Google November 2014  – Present (10 months) Mountain View, CA Public Policy Manager Google November 2014  – Present (10 months) Mountain View, CA Corporate Communications Manager, Policy Google September 2011  –  November 2014  (3 years 3 months) Mountain View, CA Corporate Communications Manager, Policy Google September 2011  –  November 2014  (3 years 3 months) Mountain View, CA Special Assistant, Policy & International Affairs U.S. Department of Energy May 2009  –  July 2011  (2 years 3 months) Washington, DC Special Assistant, Policy & International Affairs U.S. Department of Energy May 2009  –  July 2011  (2 years 3 months) Washington, DC Energy & Environment Research Assistant The Brookings Institution August 2008  –  May 2009  (10 months) Washington, DC Energy & Environment Research Assistant The Brookings Institution August 2008  –  May 2009  (10 months) Washington, DC Languages French French French Skills Speech Writing Policy Analysis Public Policy Energy Policy Corporate Communications Data Analysis Technology Policy Internet Policy Skills  Speech Writing Policy Analysis Public Policy Energy Policy Corporate Communications Data Analysis Technology Policy Internet Policy Speech Writing Policy Analysis Public Policy Energy Policy Corporate Communications Data Analysis Technology Policy Internet Policy Speech Writing Policy Analysis Public Policy Energy Policy Corporate Communications Data Analysis Technology Policy Internet Policy Education Georgetown University B.S. in Foreign Service,  Science , Technology and International Affairs 2004  – 2008 Georgetown University B.S. in Foreign Service,  Science , Technology and International Affairs 2004  – 2008 Georgetown University B.S. in Foreign Service,  Science , Technology and International Affairs 2004  – 2008 Georgetown University B.S. in Foreign Service,  Science , Technology and International Affairs 2004  – 2008 ", "Summary Specialties:Internet, Telecommunications, Media, Competition Law Summary Specialties:Internet, Telecommunications, Media, Competition Law Specialties:Internet, Telecommunications, Media, Competition Law Specialties:Internet, Telecommunications, Media, Competition Law Skills Telecommunications Public Policy Competition Law Corporate Law International Law Intellectual Property European Union Legal Assistance Strategic Planning IT law Privacy Law Business Strategy Corporate Governance Cyberlaw Copyright Law Mergers & Acquisitions Data Privacy Licensing Due Diligence European Law Legal Advice International Relations Contract Negotiation Strategy Consumer Law See 10+     See less Skills  Telecommunications Public Policy Competition Law Corporate Law International Law Intellectual Property European Union Legal Assistance Strategic Planning IT law Privacy Law Business Strategy Corporate Governance Cyberlaw Copyright Law Mergers & Acquisitions Data Privacy Licensing Due Diligence European Law Legal Advice International Relations Contract Negotiation Strategy Consumer Law See 10+     See less Telecommunications Public Policy Competition Law Corporate Law International Law Intellectual Property European Union Legal Assistance Strategic Planning IT law Privacy Law Business Strategy Corporate Governance Cyberlaw Copyright Law Mergers & Acquisitions Data Privacy Licensing Due Diligence European Law Legal Advice International Relations Contract Negotiation Strategy Consumer Law See 10+     See less Telecommunications Public Policy Competition Law Corporate Law International Law Intellectual Property European Union Legal Assistance Strategic Planning IT law Privacy Law Business Strategy Corporate Governance Cyberlaw Copyright Law Mergers & Acquisitions Data Privacy Licensing Due Diligence European Law Legal Advice International Relations Contract Negotiation Strategy Consumer Law See 10+     See less ", "Summary Thought leader in digital Security, Safety, and user Trust, with 15 years of experience. Experience in product management, product and ads policy management, program management, developing education, investigation, threat response and prevention/detection programs. Frequent industry speaker. Founded Google's Anti-Malvertising Team. Founded Google's Trust & Safety Team. Co-author of 3 security-related patents. Board member, National Cyber Security Alliance. Experience prior to Google includes international trust and safety product management at eBay, and international product expansion at Netscape. \n \nSpecialties: Product Management, Program Management, Mobile Security, User Trust & Safety, Ads and Product Policy, Public Policy, Industry Relations, Anti-\"Malvertising\" (installation of malware via ads) Summary Thought leader in digital Security, Safety, and user Trust, with 15 years of experience. Experience in product management, product and ads policy management, program management, developing education, investigation, threat response and prevention/detection programs. Frequent industry speaker. Founded Google's Anti-Malvertising Team. Founded Google's Trust & Safety Team. Co-author of 3 security-related patents. Board member, National Cyber Security Alliance. Experience prior to Google includes international trust and safety product management at eBay, and international product expansion at Netscape. \n \nSpecialties: Product Management, Program Management, Mobile Security, User Trust & Safety, Ads and Product Policy, Public Policy, Industry Relations, Anti-\"Malvertising\" (installation of malware via ads) Thought leader in digital Security, Safety, and user Trust, with 15 years of experience. Experience in product management, product and ads policy management, program management, developing education, investigation, threat response and prevention/detection programs. Frequent industry speaker. Founded Google's Anti-Malvertising Team. Founded Google's Trust & Safety Team. Co-author of 3 security-related patents. Board member, National Cyber Security Alliance. Experience prior to Google includes international trust and safety product management at eBay, and international product expansion at Netscape. \n \nSpecialties: Product Management, Program Management, Mobile Security, User Trust & Safety, Ads and Product Policy, Public Policy, Industry Relations, Anti-\"Malvertising\" (installation of malware via ads) Thought leader in digital Security, Safety, and user Trust, with 15 years of experience. Experience in product management, product and ads policy management, program management, developing education, investigation, threat response and prevention/detection programs. Frequent industry speaker. Founded Google's Anti-Malvertising Team. Founded Google's Trust & Safety Team. Co-author of 3 security-related patents. Board member, National Cyber Security Alliance. Experience prior to Google includes international trust and safety product management at eBay, and international product expansion at Netscape. \n \nSpecialties: Product Management, Program Management, Mobile Security, User Trust & Safety, Ads and Product Policy, Public Policy, Industry Relations, Anti-\"Malvertising\" (installation of malware via ads) Experience Senior PM, Android Security Team Google April 2013  – Present (2 years 5 months) Member, Board of Directors M3AAWG (Messaging Anti-Abuse Working Group) April 2012  – Present (3 years 5 months) Member, Board of Directors StopBadware 2012  – Present (3 years) Member, Executive Board National Cyber Security Alliance August 2009  – Present (6 years 1 month) Senior PM, Android Security Team Google April 2013  – Present (2 years 5 months) Senior PM, Android Security Team Google April 2013  – Present (2 years 5 months) Member, Board of Directors M3AAWG (Messaging Anti-Abuse Working Group) April 2012  – Present (3 years 5 months) Member, Board of Directors M3AAWG (Messaging Anti-Abuse Working Group) April 2012  – Present (3 years 5 months) Member, Board of Directors StopBadware 2012  – Present (3 years) Member, Board of Directors StopBadware 2012  – Present (3 years) Member, Executive Board National Cyber Security Alliance August 2009  – Present (6 years 1 month) Member, Executive Board National Cyber Security Alliance August 2009  – Present (6 years 1 month) Skills Product Management Security Public Policy Start-ups Program Management Strategic Planning Privacy Law Policy Government Analytics Strategic Partnerships Strategy Computer Security Product Policy Mobile Security Ads Policy Industry Relations Anti-Malvertising Soylent Green Mergers & Acquisitions Corporate Communications Media Relations Leadership Executive Management See 9+     See less Skills  Product Management Security Public Policy Start-ups Program Management Strategic Planning Privacy Law Policy Government Analytics Strategic Partnerships Strategy Computer Security Product Policy Mobile Security Ads Policy Industry Relations Anti-Malvertising Soylent Green Mergers & Acquisitions Corporate Communications Media Relations Leadership Executive Management See 9+     See less Product Management Security Public Policy Start-ups Program Management Strategic Planning Privacy Law Policy Government Analytics Strategic Partnerships Strategy Computer Security Product Policy Mobile Security Ads Policy Industry Relations Anti-Malvertising Soylent Green Mergers & Acquisitions Corporate Communications Media Relations Leadership Executive Management See 9+     See less Product Management Security Public Policy Start-ups Program Management Strategic Planning Privacy Law Policy Government Analytics Strategic Partnerships Strategy Computer Security Product Policy Mobile Security Ads Policy Industry Relations Anti-Malvertising Soylent Green Mergers & Acquisitions Corporate Communications Media Relations Leadership Executive Management See 9+     See less ", "Languages English Full professional proficiency French Native or bilingual proficiency Greek Native or bilingual proficiency Dutch Limited working proficiency English Full professional proficiency French Native or bilingual proficiency Greek Native or bilingual proficiency Dutch Limited working proficiency English Full professional proficiency French Native or bilingual proficiency Greek Native or bilingual proficiency Dutch Limited working proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills European Union Intellectual Property Public Policy Legal Writing Corporate Law Data Privacy Privacy Law European politics European Law EU Law Policy Copyright Law Human Rights Politics European Politics Consumer Law Legal Advice Policy Analysis International Relations See 4+     See less Skills  European Union Intellectual Property Public Policy Legal Writing Corporate Law Data Privacy Privacy Law European politics European Law EU Law Policy Copyright Law Human Rights Politics European Politics Consumer Law Legal Advice Policy Analysis International Relations See 4+     See less European Union Intellectual Property Public Policy Legal Writing Corporate Law Data Privacy Privacy Law European politics European Law EU Law Policy Copyright Law Human Rights Politics European Politics Consumer Law Legal Advice Policy Analysis International Relations See 4+     See less European Union Intellectual Property Public Policy Legal Writing Corporate Law Data Privacy Privacy Law European politics European Law EU Law Policy Copyright Law Human Rights Politics European Politics Consumer Law Legal Advice Policy Analysis International Relations See 4+     See less ", "Experience Community Affairs & Public Policy Manager Google March 2013  – Present (2 years 6 months) Greater Boston Area Large Customer Sales Google January 2010  –  February 2013  (3 years 2 months) Corporate Project Assistant Wandrian, Inc. August 2008  –  April 2009  (9 months) Director of Operations George Washington University July 2006  –  July 2008  (2 years 1 month) Legislative Correspondent US Senate August 2005  –  July 2006  (1 year) Community Affairs & Public Policy Manager Google March 2013  – Present (2 years 6 months) Greater Boston Area Community Affairs & Public Policy Manager Google March 2013  – Present (2 years 6 months) Greater Boston Area Large Customer Sales Google January 2010  –  February 2013  (3 years 2 months) Large Customer Sales Google January 2010  –  February 2013  (3 years 2 months) Corporate Project Assistant Wandrian, Inc. August 2008  –  April 2009  (9 months) Corporate Project Assistant Wandrian, Inc. August 2008  –  April 2009  (9 months) Director of Operations George Washington University July 2006  –  July 2008  (2 years 1 month) Director of Operations George Washington University July 2006  –  July 2008  (2 years 1 month) Legislative Correspondent US Senate August 2005  –  July 2006  (1 year) Legislative Correspondent US Senate August 2005  –  July 2006  (1 year) Skills Google Adwords Social Media Google Analytics Research Event Planning Digital Marketing Strategic Planning Business Strategy Microsoft Office Online Advertising Social Media Marketing Data Analysis Marketing Strategy Skills  Google Adwords Social Media Google Analytics Research Event Planning Digital Marketing Strategic Planning Business Strategy Microsoft Office Online Advertising Social Media Marketing Data Analysis Marketing Strategy Google Adwords Social Media Google Analytics Research Event Planning Digital Marketing Strategic Planning Business Strategy Microsoft Office Online Advertising Social Media Marketing Data Analysis Marketing Strategy Google Adwords Social Media Google Analytics Research Event Planning Digital Marketing Strategic Planning Business Strategy Microsoft Office Online Advertising Social Media Marketing Data Analysis Marketing Strategy Education The George Washington University - School of Business Master of Business Administration 2006  – 2008 The George Washington University Bachelor of Arts,  Criminal Justice ,  Religion 2001  – 2005 The George Washington University - School of Business Master of Business Administration 2006  – 2008 The George Washington University - School of Business Master of Business Administration 2006  – 2008 The George Washington University - School of Business Master of Business Administration 2006  – 2008 The George Washington University Bachelor of Arts,  Criminal Justice ,  Religion 2001  – 2005 The George Washington University Bachelor of Arts,  Criminal Justice ,  Religion 2001  – 2005 The George Washington University Bachelor of Arts,  Criminal Justice ,  Religion 2001  – 2005 ", "Experience Trustee San Jose Evergreen Community College District December 2012  – Present (2 years 9 months) Advocacy & Public Policy Program Manager United Way Silicon Valley February 2012  – Present (3 years 7 months) San Jose Research & Policy Analyst Asian & Pacific Islander American Health Forum November 2010  –  February 2012  (1 year 4 months) State Policy Analyst Asian & Pacific Islander American Health Forum July 2008  –  November 2010  (2 years 5 months) Asian Pacific American Institute for Congressional Studies Fellow Office of Congressman Mike Honda - United States House of Representatives August 2007  –  June 2008  (11 months) Graduate Assistant/Student Outreach Coordinator Indiana University Bloomington - Asian Culture Center August 2006  –  May 2007  (10 months) Analyst Intern Government Accountability Office (GAO) May 2006  –  August 2006  (4 months) Graduate Assistant to Dr. Rafael Reuveny Indiana University Bloomington - School of Public and Environmental Affairs August 2005  –  May 2006  (10 months) Assistant Language Teacher Takasago City Board of Education July 2003  –  July 2005  (2 years 1 month) Student Assistant UCSD Governmental and Community Relations 2000  –  2003  (3 years) Trustee San Jose Evergreen Community College District December 2012  – Present (2 years 9 months) Trustee San Jose Evergreen Community College District December 2012  – Present (2 years 9 months) Advocacy & Public Policy Program Manager United Way Silicon Valley February 2012  – Present (3 years 7 months) San Jose Advocacy & Public Policy Program Manager United Way Silicon Valley February 2012  – Present (3 years 7 months) San Jose Research & Policy Analyst Asian & Pacific Islander American Health Forum November 2010  –  February 2012  (1 year 4 months) Research & Policy Analyst Asian & Pacific Islander American Health Forum November 2010  –  February 2012  (1 year 4 months) State Policy Analyst Asian & Pacific Islander American Health Forum July 2008  –  November 2010  (2 years 5 months) State Policy Analyst Asian & Pacific Islander American Health Forum July 2008  –  November 2010  (2 years 5 months) Asian Pacific American Institute for Congressional Studies Fellow Office of Congressman Mike Honda - United States House of Representatives August 2007  –  June 2008  (11 months) Asian Pacific American Institute for Congressional Studies Fellow Office of Congressman Mike Honda - United States House of Representatives August 2007  –  June 2008  (11 months) Graduate Assistant/Student Outreach Coordinator Indiana University Bloomington - Asian Culture Center August 2006  –  May 2007  (10 months) Graduate Assistant/Student Outreach Coordinator Indiana University Bloomington - Asian Culture Center August 2006  –  May 2007  (10 months) Analyst Intern Government Accountability Office (GAO) May 2006  –  August 2006  (4 months) Analyst Intern Government Accountability Office (GAO) May 2006  –  August 2006  (4 months) Graduate Assistant to Dr. Rafael Reuveny Indiana University Bloomington - School of Public and Environmental Affairs August 2005  –  May 2006  (10 months) Graduate Assistant to Dr. Rafael Reuveny Indiana University Bloomington - School of Public and Environmental Affairs August 2005  –  May 2006  (10 months) Assistant Language Teacher Takasago City Board of Education July 2003  –  July 2005  (2 years 1 month) Assistant Language Teacher Takasago City Board of Education July 2003  –  July 2005  (2 years 1 month) Student Assistant UCSD Governmental and Community Relations 2000  –  2003  (3 years) Student Assistant UCSD Governmental and Community Relations 2000  –  2003  (3 years) Languages Japanese Japanese Japanese Skills Public Policy Research Public Relations Policy Analysis Community Outreach Grant Writing Non-profits Public Speaking Qualitative Research Public Health Event Planning Social Media Volunteer Management Program Development Grants Strategic Communications Community Organizing Policy Editing Community Development Data Analysis Political Campaigns Politics Fundraising Government International Relations International... Higher Education Program Evaluation Capacity Building Proposal Writing Philanthropy Program Management Media Relations Event Management Coalitions Grassroots Organizing Legislative Relations Organizational... Human Rights Political Science Legislation Speech Writing Economic Development Legislative Affairs Health Policy Political Communication Nonprofits Community Engagement Political Consulting See 35+     See less Skills  Public Policy Research Public Relations Policy Analysis Community Outreach Grant Writing Non-profits Public Speaking Qualitative Research Public Health Event Planning Social Media Volunteer Management Program Development Grants Strategic Communications Community Organizing Policy Editing Community Development Data Analysis Political Campaigns Politics Fundraising Government International Relations International... Higher Education Program Evaluation Capacity Building Proposal Writing Philanthropy Program Management Media Relations Event Management Coalitions Grassroots Organizing Legislative Relations Organizational... Human Rights Political Science Legislation Speech Writing Economic Development Legislative Affairs Health Policy Political Communication Nonprofits Community Engagement Political Consulting See 35+     See less Public Policy Research Public Relations Policy Analysis Community Outreach Grant Writing Non-profits Public Speaking Qualitative Research Public Health Event Planning Social Media Volunteer Management Program Development Grants Strategic Communications Community Organizing Policy Editing Community Development Data Analysis Political Campaigns Politics Fundraising Government International Relations International... Higher Education Program Evaluation Capacity Building Proposal Writing Philanthropy Program Management Media Relations Event Management Coalitions Grassroots Organizing Legislative Relations Organizational... Human Rights Political Science Legislation Speech Writing Economic Development Legislative Affairs Health Policy Political Communication Nonprofits Community Engagement Political Consulting See 35+     See less Public Policy Research Public Relations Policy Analysis Community Outreach Grant Writing Non-profits Public Speaking Qualitative Research Public Health Event Planning Social Media Volunteer Management Program Development Grants Strategic Communications Community Organizing Policy Editing Community Development Data Analysis Political Campaigns Politics Fundraising Government International Relations International... Higher Education Program Evaluation Capacity Building Proposal Writing Philanthropy Program Management Media Relations Event Management Coalitions Grassroots Organizing Legislative Relations Organizational... Human Rights Political Science Legislation Speech Writing Economic Development Legislative Affairs Health Policy Political Communication Nonprofits Community Engagement Political Consulting See 35+     See less Education Indiana University Bloomington MPA,  Public Affairs 2005  – 2007 Activities and Societies:  School of Public and Environmental Affairs Diversity Committee University of California, San Diego Bachelor of Arts; Bachelor of Arts,  Political Science- International Relations; Japanese Studies 1999  – 2003 Activities and Societies:  Phi Beta Kappa ,  Associated Students ,  Student Council at Eleanor Roosevelt College ,  Eleanor Roosevelt College Residence Life ,  Inter-collegiate Residents Association ,  Student Organization Funding Advisory Board ,  Alliance Indiana University Bloomington MPA,  Public Affairs 2005  – 2007 Activities and Societies:  School of Public and Environmental Affairs Diversity Committee Indiana University Bloomington MPA,  Public Affairs 2005  – 2007 Activities and Societies:  School of Public and Environmental Affairs Diversity Committee Indiana University Bloomington MPA,  Public Affairs 2005  – 2007 Activities and Societies:  School of Public and Environmental Affairs Diversity Committee University of California, San Diego Bachelor of Arts; Bachelor of Arts,  Political Science- International Relations; Japanese Studies 1999  – 2003 Activities and Societies:  Phi Beta Kappa ,  Associated Students ,  Student Council at Eleanor Roosevelt College ,  Eleanor Roosevelt College Residence Life ,  Inter-collegiate Residents Association ,  Student Organization Funding Advisory Board ,  Alliance University of California, San Diego Bachelor of Arts; Bachelor of Arts,  Political Science- International Relations; Japanese Studies 1999  – 2003 Activities and Societies:  Phi Beta Kappa ,  Associated Students ,  Student Council at Eleanor Roosevelt College ,  Eleanor Roosevelt College Residence Life ,  Inter-collegiate Residents Association ,  Student Organization Funding Advisory Board ,  Alliance University of California, San Diego Bachelor of Arts; Bachelor of Arts,  Political Science- International Relations; Japanese Studies 1999  – 2003 Activities and Societies:  Phi Beta Kappa ,  Associated Students ,  Student Council at Eleanor Roosevelt College ,  Eleanor Roosevelt College Residence Life ,  Inter-collegiate Residents Association ,  Student Organization Funding Advisory Board ,  Alliance ", "Experience Google Public Policy Manager, EMEA Google July 2014  – Present (1 year 2 months) London, United Kingdom Telecommunications, access and consumer strategies Google UK Policy Manager Google April 2011  –  June 2014  (3 years 3 months) Head of Public Affairs O2 UK (a Telefónica Company) August 2010  –  April 2011  (9 months) Special Adviser Office of the Prime Minister September 2006  –  May 2010  (3 years 9 months) Head of Research and Information Google Public Policy Manager, EMEA Google July 2014  – Present (1 year 2 months) London, United Kingdom Telecommunications, access and consumer strategies Google Public Policy Manager, EMEA Google July 2014  – Present (1 year 2 months) London, United Kingdom Telecommunications, access and consumer strategies Google UK Policy Manager Google April 2011  –  June 2014  (3 years 3 months) Google UK Policy Manager Google April 2011  –  June 2014  (3 years 3 months) Head of Public Affairs O2 UK (a Telefónica Company) August 2010  –  April 2011  (9 months) Head of Public Affairs O2 UK (a Telefónica Company) August 2010  –  April 2011  (9 months) Special Adviser Office of the Prime Minister September 2006  –  May 2010  (3 years 9 months) Head of Research and Information Special Adviser Office of the Prime Minister September 2006  –  May 2010  (3 years 9 months) Head of Research and Information Skills Strategic Communications Public Affairs Stakeholder Engagement Politics Media Relations Crisis Communications Political Campaigns Public Policy Lobbying Internal Communications Corporate Communications Public Relations Policy Stakeholder Management Reputation Management Community Engagement See 1+     See less Skills  Strategic Communications Public Affairs Stakeholder Engagement Politics Media Relations Crisis Communications Political Campaigns Public Policy Lobbying Internal Communications Corporate Communications Public Relations Policy Stakeholder Management Reputation Management Community Engagement See 1+     See less Strategic Communications Public Affairs Stakeholder Engagement Politics Media Relations Crisis Communications Political Campaigns Public Policy Lobbying Internal Communications Corporate Communications Public Relations Policy Stakeholder Management Reputation Management Community Engagement See 1+     See less Strategic Communications Public Affairs Stakeholder Engagement Politics Media Relations Crisis Communications Political Campaigns Public Policy Lobbying Internal Communications Corporate Communications Public Relations Policy Stakeholder Management Reputation Management Community Engagement See 1+     See less Education University of Bristol Doctor of Philosophy (PhD),  English Literature 1997  – 2000 University of Cambridge Bachelor of Arts (B.A.),  English Literature 1994  – 1997 University of Bristol Doctor of Philosophy (PhD),  English Literature 1997  – 2000 University of Bristol Doctor of Philosophy (PhD),  English Literature 1997  – 2000 University of Bristol Doctor of Philosophy (PhD),  English Literature 1997  – 2000 University of Cambridge Bachelor of Arts (B.A.),  English Literature 1994  – 1997 University of Cambridge Bachelor of Arts (B.A.),  English Literature 1994  – 1997 University of Cambridge Bachelor of Arts (B.A.),  English Literature 1994  – 1997 ", "Summary Policy and Government Affairs at Google, focused on economic impact of the web, innovation agenda, economy of data, open government, digital democracy Summary Policy and Government Affairs at Google, focused on economic impact of the web, innovation agenda, economy of data, open government, digital democracy Policy and Government Affairs at Google, focused on economic impact of the web, innovation agenda, economy of data, open government, digital democracy Policy and Government Affairs at Google, focused on economic impact of the web, innovation agenda, economy of data, open government, digital democracy Experience Public Policy Manager Google September 2011  – Present (4 years) Member of the town government Comune di Certaldo February 2011  –  December 2011  (11 months) Member of the Government in charge for education, ICT, communication, training, immigration policies Founder EuProgress September 2010  –  September 2011  (1 year 1 month) Founder and manager of the webmagazine on European progressive economic policies Member of the Regional Parliament Regione Toscana August 2007  –  April 2010  (2 years 9 months) Firenze Member of the executive board of the youth organisation Democratici di Sinistra May 2007  –  March 2008  (11 months) Assistant, board of the President Regione Toscana June 2006  –  August 2007  (1 year 3 months) Public Policy Manager Google September 2011  – Present (4 years) Public Policy Manager Google September 2011  – Present (4 years) Member of the town government Comune di Certaldo February 2011  –  December 2011  (11 months) Member of the Government in charge for education, ICT, communication, training, immigration policies Member of the town government Comune di Certaldo February 2011  –  December 2011  (11 months) Member of the Government in charge for education, ICT, communication, training, immigration policies Founder EuProgress September 2010  –  September 2011  (1 year 1 month) Founder and manager of the webmagazine on European progressive economic policies Founder EuProgress September 2010  –  September 2011  (1 year 1 month) Founder and manager of the webmagazine on European progressive economic policies Member of the Regional Parliament Regione Toscana August 2007  –  April 2010  (2 years 9 months) Firenze Member of the Regional Parliament Regione Toscana August 2007  –  April 2010  (2 years 9 months) Firenze Member of the executive board of the youth organisation Democratici di Sinistra May 2007  –  March 2008  (11 months) Member of the executive board of the youth organisation Democratici di Sinistra May 2007  –  March 2008  (11 months) Assistant, board of the President Regione Toscana June 2006  –  August 2007  (1 year 3 months) Assistant, board of the President Regione Toscana June 2006  –  August 2007  (1 year 3 months) Languages English Italian German English Italian German English Italian German Skills Economics Social Media Social Networking Italian Local Politics Public Policy Political Campaigns Photoshop Lobbying Government Public Speaking Digital Economy Public Affairs Social media Politics Media Relations Strategic Communications See 2+     See less Skills  Economics Social Media Social Networking Italian Local Politics Public Policy Political Campaigns Photoshop Lobbying Government Public Speaking Digital Economy Public Affairs Social media Politics Media Relations Strategic Communications See 2+     See less Economics Social Media Social Networking Italian Local Politics Public Policy Political Campaigns Photoshop Lobbying Government Public Speaking Digital Economy Public Affairs Social media Politics Media Relations Strategic Communications See 2+     See less Economics Social Media Social Networking Italian Local Politics Public Policy Political Campaigns Photoshop Lobbying Government Public Speaking Digital Economy Public Affairs Social media Politics Media Relations Strategic Communications See 2+     See less Education Università degli Studi di Firenze / University of Florence Bachelor,  Economics 2003  – 2010 Università degli Studi di Firenze / University of Florence Bachelor of Economic Development,  Development Economics and International Development Università degli Studi di Firenze / University of Florence Bachelor,  Economics 2003  – 2010 Università degli Studi di Firenze / University of Florence Bachelor,  Economics 2003  – 2010 Università degli Studi di Firenze / University of Florence Bachelor,  Economics 2003  – 2010 Università degli Studi di Firenze / University of Florence Bachelor of Economic Development,  Development Economics and International Development Università degli Studi di Firenze / University of Florence Bachelor of Economic Development,  Development Economics and International Development Università degli Studi di Firenze / University of Florence Bachelor of Economic Development,  Development Economics and International Development ", "Experience UK Public Policy Manager Google July 2013  – Present (2 years 2 months) Advisory Board Member Women on Boards UK Ltd June 2014  – Present (1 year 3 months) Special Adviser to the Deputy Prime Minister UK Government June 2009  –  June 2013  (4 years 1 month) UK Public Policy Manager Google July 2013  – Present (2 years 2 months) UK Public Policy Manager Google July 2013  – Present (2 years 2 months) Advisory Board Member Women on Boards UK Ltd June 2014  – Present (1 year 3 months) Advisory Board Member Women on Boards UK Ltd June 2014  – Present (1 year 3 months) Special Adviser to the Deputy Prime Minister UK Government June 2009  –  June 2013  (4 years 1 month) Special Adviser to the Deputy Prime Minister UK Government June 2009  –  June 2013  (4 years 1 month) Education Harvard University Michael Von Clemm Fellowship,  History and Politics 2007  – 2008 University of Oxford First Class BA Hons,  Modern History 2003  – 2006 Harvard University Michael Von Clemm Fellowship,  History and Politics 2007  – 2008 Harvard University Michael Von Clemm Fellowship,  History and Politics 2007  – 2008 Harvard University Michael Von Clemm Fellowship,  History and Politics 2007  – 2008 University of Oxford First Class BA Hons,  Modern History 2003  – 2006 University of Oxford First Class BA Hons,  Modern History 2003  – 2006 University of Oxford First Class BA Hons,  Modern History 2003  – 2006 ", "Experience Growth Stripe June 2015  – Present (3 months) San Francisco Bay Area Growth Stripe June 2015  – Present (3 months) San Francisco Bay Area Growth Stripe June 2015  – Present (3 months) San Francisco Bay Area Skills Google Adwords Digital Strategy Online Advertising Display Advertising Fundraising Politics Google Apps SEM PPC Event Planning Google Analytics Strategic Planning Online Marketing Public Policy Social Media Skills  Google Adwords Digital Strategy Online Advertising Display Advertising Fundraising Politics Google Apps SEM PPC Event Planning Google Analytics Strategic Planning Online Marketing Public Policy Social Media Google Adwords Digital Strategy Online Advertising Display Advertising Fundraising Politics Google Apps SEM PPC Event Planning Google Analytics Strategic Planning Online Marketing Public Policy Social Media Google Adwords Digital Strategy Online Advertising Display Advertising Fundraising Politics Google Apps SEM PPC Event Planning Google Analytics Strategic Planning Online Marketing Public Policy Social Media ", "Summary I am passionate and experienced in public policy, public health law (specifically emergency preparedness measures), municipal law, mediation, small-group facilitation, and international human rights law.  \n \nI constantly seek new challenges, and look forward to using my creative energy to better the world. Specialties:public health law, international human rights law, municipal law, administrative law, public policy, alternative dispute resolution, parenting consulting, public speaking, training and program development and management, small group facilitation, collaboration Summary I am passionate and experienced in public policy, public health law (specifically emergency preparedness measures), municipal law, mediation, small-group facilitation, and international human rights law.  \n \nI constantly seek new challenges, and look forward to using my creative energy to better the world. Specialties:public health law, international human rights law, municipal law, administrative law, public policy, alternative dispute resolution, parenting consulting, public speaking, training and program development and management, small group facilitation, collaboration I am passionate and experienced in public policy, public health law (specifically emergency preparedness measures), municipal law, mediation, small-group facilitation, and international human rights law.  \n \nI constantly seek new challenges, and look forward to using my creative energy to better the world. Specialties:public health law, international human rights law, municipal law, administrative law, public policy, alternative dispute resolution, parenting consulting, public speaking, training and program development and management, small group facilitation, collaboration I am passionate and experienced in public policy, public health law (specifically emergency preparedness measures), municipal law, mediation, small-group facilitation, and international human rights law.  \n \nI constantly seek new challenges, and look forward to using my creative energy to better the world. Specialties:public health law, international human rights law, municipal law, administrative law, public policy, alternative dispute resolution, parenting consulting, public speaking, training and program development and management, small group facilitation, collaboration Experience Public Policy Manager Medica July 2013  – Present (2 years 2 months) Support Medica's policy goals and initiatives.  \nCoordinate distribution of health care reform regulation across business units. \nTrack legislation in four states.  \nWork with legal department and business units to understand health care reform changes.  \nIn-depth knowledge of ACA.  \nRepresent Medica at Minnesota Council of Health Plans. Server Rush Creek Golf Club 2009  –  2014  (5 years) Customer Service, Organization, Attention to Detail, Conflict Resolution Health Plan Law Clerk HealthPartners May 2013  –  July 2013  (3 months) * Draft and revise internal legal reference documents \n* Conduct legal research and answer corporate client legal questions Independent Legal Contractor/Law Clerk Novitzke, Gust, Sempf, Whitely & Bergmanis October 2012  –  July 2013  (10 months) • Conduct legal research, primarily on Google Scholar so as to save on research costs, focusing on civil law, including civil procedure, family law, personal injury, and public benefits \n• Draft motions, pleadings, and briefs Lobbying Intern Minnesota Council of Health Plans January 2013  –  May 2013  (5 months) St. Paul, Minnesota • Knowledge of legislative process and health care and public health policy in Minnesota \n• Attend legislative committee hearings and meetings \n• Monitor legislation, including the bills related to Minnesota Health Insurance Exchange, Medical Assistance expansion, and Autism coverage.  \n• Conduct legal research related to the Affordable Care Act and legislation, rules, and policies from other states regarding Health Insurance Exchange Legal Unit Intern Minnesota Department of Health January 2012  –  May 2012  (5 months) St. Paul, MN •\tLegal research regarding public health emergency preparedness law, data practices, and agency adjudication standards \n•\tDraft recommendations for emergency preparedness regarding use of N95 masks during Postal Plan Model exercise in May 2012 \n•\tAdvise chief legal counsel, as well as various public health units, including the Office of Emergency Preparedness, about relevant legal standards \n•\tParticipate in advisory panel about redevelopment of newborn screening program, including editing \n•\tEvaluate potential training opportunity for judges about public health laws  \n•\tAttend webinar and educational opportunities relating to public health laws, including Emergency Use Authorization webinar from FDA and Framework for Convention on Global Health, presented by Lawrence O. Gostin \n•\tEdit public documents for inconsistencies, policy, and grammatical errors Volunteer/Intern National Child Protection Training Center September 2011  –  May 2012  (9 months) Remote legal research & writing Clerk/Student Worker Mediation Center for Dispute Resolution July 2009  –  May 2012  (2 years 11 months) St. Paul, MN •\tDraft ethical recommendations for Minnesota Alternative Dispute Resolution ethics review board, experience with factual analysis \n•\tManage mediation training programs \n•\tDevelop and implement marketing for training programs \n•\tCreated and managed family mediation case database \n•\tFacilitate and coordinate the development of standardized Stipulation and Order and Retainer for Parenting Consultants and Parenting Time Expeditors in State of Minnesota CSF Intern League of Minnesota Cities May 2011  –  September 2011  (5 months) St. Paul, MN •\tFacilitated small group of citizens regarding what services they want from cities, funding sources, service delivery methods and values and considerations that should drive decision-making (trained by University of Minnesota Extension Services)  \n•\tEntered data, formatted transcripts and analyzed transcripts for policy recommendations  \n•\tOrganized meeting materials and letters Intern City of Dayton 2007  –  2009  (2 years) Property-files management, answer phones, customer service, manage sewer and water payments, draft yearly-reports Music Department Assistant College of Saint Benedict/Saint John's University 2005  –  2009  (4 years) Scholarship Compliance coordinator, make copies and coffee, create and hang posters for musical events Education Intern Immigrant Law Center of Minnesota June 2008  –  August 2008  (3 months) Completed in conjunction with Upper Midwest Human Rights Fellowship from the University of Minnesota Human Rights Center \nGained experience in advocacy, formulating strategies for educational outreach \nWrote and drafted brochures, articles and education presentations \nBuilt networks among local schools, students and the program, including local colleges Intern Lutheran Social Services July 2007  –  August 2007  (2 months) Data entry and management, interviews with recent immigrants and assist in family reunification Public Policy Manager Medica July 2013  – Present (2 years 2 months) Support Medica's policy goals and initiatives.  \nCoordinate distribution of health care reform regulation across business units. \nTrack legislation in four states.  \nWork with legal department and business units to understand health care reform changes.  \nIn-depth knowledge of ACA.  \nRepresent Medica at Minnesota Council of Health Plans. Public Policy Manager Medica July 2013  – Present (2 years 2 months) Support Medica's policy goals and initiatives.  \nCoordinate distribution of health care reform regulation across business units. \nTrack legislation in four states.  \nWork with legal department and business units to understand health care reform changes.  \nIn-depth knowledge of ACA.  \nRepresent Medica at Minnesota Council of Health Plans. Server Rush Creek Golf Club 2009  –  2014  (5 years) Customer Service, Organization, Attention to Detail, Conflict Resolution Server Rush Creek Golf Club 2009  –  2014  (5 years) Customer Service, Organization, Attention to Detail, Conflict Resolution Health Plan Law Clerk HealthPartners May 2013  –  July 2013  (3 months) * Draft and revise internal legal reference documents \n* Conduct legal research and answer corporate client legal questions Health Plan Law Clerk HealthPartners May 2013  –  July 2013  (3 months) * Draft and revise internal legal reference documents \n* Conduct legal research and answer corporate client legal questions Independent Legal Contractor/Law Clerk Novitzke, Gust, Sempf, Whitely & Bergmanis October 2012  –  July 2013  (10 months) • Conduct legal research, primarily on Google Scholar so as to save on research costs, focusing on civil law, including civil procedure, family law, personal injury, and public benefits \n• Draft motions, pleadings, and briefs Independent Legal Contractor/Law Clerk Novitzke, Gust, Sempf, Whitely & Bergmanis October 2012  –  July 2013  (10 months) • Conduct legal research, primarily on Google Scholar so as to save on research costs, focusing on civil law, including civil procedure, family law, personal injury, and public benefits \n• Draft motions, pleadings, and briefs Lobbying Intern Minnesota Council of Health Plans January 2013  –  May 2013  (5 months) St. Paul, Minnesota • Knowledge of legislative process and health care and public health policy in Minnesota \n• Attend legislative committee hearings and meetings \n• Monitor legislation, including the bills related to Minnesota Health Insurance Exchange, Medical Assistance expansion, and Autism coverage.  \n• Conduct legal research related to the Affordable Care Act and legislation, rules, and policies from other states regarding Health Insurance Exchange Lobbying Intern Minnesota Council of Health Plans January 2013  –  May 2013  (5 months) St. Paul, Minnesota • Knowledge of legislative process and health care and public health policy in Minnesota \n• Attend legislative committee hearings and meetings \n• Monitor legislation, including the bills related to Minnesota Health Insurance Exchange, Medical Assistance expansion, and Autism coverage.  \n• Conduct legal research related to the Affordable Care Act and legislation, rules, and policies from other states regarding Health Insurance Exchange Legal Unit Intern Minnesota Department of Health January 2012  –  May 2012  (5 months) St. Paul, MN •\tLegal research regarding public health emergency preparedness law, data practices, and agency adjudication standards \n•\tDraft recommendations for emergency preparedness regarding use of N95 masks during Postal Plan Model exercise in May 2012 \n•\tAdvise chief legal counsel, as well as various public health units, including the Office of Emergency Preparedness, about relevant legal standards \n•\tParticipate in advisory panel about redevelopment of newborn screening program, including editing \n•\tEvaluate potential training opportunity for judges about public health laws  \n•\tAttend webinar and educational opportunities relating to public health laws, including Emergency Use Authorization webinar from FDA and Framework for Convention on Global Health, presented by Lawrence O. Gostin \n•\tEdit public documents for inconsistencies, policy, and grammatical errors Legal Unit Intern Minnesota Department of Health January 2012  –  May 2012  (5 months) St. Paul, MN •\tLegal research regarding public health emergency preparedness law, data practices, and agency adjudication standards \n•\tDraft recommendations for emergency preparedness regarding use of N95 masks during Postal Plan Model exercise in May 2012 \n•\tAdvise chief legal counsel, as well as various public health units, including the Office of Emergency Preparedness, about relevant legal standards \n•\tParticipate in advisory panel about redevelopment of newborn screening program, including editing \n•\tEvaluate potential training opportunity for judges about public health laws  \n•\tAttend webinar and educational opportunities relating to public health laws, including Emergency Use Authorization webinar from FDA and Framework for Convention on Global Health, presented by Lawrence O. Gostin \n•\tEdit public documents for inconsistencies, policy, and grammatical errors Volunteer/Intern National Child Protection Training Center September 2011  –  May 2012  (9 months) Remote legal research & writing Volunteer/Intern National Child Protection Training Center September 2011  –  May 2012  (9 months) Remote legal research & writing Clerk/Student Worker Mediation Center for Dispute Resolution July 2009  –  May 2012  (2 years 11 months) St. Paul, MN •\tDraft ethical recommendations for Minnesota Alternative Dispute Resolution ethics review board, experience with factual analysis \n•\tManage mediation training programs \n•\tDevelop and implement marketing for training programs \n•\tCreated and managed family mediation case database \n•\tFacilitate and coordinate the development of standardized Stipulation and Order and Retainer for Parenting Consultants and Parenting Time Expeditors in State of Minnesota Clerk/Student Worker Mediation Center for Dispute Resolution July 2009  –  May 2012  (2 years 11 months) St. Paul, MN •\tDraft ethical recommendations for Minnesota Alternative Dispute Resolution ethics review board, experience with factual analysis \n•\tManage mediation training programs \n•\tDevelop and implement marketing for training programs \n•\tCreated and managed family mediation case database \n•\tFacilitate and coordinate the development of standardized Stipulation and Order and Retainer for Parenting Consultants and Parenting Time Expeditors in State of Minnesota CSF Intern League of Minnesota Cities May 2011  –  September 2011  (5 months) St. Paul, MN •\tFacilitated small group of citizens regarding what services they want from cities, funding sources, service delivery methods and values and considerations that should drive decision-making (trained by University of Minnesota Extension Services)  \n•\tEntered data, formatted transcripts and analyzed transcripts for policy recommendations  \n•\tOrganized meeting materials and letters CSF Intern League of Minnesota Cities May 2011  –  September 2011  (5 months) St. Paul, MN •\tFacilitated small group of citizens regarding what services they want from cities, funding sources, service delivery methods and values and considerations that should drive decision-making (trained by University of Minnesota Extension Services)  \n•\tEntered data, formatted transcripts and analyzed transcripts for policy recommendations  \n•\tOrganized meeting materials and letters Intern City of Dayton 2007  –  2009  (2 years) Property-files management, answer phones, customer service, manage sewer and water payments, draft yearly-reports Intern City of Dayton 2007  –  2009  (2 years) Property-files management, answer phones, customer service, manage sewer and water payments, draft yearly-reports Music Department Assistant College of Saint Benedict/Saint John's University 2005  –  2009  (4 years) Scholarship Compliance coordinator, make copies and coffee, create and hang posters for musical events Music Department Assistant College of Saint Benedict/Saint John's University 2005  –  2009  (4 years) Scholarship Compliance coordinator, make copies and coffee, create and hang posters for musical events Education Intern Immigrant Law Center of Minnesota June 2008  –  August 2008  (3 months) Completed in conjunction with Upper Midwest Human Rights Fellowship from the University of Minnesota Human Rights Center \nGained experience in advocacy, formulating strategies for educational outreach \nWrote and drafted brochures, articles and education presentations \nBuilt networks among local schools, students and the program, including local colleges Education Intern Immigrant Law Center of Minnesota June 2008  –  August 2008  (3 months) Completed in conjunction with Upper Midwest Human Rights Fellowship from the University of Minnesota Human Rights Center \nGained experience in advocacy, formulating strategies for educational outreach \nWrote and drafted brochures, articles and education presentations \nBuilt networks among local schools, students and the program, including local colleges Intern Lutheran Social Services July 2007  –  August 2007  (2 months) Data entry and management, interviews with recent immigrants and assist in family reunification Intern Lutheran Social Services July 2007  –  August 2007  (2 months) Data entry and management, interviews with recent immigrants and assist in family reunification Skills Legal Research Policy Analysis Legal Writing Mediation Public Speaking Public Policy Personal Injury Family Law Health Law Public Health Emergency... Public Health Law Public Health Policy Municipal Law Small Group Facilitation Training & Development Collaborative Leadership Neutral Ethics Organizing Event Planning Social Media Civil Litigation Policy Human Rights Legislation Health Policy See 10+     See less Skills  Legal Research Policy Analysis Legal Writing Mediation Public Speaking Public Policy Personal Injury Family Law Health Law Public Health Emergency... Public Health Law Public Health Policy Municipal Law Small Group Facilitation Training & Development Collaborative Leadership Neutral Ethics Organizing Event Planning Social Media Civil Litigation Policy Human Rights Legislation Health Policy See 10+     See less Legal Research Policy Analysis Legal Writing Mediation Public Speaking Public Policy Personal Injury Family Law Health Law Public Health Emergency... Public Health Law Public Health Policy Municipal Law Small Group Facilitation Training & Development Collaborative Leadership Neutral Ethics Organizing Event Planning Social Media Civil Litigation Policy Human Rights Legislation Health Policy See 10+     See less Legal Research Policy Analysis Legal Writing Mediation Public Speaking Public Policy Personal Injury Family Law Health Law Public Health Emergency... Public Health Law Public Health Policy Municipal Law Small Group Facilitation Training & Development Collaborative Leadership Neutral Ethics Organizing Event Planning Social Media Civil Litigation Policy Human Rights Legislation Health Policy See 10+     See less Education Hamline University School of Law Juris Doctor,  Law , 3.464 2009  – 2012 Dean's Honor Roll Fall 2009, Fall 2010, Spring 2011, Fall 2011, Spring 2012 \n \nLarry Bakken Leadership Award Activities and Societies:  Hamline Journal of Public Law and Policy - Associated Editor ,  2010-2011\nHamline Journal of Public Law and Policy - Symposium Editor ,  2011-2012 College of Saint Benedict B.A.,  Peace Studies ,  Sociology 2005  – 2009 2009 \"Challenge the Process\" Leadership Award \n2009 \"Excellence in Leadership\" Award \n2009 Graduated Magna cum Laude \n2009 Graduate with All-College Honors in Peace Studies and Sociology \n2009 Completed Honors Thesis in Peace Studies and Sociology \n2008 Study Abroad to South Africa \n2008 Upper Midwest Human Rights Fellowship Recipient \n2006, 2007, 2009 Alternative Spring Break Trips Activities and Societies:  Joint Events Council ,  Orchestra ,  Amadeus Symphony ,  Honors Program Hamline University School of Law Juris Doctor,  Law , 3.464 2009  – 2012 Dean's Honor Roll Fall 2009, Fall 2010, Spring 2011, Fall 2011, Spring 2012 \n \nLarry Bakken Leadership Award Activities and Societies:  Hamline Journal of Public Law and Policy - Associated Editor ,  2010-2011\nHamline Journal of Public Law and Policy - Symposium Editor ,  2011-2012 Hamline University School of Law Juris Doctor,  Law , 3.464 2009  – 2012 Dean's Honor Roll Fall 2009, Fall 2010, Spring 2011, Fall 2011, Spring 2012 \n \nLarry Bakken Leadership Award Activities and Societies:  Hamline Journal of Public Law and Policy - Associated Editor ,  2010-2011\nHamline Journal of Public Law and Policy - Symposium Editor ,  2011-2012 Hamline University School of Law Juris Doctor,  Law , 3.464 2009  – 2012 Dean's Honor Roll Fall 2009, Fall 2010, Spring 2011, Fall 2011, Spring 2012 \n \nLarry Bakken Leadership Award Activities and Societies:  Hamline Journal of Public Law and Policy - Associated Editor ,  2010-2011\nHamline Journal of Public Law and Policy - Symposium Editor ,  2011-2012 College of Saint Benedict B.A.,  Peace Studies ,  Sociology 2005  – 2009 2009 \"Challenge the Process\" Leadership Award \n2009 \"Excellence in Leadership\" Award \n2009 Graduated Magna cum Laude \n2009 Graduate with All-College Honors in Peace Studies and Sociology \n2009 Completed Honors Thesis in Peace Studies and Sociology \n2008 Study Abroad to South Africa \n2008 Upper Midwest Human Rights Fellowship Recipient \n2006, 2007, 2009 Alternative Spring Break Trips Activities and Societies:  Joint Events Council ,  Orchestra ,  Amadeus Symphony ,  Honors Program College of Saint Benedict B.A.,  Peace Studies ,  Sociology 2005  – 2009 2009 \"Challenge the Process\" Leadership Award \n2009 \"Excellence in Leadership\" Award \n2009 Graduated Magna cum Laude \n2009 Graduate with All-College Honors in Peace Studies and Sociology \n2009 Completed Honors Thesis in Peace Studies and Sociology \n2008 Study Abroad to South Africa \n2008 Upper Midwest Human Rights Fellowship Recipient \n2006, 2007, 2009 Alternative Spring Break Trips Activities and Societies:  Joint Events Council ,  Orchestra ,  Amadeus Symphony ,  Honors Program College of Saint Benedict B.A.,  Peace Studies ,  Sociology 2005  – 2009 2009 \"Challenge the Process\" Leadership Award \n2009 \"Excellence in Leadership\" Award \n2009 Graduated Magna cum Laude \n2009 Graduate with All-College Honors in Peace Studies and Sociology \n2009 Completed Honors Thesis in Peace Studies and Sociology \n2008 Study Abroad to South Africa \n2008 Upper Midwest Human Rights Fellowship Recipient \n2006, 2007, 2009 Alternative Spring Break Trips Activities and Societies:  Joint Events Council ,  Orchestra ,  Amadeus Symphony ,  Honors Program Honors & Awards CALI Award - International Human Rights Law CALI January 2012 Earned the CALI Award in International Human Rights Law for the Fall 2011 Semester at Hamline University School of Law Additional Honors & Awards Who's Who Among High School Students 2003-2004 \nGirl Scout Gold Award 2003 CALI Award - International Human Rights Law CALI January 2012 Earned the CALI Award in International Human Rights Law for the Fall 2011 Semester at Hamline University School of Law CALI Award - International Human Rights Law CALI January 2012 Earned the CALI Award in International Human Rights Law for the Fall 2011 Semester at Hamline University School of Law CALI Award - International Human Rights Law CALI January 2012 Earned the CALI Award in International Human Rights Law for the Fall 2011 Semester at Hamline University School of Law Additional Honors & Awards Who's Who Among High School Students 2003-2004 \nGirl Scout Gold Award 2003 Additional Honors & Awards Who's Who Among High School Students 2003-2004 \nGirl Scout Gold Award 2003 Additional Honors & Awards Who's Who Among High School Students 2003-2004 \nGirl Scout Gold Award 2003 ", "Summary Gerente de Relações Governamentais no Google Brasil Summary Gerente de Relações Governamentais no Google Brasil Gerente de Relações Governamentais no Google Brasil Gerente de Relações Governamentais no Google Brasil Experience Public Policy Manager Google October 2011  – Present (3 years 11 months) Colaboradora SBDP 2008  –  2011  (3 years) Coordenadora e professora do curso \"Desmistificando as Relações Governamentais\" em 2008. \nCoordenadora e palestrante dos \"Encontros de Relações Governamentais\" em 2009. \nCoordenadora e professora do Ciclo de filmes \"O jogo político: conhecer, dominar e questionar\" em 2011. \nCoordenadora e professora no curso \"A defesa de interesses junto a governos\" em 2011. Assessora Parlamentar Defensoria Pública do Estado de São Paulo 2008  –  2010  (2 years) Assessora de Gabinete Secretaria de Desenvolvimento Econômico, Ciência, Tecnologia e Inovação do Estado de São Paulo 2007  –  2008  (1 year) Coordenadora de Relações Governamentais Suzano Papel e Celulose 2004  –  2007  (3 years) Estagiária de Pesquisa FGV DIREITO SP January 2004  –  July 2004  (7 months) Pesquisa - O sistema de justiça brasileiro, a produção de informações e sua utilização Estagiária Momsen, Leonardos & Cia. 2003  –  2004  (1 year) Public Policy Manager Google October 2011  – Present (3 years 11 months) Public Policy Manager Google October 2011  – Present (3 years 11 months) Colaboradora SBDP 2008  –  2011  (3 years) Coordenadora e professora do curso \"Desmistificando as Relações Governamentais\" em 2008. \nCoordenadora e palestrante dos \"Encontros de Relações Governamentais\" em 2009. \nCoordenadora e professora do Ciclo de filmes \"O jogo político: conhecer, dominar e questionar\" em 2011. \nCoordenadora e professora no curso \"A defesa de interesses junto a governos\" em 2011. Colaboradora SBDP 2008  –  2011  (3 years) Coordenadora e professora do curso \"Desmistificando as Relações Governamentais\" em 2008. \nCoordenadora e palestrante dos \"Encontros de Relações Governamentais\" em 2009. \nCoordenadora e professora do Ciclo de filmes \"O jogo político: conhecer, dominar e questionar\" em 2011. \nCoordenadora e professora no curso \"A defesa de interesses junto a governos\" em 2011. Assessora Parlamentar Defensoria Pública do Estado de São Paulo 2008  –  2010  (2 years) Assessora Parlamentar Defensoria Pública do Estado de São Paulo 2008  –  2010  (2 years) Assessora de Gabinete Secretaria de Desenvolvimento Econômico, Ciência, Tecnologia e Inovação do Estado de São Paulo 2007  –  2008  (1 year) Assessora de Gabinete Secretaria de Desenvolvimento Econômico, Ciência, Tecnologia e Inovação do Estado de São Paulo 2007  –  2008  (1 year) Coordenadora de Relações Governamentais Suzano Papel e Celulose 2004  –  2007  (3 years) Coordenadora de Relações Governamentais Suzano Papel e Celulose 2004  –  2007  (3 years) Estagiária de Pesquisa FGV DIREITO SP January 2004  –  July 2004  (7 months) Pesquisa - O sistema de justiça brasileiro, a produção de informações e sua utilização Estagiária de Pesquisa FGV DIREITO SP January 2004  –  July 2004  (7 months) Pesquisa - O sistema de justiça brasileiro, a produção de informações e sua utilização Estagiária Momsen, Leonardos & Cia. 2003  –  2004  (1 year) Estagiária Momsen, Leonardos & Cia. 2003  –  2004  (1 year) Languages Espanhol Professional working proficiency Inglês Native or bilingual proficiency Espanhol Professional working proficiency Inglês Native or bilingual proficiency Espanhol Professional working proficiency Inglês Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Relações públicas Espanhol Português Política pública Análise de políticas Skills  Relações públicas Espanhol Português Política pública Análise de políticas Relações públicas Espanhol Português Política pública Análise de políticas Relações públicas Espanhol Português Política pública Análise de políticas Education Universidade de São Paulo Mestrado,  Filosofia e Teoria Geral do Direito 2008  – 2011 Consolidação da independência do Brasil - História do direito Universidade de São Paulo Bacharelado em Direito 2000  – 2004 Universidade de São Paulo Mestrado,  Filosofia e Teoria Geral do Direito 2008  – 2011 Consolidação da independência do Brasil - História do direito Universidade de São Paulo Mestrado,  Filosofia e Teoria Geral do Direito 2008  – 2011 Consolidação da independência do Brasil - História do direito Universidade de São Paulo Mestrado,  Filosofia e Teoria Geral do Direito 2008  – 2011 Consolidação da independência do Brasil - História do direito Universidade de São Paulo Bacharelado em Direito 2000  – 2004 Universidade de São Paulo Bacharelado em Direito 2000  – 2004 Universidade de São Paulo Bacharelado em Direito 2000  – 2004 ", "Experience Public Policy and Government Relations Manager Google November 2014  – Present (10 months) Berlin Senior Public Policy and Government Relations Analyst Google March 2013  –  November 2014  (1 year 9 months) Berlin Area, Germany Public Policy and Government Relations Analyst Google January 2012  –  March 2013  (1 year 3 months) Berlin Area, Germany Research Analyst Department of Foreign Affairs, Trade and Development Canada August 2011  –  December 2011  (5 months) Berlin Area, Germany Freelance Analyst at the International Politics Desk Heinrich Boell Foundation September 2010  –  December 2011  (1 year 4 months) Berlin Area, Germany Project Team Member of the Hertie School of Governance German Federal Ministry of Labour and Social Affaires March 2010  –  June 2010  (4 months) Berlin Area, Germany Consulted the ministry in developing a national action plan to implement the UN convention for the rights of the disabled Lead Analyst G8 Research Group October 2006  –  June 2009  (2 years 9 months) Toronto, Canada Area Program Administrator Student Services University of Toronto, School of Continuing Studies May 2007  –  August 2007  (4 months) Toronto, Canada Area Public Policy and Government Relations Manager Google November 2014  – Present (10 months) Berlin Public Policy and Government Relations Manager Google November 2014  – Present (10 months) Berlin Senior Public Policy and Government Relations Analyst Google March 2013  –  November 2014  (1 year 9 months) Berlin Area, Germany Senior Public Policy and Government Relations Analyst Google March 2013  –  November 2014  (1 year 9 months) Berlin Area, Germany Public Policy and Government Relations Analyst Google January 2012  –  March 2013  (1 year 3 months) Berlin Area, Germany Public Policy and Government Relations Analyst Google January 2012  –  March 2013  (1 year 3 months) Berlin Area, Germany Research Analyst Department of Foreign Affairs, Trade and Development Canada August 2011  –  December 2011  (5 months) Berlin Area, Germany Research Analyst Department of Foreign Affairs, Trade and Development Canada August 2011  –  December 2011  (5 months) Berlin Area, Germany Freelance Analyst at the International Politics Desk Heinrich Boell Foundation September 2010  –  December 2011  (1 year 4 months) Berlin Area, Germany Freelance Analyst at the International Politics Desk Heinrich Boell Foundation September 2010  –  December 2011  (1 year 4 months) Berlin Area, Germany Project Team Member of the Hertie School of Governance German Federal Ministry of Labour and Social Affaires March 2010  –  June 2010  (4 months) Berlin Area, Germany Consulted the ministry in developing a national action plan to implement the UN convention for the rights of the disabled Project Team Member of the Hertie School of Governance German Federal Ministry of Labour and Social Affaires March 2010  –  June 2010  (4 months) Berlin Area, Germany Consulted the ministry in developing a national action plan to implement the UN convention for the rights of the disabled Lead Analyst G8 Research Group October 2006  –  June 2009  (2 years 9 months) Toronto, Canada Area Lead Analyst G8 Research Group October 2006  –  June 2009  (2 years 9 months) Toronto, Canada Area Program Administrator Student Services University of Toronto, School of Continuing Studies May 2007  –  August 2007  (4 months) Toronto, Canada Area Program Administrator Student Services University of Toronto, School of Continuing Studies May 2007  –  August 2007  (4 months) Toronto, Canada Area Languages English Native or bilingual proficiency German Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency German Native or bilingual proficiency French Limited working proficiency English Native or bilingual proficiency German Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Stata Policy Analysis Public Policy International Relations Politics Research International... Political Science Foreign Policy Qualitative Research Governance Economics Policy European Union Government Data Analysis Economic Development Econometrics Human Rights Quantitative Analytics See 5+     See less Skills  Stata Policy Analysis Public Policy International Relations Politics Research International... Political Science Foreign Policy Qualitative Research Governance Economics Policy European Union Government Data Analysis Economic Development Econometrics Human Rights Quantitative Analytics See 5+     See less Stata Policy Analysis Public Policy International Relations Politics Research International... Political Science Foreign Policy Qualitative Research Governance Economics Policy European Union Government Data Analysis Economic Development Econometrics Human Rights Quantitative Analytics See 5+     See less Stata Policy Analysis Public Policy International Relations Politics Research International... Political Science Foreign Policy Qualitative Research Governance Economics Policy European Union Government Data Analysis Economic Development Econometrics Human Rights Quantitative Analytics See 5+     See less Education Hertie School of Governance MPP,  Public Policy 2009  – 2011 Activities and Societies:  Student Representatives University of Toronto Hon. Bachelor of Arts,  International Relations and Political Science 2005  – 2009 Hertie School of Governance MPP,  Public Policy 2009  – 2011 Activities and Societies:  Student Representatives Hertie School of Governance MPP,  Public Policy 2009  – 2011 Activities and Societies:  Student Representatives Hertie School of Governance MPP,  Public Policy 2009  – 2011 Activities and Societies:  Student Representatives University of Toronto Hon. Bachelor of Arts,  International Relations and Political Science 2005  – 2009 University of Toronto Hon. Bachelor of Arts,  International Relations and Political Science 2005  – 2009 University of Toronto Hon. Bachelor of Arts,  International Relations and Political Science 2005  – 2009 Honors & Awards Dean`s List Scholar University of Toronto September 2008 Edith Ailsa Greene Scholarship Victoria College Senate September 2008 Professor Paul Fox Scholarship Victoria College Senate September 2006 Lincoln Hutton Essay Prize Victoria College Senate October 2008 Best essay written by a Victoria College student: \"Gorbachev`s New Thinking and the International System 1988-1999\" Dean`s List Scholar University of Toronto September 2008 Dean`s List Scholar University of Toronto September 2008 Dean`s List Scholar University of Toronto September 2008 Edith Ailsa Greene Scholarship Victoria College Senate September 2008 Edith Ailsa Greene Scholarship Victoria College Senate September 2008 Edith Ailsa Greene Scholarship Victoria College Senate September 2008 Professor Paul Fox Scholarship Victoria College Senate September 2006 Professor Paul Fox Scholarship Victoria College Senate September 2006 Professor Paul Fox Scholarship Victoria College Senate September 2006 Lincoln Hutton Essay Prize Victoria College Senate October 2008 Best essay written by a Victoria College student: \"Gorbachev`s New Thinking and the International System 1988-1999\" Lincoln Hutton Essay Prize Victoria College Senate October 2008 Best essay written by a Victoria College student: \"Gorbachev`s New Thinking and the International System 1988-1999\" Lincoln Hutton Essay Prize Victoria College Senate October 2008 Best essay written by a Victoria College student: \"Gorbachev`s New Thinking and the International System 1988-1999\" ", "Summary 8 years as a consultant in the field of telecom and media strategy and competition analysis: 5 years at Tera Consultants and for 3 years with my own company BeMedia.  \n \nIn 2005, I undertook a phd (Economy, University of Dauphine) about the impact of disruptive innovation on the French system of funding movies.  \nPhd director: Patrice Geoffron.  \nJury: Françoise Benhamou, Pierre Kopp, René Bonnell \n \nThe phd ended in October 2007 with highest honours. Specialties:Competitive ans strategic analysis, regulation, project management \nIndustries : Internet, telecom Summary 8 years as a consultant in the field of telecom and media strategy and competition analysis: 5 years at Tera Consultants and for 3 years with my own company BeMedia.  \n \nIn 2005, I undertook a phd (Economy, University of Dauphine) about the impact of disruptive innovation on the French system of funding movies.  \nPhd director: Patrice Geoffron.  \nJury: Françoise Benhamou, Pierre Kopp, René Bonnell \n \nThe phd ended in October 2007 with highest honours. Specialties:Competitive ans strategic analysis, regulation, project management \nIndustries : Internet, telecom 8 years as a consultant in the field of telecom and media strategy and competition analysis: 5 years at Tera Consultants and for 3 years with my own company BeMedia.  \n \nIn 2005, I undertook a phd (Economy, University of Dauphine) about the impact of disruptive innovation on the French system of funding movies.  \nPhd director: Patrice Geoffron.  \nJury: Françoise Benhamou, Pierre Kopp, René Bonnell \n \nThe phd ended in October 2007 with highest honours. Specialties:Competitive ans strategic analysis, regulation, project management \nIndustries : Internet, telecom 8 years as a consultant in the field of telecom and media strategy and competition analysis: 5 years at Tera Consultants and for 3 years with my own company BeMedia.  \n \nIn 2005, I undertook a phd (Economy, University of Dauphine) about the impact of disruptive innovation on the French system of funding movies.  \nPhd director: Patrice Geoffron.  \nJury: Françoise Benhamou, Pierre Kopp, René Bonnell \n \nThe phd ended in October 2007 with highest honours. Specialties:Competitive ans strategic analysis, regulation, project management \nIndustries : Internet, telecom Experience Public Policy Senior Manager Google May 2014  – Present (1 year 4 months) Paris Area, France Public Policy Manager Google June 2010  – Present (5 years 3 months) Provide a stimulating environment for the development of the French digital economy  \nDo economic research on the impact of Internet \nDrive our initiatives to support entrepreneurship and startups Lecturer - Business strategy and consulting Université Paris 13 - Master Conseil en entreprise March 2005  –  January 2012  (6 years 11 months) Paris XIII Representative for the information society Directorate for media development, Prime minister April 2008  –  June 2010  (2 years 3 months) Director BeMedia August 2005  –  January 2008  (2 years 6 months) Business strategy for telco&media companies ICT Senior consultant TERA Consultants 2000  –  2005  (5 years) Strategy analysis and regulation lobby for telecom and media companies Public Policy Senior Manager Google May 2014  – Present (1 year 4 months) Paris Area, France Public Policy Senior Manager Google May 2014  – Present (1 year 4 months) Paris Area, France Public Policy Manager Google June 2010  – Present (5 years 3 months) Provide a stimulating environment for the development of the French digital economy  \nDo economic research on the impact of Internet \nDrive our initiatives to support entrepreneurship and startups Public Policy Manager Google June 2010  – Present (5 years 3 months) Provide a stimulating environment for the development of the French digital economy  \nDo economic research on the impact of Internet \nDrive our initiatives to support entrepreneurship and startups Lecturer - Business strategy and consulting Université Paris 13 - Master Conseil en entreprise March 2005  –  January 2012  (6 years 11 months) Paris XIII Lecturer - Business strategy and consulting Université Paris 13 - Master Conseil en entreprise March 2005  –  January 2012  (6 years 11 months) Paris XIII Representative for the information society Directorate for media development, Prime minister April 2008  –  June 2010  (2 years 3 months) Representative for the information society Directorate for media development, Prime minister April 2008  –  June 2010  (2 years 3 months) Director BeMedia August 2005  –  January 2008  (2 years 6 months) Business strategy for telco&media companies Director BeMedia August 2005  –  January 2008  (2 years 6 months) Business strategy for telco&media companies ICT Senior consultant TERA Consultants 2000  –  2005  (5 years) Strategy analysis and regulation lobby for telecom and media companies ICT Senior consultant TERA Consultants 2000  –  2005  (5 years) Strategy analysis and regulation lobby for telecom and media companies Skills Project Management Policy Strategy Business Planning Economics Competitive Analysis E-commerce Internet Strategy Strategic Communications Start-ups Entrepreneurship Analysis Telecommunications Business Strategy ICT Governance Management Consulting Business Development Consulting Digital Marketing French Start-up Management Digital Strategy See 8+     See less Skills  Project Management Policy Strategy Business Planning Economics Competitive Analysis E-commerce Internet Strategy Strategic Communications Start-ups Entrepreneurship Analysis Telecommunications Business Strategy ICT Governance Management Consulting Business Development Consulting Digital Marketing French Start-up Management Digital Strategy See 8+     See less Project Management Policy Strategy Business Planning Economics Competitive Analysis E-commerce Internet Strategy Strategic Communications Start-ups Entrepreneurship Analysis Telecommunications Business Strategy ICT Governance Management Consulting Business Development Consulting Digital Marketing French Start-up Management Digital Strategy See 8+     See less Project Management Policy Strategy Business Planning Economics Competitive Analysis E-commerce Internet Strategy Strategic Communications Start-ups Entrepreneurship Analysis Telecommunications Business Strategy ICT Governance Management Consulting Business Development Consulting Digital Marketing French Start-up Management Digital Strategy See 8+     See less Education Phd in Economy - University Paris Dauphine Phd,  French movie public policy 2005  – 2007 Industrial Economy - Université Paris 13 DEA,  Industrial Economics 1999  – 2000 Phd in Economy - University Paris Dauphine Phd,  French movie public policy 2005  – 2007 Phd in Economy - University Paris Dauphine Phd,  French movie public policy 2005  – 2007 Phd in Economy - University Paris Dauphine Phd,  French movie public policy 2005  – 2007 Industrial Economy - Université Paris 13 DEA,  Industrial Economics 1999  – 2000 Industrial Economy - Université Paris 13 DEA,  Industrial Economics 1999  – 2000 Industrial Economy - Université Paris 13 DEA,  Industrial Economics 1999  – 2000 ", "Summary + Experienced, disciplined, agenda-drive nonprofit manager with meticulous attention to detail in public policy, communications, event planning, grassroots organizing, and operations \n+ Passionate and tenacious advocate for the human cause with experience in New York's Capitol and in Washington, DC \n+ Gregarious relationship-building with advanced networking, outreach, training and facilitation, and coalition-building skills \n+ Quick learner with proficiency in Adobe CS6, Dreamweaver, CMS platforms, Salsa (Democracy in Action), Google Apps, GoToWebinar, ZoHo Database, FirstGiving, Network for Good, Constant COntact, EmailNow, MailChimp, QuickBooks, Microsoft Office, Filemaker, and more \n \nSpecialties: Relationship management, nonprofit operations and governance, outreach, collaborative building, government liaison. Summary + Experienced, disciplined, agenda-drive nonprofit manager with meticulous attention to detail in public policy, communications, event planning, grassroots organizing, and operations \n+ Passionate and tenacious advocate for the human cause with experience in New York's Capitol and in Washington, DC \n+ Gregarious relationship-building with advanced networking, outreach, training and facilitation, and coalition-building skills \n+ Quick learner with proficiency in Adobe CS6, Dreamweaver, CMS platforms, Salsa (Democracy in Action), Google Apps, GoToWebinar, ZoHo Database, FirstGiving, Network for Good, Constant COntact, EmailNow, MailChimp, QuickBooks, Microsoft Office, Filemaker, and more \n \nSpecialties: Relationship management, nonprofit operations and governance, outreach, collaborative building, government liaison. + Experienced, disciplined, agenda-drive nonprofit manager with meticulous attention to detail in public policy, communications, event planning, grassroots organizing, and operations \n+ Passionate and tenacious advocate for the human cause with experience in New York's Capitol and in Washington, DC \n+ Gregarious relationship-building with advanced networking, outreach, training and facilitation, and coalition-building skills \n+ Quick learner with proficiency in Adobe CS6, Dreamweaver, CMS platforms, Salsa (Democracy in Action), Google Apps, GoToWebinar, ZoHo Database, FirstGiving, Network for Good, Constant COntact, EmailNow, MailChimp, QuickBooks, Microsoft Office, Filemaker, and more \n \nSpecialties: Relationship management, nonprofit operations and governance, outreach, collaborative building, government liaison. + Experienced, disciplined, agenda-drive nonprofit manager with meticulous attention to detail in public policy, communications, event planning, grassroots organizing, and operations \n+ Passionate and tenacious advocate for the human cause with experience in New York's Capitol and in Washington, DC \n+ Gregarious relationship-building with advanced networking, outreach, training and facilitation, and coalition-building skills \n+ Quick learner with proficiency in Adobe CS6, Dreamweaver, CMS platforms, Salsa (Democracy in Action), Google Apps, GoToWebinar, ZoHo Database, FirstGiving, Network for Good, Constant COntact, EmailNow, MailChimp, QuickBooks, Microsoft Office, Filemaker, and more \n \nSpecialties: Relationship management, nonprofit operations and governance, outreach, collaborative building, government liaison. Experience Principal Michelle Bauer Consulting March 2010  – Present (5 years 6 months) I provide consulting services to small to medium-sized nonprofits and businesses related to community outreach, relationship management, collaborative building; organizational development, strategic panning, and meeting facilitation; and government affairs, public policy, and advocacy planning. \n \nCurrently, I've been working with organizations to obtain nonprofit tax exempt status and to rebuild core mission and vision statements. Chief Operating Officer National Committee of Grandparents for Children's Rights September 2010  –  January 2013  (2 years 5 months) Albany, New York Area At NCGCR, I am responsible for the internal leadership of the organization, including day-to-day operations, fiscal oversight, human resources, board development, program, and communications. \n \nThroughout the last two years, I've worked to rebrand the organization with a new mission statement, renewed board of directors, newly designed and implemented program standards, and a total rebranding including new logo, marketing materials, website and marketing/outreach plan. \n \nHighlighted accomplishments include: \n+ The reorganization of NCGCR, including board development, staff and organizational policy development, new logo and marketing materials, eNewsletter distribution, and general operational cleanup \n+ Quadrupled use of social media, including Facebook, Google Groups, LinkedIn, Twitter, and connections with technology-driven nonprofit assistance such as TechSoup, NTEN, Network for Good, IdealCore, and more \n+ Developed an efficient and transparent donor database system and \"donor thank you\" process \n+ Redesigned the data collection and resource directory system for the Grandparent Warmline \n+ Redesigned our brand, including new logo, new marketing materials, new website, and more \n+ Co-hosted the National Kinship Summit with the Child Welfare League of America in Washington, DC, including the development of materials and outreach for attendance Public Policy Manager / Co-Facilitator of the NYS Parenting Education Partnership Prevent Child Abuse New York November 2006  –  August 2010  (3 years 10 months) Albany, New York Area At PCANY, I managed the NYS Parenting Education Partnership and participated in a number of other parenting and children and families-related coalitions and networks, designed and execute the advocacy/legislative lobbying platform and associated materials for PCANY and several other nonprofit organizations. \n \nHighlighted accomplishments include: \n+ Facilitated and grew the 250-organizational member strong NYS Parenting Education Partnership, including the design and distribution of communications (blog, Twitter, eNewsletter, marketing materials) and the coordination of events (focus groups, conferences, coalition meetings, webinars, annual retreats through New York State) \n+ Successfully managed the PCANY legislative agenda as a registered lobbyist and designed and implemented both the grassroots and online advocacy campaigns, including multiple advocacy days and a rally on the steps of the Capitol \n+ Keynoted at more than fifty advocacy and coalition events, trained over two-hundred advocates in person and online, and participated in numerous coalitions as representative of PCANY Consultant Early Care and Learning Council February 2010  –  May 2010  (4 months) Albany, New York Area At ECLC, I supported the public policy and advocacy work of the Early Care and Learning Council, including the creation of policy language and documents for advocates. Deputy Commissioner of Motor Vehicles / Deputy County Clerk Broome County February 2005  –  November 2006  (1 year 10 months) Binghamton, NY At the DMV, I acted as the Departmenthead for the Broome County Department of Motor Vehicles, including in a liaison role with NYS DMV and the legislature, coordinated media relations and designed public events and programs, website manager for content and design and supervised all administrative activities including human resources, budgetary issues and others. \n \nHighlighted accomplishments include: \n+ Managed a staff of twenty-two, a budget of $2 million, and the opening of two additional satellite offices for a total of five offices \n+ Coordinated over thirty events, including fifteen press conferences and multiple community-building events, and acted as the Public Information Officer for the County Clerk and DMV Public Affairs Coordinator and Webmaster Rick Blythe for County Clerk February 2005  –  November 2006  (1 year 10 months) Binghamton, NY At Rick Blythe for County Clerk, I was responsible for most aspects of the county clerk election campaign of 2005. \n \nHighlighted accomplishments include: \n+ Managed all media relations for the campaign and planned outreach strategies which resulted in a successful election \n+ Designed and maintained the website, including daily video and content upload Public and District Affairs / Constituent Services Assistant Office of Senator Thomas W. Libous May 2003  –  February 2005  (1 year 10 months) Binghamton, NY At Senator Libous' office, I assisted in constituent relations, district and public affairs, helping more than six hundred constituents break through the red tape of state government. I also assisted in implementing the \"Congrats\" outreach campaign as part of a public affairs strategy, writing and disseminating thousands of letters, certificates, and proclamations. Deputy Director of Food Operations / Marketing Assistant Friends of Senator Libous Committee May 2003  –  January 2005  (1 year 9 months) Binghamton, NY At the Friends of Senator Libous Committee, I worked on both political campaigns and fundraisers, including the annual Steak Roast. \n \nHighlighted accomplishments include: \n+ Acted as Deputy Director of Food Operations at the Annual Steak Roast, acquiring nearly $100,000 in ingredient and materials donations and serving meals cooked by over three-hundred volunteers to four-thousand attendees \n+ Assisted in marketing development and financial record-keeping through materials design, database coordination, and ticket distribution planning for four-thousand tickets \n+ Developed multiple mailpieces, door-hangers, and planned over a dozen grassroots fundraisers for local candidates Principal Michelle Bauer Consulting March 2010  – Present (5 years 6 months) I provide consulting services to small to medium-sized nonprofits and businesses related to community outreach, relationship management, collaborative building; organizational development, strategic panning, and meeting facilitation; and government affairs, public policy, and advocacy planning. \n \nCurrently, I've been working with organizations to obtain nonprofit tax exempt status and to rebuild core mission and vision statements. Principal Michelle Bauer Consulting March 2010  – Present (5 years 6 months) I provide consulting services to small to medium-sized nonprofits and businesses related to community outreach, relationship management, collaborative building; organizational development, strategic panning, and meeting facilitation; and government affairs, public policy, and advocacy planning. \n \nCurrently, I've been working with organizations to obtain nonprofit tax exempt status and to rebuild core mission and vision statements. Chief Operating Officer National Committee of Grandparents for Children's Rights September 2010  –  January 2013  (2 years 5 months) Albany, New York Area At NCGCR, I am responsible for the internal leadership of the organization, including day-to-day operations, fiscal oversight, human resources, board development, program, and communications. \n \nThroughout the last two years, I've worked to rebrand the organization with a new mission statement, renewed board of directors, newly designed and implemented program standards, and a total rebranding including new logo, marketing materials, website and marketing/outreach plan. \n \nHighlighted accomplishments include: \n+ The reorganization of NCGCR, including board development, staff and organizational policy development, new logo and marketing materials, eNewsletter distribution, and general operational cleanup \n+ Quadrupled use of social media, including Facebook, Google Groups, LinkedIn, Twitter, and connections with technology-driven nonprofit assistance such as TechSoup, NTEN, Network for Good, IdealCore, and more \n+ Developed an efficient and transparent donor database system and \"donor thank you\" process \n+ Redesigned the data collection and resource directory system for the Grandparent Warmline \n+ Redesigned our brand, including new logo, new marketing materials, new website, and more \n+ Co-hosted the National Kinship Summit with the Child Welfare League of America in Washington, DC, including the development of materials and outreach for attendance Chief Operating Officer National Committee of Grandparents for Children's Rights September 2010  –  January 2013  (2 years 5 months) Albany, New York Area At NCGCR, I am responsible for the internal leadership of the organization, including day-to-day operations, fiscal oversight, human resources, board development, program, and communications. \n \nThroughout the last two years, I've worked to rebrand the organization with a new mission statement, renewed board of directors, newly designed and implemented program standards, and a total rebranding including new logo, marketing materials, website and marketing/outreach plan. \n \nHighlighted accomplishments include: \n+ The reorganization of NCGCR, including board development, staff and organizational policy development, new logo and marketing materials, eNewsletter distribution, and general operational cleanup \n+ Quadrupled use of social media, including Facebook, Google Groups, LinkedIn, Twitter, and connections with technology-driven nonprofit assistance such as TechSoup, NTEN, Network for Good, IdealCore, and more \n+ Developed an efficient and transparent donor database system and \"donor thank you\" process \n+ Redesigned the data collection and resource directory system for the Grandparent Warmline \n+ Redesigned our brand, including new logo, new marketing materials, new website, and more \n+ Co-hosted the National Kinship Summit with the Child Welfare League of America in Washington, DC, including the development of materials and outreach for attendance Public Policy Manager / Co-Facilitator of the NYS Parenting Education Partnership Prevent Child Abuse New York November 2006  –  August 2010  (3 years 10 months) Albany, New York Area At PCANY, I managed the NYS Parenting Education Partnership and participated in a number of other parenting and children and families-related coalitions and networks, designed and execute the advocacy/legislative lobbying platform and associated materials for PCANY and several other nonprofit organizations. \n \nHighlighted accomplishments include: \n+ Facilitated and grew the 250-organizational member strong NYS Parenting Education Partnership, including the design and distribution of communications (blog, Twitter, eNewsletter, marketing materials) and the coordination of events (focus groups, conferences, coalition meetings, webinars, annual retreats through New York State) \n+ Successfully managed the PCANY legislative agenda as a registered lobbyist and designed and implemented both the grassroots and online advocacy campaigns, including multiple advocacy days and a rally on the steps of the Capitol \n+ Keynoted at more than fifty advocacy and coalition events, trained over two-hundred advocates in person and online, and participated in numerous coalitions as representative of PCANY Public Policy Manager / Co-Facilitator of the NYS Parenting Education Partnership Prevent Child Abuse New York November 2006  –  August 2010  (3 years 10 months) Albany, New York Area At PCANY, I managed the NYS Parenting Education Partnership and participated in a number of other parenting and children and families-related coalitions and networks, designed and execute the advocacy/legislative lobbying platform and associated materials for PCANY and several other nonprofit organizations. \n \nHighlighted accomplishments include: \n+ Facilitated and grew the 250-organizational member strong NYS Parenting Education Partnership, including the design and distribution of communications (blog, Twitter, eNewsletter, marketing materials) and the coordination of events (focus groups, conferences, coalition meetings, webinars, annual retreats through New York State) \n+ Successfully managed the PCANY legislative agenda as a registered lobbyist and designed and implemented both the grassroots and online advocacy campaigns, including multiple advocacy days and a rally on the steps of the Capitol \n+ Keynoted at more than fifty advocacy and coalition events, trained over two-hundred advocates in person and online, and participated in numerous coalitions as representative of PCANY Consultant Early Care and Learning Council February 2010  –  May 2010  (4 months) Albany, New York Area At ECLC, I supported the public policy and advocacy work of the Early Care and Learning Council, including the creation of policy language and documents for advocates. Consultant Early Care and Learning Council February 2010  –  May 2010  (4 months) Albany, New York Area At ECLC, I supported the public policy and advocacy work of the Early Care and Learning Council, including the creation of policy language and documents for advocates. Deputy Commissioner of Motor Vehicles / Deputy County Clerk Broome County February 2005  –  November 2006  (1 year 10 months) Binghamton, NY At the DMV, I acted as the Departmenthead for the Broome County Department of Motor Vehicles, including in a liaison role with NYS DMV and the legislature, coordinated media relations and designed public events and programs, website manager for content and design and supervised all administrative activities including human resources, budgetary issues and others. \n \nHighlighted accomplishments include: \n+ Managed a staff of twenty-two, a budget of $2 million, and the opening of two additional satellite offices for a total of five offices \n+ Coordinated over thirty events, including fifteen press conferences and multiple community-building events, and acted as the Public Information Officer for the County Clerk and DMV Deputy Commissioner of Motor Vehicles / Deputy County Clerk Broome County February 2005  –  November 2006  (1 year 10 months) Binghamton, NY At the DMV, I acted as the Departmenthead for the Broome County Department of Motor Vehicles, including in a liaison role with NYS DMV and the legislature, coordinated media relations and designed public events and programs, website manager for content and design and supervised all administrative activities including human resources, budgetary issues and others. \n \nHighlighted accomplishments include: \n+ Managed a staff of twenty-two, a budget of $2 million, and the opening of two additional satellite offices for a total of five offices \n+ Coordinated over thirty events, including fifteen press conferences and multiple community-building events, and acted as the Public Information Officer for the County Clerk and DMV Public Affairs Coordinator and Webmaster Rick Blythe for County Clerk February 2005  –  November 2006  (1 year 10 months) Binghamton, NY At Rick Blythe for County Clerk, I was responsible for most aspects of the county clerk election campaign of 2005. \n \nHighlighted accomplishments include: \n+ Managed all media relations for the campaign and planned outreach strategies which resulted in a successful election \n+ Designed and maintained the website, including daily video and content upload Public Affairs Coordinator and Webmaster Rick Blythe for County Clerk February 2005  –  November 2006  (1 year 10 months) Binghamton, NY At Rick Blythe for County Clerk, I was responsible for most aspects of the county clerk election campaign of 2005. \n \nHighlighted accomplishments include: \n+ Managed all media relations for the campaign and planned outreach strategies which resulted in a successful election \n+ Designed and maintained the website, including daily video and content upload Public and District Affairs / Constituent Services Assistant Office of Senator Thomas W. Libous May 2003  –  February 2005  (1 year 10 months) Binghamton, NY At Senator Libous' office, I assisted in constituent relations, district and public affairs, helping more than six hundred constituents break through the red tape of state government. I also assisted in implementing the \"Congrats\" outreach campaign as part of a public affairs strategy, writing and disseminating thousands of letters, certificates, and proclamations. Public and District Affairs / Constituent Services Assistant Office of Senator Thomas W. Libous May 2003  –  February 2005  (1 year 10 months) Binghamton, NY At Senator Libous' office, I assisted in constituent relations, district and public affairs, helping more than six hundred constituents break through the red tape of state government. I also assisted in implementing the \"Congrats\" outreach campaign as part of a public affairs strategy, writing and disseminating thousands of letters, certificates, and proclamations. Deputy Director of Food Operations / Marketing Assistant Friends of Senator Libous Committee May 2003  –  January 2005  (1 year 9 months) Binghamton, NY At the Friends of Senator Libous Committee, I worked on both political campaigns and fundraisers, including the annual Steak Roast. \n \nHighlighted accomplishments include: \n+ Acted as Deputy Director of Food Operations at the Annual Steak Roast, acquiring nearly $100,000 in ingredient and materials donations and serving meals cooked by over three-hundred volunteers to four-thousand attendees \n+ Assisted in marketing development and financial record-keeping through materials design, database coordination, and ticket distribution planning for four-thousand tickets \n+ Developed multiple mailpieces, door-hangers, and planned over a dozen grassroots fundraisers for local candidates Deputy Director of Food Operations / Marketing Assistant Friends of Senator Libous Committee May 2003  –  January 2005  (1 year 9 months) Binghamton, NY At the Friends of Senator Libous Committee, I worked on both political campaigns and fundraisers, including the annual Steak Roast. \n \nHighlighted accomplishments include: \n+ Acted as Deputy Director of Food Operations at the Annual Steak Roast, acquiring nearly $100,000 in ingredient and materials donations and serving meals cooked by over three-hundred volunteers to four-thousand attendees \n+ Assisted in marketing development and financial record-keeping through materials design, database coordination, and ticket distribution planning for four-thousand tickets \n+ Developed multiple mailpieces, door-hangers, and planned over a dozen grassroots fundraisers for local candidates Skills Adobe Creative Suite Public Policy Political Campaigns Marketing Communications Community Relations Communications Planning Political Communication Dreamweaver Nonprofit Leadership Nonprofit Consulting Public Speaking Earned Media Coalition Building Website Management Media Relations Social Media Marketing Email Marketing Budget Development Budget Management Personnel Supervision Personnel Policies Strategic Planning Strategic Communications Strategic Partnerships Retreat Facilitation Strategic Planning... Event Planning Event Management Event Marketing Materials Development Electronic Newsletters Grants Administration Non-profit... Non-profit Board... Board Development Non-profit Consulting Non-profit Events Political Affairs Government Relations Government Affairs Coalitions Social Media Non-profits Community Outreach Newsletters Budgets Politics Relationship Management Government Human Resources See 35+     See less Skills  Adobe Creative Suite Public Policy Political Campaigns Marketing Communications Community Relations Communications Planning Political Communication Dreamweaver Nonprofit Leadership Nonprofit Consulting Public Speaking Earned Media Coalition Building Website Management Media Relations Social Media Marketing Email Marketing Budget Development Budget Management Personnel Supervision Personnel Policies Strategic Planning Strategic Communications Strategic Partnerships Retreat Facilitation Strategic Planning... Event Planning Event Management Event Marketing Materials Development Electronic Newsletters Grants Administration Non-profit... Non-profit Board... Board Development Non-profit Consulting Non-profit Events Political Affairs Government Relations Government Affairs Coalitions Social Media Non-profits Community Outreach Newsletters Budgets Politics Relationship Management Government Human Resources See 35+     See less Adobe Creative Suite Public Policy Political Campaigns Marketing Communications Community Relations Communications Planning Political Communication Dreamweaver Nonprofit Leadership Nonprofit Consulting Public Speaking Earned Media Coalition Building Website Management Media Relations Social Media Marketing Email Marketing Budget Development Budget Management Personnel Supervision Personnel Policies Strategic Planning Strategic Communications Strategic Partnerships Retreat Facilitation Strategic Planning... Event Planning Event Management Event Marketing Materials Development Electronic Newsletters Grants Administration Non-profit... Non-profit Board... Board Development Non-profit Consulting Non-profit Events Political Affairs Government Relations Government Affairs Coalitions Social Media Non-profits Community Outreach Newsletters Budgets Politics Relationship Management Government Human Resources See 35+     See less Adobe Creative Suite Public Policy Political Campaigns Marketing Communications Community Relations Communications Planning Political Communication Dreamweaver Nonprofit Leadership Nonprofit Consulting Public Speaking Earned Media Coalition Building Website Management Media Relations Social Media Marketing Email Marketing Budget Development Budget Management Personnel Supervision Personnel Policies Strategic Planning Strategic Communications Strategic Partnerships Retreat Facilitation Strategic Planning... Event Planning Event Management Event Marketing Materials Development Electronic Newsletters Grants Administration Non-profit... Non-profit Board... Board Development Non-profit Consulting Non-profit Events Political Affairs Government Relations Government Affairs Coalitions Social Media Non-profits Community Outreach Newsletters Budgets Politics Relationship Management Government Human Resources See 35+     See less Education Southern New Hampshire University Master of Science (MS),  Accounting 2013  – 2017 State University of New York at Binghamton Bachelor of Arts (BA),  Political Science 2001  – 2004 Ulster County Community College 2000  – 2001 Rondout Valley High School Regents Diploma,  General 1995  – 1999 Southern New Hampshire University Master of Science (MS),  Accounting 2013  – 2017 Southern New Hampshire University Master of Science (MS),  Accounting 2013  – 2017 Southern New Hampshire University Master of Science (MS),  Accounting 2013  – 2017 State University of New York at Binghamton Bachelor of Arts (BA),  Political Science 2001  – 2004 State University of New York at Binghamton Bachelor of Arts (BA),  Political Science 2001  – 2004 State University of New York at Binghamton Bachelor of Arts (BA),  Political Science 2001  – 2004 Ulster County Community College 2000  – 2001 Ulster County Community College 2000  – 2001 Ulster County Community College 2000  – 2001 Rondout Valley High School Regents Diploma,  General 1995  – 1999 Rondout Valley High School Regents Diploma,  General 1995  – 1999 Rondout Valley High School Regents Diploma,  General 1995  – 1999 ", "Summary As the Public Policy manager of Google in Greece and other countries in the region, Dionisis' mission is to work with policy makers & other stakeholders towards the world's bright future in the Internet era. One path might be if the world adopts Google's commitment to innovation, in the same way as Google embraced ancient Greece's commitment to open democracy.  \n \nPreviously, as the General Manager of the Hellenic Semiconductor Industry Association (HSIA), Dionisis developed the HSIA brand and managed the stakeholder & media relations, resulting in TV, radio & print interviews. He organized events with the participation of global industry experts and VCs and secured new membership applications from Greece and abroad. \n \nBefore that, Dionisis was a member of the Procter & Gamble External Relations team in the Global Household Care unit. In that role he designed and rolled out communication campaigns for P&G's laundry brands in Western Europe and in developing markets in Latin America, Eastern Europe, Middle East, South East Asia and in China.  \n \nIn his early P&G career, he worked on safety and regulatory compliance ensuring that new products and the manufacturing processes meet P&G standards and sustainability policies and comply with the law. He continued to be involved in sustainability issues and co-authored the P&G sustainability report in 2003 and 2004. \n \nBefore joining P&G in 1999, Dionisis worked on European energy, environment and economic policy scenario analyses, which represents his lifetime opportunity to work in modeling (that was mathematical, not fashion modeling..). He holds a Master's in environmental management in business and an engineering degree.  \n \nHe has expertise in stakeholder & influencer relations, risk and crisis management. He is passionate about making technology, and sustainability relevant and easily understood by non-experts. \n \nDionisis is the father of three energetic kids and the husband of a passionate communication consultant and author. Summary As the Public Policy manager of Google in Greece and other countries in the region, Dionisis' mission is to work with policy makers & other stakeholders towards the world's bright future in the Internet era. One path might be if the world adopts Google's commitment to innovation, in the same way as Google embraced ancient Greece's commitment to open democracy.  \n \nPreviously, as the General Manager of the Hellenic Semiconductor Industry Association (HSIA), Dionisis developed the HSIA brand and managed the stakeholder & media relations, resulting in TV, radio & print interviews. He organized events with the participation of global industry experts and VCs and secured new membership applications from Greece and abroad. \n \nBefore that, Dionisis was a member of the Procter & Gamble External Relations team in the Global Household Care unit. In that role he designed and rolled out communication campaigns for P&G's laundry brands in Western Europe and in developing markets in Latin America, Eastern Europe, Middle East, South East Asia and in China.  \n \nIn his early P&G career, he worked on safety and regulatory compliance ensuring that new products and the manufacturing processes meet P&G standards and sustainability policies and comply with the law. He continued to be involved in sustainability issues and co-authored the P&G sustainability report in 2003 and 2004. \n \nBefore joining P&G in 1999, Dionisis worked on European energy, environment and economic policy scenario analyses, which represents his lifetime opportunity to work in modeling (that was mathematical, not fashion modeling..). He holds a Master's in environmental management in business and an engineering degree.  \n \nHe has expertise in stakeholder & influencer relations, risk and crisis management. He is passionate about making technology, and sustainability relevant and easily understood by non-experts. \n \nDionisis is the father of three energetic kids and the husband of a passionate communication consultant and author. As the Public Policy manager of Google in Greece and other countries in the region, Dionisis' mission is to work with policy makers & other stakeholders towards the world's bright future in the Internet era. One path might be if the world adopts Google's commitment to innovation, in the same way as Google embraced ancient Greece's commitment to open democracy.  \n \nPreviously, as the General Manager of the Hellenic Semiconductor Industry Association (HSIA), Dionisis developed the HSIA brand and managed the stakeholder & media relations, resulting in TV, radio & print interviews. He organized events with the participation of global industry experts and VCs and secured new membership applications from Greece and abroad. \n \nBefore that, Dionisis was a member of the Procter & Gamble External Relations team in the Global Household Care unit. In that role he designed and rolled out communication campaigns for P&G's laundry brands in Western Europe and in developing markets in Latin America, Eastern Europe, Middle East, South East Asia and in China.  \n \nIn his early P&G career, he worked on safety and regulatory compliance ensuring that new products and the manufacturing processes meet P&G standards and sustainability policies and comply with the law. He continued to be involved in sustainability issues and co-authored the P&G sustainability report in 2003 and 2004. \n \nBefore joining P&G in 1999, Dionisis worked on European energy, environment and economic policy scenario analyses, which represents his lifetime opportunity to work in modeling (that was mathematical, not fashion modeling..). He holds a Master's in environmental management in business and an engineering degree.  \n \nHe has expertise in stakeholder & influencer relations, risk and crisis management. He is passionate about making technology, and sustainability relevant and easily understood by non-experts. \n \nDionisis is the father of three energetic kids and the husband of a passionate communication consultant and author. As the Public Policy manager of Google in Greece and other countries in the region, Dionisis' mission is to work with policy makers & other stakeholders towards the world's bright future in the Internet era. One path might be if the world adopts Google's commitment to innovation, in the same way as Google embraced ancient Greece's commitment to open democracy.  \n \nPreviously, as the General Manager of the Hellenic Semiconductor Industry Association (HSIA), Dionisis developed the HSIA brand and managed the stakeholder & media relations, resulting in TV, radio & print interviews. He organized events with the participation of global industry experts and VCs and secured new membership applications from Greece and abroad. \n \nBefore that, Dionisis was a member of the Procter & Gamble External Relations team in the Global Household Care unit. In that role he designed and rolled out communication campaigns for P&G's laundry brands in Western Europe and in developing markets in Latin America, Eastern Europe, Middle East, South East Asia and in China.  \n \nIn his early P&G career, he worked on safety and regulatory compliance ensuring that new products and the manufacturing processes meet P&G standards and sustainability policies and comply with the law. He continued to be involved in sustainability issues and co-authored the P&G sustainability report in 2003 and 2004. \n \nBefore joining P&G in 1999, Dionisis worked on European energy, environment and economic policy scenario analyses, which represents his lifetime opportunity to work in modeling (that was mathematical, not fashion modeling..). He holds a Master's in environmental management in business and an engineering degree.  \n \nHe has expertise in stakeholder & influencer relations, risk and crisis management. He is passionate about making technology, and sustainability relevant and easily understood by non-experts. \n \nDionisis is the father of three energetic kids and the husband of a passionate communication consultant and author. Experience Public Policy manager Google September 2011  – Present (4 years) Athns, Greece Lead Google relationships with policy makers and other stakeholders in Greece, Cyprus and Western Balkans to advance policy positions towards socio-economic growth and prosperity. Adviser ACG - Athena Consulting Group January 2005  – Present (10 years 8 months) Public Policy manager Google September 2011  – Present (4 years) Athns, Greece Lead Google relationships with policy makers and other stakeholders in Greece, Cyprus and Western Balkans to advance policy positions towards socio-economic growth and prosperity. Public Policy manager Google September 2011  – Present (4 years) Athns, Greece Lead Google relationships with policy makers and other stakeholders in Greece, Cyprus and Western Balkans to advance policy positions towards socio-economic growth and prosperity. Adviser ACG - Athena Consulting Group January 2005  – Present (10 years 8 months) Adviser ACG - Athena Consulting Group January 2005  – Present (10 years 8 months) Skills Public Relations Marketing Communications Marketing Strategy Product Marketing Project Management Strategic Partnerships Sustainability Analysis Social Media Marketing Media Relations Digital Marketing Corporate Communications Brand Management Strategy International Relations Social Media Advertising Entrepreneurship Crisis Management New Business Development Strategic Communications Online Advertising Business Development Program Management Policy Event Management Management Marketing Management Business Strategy Change Management Market Research Government Start-ups Competitive Analysis Public Policy Strategic Planning Internal Communications Management Consulting Business Planning Corporate Social... Leadership Crisis Communications European Union Online Marketing See 29+     See less Skills  Public Relations Marketing Communications Marketing Strategy Product Marketing Project Management Strategic Partnerships Sustainability Analysis Social Media Marketing Media Relations Digital Marketing Corporate Communications Brand Management Strategy International Relations Social Media Advertising Entrepreneurship Crisis Management New Business Development Strategic Communications Online Advertising Business Development Program Management Policy Event Management Management Marketing Management Business Strategy Change Management Market Research Government Start-ups Competitive Analysis Public Policy Strategic Planning Internal Communications Management Consulting Business Planning Corporate Social... Leadership Crisis Communications European Union Online Marketing See 29+     See less Public Relations Marketing Communications Marketing Strategy Product Marketing Project Management Strategic Partnerships Sustainability Analysis Social Media Marketing Media Relations Digital Marketing Corporate Communications Brand Management Strategy International Relations Social Media Advertising Entrepreneurship Crisis Management New Business Development Strategic Communications Online Advertising Business Development Program Management Policy Event Management Management Marketing Management Business Strategy Change Management Market Research Government Start-ups Competitive Analysis Public Policy Strategic Planning Internal Communications Management Consulting Business Planning Corporate Social... Leadership Crisis Communications European Union Online Marketing See 29+     See less Public Relations Marketing Communications Marketing Strategy Product Marketing Project Management Strategic Partnerships Sustainability Analysis Social Media Marketing Media Relations Digital Marketing Corporate Communications Brand Management Strategy International Relations Social Media Advertising Entrepreneurship Crisis Management New Business Development Strategic Communications Online Advertising Business Development Program Management Policy Event Management Management Marketing Management Business Strategy Change Management Market Research Government Start-ups Competitive Analysis Public Policy Strategic Planning Internal Communications Management Consulting Business Planning Corporate Social... Leadership Crisis Communications European Union Online Marketing See 29+     See less ", "Summary - B.S. Biology, from Birmingham-Southern College, Phi Beta Kappa, Magna Cum Laude \n- Thorough knowledge and understanding of cellular and ecological biology concepts \n- Extensive field biology, research, teaching, community service, and childcare experinces \n- Excellent communication and interpersonal skills \n- Strong analytical and research skills \n- Strong teaching and facilitative skills \n- Excellent supervisory skills \n- Trustworthy - Responsible - Goal oriented - Quick learner - Dependable - Flexible Summary - B.S. Biology, from Birmingham-Southern College, Phi Beta Kappa, Magna Cum Laude \n- Thorough knowledge and understanding of cellular and ecological biology concepts \n- Extensive field biology, research, teaching, community service, and childcare experinces \n- Excellent communication and interpersonal skills \n- Strong analytical and research skills \n- Strong teaching and facilitative skills \n- Excellent supervisory skills \n- Trustworthy - Responsible - Goal oriented - Quick learner - Dependable - Flexible - B.S. Biology, from Birmingham-Southern College, Phi Beta Kappa, Magna Cum Laude \n- Thorough knowledge and understanding of cellular and ecological biology concepts \n- Extensive field biology, research, teaching, community service, and childcare experinces \n- Excellent communication and interpersonal skills \n- Strong analytical and research skills \n- Strong teaching and facilitative skills \n- Excellent supervisory skills \n- Trustworthy - Responsible - Goal oriented - Quick learner - Dependable - Flexible - B.S. Biology, from Birmingham-Southern College, Phi Beta Kappa, Magna Cum Laude \n- Thorough knowledge and understanding of cellular and ecological biology concepts \n- Extensive field biology, research, teaching, community service, and childcare experinces \n- Excellent communication and interpersonal skills \n- Strong analytical and research skills \n- Strong teaching and facilitative skills \n- Excellent supervisory skills \n- Trustworthy - Responsible - Goal oriented - Quick learner - Dependable - Flexible Experience Public Policy Manager Planned Parenthood Southeast, Inc. July 2014  – Present (1 year 2 months) Montgomery, Alabama Area -\tIncreased supporter base in Montgomery Co. by 18% over 8 months \n-\tCollaborated with student leaders on local campuses – Supervised student intern \n-\tMaintained accurate databases – Distributed email newsletters to supporters \n-\tOrganized events to identify and engage supporters  \n-\tEffectively communicated with a team across various cities and states \n Secretary Allies: LGBTQ+ Student Alliance May 2012  –  December 2014  (2 years 8 months) Birmingham, Alabama Area -\tPlanned events to engage group members and campus community \n-\tMaintained communication among group members \n-\tBuilt coalition partners within campus and Birmingham community \n-\tWorked to establish and implement campus LGBT+ sensitivity program \n Education Specialist Intern Turkey Creek Nature Preserve May 2013  –  August 2013  (4 months) Pinson, Alabama - Developed herpetology education program for elementary through college aged students \n- Compiled information on reptile care \n- Maintained and organized nature preserve \n- Performed functions requiring biology knowledge \n- Conducted research \n- Wrote informative blog entries on history of nature preserve \n- Coordinated volunteer groups \n- Communicated effectively with public Nanny Gilkerson Childcare Services August 2012  –  December 2012  (5 months) - Enforced rules while maintaining fun, safe environment \n- Assisted with schoolwork, study skills, and reading \n- Facilitated various hands-on activities \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Camp Counselor Camp Isidore Alterman May 2011  –  August 2012  (1 year 4 months) Greater Atlanta Area - Fostered pleasant, secure environment for children to try new experiences \n- Coordinated activities with public and coworkers \n- Facilitated programming with coworkers \n- Facilitated nature-based, science, and outdoor activities \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Afterschool Caregiver Urban Kids September 2011  –  December 2011  (4 months) Birmingham, Alabama Area - Tutored children in various subjects \n- Fostered safe environment while communicating rules \n- Collaborated with coworkers to create programming \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Reading Assistant Sagamore Hills Elementary February 2008  –  April 2010  (2 years 3 months) Greater Atlanta Area - Coached students in reading comprehension techniques \n- Helped improve reading skills of students \n- Reinforced lessons taught in school \n- Assisted with oversight of afterschool program Public Policy Manager Planned Parenthood Southeast, Inc. July 2014  – Present (1 year 2 months) Montgomery, Alabama Area -\tIncreased supporter base in Montgomery Co. by 18% over 8 months \n-\tCollaborated with student leaders on local campuses – Supervised student intern \n-\tMaintained accurate databases – Distributed email newsletters to supporters \n-\tOrganized events to identify and engage supporters  \n-\tEffectively communicated with a team across various cities and states \n Public Policy Manager Planned Parenthood Southeast, Inc. July 2014  – Present (1 year 2 months) Montgomery, Alabama Area -\tIncreased supporter base in Montgomery Co. by 18% over 8 months \n-\tCollaborated with student leaders on local campuses – Supervised student intern \n-\tMaintained accurate databases – Distributed email newsletters to supporters \n-\tOrganized events to identify and engage supporters  \n-\tEffectively communicated with a team across various cities and states \n Secretary Allies: LGBTQ+ Student Alliance May 2012  –  December 2014  (2 years 8 months) Birmingham, Alabama Area -\tPlanned events to engage group members and campus community \n-\tMaintained communication among group members \n-\tBuilt coalition partners within campus and Birmingham community \n-\tWorked to establish and implement campus LGBT+ sensitivity program \n Secretary Allies: LGBTQ+ Student Alliance May 2012  –  December 2014  (2 years 8 months) Birmingham, Alabama Area -\tPlanned events to engage group members and campus community \n-\tMaintained communication among group members \n-\tBuilt coalition partners within campus and Birmingham community \n-\tWorked to establish and implement campus LGBT+ sensitivity program \n Education Specialist Intern Turkey Creek Nature Preserve May 2013  –  August 2013  (4 months) Pinson, Alabama - Developed herpetology education program for elementary through college aged students \n- Compiled information on reptile care \n- Maintained and organized nature preserve \n- Performed functions requiring biology knowledge \n- Conducted research \n- Wrote informative blog entries on history of nature preserve \n- Coordinated volunteer groups \n- Communicated effectively with public Education Specialist Intern Turkey Creek Nature Preserve May 2013  –  August 2013  (4 months) Pinson, Alabama - Developed herpetology education program for elementary through college aged students \n- Compiled information on reptile care \n- Maintained and organized nature preserve \n- Performed functions requiring biology knowledge \n- Conducted research \n- Wrote informative blog entries on history of nature preserve \n- Coordinated volunteer groups \n- Communicated effectively with public Nanny Gilkerson Childcare Services August 2012  –  December 2012  (5 months) - Enforced rules while maintaining fun, safe environment \n- Assisted with schoolwork, study skills, and reading \n- Facilitated various hands-on activities \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Nanny Gilkerson Childcare Services August 2012  –  December 2012  (5 months) - Enforced rules while maintaining fun, safe environment \n- Assisted with schoolwork, study skills, and reading \n- Facilitated various hands-on activities \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Camp Counselor Camp Isidore Alterman May 2011  –  August 2012  (1 year 4 months) Greater Atlanta Area - Fostered pleasant, secure environment for children to try new experiences \n- Coordinated activities with public and coworkers \n- Facilitated programming with coworkers \n- Facilitated nature-based, science, and outdoor activities \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Camp Counselor Camp Isidore Alterman May 2011  –  August 2012  (1 year 4 months) Greater Atlanta Area - Fostered pleasant, secure environment for children to try new experiences \n- Coordinated activities with public and coworkers \n- Facilitated programming with coworkers \n- Facilitated nature-based, science, and outdoor activities \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Afterschool Caregiver Urban Kids September 2011  –  December 2011  (4 months) Birmingham, Alabama Area - Tutored children in various subjects \n- Fostered safe environment while communicating rules \n- Collaborated with coworkers to create programming \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Afterschool Caregiver Urban Kids September 2011  –  December 2011  (4 months) Birmingham, Alabama Area - Tutored children in various subjects \n- Fostered safe environment while communicating rules \n- Collaborated with coworkers to create programming \n- Utilized effective supervisory, instructive, facilitative, and interpersonal skills Reading Assistant Sagamore Hills Elementary February 2008  –  April 2010  (2 years 3 months) Greater Atlanta Area - Coached students in reading comprehension techniques \n- Helped improve reading skills of students \n- Reinforced lessons taught in school \n- Assisted with oversight of afterschool program Reading Assistant Sagamore Hills Elementary February 2008  –  April 2010  (2 years 3 months) Greater Atlanta Area - Coached students in reading comprehension techniques \n- Helped improve reading skills of students \n- Reinforced lessons taught in school \n- Assisted with oversight of afterschool program Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Research Teaching Community Outreach Biology Microsoft Office Volunteering Ecology Education Service Learning Childcare Writing Social Media Google Apps Microsoft Excel NGP VAN Convio Luminate Online See 1+     See less Skills  Research Teaching Community Outreach Biology Microsoft Office Volunteering Ecology Education Service Learning Childcare Writing Social Media Google Apps Microsoft Excel NGP VAN Convio Luminate Online See 1+     See less Research Teaching Community Outreach Biology Microsoft Office Volunteering Ecology Education Service Learning Childcare Writing Social Media Google Apps Microsoft Excel NGP VAN Convio Luminate Online See 1+     See less Research Teaching Community Outreach Biology Microsoft Office Volunteering Ecology Education Service Learning Childcare Writing Social Media Google Apps Microsoft Excel NGP VAN Convio Luminate Online See 1+     See less Education Birmingham-Southern College Bachelor of Science (B.S.),  Biology , General 2010  – 2013 Activities and Societies:  Alpha Lambda Delta Honor Society ,  Allies (Secretary) ,  Marching Band ,  Concert Band ,  W.I.L.D. (Women in Leadership Development) ,  Field Biology Club ,  Alternative Spring Break Birmingham-Southern College Bachelor of Science (B.S.),  Biology , General 2010  – 2013 Activities and Societies:  Alpha Lambda Delta Honor Society ,  Allies (Secretary) ,  Marching Band ,  Concert Band ,  W.I.L.D. (Women in Leadership Development) ,  Field Biology Club ,  Alternative Spring Break Birmingham-Southern College Bachelor of Science (B.S.),  Biology , General 2010  – 2013 Activities and Societies:  Alpha Lambda Delta Honor Society ,  Allies (Secretary) ,  Marching Band ,  Concert Band ,  W.I.L.D. (Women in Leadership Development) ,  Field Biology Club ,  Alternative Spring Break Birmingham-Southern College Bachelor of Science (B.S.),  Biology , General 2010  – 2013 Activities and Societies:  Alpha Lambda Delta Honor Society ,  Allies (Secretary) ,  Marching Band ,  Concert Band ,  W.I.L.D. (Women in Leadership Development) ,  Field Biology Club ,  Alternative Spring Break Honors & Awards Magna Cum Laude Birmingham-Southern College I graduated Magna Cum Laude from Birmingham-Southern College Phi Beta Kappa I am an inducted member of Phi Beta Kappa Magna Cum Laude Birmingham-Southern College I graduated Magna Cum Laude from Birmingham-Southern College Magna Cum Laude Birmingham-Southern College I graduated Magna Cum Laude from Birmingham-Southern College Magna Cum Laude Birmingham-Southern College I graduated Magna Cum Laude from Birmingham-Southern College Phi Beta Kappa I am an inducted member of Phi Beta Kappa Phi Beta Kappa I am an inducted member of Phi Beta Kappa Phi Beta Kappa I am an inducted member of Phi Beta Kappa ", "Summary Former Federal Senate Legislative Correspondent, Legislative Deputy to the Los Angeles City Council and Public Policy Manager for the Los Angeles Area Chamber of Commerce.  \n \nCurrently serving as Director of Communications and Public Policy for the President of the Los Angeles Unified School District.  \n \nBackground in Federal legislative and appropriations process, City of Los Angeles legislative process, budgetary process, public safety policy, planning, land use, technology and innovation. Summary Former Federal Senate Legislative Correspondent, Legislative Deputy to the Los Angeles City Council and Public Policy Manager for the Los Angeles Area Chamber of Commerce.  \n \nCurrently serving as Director of Communications and Public Policy for the President of the Los Angeles Unified School District.  \n \nBackground in Federal legislative and appropriations process, City of Los Angeles legislative process, budgetary process, public safety policy, planning, land use, technology and innovation. Former Federal Senate Legislative Correspondent, Legislative Deputy to the Los Angeles City Council and Public Policy Manager for the Los Angeles Area Chamber of Commerce.  \n \nCurrently serving as Director of Communications and Public Policy for the President of the Los Angeles Unified School District.  \n \nBackground in Federal legislative and appropriations process, City of Los Angeles legislative process, budgetary process, public safety policy, planning, land use, technology and innovation. Former Federal Senate Legislative Correspondent, Legislative Deputy to the Los Angeles City Council and Public Policy Manager for the Los Angeles Area Chamber of Commerce.  \n \nCurrently serving as Director of Communications and Public Policy for the President of the Los Angeles Unified School District.  \n \nBackground in Federal legislative and appropriations process, City of Los Angeles legislative process, budgetary process, public safety policy, planning, land use, technology and innovation. Experience Director of Communications and Policy Los Angeles Unified School District January 2015  – Present (8 months) Policy Manager - Planning, Land Use, and Technology Los Angeles Area Chamber of Commerce June 2014  –  January 2015  (8 months) Legislative Deputy/Policy Advisor - Los Angeles City Councilman Joe Buscaino City of Los Angeles January 2012  –  July 2014  (2 years 7 months) Legislative Deputy for Public Safety, Disaster Preparedness, and Labor Relations Class Facilitator The George Washington University October 2010  –  January 2013  (2 years 4 months) Responsible for instructing on-line classes of the Strategic Public Relations Masters degree program at the George Washington University \n \nInstruction of Public Relations practices, ethics, crisis management, corporate social responsibility tactics and strategies, and written products (op/ed, press releases) \n \nResponsible for grading student assignments, providing instruction on class materials, moderating student discussion boards, and time-sensitive responses to student class inquiries. Field Deputy-San Pedro for Councilman Joe Buscaino City of Los Angeles January 2012  –  August 2012  (8 months) san pedro, ca Representation of the Council Office at community meetings and events in San Pedro, CA Campaign Coordinator Joe Buscaino for LA City Council June 2011  –  October 2011  (5 months) San Pedro, CA Managing and creation of campaign and candidate daily schedule \n \nOversight of daily campaign office operations, management of Facebook and Twitter social media messaging, successful addition of over 500 fans to campaign Facebook page in less than two months \n \nResearch for candidate endorsement interviews, authoring candidate questionnaires, preparation of candidate for interviews \n \nAssisted campaign fundraising program that raised over $100,000 in less than two months \n \nStaffing candidate at events, providing on-site political advice and logistical support \n \nSolicitation of endorsements from organizations and community leaders Consultant HSG Campaigns February 2011  –  October 2011  (9 months) Providing logistical support at client fundraisers \n \nIdentifying potential fundraising opportunities and talent withing client organizations \n \nResearching strengths and weaknesses of client organizations, including management structure, communication methods, and strategic goals \n \nAssisting with client pitch meetings and post-meeting counseling sessions. Volunteer Coordinator Dr. Richard Vladovic for Los Angeles Unified School Discrict Board Campaign February 2011  –  March 2011  (2 months) Member of successful campaign team that achieved re-election of Board Member Vladovic.  \n \nResponsible for management of phone bank/canvass walking volunteers, volunteer recruitment , and data entry for phone bank/canvass results. \n \nTraining volunteers on proper potential voter interactions \n \nDaily writing and updating scripts for volunteer use \n \nDevelopment of improved tactics to engage Hispanic voters Legislative Correspondent Senator Herb Kohl December 2005  –  October 2010  (4 years 11 months) Tasked with responding to constituent correspondence on issues including, but not limited to, defense, defense appropriations, foreign relations, trade relations, and Department of Homeland Security reorganization \nTook regular meetings with constituents and lobbying groups on above mentioned issues and appropriation request concerns. Crowd management and screening for constituent meetings and VIP biographical research \nResearch and production of Congressional Record statements \nMember of committee tasked to develop new media outreach strategies for Senator Kohl including building a new Facebook page and an e-newsletter \n \nFederal Legislative Process\tFederal Appropriations Process\tAdobe Office Suite\t \n \nAdobe InDesign\tGoogle Docs\tMicrosoft Office 2010\t \n \nWindows 7\tMac OSX\tMac iOS Products Director of Communications and Policy Los Angeles Unified School District January 2015  – Present (8 months) Director of Communications and Policy Los Angeles Unified School District January 2015  – Present (8 months) Policy Manager - Planning, Land Use, and Technology Los Angeles Area Chamber of Commerce June 2014  –  January 2015  (8 months) Policy Manager - Planning, Land Use, and Technology Los Angeles Area Chamber of Commerce June 2014  –  January 2015  (8 months) Legislative Deputy/Policy Advisor - Los Angeles City Councilman Joe Buscaino City of Los Angeles January 2012  –  July 2014  (2 years 7 months) Legislative Deputy for Public Safety, Disaster Preparedness, and Labor Relations Legislative Deputy/Policy Advisor - Los Angeles City Councilman Joe Buscaino City of Los Angeles January 2012  –  July 2014  (2 years 7 months) Legislative Deputy for Public Safety, Disaster Preparedness, and Labor Relations Class Facilitator The George Washington University October 2010  –  January 2013  (2 years 4 months) Responsible for instructing on-line classes of the Strategic Public Relations Masters degree program at the George Washington University \n \nInstruction of Public Relations practices, ethics, crisis management, corporate social responsibility tactics and strategies, and written products (op/ed, press releases) \n \nResponsible for grading student assignments, providing instruction on class materials, moderating student discussion boards, and time-sensitive responses to student class inquiries. Class Facilitator The George Washington University October 2010  –  January 2013  (2 years 4 months) Responsible for instructing on-line classes of the Strategic Public Relations Masters degree program at the George Washington University \n \nInstruction of Public Relations practices, ethics, crisis management, corporate social responsibility tactics and strategies, and written products (op/ed, press releases) \n \nResponsible for grading student assignments, providing instruction on class materials, moderating student discussion boards, and time-sensitive responses to student class inquiries. Field Deputy-San Pedro for Councilman Joe Buscaino City of Los Angeles January 2012  –  August 2012  (8 months) san pedro, ca Representation of the Council Office at community meetings and events in San Pedro, CA Field Deputy-San Pedro for Councilman Joe Buscaino City of Los Angeles January 2012  –  August 2012  (8 months) san pedro, ca Representation of the Council Office at community meetings and events in San Pedro, CA Campaign Coordinator Joe Buscaino for LA City Council June 2011  –  October 2011  (5 months) San Pedro, CA Managing and creation of campaign and candidate daily schedule \n \nOversight of daily campaign office operations, management of Facebook and Twitter social media messaging, successful addition of over 500 fans to campaign Facebook page in less than two months \n \nResearch for candidate endorsement interviews, authoring candidate questionnaires, preparation of candidate for interviews \n \nAssisted campaign fundraising program that raised over $100,000 in less than two months \n \nStaffing candidate at events, providing on-site political advice and logistical support \n \nSolicitation of endorsements from organizations and community leaders Campaign Coordinator Joe Buscaino for LA City Council June 2011  –  October 2011  (5 months) San Pedro, CA Managing and creation of campaign and candidate daily schedule \n \nOversight of daily campaign office operations, management of Facebook and Twitter social media messaging, successful addition of over 500 fans to campaign Facebook page in less than two months \n \nResearch for candidate endorsement interviews, authoring candidate questionnaires, preparation of candidate for interviews \n \nAssisted campaign fundraising program that raised over $100,000 in less than two months \n \nStaffing candidate at events, providing on-site political advice and logistical support \n \nSolicitation of endorsements from organizations and community leaders Consultant HSG Campaigns February 2011  –  October 2011  (9 months) Providing logistical support at client fundraisers \n \nIdentifying potential fundraising opportunities and talent withing client organizations \n \nResearching strengths and weaknesses of client organizations, including management structure, communication methods, and strategic goals \n \nAssisting with client pitch meetings and post-meeting counseling sessions. Consultant HSG Campaigns February 2011  –  October 2011  (9 months) Providing logistical support at client fundraisers \n \nIdentifying potential fundraising opportunities and talent withing client organizations \n \nResearching strengths and weaknesses of client organizations, including management structure, communication methods, and strategic goals \n \nAssisting with client pitch meetings and post-meeting counseling sessions. Volunteer Coordinator Dr. Richard Vladovic for Los Angeles Unified School Discrict Board Campaign February 2011  –  March 2011  (2 months) Member of successful campaign team that achieved re-election of Board Member Vladovic.  \n \nResponsible for management of phone bank/canvass walking volunteers, volunteer recruitment , and data entry for phone bank/canvass results. \n \nTraining volunteers on proper potential voter interactions \n \nDaily writing and updating scripts for volunteer use \n \nDevelopment of improved tactics to engage Hispanic voters Volunteer Coordinator Dr. Richard Vladovic for Los Angeles Unified School Discrict Board Campaign February 2011  –  March 2011  (2 months) Member of successful campaign team that achieved re-election of Board Member Vladovic.  \n \nResponsible for management of phone bank/canvass walking volunteers, volunteer recruitment , and data entry for phone bank/canvass results. \n \nTraining volunteers on proper potential voter interactions \n \nDaily writing and updating scripts for volunteer use \n \nDevelopment of improved tactics to engage Hispanic voters Legislative Correspondent Senator Herb Kohl December 2005  –  October 2010  (4 years 11 months) Tasked with responding to constituent correspondence on issues including, but not limited to, defense, defense appropriations, foreign relations, trade relations, and Department of Homeland Security reorganization \nTook regular meetings with constituents and lobbying groups on above mentioned issues and appropriation request concerns. Crowd management and screening for constituent meetings and VIP biographical research \nResearch and production of Congressional Record statements \nMember of committee tasked to develop new media outreach strategies for Senator Kohl including building a new Facebook page and an e-newsletter \n \nFederal Legislative Process\tFederal Appropriations Process\tAdobe Office Suite\t \n \nAdobe InDesign\tGoogle Docs\tMicrosoft Office 2010\t \n \nWindows 7\tMac OSX\tMac iOS Products Legislative Correspondent Senator Herb Kohl December 2005  –  October 2010  (4 years 11 months) Tasked with responding to constituent correspondence on issues including, but not limited to, defense, defense appropriations, foreign relations, trade relations, and Department of Homeland Security reorganization \nTook regular meetings with constituents and lobbying groups on above mentioned issues and appropriation request concerns. Crowd management and screening for constituent meetings and VIP biographical research \nResearch and production of Congressional Record statements \nMember of committee tasked to develop new media outreach strategies for Senator Kohl including building a new Facebook page and an e-newsletter \n \nFederal Legislative Process\tFederal Appropriations Process\tAdobe Office Suite\t \n \nAdobe InDesign\tGoogle Docs\tMicrosoft Office 2010\t \n \nWindows 7\tMac OSX\tMac iOS Products Skills Social Media Federal Government Windows Mac OS X Public Relations Writing Public Speaking Journalism Press Releases Government Public Relations Crisis Communications Fundraising Legislative Relations Policy Facebook Research Legislation Policy Analysis Public Policy Politics Political Campaigns Public Affairs Strategic Communications Speech Writing Grassroots Coalitions International Relations Community Outreach Political Consulting Community Development Political Communication Political Science Media Relations Strategic Planning Nonprofits Foreign Policy Corporate Social... Economic Development Public Administration Message Development Defense Crisis Management Volunteer Management Management Campaigns Emergency Management Budgets Local Government Homeland Security Corporate Communications See 35+     See less Skills  Social Media Federal Government Windows Mac OS X Public Relations Writing Public Speaking Journalism Press Releases Government Public Relations Crisis Communications Fundraising Legislative Relations Policy Facebook Research Legislation Policy Analysis Public Policy Politics Political Campaigns Public Affairs Strategic Communications Speech Writing Grassroots Coalitions International Relations Community Outreach Political Consulting Community Development Political Communication Political Science Media Relations Strategic Planning Nonprofits Foreign Policy Corporate Social... Economic Development Public Administration Message Development Defense Crisis Management Volunteer Management Management Campaigns Emergency Management Budgets Local Government Homeland Security Corporate Communications See 35+     See less Social Media Federal Government Windows Mac OS X Public Relations Writing Public Speaking Journalism Press Releases Government Public Relations Crisis Communications Fundraising Legislative Relations Policy Facebook Research Legislation Policy Analysis Public Policy Politics Political Campaigns Public Affairs Strategic Communications Speech Writing Grassroots Coalitions International Relations Community Outreach Political Consulting Community Development Political Communication Political Science Media Relations Strategic Planning Nonprofits Foreign Policy Corporate Social... Economic Development Public Administration Message Development Defense Crisis Management Volunteer Management Management Campaigns Emergency Management Budgets Local Government Homeland Security Corporate Communications See 35+     See less Social Media Federal Government Windows Mac OS X Public Relations Writing Public Speaking Journalism Press Releases Government Public Relations Crisis Communications Fundraising Legislative Relations Policy Facebook Research Legislation Policy Analysis Public Policy Politics Political Campaigns Public Affairs Strategic Communications Speech Writing Grassroots Coalitions International Relations Community Outreach Political Consulting Community Development Political Communication Political Science Media Relations Strategic Planning Nonprofits Foreign Policy Corporate Social... Economic Development Public Administration Message Development Defense Crisis Management Volunteer Management Management Campaigns Emergency Management Budgets Local Government Homeland Security Corporate Communications See 35+     See less Education The George Washington University Master of Professional Studies,  Strategic Public Relations 2007  – 2009 University of Wisconsin-Stevens Point Bachelor of Arts,  Political Science 2000  – 2005 Activities and Societies:  WWSP-Radio Show Host ,  News Editor-The Pointer Campus Paper ,  TV Host-STV Deputy Head of Delegation Model UN Club The George Washington University Master of Professional Studies,  Strategic Public Relations 2007  – 2009 The George Washington University Master of Professional Studies,  Strategic Public Relations 2007  – 2009 The George Washington University Master of Professional Studies,  Strategic Public Relations 2007  – 2009 University of Wisconsin-Stevens Point Bachelor of Arts,  Political Science 2000  – 2005 Activities and Societies:  WWSP-Radio Show Host ,  News Editor-The Pointer Campus Paper ,  TV Host-STV Deputy Head of Delegation Model UN Club University of Wisconsin-Stevens Point Bachelor of Arts,  Political Science 2000  – 2005 Activities and Societies:  WWSP-Radio Show Host ,  News Editor-The Pointer Campus Paper ,  TV Host-STV Deputy Head of Delegation Model UN Club University of Wisconsin-Stevens Point Bachelor of Arts,  Political Science 2000  – 2005 Activities and Societies:  WWSP-Radio Show Host ,  News Editor-The Pointer Campus Paper ,  TV Host-STV Deputy Head of Delegation Model UN Club ", "Summary Public policy and government affairs professional with a strong track record in the technology and telecomms sectors, built across senior roles in government, global ICT players, and start-ups in the European and Asia-Pacific regions \n \nSpecialties: Strategy formulation and advocacy on technology policy, including telecomms access issues, content regulation, and privacy and security \n Summary Public policy and government affairs professional with a strong track record in the technology and telecomms sectors, built across senior roles in government, global ICT players, and start-ups in the European and Asia-Pacific regions \n \nSpecialties: Strategy formulation and advocacy on technology policy, including telecomms access issues, content regulation, and privacy and security \n Public policy and government affairs professional with a strong track record in the technology and telecomms sectors, built across senior roles in government, global ICT players, and start-ups in the European and Asia-Pacific regions \n \nSpecialties: Strategy formulation and advocacy on technology policy, including telecomms access issues, content regulation, and privacy and security \n Public policy and government affairs professional with a strong track record in the technology and telecomms sectors, built across senior roles in government, global ICT players, and start-ups in the European and Asia-Pacific regions \n \nSpecialties: Strategy formulation and advocacy on technology policy, including telecomms access issues, content regulation, and privacy and security \n Experience Director Public Policy & Govt Affairs (Northern Europe) Google March 2014  – Present (1 year 6 months) London, United Kingdom Head of Public Policy and Govt Affairs (Australia/NZ) Google April 2009  –  March 2014  (5 years) Sydney Area, Australia European Public Policy Manager Google September 2007  –  April 2009  (1 year 8 months) Dublin Head of Regulatory Affairs Smart Telecom March 2005  –  February 2007  (2 years) Executive Director Association of Licensed Telecomms Operators (ALTO) 2002  –  2005  (3 years) Industry group for new entrant telecomms operators Regulatory Affairs Manager BT Ireland 1999  –  2001  (2 years) Policy Executive Department of Communications 1995  –  1999  (4 years) Ireland Director Public Policy & Govt Affairs (Northern Europe) Google March 2014  – Present (1 year 6 months) London, United Kingdom Director Public Policy & Govt Affairs (Northern Europe) Google March 2014  – Present (1 year 6 months) London, United Kingdom Head of Public Policy and Govt Affairs (Australia/NZ) Google April 2009  –  March 2014  (5 years) Sydney Area, Australia Head of Public Policy and Govt Affairs (Australia/NZ) Google April 2009  –  March 2014  (5 years) Sydney Area, Australia European Public Policy Manager Google September 2007  –  April 2009  (1 year 8 months) Dublin European Public Policy Manager Google September 2007  –  April 2009  (1 year 8 months) Dublin Head of Regulatory Affairs Smart Telecom March 2005  –  February 2007  (2 years) Head of Regulatory Affairs Smart Telecom March 2005  –  February 2007  (2 years) Executive Director Association of Licensed Telecomms Operators (ALTO) 2002  –  2005  (3 years) Industry group for new entrant telecomms operators Executive Director Association of Licensed Telecomms Operators (ALTO) 2002  –  2005  (3 years) Industry group for new entrant telecomms operators Regulatory Affairs Manager BT Ireland 1999  –  2001  (2 years) Regulatory Affairs Manager BT Ireland 1999  –  2001  (2 years) Policy Executive Department of Communications 1995  –  1999  (4 years) Ireland Policy Executive Department of Communications 1995  –  1999  (4 years) Ireland Skills Management Policy Program Management Start-ups Strategic Communications Intellectual Property Government Public Policy Change Management Stakeholder Engagement Strategy Telecommunications European Union Public Relations Google Adwords Business Strategy Regulatory Affairs Product Management Privacy Law E-commerce Competitive Analysis Team Leadership Strategic Planning Policy Analysis Security Project Management Media Relations Stakeholder Management Social Media Corporate Communications Google Apps See 16+     See less Skills  Management Policy Program Management Start-ups Strategic Communications Intellectual Property Government Public Policy Change Management Stakeholder Engagement Strategy Telecommunications European Union Public Relations Google Adwords Business Strategy Regulatory Affairs Product Management Privacy Law E-commerce Competitive Analysis Team Leadership Strategic Planning Policy Analysis Security Project Management Media Relations Stakeholder Management Social Media Corporate Communications Google Apps See 16+     See less Management Policy Program Management Start-ups Strategic Communications Intellectual Property Government Public Policy Change Management Stakeholder Engagement Strategy Telecommunications European Union Public Relations Google Adwords Business Strategy Regulatory Affairs Product Management Privacy Law E-commerce Competitive Analysis Team Leadership Strategic Planning Policy Analysis Security Project Management Media Relations Stakeholder Management Social Media Corporate Communications Google Apps See 16+     See less Management Policy Program Management Start-ups Strategic Communications Intellectual Property Government Public Policy Change Management Stakeholder Engagement Strategy Telecommunications European Union Public Relations Google Adwords Business Strategy Regulatory Affairs Product Management Privacy Law E-commerce Competitive Analysis Team Leadership Strategic Planning Policy Analysis Security Project Management Media Relations Stakeholder Management Social Media Corporate Communications Google Apps See 16+     See less Education Trinity College Dublin MSc,  Economic Policy Studies 2003  – 2005 University College Cork B. Commerce,  MIS ,  Economics ,  French 1990  – 1995 Higher Diploma in Computer Science 1994/1995 Trinity College Dublin MSc,  Economic Policy Studies 2003  – 2005 Trinity College Dublin MSc,  Economic Policy Studies 2003  – 2005 Trinity College Dublin MSc,  Economic Policy Studies 2003  – 2005 University College Cork B. Commerce,  MIS ,  Economics ,  French 1990  – 1995 Higher Diploma in Computer Science 1994/1995 University College Cork B. Commerce,  MIS ,  Economics ,  French 1990  – 1995 Higher Diploma in Computer Science 1994/1995 University College Cork B. Commerce,  MIS ,  Economics ,  French 1990  – 1995 Higher Diploma in Computer Science 1994/1995 ", "Experience Public Policy Manager, Central and Eastern Europe Google January 2015  – Present (8 months) Warsaw Ambassador at large Ministry of Foreign Affairs, Lithuania September 2014  –  November 2014  (3 months) EU Director European Affairs Ministry of Foreign Affairs Lithuania July 2010  –  August 2014  (4 years 2 months) Vilnius Responsible for the program of the Lithuanian Presidency of the EU Council (575 dossiers, priorities – multiannual financial framework, banking union, energy policy, EU neighbourhood, digital agenda) \nAssisting the Head of State at European Councils \nAssisting the Minister at General Affairs Council \nOverall coordination of the national system of EU affairs ( weekly meetings of the Governmental EU Committee – 13 ministries at vice-minister level) \nAssisting and deputising the Chair of the Governmental EU Committee \nMaintaining the inter-institutional relations (relations with national Parliament, convening and chairing inter-ministerial meetings) \nNegotiations of the Multiannual financial framework (total EU 7 year budget 962 bln. EUR, Lithuanian national envelope 13 bln. EUR) \nManagement of the EU General Affairs Council agenda \nMember of the Network of the EU Council Presidency Coordinators \nMember of the Group for Communication of the EU Council Presidency \nMember of the National commission for absorption of European Structural and Investment Funds \nRelations with Central and Western European states, Turkey, Balkan countries, \nEU Neighbourhood policies, relations with Ukraine, Moldova, Georgia, Belarus Project Administrator Ministry of foreign affairs of Lithuania 2010  –  August 2014  (4 years) Vilnius Short term expert starting 2014 in EU twinning project in Croatia “Strengthening the capacities of the Ministry of Foreign and European Affairs (MFEA) in performing its role as a national coordinator of EU affairs”. \n \nProject leader 2010-2011, later member of the steering group of the project ‘Evaluation of Lithuania’s participation in the EU initiatives” \nActivities: idea generation, ensuring successful submission of application for financing, budget and activity management.  \n•\tThe aim of the project is to evaluate the impact of the participation of Lithuania in the EU regional cooperation, energy security, EU 2020, budgetary revision, EU border protection and other initiatives and to make recommendations on Lithuania‘s positions. \n•\tActivities of the project – 8 studies and round table discussions were carried out during the implementation of the project.  \nScope of the project: - 0.3 million EUR \n \nMember of the steering group of the project “Promotion of Lithuania’s networking in the EU” \nActivities: idea generation, applications for financing, budget and activity supervision. \n•\tThe aim of the project is to facilitate the networking between the participants of the EU decision making and to create necessary infrastructure for the further integration of Lithuania to the EU and strengthening the influence of Lithuania in the EU decision making. \nScope of the project: - 4.9 million EUR \n \nMember of the steering group of the project “Enhancing Efficiency of Lithuania’s EU Affairs System” \nActivities: idea generation, applications for financing, budget and activity supervision. \n•\tThe aim of the project is to enhance efficiency of Lithuania’s EU affairs system at the institutional and inter-institutional level. It is expected that the project will contribute to smoother functioning of the EU affairs system as well as ensuring of quality and consistency of Lithuania’s EU policy.  \nScope of the project: - 2.3 million EUR Deputy Head Lithuanian Embassy in USA July 2007  –  July 2010  (3 years 1 month) Washington DC Relations with US Administration, Congress and think-tanks on European neighbourhood policies, security policy and energy policy  \nCoordination of EU agenda in the US \nRelations with Lithuanian business community in US Head of Division, Counsellor Ministry of Foreign Affairs, Lithuania 2000  –  2007  (7 years) ▪\tAssisting the Foreign Minister at EU General Affairs/External relations Council \n▪\tDrafting procedures of the coordination mechanism within the MFA (Political Director’s role, relations with other departments of the MFA, weekly coordination meetings) \n▪\tDesigning of the computerized data base for CFSP coordination \n▪\tDaily coordination of CFSP issues running the daily routine CFSP business, coordination of national and EU positions on CFSP issues, maintaining relations with President’s Office, Prime Minister’s office and with Parliament \n▪\tNegotiations on the Constitutional Treaty of the EU \n▪\tEU Neighbourhood policy: designing the concept, drafting and presentation of the national position Lecturer Mykolas Romeris University September 2001  –  December 2003  (2 years 4 months) Public Policy Manager, Central and Eastern Europe Google January 2015  – Present (8 months) Warsaw Public Policy Manager, Central and Eastern Europe Google January 2015  – Present (8 months) Warsaw Ambassador at large Ministry of Foreign Affairs, Lithuania September 2014  –  November 2014  (3 months) EU Ambassador at large Ministry of Foreign Affairs, Lithuania September 2014  –  November 2014  (3 months) EU Director European Affairs Ministry of Foreign Affairs Lithuania July 2010  –  August 2014  (4 years 2 months) Vilnius Responsible for the program of the Lithuanian Presidency of the EU Council (575 dossiers, priorities – multiannual financial framework, banking union, energy policy, EU neighbourhood, digital agenda) \nAssisting the Head of State at European Councils \nAssisting the Minister at General Affairs Council \nOverall coordination of the national system of EU affairs ( weekly meetings of the Governmental EU Committee – 13 ministries at vice-minister level) \nAssisting and deputising the Chair of the Governmental EU Committee \nMaintaining the inter-institutional relations (relations with national Parliament, convening and chairing inter-ministerial meetings) \nNegotiations of the Multiannual financial framework (total EU 7 year budget 962 bln. EUR, Lithuanian national envelope 13 bln. EUR) \nManagement of the EU General Affairs Council agenda \nMember of the Network of the EU Council Presidency Coordinators \nMember of the Group for Communication of the EU Council Presidency \nMember of the National commission for absorption of European Structural and Investment Funds \nRelations with Central and Western European states, Turkey, Balkan countries, \nEU Neighbourhood policies, relations with Ukraine, Moldova, Georgia, Belarus Director European Affairs Ministry of Foreign Affairs Lithuania July 2010  –  August 2014  (4 years 2 months) Vilnius Responsible for the program of the Lithuanian Presidency of the EU Council (575 dossiers, priorities – multiannual financial framework, banking union, energy policy, EU neighbourhood, digital agenda) \nAssisting the Head of State at European Councils \nAssisting the Minister at General Affairs Council \nOverall coordination of the national system of EU affairs ( weekly meetings of the Governmental EU Committee – 13 ministries at vice-minister level) \nAssisting and deputising the Chair of the Governmental EU Committee \nMaintaining the inter-institutional relations (relations with national Parliament, convening and chairing inter-ministerial meetings) \nNegotiations of the Multiannual financial framework (total EU 7 year budget 962 bln. EUR, Lithuanian national envelope 13 bln. EUR) \nManagement of the EU General Affairs Council agenda \nMember of the Network of the EU Council Presidency Coordinators \nMember of the Group for Communication of the EU Council Presidency \nMember of the National commission for absorption of European Structural and Investment Funds \nRelations with Central and Western European states, Turkey, Balkan countries, \nEU Neighbourhood policies, relations with Ukraine, Moldova, Georgia, Belarus Project Administrator Ministry of foreign affairs of Lithuania 2010  –  August 2014  (4 years) Vilnius Short term expert starting 2014 in EU twinning project in Croatia “Strengthening the capacities of the Ministry of Foreign and European Affairs (MFEA) in performing its role as a national coordinator of EU affairs”. \n \nProject leader 2010-2011, later member of the steering group of the project ‘Evaluation of Lithuania’s participation in the EU initiatives” \nActivities: idea generation, ensuring successful submission of application for financing, budget and activity management.  \n•\tThe aim of the project is to evaluate the impact of the participation of Lithuania in the EU regional cooperation, energy security, EU 2020, budgetary revision, EU border protection and other initiatives and to make recommendations on Lithuania‘s positions. \n•\tActivities of the project – 8 studies and round table discussions were carried out during the implementation of the project.  \nScope of the project: - 0.3 million EUR \n \nMember of the steering group of the project “Promotion of Lithuania’s networking in the EU” \nActivities: idea generation, applications for financing, budget and activity supervision. \n•\tThe aim of the project is to facilitate the networking between the participants of the EU decision making and to create necessary infrastructure for the further integration of Lithuania to the EU and strengthening the influence of Lithuania in the EU decision making. \nScope of the project: - 4.9 million EUR \n \nMember of the steering group of the project “Enhancing Efficiency of Lithuania’s EU Affairs System” \nActivities: idea generation, applications for financing, budget and activity supervision. \n•\tThe aim of the project is to enhance efficiency of Lithuania’s EU affairs system at the institutional and inter-institutional level. It is expected that the project will contribute to smoother functioning of the EU affairs system as well as ensuring of quality and consistency of Lithuania’s EU policy.  \nScope of the project: - 2.3 million EUR Project Administrator Ministry of foreign affairs of Lithuania 2010  –  August 2014  (4 years) Vilnius Short term expert starting 2014 in EU twinning project in Croatia “Strengthening the capacities of the Ministry of Foreign and European Affairs (MFEA) in performing its role as a national coordinator of EU affairs”. \n \nProject leader 2010-2011, later member of the steering group of the project ‘Evaluation of Lithuania’s participation in the EU initiatives” \nActivities: idea generation, ensuring successful submission of application for financing, budget and activity management.  \n•\tThe aim of the project is to evaluate the impact of the participation of Lithuania in the EU regional cooperation, energy security, EU 2020, budgetary revision, EU border protection and other initiatives and to make recommendations on Lithuania‘s positions. \n•\tActivities of the project – 8 studies and round table discussions were carried out during the implementation of the project.  \nScope of the project: - 0.3 million EUR \n \nMember of the steering group of the project “Promotion of Lithuania’s networking in the EU” \nActivities: idea generation, applications for financing, budget and activity supervision. \n•\tThe aim of the project is to facilitate the networking between the participants of the EU decision making and to create necessary infrastructure for the further integration of Lithuania to the EU and strengthening the influence of Lithuania in the EU decision making. \nScope of the project: - 4.9 million EUR \n \nMember of the steering group of the project “Enhancing Efficiency of Lithuania’s EU Affairs System” \nActivities: idea generation, applications for financing, budget and activity supervision. \n•\tThe aim of the project is to enhance efficiency of Lithuania’s EU affairs system at the institutional and inter-institutional level. It is expected that the project will contribute to smoother functioning of the EU affairs system as well as ensuring of quality and consistency of Lithuania’s EU policy.  \nScope of the project: - 2.3 million EUR Deputy Head Lithuanian Embassy in USA July 2007  –  July 2010  (3 years 1 month) Washington DC Relations with US Administration, Congress and think-tanks on European neighbourhood policies, security policy and energy policy  \nCoordination of EU agenda in the US \nRelations with Lithuanian business community in US Deputy Head Lithuanian Embassy in USA July 2007  –  July 2010  (3 years 1 month) Washington DC Relations with US Administration, Congress and think-tanks on European neighbourhood policies, security policy and energy policy  \nCoordination of EU agenda in the US \nRelations with Lithuanian business community in US Head of Division, Counsellor Ministry of Foreign Affairs, Lithuania 2000  –  2007  (7 years) ▪\tAssisting the Foreign Minister at EU General Affairs/External relations Council \n▪\tDrafting procedures of the coordination mechanism within the MFA (Political Director’s role, relations with other departments of the MFA, weekly coordination meetings) \n▪\tDesigning of the computerized data base for CFSP coordination \n▪\tDaily coordination of CFSP issues running the daily routine CFSP business, coordination of national and EU positions on CFSP issues, maintaining relations with President’s Office, Prime Minister’s office and with Parliament \n▪\tNegotiations on the Constitutional Treaty of the EU \n▪\tEU Neighbourhood policy: designing the concept, drafting and presentation of the national position Head of Division, Counsellor Ministry of Foreign Affairs, Lithuania 2000  –  2007  (7 years) ▪\tAssisting the Foreign Minister at EU General Affairs/External relations Council \n▪\tDrafting procedures of the coordination mechanism within the MFA (Political Director’s role, relations with other departments of the MFA, weekly coordination meetings) \n▪\tDesigning of the computerized data base for CFSP coordination \n▪\tDaily coordination of CFSP issues running the daily routine CFSP business, coordination of national and EU positions on CFSP issues, maintaining relations with President’s Office, Prime Minister’s office and with Parliament \n▪\tNegotiations on the Constitutional Treaty of the EU \n▪\tEU Neighbourhood policy: designing the concept, drafting and presentation of the national position Lecturer Mykolas Romeris University September 2001  –  December 2003  (2 years 4 months) Lecturer Mykolas Romeris University September 2001  –  December 2003  (2 years 4 months) Languages Lithuanian Native or bilingual proficiency English Full professional proficiency Russian Full professional proficiency French Full professional proficiency Polish Limited working proficiency Italian Elementary proficiency Lithuanian Native or bilingual proficiency English Full professional proficiency Russian Full professional proficiency French Full professional proficiency Polish Limited working proficiency Italian Elementary proficiency Lithuanian Native or bilingual proficiency English Full professional proficiency Russian Full professional proficiency French Full professional proficiency Polish Limited working proficiency Italian Elementary proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills International Relations European Union Diplomacy Foreign Policy Human Rights European Law Political Science International... Management Politics Government Public Diplomacy Energy Policy Policy Analysis Skills  International Relations European Union Diplomacy Foreign Policy Human Rights European Law Political Science International... Management Politics Government Public Diplomacy Energy Policy Policy Analysis International Relations European Union Diplomacy Foreign Policy Human Rights European Law Political Science International... Management Politics Government Public Diplomacy Energy Policy Policy Analysis International Relations European Union Diplomacy Foreign Policy Human Rights European Law Political Science International... Management Politics Government Public Diplomacy Energy Policy Policy Analysis Education Vilniaus Universitetas / Vilnius University Master of Law 1990  – 1995 Université Jean Moulin (Lyon III) DEUF,  Law 1993  – 1994 European Institute of Public Administration 2004  – 2004 Ecole nationale d'Administration 2003  – 2003 Swedish National Defence College 2001  – 2001 J.Jablonskio Vilniaus Universitetas / Vilnius University Master of Law 1990  – 1995 Vilniaus Universitetas / Vilnius University Master of Law 1990  – 1995 Vilniaus Universitetas / Vilnius University Master of Law 1990  – 1995 Université Jean Moulin (Lyon III) DEUF,  Law 1993  – 1994 Université Jean Moulin (Lyon III) DEUF,  Law 1993  – 1994 Université Jean Moulin (Lyon III) DEUF,  Law 1993  – 1994 European Institute of Public Administration 2004  – 2004 European Institute of Public Administration 2004  – 2004 European Institute of Public Administration 2004  – 2004 Ecole nationale d'Administration 2003  – 2003 Ecole nationale d'Administration 2003  – 2003 Ecole nationale d'Administration 2003  – 2003 Swedish National Defence College 2001  – 2001 Swedish National Defence College 2001  – 2001 Swedish National Defence College 2001  – 2001 J.Jablonskio J.Jablonskio J.Jablonskio ", "Experience Associate Product Marketing Manager Google February 2014  –  January 2015  (1 year) Athens, Greece Reported to CMM, worked closely with Head of SMB Marketing. \nWorked on B2B (mainly) and B2C products. Three intern contract renewals. \n \n════════ B2B ════════ \n \n► Google AdWords Support Call Center for new advertisers: program 'Jumpstart' \nUndertook responsibilities including: lead delivery growth, influencing sales performance, reps' trainining plan, designing financial incentives, identifying new growth initiatives, management calls with Google and vendor counterparts, quarterly planning, to grow this revenue stream to ±35% of marketing's revenue per quarter. \n \n► Google Partners Program [google.gr/partners] \nExecuted the 'High Flyers' agency business development program for ±20 agencies for a quarter. Planned AdWords certification events, constructed website; design and content \n \n► Google My Business [google.gr/business] \nServed as the marketing POC. Collaborated with creative agency on promotional brochure; localized GMB website. Supported the Ministry of Administrative Reform and e-Governance and Google's Public Policy manager, and accomplished the integration of the greek citizen service centers into GMB. \n \n► Travel Initiative \"Grow Greek Tourism Online\" [g.co/growgreektourism] \nSupported CMM with the initiative's pilot, handled communication flow,  \nwebsite's design, pre and post event customer support system, email campaigns  \n \n► Marketing Channels \nIdentified issues in lead delivery, responsible for continuous channel oprimization of House Ads and Embedded Promo (achieved overdelivery of +100%). Formed greek Cross-Sell and Funnel Management campaigns. \n \n════════ B2C ════════ \n \n► Doodles \nServed as a Local Doodle Manager and managed the content displayed on the greek domain. \nPrepared ±60 doodles and oneboxes for Greece; generated 100+ positive media mentions by creating the local \"Dionysios Solomos\" doodle; prepared 20 ideas for local and global 2015 doodles \n \n► Google Science Fair [googlesciencefair.com] \nLaunched and coordinated the first local GSF competition in Greece. Founder InstantHome February 2013  –  January 2014  (1 year) Athens, Greece A startup aiming to resolve housing problems. Based on a bidding platform for short term house rental. Offering minimum costs for renters and minimising maintenance costs for owners. \n \nKey responsibilities: \n- Team management \n- Pitching to investors \n- Business planning \n- Project management Founder InfoBuddy January 2011  –  January 2014  (3 years 1 month) Athens, Greece Several information websites based on instant news sharing and high user engagement. URLs provided on request.  \n \nHighest achievements: 2M+ views in 1.5 years, max 60K+ views per day, 10K highly engaged and every day visiting users, best customer support among news' websites in Greece, stable revenue stream from advertising - mainly Google AdSense, established partnerships with industry's key information sources - news leadership, top in Google's organic search \n \nKey responsibilities: \n- Web design \n- SEO \n- Revenue sources \n- Customer support \n- Partnerships Co-Founder YouNew November 2012  –  March 2013  (5 months) Athens, Greece Startup attempt. Advice website, helping users improve key areas of their life (educational, professional, relationships). \n \nKey responsibilities: \n- Business planning \n- Idea pitch Operations Manager Europaints September 2010  –  February 2013  (2 years 6 months) Athens, Greece Renovations and constructions company, family business. \n \nKey responsibilities: \n- Deals with suppliers \n- Web design & SEO \n- Establishing partnerships \n- Marketing strategy \n- Sales pitches \n- Google AdWords \n \nKey achievements: \n- 80% of leads coming from my actions \n- 20% decrease in seasonality's impact on revenue Freelance Interpreter and Translator January 2011  –  January 2013  (2 years 1 month) Athens, Greece Cooperation with several online translation agencies. Languages: english, polish, greek. Associate Product Marketing Manager Google February 2014  –  January 2015  (1 year) Athens, Greece Reported to CMM, worked closely with Head of SMB Marketing. \nWorked on B2B (mainly) and B2C products. Three intern contract renewals. \n \n════════ B2B ════════ \n \n► Google AdWords Support Call Center for new advertisers: program 'Jumpstart' \nUndertook responsibilities including: lead delivery growth, influencing sales performance, reps' trainining plan, designing financial incentives, identifying new growth initiatives, management calls with Google and vendor counterparts, quarterly planning, to grow this revenue stream to ±35% of marketing's revenue per quarter. \n \n► Google Partners Program [google.gr/partners] \nExecuted the 'High Flyers' agency business development program for ±20 agencies for a quarter. Planned AdWords certification events, constructed website; design and content \n \n► Google My Business [google.gr/business] \nServed as the marketing POC. Collaborated with creative agency on promotional brochure; localized GMB website. Supported the Ministry of Administrative Reform and e-Governance and Google's Public Policy manager, and accomplished the integration of the greek citizen service centers into GMB. \n \n► Travel Initiative \"Grow Greek Tourism Online\" [g.co/growgreektourism] \nSupported CMM with the initiative's pilot, handled communication flow,  \nwebsite's design, pre and post event customer support system, email campaigns  \n \n► Marketing Channels \nIdentified issues in lead delivery, responsible for continuous channel oprimization of House Ads and Embedded Promo (achieved overdelivery of +100%). Formed greek Cross-Sell and Funnel Management campaigns. \n \n════════ B2C ════════ \n \n► Doodles \nServed as a Local Doodle Manager and managed the content displayed on the greek domain. \nPrepared ±60 doodles and oneboxes for Greece; generated 100+ positive media mentions by creating the local \"Dionysios Solomos\" doodle; prepared 20 ideas for local and global 2015 doodles \n \n► Google Science Fair [googlesciencefair.com] \nLaunched and coordinated the first local GSF competition in Greece. Associate Product Marketing Manager Google February 2014  –  January 2015  (1 year) Athens, Greece Reported to CMM, worked closely with Head of SMB Marketing. \nWorked on B2B (mainly) and B2C products. Three intern contract renewals. \n \n════════ B2B ════════ \n \n► Google AdWords Support Call Center for new advertisers: program 'Jumpstart' \nUndertook responsibilities including: lead delivery growth, influencing sales performance, reps' trainining plan, designing financial incentives, identifying new growth initiatives, management calls with Google and vendor counterparts, quarterly planning, to grow this revenue stream to ±35% of marketing's revenue per quarter. \n \n► Google Partners Program [google.gr/partners] \nExecuted the 'High Flyers' agency business development program for ±20 agencies for a quarter. Planned AdWords certification events, constructed website; design and content \n \n► Google My Business [google.gr/business] \nServed as the marketing POC. Collaborated with creative agency on promotional brochure; localized GMB website. Supported the Ministry of Administrative Reform and e-Governance and Google's Public Policy manager, and accomplished the integration of the greek citizen service centers into GMB. \n \n► Travel Initiative \"Grow Greek Tourism Online\" [g.co/growgreektourism] \nSupported CMM with the initiative's pilot, handled communication flow,  \nwebsite's design, pre and post event customer support system, email campaigns  \n \n► Marketing Channels \nIdentified issues in lead delivery, responsible for continuous channel oprimization of House Ads and Embedded Promo (achieved overdelivery of +100%). Formed greek Cross-Sell and Funnel Management campaigns. \n \n════════ B2C ════════ \n \n► Doodles \nServed as a Local Doodle Manager and managed the content displayed on the greek domain. \nPrepared ±60 doodles and oneboxes for Greece; generated 100+ positive media mentions by creating the local \"Dionysios Solomos\" doodle; prepared 20 ideas for local and global 2015 doodles \n \n► Google Science Fair [googlesciencefair.com] \nLaunched and coordinated the first local GSF competition in Greece. Founder InstantHome February 2013  –  January 2014  (1 year) Athens, Greece A startup aiming to resolve housing problems. Based on a bidding platform for short term house rental. Offering minimum costs for renters and minimising maintenance costs for owners. \n \nKey responsibilities: \n- Team management \n- Pitching to investors \n- Business planning \n- Project management Founder InstantHome February 2013  –  January 2014  (1 year) Athens, Greece A startup aiming to resolve housing problems. Based on a bidding platform for short term house rental. Offering minimum costs for renters and minimising maintenance costs for owners. \n \nKey responsibilities: \n- Team management \n- Pitching to investors \n- Business planning \n- Project management Founder InfoBuddy January 2011  –  January 2014  (3 years 1 month) Athens, Greece Several information websites based on instant news sharing and high user engagement. URLs provided on request.  \n \nHighest achievements: 2M+ views in 1.5 years, max 60K+ views per day, 10K highly engaged and every day visiting users, best customer support among news' websites in Greece, stable revenue stream from advertising - mainly Google AdSense, established partnerships with industry's key information sources - news leadership, top in Google's organic search \n \nKey responsibilities: \n- Web design \n- SEO \n- Revenue sources \n- Customer support \n- Partnerships Founder InfoBuddy January 2011  –  January 2014  (3 years 1 month) Athens, Greece Several information websites based on instant news sharing and high user engagement. URLs provided on request.  \n \nHighest achievements: 2M+ views in 1.5 years, max 60K+ views per day, 10K highly engaged and every day visiting users, best customer support among news' websites in Greece, stable revenue stream from advertising - mainly Google AdSense, established partnerships with industry's key information sources - news leadership, top in Google's organic search \n \nKey responsibilities: \n- Web design \n- SEO \n- Revenue sources \n- Customer support \n- Partnerships Co-Founder YouNew November 2012  –  March 2013  (5 months) Athens, Greece Startup attempt. Advice website, helping users improve key areas of their life (educational, professional, relationships). \n \nKey responsibilities: \n- Business planning \n- Idea pitch Co-Founder YouNew November 2012  –  March 2013  (5 months) Athens, Greece Startup attempt. Advice website, helping users improve key areas of their life (educational, professional, relationships). \n \nKey responsibilities: \n- Business planning \n- Idea pitch Operations Manager Europaints September 2010  –  February 2013  (2 years 6 months) Athens, Greece Renovations and constructions company, family business. \n \nKey responsibilities: \n- Deals with suppliers \n- Web design & SEO \n- Establishing partnerships \n- Marketing strategy \n- Sales pitches \n- Google AdWords \n \nKey achievements: \n- 80% of leads coming from my actions \n- 20% decrease in seasonality's impact on revenue Operations Manager Europaints September 2010  –  February 2013  (2 years 6 months) Athens, Greece Renovations and constructions company, family business. \n \nKey responsibilities: \n- Deals with suppliers \n- Web design & SEO \n- Establishing partnerships \n- Marketing strategy \n- Sales pitches \n- Google AdWords \n \nKey achievements: \n- 80% of leads coming from my actions \n- 20% decrease in seasonality's impact on revenue Freelance Interpreter and Translator January 2011  –  January 2013  (2 years 1 month) Athens, Greece Cooperation with several online translation agencies. Languages: english, polish, greek. Freelance Interpreter and Translator January 2011  –  January 2013  (2 years 1 month) Athens, Greece Cooperation with several online translation agencies. Languages: english, polish, greek. Languages English Full professional proficiency Greek Native or bilingual proficiency Polish Native or bilingual proficiency French Limited working proficiency German Elementary proficiency English Full professional proficiency Greek Native or bilingual proficiency Polish Native or bilingual proficiency French Limited working proficiency German Elementary proficiency English Full professional proficiency Greek Native or bilingual proficiency Polish Native or bilingual proficiency French Limited working proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Online Advertising Start-ups Marketing Strategy Entrepreneurship Social Media Marketing SEO Social Media Leadership Business Strategy E-commerce Online Marketing Management Consulting New Business Development Strategic Planning Business Development Strategy Marketing Management Project Management Coaching Salesforce See 6+     See less Skills  Online Advertising Start-ups Marketing Strategy Entrepreneurship Social Media Marketing SEO Social Media Leadership Business Strategy E-commerce Online Marketing Management Consulting New Business Development Strategic Planning Business Development Strategy Marketing Management Project Management Coaching Salesforce See 6+     See less Online Advertising Start-ups Marketing Strategy Entrepreneurship Social Media Marketing SEO Social Media Leadership Business Strategy E-commerce Online Marketing Management Consulting New Business Development Strategic Planning Business Development Strategy Marketing Management Project Management Coaching Salesforce See 6+     See less Online Advertising Start-ups Marketing Strategy Entrepreneurship Social Media Marketing SEO Social Media Leadership Business Strategy E-commerce Online Marketing Management Consulting New Business Development Strategic Planning Business Development Strategy Marketing Management Project Management Coaching Salesforce See 6+     See less Education Athens University of Economics and Business Bachelor of Science (BSc),  International Economics , 7.9 / 10 2010  – 2015 I have decided to study International Economics because the faculty combines classes of the three thematics I love: economics, politics and business.  EM Strasbourg Business School Erasmus,  Business Administration and Management 2013  – 2013 I joined the University of Strasbourg's Business School, as part of my Erasmus studies program. I concentrated on business, marketing and management courses. École Des Ursulines High School 2007  – 2010 I joined this private francohellenic high school, after receiving a scholarship thanks to high performance. Zygmunt Mineyko High School,  Polish Studies , 5.5 / 5 1999  – 2009 I have been attending the polish primary school, junior and senior high school every Saturday, simultaneously with the greek school. I was one of the most performing students 'Zygmunt Mineyko' ever had. My courses included polish literature, polish language, history, politics, and geography. Athens University of Economics and Business Bachelor of Science (BSc),  International Economics , 7.9 / 10 2010  – 2015 I have decided to study International Economics because the faculty combines classes of the three thematics I love: economics, politics and business.  Athens University of Economics and Business Bachelor of Science (BSc),  International Economics , 7.9 / 10 2010  – 2015 I have decided to study International Economics because the faculty combines classes of the three thematics I love: economics, politics and business.  Athens University of Economics and Business Bachelor of Science (BSc),  International Economics , 7.9 / 10 2010  – 2015 I have decided to study International Economics because the faculty combines classes of the three thematics I love: economics, politics and business.  EM Strasbourg Business School Erasmus,  Business Administration and Management 2013  – 2013 I joined the University of Strasbourg's Business School, as part of my Erasmus studies program. I concentrated on business, marketing and management courses. EM Strasbourg Business School Erasmus,  Business Administration and Management 2013  – 2013 I joined the University of Strasbourg's Business School, as part of my Erasmus studies program. I concentrated on business, marketing and management courses. EM Strasbourg Business School Erasmus,  Business Administration and Management 2013  – 2013 I joined the University of Strasbourg's Business School, as part of my Erasmus studies program. I concentrated on business, marketing and management courses. École Des Ursulines High School 2007  – 2010 I joined this private francohellenic high school, after receiving a scholarship thanks to high performance. École Des Ursulines High School 2007  – 2010 I joined this private francohellenic high school, after receiving a scholarship thanks to high performance. École Des Ursulines High School 2007  – 2010 I joined this private francohellenic high school, after receiving a scholarship thanks to high performance. Zygmunt Mineyko High School,  Polish Studies , 5.5 / 5 1999  – 2009 I have been attending the polish primary school, junior and senior high school every Saturday, simultaneously with the greek school. I was one of the most performing students 'Zygmunt Mineyko' ever had. My courses included polish literature, polish language, history, politics, and geography. Zygmunt Mineyko High School,  Polish Studies , 5.5 / 5 1999  – 2009 I have been attending the polish primary school, junior and senior high school every Saturday, simultaneously with the greek school. I was one of the most performing students 'Zygmunt Mineyko' ever had. My courses included polish literature, polish language, history, politics, and geography. Zygmunt Mineyko High School,  Polish Studies , 5.5 / 5 1999  – 2009 I have been attending the polish primary school, junior and senior high school every Saturday, simultaneously with the greek school. I was one of the most performing students 'Zygmunt Mineyko' ever had. My courses included polish literature, polish language, history, politics, and geography. Honors & Awards StartingUp Microsoft December 2012 StartingUp is an annual business simulation competition organised by the ΚΕΠΝΕΤ organisation, the biggest of its kind in Greece of 2012. After taking the 4th place, we received the award below: \n \nThree years of cooperation with Microsoft through the BizSpark program, valued at ± $50K. StartingUp Microsoft December 2012 StartingUp is an annual business simulation competition organised by the ΚΕΠΝΕΤ organisation, the biggest of its kind in Greece of 2012. After taking the 4th place, we received the award below: \n \nThree years of cooperation with Microsoft through the BizSpark program, valued at ± $50K. StartingUp Microsoft December 2012 StartingUp is an annual business simulation competition organised by the ΚΕΠΝΕΤ organisation, the biggest of its kind in Greece of 2012. After taking the 4th place, we received the award below: \n \nThree years of cooperation with Microsoft through the BizSpark program, valued at ± $50K. StartingUp Microsoft December 2012 StartingUp is an annual business simulation competition organised by the ΚΕΠΝΕΤ organisation, the biggest of its kind in Greece of 2012. After taking the 4th place, we received the award below: \n \nThree years of cooperation with Microsoft through the BizSpark program, valued at ± $50K. ", "Languages English Native or bilingual proficiency French Full professional proficiency English Native or bilingual proficiency French Full professional proficiency English Native or bilingual proficiency French Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Public Affairs Media Relations Corporate Communications Crisis Communications Competition & Anti-Trust Government Relations Advocacy Issues Management Coalition-building Reputation Management Leadership Communication Internal Communications Automotive Policy &... Transport Policy (air,... Environmental Policy Sport policy Intellectual Property Broadcasting & Media Publishing policy ICT policy Public Policy Strategic Communications International Relations See 8+     See less Skills  Public Affairs Media Relations Corporate Communications Crisis Communications Competition & Anti-Trust Government Relations Advocacy Issues Management Coalition-building Reputation Management Leadership Communication Internal Communications Automotive Policy &... Transport Policy (air,... Environmental Policy Sport policy Intellectual Property Broadcasting & Media Publishing policy ICT policy Public Policy Strategic Communications International Relations See 8+     See less Public Affairs Media Relations Corporate Communications Crisis Communications Competition & Anti-Trust Government Relations Advocacy Issues Management Coalition-building Reputation Management Leadership Communication Internal Communications Automotive Policy &... Transport Policy (air,... Environmental Policy Sport policy Intellectual Property Broadcasting & Media Publishing policy ICT policy Public Policy Strategic Communications International Relations See 8+     See less Public Affairs Media Relations Corporate Communications Crisis Communications Competition & Anti-Trust Government Relations Advocacy Issues Management Coalition-building Reputation Management Leadership Communication Internal Communications Automotive Policy &... Transport Policy (air,... Environmental Policy Sport policy Intellectual Property Broadcasting & Media Publishing policy ICT policy Public Policy Strategic Communications International Relations See 8+     See less Honors & Awards European Consultant of the Year Public Affairs News 2006 European Consultant of the Year Public Affairs News 2006 European Consultant of the Year Public Affairs News 2006 European Consultant of the Year Public Affairs News 2006 ", "Summary Carolyn Dalton is one of Australia’s best known and well respected policy lawyers and strategic thinkers. A copyright law specialist, she is also an expert adviser on internet and communications law and policy. \n \nAs Executive Director of Policy Australia, Carolyn advises clients on a range of strategic, policy and legal issues. Areas of particular focus include the internet, media & communications, copyright and technology law and policy. Clients include internet companies such as Google and Netflix, peak body groups in the education sector, advocacy groups and rights holder organisations. \n \nCarolyn has spent over 15 years working with a wide range of government departments, industry bodies and major corporations as a legal adviser, public policy professional and government relations manager.  \n \nHer previous roles include: \n \n- Head of Government Relations and Public Affairs, Google Australia & New Zealand \n \n- Special Counsel, Copyright & Communications, Minter Ellison Lawyers \nRepresenting clients such as the peak body for Australia’s school/TAFE sectors, Optus, the Motion Picture Association of America, the Interactive Games Association of Australia, the Australian Subscription Television and Radio Association, various government departments and cultural institutions. \n \n- Public Policy Manager, Telstra Regulatory \n \n- Principal Legal Officer, New Technologies Section, Copyright Law Branch, Commonwealth Attorney–General’s Department \n \n- Solicitor IP/IT Middletons Moore & Bevins \n \nCarolyn is on the Management Committee of the Copyright Society of Australia and was a Board Member of the Internet Industry Association. \n \nShe was an advisory committee member for the Australian Law Reform Commission's review into Copyright and the Digital Economy and has been a member of the Australian Government's Consultative Group on Cybersafety. \n \nIn 2001 Carolyn was awarded an Australia Day award for her work on the Copyright Amendment (Digital Agenda) Act 2000. Specialties:Copyright, internet, communications, media & technology law and policy \nStrategic planning \nSubmission writing \nGovernment and stakeholder relations Summary Carolyn Dalton is one of Australia’s best known and well respected policy lawyers and strategic thinkers. A copyright law specialist, she is also an expert adviser on internet and communications law and policy. \n \nAs Executive Director of Policy Australia, Carolyn advises clients on a range of strategic, policy and legal issues. Areas of particular focus include the internet, media & communications, copyright and technology law and policy. Clients include internet companies such as Google and Netflix, peak body groups in the education sector, advocacy groups and rights holder organisations. \n \nCarolyn has spent over 15 years working with a wide range of government departments, industry bodies and major corporations as a legal adviser, public policy professional and government relations manager.  \n \nHer previous roles include: \n \n- Head of Government Relations and Public Affairs, Google Australia & New Zealand \n \n- Special Counsel, Copyright & Communications, Minter Ellison Lawyers \nRepresenting clients such as the peak body for Australia’s school/TAFE sectors, Optus, the Motion Picture Association of America, the Interactive Games Association of Australia, the Australian Subscription Television and Radio Association, various government departments and cultural institutions. \n \n- Public Policy Manager, Telstra Regulatory \n \n- Principal Legal Officer, New Technologies Section, Copyright Law Branch, Commonwealth Attorney–General’s Department \n \n- Solicitor IP/IT Middletons Moore & Bevins \n \nCarolyn is on the Management Committee of the Copyright Society of Australia and was a Board Member of the Internet Industry Association. \n \nShe was an advisory committee member for the Australian Law Reform Commission's review into Copyright and the Digital Economy and has been a member of the Australian Government's Consultative Group on Cybersafety. \n \nIn 2001 Carolyn was awarded an Australia Day award for her work on the Copyright Amendment (Digital Agenda) Act 2000. Specialties:Copyright, internet, communications, media & technology law and policy \nStrategic planning \nSubmission writing \nGovernment and stakeholder relations Carolyn Dalton is one of Australia’s best known and well respected policy lawyers and strategic thinkers. A copyright law specialist, she is also an expert adviser on internet and communications law and policy. \n \nAs Executive Director of Policy Australia, Carolyn advises clients on a range of strategic, policy and legal issues. Areas of particular focus include the internet, media & communications, copyright and technology law and policy. Clients include internet companies such as Google and Netflix, peak body groups in the education sector, advocacy groups and rights holder organisations. \n \nCarolyn has spent over 15 years working with a wide range of government departments, industry bodies and major corporations as a legal adviser, public policy professional and government relations manager.  \n \nHer previous roles include: \n \n- Head of Government Relations and Public Affairs, Google Australia & New Zealand \n \n- Special Counsel, Copyright & Communications, Minter Ellison Lawyers \nRepresenting clients such as the peak body for Australia’s school/TAFE sectors, Optus, the Motion Picture Association of America, the Interactive Games Association of Australia, the Australian Subscription Television and Radio Association, various government departments and cultural institutions. \n \n- Public Policy Manager, Telstra Regulatory \n \n- Principal Legal Officer, New Technologies Section, Copyright Law Branch, Commonwealth Attorney–General’s Department \n \n- Solicitor IP/IT Middletons Moore & Bevins \n \nCarolyn is on the Management Committee of the Copyright Society of Australia and was a Board Member of the Internet Industry Association. \n \nShe was an advisory committee member for the Australian Law Reform Commission's review into Copyright and the Digital Economy and has been a member of the Australian Government's Consultative Group on Cybersafety. \n \nIn 2001 Carolyn was awarded an Australia Day award for her work on the Copyright Amendment (Digital Agenda) Act 2000. Specialties:Copyright, internet, communications, media & technology law and policy \nStrategic planning \nSubmission writing \nGovernment and stakeholder relations Carolyn Dalton is one of Australia’s best known and well respected policy lawyers and strategic thinkers. A copyright law specialist, she is also an expert adviser on internet and communications law and policy. \n \nAs Executive Director of Policy Australia, Carolyn advises clients on a range of strategic, policy and legal issues. Areas of particular focus include the internet, media & communications, copyright and technology law and policy. Clients include internet companies such as Google and Netflix, peak body groups in the education sector, advocacy groups and rights holder organisations. \n \nCarolyn has spent over 15 years working with a wide range of government departments, industry bodies and major corporations as a legal adviser, public policy professional and government relations manager.  \n \nHer previous roles include: \n \n- Head of Government Relations and Public Affairs, Google Australia & New Zealand \n \n- Special Counsel, Copyright & Communications, Minter Ellison Lawyers \nRepresenting clients such as the peak body for Australia’s school/TAFE sectors, Optus, the Motion Picture Association of America, the Interactive Games Association of Australia, the Australian Subscription Television and Radio Association, various government departments and cultural institutions. \n \n- Public Policy Manager, Telstra Regulatory \n \n- Principal Legal Officer, New Technologies Section, Copyright Law Branch, Commonwealth Attorney–General’s Department \n \n- Solicitor IP/IT Middletons Moore & Bevins \n \nCarolyn is on the Management Committee of the Copyright Society of Australia and was a Board Member of the Internet Industry Association. \n \nShe was an advisory committee member for the Australian Law Reform Commission's review into Copyright and the Digital Economy and has been a member of the Australian Government's Consultative Group on Cybersafety. \n \nIn 2001 Carolyn was awarded an Australia Day award for her work on the Copyright Amendment (Digital Agenda) Act 2000. Specialties:Copyright, internet, communications, media & technology law and policy \nStrategic planning \nSubmission writing \nGovernment and stakeholder relations Experience Executive Director Policy Australia Pty Ltd July 2010  – Present (5 years 2 months) Sydney Carolyn Dalton founded Policy Australia Pty Ltd in July 2010 and has developed the company into a premium law and policy consulting firm. \n \nPolicy Australia Pty Ltd provides policy, legal and strategy advice to clients primarily in the IT, media, telecommunications, education and government sectors. Committee Member Copyright Society of Australia March 2006  – Present (9 years 6 months) Sydney I was a committee member from 2006 - 2009 and again from 2013 Head of Government Relations and Public Affairs, Australia & New Zealand Google November 2007  –  July 2010  (2 years 9 months) I established Google's public policy & government affairs team in Australia & New Zealand & South East Asia.  \n \nI was responsible for all aspects of public policy and government affairs for Google in Australia & New Zealand - from liaison with government, developing policy positions for the digital economy, intellectual property, privacy, cybersafety & security, cloud computing, 'Gov 2.0', broadband, spectrum, smart grid/energy policy, to a ‘ride along’ in the StreetView car ensuring cultural sensitivities were protected at Uluru.  \n \nI was part of Google Australia's senior management team. Board Member Internet Industry Association January 2008  –  July 2009  (1 year 7 months) Member Australian Government Consultative Group on Cybersafety 2008  –  2009  (1 year) The Australian Government’s Consultative Working Group on Cybersafety (CWG) is comprised of \nrepresentatives from industry, community organisations and Australian Government \nagencies. The CWG’s role is to consider all aspects of cybersafety faced by \nAustralian children, provide information to Government on measures required to \noperate and maintain world’s best practice safeguards for Australian children \nengaging in the digital economy and advise the Government on priorities for action by \ngovernment and industry. Special Counsel Minter Ellison January 2005  –  November 2007  (2 years 11 months) Public Policy Manager, Regulatory Telstra 2003  –  January 2005  (2 years) Senior Associate Minter Ellison 2001  –  2003  (2 years) Principal Legal Officer/Senior Legal Officer Commonwealth Attorney General's Department March 1999  –  2001  (2 years) I worked on - and then led - the team responsible for drafting and implementing the Copyright Amendment (Digital Agenda) Act 2000 (Australia's implementation of the 1996 WIPO Copyright/Performances and Phonograms Treaties)  \nAs the head of the New Technologies section I was responsible for managing digital copyright policy for the Australian government. Graduate Lawyer/Paralegal Middletons Moore & Bevins December 1996  –  March 1999  (2 years 4 months) Executive Director Policy Australia Pty Ltd July 2010  – Present (5 years 2 months) Sydney Carolyn Dalton founded Policy Australia Pty Ltd in July 2010 and has developed the company into a premium law and policy consulting firm. \n \nPolicy Australia Pty Ltd provides policy, legal and strategy advice to clients primarily in the IT, media, telecommunications, education and government sectors. Executive Director Policy Australia Pty Ltd July 2010  – Present (5 years 2 months) Sydney Carolyn Dalton founded Policy Australia Pty Ltd in July 2010 and has developed the company into a premium law and policy consulting firm. \n \nPolicy Australia Pty Ltd provides policy, legal and strategy advice to clients primarily in the IT, media, telecommunications, education and government sectors. Committee Member Copyright Society of Australia March 2006  – Present (9 years 6 months) Sydney I was a committee member from 2006 - 2009 and again from 2013 Committee Member Copyright Society of Australia March 2006  – Present (9 years 6 months) Sydney I was a committee member from 2006 - 2009 and again from 2013 Head of Government Relations and Public Affairs, Australia & New Zealand Google November 2007  –  July 2010  (2 years 9 months) I established Google's public policy & government affairs team in Australia & New Zealand & South East Asia.  \n \nI was responsible for all aspects of public policy and government affairs for Google in Australia & New Zealand - from liaison with government, developing policy positions for the digital economy, intellectual property, privacy, cybersafety & security, cloud computing, 'Gov 2.0', broadband, spectrum, smart grid/energy policy, to a ‘ride along’ in the StreetView car ensuring cultural sensitivities were protected at Uluru.  \n \nI was part of Google Australia's senior management team. Head of Government Relations and Public Affairs, Australia & New Zealand Google November 2007  –  July 2010  (2 years 9 months) I established Google's public policy & government affairs team in Australia & New Zealand & South East Asia.  \n \nI was responsible for all aspects of public policy and government affairs for Google in Australia & New Zealand - from liaison with government, developing policy positions for the digital economy, intellectual property, privacy, cybersafety & security, cloud computing, 'Gov 2.0', broadband, spectrum, smart grid/energy policy, to a ‘ride along’ in the StreetView car ensuring cultural sensitivities were protected at Uluru.  \n \nI was part of Google Australia's senior management team. Board Member Internet Industry Association January 2008  –  July 2009  (1 year 7 months) Board Member Internet Industry Association January 2008  –  July 2009  (1 year 7 months) Member Australian Government Consultative Group on Cybersafety 2008  –  2009  (1 year) The Australian Government’s Consultative Working Group on Cybersafety (CWG) is comprised of \nrepresentatives from industry, community organisations and Australian Government \nagencies. The CWG’s role is to consider all aspects of cybersafety faced by \nAustralian children, provide information to Government on measures required to \noperate and maintain world’s best practice safeguards for Australian children \nengaging in the digital economy and advise the Government on priorities for action by \ngovernment and industry. Member Australian Government Consultative Group on Cybersafety 2008  –  2009  (1 year) The Australian Government’s Consultative Working Group on Cybersafety (CWG) is comprised of \nrepresentatives from industry, community organisations and Australian Government \nagencies. The CWG’s role is to consider all aspects of cybersafety faced by \nAustralian children, provide information to Government on measures required to \noperate and maintain world’s best practice safeguards for Australian children \nengaging in the digital economy and advise the Government on priorities for action by \ngovernment and industry. Special Counsel Minter Ellison January 2005  –  November 2007  (2 years 11 months) Special Counsel Minter Ellison January 2005  –  November 2007  (2 years 11 months) Public Policy Manager, Regulatory Telstra 2003  –  January 2005  (2 years) Public Policy Manager, Regulatory Telstra 2003  –  January 2005  (2 years) Senior Associate Minter Ellison 2001  –  2003  (2 years) Senior Associate Minter Ellison 2001  –  2003  (2 years) Principal Legal Officer/Senior Legal Officer Commonwealth Attorney General's Department March 1999  –  2001  (2 years) I worked on - and then led - the team responsible for drafting and implementing the Copyright Amendment (Digital Agenda) Act 2000 (Australia's implementation of the 1996 WIPO Copyright/Performances and Phonograms Treaties)  \nAs the head of the New Technologies section I was responsible for managing digital copyright policy for the Australian government. Principal Legal Officer/Senior Legal Officer Commonwealth Attorney General's Department March 1999  –  2001  (2 years) I worked on - and then led - the team responsible for drafting and implementing the Copyright Amendment (Digital Agenda) Act 2000 (Australia's implementation of the 1996 WIPO Copyright/Performances and Phonograms Treaties)  \nAs the head of the New Technologies section I was responsible for managing digital copyright policy for the Australian government. Graduate Lawyer/Paralegal Middletons Moore & Bevins December 1996  –  March 1999  (2 years 4 months) Graduate Lawyer/Paralegal Middletons Moore & Bevins December 1996  –  March 1999  (2 years 4 months) Languages French (basic conversational) French (basic conversational) French (basic conversational) Skills Government Relations Policy Public Policy Government Strategic Communications Intellectual Property Stakeholder Management IT law Public Speaking Telecommunications Lobbying Cyberlaw Copyright Law Strategy Policy Analysis Stakeholder Engagement Privacy Law Legal Research Contract Negotiation Legal Advice Licensing Public Sector Management Politics Strategic Planning Corporate Governance Data Privacy Legal Issues Board of Directors International Law Governance Entertainment Law Legislation Legal Compliance Internet Law Government Liaison Presentations Seminars Business Planning Workshop Facilitation Legal Writing Public Affairs Legal Assistance Digital Copyright Speech Writing Community Engagement Regulations Executive Management Business Strategy See 34+     See less Skills  Government Relations Policy Public Policy Government Strategic Communications Intellectual Property Stakeholder Management IT law Public Speaking Telecommunications Lobbying Cyberlaw Copyright Law Strategy Policy Analysis Stakeholder Engagement Privacy Law Legal Research Contract Negotiation Legal Advice Licensing Public Sector Management Politics Strategic Planning Corporate Governance Data Privacy Legal Issues Board of Directors International Law Governance Entertainment Law Legislation Legal Compliance Internet Law Government Liaison Presentations Seminars Business Planning Workshop Facilitation Legal Writing Public Affairs Legal Assistance Digital Copyright Speech Writing Community Engagement Regulations Executive Management Business Strategy See 34+     See less Government Relations Policy Public Policy Government Strategic Communications Intellectual Property Stakeholder Management IT law Public Speaking Telecommunications Lobbying Cyberlaw Copyright Law Strategy Policy Analysis Stakeholder Engagement Privacy Law Legal Research Contract Negotiation Legal Advice Licensing Public Sector Management Politics Strategic Planning Corporate Governance Data Privacy Legal Issues Board of Directors International Law Governance Entertainment Law Legislation Legal Compliance Internet Law Government Liaison Presentations Seminars Business Planning Workshop Facilitation Legal Writing Public Affairs Legal Assistance Digital Copyright Speech Writing Community Engagement Regulations Executive Management Business Strategy See 34+     See less Government Relations Policy Public Policy Government Strategic Communications Intellectual Property Stakeholder Management IT law Public Speaking Telecommunications Lobbying Cyberlaw Copyright Law Strategy Policy Analysis Stakeholder Engagement Privacy Law Legal Research Contract Negotiation Legal Advice Licensing Public Sector Management Politics Strategic Planning Corporate Governance Data Privacy Legal Issues Board of Directors International Law Governance Entertainment Law Legislation Legal Compliance Internet Law Government Liaison Presentations Seminars Business Planning Workshop Facilitation Legal Writing Public Affairs Legal Assistance Digital Copyright Speech Writing Community Engagement Regulations Executive Management Business Strategy See 34+     See less Education University of Wollongong BA LLB (Hons I),  Law ,  English ,  Communications & Media 1992  – 1996 Activities and Societies:  Editor of Law Society Journal Illawarra Grammar School 1986  – 1991 University of Wollongong BA LLB (Hons I),  Law ,  English ,  Communications & Media 1992  – 1996 Activities and Societies:  Editor of Law Society Journal University of Wollongong BA LLB (Hons I),  Law ,  English ,  Communications & Media 1992  – 1996 Activities and Societies:  Editor of Law Society Journal University of Wollongong BA LLB (Hons I),  Law ,  English ,  Communications & Media 1992  – 1996 Activities and Societies:  Editor of Law Society Journal Illawarra Grammar School 1986  – 1991 Illawarra Grammar School 1986  – 1991 Illawarra Grammar School 1986  – 1991 ", "Experience Domains Policy and Compliance Google August 2015  – Present (1 month) Greater Seattle Area Public Policy Manager NeuStar, Inc. June 2014  –  July 2015  (1 year 2 months) Washington D.C. Metro Area Serve as the manager of public participation for the .US top-level domain driving the new .US Stakeholder Council and Education Advisory Committee. Provide policy and compliance-related support for Neustar-managed top level domains (.US, .CO, .BIZ, and .NYC), as well as its registry service clients, based upon knowledge of ICANN policies and structures. Participate in ICANN through the Registries Stakeholder Group and other interest groups including attending ICANN Public Meetings, drafting public comments and other correspondence, and participating in ICANN Working Groups and Drafting Teams. Consulting Associate FairWinds Partners LLC September 2012  –  June 2014  (1 year 10 months) Washington D.C. Metro Area Led public participation and policy engagement on behalf of FairWinds, including through participation at ICANN and INTA and the development of public comments, correspondence, and policy outreach strategies. Served as a project manager to cross-functional teams within Fortune 500 companies spanning the financial, retail, and pharmaceutical industries in developing launch and business strategies for new generic top-level domains. Advised clients on optimizing their digital presences through domain name portfolio audits, recoveries, and acquisitions and through online brand monitoring. Program Coordinator, Program on Information Justice and Intellectual Property American University Washington College of Law November 2011  –  September 2012  (11 months) Washington D.C. Metro Area Coordinated research and advocacy on intellectual property and the public interest including access to medicines, access to information journals and scientific research, and Fair Use/Fair Dealing. Work included planning academic events, reviewing academic research on cyberlaw and international trade, and coordinating a cross-faculty working group on intellectual property. Administrative Assistant HATLEY Conseillers en stratégie January 2011  –  May 2011  (5 months) Montreal, Canada Area Provided support to a public and government relations firm in a bilingual capacity. Supported clients in the oil and natural gas industries in developing and executing on communications strategies. Domains Policy and Compliance Google August 2015  – Present (1 month) Greater Seattle Area Domains Policy and Compliance Google August 2015  – Present (1 month) Greater Seattle Area Public Policy Manager NeuStar, Inc. June 2014  –  July 2015  (1 year 2 months) Washington D.C. Metro Area Serve as the manager of public participation for the .US top-level domain driving the new .US Stakeholder Council and Education Advisory Committee. Provide policy and compliance-related support for Neustar-managed top level domains (.US, .CO, .BIZ, and .NYC), as well as its registry service clients, based upon knowledge of ICANN policies and structures. Participate in ICANN through the Registries Stakeholder Group and other interest groups including attending ICANN Public Meetings, drafting public comments and other correspondence, and participating in ICANN Working Groups and Drafting Teams. Public Policy Manager NeuStar, Inc. June 2014  –  July 2015  (1 year 2 months) Washington D.C. Metro Area Serve as the manager of public participation for the .US top-level domain driving the new .US Stakeholder Council and Education Advisory Committee. Provide policy and compliance-related support for Neustar-managed top level domains (.US, .CO, .BIZ, and .NYC), as well as its registry service clients, based upon knowledge of ICANN policies and structures. Participate in ICANN through the Registries Stakeholder Group and other interest groups including attending ICANN Public Meetings, drafting public comments and other correspondence, and participating in ICANN Working Groups and Drafting Teams. Consulting Associate FairWinds Partners LLC September 2012  –  June 2014  (1 year 10 months) Washington D.C. Metro Area Led public participation and policy engagement on behalf of FairWinds, including through participation at ICANN and INTA and the development of public comments, correspondence, and policy outreach strategies. Served as a project manager to cross-functional teams within Fortune 500 companies spanning the financial, retail, and pharmaceutical industries in developing launch and business strategies for new generic top-level domains. Advised clients on optimizing their digital presences through domain name portfolio audits, recoveries, and acquisitions and through online brand monitoring. Consulting Associate FairWinds Partners LLC September 2012  –  June 2014  (1 year 10 months) Washington D.C. Metro Area Led public participation and policy engagement on behalf of FairWinds, including through participation at ICANN and INTA and the development of public comments, correspondence, and policy outreach strategies. Served as a project manager to cross-functional teams within Fortune 500 companies spanning the financial, retail, and pharmaceutical industries in developing launch and business strategies for new generic top-level domains. Advised clients on optimizing their digital presences through domain name portfolio audits, recoveries, and acquisitions and through online brand monitoring. Program Coordinator, Program on Information Justice and Intellectual Property American University Washington College of Law November 2011  –  September 2012  (11 months) Washington D.C. Metro Area Coordinated research and advocacy on intellectual property and the public interest including access to medicines, access to information journals and scientific research, and Fair Use/Fair Dealing. Work included planning academic events, reviewing academic research on cyberlaw and international trade, and coordinating a cross-faculty working group on intellectual property. Program Coordinator, Program on Information Justice and Intellectual Property American University Washington College of Law November 2011  –  September 2012  (11 months) Washington D.C. Metro Area Coordinated research and advocacy on intellectual property and the public interest including access to medicines, access to information journals and scientific research, and Fair Use/Fair Dealing. Work included planning academic events, reviewing academic research on cyberlaw and international trade, and coordinating a cross-faculty working group on intellectual property. Administrative Assistant HATLEY Conseillers en stratégie January 2011  –  May 2011  (5 months) Montreal, Canada Area Provided support to a public and government relations firm in a bilingual capacity. Supported clients in the oil and natural gas industries in developing and executing on communications strategies. Administrative Assistant HATLEY Conseillers en stratégie January 2011  –  May 2011  (5 months) Montreal, Canada Area Provided support to a public and government relations firm in a bilingual capacity. Supported clients in the oil and natural gas industries in developing and executing on communications strategies. Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Research Strategy Public Policy Policy Analysis Policy International Relations Internet Governance Domain Names Internet Strategy Public Speaking Data Analysis Political Science Social Media International... Blogging Public Relations French See 2+     See less Skills  Research Strategy Public Policy Policy Analysis Policy International Relations Internet Governance Domain Names Internet Strategy Public Speaking Data Analysis Political Science Social Media International... Blogging Public Relations French See 2+     See less Research Strategy Public Policy Policy Analysis Policy International Relations Internet Governance Domain Names Internet Strategy Public Speaking Data Analysis Political Science Social Media International... Blogging Public Relations French See 2+     See less Research Strategy Public Policy Policy Analysis Policy International Relations Internet Governance Domain Names Internet Strategy Public Speaking Data Analysis Political Science Social Media International... Blogging Public Relations French See 2+     See less Education McGill University Bachelor of Arts (BA),  Political Science and Government 2007  – 2011 Activities and Societies:  McGill Essay Center (Founder/Manager) 2010-2011 ,  McGill Political Science Students' Association (Vice President Academic) 2010-2011 ,  Arts Undergraduate Society Peer Tutor 2009-2011 ,  McGill Model United Nations (Chair) 2009-2011 Hingham High School 2003  – 2007 McGill University Bachelor of Arts (BA),  Political Science and Government 2007  – 2011 Activities and Societies:  McGill Essay Center (Founder/Manager) 2010-2011 ,  McGill Political Science Students' Association (Vice President Academic) 2010-2011 ,  Arts Undergraduate Society Peer Tutor 2009-2011 ,  McGill Model United Nations (Chair) 2009-2011 McGill University Bachelor of Arts (BA),  Political Science and Government 2007  – 2011 Activities and Societies:  McGill Essay Center (Founder/Manager) 2010-2011 ,  McGill Political Science Students' Association (Vice President Academic) 2010-2011 ,  Arts Undergraduate Society Peer Tutor 2009-2011 ,  McGill Model United Nations (Chair) 2009-2011 McGill University Bachelor of Arts (BA),  Political Science and Government 2007  – 2011 Activities and Societies:  McGill Essay Center (Founder/Manager) 2010-2011 ,  McGill Political Science Students' Association (Vice President Academic) 2010-2011 ,  Arts Undergraduate Society Peer Tutor 2009-2011 ,  McGill Model United Nations (Chair) 2009-2011 Hingham High School 2003  – 2007 Hingham High School 2003  – 2007 Hingham High School 2003  – 2007 Honors & Awards Valedictorian McGill Faculty of Arts May 2011 Dean's List McGill University Volunteer of the Year McGill Arts Undergraduate Society April 2011 Valedictorian McGill Faculty of Arts May 2011 Valedictorian McGill Faculty of Arts May 2011 Valedictorian McGill Faculty of Arts May 2011 Dean's List McGill University Dean's List McGill University Dean's List McGill University Volunteer of the Year McGill Arts Undergraduate Society April 2011 Volunteer of the Year McGill Arts Undergraduate Society April 2011 Volunteer of the Year McGill Arts Undergraduate Society April 2011 "]}