{"position": "Principal Industry Analyst", "company": "Google", "profiles": ["Experience Principal Industry Analyst Google March 2011  – Present (4 years 5 months) Regional Marketing Manager Clark Hill PLC April 2010  –  March 2011  (1 year) Media Activation Supervisor Starcom MediaVest Group December 2004  –  April 2010  (5 years 5 months) Principal Industry Analyst Google March 2011  – Present (4 years 5 months) Principal Industry Analyst Google March 2011  – Present (4 years 5 months) Regional Marketing Manager Clark Hill PLC April 2010  –  March 2011  (1 year) Regional Marketing Manager Clark Hill PLC April 2010  –  March 2011  (1 year) Media Activation Supervisor Starcom MediaVest Group December 2004  –  April 2010  (5 years 5 months) Media Activation Supervisor Starcom MediaVest Group December 2004  –  April 2010  (5 years 5 months) Skills Top Skills 8 Digital Strategy 5 Media Planning 5 Integrated Marketing 4 Mobile Advertising 4 Digital Marketing 4 Online Advertising 4 Marketing 3 Digital Media 3 Media Buying 3 Mobile Marketing Ellie also knows about... 2 Strategic Partnerships 2 Advertising Sales 2 SEM 2 Interactive Marketing Skills  Top Skills 8 Digital Strategy 5 Media Planning 5 Integrated Marketing 4 Mobile Advertising 4 Digital Marketing 4 Online Advertising 4 Marketing 3 Digital Media 3 Media Buying 3 Mobile Marketing Ellie also knows about... 2 Strategic Partnerships 2 Advertising Sales 2 SEM 2 Interactive Marketing Top Skills 8 Digital Strategy 5 Media Planning 5 Integrated Marketing 4 Mobile Advertising 4 Digital Marketing 4 Online Advertising 4 Marketing 3 Digital Media 3 Media Buying 3 Mobile Marketing Ellie also knows about... 2 Strategic Partnerships 2 Advertising Sales 2 SEM 2 Interactive Marketing Top Skills 8 Digital Strategy 5 Media Planning 5 Integrated Marketing 4 Mobile Advertising 4 Digital Marketing 4 Online Advertising 4 Marketing 3 Digital Media 3 Media Buying 3 Mobile Marketing Ellie also knows about... 2 Strategic Partnerships 2 Advertising Sales 2 SEM 2 Interactive Marketing                     2 Strategic Partnerships 2 Advertising Sales 2 SEM 2 Interactive Marketing Education University of Michigan Bachelor of Arts,  Communication Studies & English 2000  – 2004 University of Michigan Bachelor of Arts,  Communication Studies & English 2000  – 2004 University of Michigan Bachelor of Arts,  Communication Studies & English 2000  – 2004 University of Michigan Bachelor of Arts,  Communication Studies & English 2000  – 2004 ", "Experience Principal Industry Analyst Google April 2008  – Present (7 years 4 months) Account Executive TNS OBOP June 2005  –  March 2008  (2 years 10 months) Research Assistant Discovery Media November 2003  –  May 2005  (1 year 7 months) Principal Industry Analyst Google April 2008  – Present (7 years 4 months) Principal Industry Analyst Google April 2008  – Present (7 years 4 months) Account Executive TNS OBOP June 2005  –  March 2008  (2 years 10 months) Account Executive TNS OBOP June 2005  –  March 2008  (2 years 10 months) Research Assistant Discovery Media November 2003  –  May 2005  (1 year 7 months) Research Assistant Discovery Media November 2003  –  May 2005  (1 year 7 months) Languages English English English Skills Top Skills 10 Marketing Research 9 Market Research 8 Customer Insight 7 Online Advertising 6 Google Adwords 6 Digital Strategy 5 Quantitative Research 5 Analytics 3 Digital Marketing 2 Data Analysis Kuba also knows about... 2 SEM 2 Market Analysis 2 Web Analytics 2 Mobile Marketing 2 Mobile Advertising 1 Qualitative Research 1 Advertising Research 1 PPC 1 Search Advertising 1 Competitive Analysis 1 Display Advertising Skills  Top Skills 10 Marketing Research 9 Market Research 8 Customer Insight 7 Online Advertising 6 Google Adwords 6 Digital Strategy 5 Quantitative Research 5 Analytics 3 Digital Marketing 2 Data Analysis Kuba also knows about... 2 SEM 2 Market Analysis 2 Web Analytics 2 Mobile Marketing 2 Mobile Advertising 1 Qualitative Research 1 Advertising Research 1 PPC 1 Search Advertising 1 Competitive Analysis 1 Display Advertising Top Skills 10 Marketing Research 9 Market Research 8 Customer Insight 7 Online Advertising 6 Google Adwords 6 Digital Strategy 5 Quantitative Research 5 Analytics 3 Digital Marketing 2 Data Analysis Kuba also knows about... 2 SEM 2 Market Analysis 2 Web Analytics 2 Mobile Marketing 2 Mobile Advertising 1 Qualitative Research 1 Advertising Research 1 PPC 1 Search Advertising 1 Competitive Analysis 1 Display Advertising Top Skills 10 Marketing Research 9 Market Research 8 Customer Insight 7 Online Advertising 6 Google Adwords 6 Digital Strategy 5 Quantitative Research 5 Analytics 3 Digital Marketing 2 Data Analysis Kuba also knows about... 2 SEM 2 Market Analysis 2 Web Analytics 2 Mobile Marketing 2 Mobile Advertising 1 Qualitative Research 1 Advertising Research 1 PPC 1 Search Advertising 1 Competitive Analysis 1 Display Advertising                     2 SEM 2 Market Analysis 2 Web Analytics 2 Mobile Marketing 2 Mobile Advertising 1 Qualitative Research 1 Advertising Research 1 PPC 1 Search Advertising 1 Competitive Analysis 1 Display Advertising Education Szkoła Wyższa Psychologii Społecznej MA,  Sociology 2002  – 2007 Szkoła Wyższa Psychologii Społecznej MA,  Sociology 2002  – 2007 Szkoła Wyższa Psychologii Społecznej MA,  Sociology 2002  – 2007 Szkoła Wyższa Psychologii Społecznej MA,  Sociology 2002  – 2007 ", "Experience Product Marketing Manager Google Glass Google January 2014  – Present (1 year 7 months) United States Principal Industry Analyst - CPG and Entertainment Google June 2013  –  January 2014  (8 months) Sydney Area, Australia Senior Industry Analyst FMCG & Entertainment Google May 2011  –  June 2013  (2 years 2 months) Brand Manager - NESCAFE Nestlé Australia Limited January 2008  –  May 2011  (3 years 5 months) Responsible for brand management of NESCAFE Greenblend as well as the development of a broader 'Wellbeing' coffee strategy. Key achievements include generating health and wellness insights (based on qualitative and quantitative research data) to drive development of an innovation pipeline and to better target category communication - particularly to health care professionals as key influencers in consumer lifestyle and nutrition choices. This approach was subsequently showcased at the annual Nestle Global Coffee Seminar and heralded as best-in-class communication for an emerging brand. Manager Corporate Strategy Nestlé S.A. January 2010  –  October 2010  (10 months) Selected to represent Beverages Division in broader corporate growth strategy project across Australia/New Zealand. Responsible for bringing together consumer, category, and channel data to develop growth platforms over the next 5 years prior to presenting to Executive Steering Committee (inclusive of CEO and CFO). Key achievements included a prioritised innovation pipeline as well as designing a methodology to assess commercial potential of nutrition-based positioning across Nestle's collection of 1,500+ food & beverage brands. Brand Manager - MILO Nestle S.A. March 2009  –  October 2009  (8 months) Responsible for managing the integrated marketing strategy for MILO, incorporating sports sponsorships, traditional above-the-line media, and digital media. Key achievements included the development of a communication strategy centred on MILO's nutritional credentials (identified through distilling insights from consumer and shopper research) and launch of a new website. This resulted in restoring MILO to growth across all KPI's - (volume share, value share, and brand equity scores) after a steady 5-year decline. Assistant Brand Manager Nestlé S.A. January 2008  –  February 2009  (1 year 2 months) Responsible for providing marketing support across the milk drinks portfolio. Provided day-to-day assistance on managing the execution of an integrated marketing campaign for MILO, while leading the development of the brand and communication strategy for NESQUIK. Key achievements included the development of insights for NESQUIK; from qualitative research with children and mums through to the translation of these insights into the repositioning of the brand to increase its relevance and appeal. Assistant Product Manager Village Roadshow Entertainment August 2006  –  January 2008  (1 year 6 months) Responsible for developing marketing campaigns for theatrical titles across the entire product life cycle. Managed studio relationships, assessed potential return-on-investment across the life cycle, designed communication touch-point plans, and then developed/executed trade marketing initiatives and sales support. Key achievements included winning an AVSDA for Best Marketing Campaign 2007 for 'Hoodwinked' and the development and launch of DVD2GIVE - an online DVD gift selector. Business Development Executive Asia Pacific Trading October 2004  –  June 2006  (1 year 9 months) Responsible for cross functional duties as founding member of start-up business, including; stakeholder management across the supply chain of beef suppliers, abattoirs, and Korean beef importers, development and execution of a B2B marketing strategy, and business development support for subsequent expansion into a greenfield soup operation. Key achievements included securing supply from local beef suppliers and councils in Northern NSW after their initial reluctance to partner with foreign investors and the resulting successful sale of the business. Assistant Editor MG Group Pty Ltd September 2001  –  May 2004  (2 years 9 months) Responsible for liaising with editors to evaluate relevant content and the editing of all English components of the Inflight magazine. Key achievements included being selected to accompany the Managing Director to Korea in order to secure advertising with major accounts such as Samsung Electronics, Samsung Motors, and the Korean Tourism Organisation.; Responsible for completing market feasibility studies (including forecasting ticket sales) ahead of key performances and developing marketing plans (inclusive of media buying, sponsorship, and event management). Key achievements included securing and managing the sponsorship relationship with Samsung Electronics as well as successfully managing a number of red carpet events. Product Marketing Manager Google Glass Google January 2014  – Present (1 year 7 months) United States Product Marketing Manager Google Glass Google January 2014  – Present (1 year 7 months) United States Principal Industry Analyst - CPG and Entertainment Google June 2013  –  January 2014  (8 months) Sydney Area, Australia Principal Industry Analyst - CPG and Entertainment Google June 2013  –  January 2014  (8 months) Sydney Area, Australia Senior Industry Analyst FMCG & Entertainment Google May 2011  –  June 2013  (2 years 2 months) Senior Industry Analyst FMCG & Entertainment Google May 2011  –  June 2013  (2 years 2 months) Brand Manager - NESCAFE Nestlé Australia Limited January 2008  –  May 2011  (3 years 5 months) Responsible for brand management of NESCAFE Greenblend as well as the development of a broader 'Wellbeing' coffee strategy. Key achievements include generating health and wellness insights (based on qualitative and quantitative research data) to drive development of an innovation pipeline and to better target category communication - particularly to health care professionals as key influencers in consumer lifestyle and nutrition choices. This approach was subsequently showcased at the annual Nestle Global Coffee Seminar and heralded as best-in-class communication for an emerging brand. Brand Manager - NESCAFE Nestlé Australia Limited January 2008  –  May 2011  (3 years 5 months) Responsible for brand management of NESCAFE Greenblend as well as the development of a broader 'Wellbeing' coffee strategy. Key achievements include generating health and wellness insights (based on qualitative and quantitative research data) to drive development of an innovation pipeline and to better target category communication - particularly to health care professionals as key influencers in consumer lifestyle and nutrition choices. This approach was subsequently showcased at the annual Nestle Global Coffee Seminar and heralded as best-in-class communication for an emerging brand. Manager Corporate Strategy Nestlé S.A. January 2010  –  October 2010  (10 months) Selected to represent Beverages Division in broader corporate growth strategy project across Australia/New Zealand. Responsible for bringing together consumer, category, and channel data to develop growth platforms over the next 5 years prior to presenting to Executive Steering Committee (inclusive of CEO and CFO). Key achievements included a prioritised innovation pipeline as well as designing a methodology to assess commercial potential of nutrition-based positioning across Nestle's collection of 1,500+ food & beverage brands. Manager Corporate Strategy Nestlé S.A. January 2010  –  October 2010  (10 months) Selected to represent Beverages Division in broader corporate growth strategy project across Australia/New Zealand. Responsible for bringing together consumer, category, and channel data to develop growth platforms over the next 5 years prior to presenting to Executive Steering Committee (inclusive of CEO and CFO). Key achievements included a prioritised innovation pipeline as well as designing a methodology to assess commercial potential of nutrition-based positioning across Nestle's collection of 1,500+ food & beverage brands. Brand Manager - MILO Nestle S.A. March 2009  –  October 2009  (8 months) Responsible for managing the integrated marketing strategy for MILO, incorporating sports sponsorships, traditional above-the-line media, and digital media. Key achievements included the development of a communication strategy centred on MILO's nutritional credentials (identified through distilling insights from consumer and shopper research) and launch of a new website. This resulted in restoring MILO to growth across all KPI's - (volume share, value share, and brand equity scores) after a steady 5-year decline. Brand Manager - MILO Nestle S.A. March 2009  –  October 2009  (8 months) Responsible for managing the integrated marketing strategy for MILO, incorporating sports sponsorships, traditional above-the-line media, and digital media. Key achievements included the development of a communication strategy centred on MILO's nutritional credentials (identified through distilling insights from consumer and shopper research) and launch of a new website. This resulted in restoring MILO to growth across all KPI's - (volume share, value share, and brand equity scores) after a steady 5-year decline. Assistant Brand Manager Nestlé S.A. January 2008  –  February 2009  (1 year 2 months) Responsible for providing marketing support across the milk drinks portfolio. Provided day-to-day assistance on managing the execution of an integrated marketing campaign for MILO, while leading the development of the brand and communication strategy for NESQUIK. Key achievements included the development of insights for NESQUIK; from qualitative research with children and mums through to the translation of these insights into the repositioning of the brand to increase its relevance and appeal. Assistant Brand Manager Nestlé S.A. January 2008  –  February 2009  (1 year 2 months) Responsible for providing marketing support across the milk drinks portfolio. Provided day-to-day assistance on managing the execution of an integrated marketing campaign for MILO, while leading the development of the brand and communication strategy for NESQUIK. Key achievements included the development of insights for NESQUIK; from qualitative research with children and mums through to the translation of these insights into the repositioning of the brand to increase its relevance and appeal. Assistant Product Manager Village Roadshow Entertainment August 2006  –  January 2008  (1 year 6 months) Responsible for developing marketing campaigns for theatrical titles across the entire product life cycle. Managed studio relationships, assessed potential return-on-investment across the life cycle, designed communication touch-point plans, and then developed/executed trade marketing initiatives and sales support. Key achievements included winning an AVSDA for Best Marketing Campaign 2007 for 'Hoodwinked' and the development and launch of DVD2GIVE - an online DVD gift selector. Assistant Product Manager Village Roadshow Entertainment August 2006  –  January 2008  (1 year 6 months) Responsible for developing marketing campaigns for theatrical titles across the entire product life cycle. Managed studio relationships, assessed potential return-on-investment across the life cycle, designed communication touch-point plans, and then developed/executed trade marketing initiatives and sales support. Key achievements included winning an AVSDA for Best Marketing Campaign 2007 for 'Hoodwinked' and the development and launch of DVD2GIVE - an online DVD gift selector. Business Development Executive Asia Pacific Trading October 2004  –  June 2006  (1 year 9 months) Responsible for cross functional duties as founding member of start-up business, including; stakeholder management across the supply chain of beef suppliers, abattoirs, and Korean beef importers, development and execution of a B2B marketing strategy, and business development support for subsequent expansion into a greenfield soup operation. Key achievements included securing supply from local beef suppliers and councils in Northern NSW after their initial reluctance to partner with foreign investors and the resulting successful sale of the business. Business Development Executive Asia Pacific Trading October 2004  –  June 2006  (1 year 9 months) Responsible for cross functional duties as founding member of start-up business, including; stakeholder management across the supply chain of beef suppliers, abattoirs, and Korean beef importers, development and execution of a B2B marketing strategy, and business development support for subsequent expansion into a greenfield soup operation. Key achievements included securing supply from local beef suppliers and councils in Northern NSW after their initial reluctance to partner with foreign investors and the resulting successful sale of the business. Assistant Editor MG Group Pty Ltd September 2001  –  May 2004  (2 years 9 months) Responsible for liaising with editors to evaluate relevant content and the editing of all English components of the Inflight magazine. Key achievements included being selected to accompany the Managing Director to Korea in order to secure advertising with major accounts such as Samsung Electronics, Samsung Motors, and the Korean Tourism Organisation.; Responsible for completing market feasibility studies (including forecasting ticket sales) ahead of key performances and developing marketing plans (inclusive of media buying, sponsorship, and event management). Key achievements included securing and managing the sponsorship relationship with Samsung Electronics as well as successfully managing a number of red carpet events. Assistant Editor MG Group Pty Ltd September 2001  –  May 2004  (2 years 9 months) Responsible for liaising with editors to evaluate relevant content and the editing of all English components of the Inflight magazine. Key achievements included being selected to accompany the Managing Director to Korea in order to secure advertising with major accounts such as Samsung Electronics, Samsung Motors, and the Korean Tourism Organisation.; Responsible for completing market feasibility studies (including forecasting ticket sales) ahead of key performances and developing marketing plans (inclusive of media buying, sponsorship, and event management). Key achievements included securing and managing the sponsorship relationship with Samsung Electronics as well as successfully managing a number of red carpet events. Skills Top Skills 14 Integrated Marketing 13 Strategy 7 Market Research 4 Digital Marketing 4 Brand Management 3 Digital Media 2 Marketing 1 Cross-functional Team... 1 Business Development 0 Marketing Strategy Noelle also knows about... 0 Business Strategy 0 Management 0 Online Advertising 0 Advertising 0 Product Marketing Skills  Top Skills 14 Integrated Marketing 13 Strategy 7 Market Research 4 Digital Marketing 4 Brand Management 3 Digital Media 2 Marketing 1 Cross-functional Team... 1 Business Development 0 Marketing Strategy Noelle also knows about... 0 Business Strategy 0 Management 0 Online Advertising 0 Advertising 0 Product Marketing Top Skills 14 Integrated Marketing 13 Strategy 7 Market Research 4 Digital Marketing 4 Brand Management 3 Digital Media 2 Marketing 1 Cross-functional Team... 1 Business Development 0 Marketing Strategy Noelle also knows about... 0 Business Strategy 0 Management 0 Online Advertising 0 Advertising 0 Product Marketing Top Skills 14 Integrated Marketing 13 Strategy 7 Market Research 4 Digital Marketing 4 Brand Management 3 Digital Media 2 Marketing 1 Cross-functional Team... 1 Business Development 0 Marketing Strategy Noelle also knows about... 0 Business Strategy 0 Management 0 Online Advertising 0 Advertising 0 Product Marketing                     0 Business Strategy 0 Management 0 Online Advertising 0 Advertising 0 Product Marketing Education Australian Graduate School of Management North Sydney Girls High School Northwestern University - Kellogg School of Management Australian Graduate School of Management Australian Graduate School of Management Australian Graduate School of Management North Sydney Girls High School North Sydney Girls High School North Sydney Girls High School Northwestern University - Kellogg School of Management Northwestern University - Kellogg School of Management Northwestern University - Kellogg School of Management ", "Experience Principal Industry Analyst Google October 2013  – Present (1 year 10 months) Moscow, Russian Federation *Building and leading a team of Analysts in Moscow Large Customer Sales team: \n* defining strategic priorities for the team \n* leading all people processes, including recruiting, professional development and evaluation \n* directing content/resource operations for the research unit \n* Playing an active role in delivering knowledge to clients- help teams scope research needs, offer guidance concerning best research approach, provide personal perspectives and analysis \n* Conducting trainings on Google Analysis Tools to internal and external audiences \n* Delivering presentations on digital marketing trends to external audiences Research Manager McKinsey & Company November 2009  –  September 2013  (3 years 11 months) Moscow, Russian Federation * Leading a group of 18 Moscow based analysts: \n* defining strategic priorities for the team \n* leading all people processes, including recruiting, professional development and evaluation \n* directing content/resource operations for the research unit, with responsibility for financial performance \n* Playing an active role in delivering knowledge to client service teams - help teams scope research needs, offer guidance concerning best research approach, provide personal perspectives and analysis \n* Playing faculty role on global trainings Senior Research Analyst McKinsey&Co June 2004  –  October 2009  (5 years 5 months) Senior Analyst IFD Kapital February 2004  –  May 2004  (4 months) -Provide insight on market environment in its key aspects as macroeconomics, company and client industries dynamics and competitive developments \n-Leverage market knowledge to contribute into strategic and operating planning and executive decision-making \n-Manage core marketing information/intelligence business processes, such as gathering relevant data and information from the chosen reliable sources, validating information flows, converting the data and information into a structured knowledge base, and generating a scheduled flow of business reports Research Manager in Marketing Department PricewaterhouseCoopers February 2001  –  March 2004  (3 years 2 months) -Provide research, information and knowledge management support to all partners and staff  \n-Develop and maintain a system to facilitate access to any external and internal knowledge information base \n-Supervise work of two marketing research assistants \n-Manage external information/research providers (\tOrganize research function outsourcing, supervise work of Research contractors  \n-Conduct market sector analysis, company analysis, competitors analysis, macroeconomic research, M&A research \n-Make presentations on marketing research tools/techniques, provide on-going training and support to users Equity Analyst CentreInvest Securities October 1999  –  January 2001  (1 year 4 months) -Wrote research reports on various sectors and companies (focus on metals & mining) \n-Analyzed companies, worked with balance sheets, income statements, cash flow reports, business plans, industry surveys \n-Created and administered Excel program to monitor stock market activity Junior Research Analyst CentreInvest Group, Moscow, Russia 1999  –  2001  (2 years) Principal Industry Analyst Google October 2013  – Present (1 year 10 months) Moscow, Russian Federation *Building and leading a team of Analysts in Moscow Large Customer Sales team: \n* defining strategic priorities for the team \n* leading all people processes, including recruiting, professional development and evaluation \n* directing content/resource operations for the research unit \n* Playing an active role in delivering knowledge to clients- help teams scope research needs, offer guidance concerning best research approach, provide personal perspectives and analysis \n* Conducting trainings on Google Analysis Tools to internal and external audiences \n* Delivering presentations on digital marketing trends to external audiences Principal Industry Analyst Google October 2013  – Present (1 year 10 months) Moscow, Russian Federation *Building and leading a team of Analysts in Moscow Large Customer Sales team: \n* defining strategic priorities for the team \n* leading all people processes, including recruiting, professional development and evaluation \n* directing content/resource operations for the research unit \n* Playing an active role in delivering knowledge to clients- help teams scope research needs, offer guidance concerning best research approach, provide personal perspectives and analysis \n* Conducting trainings on Google Analysis Tools to internal and external audiences \n* Delivering presentations on digital marketing trends to external audiences Research Manager McKinsey & Company November 2009  –  September 2013  (3 years 11 months) Moscow, Russian Federation * Leading a group of 18 Moscow based analysts: \n* defining strategic priorities for the team \n* leading all people processes, including recruiting, professional development and evaluation \n* directing content/resource operations for the research unit, with responsibility for financial performance \n* Playing an active role in delivering knowledge to client service teams - help teams scope research needs, offer guidance concerning best research approach, provide personal perspectives and analysis \n* Playing faculty role on global trainings Research Manager McKinsey & Company November 2009  –  September 2013  (3 years 11 months) Moscow, Russian Federation * Leading a group of 18 Moscow based analysts: \n* defining strategic priorities for the team \n* leading all people processes, including recruiting, professional development and evaluation \n* directing content/resource operations for the research unit, with responsibility for financial performance \n* Playing an active role in delivering knowledge to client service teams - help teams scope research needs, offer guidance concerning best research approach, provide personal perspectives and analysis \n* Playing faculty role on global trainings Senior Research Analyst McKinsey&Co June 2004  –  October 2009  (5 years 5 months) Senior Research Analyst McKinsey&Co June 2004  –  October 2009  (5 years 5 months) Senior Analyst IFD Kapital February 2004  –  May 2004  (4 months) -Provide insight on market environment in its key aspects as macroeconomics, company and client industries dynamics and competitive developments \n-Leverage market knowledge to contribute into strategic and operating planning and executive decision-making \n-Manage core marketing information/intelligence business processes, such as gathering relevant data and information from the chosen reliable sources, validating information flows, converting the data and information into a structured knowledge base, and generating a scheduled flow of business reports Senior Analyst IFD Kapital February 2004  –  May 2004  (4 months) -Provide insight on market environment in its key aspects as macroeconomics, company and client industries dynamics and competitive developments \n-Leverage market knowledge to contribute into strategic and operating planning and executive decision-making \n-Manage core marketing information/intelligence business processes, such as gathering relevant data and information from the chosen reliable sources, validating information flows, converting the data and information into a structured knowledge base, and generating a scheduled flow of business reports Research Manager in Marketing Department PricewaterhouseCoopers February 2001  –  March 2004  (3 years 2 months) -Provide research, information and knowledge management support to all partners and staff  \n-Develop and maintain a system to facilitate access to any external and internal knowledge information base \n-Supervise work of two marketing research assistants \n-Manage external information/research providers (\tOrganize research function outsourcing, supervise work of Research contractors  \n-Conduct market sector analysis, company analysis, competitors analysis, macroeconomic research, M&A research \n-Make presentations on marketing research tools/techniques, provide on-going training and support to users Research Manager in Marketing Department PricewaterhouseCoopers February 2001  –  March 2004  (3 years 2 months) -Provide research, information and knowledge management support to all partners and staff  \n-Develop and maintain a system to facilitate access to any external and internal knowledge information base \n-Supervise work of two marketing research assistants \n-Manage external information/research providers (\tOrganize research function outsourcing, supervise work of Research contractors  \n-Conduct market sector analysis, company analysis, competitors analysis, macroeconomic research, M&A research \n-Make presentations on marketing research tools/techniques, provide on-going training and support to users Equity Analyst CentreInvest Securities October 1999  –  January 2001  (1 year 4 months) -Wrote research reports on various sectors and companies (focus on metals & mining) \n-Analyzed companies, worked with balance sheets, income statements, cash flow reports, business plans, industry surveys \n-Created and administered Excel program to monitor stock market activity Equity Analyst CentreInvest Securities October 1999  –  January 2001  (1 year 4 months) -Wrote research reports on various sectors and companies (focus on metals & mining) \n-Analyzed companies, worked with balance sheets, income statements, cash flow reports, business plans, industry surveys \n-Created and administered Excel program to monitor stock market activity Junior Research Analyst CentreInvest Group, Moscow, Russia 1999  –  2001  (2 years) Junior Research Analyst CentreInvest Group, Moscow, Russia 1999  –  2001  (2 years) Skills 16 Competitive Analysis 15 Strategy 12 Management Consulting 11 Financial Modeling 7 Emerging Markets 5 Analytics 4 Research 3 Valuation 2 Market Entry Skills  16 Competitive Analysis 15 Strategy 12 Management Consulting 11 Financial Modeling 7 Emerging Markets 5 Analytics 4 Research 3 Valuation 2 Market Entry 16 Competitive Analysis 15 Strategy 12 Management Consulting 11 Financial Modeling 7 Emerging Markets 5 Analytics 4 Research 3 Valuation 2 Market Entry 16 Competitive Analysis 15 Strategy 12 Management Consulting 11 Financial Modeling 7 Emerging Markets 5 Analytics 4 Research 3 Valuation 2 Market Entry                   Education American Institute of Business and Economics (AIBEC) MBA,  Management and Economics 1998  – 2004 Russian University of Humanities Specialst,  Management 1994  – 1999 American Institute of Business and Economics (AIBEC) MBA,  Management and Economics 1998  – 2004 American Institute of Business and Economics (AIBEC) MBA,  Management and Economics 1998  – 2004 American Institute of Business and Economics (AIBEC) MBA,  Management and Economics 1998  – 2004 Russian University of Humanities Specialst,  Management 1994  – 1999 Russian University of Humanities Specialst,  Management 1994  – 1999 Russian University of Humanities Specialst,  Management 1994  – 1999 ", "Skills Skills     Honors & Awards ", "Summary I am a professional with substantive experience in strategic planning, integrated marketing communications, relationship building and management, and talent development in both corporate and nonprofit settings. \n \nAs an inquisitive individual with a desire to constantly learn and develop, I seek work that inspires and fulfills me as well as provides me with the ability to meaningfully contribute to the success of the organization and its various constituencies.  \n \nMoreover, I am an adept leader and organizer who thrives in creative, thought-provoking, and collaborative environments. I strive to ensure that my team's work is thorough, strategically-driven, results-oriented, and successful. I believe strong relationships are necessary for achieving high standards and performing noteworthy work. Accordingly, I am an innate relationship builder who successfully establishes and fosters connections with myriad partners to achieve results.  \n \nMy diverse experiences position me to be successful in various settings. Collectively, they have instilled in me the critical skills (e.g., strategic thinking, effective communication, creativity, and leadership) necessary to successfully support and advance an organization's mission in an evolving and increasingly complex landscape. \n \nSample of competencies: Relationship cultivation and stewardship, strategic planning, talent acquisition and development, persuasive presenting, marketing, and consumer/target segmentation Summary I am a professional with substantive experience in strategic planning, integrated marketing communications, relationship building and management, and talent development in both corporate and nonprofit settings. \n \nAs an inquisitive individual with a desire to constantly learn and develop, I seek work that inspires and fulfills me as well as provides me with the ability to meaningfully contribute to the success of the organization and its various constituencies.  \n \nMoreover, I am an adept leader and organizer who thrives in creative, thought-provoking, and collaborative environments. I strive to ensure that my team's work is thorough, strategically-driven, results-oriented, and successful. I believe strong relationships are necessary for achieving high standards and performing noteworthy work. Accordingly, I am an innate relationship builder who successfully establishes and fosters connections with myriad partners to achieve results.  \n \nMy diverse experiences position me to be successful in various settings. Collectively, they have instilled in me the critical skills (e.g., strategic thinking, effective communication, creativity, and leadership) necessary to successfully support and advance an organization's mission in an evolving and increasingly complex landscape. \n \nSample of competencies: Relationship cultivation and stewardship, strategic planning, talent acquisition and development, persuasive presenting, marketing, and consumer/target segmentation I am a professional with substantive experience in strategic planning, integrated marketing communications, relationship building and management, and talent development in both corporate and nonprofit settings. \n \nAs an inquisitive individual with a desire to constantly learn and develop, I seek work that inspires and fulfills me as well as provides me with the ability to meaningfully contribute to the success of the organization and its various constituencies.  \n \nMoreover, I am an adept leader and organizer who thrives in creative, thought-provoking, and collaborative environments. I strive to ensure that my team's work is thorough, strategically-driven, results-oriented, and successful. I believe strong relationships are necessary for achieving high standards and performing noteworthy work. Accordingly, I am an innate relationship builder who successfully establishes and fosters connections with myriad partners to achieve results.  \n \nMy diverse experiences position me to be successful in various settings. Collectively, they have instilled in me the critical skills (e.g., strategic thinking, effective communication, creativity, and leadership) necessary to successfully support and advance an organization's mission in an evolving and increasingly complex landscape. \n \nSample of competencies: Relationship cultivation and stewardship, strategic planning, talent acquisition and development, persuasive presenting, marketing, and consumer/target segmentation I am a professional with substantive experience in strategic planning, integrated marketing communications, relationship building and management, and talent development in both corporate and nonprofit settings. \n \nAs an inquisitive individual with a desire to constantly learn and develop, I seek work that inspires and fulfills me as well as provides me with the ability to meaningfully contribute to the success of the organization and its various constituencies.  \n \nMoreover, I am an adept leader and organizer who thrives in creative, thought-provoking, and collaborative environments. I strive to ensure that my team's work is thorough, strategically-driven, results-oriented, and successful. I believe strong relationships are necessary for achieving high standards and performing noteworthy work. Accordingly, I am an innate relationship builder who successfully establishes and fosters connections with myriad partners to achieve results.  \n \nMy diverse experiences position me to be successful in various settings. Collectively, they have instilled in me the critical skills (e.g., strategic thinking, effective communication, creativity, and leadership) necessary to successfully support and advance an organization's mission in an evolving and increasingly complex landscape. \n \nSample of competencies: Relationship cultivation and stewardship, strategic planning, talent acquisition and development, persuasive presenting, marketing, and consumer/target segmentation Experience Sales Development Manager Google July 2015  – Present (1 month) Greater Chicago Area Principal Industry Analyst Google March 2015  –  June 2015  (4 months) Greater Chicago Area Director of Career Services, School of Education University of Pittsburgh August 2014  –  March 2015  (8 months) Greater Pittsburgh Area As the head of a new career services offering, I am responsible for leading all aspects of the office, including its establishment within the School of Education and advocating for its services. Aside from my primary responsibility of coaching 800+ master's and PhD students (including international students), I: \n \n- Craft and deliver a vision for students, staff, and faculty to follow and support \n- Develop school’s first strategic plan to formalize and improve career service offerings in 4 academic departments \n- Create targeted communications plan to build school’s visibility with 100 key regional and national employers \n- Employ user-experience best practices to create website update and re-launch plan, improving user navigation and content accessibility for 1,500 visits per month \n- Market and manage mentor program, pairing 250 alumni with students; supports early stages of students’ careers \n- Institute CRM platform to gather audience information, track involvement, and identify engagement opportunities  \n- Partner with 10 career services offices across university to share best practices and to capitalize on scale when possible (e.g., career fairs, speaker series) Career Services Manager University of Chicago Booth School of Business July 2013  –  June 2014  (1 year) Chicago, Illinois I supported the career management efforts of part-time and executive MBA students (1,600 total enrollment) and alumni (43,000 total network) and led department-wide processes development and improvement. A sampling of my accomplishments include: \n \n- Created quarterly, multichannel communications plans to build awareness of and to increase participation in office offerings; resulted in 15% increase of online profile completions over two quarters \n- Developed process to gather 3,000+ students’ target lists to enhance employer relations’ marketing efforts \n- Evaluated résumé referral program, identifying areas to increase efficacy of student-employer connections Graduate Intern - Assessment, Planning, and Communications DePaul University August 2013  –  January 2014  (6 months) Chicago, Illinois I contributed to and led efforts within the assessment and communications units of the Division of Student Affairs. My accomplishments include: \n \n- Performed division-wide assessment of 15 leadership training programs, impacting 200+ students, to measure delivery on Division’s strategic priority of leadership development; presented findings and written report to five vice presidents \n- Developed a workshop on cultural competence in measurement and delivered material to representatives from 15 university departments Graduate Assistant - Medill Career Services Northwestern University January 2013  –  August 2013  (8 months) Evanston, IL I worked across departments that supported a total of 1,000+ domestic and international students studying journalism and integrated marketing communications. In the role, I: \n \n- Developed employer outreach plan to build awareness of and engagement with integrated marketing program \n- Coached and advised marketing students on career preparation and academic strategies \n- Created strategic plan that established 4 career programs, resulting in 20% increase in yearly program participation Associate Director Mindshare November 2010  –  August 2012  (1 year 10 months) Chicago, IL I served as the lead on the Family Care sector of the Kimberly Clark account, supervising day-to-day operations, integrated marketing planning, and account and client management. As a leader and manager, I was goal- and efficiency-oriented, but I never sacrificed quality or client service during the process. \n \nIn the dynamic, multi-agency environment, I performed various duties and achieved numerous accomplishments. For instance, I: \n \n- Improved team’s performance rating 25% (highest in four years) by assessing needs and reprioritizing team workload to focus on strategic business conversations \n- Consulted clients on communications strategies as day-to-day business lead and created tactical proposals to increase consumer engagement and achieve revenue goals \n- Led highly effective team of five by managing operations, increasing efficiency, improving morale, and mentoring career growth \n- Identified market opportunities and analyzed data to inform consumer insights for 5 brands \n- Developed award-winning initiatives that increased brand affinity, sales, and revenue; awarded Bronze Effie for Kleenex Brand Tissue program and Silver Effie for Cottonelle Toilet Paper program \n \n \nIn addition to my daily responsibilities, I was heavily involved in personnel and organizational initiatives, such as:  \n \n- Leading University of Missouri recruiting team efforts by outlining sourcing strategies, partnering with university offices, reviewing résumés, and interviewing candidates \n- Coaching entry-level trainees throughout their training experience and during their capstone project; two groups I advised won first place in the capstone competition (Open) 1 recommendation Shelley Rees Digital Strategy & Planning Consultant at Freelance Matt is simply one of the smartest and most effective people I've worked with.\nOn a challenging, billion-dollar, multi-agency account, Matt not only had to perform his own job as Media Director, but also co-ordinate and cultivate all the agency... View Media Supervisor Starcom MediaVest Group September 2007  –  November 2010  (3 years 3 months) Chicago, IL I managed the day-to-day business operations of and participated in program planning for the Kraft Pizza Division (DiGiorno, California Pizza Kitchen, Jack's, and Tombstone), Oscar Mayer, and Procter & Gamble fabric care brands (Downy, Dreft, and Bounce). My accomplishments included: \n \n- Developing an integrated strategy that contributed to a 20% increase in Kraft Foods’ Pizza Category 2009 net revenue \n- Elevating client’s annual rating of agency to “A” by engaging in all business operations and driving efficient growth \n- Analyzing proprietary and syndicated data to develop 12 consumer segmentation profiles that informed the marketing strategies for 10 organizations \n- Led 2 associates daily to ensure effective stewardship of out clients' accounts; coached associates to support appropriate career development (Open) 1 recommendation Ellie Dimick Principal Industry Analyst at Google Matt’s ability to think strategically and execute tactically is impressive. As a team leader, client manager, and cross-functional partner, Matt maintains laser focus on business objectives through open communication and by outlining clear... View Media Associate Starcom MediaVest Group September 2005  –  October 2007  (2 years 2 months) Chicago, IL Across both national TV buying and strategic planning, I mined and synthesized data to inform strategies that built brand awareness, increased marketing efficacy, and delivered increased revenue (e.g., 20% in 2009 for Kraft's Pizza Division) for global, billion-dollar brands.  \n \nMy clients included Nintendo of America and Kraft Foods (DiGiorno, California Pizza Kitchen, Jack's, Tombstone) Sales Development Manager Google July 2015  – Present (1 month) Greater Chicago Area Sales Development Manager Google July 2015  – Present (1 month) Greater Chicago Area Principal Industry Analyst Google March 2015  –  June 2015  (4 months) Greater Chicago Area Principal Industry Analyst Google March 2015  –  June 2015  (4 months) Greater Chicago Area Director of Career Services, School of Education University of Pittsburgh August 2014  –  March 2015  (8 months) Greater Pittsburgh Area As the head of a new career services offering, I am responsible for leading all aspects of the office, including its establishment within the School of Education and advocating for its services. Aside from my primary responsibility of coaching 800+ master's and PhD students (including international students), I: \n \n- Craft and deliver a vision for students, staff, and faculty to follow and support \n- Develop school’s first strategic plan to formalize and improve career service offerings in 4 academic departments \n- Create targeted communications plan to build school’s visibility with 100 key regional and national employers \n- Employ user-experience best practices to create website update and re-launch plan, improving user navigation and content accessibility for 1,500 visits per month \n- Market and manage mentor program, pairing 250 alumni with students; supports early stages of students’ careers \n- Institute CRM platform to gather audience information, track involvement, and identify engagement opportunities  \n- Partner with 10 career services offices across university to share best practices and to capitalize on scale when possible (e.g., career fairs, speaker series) Director of Career Services, School of Education University of Pittsburgh August 2014  –  March 2015  (8 months) Greater Pittsburgh Area As the head of a new career services offering, I am responsible for leading all aspects of the office, including its establishment within the School of Education and advocating for its services. Aside from my primary responsibility of coaching 800+ master's and PhD students (including international students), I: \n \n- Craft and deliver a vision for students, staff, and faculty to follow and support \n- Develop school’s first strategic plan to formalize and improve career service offerings in 4 academic departments \n- Create targeted communications plan to build school’s visibility with 100 key regional and national employers \n- Employ user-experience best practices to create website update and re-launch plan, improving user navigation and content accessibility for 1,500 visits per month \n- Market and manage mentor program, pairing 250 alumni with students; supports early stages of students’ careers \n- Institute CRM platform to gather audience information, track involvement, and identify engagement opportunities  \n- Partner with 10 career services offices across university to share best practices and to capitalize on scale when possible (e.g., career fairs, speaker series) Career Services Manager University of Chicago Booth School of Business July 2013  –  June 2014  (1 year) Chicago, Illinois I supported the career management efforts of part-time and executive MBA students (1,600 total enrollment) and alumni (43,000 total network) and led department-wide processes development and improvement. A sampling of my accomplishments include: \n \n- Created quarterly, multichannel communications plans to build awareness of and to increase participation in office offerings; resulted in 15% increase of online profile completions over two quarters \n- Developed process to gather 3,000+ students’ target lists to enhance employer relations’ marketing efforts \n- Evaluated résumé referral program, identifying areas to increase efficacy of student-employer connections Career Services Manager University of Chicago Booth School of Business July 2013  –  June 2014  (1 year) Chicago, Illinois I supported the career management efforts of part-time and executive MBA students (1,600 total enrollment) and alumni (43,000 total network) and led department-wide processes development and improvement. A sampling of my accomplishments include: \n \n- Created quarterly, multichannel communications plans to build awareness of and to increase participation in office offerings; resulted in 15% increase of online profile completions over two quarters \n- Developed process to gather 3,000+ students’ target lists to enhance employer relations’ marketing efforts \n- Evaluated résumé referral program, identifying areas to increase efficacy of student-employer connections Graduate Intern - Assessment, Planning, and Communications DePaul University August 2013  –  January 2014  (6 months) Chicago, Illinois I contributed to and led efforts within the assessment and communications units of the Division of Student Affairs. My accomplishments include: \n \n- Performed division-wide assessment of 15 leadership training programs, impacting 200+ students, to measure delivery on Division’s strategic priority of leadership development; presented findings and written report to five vice presidents \n- Developed a workshop on cultural competence in measurement and delivered material to representatives from 15 university departments Graduate Intern - Assessment, Planning, and Communications DePaul University August 2013  –  January 2014  (6 months) Chicago, Illinois I contributed to and led efforts within the assessment and communications units of the Division of Student Affairs. My accomplishments include: \n \n- Performed division-wide assessment of 15 leadership training programs, impacting 200+ students, to measure delivery on Division’s strategic priority of leadership development; presented findings and written report to five vice presidents \n- Developed a workshop on cultural competence in measurement and delivered material to representatives from 15 university departments Graduate Assistant - Medill Career Services Northwestern University January 2013  –  August 2013  (8 months) Evanston, IL I worked across departments that supported a total of 1,000+ domestic and international students studying journalism and integrated marketing communications. In the role, I: \n \n- Developed employer outreach plan to build awareness of and engagement with integrated marketing program \n- Coached and advised marketing students on career preparation and academic strategies \n- Created strategic plan that established 4 career programs, resulting in 20% increase in yearly program participation Graduate Assistant - Medill Career Services Northwestern University January 2013  –  August 2013  (8 months) Evanston, IL I worked across departments that supported a total of 1,000+ domestic and international students studying journalism and integrated marketing communications. In the role, I: \n \n- Developed employer outreach plan to build awareness of and engagement with integrated marketing program \n- Coached and advised marketing students on career preparation and academic strategies \n- Created strategic plan that established 4 career programs, resulting in 20% increase in yearly program participation Associate Director Mindshare November 2010  –  August 2012  (1 year 10 months) Chicago, IL I served as the lead on the Family Care sector of the Kimberly Clark account, supervising day-to-day operations, integrated marketing planning, and account and client management. As a leader and manager, I was goal- and efficiency-oriented, but I never sacrificed quality or client service during the process. \n \nIn the dynamic, multi-agency environment, I performed various duties and achieved numerous accomplishments. For instance, I: \n \n- Improved team’s performance rating 25% (highest in four years) by assessing needs and reprioritizing team workload to focus on strategic business conversations \n- Consulted clients on communications strategies as day-to-day business lead and created tactical proposals to increase consumer engagement and achieve revenue goals \n- Led highly effective team of five by managing operations, increasing efficiency, improving morale, and mentoring career growth \n- Identified market opportunities and analyzed data to inform consumer insights for 5 brands \n- Developed award-winning initiatives that increased brand affinity, sales, and revenue; awarded Bronze Effie for Kleenex Brand Tissue program and Silver Effie for Cottonelle Toilet Paper program \n \n \nIn addition to my daily responsibilities, I was heavily involved in personnel and organizational initiatives, such as:  \n \n- Leading University of Missouri recruiting team efforts by outlining sourcing strategies, partnering with university offices, reviewing résumés, and interviewing candidates \n- Coaching entry-level trainees throughout their training experience and during their capstone project; two groups I advised won first place in the capstone competition (Open) 1 recommendation Shelley Rees Digital Strategy & Planning Consultant at Freelance Matt is simply one of the smartest and most effective people I've worked with.\nOn a challenging, billion-dollar, multi-agency account, Matt not only had to perform his own job as Media Director, but also co-ordinate and cultivate all the agency... View Associate Director Mindshare November 2010  –  August 2012  (1 year 10 months) Chicago, IL I served as the lead on the Family Care sector of the Kimberly Clark account, supervising day-to-day operations, integrated marketing planning, and account and client management. As a leader and manager, I was goal- and efficiency-oriented, but I never sacrificed quality or client service during the process. \n \nIn the dynamic, multi-agency environment, I performed various duties and achieved numerous accomplishments. For instance, I: \n \n- Improved team’s performance rating 25% (highest in four years) by assessing needs and reprioritizing team workload to focus on strategic business conversations \n- Consulted clients on communications strategies as day-to-day business lead and created tactical proposals to increase consumer engagement and achieve revenue goals \n- Led highly effective team of five by managing operations, increasing efficiency, improving morale, and mentoring career growth \n- Identified market opportunities and analyzed data to inform consumer insights for 5 brands \n- Developed award-winning initiatives that increased brand affinity, sales, and revenue; awarded Bronze Effie for Kleenex Brand Tissue program and Silver Effie for Cottonelle Toilet Paper program \n \n \nIn addition to my daily responsibilities, I was heavily involved in personnel and organizational initiatives, such as:  \n \n- Leading University of Missouri recruiting team efforts by outlining sourcing strategies, partnering with university offices, reviewing résumés, and interviewing candidates \n- Coaching entry-level trainees throughout their training experience and during their capstone project; two groups I advised won first place in the capstone competition (Open) 1 recommendation Shelley Rees Digital Strategy & Planning Consultant at Freelance Matt is simply one of the smartest and most effective people I've worked with.\nOn a challenging, billion-dollar, multi-agency account, Matt not only had to perform his own job as Media Director, but also co-ordinate and cultivate all the agency... View Media Supervisor Starcom MediaVest Group September 2007  –  November 2010  (3 years 3 months) Chicago, IL I managed the day-to-day business operations of and participated in program planning for the Kraft Pizza Division (DiGiorno, California Pizza Kitchen, Jack's, and Tombstone), Oscar Mayer, and Procter & Gamble fabric care brands (Downy, Dreft, and Bounce). My accomplishments included: \n \n- Developing an integrated strategy that contributed to a 20% increase in Kraft Foods’ Pizza Category 2009 net revenue \n- Elevating client’s annual rating of agency to “A” by engaging in all business operations and driving efficient growth \n- Analyzing proprietary and syndicated data to develop 12 consumer segmentation profiles that informed the marketing strategies for 10 organizations \n- Led 2 associates daily to ensure effective stewardship of out clients' accounts; coached associates to support appropriate career development (Open) 1 recommendation Ellie Dimick Principal Industry Analyst at Google Matt’s ability to think strategically and execute tactically is impressive. As a team leader, client manager, and cross-functional partner, Matt maintains laser focus on business objectives through open communication and by outlining clear... View Media Supervisor Starcom MediaVest Group September 2007  –  November 2010  (3 years 3 months) Chicago, IL I managed the day-to-day business operations of and participated in program planning for the Kraft Pizza Division (DiGiorno, California Pizza Kitchen, Jack's, and Tombstone), Oscar Mayer, and Procter & Gamble fabric care brands (Downy, Dreft, and Bounce). My accomplishments included: \n \n- Developing an integrated strategy that contributed to a 20% increase in Kraft Foods’ Pizza Category 2009 net revenue \n- Elevating client’s annual rating of agency to “A” by engaging in all business operations and driving efficient growth \n- Analyzing proprietary and syndicated data to develop 12 consumer segmentation profiles that informed the marketing strategies for 10 organizations \n- Led 2 associates daily to ensure effective stewardship of out clients' accounts; coached associates to support appropriate career development (Open) 1 recommendation Ellie Dimick Principal Industry Analyst at Google Matt’s ability to think strategically and execute tactically is impressive. As a team leader, client manager, and cross-functional partner, Matt maintains laser focus on business objectives through open communication and by outlining clear... View Media Associate Starcom MediaVest Group September 2005  –  October 2007  (2 years 2 months) Chicago, IL Across both national TV buying and strategic planning, I mined and synthesized data to inform strategies that built brand awareness, increased marketing efficacy, and delivered increased revenue (e.g., 20% in 2009 for Kraft's Pizza Division) for global, billion-dollar brands.  \n \nMy clients included Nintendo of America and Kraft Foods (DiGiorno, California Pizza Kitchen, Jack's, Tombstone) Media Associate Starcom MediaVest Group September 2005  –  October 2007  (2 years 2 months) Chicago, IL Across both national TV buying and strategic planning, I mined and synthesized data to inform strategies that built brand awareness, increased marketing efficacy, and delivered increased revenue (e.g., 20% in 2009 for Kraft's Pizza Division) for global, billion-dollar brands.  \n \nMy clients included Nintendo of America and Kraft Foods (DiGiorno, California Pizza Kitchen, Jack's, Tombstone) ", "Experience Principal Industry Analyst Google December 2012  – Present (2 years 8 months) China Reseller Operation Manager Google May 2009  –  December 2012  (3 years 8 months) China Senior Analyst , Central Sales Operations Google April 2012  –  July 2012  (4 months) United States Channel Sales Operation Manager Motorola May 2006  –  May 2009  (3 years 1 month) China Next Generation Leadership Program Trainee Motorola May 2006  –  October 2007  (1 year 6 months) China Principal Industry Analyst Google December 2012  – Present (2 years 8 months) China Principal Industry Analyst Google December 2012  – Present (2 years 8 months) China Reseller Operation Manager Google May 2009  –  December 2012  (3 years 8 months) China Reseller Operation Manager Google May 2009  –  December 2012  (3 years 8 months) China Senior Analyst , Central Sales Operations Google April 2012  –  July 2012  (4 months) United States Senior Analyst , Central Sales Operations Google April 2012  –  July 2012  (4 months) United States Channel Sales Operation Manager Motorola May 2006  –  May 2009  (3 years 1 month) China Channel Sales Operation Manager Motorola May 2006  –  May 2009  (3 years 1 month) China Next Generation Leadership Program Trainee Motorola May 2006  –  October 2007  (1 year 6 months) China Next Generation Leadership Program Trainee Motorola May 2006  –  October 2007  (1 year 6 months) China Skills Skills     Education Xi'an Jiaotong University Master,  Management Science 2003  – 2006 Xi'an Jiaotong University Master,  Management Science 2003  – 2006 Xi'an Jiaotong University Master,  Management Science 2003  – 2006 Xi'an Jiaotong University Master,  Management Science 2003  – 2006 ", "Summary Business Development ● Alliance Management ● Marketing ● Strategy Consulting ● Technology Sales ● MBA in Marketing and Strategy, INSEAD \n \nCatalyst for revenue and business growth: Strategic, customer- and solutions-focused alliances executive with proven success delivering strong results by growing partnerships and developing new opportunities. \n \n• Exceeded sales quotas by 109% - 120% for net new and existing accounts \n• “Partner of the Year” and President’s Club award-winner  \n• Success increasing market share against Google across EMEA and North America for Microsoft  \n \nProven success in alliance management and business development for technology companies and Systems Integrators. Record of sourcing and managing deals through close by aligning with all levels of an organization. Collaboration with alliance partners and field sales to develop joint pipeline, customer segmentation strategies, and go-to-market programs. Experienced in articulating the business benefits of technology through writing and presenting to Marketing and IT C-level executives. \n \n \nMicrosoft Business Partners: Havas Digital, OMD Digital, Omnicom Group, Starcom  \nEnterprise Clients: American Express, ING Direct, Microsoft, Sirius, Sony, Viacom, Vonage Summary Business Development ● Alliance Management ● Marketing ● Strategy Consulting ● Technology Sales ● MBA in Marketing and Strategy, INSEAD \n \nCatalyst for revenue and business growth: Strategic, customer- and solutions-focused alliances executive with proven success delivering strong results by growing partnerships and developing new opportunities. \n \n• Exceeded sales quotas by 109% - 120% for net new and existing accounts \n• “Partner of the Year” and President’s Club award-winner  \n• Success increasing market share against Google across EMEA and North America for Microsoft  \n \nProven success in alliance management and business development for technology companies and Systems Integrators. Record of sourcing and managing deals through close by aligning with all levels of an organization. Collaboration with alliance partners and field sales to develop joint pipeline, customer segmentation strategies, and go-to-market programs. Experienced in articulating the business benefits of technology through writing and presenting to Marketing and IT C-level executives. \n \n \nMicrosoft Business Partners: Havas Digital, OMD Digital, Omnicom Group, Starcom  \nEnterprise Clients: American Express, ING Direct, Microsoft, Sirius, Sony, Viacom, Vonage Business Development ● Alliance Management ● Marketing ● Strategy Consulting ● Technology Sales ● MBA in Marketing and Strategy, INSEAD \n \nCatalyst for revenue and business growth: Strategic, customer- and solutions-focused alliances executive with proven success delivering strong results by growing partnerships and developing new opportunities. \n \n• Exceeded sales quotas by 109% - 120% for net new and existing accounts \n• “Partner of the Year” and President’s Club award-winner  \n• Success increasing market share against Google across EMEA and North America for Microsoft  \n \nProven success in alliance management and business development for technology companies and Systems Integrators. Record of sourcing and managing deals through close by aligning with all levels of an organization. Collaboration with alliance partners and field sales to develop joint pipeline, customer segmentation strategies, and go-to-market programs. Experienced in articulating the business benefits of technology through writing and presenting to Marketing and IT C-level executives. \n \n \nMicrosoft Business Partners: Havas Digital, OMD Digital, Omnicom Group, Starcom  \nEnterprise Clients: American Express, ING Direct, Microsoft, Sirius, Sony, Viacom, Vonage Business Development ● Alliance Management ● Marketing ● Strategy Consulting ● Technology Sales ● MBA in Marketing and Strategy, INSEAD \n \nCatalyst for revenue and business growth: Strategic, customer- and solutions-focused alliances executive with proven success delivering strong results by growing partnerships and developing new opportunities. \n \n• Exceeded sales quotas by 109% - 120% for net new and existing accounts \n• “Partner of the Year” and President’s Club award-winner  \n• Success increasing market share against Google across EMEA and North America for Microsoft  \n \nProven success in alliance management and business development for technology companies and Systems Integrators. Record of sourcing and managing deals through close by aligning with all levels of an organization. Collaboration with alliance partners and field sales to develop joint pipeline, customer segmentation strategies, and go-to-market programs. Experienced in articulating the business benefits of technology through writing and presenting to Marketing and IT C-level executives. \n \n \nMicrosoft Business Partners: Havas Digital, OMD Digital, Omnicom Group, Starcom  \nEnterprise Clients: American Express, ING Direct, Microsoft, Sirius, Sony, Viacom, Vonage Experience Channel Manager - East/Canada hybris software February 2015  – Present (6 months) Washington D.C. Metro Area hybris, an SAP Company, helps businesses around the globe sell more goods, services and digital content through every touchpoint, channel and device. hybris delivers \"OmniCommerce™\": state-of-the-art master data management and unified commerce processes that give a business a single view of its customers, products and orders, and its customers a single view of the business. hybris' omni-channel software is built on a single platform, based on open standards, that is agile to support limitless innovation, efficient to drive the best TCO, and scalable and extensible to be the last commerce platform companies will ever need. Both principal industry analyst firms rank hybris as a “leader” and list its commerce platform among the top two or three in the market. The same software is available on-premise, on-demand and managed hosted, giving merchants of all sizes maximum flexibility. Over 500 companies have chosen hybris, including global B2B sites W.W.Grainger, Rexel, General Electric, Thomson Reuters and 3M as well as consumer brands Toys“R”Us, Metro, Bridgestone, P&G, Levi's, Nikon, Galeries Lafayette, Migros, Nespresso and Lufthansa. hybris has operations in 15 countries around the globe. hybris is the future of commerce™.  \n \nI have the responsibility of managing a key set of named Agency/SI Partners in the East/Canada region to improve co-selling efforts, drive incremental leads to hybris, and help deliver implementation excellence. Marketing Consultant Offering Project-based marketing consulting May 2014  –  January 2015  (9 months) Washington D.C. Metro Area (Open) 1 recommendation Jorge Corral Business Development Manager at Conexio Group Seena provided Conexio Group with professional consultancy services regarding our internationalization efforts. I fully recommend her. View Director of Strategic Alliances Siteworx 2012  –  April 2014  (2 years) Washington D.C. Metro Area (Open) 3 recommendations, including: Pieter Casneuf CEO at ADAM Software Meeting Seena is meeting a professional with a smile. She has been driving the relationship between ADAM Software and... View Deepak Narisety VP Technology Services at Rauxa Seena’s hard work building relationships with partners always generated new opportunities. I’d work with her to best... View 1 more recommendation MBA Student INSEAD January 2011  –  December 2011  (1 year) Fontainebleau, France and Singapore Business Analyst (MBA Internship) Avon July 2011  –  August 2011  (2 months) Paris Area, France Director of Online & Annual Giving Grameen Foundation 2009  –  2010  (1 year) Washington D.C. Metro Area (Open) 1 recommendation Matt Mechenbier Sr. Salesforce Administrator at The Urban Institute Seena is a confidence inspiring leader that gets the best out of those who work for her. She took a key position at Grameen Foundation during the most hectic part of the year and performed exceptionally by recognizing when to lead and when to seek... View Account Director Microsoft 2006  –  2009  (3 years) London, United Kingdom; Madrid, Spain; Greater New York City Area (Open) 4 recommendations, including: David Pedroche Founder at Control Ad, ConduzcoYo.com y Familycareapps.com Me complace poder recomendar a una persona como Seena, es capaz crear y mantener una espléndida relación laboral desde 0 ,... View Susanne Schmid Regional Agency Lead, EMEA at Facebook Seena is a fantastic sales and account manager. She has the ability to understand and translate any client needs into a... View 2 more recommendations Senior Account Manager PR Newswire 2002  –  2006  (4 years) Greater New York City Area (Open) 2 recommendations Rodrigo Gonzalez, MBA Experienced and Agile Business Development, Sales and Account Management Professional. Seena served not only as a model for work ethic and perseverence, but also as a great point of reference and someone whom I... View Mary Levine Director, Inside Sales at PR Newswire I hired Seena in 2002 and watched her excel in the many roles and challenges that she took on at PR Newswire over the next... View Marketing Communications Manager The Strategis Group 1999  –  2002  (3 years) Washington D.C. Metro Area; Singapore Economist, International Price Program (IPP) Bureau of Labor Statistics 1998  –  1999  (1 year) Washington D.C. Metro Area Channel Manager - East/Canada hybris software February 2015  – Present (6 months) Washington D.C. Metro Area hybris, an SAP Company, helps businesses around the globe sell more goods, services and digital content through every touchpoint, channel and device. hybris delivers \"OmniCommerce™\": state-of-the-art master data management and unified commerce processes that give a business a single view of its customers, products and orders, and its customers a single view of the business. hybris' omni-channel software is built on a single platform, based on open standards, that is agile to support limitless innovation, efficient to drive the best TCO, and scalable and extensible to be the last commerce platform companies will ever need. Both principal industry analyst firms rank hybris as a “leader” and list its commerce platform among the top two or three in the market. The same software is available on-premise, on-demand and managed hosted, giving merchants of all sizes maximum flexibility. Over 500 companies have chosen hybris, including global B2B sites W.W.Grainger, Rexel, General Electric, Thomson Reuters and 3M as well as consumer brands Toys“R”Us, Metro, Bridgestone, P&G, Levi's, Nikon, Galeries Lafayette, Migros, Nespresso and Lufthansa. hybris has operations in 15 countries around the globe. hybris is the future of commerce™.  \n \nI have the responsibility of managing a key set of named Agency/SI Partners in the East/Canada region to improve co-selling efforts, drive incremental leads to hybris, and help deliver implementation excellence. Channel Manager - East/Canada hybris software February 2015  – Present (6 months) Washington D.C. Metro Area hybris, an SAP Company, helps businesses around the globe sell more goods, services and digital content through every touchpoint, channel and device. hybris delivers \"OmniCommerce™\": state-of-the-art master data management and unified commerce processes that give a business a single view of its customers, products and orders, and its customers a single view of the business. hybris' omni-channel software is built on a single platform, based on open standards, that is agile to support limitless innovation, efficient to drive the best TCO, and scalable and extensible to be the last commerce platform companies will ever need. Both principal industry analyst firms rank hybris as a “leader” and list its commerce platform among the top two or three in the market. The same software is available on-premise, on-demand and managed hosted, giving merchants of all sizes maximum flexibility. Over 500 companies have chosen hybris, including global B2B sites W.W.Grainger, Rexel, General Electric, Thomson Reuters and 3M as well as consumer brands Toys“R”Us, Metro, Bridgestone, P&G, Levi's, Nikon, Galeries Lafayette, Migros, Nespresso and Lufthansa. hybris has operations in 15 countries around the globe. hybris is the future of commerce™.  \n \nI have the responsibility of managing a key set of named Agency/SI Partners in the East/Canada region to improve co-selling efforts, drive incremental leads to hybris, and help deliver implementation excellence. Marketing Consultant Offering Project-based marketing consulting May 2014  –  January 2015  (9 months) Washington D.C. Metro Area (Open) 1 recommendation Jorge Corral Business Development Manager at Conexio Group Seena provided Conexio Group with professional consultancy services regarding our internationalization efforts. I fully recommend her. View Marketing Consultant Offering Project-based marketing consulting May 2014  –  January 2015  (9 months) Washington D.C. Metro Area (Open) 1 recommendation Jorge Corral Business Development Manager at Conexio Group Seena provided Conexio Group with professional consultancy services regarding our internationalization efforts. I fully recommend her. View Director of Strategic Alliances Siteworx 2012  –  April 2014  (2 years) Washington D.C. Metro Area (Open) 3 recommendations, including: Pieter Casneuf CEO at ADAM Software Meeting Seena is meeting a professional with a smile. She has been driving the relationship between ADAM Software and... View Deepak Narisety VP Technology Services at Rauxa Seena’s hard work building relationships with partners always generated new opportunities. I’d work with her to best... View 1 more recommendation Director of Strategic Alliances Siteworx 2012  –  April 2014  (2 years) Washington D.C. Metro Area (Open) 3 recommendations, including: Pieter Casneuf CEO at ADAM Software Meeting Seena is meeting a professional with a smile. She has been driving the relationship between ADAM Software and... View Deepak Narisety VP Technology Services at Rauxa Seena’s hard work building relationships with partners always generated new opportunities. I’d work with her to best... View 1 more recommendation MBA Student INSEAD January 2011  –  December 2011  (1 year) Fontainebleau, France and Singapore MBA Student INSEAD January 2011  –  December 2011  (1 year) Fontainebleau, France and Singapore Business Analyst (MBA Internship) Avon July 2011  –  August 2011  (2 months) Paris Area, France Business Analyst (MBA Internship) Avon July 2011  –  August 2011  (2 months) Paris Area, France Director of Online & Annual Giving Grameen Foundation 2009  –  2010  (1 year) Washington D.C. Metro Area (Open) 1 recommendation Matt Mechenbier Sr. Salesforce Administrator at The Urban Institute Seena is a confidence inspiring leader that gets the best out of those who work for her. She took a key position at Grameen Foundation during the most hectic part of the year and performed exceptionally by recognizing when to lead and when to seek... View Director of Online & Annual Giving Grameen Foundation 2009  –  2010  (1 year) Washington D.C. Metro Area (Open) 1 recommendation Matt Mechenbier Sr. Salesforce Administrator at The Urban Institute Seena is a confidence inspiring leader that gets the best out of those who work for her. She took a key position at Grameen Foundation during the most hectic part of the year and performed exceptionally by recognizing when to lead and when to seek... View Account Director Microsoft 2006  –  2009  (3 years) London, United Kingdom; Madrid, Spain; Greater New York City Area (Open) 4 recommendations, including: David Pedroche Founder at Control Ad, ConduzcoYo.com y Familycareapps.com Me complace poder recomendar a una persona como Seena, es capaz crear y mantener una espléndida relación laboral desde 0 ,... View Susanne Schmid Regional Agency Lead, EMEA at Facebook Seena is a fantastic sales and account manager. She has the ability to understand and translate any client needs into a... View 2 more recommendations Account Director Microsoft 2006  –  2009  (3 years) London, United Kingdom; Madrid, Spain; Greater New York City Area (Open) 4 recommendations, including: David Pedroche Founder at Control Ad, ConduzcoYo.com y Familycareapps.com Me complace poder recomendar a una persona como Seena, es capaz crear y mantener una espléndida relación laboral desde 0 ,... View Susanne Schmid Regional Agency Lead, EMEA at Facebook Seena is a fantastic sales and account manager. She has the ability to understand and translate any client needs into a... View 2 more recommendations Senior Account Manager PR Newswire 2002  –  2006  (4 years) Greater New York City Area (Open) 2 recommendations Rodrigo Gonzalez, MBA Experienced and Agile Business Development, Sales and Account Management Professional. Seena served not only as a model for work ethic and perseverence, but also as a great point of reference and someone whom I... View Mary Levine Director, Inside Sales at PR Newswire I hired Seena in 2002 and watched her excel in the many roles and challenges that she took on at PR Newswire over the next... View Senior Account Manager PR Newswire 2002  –  2006  (4 years) Greater New York City Area (Open) 2 recommendations Rodrigo Gonzalez, MBA Experienced and Agile Business Development, Sales and Account Management Professional. Seena served not only as a model for work ethic and perseverence, but also as a great point of reference and someone whom I... View Mary Levine Director, Inside Sales at PR Newswire I hired Seena in 2002 and watched her excel in the many roles and challenges that she took on at PR Newswire over the next... View Marketing Communications Manager The Strategis Group 1999  –  2002  (3 years) Washington D.C. Metro Area; Singapore Marketing Communications Manager The Strategis Group 1999  –  2002  (3 years) Washington D.C. Metro Area; Singapore Economist, International Price Program (IPP) Bureau of Labor Statistics 1998  –  1999  (1 year) Washington D.C. Metro Area Economist, International Price Program (IPP) Bureau of Labor Statistics 1998  –  1999  (1 year) Washington D.C. Metro Area Languages Spanish French Marathi Spanish French Marathi Spanish French Marathi Skills Top Skills 54 Business Development 5 Strategic Partner... 3 Enterprise Software 30 Online Advertising 26 Marketing Communications 21 Strategic Planning 9 Global Business... 7 Contract Negotiation 0 Solution Selling 1 Project & Stakeholder... Seena also knows about... 13 Fundraising 1 Go-to-market Strategy 6 Blue Ocean Strategy 2 Sales Enablement 24 Social Media Marketing 0 Strategy 0 Strategic Partnerships Skills  Top Skills 54 Business Development 5 Strategic Partner... 3 Enterprise Software 30 Online Advertising 26 Marketing Communications 21 Strategic Planning 9 Global Business... 7 Contract Negotiation 0 Solution Selling 1 Project & Stakeholder... Seena also knows about... 13 Fundraising 1 Go-to-market Strategy 6 Blue Ocean Strategy 2 Sales Enablement 24 Social Media Marketing 0 Strategy 0 Strategic Partnerships Top Skills 54 Business Development 5 Strategic Partner... 3 Enterprise Software 30 Online Advertising 26 Marketing Communications 21 Strategic Planning 9 Global Business... 7 Contract Negotiation 0 Solution Selling 1 Project & Stakeholder... Seena also knows about... 13 Fundraising 1 Go-to-market Strategy 6 Blue Ocean Strategy 2 Sales Enablement 24 Social Media Marketing 0 Strategy 0 Strategic Partnerships Top Skills 54 Business Development 5 Strategic Partner... 3 Enterprise Software 30 Online Advertising 26 Marketing Communications 21 Strategic Planning 9 Global Business... 7 Contract Negotiation 0 Solution Selling 1 Project & Stakeholder... Seena also knows about... 13 Fundraising 1 Go-to-market Strategy 6 Blue Ocean Strategy 2 Sales Enablement 24 Social Media Marketing 0 Strategy 0 Strategic Partnerships                     13 Fundraising 1 Go-to-market Strategy 6 Blue Ocean Strategy 2 Sales Enablement 24 Social Media Marketing 0 Strategy 0 Strategic Partnerships Education INSEAD MBA 2011  – 2011 Boston College BA 1994  – 1998 INSEAD MBA 2011  – 2011 INSEAD MBA 2011  – 2011 INSEAD MBA 2011  – 2011 Boston College BA 1994  – 1998 Boston College BA 1994  – 1998 Boston College BA 1994  – 1998 ", "Experience Industry Manager -Automotive Google Australia November 2014  – Present (9 months) Sydney Industry Analyst Lead, Principal Industry Analyst Google May 2013  –  November 2014  (1 year 7 months) Sydney Area, Australia Industry Analyst - Automotive Google Australia March 2011  –  November 2014  (3 years 9 months) Senior Account Manager Google Australia September 2009  –  March 2011  (1 year 7 months) (Open) 1 recommendation Jenna Sandoval Global Business Marketing Manager at Instagram Marion is one of my favorite people to work with. She is smart, personable, and a true team player. She has played a crucial part with our global auto shopper study by going above and beyond giving feedback and making our deliverables stronger. She... View Account Manager Retail Google France February 2007  –  September 2009  (2 years 8 months) International coordinator, Account Executive assistant BETC EuroRSCG July 2006  –  December 2006  (6 months) working on Disneyland Paris and Canal Satellite budgets Industry Manager -Automotive Google Australia November 2014  – Present (9 months) Sydney Industry Manager -Automotive Google Australia November 2014  – Present (9 months) Sydney Industry Analyst Lead, Principal Industry Analyst Google May 2013  –  November 2014  (1 year 7 months) Sydney Area, Australia Industry Analyst Lead, Principal Industry Analyst Google May 2013  –  November 2014  (1 year 7 months) Sydney Area, Australia Industry Analyst - Automotive Google Australia March 2011  –  November 2014  (3 years 9 months) Industry Analyst - Automotive Google Australia March 2011  –  November 2014  (3 years 9 months) Senior Account Manager Google Australia September 2009  –  March 2011  (1 year 7 months) (Open) 1 recommendation Jenna Sandoval Global Business Marketing Manager at Instagram Marion is one of my favorite people to work with. She is smart, personable, and a true team player. She has played a crucial part with our global auto shopper study by going above and beyond giving feedback and making our deliverables stronger. She... View Senior Account Manager Google Australia September 2009  –  March 2011  (1 year 7 months) (Open) 1 recommendation Jenna Sandoval Global Business Marketing Manager at Instagram Marion is one of my favorite people to work with. She is smart, personable, and a true team player. She has played a crucial part with our global auto shopper study by going above and beyond giving feedback and making our deliverables stronger. She... View Account Manager Retail Google France February 2007  –  September 2009  (2 years 8 months) Account Manager Retail Google France February 2007  –  September 2009  (2 years 8 months) International coordinator, Account Executive assistant BETC EuroRSCG July 2006  –  December 2006  (6 months) working on Disneyland Paris and Canal Satellite budgets International coordinator, Account Executive assistant BETC EuroRSCG July 2006  –  December 2006  (6 months) working on Disneyland Paris and Canal Satellite budgets Languages English French Spanish English French Spanish English French Spanish Skills Top Skills 8 Digital Marketing 4 Online Advertising 0 Web Analytics 0 PPC 0 Digital Strategy Marion also knows about... 0 E-commerce 0 Search Advertising 0 SEO 0 Digital Media 0 Consultative Selling... 0 Strategic Thinking 0 Thought Leadership 0 Public Speaking 0 Business Planning 0 Retail 0 Automotive Skills  Top Skills 8 Digital Marketing 4 Online Advertising 0 Web Analytics 0 PPC 0 Digital Strategy Marion also knows about... 0 E-commerce 0 Search Advertising 0 SEO 0 Digital Media 0 Consultative Selling... 0 Strategic Thinking 0 Thought Leadership 0 Public Speaking 0 Business Planning 0 Retail 0 Automotive Top Skills 8 Digital Marketing 4 Online Advertising 0 Web Analytics 0 PPC 0 Digital Strategy Marion also knows about... 0 E-commerce 0 Search Advertising 0 SEO 0 Digital Media 0 Consultative Selling... 0 Strategic Thinking 0 Thought Leadership 0 Public Speaking 0 Business Planning 0 Retail 0 Automotive Top Skills 8 Digital Marketing 4 Online Advertising 0 Web Analytics 0 PPC 0 Digital Strategy Marion also knows about... 0 E-commerce 0 Search Advertising 0 SEO 0 Digital Media 0 Consultative Selling... 0 Strategic Thinking 0 Thought Leadership 0 Public Speaking 0 Business Planning 0 Retail 0 Automotive           0 E-commerce 0 Search Advertising 0 SEO 0 Digital Media 0 Consultative Selling... 0 Strategic Thinking 0 Thought Leadership 0 Public Speaking 0 Business Planning 0 Retail 0 Automotive Education INSEAD (SG) Google executive program,  Marketing 2011  – 2011 EMLYON Business School MSC in Management,  Marketing / Communication 2003  – 2007 Activities and Societies:  BDE\nConseil de Corporation University of Florida Business,  Exchange program ,  MBA classes of marketing & communication 2005  – 2005 INSEAD (SG) Google executive program,  Marketing 2011  – 2011 INSEAD (SG) Google executive program,  Marketing 2011  – 2011 INSEAD (SG) Google executive program,  Marketing 2011  – 2011 EMLYON Business School MSC in Management,  Marketing / Communication 2003  – 2007 Activities and Societies:  BDE\nConseil de Corporation EMLYON Business School MSC in Management,  Marketing / Communication 2003  – 2007 Activities and Societies:  BDE\nConseil de Corporation EMLYON Business School MSC in Management,  Marketing / Communication 2003  – 2007 Activities and Societies:  BDE\nConseil de Corporation University of Florida Business,  Exchange program ,  MBA classes of marketing & communication 2005  – 2005 University of Florida Business,  Exchange program ,  MBA classes of marketing & communication 2005  – 2005 University of Florida Business,  Exchange program ,  MBA classes of marketing & communication 2005  – 2005 ", "Summary Expertise in digital and direct marketing across multiple industries including financial services, travel, telecom, CPG and retail. \n \nSpecialties: Marketing strategy, account management, measurement and analytics, insights development, digital branding, digital strategy \n \nTools & Skills: GfK MRI, Nielsen, ComScore, Omniture, Google Analytics, Stradegy (Kantar Media), Hitwise, Compete Pro, Google Consumer Surveys, Microsoft Excel, Microsoft Powerpoint Summary Expertise in digital and direct marketing across multiple industries including financial services, travel, telecom, CPG and retail. \n \nSpecialties: Marketing strategy, account management, measurement and analytics, insights development, digital branding, digital strategy \n \nTools & Skills: GfK MRI, Nielsen, ComScore, Omniture, Google Analytics, Stradegy (Kantar Media), Hitwise, Compete Pro, Google Consumer Surveys, Microsoft Excel, Microsoft Powerpoint Expertise in digital and direct marketing across multiple industries including financial services, travel, telecom, CPG and retail. \n \nSpecialties: Marketing strategy, account management, measurement and analytics, insights development, digital branding, digital strategy \n \nTools & Skills: GfK MRI, Nielsen, ComScore, Omniture, Google Analytics, Stradegy (Kantar Media), Hitwise, Compete Pro, Google Consumer Surveys, Microsoft Excel, Microsoft Powerpoint Expertise in digital and direct marketing across multiple industries including financial services, travel, telecom, CPG and retail. \n \nSpecialties: Marketing strategy, account management, measurement and analytics, insights development, digital branding, digital strategy \n \nTools & Skills: GfK MRI, Nielsen, ComScore, Omniture, Google Analytics, Stradegy (Kantar Media), Hitwise, Compete Pro, Google Consumer Surveys, Microsoft Excel, Microsoft Powerpoint Experience Insights Lead, Google BrandLab Google December 2014  – Present (8 months) San Francisco Bay Area Use data to uncover and create compelling narratives and hypotheses that inspire, engage and educate global marketing executives, media, digital and traditional ad agency executives and industry thought leaders who attend BrandLab workshops, with an overarching goal to drive incremental business with YouTube and Google. \n \n• Guide insights preparation for every client workshop (2x a week), managing analysts on client account teams to pull data and generate insights that tie directly back to the client’s goal for the day \n• Conduct and lead analysis for client workshops, using internal Google and external analytical tools to gain deeper understanding of a client's target audience and their digital media behaviors \n• Digest data through a brand lens, identifying and curating the most important trends / insights to highlight in a client workshop \n• Facilitate Insights Discovery portion of workshop, guiding clients to key takeaways and action items that can be weaved throughout the day \n• Manage freelance designer to create visually appealing and informative infographics, to be used in the Insights Discovery portion of the BrandLab workshop \n• Act as liaison between Brand Insights/Research team, working closely to determine how larger-scale projects can come to life in the BrandLab experience Principal Industry Analyst / Sr. Account Planner, Large Customer Sales Google June 2013  –  November 2014  (1 year 6 months) San Francisco Bay Area Produce integrated, research-based proposals, presentations and industry narratives to support sales team in driving revenue growth using impactful market and consumer insights from internal Google and 3rd-party tools. Industry expertise in credit reporting, identity protection, tax, payments, and small business services. \n \n• Facilitate industry discussions during tax season by creating easy-to-digest collateral for clients and agencies providing weekly industry, market and search query trends and insights, resulting in +33% y/y growth in 2013  \n• Collaborate with senior sales leaders to develop strategic marketing plans, for both brand and direct response focused clients, transforming key market and competitive trends to customized solutions for advertisers  \n• Present industry, consumer and media trend insights to clients and their agencies, including Equifax’s CMO and Western Union’s agency leadership  \n• Design, execute and analyze results for market research studies using Google Consumer Surveys to provide insights around brand perception, product recognition, competitive landscape and consumer behavior  \n• Mentor and oversee projects for interns (MBA and undergraduate) and junior-level Sales Googlers Senior Industry Analyst / Account Planner, Large Customer Sales Google May 2011  –  May 2013  (2 years 1 month) Senior Strategist, Digital Analytics Goodby, Silverstein & Partners August 2010  –  April 2011  (9 months) Develop strategic recommendations around measurement planning, tracking implementation, reporting and optimization for online advertising campaigns and websites. Clients include Adobe and HP. \n \n• Lead digital analytics and reporting efforts to assess performance of online media campaigns, ranging from awareness to direct response, for Adobe Business products \n• Manage and guide Junior Analytics Strategists in creating weekly reports to aid media team and clients in tracking and optimizing live campaign performance \n• Identified marketing goals, created learning agenda and developed tagging solution for HP to report on site performance Senior Analyst, Strategy & Analysis Digitas September 2009  –  July 2010  (11 months) Drive business and direct marketing strategy while providing data-driven analysis and insights across multiple industries and channels. Clients include Comcast, Delta, IBM and T.G.I. Friday’s. Proficient in Doubleclick, Omniture, Excel and various social reporting tools. \n \n• Developed marketing strategy for destination content on Delta.com, identifying key target market segments, analyzing industry trends and auditing competitor sites \n• Defined customer segmentation and contact strategy for Comcast acquisition direct mail by examining product propensity models and customer lifecycles \n• Created standardized approaches to online, site and social measurement campaigns to benchmark and validate investments across various IBM business units \n• Optimized Comcast’s direct mail and DRTV initiatives by developing quarterly testing agendas and generating actionable recommendations based on results data \n• Standardized success metrics and reporting templates for tests conducted across all Comcast regional divisions Senior Associate, Marketing Digitas October 2007  –  September 2009  (2 years) Manage strategy and execution on both interactive and offline direct marketing projects while keeping budgets and schedules on track. Experience includes web builds, emails, online advertising, direct mail, print and radio. Clients include American Express, Comcast, and The Ad Council. \n \n• Developed and executed implementation strategies for national multi-offer, multi-channel Comcast acquisition campaigns on accelerated timelines \n• Served as primary day-to-day contact for director-level clients on the American Express OPEN for Small Business Interactive group and the American Express Labs group with projects totaling ~$2MM \n• Led creative development of American Express’ first online invoicing and payment solutions tool specifically targeting small business owners \n• Launched successful beta programs for American Express, including a 3D Card registration and activation process, mobile services, informational widgets, and acquisition sitelets \n• Coordinated between client, internal and international technology teams to successfully launch the Prospect and Cardmember versions of the American Express Small Business homepage \n• Managed the American Express email marketing template redesign to ensure inclusion of best-in-class learnings Associate, Marketing Digitas July 2006  –  October 2007  (1 year 4 months) Brand Promotions Intern Arnold Worldwide February 2006  –  May 2006  (4 months) • Audited the in-store and online customer experiences at RadioShack in comparison to market competitors and presented recommendations to client \n• Recommended use of emerging media technology to improve sales and create higher awareness for RadioShack Account Services Intern Zenith Optimedia, Ltd; Shanghai August 2005  –  August 2005  (1 month) • Developed promotional events, giveaways, and slogans to improve advertising strategies for Panasonic MTV World Intern MTV Networks June 2005  –  July 2005  (2 months) • Increased awareness for MTV Desi through use of guerilla marketing techniques such as blogging and promotional giveaways \n• Translated and organized materials to be used on MTV Chi Insights Lead, Google BrandLab Google December 2014  – Present (8 months) San Francisco Bay Area Use data to uncover and create compelling narratives and hypotheses that inspire, engage and educate global marketing executives, media, digital and traditional ad agency executives and industry thought leaders who attend BrandLab workshops, with an overarching goal to drive incremental business with YouTube and Google. \n \n• Guide insights preparation for every client workshop (2x a week), managing analysts on client account teams to pull data and generate insights that tie directly back to the client’s goal for the day \n• Conduct and lead analysis for client workshops, using internal Google and external analytical tools to gain deeper understanding of a client's target audience and their digital media behaviors \n• Digest data through a brand lens, identifying and curating the most important trends / insights to highlight in a client workshop \n• Facilitate Insights Discovery portion of workshop, guiding clients to key takeaways and action items that can be weaved throughout the day \n• Manage freelance designer to create visually appealing and informative infographics, to be used in the Insights Discovery portion of the BrandLab workshop \n• Act as liaison between Brand Insights/Research team, working closely to determine how larger-scale projects can come to life in the BrandLab experience Insights Lead, Google BrandLab Google December 2014  – Present (8 months) San Francisco Bay Area Use data to uncover and create compelling narratives and hypotheses that inspire, engage and educate global marketing executives, media, digital and traditional ad agency executives and industry thought leaders who attend BrandLab workshops, with an overarching goal to drive incremental business with YouTube and Google. \n \n• Guide insights preparation for every client workshop (2x a week), managing analysts on client account teams to pull data and generate insights that tie directly back to the client’s goal for the day \n• Conduct and lead analysis for client workshops, using internal Google and external analytical tools to gain deeper understanding of a client's target audience and their digital media behaviors \n• Digest data through a brand lens, identifying and curating the most important trends / insights to highlight in a client workshop \n• Facilitate Insights Discovery portion of workshop, guiding clients to key takeaways and action items that can be weaved throughout the day \n• Manage freelance designer to create visually appealing and informative infographics, to be used in the Insights Discovery portion of the BrandLab workshop \n• Act as liaison between Brand Insights/Research team, working closely to determine how larger-scale projects can come to life in the BrandLab experience Principal Industry Analyst / Sr. Account Planner, Large Customer Sales Google June 2013  –  November 2014  (1 year 6 months) San Francisco Bay Area Produce integrated, research-based proposals, presentations and industry narratives to support sales team in driving revenue growth using impactful market and consumer insights from internal Google and 3rd-party tools. Industry expertise in credit reporting, identity protection, tax, payments, and small business services. \n \n• Facilitate industry discussions during tax season by creating easy-to-digest collateral for clients and agencies providing weekly industry, market and search query trends and insights, resulting in +33% y/y growth in 2013  \n• Collaborate with senior sales leaders to develop strategic marketing plans, for both brand and direct response focused clients, transforming key market and competitive trends to customized solutions for advertisers  \n• Present industry, consumer and media trend insights to clients and their agencies, including Equifax’s CMO and Western Union’s agency leadership  \n• Design, execute and analyze results for market research studies using Google Consumer Surveys to provide insights around brand perception, product recognition, competitive landscape and consumer behavior  \n• Mentor and oversee projects for interns (MBA and undergraduate) and junior-level Sales Googlers Principal Industry Analyst / Sr. Account Planner, Large Customer Sales Google June 2013  –  November 2014  (1 year 6 months) San Francisco Bay Area Produce integrated, research-based proposals, presentations and industry narratives to support sales team in driving revenue growth using impactful market and consumer insights from internal Google and 3rd-party tools. Industry expertise in credit reporting, identity protection, tax, payments, and small business services. \n \n• Facilitate industry discussions during tax season by creating easy-to-digest collateral for clients and agencies providing weekly industry, market and search query trends and insights, resulting in +33% y/y growth in 2013  \n• Collaborate with senior sales leaders to develop strategic marketing plans, for both brand and direct response focused clients, transforming key market and competitive trends to customized solutions for advertisers  \n• Present industry, consumer and media trend insights to clients and their agencies, including Equifax’s CMO and Western Union’s agency leadership  \n• Design, execute and analyze results for market research studies using Google Consumer Surveys to provide insights around brand perception, product recognition, competitive landscape and consumer behavior  \n• Mentor and oversee projects for interns (MBA and undergraduate) and junior-level Sales Googlers Senior Industry Analyst / Account Planner, Large Customer Sales Google May 2011  –  May 2013  (2 years 1 month) Senior Industry Analyst / Account Planner, Large Customer Sales Google May 2011  –  May 2013  (2 years 1 month) Senior Strategist, Digital Analytics Goodby, Silverstein & Partners August 2010  –  April 2011  (9 months) Develop strategic recommendations around measurement planning, tracking implementation, reporting and optimization for online advertising campaigns and websites. Clients include Adobe and HP. \n \n• Lead digital analytics and reporting efforts to assess performance of online media campaigns, ranging from awareness to direct response, for Adobe Business products \n• Manage and guide Junior Analytics Strategists in creating weekly reports to aid media team and clients in tracking and optimizing live campaign performance \n• Identified marketing goals, created learning agenda and developed tagging solution for HP to report on site performance Senior Strategist, Digital Analytics Goodby, Silverstein & Partners August 2010  –  April 2011  (9 months) Develop strategic recommendations around measurement planning, tracking implementation, reporting and optimization for online advertising campaigns and websites. Clients include Adobe and HP. \n \n• Lead digital analytics and reporting efforts to assess performance of online media campaigns, ranging from awareness to direct response, for Adobe Business products \n• Manage and guide Junior Analytics Strategists in creating weekly reports to aid media team and clients in tracking and optimizing live campaign performance \n• Identified marketing goals, created learning agenda and developed tagging solution for HP to report on site performance Senior Analyst, Strategy & Analysis Digitas September 2009  –  July 2010  (11 months) Drive business and direct marketing strategy while providing data-driven analysis and insights across multiple industries and channels. Clients include Comcast, Delta, IBM and T.G.I. Friday’s. Proficient in Doubleclick, Omniture, Excel and various social reporting tools. \n \n• Developed marketing strategy for destination content on Delta.com, identifying key target market segments, analyzing industry trends and auditing competitor sites \n• Defined customer segmentation and contact strategy for Comcast acquisition direct mail by examining product propensity models and customer lifecycles \n• Created standardized approaches to online, site and social measurement campaigns to benchmark and validate investments across various IBM business units \n• Optimized Comcast’s direct mail and DRTV initiatives by developing quarterly testing agendas and generating actionable recommendations based on results data \n• Standardized success metrics and reporting templates for tests conducted across all Comcast regional divisions Senior Analyst, Strategy & Analysis Digitas September 2009  –  July 2010  (11 months) Drive business and direct marketing strategy while providing data-driven analysis and insights across multiple industries and channels. Clients include Comcast, Delta, IBM and T.G.I. Friday’s. Proficient in Doubleclick, Omniture, Excel and various social reporting tools. \n \n• Developed marketing strategy for destination content on Delta.com, identifying key target market segments, analyzing industry trends and auditing competitor sites \n• Defined customer segmentation and contact strategy for Comcast acquisition direct mail by examining product propensity models and customer lifecycles \n• Created standardized approaches to online, site and social measurement campaigns to benchmark and validate investments across various IBM business units \n• Optimized Comcast’s direct mail and DRTV initiatives by developing quarterly testing agendas and generating actionable recommendations based on results data \n• Standardized success metrics and reporting templates for tests conducted across all Comcast regional divisions Senior Associate, Marketing Digitas October 2007  –  September 2009  (2 years) Manage strategy and execution on both interactive and offline direct marketing projects while keeping budgets and schedules on track. Experience includes web builds, emails, online advertising, direct mail, print and radio. Clients include American Express, Comcast, and The Ad Council. \n \n• Developed and executed implementation strategies for national multi-offer, multi-channel Comcast acquisition campaigns on accelerated timelines \n• Served as primary day-to-day contact for director-level clients on the American Express OPEN for Small Business Interactive group and the American Express Labs group with projects totaling ~$2MM \n• Led creative development of American Express’ first online invoicing and payment solutions tool specifically targeting small business owners \n• Launched successful beta programs for American Express, including a 3D Card registration and activation process, mobile services, informational widgets, and acquisition sitelets \n• Coordinated between client, internal and international technology teams to successfully launch the Prospect and Cardmember versions of the American Express Small Business homepage \n• Managed the American Express email marketing template redesign to ensure inclusion of best-in-class learnings Senior Associate, Marketing Digitas October 2007  –  September 2009  (2 years) Manage strategy and execution on both interactive and offline direct marketing projects while keeping budgets and schedules on track. Experience includes web builds, emails, online advertising, direct mail, print and radio. Clients include American Express, Comcast, and The Ad Council. \n \n• Developed and executed implementation strategies for national multi-offer, multi-channel Comcast acquisition campaigns on accelerated timelines \n• Served as primary day-to-day contact for director-level clients on the American Express OPEN for Small Business Interactive group and the American Express Labs group with projects totaling ~$2MM \n• Led creative development of American Express’ first online invoicing and payment solutions tool specifically targeting small business owners \n• Launched successful beta programs for American Express, including a 3D Card registration and activation process, mobile services, informational widgets, and acquisition sitelets \n• Coordinated between client, internal and international technology teams to successfully launch the Prospect and Cardmember versions of the American Express Small Business homepage \n• Managed the American Express email marketing template redesign to ensure inclusion of best-in-class learnings Associate, Marketing Digitas July 2006  –  October 2007  (1 year 4 months) Associate, Marketing Digitas July 2006  –  October 2007  (1 year 4 months) Brand Promotions Intern Arnold Worldwide February 2006  –  May 2006  (4 months) • Audited the in-store and online customer experiences at RadioShack in comparison to market competitors and presented recommendations to client \n• Recommended use of emerging media technology to improve sales and create higher awareness for RadioShack Brand Promotions Intern Arnold Worldwide February 2006  –  May 2006  (4 months) • Audited the in-store and online customer experiences at RadioShack in comparison to market competitors and presented recommendations to client \n• Recommended use of emerging media technology to improve sales and create higher awareness for RadioShack Account Services Intern Zenith Optimedia, Ltd; Shanghai August 2005  –  August 2005  (1 month) • Developed promotional events, giveaways, and slogans to improve advertising strategies for Panasonic Account Services Intern Zenith Optimedia, Ltd; Shanghai August 2005  –  August 2005  (1 month) • Developed promotional events, giveaways, and slogans to improve advertising strategies for Panasonic MTV World Intern MTV Networks June 2005  –  July 2005  (2 months) • Increased awareness for MTV Desi through use of guerilla marketing techniques such as blogging and promotional giveaways \n• Translated and organized materials to be used on MTV Chi MTV World Intern MTV Networks June 2005  –  July 2005  (2 months) • Increased awareness for MTV Desi through use of guerilla marketing techniques such as blogging and promotional giveaways \n• Translated and organized materials to be used on MTV Chi Languages English Mandarin Chinese French (Conversational) English Mandarin Chinese French (Conversational) English Mandarin Chinese French (Conversational) Skills Top Skills 6 Marketing Strategy 5 Digital Strategy 4 Digital Media 3 Digital Marketing 3 Integrated Marketing 3 Market Research 2 Online Advertising 2 Analytics 2 Web Analytics 2 Google Analytics Linda also knows about... 1 Leadership Skills  Top Skills 6 Marketing Strategy 5 Digital Strategy 4 Digital Media 3 Digital Marketing 3 Integrated Marketing 3 Market Research 2 Online Advertising 2 Analytics 2 Web Analytics 2 Google Analytics Linda also knows about... 1 Leadership Top Skills 6 Marketing Strategy 5 Digital Strategy 4 Digital Media 3 Digital Marketing 3 Integrated Marketing 3 Market Research 2 Online Advertising 2 Analytics 2 Web Analytics 2 Google Analytics Linda also knows about... 1 Leadership Top Skills 6 Marketing Strategy 5 Digital Strategy 4 Digital Media 3 Digital Marketing 3 Integrated Marketing 3 Market Research 2 Online Advertising 2 Analytics 2 Web Analytics 2 Google Analytics Linda also knows about... 1 Leadership                     1 Leadership Education Massachusetts Institute of Technology B.S.,  Comparative Media Studies; Biology 2002  – 2006 Massachusetts Institute of Technology B.S.,  Comparative Media Studies; Biology 2002  – 2006 Massachusetts Institute of Technology B.S.,  Comparative Media Studies; Biology 2002  – 2006 Massachusetts Institute of Technology B.S.,  Comparative Media Studies; Biology 2002  – 2006 ", "Experience Principal Industry Analyst, Retail Google June 2013  – Present (2 years 2 months) New York, New York Strategic Planning Intern, Agency Development Google May 2012  –  August 2012  (4 months) New York, New York Strategy Intern BBMG May 2011  –  August 2011  (4 months) Greater New York City Area BBMG is a sustainability branding and marketing agency. As a summer intern, I refined BBMG's innovation offering - I formalized the internal innovation process and created ideation methodologies specific to sustainability business challenges. My clients included beverage alcohol companies who were seeking sustainable packaging and new product development. Innovation Specialist Prophet December 2008  –  July 2010  (1 year 8 months) Greater New York City Area Prophet is a strategic brand and marketing consultancy. I managed cross-functional teams to lead innovation, brand and marketing projects. I conducted ethnographic research, designed ideation workshops, developed brand value propositions, reorganized marketing organizations, led brand strategy trainings, and oversaw visual identity development. Clients were from the consumer packaged goods, financial services, and healthcare industries. Innovation Consultant Play January 2005  –  December 2008  (4 years) Richmond, Virginia Area Play was a boutique innovation consulting firm that was acquired by Prophet. I led ideation workshops and orchestrated change management processes for clients who wanted a collaborative methodology to achieve their diverse innovation objectives. I often taught creativity training workshops. Clients were from the consumer packaged goods, apparel, media, and advertising industries. Principal Industry Analyst, Retail Google June 2013  – Present (2 years 2 months) New York, New York Principal Industry Analyst, Retail Google June 2013  – Present (2 years 2 months) New York, New York Strategic Planning Intern, Agency Development Google May 2012  –  August 2012  (4 months) New York, New York Strategic Planning Intern, Agency Development Google May 2012  –  August 2012  (4 months) New York, New York Strategy Intern BBMG May 2011  –  August 2011  (4 months) Greater New York City Area BBMG is a sustainability branding and marketing agency. As a summer intern, I refined BBMG's innovation offering - I formalized the internal innovation process and created ideation methodologies specific to sustainability business challenges. My clients included beverage alcohol companies who were seeking sustainable packaging and new product development. Strategy Intern BBMG May 2011  –  August 2011  (4 months) Greater New York City Area BBMG is a sustainability branding and marketing agency. As a summer intern, I refined BBMG's innovation offering - I formalized the internal innovation process and created ideation methodologies specific to sustainability business challenges. My clients included beverage alcohol companies who were seeking sustainable packaging and new product development. Innovation Specialist Prophet December 2008  –  July 2010  (1 year 8 months) Greater New York City Area Prophet is a strategic brand and marketing consultancy. I managed cross-functional teams to lead innovation, brand and marketing projects. I conducted ethnographic research, designed ideation workshops, developed brand value propositions, reorganized marketing organizations, led brand strategy trainings, and oversaw visual identity development. Clients were from the consumer packaged goods, financial services, and healthcare industries. Innovation Specialist Prophet December 2008  –  July 2010  (1 year 8 months) Greater New York City Area Prophet is a strategic brand and marketing consultancy. I managed cross-functional teams to lead innovation, brand and marketing projects. I conducted ethnographic research, designed ideation workshops, developed brand value propositions, reorganized marketing organizations, led brand strategy trainings, and oversaw visual identity development. Clients were from the consumer packaged goods, financial services, and healthcare industries. Innovation Consultant Play January 2005  –  December 2008  (4 years) Richmond, Virginia Area Play was a boutique innovation consulting firm that was acquired by Prophet. I led ideation workshops and orchestrated change management processes for clients who wanted a collaborative methodology to achieve their diverse innovation objectives. I often taught creativity training workshops. Clients were from the consumer packaged goods, apparel, media, and advertising industries. Innovation Consultant Play January 2005  –  December 2008  (4 years) Richmond, Virginia Area Play was a boutique innovation consulting firm that was acquired by Prophet. I led ideation workshops and orchestrated change management processes for clients who wanted a collaborative methodology to achieve their diverse innovation objectives. I often taught creativity training workshops. Clients were from the consumer packaged goods, apparel, media, and advertising industries. Skills 35 Strategy 19 Marketing Strategy 16 Business Strategy 12 Brand Architecture 12 Product Development 10 Innovation Consulting 10 Marketing 5 Cross-functional Team... Skills  35 Strategy 19 Marketing Strategy 16 Business Strategy 12 Brand Architecture 12 Product Development 10 Innovation Consulting 10 Marketing 5 Cross-functional Team... 35 Strategy 19 Marketing Strategy 16 Business Strategy 12 Brand Architecture 12 Product Development 10 Innovation Consulting 10 Marketing 5 Cross-functional Team... 35 Strategy 19 Marketing Strategy 16 Business Strategy 12 Brand Architecture 12 Product Development 10 Innovation Consulting 10 Marketing 5 Cross-functional Team...                 Education Yale School of Management Master of Business Administration (MBA),  Marketing & Corporate Strategy 2011  – 2013 Activities and Societies:  Executed quantitative market research to inform design and positioning of new product for multinational cosmetics company; conducting qualitative consumer research on mobile payments; provided pro bono brand and marketing services to Yale start-ups Yale School of Forestry & Environmental Studies Master of Environmental Management,  Sustainability & Green Design 2010  – 2013 Activities and Societies:  Completed product design project to reduce at-home food spoilage for Green Engineering & Sustainable Design course; identified five conclusive innovation best practices based on literature review for Yale Center for Business and the Environment ,  CBEY University of Richmond Bachelor of Arts (BA),  Leadership Studies , 3.92 2000  – 2004 School for International Training, Study Abroad, Chile, Fall 2002 Activities and Societies:  Captain of NCAA Division I tennis team Yale School of Management Master of Business Administration (MBA),  Marketing & Corporate Strategy 2011  – 2013 Activities and Societies:  Executed quantitative market research to inform design and positioning of new product for multinational cosmetics company; conducting qualitative consumer research on mobile payments; provided pro bono brand and marketing services to Yale start-ups Yale School of Management Master of Business Administration (MBA),  Marketing & Corporate Strategy 2011  – 2013 Activities and Societies:  Executed quantitative market research to inform design and positioning of new product for multinational cosmetics company; conducting qualitative consumer research on mobile payments; provided pro bono brand and marketing services to Yale start-ups Yale School of Management Master of Business Administration (MBA),  Marketing & Corporate Strategy 2011  – 2013 Activities and Societies:  Executed quantitative market research to inform design and positioning of new product for multinational cosmetics company; conducting qualitative consumer research on mobile payments; provided pro bono brand and marketing services to Yale start-ups Yale School of Forestry & Environmental Studies Master of Environmental Management,  Sustainability & Green Design 2010  – 2013 Activities and Societies:  Completed product design project to reduce at-home food spoilage for Green Engineering & Sustainable Design course; identified five conclusive innovation best practices based on literature review for Yale Center for Business and the Environment ,  CBEY Yale School of Forestry & Environmental Studies Master of Environmental Management,  Sustainability & Green Design 2010  – 2013 Activities and Societies:  Completed product design project to reduce at-home food spoilage for Green Engineering & Sustainable Design course; identified five conclusive innovation best practices based on literature review for Yale Center for Business and the Environment ,  CBEY Yale School of Forestry & Environmental Studies Master of Environmental Management,  Sustainability & Green Design 2010  – 2013 Activities and Societies:  Completed product design project to reduce at-home food spoilage for Green Engineering & Sustainable Design course; identified five conclusive innovation best practices based on literature review for Yale Center for Business and the Environment ,  CBEY University of Richmond Bachelor of Arts (BA),  Leadership Studies , 3.92 2000  – 2004 School for International Training, Study Abroad, Chile, Fall 2002 Activities and Societies:  Captain of NCAA Division I tennis team University of Richmond Bachelor of Arts (BA),  Leadership Studies , 3.92 2000  – 2004 School for International Training, Study Abroad, Chile, Fall 2002 Activities and Societies:  Captain of NCAA Division I tennis team University of Richmond Bachelor of Arts (BA),  Leadership Studies , 3.92 2000  – 2004 School for International Training, Study Abroad, Chile, Fall 2002 Activities and Societies:  Captain of NCAA Division I tennis team ", "Experience Principal Industry Analyst Google November 2012  – Present (2 years 9 months) Gurgaon, India Manager Analysys Mason April 2010  –  November 2012  (2 years 8 months) Consultant BDA March 2007  –  March 2010  (3 years 1 month) New Delhi Area, India Senior Systems Engineer Kyocera Communications Inc. May 2005  –  March 2007  (1 year 11 months) (Open) 2 recommendations Terry Lingren CEO/Co-Founder at Resonant Inc. Deepshikha is an excellent Systems Engineer, with great knowledge about mobile communications systems. She is conscientious... View Tim Thome Principal Product Development Engineer at AT&T Deepshikha and I worked in different groups, but with a high degree of commonality, she with dot20, and I worked on 802.16. ... View Research Engineer Tohoku University, Japan April 2002  –  March 2005  (3 years) (Open) 1 recommendation Haris Gacanin Research Director bij Alcatel-Lucent Dr. Garg has made a very significant contribution to the field of wireless communications and contributed extensively to reveal important properties of the several transmission systems, which are under extensive research as a candidates for future... View Intern- Research Engineer NTT DoCoMo, Japan August 2004  –  September 2004  (2 months) Lecturer Kathmandu University August 1998  –  March 1999  (8 months) Nepal Principal Industry Analyst Google November 2012  – Present (2 years 9 months) Gurgaon, India Principal Industry Analyst Google November 2012  – Present (2 years 9 months) Gurgaon, India Manager Analysys Mason April 2010  –  November 2012  (2 years 8 months) Manager Analysys Mason April 2010  –  November 2012  (2 years 8 months) Consultant BDA March 2007  –  March 2010  (3 years 1 month) New Delhi Area, India Consultant BDA March 2007  –  March 2010  (3 years 1 month) New Delhi Area, India Senior Systems Engineer Kyocera Communications Inc. May 2005  –  March 2007  (1 year 11 months) (Open) 2 recommendations Terry Lingren CEO/Co-Founder at Resonant Inc. Deepshikha is an excellent Systems Engineer, with great knowledge about mobile communications systems. She is conscientious... View Tim Thome Principal Product Development Engineer at AT&T Deepshikha and I worked in different groups, but with a high degree of commonality, she with dot20, and I worked on 802.16. ... View Senior Systems Engineer Kyocera Communications Inc. May 2005  –  March 2007  (1 year 11 months) (Open) 2 recommendations Terry Lingren CEO/Co-Founder at Resonant Inc. Deepshikha is an excellent Systems Engineer, with great knowledge about mobile communications systems. She is conscientious... View Tim Thome Principal Product Development Engineer at AT&T Deepshikha and I worked in different groups, but with a high degree of commonality, she with dot20, and I worked on 802.16. ... View Research Engineer Tohoku University, Japan April 2002  –  March 2005  (3 years) (Open) 1 recommendation Haris Gacanin Research Director bij Alcatel-Lucent Dr. Garg has made a very significant contribution to the field of wireless communications and contributed extensively to reveal important properties of the several transmission systems, which are under extensive research as a candidates for future... View Research Engineer Tohoku University, Japan April 2002  –  March 2005  (3 years) (Open) 1 recommendation Haris Gacanin Research Director bij Alcatel-Lucent Dr. Garg has made a very significant contribution to the field of wireless communications and contributed extensively to reveal important properties of the several transmission systems, which are under extensive research as a candidates for future... View Intern- Research Engineer NTT DoCoMo, Japan August 2004  –  September 2004  (2 months) Intern- Research Engineer NTT DoCoMo, Japan August 2004  –  September 2004  (2 months) Lecturer Kathmandu University August 1998  –  March 1999  (8 months) Nepal Lecturer Kathmandu University August 1998  –  March 1999  (8 months) Nepal Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Neplai Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Neplai Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Neplai Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Top Skills 28 Telecommunications 19 Wireless 14 VAS 14 Mobile Communications 11 Mobile Devices 10 Management Consulting 9 Competitive Intelligence 8 E-commerce 7 Strategy 6 Market Analysis Deepshikha also knows about... 6 Competitive Analysis 5 LTE 5 Due Diligence 5 Business Strategy 4 Investment Advisory 4 Business Planning 4 Broadband 3 mobile VAS 3 3G 3 Cellular Communications 3 Mobile Technology 3 Product Management 3 Analytics 3 CRM 2 Start-ups 2 Business Development 2 Cloud Computing 2 Mobile Internet 2 Go-to-market Strategy 2 Consulting 2 Integration 1 Strategic Consulting 1 Business Modeling 1 Venture Capital 1 GSM 1 Pre-sales 1 Strategic Partnerships 1 Business Case 1 Market Entry 1 Mobile Applications 1 Product Marketing 1 IP 1 Mobile Payments 1 Financial Modeling 1 Entrepreneurship 1 WiFi 1 Vendor Management 1 Segmentation 1 Business Transformation 1 Market Intelligence See 25+     See less Skills  Top Skills 28 Telecommunications 19 Wireless 14 VAS 14 Mobile Communications 11 Mobile Devices 10 Management Consulting 9 Competitive Intelligence 8 E-commerce 7 Strategy 6 Market Analysis Deepshikha also knows about... 6 Competitive Analysis 5 LTE 5 Due Diligence 5 Business Strategy 4 Investment Advisory 4 Business Planning 4 Broadband 3 mobile VAS 3 3G 3 Cellular Communications 3 Mobile Technology 3 Product Management 3 Analytics 3 CRM 2 Start-ups 2 Business Development 2 Cloud Computing 2 Mobile Internet 2 Go-to-market Strategy 2 Consulting 2 Integration 1 Strategic Consulting 1 Business Modeling 1 Venture Capital 1 GSM 1 Pre-sales 1 Strategic Partnerships 1 Business Case 1 Market Entry 1 Mobile Applications 1 Product Marketing 1 IP 1 Mobile Payments 1 Financial Modeling 1 Entrepreneurship 1 WiFi 1 Vendor Management 1 Segmentation 1 Business Transformation 1 Market Intelligence See 25+     See less Top Skills 28 Telecommunications 19 Wireless 14 VAS 14 Mobile Communications 11 Mobile Devices 10 Management Consulting 9 Competitive Intelligence 8 E-commerce 7 Strategy 6 Market Analysis Deepshikha also knows about... 6 Competitive Analysis 5 LTE 5 Due Diligence 5 Business Strategy 4 Investment Advisory 4 Business Planning 4 Broadband 3 mobile VAS 3 3G 3 Cellular Communications 3 Mobile Technology 3 Product Management 3 Analytics 3 CRM 2 Start-ups 2 Business Development 2 Cloud Computing 2 Mobile Internet 2 Go-to-market Strategy 2 Consulting 2 Integration 1 Strategic Consulting 1 Business Modeling 1 Venture Capital 1 GSM 1 Pre-sales 1 Strategic Partnerships 1 Business Case 1 Market Entry 1 Mobile Applications 1 Product Marketing 1 IP 1 Mobile Payments 1 Financial Modeling 1 Entrepreneurship 1 WiFi 1 Vendor Management 1 Segmentation 1 Business Transformation 1 Market Intelligence See 25+     See less Top Skills 28 Telecommunications 19 Wireless 14 VAS 14 Mobile Communications 11 Mobile Devices 10 Management Consulting 9 Competitive Intelligence 8 E-commerce 7 Strategy 6 Market Analysis Deepshikha also knows about... 6 Competitive Analysis 5 LTE 5 Due Diligence 5 Business Strategy 4 Investment Advisory 4 Business Planning 4 Broadband 3 mobile VAS 3 3G 3 Cellular Communications 3 Mobile Technology 3 Product Management 3 Analytics 3 CRM 2 Start-ups 2 Business Development 2 Cloud Computing 2 Mobile Internet 2 Go-to-market Strategy 2 Consulting 2 Integration 1 Strategic Consulting 1 Business Modeling 1 Venture Capital 1 GSM 1 Pre-sales 1 Strategic Partnerships 1 Business Case 1 Market Entry 1 Mobile Applications 1 Product Marketing 1 IP 1 Mobile Payments 1 Financial Modeling 1 Entrepreneurship 1 WiFi 1 Vendor Management 1 Segmentation 1 Business Transformation 1 Market Intelligence See 25+     See less                     6 Competitive Analysis 5 LTE 5 Due Diligence 5 Business Strategy 4 Investment Advisory 4 Business Planning 4 Broadband 3 mobile VAS 3 3G 3 Cellular Communications 3 Mobile Technology 3 Product Management 3 Analytics 3 CRM 2 Start-ups 2 Business Development 2 Cloud Computing 2 Mobile Internet 2 Go-to-market Strategy 2 Consulting 2 Integration 1 Strategic Consulting 1 Business Modeling 1 Venture Capital 1 GSM 1 Pre-sales 1 Strategic Partnerships 1 Business Case 1 Market Entry 1 Mobile Applications 1 Product Marketing 1 IP 1 Mobile Payments 1 Financial Modeling 1 Entrepreneurship 1 WiFi 1 Vendor Management 1 Segmentation 1 Business Transformation 1 Market Intelligence Education Tohoku University PhD Tohoku University ME Kathmandu University BE St. Xavier's Campus Tohoku University PhD Tohoku University PhD Tohoku University PhD Tohoku University ME Tohoku University ME Tohoku University ME Kathmandu University BE Kathmandu University BE Kathmandu University BE St. Xavier's Campus St. Xavier's Campus St. Xavier's Campus ", "Experience Principal Industry Analyst, Retail - Middle East & North Africa Google July 2015  – Present (1 month) Dubai Chief Strategy Officer MarkaVIP June 2013  –  April 2015  (1 year 11 months) Dubai Director of Strategy MarkaVIP February 2012  –  May 2013  (1 year 4 months) Jordan •\tAssisting the CEO in driving critical projects to completion, working across the entire organization \n•\tUnderstanding the business and key issues at a detailed level; proactively researching issues; anticipating opportunities and providing answers / insights to key questions; developing hypotheses and proving / disproving with supporting analysis \n•\tPlaying a key role in annual and long-term business planning, including financial planning and analysis  \n•\tEvaluating and (in some cases) spearheading new products / business development opportunities, partnering with finance, marketing, and other operating areas \n•\tDeveloping strategy/business case, selling into organization, raising/resolving issues, and taking on wide variety of roles, depending on project Consultant Booz & Company October 2010  –  February 2012  (1 year 5 months) A- Corporate Finance /Partial Balance Sheet by Product - Major Petrochemical Company (GCC) \n- Presented Partial Balance Sheet by Product as a key tool for steering business and suggested key KPIs to aid decision making \n- Developed global template to gather data from different regional systems, with a focus on Working Capital and Fixed Assets data \n- Designed MS Access database system to consolidate data across regions \n- Analyzed results, Identified underlying data quality issues  \n- Suggested and implemented solution for DQ issues \n \nB- Corporate Finance / Global Cost Reports - Major Petrochemical Company (GCC) \n- Gathered business requirements from Finance Team \n- Developed global template to gather data from different regional systems \n- Designed MS Access database system to consolidate data \n- Validated functionalities with Manager of Global Management Reporting department \n- Implemented automatic reporting functionalities that help the team generate more than 150 reports/month \n- Implemented data integrity rules and queries \n- Developed documentation for the usage and maintenance of the tool \n- Conducted workshops and trainings along a 3 months period to transfer knowledge to client employees \n \nC- Corporate Finance / Cost Allocation Cycles- Major Petrochemical Company (GCC) \n- Performed baseline of all active cost allocation cycles (200+) of 18 different legal entities over a 3 months period \n- Engaged with 8 affiliates’ Finance Managers to present findings and gather feedback \n- Contributed to the design of the new Core Model of the cost allocation cycles \n- Assisted the affiliates in the implementation of the proposed recommendations \n \n \nD- IT Strategy - National EMS Provider (GCC) \n- Conducted an assessment of Infrastructure, Applications, Human resources, Processes, and Governance that lead to the identification of key initiatives \n- Developed a target model comprising a master plan and initial budget for the EMS application portfolio, the EMS network, and the EMS call center (Open) 2 recommendations Abdulkader Lamaa Principal at Strategy& (Formerly Booz & Company) I have worked with Eddy over the past few years on multiple strategic assignments. He is full of energy, sharp and diligent... View Jack Woodhouse Director at I-Kimata, Borel & Woodhouse Eddy is a very diligent consultant, with an excellent grasp of all the basic analytical and communicative tools. Furthermore... View Business Analyst Booz & Company October 2009  –  September 2010  (1 year) A- e-Gov/ICT National Roundtable - Government (GCC) \n- Participated in the preparation efforts for a high-profile key conference with the participation of the national leadership of a GCC country and international participants  \n- Contributed to formulation of national e-Maturity declaration \n- Performed comprehensive analysis of the government portals and e-Services \n- Wrote two international award documents and external communications documents, such as press releases \n \nB- e-Gov/ICT Procurement - Government (GCC) \n- Conducted IT procurement benchmarking of more than 40 -vendors for accessibility procurement \n- Short-listed the most relevant vendors for the country’s - Government Accessibility Enablement project \n \nC- Corporate Training Strategy - Global Management Consulting Firm (Middle East)  \n- Performed baseline of corporate training program by assessing training course portfolio, delivery methods, resource management, feedback and reporting (Open) 1 recommendation Niels Beisinghoff Entrepreneur in the field of Mobility and Ecology Eddy is one of the most committed and most capable persons I have worked with. He is very analytical and a highly gifted presenter. He has received extraordinary accolades on all projects he has worked on, also from senior management. He is very... View Part-timer / Intern Orolix February 2009  –  June 2009  (5 months) Mobile Software Development (Open) 1 recommendation Marc Haddad Assistant Professor of Engineering Eddy is a consummate professional with a creative mind to match, he was one of our best interns in terms of his technical skills in software engineering, and he displayed a natural aptitude for tackling organizational challenges, from team to... View Part-timer Evolve S.A.R.L October 2008  –  December 2008  (3 months) Social Network Application Development Intern INRIA June 2008  –  August 2008  (3 months) INRIA-IRISA, Rennes, France (Institut de Recherche en Informatique et Systèmes Aléatoires) \n•\tFully designed and implemented web-based application for automated user account management of the Ouest-Genopole platform cluster(creation ,destruction, monitoring of expiration, notification of administrators by e-mail, logging) \n•\tResults: Reduced time spent by administrator on cited tasks, increased speed, decreased possibility of error (Open) 1 recommendation Anthony Assi ►Cloud Chief Technologist◄ Having managed Eddy during his stay at the research lab, I have to make the point that Eddy was very committed to his work and was always looking after the quality of what he delivered. What i appreciated most in Eddy, was his great commitment to... View Principal Industry Analyst, Retail - Middle East & North Africa Google July 2015  – Present (1 month) Dubai Principal Industry Analyst, Retail - Middle East & North Africa Google July 2015  – Present (1 month) Dubai Chief Strategy Officer MarkaVIP June 2013  –  April 2015  (1 year 11 months) Dubai Chief Strategy Officer MarkaVIP June 2013  –  April 2015  (1 year 11 months) Dubai Director of Strategy MarkaVIP February 2012  –  May 2013  (1 year 4 months) Jordan •\tAssisting the CEO in driving critical projects to completion, working across the entire organization \n•\tUnderstanding the business and key issues at a detailed level; proactively researching issues; anticipating opportunities and providing answers / insights to key questions; developing hypotheses and proving / disproving with supporting analysis \n•\tPlaying a key role in annual and long-term business planning, including financial planning and analysis  \n•\tEvaluating and (in some cases) spearheading new products / business development opportunities, partnering with finance, marketing, and other operating areas \n•\tDeveloping strategy/business case, selling into organization, raising/resolving issues, and taking on wide variety of roles, depending on project Director of Strategy MarkaVIP February 2012  –  May 2013  (1 year 4 months) Jordan •\tAssisting the CEO in driving critical projects to completion, working across the entire organization \n•\tUnderstanding the business and key issues at a detailed level; proactively researching issues; anticipating opportunities and providing answers / insights to key questions; developing hypotheses and proving / disproving with supporting analysis \n•\tPlaying a key role in annual and long-term business planning, including financial planning and analysis  \n•\tEvaluating and (in some cases) spearheading new products / business development opportunities, partnering with finance, marketing, and other operating areas \n•\tDeveloping strategy/business case, selling into organization, raising/resolving issues, and taking on wide variety of roles, depending on project Consultant Booz & Company October 2010  –  February 2012  (1 year 5 months) A- Corporate Finance /Partial Balance Sheet by Product - Major Petrochemical Company (GCC) \n- Presented Partial Balance Sheet by Product as a key tool for steering business and suggested key KPIs to aid decision making \n- Developed global template to gather data from different regional systems, with a focus on Working Capital and Fixed Assets data \n- Designed MS Access database system to consolidate data across regions \n- Analyzed results, Identified underlying data quality issues  \n- Suggested and implemented solution for DQ issues \n \nB- Corporate Finance / Global Cost Reports - Major Petrochemical Company (GCC) \n- Gathered business requirements from Finance Team \n- Developed global template to gather data from different regional systems \n- Designed MS Access database system to consolidate data \n- Validated functionalities with Manager of Global Management Reporting department \n- Implemented automatic reporting functionalities that help the team generate more than 150 reports/month \n- Implemented data integrity rules and queries \n- Developed documentation for the usage and maintenance of the tool \n- Conducted workshops and trainings along a 3 months period to transfer knowledge to client employees \n \nC- Corporate Finance / Cost Allocation Cycles- Major Petrochemical Company (GCC) \n- Performed baseline of all active cost allocation cycles (200+) of 18 different legal entities over a 3 months period \n- Engaged with 8 affiliates’ Finance Managers to present findings and gather feedback \n- Contributed to the design of the new Core Model of the cost allocation cycles \n- Assisted the affiliates in the implementation of the proposed recommendations \n \n \nD- IT Strategy - National EMS Provider (GCC) \n- Conducted an assessment of Infrastructure, Applications, Human resources, Processes, and Governance that lead to the identification of key initiatives \n- Developed a target model comprising a master plan and initial budget for the EMS application portfolio, the EMS network, and the EMS call center (Open) 2 recommendations Abdulkader Lamaa Principal at Strategy& (Formerly Booz & Company) I have worked with Eddy over the past few years on multiple strategic assignments. He is full of energy, sharp and diligent... View Jack Woodhouse Director at I-Kimata, Borel & Woodhouse Eddy is a very diligent consultant, with an excellent grasp of all the basic analytical and communicative tools. Furthermore... View Consultant Booz & Company October 2010  –  February 2012  (1 year 5 months) A- Corporate Finance /Partial Balance Sheet by Product - Major Petrochemical Company (GCC) \n- Presented Partial Balance Sheet by Product as a key tool for steering business and suggested key KPIs to aid decision making \n- Developed global template to gather data from different regional systems, with a focus on Working Capital and Fixed Assets data \n- Designed MS Access database system to consolidate data across regions \n- Analyzed results, Identified underlying data quality issues  \n- Suggested and implemented solution for DQ issues \n \nB- Corporate Finance / Global Cost Reports - Major Petrochemical Company (GCC) \n- Gathered business requirements from Finance Team \n- Developed global template to gather data from different regional systems \n- Designed MS Access database system to consolidate data \n- Validated functionalities with Manager of Global Management Reporting department \n- Implemented automatic reporting functionalities that help the team generate more than 150 reports/month \n- Implemented data integrity rules and queries \n- Developed documentation for the usage and maintenance of the tool \n- Conducted workshops and trainings along a 3 months period to transfer knowledge to client employees \n \nC- Corporate Finance / Cost Allocation Cycles- Major Petrochemical Company (GCC) \n- Performed baseline of all active cost allocation cycles (200+) of 18 different legal entities over a 3 months period \n- Engaged with 8 affiliates’ Finance Managers to present findings and gather feedback \n- Contributed to the design of the new Core Model of the cost allocation cycles \n- Assisted the affiliates in the implementation of the proposed recommendations \n \n \nD- IT Strategy - National EMS Provider (GCC) \n- Conducted an assessment of Infrastructure, Applications, Human resources, Processes, and Governance that lead to the identification of key initiatives \n- Developed a target model comprising a master plan and initial budget for the EMS application portfolio, the EMS network, and the EMS call center (Open) 2 recommendations Abdulkader Lamaa Principal at Strategy& (Formerly Booz & Company) I have worked with Eddy over the past few years on multiple strategic assignments. He is full of energy, sharp and diligent... View Jack Woodhouse Director at I-Kimata, Borel & Woodhouse Eddy is a very diligent consultant, with an excellent grasp of all the basic analytical and communicative tools. Furthermore... View Business Analyst Booz & Company October 2009  –  September 2010  (1 year) A- e-Gov/ICT National Roundtable - Government (GCC) \n- Participated in the preparation efforts for a high-profile key conference with the participation of the national leadership of a GCC country and international participants  \n- Contributed to formulation of national e-Maturity declaration \n- Performed comprehensive analysis of the government portals and e-Services \n- Wrote two international award documents and external communications documents, such as press releases \n \nB- e-Gov/ICT Procurement - Government (GCC) \n- Conducted IT procurement benchmarking of more than 40 -vendors for accessibility procurement \n- Short-listed the most relevant vendors for the country’s - Government Accessibility Enablement project \n \nC- Corporate Training Strategy - Global Management Consulting Firm (Middle East)  \n- Performed baseline of corporate training program by assessing training course portfolio, delivery methods, resource management, feedback and reporting (Open) 1 recommendation Niels Beisinghoff Entrepreneur in the field of Mobility and Ecology Eddy is one of the most committed and most capable persons I have worked with. He is very analytical and a highly gifted presenter. He has received extraordinary accolades on all projects he has worked on, also from senior management. He is very... View Business Analyst Booz & Company October 2009  –  September 2010  (1 year) A- e-Gov/ICT National Roundtable - Government (GCC) \n- Participated in the preparation efforts for a high-profile key conference with the participation of the national leadership of a GCC country and international participants  \n- Contributed to formulation of national e-Maturity declaration \n- Performed comprehensive analysis of the government portals and e-Services \n- Wrote two international award documents and external communications documents, such as press releases \n \nB- e-Gov/ICT Procurement - Government (GCC) \n- Conducted IT procurement benchmarking of more than 40 -vendors for accessibility procurement \n- Short-listed the most relevant vendors for the country’s - Government Accessibility Enablement project \n \nC- Corporate Training Strategy - Global Management Consulting Firm (Middle East)  \n- Performed baseline of corporate training program by assessing training course portfolio, delivery methods, resource management, feedback and reporting (Open) 1 recommendation Niels Beisinghoff Entrepreneur in the field of Mobility and Ecology Eddy is one of the most committed and most capable persons I have worked with. He is very analytical and a highly gifted presenter. He has received extraordinary accolades on all projects he has worked on, also from senior management. He is very... View Part-timer / Intern Orolix February 2009  –  June 2009  (5 months) Mobile Software Development (Open) 1 recommendation Marc Haddad Assistant Professor of Engineering Eddy is a consummate professional with a creative mind to match, he was one of our best interns in terms of his technical skills in software engineering, and he displayed a natural aptitude for tackling organizational challenges, from team to... View Part-timer / Intern Orolix February 2009  –  June 2009  (5 months) Mobile Software Development (Open) 1 recommendation Marc Haddad Assistant Professor of Engineering Eddy is a consummate professional with a creative mind to match, he was one of our best interns in terms of his technical skills in software engineering, and he displayed a natural aptitude for tackling organizational challenges, from team to... View Part-timer Evolve S.A.R.L October 2008  –  December 2008  (3 months) Social Network Application Development Part-timer Evolve S.A.R.L October 2008  –  December 2008  (3 months) Social Network Application Development Intern INRIA June 2008  –  August 2008  (3 months) INRIA-IRISA, Rennes, France (Institut de Recherche en Informatique et Systèmes Aléatoires) \n•\tFully designed and implemented web-based application for automated user account management of the Ouest-Genopole platform cluster(creation ,destruction, monitoring of expiration, notification of administrators by e-mail, logging) \n•\tResults: Reduced time spent by administrator on cited tasks, increased speed, decreased possibility of error (Open) 1 recommendation Anthony Assi ►Cloud Chief Technologist◄ Having managed Eddy during his stay at the research lab, I have to make the point that Eddy was very committed to his work and was always looking after the quality of what he delivered. What i appreciated most in Eddy, was his great commitment to... View Intern INRIA June 2008  –  August 2008  (3 months) INRIA-IRISA, Rennes, France (Institut de Recherche en Informatique et Systèmes Aléatoires) \n•\tFully designed and implemented web-based application for automated user account management of the Ouest-Genopole platform cluster(creation ,destruction, monitoring of expiration, notification of administrators by e-mail, logging) \n•\tResults: Reduced time spent by administrator on cited tasks, increased speed, decreased possibility of error (Open) 1 recommendation Anthony Assi ►Cloud Chief Technologist◄ Having managed Eddy during his stay at the research lab, I have to make the point that Eddy was very committed to his work and was always looking after the quality of what he delivered. What i appreciated most in Eddy, was his great commitment to... View Languages French Native or bilingual proficiency English Full professional proficiency Arabic Native or bilingual proficiency French Native or bilingual proficiency English Full professional proficiency Arabic Native or bilingual proficiency French Native or bilingual proficiency English Full professional proficiency Arabic Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Top Skills 68 Management Consulting 55 Strategy 54 IT Strategy 48 Strategic Planning 40 Analysis 35 E-commerce 27 Management 24 Business Development 23 Project Management 21 Software Engineering Eddy also knows about... 19 Business Strategy 14 Leadership 11 MySQL 10 Team Leadership 10 Team Management 9 Team Building 6 Business Analysis 5 Soft Skills 5 Change Management 4 Entrepreneurship 4 Business Transformation 4 Strategic Consulting 3 Governance 3 Telecommunications 2 PHP 2 Organizational Design 1 AJAX 1 Flex 0 Online Retail 0 Industrial Chemicals 0 Web Applications 0 Operating Models 0 Java 0 C++ See 9+     See less Skills  Top Skills 68 Management Consulting 55 Strategy 54 IT Strategy 48 Strategic Planning 40 Analysis 35 E-commerce 27 Management 24 Business Development 23 Project Management 21 Software Engineering Eddy also knows about... 19 Business Strategy 14 Leadership 11 MySQL 10 Team Leadership 10 Team Management 9 Team Building 6 Business Analysis 5 Soft Skills 5 Change Management 4 Entrepreneurship 4 Business Transformation 4 Strategic Consulting 3 Governance 3 Telecommunications 2 PHP 2 Organizational Design 1 AJAX 1 Flex 0 Online Retail 0 Industrial Chemicals 0 Web Applications 0 Operating Models 0 Java 0 C++ See 9+     See less Top Skills 68 Management Consulting 55 Strategy 54 IT Strategy 48 Strategic Planning 40 Analysis 35 E-commerce 27 Management 24 Business Development 23 Project Management 21 Software Engineering Eddy also knows about... 19 Business Strategy 14 Leadership 11 MySQL 10 Team Leadership 10 Team Management 9 Team Building 6 Business Analysis 5 Soft Skills 5 Change Management 4 Entrepreneurship 4 Business Transformation 4 Strategic Consulting 3 Governance 3 Telecommunications 2 PHP 2 Organizational Design 1 AJAX 1 Flex 0 Online Retail 0 Industrial Chemicals 0 Web Applications 0 Operating Models 0 Java 0 C++ See 9+     See less Top Skills 68 Management Consulting 55 Strategy 54 IT Strategy 48 Strategic Planning 40 Analysis 35 E-commerce 27 Management 24 Business Development 23 Project Management 21 Software Engineering Eddy also knows about... 19 Business Strategy 14 Leadership 11 MySQL 10 Team Leadership 10 Team Management 9 Team Building 6 Business Analysis 5 Soft Skills 5 Change Management 4 Entrepreneurship 4 Business Transformation 4 Strategic Consulting 3 Governance 3 Telecommunications 2 PHP 2 Organizational Design 1 AJAX 1 Flex 0 Online Retail 0 Industrial Chemicals 0 Web Applications 0 Operating Models 0 Java 0 C++ See 9+     See less                     19 Business Strategy 14 Leadership 11 MySQL 10 Team Leadership 10 Team Management 9 Team Building 6 Business Analysis 5 Soft Skills 5 Change Management 4 Entrepreneurship 4 Business Transformation 4 Strategic Consulting 3 Governance 3 Telecommunications 2 PHP 2 Organizational Design 1 AJAX 1 Flex 0 Online Retail 0 Industrial Chemicals 0 Web Applications 0 Operating Models 0 Java 0 C++ Education College Notre Dame de Jamhour Lebanese and French Baccalaureate \nwith emphasis on Mathematics (Open) 1 honor or award Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) View ESIB (Ecole Supérieure d’Ingénieurs de Beyrouth) Bachelor of Engineering,  Computer and Networking (Open) 1 project Share IT Share IT is a peer to peer client that adds semantic support to file sharing, routing, discovery as well as trust management. It proposes to use an Integration of Reputation-based and semantic Policy-based trust management to manage these services. View (Open) 1 honor or award Software Design Consulting Group “Road to Success “ award for best computer software View (Open) 3 courses Parallel Programming (MPI, PThreads) Prolog Design Patterns See more College Notre Dame de Jamhour Lebanese and French Baccalaureate \nwith emphasis on Mathematics (Open) 1 honor or award Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) View College Notre Dame de Jamhour Lebanese and French Baccalaureate \nwith emphasis on Mathematics (Open) 1 honor or award Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) View College Notre Dame de Jamhour Lebanese and French Baccalaureate \nwith emphasis on Mathematics (Open) 1 honor or award Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) View ESIB (Ecole Supérieure d’Ingénieurs de Beyrouth) Bachelor of Engineering,  Computer and Networking (Open) 1 project Share IT Share IT is a peer to peer client that adds semantic support to file sharing, routing, discovery as well as trust management. It proposes to use an Integration of Reputation-based and semantic Policy-based trust management to manage these services. View (Open) 1 honor or award Software Design Consulting Group “Road to Success “ award for best computer software View (Open) 3 courses Parallel Programming (MPI, PThreads) Prolog Design Patterns See more ESIB (Ecole Supérieure d’Ingénieurs de Beyrouth) Bachelor of Engineering,  Computer and Networking (Open) 1 project Share IT Share IT is a peer to peer client that adds semantic support to file sharing, routing, discovery as well as trust management. It proposes to use an Integration of Reputation-based and semantic Policy-based trust management to manage these services. View (Open) 1 honor or award Software Design Consulting Group “Road to Success “ award for best computer software View (Open) 3 courses Parallel Programming (MPI, PThreads) Prolog Design Patterns See more ESIB (Ecole Supérieure d’Ingénieurs de Beyrouth) Bachelor of Engineering,  Computer and Networking (Open) 1 project Share IT Share IT is a peer to peer client that adds semantic support to file sharing, routing, discovery as well as trust management. It proposes to use an Integration of Reputation-based and semantic Policy-based trust management to manage these services. View (Open) 1 honor or award Software Design Consulting Group “Road to Success “ award for best computer software View (Open) 3 courses Parallel Programming (MPI, PThreads) Prolog Design Patterns See more Honors & Awards Software Design Consulting Group “Road to Success “ award for best computer software Software Design Consulting Group Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) June 2001 “Best sportsman of the year” award by Collège Notre-Dame de Jamhour (2001) Additional Honors & Awards Software Design Consulting Group \" Road To Success\" Award 2008 \nLebanese record man in Triple Jump 2001-2005 Software Design Consulting Group “Road to Success “ award for best computer software Software Design Consulting Group Software Design Consulting Group “Road to Success “ award for best computer software Software Design Consulting Group Software Design Consulting Group “Road to Success “ award for best computer software Software Design Consulting Group Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) June 2001 Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) June 2001 Former lebanese champion and recordman in athletics (Triple Jump, Discus Throw) June 2001 “Best sportsman of the year” award by Collège Notre-Dame de Jamhour (2001) “Best sportsman of the year” award by Collège Notre-Dame de Jamhour (2001) “Best sportsman of the year” award by Collège Notre-Dame de Jamhour (2001) Additional Honors & Awards Software Design Consulting Group \" Road To Success\" Award 2008 \nLebanese record man in Triple Jump 2001-2005 Additional Honors & Awards Software Design Consulting Group \" Road To Success\" Award 2008 \nLebanese record man in Triple Jump 2001-2005 Additional Honors & Awards Software Design Consulting Group \" Road To Success\" Award 2008 \nLebanese record man in Triple Jump 2001-2005 ", "Experience Principal Account Manager - Technology & SAAS Google August 2014  – Present (1 year) Gurgaon, India Online business development for technology OEMs and SAAS industry. Business development & growth consulting for technology startups in India. Advising on online advertising and media campaigns of prominent consumer technology brands. Thought leadership on Internet and allied businesses. Principal Industry Analyst - Technology & Telecom Google October 2013  –  August 2014  (11 months) Gurgaon, India Online business development for technology and telecom industry. Online advertising and media campaigns of prominent brands in India. Thought leadership on Internet and allied businesses in India. (Open) 1 project Creating the Next Multibillion-Dollar Online Opportunities in Telecoms With India on the threshold of an Internet explosion, a joint Google-A.T. Kearney study pinpoints the opportunities that hold the most value. View Creating the Next Multibillion-Dollar Online Opportunities in Telecoms Edit Senior Industry Analyst - Technology, Telecom & BFSI Google May 2011  –  September 2013  (2 years 5 months) Gurgaon, India Online business development for technology, telecom and BFSI industry in India. (Open) 1 honor or award APAC Sales Award for Best Senior Level Pitch View Secretary, Students' Affairs Council IIM Ahmedabad January 2010  –  January 2011  (1 year 1 month) Ahmedabad Area, India Elected as Secretary to the Students' Affairs Council (SAC) by a direct presidential vote by all the students of campus. The SAC looks into academics, placements, media relations, cultural activities, sports, food and infrastructure at campus. Summer Intern Procter & Gamble, Singapore April 2010  –  June 2010  (3 months) Singapore Worked at the Asia GBU on \"Pringles\" brand. Work covered markets in Japan, Asia, Australia & New Zealand. Design Engineer STMicroelectronics July 2007  –  May 2009  (1 year 11 months) Noida Area, India Analog VLSI electronic-chip design. Semiconductor design. \nSpl in: Design of on-chip circuits like bandgap reference, voltage regulators and oscillators. Intern Bhabha Atomic Research Centre May 2006  –  July 2006  (3 months) Mumbai Area, India Semiconductor design for Application Specific Integrated Circuits. Principal Account Manager - Technology & SAAS Google August 2014  – Present (1 year) Gurgaon, India Online business development for technology OEMs and SAAS industry. Business development & growth consulting for technology startups in India. Advising on online advertising and media campaigns of prominent consumer technology brands. Thought leadership on Internet and allied businesses. Principal Account Manager - Technology & SAAS Google August 2014  – Present (1 year) Gurgaon, India Online business development for technology OEMs and SAAS industry. Business development & growth consulting for technology startups in India. Advising on online advertising and media campaigns of prominent consumer technology brands. Thought leadership on Internet and allied businesses. Principal Industry Analyst - Technology & Telecom Google October 2013  –  August 2014  (11 months) Gurgaon, India Online business development for technology and telecom industry. Online advertising and media campaigns of prominent brands in India. Thought leadership on Internet and allied businesses in India. (Open) 1 project Creating the Next Multibillion-Dollar Online Opportunities in Telecoms With India on the threshold of an Internet explosion, a joint Google-A.T. Kearney study pinpoints the opportunities that hold the most value. View Creating the Next Multibillion-Dollar Online Opportunities in Telecoms Edit Principal Industry Analyst - Technology & Telecom Google October 2013  –  August 2014  (11 months) Gurgaon, India Online business development for technology and telecom industry. Online advertising and media campaigns of prominent brands in India. Thought leadership on Internet and allied businesses in India. (Open) 1 project Creating the Next Multibillion-Dollar Online Opportunities in Telecoms With India on the threshold of an Internet explosion, a joint Google-A.T. Kearney study pinpoints the opportunities that hold the most value. View Creating the Next Multibillion-Dollar Online Opportunities in Telecoms Edit Creating the Next Multibillion-Dollar Online Opportunities in Telecoms Edit Creating the Next Multibillion-Dollar Online Opportunities in Telecoms Edit Creating the Next Multibillion-Dollar Online Opportunities in Telecoms  Creating the Next Multibillion-Dollar Online Opportunities in Telecoms  Senior Industry Analyst - Technology, Telecom & BFSI Google May 2011  –  September 2013  (2 years 5 months) Gurgaon, India Online business development for technology, telecom and BFSI industry in India. (Open) 1 honor or award APAC Sales Award for Best Senior Level Pitch View Senior Industry Analyst - Technology, Telecom & BFSI Google May 2011  –  September 2013  (2 years 5 months) Gurgaon, India Online business development for technology, telecom and BFSI industry in India. (Open) 1 honor or award APAC Sales Award for Best Senior Level Pitch View Secretary, Students' Affairs Council IIM Ahmedabad January 2010  –  January 2011  (1 year 1 month) Ahmedabad Area, India Elected as Secretary to the Students' Affairs Council (SAC) by a direct presidential vote by all the students of campus. The SAC looks into academics, placements, media relations, cultural activities, sports, food and infrastructure at campus. Secretary, Students' Affairs Council IIM Ahmedabad January 2010  –  January 2011  (1 year 1 month) Ahmedabad Area, India Elected as Secretary to the Students' Affairs Council (SAC) by a direct presidential vote by all the students of campus. The SAC looks into academics, placements, media relations, cultural activities, sports, food and infrastructure at campus. Summer Intern Procter & Gamble, Singapore April 2010  –  June 2010  (3 months) Singapore Worked at the Asia GBU on \"Pringles\" brand. Work covered markets in Japan, Asia, Australia & New Zealand. Summer Intern Procter & Gamble, Singapore April 2010  –  June 2010  (3 months) Singapore Worked at the Asia GBU on \"Pringles\" brand. Work covered markets in Japan, Asia, Australia & New Zealand. Design Engineer STMicroelectronics July 2007  –  May 2009  (1 year 11 months) Noida Area, India Analog VLSI electronic-chip design. Semiconductor design. \nSpl in: Design of on-chip circuits like bandgap reference, voltage regulators and oscillators. Design Engineer STMicroelectronics July 2007  –  May 2009  (1 year 11 months) Noida Area, India Analog VLSI electronic-chip design. Semiconductor design. \nSpl in: Design of on-chip circuits like bandgap reference, voltage regulators and oscillators. Intern Bhabha Atomic Research Centre May 2006  –  July 2006  (3 months) Mumbai Area, India Semiconductor design for Application Specific Integrated Circuits. Intern Bhabha Atomic Research Centre May 2006  –  July 2006  (3 months) Mumbai Area, India Semiconductor design for Application Specific Integrated Circuits. Languages English Full professional proficiency Hindi Full professional proficiency English Full professional proficiency Hindi Full professional proficiency English Full professional proficiency Hindi Full professional proficiency Full professional proficiency Full professional proficiency Skills Top Skills 16 Business Strategy 12 Analytics 11 Online Advertising 9 Management Consulting 8 Strategy 7 Business Development 5 Business Analysis 5 Telecommunications 3 Online Marketing... 3 Market Research Arpit also knows about... 3 Product Management 3 E-commerce 2 Industry Analysis 2 Strategic Consulting 1 Competitive Analysis Skills  Top Skills 16 Business Strategy 12 Analytics 11 Online Advertising 9 Management Consulting 8 Strategy 7 Business Development 5 Business Analysis 5 Telecommunications 3 Online Marketing... 3 Market Research Arpit also knows about... 3 Product Management 3 E-commerce 2 Industry Analysis 2 Strategic Consulting 1 Competitive Analysis Top Skills 16 Business Strategy 12 Analytics 11 Online Advertising 9 Management Consulting 8 Strategy 7 Business Development 5 Business Analysis 5 Telecommunications 3 Online Marketing... 3 Market Research Arpit also knows about... 3 Product Management 3 E-commerce 2 Industry Analysis 2 Strategic Consulting 1 Competitive Analysis Top Skills 16 Business Strategy 12 Analytics 11 Online Advertising 9 Management Consulting 8 Strategy 7 Business Development 5 Business Analysis 5 Telecommunications 3 Online Marketing... 3 Market Research Arpit also knows about... 3 Product Management 3 E-commerce 2 Industry Analysis 2 Strategic Consulting 1 Competitive Analysis                     3 Product Management 3 E-commerce 2 Industry Analysis 2 Strategic Consulting 1 Competitive Analysis Education Indian Institute of Management, Ahmedabad Post Graduate Programme in Management (PGP),  Business Administration and Management ,  General 2009  – 2011 Was among the top 20 students of the batch admitted. Elected Secretary of the Student Council (Student Government). Head of Academic Council. Conceptualized and implemented dynamic auction for course allocation. Activities and Societies:  Students' Affairs Council ,  Academic Council Birla Institute of Technology and Science Bachelor of Engineering (Hons.),  Electrical & Electronics , 9.96 / 10 2003  – 2007 Graduated with Honours in EEE focusing on analog semiconductor circuit design. Merit scholar and best outgoing student of the batch. (Open) 1 honor or award Best Outgoing Student View Indian Institute of Management, Ahmedabad Post Graduate Programme in Management (PGP),  Business Administration and Management ,  General 2009  – 2011 Was among the top 20 students of the batch admitted. Elected Secretary of the Student Council (Student Government). Head of Academic Council. Conceptualized and implemented dynamic auction for course allocation. Activities and Societies:  Students' Affairs Council ,  Academic Council Indian Institute of Management, Ahmedabad Post Graduate Programme in Management (PGP),  Business Administration and Management ,  General 2009  – 2011 Was among the top 20 students of the batch admitted. Elected Secretary of the Student Council (Student Government). Head of Academic Council. Conceptualized and implemented dynamic auction for course allocation. Activities and Societies:  Students' Affairs Council ,  Academic Council Indian Institute of Management, Ahmedabad Post Graduate Programme in Management (PGP),  Business Administration and Management ,  General 2009  – 2011 Was among the top 20 students of the batch admitted. Elected Secretary of the Student Council (Student Government). Head of Academic Council. Conceptualized and implemented dynamic auction for course allocation. Activities and Societies:  Students' Affairs Council ,  Academic Council Birla Institute of Technology and Science Bachelor of Engineering (Hons.),  Electrical & Electronics , 9.96 / 10 2003  – 2007 Graduated with Honours in EEE focusing on analog semiconductor circuit design. Merit scholar and best outgoing student of the batch. (Open) 1 honor or award Best Outgoing Student View Birla Institute of Technology and Science Bachelor of Engineering (Hons.),  Electrical & Electronics , 9.96 / 10 2003  – 2007 Graduated with Honours in EEE focusing on analog semiconductor circuit design. Merit scholar and best outgoing student of the batch. (Open) 1 honor or award Best Outgoing Student View Birla Institute of Technology and Science Bachelor of Engineering (Hons.),  Electrical & Electronics , 9.96 / 10 2003  – 2007 Graduated with Honours in EEE focusing on analog semiconductor circuit design. Merit scholar and best outgoing student of the batch. (Open) 1 honor or award Best Outgoing Student View Honors & Awards Best Outgoing Student BITS Pilani May 2007 APAC Sales Award for Best Senior Level Pitch Google October 2011 Additional Honors & Awards Best Outgoing Student Award, EEE 2003-2007 Batch, BITS Pilani. Among the top 20 students admitted to IIM Ahmedabad Best Outgoing Student BITS Pilani May 2007 Best Outgoing Student BITS Pilani May 2007 Best Outgoing Student BITS Pilani May 2007 APAC Sales Award for Best Senior Level Pitch Google October 2011 APAC Sales Award for Best Senior Level Pitch Google October 2011 APAC Sales Award for Best Senior Level Pitch Google October 2011 Additional Honors & Awards Best Outgoing Student Award, EEE 2003-2007 Batch, BITS Pilani. Among the top 20 students admitted to IIM Ahmedabad Additional Honors & Awards Best Outgoing Student Award, EEE 2003-2007 Batch, BITS Pilani. Among the top 20 students admitted to IIM Ahmedabad Additional Honors & Awards Best Outgoing Student Award, EEE 2003-2007 Batch, BITS Pilani. Among the top 20 students admitted to IIM Ahmedabad ", "Experience Principal Industry Analyst | Sr. Account Planner, Advertising Sales - Finance Google March 2014  – Present (1 year 5 months) San Francisco Bay Area Principal Analytical Lead, Advertising Sales - Retail Google February 2013  –  February 2014  (1 year 1 month) Mountain View, CA Sr. Manager, Client Insights - Media & Advertising Analytics The Nielsen Company April 2011  –  February 2013  (1 year 11 months) San Francisco Bay Area (Open) 3 recommendations, including: Corey Jeffery VP, Client Solutions at Millward Brown Rosa is the total package; smart, personable, hard-working and detail-oriented. She was the linchpin of our team - ever... View Michelle Tang Client Engagement & Sales Strategy Rosa is AMAZING at what she does - knowledgeable, accommodating and always willing to lend a cross-functional hand. Everyone... View 1 more recommendation Sr. Product Manager, Advertising Effectiveness Solutions The Nielsen Company January 2009  –  March 2011  (2 years 3 months) San Francisco Bay Area Internet Analyst, Insight & Innovation The Nielsen Company March 2007  –  December 2008  (1 year 10 months) San Francisco Bay Area Strategic Account Manager, Client Services Nielsen//NetRatings February 2005  –  February 2007  (2 years 1 month) San Francisco Bay Area Investigative Analyst, Options Surveillance NYSE Euronext (merged with Pacific Exchange) 2000  –  2004  (4 years) San Francisco Bay Area Research Analyst, Mergers & Acquisitions Prudential Financial (merged with Volpe Brown Whelan & Co., LLC) 1999  –  2000  (1 year) San Francisco Bay Area Principal Industry Analyst | Sr. Account Planner, Advertising Sales - Finance Google March 2014  – Present (1 year 5 months) San Francisco Bay Area Principal Industry Analyst | Sr. Account Planner, Advertising Sales - Finance Google March 2014  – Present (1 year 5 months) San Francisco Bay Area Principal Analytical Lead, Advertising Sales - Retail Google February 2013  –  February 2014  (1 year 1 month) Mountain View, CA Principal Analytical Lead, Advertising Sales - Retail Google February 2013  –  February 2014  (1 year 1 month) Mountain View, CA Sr. Manager, Client Insights - Media & Advertising Analytics The Nielsen Company April 2011  –  February 2013  (1 year 11 months) San Francisco Bay Area (Open) 3 recommendations, including: Corey Jeffery VP, Client Solutions at Millward Brown Rosa is the total package; smart, personable, hard-working and detail-oriented. She was the linchpin of our team - ever... View Michelle Tang Client Engagement & Sales Strategy Rosa is AMAZING at what she does - knowledgeable, accommodating and always willing to lend a cross-functional hand. Everyone... View 1 more recommendation Sr. Manager, Client Insights - Media & Advertising Analytics The Nielsen Company April 2011  –  February 2013  (1 year 11 months) San Francisco Bay Area (Open) 3 recommendations, including: Corey Jeffery VP, Client Solutions at Millward Brown Rosa is the total package; smart, personable, hard-working and detail-oriented. She was the linchpin of our team - ever... View Michelle Tang Client Engagement & Sales Strategy Rosa is AMAZING at what she does - knowledgeable, accommodating and always willing to lend a cross-functional hand. Everyone... View 1 more recommendation Sr. Product Manager, Advertising Effectiveness Solutions The Nielsen Company January 2009  –  March 2011  (2 years 3 months) San Francisco Bay Area Sr. Product Manager, Advertising Effectiveness Solutions The Nielsen Company January 2009  –  March 2011  (2 years 3 months) San Francisco Bay Area Internet Analyst, Insight & Innovation The Nielsen Company March 2007  –  December 2008  (1 year 10 months) San Francisco Bay Area Internet Analyst, Insight & Innovation The Nielsen Company March 2007  –  December 2008  (1 year 10 months) San Francisco Bay Area Strategic Account Manager, Client Services Nielsen//NetRatings February 2005  –  February 2007  (2 years 1 month) San Francisco Bay Area Strategic Account Manager, Client Services Nielsen//NetRatings February 2005  –  February 2007  (2 years 1 month) San Francisco Bay Area Investigative Analyst, Options Surveillance NYSE Euronext (merged with Pacific Exchange) 2000  –  2004  (4 years) San Francisco Bay Area Investigative Analyst, Options Surveillance NYSE Euronext (merged with Pacific Exchange) 2000  –  2004  (4 years) San Francisco Bay Area Research Analyst, Mergers & Acquisitions Prudential Financial (merged with Volpe Brown Whelan & Co., LLC) 1999  –  2000  (1 year) San Francisco Bay Area Research Analyst, Mergers & Acquisitions Prudential Financial (merged with Volpe Brown Whelan & Co., LLC) 1999  –  2000  (1 year) San Francisco Bay Area Languages   Skills Skills     Education University of California, Berkeley University of California, Berkeley University of California, Berkeley University of California, Berkeley ", "Experience Interim - Advisor to the Board VBL Ltd. March 2015  – Present (5 months) Malta Principal Industry Analyst Google January 2014  –  January 2015  (1 year 1 month) Group Account Director TNS March 2013  –  November 2013  (9 months) UAE Head, Market Research CE Region Chello Central Europe May 2012  –  March 2013  (11 months) Hungary area Head, Client Services Replise April 2010  –  April 2012  (2 years 1 month) Hungary Head, Media division GfK December 2002  –  March 2010  (7 years 4 months) Hungary; US Senior Research Executive Ipsos January 2001  –  November 2002  (1 year 11 months) Hungary Researcher TÁRKI January 1997  –  December 2000  (4 years) Hungary Interim - Advisor to the Board VBL Ltd. March 2015  – Present (5 months) Malta Interim - Advisor to the Board VBL Ltd. March 2015  – Present (5 months) Malta Principal Industry Analyst Google January 2014  –  January 2015  (1 year 1 month) Principal Industry Analyst Google January 2014  –  January 2015  (1 year 1 month) Group Account Director TNS March 2013  –  November 2013  (9 months) UAE Group Account Director TNS March 2013  –  November 2013  (9 months) UAE Head, Market Research CE Region Chello Central Europe May 2012  –  March 2013  (11 months) Hungary area Head, Market Research CE Region Chello Central Europe May 2012  –  March 2013  (11 months) Hungary area Head, Client Services Replise April 2010  –  April 2012  (2 years 1 month) Hungary Head, Client Services Replise April 2010  –  April 2012  (2 years 1 month) Hungary Head, Media division GfK December 2002  –  March 2010  (7 years 4 months) Hungary; US Head, Media division GfK December 2002  –  March 2010  (7 years 4 months) Hungary; US Senior Research Executive Ipsos January 2001  –  November 2002  (1 year 11 months) Hungary Senior Research Executive Ipsos January 2001  –  November 2002  (1 year 11 months) Hungary Researcher TÁRKI January 1997  –  December 2000  (4 years) Hungary Researcher TÁRKI January 1997  –  December 2000  (4 years) Hungary Languages English Full professional proficiency Hungarian Native or bilingual proficiency English Full professional proficiency Hungarian Native or bilingual proficiency English Full professional proficiency Hungarian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Top Skills 81 Market Research 41 Customer Insight 36 Marketing Research 30 Marketing Strategy 22 Segmentation 19 Market Analysis 19 Consumer Behaviour 16 Social Media 16 SPSS 16 Analytics István also knows about... 14 Digital Media 14 Marketing Communications 13 Advertising Research 13 Business Insights 12 Online Research 11 Quantitative Research 11 Questionnaire Design 10 Digital Strategy 10 Google Analytics 7 Market Intelligence 6 New Business Development 6 Digital Marketing 6 Online Advertising 5 Social Media Marketing 5 Focus Groups 4 Mobile Marketing 4 Primary Research 3 New Media 3 Strategy 3 Integrated Marketing 3 Media Planning 3 Online Marketing 3 Consumer Insight 3 Advertising 3 Secondary Research 2 Consumer Insights 2 Brand Development 2 Web Analytics 2 Qualitative Research 2 Competitive Analysis 2 Survey Design 1 Client Services 1 Media Research 1 Brand Management 1 Brand Equity 1 Marketing Management 1 FMCG 0 Client Service See 23+     See less Skills  Top Skills 81 Market Research 41 Customer Insight 36 Marketing Research 30 Marketing Strategy 22 Segmentation 19 Market Analysis 19 Consumer Behaviour 16 Social Media 16 SPSS 16 Analytics István also knows about... 14 Digital Media 14 Marketing Communications 13 Advertising Research 13 Business Insights 12 Online Research 11 Quantitative Research 11 Questionnaire Design 10 Digital Strategy 10 Google Analytics 7 Market Intelligence 6 New Business Development 6 Digital Marketing 6 Online Advertising 5 Social Media Marketing 5 Focus Groups 4 Mobile Marketing 4 Primary Research 3 New Media 3 Strategy 3 Integrated Marketing 3 Media Planning 3 Online Marketing 3 Consumer Insight 3 Advertising 3 Secondary Research 2 Consumer Insights 2 Brand Development 2 Web Analytics 2 Qualitative Research 2 Competitive Analysis 2 Survey Design 1 Client Services 1 Media Research 1 Brand Management 1 Brand Equity 1 Marketing Management 1 FMCG 0 Client Service See 23+     See less Top Skills 81 Market Research 41 Customer Insight 36 Marketing Research 30 Marketing Strategy 22 Segmentation 19 Market Analysis 19 Consumer Behaviour 16 Social Media 16 SPSS 16 Analytics István also knows about... 14 Digital Media 14 Marketing Communications 13 Advertising Research 13 Business Insights 12 Online Research 11 Quantitative Research 11 Questionnaire Design 10 Digital Strategy 10 Google Analytics 7 Market Intelligence 6 New Business Development 6 Digital Marketing 6 Online Advertising 5 Social Media Marketing 5 Focus Groups 4 Mobile Marketing 4 Primary Research 3 New Media 3 Strategy 3 Integrated Marketing 3 Media Planning 3 Online Marketing 3 Consumer Insight 3 Advertising 3 Secondary Research 2 Consumer Insights 2 Brand Development 2 Web Analytics 2 Qualitative Research 2 Competitive Analysis 2 Survey Design 1 Client Services 1 Media Research 1 Brand Management 1 Brand Equity 1 Marketing Management 1 FMCG 0 Client Service See 23+     See less Top Skills 81 Market Research 41 Customer Insight 36 Marketing Research 30 Marketing Strategy 22 Segmentation 19 Market Analysis 19 Consumer Behaviour 16 Social Media 16 SPSS 16 Analytics István also knows about... 14 Digital Media 14 Marketing Communications 13 Advertising Research 13 Business Insights 12 Online Research 11 Quantitative Research 11 Questionnaire Design 10 Digital Strategy 10 Google Analytics 7 Market Intelligence 6 New Business Development 6 Digital Marketing 6 Online Advertising 5 Social Media Marketing 5 Focus Groups 4 Mobile Marketing 4 Primary Research 3 New Media 3 Strategy 3 Integrated Marketing 3 Media Planning 3 Online Marketing 3 Consumer Insight 3 Advertising 3 Secondary Research 2 Consumer Insights 2 Brand Development 2 Web Analytics 2 Qualitative Research 2 Competitive Analysis 2 Survey Design 1 Client Services 1 Media Research 1 Brand Management 1 Brand Equity 1 Marketing Management 1 FMCG 0 Client Service See 23+     See less                     14 Digital Media 14 Marketing Communications 13 Advertising Research 13 Business Insights 12 Online Research 11 Quantitative Research 11 Questionnaire Design 10 Digital Strategy 10 Google Analytics 7 Market Intelligence 6 New Business Development 6 Digital Marketing 6 Online Advertising 5 Social Media Marketing 5 Focus Groups 4 Mobile Marketing 4 Primary Research 3 New Media 3 Strategy 3 Integrated Marketing 3 Media Planning 3 Online Marketing 3 Consumer Insight 3 Advertising 3 Secondary Research 2 Consumer Insights 2 Brand Development 2 Web Analytics 2 Qualitative Research 2 Competitive Analysis 2 Survey Design 1 Client Services 1 Media Research 1 Brand Management 1 Brand Equity 1 Marketing Management 1 FMCG 0 Client Service Education Eötvös Loránd Tudományegyetem MA,  sociologyst 1995  – 2000 Eötvös Loránd Tudományegyetem MA,  sociologyst 1995  – 2000 Eötvös Loránd Tudományegyetem MA,  sociologyst 1995  – 2000 Eötvös Loránd Tudományegyetem MA,  sociologyst 1995  – 2000 ", "Summary Currently working as Account Manager in the India market in E Commerce Online Retail. As an AM, handling a portfolio of leading Online Retail clients across Apparel, Electronics and others. \n \nSpecialties \n \n-Revenue Analysis, deficit management, portfolio management \n-Industry analysis, sales presentation skills & direct sales experience. \n-Search Engine Marketing (SEM)  \n-Relationship Management w/ clients \n-Google AdWords Professional \n-Account Analysis and growth opportunity identification. Summary Currently working as Account Manager in the India market in E Commerce Online Retail. As an AM, handling a portfolio of leading Online Retail clients across Apparel, Electronics and others. \n \nSpecialties \n \n-Revenue Analysis, deficit management, portfolio management \n-Industry analysis, sales presentation skills & direct sales experience. \n-Search Engine Marketing (SEM)  \n-Relationship Management w/ clients \n-Google AdWords Professional \n-Account Analysis and growth opportunity identification. Currently working as Account Manager in the India market in E Commerce Online Retail. As an AM, handling a portfolio of leading Online Retail clients across Apparel, Electronics and others. \n \nSpecialties \n \n-Revenue Analysis, deficit management, portfolio management \n-Industry analysis, sales presentation skills & direct sales experience. \n-Search Engine Marketing (SEM)  \n-Relationship Management w/ clients \n-Google AdWords Professional \n-Account Analysis and growth opportunity identification. Currently working as Account Manager in the India market in E Commerce Online Retail. As an AM, handling a portfolio of leading Online Retail clients across Apparel, Electronics and others. \n \nSpecialties \n \n-Revenue Analysis, deficit management, portfolio management \n-Industry analysis, sales presentation skills & direct sales experience. \n-Search Engine Marketing (SEM)  \n-Relationship Management w/ clients \n-Google AdWords Professional \n-Account Analysis and growth opportunity identification. Experience Account Manager, Google India Google July 2007  – Present (8 years 1 month) Google India, Gurgaon. Online Retail - E Commerce India Account Manager, Google India Google July 2007  – Present (8 years 1 month) Google India, Gurgaon. Online Retail - E Commerce India Account Manager, Google India Google July 2007  – Present (8 years 1 month) Google India, Gurgaon. Online Retail - E Commerce India Skills Top Skills 27 SEM 17 Google Adwords 13 Search Advertising 8 Online Advertising 8 Google Analytics 8 Digital Marketing 6 PPC 4 Direct Marketing 2 Conversion Optimization 2 Market Research Aruni also knows about... 2 Online Marketing 2 E-commerce 1 Online Retail 1 Google Display Network 1 Analytics 1 Web Analytics 1 Mobile Marketing 1 Marketing Strategy 0 Search Analysis 0 Search Analytics 0 Market Analysis 0 YouTube 0 Digital Photography Skills  Top Skills 27 SEM 17 Google Adwords 13 Search Advertising 8 Online Advertising 8 Google Analytics 8 Digital Marketing 6 PPC 4 Direct Marketing 2 Conversion Optimization 2 Market Research Aruni also knows about... 2 Online Marketing 2 E-commerce 1 Online Retail 1 Google Display Network 1 Analytics 1 Web Analytics 1 Mobile Marketing 1 Marketing Strategy 0 Search Analysis 0 Search Analytics 0 Market Analysis 0 YouTube 0 Digital Photography Top Skills 27 SEM 17 Google Adwords 13 Search Advertising 8 Online Advertising 8 Google Analytics 8 Digital Marketing 6 PPC 4 Direct Marketing 2 Conversion Optimization 2 Market Research Aruni also knows about... 2 Online Marketing 2 E-commerce 1 Online Retail 1 Google Display Network 1 Analytics 1 Web Analytics 1 Mobile Marketing 1 Marketing Strategy 0 Search Analysis 0 Search Analytics 0 Market Analysis 0 YouTube 0 Digital Photography Top Skills 27 SEM 17 Google Adwords 13 Search Advertising 8 Online Advertising 8 Google Analytics 8 Digital Marketing 6 PPC 4 Direct Marketing 2 Conversion Optimization 2 Market Research Aruni also knows about... 2 Online Marketing 2 E-commerce 1 Online Retail 1 Google Display Network 1 Analytics 1 Web Analytics 1 Mobile Marketing 1 Marketing Strategy 0 Search Analysis 0 Search Analytics 0 Market Analysis 0 YouTube 0 Digital Photography                     2 Online Marketing 2 E-commerce 1 Online Retail 1 Google Display Network 1 Analytics 1 Web Analytics 1 Mobile Marketing 1 Marketing Strategy 0 Search Analysis 0 Search Analytics 0 Market Analysis 0 YouTube 0 Digital Photography Education St. Xavier's College St. Xavier's College St. Xavier's College St. Xavier's College "]}