{"position": "Product Specialist", "company": "Google", "profiles": ["Skills Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Skills  Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords Public Relations Android Cross-functional Team... Policy Online Advertising Strategy Digital Marketing Google Analytics Advertising Web Analytics Digital Strategy Online Marketing Social Media Google Adwords ", "Summary A long time Googler and problem solver by nature, I work across the product and business organizations. I have a history of prioritizing, advocating, building, launching and scaling some of Google’s most successful new products and incubating strategically important initiatives. My recent focus has been spent in Social, Mobile and Local, helping to define the strategies for the future and grow our existing products in all our Global markets. Summary A long time Googler and problem solver by nature, I work across the product and business organizations. I have a history of prioritizing, advocating, building, launching and scaling some of Google’s most successful new products and incubating strategically important initiatives. My recent focus has been spent in Social, Mobile and Local, helping to define the strategies for the future and grow our existing products in all our Global markets. A long time Googler and problem solver by nature, I work across the product and business organizations. I have a history of prioritizing, advocating, building, launching and scaling some of Google’s most successful new products and incubating strategically important initiatives. My recent focus has been spent in Social, Mobile and Local, helping to define the strategies for the future and grow our existing products in all our Global markets. A long time Googler and problem solver by nature, I work across the product and business organizations. I have a history of prioritizing, advocating, building, launching and scaling some of Google’s most successful new products and incubating strategically important initiatives. My recent focus has been spent in Social, Mobile and Local, helping to define the strategies for the future and grow our existing products in all our Global markets. Experience Senior Global Product Lead - Mobile Call Advertising Google July 2014  – Present (1 year 2 months) Greater New York City Area I lead the strategy and business execution of our Mobile calls products, globally. Senior Global Product Lead - Emerging Location Solutions Google November 2013  –  June 2014  (8 months) Greater New York City Area I was responsible for leading a number of initiatives across our cross-functional Location efforts. I was also responsible for creating and executing our strategy for future initiatives which involves conversations with the VC community, market research, analysis as well as market viability. Global Lead, Social Sales and Strategy Google January 2012  –  November 2013  (1 year 11 months) Greater New York City Area As a Global Lead, I was a chief advocate for Google+ and responsible for the overall go-to-market strategy of social and search. I worked cross-functionality and cross-org on the product side to advocate the needs of our customers and prioritize the features that would be most impactful. On the sales side, I created programs to ensure the success of social by working with marketing materials, and regional experts to grow the use of social by our customers. Product Specialist Manager Google January 2011  –  December 2011  (1 year) Greater New York City Area As a Product Specialist Manager, I led a team of five Product Specialists who were responsible for any changes or new initiatives related to Ads on Google search. Senior Product Specialist Lead - New Search Formats Google June 2009  –  February 2011  (1 year 9 months) Greater New York City Area As the lead for new formats in search, I took many products from concept into full launch, representing more than $100m in run rate and resulted in receiving two company-level awards. Senior Product Specialist Lead - Agencies Google May 2008  –  June 2009  (1 year 2 months) Greater New York City Area The purpose of the Agency Product specialist role was to bring the vast product knowledge at Google to our agencies, to help them become more efficient in their advertising and also help them do more non-standard initiatives. Senior Product Specialist Google June 2005  –  May 2008  (3 years) Greater New York City Area My time as a Product Specialist gave me experience in many new and diverse areas of our advertising business. The theme of my work was to incubate, test and iterate on new areas of interest for Google. I was responsible for prioritizing feature requirements for engineering, making assessments of the future viability, for all sales materials, troubleshooting and for setting up scalable implementation processes. Senior Account Executive / Acting Team Lead Google March 2004  –  June 2005  (1 year 4 months) Greater New York City Area Led the top inside sales team of 4 reps working in the retail space and organized it by sub-vertical to maximize efficiency and specialization. Individual revenue in excess of $1.5 million per quarter, with a run-rate of $10 million from new accounts. Inside Sales Manager MaxOnline June 2003  –  March 2004  (10 months) Greater New York City Area - Sold a wide variety of online advertising products including; Banners, Pop-unders, Sky Scrapers, Search Engine Marketing, Email Marketing, Newsletter Sponsorship, Co-Registration. \n- Hit every monthly goal, and billed more than $1.4 million annually. \n- Maintained an international territory, including the United States, Canada, United Kingdom, Australia and Brazil. \n- Other main duties included; coordination with trafficking to meet specified goals of all campaigns, monitoring and editing campaigns to ensure constant success, maintenance of all accounts for timely payment of services rendered and overall expansion of each account. Senior Account Manager Digital Island Inc, a Cable and Wireless company June 2000  –  January 2002  (1 year 8 months) Greater New York City Area - Sales position for the New York-New Jersey territory. \n- $2.8 million in sales for fiscal year 2001, 103% of overall quota. \n- Analyzed basic network and server configurations to determine the proper service package for client needs. \n- Products sold included: multiple types of web hosting and management services, content delivery, on-demand and live event streaming, as well as dedicated network connectivity. Senior Account Executive Qwest Communications May 1999  –  June 2000  (1 year 2 months) Greater New York City Area - Sales position focused mainly on national accounts, though took on various international locations as well. \n- Products sold: dedicated Internet access, dedicated hosting services, equipment and professional services including; site design, application development and consulting. \n- Consistently at 150% of specified sales quota and responsible for $2.7 Million in sales. \n- Personally took on the responsibility of training new sales reps on the more technical side of the product offerings. Senior Global Product Lead - Mobile Call Advertising Google July 2014  – Present (1 year 2 months) Greater New York City Area I lead the strategy and business execution of our Mobile calls products, globally. Senior Global Product Lead - Mobile Call Advertising Google July 2014  – Present (1 year 2 months) Greater New York City Area I lead the strategy and business execution of our Mobile calls products, globally. Senior Global Product Lead - Emerging Location Solutions Google November 2013  –  June 2014  (8 months) Greater New York City Area I was responsible for leading a number of initiatives across our cross-functional Location efforts. I was also responsible for creating and executing our strategy for future initiatives which involves conversations with the VC community, market research, analysis as well as market viability. Senior Global Product Lead - Emerging Location Solutions Google November 2013  –  June 2014  (8 months) Greater New York City Area I was responsible for leading a number of initiatives across our cross-functional Location efforts. I was also responsible for creating and executing our strategy for future initiatives which involves conversations with the VC community, market research, analysis as well as market viability. Global Lead, Social Sales and Strategy Google January 2012  –  November 2013  (1 year 11 months) Greater New York City Area As a Global Lead, I was a chief advocate for Google+ and responsible for the overall go-to-market strategy of social and search. I worked cross-functionality and cross-org on the product side to advocate the needs of our customers and prioritize the features that would be most impactful. On the sales side, I created programs to ensure the success of social by working with marketing materials, and regional experts to grow the use of social by our customers. Global Lead, Social Sales and Strategy Google January 2012  –  November 2013  (1 year 11 months) Greater New York City Area As a Global Lead, I was a chief advocate for Google+ and responsible for the overall go-to-market strategy of social and search. I worked cross-functionality and cross-org on the product side to advocate the needs of our customers and prioritize the features that would be most impactful. On the sales side, I created programs to ensure the success of social by working with marketing materials, and regional experts to grow the use of social by our customers. Product Specialist Manager Google January 2011  –  December 2011  (1 year) Greater New York City Area As a Product Specialist Manager, I led a team of five Product Specialists who were responsible for any changes or new initiatives related to Ads on Google search. Product Specialist Manager Google January 2011  –  December 2011  (1 year) Greater New York City Area As a Product Specialist Manager, I led a team of five Product Specialists who were responsible for any changes or new initiatives related to Ads on Google search. Senior Product Specialist Lead - New Search Formats Google June 2009  –  February 2011  (1 year 9 months) Greater New York City Area As the lead for new formats in search, I took many products from concept into full launch, representing more than $100m in run rate and resulted in receiving two company-level awards. Senior Product Specialist Lead - New Search Formats Google June 2009  –  February 2011  (1 year 9 months) Greater New York City Area As the lead for new formats in search, I took many products from concept into full launch, representing more than $100m in run rate and resulted in receiving two company-level awards. Senior Product Specialist Lead - Agencies Google May 2008  –  June 2009  (1 year 2 months) Greater New York City Area The purpose of the Agency Product specialist role was to bring the vast product knowledge at Google to our agencies, to help them become more efficient in their advertising and also help them do more non-standard initiatives. Senior Product Specialist Lead - Agencies Google May 2008  –  June 2009  (1 year 2 months) Greater New York City Area The purpose of the Agency Product specialist role was to bring the vast product knowledge at Google to our agencies, to help them become more efficient in their advertising and also help them do more non-standard initiatives. Senior Product Specialist Google June 2005  –  May 2008  (3 years) Greater New York City Area My time as a Product Specialist gave me experience in many new and diverse areas of our advertising business. The theme of my work was to incubate, test and iterate on new areas of interest for Google. I was responsible for prioritizing feature requirements for engineering, making assessments of the future viability, for all sales materials, troubleshooting and for setting up scalable implementation processes. Senior Product Specialist Google June 2005  –  May 2008  (3 years) Greater New York City Area My time as a Product Specialist gave me experience in many new and diverse areas of our advertising business. The theme of my work was to incubate, test and iterate on new areas of interest for Google. I was responsible for prioritizing feature requirements for engineering, making assessments of the future viability, for all sales materials, troubleshooting and for setting up scalable implementation processes. Senior Account Executive / Acting Team Lead Google March 2004  –  June 2005  (1 year 4 months) Greater New York City Area Led the top inside sales team of 4 reps working in the retail space and organized it by sub-vertical to maximize efficiency and specialization. Individual revenue in excess of $1.5 million per quarter, with a run-rate of $10 million from new accounts. Senior Account Executive / Acting Team Lead Google March 2004  –  June 2005  (1 year 4 months) Greater New York City Area Led the top inside sales team of 4 reps working in the retail space and organized it by sub-vertical to maximize efficiency and specialization. Individual revenue in excess of $1.5 million per quarter, with a run-rate of $10 million from new accounts. Inside Sales Manager MaxOnline June 2003  –  March 2004  (10 months) Greater New York City Area - Sold a wide variety of online advertising products including; Banners, Pop-unders, Sky Scrapers, Search Engine Marketing, Email Marketing, Newsletter Sponsorship, Co-Registration. \n- Hit every monthly goal, and billed more than $1.4 million annually. \n- Maintained an international territory, including the United States, Canada, United Kingdom, Australia and Brazil. \n- Other main duties included; coordination with trafficking to meet specified goals of all campaigns, monitoring and editing campaigns to ensure constant success, maintenance of all accounts for timely payment of services rendered and overall expansion of each account. Inside Sales Manager MaxOnline June 2003  –  March 2004  (10 months) Greater New York City Area - Sold a wide variety of online advertising products including; Banners, Pop-unders, Sky Scrapers, Search Engine Marketing, Email Marketing, Newsletter Sponsorship, Co-Registration. \n- Hit every monthly goal, and billed more than $1.4 million annually. \n- Maintained an international territory, including the United States, Canada, United Kingdom, Australia and Brazil. \n- Other main duties included; coordination with trafficking to meet specified goals of all campaigns, monitoring and editing campaigns to ensure constant success, maintenance of all accounts for timely payment of services rendered and overall expansion of each account. Senior Account Manager Digital Island Inc, a Cable and Wireless company June 2000  –  January 2002  (1 year 8 months) Greater New York City Area - Sales position for the New York-New Jersey territory. \n- $2.8 million in sales for fiscal year 2001, 103% of overall quota. \n- Analyzed basic network and server configurations to determine the proper service package for client needs. \n- Products sold included: multiple types of web hosting and management services, content delivery, on-demand and live event streaming, as well as dedicated network connectivity. Senior Account Manager Digital Island Inc, a Cable and Wireless company June 2000  –  January 2002  (1 year 8 months) Greater New York City Area - Sales position for the New York-New Jersey territory. \n- $2.8 million in sales for fiscal year 2001, 103% of overall quota. \n- Analyzed basic network and server configurations to determine the proper service package for client needs. \n- Products sold included: multiple types of web hosting and management services, content delivery, on-demand and live event streaming, as well as dedicated network connectivity. Senior Account Executive Qwest Communications May 1999  –  June 2000  (1 year 2 months) Greater New York City Area - Sales position focused mainly on national accounts, though took on various international locations as well. \n- Products sold: dedicated Internet access, dedicated hosting services, equipment and professional services including; site design, application development and consulting. \n- Consistently at 150% of specified sales quota and responsible for $2.7 Million in sales. \n- Personally took on the responsibility of training new sales reps on the more technical side of the product offerings. Senior Account Executive Qwest Communications May 1999  –  June 2000  (1 year 2 months) Greater New York City Area - Sales position focused mainly on national accounts, though took on various international locations as well. \n- Products sold: dedicated Internet access, dedicated hosting services, equipment and professional services including; site design, application development and consulting. \n- Consistently at 150% of specified sales quota and responsible for $2.7 Million in sales. \n- Personally took on the responsibility of training new sales reps on the more technical side of the product offerings. Skills SEM Online Advertising Google Adwords Digital Media Analytics Mobile Advertising Search Advertising PPC Digital Marketing Display Advertising Mobile Marketing Ad Serving Product Management Digital Strategy Ad Networks Google Analytics Web Analytics Strategic Partnerships Social Media Social Media Marketing Product Development Product Marketing Product Launch Product Design Advertising Lead Generation Email Marketing Competitive Analysis Salesforce.com See 14+     See less Skills  SEM Online Advertising Google Adwords Digital Media Analytics Mobile Advertising Search Advertising PPC Digital Marketing Display Advertising Mobile Marketing Ad Serving Product Management Digital Strategy Ad Networks Google Analytics Web Analytics Strategic Partnerships Social Media Social Media Marketing Product Development Product Marketing Product Launch Product Design Advertising Lead Generation Email Marketing Competitive Analysis Salesforce.com See 14+     See less SEM Online Advertising Google Adwords Digital Media Analytics Mobile Advertising Search Advertising PPC Digital Marketing Display Advertising Mobile Marketing Ad Serving Product Management Digital Strategy Ad Networks Google Analytics Web Analytics Strategic Partnerships Social Media Social Media Marketing Product Development Product Marketing Product Launch Product Design Advertising Lead Generation Email Marketing Competitive Analysis Salesforce.com See 14+     See less SEM Online Advertising Google Adwords Digital Media Analytics Mobile Advertising Search Advertising PPC Digital Marketing Display Advertising Mobile Marketing Ad Serving Product Management Digital Strategy Ad Networks Google Analytics Web Analytics Strategic Partnerships Social Media Social Media Marketing Product Development Product Marketing Product Launch Product Design Advertising Lead Generation Email Marketing Competitive Analysis Salesforce.com See 14+     See less Education State University of New York, College at Oswego Bachelor of Science,  Marketing 1993  – 1997 State University of New York, College at Oswego Bachelor of Science,  Marketing 1993  – 1997 State University of New York, College at Oswego Bachelor of Science,  Marketing 1993  – 1997 State University of New York, College at Oswego Bachelor of Science,  Marketing 1993  – 1997 ", "Languages German Native or bilingual proficiency English Full professional proficiency French Limited working proficiency Portuguese Elementary proficiency German Native or bilingual proficiency English Full professional proficiency French Limited working proficiency Portuguese Elementary proficiency German Native or bilingual proficiency English Full professional proficiency French Limited working proficiency Portuguese Elementary proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills Google Adwords Online Marketing Display Advertising Online Advertising Search Advertising SEM Mobile Advertising PPC Mobile Devices Start-ups E-commerce Mobile Marketing Online Lead Generation Analytics Social Media YouTube Social Networking Adsense Affiliate Marketing B2B SEO Google Facebook Local Search Digital Media Digital Strategy CRM software Data Migration Video Advertising Keyword Advertising Web Marketing E-business Landing Page... Media Planning Organic Search Advertising New Trends Twitter Local Marketing CRM Internet Strategy Emerging Markets Middle East CEE German Export I18n Internationalization See 33+     See less Skills  Google Adwords Online Marketing Display Advertising Online Advertising Search Advertising SEM Mobile Advertising PPC Mobile Devices Start-ups E-commerce Mobile Marketing Online Lead Generation Analytics Social Media YouTube Social Networking Adsense Affiliate Marketing B2B SEO Google Facebook Local Search Digital Media Digital Strategy CRM software Data Migration Video Advertising Keyword Advertising Web Marketing E-business Landing Page... Media Planning Organic Search Advertising New Trends Twitter Local Marketing CRM Internet Strategy Emerging Markets Middle East CEE German Export I18n Internationalization See 33+     See less Google Adwords Online Marketing Display Advertising Online Advertising Search Advertising SEM Mobile Advertising PPC Mobile Devices Start-ups E-commerce Mobile Marketing Online Lead Generation Analytics Social Media YouTube Social Networking Adsense Affiliate Marketing B2B SEO Google Facebook Local Search Digital Media Digital Strategy CRM software Data Migration Video Advertising Keyword Advertising Web Marketing E-business Landing Page... Media Planning Organic Search Advertising New Trends Twitter Local Marketing CRM Internet Strategy Emerging Markets Middle East CEE German Export I18n Internationalization See 33+     See less Google Adwords Online Marketing Display Advertising Online Advertising Search Advertising SEM Mobile Advertising PPC Mobile Devices Start-ups E-commerce Mobile Marketing Online Lead Generation Analytics Social Media YouTube Social Networking Adsense Affiliate Marketing B2B SEO Google Facebook Local Search Digital Media Digital Strategy CRM software Data Migration Video Advertising Keyword Advertising Web Marketing E-business Landing Page... Media Planning Organic Search Advertising New Trends Twitter Local Marketing CRM Internet Strategy Emerging Markets Middle East CEE German Export I18n Internationalization See 33+     See less Honors & Awards ", "Experience Audience Product Specialist - Telecom Industry Google July 2015  – Present (2 months) Greater New York City Area Senior Online Sales Account Manager | Digital Marketing Google November 2014  – Present (10 months) Dublin Advising large Travel advertisers and agencies in The Netherlands on Google’s broad range of solutions across Search, Display, Video and Mobile to help them to connect with their audiences online. \n \n• Manage trusted relationships with large Benelux travel clients and develop a thorough understanding of their business challenges \n• Create innovative digital strategies to achieve our customers’ marketing and sales objectives \n• Leverage on this strategic partnership to add value to our ​clients​' business and hence grow their business \n• Constantly think of creative ways to improve our relationships with our clients and grow clients’ revenue \n​• Persuade and advise​ clients of the wider strategic opportunities in relation to S​earch​, Display,​ ​Video, Mobile and ​P​rogrammatic buying \n• Project Management and strategic advice to help our clients to capture and expand international opportunities Online Sales Account Manager at Google Google January 2013  – Present (2 years 8 months) Dublin Online Media Associate Google October 2011  –  January 2013  (1 year 4 months) Dublin Intern Strategic Development Group Strategic Development Group | SDG April 2011  –  September 2011  (6 months) Graduation internship to write my Master thesis in the field of Entrepreneurship and Management \nConsultancy. Sales & Service Advisor Rabobank Tilburg Rabobank Tilburg en omstreken September 2010  –  April 2011  (8 months) Tilburg, The Netherlands Supportive and sales tasks around several projects. Consultant Office for SMEs, Tilburg University Tilburg University June 2010  –  January 2011  (8 months) Marketresearch for Foundation The Consularis, Breda \nResponsible for the execution of a marketresearch in order to give more insights in the needs for (informal) advise among CEO's/major shareholders of medium and large enterprises in the South-Western part of the Netherlands. This marketresearch is combined with an acquisition research in order to increase the awareness of the core business of The Consularis. HRD-manager/ Projectmanager UniPartners Tilburg June 2009  –  September 2010  (1 year 4 months) UniPartners Tilburg is a non-profit academic consultancy firm that conducts project-based (research)assignment for institutions and small and middle sized firms. These projects are conducted by excellent, ambitious students in the last phase of their education at Tilburg University.  \n \nThe mission of UniPartners Tilburg is to offer small and middle sized firms access to current academic knowledge, and on the other side provide students with relevant practical experience by conducting the research and writing a report.  \n \nUniPartners Tilburg works with the principle of 'fixed-price, fixed service'. We will guarantee our quality by means of internal audits, national network, and an advanced quality management system. As being a non-profit organisation, UniPartners Tilburg can guarantee good quality against a competitive price. Studentadvisor Programmeboard International Business Administration Tilburg University January 2010  –  July 2010  (7 months) Studentadvisor of the Programmeboard of the Bachelor International Business Administration and student coordinator. Client Advisor CZ May 2008  –  December 2008  (8 months) Responsible for giving advice to (potential) clients about insurances and solving problems around insurances of existing clients. Selection Responsible/ Marketing manager AIESEC June 2007  –  June 2008  (1 year 1 month) Outgoing Exchange Team: responsible for interviewing potential candidates for an international internship with help of the CORE-method, and coaching students in organising their internship.  \n \nMarketing Team: responsible for the marketingteam and the marketingcampaigns of international programmes like the Ambassadorsprogramme, Global Exchange Program (GEP), NOUR, and the semi-annual recruitmentcampaigns. Officemanager Tilburg StudentsPlus Bijlessen September 2006  –  November 2007  (1 year 3 months) Arbitration between clients and university students in tutoring and coaching. Responsible for marketing, HR, administrative tasks, and problem-solving. Audience Product Specialist - Telecom Industry Google July 2015  – Present (2 months) Greater New York City Area Audience Product Specialist - Telecom Industry Google July 2015  – Present (2 months) Greater New York City Area Senior Online Sales Account Manager | Digital Marketing Google November 2014  – Present (10 months) Dublin Advising large Travel advertisers and agencies in The Netherlands on Google’s broad range of solutions across Search, Display, Video and Mobile to help them to connect with their audiences online. \n \n• Manage trusted relationships with large Benelux travel clients and develop a thorough understanding of their business challenges \n• Create innovative digital strategies to achieve our customers’ marketing and sales objectives \n• Leverage on this strategic partnership to add value to our ​clients​' business and hence grow their business \n• Constantly think of creative ways to improve our relationships with our clients and grow clients’ revenue \n​• Persuade and advise​ clients of the wider strategic opportunities in relation to S​earch​, Display,​ ​Video, Mobile and ​P​rogrammatic buying \n• Project Management and strategic advice to help our clients to capture and expand international opportunities Senior Online Sales Account Manager | Digital Marketing Google November 2014  – Present (10 months) Dublin Advising large Travel advertisers and agencies in The Netherlands on Google’s broad range of solutions across Search, Display, Video and Mobile to help them to connect with their audiences online. \n \n• Manage trusted relationships with large Benelux travel clients and develop a thorough understanding of their business challenges \n• Create innovative digital strategies to achieve our customers’ marketing and sales objectives \n• Leverage on this strategic partnership to add value to our ​clients​' business and hence grow their business \n• Constantly think of creative ways to improve our relationships with our clients and grow clients’ revenue \n​• Persuade and advise​ clients of the wider strategic opportunities in relation to S​earch​, Display,​ ​Video, Mobile and ​P​rogrammatic buying \n• Project Management and strategic advice to help our clients to capture and expand international opportunities Online Sales Account Manager at Google Google January 2013  – Present (2 years 8 months) Dublin Online Sales Account Manager at Google Google January 2013  – Present (2 years 8 months) Dublin Online Media Associate Google October 2011  –  January 2013  (1 year 4 months) Dublin Online Media Associate Google October 2011  –  January 2013  (1 year 4 months) Dublin Intern Strategic Development Group Strategic Development Group | SDG April 2011  –  September 2011  (6 months) Graduation internship to write my Master thesis in the field of Entrepreneurship and Management \nConsultancy. Intern Strategic Development Group Strategic Development Group | SDG April 2011  –  September 2011  (6 months) Graduation internship to write my Master thesis in the field of Entrepreneurship and Management \nConsultancy. Sales & Service Advisor Rabobank Tilburg Rabobank Tilburg en omstreken September 2010  –  April 2011  (8 months) Tilburg, The Netherlands Supportive and sales tasks around several projects. Sales & Service Advisor Rabobank Tilburg Rabobank Tilburg en omstreken September 2010  –  April 2011  (8 months) Tilburg, The Netherlands Supportive and sales tasks around several projects. Consultant Office for SMEs, Tilburg University Tilburg University June 2010  –  January 2011  (8 months) Marketresearch for Foundation The Consularis, Breda \nResponsible for the execution of a marketresearch in order to give more insights in the needs for (informal) advise among CEO's/major shareholders of medium and large enterprises in the South-Western part of the Netherlands. This marketresearch is combined with an acquisition research in order to increase the awareness of the core business of The Consularis. Consultant Office for SMEs, Tilburg University Tilburg University June 2010  –  January 2011  (8 months) Marketresearch for Foundation The Consularis, Breda \nResponsible for the execution of a marketresearch in order to give more insights in the needs for (informal) advise among CEO's/major shareholders of medium and large enterprises in the South-Western part of the Netherlands. This marketresearch is combined with an acquisition research in order to increase the awareness of the core business of The Consularis. HRD-manager/ Projectmanager UniPartners Tilburg June 2009  –  September 2010  (1 year 4 months) UniPartners Tilburg is a non-profit academic consultancy firm that conducts project-based (research)assignment for institutions and small and middle sized firms. These projects are conducted by excellent, ambitious students in the last phase of their education at Tilburg University.  \n \nThe mission of UniPartners Tilburg is to offer small and middle sized firms access to current academic knowledge, and on the other side provide students with relevant practical experience by conducting the research and writing a report.  \n \nUniPartners Tilburg works with the principle of 'fixed-price, fixed service'. We will guarantee our quality by means of internal audits, national network, and an advanced quality management system. As being a non-profit organisation, UniPartners Tilburg can guarantee good quality against a competitive price. HRD-manager/ Projectmanager UniPartners Tilburg June 2009  –  September 2010  (1 year 4 months) UniPartners Tilburg is a non-profit academic consultancy firm that conducts project-based (research)assignment for institutions and small and middle sized firms. These projects are conducted by excellent, ambitious students in the last phase of their education at Tilburg University.  \n \nThe mission of UniPartners Tilburg is to offer small and middle sized firms access to current academic knowledge, and on the other side provide students with relevant practical experience by conducting the research and writing a report.  \n \nUniPartners Tilburg works with the principle of 'fixed-price, fixed service'. We will guarantee our quality by means of internal audits, national network, and an advanced quality management system. As being a non-profit organisation, UniPartners Tilburg can guarantee good quality against a competitive price. Studentadvisor Programmeboard International Business Administration Tilburg University January 2010  –  July 2010  (7 months) Studentadvisor of the Programmeboard of the Bachelor International Business Administration and student coordinator. Studentadvisor Programmeboard International Business Administration Tilburg University January 2010  –  July 2010  (7 months) Studentadvisor of the Programmeboard of the Bachelor International Business Administration and student coordinator. Client Advisor CZ May 2008  –  December 2008  (8 months) Responsible for giving advice to (potential) clients about insurances and solving problems around insurances of existing clients. Client Advisor CZ May 2008  –  December 2008  (8 months) Responsible for giving advice to (potential) clients about insurances and solving problems around insurances of existing clients. Selection Responsible/ Marketing manager AIESEC June 2007  –  June 2008  (1 year 1 month) Outgoing Exchange Team: responsible for interviewing potential candidates for an international internship with help of the CORE-method, and coaching students in organising their internship.  \n \nMarketing Team: responsible for the marketingteam and the marketingcampaigns of international programmes like the Ambassadorsprogramme, Global Exchange Program (GEP), NOUR, and the semi-annual recruitmentcampaigns. Selection Responsible/ Marketing manager AIESEC June 2007  –  June 2008  (1 year 1 month) Outgoing Exchange Team: responsible for interviewing potential candidates for an international internship with help of the CORE-method, and coaching students in organising their internship.  \n \nMarketing Team: responsible for the marketingteam and the marketingcampaigns of international programmes like the Ambassadorsprogramme, Global Exchange Program (GEP), NOUR, and the semi-annual recruitmentcampaigns. Officemanager Tilburg StudentsPlus Bijlessen September 2006  –  November 2007  (1 year 3 months) Arbitration between clients and university students in tutoring and coaching. Responsible for marketing, HR, administrative tasks, and problem-solving. Officemanager Tilburg StudentsPlus Bijlessen September 2006  –  November 2007  (1 year 3 months) Arbitration between clients and university students in tutoring and coaching. Responsible for marketing, HR, administrative tasks, and problem-solving. Languages Dutch Native or bilingual proficiency English Full professional proficiency German Limited working proficiency French Elementary proficiency Dutch Native or bilingual proficiency English Full professional proficiency German Limited working proficiency French Elementary proficiency Dutch Native or bilingual proficiency English Full professional proficiency German Limited working proficiency French Elementary proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills Online Marketing Google Adwords Business Strategy Online Advertising Advertising Sales Teamwork Consultancy E-commerce Consulting Social Media Marketing Strategy International Business Event Management Project Management Digital Marketing Microsoft Office Research Search Advertising Mobile Marketing SPSS (statistical... Marketing Management Management Consulting See 7+     See less Skills  Online Marketing Google Adwords Business Strategy Online Advertising Advertising Sales Teamwork Consultancy E-commerce Consulting Social Media Marketing Strategy International Business Event Management Project Management Digital Marketing Microsoft Office Research Search Advertising Mobile Marketing SPSS (statistical... Marketing Management Management Consulting See 7+     See less Online Marketing Google Adwords Business Strategy Online Advertising Advertising Sales Teamwork Consultancy E-commerce Consulting Social Media Marketing Strategy International Business Event Management Project Management Digital Marketing Microsoft Office Research Search Advertising Mobile Marketing SPSS (statistical... Marketing Management Management Consulting See 7+     See less Online Marketing Google Adwords Business Strategy Online Advertising Advertising Sales Teamwork Consultancy E-commerce Consulting Social Media Marketing Strategy International Business Event Management Project Management Digital Marketing Microsoft Office Research Search Advertising Mobile Marketing SPSS (statistical... Marketing Management Management Consulting See 7+     See less Education Universiteit van Tilburg / Tilburg University MSc,  Strategic Management , Graduated with honors. 2010  – 2011 Master thesis: \"The effect of the entrepreneur's personality on the use of an external management consultant: a quantitative research among Dutch entrepreneurs\".  \n \nGPA: 8.5 (out of 10) Universiteit van Tilburg / Tilburg University BSc,  International Business Administration 2006  – 2009 This business oriented bachelor focuses on teamwork and projects assignments and offers courses in several fields like accounting, finance, marketing, mathematics, and operations. \n \nBachelor thesis subject: \"What is the effect of the integration process on post-merger performance of the firm \". Grade: 8.0 (out of 10). Activities and Societies:  Studentadvisor of the Program Board College Den Hulster VWO Bilingual,  Economics and Society , International Baccalaureate Certificate (English) 2000  – 2006 VWO Bilingual, College Den Hulster, Venlo \nProfile Economics and Society. Optional courses: Management & Organisation and German 2 \nInternational Baccalaureate Certificate (English) Universiteit van Tilburg / Tilburg University MSc,  Strategic Management , Graduated with honors. 2010  – 2011 Master thesis: \"The effect of the entrepreneur's personality on the use of an external management consultant: a quantitative research among Dutch entrepreneurs\".  \n \nGPA: 8.5 (out of 10) Universiteit van Tilburg / Tilburg University MSc,  Strategic Management , Graduated with honors. 2010  – 2011 Master thesis: \"The effect of the entrepreneur's personality on the use of an external management consultant: a quantitative research among Dutch entrepreneurs\".  \n \nGPA: 8.5 (out of 10) Universiteit van Tilburg / Tilburg University MSc,  Strategic Management , Graduated with honors. 2010  – 2011 Master thesis: \"The effect of the entrepreneur's personality on the use of an external management consultant: a quantitative research among Dutch entrepreneurs\".  \n \nGPA: 8.5 (out of 10) Universiteit van Tilburg / Tilburg University BSc,  International Business Administration 2006  – 2009 This business oriented bachelor focuses on teamwork and projects assignments and offers courses in several fields like accounting, finance, marketing, mathematics, and operations. \n \nBachelor thesis subject: \"What is the effect of the integration process on post-merger performance of the firm \". Grade: 8.0 (out of 10). Activities and Societies:  Studentadvisor of the Program Board Universiteit van Tilburg / Tilburg University BSc,  International Business Administration 2006  – 2009 This business oriented bachelor focuses on teamwork and projects assignments and offers courses in several fields like accounting, finance, marketing, mathematics, and operations. \n \nBachelor thesis subject: \"What is the effect of the integration process on post-merger performance of the firm \". Grade: 8.0 (out of 10). Activities and Societies:  Studentadvisor of the Program Board Universiteit van Tilburg / Tilburg University BSc,  International Business Administration 2006  – 2009 This business oriented bachelor focuses on teamwork and projects assignments and offers courses in several fields like accounting, finance, marketing, mathematics, and operations. \n \nBachelor thesis subject: \"What is the effect of the integration process on post-merger performance of the firm \". Grade: 8.0 (out of 10). Activities and Societies:  Studentadvisor of the Program Board College Den Hulster VWO Bilingual,  Economics and Society , International Baccalaureate Certificate (English) 2000  – 2006 VWO Bilingual, College Den Hulster, Venlo \nProfile Economics and Society. Optional courses: Management & Organisation and German 2 \nInternational Baccalaureate Certificate (English) College Den Hulster VWO Bilingual,  Economics and Society , International Baccalaureate Certificate (English) 2000  – 2006 VWO Bilingual, College Den Hulster, Venlo \nProfile Economics and Society. Optional courses: Management & Organisation and German 2 \nInternational Baccalaureate Certificate (English) College Den Hulster VWO Bilingual,  Economics and Society , International Baccalaureate Certificate (English) 2000  – 2006 VWO Bilingual, College Den Hulster, Venlo \nProfile Economics and Society. Optional courses: Management & Organisation and German 2 \nInternational Baccalaureate Certificate (English) Honors & Awards ", "Summary Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Summary Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Sales and Marketing manager with over 10 years of experience in the online industry across multiple international locations. I’m passionate about growing businesses at scale and developing talents.  \n \nI’m currently managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms. Experience Sales and Marketing Manager Google September 2013  – Present (2 years) Singapore I’m managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms.  \n \nI’m responsible to drive business growth through acquisition and engagement of new partners. I develop and implement data-driven strategies by analysing online and offline performance across multiple channels.  \nMy team has consistently exceeded its targets since creation, with a +50% YoY growth. My main responsibilities include Business Development, Marketing, and People Management. I work closely with the senior Google management team across our core APAC markets to plan and deliver on our sales forecast. I also work cross-functionally with our product and engineering teams to constantly improve our solutions by incorporating our partners’ feedback. Acquisition and Support Regional Manager Google April 2012  –  September 2013  (1 year 6 months) Singapore My mission is to enable the growth of online publishers in Asia-Pacific with Google advertising solutions. I manage a regional team of 20+ account managers and specialists based in Beijing, Tokyo, New Delhi, Singapore, Seoul, and Sydney. We are responsible for identifying, acquiring, supporting, and optimising online publishers that represent 70% of Google AdSense revenues in APAC.  \nI also work closely with regional leads in America and EMEA to formulate Google’s international strategy for publishers. \n \nMy achievements include: \n•\tManage 70% of Google AdSense revenues in APAC and enhanced sales processes resulting in 25% year over year growth \n•\tImproved effectiveness of operational team by leveraging online resources to reallocate 20% of our headcounts to revenue-generating activities \n•\tStreamlined workflow and reorganised functions in order to achieve significant gain in efficiency and strengthen our KPIs \n \nResponsibilities: \n•\tManage a growing team of Sales and Relationship Managers (20+ individuals) focused on driving new revenue in 12 markets \n•\tRecruit new team members and provide sales mentorship, performance reviews, and regular feedback \n•\tSupport my team with professional development opportunities and constantly build a talent pipeline \n•\tFormulate and implement the international strategy of Google AdSense \n•\tCollaborate with local marketing teams to budget and execute branding campaigns APAC Acquisition and Support regional lead Google July 2011  –  June 2012  (1 year) Singapore * Leading a team of 20+ people across Google's offices in China, Japan, Australia, India, South East Asia, and Korea ; \n* Defining long term sales strategy ; \n* Measuring and tracking ongoing performances of the business against KPIs. Online Sales & Operations Team Leader Google May 2010  –  July 2011  (1 year 3 months) • Set strategy and Key Performance Indicators (KPIs) for a 20+ person international team. \n• Directly manage people with respect to mentoring, individual KPI setting, feedback and personal and professional development. \n• Increase the effectiveness of staff and tools by recognising opportunities for development and proactively creating new systems and structures. \n• Develop operational metrics to measure the growth and performance of the department, and report on the achievements of my team. \n• Execute projects involving quantitative analysis, industry research and strategy development. \n• Collaborate with leads from other support teams to ensure a consistent support experience. \n• Conduct candidates’ interviews and provide feedback to recruitment teams. Strategist - Online Help Product Specialist Google November 2008  –  June 2010  (1 year 8 months) • Managing and Strategic planning of the implementation of a new Online Support platform. \n• Manager and Owner of worldwide Online Resources and Support Platforms. \n• Webmaster. Senior Associate Google May 2008  –  November 2008  (7 months) • Co-manager of worldwide Online Help Resources and Support Platforms. \n• Manage and grow relationships with Tier 2 publishers, and web site directors. AdSense Account Associate Google November 2006  –  May 2008  (1 year 7 months) • Manage and grow relationships with publishers, web site operators, and E-commerce merchants.  \n• Optimise client accounts in order to maximise their return on investment.  \n• Provide service to Google's clients via the AdSense’s Blog, Forum, Online Help Centre, and email.  \n• Identify innovative ways to improve user experience, and work with product management, marketing and engineering to implement new ideas.  \n• Localise products for the European, Middle Eastern and African markets.  \n• Monitor product performance and analyse feedback from clients and users.  \n• Execute special projects involving quantitative analysis, industry research and strategy development.  \n• Manage AdSense projects and communicate issues across teams and products.  \n• Support the launch of new AdSense product features.  \n• Employ creative solutions to improve workflow, customer support, policy and procedures.  \n• Back up the French YouTube team. Market Specialist Bank of New York 2006  –  2006  (less than a year) • Responsible for day-to-day executions and processes for the Trade Operations group. \n• Processing trades via Online systems. \n• Instructing payments and receipts. \n• Monitoring and resolving fails. \n• Managing claims and trade confirmations \n• Interacting with counterparties on trade inquiries and issues. \n• Maintaining systems with accurate data. Account Manager Peve (European Video Edition Perspective) 2004  –  2006  (2 years) • Organise the annual European Video Edition Conference. \n• Manage members’ relations and subscriptions. \n• Set up a communication strategy through online and off line media. \n• Take care of the smooth development of the Conference. Sales and Marketing Manager Google September 2013  – Present (2 years) Singapore I’m managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms.  \n \nI’m responsible to drive business growth through acquisition and engagement of new partners. I develop and implement data-driven strategies by analysing online and offline performance across multiple channels.  \nMy team has consistently exceeded its targets since creation, with a +50% YoY growth. My main responsibilities include Business Development, Marketing, and People Management. I work closely with the senior Google management team across our core APAC markets to plan and deliver on our sales forecast. I also work cross-functionally with our product and engineering teams to constantly improve our solutions by incorporating our partners’ feedback. Sales and Marketing Manager Google September 2013  – Present (2 years) Singapore I’m managing a $1B+ business for Google with a team of 20+ individuals across North America, Europe, and Asia. We help mobile developers and online publishers grow their business through Google’s advertising platforms.  \n \nI’m responsible to drive business growth through acquisition and engagement of new partners. I develop and implement data-driven strategies by analysing online and offline performance across multiple channels.  \nMy team has consistently exceeded its targets since creation, with a +50% YoY growth. My main responsibilities include Business Development, Marketing, and People Management. I work closely with the senior Google management team across our core APAC markets to plan and deliver on our sales forecast. I also work cross-functionally with our product and engineering teams to constantly improve our solutions by incorporating our partners’ feedback. Acquisition and Support Regional Manager Google April 2012  –  September 2013  (1 year 6 months) Singapore My mission is to enable the growth of online publishers in Asia-Pacific with Google advertising solutions. I manage a regional team of 20+ account managers and specialists based in Beijing, Tokyo, New Delhi, Singapore, Seoul, and Sydney. We are responsible for identifying, acquiring, supporting, and optimising online publishers that represent 70% of Google AdSense revenues in APAC.  \nI also work closely with regional leads in America and EMEA to formulate Google’s international strategy for publishers. \n \nMy achievements include: \n•\tManage 70% of Google AdSense revenues in APAC and enhanced sales processes resulting in 25% year over year growth \n•\tImproved effectiveness of operational team by leveraging online resources to reallocate 20% of our headcounts to revenue-generating activities \n•\tStreamlined workflow and reorganised functions in order to achieve significant gain in efficiency and strengthen our KPIs \n \nResponsibilities: \n•\tManage a growing team of Sales and Relationship Managers (20+ individuals) focused on driving new revenue in 12 markets \n•\tRecruit new team members and provide sales mentorship, performance reviews, and regular feedback \n•\tSupport my team with professional development opportunities and constantly build a talent pipeline \n•\tFormulate and implement the international strategy of Google AdSense \n•\tCollaborate with local marketing teams to budget and execute branding campaigns Acquisition and Support Regional Manager Google April 2012  –  September 2013  (1 year 6 months) Singapore My mission is to enable the growth of online publishers in Asia-Pacific with Google advertising solutions. I manage a regional team of 20+ account managers and specialists based in Beijing, Tokyo, New Delhi, Singapore, Seoul, and Sydney. We are responsible for identifying, acquiring, supporting, and optimising online publishers that represent 70% of Google AdSense revenues in APAC.  \nI also work closely with regional leads in America and EMEA to formulate Google’s international strategy for publishers. \n \nMy achievements include: \n•\tManage 70% of Google AdSense revenues in APAC and enhanced sales processes resulting in 25% year over year growth \n•\tImproved effectiveness of operational team by leveraging online resources to reallocate 20% of our headcounts to revenue-generating activities \n•\tStreamlined workflow and reorganised functions in order to achieve significant gain in efficiency and strengthen our KPIs \n \nResponsibilities: \n•\tManage a growing team of Sales and Relationship Managers (20+ individuals) focused on driving new revenue in 12 markets \n•\tRecruit new team members and provide sales mentorship, performance reviews, and regular feedback \n•\tSupport my team with professional development opportunities and constantly build a talent pipeline \n•\tFormulate and implement the international strategy of Google AdSense \n•\tCollaborate with local marketing teams to budget and execute branding campaigns APAC Acquisition and Support regional lead Google July 2011  –  June 2012  (1 year) Singapore * Leading a team of 20+ people across Google's offices in China, Japan, Australia, India, South East Asia, and Korea ; \n* Defining long term sales strategy ; \n* Measuring and tracking ongoing performances of the business against KPIs. APAC Acquisition and Support regional lead Google July 2011  –  June 2012  (1 year) Singapore * Leading a team of 20+ people across Google's offices in China, Japan, Australia, India, South East Asia, and Korea ; \n* Defining long term sales strategy ; \n* Measuring and tracking ongoing performances of the business against KPIs. Online Sales & Operations Team Leader Google May 2010  –  July 2011  (1 year 3 months) • Set strategy and Key Performance Indicators (KPIs) for a 20+ person international team. \n• Directly manage people with respect to mentoring, individual KPI setting, feedback and personal and professional development. \n• Increase the effectiveness of staff and tools by recognising opportunities for development and proactively creating new systems and structures. \n• Develop operational metrics to measure the growth and performance of the department, and report on the achievements of my team. \n• Execute projects involving quantitative analysis, industry research and strategy development. \n• Collaborate with leads from other support teams to ensure a consistent support experience. \n• Conduct candidates’ interviews and provide feedback to recruitment teams. Online Sales & Operations Team Leader Google May 2010  –  July 2011  (1 year 3 months) • Set strategy and Key Performance Indicators (KPIs) for a 20+ person international team. \n• Directly manage people with respect to mentoring, individual KPI setting, feedback and personal and professional development. \n• Increase the effectiveness of staff and tools by recognising opportunities for development and proactively creating new systems and structures. \n• Develop operational metrics to measure the growth and performance of the department, and report on the achievements of my team. \n• Execute projects involving quantitative analysis, industry research and strategy development. \n• Collaborate with leads from other support teams to ensure a consistent support experience. \n• Conduct candidates’ interviews and provide feedback to recruitment teams. Strategist - Online Help Product Specialist Google November 2008  –  June 2010  (1 year 8 months) • Managing and Strategic planning of the implementation of a new Online Support platform. \n• Manager and Owner of worldwide Online Resources and Support Platforms. \n• Webmaster. Strategist - Online Help Product Specialist Google November 2008  –  June 2010  (1 year 8 months) • Managing and Strategic planning of the implementation of a new Online Support platform. \n• Manager and Owner of worldwide Online Resources and Support Platforms. \n• Webmaster. Senior Associate Google May 2008  –  November 2008  (7 months) • Co-manager of worldwide Online Help Resources and Support Platforms. \n• Manage and grow relationships with Tier 2 publishers, and web site directors. Senior Associate Google May 2008  –  November 2008  (7 months) • Co-manager of worldwide Online Help Resources and Support Platforms. \n• Manage and grow relationships with Tier 2 publishers, and web site directors. AdSense Account Associate Google November 2006  –  May 2008  (1 year 7 months) • Manage and grow relationships with publishers, web site operators, and E-commerce merchants.  \n• Optimise client accounts in order to maximise their return on investment.  \n• Provide service to Google's clients via the AdSense’s Blog, Forum, Online Help Centre, and email.  \n• Identify innovative ways to improve user experience, and work with product management, marketing and engineering to implement new ideas.  \n• Localise products for the European, Middle Eastern and African markets.  \n• Monitor product performance and analyse feedback from clients and users.  \n• Execute special projects involving quantitative analysis, industry research and strategy development.  \n• Manage AdSense projects and communicate issues across teams and products.  \n• Support the launch of new AdSense product features.  \n• Employ creative solutions to improve workflow, customer support, policy and procedures.  \n• Back up the French YouTube team. AdSense Account Associate Google November 2006  –  May 2008  (1 year 7 months) • Manage and grow relationships with publishers, web site operators, and E-commerce merchants.  \n• Optimise client accounts in order to maximise their return on investment.  \n• Provide service to Google's clients via the AdSense’s Blog, Forum, Online Help Centre, and email.  \n• Identify innovative ways to improve user experience, and work with product management, marketing and engineering to implement new ideas.  \n• Localise products for the European, Middle Eastern and African markets.  \n• Monitor product performance and analyse feedback from clients and users.  \n• Execute special projects involving quantitative analysis, industry research and strategy development.  \n• Manage AdSense projects and communicate issues across teams and products.  \n• Support the launch of new AdSense product features.  \n• Employ creative solutions to improve workflow, customer support, policy and procedures.  \n• Back up the French YouTube team. Market Specialist Bank of New York 2006  –  2006  (less than a year) • Responsible for day-to-day executions and processes for the Trade Operations group. \n• Processing trades via Online systems. \n• Instructing payments and receipts. \n• Monitoring and resolving fails. \n• Managing claims and trade confirmations \n• Interacting with counterparties on trade inquiries and issues. \n• Maintaining systems with accurate data. Market Specialist Bank of New York 2006  –  2006  (less than a year) • Responsible for day-to-day executions and processes for the Trade Operations group. \n• Processing trades via Online systems. \n• Instructing payments and receipts. \n• Monitoring and resolving fails. \n• Managing claims and trade confirmations \n• Interacting with counterparties on trade inquiries and issues. \n• Maintaining systems with accurate data. Account Manager Peve (European Video Edition Perspective) 2004  –  2006  (2 years) • Organise the annual European Video Edition Conference. \n• Manage members’ relations and subscriptions. \n• Set up a communication strategy through online and off line media. \n• Take care of the smooth development of the Conference. Account Manager Peve (European Video Edition Perspective) 2004  –  2006  (2 years) • Organise the annual European Video Edition Conference. \n• Manage members’ relations and subscriptions. \n• Set up a communication strategy through online and off line media. \n• Take care of the smooth development of the Conference. Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Skills  Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Online Marketing Management Strategic Partnerships Project Management Analytics Strategy Business Planning Product Marketing Cross-functional Team... Leadership Online Advertising Marketing People Management Program Management Mentoring Graphic Design Customer Service Google Adwords Strategic Planning Sales Enterprise Software Recruiting Web Analytics Vendor Management Customer Relations Web Development Talent Management CRM Mobile Marketing Business Intelligence Mobile Product... Multi-channel Marketing Multi-media Marketing... E-commerce Business Development Start-ups Digital Marketing Product Management Marketing Strategy Advertising Team Leadership Mobile Devices Digital Strategy Analysis Google Analytics Social Media Social Media Marketing See 32+     See less Education Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Collège Saint-Hubert 1993  – 1999 Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Duke University - The Fuqua School of Business Google Business Academy,  Finance ,  Marketing ,  Strategic and Operational Leadership expertise 2014  – 2015 The Google Business Academy is a year-long, Masters-level business leadership program. It's offered in partnership with Duke Corporate Education, whose executive education program has been ranked #1 in the world by Financial Times for 12 consecutive years.  \n \nThe academy includes lectures, live case studies, workshops, and immersive, out-of-classroom activities, all led by renowned industry experts. It aims at helping students act as future leaders within Google by inspiring followership, sharing knowledge, and demonstrating the ability to anticipate and maximize future business opportunities. Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Dublin City University Master of Arts (MA),  International Relations , Second Class Honours 2004  – 2005 Orientation: IT Communication and Development \nThesis: The Democratization Process in Central Africa: Post-conflict Transition and Perspectives of Political Development Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Université libre de Bruxelles Master of Arts (MA),  Communication ,  Marketing ,  and Public Relations , Great Distinction 1999  – 2004 Orientation: Enterprise Communication, Media, Public Relations and Marketing \nDissertation: The European Sugar Industry: Development of a Lobbying Strategy Collège Saint-Hubert 1993  – 1999 Collège Saint-Hubert 1993  – 1999 Collège Saint-Hubert 1993  – 1999 Honors & Awards VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. VP Award Google Vice Presidents May 2009 Rewards accomplishments that are strategic and transformational in nature and provide long-term contributions to the organisation. These contributions require an extraordinary amount of initiative, commitment and collaboration across functions and exemplify Google core values. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. Platinum Award Google Senior Vice President December 2014 Platinum awards recognize empowering leaders whose contributions have strategic and long-term impact to Google. They not only drive the global business but also the Google culture. Their leadership and initiative makes the business, the users, and themselves thrive. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. BeGoogle Award - Better than the Best Google Senior Vice President and Chief Business Officer September 2010 Rewarding those who have gone above and beyond the call of duty and have made a particularly great contribution to their teams and to Google. Nominated by peers and awarded by Vice President. Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Gold awards Directors Received 3 Gold Awards recognising extraordinary performances against sales and customer satisfaction targets.  Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. Peer Awards Peers and Managers Received 47 peer awards rewarding individuals who did something exceptional for their teams, other Googlers or a project. Recognise peers for going above and beyond the call of duty by exhibiting outstanding work ethic, lending a hand during an unforeseen crisis, providing timely and insightful counsel on a project outside of one’s normal job scope, being a great coach and advocate for the team. ", "Experience Team Lead Google January 2014  – Present (1 year 8 months) Mountain View, CA - Lead the Platform Account Managers focussing on the development of the DoubleClick for Publishers (DFP) business, with an annual run rate of $30M.  \n- Define the Platform strategy and oversee execution of the platform business initiatives \n- Lead cross-functional, products as well as regional efforts managing expectations from stakeholders while delivering on key platform initiatives.  \n- Impact platform product development by launching and/or facilitating new and improved solutions for ad serving \n- Manage a portfolio of DFP Premium publishers focussed on building strong business relationships providing insights into holistic business needs. Provide Google solutions across DFP (Small Business and Premium), AdX for Sellers and Buyers, AdSense, Sales Manager, Audience, Video and Mobile. Sr. Account Manager and Product Specialist Google January 2012  –  December 2012  (1 year) Mountain View, California Product Specialist Lead:  \nPSL for core DFP, Audience, Audience Extension, Video and Mobile.  \n1. Collaborate with Product Managers, Engineers and regional Sales heads to expand features and publisher offerings for core DFP and the add-ons Video, Mobile, Audience, Sales Manager and emerging products/features.  \n2.Empower Sales team to sell innovative publisher solutions based on DFP via training on new and existing features, coaching of product use and collaborative partner selling3.  \n3. Collaborate with Product Managers and Engineers to develop the DFP product vision \n \nSr. Account Manager:  \nManaging a portfolio of North American DoubleClick for Publishers Premium accounts in a small, competitive and enthusiastic team within OPG, Google in Mountain View, CA.  \n- Building strong business relationships and advising on the partner's ad serving needs, and providing Google business solutions wherever needed.  \n- Provide consultation on Google Monetization opportunities and other competitive Yield Management solutions.  \n \nOther:  \n- Business Lead, DFP Audience and Audience Extension. Collaborating with Product Managers to expand DFP Audience features and client offerings. \n- Lead, Cross-functional Collaboration. Launch internal engagement model and ensuring that Account Managers are working together on joint accounts to ensure holistic business solutions for each client. Lead Account Manager, OPG Google June 2011  –  January 2012  (8 months) Gurgaon, India Apart from managing my portfolio of priority AdSense accounts in India, I am currently responsible for driving all Account Management activities in OPG India; contributing to over 65% of revenue. This involves preparing the framework for account management, facilitating and measuring progress against different projects that the Account Managers are leading. Account Manager, AdSense Google April 2010  –  May 2011  (1 year 2 months) Handle the AdSense account for 50 high-end publishers in India. The core responsibilities include: \n1. Managed support for all account-related issues. \n2. Identify opportunities in the account to improve monetization.  \n3. Identify and pitch other Google products like AdSense for Search, Games, Video etc, which will cater to all/any of the website requirements. \n \n \nAchievements: \nIndia:  \nManage an AdSense portfolio of over $20M annually consisting of India's largest AdSense and DFP SB publishers; consistently attaining over 150% of revenue and pod targets. \n \nRegional - APAC:  \nAPAC representative for the following global initiatives - Global Taskforce team and the Global CSAT team delivering projects and initiatives from the APAC region while working closely with the Account Managers from 6 APAC countries.  \n \nGlobal: \nIn Q2, 2011, planned and executed the Global Pitch Blast among global Account Managers of priority accounts with the objective to increase sales activity early on in a quarter. A unique method was used to track and rewards optimizations, and the annualized revenue impact has been hugely significant. Scalable Account Management Google January 2010  –  March 2010  (3 months) For one quarter, I handled the mixed responsibilities of a revenue sustaining Policy Specialist as well as a revenue generating SAM role. \nMy core projects included: \n1. Managed support for 10 accounts and provide account-related assistance. \n2. Monitor the performance of all the AdSense accounts, and reach out with one-on-one Optimization pitches to accounts with significant decrease in revenue week over week. \n3. Send out 3 different Optimization bulk email pitches to around 3000 publishers who were carefully selected based on account information. Policy Specialist, AdSense (India and Australia) Google April 2009  –  March 2010  (1 year) Core responsibilities included:  \n1. Ensure all accounts in the India and Australia content network are compliant according to Google policy guidelines.  \n2. Identify and execute scalable process to review websites for policy checks.  \n3. Liaison with the JAPAC Policy team and the Global AdSense Policy team. Execute jointly common objectives for faster turn around time. Account Associate, AdSense Scalable Operations Google December 2007  –  March 2009  (1 year 4 months) Hyderabad Area, India 1. Drove global automation initiative as India Project Lead to reduce manual publisher approval and customized email volume.  \n2. Designed and launched publisher troubleshooters within AdSense Help Center to decrease user dependency on human responses. \n3. Formed the Content Analyst group within AdSense India to collaborate with  \nthe AdWords North America team in Hyderabad to upsell content. Worked with the AdWords pods to develop core packs as an initiative to take advantage of seasonal spike in advertiser spend for top verticals. Account Representative, AdWords Google July 2006  –  November 2007  (1 year 5 months) Hyderabad Area, India Team Lead Google January 2014  – Present (1 year 8 months) Mountain View, CA - Lead the Platform Account Managers focussing on the development of the DoubleClick for Publishers (DFP) business, with an annual run rate of $30M.  \n- Define the Platform strategy and oversee execution of the platform business initiatives \n- Lead cross-functional, products as well as regional efforts managing expectations from stakeholders while delivering on key platform initiatives.  \n- Impact platform product development by launching and/or facilitating new and improved solutions for ad serving \n- Manage a portfolio of DFP Premium publishers focussed on building strong business relationships providing insights into holistic business needs. Provide Google solutions across DFP (Small Business and Premium), AdX for Sellers and Buyers, AdSense, Sales Manager, Audience, Video and Mobile. Team Lead Google January 2014  – Present (1 year 8 months) Mountain View, CA - Lead the Platform Account Managers focussing on the development of the DoubleClick for Publishers (DFP) business, with an annual run rate of $30M.  \n- Define the Platform strategy and oversee execution of the platform business initiatives \n- Lead cross-functional, products as well as regional efforts managing expectations from stakeholders while delivering on key platform initiatives.  \n- Impact platform product development by launching and/or facilitating new and improved solutions for ad serving \n- Manage a portfolio of DFP Premium publishers focussed on building strong business relationships providing insights into holistic business needs. Provide Google solutions across DFP (Small Business and Premium), AdX for Sellers and Buyers, AdSense, Sales Manager, Audience, Video and Mobile. Sr. Account Manager and Product Specialist Google January 2012  –  December 2012  (1 year) Mountain View, California Product Specialist Lead:  \nPSL for core DFP, Audience, Audience Extension, Video and Mobile.  \n1. Collaborate with Product Managers, Engineers and regional Sales heads to expand features and publisher offerings for core DFP and the add-ons Video, Mobile, Audience, Sales Manager and emerging products/features.  \n2.Empower Sales team to sell innovative publisher solutions based on DFP via training on new and existing features, coaching of product use and collaborative partner selling3.  \n3. Collaborate with Product Managers and Engineers to develop the DFP product vision \n \nSr. Account Manager:  \nManaging a portfolio of North American DoubleClick for Publishers Premium accounts in a small, competitive and enthusiastic team within OPG, Google in Mountain View, CA.  \n- Building strong business relationships and advising on the partner's ad serving needs, and providing Google business solutions wherever needed.  \n- Provide consultation on Google Monetization opportunities and other competitive Yield Management solutions.  \n \nOther:  \n- Business Lead, DFP Audience and Audience Extension. Collaborating with Product Managers to expand DFP Audience features and client offerings. \n- Lead, Cross-functional Collaboration. Launch internal engagement model and ensuring that Account Managers are working together on joint accounts to ensure holistic business solutions for each client. Sr. Account Manager and Product Specialist Google January 2012  –  December 2012  (1 year) Mountain View, California Product Specialist Lead:  \nPSL for core DFP, Audience, Audience Extension, Video and Mobile.  \n1. Collaborate with Product Managers, Engineers and regional Sales heads to expand features and publisher offerings for core DFP and the add-ons Video, Mobile, Audience, Sales Manager and emerging products/features.  \n2.Empower Sales team to sell innovative publisher solutions based on DFP via training on new and existing features, coaching of product use and collaborative partner selling3.  \n3. Collaborate with Product Managers and Engineers to develop the DFP product vision \n \nSr. Account Manager:  \nManaging a portfolio of North American DoubleClick for Publishers Premium accounts in a small, competitive and enthusiastic team within OPG, Google in Mountain View, CA.  \n- Building strong business relationships and advising on the partner's ad serving needs, and providing Google business solutions wherever needed.  \n- Provide consultation on Google Monetization opportunities and other competitive Yield Management solutions.  \n \nOther:  \n- Business Lead, DFP Audience and Audience Extension. Collaborating with Product Managers to expand DFP Audience features and client offerings. \n- Lead, Cross-functional Collaboration. Launch internal engagement model and ensuring that Account Managers are working together on joint accounts to ensure holistic business solutions for each client. Lead Account Manager, OPG Google June 2011  –  January 2012  (8 months) Gurgaon, India Apart from managing my portfolio of priority AdSense accounts in India, I am currently responsible for driving all Account Management activities in OPG India; contributing to over 65% of revenue. This involves preparing the framework for account management, facilitating and measuring progress against different projects that the Account Managers are leading. Lead Account Manager, OPG Google June 2011  –  January 2012  (8 months) Gurgaon, India Apart from managing my portfolio of priority AdSense accounts in India, I am currently responsible for driving all Account Management activities in OPG India; contributing to over 65% of revenue. This involves preparing the framework for account management, facilitating and measuring progress against different projects that the Account Managers are leading. Account Manager, AdSense Google April 2010  –  May 2011  (1 year 2 months) Handle the AdSense account for 50 high-end publishers in India. The core responsibilities include: \n1. Managed support for all account-related issues. \n2. Identify opportunities in the account to improve monetization.  \n3. Identify and pitch other Google products like AdSense for Search, Games, Video etc, which will cater to all/any of the website requirements. \n \n \nAchievements: \nIndia:  \nManage an AdSense portfolio of over $20M annually consisting of India's largest AdSense and DFP SB publishers; consistently attaining over 150% of revenue and pod targets. \n \nRegional - APAC:  \nAPAC representative for the following global initiatives - Global Taskforce team and the Global CSAT team delivering projects and initiatives from the APAC region while working closely with the Account Managers from 6 APAC countries.  \n \nGlobal: \nIn Q2, 2011, planned and executed the Global Pitch Blast among global Account Managers of priority accounts with the objective to increase sales activity early on in a quarter. A unique method was used to track and rewards optimizations, and the annualized revenue impact has been hugely significant. Account Manager, AdSense Google April 2010  –  May 2011  (1 year 2 months) Handle the AdSense account for 50 high-end publishers in India. The core responsibilities include: \n1. Managed support for all account-related issues. \n2. Identify opportunities in the account to improve monetization.  \n3. Identify and pitch other Google products like AdSense for Search, Games, Video etc, which will cater to all/any of the website requirements. \n \n \nAchievements: \nIndia:  \nManage an AdSense portfolio of over $20M annually consisting of India's largest AdSense and DFP SB publishers; consistently attaining over 150% of revenue and pod targets. \n \nRegional - APAC:  \nAPAC representative for the following global initiatives - Global Taskforce team and the Global CSAT team delivering projects and initiatives from the APAC region while working closely with the Account Managers from 6 APAC countries.  \n \nGlobal: \nIn Q2, 2011, planned and executed the Global Pitch Blast among global Account Managers of priority accounts with the objective to increase sales activity early on in a quarter. A unique method was used to track and rewards optimizations, and the annualized revenue impact has been hugely significant. Scalable Account Management Google January 2010  –  March 2010  (3 months) For one quarter, I handled the mixed responsibilities of a revenue sustaining Policy Specialist as well as a revenue generating SAM role. \nMy core projects included: \n1. Managed support for 10 accounts and provide account-related assistance. \n2. Monitor the performance of all the AdSense accounts, and reach out with one-on-one Optimization pitches to accounts with significant decrease in revenue week over week. \n3. Send out 3 different Optimization bulk email pitches to around 3000 publishers who were carefully selected based on account information. Scalable Account Management Google January 2010  –  March 2010  (3 months) For one quarter, I handled the mixed responsibilities of a revenue sustaining Policy Specialist as well as a revenue generating SAM role. \nMy core projects included: \n1. Managed support for 10 accounts and provide account-related assistance. \n2. Monitor the performance of all the AdSense accounts, and reach out with one-on-one Optimization pitches to accounts with significant decrease in revenue week over week. \n3. Send out 3 different Optimization bulk email pitches to around 3000 publishers who were carefully selected based on account information. Policy Specialist, AdSense (India and Australia) Google April 2009  –  March 2010  (1 year) Core responsibilities included:  \n1. Ensure all accounts in the India and Australia content network are compliant according to Google policy guidelines.  \n2. Identify and execute scalable process to review websites for policy checks.  \n3. Liaison with the JAPAC Policy team and the Global AdSense Policy team. Execute jointly common objectives for faster turn around time. Policy Specialist, AdSense (India and Australia) Google April 2009  –  March 2010  (1 year) Core responsibilities included:  \n1. Ensure all accounts in the India and Australia content network are compliant according to Google policy guidelines.  \n2. Identify and execute scalable process to review websites for policy checks.  \n3. Liaison with the JAPAC Policy team and the Global AdSense Policy team. Execute jointly common objectives for faster turn around time. Account Associate, AdSense Scalable Operations Google December 2007  –  March 2009  (1 year 4 months) Hyderabad Area, India 1. Drove global automation initiative as India Project Lead to reduce manual publisher approval and customized email volume.  \n2. Designed and launched publisher troubleshooters within AdSense Help Center to decrease user dependency on human responses. \n3. Formed the Content Analyst group within AdSense India to collaborate with  \nthe AdWords North America team in Hyderabad to upsell content. Worked with the AdWords pods to develop core packs as an initiative to take advantage of seasonal spike in advertiser spend for top verticals. Account Associate, AdSense Scalable Operations Google December 2007  –  March 2009  (1 year 4 months) Hyderabad Area, India 1. Drove global automation initiative as India Project Lead to reduce manual publisher approval and customized email volume.  \n2. Designed and launched publisher troubleshooters within AdSense Help Center to decrease user dependency on human responses. \n3. Formed the Content Analyst group within AdSense India to collaborate with  \nthe AdWords North America team in Hyderabad to upsell content. Worked with the AdWords pods to develop core packs as an initiative to take advantage of seasonal spike in advertiser spend for top verticals. Account Representative, AdWords Google July 2006  –  November 2007  (1 year 5 months) Hyderabad Area, India Account Representative, AdWords Google July 2006  –  November 2007  (1 year 5 months) Hyderabad Area, India Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Native or bilingual proficiency Bengali Native or bilingual proficiency Spanish Limited working proficiency Italian Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Native or bilingual proficiency Bengali Native or bilingual proficiency Spanish Limited working proficiency Italian Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Malayalam Native or bilingual proficiency Bengali Native or bilingual proficiency Spanish Limited working proficiency Italian Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less Skills  International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less International Account... Strategic Planning Strategic Account Growth Project Management Influence Without... Customer Retention Interpersonal... Communication Skills C-Level Relationships DoubleClick for... DART for Publishers Adsense Ad Exchanges Google Adwords SEM PPC Display Advertising Google Analytics Digital Marketing Online Advertising Search Digital Strategy Mobile Advertising Mobile Marketing Conversion Optimization Monetization Search Advertising Ad Serving DoubleClick E-commerce Web Analytics Ad Networks Affiliate Marketing Advertising Operations Yahoo Search Marketing Keyword Advertising See 21+     See less Education St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member St. Xavier's College B.Sc,  Economics ,  Mathematics and Statistics 2003  – 2006 Activities and Societies:  Editorial Team member Honors & Awards OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO Recognition Awards Google December 2009 Played a crucial role in stepping up policy in AdSense JAPAC. Streamlined the process of getting special approvals, tier upgrades, tier compliance within faster TAT. Strived beyond available bandwidth to bring better quality network by doing continuous policy checks for AU and IN tier 1 and 2 to ensure that compliance is way above the 98% rate. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO VP Awards Google May 2009 The Global OSO AdSense ATM team achieved huge strides in improving the user experience in 2009. Led a strategic project in the ATM core team to bring about significant changes to the Help Center troubleshooting solutions. The ATM team was able to maintain or increase customer happiness levels around the world. This also led to reallocation of the team members to more strategic revenue-driving activities. OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  OSO Recognition Award OPG, Google August 2011 Organized a Global Pitch Blast competition among 60 global Account Managers for priority accounts.Tracked Impact from the optimizations implemented against the Q2 targets to increase impact from the pitches. Worked closely with the Global OPG Management and POCs, one from each region, in introducing and executing the competition globally. The total Global Annualized Revenue Uplift from pitching early and ensuring early optimizations, was over $35 Million.  ", "Summary Start ups, Marketing, advertising, Psychology, business strategy, technology, debate, building things/disrupting things, consulting, career coaching, sales, Business development, power broker, Production, Humor, and Foodie. Summary Start ups, Marketing, advertising, Psychology, business strategy, technology, debate, building things/disrupting things, consulting, career coaching, sales, Business development, power broker, Production, Humor, and Foodie. Start ups, Marketing, advertising, Psychology, business strategy, technology, debate, building things/disrupting things, consulting, career coaching, sales, Business development, power broker, Production, Humor, and Foodie. Start ups, Marketing, advertising, Psychology, business strategy, technology, debate, building things/disrupting things, consulting, career coaching, sales, Business development, power broker, Production, Humor, and Foodie. Experience Product Brand Manager Google August 2014  – Present (1 year 1 month) New Product Specialist Google August 2012  – Present (3 years 1 month) Greater New York City Area Product Brand Manager Google August 2014  – Present (1 year 1 month) Product Brand Manager Google August 2014  – Present (1 year 1 month) New Product Specialist Google August 2012  – Present (3 years 1 month) Greater New York City Area New Product Specialist Google August 2012  – Present (3 years 1 month) Greater New York City Area Languages Spanish Spanish Spanish Skills Conversational Spanish Dart Sales Manager Salesforce.com Advertising Customer Relations Product Development Research Market Research Spanish Customer Service DART Sales Manager Competitive Analysis Marketing Social Media Social Media Marketing Sales Marketing Strategy Management Leadership Strategy Analysis Online Advertising Digital Marketing Online Marketing Digital Strategy Digital Media Business Development Start-ups See 13+     See less Skills  Conversational Spanish Dart Sales Manager Salesforce.com Advertising Customer Relations Product Development Research Market Research Spanish Customer Service DART Sales Manager Competitive Analysis Marketing Social Media Social Media Marketing Sales Marketing Strategy Management Leadership Strategy Analysis Online Advertising Digital Marketing Online Marketing Digital Strategy Digital Media Business Development Start-ups See 13+     See less Conversational Spanish Dart Sales Manager Salesforce.com Advertising Customer Relations Product Development Research Market Research Spanish Customer Service DART Sales Manager Competitive Analysis Marketing Social Media Social Media Marketing Sales Marketing Strategy Management Leadership Strategy Analysis Online Advertising Digital Marketing Online Marketing Digital Strategy Digital Media Business Development Start-ups See 13+     See less Conversational Spanish Dart Sales Manager Salesforce.com Advertising Customer Relations Product Development Research Market Research Spanish Customer Service DART Sales Manager Competitive Analysis Marketing Social Media Social Media Marketing Sales Marketing Strategy Management Leadership Strategy Analysis Online Advertising Digital Marketing Online Marketing Digital Strategy Digital Media Business Development Start-ups See 13+     See less Education Baruch College, City University of New York (CUNY) Marketing Psychology 2003  – 2008 City University of New York-Baruch College BA 2003  – 2008 Baruch College, City University of New York (CUNY) Marketing Psychology 2003  – 2008 Baruch College, City University of New York (CUNY) Marketing Psychology 2003  – 2008 Baruch College, City University of New York (CUNY) Marketing Psychology 2003  – 2008 City University of New York-Baruch College BA 2003  – 2008 City University of New York-Baruch College BA 2003  – 2008 City University of New York-Baruch College BA 2003  – 2008 Honors & Awards ", "Summary Versatile, results-oriented technology professional; experience in operations, sales, product, and customer care. Successful in software and hardware businesses. Versed in consumer and enterprise ventures (from start-ups to mature products). Summary Versatile, results-oriented technology professional; experience in operations, sales, product, and customer care. Successful in software and hardware businesses. Versed in consumer and enterprise ventures (from start-ups to mature products). Versatile, results-oriented technology professional; experience in operations, sales, product, and customer care. Successful in software and hardware businesses. Versed in consumer and enterprise ventures (from start-ups to mature products). Versatile, results-oriented technology professional; experience in operations, sales, product, and customer care. Successful in software and hardware businesses. Versed in consumer and enterprise ventures (from start-ups to mature products). Experience Senior Product Specialist, Maps Google November 2013  – Present (1 year 10 months) Mountain View, California Global Business Rotation, BufferBox Google October 2013  –  December 2013  (3 months) Kitchener, Canada Area Product Specialist, Maps Google February 2012  –  November 2013  (1 year 10 months) Mountain View, CA Program Manager, Google for Work Google June 2010  –  February 2012  (1 year 9 months) Austin, TX Senior Product Specialist, Maps Google November 2013  – Present (1 year 10 months) Mountain View, California Senior Product Specialist, Maps Google November 2013  – Present (1 year 10 months) Mountain View, California Global Business Rotation, BufferBox Google October 2013  –  December 2013  (3 months) Kitchener, Canada Area Global Business Rotation, BufferBox Google October 2013  –  December 2013  (3 months) Kitchener, Canada Area Product Specialist, Maps Google February 2012  –  November 2013  (1 year 10 months) Mountain View, CA Product Specialist, Maps Google February 2012  –  November 2013  (1 year 10 months) Mountain View, CA Program Manager, Google for Work Google June 2010  –  February 2012  (1 year 9 months) Austin, TX Program Manager, Google for Work Google June 2010  –  February 2012  (1 year 9 months) Austin, TX Skills Salesforce.com SaaS Enterprise Software Product Management Go-to-market Strategy Product Marketing Cloud Computing Competitive Analysis Lead Generation B2B Google Apps Business Strategy Product Development Product Launch Product Quality Taking New Products to... Product Evangelism New Business Development B2C Google Maps Competitive Intelligence Consultative Selling Prospect Research Dashboarding Statistical Reporting Community Development Cross-functional Team... User Experience Mobile Applications Teaching Training Education SQL E-commerce Retail See 20+     See less Skills  Salesforce.com SaaS Enterprise Software Product Management Go-to-market Strategy Product Marketing Cloud Computing Competitive Analysis Lead Generation B2B Google Apps Business Strategy Product Development Product Launch Product Quality Taking New Products to... Product Evangelism New Business Development B2C Google Maps Competitive Intelligence Consultative Selling Prospect Research Dashboarding Statistical Reporting Community Development Cross-functional Team... User Experience Mobile Applications Teaching Training Education SQL E-commerce Retail See 20+     See less Salesforce.com SaaS Enterprise Software Product Management Go-to-market Strategy Product Marketing Cloud Computing Competitive Analysis Lead Generation B2B Google Apps Business Strategy Product Development Product Launch Product Quality Taking New Products to... Product Evangelism New Business Development B2C Google Maps Competitive Intelligence Consultative Selling Prospect Research Dashboarding Statistical Reporting Community Development Cross-functional Team... User Experience Mobile Applications Teaching Training Education SQL E-commerce Retail See 20+     See less Salesforce.com SaaS Enterprise Software Product Management Go-to-market Strategy Product Marketing Cloud Computing Competitive Analysis Lead Generation B2B Google Apps Business Strategy Product Development Product Launch Product Quality Taking New Products to... Product Evangelism New Business Development B2C Google Maps Competitive Intelligence Consultative Selling Prospect Research Dashboarding Statistical Reporting Community Development Cross-functional Team... User Experience Mobile Applications Teaching Training Education SQL E-commerce Retail See 20+     See less Education University of Notre Dame Master's degree 2010 Syracuse University Bachelor of Science (B.S.) 2008 University of Notre Dame Master's degree 2010 University of Notre Dame Master's degree 2010 University of Notre Dame Master's degree 2010 Syracuse University Bachelor of Science (B.S.) 2008 Syracuse University Bachelor of Science (B.S.) 2008 Syracuse University Bachelor of Science (B.S.) 2008 Honors & Awards Additional Honors & Awards Global Renewals/Inside Sales Rep of the Year [Google for Work - 2011] \nAmericas Top Large Customer Sales Associate [Google for Work - 2011] Additional Honors & Awards Global Renewals/Inside Sales Rep of the Year [Google for Work - 2011] \nAmericas Top Large Customer Sales Associate [Google for Work - 2011] Additional Honors & Awards Global Renewals/Inside Sales Rep of the Year [Google for Work - 2011] \nAmericas Top Large Customer Sales Associate [Google for Work - 2011] Additional Honors & Awards Global Renewals/Inside Sales Rep of the Year [Google for Work - 2011] \nAmericas Top Large Customer Sales Associate [Google for Work - 2011] ", "Summary Customer focused and results oriented in a start up environment with expertise in launching products, defining product strategy, advocating for customers and driving product improvements. Passionate about creating and deploying compelling online experiences and thrives on new challenges. Demonstrated ability to work in a rapidly changing environment to get results, motivate colleagues and lead change. Summary Customer focused and results oriented in a start up environment with expertise in launching products, defining product strategy, advocating for customers and driving product improvements. Passionate about creating and deploying compelling online experiences and thrives on new challenges. Demonstrated ability to work in a rapidly changing environment to get results, motivate colleagues and lead change. Customer focused and results oriented in a start up environment with expertise in launching products, defining product strategy, advocating for customers and driving product improvements. Passionate about creating and deploying compelling online experiences and thrives on new challenges. Demonstrated ability to work in a rapidly changing environment to get results, motivate colleagues and lead change. Customer focused and results oriented in a start up environment with expertise in launching products, defining product strategy, advocating for customers and driving product improvements. Passionate about creating and deploying compelling online experiences and thrives on new challenges. Demonstrated ability to work in a rapidly changing environment to get results, motivate colleagues and lead change. Experience Google Fiber - Product Specialist Google September 2012  – Present (3 years) Google Fiber - Guided workflow development for Google Fiber Multi Dwelling Units (MDU) from concept to fully-functional operation. Helped define strategy and launch first MDU successfully.  \n- Planned and launched Community Connections for the first time, serving public institutions with a Gigabit connection.  \n- Worked with Product/Sales teams to formulate strategy for Small and Medium Businesses. Digital Content - Partner Operations Manager Google February 2012  –  September 2012  (8 months) - Lead a team of 7, covering the Digital Content suite of products: Books, Magazines, Currents \n- Engaged with product teams on goal alignment \n- Lead the Product Specialists group across all Partner Operations verticals. Google Books on Play - Operations Specialist Google January 2011  –  February 2012  (1 year 2 months) Mountain View, CA - Managed the initial eBooks launch. \n- Initiated a cross functional effort to improve books quality process. \n- Ran UX study for Magazines on Play. Google News - Specialist, Publisher Operations Google March 2006  –  December 2010  (4 years 10 months) Mountain View, CA - Launched Arabic edition of Google News, helped support French-language launches.  \n- Collaborated on engineering run projects to improve online publisher experience, including UX studies and direct feedback for UI updates. \n- Lead cross-functional initiatives with YouTube, AdSense, Google.org. GORE-TEX Medical Product Specialist Dima Healthcare S.A.R.L. October 2003  –  October 2005  (2 years 1 month) Beirut, Lebanon - Increased local sales by 30% within the first 18 months. \n- Managed sales activity covering the entire Lebanese medical market. \n- Established a strong network among physicians and hospitals. Research Assistant, Intern UNESCO May 2003  –  August 2003  (4 months) Beirut, Lebanon - Contributed to the study on “Knowledge Management Methodology” among Western-Asian countries with Dr. Manuel Rincon at the Industrial Development Office. Google Fiber - Product Specialist Google September 2012  – Present (3 years) Google Fiber - Guided workflow development for Google Fiber Multi Dwelling Units (MDU) from concept to fully-functional operation. Helped define strategy and launch first MDU successfully.  \n- Planned and launched Community Connections for the first time, serving public institutions with a Gigabit connection.  \n- Worked with Product/Sales teams to formulate strategy for Small and Medium Businesses. Google Fiber - Product Specialist Google September 2012  – Present (3 years) Google Fiber - Guided workflow development for Google Fiber Multi Dwelling Units (MDU) from concept to fully-functional operation. Helped define strategy and launch first MDU successfully.  \n- Planned and launched Community Connections for the first time, serving public institutions with a Gigabit connection.  \n- Worked with Product/Sales teams to formulate strategy for Small and Medium Businesses. Digital Content - Partner Operations Manager Google February 2012  –  September 2012  (8 months) - Lead a team of 7, covering the Digital Content suite of products: Books, Magazines, Currents \n- Engaged with product teams on goal alignment \n- Lead the Product Specialists group across all Partner Operations verticals. Digital Content - Partner Operations Manager Google February 2012  –  September 2012  (8 months) - Lead a team of 7, covering the Digital Content suite of products: Books, Magazines, Currents \n- Engaged with product teams on goal alignment \n- Lead the Product Specialists group across all Partner Operations verticals. Google Books on Play - Operations Specialist Google January 2011  –  February 2012  (1 year 2 months) Mountain View, CA - Managed the initial eBooks launch. \n- Initiated a cross functional effort to improve books quality process. \n- Ran UX study for Magazines on Play. Google Books on Play - Operations Specialist Google January 2011  –  February 2012  (1 year 2 months) Mountain View, CA - Managed the initial eBooks launch. \n- Initiated a cross functional effort to improve books quality process. \n- Ran UX study for Magazines on Play. Google News - Specialist, Publisher Operations Google March 2006  –  December 2010  (4 years 10 months) Mountain View, CA - Launched Arabic edition of Google News, helped support French-language launches.  \n- Collaborated on engineering run projects to improve online publisher experience, including UX studies and direct feedback for UI updates. \n- Lead cross-functional initiatives with YouTube, AdSense, Google.org. Google News - Specialist, Publisher Operations Google March 2006  –  December 2010  (4 years 10 months) Mountain View, CA - Launched Arabic edition of Google News, helped support French-language launches.  \n- Collaborated on engineering run projects to improve online publisher experience, including UX studies and direct feedback for UI updates. \n- Lead cross-functional initiatives with YouTube, AdSense, Google.org. GORE-TEX Medical Product Specialist Dima Healthcare S.A.R.L. October 2003  –  October 2005  (2 years 1 month) Beirut, Lebanon - Increased local sales by 30% within the first 18 months. \n- Managed sales activity covering the entire Lebanese medical market. \n- Established a strong network among physicians and hospitals. GORE-TEX Medical Product Specialist Dima Healthcare S.A.R.L. October 2003  –  October 2005  (2 years 1 month) Beirut, Lebanon - Increased local sales by 30% within the first 18 months. \n- Managed sales activity covering the entire Lebanese medical market. \n- Established a strong network among physicians and hospitals. Research Assistant, Intern UNESCO May 2003  –  August 2003  (4 months) Beirut, Lebanon - Contributed to the study on “Knowledge Management Methodology” among Western-Asian countries with Dr. Manuel Rincon at the Industrial Development Office. Research Assistant, Intern UNESCO May 2003  –  August 2003  (4 months) Beirut, Lebanon - Contributed to the study on “Knowledge Management Methodology” among Western-Asian countries with Dr. Manuel Rincon at the Industrial Development Office. Languages French Arabic French Arabic French Arabic Skills E-commerce Google Analytics Start-ups User Experience Project Management Strategic Partnerships Mobile Devices Digital Media Cross-functional Team... Information Architecture Program Management Google Adwords Online Advertising Skills  E-commerce Google Analytics Start-ups User Experience Project Management Strategic Partnerships Mobile Devices Digital Media Cross-functional Team... Information Architecture Program Management Google Adwords Online Advertising E-commerce Google Analytics Start-ups User Experience Project Management Strategic Partnerships Mobile Devices Digital Media Cross-functional Team... Information Architecture Program Management Google Adwords Online Advertising E-commerce Google Analytics Start-ups User Experience Project Management Strategic Partnerships Mobile Devices Digital Media Cross-functional Team... Information Architecture Program Management Google Adwords Online Advertising Education American University of Beirut Bachelors of Business Administration,  Operations and Information Management 2000  – 2003 - Dean’s Honor List student for the academic semesters Fall 2002 and Spring 2003. American University of Beirut Bachelors of Business Administration,  Operations and Information Management 2000  – 2003 - Dean’s Honor List student for the academic semesters Fall 2002 and Spring 2003. American University of Beirut Bachelors of Business Administration,  Operations and Information Management 2000  – 2003 - Dean’s Honor List student for the academic semesters Fall 2002 and Spring 2003. American University of Beirut Bachelors of Business Administration,  Operations and Information Management 2000  – 2003 - Dean’s Honor List student for the academic semesters Fall 2002 and Spring 2003. ", "Summary I manage a team of analysts who are responsible for protecting the integrity of Google's monetized ad networks (AdWords, Doubleclick Ad Exchange, Doubleclick Bid Manager, AdMob, Remarketing) through content review and operational enhancements to ensure ads are safe for users and comply with local laws and regulations. Summary I manage a team of analysts who are responsible for protecting the integrity of Google's monetized ad networks (AdWords, Doubleclick Ad Exchange, Doubleclick Bid Manager, AdMob, Remarketing) through content review and operational enhancements to ensure ads are safe for users and comply with local laws and regulations. I manage a team of analysts who are responsible for protecting the integrity of Google's monetized ad networks (AdWords, Doubleclick Ad Exchange, Doubleclick Bid Manager, AdMob, Remarketing) through content review and operational enhancements to ensure ads are safe for users and comply with local laws and regulations. I manage a team of analysts who are responsible for protecting the integrity of Google's monetized ad networks (AdWords, Doubleclick Ad Exchange, Doubleclick Bid Manager, AdMob, Remarketing) through content review and operational enhancements to ensure ads are safe for users and comply with local laws and regulations. Experience Manager II, Ads Quality Operations Google December 2014  – Present (9 months) Mountain View, CA * Manage a medium size team of analysts responsible for removing fraudulent and non-compliant ads from Google systems through human review and automation initiatives, covering > $40B of ad revenue. Manager, Ads Quality Operations Google June 2012  – Present (3 years 3 months) Mountain View, CA * Manage a medium size team of analysts responsible for removing fraudulent and non-compliant ads from Google systems through human review and automation initiatives, covering > $40B of ad revenue. \n* Operational improvements, in conjunction with engineering teams and global colleagues in India, \nSingapore, Tokyo, China, and Ireland, reduced bad ads by 50% in 2012 while maintaining an error \nrate of < 3%. \n* Collaborate and provide guidance for enforcement support required for launches modifying what \nproducts and services are allowed to be advertised on Google AdWords and Display platforms. \nAssisted with 20+ launches. \n* Mentor team members on projects ranging from programming internal tools to training sales \nteams on advertising policies and support overall career growth. Team Lead, Ads Quality Operations Google September 2010  –  June 2012  (1 year 10 months) Mountain View, CA * Led reorganization of large global team members into project focus areas to support secondary \ngoals of business unit including data analytics, workflow improvements, and programming. \n* Global team awarded VP Award recognizing outstanding contribution toward improving health of ad \nnetwork through 50% reduction of non-compliant ads in 2011. \n* Presented business case to senior Sales and Operational leadership to take policy action on one \nof the largest advertisers in Europe. Spearheaded compliance checks necessary to bring \nadvertiser back into compliance with Google AdWords guidelines, saving millions in revenue. \n* Traveled to India, Singapore, Poland, and Ireland on project work. Product Specialist, Ads Review Google May 2009  –  September 2010  (1 year 5 months) Mountain View, CA * Served as interim Product Manager for Ads Review, the system responsible for the review of \nbillions of ads submitted to AdWords each year. Defined product goals for 200+ engineering and \noperations team spread across 10 global offices and led weekly meeting to discuss key issues \nand review business metrics amongst key engineering and business managers. \n* Led trainings and resolved process issues for ad reviews for enhanced capabilities of AdWords \nplatform. Enhancements enabled previously restricted ads to run in more countries, netting \nmillions in revenue. \n* Wrote product requirement documents for internal review tools, security permissions for advertiser \ndata, and reporting requirements for business analysts \n* Drove quarterly goals for engineering and operations teams. Triaged and prioritized hundreds of new bugs and feature requests. \n* Wrote monthly summary of Ads Review sent to senior executives across company. \n* Wrote Product Requirement Docs for enhanced reporting, workflow operations, and access controls. Strategist, Search Quality Evaluation Google November 2008  –  May 2009  (7 months) Mountain View, CA * Project manager for team’s internal review tool. Set product roadmap and coordinated tool \nimprovements among small team of engineers and analysts in 6 global offices. Directed feature \nimprovements that increased efficiency of work by 30% among a 200+ global team. \n* Awarded with the “Most URLs Rated” award globally in 2009 global team meeting, despite tenure \nof 3+ years fewer than some team members. \n* Actively participated in Google Webmaster Central through posting in the help forum, webmaster central blog and YouTube channel. Associate, Search Quality Evaluation Google October 2007  –  November 2008  (1 year 2 months) Mountain View, CA * Demoed Google Webmaster Tools at Google I/O 2008 attended by experts in search industry. \n* Analyzed webspam to detect and remove malicious results from Google Search index. Research Assistant Martin Luther King, Jr. Research and Education Institute October 2004  –  June 2007  (2 years 9 months) Stanford, CA * Conducted original research on primary and secondary source documents appearing in volume six of the fourteen volume set, “The Papers of Martin Luther King, Jr” and the “King Encyclopedia.” Manager II, Ads Quality Operations Google December 2014  – Present (9 months) Mountain View, CA * Manage a medium size team of analysts responsible for removing fraudulent and non-compliant ads from Google systems through human review and automation initiatives, covering > $40B of ad revenue. Manager II, Ads Quality Operations Google December 2014  – Present (9 months) Mountain View, CA * Manage a medium size team of analysts responsible for removing fraudulent and non-compliant ads from Google systems through human review and automation initiatives, covering > $40B of ad revenue. Manager, Ads Quality Operations Google June 2012  – Present (3 years 3 months) Mountain View, CA * Manage a medium size team of analysts responsible for removing fraudulent and non-compliant ads from Google systems through human review and automation initiatives, covering > $40B of ad revenue. \n* Operational improvements, in conjunction with engineering teams and global colleagues in India, \nSingapore, Tokyo, China, and Ireland, reduced bad ads by 50% in 2012 while maintaining an error \nrate of < 3%. \n* Collaborate and provide guidance for enforcement support required for launches modifying what \nproducts and services are allowed to be advertised on Google AdWords and Display platforms. \nAssisted with 20+ launches. \n* Mentor team members on projects ranging from programming internal tools to training sales \nteams on advertising policies and support overall career growth. Manager, Ads Quality Operations Google June 2012  – Present (3 years 3 months) Mountain View, CA * Manage a medium size team of analysts responsible for removing fraudulent and non-compliant ads from Google systems through human review and automation initiatives, covering > $40B of ad revenue. \n* Operational improvements, in conjunction with engineering teams and global colleagues in India, \nSingapore, Tokyo, China, and Ireland, reduced bad ads by 50% in 2012 while maintaining an error \nrate of < 3%. \n* Collaborate and provide guidance for enforcement support required for launches modifying what \nproducts and services are allowed to be advertised on Google AdWords and Display platforms. \nAssisted with 20+ launches. \n* Mentor team members on projects ranging from programming internal tools to training sales \nteams on advertising policies and support overall career growth. Team Lead, Ads Quality Operations Google September 2010  –  June 2012  (1 year 10 months) Mountain View, CA * Led reorganization of large global team members into project focus areas to support secondary \ngoals of business unit including data analytics, workflow improvements, and programming. \n* Global team awarded VP Award recognizing outstanding contribution toward improving health of ad \nnetwork through 50% reduction of non-compliant ads in 2011. \n* Presented business case to senior Sales and Operational leadership to take policy action on one \nof the largest advertisers in Europe. Spearheaded compliance checks necessary to bring \nadvertiser back into compliance with Google AdWords guidelines, saving millions in revenue. \n* Traveled to India, Singapore, Poland, and Ireland on project work. Team Lead, Ads Quality Operations Google September 2010  –  June 2012  (1 year 10 months) Mountain View, CA * Led reorganization of large global team members into project focus areas to support secondary \ngoals of business unit including data analytics, workflow improvements, and programming. \n* Global team awarded VP Award recognizing outstanding contribution toward improving health of ad \nnetwork through 50% reduction of non-compliant ads in 2011. \n* Presented business case to senior Sales and Operational leadership to take policy action on one \nof the largest advertisers in Europe. Spearheaded compliance checks necessary to bring \nadvertiser back into compliance with Google AdWords guidelines, saving millions in revenue. \n* Traveled to India, Singapore, Poland, and Ireland on project work. Product Specialist, Ads Review Google May 2009  –  September 2010  (1 year 5 months) Mountain View, CA * Served as interim Product Manager for Ads Review, the system responsible for the review of \nbillions of ads submitted to AdWords each year. Defined product goals for 200+ engineering and \noperations team spread across 10 global offices and led weekly meeting to discuss key issues \nand review business metrics amongst key engineering and business managers. \n* Led trainings and resolved process issues for ad reviews for enhanced capabilities of AdWords \nplatform. Enhancements enabled previously restricted ads to run in more countries, netting \nmillions in revenue. \n* Wrote product requirement documents for internal review tools, security permissions for advertiser \ndata, and reporting requirements for business analysts \n* Drove quarterly goals for engineering and operations teams. Triaged and prioritized hundreds of new bugs and feature requests. \n* Wrote monthly summary of Ads Review sent to senior executives across company. \n* Wrote Product Requirement Docs for enhanced reporting, workflow operations, and access controls. Product Specialist, Ads Review Google May 2009  –  September 2010  (1 year 5 months) Mountain View, CA * Served as interim Product Manager for Ads Review, the system responsible for the review of \nbillions of ads submitted to AdWords each year. Defined product goals for 200+ engineering and \noperations team spread across 10 global offices and led weekly meeting to discuss key issues \nand review business metrics amongst key engineering and business managers. \n* Led trainings and resolved process issues for ad reviews for enhanced capabilities of AdWords \nplatform. Enhancements enabled previously restricted ads to run in more countries, netting \nmillions in revenue. \n* Wrote product requirement documents for internal review tools, security permissions for advertiser \ndata, and reporting requirements for business analysts \n* Drove quarterly goals for engineering and operations teams. Triaged and prioritized hundreds of new bugs and feature requests. \n* Wrote monthly summary of Ads Review sent to senior executives across company. \n* Wrote Product Requirement Docs for enhanced reporting, workflow operations, and access controls. Strategist, Search Quality Evaluation Google November 2008  –  May 2009  (7 months) Mountain View, CA * Project manager for team’s internal review tool. Set product roadmap and coordinated tool \nimprovements among small team of engineers and analysts in 6 global offices. Directed feature \nimprovements that increased efficiency of work by 30% among a 200+ global team. \n* Awarded with the “Most URLs Rated” award globally in 2009 global team meeting, despite tenure \nof 3+ years fewer than some team members. \n* Actively participated in Google Webmaster Central through posting in the help forum, webmaster central blog and YouTube channel. Strategist, Search Quality Evaluation Google November 2008  –  May 2009  (7 months) Mountain View, CA * Project manager for team’s internal review tool. Set product roadmap and coordinated tool \nimprovements among small team of engineers and analysts in 6 global offices. Directed feature \nimprovements that increased efficiency of work by 30% among a 200+ global team. \n* Awarded with the “Most URLs Rated” award globally in 2009 global team meeting, despite tenure \nof 3+ years fewer than some team members. \n* Actively participated in Google Webmaster Central through posting in the help forum, webmaster central blog and YouTube channel. Associate, Search Quality Evaluation Google October 2007  –  November 2008  (1 year 2 months) Mountain View, CA * Demoed Google Webmaster Tools at Google I/O 2008 attended by experts in search industry. \n* Analyzed webspam to detect and remove malicious results from Google Search index. Associate, Search Quality Evaluation Google October 2007  –  November 2008  (1 year 2 months) Mountain View, CA * Demoed Google Webmaster Tools at Google I/O 2008 attended by experts in search industry. \n* Analyzed webspam to detect and remove malicious results from Google Search index. Research Assistant Martin Luther King, Jr. Research and Education Institute October 2004  –  June 2007  (2 years 9 months) Stanford, CA * Conducted original research on primary and secondary source documents appearing in volume six of the fourteen volume set, “The Papers of Martin Luther King, Jr” and the “King Encyclopedia.” Research Assistant Martin Luther King, Jr. Research and Education Institute October 2004  –  June 2007  (2 years 9 months) Stanford, CA * Conducted original research on primary and secondary source documents appearing in volume six of the fourteen volume set, “The Papers of Martin Luther King, Jr” and the “King Encyclopedia.” Skills Product Management Data Analysis Google Adwords Online Advertising Search Team Management Management Google Analytics Project Management Advertising Leadership Analytics Product Development Cross-functional Team... Skills  Product Management Data Analysis Google Adwords Online Advertising Search Team Management Management Google Analytics Project Management Advertising Leadership Analytics Product Development Cross-functional Team... Product Management Data Analysis Google Adwords Online Advertising Search Team Management Management Google Analytics Project Management Advertising Leadership Analytics Product Development Cross-functional Team... Product Management Data Analysis Google Adwords Online Advertising Search Team Management Management Google Analytics Project Management Advertising Leadership Analytics Product Development Cross-functional Team... Education University of California, Berkeley - Walter A. Haas School of Business 2013  – 2016 Stanford University BA,  History and Asian American Studies 2003  – 2007 Graduated with Honors, with Distinction \n \nThesis: Return, Rebuild, and Redevelop: Japanese American Resettlement in San Francisco, 1945-1958, received James Birdsall Weter Prize for Best History Honors Thesis. \n \nResident Assistant, Summer Research College and Lantana, 6/06-6/07 - Worked with a team of eight staff members in a 110-student, upper-class dorm. \n \nRecipient of Undergraduate Research Major Grant, the largest undergraduate grant Stanford offers. University of California, Berkeley - Walter A. Haas School of Business 2013  – 2016 University of California, Berkeley - Walter A. Haas School of Business 2013  – 2016 University of California, Berkeley - Walter A. Haas School of Business 2013  – 2016 Stanford University BA,  History and Asian American Studies 2003  – 2007 Graduated with Honors, with Distinction \n \nThesis: Return, Rebuild, and Redevelop: Japanese American Resettlement in San Francisco, 1945-1958, received James Birdsall Weter Prize for Best History Honors Thesis. \n \nResident Assistant, Summer Research College and Lantana, 6/06-6/07 - Worked with a team of eight staff members in a 110-student, upper-class dorm. \n \nRecipient of Undergraduate Research Major Grant, the largest undergraduate grant Stanford offers. Stanford University BA,  History and Asian American Studies 2003  – 2007 Graduated with Honors, with Distinction \n \nThesis: Return, Rebuild, and Redevelop: Japanese American Resettlement in San Francisco, 1945-1958, received James Birdsall Weter Prize for Best History Honors Thesis. \n \nResident Assistant, Summer Research College and Lantana, 6/06-6/07 - Worked with a team of eight staff members in a 110-student, upper-class dorm. \n \nRecipient of Undergraduate Research Major Grant, the largest undergraduate grant Stanford offers. Stanford University BA,  History and Asian American Studies 2003  – 2007 Graduated with Honors, with Distinction \n \nThesis: Return, Rebuild, and Redevelop: Japanese American Resettlement in San Francisco, 1945-1958, received James Birdsall Weter Prize for Best History Honors Thesis. \n \nResident Assistant, Summer Research College and Lantana, 6/06-6/07 - Worked with a team of eight staff members in a 110-student, upper-class dorm. \n \nRecipient of Undergraduate Research Major Grant, the largest undergraduate grant Stanford offers. Honors & Awards Additional Honors & Awards a hodgepodge of various internal awards at Google \n \nJames Birdsall Weter Prize for Best History Honors Thesis, Stanford University 2007 Additional Honors & Awards a hodgepodge of various internal awards at Google \n \nJames Birdsall Weter Prize for Best History Honors Thesis, Stanford University 2007 Additional Honors & Awards a hodgepodge of various internal awards at Google \n \nJames Birdsall Weter Prize for Best History Honors Thesis, Stanford University 2007 Additional Honors & Awards a hodgepodge of various internal awards at Google \n \nJames Birdsall Weter Prize for Best History Honors Thesis, Stanford University 2007 ", "Experience Senior Product Specialist, Google Grants Google July 2010  – Present (5 years 2 months) Mountain View Google Grants is a unique in-kind donation program awarding free AdWords advertising to select charitable organizations. We support organizations sharing our philosophy of community service to help the world in areas such as science and technology, education, global public health, the environment, youth advocacy, and the arts. Google Product Marketing - Get Your Business Online (20% Role) Google October 2012  – Present (2 years 11 months) Mountain View, CA Building an online presence is critical for growing businesses. Google's Get Your Business Online initiative makes it fast, easy and free for businesses to get online. Senior Display Specialist Google 2007  –  2010  (3 years) Mountain View, CA The Display Network reaches 83% of unique Internet users around the world, including people speaking more than 30 languages in over 100 countries. The Display team works closely with AdWords advertisers to drive sales growth and to maximize their return on investment by targeting ads to relevant sites. Account Strategist, AdWords Google 2004  –  2007  (3 years) Mountain View, CA Account Coordinator, AdWords Google 2003  –  2004  (1 year) Strategic Marketing Intern KQED 2002  –  2002  (less than a year) KQED delivers the nation's most-watched public television station, the most-listened-to public radio station, interactive content for digital platforms and mobile devices, and an Education Network that reaches more than 200,000 Bay Area residents a year. Senior Product Specialist, Google Grants Google July 2010  – Present (5 years 2 months) Mountain View Google Grants is a unique in-kind donation program awarding free AdWords advertising to select charitable organizations. We support organizations sharing our philosophy of community service to help the world in areas such as science and technology, education, global public health, the environment, youth advocacy, and the arts. Senior Product Specialist, Google Grants Google July 2010  – Present (5 years 2 months) Mountain View Google Grants is a unique in-kind donation program awarding free AdWords advertising to select charitable organizations. We support organizations sharing our philosophy of community service to help the world in areas such as science and technology, education, global public health, the environment, youth advocacy, and the arts. Google Product Marketing - Get Your Business Online (20% Role) Google October 2012  – Present (2 years 11 months) Mountain View, CA Building an online presence is critical for growing businesses. Google's Get Your Business Online initiative makes it fast, easy and free for businesses to get online. Google Product Marketing - Get Your Business Online (20% Role) Google October 2012  – Present (2 years 11 months) Mountain View, CA Building an online presence is critical for growing businesses. Google's Get Your Business Online initiative makes it fast, easy and free for businesses to get online. Senior Display Specialist Google 2007  –  2010  (3 years) Mountain View, CA The Display Network reaches 83% of unique Internet users around the world, including people speaking more than 30 languages in over 100 countries. The Display team works closely with AdWords advertisers to drive sales growth and to maximize their return on investment by targeting ads to relevant sites. Senior Display Specialist Google 2007  –  2010  (3 years) Mountain View, CA The Display Network reaches 83% of unique Internet users around the world, including people speaking more than 30 languages in over 100 countries. The Display team works closely with AdWords advertisers to drive sales growth and to maximize their return on investment by targeting ads to relevant sites. Account Strategist, AdWords Google 2004  –  2007  (3 years) Mountain View, CA Account Strategist, AdWords Google 2004  –  2007  (3 years) Mountain View, CA Account Coordinator, AdWords Google 2003  –  2004  (1 year) Account Coordinator, AdWords Google 2003  –  2004  (1 year) Strategic Marketing Intern KQED 2002  –  2002  (less than a year) KQED delivers the nation's most-watched public television station, the most-listened-to public radio station, interactive content for digital platforms and mobile devices, and an Education Network that reaches more than 200,000 Bay Area residents a year. Strategic Marketing Intern KQED 2002  –  2002  (less than a year) KQED delivers the nation's most-watched public television station, the most-listened-to public radio station, interactive content for digital platforms and mobile devices, and an Education Network that reaches more than 200,000 Bay Area residents a year. Languages English Native or bilingual proficiency Vietnamese Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Vietnamese Professional working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Vietnamese Professional working proficiency Spanish Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Google Adwords Search Advertising SEM PPC Online Advertising Display Advertising Google Analytics Digital Marketing Web Analytics Analytics Digital Strategy Digital Media Non-profits Nonprofit Technology Product Development Product Design Operations Management Program Management Program Development Marketing Strategy Marketing Communications Conversion Optimization Account Optimization Social Media Marketing Marketing Blogging Web Marketing Mobile Devices Online Marketing See 14+     See less Skills  Google Adwords Search Advertising SEM PPC Online Advertising Display Advertising Google Analytics Digital Marketing Web Analytics Analytics Digital Strategy Digital Media Non-profits Nonprofit Technology Product Development Product Design Operations Management Program Management Program Development Marketing Strategy Marketing Communications Conversion Optimization Account Optimization Social Media Marketing Marketing Blogging Web Marketing Mobile Devices Online Marketing See 14+     See less Google Adwords Search Advertising SEM PPC Online Advertising Display Advertising Google Analytics Digital Marketing Web Analytics Analytics Digital Strategy Digital Media Non-profits Nonprofit Technology Product Development Product Design Operations Management Program Management Program Development Marketing Strategy Marketing Communications Conversion Optimization Account Optimization Social Media Marketing Marketing Blogging Web Marketing Mobile Devices Online Marketing See 14+     See less Google Adwords Search Advertising SEM PPC Online Advertising Display Advertising Google Analytics Digital Marketing Web Analytics Analytics Digital Strategy Digital Media Non-profits Nonprofit Technology Product Development Product Design Operations Management Program Management Program Development Marketing Strategy Marketing Communications Conversion Optimization Account Optimization Social Media Marketing Marketing Blogging Web Marketing Mobile Devices Online Marketing See 14+     See less Education Cal Poly San Luis Obispo Bachelor of Science,  Marketing and Advertising Cal Poly San Luis Obispo Bachelor of Science,  Marketing and Advertising Cal Poly San Luis Obispo Bachelor of Science,  Marketing and Advertising Cal Poly San Luis Obispo Bachelor of Science,  Marketing and Advertising Honors & Awards Google VP OSO Award Creating and growing the Google Display team Google OSO Recognition Award Awarded for developing innovative online advertising strategies and tools for AdWords advertisers \n Additional Honors & Awards Google • Peer Recognition Bonuses \n• Spot bonuses for outstanding achievement Google VP OSO Award Creating and growing the Google Display team Google VP OSO Award Creating and growing the Google Display team Google VP OSO Award Creating and growing the Google Display team Google OSO Recognition Award Awarded for developing innovative online advertising strategies and tools for AdWords advertisers \n Google OSO Recognition Award Awarded for developing innovative online advertising strategies and tools for AdWords advertisers \n Google OSO Recognition Award Awarded for developing innovative online advertising strategies and tools for AdWords advertisers \n Additional Honors & Awards Google • Peer Recognition Bonuses \n• Spot bonuses for outstanding achievement Additional Honors & Awards Google • Peer Recognition Bonuses \n• Spot bonuses for outstanding achievement Additional Honors & Awards Google • Peer Recognition Bonuses \n• Spot bonuses for outstanding achievement ", "Summary Sohail Singh is a long time Googler who has worked on shaping the evolution of Google’s products as a product specialist involved in multiple product areas. Sohail has years of experience in launching both Hardware & Software products in the Asia pacific region and was involved in the early days of multiple product areas. In his current position at Google, Singapore he works on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast. Sohail is a geek who loves technology and is very passionate about the possibilities that the internet creates.  \n \nHe has delivered invited guest lecturers at various business schools on digital marketing and the ways by which the internet is impacting how we work, communicate and live.  \n \n Summary Sohail Singh is a long time Googler who has worked on shaping the evolution of Google’s products as a product specialist involved in multiple product areas. Sohail has years of experience in launching both Hardware & Software products in the Asia pacific region and was involved in the early days of multiple product areas. In his current position at Google, Singapore he works on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast. Sohail is a geek who loves technology and is very passionate about the possibilities that the internet creates.  \n \nHe has delivered invited guest lecturers at various business schools on digital marketing and the ways by which the internet is impacting how we work, communicate and live.  \n \n Sohail Singh is a long time Googler who has worked on shaping the evolution of Google’s products as a product specialist involved in multiple product areas. Sohail has years of experience in launching both Hardware & Software products in the Asia pacific region and was involved in the early days of multiple product areas. In his current position at Google, Singapore he works on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast. Sohail is a geek who loves technology and is very passionate about the possibilities that the internet creates.  \n \nHe has delivered invited guest lecturers at various business schools on digital marketing and the ways by which the internet is impacting how we work, communicate and live.  \n \n Sohail Singh is a long time Googler who has worked on shaping the evolution of Google’s products as a product specialist involved in multiple product areas. Sohail has years of experience in launching both Hardware & Software products in the Asia pacific region and was involved in the early days of multiple product areas. In his current position at Google, Singapore he works on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast. Sohail is a geek who loves technology and is very passionate about the possibilities that the internet creates.  \n \nHe has delivered invited guest lecturers at various business schools on digital marketing and the ways by which the internet is impacting how we work, communicate and live.  \n \n Experience APAC Program Manager, Google Devices Google January 2015  – Present (8 months) Singapore I work on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast.  Lead Product Specialist, Asia Pacific Google August 2011  –  December 2014  (3 years 5 months) Singapore Lead one of the product focus areas (internal Systems) for APAC. Product portfolio includes Development and Deployment of Google's inhouse CRM solution, advertiser support products and billing solutions. Role involves working cross functionally to guarantee sales readiness for product launches & ensuring standardized roll-out of Google’s internal systems in collaboration with Product Management, Engineering, Marketing and Sales Operations. Includes but not limited to tracking product launch success and analyzing key product and process obstacles to adoption Country Product Specialist, India Google June 2010  –  July 2011  (1 year 2 months) New Delhi Area, India Worked as the country Product Specialist for the India facing business. Responsible for prioritization and launch of all B2B products in India. Cross functional engagement with India leadership, marketing and sales operations to formulate country product & launch strategy for B2B(AdWords) products.  \n \nResponsibilities included ensuring advertiser-centric product development by working in collaboration with Product & Engineering teams inorder to enable Sales teams to achieve revenue goals through commercially successful launches. Served as Product Expert and consultant for Sales teams. Product Specialist Google August 2008  –  June 2010  (1 year 11 months) Gurgaon, India Represented India as the Product Specialist for Optimization (SEM) products available to both Clients and Google's sales teams. Functioned as both product and workflow consultant for sales teams, responsibilities included acting as a product expert within the AdWords area operations group, and work integrally with Google's product management and engineering teams to help shape the evolution of AdWords products. \n \nProduct portfolio included AdWords Opportunity center, AdWords editor, keyword tool and various internal optimization tools. Product Specialist Ambassador Google April 2008  –  July 2008  (4 months) Dublin, Ireland Worked closely with the Product Specialist team for EMEA operations. Product Focus was the AdWords helpcenter, where I worked with the engg & PM teams to improve the helpcenter. Responsibilities included competitor analysis, feature request prioritization and launch.  \n \nWorked on designing and implementing scalable support solutions that were integrated on the help center. AdWords Account Strategist Google May 2007  –  March 2008  (11 months) Gurgaon, India Part of the Google sales team with a mission to support and grow AdWords customers inorder to help them realize their marketing goals via Google AdWords. \n \nDesign and implement advertising strategies focussed on business profitability, product range extension, and optimizing client marketing spend. APAC Program Manager, Google Devices Google January 2015  – Present (8 months) Singapore I work on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast.  APAC Program Manager, Google Devices Google January 2015  – Present (8 months) Singapore I work on launching Google hardware products across the Asia pacific region which includes but is not limited to Nexus Phones, chromebooks and chromecast.  Lead Product Specialist, Asia Pacific Google August 2011  –  December 2014  (3 years 5 months) Singapore Lead one of the product focus areas (internal Systems) for APAC. Product portfolio includes Development and Deployment of Google's inhouse CRM solution, advertiser support products and billing solutions. Role involves working cross functionally to guarantee sales readiness for product launches & ensuring standardized roll-out of Google’s internal systems in collaboration with Product Management, Engineering, Marketing and Sales Operations. Includes but not limited to tracking product launch success and analyzing key product and process obstacles to adoption Lead Product Specialist, Asia Pacific Google August 2011  –  December 2014  (3 years 5 months) Singapore Lead one of the product focus areas (internal Systems) for APAC. Product portfolio includes Development and Deployment of Google's inhouse CRM solution, advertiser support products and billing solutions. Role involves working cross functionally to guarantee sales readiness for product launches & ensuring standardized roll-out of Google’s internal systems in collaboration with Product Management, Engineering, Marketing and Sales Operations. Includes but not limited to tracking product launch success and analyzing key product and process obstacles to adoption Country Product Specialist, India Google June 2010  –  July 2011  (1 year 2 months) New Delhi Area, India Worked as the country Product Specialist for the India facing business. Responsible for prioritization and launch of all B2B products in India. Cross functional engagement with India leadership, marketing and sales operations to formulate country product & launch strategy for B2B(AdWords) products.  \n \nResponsibilities included ensuring advertiser-centric product development by working in collaboration with Product & Engineering teams inorder to enable Sales teams to achieve revenue goals through commercially successful launches. Served as Product Expert and consultant for Sales teams. Country Product Specialist, India Google June 2010  –  July 2011  (1 year 2 months) New Delhi Area, India Worked as the country Product Specialist for the India facing business. Responsible for prioritization and launch of all B2B products in India. Cross functional engagement with India leadership, marketing and sales operations to formulate country product & launch strategy for B2B(AdWords) products.  \n \nResponsibilities included ensuring advertiser-centric product development by working in collaboration with Product & Engineering teams inorder to enable Sales teams to achieve revenue goals through commercially successful launches. Served as Product Expert and consultant for Sales teams. Product Specialist Google August 2008  –  June 2010  (1 year 11 months) Gurgaon, India Represented India as the Product Specialist for Optimization (SEM) products available to both Clients and Google's sales teams. Functioned as both product and workflow consultant for sales teams, responsibilities included acting as a product expert within the AdWords area operations group, and work integrally with Google's product management and engineering teams to help shape the evolution of AdWords products. \n \nProduct portfolio included AdWords Opportunity center, AdWords editor, keyword tool and various internal optimization tools. Product Specialist Google August 2008  –  June 2010  (1 year 11 months) Gurgaon, India Represented India as the Product Specialist for Optimization (SEM) products available to both Clients and Google's sales teams. Functioned as both product and workflow consultant for sales teams, responsibilities included acting as a product expert within the AdWords area operations group, and work integrally with Google's product management and engineering teams to help shape the evolution of AdWords products. \n \nProduct portfolio included AdWords Opportunity center, AdWords editor, keyword tool and various internal optimization tools. Product Specialist Ambassador Google April 2008  –  July 2008  (4 months) Dublin, Ireland Worked closely with the Product Specialist team for EMEA operations. Product Focus was the AdWords helpcenter, where I worked with the engg & PM teams to improve the helpcenter. Responsibilities included competitor analysis, feature request prioritization and launch.  \n \nWorked on designing and implementing scalable support solutions that were integrated on the help center. Product Specialist Ambassador Google April 2008  –  July 2008  (4 months) Dublin, Ireland Worked closely with the Product Specialist team for EMEA operations. Product Focus was the AdWords helpcenter, where I worked with the engg & PM teams to improve the helpcenter. Responsibilities included competitor analysis, feature request prioritization and launch.  \n \nWorked on designing and implementing scalable support solutions that were integrated on the help center. AdWords Account Strategist Google May 2007  –  March 2008  (11 months) Gurgaon, India Part of the Google sales team with a mission to support and grow AdWords customers inorder to help them realize their marketing goals via Google AdWords. \n \nDesign and implement advertising strategies focussed on business profitability, product range extension, and optimizing client marketing spend. AdWords Account Strategist Google May 2007  –  March 2008  (11 months) Gurgaon, India Part of the Google sales team with a mission to support and grow AdWords customers inorder to help them realize their marketing goals via Google AdWords. \n \nDesign and implement advertising strategies focussed on business profitability, product range extension, and optimizing client marketing spend. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Management CRM Product Launch Internet Strategy Online Advertising Product Development Product Strategies Production Deployment Product Marketing Search Engine Technology Business Strategy E-commerce Consulting Cross-functional Team... Integrated Marketing Internet Product... Cross Cultural... CPFR Strategic Planning Public Speaking See 4+     See less Skills  Product Management CRM Product Launch Internet Strategy Online Advertising Product Development Product Strategies Production Deployment Product Marketing Search Engine Technology Business Strategy E-commerce Consulting Cross-functional Team... Integrated Marketing Internet Product... Cross Cultural... CPFR Strategic Planning Public Speaking See 4+     See less Product Management CRM Product Launch Internet Strategy Online Advertising Product Development Product Strategies Production Deployment Product Marketing Search Engine Technology Business Strategy E-commerce Consulting Cross-functional Team... Integrated Marketing Internet Product... Cross Cultural... CPFR Strategic Planning Public Speaking See 4+     See less Product Management CRM Product Launch Internet Strategy Online Advertising Product Development Product Strategies Production Deployment Product Marketing Search Engine Technology Business Strategy E-commerce Consulting Cross-functional Team... Integrated Marketing Internet Product... Cross Cultural... CPFR Strategic Planning Public Speaking See 4+     See less Education Indian Institute of Management (IIM), Calcutta Executive MBA,  Sales & Marketing 2010  – 2011 Delhi University B.com,  Commerce 2005  – 2007 Indian Institute of Management (IIM), Calcutta Executive MBA,  Sales & Marketing 2010  – 2011 Indian Institute of Management (IIM), Calcutta Executive MBA,  Sales & Marketing 2010  – 2011 Indian Institute of Management (IIM), Calcutta Executive MBA,  Sales & Marketing 2010  – 2011 Delhi University B.com,  Commerce 2005  – 2007 Delhi University B.com,  Commerce 2005  – 2007 Delhi University B.com,  Commerce 2005  – 2007 ", "Languages English Native or bilingual proficiency Polish Native or bilingual proficiency German Full professional proficiency Portuguese Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency German Full professional proficiency Portuguese Elementary proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency German Full professional proficiency Portuguese Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Google Adwords Advertising Google Analytics SEM Online Marketing Adsense Online Advertising Social Media New Media PPC Web Analytics Marketing Mobile Advertising Mobile Marketing Marketing Communications Search Advertising Digital Strategy E-commerce Display Advertising Conversion Optimization Digital Marketing SEO Business Strategy Marketing Strategy See 9+     See less Skills  Google Adwords Advertising Google Analytics SEM Online Marketing Adsense Online Advertising Social Media New Media PPC Web Analytics Marketing Mobile Advertising Mobile Marketing Marketing Communications Search Advertising Digital Strategy E-commerce Display Advertising Conversion Optimization Digital Marketing SEO Business Strategy Marketing Strategy See 9+     See less Google Adwords Advertising Google Analytics SEM Online Marketing Adsense Online Advertising Social Media New Media PPC Web Analytics Marketing Mobile Advertising Mobile Marketing Marketing Communications Search Advertising Digital Strategy E-commerce Display Advertising Conversion Optimization Digital Marketing SEO Business Strategy Marketing Strategy See 9+     See less Google Adwords Advertising Google Analytics SEM Online Marketing Adsense Online Advertising Social Media New Media PPC Web Analytics Marketing Mobile Advertising Mobile Marketing Marketing Communications Search Advertising Digital Strategy E-commerce Display Advertising Conversion Optimization Digital Marketing SEO Business Strategy Marketing Strategy See 9+     See less Honors & Awards Google Platinum award Recognized for managing the global program helping SMB publishers to adapt to the multi-screen reality. Google Platinum award Recognized for leading publisher team migration to Google new customer interaction system.  Google Gold award Recognized for creating business intelligence tools that helped improving customer satisfaction. Runner up in the competition for the Best Thesis about Digital Marketing in 2011 IAB Poland Thesis: “Digital Mom” -Marketing communications with online communities.  Google Platinum award Recognized for managing the global program helping SMB publishers to adapt to the multi-screen reality. Google Platinum award Recognized for managing the global program helping SMB publishers to adapt to the multi-screen reality. Google Platinum award Recognized for managing the global program helping SMB publishers to adapt to the multi-screen reality. Google Platinum award Recognized for leading publisher team migration to Google new customer interaction system.  Google Platinum award Recognized for leading publisher team migration to Google new customer interaction system.  Google Platinum award Recognized for leading publisher team migration to Google new customer interaction system.  Google Gold award Recognized for creating business intelligence tools that helped improving customer satisfaction. Google Gold award Recognized for creating business intelligence tools that helped improving customer satisfaction. Google Gold award Recognized for creating business intelligence tools that helped improving customer satisfaction. Runner up in the competition for the Best Thesis about Digital Marketing in 2011 IAB Poland Thesis: “Digital Mom” -Marketing communications with online communities.  Runner up in the competition for the Best Thesis about Digital Marketing in 2011 IAB Poland Thesis: “Digital Mom” -Marketing communications with online communities.  Runner up in the competition for the Best Thesis about Digital Marketing in 2011 IAB Poland Thesis: “Digital Mom” -Marketing communications with online communities.  ", "Summary I currently work at Google as a product specialist for Google News.  \n \nI started out at Google 5 years ago in ad sales. After 2.5 years launching and managing ad campaigns, I developed a strong understanding and appreciation for how the web is monetized. Next, I worked on two of our news products, Google News & Google Play Newsstand, focusing on educating publishers on our products and handling sensitive content policy issues. Recently, I've moved to a product specialist role for Google News, influencing product direction, coordinating launch operations, and leading various efforts to improve index quality.  \n \nWhen I'm not working, I'm attempting to learn to code (check out my first site! http://reportinginconflict.com), occasionally swimming in the bay, and trying to figure out how to make the world a slightly better place. Summary I currently work at Google as a product specialist for Google News.  \n \nI started out at Google 5 years ago in ad sales. After 2.5 years launching and managing ad campaigns, I developed a strong understanding and appreciation for how the web is monetized. Next, I worked on two of our news products, Google News & Google Play Newsstand, focusing on educating publishers on our products and handling sensitive content policy issues. Recently, I've moved to a product specialist role for Google News, influencing product direction, coordinating launch operations, and leading various efforts to improve index quality.  \n \nWhen I'm not working, I'm attempting to learn to code (check out my first site! http://reportinginconflict.com), occasionally swimming in the bay, and trying to figure out how to make the world a slightly better place. I currently work at Google as a product specialist for Google News.  \n \nI started out at Google 5 years ago in ad sales. After 2.5 years launching and managing ad campaigns, I developed a strong understanding and appreciation for how the web is monetized. Next, I worked on two of our news products, Google News & Google Play Newsstand, focusing on educating publishers on our products and handling sensitive content policy issues. Recently, I've moved to a product specialist role for Google News, influencing product direction, coordinating launch operations, and leading various efforts to improve index quality.  \n \nWhen I'm not working, I'm attempting to learn to code (check out my first site! http://reportinginconflict.com), occasionally swimming in the bay, and trying to figure out how to make the world a slightly better place. I currently work at Google as a product specialist for Google News.  \n \nI started out at Google 5 years ago in ad sales. After 2.5 years launching and managing ad campaigns, I developed a strong understanding and appreciation for how the web is monetized. Next, I worked on two of our news products, Google News & Google Play Newsstand, focusing on educating publishers on our products and handling sensitive content policy issues. Recently, I've moved to a product specialist role for Google News, influencing product direction, coordinating launch operations, and leading various efforts to improve index quality.  \n \nWhen I'm not working, I'm attempting to learn to code (check out my first site! http://reportinginconflict.com), occasionally swimming in the bay, and trying to figure out how to make the world a slightly better place. Experience Product Specialist, Google News Google May 2015  – Present (4 months) Mountain View, CA Influence tool and product development for Google News by escalating publisher and industry needs. Partner closely with engineering and product from feature development (mocks, PRD creation) to publisher piloting and launch.  \n \nLead various operational projects to improve news index quality, as well as tackle spam and abuse issues. Work with policy, legal and product teams to resolve sensitive policy issues. \n \nPublisher outreach via newsletters, events, or newsroom meetings.  Publisher Education & Policy (News) Google January 2013  –  May 2015  (2 years 5 months) Mountain View, CA Design and implement publisher support and education strategy for Google News & Google Play Newsstand.  \n \nAssist news publishers with technical troubleshooting for crawl and indexing issues. Write publisher facing communications: blog posts, social posts, and announcements emails distributed to tens of thousands of news publishers internationally. \n \nTeam lead for policy issues (e.g., graphic content); work with senior leadership to create and revise news content policies that put our users first. Train and supervise vendor team that handles day-to-day content review. \n \nCreated project focused on improving global news source coverage. Launched vendor sourcing process; currently supervising the automation of various steps to optimize and scale workflow. 20% Project work with Google.org Google April 2012  –  May 2014  (2 years 2 months) Mountain View, CA Researcher on various projects, investigating product applications for topics such as hate speech, encryption, and digital conflict. Account Strategist Google January 2012  –  December 2012  (1 year) Mountain View, CA Handpicked as one of the founding members of specialized launch team for new digital advertising business in North America. Led creation of team processes and workflow.  \n \nConsistently exceeded core account assistance metrics (both depth and account coverage), drove ~$1.5M+ per quarter in launch revenue. \n \nServed as team specialist for internal and external technical troubleshooting. Account Manager Google July 2010  –  December 2011  (1 year 6 months) Ann Arbor, MI Worked closely with teammates and clients to develop and implement digital advertising strategy for 45+ mid-market Canadian companies. Managed $20MM+ in annualized revenue for education, healthcare, and government advertisers. \n \nCreated and managed program to provide specialized support for Canadian team’s account launches from new business acquisition team. \n \nGoogle Analytics specialist and troubleshooting lead for account trafficking, optimization & tracking issues across Search, YouTube, Display & Mobile platforms. Microeconomics Tutor Denison University August 2009  –  May 2010  (10 months) Tutored students of microeconomics, primarily with homework assignments or before tests. Writing Consultant Denison University August 2007  –  May 2010  (2 years 10 months) Edited papers and personal statements for students in a variety of academic majors. Led plagiarism workshops for students and faculty. Analyst Intern Diamond Hill Investments May 2009  –  August 2009  (4 months) Researched, wrote, and presented research and risk mitigation recommendations to the company’s CFO on prime brokerage risk.  \n \nExamined potential stock options and worked closely with the team’s research analysts to model stocks' value. Intern Ann Arbor SPARK May 2008  –  July 2008  (3 months) Product Specialist, Google News Google May 2015  – Present (4 months) Mountain View, CA Influence tool and product development for Google News by escalating publisher and industry needs. Partner closely with engineering and product from feature development (mocks, PRD creation) to publisher piloting and launch.  \n \nLead various operational projects to improve news index quality, as well as tackle spam and abuse issues. Work with policy, legal and product teams to resolve sensitive policy issues. \n \nPublisher outreach via newsletters, events, or newsroom meetings.  Product Specialist, Google News Google May 2015  – Present (4 months) Mountain View, CA Influence tool and product development for Google News by escalating publisher and industry needs. Partner closely with engineering and product from feature development (mocks, PRD creation) to publisher piloting and launch.  \n \nLead various operational projects to improve news index quality, as well as tackle spam and abuse issues. Work with policy, legal and product teams to resolve sensitive policy issues. \n \nPublisher outreach via newsletters, events, or newsroom meetings.  Publisher Education & Policy (News) Google January 2013  –  May 2015  (2 years 5 months) Mountain View, CA Design and implement publisher support and education strategy for Google News & Google Play Newsstand.  \n \nAssist news publishers with technical troubleshooting for crawl and indexing issues. Write publisher facing communications: blog posts, social posts, and announcements emails distributed to tens of thousands of news publishers internationally. \n \nTeam lead for policy issues (e.g., graphic content); work with senior leadership to create and revise news content policies that put our users first. Train and supervise vendor team that handles day-to-day content review. \n \nCreated project focused on improving global news source coverage. Launched vendor sourcing process; currently supervising the automation of various steps to optimize and scale workflow. Publisher Education & Policy (News) Google January 2013  –  May 2015  (2 years 5 months) Mountain View, CA Design and implement publisher support and education strategy for Google News & Google Play Newsstand.  \n \nAssist news publishers with technical troubleshooting for crawl and indexing issues. Write publisher facing communications: blog posts, social posts, and announcements emails distributed to tens of thousands of news publishers internationally. \n \nTeam lead for policy issues (e.g., graphic content); work with senior leadership to create and revise news content policies that put our users first. Train and supervise vendor team that handles day-to-day content review. \n \nCreated project focused on improving global news source coverage. Launched vendor sourcing process; currently supervising the automation of various steps to optimize and scale workflow. 20% Project work with Google.org Google April 2012  –  May 2014  (2 years 2 months) Mountain View, CA Researcher on various projects, investigating product applications for topics such as hate speech, encryption, and digital conflict. 20% Project work with Google.org Google April 2012  –  May 2014  (2 years 2 months) Mountain View, CA Researcher on various projects, investigating product applications for topics such as hate speech, encryption, and digital conflict. Account Strategist Google January 2012  –  December 2012  (1 year) Mountain View, CA Handpicked as one of the founding members of specialized launch team for new digital advertising business in North America. Led creation of team processes and workflow.  \n \nConsistently exceeded core account assistance metrics (both depth and account coverage), drove ~$1.5M+ per quarter in launch revenue. \n \nServed as team specialist for internal and external technical troubleshooting. Account Strategist Google January 2012  –  December 2012  (1 year) Mountain View, CA Handpicked as one of the founding members of specialized launch team for new digital advertising business in North America. Led creation of team processes and workflow.  \n \nConsistently exceeded core account assistance metrics (both depth and account coverage), drove ~$1.5M+ per quarter in launch revenue. \n \nServed as team specialist for internal and external technical troubleshooting. Account Manager Google July 2010  –  December 2011  (1 year 6 months) Ann Arbor, MI Worked closely with teammates and clients to develop and implement digital advertising strategy for 45+ mid-market Canadian companies. Managed $20MM+ in annualized revenue for education, healthcare, and government advertisers. \n \nCreated and managed program to provide specialized support for Canadian team’s account launches from new business acquisition team. \n \nGoogle Analytics specialist and troubleshooting lead for account trafficking, optimization & tracking issues across Search, YouTube, Display & Mobile platforms. Account Manager Google July 2010  –  December 2011  (1 year 6 months) Ann Arbor, MI Worked closely with teammates and clients to develop and implement digital advertising strategy for 45+ mid-market Canadian companies. Managed $20MM+ in annualized revenue for education, healthcare, and government advertisers. \n \nCreated and managed program to provide specialized support for Canadian team’s account launches from new business acquisition team. \n \nGoogle Analytics specialist and troubleshooting lead for account trafficking, optimization & tracking issues across Search, YouTube, Display & Mobile platforms. Microeconomics Tutor Denison University August 2009  –  May 2010  (10 months) Tutored students of microeconomics, primarily with homework assignments or before tests. Microeconomics Tutor Denison University August 2009  –  May 2010  (10 months) Tutored students of microeconomics, primarily with homework assignments or before tests. Writing Consultant Denison University August 2007  –  May 2010  (2 years 10 months) Edited papers and personal statements for students in a variety of academic majors. Led plagiarism workshops for students and faculty. Writing Consultant Denison University August 2007  –  May 2010  (2 years 10 months) Edited papers and personal statements for students in a variety of academic majors. Led plagiarism workshops for students and faculty. Analyst Intern Diamond Hill Investments May 2009  –  August 2009  (4 months) Researched, wrote, and presented research and risk mitigation recommendations to the company’s CFO on prime brokerage risk.  \n \nExamined potential stock options and worked closely with the team’s research analysts to model stocks' value. Analyst Intern Diamond Hill Investments May 2009  –  August 2009  (4 months) Researched, wrote, and presented research and risk mitigation recommendations to the company’s CFO on prime brokerage risk.  \n \nExamined potential stock options and worked closely with the team’s research analysts to model stocks' value. Intern Ann Arbor SPARK May 2008  –  July 2008  (3 months) Intern Ann Arbor SPARK May 2008  –  July 2008  (3 months) Skills Google News Digital Strategy Google Analytics Online Advertising Google Adwords SEM Web Analytics SEO Digital Marketing Display Advertising Project Management PPC Google Trends Content Strategy Hate Speech Google Play Newsstand Policy Data Science Online News Online Journalism Public Relations Advertising Social Media Marketing Journalism Social Media Newsletters Search Advertising See 12+     See less Skills  Google News Digital Strategy Google Analytics Online Advertising Google Adwords SEM Web Analytics SEO Digital Marketing Display Advertising Project Management PPC Google Trends Content Strategy Hate Speech Google Play Newsstand Policy Data Science Online News Online Journalism Public Relations Advertising Social Media Marketing Journalism Social Media Newsletters Search Advertising See 12+     See less Google News Digital Strategy Google Analytics Online Advertising Google Adwords SEM Web Analytics SEO Digital Marketing Display Advertising Project Management PPC Google Trends Content Strategy Hate Speech Google Play Newsstand Policy Data Science Online News Online Journalism Public Relations Advertising Social Media Marketing Journalism Social Media Newsletters Search Advertising See 12+     See less Google News Digital Strategy Google Analytics Online Advertising Google Adwords SEM Web Analytics SEO Digital Marketing Display Advertising Project Management PPC Google Trends Content Strategy Hate Speech Google Play Newsstand Policy Data Science Online News Online Journalism Public Relations Advertising Social Media Marketing Journalism Social Media Newsletters Search Advertising See 12+     See less Education General Assembly Front End Web Development , Data Science 2014  – 2015 Front End Development in Fall of 2014, created site http://reportinginconflict.com/ as final project. \n \nData Science in Spring of 2015, used several different machine learning algorithms (Python & various libraries) to analyze historical Google Trends traffic (google.com/trends) for politically sensitive terms to determine how well they correlated with state election results.  \n \n Denison University Bachelor of Arts (B.A.), Summa Cum Laude,  Economics & History 2006  – 2010 Activities and Societies:  Varsity Cross Country ,  Indoor Track ,  & Track ,  The Community Rights and Standards Board ,  Academic Affairs Council ,  The Denisonian ,  and Green Team General Assembly Front End Web Development , Data Science 2014  – 2015 Front End Development in Fall of 2014, created site http://reportinginconflict.com/ as final project. \n \nData Science in Spring of 2015, used several different machine learning algorithms (Python & various libraries) to analyze historical Google Trends traffic (google.com/trends) for politically sensitive terms to determine how well they correlated with state election results.  \n \n General Assembly Front End Web Development , Data Science 2014  – 2015 Front End Development in Fall of 2014, created site http://reportinginconflict.com/ as final project. \n \nData Science in Spring of 2015, used several different machine learning algorithms (Python & various libraries) to analyze historical Google Trends traffic (google.com/trends) for politically sensitive terms to determine how well they correlated with state election results.  \n \n General Assembly Front End Web Development , Data Science 2014  – 2015 Front End Development in Fall of 2014, created site http://reportinginconflict.com/ as final project. \n \nData Science in Spring of 2015, used several different machine learning algorithms (Python & various libraries) to analyze historical Google Trends traffic (google.com/trends) for politically sensitive terms to determine how well they correlated with state election results.  \n \n Denison University Bachelor of Arts (B.A.), Summa Cum Laude,  Economics & History 2006  – 2010 Activities and Societies:  Varsity Cross Country ,  Indoor Track ,  & Track ,  The Community Rights and Standards Board ,  Academic Affairs Council ,  The Denisonian ,  and Green Team Denison University Bachelor of Arts (B.A.), Summa Cum Laude,  Economics & History 2006  – 2010 Activities and Societies:  Varsity Cross Country ,  Indoor Track ,  & Track ,  The Community Rights and Standards Board ,  Academic Affairs Council ,  The Denisonian ,  and Green Team Denison University Bachelor of Arts (B.A.), Summa Cum Laude,  Economics & History 2006  – 2010 Activities and Societies:  Varsity Cross Country ,  Indoor Track ,  & Track ,  The Community Rights and Standards Board ,  Academic Affairs Council ,  The Denisonian ,  and Green Team Honors & Awards Impact Award: Cross Collaboration Google, Inc. July 2011 Additional Honors & Awards Phi Beta Kappa, Denison’s Distinguished Leadership Award, Honor's Program, Phi Honorary Society, Omicron Delta Epsilon Economics Honorary, Phi Alpha Theta History Honorary, History Fellow, and Mortar Board Member Impact Award: Cross Collaboration Google, Inc. July 2011 Impact Award: Cross Collaboration Google, Inc. July 2011 Impact Award: Cross Collaboration Google, Inc. July 2011 Additional Honors & Awards Phi Beta Kappa, Denison’s Distinguished Leadership Award, Honor's Program, Phi Honorary Society, Omicron Delta Epsilon Economics Honorary, Phi Alpha Theta History Honorary, History Fellow, and Mortar Board Member Additional Honors & Awards Phi Beta Kappa, Denison’s Distinguished Leadership Award, Honor's Program, Phi Honorary Society, Omicron Delta Epsilon Economics Honorary, Phi Alpha Theta History Honorary, History Fellow, and Mortar Board Member Additional Honors & Awards Phi Beta Kappa, Denison’s Distinguished Leadership Award, Honor's Program, Phi Honorary Society, Omicron Delta Epsilon Economics Honorary, Phi Alpha Theta History Honorary, History Fellow, and Mortar Board Member ", "Experience Product Specialist - Brand Measurement Google February 2015  – Present (7 months) San Francisco Bay Area New Product Specialist Google October 2012  – Present (2 years 11 months) San Francisco Bay Area Scoping and launching new products in North America.  \nProjects include: Enhanced Campaigns and Google Preferred launches Account Manager, Google TV Ads Google January 2012  –  October 2012  (10 months) San Francisco Bay Area -Account manager for Google TV Ads customers in the Education, Classifieds and Local Services & Government Verticals, representing ~18% of Google TV Ads revenue. Visiting Ads Program Manager- TangoZebra Creative Services Google April 2012  –  June 2012  (3 months) London, United Kingdom Project Manager for Google's Creative Team ('The Zoo'). Worked cross-functionally with Sales, Design & Brand Planners to deliver creative briefs showcasing Google & Youtube's creative capabilities. Account Executive YouTube January 2011  –  February 2012  (1 year 2 months) San Francisco Bay Area -Drove YouTube Sales Strategy for 3 Verticals: Local, Travel, and Financial Services, representing approx 20% of YouTube Revenue for Online Sales. Senior Account Strategist, AdWords, National Agency Team Google August 2008  –  December 2010  (2 years 5 months) Cambridge, MA Account Associate, AdWords Google August 2007  –  August 2008  (1 year 1 month) Cambridge, MA Product Specialist - Brand Measurement Google February 2015  – Present (7 months) San Francisco Bay Area Product Specialist - Brand Measurement Google February 2015  – Present (7 months) San Francisco Bay Area New Product Specialist Google October 2012  – Present (2 years 11 months) San Francisco Bay Area Scoping and launching new products in North America.  \nProjects include: Enhanced Campaigns and Google Preferred launches New Product Specialist Google October 2012  – Present (2 years 11 months) San Francisco Bay Area Scoping and launching new products in North America.  \nProjects include: Enhanced Campaigns and Google Preferred launches Account Manager, Google TV Ads Google January 2012  –  October 2012  (10 months) San Francisco Bay Area -Account manager for Google TV Ads customers in the Education, Classifieds and Local Services & Government Verticals, representing ~18% of Google TV Ads revenue. Account Manager, Google TV Ads Google January 2012  –  October 2012  (10 months) San Francisco Bay Area -Account manager for Google TV Ads customers in the Education, Classifieds and Local Services & Government Verticals, representing ~18% of Google TV Ads revenue. Visiting Ads Program Manager- TangoZebra Creative Services Google April 2012  –  June 2012  (3 months) London, United Kingdom Project Manager for Google's Creative Team ('The Zoo'). Worked cross-functionally with Sales, Design & Brand Planners to deliver creative briefs showcasing Google & Youtube's creative capabilities. Visiting Ads Program Manager- TangoZebra Creative Services Google April 2012  –  June 2012  (3 months) London, United Kingdom Project Manager for Google's Creative Team ('The Zoo'). Worked cross-functionally with Sales, Design & Brand Planners to deliver creative briefs showcasing Google & Youtube's creative capabilities. Account Executive YouTube January 2011  –  February 2012  (1 year 2 months) San Francisco Bay Area -Drove YouTube Sales Strategy for 3 Verticals: Local, Travel, and Financial Services, representing approx 20% of YouTube Revenue for Online Sales. Account Executive YouTube January 2011  –  February 2012  (1 year 2 months) San Francisco Bay Area -Drove YouTube Sales Strategy for 3 Verticals: Local, Travel, and Financial Services, representing approx 20% of YouTube Revenue for Online Sales. Senior Account Strategist, AdWords, National Agency Team Google August 2008  –  December 2010  (2 years 5 months) Cambridge, MA Senior Account Strategist, AdWords, National Agency Team Google August 2008  –  December 2010  (2 years 5 months) Cambridge, MA Account Associate, AdWords Google August 2007  –  August 2008  (1 year 1 month) Cambridge, MA Account Associate, AdWords Google August 2007  –  August 2008  (1 year 1 month) Cambridge, MA Skills Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Skills  Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Google Adwords SEM Search Advertising YouTube Display Advertising Mobile Advertising Marketing Strategy Advertising Education Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Harvard University BA,  Psychology ,  Spanish Language Citation 2003  – 2007 Activities and Societies:  CityStep (Non-profit after school Arts Program); Mainly Jazz Dance Company (co-director) Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 Universidad Complutense de Madrid Study Abroad,  Spanish Language ,  Art ,  & Architecture 2006  – 2006 ", "Experience Global Product Expert Google June 2010  – Present (5 years 3 months) Greater New York City Area Sales Operations Google March 2004  – Present (11 years 6 months) Global Product Expert Google June 2010  – Present (5 years 3 months) Greater New York City Area Global Product Expert Google June 2010  – Present (5 years 3 months) Greater New York City Area Sales Operations Google March 2004  – Present (11 years 6 months) Sales Operations Google March 2004  – Present (11 years 6 months) Education Cornell University BS 1998  – 2002 Cornell University BS 1998  – 2002 Cornell University BS 1998  – 2002 Cornell University BS 1998  – 2002 ", "Experience Solutions & Strategy Team Lead Google October 2013  – Present (1 year 11 months) Product Specialist Google Inc. July 2012  – Present (3 years 2 months) Senior Account Manager Google April 2011  –  June 2012  (1 year 3 months) Display Account Manager Google October 2009  –  March 2011  (1 year 6 months) Relationship Manager Google January 2008  –  September 2009  (1 year 9 months) San Francisco Bay Area Solutions & Strategy Team Lead Google October 2013  – Present (1 year 11 months) Solutions & Strategy Team Lead Google October 2013  – Present (1 year 11 months) Product Specialist Google Inc. July 2012  – Present (3 years 2 months) Product Specialist Google Inc. July 2012  – Present (3 years 2 months) Senior Account Manager Google April 2011  –  June 2012  (1 year 3 months) Senior Account Manager Google April 2011  –  June 2012  (1 year 3 months) Display Account Manager Google October 2009  –  March 2011  (1 year 6 months) Display Account Manager Google October 2009  –  March 2011  (1 year 6 months) Relationship Manager Google January 2008  –  September 2009  (1 year 9 months) San Francisco Bay Area Relationship Manager Google January 2008  –  September 2009  (1 year 9 months) San Francisco Bay Area Skills Google Adwords SEM Skills  Google Adwords SEM Google Adwords SEM Google Adwords SEM Education The University of Chicago Booth School of Business Master of Business Administration (M.B.A.) 2014  – 2016 Colgate University Bachelor's Degree,  English ,  Chinese 2002  – 2006 The University of Chicago Booth School of Business Master of Business Administration (M.B.A.) 2014  – 2016 The University of Chicago Booth School of Business Master of Business Administration (M.B.A.) 2014  – 2016 The University of Chicago Booth School of Business Master of Business Administration (M.B.A.) 2014  – 2016 Colgate University Bachelor's Degree,  English ,  Chinese 2002  – 2006 Colgate University Bachelor's Degree,  English ,  Chinese 2002  – 2006 Colgate University Bachelor's Degree,  English ,  Chinese 2002  – 2006 ", "Skills Digital Marketing Web Analytics Google Adwords SEM Display Advertising Mobile Advertising Digital Strategy Google Analytics PPC Search Advertising Mobile Marketing DoubleClick Affiliate Marketing Conversion Optimization Online Advertising E-commerce See 1+     See less Skills  Digital Marketing Web Analytics Google Adwords SEM Display Advertising Mobile Advertising Digital Strategy Google Analytics PPC Search Advertising Mobile Marketing DoubleClick Affiliate Marketing Conversion Optimization Online Advertising E-commerce See 1+     See less Digital Marketing Web Analytics Google Adwords SEM Display Advertising Mobile Advertising Digital Strategy Google Analytics PPC Search Advertising Mobile Marketing DoubleClick Affiliate Marketing Conversion Optimization Online Advertising E-commerce See 1+     See less Digital Marketing Web Analytics Google Adwords SEM Display Advertising Mobile Advertising Digital Strategy Google Analytics PPC Search Advertising Mobile Marketing DoubleClick Affiliate Marketing Conversion Optimization Online Advertising E-commerce See 1+     See less ", "Summary Specialties:Online Display Advertising, Campaign Management, International Sales and Business Development. Summary Specialties:Online Display Advertising, Campaign Management, International Sales and Business Development. Specialties:Online Display Advertising, Campaign Management, International Sales and Business Development. Specialties:Online Display Advertising, Campaign Management, International Sales and Business Development. Experience Doubleclick Product Specialist Google October 2014  – Present (11 months) Amsterdam Area, Netherlands As an Ads Platform Specialist, I lead and execute projects for all clients who use DoubleClick products, with a major focus on DoubleClick Campaign Manager, Bid Manager and Rich Media. These projects will include technical assistance on business pitches, product implementations, product upgrades, and custom solutions. I help customers with product configuration and business process improvement, combining a deep understanding of DoubleClick products to provide best-in-class solutions. I provide the voice of the customer to the Product Management and Engineering team in order to make ongoing improvements to our tools. Product Solutions Consultant, Doubleclick Digital Marketing Google August 2013  – Present (2 years 1 month) Amsterdam Area, Netherlands As a Platforms Solutions Consultant for the Benelux, I provide solution support such as advanced troubleshooting questions, technical pre-sales, product implementation and training, consulting, project- and escalation management and custom development to Google’s Display customers. Technical Account Manager, Doubleclick for Advertisers Google September 2012  – Present (3 years) Amsterdam Area, Netherlands Supporting DFA clients in the Benelux, providing training, product updates, product implementation, and acting as an escalation point. \n \nDoubleclick for Advertiser's is Google's ad serving solution for media agencies and large advertisers to power their digital advertising campaigns. \n \nhttp://www.google.com/doubleclick/ \n \nhttp://doubleclickadvertisers.blogspot.nl/ YouTube Local Media Manager Google Netherlands June 2010  –  September 2012  (2 years 4 months) Manage reservation-based display advertising campaigns on www.youtube.nl Vertical Portfolio Manager Google October 2008  –  June 2010  (1 year 9 months) Online Sales, Marketing & Communications:  \n \nAccount Manager: fast-paced sales role which included managing advertiser accounts for the UK/IE markets, developing compelling advertising solutions for brand advertisers or developing scalable support solutions for rapid-growth consumer products. It required an advanced knowledge of Google products and advising clients on the best strategy for them to achieve their desired results. Marketing Executive Enterprise Ireland October 2006  –  October 2008  (2 years 1 month) Enterprise Ireland is the government agency responsible for the development and promotion of indigenous Irish business. Our mission is to accelerate the development of world-class Irish companies, achieving strong positions in global markets resulting in increased national and regional prosperity. \n \nWorked with colleagues in Amsterdam, Brussels, London & Dublin, while liaising with senior management of Irish SMEs to discuss their proposed market entry strategy. Specialised in promoting the Irish Construction & Environmental Services sector overseas. \n \nMy role involved supporting Irish companies in their export sales & marketing activities, developing strong networks of market contacts and providing a professional product/service sourcing service to Dutch/Belgian buyers to increase export growth to for the Irish market. Credit and Collections Advisor MBNA June 2006  –  August 2006  (3 months) Advised clients in financial difficulty how to proceed by calculating monthly repayment schemes. Learnt how to deal with difficult & abusive customers in a helpful & constructive manner. Formulated repayment schemes using a number of complex computer systems. Assistant Manager & Purchaser Penny Lane Boutique March 2005  –  September 2005  (7 months) Ladies fashion boutique in Midleton, County Cork. The full-time role of Assistant Manager was undertaken during the interim of attending undergraduate & postgraduate courses at university.  \n \nCreated promotional campaign & marketing literature for the launch of Penny Lane. Worked with owner on boutique design, layout & branding. Attended international trade events in Paris, London, Milan & Dublin.  \n \nManaged purchasing, budget & selection of stock on a seasonal & flash delivery basis. Dealt with customers, queries & orders. Gained international purchasing & retail experience, worked under own initiative, steep learning curve, given large capacity for creativity. First-hand experience of starting a small business venture. Doubleclick Product Specialist Google October 2014  – Present (11 months) Amsterdam Area, Netherlands As an Ads Platform Specialist, I lead and execute projects for all clients who use DoubleClick products, with a major focus on DoubleClick Campaign Manager, Bid Manager and Rich Media. These projects will include technical assistance on business pitches, product implementations, product upgrades, and custom solutions. I help customers with product configuration and business process improvement, combining a deep understanding of DoubleClick products to provide best-in-class solutions. I provide the voice of the customer to the Product Management and Engineering team in order to make ongoing improvements to our tools. Doubleclick Product Specialist Google October 2014  – Present (11 months) Amsterdam Area, Netherlands As an Ads Platform Specialist, I lead and execute projects for all clients who use DoubleClick products, with a major focus on DoubleClick Campaign Manager, Bid Manager and Rich Media. These projects will include technical assistance on business pitches, product implementations, product upgrades, and custom solutions. I help customers with product configuration and business process improvement, combining a deep understanding of DoubleClick products to provide best-in-class solutions. I provide the voice of the customer to the Product Management and Engineering team in order to make ongoing improvements to our tools. Product Solutions Consultant, Doubleclick Digital Marketing Google August 2013  – Present (2 years 1 month) Amsterdam Area, Netherlands As a Platforms Solutions Consultant for the Benelux, I provide solution support such as advanced troubleshooting questions, technical pre-sales, product implementation and training, consulting, project- and escalation management and custom development to Google’s Display customers. Product Solutions Consultant, Doubleclick Digital Marketing Google August 2013  – Present (2 years 1 month) Amsterdam Area, Netherlands As a Platforms Solutions Consultant for the Benelux, I provide solution support such as advanced troubleshooting questions, technical pre-sales, product implementation and training, consulting, project- and escalation management and custom development to Google’s Display customers. Technical Account Manager, Doubleclick for Advertisers Google September 2012  – Present (3 years) Amsterdam Area, Netherlands Supporting DFA clients in the Benelux, providing training, product updates, product implementation, and acting as an escalation point. \n \nDoubleclick for Advertiser's is Google's ad serving solution for media agencies and large advertisers to power their digital advertising campaigns. \n \nhttp://www.google.com/doubleclick/ \n \nhttp://doubleclickadvertisers.blogspot.nl/ Technical Account Manager, Doubleclick for Advertisers Google September 2012  – Present (3 years) Amsterdam Area, Netherlands Supporting DFA clients in the Benelux, providing training, product updates, product implementation, and acting as an escalation point. \n \nDoubleclick for Advertiser's is Google's ad serving solution for media agencies and large advertisers to power their digital advertising campaigns. \n \nhttp://www.google.com/doubleclick/ \n \nhttp://doubleclickadvertisers.blogspot.nl/ YouTube Local Media Manager Google Netherlands June 2010  –  September 2012  (2 years 4 months) Manage reservation-based display advertising campaigns on www.youtube.nl YouTube Local Media Manager Google Netherlands June 2010  –  September 2012  (2 years 4 months) Manage reservation-based display advertising campaigns on www.youtube.nl Vertical Portfolio Manager Google October 2008  –  June 2010  (1 year 9 months) Online Sales, Marketing & Communications:  \n \nAccount Manager: fast-paced sales role which included managing advertiser accounts for the UK/IE markets, developing compelling advertising solutions for brand advertisers or developing scalable support solutions for rapid-growth consumer products. It required an advanced knowledge of Google products and advising clients on the best strategy for them to achieve their desired results. Vertical Portfolio Manager Google October 2008  –  June 2010  (1 year 9 months) Online Sales, Marketing & Communications:  \n \nAccount Manager: fast-paced sales role which included managing advertiser accounts for the UK/IE markets, developing compelling advertising solutions for brand advertisers or developing scalable support solutions for rapid-growth consumer products. It required an advanced knowledge of Google products and advising clients on the best strategy for them to achieve their desired results. Marketing Executive Enterprise Ireland October 2006  –  October 2008  (2 years 1 month) Enterprise Ireland is the government agency responsible for the development and promotion of indigenous Irish business. Our mission is to accelerate the development of world-class Irish companies, achieving strong positions in global markets resulting in increased national and regional prosperity. \n \nWorked with colleagues in Amsterdam, Brussels, London & Dublin, while liaising with senior management of Irish SMEs to discuss their proposed market entry strategy. Specialised in promoting the Irish Construction & Environmental Services sector overseas. \n \nMy role involved supporting Irish companies in their export sales & marketing activities, developing strong networks of market contacts and providing a professional product/service sourcing service to Dutch/Belgian buyers to increase export growth to for the Irish market. Marketing Executive Enterprise Ireland October 2006  –  October 2008  (2 years 1 month) Enterprise Ireland is the government agency responsible for the development and promotion of indigenous Irish business. Our mission is to accelerate the development of world-class Irish companies, achieving strong positions in global markets resulting in increased national and regional prosperity. \n \nWorked with colleagues in Amsterdam, Brussels, London & Dublin, while liaising with senior management of Irish SMEs to discuss their proposed market entry strategy. Specialised in promoting the Irish Construction & Environmental Services sector overseas. \n \nMy role involved supporting Irish companies in their export sales & marketing activities, developing strong networks of market contacts and providing a professional product/service sourcing service to Dutch/Belgian buyers to increase export growth to for the Irish market. Credit and Collections Advisor MBNA June 2006  –  August 2006  (3 months) Advised clients in financial difficulty how to proceed by calculating monthly repayment schemes. Learnt how to deal with difficult & abusive customers in a helpful & constructive manner. Formulated repayment schemes using a number of complex computer systems. Credit and Collections Advisor MBNA June 2006  –  August 2006  (3 months) Advised clients in financial difficulty how to proceed by calculating monthly repayment schemes. Learnt how to deal with difficult & abusive customers in a helpful & constructive manner. Formulated repayment schemes using a number of complex computer systems. Assistant Manager & Purchaser Penny Lane Boutique March 2005  –  September 2005  (7 months) Ladies fashion boutique in Midleton, County Cork. The full-time role of Assistant Manager was undertaken during the interim of attending undergraduate & postgraduate courses at university.  \n \nCreated promotional campaign & marketing literature for the launch of Penny Lane. Worked with owner on boutique design, layout & branding. Attended international trade events in Paris, London, Milan & Dublin.  \n \nManaged purchasing, budget & selection of stock on a seasonal & flash delivery basis. Dealt with customers, queries & orders. Gained international purchasing & retail experience, worked under own initiative, steep learning curve, given large capacity for creativity. First-hand experience of starting a small business venture. Assistant Manager & Purchaser Penny Lane Boutique March 2005  –  September 2005  (7 months) Ladies fashion boutique in Midleton, County Cork. The full-time role of Assistant Manager was undertaken during the interim of attending undergraduate & postgraduate courses at university.  \n \nCreated promotional campaign & marketing literature for the launch of Penny Lane. Worked with owner on boutique design, layout & branding. Attended international trade events in Paris, London, Milan & Dublin.  \n \nManaged purchasing, budget & selection of stock on a seasonal & flash delivery basis. Dealt with customers, queries & orders. Gained international purchasing & retail experience, worked under own initiative, steep learning curve, given large capacity for creativity. First-hand experience of starting a small business venture. Languages English Native or bilingual proficiency Dutch Professional working proficiency English Native or bilingual proficiency Dutch Professional working proficiency English Native or bilingual proficiency Dutch Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills DoubleClick YouTube Ad Serving Search Advertising Sales Support Rich Media DFP DoubleClick for... Doubleclick Studio Google Adwords Technical Training Display Advertising Online Advertising Digital Marketing Online Marketing Skills  DoubleClick YouTube Ad Serving Search Advertising Sales Support Rich Media DFP DoubleClick for... Doubleclick Studio Google Adwords Technical Training Display Advertising Online Advertising Digital Marketing Online Marketing DoubleClick YouTube Ad Serving Search Advertising Sales Support Rich Media DFP DoubleClick for... Doubleclick Studio Google Adwords Technical Training Display Advertising Online Advertising Digital Marketing Online Marketing DoubleClick YouTube Ad Serving Search Advertising Sales Support Rich Media DFP DoubleClick for... Doubleclick Studio Google Adwords Technical Training Display Advertising Online Advertising Digital Marketing Online Marketing Education University College Dublin, Michael Smurfit School of Business Post-Graduate Higher Diploma in Business. Hons,  Business ,  International Marketing and Business Information Technology 2005  – 2006 University College Cork Bachelor; Hons,  English Literature & Geography 2001  – 2004 Cambridge University CELTA Certificate for English Language Teaching to Adults University College Dublin, Michael Smurfit School of Business Post-Graduate Higher Diploma in Business. Hons,  Business ,  International Marketing and Business Information Technology 2005  – 2006 University College Dublin, Michael Smurfit School of Business Post-Graduate Higher Diploma in Business. Hons,  Business ,  International Marketing and Business Information Technology 2005  – 2006 University College Dublin, Michael Smurfit School of Business Post-Graduate Higher Diploma in Business. Hons,  Business ,  International Marketing and Business Information Technology 2005  – 2006 University College Cork Bachelor; Hons,  English Literature & Geography 2001  – 2004 Cambridge University CELTA Certificate for English Language Teaching to Adults University College Cork Bachelor; Hons,  English Literature & Geography 2001  – 2004 Cambridge University CELTA Certificate for English Language Teaching to Adults University College Cork Bachelor; Hons,  English Literature & Geography 2001  – 2004 Cambridge University CELTA Certificate for English Language Teaching to Adults ", "Summary Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Summary Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Experience Head of NACE Field & Partner Operations – Google Google January 2015  – Present (8 months) London, United Kingdom • Head up the Northern, Central and Eastern European Google For Work Post Sales teams: Field & Partner Operations, Deployment, Transformation and Customer Success Services. Responsible for all market segments \n• \"Go to market\" strategy for Strategic Alliances  \n• Ensure successful deployments, high renewal rates and position to existing customers new Solutions  \n• Scale Post-Sales activities through partners and define strategy for top tier partners. \n• Engagement with Strategic Alliance Partners in EMEA \n• Interact with customers: C-Level & Executive briefings to ensure the success of the projects and the roadmap for #Transformation, #Innovation and #Mobility \n• Key note speaker at Google, Partner and Industry events  \n• Hiring Manager for Post-Sales teams and part of the EMEA Google For Work hiring panel \n• Mentor Startups @ www.campuslondon.com \n• Mentor junior Googlers and university students as part of several mentorship programs Head of EMEA Channel Sales Engineering Google February 2012  – Present (3 years 7 months) London, UK • Focused on Google Apps for Business, Google Vault, Cloud & Chrome OS for the Large Client Sales organisation \n• Support all the technical aspects of these products throughout the sales cycle \n• Manage a talented team of Sales Engineers spread across the EMEA region \n• Set the vision and objectives for the team and review key results \n• Drive and support evangelisation initiatives at EMEA level to ensure the growth of Google Enterprise business and our Google Apps Partners  \n• Develop and deliver training sessions to our Google Premium Partners and act as a close advisor on their opportunities \n• Speak at industry conferences about Cloud computing & Google Apps including demo our products to small or large audiences \n• Executive briefings with major customers and prospects \n• Mentor Startups @ www.campuslondon.com EMEA Mid-Market Sales Engineering Manager Google March 2011  –  February 2012  (1 year) • Google Enterprise Sales EMEA Engineering Manager responsible for the mid-market organisation (Inside and direct sales) at Google \n• Managing a talented team of Sales Engineers across the EMEA region \n• Specialist in Google Apps for Business, Enterprise Search, and Google Platform Offerings, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive and support initiatives in the region to ensure growth of the Google Enterprise business \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set objectives for the team and review key results \n• Supporting pre and post sales activities for customers and partners Enterprise Sales Engineering Technical Lead Google July 2009  –  March 2011  (1 year 9 months) • Google Enterprise technical lead for the mid-market (North and Central Europe) at Google \n• Specialist for the the mid-market in the regions above, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive specific, and focused technical initiatives in the region to ensure growth of the Google Enterprise business \n• Project planner, including change management, for pilots and deployments  \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set technical objectives for the team and review key results \n• Technical mentoring for the rest of the team and new members as they join \n• Interview candidates for many positions at Google Gmail & Google Accounts EMEA & LATAM Product Specialist (Strategist) Google July 2006  –  July 2009  (3 years 1 month) • Operations lead (coordination, training and specific product workflow management) for Gmail and Google Accounts EMEA/LATAM \n• Consumer Operations internal communications point person for several products in EMEA/LATAM (contacts with Engineering, Communications, Product, Marketing etc) \n• Full member of the Consumer Operations Marketing Intelligence team \n• Product Strategy: Focus on user adoption, user retention and ROI \n• Consolidation of product roadmaps, tailored to EMEA & LATAM \n• Coordinates several product reports and analysis that include stability, bugs, user suggestions and trends (shared with Engineering, Product, Marketing, Usability and Senior Management) \n• Part of the hiring committee and interviewed several candidates for many positions at Google \n• Product support specialist for several Google Products  \n• Received a Google Gold Award for productivity and process improvements (reached 120% increase by developing a new tool and streamlining several processes and 1 to many initiatives) IT Consultant – Pre-Sales Engineer and Product Developer IDW February 2005  –  July 2006  (1 year 6 months) • ICR - OCR, Business Process Automation, Document Automation \n• Pre-Sales Engineer.  \n• Post sales consultant and Add-On solutions developer Head of NACE Field & Partner Operations – Google Google January 2015  – Present (8 months) London, United Kingdom • Head up the Northern, Central and Eastern European Google For Work Post Sales teams: Field & Partner Operations, Deployment, Transformation and Customer Success Services. Responsible for all market segments \n• \"Go to market\" strategy for Strategic Alliances  \n• Ensure successful deployments, high renewal rates and position to existing customers new Solutions  \n• Scale Post-Sales activities through partners and define strategy for top tier partners. \n• Engagement with Strategic Alliance Partners in EMEA \n• Interact with customers: C-Level & Executive briefings to ensure the success of the projects and the roadmap for #Transformation, #Innovation and #Mobility \n• Key note speaker at Google, Partner and Industry events  \n• Hiring Manager for Post-Sales teams and part of the EMEA Google For Work hiring panel \n• Mentor Startups @ www.campuslondon.com \n• Mentor junior Googlers and university students as part of several mentorship programs Head of NACE Field & Partner Operations – Google Google January 2015  – Present (8 months) London, United Kingdom • Head up the Northern, Central and Eastern European Google For Work Post Sales teams: Field & Partner Operations, Deployment, Transformation and Customer Success Services. Responsible for all market segments \n• \"Go to market\" strategy for Strategic Alliances  \n• Ensure successful deployments, high renewal rates and position to existing customers new Solutions  \n• Scale Post-Sales activities through partners and define strategy for top tier partners. \n• Engagement with Strategic Alliance Partners in EMEA \n• Interact with customers: C-Level & Executive briefings to ensure the success of the projects and the roadmap for #Transformation, #Innovation and #Mobility \n• Key note speaker at Google, Partner and Industry events  \n• Hiring Manager for Post-Sales teams and part of the EMEA Google For Work hiring panel \n• Mentor Startups @ www.campuslondon.com \n• Mentor junior Googlers and university students as part of several mentorship programs Head of EMEA Channel Sales Engineering Google February 2012  – Present (3 years 7 months) London, UK • Focused on Google Apps for Business, Google Vault, Cloud & Chrome OS for the Large Client Sales organisation \n• Support all the technical aspects of these products throughout the sales cycle \n• Manage a talented team of Sales Engineers spread across the EMEA region \n• Set the vision and objectives for the team and review key results \n• Drive and support evangelisation initiatives at EMEA level to ensure the growth of Google Enterprise business and our Google Apps Partners  \n• Develop and deliver training sessions to our Google Premium Partners and act as a close advisor on their opportunities \n• Speak at industry conferences about Cloud computing & Google Apps including demo our products to small or large audiences \n• Executive briefings with major customers and prospects \n• Mentor Startups @ www.campuslondon.com Head of EMEA Channel Sales Engineering Google February 2012  – Present (3 years 7 months) London, UK • Focused on Google Apps for Business, Google Vault, Cloud & Chrome OS for the Large Client Sales organisation \n• Support all the technical aspects of these products throughout the sales cycle \n• Manage a talented team of Sales Engineers spread across the EMEA region \n• Set the vision and objectives for the team and review key results \n• Drive and support evangelisation initiatives at EMEA level to ensure the growth of Google Enterprise business and our Google Apps Partners  \n• Develop and deliver training sessions to our Google Premium Partners and act as a close advisor on their opportunities \n• Speak at industry conferences about Cloud computing & Google Apps including demo our products to small or large audiences \n• Executive briefings with major customers and prospects \n• Mentor Startups @ www.campuslondon.com EMEA Mid-Market Sales Engineering Manager Google March 2011  –  February 2012  (1 year) • Google Enterprise Sales EMEA Engineering Manager responsible for the mid-market organisation (Inside and direct sales) at Google \n• Managing a talented team of Sales Engineers across the EMEA region \n• Specialist in Google Apps for Business, Enterprise Search, and Google Platform Offerings, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive and support initiatives in the region to ensure growth of the Google Enterprise business \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set objectives for the team and review key results \n• Supporting pre and post sales activities for customers and partners EMEA Mid-Market Sales Engineering Manager Google March 2011  –  February 2012  (1 year) • Google Enterprise Sales EMEA Engineering Manager responsible for the mid-market organisation (Inside and direct sales) at Google \n• Managing a talented team of Sales Engineers across the EMEA region \n• Specialist in Google Apps for Business, Enterprise Search, and Google Platform Offerings, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive and support initiatives in the region to ensure growth of the Google Enterprise business \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set objectives for the team and review key results \n• Supporting pre and post sales activities for customers and partners Enterprise Sales Engineering Technical Lead Google July 2009  –  March 2011  (1 year 9 months) • Google Enterprise technical lead for the mid-market (North and Central Europe) at Google \n• Specialist for the the mid-market in the regions above, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive specific, and focused technical initiatives in the region to ensure growth of the Google Enterprise business \n• Project planner, including change management, for pilots and deployments  \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set technical objectives for the team and review key results \n• Technical mentoring for the rest of the team and new members as they join \n• Interview candidates for many positions at Google Enterprise Sales Engineering Technical Lead Google July 2009  –  March 2011  (1 year 9 months) • Google Enterprise technical lead for the mid-market (North and Central Europe) at Google \n• Specialist for the the mid-market in the regions above, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive specific, and focused technical initiatives in the region to ensure growth of the Google Enterprise business \n• Project planner, including change management, for pilots and deployments  \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set technical objectives for the team and review key results \n• Technical mentoring for the rest of the team and new members as they join \n• Interview candidates for many positions at Google Gmail & Google Accounts EMEA & LATAM Product Specialist (Strategist) Google July 2006  –  July 2009  (3 years 1 month) • Operations lead (coordination, training and specific product workflow management) for Gmail and Google Accounts EMEA/LATAM \n• Consumer Operations internal communications point person for several products in EMEA/LATAM (contacts with Engineering, Communications, Product, Marketing etc) \n• Full member of the Consumer Operations Marketing Intelligence team \n• Product Strategy: Focus on user adoption, user retention and ROI \n• Consolidation of product roadmaps, tailored to EMEA & LATAM \n• Coordinates several product reports and analysis that include stability, bugs, user suggestions and trends (shared with Engineering, Product, Marketing, Usability and Senior Management) \n• Part of the hiring committee and interviewed several candidates for many positions at Google \n• Product support specialist for several Google Products  \n• Received a Google Gold Award for productivity and process improvements (reached 120% increase by developing a new tool and streamlining several processes and 1 to many initiatives) Gmail & Google Accounts EMEA & LATAM Product Specialist (Strategist) Google July 2006  –  July 2009  (3 years 1 month) • Operations lead (coordination, training and specific product workflow management) for Gmail and Google Accounts EMEA/LATAM \n• Consumer Operations internal communications point person for several products in EMEA/LATAM (contacts with Engineering, Communications, Product, Marketing etc) \n• Full member of the Consumer Operations Marketing Intelligence team \n• Product Strategy: Focus on user adoption, user retention and ROI \n• Consolidation of product roadmaps, tailored to EMEA & LATAM \n• Coordinates several product reports and analysis that include stability, bugs, user suggestions and trends (shared with Engineering, Product, Marketing, Usability and Senior Management) \n• Part of the hiring committee and interviewed several candidates for many positions at Google \n• Product support specialist for several Google Products  \n• Received a Google Gold Award for productivity and process improvements (reached 120% increase by developing a new tool and streamlining several processes and 1 to many initiatives) IT Consultant – Pre-Sales Engineer and Product Developer IDW February 2005  –  July 2006  (1 year 6 months) • ICR - OCR, Business Process Automation, Document Automation \n• Pre-Sales Engineer.  \n• Post sales consultant and Add-On solutions developer IT Consultant – Pre-Sales Engineer and Product Developer IDW February 2005  –  July 2006  (1 year 6 months) • ICR - OCR, Business Process Automation, Document Automation \n• Pre-Sales Engineer.  \n• Post sales consultant and Add-On solutions developer Languages English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Russian Elementary proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Russian Elementary proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Russian Elementary proficiency Full professional proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Elementary proficiency Skills User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less Skills  User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less Education Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Dublin Business School Diploma,  Project Management 2007  – 2007 University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Dublin Business School Diploma,  Project Management 2007  – 2007 Dublin Business School Diploma,  Project Management 2007  – 2007 Dublin Business School Diploma,  Project Management 2007  – 2007 University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China Honors & Awards Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 ", "Summary I am really passionate about the democratic potential of the internet for social change and how I can help users identify the power of their voice via online engagement. \n \nMy main areas of interest, from a professional standpoint, are: \n \n- product, strategy and creative consultancy \n- corporate social responsibility \n- product management \n- project management Summary I am really passionate about the democratic potential of the internet for social change and how I can help users identify the power of their voice via online engagement. \n \nMy main areas of interest, from a professional standpoint, are: \n \n- product, strategy and creative consultancy \n- corporate social responsibility \n- product management \n- project management I am really passionate about the democratic potential of the internet for social change and how I can help users identify the power of their voice via online engagement. \n \nMy main areas of interest, from a professional standpoint, are: \n \n- product, strategy and creative consultancy \n- corporate social responsibility \n- product management \n- project management I am really passionate about the democratic potential of the internet for social change and how I can help users identify the power of their voice via online engagement. \n \nMy main areas of interest, from a professional standpoint, are: \n \n- product, strategy and creative consultancy \n- corporate social responsibility \n- product management \n- project management Experience Technical Product Specialist Google November 2014  – Present (10 months) Technical expert across multiple products including, but not limited to:  \n \n- AdWords \n- Google Search, GDN and YouTube networks \n- All creative formats across AdWords and Reservation platforms \n- Standard and Dynamic Remarketing \n- Google and YouTube Analytics \n- Merchant Centre Google Australia Charity Lead Google June 2014  – Present (1 year 3 months) I am responsible for engaging our internal staff in socially responsible endeavours across Australia that results in our internal staff feeling engaged in doing good in our community as well as identifying projects that will maximise the impact for the local and global community. Display Specialist Google January 2014  –  October 2014  (10 months) Creation and Optimisation of Display campaigns across Auction and Reservation. \n \nWorking directly with agencies to help optimise and strategise their campaign performance in addition to creative consultation. Engagement Program Manager Google January 2013  –  March 2014  (1 year 3 months) I was a creative consultant across Google's Display products, with a focus on Rich Media, YouTube Brand Channels and Google +. I provided clients with best practice advise regarding implementation and creative strategy. Media Manager Google April 2010  –  March 2013  (3 years) I was responsible for the campaign management of YouTube's Display campaigns across our biggest verticals - Auto, Media and Entertainment and our New Zealand clients. Additionally I was also supporting our Marketing team for major projects, eg Live stream for Vivid campaign, YouTube Symphony and Chrome. \n \nIn this role I was the team's Rich Media specialist and played a major role in developing our Rich Media processes, providing trainings to internal and external clients, product management and development, and evangilisation of Rich media in market. Online Learning Publisher College of Law October 2008  –  May 2010  (1 year 8 months) Sydney Area, Australia - Liaising with legal professionals and lecturing staff to update and maintain the interactive e-learning content for the College’s postgraduate suite of practical law programs.  \n \n- Assisting with the creation and planning of timetables for the College’s courses nationally. \n \n- Drafting, editing and designing material for the College’s new student interface, the Learning Portal. \n \n- Preliminary storyboarding and creation of online tutorials on a number of topics including Wills and Estates Legal Practice, Planning and Environment Law Practice and Property Law Practice. Office Administrator/Website Coordinator/Finance Assistant Screen Australia February 2008  –  October 2008  (9 months) Sydney Area, Australia Study, Inlink and Digital Coordinator Eye Corp June 2007  –  February 2008  (9 months) Sydney Area, Australia - Coordinating all the media (static and digital) for over 80 university campuses across Australia. \n \n- Coordinating all the digital media for all our silos across Australia, including all of our digital campaigns in shopping centres, airports and office building elevators. \n \n- Chasing up and managing all the creatives that will be used for upcoming digital and university campaigns. Technical Product Specialist Google November 2014  – Present (10 months) Technical expert across multiple products including, but not limited to:  \n \n- AdWords \n- Google Search, GDN and YouTube networks \n- All creative formats across AdWords and Reservation platforms \n- Standard and Dynamic Remarketing \n- Google and YouTube Analytics \n- Merchant Centre Technical Product Specialist Google November 2014  – Present (10 months) Technical expert across multiple products including, but not limited to:  \n \n- AdWords \n- Google Search, GDN and YouTube networks \n- All creative formats across AdWords and Reservation platforms \n- Standard and Dynamic Remarketing \n- Google and YouTube Analytics \n- Merchant Centre Google Australia Charity Lead Google June 2014  – Present (1 year 3 months) I am responsible for engaging our internal staff in socially responsible endeavours across Australia that results in our internal staff feeling engaged in doing good in our community as well as identifying projects that will maximise the impact for the local and global community. Google Australia Charity Lead Google June 2014  – Present (1 year 3 months) I am responsible for engaging our internal staff in socially responsible endeavours across Australia that results in our internal staff feeling engaged in doing good in our community as well as identifying projects that will maximise the impact for the local and global community. Display Specialist Google January 2014  –  October 2014  (10 months) Creation and Optimisation of Display campaigns across Auction and Reservation. \n \nWorking directly with agencies to help optimise and strategise their campaign performance in addition to creative consultation. Display Specialist Google January 2014  –  October 2014  (10 months) Creation and Optimisation of Display campaigns across Auction and Reservation. \n \nWorking directly with agencies to help optimise and strategise their campaign performance in addition to creative consultation. Engagement Program Manager Google January 2013  –  March 2014  (1 year 3 months) I was a creative consultant across Google's Display products, with a focus on Rich Media, YouTube Brand Channels and Google +. I provided clients with best practice advise regarding implementation and creative strategy. Engagement Program Manager Google January 2013  –  March 2014  (1 year 3 months) I was a creative consultant across Google's Display products, with a focus on Rich Media, YouTube Brand Channels and Google +. I provided clients with best practice advise regarding implementation and creative strategy. Media Manager Google April 2010  –  March 2013  (3 years) I was responsible for the campaign management of YouTube's Display campaigns across our biggest verticals - Auto, Media and Entertainment and our New Zealand clients. Additionally I was also supporting our Marketing team for major projects, eg Live stream for Vivid campaign, YouTube Symphony and Chrome. \n \nIn this role I was the team's Rich Media specialist and played a major role in developing our Rich Media processes, providing trainings to internal and external clients, product management and development, and evangilisation of Rich media in market. Media Manager Google April 2010  –  March 2013  (3 years) I was responsible for the campaign management of YouTube's Display campaigns across our biggest verticals - Auto, Media and Entertainment and our New Zealand clients. Additionally I was also supporting our Marketing team for major projects, eg Live stream for Vivid campaign, YouTube Symphony and Chrome. \n \nIn this role I was the team's Rich Media specialist and played a major role in developing our Rich Media processes, providing trainings to internal and external clients, product management and development, and evangilisation of Rich media in market. Online Learning Publisher College of Law October 2008  –  May 2010  (1 year 8 months) Sydney Area, Australia - Liaising with legal professionals and lecturing staff to update and maintain the interactive e-learning content for the College’s postgraduate suite of practical law programs.  \n \n- Assisting with the creation and planning of timetables for the College’s courses nationally. \n \n- Drafting, editing and designing material for the College’s new student interface, the Learning Portal. \n \n- Preliminary storyboarding and creation of online tutorials on a number of topics including Wills and Estates Legal Practice, Planning and Environment Law Practice and Property Law Practice. Online Learning Publisher College of Law October 2008  –  May 2010  (1 year 8 months) Sydney Area, Australia - Liaising with legal professionals and lecturing staff to update and maintain the interactive e-learning content for the College’s postgraduate suite of practical law programs.  \n \n- Assisting with the creation and planning of timetables for the College’s courses nationally. \n \n- Drafting, editing and designing material for the College’s new student interface, the Learning Portal. \n \n- Preliminary storyboarding and creation of online tutorials on a number of topics including Wills and Estates Legal Practice, Planning and Environment Law Practice and Property Law Practice. Office Administrator/Website Coordinator/Finance Assistant Screen Australia February 2008  –  October 2008  (9 months) Sydney Area, Australia Office Administrator/Website Coordinator/Finance Assistant Screen Australia February 2008  –  October 2008  (9 months) Sydney Area, Australia Study, Inlink and Digital Coordinator Eye Corp June 2007  –  February 2008  (9 months) Sydney Area, Australia - Coordinating all the media (static and digital) for over 80 university campuses across Australia. \n \n- Coordinating all the digital media for all our silos across Australia, including all of our digital campaigns in shopping centres, airports and office building elevators. \n \n- Chasing up and managing all the creatives that will be used for upcoming digital and university campaigns. Study, Inlink and Digital Coordinator Eye Corp June 2007  –  February 2008  (9 months) Sydney Area, Australia - Coordinating all the media (static and digital) for over 80 university campuses across Australia. \n \n- Coordinating all the digital media for all our silos across Australia, including all of our digital campaigns in shopping centres, airports and office building elevators. \n \n- Chasing up and managing all the creatives that will be used for upcoming digital and university campaigns. Languages French French French Skills Digital Media Creative Strategy Display Advertising Mobile Marketing Online Advertising Creative Solutions Marketing Strategy DFA DoubleClick for... YouTube Social Media Marketing Digital Strategy Optimization Product Management Legal Assistance Educational Technology Education Lateral Thinking Problem Solving Google Adwords Studio Strategic Consulting Networking Customer Engagement Customer Service Process Management Process Improvement Technical Training Training Campaign Management Rich Media Interactive Advertising DoubleClick Digital Marketing Online Marketing Marketing SEO SEM Google Analytics Analytics Web Analytics Idea Person Advertising Social Media Mobile Advertising Strategy See 31+     See less Skills  Digital Media Creative Strategy Display Advertising Mobile Marketing Online Advertising Creative Solutions Marketing Strategy DFA DoubleClick for... YouTube Social Media Marketing Digital Strategy Optimization Product Management Legal Assistance Educational Technology Education Lateral Thinking Problem Solving Google Adwords Studio Strategic Consulting Networking Customer Engagement Customer Service Process Management Process Improvement Technical Training Training Campaign Management Rich Media Interactive Advertising DoubleClick Digital Marketing Online Marketing Marketing SEO SEM Google Analytics Analytics Web Analytics Idea Person Advertising Social Media Mobile Advertising Strategy See 31+     See less Digital Media Creative Strategy Display Advertising Mobile Marketing Online Advertising Creative Solutions Marketing Strategy DFA DoubleClick for... YouTube Social Media Marketing Digital Strategy Optimization Product Management Legal Assistance Educational Technology Education Lateral Thinking Problem Solving Google Adwords Studio Strategic Consulting Networking Customer Engagement Customer Service Process Management Process Improvement Technical Training Training Campaign Management Rich Media Interactive Advertising DoubleClick Digital Marketing Online Marketing Marketing SEO SEM Google Analytics Analytics Web Analytics Idea Person Advertising Social Media Mobile Advertising Strategy See 31+     See less Digital Media Creative Strategy Display Advertising Mobile Marketing Online Advertising Creative Solutions Marketing Strategy DFA DoubleClick for... YouTube Social Media Marketing Digital Strategy Optimization Product Management Legal Assistance Educational Technology Education Lateral Thinking Problem Solving Google Adwords Studio Strategic Consulting Networking Customer Engagement Customer Service Process Management Process Improvement Technical Training Training Campaign Management Rich Media Interactive Advertising DoubleClick Digital Marketing Online Marketing Marketing SEO SEM Google Analytics Analytics Web Analytics Idea Person Advertising Social Media Mobile Advertising Strategy See 31+     See less Education University of Sydney Master's Degree,  Masters of Media Practice , A 2006  – 2007 Masters of Media Macquarie University Bachelor's Degree,  Philosophy ,  Film Studies ,  History and Cultural Studies , High Distinction 1999  – 2004 Bachelor of Arts with a triple major in Philosophy, History and Film Studies University of Sydney Master's Degree,  Masters of Media Practice , A 2006  – 2007 Masters of Media University of Sydney Master's Degree,  Masters of Media Practice , A 2006  – 2007 Masters of Media University of Sydney Master's Degree,  Masters of Media Practice , A 2006  – 2007 Masters of Media Macquarie University Bachelor's Degree,  Philosophy ,  Film Studies ,  History and Cultural Studies , High Distinction 1999  – 2004 Bachelor of Arts with a triple major in Philosophy, History and Film Studies Macquarie University Bachelor's Degree,  Philosophy ,  Film Studies ,  History and Cultural Studies , High Distinction 1999  – 2004 Bachelor of Arts with a triple major in Philosophy, History and Film Studies Macquarie University Bachelor's Degree,  Philosophy ,  Film Studies ,  History and Cultural Studies , High Distinction 1999  – 2004 Bachelor of Arts with a triple major in Philosophy, History and Film Studies ", "Experience Google Fiber - Sales Operations Manager Google June 2015  – Present (3 months) Austin, Texas Area Along with the team I manage, I work with the Fiber sales team to identify & qualify leads, build sales plans & processes, and create data dashboards & analytics to ensure we're growing the business. Ads Product Specialist Manager Google May 2014  – Present (1 year 4 months) Mountain View, CA While inheriting my previous responsibilities around growing product revenue & adoption, I now manage a team of 3 product specialist across our ads product on both web (AdSense for Content, Video, and Games) and apps (AdMob). AdSense for Content Product Specialist Google May 2011  –  May 2014  (3 years 1 month) Mountain View, California I worked as a product specialist for our web-based product AdSense for Content. This typically spanned 3 functions: \n \n1.) Pitching product and engineering on new features & products. This included sizing the overall opportunity, developing plans to capture the target users, executing those plans, and reporting to the team on progress \n \n2.) Communicating to the sales, support, and marketing teams regarding new features & products to grow adoption \n \n3.) Aiding the sales team on large opportunities. This could be jumping on large potential acquisitions & getting them ramped up on the product or growing existing accounts to make sure they were maximizing the potential of our products. Product Marketing Manager National Instruments November 2008  –  May 2011  (2 years 7 months) Engineering Leadership Program (ELP) National Instruments August 2007  –  November 2008  (1 year 4 months) Engineering Summer Intern Northrop Grumman Corporation 2004  –  2006  (2 years) Google Fiber - Sales Operations Manager Google June 2015  – Present (3 months) Austin, Texas Area Along with the team I manage, I work with the Fiber sales team to identify & qualify leads, build sales plans & processes, and create data dashboards & analytics to ensure we're growing the business. Google Fiber - Sales Operations Manager Google June 2015  – Present (3 months) Austin, Texas Area Along with the team I manage, I work with the Fiber sales team to identify & qualify leads, build sales plans & processes, and create data dashboards & analytics to ensure we're growing the business. Ads Product Specialist Manager Google May 2014  – Present (1 year 4 months) Mountain View, CA While inheriting my previous responsibilities around growing product revenue & adoption, I now manage a team of 3 product specialist across our ads product on both web (AdSense for Content, Video, and Games) and apps (AdMob). Ads Product Specialist Manager Google May 2014  – Present (1 year 4 months) Mountain View, CA While inheriting my previous responsibilities around growing product revenue & adoption, I now manage a team of 3 product specialist across our ads product on both web (AdSense for Content, Video, and Games) and apps (AdMob). AdSense for Content Product Specialist Google May 2011  –  May 2014  (3 years 1 month) Mountain View, California I worked as a product specialist for our web-based product AdSense for Content. This typically spanned 3 functions: \n \n1.) Pitching product and engineering on new features & products. This included sizing the overall opportunity, developing plans to capture the target users, executing those plans, and reporting to the team on progress \n \n2.) Communicating to the sales, support, and marketing teams regarding new features & products to grow adoption \n \n3.) Aiding the sales team on large opportunities. This could be jumping on large potential acquisitions & getting them ramped up on the product or growing existing accounts to make sure they were maximizing the potential of our products. AdSense for Content Product Specialist Google May 2011  –  May 2014  (3 years 1 month) Mountain View, California I worked as a product specialist for our web-based product AdSense for Content. This typically spanned 3 functions: \n \n1.) Pitching product and engineering on new features & products. This included sizing the overall opportunity, developing plans to capture the target users, executing those plans, and reporting to the team on progress \n \n2.) Communicating to the sales, support, and marketing teams regarding new features & products to grow adoption \n \n3.) Aiding the sales team on large opportunities. This could be jumping on large potential acquisitions & getting them ramped up on the product or growing existing accounts to make sure they were maximizing the potential of our products. Product Marketing Manager National Instruments November 2008  –  May 2011  (2 years 7 months) Product Marketing Manager National Instruments November 2008  –  May 2011  (2 years 7 months) Engineering Leadership Program (ELP) National Instruments August 2007  –  November 2008  (1 year 4 months) Engineering Leadership Program (ELP) National Instruments August 2007  –  November 2008  (1 year 4 months) Engineering Summer Intern Northrop Grumman Corporation 2004  –  2006  (2 years) Engineering Summer Intern Northrop Grumman Corporation 2004  –  2006  (2 years) Skills Product Marketing Product Development Strategy Embedded Systems C++ Product Management Skills  Product Marketing Product Development Strategy Embedded Systems C++ Product Management Product Marketing Product Development Strategy Embedded Systems C++ Product Management Product Marketing Product Development Strategy Embedded Systems C++ Product Management Education Stanford University N/A - Stanford Center for Professional Development,  Computer Science 2012  – 2013 Rose-Hulman Institute of Technology BS,  Software Engineering 2003  – 2007 Stanford University N/A - Stanford Center for Professional Development,  Computer Science 2012  – 2013 Stanford University N/A - Stanford Center for Professional Development,  Computer Science 2012  – 2013 Stanford University N/A - Stanford Center for Professional Development,  Computer Science 2012  – 2013 Rose-Hulman Institute of Technology BS,  Software Engineering 2003  – 2007 Rose-Hulman Institute of Technology BS,  Software Engineering 2003  – 2007 Rose-Hulman Institute of Technology BS,  Software Engineering 2003  – 2007 ", "Experience Global Product Specialist Google May 2012  – Present (3 years 4 months) Greater New York City Area Founder AdByte Powered by Google August 2013  – Present (2 years 1 month) Greater New York City Area AdByte is a partnership among the 4A's, Ad Council and Google to help educate, train and develop young diverse talent while highlighting the connections between the advertising and technology industries. Greater China Strategy Consultant Google October 2014  –  December 2014  (3 months) Beijing City, China Pod Lead, Havas, IPG & Aegis Google July 2014  –  September 2014  (3 months) MAIP Alumni Executive Council, Online Communication Chair American Association of Advertising Agencies January 2012  –  December 2012  (1 year) Greater New York City Area Independent Creative Agency intern Google July 2011  –  August 2011  (2 months) San Francisco, California Teacher Assistant for Warrington College of Business University of Florida August 2010  –  May 2011  (10 months) Gainesville, Florida Account Management Intern Saatchi & Saatchi Healthcare Advertising Agency June 2010  –  August 2010  (3 months) New York City, New York Creative Services Department Intern NBC Universal & Telemundo 51 January 2010  –  May 2010  (5 months) Miramar, Florida East Asia Project Management Intern ALDION Consulting June 2006  –  July 2006  (2 months) Singapore, Singapore Global Product Specialist Google May 2012  – Present (3 years 4 months) Greater New York City Area Global Product Specialist Google May 2012  – Present (3 years 4 months) Greater New York City Area Founder AdByte Powered by Google August 2013  – Present (2 years 1 month) Greater New York City Area AdByte is a partnership among the 4A's, Ad Council and Google to help educate, train and develop young diverse talent while highlighting the connections between the advertising and technology industries. Founder AdByte Powered by Google August 2013  – Present (2 years 1 month) Greater New York City Area AdByte is a partnership among the 4A's, Ad Council and Google to help educate, train and develop young diverse talent while highlighting the connections between the advertising and technology industries. Greater China Strategy Consultant Google October 2014  –  December 2014  (3 months) Beijing City, China Greater China Strategy Consultant Google October 2014  –  December 2014  (3 months) Beijing City, China Pod Lead, Havas, IPG & Aegis Google July 2014  –  September 2014  (3 months) Pod Lead, Havas, IPG & Aegis Google July 2014  –  September 2014  (3 months) MAIP Alumni Executive Council, Online Communication Chair American Association of Advertising Agencies January 2012  –  December 2012  (1 year) Greater New York City Area MAIP Alumni Executive Council, Online Communication Chair American Association of Advertising Agencies January 2012  –  December 2012  (1 year) Greater New York City Area Independent Creative Agency intern Google July 2011  –  August 2011  (2 months) San Francisco, California Independent Creative Agency intern Google July 2011  –  August 2011  (2 months) San Francisco, California Teacher Assistant for Warrington College of Business University of Florida August 2010  –  May 2011  (10 months) Gainesville, Florida Teacher Assistant for Warrington College of Business University of Florida August 2010  –  May 2011  (10 months) Gainesville, Florida Account Management Intern Saatchi & Saatchi Healthcare Advertising Agency June 2010  –  August 2010  (3 months) New York City, New York Account Management Intern Saatchi & Saatchi Healthcare Advertising Agency June 2010  –  August 2010  (3 months) New York City, New York Creative Services Department Intern NBC Universal & Telemundo 51 January 2010  –  May 2010  (5 months) Miramar, Florida Creative Services Department Intern NBC Universal & Telemundo 51 January 2010  –  May 2010  (5 months) Miramar, Florida East Asia Project Management Intern ALDION Consulting June 2006  –  July 2006  (2 months) Singapore, Singapore East Asia Project Management Intern ALDION Consulting June 2006  –  July 2006  (2 months) Singapore, Singapore Languages   Skills Skills     Honors & Awards ", "Summary Trilingual French born engineer and business graduate based in London, working on launching Channel Intelligence, a recent acquisition, internationally. Experience in operations management, automation, product management, scaling of processes, business analysis reporting and 3rd party vendor management. \n \nIndustries: products online advertising, e-commerce and online payments. Summary Trilingual French born engineer and business graduate based in London, working on launching Channel Intelligence, a recent acquisition, internationally. Experience in operations management, automation, product management, scaling of processes, business analysis reporting and 3rd party vendor management. \n \nIndustries: products online advertising, e-commerce and online payments. Trilingual French born engineer and business graduate based in London, working on launching Channel Intelligence, a recent acquisition, internationally. Experience in operations management, automation, product management, scaling of processes, business analysis reporting and 3rd party vendor management. \n \nIndustries: products online advertising, e-commerce and online payments. Trilingual French born engineer and business graduate based in London, working on launching Channel Intelligence, a recent acquisition, internationally. Experience in operations management, automation, product management, scaling of processes, business analysis reporting and 3rd party vendor management. \n \nIndustries: products online advertising, e-commerce and online payments. Experience Pre-sales engineer and Delivery Manager, Channel Intelligence by Google Google September 2014  – Present (1 year) London, United Kingdom International Launch Lead, Channel Intelligence by Google Google June 2013  – Present (2 years 3 months) London, United Kingdom Product Listing Ads Specialist, Google Shopping Google November 2012  –  June 2013  (8 months) Ireland International Product Specialist, Google Wallet Google February 2012  –  November 2012  (10 months) Ireland Partner Manager, Google Shopping Operations UK Google July 2011  –  February 2012  (8 months) Ireland Product Manager Rangespan Ltd February 2011  –  July 2011  (6 months) London, United Kingdom Masters in Management student London Business School September 2010  –  June 2011  (10 months) London, United Kingdom Supply Chain Strategy Intern at Direction Générale Des Operations (DGO) L'Oreal S.A. February 2010  –  June 2010  (5 months) Paris Area, France Exchange Semester - Research visiting scholar at CIMSS Virginia Tech August 2009  –  December 2009  (5 months) System analysis & optimisation Horiba October 2008  –  January 2009  (4 months) Founder and team leader of a Multi-Level Marketing (MLM) organisation Self employed September 2007  –  May 2008  (9 months) Intern - Business Analyst AXA Tech July 2007  –  August 2007  (2 months) Intern - Manufacturing Renault June 2007  –  July 2007  (2 months) Pre-sales engineer and Delivery Manager, Channel Intelligence by Google Google September 2014  – Present (1 year) London, United Kingdom Pre-sales engineer and Delivery Manager, Channel Intelligence by Google Google September 2014  – Present (1 year) London, United Kingdom International Launch Lead, Channel Intelligence by Google Google June 2013  – Present (2 years 3 months) London, United Kingdom International Launch Lead, Channel Intelligence by Google Google June 2013  – Present (2 years 3 months) London, United Kingdom Product Listing Ads Specialist, Google Shopping Google November 2012  –  June 2013  (8 months) Ireland Product Listing Ads Specialist, Google Shopping Google November 2012  –  June 2013  (8 months) Ireland International Product Specialist, Google Wallet Google February 2012  –  November 2012  (10 months) Ireland International Product Specialist, Google Wallet Google February 2012  –  November 2012  (10 months) Ireland Partner Manager, Google Shopping Operations UK Google July 2011  –  February 2012  (8 months) Ireland Partner Manager, Google Shopping Operations UK Google July 2011  –  February 2012  (8 months) Ireland Product Manager Rangespan Ltd February 2011  –  July 2011  (6 months) London, United Kingdom Product Manager Rangespan Ltd February 2011  –  July 2011  (6 months) London, United Kingdom Masters in Management student London Business School September 2010  –  June 2011  (10 months) London, United Kingdom Masters in Management student London Business School September 2010  –  June 2011  (10 months) London, United Kingdom Supply Chain Strategy Intern at Direction Générale Des Operations (DGO) L'Oreal S.A. February 2010  –  June 2010  (5 months) Paris Area, France Supply Chain Strategy Intern at Direction Générale Des Operations (DGO) L'Oreal S.A. February 2010  –  June 2010  (5 months) Paris Area, France Exchange Semester - Research visiting scholar at CIMSS Virginia Tech August 2009  –  December 2009  (5 months) Exchange Semester - Research visiting scholar at CIMSS Virginia Tech August 2009  –  December 2009  (5 months) System analysis & optimisation Horiba October 2008  –  January 2009  (4 months) System analysis & optimisation Horiba October 2008  –  January 2009  (4 months) Founder and team leader of a Multi-Level Marketing (MLM) organisation Self employed September 2007  –  May 2008  (9 months) Founder and team leader of a Multi-Level Marketing (MLM) organisation Self employed September 2007  –  May 2008  (9 months) Intern - Business Analyst AXA Tech July 2007  –  August 2007  (2 months) Intern - Business Analyst AXA Tech July 2007  –  August 2007  (2 months) Intern - Manufacturing Renault June 2007  –  July 2007  (2 months) Intern - Manufacturing Renault June 2007  –  July 2007  (2 months) Languages English Native or bilingual proficiency French Native or bilingual proficiency Portuguese Professional working proficiency Spanish Limited working proficiency German Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Portuguese Professional working proficiency Spanish Limited working proficiency German Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Portuguese Professional working proficiency Spanish Limited working proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Elementary proficiency Skills E-commerce Business Analysis Operations Management Strategy Process Improvement Marketing Supply Chain Telecommunications Integration Online Advertising Business Strategy Vendor Management Public Speaking New Business Development Six Sigma Start-ups Customer Insight International Competitive Analysis Internationalization Product Launch Comparison Shopping... International Project... Partner Management Launch Operations Project Planning Business Analytics Product Forecasting Operations Improvement Customer Satisfaction Engineering XML Data Feeds JavaScript See 19+     See less Skills  E-commerce Business Analysis Operations Management Strategy Process Improvement Marketing Supply Chain Telecommunications Integration Online Advertising Business Strategy Vendor Management Public Speaking New Business Development Six Sigma Start-ups Customer Insight International Competitive Analysis Internationalization Product Launch Comparison Shopping... International Project... Partner Management Launch Operations Project Planning Business Analytics Product Forecasting Operations Improvement Customer Satisfaction Engineering XML Data Feeds JavaScript See 19+     See less E-commerce Business Analysis Operations Management Strategy Process Improvement Marketing Supply Chain Telecommunications Integration Online Advertising Business Strategy Vendor Management Public Speaking New Business Development Six Sigma Start-ups Customer Insight International Competitive Analysis Internationalization Product Launch Comparison Shopping... International Project... Partner Management Launch Operations Project Planning Business Analytics Product Forecasting Operations Improvement Customer Satisfaction Engineering XML Data Feeds JavaScript See 19+     See less E-commerce Business Analysis Operations Management Strategy Process Improvement Marketing Supply Chain Telecommunications Integration Online Advertising Business Strategy Vendor Management Public Speaking New Business Development Six Sigma Start-ups Customer Insight International Competitive Analysis Internationalization Product Launch Comparison Shopping... International Project... Partner Management Launch Operations Project Planning Business Analytics Product Forecasting Operations Improvement Customer Satisfaction Engineering XML Data Feeds JavaScript See 19+     See less Education London Business School Masters in Management 2010  – 2011 Icam - Institut Catholique d'Arts et Métiers Masters degree in Engineering 2005  – 2010 Virginia Polytechnic Institute and State University Visiting research scholar 2009  – 2009 London Business School Masters in Management 2010  – 2011 London Business School Masters in Management 2010  – 2011 London Business School Masters in Management 2010  – 2011 Icam - Institut Catholique d'Arts et Métiers Masters degree in Engineering 2005  – 2010 Icam - Institut Catholique d'Arts et Métiers Masters degree in Engineering 2005  – 2010 Icam - Institut Catholique d'Arts et Métiers Masters degree in Engineering 2005  – 2010 Virginia Polytechnic Institute and State University Visiting research scholar 2009  – 2009 Virginia Polytechnic Institute and State University Visiting research scholar 2009  – 2009 Virginia Polytechnic Institute and State University Visiting research scholar 2009  – 2009 Honors & Awards Additional Honors & Awards London Business School Annual Fund Scholarship Additional Honors & Awards London Business School Annual Fund Scholarship Additional Honors & Awards London Business School Annual Fund Scholarship Additional Honors & Awards London Business School Annual Fund Scholarship "]}