{"position": "Product Quality Associate", "company": "Google", "profiles": ["Experience Technical Program Manager Google April 2015  – Present (5 months) San Francisco Bay Area Product Quality Senior Strategist / Technical Program Manager Google December 2013  –  March 2015  (1 year 4 months) Ireland Advertising Quality Product Quality Strategist Google June 2012  –  November 2013  (1 year 6 months) Ireland Advertising Quality Product Quality Associate Google November 2010  –  June 2012  (1 year 8 months) Ireland Advertising Quality Teaching Assistant Universidade Nova de Lisboa March 2008  –  July 2010  (2 years 5 months) Portugal C++ and Matlab programming classes Technical Program Manager Google April 2015  – Present (5 months) San Francisco Bay Area Technical Program Manager Google April 2015  – Present (5 months) San Francisco Bay Area Product Quality Senior Strategist / Technical Program Manager Google December 2013  –  March 2015  (1 year 4 months) Ireland Advertising Quality Product Quality Senior Strategist / Technical Program Manager Google December 2013  –  March 2015  (1 year 4 months) Ireland Advertising Quality Product Quality Strategist Google June 2012  –  November 2013  (1 year 6 months) Ireland Advertising Quality Product Quality Strategist Google June 2012  –  November 2013  (1 year 6 months) Ireland Advertising Quality Product Quality Associate Google November 2010  –  June 2012  (1 year 8 months) Ireland Advertising Quality Product Quality Associate Google November 2010  –  June 2012  (1 year 8 months) Ireland Advertising Quality Teaching Assistant Universidade Nova de Lisboa March 2008  –  July 2010  (2 years 5 months) Portugal C++ and Matlab programming classes Teaching Assistant Universidade Nova de Lisboa March 2008  –  July 2010  (2 years 5 months) Portugal C++ and Matlab programming classes Languages English Portuguese English Portuguese English Portuguese Skills C Python Java JavaScript SQL XML Web Development Online Advertising Data Analysis Fraud Detection Programming Computer Science Distributed Systems Project Management Software Engineering HTML Matlab Linux C++ See 4+     See less Skills  C Python Java JavaScript SQL XML Web Development Online Advertising Data Analysis Fraud Detection Programming Computer Science Distributed Systems Project Management Software Engineering HTML Matlab Linux C++ See 4+     See less C Python Java JavaScript SQL XML Web Development Online Advertising Data Analysis Fraud Detection Programming Computer Science Distributed Systems Project Management Software Engineering HTML Matlab Linux C++ See 4+     See less C Python Java JavaScript SQL XML Web Development Online Advertising Data Analysis Fraud Detection Programming Computer Science Distributed Systems Project Management Software Engineering HTML Matlab Linux C++ See 4+     See less Education Universidade Nova de Lisboa Master of Science (MSc),  Computer Science 2008  – 2010 Universidade Nova de Lisboa Bachelor of Science (BSc),  Computer Science 2005  – 2008 Universidade Nova de Lisboa Master of Science (MSc),  Computer Science 2008  – 2010 Universidade Nova de Lisboa Master of Science (MSc),  Computer Science 2008  – 2010 Universidade Nova de Lisboa Master of Science (MSc),  Computer Science 2008  – 2010 Universidade Nova de Lisboa Bachelor of Science (BSc),  Computer Science 2005  – 2008 Universidade Nova de Lisboa Bachelor of Science (BSc),  Computer Science 2005  – 2008 Universidade Nova de Lisboa Bachelor of Science (BSc),  Computer Science 2005  – 2008 ", "Summary https://github.com/tiffanywei \n Summary https://github.com/tiffanywei \n https://github.com/tiffanywei \n https://github.com/tiffanywei \n Experience Product Quality Associate/Tools Developer Google July 2012  –  February 2015  (2 years 8 months) Mountain View, CA Adwords Risk -- Analytics and investigations for payment fraud and account hijackings \nDeveloped internal web applications for hijacking analysis and cleanup tools. \n Undergraduate Research Assistant Johns Hopkins University February 2011  –  August 2012  (1 year 7 months) Detector testing and instrumentation design in Chuck Bennett's group for the Cosmology Large Angular Scale Surveyor (CLASS), a telescope which will be placed in the Atacama desert in northern Chile to search for b-mode polarization due to gravitational waves in the cosmic microwave background. Undergraduate Teaching Assistant Johns Hopkins University January 2011  –  May 2011  (5 months) Prepare solutions to problem sets, grade problem sets, and aid students in Electronic, Optical, and Magnetic Properties of Materials (510.314) taught by Professor Ted Poehler. Undergraduate Research Assistant Johns Hopkins University January 2010  –  May 2010  (5 months) Investigated effects of UV light on tungsten oxide embedded in an FEP polymer matrix using UV spectroscopy. Characterized various nanoparticle-polymer composites. Designed techniques to synthesize FEP polymer matrix nano-composites. Product Quality Associate/Tools Developer Google July 2012  –  February 2015  (2 years 8 months) Mountain View, CA Adwords Risk -- Analytics and investigations for payment fraud and account hijackings \nDeveloped internal web applications for hijacking analysis and cleanup tools. \n Product Quality Associate/Tools Developer Google July 2012  –  February 2015  (2 years 8 months) Mountain View, CA Adwords Risk -- Analytics and investigations for payment fraud and account hijackings \nDeveloped internal web applications for hijacking analysis and cleanup tools. \n Undergraduate Research Assistant Johns Hopkins University February 2011  –  August 2012  (1 year 7 months) Detector testing and instrumentation design in Chuck Bennett's group for the Cosmology Large Angular Scale Surveyor (CLASS), a telescope which will be placed in the Atacama desert in northern Chile to search for b-mode polarization due to gravitational waves in the cosmic microwave background. Undergraduate Research Assistant Johns Hopkins University February 2011  –  August 2012  (1 year 7 months) Detector testing and instrumentation design in Chuck Bennett's group for the Cosmology Large Angular Scale Surveyor (CLASS), a telescope which will be placed in the Atacama desert in northern Chile to search for b-mode polarization due to gravitational waves in the cosmic microwave background. Undergraduate Teaching Assistant Johns Hopkins University January 2011  –  May 2011  (5 months) Prepare solutions to problem sets, grade problem sets, and aid students in Electronic, Optical, and Magnetic Properties of Materials (510.314) taught by Professor Ted Poehler. Undergraduate Teaching Assistant Johns Hopkins University January 2011  –  May 2011  (5 months) Prepare solutions to problem sets, grade problem sets, and aid students in Electronic, Optical, and Magnetic Properties of Materials (510.314) taught by Professor Ted Poehler. Undergraduate Research Assistant Johns Hopkins University January 2010  –  May 2010  (5 months) Investigated effects of UV light on tungsten oxide embedded in an FEP polymer matrix using UV spectroscopy. Characterized various nanoparticle-polymer composites. Designed techniques to synthesize FEP polymer matrix nano-composites. Undergraduate Research Assistant Johns Hopkins University January 2010  –  May 2010  (5 months) Investigated effects of UV light on tungsten oxide embedded in an FEP polymer matrix using UV spectroscopy. Characterized various nanoparticle-polymer composites. Designed techniques to synthesize FEP polymer matrix nano-composites. Skills JavaScript Python Java C++ LaTeX Research UML Laboratory Computer Science Calculus C Solidworks Numerical Analysis Data Reduction Zemax HTML CSS See 2+     See less Skills  JavaScript Python Java C++ LaTeX Research UML Laboratory Computer Science Calculus C Solidworks Numerical Analysis Data Reduction Zemax HTML CSS See 2+     See less JavaScript Python Java C++ LaTeX Research UML Laboratory Computer Science Calculus C Solidworks Numerical Analysis Data Reduction Zemax HTML CSS See 2+     See less JavaScript Python Java C++ LaTeX Research UML Laboratory Computer Science Calculus C Solidworks Numerical Analysis Data Reduction Zemax HTML CSS See 2+     See less Education The Johns Hopkins University BS,  Physics , 3.71 2008  – 2012 Relevant Coursework \n \nAstrophysics: Extragalactic Astronomy and Cosmology, Observational Astronomy \n \nPhysics: Classical Mechanics, Special Relativity, Electromagnetic Theory, Quantum Mechanics, Statistical Mechanics and Thermodynamics, Advanced Laboratory \n \nMathematics: Calculus I, II, III, Differential Equations, Linear Algebra, Complex Analysis, Real Analysis \n \nComputer Science: Java, C/C++/object oriented design, Python scripting \n \nEngineering: Chemical and Biological Processes, Structure of Materials, Statics, Dynamics, Mechanical Properties of Materials, Electronic, Magnetic, and Optical Properties of Materials Activities and Societies:  Sigma Pi Sigma san marino high The Johns Hopkins University BS,  Physics , 3.71 2008  – 2012 Relevant Coursework \n \nAstrophysics: Extragalactic Astronomy and Cosmology, Observational Astronomy \n \nPhysics: Classical Mechanics, Special Relativity, Electromagnetic Theory, Quantum Mechanics, Statistical Mechanics and Thermodynamics, Advanced Laboratory \n \nMathematics: Calculus I, II, III, Differential Equations, Linear Algebra, Complex Analysis, Real Analysis \n \nComputer Science: Java, C/C++/object oriented design, Python scripting \n \nEngineering: Chemical and Biological Processes, Structure of Materials, Statics, Dynamics, Mechanical Properties of Materials, Electronic, Magnetic, and Optical Properties of Materials Activities and Societies:  Sigma Pi Sigma The Johns Hopkins University BS,  Physics , 3.71 2008  – 2012 Relevant Coursework \n \nAstrophysics: Extragalactic Astronomy and Cosmology, Observational Astronomy \n \nPhysics: Classical Mechanics, Special Relativity, Electromagnetic Theory, Quantum Mechanics, Statistical Mechanics and Thermodynamics, Advanced Laboratory \n \nMathematics: Calculus I, II, III, Differential Equations, Linear Algebra, Complex Analysis, Real Analysis \n \nComputer Science: Java, C/C++/object oriented design, Python scripting \n \nEngineering: Chemical and Biological Processes, Structure of Materials, Statics, Dynamics, Mechanical Properties of Materials, Electronic, Magnetic, and Optical Properties of Materials Activities and Societies:  Sigma Pi Sigma The Johns Hopkins University BS,  Physics , 3.71 2008  – 2012 Relevant Coursework \n \nAstrophysics: Extragalactic Astronomy and Cosmology, Observational Astronomy \n \nPhysics: Classical Mechanics, Special Relativity, Electromagnetic Theory, Quantum Mechanics, Statistical Mechanics and Thermodynamics, Advanced Laboratory \n \nMathematics: Calculus I, II, III, Differential Equations, Linear Algebra, Complex Analysis, Real Analysis \n \nComputer Science: Java, C/C++/object oriented design, Python scripting \n \nEngineering: Chemical and Biological Processes, Structure of Materials, Statics, Dynamics, Mechanical Properties of Materials, Electronic, Magnetic, and Optical Properties of Materials Activities and Societies:  Sigma Pi Sigma san marino high san marino high san marino high Honors & Awards Additional Honors & Awards Sigma Pi Sigma Additional Honors & Awards Sigma Pi Sigma Additional Honors & Awards Sigma Pi Sigma Additional Honors & Awards Sigma Pi Sigma ", "Summary Profoundly talented and enthusiastic with substantial global exposure and experience with Google India specializing in Adwords Product Quality.  \nExcellent communication skills and and persistence to troubleshoot client issues with dynamic results oriented solutions. Skilled at analyzing options and savvy with SQL. Mined data using Tenzing on the MapReduce framework for some of Google's biggest clients.  \nCurrently looking for Analyst and Consult Management roles in Seattle, Washington. Summary Profoundly talented and enthusiastic with substantial global exposure and experience with Google India specializing in Adwords Product Quality.  \nExcellent communication skills and and persistence to troubleshoot client issues with dynamic results oriented solutions. Skilled at analyzing options and savvy with SQL. Mined data using Tenzing on the MapReduce framework for some of Google's biggest clients.  \nCurrently looking for Analyst and Consult Management roles in Seattle, Washington. Profoundly talented and enthusiastic with substantial global exposure and experience with Google India specializing in Adwords Product Quality.  \nExcellent communication skills and and persistence to troubleshoot client issues with dynamic results oriented solutions. Skilled at analyzing options and savvy with SQL. Mined data using Tenzing on the MapReduce framework for some of Google's biggest clients.  \nCurrently looking for Analyst and Consult Management roles in Seattle, Washington. Profoundly talented and enthusiastic with substantial global exposure and experience with Google India specializing in Adwords Product Quality.  \nExcellent communication skills and and persistence to troubleshoot client issues with dynamic results oriented solutions. Skilled at analyzing options and savvy with SQL. Mined data using Tenzing on the MapReduce framework for some of Google's biggest clients.  \nCurrently looking for Analyst and Consult Management roles in Seattle, Washington. Experience Associate Business Analyst Google May 2010  –  August 2014  (4 years 4 months) Hyderabad, Andhra Pradesh, India Channel Sales Analyst  \n● Business analyst for the reseller team that deals with Google partners and agencies.  \n● Initiated a dashboard monitoring system for the team to pull large scale data required for the reseller business.  \n● Mined data with SQL and Tenzing on the MapReduce framework for advertisers such as Yellow Pages, Reachlocal, Ford, DexMedia and Wordstream Product Quality Associate Google 2012  –  2014  (2 years) Hyderabad Area, India Product Quality Associate  \n● Review and Consult: A part of a two member team that resolved highly sensitive advertiser escalations in Google. This involved proactive policy enforcement takedowns via site level actions, filter creations and optimizations for tools. Process required collaborating with the Legal, Engineering, Policy and Quality teams to improve the quality of escalations and reduce overall spam rate on the Google network.  \n● Communications: Led a team of 4 in India to create a global consult training program that resulted in 45% reduction of consult volumes.  \nHosted an external Hangout with WoW (Women on the Web) via Google+ on site quality and content.  \n● Tool Management: Incorporated a tracker tool to the internal consult queues to record the quality of consults. Saw an overall reduction to less than 8% bad consults globally. Maintained and reviewed the tool codes.  \nAcquired skills in data analysis and dashboarding using #plx and ABI. (Tenzing, Powerdrill querying). \n● Awards: Won 14 peer nominated awards for consult resolutions, Sales communications and ads review with revenue impacts of over ~$200K/month for campaigns including Fansedge, Lids, Apple and Ultrashaft among others. Adwords Associate Google 2011  –  2012  (1 year) Hyderabad Area, India ● Reviewed highly confidential ads data in conjunction with the Legal Team for high tier accounts in Google like Ebay, Nextag and Pronto. Success rate was 64% reduction in escalations and 11% reduction in new requests preventing accounts from further strikes/disapprovals. \n● Lead POC for an Employee Engagement Initiative that focused on issues of employee involvement, career development and innovation. Collaborating with different teams and organizing tech talks, brainstorming sessions and fireside chats with Google business leads helped acquire time and people management skills along with different presentation styles and techniques. Adwords Representative Google 2010  –  2011  (1 year) Hyderabad Area, India Piloted project and mentored a team of 5 stakeholders to review quality of translated text and image ads for the Italian market.  \n● Project Management: Led a transliteration project for expedited consult and support for sales teams across 8 new markets with 100% quality within a quarter. Managed and trained a 12 member vendor team to take this forward. \n● Trained over 300 Googlers on reviewing ads in different formats/languages/markets and held sessions for over 20 sales teams on consult and support orientation across the San Francisco, Mountain View, Tokyo, Hyderabad and Gurgaon offices. Feature Writer and Event Coordinator Cluburb.com May 2009  –  February 2010  (10 months) Hyderabad Area, India Wrote feature articles and content for the web portal. Was also responsible for PR and Event coordination in the firm. Member AIESEC India 2009  –  2010  (1 year) Hyderabad Area, India Worked in Communications and Acquisitions of small businesses for the org Content Writer Wow! Magazine September 2008  –  February 2009  (6 months) hyderabad Worked in Communications and Acquisitions of small businesses for the org Event Manager The Times Of India February 2007  –  September 2007  (8 months) Hyderabad Area, India Event Manager for Times Youthopia'07 - a three day collegiate festival. Associate Business Analyst Google May 2010  –  August 2014  (4 years 4 months) Hyderabad, Andhra Pradesh, India Channel Sales Analyst  \n● Business analyst for the reseller team that deals with Google partners and agencies.  \n● Initiated a dashboard monitoring system for the team to pull large scale data required for the reseller business.  \n● Mined data with SQL and Tenzing on the MapReduce framework for advertisers such as Yellow Pages, Reachlocal, Ford, DexMedia and Wordstream Associate Business Analyst Google May 2010  –  August 2014  (4 years 4 months) Hyderabad, Andhra Pradesh, India Channel Sales Analyst  \n● Business analyst for the reseller team that deals with Google partners and agencies.  \n● Initiated a dashboard monitoring system for the team to pull large scale data required for the reseller business.  \n● Mined data with SQL and Tenzing on the MapReduce framework for advertisers such as Yellow Pages, Reachlocal, Ford, DexMedia and Wordstream Product Quality Associate Google 2012  –  2014  (2 years) Hyderabad Area, India Product Quality Associate  \n● Review and Consult: A part of a two member team that resolved highly sensitive advertiser escalations in Google. This involved proactive policy enforcement takedowns via site level actions, filter creations and optimizations for tools. Process required collaborating with the Legal, Engineering, Policy and Quality teams to improve the quality of escalations and reduce overall spam rate on the Google network.  \n● Communications: Led a team of 4 in India to create a global consult training program that resulted in 45% reduction of consult volumes.  \nHosted an external Hangout with WoW (Women on the Web) via Google+ on site quality and content.  \n● Tool Management: Incorporated a tracker tool to the internal consult queues to record the quality of consults. Saw an overall reduction to less than 8% bad consults globally. Maintained and reviewed the tool codes.  \nAcquired skills in data analysis and dashboarding using #plx and ABI. (Tenzing, Powerdrill querying). \n● Awards: Won 14 peer nominated awards for consult resolutions, Sales communications and ads review with revenue impacts of over ~$200K/month for campaigns including Fansedge, Lids, Apple and Ultrashaft among others. Product Quality Associate Google 2012  –  2014  (2 years) Hyderabad Area, India Product Quality Associate  \n● Review and Consult: A part of a two member team that resolved highly sensitive advertiser escalations in Google. This involved proactive policy enforcement takedowns via site level actions, filter creations and optimizations for tools. Process required collaborating with the Legal, Engineering, Policy and Quality teams to improve the quality of escalations and reduce overall spam rate on the Google network.  \n● Communications: Led a team of 4 in India to create a global consult training program that resulted in 45% reduction of consult volumes.  \nHosted an external Hangout with WoW (Women on the Web) via Google+ on site quality and content.  \n● Tool Management: Incorporated a tracker tool to the internal consult queues to record the quality of consults. Saw an overall reduction to less than 8% bad consults globally. Maintained and reviewed the tool codes.  \nAcquired skills in data analysis and dashboarding using #plx and ABI. (Tenzing, Powerdrill querying). \n● Awards: Won 14 peer nominated awards for consult resolutions, Sales communications and ads review with revenue impacts of over ~$200K/month for campaigns including Fansedge, Lids, Apple and Ultrashaft among others. Adwords Associate Google 2011  –  2012  (1 year) Hyderabad Area, India ● Reviewed highly confidential ads data in conjunction with the Legal Team for high tier accounts in Google like Ebay, Nextag and Pronto. Success rate was 64% reduction in escalations and 11% reduction in new requests preventing accounts from further strikes/disapprovals. \n● Lead POC for an Employee Engagement Initiative that focused on issues of employee involvement, career development and innovation. Collaborating with different teams and organizing tech talks, brainstorming sessions and fireside chats with Google business leads helped acquire time and people management skills along with different presentation styles and techniques. Adwords Associate Google 2011  –  2012  (1 year) Hyderabad Area, India ● Reviewed highly confidential ads data in conjunction with the Legal Team for high tier accounts in Google like Ebay, Nextag and Pronto. Success rate was 64% reduction in escalations and 11% reduction in new requests preventing accounts from further strikes/disapprovals. \n● Lead POC for an Employee Engagement Initiative that focused on issues of employee involvement, career development and innovation. Collaborating with different teams and organizing tech talks, brainstorming sessions and fireside chats with Google business leads helped acquire time and people management skills along with different presentation styles and techniques. Adwords Representative Google 2010  –  2011  (1 year) Hyderabad Area, India Piloted project and mentored a team of 5 stakeholders to review quality of translated text and image ads for the Italian market.  \n● Project Management: Led a transliteration project for expedited consult and support for sales teams across 8 new markets with 100% quality within a quarter. Managed and trained a 12 member vendor team to take this forward. \n● Trained over 300 Googlers on reviewing ads in different formats/languages/markets and held sessions for over 20 sales teams on consult and support orientation across the San Francisco, Mountain View, Tokyo, Hyderabad and Gurgaon offices. Adwords Representative Google 2010  –  2011  (1 year) Hyderabad Area, India Piloted project and mentored a team of 5 stakeholders to review quality of translated text and image ads for the Italian market.  \n● Project Management: Led a transliteration project for expedited consult and support for sales teams across 8 new markets with 100% quality within a quarter. Managed and trained a 12 member vendor team to take this forward. \n● Trained over 300 Googlers on reviewing ads in different formats/languages/markets and held sessions for over 20 sales teams on consult and support orientation across the San Francisco, Mountain View, Tokyo, Hyderabad and Gurgaon offices. Feature Writer and Event Coordinator Cluburb.com May 2009  –  February 2010  (10 months) Hyderabad Area, India Wrote feature articles and content for the web portal. Was also responsible for PR and Event coordination in the firm. Feature Writer and Event Coordinator Cluburb.com May 2009  –  February 2010  (10 months) Hyderabad Area, India Wrote feature articles and content for the web portal. Was also responsible for PR and Event coordination in the firm. Member AIESEC India 2009  –  2010  (1 year) Hyderabad Area, India Worked in Communications and Acquisitions of small businesses for the org Member AIESEC India 2009  –  2010  (1 year) Hyderabad Area, India Worked in Communications and Acquisitions of small businesses for the org Content Writer Wow! Magazine September 2008  –  February 2009  (6 months) hyderabad Worked in Communications and Acquisitions of small businesses for the org Content Writer Wow! Magazine September 2008  –  February 2009  (6 months) hyderabad Worked in Communications and Acquisitions of small businesses for the org Event Manager The Times Of India February 2007  –  September 2007  (8 months) Hyderabad Area, India Event Manager for Times Youthopia'07 - a three day collegiate festival. Event Manager The Times Of India February 2007  –  September 2007  (8 months) Hyderabad Area, India Event Manager for Times Youthopia'07 - a three day collegiate festival. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Team Management Event Management Project Management Team Leadership Microsoft Office Microsoft Excel Business Analysis Data Analysis SQL MapReduce Leadership Training & Development Employee Training Certified Trainer Skills  Team Management Event Management Project Management Team Leadership Microsoft Office Microsoft Excel Business Analysis Data Analysis SQL MapReduce Leadership Training & Development Employee Training Certified Trainer Team Management Event Management Project Management Team Leadership Microsoft Office Microsoft Excel Business Analysis Data Analysis SQL MapReduce Leadership Training & Development Employee Training Certified Trainer Team Management Event Management Project Management Team Leadership Microsoft Office Microsoft Excel Business Analysis Data Analysis SQL MapReduce Leadership Training & Development Employee Training Certified Trainer Education Mudra Institute of Communications Ahmedabad Post Graduate Certificate,  Public Relations , Advertising, and Applied Communication , A 2010  – 2011 St. Francis Degree College, Osmania University 3 years,  Biochemistry ,  Microbiology ,  Chemistry , A 2007  – 2010 Mudra Institute of Communications Ahmedabad Post Graduate Certificate,  Public Relations , Advertising, and Applied Communication , A 2010  – 2011 Mudra Institute of Communications Ahmedabad Post Graduate Certificate,  Public Relations , Advertising, and Applied Communication , A 2010  – 2011 Mudra Institute of Communications Ahmedabad Post Graduate Certificate,  Public Relations , Advertising, and Applied Communication , A 2010  – 2011 St. Francis Degree College, Osmania University 3 years,  Biochemistry ,  Microbiology ,  Chemistry , A 2007  – 2010 St. Francis Degree College, Osmania University 3 years,  Biochemistry ,  Microbiology ,  Chemistry , A 2007  – 2010 St. Francis Degree College, Osmania University 3 years,  Biochemistry ,  Microbiology ,  Chemistry , A 2007  – 2010 ", "Experience Founder/CEO Bloom Ready 2013  – Present (2 years) SF, OAK Bloom exists to help teams work better together through the communal experiences of coffee and tea. We leverage research and experiences from workplaces like Google to increase serendipitous interaction and make team familiarity a competitive advantage. Director of User Experience UniversityNow February 2012  –  August 2013  (1 year 7 months) Product Quality Associate Google August 2011  –  February 2012  (7 months) Mountain View * Worked on the search quality team to defend the integrity of Google search results \n* Led and helped organize a usability study for the Drupal 7 content editing interface that was live streamed and attracted 100+ viewers, co-sponsored by Google Open Source \n* Participated in multiple side projects with different arms of Google UX, including Hangouts and Google Small Business Solutions Founder/CEO Bloom Ready 2013  – Present (2 years) SF, OAK Bloom exists to help teams work better together through the communal experiences of coffee and tea. We leverage research and experiences from workplaces like Google to increase serendipitous interaction and make team familiarity a competitive advantage. Founder/CEO Bloom Ready 2013  – Present (2 years) SF, OAK Bloom exists to help teams work better together through the communal experiences of coffee and tea. We leverage research and experiences from workplaces like Google to increase serendipitous interaction and make team familiarity a competitive advantage. Director of User Experience UniversityNow February 2012  –  August 2013  (1 year 7 months) Director of User Experience UniversityNow February 2012  –  August 2013  (1 year 7 months) Product Quality Associate Google August 2011  –  February 2012  (7 months) Mountain View * Worked on the search quality team to defend the integrity of Google search results \n* Led and helped organize a usability study for the Drupal 7 content editing interface that was live streamed and attracted 100+ viewers, co-sponsored by Google Open Source \n* Participated in multiple side projects with different arms of Google UX, including Hangouts and Google Small Business Solutions Product Quality Associate Google August 2011  –  February 2012  (7 months) Mountain View * Worked on the search quality team to defend the integrity of Google search results \n* Led and helped organize a usability study for the Drupal 7 content editing interface that was live streamed and attracted 100+ viewers, co-sponsored by Google Open Source \n* Participated in multiple side projects with different arms of Google UX, including Hangouts and Google Small Business Solutions Skills Research Entrepreneurship Digital Strategy Web Analytics Specialty Coffee User Experience German Start-ups Strategy Analytics Social Networking Content Management Online Advertising Usability Testing Skills  Research Entrepreneurship Digital Strategy Web Analytics Specialty Coffee User Experience German Start-ups Strategy Analytics Social Networking Content Management Online Advertising Usability Testing Research Entrepreneurship Digital Strategy Web Analytics Specialty Coffee User Experience German Start-ups Strategy Analytics Social Networking Content Management Online Advertising Usability Testing Research Entrepreneurship Digital Strategy Web Analytics Specialty Coffee User Experience German Start-ups Strategy Analytics Social Networking Content Management Online Advertising Usability Testing Education Georgetown University Bachelor of Arts (BA),  Comparative Literature 2007  – 2011 I studied languages and literature, specifically German, French and Spanish. My thesis was a comparative study of Jewish literature in Mexico and Argentina. Georgetown University Bachelor of Arts (BA),  Comparative Literature 2007  – 2011 I studied languages and literature, specifically German, French and Spanish. My thesis was a comparative study of Jewish literature in Mexico and Argentina. Georgetown University Bachelor of Arts (BA),  Comparative Literature 2007  – 2011 I studied languages and literature, specifically German, French and Spanish. My thesis was a comparative study of Jewish literature in Mexico and Argentina. Georgetown University Bachelor of Arts (BA),  Comparative Literature 2007  – 2011 I studied languages and literature, specifically German, French and Spanish. My thesis was a comparative study of Jewish literature in Mexico and Argentina. ", "Summary I have a strong background in program management such as leading projects for a technical team involving cross-functional stakeholders (such as coordination of trainings on global scale, implementing workflows for experimental reviews), certified in Stanford Advanced Project Management. Further have also vendor management experience (COPC certified, implemented vendor teams for Ads Quality at Google); with in addition experience in localization (for Google Maps, Experimental ads formats, fluent in Dutch/Flemish and French). Summary I have a strong background in program management such as leading projects for a technical team involving cross-functional stakeholders (such as coordination of trainings on global scale, implementing workflows for experimental reviews), certified in Stanford Advanced Project Management. Further have also vendor management experience (COPC certified, implemented vendor teams for Ads Quality at Google); with in addition experience in localization (for Google Maps, Experimental ads formats, fluent in Dutch/Flemish and French). I have a strong background in program management such as leading projects for a technical team involving cross-functional stakeholders (such as coordination of trainings on global scale, implementing workflows for experimental reviews), certified in Stanford Advanced Project Management. Further have also vendor management experience (COPC certified, implemented vendor teams for Ads Quality at Google); with in addition experience in localization (for Google Maps, Experimental ads formats, fluent in Dutch/Flemish and French). I have a strong background in program management such as leading projects for a technical team involving cross-functional stakeholders (such as coordination of trainings on global scale, implementing workflows for experimental reviews), certified in Stanford Advanced Project Management. Further have also vendor management experience (COPC certified, implemented vendor teams for Ads Quality at Google); with in addition experience in localization (for Google Maps, Experimental ads formats, fluent in Dutch/Flemish and French). Experience Product Quality Strategist Google November 2013  – Present (1 year 10 months) Dublin *Program Manager: ​Lead several local and global projects, such as: Training/testing of new \nAdwords policies globally, resulting into marginal impact on quality and productivity despite important policy roll-out;creation of task force to analyze badness on new mobile format \n \n* Vendor Manager: ​Implemented and managed two vendors team (currently implementing one \nexperimental vendor teams) for Ads Quality Operations EMEA: Working with vendors partner \n(Arvato) to hire skilled reviewers (to cover 30 languages). Followed up on KPI’s \n(quality, productivity), collaborating with product specialist and business analyst to launch new \ntools; transitioned workflows and developed vendors strategy to improve workflows. Implemented in January 2015 new experimental vendor team. \n \n*Product Specialist: ​Product specialist of “Beta” formats, working on policies, bugs, escalating \nfeedback from vendors, improving workflow. \n \n Product Quality Associate Google August 2011  –  October 2013  (2 years 3 months) Dublin *French Market Leader: ​Lead the workflow of the French market across for Adwords on abuse investigation, and collaboration with legal team. Mentored new hires in French market.In addition lead the workflows of long-tail languages (Romanian, Lithuanian, Latvian). \n \n*Temp Recruiter and Manager: ​Lead the hiring process of temps for Ads Quality Operations \nin collaboration with agencies: screening CVs, interviews. 9 temps hired, managed 7. \n \n*Project Collaborator: ​Co-lead on several global scaled projects:  \ncoordination included training , strong quality control, follow-up with policy team and senior \nstakeholders; Mobile Point of Contact for EMEA Ads quality operations: triaging of \nbugs/communication on new tools / processes. Visual Data Specialist for Google Maps (contract with Manpower) Google September 2010  –  July 2011  (11 months) Dublin Country Specialist for Belgium/France/Netherlands: collaborated closely with program managers, \nengineers and vendors teams in different locations (Zurich, MountainView, Hyderabad), to \nescalate/prioritize Google maps bugs and adapt policies to European market issues. Lead the \nimplementation of Global Quality Reports from Country Specialist to highlight and improve quality on European maps, Assistant (Intern) to the Economic & Commercial Attaché Embassy of Belgium in Ireland February 2010  –  March 2010  (2 months) Teacher (Dutch & English) Educadomo ( Sodexo personal and home solutions) January 2009  –  June 2009  (6 months) Secondary school teacher (Dutch) Institut du Sacré-Coeur de Koekelberg October 2008  –  January 2009  (4 months) Product Quality Strategist Google November 2013  – Present (1 year 10 months) Dublin *Program Manager: ​Lead several local and global projects, such as: Training/testing of new \nAdwords policies globally, resulting into marginal impact on quality and productivity despite important policy roll-out;creation of task force to analyze badness on new mobile format \n \n* Vendor Manager: ​Implemented and managed two vendors team (currently implementing one \nexperimental vendor teams) for Ads Quality Operations EMEA: Working with vendors partner \n(Arvato) to hire skilled reviewers (to cover 30 languages). Followed up on KPI’s \n(quality, productivity), collaborating with product specialist and business analyst to launch new \ntools; transitioned workflows and developed vendors strategy to improve workflows. Implemented in January 2015 new experimental vendor team. \n \n*Product Specialist: ​Product specialist of “Beta” formats, working on policies, bugs, escalating \nfeedback from vendors, improving workflow. \n \n Product Quality Strategist Google November 2013  – Present (1 year 10 months) Dublin *Program Manager: ​Lead several local and global projects, such as: Training/testing of new \nAdwords policies globally, resulting into marginal impact on quality and productivity despite important policy roll-out;creation of task force to analyze badness on new mobile format \n \n* Vendor Manager: ​Implemented and managed two vendors team (currently implementing one \nexperimental vendor teams) for Ads Quality Operations EMEA: Working with vendors partner \n(Arvato) to hire skilled reviewers (to cover 30 languages). Followed up on KPI’s \n(quality, productivity), collaborating with product specialist and business analyst to launch new \ntools; transitioned workflows and developed vendors strategy to improve workflows. Implemented in January 2015 new experimental vendor team. \n \n*Product Specialist: ​Product specialist of “Beta” formats, working on policies, bugs, escalating \nfeedback from vendors, improving workflow. \n \n Product Quality Associate Google August 2011  –  October 2013  (2 years 3 months) Dublin *French Market Leader: ​Lead the workflow of the French market across for Adwords on abuse investigation, and collaboration with legal team. Mentored new hires in French market.In addition lead the workflows of long-tail languages (Romanian, Lithuanian, Latvian). \n \n*Temp Recruiter and Manager: ​Lead the hiring process of temps for Ads Quality Operations \nin collaboration with agencies: screening CVs, interviews. 9 temps hired, managed 7. \n \n*Project Collaborator: ​Co-lead on several global scaled projects:  \ncoordination included training , strong quality control, follow-up with policy team and senior \nstakeholders; Mobile Point of Contact for EMEA Ads quality operations: triaging of \nbugs/communication on new tools / processes. Product Quality Associate Google August 2011  –  October 2013  (2 years 3 months) Dublin *French Market Leader: ​Lead the workflow of the French market across for Adwords on abuse investigation, and collaboration with legal team. Mentored new hires in French market.In addition lead the workflows of long-tail languages (Romanian, Lithuanian, Latvian). \n \n*Temp Recruiter and Manager: ​Lead the hiring process of temps for Ads Quality Operations \nin collaboration with agencies: screening CVs, interviews. 9 temps hired, managed 7. \n \n*Project Collaborator: ​Co-lead on several global scaled projects:  \ncoordination included training , strong quality control, follow-up with policy team and senior \nstakeholders; Mobile Point of Contact for EMEA Ads quality operations: triaging of \nbugs/communication on new tools / processes. Visual Data Specialist for Google Maps (contract with Manpower) Google September 2010  –  July 2011  (11 months) Dublin Country Specialist for Belgium/France/Netherlands: collaborated closely with program managers, \nengineers and vendors teams in different locations (Zurich, MountainView, Hyderabad), to \nescalate/prioritize Google maps bugs and adapt policies to European market issues. Lead the \nimplementation of Global Quality Reports from Country Specialist to highlight and improve quality on European maps, Visual Data Specialist for Google Maps (contract with Manpower) Google September 2010  –  July 2011  (11 months) Dublin Country Specialist for Belgium/France/Netherlands: collaborated closely with program managers, \nengineers and vendors teams in different locations (Zurich, MountainView, Hyderabad), to \nescalate/prioritize Google maps bugs and adapt policies to European market issues. Lead the \nimplementation of Global Quality Reports from Country Specialist to highlight and improve quality on European maps, Assistant (Intern) to the Economic & Commercial Attaché Embassy of Belgium in Ireland February 2010  –  March 2010  (2 months) Assistant (Intern) to the Economic & Commercial Attaché Embassy of Belgium in Ireland February 2010  –  March 2010  (2 months) Teacher (Dutch & English) Educadomo ( Sodexo personal and home solutions) January 2009  –  June 2009  (6 months) Teacher (Dutch & English) Educadomo ( Sodexo personal and home solutions) January 2009  –  June 2009  (6 months) Secondary school teacher (Dutch) Institut du Sacré-Coeur de Koekelberg October 2008  –  January 2009  (4 months) Secondary school teacher (Dutch) Institut du Sacré-Coeur de Koekelberg October 2008  –  January 2009  (4 months) Languages English Native or bilingual proficiency French Native or bilingual proficiency Dutch Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Dutch Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Dutch Native or bilingual proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills English French Microsoft Office Translation Research Social Media Foreign Languages Online Advertising Google Adwords fixing the coffee... Dutch Data Analysis Advertising Online Marketing Market Research Localization Spanish Project Management Teamwork See 4+     See less Skills  English French Microsoft Office Translation Research Social Media Foreign Languages Online Advertising Google Adwords fixing the coffee... Dutch Data Analysis Advertising Online Marketing Market Research Localization Spanish Project Management Teamwork See 4+     See less English French Microsoft Office Translation Research Social Media Foreign Languages Online Advertising Google Adwords fixing the coffee... Dutch Data Analysis Advertising Online Marketing Market Research Localization Spanish Project Management Teamwork See 4+     See less English French Microsoft Office Translation Research Social Media Foreign Languages Online Advertising Google Adwords fixing the coffee... Dutch Data Analysis Advertising Online Marketing Market Research Localization Spanish Project Management Teamwork See 4+     See less Education Université catholique de Louvain Master,  Dutch and English Literature and Linguistics with a specialisation in Business Communication 2008  – 2010 Trinity College, Dublin Erasmus Exchange 2009  – 2009 Katholieke Universiteit Leuven Erasmus Belgica 2008  – 2009 Rijksuniversiteit Groningen Erasmus Exchange 2007  – 2008 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Dutch and English Literature and Linguistics 2005  – 2008 Hoge Universiteit Brussel Erasmus Belgica Exchange 2006  – 2007 Université catholique de Louvain Master,  Dutch and English Literature and Linguistics with a specialisation in Business Communication 2008  – 2010 Université catholique de Louvain Master,  Dutch and English Literature and Linguistics with a specialisation in Business Communication 2008  – 2010 Université catholique de Louvain Master,  Dutch and English Literature and Linguistics with a specialisation in Business Communication 2008  – 2010 Trinity College, Dublin Erasmus Exchange 2009  – 2009 Trinity College, Dublin Erasmus Exchange 2009  – 2009 Trinity College, Dublin Erasmus Exchange 2009  – 2009 Katholieke Universiteit Leuven Erasmus Belgica 2008  – 2009 Katholieke Universiteit Leuven Erasmus Belgica 2008  – 2009 Katholieke Universiteit Leuven Erasmus Belgica 2008  – 2009 Rijksuniversiteit Groningen Erasmus Exchange 2007  – 2008 Rijksuniversiteit Groningen Erasmus Exchange 2007  – 2008 Rijksuniversiteit Groningen Erasmus Exchange 2007  – 2008 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Dutch and English Literature and Linguistics 2005  – 2008 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Dutch and English Literature and Linguistics 2005  – 2008 Facultés universitaires 'Saint-Louis', Bruxelles Bachelor,  Dutch and English Literature and Linguistics 2005  – 2008 Hoge Universiteit Brussel Erasmus Belgica Exchange 2006  – 2007 Hoge Universiteit Brussel Erasmus Belgica Exchange 2006  – 2007 Hoge Universiteit Brussel Erasmus Belgica Exchange 2006  – 2007 ", "Experience Account Strategist Google January 2013  – Present (2 years 8 months) Hyderabad Area, India Account Strategist Google January 2013  – Present (2 years 8 months) Hyderabad Area, India Account Strategist Google January 2013  – Present (2 years 8 months) Hyderabad Area, India Skills Skills     ", "Experience Product Quality Strategist - Google Shopping Google April 2014  – Present (1 year 5 months) Mountain View, CA Product Quality Associate - AdWords Google August 2012  –  March 2014  (1 year 8 months) Mountain View, CA Marketing Intern VisionWeb January 2012  –  March 2012  (3 months) Austin, Texas Area • Wrote and edited content for marketing materials, eBooks, blog posts, and the website \n• Assisted in managing SEO of website/videos/blog \n• Assisted in running social media and email campaigns via HubSpot \n• Worked 15-20 hours/week while also in school full-time Assistant to the Executive Team ISNetworld May 2011  –  July 2011  (3 months) Dallas/Fort Worth Area Upstream/Mining Team Intern ISNetworld June 2010  –  August 2010  (3 months) Dallas/Fort Worth Area • Researched and created Global Banking report of requirements, namely KYC (Know Your Customer), for corporation subsidiaries in 12 countries in Europe and South America \n• Conducted non-renewing contractor analysis and proposed improvement strategies \n• Worked with and educated clients on software functionality \n• Prospected new business through cold-calling and emailing and assisted in managing current client accounts \n• Created and maintained company Facebook page \n• Rewrote industry white papers used for conference applications Product Quality Strategist - Google Shopping Google April 2014  – Present (1 year 5 months) Mountain View, CA Product Quality Strategist - Google Shopping Google April 2014  – Present (1 year 5 months) Mountain View, CA Product Quality Associate - AdWords Google August 2012  –  March 2014  (1 year 8 months) Mountain View, CA Product Quality Associate - AdWords Google August 2012  –  March 2014  (1 year 8 months) Mountain View, CA Marketing Intern VisionWeb January 2012  –  March 2012  (3 months) Austin, Texas Area • Wrote and edited content for marketing materials, eBooks, blog posts, and the website \n• Assisted in managing SEO of website/videos/blog \n• Assisted in running social media and email campaigns via HubSpot \n• Worked 15-20 hours/week while also in school full-time Marketing Intern VisionWeb January 2012  –  March 2012  (3 months) Austin, Texas Area • Wrote and edited content for marketing materials, eBooks, blog posts, and the website \n• Assisted in managing SEO of website/videos/blog \n• Assisted in running social media and email campaigns via HubSpot \n• Worked 15-20 hours/week while also in school full-time Assistant to the Executive Team ISNetworld May 2011  –  July 2011  (3 months) Dallas/Fort Worth Area Assistant to the Executive Team ISNetworld May 2011  –  July 2011  (3 months) Dallas/Fort Worth Area Upstream/Mining Team Intern ISNetworld June 2010  –  August 2010  (3 months) Dallas/Fort Worth Area • Researched and created Global Banking report of requirements, namely KYC (Know Your Customer), for corporation subsidiaries in 12 countries in Europe and South America \n• Conducted non-renewing contractor analysis and proposed improvement strategies \n• Worked with and educated clients on software functionality \n• Prospected new business through cold-calling and emailing and assisted in managing current client accounts \n• Created and maintained company Facebook page \n• Rewrote industry white papers used for conference applications Upstream/Mining Team Intern ISNetworld June 2010  –  August 2010  (3 months) Dallas/Fort Worth Area • Researched and created Global Banking report of requirements, namely KYC (Know Your Customer), for corporation subsidiaries in 12 countries in Europe and South America \n• Conducted non-renewing contractor analysis and proposed improvement strategies \n• Worked with and educated clients on software functionality \n• Prospected new business through cold-calling and emailing and assisted in managing current client accounts \n• Created and maintained company Facebook page \n• Rewrote industry white papers used for conference applications Languages Spanish Professional working proficiency Spanish Professional working proficiency Spanish Professional working proficiency Professional working proficiency Skills Microsoft Office PowerPoint Excel Social Media Customer Relations Online Marketing Direct Sales Advertising Sales Event Management Skills  Microsoft Office PowerPoint Excel Social Media Customer Relations Online Marketing Direct Sales Advertising Sales Event Management Microsoft Office PowerPoint Excel Social Media Customer Relations Online Marketing Direct Sales Advertising Sales Event Management Microsoft Office PowerPoint Excel Social Media Customer Relations Online Marketing Direct Sales Advertising Sales Event Management Education The University of Texas at Austin - The Red McCombs School of Business BBA, BA,  International Business ,  Spanish 2007  – 2012 Dean's List, University Honors, McCombs School of Business Honors Activities and Societies:  Planet Longhorn (International Exchange Student Organization) ,  API Study Abroad Sevilla ,  Study Abroad Semester - PUC Santiago ,  Chile Pontificia Universidad Católica de Chile Bachelor of Business Administration (BBA),  International Business 2011  – 2011 Activities and Societies:  Start-Up Chile Entrepreneurship Extracurricular Course Universidad de Sevilla BA,  Spanish Humanities 2009  – 2009 Activities and Societies:  Language Exchange Buddy Program The University of Texas at Austin - The Red McCombs School of Business BBA, BA,  International Business ,  Spanish 2007  – 2012 Dean's List, University Honors, McCombs School of Business Honors Activities and Societies:  Planet Longhorn (International Exchange Student Organization) ,  API Study Abroad Sevilla ,  Study Abroad Semester - PUC Santiago ,  Chile The University of Texas at Austin - The Red McCombs School of Business BBA, BA,  International Business ,  Spanish 2007  – 2012 Dean's List, University Honors, McCombs School of Business Honors Activities and Societies:  Planet Longhorn (International Exchange Student Organization) ,  API Study Abroad Sevilla ,  Study Abroad Semester - PUC Santiago ,  Chile The University of Texas at Austin - The Red McCombs School of Business BBA, BA,  International Business ,  Spanish 2007  – 2012 Dean's List, University Honors, McCombs School of Business Honors Activities and Societies:  Planet Longhorn (International Exchange Student Organization) ,  API Study Abroad Sevilla ,  Study Abroad Semester - PUC Santiago ,  Chile Pontificia Universidad Católica de Chile Bachelor of Business Administration (BBA),  International Business 2011  – 2011 Activities and Societies:  Start-Up Chile Entrepreneurship Extracurricular Course Pontificia Universidad Católica de Chile Bachelor of Business Administration (BBA),  International Business 2011  – 2011 Activities and Societies:  Start-Up Chile Entrepreneurship Extracurricular Course Pontificia Universidad Católica de Chile Bachelor of Business Administration (BBA),  International Business 2011  – 2011 Activities and Societies:  Start-Up Chile Entrepreneurship Extracurricular Course Universidad de Sevilla BA,  Spanish Humanities 2009  – 2009 Activities and Societies:  Language Exchange Buddy Program Universidad de Sevilla BA,  Spanish Humanities 2009  – 2009 Activities and Societies:  Language Exchange Buddy Program Universidad de Sevilla BA,  Spanish Humanities 2009  – 2009 Activities and Societies:  Language Exchange Buddy Program Honors & Awards Global Leadership Scholarship American Airlines August 2011 Received a round-trip flight from AA to study abroad in Santiago, Chile based on my academic achievements, work in promoting global education at the University of Texas, and dedication towards global development through education and technology Strategic Partners Scholarship CIBER April 2011 Awarded a study abroad scholarship based on decision to study abroad in a non-traditional location and dependent on the completion of a self-designed service project promoting global education the semester following my study abroad.  Accenture Leadership Series Accenture April 2011 • Selected as 1 of 20 participants, out of over 200 applicants, for a 5-week leadership series hosted by Accenture \n• Learned, practiced, and refined leadership qualities and techniques with key Accenture employees Additional Honors & Awards • American Airlines Global Leaders Scholarship – Roundtrip flight to study abroad \n• CIBER Strategic Partners Scholarship (Study Abroad Education Project) \n• Dean’s List/University Honors \n• McCombs Business School University Honors\t \n• International Education Fee Scholarship \n• McCombs Undergraduate Scholarship\t \n• Academic Programs International Study Abroad Scholarship Global Leadership Scholarship American Airlines August 2011 Received a round-trip flight from AA to study abroad in Santiago, Chile based on my academic achievements, work in promoting global education at the University of Texas, and dedication towards global development through education and technology Global Leadership Scholarship American Airlines August 2011 Received a round-trip flight from AA to study abroad in Santiago, Chile based on my academic achievements, work in promoting global education at the University of Texas, and dedication towards global development through education and technology Global Leadership Scholarship American Airlines August 2011 Received a round-trip flight from AA to study abroad in Santiago, Chile based on my academic achievements, work in promoting global education at the University of Texas, and dedication towards global development through education and technology Strategic Partners Scholarship CIBER April 2011 Awarded a study abroad scholarship based on decision to study abroad in a non-traditional location and dependent on the completion of a self-designed service project promoting global education the semester following my study abroad.  Strategic Partners Scholarship CIBER April 2011 Awarded a study abroad scholarship based on decision to study abroad in a non-traditional location and dependent on the completion of a self-designed service project promoting global education the semester following my study abroad.  Strategic Partners Scholarship CIBER April 2011 Awarded a study abroad scholarship based on decision to study abroad in a non-traditional location and dependent on the completion of a self-designed service project promoting global education the semester following my study abroad.  Accenture Leadership Series Accenture April 2011 • Selected as 1 of 20 participants, out of over 200 applicants, for a 5-week leadership series hosted by Accenture \n• Learned, practiced, and refined leadership qualities and techniques with key Accenture employees Accenture Leadership Series Accenture April 2011 • Selected as 1 of 20 participants, out of over 200 applicants, for a 5-week leadership series hosted by Accenture \n• Learned, practiced, and refined leadership qualities and techniques with key Accenture employees Accenture Leadership Series Accenture April 2011 • Selected as 1 of 20 participants, out of over 200 applicants, for a 5-week leadership series hosted by Accenture \n• Learned, practiced, and refined leadership qualities and techniques with key Accenture employees Additional Honors & Awards • American Airlines Global Leaders Scholarship – Roundtrip flight to study abroad \n• CIBER Strategic Partners Scholarship (Study Abroad Education Project) \n• Dean’s List/University Honors \n• McCombs Business School University Honors\t \n• International Education Fee Scholarship \n• McCombs Undergraduate Scholarship\t \n• Academic Programs International Study Abroad Scholarship Additional Honors & Awards • American Airlines Global Leaders Scholarship – Roundtrip flight to study abroad \n• CIBER Strategic Partners Scholarship (Study Abroad Education Project) \n• Dean’s List/University Honors \n• McCombs Business School University Honors\t \n• International Education Fee Scholarship \n• McCombs Undergraduate Scholarship\t \n• Academic Programs International Study Abroad Scholarship Additional Honors & Awards • American Airlines Global Leaders Scholarship – Roundtrip flight to study abroad \n• CIBER Strategic Partners Scholarship (Study Abroad Education Project) \n• Dean’s List/University Honors \n• McCombs Business School University Honors\t \n• International Education Fee Scholarship \n• McCombs Undergraduate Scholarship\t \n• Academic Programs International Study Abroad Scholarship ", "Summary I work as a Delivery Manager for Google in NYC which essentially means I manage client launches and organise the technical implementation of Shopping Comparison Engines (like Google Shopping, Shopping.com etc.). Apart from that I create temporary tattoos with grumpy cats and happy milk cartons. In general, I am fascinated by the funkier parts of the web, I love skiing, and I enjoy good coffee. Summary I work as a Delivery Manager for Google in NYC which essentially means I manage client launches and organise the technical implementation of Shopping Comparison Engines (like Google Shopping, Shopping.com etc.). Apart from that I create temporary tattoos with grumpy cats and happy milk cartons. In general, I am fascinated by the funkier parts of the web, I love skiing, and I enjoy good coffee. I work as a Delivery Manager for Google in NYC which essentially means I manage client launches and organise the technical implementation of Shopping Comparison Engines (like Google Shopping, Shopping.com etc.). Apart from that I create temporary tattoos with grumpy cats and happy milk cartons. In general, I am fascinated by the funkier parts of the web, I love skiing, and I enjoy good coffee. I work as a Delivery Manager for Google in NYC which essentially means I manage client launches and organise the technical implementation of Shopping Comparison Engines (like Google Shopping, Shopping.com etc.). Apart from that I create temporary tattoos with grumpy cats and happy milk cartons. In general, I am fascinated by the funkier parts of the web, I love skiing, and I enjoy good coffee. Experience Co-founder and Wizard Young & Smitten June 2013  – Present (2 years 3 months) Dublin, Ireland - Creating a real business for fake ink art \n- Making the world a better place one temporary tattoo at a time Delivery Manager Google February 2015  – Present (7 months) New York, United States Product Quality Strategist, EMEA/LATAM Google October 2013  –  February 2015  (1 year 5 months) Dublin, Ireland Product Quality Associate, EMEA/LATAM Google September 2012  –  October 2013  (1 year 2 months) Dublin, Ireland - Detecting and analyzing potential fraud and product abuse patterns on Google Shopping \n- Developing scalable systems to automate the fight against spam and fraud Product Development Manager Mobile Jazz April 2012  –  August 2012  (5 months) Barcelona, Spain - Analyzing the business requirements and opportunities for a social music app \n- Developing and implementing a product and marketing stategy for the pre-launch and early post-launch phases Associate Researcher CERN September 2010  –  August 2012  (2 years) Geneva, Switzerland and Vienna, Austria - Designing and conducting a social science study on the socio-technical entanglement in a large-scale particle physics environment \n- Analyzing and documenting the key challenges throughout a 20-year scientific project involving thousands of scientists Associate Product Marketing Manager Intern Google July 2009  –  October 2009  (4 months) Hamburg, Germany - Developing a new communication strategy to position a new value proposition for Search, considering latent conversions, offline purchases and long-time branding effects \n- Aggregating data of a YouTube campaign performance and effectiveness whitepaper featuring an audience analysis of YouTube users and campaign impact on behavioural metrics Supply Chain and Customer Service Intern Unilever July 2008  –  September 2008  (3 months) Tehran, Iran Research Consultant (PTE) The Frank Latzer Group February 2008  –  June 2008  (5 months) Vienna, Austria Team Leader Global Development, Project Manager, Trainer AIESEC October 2006  –  October 2007  (1 year 1 month) Vienna, Austria Community Health Service Intern, IT Coach CHAIN July 2007  –  August 2007  (2 months) Kampala, Uganda Co-founder and Wizard Young & Smitten June 2013  – Present (2 years 3 months) Dublin, Ireland - Creating a real business for fake ink art \n- Making the world a better place one temporary tattoo at a time Co-founder and Wizard Young & Smitten June 2013  – Present (2 years 3 months) Dublin, Ireland - Creating a real business for fake ink art \n- Making the world a better place one temporary tattoo at a time Delivery Manager Google February 2015  – Present (7 months) New York, United States Delivery Manager Google February 2015  – Present (7 months) New York, United States Product Quality Strategist, EMEA/LATAM Google October 2013  –  February 2015  (1 year 5 months) Dublin, Ireland Product Quality Strategist, EMEA/LATAM Google October 2013  –  February 2015  (1 year 5 months) Dublin, Ireland Product Quality Associate, EMEA/LATAM Google September 2012  –  October 2013  (1 year 2 months) Dublin, Ireland - Detecting and analyzing potential fraud and product abuse patterns on Google Shopping \n- Developing scalable systems to automate the fight against spam and fraud Product Quality Associate, EMEA/LATAM Google September 2012  –  October 2013  (1 year 2 months) Dublin, Ireland - Detecting and analyzing potential fraud and product abuse patterns on Google Shopping \n- Developing scalable systems to automate the fight against spam and fraud Product Development Manager Mobile Jazz April 2012  –  August 2012  (5 months) Barcelona, Spain - Analyzing the business requirements and opportunities for a social music app \n- Developing and implementing a product and marketing stategy for the pre-launch and early post-launch phases Product Development Manager Mobile Jazz April 2012  –  August 2012  (5 months) Barcelona, Spain - Analyzing the business requirements and opportunities for a social music app \n- Developing and implementing a product and marketing stategy for the pre-launch and early post-launch phases Associate Researcher CERN September 2010  –  August 2012  (2 years) Geneva, Switzerland and Vienna, Austria - Designing and conducting a social science study on the socio-technical entanglement in a large-scale particle physics environment \n- Analyzing and documenting the key challenges throughout a 20-year scientific project involving thousands of scientists Associate Researcher CERN September 2010  –  August 2012  (2 years) Geneva, Switzerland and Vienna, Austria - Designing and conducting a social science study on the socio-technical entanglement in a large-scale particle physics environment \n- Analyzing and documenting the key challenges throughout a 20-year scientific project involving thousands of scientists Associate Product Marketing Manager Intern Google July 2009  –  October 2009  (4 months) Hamburg, Germany - Developing a new communication strategy to position a new value proposition for Search, considering latent conversions, offline purchases and long-time branding effects \n- Aggregating data of a YouTube campaign performance and effectiveness whitepaper featuring an audience analysis of YouTube users and campaign impact on behavioural metrics Associate Product Marketing Manager Intern Google July 2009  –  October 2009  (4 months) Hamburg, Germany - Developing a new communication strategy to position a new value proposition for Search, considering latent conversions, offline purchases and long-time branding effects \n- Aggregating data of a YouTube campaign performance and effectiveness whitepaper featuring an audience analysis of YouTube users and campaign impact on behavioural metrics Supply Chain and Customer Service Intern Unilever July 2008  –  September 2008  (3 months) Tehran, Iran Supply Chain and Customer Service Intern Unilever July 2008  –  September 2008  (3 months) Tehran, Iran Research Consultant (PTE) The Frank Latzer Group February 2008  –  June 2008  (5 months) Vienna, Austria Research Consultant (PTE) The Frank Latzer Group February 2008  –  June 2008  (5 months) Vienna, Austria Team Leader Global Development, Project Manager, Trainer AIESEC October 2006  –  October 2007  (1 year 1 month) Vienna, Austria Team Leader Global Development, Project Manager, Trainer AIESEC October 2006  –  October 2007  (1 year 1 month) Vienna, Austria Community Health Service Intern, IT Coach CHAIN July 2007  –  August 2007  (2 months) Kampala, Uganda Community Health Service Intern, IT Coach CHAIN July 2007  –  August 2007  (2 months) Kampala, Uganda Languages German Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency French Limited working proficiency German Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency French Limited working proficiency German Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency French Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Limited working proficiency Skills Skills     Education Universität Wien MA (Mag. phil.),  Philosophy 2007  – 2012 Specialties: Epistemology, Phenomenology, Ontology, Philosophy of Mind, Philosophy of Action Wirtschaftsuniversität Wien MSc (Mag.rer.soc.oec.),  International Business 2005  – 2010 Specialties: Entrepreneurship & Innovation, International Marketing & Management Handelshögskolan i Stockholm CEMS MIM,  International Management 2008  – 2009 Specialties: Strategic Management, Cross-Cultural Management Universität Wien MA (Mag. phil.),  Philosophy 2007  – 2012 Specialties: Epistemology, Phenomenology, Ontology, Philosophy of Mind, Philosophy of Action Universität Wien MA (Mag. phil.),  Philosophy 2007  – 2012 Specialties: Epistemology, Phenomenology, Ontology, Philosophy of Mind, Philosophy of Action Universität Wien MA (Mag. phil.),  Philosophy 2007  – 2012 Specialties: Epistemology, Phenomenology, Ontology, Philosophy of Mind, Philosophy of Action Wirtschaftsuniversität Wien MSc (Mag.rer.soc.oec.),  International Business 2005  – 2010 Specialties: Entrepreneurship & Innovation, International Marketing & Management Wirtschaftsuniversität Wien MSc (Mag.rer.soc.oec.),  International Business 2005  – 2010 Specialties: Entrepreneurship & Innovation, International Marketing & Management Wirtschaftsuniversität Wien MSc (Mag.rer.soc.oec.),  International Business 2005  – 2010 Specialties: Entrepreneurship & Innovation, International Marketing & Management Handelshögskolan i Stockholm CEMS MIM,  International Management 2008  – 2009 Specialties: Strategic Management, Cross-Cultural Management Handelshögskolan i Stockholm CEMS MIM,  International Management 2008  – 2009 Specialties: Strategic Management, Cross-Cultural Management Handelshögskolan i Stockholm CEMS MIM,  International Management 2008  – 2009 Specialties: Strategic Management, Cross-Cultural Management ", "Experience Product Quality Associate Google January 2014  – Present (1 year 8 months) Hyderabad Area, India Product Quality Associate Google January 2014  – Present (1 year 8 months) Hyderabad Area, India Product Quality Associate Google January 2014  – Present (1 year 8 months) Hyderabad Area, India Skills User Experience User Research Data Analysis Cross-functional... Cross-functional... Policy Analysis Skills  User Experience User Research Data Analysis Cross-functional... Cross-functional... Policy Analysis User Experience User Research Data Analysis Cross-functional... Cross-functional... Policy Analysis User Experience User Research Data Analysis Cross-functional... Cross-functional... Policy Analysis Education Mount Carmel College, Bangalore Bachelor of Commerce (B.Com.) 2005  – 2008 Sophia High School Mount Carmel College, Bangalore Bachelor of Commerce (B.Com.) 2005  – 2008 Mount Carmel College, Bangalore Bachelor of Commerce (B.Com.) 2005  – 2008 Mount Carmel College, Bangalore Bachelor of Commerce (B.Com.) 2005  – 2008 Sophia High School Sophia High School Sophia High School ", "Experience Product Quality Associate Google January 2012  – Present (3 years 8 months) Dublin, Ireland Working as part of the quality operations team in Google I support the continued quality of the Google Ads Network. My tasks include \n* Proactive monitoring of the quality in the Google Display Network \n* Working on several different ads products and ensuring coverage for each \n* Analysing and interpreting large amounts of data and making decisions based on the outcome of the analyses \n* Internal and external education on Google's Terms and Conditions and Policies, including preparation of training materials and presentations \n* Detailed documentation of internal process in order to facilitate improvements \n* Communicating with our internal partners in Sales, Product and Engineering to help protect our products \n* Working with our product counsels and legal teams to ensure legal compliance  \n* Implementing scalable solutions to protect the network \n* Working with business partners across the globe \n* Training new team members and helping set up new operations in Hyderabad, India  German Customer Service Representative Arvato UK & Ireland May 2011  –  January 2012  (9 months) Dublin, Ireland Worked for a year as part of the customer service team in Arvato, working for Microsoft. This involved solving licensing and contract related issues in a business-to-business environment. A well as working as part of a smaller operational group within a large multinational company and working in a very target and deadline driven environment with hard work and overtime dedicated to meeting those targets my tasks also included: \n* Answering queries and solving problems using various tools at our disposal \n* Translating outgoing messages from German to English as well as organsing the German members of the organisations for translation work \n* Training new team members on our processes Intern ARIATHES Rechtsanwälte June 2010  –  July 2010  (2 months) Munich Area, Germany I worked as a part time intern for a German law firm specialising in competition law during my studies in the summer of 2010. My main responsibilities involved researching EU case law and relevant European and German statutes and presenting these in a report to senior management. I also helped translate relevant documents from English into German and maintain case files. Product Quality Associate Google January 2012  – Present (3 years 8 months) Dublin, Ireland Working as part of the quality operations team in Google I support the continued quality of the Google Ads Network. My tasks include \n* Proactive monitoring of the quality in the Google Display Network \n* Working on several different ads products and ensuring coverage for each \n* Analysing and interpreting large amounts of data and making decisions based on the outcome of the analyses \n* Internal and external education on Google's Terms and Conditions and Policies, including preparation of training materials and presentations \n* Detailed documentation of internal process in order to facilitate improvements \n* Communicating with our internal partners in Sales, Product and Engineering to help protect our products \n* Working with our product counsels and legal teams to ensure legal compliance  \n* Implementing scalable solutions to protect the network \n* Working with business partners across the globe \n* Training new team members and helping set up new operations in Hyderabad, India  Product Quality Associate Google January 2012  – Present (3 years 8 months) Dublin, Ireland Working as part of the quality operations team in Google I support the continued quality of the Google Ads Network. My tasks include \n* Proactive monitoring of the quality in the Google Display Network \n* Working on several different ads products and ensuring coverage for each \n* Analysing and interpreting large amounts of data and making decisions based on the outcome of the analyses \n* Internal and external education on Google's Terms and Conditions and Policies, including preparation of training materials and presentations \n* Detailed documentation of internal process in order to facilitate improvements \n* Communicating with our internal partners in Sales, Product and Engineering to help protect our products \n* Working with our product counsels and legal teams to ensure legal compliance  \n* Implementing scalable solutions to protect the network \n* Working with business partners across the globe \n* Training new team members and helping set up new operations in Hyderabad, India  German Customer Service Representative Arvato UK & Ireland May 2011  –  January 2012  (9 months) Dublin, Ireland Worked for a year as part of the customer service team in Arvato, working for Microsoft. This involved solving licensing and contract related issues in a business-to-business environment. A well as working as part of a smaller operational group within a large multinational company and working in a very target and deadline driven environment with hard work and overtime dedicated to meeting those targets my tasks also included: \n* Answering queries and solving problems using various tools at our disposal \n* Translating outgoing messages from German to English as well as organsing the German members of the organisations for translation work \n* Training new team members on our processes German Customer Service Representative Arvato UK & Ireland May 2011  –  January 2012  (9 months) Dublin, Ireland Worked for a year as part of the customer service team in Arvato, working for Microsoft. This involved solving licensing and contract related issues in a business-to-business environment. A well as working as part of a smaller operational group within a large multinational company and working in a very target and deadline driven environment with hard work and overtime dedicated to meeting those targets my tasks also included: \n* Answering queries and solving problems using various tools at our disposal \n* Translating outgoing messages from German to English as well as organsing the German members of the organisations for translation work \n* Training new team members on our processes Intern ARIATHES Rechtsanwälte June 2010  –  July 2010  (2 months) Munich Area, Germany I worked as a part time intern for a German law firm specialising in competition law during my studies in the summer of 2010. My main responsibilities involved researching EU case law and relevant European and German statutes and presenting these in a report to senior management. I also helped translate relevant documents from English into German and maintain case files. Intern ARIATHES Rechtsanwälte June 2010  –  July 2010  (2 months) Munich Area, Germany I worked as a part time intern for a German law firm specialising in competition law during my studies in the summer of 2010. My main responsibilities involved researching EU case law and relevant European and German statutes and presenting these in a report to senior management. I also helped translate relevant documents from English into German and maintain case files. Languages English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Problem Analysis Adsense Ad Exchanges Online Advertising Problem Solving Project Management Policy Development DoubleClick for... Privacy Law Data Protection Act Training & Development Google Docs Mobile Advertising International... Google Adwords SEO Microsoft Office Blogger Mobile Internet Intellectual Property... Social Networking IT Law IT Consulting Employee Training Product Management See 10+     See less Skills  Problem Analysis Adsense Ad Exchanges Online Advertising Problem Solving Project Management Policy Development DoubleClick for... Privacy Law Data Protection Act Training & Development Google Docs Mobile Advertising International... Google Adwords SEO Microsoft Office Blogger Mobile Internet Intellectual Property... Social Networking IT Law IT Consulting Employee Training Product Management See 10+     See less Problem Analysis Adsense Ad Exchanges Online Advertising Problem Solving Project Management Policy Development DoubleClick for... Privacy Law Data Protection Act Training & Development Google Docs Mobile Advertising International... Google Adwords SEO Microsoft Office Blogger Mobile Internet Intellectual Property... Social Networking IT Law IT Consulting Employee Training Product Management See 10+     See less Problem Analysis Adsense Ad Exchanges Online Advertising Problem Solving Project Management Policy Development DoubleClick for... Privacy Law Data Protection Act Training & Development Google Docs Mobile Advertising International... Google Adwords SEO Microsoft Office Blogger Mobile Internet Intellectual Property... Social Networking IT Law IT Consulting Employee Training Product Management See 10+     See less Education University College Dublin Master of Laws (LLM),  Intellectual Property & Information Technology Law 2012  – 2015 My main fields of study here have been geared towards Privacy and Data Protection as well as digital investigations. I have also had modules in EU competition law, Copyright Law and Online Governance and International Arbitration. All of these courses have not just focused on Ireland and the EU but have often compared the law here, with that in the United States where philosophically thoughts on subjects such as privacy and data protection are very different. \n \nTtitle of Thesis: 'The Role of Technology and Users in Protecting Privacy Online' University College Dublin Bachelor of Business and Law (European),  Law , 2.1 2007  – 2011 For the first two years my studies were evenly split between legal and business studies ranging from criminal, contract and tort law on the legal side to business management, accounting and information systems on the business side. In my final year I focused more on the law with 4 of my 6 core modules consisting of legal subjects. These included jurisprudence, equity and trusts, property and evidence law. On the business side I was more interested in international legal subjects and completed courses in European international relations and HRM as well as international businesses. Ludwig-Maximilians Universität München Bachelor of Business and Law (Erasmus),  Business and Law 2009  – 2010 I spent 1 year studying at the LMU in Munich. While there I studied Business and Law subjects through German. While the selection of subjects was relatively constrained by the terms of the Erasmus programme I tried to study a varied range of topics including business management, inheritance law, criminal legal history and jurisprudence. St. Kilians, German School Leaving Cert , 495 points 1995  – 2007 I attended both Primary School and Secondary School at this mixed international school. In Primary school almost all subjects were taught through German. After 6th class then the subjects were all taught through English in preparation for the Irish Junior and Leaving Certs.  \n \nMy leaving Cert subject choices included History, Physics, Biology and Accounting Activities and Societies:  Sports: Soccer ,  Hockey ,  Olympic Handball (Capt)\nAcademic: Debating (Capt) ,  Mentoring Programme ,  Drama University College Dublin Master of Laws (LLM),  Intellectual Property & Information Technology Law 2012  – 2015 My main fields of study here have been geared towards Privacy and Data Protection as well as digital investigations. I have also had modules in EU competition law, Copyright Law and Online Governance and International Arbitration. All of these courses have not just focused on Ireland and the EU but have often compared the law here, with that in the United States where philosophically thoughts on subjects such as privacy and data protection are very different. \n \nTtitle of Thesis: 'The Role of Technology and Users in Protecting Privacy Online' University College Dublin Master of Laws (LLM),  Intellectual Property & Information Technology Law 2012  – 2015 My main fields of study here have been geared towards Privacy and Data Protection as well as digital investigations. I have also had modules in EU competition law, Copyright Law and Online Governance and International Arbitration. All of these courses have not just focused on Ireland and the EU but have often compared the law here, with that in the United States where philosophically thoughts on subjects such as privacy and data protection are very different. \n \nTtitle of Thesis: 'The Role of Technology and Users in Protecting Privacy Online' University College Dublin Master of Laws (LLM),  Intellectual Property & Information Technology Law 2012  – 2015 My main fields of study here have been geared towards Privacy and Data Protection as well as digital investigations. I have also had modules in EU competition law, Copyright Law and Online Governance and International Arbitration. All of these courses have not just focused on Ireland and the EU but have often compared the law here, with that in the United States where philosophically thoughts on subjects such as privacy and data protection are very different. \n \nTtitle of Thesis: 'The Role of Technology and Users in Protecting Privacy Online' University College Dublin Bachelor of Business and Law (European),  Law , 2.1 2007  – 2011 For the first two years my studies were evenly split between legal and business studies ranging from criminal, contract and tort law on the legal side to business management, accounting and information systems on the business side. In my final year I focused more on the law with 4 of my 6 core modules consisting of legal subjects. These included jurisprudence, equity and trusts, property and evidence law. On the business side I was more interested in international legal subjects and completed courses in European international relations and HRM as well as international businesses. University College Dublin Bachelor of Business and Law (European),  Law , 2.1 2007  – 2011 For the first two years my studies were evenly split between legal and business studies ranging from criminal, contract and tort law on the legal side to business management, accounting and information systems on the business side. In my final year I focused more on the law with 4 of my 6 core modules consisting of legal subjects. These included jurisprudence, equity and trusts, property and evidence law. On the business side I was more interested in international legal subjects and completed courses in European international relations and HRM as well as international businesses. University College Dublin Bachelor of Business and Law (European),  Law , 2.1 2007  – 2011 For the first two years my studies were evenly split between legal and business studies ranging from criminal, contract and tort law on the legal side to business management, accounting and information systems on the business side. In my final year I focused more on the law with 4 of my 6 core modules consisting of legal subjects. These included jurisprudence, equity and trusts, property and evidence law. On the business side I was more interested in international legal subjects and completed courses in European international relations and HRM as well as international businesses. Ludwig-Maximilians Universität München Bachelor of Business and Law (Erasmus),  Business and Law 2009  – 2010 I spent 1 year studying at the LMU in Munich. While there I studied Business and Law subjects through German. While the selection of subjects was relatively constrained by the terms of the Erasmus programme I tried to study a varied range of topics including business management, inheritance law, criminal legal history and jurisprudence. Ludwig-Maximilians Universität München Bachelor of Business and Law (Erasmus),  Business and Law 2009  – 2010 I spent 1 year studying at the LMU in Munich. While there I studied Business and Law subjects through German. While the selection of subjects was relatively constrained by the terms of the Erasmus programme I tried to study a varied range of topics including business management, inheritance law, criminal legal history and jurisprudence. Ludwig-Maximilians Universität München Bachelor of Business and Law (Erasmus),  Business and Law 2009  – 2010 I spent 1 year studying at the LMU in Munich. While there I studied Business and Law subjects through German. While the selection of subjects was relatively constrained by the terms of the Erasmus programme I tried to study a varied range of topics including business management, inheritance law, criminal legal history and jurisprudence. St. Kilians, German School Leaving Cert , 495 points 1995  – 2007 I attended both Primary School and Secondary School at this mixed international school. In Primary school almost all subjects were taught through German. After 6th class then the subjects were all taught through English in preparation for the Irish Junior and Leaving Certs.  \n \nMy leaving Cert subject choices included History, Physics, Biology and Accounting Activities and Societies:  Sports: Soccer ,  Hockey ,  Olympic Handball (Capt)\nAcademic: Debating (Capt) ,  Mentoring Programme ,  Drama St. Kilians, German School Leaving Cert , 495 points 1995  – 2007 I attended both Primary School and Secondary School at this mixed international school. In Primary school almost all subjects were taught through German. After 6th class then the subjects were all taught through English in preparation for the Irish Junior and Leaving Certs.  \n \nMy leaving Cert subject choices included History, Physics, Biology and Accounting Activities and Societies:  Sports: Soccer ,  Hockey ,  Olympic Handball (Capt)\nAcademic: Debating (Capt) ,  Mentoring Programme ,  Drama St. Kilians, German School Leaving Cert , 495 points 1995  – 2007 I attended both Primary School and Secondary School at this mixed international school. In Primary school almost all subjects were taught through German. After 6th class then the subjects were all taught through English in preparation for the Irish Junior and Leaving Certs.  \n \nMy leaving Cert subject choices included History, Physics, Biology and Accounting Activities and Societies:  Sports: Soccer ,  Hockey ,  Olympic Handball (Capt)\nAcademic: Debating (Capt) ,  Mentoring Programme ,  Drama Honors & Awards ", "Summary Mange and Optimize the product, Goode AdWords \nFight against badness and improve User/Customer experience  Specialties:Practiced developer of C/C++, Matlab, VHDL, VERILOG \nSignal & Image Processing \nMachine Learning Summary Mange and Optimize the product, Goode AdWords \nFight against badness and improve User/Customer experience  Specialties:Practiced developer of C/C++, Matlab, VHDL, VERILOG \nSignal & Image Processing \nMachine Learning Mange and Optimize the product, Goode AdWords \nFight against badness and improve User/Customer experience  Specialties:Practiced developer of C/C++, Matlab, VHDL, VERILOG \nSignal & Image Processing \nMachine Learning Mange and Optimize the product, Goode AdWords \nFight against badness and improve User/Customer experience  Specialties:Practiced developer of C/C++, Matlab, VHDL, VERILOG \nSignal & Image Processing \nMachine Learning Experience Product Quality Strategist Google February 2014  – Present (1 year 7 months) Singapore Product Quality Associate Google August 2011  –  February 2014  (2 years 7 months) Beijing Engineering Intern Broadcom January 2011  –  August 2011  (8 months) - 65nm LP process physical digital design development \n- 130nm/65nm LP low power design methodology development \n- RTL/Gate/physical level low power design for both front-end and back-end, include Place&Route, LVS and DRC RF DVT Intern Entropic Communications October 2010  –  December 2010  (3 months) Develop and Implement RFIC Test Plans \n-Test automation software development, test execution, and test results reporting and analysis \n-Lab equipment setup and debug/data collection for various engineering experiments Engineering Intern Qualcomm June 2010  –  September 2010  (4 months) Text Recognition/Detection System  \n-Develop machine learning software for mobile user interactions \n-Lab equipment setup and debug/data collection for various engineering experiments Engineering Intern Tetra Pak July 2008  –  August 2008  (2 months) Vision System \n- Research on the fundamentals of vision system technology applied to Packaging industry \n- Analyze the performance of package traceability \n \nPLC System \n- Research on the PLC system technology applied to Packaging industry \n- Design the PLC system with Proficy Machine Edition (GE Fanuc) Product Quality Strategist Google February 2014  – Present (1 year 7 months) Singapore Product Quality Strategist Google February 2014  – Present (1 year 7 months) Singapore Product Quality Associate Google August 2011  –  February 2014  (2 years 7 months) Beijing Product Quality Associate Google August 2011  –  February 2014  (2 years 7 months) Beijing Engineering Intern Broadcom January 2011  –  August 2011  (8 months) - 65nm LP process physical digital design development \n- 130nm/65nm LP low power design methodology development \n- RTL/Gate/physical level low power design for both front-end and back-end, include Place&Route, LVS and DRC Engineering Intern Broadcom January 2011  –  August 2011  (8 months) - 65nm LP process physical digital design development \n- 130nm/65nm LP low power design methodology development \n- RTL/Gate/physical level low power design for both front-end and back-end, include Place&Route, LVS and DRC RF DVT Intern Entropic Communications October 2010  –  December 2010  (3 months) Develop and Implement RFIC Test Plans \n-Test automation software development, test execution, and test results reporting and analysis \n-Lab equipment setup and debug/data collection for various engineering experiments RF DVT Intern Entropic Communications October 2010  –  December 2010  (3 months) Develop and Implement RFIC Test Plans \n-Test automation software development, test execution, and test results reporting and analysis \n-Lab equipment setup and debug/data collection for various engineering experiments Engineering Intern Qualcomm June 2010  –  September 2010  (4 months) Text Recognition/Detection System  \n-Develop machine learning software for mobile user interactions \n-Lab equipment setup and debug/data collection for various engineering experiments Engineering Intern Qualcomm June 2010  –  September 2010  (4 months) Text Recognition/Detection System  \n-Develop machine learning software for mobile user interactions \n-Lab equipment setup and debug/data collection for various engineering experiments Engineering Intern Tetra Pak July 2008  –  August 2008  (2 months) Vision System \n- Research on the fundamentals of vision system technology applied to Packaging industry \n- Analyze the performance of package traceability \n \nPLC System \n- Research on the PLC system technology applied to Packaging industry \n- Design the PLC system with Proficy Machine Edition (GE Fanuc) Engineering Intern Tetra Pak July 2008  –  August 2008  (2 months) Vision System \n- Research on the fundamentals of vision system technology applied to Packaging industry \n- Analyze the performance of package traceability \n \nPLC System \n- Research on the PLC system technology applied to Packaging industry \n- Design the PLC system with Proficy Machine Edition (GE Fanuc) Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Matlab Algorithms SQL C++ Verilog Vendor Management Data Modeling Databases Skills  Matlab Algorithms SQL C++ Verilog Vendor Management Data Modeling Databases Matlab Algorithms SQL C++ Verilog Vendor Management Data Modeling Databases Matlab Algorithms SQL C++ Verilog Vendor Management Data Modeling Databases Education University of California, San Diego Master of Science,  Electrical & Computer Engineering , 3.63 2009  – 2011 Signal&Image Processing Tsinghua University Bachelor of Science,  Automation , 3.75 2005  – 2009 Activities and Societies:  1.President of External Relation in Student Union ,  Department of Automation ,  Tsinghua University\n- Major organizer of 2006 Freshman Banquet and Student Festival ,  Department of Automation\n- Stage supervisor of 2007 Student Festival ,  Department of Automation\n- Financial administrator of Freshman Banquet and Student Festival ,  Department of Automation\n- Toastmaster for 2005 Freshman Banquet ,  Department of Automation\n2. Volunteer in 2006 ANA Beijing International Marathon University of California, San Diego Master of Science,  Electrical & Computer Engineering , 3.63 2009  – 2011 Signal&Image Processing University of California, San Diego Master of Science,  Electrical & Computer Engineering , 3.63 2009  – 2011 Signal&Image Processing University of California, San Diego Master of Science,  Electrical & Computer Engineering , 3.63 2009  – 2011 Signal&Image Processing Tsinghua University Bachelor of Science,  Automation , 3.75 2005  – 2009 Activities and Societies:  1.President of External Relation in Student Union ,  Department of Automation ,  Tsinghua University\n- Major organizer of 2006 Freshman Banquet and Student Festival ,  Department of Automation\n- Stage supervisor of 2007 Student Festival ,  Department of Automation\n- Financial administrator of Freshman Banquet and Student Festival ,  Department of Automation\n- Toastmaster for 2005 Freshman Banquet ,  Department of Automation\n2. Volunteer in 2006 ANA Beijing International Marathon Tsinghua University Bachelor of Science,  Automation , 3.75 2005  – 2009 Activities and Societies:  1.President of External Relation in Student Union ,  Department of Automation ,  Tsinghua University\n- Major organizer of 2006 Freshman Banquet and Student Festival ,  Department of Automation\n- Stage supervisor of 2007 Student Festival ,  Department of Automation\n- Financial administrator of Freshman Banquet and Student Festival ,  Department of Automation\n- Toastmaster for 2005 Freshman Banquet ,  Department of Automation\n2. Volunteer in 2006 ANA Beijing International Marathon Tsinghua University Bachelor of Science,  Automation , 3.75 2005  – 2009 Activities and Societies:  1.President of External Relation in Student Union ,  Department of Automation ,  Tsinghua University\n- Major organizer of 2006 Freshman Banquet and Student Festival ,  Department of Automation\n- Stage supervisor of 2007 Student Festival ,  Department of Automation\n- Financial administrator of Freshman Banquet and Student Festival ,  Department of Automation\n- Toastmaster for 2005 Freshman Banquet ,  Department of Automation\n2. Volunteer in 2006 ANA Beijing International Marathon Honors & Awards Additional Honors & Awards 1. Qualcomm Fellowship in UCSD \n2. Silver medal in the National Physics Contest of University Students \n3. Golden medal in the Electronic Working Technology Practice of Tsinghua University \n4. Admission scholarship in Tsinghua University \n5. Ranked in the top 50 (out of 105,871 ) in the National College Entrance Examination \n6. Silver medal in National (China) Olympic Mathematics Contest of High School Students \n7. Golden medal in Beijing Olympic Mathematics Contest of High School Students \n8. Golden medal in Beijing Olympic Physics Contest of High School Students \n9. Golden medal in Beijing Olympic Mathematics Contest of Middle School Students \n10. Golden medal in Beijing Olympic Physics Contest of Middle School Students \n11. Honored class 3 electric technician in China Additional Honors & Awards 1. Qualcomm Fellowship in UCSD \n2. Silver medal in the National Physics Contest of University Students \n3. Golden medal in the Electronic Working Technology Practice of Tsinghua University \n4. Admission scholarship in Tsinghua University \n5. Ranked in the top 50 (out of 105,871 ) in the National College Entrance Examination \n6. Silver medal in National (China) Olympic Mathematics Contest of High School Students \n7. Golden medal in Beijing Olympic Mathematics Contest of High School Students \n8. Golden medal in Beijing Olympic Physics Contest of High School Students \n9. Golden medal in Beijing Olympic Mathematics Contest of Middle School Students \n10. Golden medal in Beijing Olympic Physics Contest of Middle School Students \n11. Honored class 3 electric technician in China Additional Honors & Awards 1. Qualcomm Fellowship in UCSD \n2. Silver medal in the National Physics Contest of University Students \n3. Golden medal in the Electronic Working Technology Practice of Tsinghua University \n4. Admission scholarship in Tsinghua University \n5. Ranked in the top 50 (out of 105,871 ) in the National College Entrance Examination \n6. Silver medal in National (China) Olympic Mathematics Contest of High School Students \n7. Golden medal in Beijing Olympic Mathematics Contest of High School Students \n8. Golden medal in Beijing Olympic Physics Contest of High School Students \n9. Golden medal in Beijing Olympic Mathematics Contest of Middle School Students \n10. Golden medal in Beijing Olympic Physics Contest of Middle School Students \n11. Honored class 3 electric technician in China Additional Honors & Awards 1. Qualcomm Fellowship in UCSD \n2. Silver medal in the National Physics Contest of University Students \n3. Golden medal in the Electronic Working Technology Practice of Tsinghua University \n4. Admission scholarship in Tsinghua University \n5. Ranked in the top 50 (out of 105,871 ) in the National College Entrance Examination \n6. Silver medal in National (China) Olympic Mathematics Contest of High School Students \n7. Golden medal in Beijing Olympic Mathematics Contest of High School Students \n8. Golden medal in Beijing Olympic Physics Contest of High School Students \n9. Golden medal in Beijing Olympic Mathematics Contest of Middle School Students \n10. Golden medal in Beijing Olympic Physics Contest of Middle School Students \n11. Honored class 3 electric technician in China ", "Summary *Summary of Professional Experience* \n \nCurrently driving new product development for a growth-stage startup which enables top brands to connect with a highly desired travel consumer base via our award winning Global First Party Data and Marketing Platform. \n \nAt Google, part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads and led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse on Google's ad network. \n \nAlumnus of a board that led a $5M national service-learning initiative on behalf of State Farm's philanthropic organization (statefarmyab.com) \n \nWorked closely with 3 early-stage startups: athleon.com (tech), lumana.org (microfinance), and ukourt.com (social) \n \nPastor at C3 Church Silicon Valley (c3sv.com) \n \n*Goals* \nCreate, implement and advocate game-changing solutions that address highly relevant needs of a community \n \nContinue to position myself in roles which cultivate my passion for problem solving and an appetite to learn Summary *Summary of Professional Experience* \n \nCurrently driving new product development for a growth-stage startup which enables top brands to connect with a highly desired travel consumer base via our award winning Global First Party Data and Marketing Platform. \n \nAt Google, part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads and led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse on Google's ad network. \n \nAlumnus of a board that led a $5M national service-learning initiative on behalf of State Farm's philanthropic organization (statefarmyab.com) \n \nWorked closely with 3 early-stage startups: athleon.com (tech), lumana.org (microfinance), and ukourt.com (social) \n \nPastor at C3 Church Silicon Valley (c3sv.com) \n \n*Goals* \nCreate, implement and advocate game-changing solutions that address highly relevant needs of a community \n \nContinue to position myself in roles which cultivate my passion for problem solving and an appetite to learn *Summary of Professional Experience* \n \nCurrently driving new product development for a growth-stage startup which enables top brands to connect with a highly desired travel consumer base via our award winning Global First Party Data and Marketing Platform. \n \nAt Google, part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads and led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse on Google's ad network. \n \nAlumnus of a board that led a $5M national service-learning initiative on behalf of State Farm's philanthropic organization (statefarmyab.com) \n \nWorked closely with 3 early-stage startups: athleon.com (tech), lumana.org (microfinance), and ukourt.com (social) \n \nPastor at C3 Church Silicon Valley (c3sv.com) \n \n*Goals* \nCreate, implement and advocate game-changing solutions that address highly relevant needs of a community \n \nContinue to position myself in roles which cultivate my passion for problem solving and an appetite to learn *Summary of Professional Experience* \n \nCurrently driving new product development for a growth-stage startup which enables top brands to connect with a highly desired travel consumer base via our award winning Global First Party Data and Marketing Platform. \n \nAt Google, part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads and led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse on Google's ad network. \n \nAlumnus of a board that led a $5M national service-learning initiative on behalf of State Farm's philanthropic organization (statefarmyab.com) \n \nWorked closely with 3 early-stage startups: athleon.com (tech), lumana.org (microfinance), and ukourt.com (social) \n \nPastor at C3 Church Silicon Valley (c3sv.com) \n \n*Goals* \nCreate, implement and advocate game-changing solutions that address highly relevant needs of a community \n \nContinue to position myself in roles which cultivate my passion for problem solving and an appetite to learn Experience Associate Pastor and General Manager C3 Church Silicon Valley February 2015  – Present (7 months) Director Product Management Adara November 2013  – Present (1 year 10 months) Mountain View, CA Product Manager Adara October 2012  – Present (2 years 11 months) Product Quality Associate Google August 2011  –  October 2012  (1 year 3 months) Mountain View, CA - Was part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads through cutting-edge technologies and risk models \n \n- Led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse trends on Google's ad network (Recipient of the Q1 2012 Product Quality Operations Platinum Award) \n \n- Project managed for the creation of a trend tracking tool that provides deep insights into advertiser behavior and fraud trends and coded a function for the tool using Python (Recipient of the Q3 2012 Product Quality Operations Gold Award) \n \n- Analyzed user feedback through spam reports, took appropriate actions, and generated impact data \n \n- Co-owned the English Region Market Report and delivered high level strategic recommendations to upper management and various stakeholders (engineering, PMs, and directors) \n \n- Traveled to Hyderabad, India for training on a workflow which increased the scope of work and responsibilities for our team in Mountain View \n \n- 20% Project with Marketing to put together copy/content across 29 initiatives around the globe for the launch of Google.com/entrepreneurs \n \n- 1% Volunteer Project with Sacred Heart of San Jose and provided marketing plan to double individual giving \n \n- 1st place out of 25 ideas in the Global Ads Quality Operations Ideas Competition Youth Advisory Board Member State Farm Insurance May 2009  –  January 2012  (2 years 9 months) - Designed and implemented a $5 million-a-year signature service-learning initiative to address issues in local communities pertaining to: environmental responsibility, access to higher education, financial literacy education, disaster preparedness, and driver safety \n \n- Served on the Communication and Publicity Committee and focusing on internal and external outreach for the SFYAB by connecting with the public media, creating marketing collateral, and assisting in the redesign of the SFYAB website \n \n- Executed innovative marketing plan which contributed to a 425% increase in grant applications for my zone \n \n- Increased funded grants in my zone by over 100% and $380,000 were allocated to the funded grants in my zone \n \n- National Service-Learning Conference MC (nslc.nylc.org) \n \nwww.StateFarmYAB.com Program Assistant for \"Entrepreneur of the Year Awards Gala\" Ernst & Young February 2011  –  June 2011  (5 months) - Assisted the Program Manager for the EY Gala in marketing related initiatives for the event including video promotion preparation, marketing collateral, and PR management Manager Montlake Consulting Group April 2009  –  June 2011  (2 years 3 months) - Student run, non-profit consultancy based out of the University of Washington connecting top students with Fortune 500, SMB, and start-up companies. Previous engagements with Starbucks, Microsoft, Expeditors International, and Real Networks. \n \n- Managed engagement with emerging micro-finance nonprofit, Lumana Credit and delivered a grant framework, social investment marketing slick, and donor party toolkit to assist them in their goal of raising $400K \n \n- Provided consulting services to CyberStreams IT firm by delivering an industry analysis, entry strategy, and marketing plan addressing how the company should package their EMR solutions to the healthcare industry \n \n- Independently contracted out by CyberStreams to strategically re-brand their marketing materials for design, clarity, and SEO purposes. Delivered through the creation of 4 new service slicks, 1 new newspaper ad, and a website transformation recommendation.  \n \nwww.montlakeconsulting.com Youth Mentor Warren Miller Freedom Foundation January 2011  –  May 2011  (5 months) - Taught weekly entrepreneurship classes to middle school students \n \n- Consulted teams of students to plan, start, and operate their own businesses \n \nwww.warrenmiller.org Marketing Coordinator/Tech Administrator University of Washington August 2008  –  April 2011  (2 years 9 months) - Created marketing content for Center of Innovation & Entrepreneurship to show investors and to recruit students \n \n- Assisted the Office of Information Management analyze and implement a new school-wide online student system \n \n- Maintained the Dept. of Oral Biology’s website and eased transition to new web platform for course websites Systems Integration Consulting Intern Accenture June 2010  –  August 2010  (3 months) Clearwire Engagement: IT Operations Division \n- Conducted PMO activities including worked with team leads to create standard processes documentation, assisted in knowledge transition process, and prepared metrics report on weekly basis of team's performance and activity \n \n- Daily managed and analyzed unresolved company-wide IT issues  \n \n- Improved risk management process and analytics procedure \n \n- Assisted Senior Manager in putting together Account Planning & Strategy presentation deck and Team Lead in creating Value Added presentation deck \n \n- Attended nationwide 2010 Student Leadership Conference in St. Charles, Illinois Marketing Intern 16 Copenhagen March 2009  –  May 2010  (1 year 3 months) - Increased traffic and leads generated on company website by over 40% with the implementation of SEO, social media strategies, and blog maintenance \n \n- Conducted market research on 16C's target market and created a 16C business development and marketing strategy guide \n \n- Contributed to the creative marketing strategy for the Yuen Lui account with the creation of the \"Yuen Lui Marketing Associate Program\" \n \n- Produced two promotional videos \n \n- Enabled publicity exposure for 16C to an audience of 50K+ by signing on a startup client, VibeGlobe \n \n- Engaged in strategic networking and created a business strategy report that was adopted for CEO use \n \nwww.16Copenhagen.com Finance and Audit Intern CB Richard Ellis June 2008  –  September 2008  (4 months) - Audited and assisted in preparing quarterly financial statements  \n \n- Assisted and developed capital, vacancy, lease assumption, budget, reforecast, and monthly expenditure reports  \n \n- Received a score of 96 and 94 out of 100 on two internal audits of lease files I helped prepare Area 5 President Washington DECA 2006  –  2007  (1 year) - Assisted in running and facilitating area-wide, state-wide, and nation-wide conferences  \n \n- Traveled locally to promote DECA in Washington and attended International Leadership Development Conferences in Dallas and Florida Associate Pastor and General Manager C3 Church Silicon Valley February 2015  – Present (7 months) Associate Pastor and General Manager C3 Church Silicon Valley February 2015  – Present (7 months) Director Product Management Adara November 2013  – Present (1 year 10 months) Mountain View, CA Director Product Management Adara November 2013  – Present (1 year 10 months) Mountain View, CA Product Manager Adara October 2012  – Present (2 years 11 months) Product Manager Adara October 2012  – Present (2 years 11 months) Product Quality Associate Google August 2011  –  October 2012  (1 year 3 months) Mountain View, CA - Was part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads through cutting-edge technologies and risk models \n \n- Led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse trends on Google's ad network (Recipient of the Q1 2012 Product Quality Operations Platinum Award) \n \n- Project managed for the creation of a trend tracking tool that provides deep insights into advertiser behavior and fraud trends and coded a function for the tool using Python (Recipient of the Q3 2012 Product Quality Operations Gold Award) \n \n- Analyzed user feedback through spam reports, took appropriate actions, and generated impact data \n \n- Co-owned the English Region Market Report and delivered high level strategic recommendations to upper management and various stakeholders (engineering, PMs, and directors) \n \n- Traveled to Hyderabad, India for training on a workflow which increased the scope of work and responsibilities for our team in Mountain View \n \n- 20% Project with Marketing to put together copy/content across 29 initiatives around the globe for the launch of Google.com/entrepreneurs \n \n- 1% Volunteer Project with Sacred Heart of San Jose and provided marketing plan to double individual giving \n \n- 1st place out of 25 ideas in the Global Ads Quality Operations Ideas Competition Product Quality Associate Google August 2011  –  October 2012  (1 year 3 months) Mountain View, CA - Was part of a global effort amongst ops, product, policy, and engineering teams to improve the quality of Google ads through cutting-edge technologies and risk models \n \n- Led an initiative in collaboration with legal and PR teams to identify and proactively detect egregious spam, fraud and abuse trends on Google's ad network (Recipient of the Q1 2012 Product Quality Operations Platinum Award) \n \n- Project managed for the creation of a trend tracking tool that provides deep insights into advertiser behavior and fraud trends and coded a function for the tool using Python (Recipient of the Q3 2012 Product Quality Operations Gold Award) \n \n- Analyzed user feedback through spam reports, took appropriate actions, and generated impact data \n \n- Co-owned the English Region Market Report and delivered high level strategic recommendations to upper management and various stakeholders (engineering, PMs, and directors) \n \n- Traveled to Hyderabad, India for training on a workflow which increased the scope of work and responsibilities for our team in Mountain View \n \n- 20% Project with Marketing to put together copy/content across 29 initiatives around the globe for the launch of Google.com/entrepreneurs \n \n- 1% Volunteer Project with Sacred Heart of San Jose and provided marketing plan to double individual giving \n \n- 1st place out of 25 ideas in the Global Ads Quality Operations Ideas Competition Youth Advisory Board Member State Farm Insurance May 2009  –  January 2012  (2 years 9 months) - Designed and implemented a $5 million-a-year signature service-learning initiative to address issues in local communities pertaining to: environmental responsibility, access to higher education, financial literacy education, disaster preparedness, and driver safety \n \n- Served on the Communication and Publicity Committee and focusing on internal and external outreach for the SFYAB by connecting with the public media, creating marketing collateral, and assisting in the redesign of the SFYAB website \n \n- Executed innovative marketing plan which contributed to a 425% increase in grant applications for my zone \n \n- Increased funded grants in my zone by over 100% and $380,000 were allocated to the funded grants in my zone \n \n- National Service-Learning Conference MC (nslc.nylc.org) \n \nwww.StateFarmYAB.com Youth Advisory Board Member State Farm Insurance May 2009  –  January 2012  (2 years 9 months) - Designed and implemented a $5 million-a-year signature service-learning initiative to address issues in local communities pertaining to: environmental responsibility, access to higher education, financial literacy education, disaster preparedness, and driver safety \n \n- Served on the Communication and Publicity Committee and focusing on internal and external outreach for the SFYAB by connecting with the public media, creating marketing collateral, and assisting in the redesign of the SFYAB website \n \n- Executed innovative marketing plan which contributed to a 425% increase in grant applications for my zone \n \n- Increased funded grants in my zone by over 100% and $380,000 were allocated to the funded grants in my zone \n \n- National Service-Learning Conference MC (nslc.nylc.org) \n \nwww.StateFarmYAB.com Program Assistant for \"Entrepreneur of the Year Awards Gala\" Ernst & Young February 2011  –  June 2011  (5 months) - Assisted the Program Manager for the EY Gala in marketing related initiatives for the event including video promotion preparation, marketing collateral, and PR management Program Assistant for \"Entrepreneur of the Year Awards Gala\" Ernst & Young February 2011  –  June 2011  (5 months) - Assisted the Program Manager for the EY Gala in marketing related initiatives for the event including video promotion preparation, marketing collateral, and PR management Manager Montlake Consulting Group April 2009  –  June 2011  (2 years 3 months) - Student run, non-profit consultancy based out of the University of Washington connecting top students with Fortune 500, SMB, and start-up companies. Previous engagements with Starbucks, Microsoft, Expeditors International, and Real Networks. \n \n- Managed engagement with emerging micro-finance nonprofit, Lumana Credit and delivered a grant framework, social investment marketing slick, and donor party toolkit to assist them in their goal of raising $400K \n \n- Provided consulting services to CyberStreams IT firm by delivering an industry analysis, entry strategy, and marketing plan addressing how the company should package their EMR solutions to the healthcare industry \n \n- Independently contracted out by CyberStreams to strategically re-brand their marketing materials for design, clarity, and SEO purposes. Delivered through the creation of 4 new service slicks, 1 new newspaper ad, and a website transformation recommendation.  \n \nwww.montlakeconsulting.com Manager Montlake Consulting Group April 2009  –  June 2011  (2 years 3 months) - Student run, non-profit consultancy based out of the University of Washington connecting top students with Fortune 500, SMB, and start-up companies. Previous engagements with Starbucks, Microsoft, Expeditors International, and Real Networks. \n \n- Managed engagement with emerging micro-finance nonprofit, Lumana Credit and delivered a grant framework, social investment marketing slick, and donor party toolkit to assist them in their goal of raising $400K \n \n- Provided consulting services to CyberStreams IT firm by delivering an industry analysis, entry strategy, and marketing plan addressing how the company should package their EMR solutions to the healthcare industry \n \n- Independently contracted out by CyberStreams to strategically re-brand their marketing materials for design, clarity, and SEO purposes. Delivered through the creation of 4 new service slicks, 1 new newspaper ad, and a website transformation recommendation.  \n \nwww.montlakeconsulting.com Youth Mentor Warren Miller Freedom Foundation January 2011  –  May 2011  (5 months) - Taught weekly entrepreneurship classes to middle school students \n \n- Consulted teams of students to plan, start, and operate their own businesses \n \nwww.warrenmiller.org Youth Mentor Warren Miller Freedom Foundation January 2011  –  May 2011  (5 months) - Taught weekly entrepreneurship classes to middle school students \n \n- Consulted teams of students to plan, start, and operate their own businesses \n \nwww.warrenmiller.org Marketing Coordinator/Tech Administrator University of Washington August 2008  –  April 2011  (2 years 9 months) - Created marketing content for Center of Innovation & Entrepreneurship to show investors and to recruit students \n \n- Assisted the Office of Information Management analyze and implement a new school-wide online student system \n \n- Maintained the Dept. of Oral Biology’s website and eased transition to new web platform for course websites Marketing Coordinator/Tech Administrator University of Washington August 2008  –  April 2011  (2 years 9 months) - Created marketing content for Center of Innovation & Entrepreneurship to show investors and to recruit students \n \n- Assisted the Office of Information Management analyze and implement a new school-wide online student system \n \n- Maintained the Dept. of Oral Biology’s website and eased transition to new web platform for course websites Systems Integration Consulting Intern Accenture June 2010  –  August 2010  (3 months) Clearwire Engagement: IT Operations Division \n- Conducted PMO activities including worked with team leads to create standard processes documentation, assisted in knowledge transition process, and prepared metrics report on weekly basis of team's performance and activity \n \n- Daily managed and analyzed unresolved company-wide IT issues  \n \n- Improved risk management process and analytics procedure \n \n- Assisted Senior Manager in putting together Account Planning & Strategy presentation deck and Team Lead in creating Value Added presentation deck \n \n- Attended nationwide 2010 Student Leadership Conference in St. Charles, Illinois Systems Integration Consulting Intern Accenture June 2010  –  August 2010  (3 months) Clearwire Engagement: IT Operations Division \n- Conducted PMO activities including worked with team leads to create standard processes documentation, assisted in knowledge transition process, and prepared metrics report on weekly basis of team's performance and activity \n \n- Daily managed and analyzed unresolved company-wide IT issues  \n \n- Improved risk management process and analytics procedure \n \n- Assisted Senior Manager in putting together Account Planning & Strategy presentation deck and Team Lead in creating Value Added presentation deck \n \n- Attended nationwide 2010 Student Leadership Conference in St. Charles, Illinois Marketing Intern 16 Copenhagen March 2009  –  May 2010  (1 year 3 months) - Increased traffic and leads generated on company website by over 40% with the implementation of SEO, social media strategies, and blog maintenance \n \n- Conducted market research on 16C's target market and created a 16C business development and marketing strategy guide \n \n- Contributed to the creative marketing strategy for the Yuen Lui account with the creation of the \"Yuen Lui Marketing Associate Program\" \n \n- Produced two promotional videos \n \n- Enabled publicity exposure for 16C to an audience of 50K+ by signing on a startup client, VibeGlobe \n \n- Engaged in strategic networking and created a business strategy report that was adopted for CEO use \n \nwww.16Copenhagen.com Marketing Intern 16 Copenhagen March 2009  –  May 2010  (1 year 3 months) - Increased traffic and leads generated on company website by over 40% with the implementation of SEO, social media strategies, and blog maintenance \n \n- Conducted market research on 16C's target market and created a 16C business development and marketing strategy guide \n \n- Contributed to the creative marketing strategy for the Yuen Lui account with the creation of the \"Yuen Lui Marketing Associate Program\" \n \n- Produced two promotional videos \n \n- Enabled publicity exposure for 16C to an audience of 50K+ by signing on a startup client, VibeGlobe \n \n- Engaged in strategic networking and created a business strategy report that was adopted for CEO use \n \nwww.16Copenhagen.com Finance and Audit Intern CB Richard Ellis June 2008  –  September 2008  (4 months) - Audited and assisted in preparing quarterly financial statements  \n \n- Assisted and developed capital, vacancy, lease assumption, budget, reforecast, and monthly expenditure reports  \n \n- Received a score of 96 and 94 out of 100 on two internal audits of lease files I helped prepare Finance and Audit Intern CB Richard Ellis June 2008  –  September 2008  (4 months) - Audited and assisted in preparing quarterly financial statements  \n \n- Assisted and developed capital, vacancy, lease assumption, budget, reforecast, and monthly expenditure reports  \n \n- Received a score of 96 and 94 out of 100 on two internal audits of lease files I helped prepare Area 5 President Washington DECA 2006  –  2007  (1 year) - Assisted in running and facilitating area-wide, state-wide, and nation-wide conferences  \n \n- Traveled locally to promote DECA in Washington and attended International Leadership Development Conferences in Dallas and Florida Area 5 President Washington DECA 2006  –  2007  (1 year) - Assisted in running and facilitating area-wide, state-wide, and nation-wide conferences  \n \n- Traveled locally to promote DECA in Washington and attended International Leadership Development Conferences in Dallas and Florida Skills Online Advertising Project Management Product Management Management Consulting Storytelling Entrepreneurship Analysis Social Media Public Speaking Business Strategy Program Management Marketing PowerPoint Processes Development Process Improvement Case Studies Relationship Management Team Leadership Nonprofits Sales Market Research Analytics Negotiation Business Development Marketing Strategy See 10+     See less Skills  Online Advertising Project Management Product Management Management Consulting Storytelling Entrepreneurship Analysis Social Media Public Speaking Business Strategy Program Management Marketing PowerPoint Processes Development Process Improvement Case Studies Relationship Management Team Leadership Nonprofits Sales Market Research Analytics Negotiation Business Development Marketing Strategy See 10+     See less Online Advertising Project Management Product Management Management Consulting Storytelling Entrepreneurship Analysis Social Media Public Speaking Business Strategy Program Management Marketing PowerPoint Processes Development Process Improvement Case Studies Relationship Management Team Leadership Nonprofits Sales Market Research Analytics Negotiation Business Development Marketing Strategy See 10+     See less Online Advertising Project Management Product Management Management Consulting Storytelling Entrepreneurship Analysis Social Media Public Speaking Business Strategy Program Management Marketing PowerPoint Processes Development Process Improvement Case Studies Relationship Management Team Leadership Nonprofits Sales Market Research Analytics Negotiation Business Development Marketing Strategy See 10+     See less Education University of Washington, Michael G. Foster School of Business Business,  Marketing and Information Systems , 3.8 (Cum Laude) 2007  – 2011 *Global Case Competition Experience* \nBEDC Diversity in Business Case Competition Sponsored by Target - 1st Place \nKPMG Case Competition (UW & West Regionals) - 1st Place  \nDeloitte Case Competition - 1st Place  \nErnst and Young Case Competition - 1st Place  \nPricewaterhouse Coopers xAct Case Competition - 1st Place \nThammasat Undergraduate Business Competition (Bangkok, Thailand) - Finalist \nMUSH Ethics Case Competition Participant \n \n*Foster School of Business*  \nTraveled to South Africa (Business Exploration Program) \nGraduation Speaker (Student Nominated) \nFoster's Most Outstanding Student Leader (Honorable Mention) \nBusiness Economic Development Center Co-President \nCreated the BEDC Leadership Team consulting project with local nonprofit, Historic Seattle \nDeveloped the \"Entrepreneurship is...\" video series for the Lavin Entrepreneurship Program \nGlobal Business Case Competition Ambassador for Thailand & Australia \nCIE Business Plan Competition - Vibe Globe \nFreshman Direct Case Competition Mentor Activities and Societies:  Intramural Sports/Shamrock Shootout Two-Time Champs Università Commerciale 'Luigi Bocconi' Business,  Marketing and Information Systems 2009  – 2010 - UW Global Business Center Exchange Program - Milan, Italy \n- Perfect Marks in International Business Course University of Washington, Michael G. Foster School of Business Business,  Marketing and Information Systems , 3.8 (Cum Laude) 2007  – 2011 *Global Case Competition Experience* \nBEDC Diversity in Business Case Competition Sponsored by Target - 1st Place \nKPMG Case Competition (UW & West Regionals) - 1st Place  \nDeloitte Case Competition - 1st Place  \nErnst and Young Case Competition - 1st Place  \nPricewaterhouse Coopers xAct Case Competition - 1st Place \nThammasat Undergraduate Business Competition (Bangkok, Thailand) - Finalist \nMUSH Ethics Case Competition Participant \n \n*Foster School of Business*  \nTraveled to South Africa (Business Exploration Program) \nGraduation Speaker (Student Nominated) \nFoster's Most Outstanding Student Leader (Honorable Mention) \nBusiness Economic Development Center Co-President \nCreated the BEDC Leadership Team consulting project with local nonprofit, Historic Seattle \nDeveloped the \"Entrepreneurship is...\" video series for the Lavin Entrepreneurship Program \nGlobal Business Case Competition Ambassador for Thailand & Australia \nCIE Business Plan Competition - Vibe Globe \nFreshman Direct Case Competition Mentor Activities and Societies:  Intramural Sports/Shamrock Shootout Two-Time Champs University of Washington, Michael G. Foster School of Business Business,  Marketing and Information Systems , 3.8 (Cum Laude) 2007  – 2011 *Global Case Competition Experience* \nBEDC Diversity in Business Case Competition Sponsored by Target - 1st Place \nKPMG Case Competition (UW & West Regionals) - 1st Place  \nDeloitte Case Competition - 1st Place  \nErnst and Young Case Competition - 1st Place  \nPricewaterhouse Coopers xAct Case Competition - 1st Place \nThammasat Undergraduate Business Competition (Bangkok, Thailand) - Finalist \nMUSH Ethics Case Competition Participant \n \n*Foster School of Business*  \nTraveled to South Africa (Business Exploration Program) \nGraduation Speaker (Student Nominated) \nFoster's Most Outstanding Student Leader (Honorable Mention) \nBusiness Economic Development Center Co-President \nCreated the BEDC Leadership Team consulting project with local nonprofit, Historic Seattle \nDeveloped the \"Entrepreneurship is...\" video series for the Lavin Entrepreneurship Program \nGlobal Business Case Competition Ambassador for Thailand & Australia \nCIE Business Plan Competition - Vibe Globe \nFreshman Direct Case Competition Mentor Activities and Societies:  Intramural Sports/Shamrock Shootout Two-Time Champs University of Washington, Michael G. Foster School of Business Business,  Marketing and Information Systems , 3.8 (Cum Laude) 2007  – 2011 *Global Case Competition Experience* \nBEDC Diversity in Business Case Competition Sponsored by Target - 1st Place \nKPMG Case Competition (UW & West Regionals) - 1st Place  \nDeloitte Case Competition - 1st Place  \nErnst and Young Case Competition - 1st Place  \nPricewaterhouse Coopers xAct Case Competition - 1st Place \nThammasat Undergraduate Business Competition (Bangkok, Thailand) - Finalist \nMUSH Ethics Case Competition Participant \n \n*Foster School of Business*  \nTraveled to South Africa (Business Exploration Program) \nGraduation Speaker (Student Nominated) \nFoster's Most Outstanding Student Leader (Honorable Mention) \nBusiness Economic Development Center Co-President \nCreated the BEDC Leadership Team consulting project with local nonprofit, Historic Seattle \nDeveloped the \"Entrepreneurship is...\" video series for the Lavin Entrepreneurship Program \nGlobal Business Case Competition Ambassador for Thailand & Australia \nCIE Business Plan Competition - Vibe Globe \nFreshman Direct Case Competition Mentor Activities and Societies:  Intramural Sports/Shamrock Shootout Two-Time Champs Università Commerciale 'Luigi Bocconi' Business,  Marketing and Information Systems 2009  – 2010 - UW Global Business Center Exchange Program - Milan, Italy \n- Perfect Marks in International Business Course Università Commerciale 'Luigi Bocconi' Business,  Marketing and Information Systems 2009  – 2010 - UW Global Business Center Exchange Program - Milan, Italy \n- Perfect Marks in International Business Course Università Commerciale 'Luigi Bocconi' Business,  Marketing and Information Systems 2009  – 2010 - UW Global Business Center Exchange Program - Milan, Italy \n- Perfect Marks in International Business Course Honors & Awards Additional Honors & Awards -Dean's List (all quarters) \n-Office of Minority Affairs Scholar  \n-BEDC Asian/Pacific Islander Endowed Scholar \n-BECU Scholar \n-Foster School of Business Brotherton Scholar Additional Honors & Awards -Dean's List (all quarters) \n-Office of Minority Affairs Scholar  \n-BEDC Asian/Pacific Islander Endowed Scholar \n-BECU Scholar \n-Foster School of Business Brotherton Scholar Additional Honors & Awards -Dean's List (all quarters) \n-Office of Minority Affairs Scholar  \n-BEDC Asian/Pacific Islander Endowed Scholar \n-BECU Scholar \n-Foster School of Business Brotherton Scholar Additional Honors & Awards -Dean's List (all quarters) \n-Office of Minority Affairs Scholar  \n-BEDC Asian/Pacific Islander Endowed Scholar \n-BECU Scholar \n-Foster School of Business Brotherton Scholar ", "Experience Product Engineer Twitch July 2013  – Present (2 years 2 months) San Francisco Commentator GGsLive.com September 2009  – Present (6 years) Chicago, IL •\tProvide color-commentary on live webcasts for Magic: The Gathering card tournaments as member of 3 person team \n•\tTravel to U.S. cities such as Dallas, Los Angeles, and Tampa to bring live web coverage of events \n•\tTroubleshoot logistics of running live stream \n•\tAttract new advertisers to program through outreach by email and phone to potential corporate sponsors Product Quality Associate Google October 2012  –  June 2013  (9 months) Mountain View CA Software Engineer Myra Trading July 2012  –  September 2012  (3 months) Skokie IL Seasonal Intern -- Clearing Information Technology CME Group May 2011  –  July 2011  (3 months) •\tWrote web application to reduce complexity of database infrastructure in order to enhance speed and usability for display of trades for Front End Clearing firms  \n•\tRedesigned Clearing Department’s Help Desk software to facilitate cross-department communication \n•\tAttended weekly seminars on future and options products and co-location technology \n•\tCreated web application to display effectiveness of over 100 trade processing servers through analytics to upper management Management Consultant MTGChicago.com May 2009  –  April 2011  (2 years) •\tCollaborated with owner to find new markets and avenues for profit \n•\tAnalyzed owner’s current pricing model to maximize profit while minimizing overhead \n•\tManaged online buy/sell bots, managing over $1000 of capital Webmaster MTGChicago.com June 2007  –  May 2008  (1 year) Designed graphics to increase sales for website \n•\tDeveloped web software such as Fantasy Pro Tour to bring in new customers \n•\tTroubleshot day-to-day problems with the website and business Intern, Responsive Environments Group MIT Media Lab July 2007  –  September 2007  (3 months) Cambridge, MA •\tDeveloped software for CargoNET project to determine temperature on microchip \n•\tRecompiled, along with graduate students, Tricorder Project as member of 6 person team Product Engineer Twitch July 2013  – Present (2 years 2 months) San Francisco Product Engineer Twitch July 2013  – Present (2 years 2 months) San Francisco Commentator GGsLive.com September 2009  – Present (6 years) Chicago, IL •\tProvide color-commentary on live webcasts for Magic: The Gathering card tournaments as member of 3 person team \n•\tTravel to U.S. cities such as Dallas, Los Angeles, and Tampa to bring live web coverage of events \n•\tTroubleshoot logistics of running live stream \n•\tAttract new advertisers to program through outreach by email and phone to potential corporate sponsors Commentator GGsLive.com September 2009  – Present (6 years) Chicago, IL •\tProvide color-commentary on live webcasts for Magic: The Gathering card tournaments as member of 3 person team \n•\tTravel to U.S. cities such as Dallas, Los Angeles, and Tampa to bring live web coverage of events \n•\tTroubleshoot logistics of running live stream \n•\tAttract new advertisers to program through outreach by email and phone to potential corporate sponsors Product Quality Associate Google October 2012  –  June 2013  (9 months) Mountain View CA Product Quality Associate Google October 2012  –  June 2013  (9 months) Mountain View CA Software Engineer Myra Trading July 2012  –  September 2012  (3 months) Skokie IL Software Engineer Myra Trading July 2012  –  September 2012  (3 months) Skokie IL Seasonal Intern -- Clearing Information Technology CME Group May 2011  –  July 2011  (3 months) •\tWrote web application to reduce complexity of database infrastructure in order to enhance speed and usability for display of trades for Front End Clearing firms  \n•\tRedesigned Clearing Department’s Help Desk software to facilitate cross-department communication \n•\tAttended weekly seminars on future and options products and co-location technology \n•\tCreated web application to display effectiveness of over 100 trade processing servers through analytics to upper management Seasonal Intern -- Clearing Information Technology CME Group May 2011  –  July 2011  (3 months) •\tWrote web application to reduce complexity of database infrastructure in order to enhance speed and usability for display of trades for Front End Clearing firms  \n•\tRedesigned Clearing Department’s Help Desk software to facilitate cross-department communication \n•\tAttended weekly seminars on future and options products and co-location technology \n•\tCreated web application to display effectiveness of over 100 trade processing servers through analytics to upper management Management Consultant MTGChicago.com May 2009  –  April 2011  (2 years) •\tCollaborated with owner to find new markets and avenues for profit \n•\tAnalyzed owner’s current pricing model to maximize profit while minimizing overhead \n•\tManaged online buy/sell bots, managing over $1000 of capital Management Consultant MTGChicago.com May 2009  –  April 2011  (2 years) •\tCollaborated with owner to find new markets and avenues for profit \n•\tAnalyzed owner’s current pricing model to maximize profit while minimizing overhead \n•\tManaged online buy/sell bots, managing over $1000 of capital Webmaster MTGChicago.com June 2007  –  May 2008  (1 year) Designed graphics to increase sales for website \n•\tDeveloped web software such as Fantasy Pro Tour to bring in new customers \n•\tTroubleshot day-to-day problems with the website and business Webmaster MTGChicago.com June 2007  –  May 2008  (1 year) Designed graphics to increase sales for website \n•\tDeveloped web software such as Fantasy Pro Tour to bring in new customers \n•\tTroubleshot day-to-day problems with the website and business Intern, Responsive Environments Group MIT Media Lab July 2007  –  September 2007  (3 months) Cambridge, MA •\tDeveloped software for CargoNET project to determine temperature on microchip \n•\tRecompiled, along with graduate students, Tricorder Project as member of 6 person team Intern, Responsive Environments Group MIT Media Lab July 2007  –  September 2007  (3 months) Cambridge, MA •\tDeveloped software for CargoNET project to determine temperature on microchip \n•\tRecompiled, along with graduate students, Tricorder Project as member of 6 person team Skills C Java SQL Linux Excel PowerPoint Word Outlook Python Stata HTML + CSS JIRA JavaScript Conversational Japanese C++ HTML CSS See 2+     See less Skills  C Java SQL Linux Excel PowerPoint Word Outlook Python Stata HTML + CSS JIRA JavaScript Conversational Japanese C++ HTML CSS See 2+     See less C Java SQL Linux Excel PowerPoint Word Outlook Python Stata HTML + CSS JIRA JavaScript Conversational Japanese C++ HTML CSS See 2+     See less C Java SQL Linux Excel PowerPoint Word Outlook Python Stata HTML + CSS JIRA JavaScript Conversational Japanese C++ HTML CSS See 2+     See less Education Brandeis University BA,  Mathematics with Honors 2008  – 2012 Activities and Societies:  Crossword Editor ,  Blowfish Newspaper\nPresident ,  Founder ,  Trading Card Game Club Kyoto Consortium of Japanese Studies Japanese Language and Business 2010  – 2011 Activities and Societies:  Go Circle Brandeis University BA,  Mathematics with Honors 2008  – 2012 Activities and Societies:  Crossword Editor ,  Blowfish Newspaper\nPresident ,  Founder ,  Trading Card Game Club Brandeis University BA,  Mathematics with Honors 2008  – 2012 Activities and Societies:  Crossword Editor ,  Blowfish Newspaper\nPresident ,  Founder ,  Trading Card Game Club Brandeis University BA,  Mathematics with Honors 2008  – 2012 Activities and Societies:  Crossword Editor ,  Blowfish Newspaper\nPresident ,  Founder ,  Trading Card Game Club Kyoto Consortium of Japanese Studies Japanese Language and Business 2010  – 2011 Activities and Societies:  Go Circle Kyoto Consortium of Japanese Studies Japanese Language and Business 2010  – 2011 Activities and Societies:  Go Circle Kyoto Consortium of Japanese Studies Japanese Language and Business 2010  – 2011 Activities and Societies:  Go Circle ", "Experience UX Designer Google January 2013  – Present (2 years 8 months) New York, NY UX Designer / Product Quality Associate Google July 2011  –  December 2012  (1 year 6 months) Mountain View, CA Responsibilities split 80/20 between Product Quality Operations (PQO) and Google+. For PQO: acted as UX team of one – conducted surveys and contextual inquiries, iterate on wireframes and mocks, and helped code workﬂow-optimized UIs for global team’s core internal auditing tools. For Google+ Communities: created mocks, wireframes, and HTML prototypes for the desktop UX and initial iPad UX. IT Analyst Intern Cisco Systems May 2010  –  August 2010  (4 months) Produced usability testing document and layout redesigns for team's presence on internal social enterprise platform. Performed heuristic evaluations of business intelligence platform for CTO. Electrical & Computer Engineering Lab TA Duke University January 2010  –  May 2010  (5 months) Assist students during weekly labs as they learn the fundamentals of ECE lab practices and mentor student groups with their final PBASIC robotics projects. Designer Duke Innovative Design Agency (DiDA) August 2008  –  May 2010  (1 year 10 months) Worked with student organizations to establish their graphic identities and effectively publicize their programs and events, by offering creative, budget-minded, and Duke-specific branding and marketing solutions. UX Designer Google January 2013  – Present (2 years 8 months) New York, NY UX Designer Google January 2013  – Present (2 years 8 months) New York, NY UX Designer / Product Quality Associate Google July 2011  –  December 2012  (1 year 6 months) Mountain View, CA Responsibilities split 80/20 between Product Quality Operations (PQO) and Google+. For PQO: acted as UX team of one – conducted surveys and contextual inquiries, iterate on wireframes and mocks, and helped code workﬂow-optimized UIs for global team’s core internal auditing tools. For Google+ Communities: created mocks, wireframes, and HTML prototypes for the desktop UX and initial iPad UX. UX Designer / Product Quality Associate Google July 2011  –  December 2012  (1 year 6 months) Mountain View, CA Responsibilities split 80/20 between Product Quality Operations (PQO) and Google+. For PQO: acted as UX team of one – conducted surveys and contextual inquiries, iterate on wireframes and mocks, and helped code workﬂow-optimized UIs for global team’s core internal auditing tools. For Google+ Communities: created mocks, wireframes, and HTML prototypes for the desktop UX and initial iPad UX. IT Analyst Intern Cisco Systems May 2010  –  August 2010  (4 months) Produced usability testing document and layout redesigns for team's presence on internal social enterprise platform. Performed heuristic evaluations of business intelligence platform for CTO. IT Analyst Intern Cisco Systems May 2010  –  August 2010  (4 months) Produced usability testing document and layout redesigns for team's presence on internal social enterprise platform. Performed heuristic evaluations of business intelligence platform for CTO. Electrical & Computer Engineering Lab TA Duke University January 2010  –  May 2010  (5 months) Assist students during weekly labs as they learn the fundamentals of ECE lab practices and mentor student groups with their final PBASIC robotics projects. Electrical & Computer Engineering Lab TA Duke University January 2010  –  May 2010  (5 months) Assist students during weekly labs as they learn the fundamentals of ECE lab practices and mentor student groups with their final PBASIC robotics projects. Designer Duke Innovative Design Agency (DiDA) August 2008  –  May 2010  (1 year 10 months) Worked with student organizations to establish their graphic identities and effectively publicize their programs and events, by offering creative, budget-minded, and Duke-specific branding and marketing solutions. Designer Duke Innovative Design Agency (DiDA) August 2008  –  May 2010  (1 year 10 months) Worked with student organizations to establish their graphic identities and effectively publicize their programs and events, by offering creative, budget-minded, and Duke-specific branding and marketing solutions. Skills User Experience Design User Interface Design Interaction Design CSS3 HTML Photoshop Illustrator Mockups Wireframes German Typography Information Architecture CSS Heuristic Evaluation Usability Testing User-centered Design User Interface Contextual Inquiry See 3+     See less Skills  User Experience Design User Interface Design Interaction Design CSS3 HTML Photoshop Illustrator Mockups Wireframes German Typography Information Architecture CSS Heuristic Evaluation Usability Testing User-centered Design User Interface Contextual Inquiry See 3+     See less User Experience Design User Interface Design Interaction Design CSS3 HTML Photoshop Illustrator Mockups Wireframes German Typography Information Architecture CSS Heuristic Evaluation Usability Testing User-centered Design User Interface Contextual Inquiry See 3+     See less User Experience Design User Interface Design Interaction Design CSS3 HTML Photoshop Illustrator Mockups Wireframes German Typography Information Architecture CSS Heuristic Evaluation Usability Testing User-centered Design User Interface Contextual Inquiry See 3+     See less Education Duke University B.S.E.,  Electrical and Computer Engineering 2007  – 2011 German and Visual Arts Minor Activities and Societies:  Eta Kappa Nu ,  Duke Smart Home ,  Society of Women Engineers ,  Usability Professionals' Association ,  IxDA Technical University of Berlin 2009  – 2009 Studied Abroad from January to July 2009. Engaged in intensive study of German language and literature, Computer Technology (Rechnertechnologie), Statistics for Engineers (Statistik fuer Prozesswissenschaften), and Political Science of the EU. Duke University B.S.E.,  Electrical and Computer Engineering 2007  – 2011 German and Visual Arts Minor Activities and Societies:  Eta Kappa Nu ,  Duke Smart Home ,  Society of Women Engineers ,  Usability Professionals' Association ,  IxDA Duke University B.S.E.,  Electrical and Computer Engineering 2007  – 2011 German and Visual Arts Minor Activities and Societies:  Eta Kappa Nu ,  Duke Smart Home ,  Society of Women Engineers ,  Usability Professionals' Association ,  IxDA Duke University B.S.E.,  Electrical and Computer Engineering 2007  – 2011 German and Visual Arts Minor Activities and Societies:  Eta Kappa Nu ,  Duke Smart Home ,  Society of Women Engineers ,  Usability Professionals' Association ,  IxDA Technical University of Berlin 2009  – 2009 Studied Abroad from January to July 2009. Engaged in intensive study of German language and literature, Computer Technology (Rechnertechnologie), Statistics for Engineers (Statistik fuer Prozesswissenschaften), and Political Science of the EU. Technical University of Berlin 2009  – 2009 Studied Abroad from January to July 2009. Engaged in intensive study of German language and literature, Computer Technology (Rechnertechnologie), Statistics for Engineers (Statistik fuer Prozesswissenschaften), and Political Science of the EU. Technical University of Berlin 2009  – 2009 Studied Abroad from January to July 2009. Engaged in intensive study of German language and literature, Computer Technology (Rechnertechnologie), Statistics for Engineers (Statistik fuer Prozesswissenschaften), and Political Science of the EU. Honors & Awards Additional Honors & Awards Dean’s List, Spring 2010 Duke Smart Home Fellow, Spring 2010 Undergraduate Research Grant, 2009-2010 Prospective Health Challenge Winner, Xerox Technical Minority Scholarship, National Merit Scholarship, Random House World of Expression Scholarship, Associated Board of the Royal Schools of Music Piano Diploma Additional Honors & Awards Dean’s List, Spring 2010 Duke Smart Home Fellow, Spring 2010 Undergraduate Research Grant, 2009-2010 Prospective Health Challenge Winner, Xerox Technical Minority Scholarship, National Merit Scholarship, Random House World of Expression Scholarship, Associated Board of the Royal Schools of Music Piano Diploma Additional Honors & Awards Dean’s List, Spring 2010 Duke Smart Home Fellow, Spring 2010 Undergraduate Research Grant, 2009-2010 Prospective Health Challenge Winner, Xerox Technical Minority Scholarship, National Merit Scholarship, Random House World of Expression Scholarship, Associated Board of the Royal Schools of Music Piano Diploma Additional Honors & Awards Dean’s List, Spring 2010 Duke Smart Home Fellow, Spring 2010 Undergraduate Research Grant, 2009-2010 Prospective Health Challenge Winner, Xerox Technical Minority Scholarship, National Merit Scholarship, Random House World of Expression Scholarship, Associated Board of the Royal Schools of Music Piano Diploma "]}