{"position": "Program Manager III", "company": "Google", "profiles": ["Summary - Driven data analyst, maps and education enthusiast; \n- Strong project manager with over 3 years of experience leading data-driven projects; \n- Demonstrated ability to develop and standardize new processes across industries and functions. \n Summary - Driven data analyst, maps and education enthusiast; \n- Strong project manager with over 3 years of experience leading data-driven projects; \n- Demonstrated ability to develop and standardize new processes across industries and functions. \n - Driven data analyst, maps and education enthusiast; \n- Strong project manager with over 3 years of experience leading data-driven projects; \n- Demonstrated ability to develop and standardize new processes across industries and functions. \n - Driven data analyst, maps and education enthusiast; \n- Strong project manager with over 3 years of experience leading data-driven projects; \n- Demonstrated ability to develop and standardize new processes across industries and functions. \n Experience Program Manager, Google Fiber Google July 2015  – Present (2 months) Program Manager, Google Fiber Google July 2015  – Present (2 months) Program Manager, Google Fiber Google July 2015  – Present (2 months) Languages English Full professional proficiency Italian Native or bilingual proficiency French Limited working proficiency English Full professional proficiency Italian Native or bilingual proficiency French Limited working proficiency English Full professional proficiency Italian Native or bilingual proficiency French Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Stata GIS SQL Quantum GIS Microsoft Excel Policy Analysis Tableau Analysis Higher Education Public Policy International Relations Research Project Management Google Maps Localization Data Analysis See 1+     See less Skills  Stata GIS SQL Quantum GIS Microsoft Excel Policy Analysis Tableau Analysis Higher Education Public Policy International Relations Research Project Management Google Maps Localization Data Analysis See 1+     See less Stata GIS SQL Quantum GIS Microsoft Excel Policy Analysis Tableau Analysis Higher Education Public Policy International Relations Research Project Management Google Maps Localization Data Analysis See 1+     See less Stata GIS SQL Quantum GIS Microsoft Excel Policy Analysis Tableau Analysis Higher Education Public Policy International Relations Research Project Management Google Maps Localization Data Analysis See 1+     See less Education Stanford University Advanced Project Management Certificate,  Project Management 2015  – 2015 Completed Stanford's Advanced Project Management Certificate in 6 months to hone my skills and prepare for my next professional venture. Hertie School of Governance Master of Public Policy,  Public Policy and Administration , GPA 87.7 (equivalent to US GPA 3.51) 2009  – 2011 Activities and Societies:  JEF@Hertie ,  FC Hertie Internazionale Università Cattolica del Sacro Cuore Bachelor of Arts (BA), Cum Laude,  International Relations ,  Political Science , GPA 29.8 (equivalent to US GPA 3.97) 2006  – 2009 University of Denver Exchange student,  International Relations ,  Political Science 2008  – 2009 Activities and Societies:  University of Denver Rugby FC Stanford University Advanced Project Management Certificate,  Project Management 2015  – 2015 Completed Stanford's Advanced Project Management Certificate in 6 months to hone my skills and prepare for my next professional venture. Stanford University Advanced Project Management Certificate,  Project Management 2015  – 2015 Completed Stanford's Advanced Project Management Certificate in 6 months to hone my skills and prepare for my next professional venture. Stanford University Advanced Project Management Certificate,  Project Management 2015  – 2015 Completed Stanford's Advanced Project Management Certificate in 6 months to hone my skills and prepare for my next professional venture. Hertie School of Governance Master of Public Policy,  Public Policy and Administration , GPA 87.7 (equivalent to US GPA 3.51) 2009  – 2011 Activities and Societies:  JEF@Hertie ,  FC Hertie Internazionale Hertie School of Governance Master of Public Policy,  Public Policy and Administration , GPA 87.7 (equivalent to US GPA 3.51) 2009  – 2011 Activities and Societies:  JEF@Hertie ,  FC Hertie Internazionale Hertie School of Governance Master of Public Policy,  Public Policy and Administration , GPA 87.7 (equivalent to US GPA 3.51) 2009  – 2011 Activities and Societies:  JEF@Hertie ,  FC Hertie Internazionale Università Cattolica del Sacro Cuore Bachelor of Arts (BA), Cum Laude,  International Relations ,  Political Science , GPA 29.8 (equivalent to US GPA 3.97) 2006  – 2009 Università Cattolica del Sacro Cuore Bachelor of Arts (BA), Cum Laude,  International Relations ,  Political Science , GPA 29.8 (equivalent to US GPA 3.97) 2006  – 2009 Università Cattolica del Sacro Cuore Bachelor of Arts (BA), Cum Laude,  International Relations ,  Political Science , GPA 29.8 (equivalent to US GPA 3.97) 2006  – 2009 University of Denver Exchange student,  International Relations ,  Political Science 2008  – 2009 Activities and Societies:  University of Denver Rugby FC University of Denver Exchange student,  International Relations ,  Political Science 2008  – 2009 Activities and Societies:  University of Denver Rugby FC University of Denver Exchange student,  International Relations ,  Political Science 2008  – 2009 Activities and Societies:  University of Denver Rugby FC Honors & Awards ", "Experience Business Program Manager, Google Fiber Google October 2014  – Present (11 months) Scale Fiber's business by identifying system and infrastructure improvements to speed up the build process Tools Program Manager, Consumer Operations Google May 2013  –  September 2014  (1 year 5 months) Key responsibilities:  \n \n-Define and develop business requirements for agent tools and contact center infrastructure, and work with engineering teams to prioritize and implement solutions \n-Scale Google’s high touch support operations by creating processes for onboarding, access control, and ongoing maintenance of call center tools \n-Supported operations include: Google Wallet, Google Play, Google Drive, Account Recovery Product Support Manager, Consumer Operations Google August 2010  –  May 2013  (2 years 10 months) -Led user support strategy for Google Accounts and Security \n-Collected and reported out on user feedback  \n-Conducted user insights analyses to drive product improvements Summer Intern Creative Artists Agency May 2010  –  August 2010  (4 months) Business Development intern- digital media and partnerships, new ventures, and entertainment consulting Business Analyst IndieGoGo.com June 2007  –  March 2009  (1 year 10 months) A website connecting filmmakers and fans to make independent film happen. The platform provides filmmakers the tools for project funding, recruiting, and promotion, while enabling their audience to discover and connect directly with filmmakers and the causes they support. \n \n-Website beta testing and design \n-Customer support \n-Grassroots marketing online and at Sundance Film Festival Business Program Manager, Google Fiber Google October 2014  – Present (11 months) Scale Fiber's business by identifying system and infrastructure improvements to speed up the build process Business Program Manager, Google Fiber Google October 2014  – Present (11 months) Scale Fiber's business by identifying system and infrastructure improvements to speed up the build process Tools Program Manager, Consumer Operations Google May 2013  –  September 2014  (1 year 5 months) Key responsibilities:  \n \n-Define and develop business requirements for agent tools and contact center infrastructure, and work with engineering teams to prioritize and implement solutions \n-Scale Google’s high touch support operations by creating processes for onboarding, access control, and ongoing maintenance of call center tools \n-Supported operations include: Google Wallet, Google Play, Google Drive, Account Recovery Tools Program Manager, Consumer Operations Google May 2013  –  September 2014  (1 year 5 months) Key responsibilities:  \n \n-Define and develop business requirements for agent tools and contact center infrastructure, and work with engineering teams to prioritize and implement solutions \n-Scale Google’s high touch support operations by creating processes for onboarding, access control, and ongoing maintenance of call center tools \n-Supported operations include: Google Wallet, Google Play, Google Drive, Account Recovery Product Support Manager, Consumer Operations Google August 2010  –  May 2013  (2 years 10 months) -Led user support strategy for Google Accounts and Security \n-Collected and reported out on user feedback  \n-Conducted user insights analyses to drive product improvements Product Support Manager, Consumer Operations Google August 2010  –  May 2013  (2 years 10 months) -Led user support strategy for Google Accounts and Security \n-Collected and reported out on user feedback  \n-Conducted user insights analyses to drive product improvements Summer Intern Creative Artists Agency May 2010  –  August 2010  (4 months) Business Development intern- digital media and partnerships, new ventures, and entertainment consulting Summer Intern Creative Artists Agency May 2010  –  August 2010  (4 months) Business Development intern- digital media and partnerships, new ventures, and entertainment consulting Business Analyst IndieGoGo.com June 2007  –  March 2009  (1 year 10 months) A website connecting filmmakers and fans to make independent film happen. The platform provides filmmakers the tools for project funding, recruiting, and promotion, while enabling their audience to discover and connect directly with filmmakers and the causes they support. \n \n-Website beta testing and design \n-Customer support \n-Grassroots marketing online and at Sundance Film Festival Business Analyst IndieGoGo.com June 2007  –  March 2009  (1 year 10 months) A website connecting filmmakers and fans to make independent film happen. The platform provides filmmakers the tools for project funding, recruiting, and promotion, while enabling their audience to discover and connect directly with filmmakers and the causes they support. \n \n-Website beta testing and design \n-Customer support \n-Grassroots marketing online and at Sundance Film Festival Skills Digital Media Film Social Media Data Analysis Microsoft Excel Microsoft Office Project Management SQL Public Speaking Mandarin User Experience HTML Google Analytics International Relations Skills  Digital Media Film Social Media Data Analysis Microsoft Excel Microsoft Office Project Management SQL Public Speaking Mandarin User Experience HTML Google Analytics International Relations Digital Media Film Social Media Data Analysis Microsoft Excel Microsoft Office Project Management SQL Public Speaking Mandarin User Experience HTML Google Analytics International Relations Digital Media Film Social Media Data Analysis Microsoft Excel Microsoft Office Project Management SQL Public Speaking Mandarin User Experience HTML Google Analytics International Relations Education University of California, Berkeley BA,  Economics ,  Political Economy 2006  – 2010 Activities and Societies:  Berkeley Model United Nations (Secretary-General ,  58th Session) University of California, Berkeley BA,  Economics ,  Political Economy 2006  – 2010 Activities and Societies:  Berkeley Model United Nations (Secretary-General ,  58th Session) University of California, Berkeley BA,  Economics ,  Political Economy 2006  – 2010 Activities and Societies:  Berkeley Model United Nations (Secretary-General ,  58th Session) University of California, Berkeley BA,  Economics ,  Political Economy 2006  – 2010 Activities and Societies:  Berkeley Model United Nations (Secretary-General ,  58th Session) ", "Summary * Proven track record of managing complex projects to successful, on-time delivery. \n* Engages collaboration across business unit boundaries to prevent roadblocks and build sustainable business processes. \n \nDetailed and exacting leader of project or response teams, providing fluent translation between management, engineering, and IT. First 10 years in hands-on Unix & Internet IT, second 10 years in project/team/program management. Specialties:Management of hosted service software development and deployment, IT/IS business process improvement, tiger-team building for strategic initiatives, refactoring troubled projects & programs for success. Summary * Proven track record of managing complex projects to successful, on-time delivery. \n* Engages collaboration across business unit boundaries to prevent roadblocks and build sustainable business processes. \n \nDetailed and exacting leader of project or response teams, providing fluent translation between management, engineering, and IT. First 10 years in hands-on Unix & Internet IT, second 10 years in project/team/program management. Specialties:Management of hosted service software development and deployment, IT/IS business process improvement, tiger-team building for strategic initiatives, refactoring troubled projects & programs for success. * Proven track record of managing complex projects to successful, on-time delivery. \n* Engages collaboration across business unit boundaries to prevent roadblocks and build sustainable business processes. \n \nDetailed and exacting leader of project or response teams, providing fluent translation between management, engineering, and IT. First 10 years in hands-on Unix & Internet IT, second 10 years in project/team/program management. Specialties:Management of hosted service software development and deployment, IT/IS business process improvement, tiger-team building for strategic initiatives, refactoring troubled projects & programs for success. * Proven track record of managing complex projects to successful, on-time delivery. \n* Engages collaboration across business unit boundaries to prevent roadblocks and build sustainable business processes. \n \nDetailed and exacting leader of project or response teams, providing fluent translation between management, engineering, and IT. First 10 years in hands-on Unix & Internet IT, second 10 years in project/team/program management. Specialties:Management of hosted service software development and deployment, IT/IS business process improvement, tiger-team building for strategic initiatives, refactoring troubled projects & programs for success. Experience Program Manager Google June 2015  – Present (3 months) Mountain View, CA Manage programs and projects with Google's Fiber group. Manager, Advisory KPMG October 2014  –  May 2015  (8 months) Silicon Valley Office Managing project teams on multiple projects, including India teams. Project Manager Qubera Solutions September 2013  –  October 2014  (1 year 2 months) Redwood City, CA Manage client projects in the field of identity management. Work with remote consulting teams and offshore resources. Technical Author Addison Wesley August 2012  –  August 2013  (1 year 1 month) Writing \"System Administration in the Cloud\" technical book with co-authors Tom Limoncelli and Christina Hogan. Sr. Domain Architect (Consultant) NetApp October 2011  –  February 2012  (5 months) Sunnyvale CA Systems architect in multi-tier organization. Distill technical requirements from business requirements, map to IT standards, manage coordination of delivery. Emphasis on Containers, VMs, and provisioning on demand. Work with internal team to design tools and processes to improve efficiency and quality in systems delivery. Placement via Taos. Owner Virtual.Net Inc January 1993  –  January 2012  (19 years 1 month) Strategic consultancy with an emphasis on bringing mature IT/IS practices (\"best practices\") to startups and fast-growing companies. We solve difficult deployment problems for firms of any size. Highly networked and able to draw on solutions from many recognized experts. Incorporated after over a decade as a successful sole proprietorship. Program Manager, Scrum Master, Second Life Enterprise Linden Lab January 2008  –  April 2010  (2 years 4 months) Engineering Project Manager, Jan 2007 - Dec 2009  \nBuilt internal cross-functional teams and worked with key vendor partners to bring Second Life Enterprise from internal tool to fully released product. Total of 2 weeks slip on 18 months of development and 4 releases, with a geographically dispersed team in SF, MV, Seattle, and Singapore. Engineering liason to key customers as part of early engineering trials. Gradually transitioned team and project sponsor into agile process (scrum). Technical Author Prentice Hall January 2006  –  May 2007  (1 year 5 months) Joined existing team of Limoncelli and Hogan for 2nd edition of The Practice of System and Network Administration, June 2007 publication. Program Manager The Usenix Association December 2005  –  December 2006  (1 year 1 month) Manage member programs and initiatives of the Usenix Special Interest Group for System Administrators (\"SAGE\"). Perform outreach to other technical groups and to non-members. Work with Usenix Executive Director and staff to create and implement new programs and benefits. Consulting Director of IT, Senior IT Consultant Micronas USA (formerly WIS Technologies) December 2004  –  September 2006  (1 year 10 months) Provide systems architecture, best practices mentoring, and high-level planning for expansion to new facilities and plans for growth. Assist IT staff in resolving legacy systems and network architecture issues. Provide direction in transitioning department to expanded full-time staffing. Continue to be available to staff & management for problem-solving & process consulting. Member The System Administrators Guild (SAGE) 1997  –  February 2006  (9 years) Executive Committee, 2001 - 2002 term. \nUsenix/SAGE LISA Conference, Invited Talks Co-chair 2001, Program Committee 1999 - 2001, Refereed paper reviewer 1998 - 2002, Panel Organizer 1998 \n[Still member, need to move to Group listing] Member BayLISA 1996  –  February 2006  (10 years) BayLISA Board of Directors 1997 - 1999, 2001 - 2005 terms. President 1999, Treasurer 2004, various committees (web, membership, elections, annual picnic). http://www.baylisa.org/ \n[Still member, need to move to Group listing] Project Manager (Contract) First Databank (via Scriplogix, Fortuna) November 2004  –  February 2005  (4 months) PM for all phases of pilot project, oversight authority on remote and local teams. Manage functional specification development and recoding efforts for IBM PL/1 to Oracle PL/SQL migration. Coordinate onsite (CA) and remote (NY, India) teams. Systems Consultant Microsoft MSNTV May 2004  –  August 2004  (4 months) Contract position via Certainty Solutions. Create project framework for ongoing operations, track & document problems and solutions, provide hands-on support for EMC Clariion and Sun A5x00 series storage arrays, Veritas Volume Manager. Customer Solutions Contractor Opsware August 2003  –  April 2004  (9 months) Contract position via Fortuna Inc. Ongoing application packaging & scripting (sh, python, csh) for automated software installation & control via Opsware's Intelligent Software Module Development Kit (ISM IDK).  \n \nAuthored initial training course for ISM IDK for both in-house and customer/partner worldwide training. Created hands-on lab material for Opsware Command Core (OCC) Administration training materials for OS Provisioning (Solaris, Windows) Module. Messaging Systems Consultant Mirapoint November 2002  –  February 2003  (4 months) Delivered feature comparison analysis and technical sales strategy toolsheets on MTA systems for ISP use, message security gateway products, hosted messaging services. \n \nJanuary 2001 - May 2001, Performance testing of competitor's products against SPECMail benchmark; contributed to product feature enhancement and design specifications for MTA, LDAP products. Systems Consultant Addamark, Inc August 2001  –  September 2001  (2 months) Hands-on IT assistance (Linux, Win2K) and systems architecture kibitzing. Director of Network Operations KnowNow Inc July 2000  –  December 2000  (6 months) Created project plans for production notification service cluster build-out; assisted in venture funding pitches and mutual-NDA technical explorations with potential partners firms; worked with executive and engineering staff on service planning, specifications, and development lifecyle issues. As contractor in June 2000, generated financial projection spreadsheets for colocation build-out and performed feasibility analysis of implementation concept. Business model changed to software rather than services, regretfully departed. Project Manager (Consultant) iPlanet (Sun Netscape Alliance) February 2000  –  May 2000  (4 months) Washington Mutual, February 2000 - May 2000, Project Manager;  \nNegotiate phased implementation plan and deliverables for 30K user greenfields enterprise rollout, develop project plan; expand Statement of Work to include testlab environment; manage client hardware recommendations process; assist client in development of functional requirements document; interface with other vendors. Project Manager (Consultant) mac.com (Apple) August 1999  –  November 1999  (4 months) Consultant via Fortuna, iPlanet Professional Services. Generate project plan & manage team for iPlanet portion of mac.com rollout on very tight deadline; create ECO's for custom application development; negotiate additions & modifications to client Statement of Work; liason to outsourced IT staffing firm to create operations processes for cluster expansion and monitoring of iPlanet portions of application services. Messaging Operations Manager (Consultant) Palm.Net May 1998  –  August 1999  (1 year 4 months) (Consultant via Teksystems) Palm.Net, a division of Palm/3Com. Generate project plan, form project team, manage staff; interface with engineering development teams to craft operations-related ECO's and feature requests; interface with outside vendors (Sun, Network Appliance, iPlanet) on client's behalf; create operations processes and production change processes; research scaleability and capacity models for operations response to varied service usage levels; create staged implementation plans and business continuity planning guidelines; liason to Customer Support to develop escalation process and intervention tools for outsourced first-tier support center. Systems Architect Consultant KiraCom March 1999  –  June 1999  (4 months) Designed messaging flow for 100K user cluster (scaleable to 300K users), created engineering specifications for custom Java messaging application, provided get-to-launch checklist, NOC procedures and requirements. Systems Architect Consultant Certainty Solutions (formerly GNAC) November 1997  –  April 1998  (6 months) Architected news, messaging, load-balancing layout, and dataflow for 100K user (10K simultaneous) service cluster for Talkway.Net premiere; assisted networking team in implementing BigIP failover and load-balancing. Wrote & reviewed security policy documents for large corporate customer. Senior Systems Administrator Synopsys, Inc July 1996  –  October 1997  (1 year 4 months) Rearchitected worldwide corporate email systems, provided firewall design and implementation, conducted selection & procurement process for corporate backup solution, installed various security & application tools (TIS-FWTK, Checkpoint Firewall-1, socks4.2, NEC PrivateNet SocksPlus, HTTP-proxy, Netscape Commerce web server, Wuarchive-FTP, DNS, sendmail, procmail, POP3 (Qualcomm popper), Majordomo, Listserv, Listproc, Smrsh). System Adminstrator, CAD Ambassadors Apple Computer 1993  –  1994  (1 year) IT Director, Center for Cognitive Science MIT September 1988  –  September 1990  (2 years 1 month) Managed computing facilities for Center for Cognitive Science. Long-term administrative planning, day-to-day system management, supervision of contractors, limited signature authority. Replaced antiquated terminal-based facilities with integrated network of Suns, Macs, and Vaxes to serve a community of over 150 academic and administrative users. Systems Consultant, MIT EE/CS Educational Computing Facility MIT May 1986  –  September 1988  (2 years 5 months) Supported ECF internal projects and computing infrastructure (Ultrix VAX, Decsystem-20 TOPS-20). Took 6-month rotation as postmaster@eddie.mit.edu, a major Usenet & Internet backbone site. Systems Consultant, various firms Miscellaneous Consulting, Boston Area January 1985  –  February 1987  (2 years 2 months) Enforth Corporation \nDesigned and implemented multi-user record-locking library routines for interactive database using SysV IPC facilities (shmem, semaphores). Application was Emergency Response Dispatching for police, paramedic, & fire, master server with independent clients.  \n \nOasys \nProduct seminar design and initial market targeting for C debugging software.  \nBoston University Medical Center \nReal-time data capture and analysis from laboratory equipment, troubleshooting PC to mainframe data linkages.  \n \nFidelity Inc. \nBasic UNIX and sysadmin training for in-house executive staff.  \n \nSystems Guild \nUNIX admin training; concept design and implementation suggestions for Amiga video game. Systems Administrator J. Redding Associates December 1983  –  December 1984  (1 year 1 month) Provided in-house technical support for 68000-based UNIX VAR. Systems Programmer Access Technology July 1983  –  December 1983  (6 months) Designed interactive on-line help system for Acess 20-20 spreadsheet(formerly SuperComp-20), implemented prototype. Systems Consultant Videomagic Laboratories March 1983  –  July 1983  (5 months) Provided daily support of 68000-based SysV Unix systems. Program Manager Google June 2015  – Present (3 months) Mountain View, CA Manage programs and projects with Google's Fiber group. Program Manager Google June 2015  – Present (3 months) Mountain View, CA Manage programs and projects with Google's Fiber group. Manager, Advisory KPMG October 2014  –  May 2015  (8 months) Silicon Valley Office Managing project teams on multiple projects, including India teams. Manager, Advisory KPMG October 2014  –  May 2015  (8 months) Silicon Valley Office Managing project teams on multiple projects, including India teams. Project Manager Qubera Solutions September 2013  –  October 2014  (1 year 2 months) Redwood City, CA Manage client projects in the field of identity management. Work with remote consulting teams and offshore resources. Project Manager Qubera Solutions September 2013  –  October 2014  (1 year 2 months) Redwood City, CA Manage client projects in the field of identity management. Work with remote consulting teams and offshore resources. Technical Author Addison Wesley August 2012  –  August 2013  (1 year 1 month) Writing \"System Administration in the Cloud\" technical book with co-authors Tom Limoncelli and Christina Hogan. Technical Author Addison Wesley August 2012  –  August 2013  (1 year 1 month) Writing \"System Administration in the Cloud\" technical book with co-authors Tom Limoncelli and Christina Hogan. Sr. Domain Architect (Consultant) NetApp October 2011  –  February 2012  (5 months) Sunnyvale CA Systems architect in multi-tier organization. Distill technical requirements from business requirements, map to IT standards, manage coordination of delivery. Emphasis on Containers, VMs, and provisioning on demand. Work with internal team to design tools and processes to improve efficiency and quality in systems delivery. Placement via Taos. Sr. Domain Architect (Consultant) NetApp October 2011  –  February 2012  (5 months) Sunnyvale CA Systems architect in multi-tier organization. Distill technical requirements from business requirements, map to IT standards, manage coordination of delivery. Emphasis on Containers, VMs, and provisioning on demand. Work with internal team to design tools and processes to improve efficiency and quality in systems delivery. Placement via Taos. Owner Virtual.Net Inc January 1993  –  January 2012  (19 years 1 month) Strategic consultancy with an emphasis on bringing mature IT/IS practices (\"best practices\") to startups and fast-growing companies. We solve difficult deployment problems for firms of any size. Highly networked and able to draw on solutions from many recognized experts. Incorporated after over a decade as a successful sole proprietorship. Owner Virtual.Net Inc January 1993  –  January 2012  (19 years 1 month) Strategic consultancy with an emphasis on bringing mature IT/IS practices (\"best practices\") to startups and fast-growing companies. We solve difficult deployment problems for firms of any size. Highly networked and able to draw on solutions from many recognized experts. Incorporated after over a decade as a successful sole proprietorship. Program Manager, Scrum Master, Second Life Enterprise Linden Lab January 2008  –  April 2010  (2 years 4 months) Engineering Project Manager, Jan 2007 - Dec 2009  \nBuilt internal cross-functional teams and worked with key vendor partners to bring Second Life Enterprise from internal tool to fully released product. Total of 2 weeks slip on 18 months of development and 4 releases, with a geographically dispersed team in SF, MV, Seattle, and Singapore. Engineering liason to key customers as part of early engineering trials. Gradually transitioned team and project sponsor into agile process (scrum). Program Manager, Scrum Master, Second Life Enterprise Linden Lab January 2008  –  April 2010  (2 years 4 months) Engineering Project Manager, Jan 2007 - Dec 2009  \nBuilt internal cross-functional teams and worked with key vendor partners to bring Second Life Enterprise from internal tool to fully released product. Total of 2 weeks slip on 18 months of development and 4 releases, with a geographically dispersed team in SF, MV, Seattle, and Singapore. Engineering liason to key customers as part of early engineering trials. Gradually transitioned team and project sponsor into agile process (scrum). Technical Author Prentice Hall January 2006  –  May 2007  (1 year 5 months) Joined existing team of Limoncelli and Hogan for 2nd edition of The Practice of System and Network Administration, June 2007 publication. Technical Author Prentice Hall January 2006  –  May 2007  (1 year 5 months) Joined existing team of Limoncelli and Hogan for 2nd edition of The Practice of System and Network Administration, June 2007 publication. Program Manager The Usenix Association December 2005  –  December 2006  (1 year 1 month) Manage member programs and initiatives of the Usenix Special Interest Group for System Administrators (\"SAGE\"). Perform outreach to other technical groups and to non-members. Work with Usenix Executive Director and staff to create and implement new programs and benefits. Program Manager The Usenix Association December 2005  –  December 2006  (1 year 1 month) Manage member programs and initiatives of the Usenix Special Interest Group for System Administrators (\"SAGE\"). Perform outreach to other technical groups and to non-members. Work with Usenix Executive Director and staff to create and implement new programs and benefits. Consulting Director of IT, Senior IT Consultant Micronas USA (formerly WIS Technologies) December 2004  –  September 2006  (1 year 10 months) Provide systems architecture, best practices mentoring, and high-level planning for expansion to new facilities and plans for growth. Assist IT staff in resolving legacy systems and network architecture issues. Provide direction in transitioning department to expanded full-time staffing. Continue to be available to staff & management for problem-solving & process consulting. Consulting Director of IT, Senior IT Consultant Micronas USA (formerly WIS Technologies) December 2004  –  September 2006  (1 year 10 months) Provide systems architecture, best practices mentoring, and high-level planning for expansion to new facilities and plans for growth. Assist IT staff in resolving legacy systems and network architecture issues. Provide direction in transitioning department to expanded full-time staffing. Continue to be available to staff & management for problem-solving & process consulting. Member The System Administrators Guild (SAGE) 1997  –  February 2006  (9 years) Executive Committee, 2001 - 2002 term. \nUsenix/SAGE LISA Conference, Invited Talks Co-chair 2001, Program Committee 1999 - 2001, Refereed paper reviewer 1998 - 2002, Panel Organizer 1998 \n[Still member, need to move to Group listing] Member The System Administrators Guild (SAGE) 1997  –  February 2006  (9 years) Executive Committee, 2001 - 2002 term. \nUsenix/SAGE LISA Conference, Invited Talks Co-chair 2001, Program Committee 1999 - 2001, Refereed paper reviewer 1998 - 2002, Panel Organizer 1998 \n[Still member, need to move to Group listing] Member BayLISA 1996  –  February 2006  (10 years) BayLISA Board of Directors 1997 - 1999, 2001 - 2005 terms. President 1999, Treasurer 2004, various committees (web, membership, elections, annual picnic). http://www.baylisa.org/ \n[Still member, need to move to Group listing] Member BayLISA 1996  –  February 2006  (10 years) BayLISA Board of Directors 1997 - 1999, 2001 - 2005 terms. President 1999, Treasurer 2004, various committees (web, membership, elections, annual picnic). http://www.baylisa.org/ \n[Still member, need to move to Group listing] Project Manager (Contract) First Databank (via Scriplogix, Fortuna) November 2004  –  February 2005  (4 months) PM for all phases of pilot project, oversight authority on remote and local teams. Manage functional specification development and recoding efforts for IBM PL/1 to Oracle PL/SQL migration. Coordinate onsite (CA) and remote (NY, India) teams. Project Manager (Contract) First Databank (via Scriplogix, Fortuna) November 2004  –  February 2005  (4 months) PM for all phases of pilot project, oversight authority on remote and local teams. Manage functional specification development and recoding efforts for IBM PL/1 to Oracle PL/SQL migration. Coordinate onsite (CA) and remote (NY, India) teams. Systems Consultant Microsoft MSNTV May 2004  –  August 2004  (4 months) Contract position via Certainty Solutions. Create project framework for ongoing operations, track & document problems and solutions, provide hands-on support for EMC Clariion and Sun A5x00 series storage arrays, Veritas Volume Manager. Systems Consultant Microsoft MSNTV May 2004  –  August 2004  (4 months) Contract position via Certainty Solutions. Create project framework for ongoing operations, track & document problems and solutions, provide hands-on support for EMC Clariion and Sun A5x00 series storage arrays, Veritas Volume Manager. Customer Solutions Contractor Opsware August 2003  –  April 2004  (9 months) Contract position via Fortuna Inc. Ongoing application packaging & scripting (sh, python, csh) for automated software installation & control via Opsware's Intelligent Software Module Development Kit (ISM IDK).  \n \nAuthored initial training course for ISM IDK for both in-house and customer/partner worldwide training. Created hands-on lab material for Opsware Command Core (OCC) Administration training materials for OS Provisioning (Solaris, Windows) Module. Customer Solutions Contractor Opsware August 2003  –  April 2004  (9 months) Contract position via Fortuna Inc. Ongoing application packaging & scripting (sh, python, csh) for automated software installation & control via Opsware's Intelligent Software Module Development Kit (ISM IDK).  \n \nAuthored initial training course for ISM IDK for both in-house and customer/partner worldwide training. Created hands-on lab material for Opsware Command Core (OCC) Administration training materials for OS Provisioning (Solaris, Windows) Module. Messaging Systems Consultant Mirapoint November 2002  –  February 2003  (4 months) Delivered feature comparison analysis and technical sales strategy toolsheets on MTA systems for ISP use, message security gateway products, hosted messaging services. \n \nJanuary 2001 - May 2001, Performance testing of competitor's products against SPECMail benchmark; contributed to product feature enhancement and design specifications for MTA, LDAP products. Messaging Systems Consultant Mirapoint November 2002  –  February 2003  (4 months) Delivered feature comparison analysis and technical sales strategy toolsheets on MTA systems for ISP use, message security gateway products, hosted messaging services. \n \nJanuary 2001 - May 2001, Performance testing of competitor's products against SPECMail benchmark; contributed to product feature enhancement and design specifications for MTA, LDAP products. Systems Consultant Addamark, Inc August 2001  –  September 2001  (2 months) Hands-on IT assistance (Linux, Win2K) and systems architecture kibitzing. Systems Consultant Addamark, Inc August 2001  –  September 2001  (2 months) Hands-on IT assistance (Linux, Win2K) and systems architecture kibitzing. Director of Network Operations KnowNow Inc July 2000  –  December 2000  (6 months) Created project plans for production notification service cluster build-out; assisted in venture funding pitches and mutual-NDA technical explorations with potential partners firms; worked with executive and engineering staff on service planning, specifications, and development lifecyle issues. As contractor in June 2000, generated financial projection spreadsheets for colocation build-out and performed feasibility analysis of implementation concept. Business model changed to software rather than services, regretfully departed. Director of Network Operations KnowNow Inc July 2000  –  December 2000  (6 months) Created project plans for production notification service cluster build-out; assisted in venture funding pitches and mutual-NDA technical explorations with potential partners firms; worked with executive and engineering staff on service planning, specifications, and development lifecyle issues. As contractor in June 2000, generated financial projection spreadsheets for colocation build-out and performed feasibility analysis of implementation concept. Business model changed to software rather than services, regretfully departed. Project Manager (Consultant) iPlanet (Sun Netscape Alliance) February 2000  –  May 2000  (4 months) Washington Mutual, February 2000 - May 2000, Project Manager;  \nNegotiate phased implementation plan and deliverables for 30K user greenfields enterprise rollout, develop project plan; expand Statement of Work to include testlab environment; manage client hardware recommendations process; assist client in development of functional requirements document; interface with other vendors. Project Manager (Consultant) iPlanet (Sun Netscape Alliance) February 2000  –  May 2000  (4 months) Washington Mutual, February 2000 - May 2000, Project Manager;  \nNegotiate phased implementation plan and deliverables for 30K user greenfields enterprise rollout, develop project plan; expand Statement of Work to include testlab environment; manage client hardware recommendations process; assist client in development of functional requirements document; interface with other vendors. Project Manager (Consultant) mac.com (Apple) August 1999  –  November 1999  (4 months) Consultant via Fortuna, iPlanet Professional Services. Generate project plan & manage team for iPlanet portion of mac.com rollout on very tight deadline; create ECO's for custom application development; negotiate additions & modifications to client Statement of Work; liason to outsourced IT staffing firm to create operations processes for cluster expansion and monitoring of iPlanet portions of application services. Project Manager (Consultant) mac.com (Apple) August 1999  –  November 1999  (4 months) Consultant via Fortuna, iPlanet Professional Services. Generate project plan & manage team for iPlanet portion of mac.com rollout on very tight deadline; create ECO's for custom application development; negotiate additions & modifications to client Statement of Work; liason to outsourced IT staffing firm to create operations processes for cluster expansion and monitoring of iPlanet portions of application services. Messaging Operations Manager (Consultant) Palm.Net May 1998  –  August 1999  (1 year 4 months) (Consultant via Teksystems) Palm.Net, a division of Palm/3Com. Generate project plan, form project team, manage staff; interface with engineering development teams to craft operations-related ECO's and feature requests; interface with outside vendors (Sun, Network Appliance, iPlanet) on client's behalf; create operations processes and production change processes; research scaleability and capacity models for operations response to varied service usage levels; create staged implementation plans and business continuity planning guidelines; liason to Customer Support to develop escalation process and intervention tools for outsourced first-tier support center. Messaging Operations Manager (Consultant) Palm.Net May 1998  –  August 1999  (1 year 4 months) (Consultant via Teksystems) Palm.Net, a division of Palm/3Com. Generate project plan, form project team, manage staff; interface with engineering development teams to craft operations-related ECO's and feature requests; interface with outside vendors (Sun, Network Appliance, iPlanet) on client's behalf; create operations processes and production change processes; research scaleability and capacity models for operations response to varied service usage levels; create staged implementation plans and business continuity planning guidelines; liason to Customer Support to develop escalation process and intervention tools for outsourced first-tier support center. Systems Architect Consultant KiraCom March 1999  –  June 1999  (4 months) Designed messaging flow for 100K user cluster (scaleable to 300K users), created engineering specifications for custom Java messaging application, provided get-to-launch checklist, NOC procedures and requirements. Systems Architect Consultant KiraCom March 1999  –  June 1999  (4 months) Designed messaging flow for 100K user cluster (scaleable to 300K users), created engineering specifications for custom Java messaging application, provided get-to-launch checklist, NOC procedures and requirements. Systems Architect Consultant Certainty Solutions (formerly GNAC) November 1997  –  April 1998  (6 months) Architected news, messaging, load-balancing layout, and dataflow for 100K user (10K simultaneous) service cluster for Talkway.Net premiere; assisted networking team in implementing BigIP failover and load-balancing. Wrote & reviewed security policy documents for large corporate customer. Systems Architect Consultant Certainty Solutions (formerly GNAC) November 1997  –  April 1998  (6 months) Architected news, messaging, load-balancing layout, and dataflow for 100K user (10K simultaneous) service cluster for Talkway.Net premiere; assisted networking team in implementing BigIP failover and load-balancing. Wrote & reviewed security policy documents for large corporate customer. Senior Systems Administrator Synopsys, Inc July 1996  –  October 1997  (1 year 4 months) Rearchitected worldwide corporate email systems, provided firewall design and implementation, conducted selection & procurement process for corporate backup solution, installed various security & application tools (TIS-FWTK, Checkpoint Firewall-1, socks4.2, NEC PrivateNet SocksPlus, HTTP-proxy, Netscape Commerce web server, Wuarchive-FTP, DNS, sendmail, procmail, POP3 (Qualcomm popper), Majordomo, Listserv, Listproc, Smrsh). Senior Systems Administrator Synopsys, Inc July 1996  –  October 1997  (1 year 4 months) Rearchitected worldwide corporate email systems, provided firewall design and implementation, conducted selection & procurement process for corporate backup solution, installed various security & application tools (TIS-FWTK, Checkpoint Firewall-1, socks4.2, NEC PrivateNet SocksPlus, HTTP-proxy, Netscape Commerce web server, Wuarchive-FTP, DNS, sendmail, procmail, POP3 (Qualcomm popper), Majordomo, Listserv, Listproc, Smrsh). System Adminstrator, CAD Ambassadors Apple Computer 1993  –  1994  (1 year) System Adminstrator, CAD Ambassadors Apple Computer 1993  –  1994  (1 year) IT Director, Center for Cognitive Science MIT September 1988  –  September 1990  (2 years 1 month) Managed computing facilities for Center for Cognitive Science. Long-term administrative planning, day-to-day system management, supervision of contractors, limited signature authority. Replaced antiquated terminal-based facilities with integrated network of Suns, Macs, and Vaxes to serve a community of over 150 academic and administrative users. IT Director, Center for Cognitive Science MIT September 1988  –  September 1990  (2 years 1 month) Managed computing facilities for Center for Cognitive Science. Long-term administrative planning, day-to-day system management, supervision of contractors, limited signature authority. Replaced antiquated terminal-based facilities with integrated network of Suns, Macs, and Vaxes to serve a community of over 150 academic and administrative users. Systems Consultant, MIT EE/CS Educational Computing Facility MIT May 1986  –  September 1988  (2 years 5 months) Supported ECF internal projects and computing infrastructure (Ultrix VAX, Decsystem-20 TOPS-20). Took 6-month rotation as postmaster@eddie.mit.edu, a major Usenet & Internet backbone site. Systems Consultant, MIT EE/CS Educational Computing Facility MIT May 1986  –  September 1988  (2 years 5 months) Supported ECF internal projects and computing infrastructure (Ultrix VAX, Decsystem-20 TOPS-20). Took 6-month rotation as postmaster@eddie.mit.edu, a major Usenet & Internet backbone site. Systems Consultant, various firms Miscellaneous Consulting, Boston Area January 1985  –  February 1987  (2 years 2 months) Enforth Corporation \nDesigned and implemented multi-user record-locking library routines for interactive database using SysV IPC facilities (shmem, semaphores). Application was Emergency Response Dispatching for police, paramedic, & fire, master server with independent clients.  \n \nOasys \nProduct seminar design and initial market targeting for C debugging software.  \nBoston University Medical Center \nReal-time data capture and analysis from laboratory equipment, troubleshooting PC to mainframe data linkages.  \n \nFidelity Inc. \nBasic UNIX and sysadmin training for in-house executive staff.  \n \nSystems Guild \nUNIX admin training; concept design and implementation suggestions for Amiga video game. Systems Consultant, various firms Miscellaneous Consulting, Boston Area January 1985  –  February 1987  (2 years 2 months) Enforth Corporation \nDesigned and implemented multi-user record-locking library routines for interactive database using SysV IPC facilities (shmem, semaphores). Application was Emergency Response Dispatching for police, paramedic, & fire, master server with independent clients.  \n \nOasys \nProduct seminar design and initial market targeting for C debugging software.  \nBoston University Medical Center \nReal-time data capture and analysis from laboratory equipment, troubleshooting PC to mainframe data linkages.  \n \nFidelity Inc. \nBasic UNIX and sysadmin training for in-house executive staff.  \n \nSystems Guild \nUNIX admin training; concept design and implementation suggestions for Amiga video game. Systems Administrator J. Redding Associates December 1983  –  December 1984  (1 year 1 month) Provided in-house technical support for 68000-based UNIX VAR. Systems Administrator J. Redding Associates December 1983  –  December 1984  (1 year 1 month) Provided in-house technical support for 68000-based UNIX VAR. Systems Programmer Access Technology July 1983  –  December 1983  (6 months) Designed interactive on-line help system for Acess 20-20 spreadsheet(formerly SuperComp-20), implemented prototype. Systems Programmer Access Technology July 1983  –  December 1983  (6 months) Designed interactive on-line help system for Acess 20-20 spreadsheet(formerly SuperComp-20), implemented prototype. Systems Consultant Videomagic Laboratories March 1983  –  July 1983  (5 months) Provided daily support of 68000-based SysV Unix systems. Systems Consultant Videomagic Laboratories March 1983  –  July 1983  (5 months) Provided daily support of 68000-based SysV Unix systems. Languages   Skills Order Out of Chaos Whole-Systems Thinking Proven Integrity Unix Software Development Documentation Security Linux Integration Solaris Agile Shell Scripting Open Source Team Leadership Problem Solving Troubleshooting Software Documentation Agile Methodologies Project Management Certified Scrum Master Consulting Scalability Cloud Computing Distributed Systems System Administration People Skills Scrum Enterprise Software Software Engineering Start-ups Program Management System Architecture See 17+     See less Skills  Order Out of Chaos Whole-Systems Thinking Proven Integrity Unix Software Development Documentation Security Linux Integration Solaris Agile Shell Scripting Open Source Team Leadership Problem Solving Troubleshooting Software Documentation Agile Methodologies Project Management Certified Scrum Master Consulting Scalability Cloud Computing Distributed Systems System Administration People Skills Scrum Enterprise Software Software Engineering Start-ups Program Management System Architecture See 17+     See less Order Out of Chaos Whole-Systems Thinking Proven Integrity Unix Software Development Documentation Security Linux Integration Solaris Agile Shell Scripting Open Source Team Leadership Problem Solving Troubleshooting Software Documentation Agile Methodologies Project Management Certified Scrum Master Consulting Scalability Cloud Computing Distributed Systems System Administration People Skills Scrum Enterprise Software Software Engineering Start-ups Program Management System Architecture See 17+     See less Order Out of Chaos Whole-Systems Thinking Proven Integrity Unix Software Development Documentation Security Linux Integration Solaris Agile Shell Scripting Open Source Team Leadership Problem Solving Troubleshooting Software Documentation Agile Methodologies Project Management Certified Scrum Master Consulting Scalability Cloud Computing Distributed Systems System Administration People Skills Scrum Enterprise Software Software Engineering Start-ups Program Management System Architecture See 17+     See less Education Scrum Alliance Certified ScrumMaster 2009  – 2009 Decker Communications Project Management Certificate , Communicator Certificate 1996  – 1996 Massachussetts Institute of Technology another MIT dropout,  Computer Science 1981  – 1983 If the technology industry ever quiets down long enough, I should go back and finish my degree. :-) Activities and Societies:  ESG Scrum Alliance Certified ScrumMaster 2009  – 2009 Scrum Alliance Certified ScrumMaster 2009  – 2009 Scrum Alliance Certified ScrumMaster 2009  – 2009 Decker Communications Project Management Certificate , Communicator Certificate 1996  – 1996 Decker Communications Project Management Certificate , Communicator Certificate 1996  – 1996 Decker Communications Project Management Certificate , Communicator Certificate 1996  – 1996 Massachussetts Institute of Technology another MIT dropout,  Computer Science 1981  – 1983 If the technology industry ever quiets down long enough, I should go back and finish my degree. :-) Activities and Societies:  ESG Massachussetts Institute of Technology another MIT dropout,  Computer Science 1981  – 1983 If the technology industry ever quiets down long enough, I should go back and finish my degree. :-) Activities and Societies:  ESG Massachussetts Institute of Technology another MIT dropout,  Computer Science 1981  – 1983 If the technology industry ever quiets down long enough, I should go back and finish my degree. :-) Activities and Societies:  ESG Honors & Awards ", "Experience Program Manager, Google Fiber Google December 2014  – Present (9 months) Raleigh-Durham, North Carolina Area Program Manager, Google Calendar Google May 2013  –  December 2014  (1 year 8 months) Zurich, Switzerland Product Specialist, Consumer Operations Google September 2009  –  May 2013  (3 years 9 months) Online Operations Associate, AdWords Google July 2008  –  September 2009  (1 year 3 months) Private Equity Intern State Board of Administration of Florida January 2007  –  May 2008  (1 year 5 months) Bureau of Economic, Energy, and Business Affairs Intern U.S. Department of State June 2007  –  August 2007  (3 months) Program Manager, Google Fiber Google December 2014  – Present (9 months) Raleigh-Durham, North Carolina Area Program Manager, Google Fiber Google December 2014  – Present (9 months) Raleigh-Durham, North Carolina Area Program Manager, Google Calendar Google May 2013  –  December 2014  (1 year 8 months) Zurich, Switzerland Program Manager, Google Calendar Google May 2013  –  December 2014  (1 year 8 months) Zurich, Switzerland Product Specialist, Consumer Operations Google September 2009  –  May 2013  (3 years 9 months) Product Specialist, Consumer Operations Google September 2009  –  May 2013  (3 years 9 months) Online Operations Associate, AdWords Google July 2008  –  September 2009  (1 year 3 months) Online Operations Associate, AdWords Google July 2008  –  September 2009  (1 year 3 months) Private Equity Intern State Board of Administration of Florida January 2007  –  May 2008  (1 year 5 months) Private Equity Intern State Board of Administration of Florida January 2007  –  May 2008  (1 year 5 months) Bureau of Economic, Energy, and Business Affairs Intern U.S. Department of State June 2007  –  August 2007  (3 months) Bureau of Economic, Energy, and Business Affairs Intern U.S. Department of State June 2007  –  August 2007  (3 months) Education Florida State University BA,  Economics , Multinational Business Operations 2004  – 2008 Florida State University BA,  Economics , Multinational Business Operations 2004  – 2008 Florida State University BA,  Economics , Multinational Business Operations 2004  – 2008 Florida State University BA,  Economics , Multinational Business Operations 2004  – 2008 ", "Experience Network Engineering & Ops Program Manager - Google Fiber Google January 2015  – Present (8 months) Mountain View, CA Implementation Project Manager Internap Network Services February 2008  –  December 2014  (6 years 11 months) Santa Clara, CA Manager, Service Provisioning Internap Network Services February 2008  –  December 2014  (6 years 11 months) Santa Clara, CA Product Manager/Packaging Acct Specialist xpedx February 2006  –  February 2008  (2 years 1 month) Sales/Marketing Analyst xpedx, A Div of International Paper August 2003  –  February 2006  (2 years 7 months) Inside Sales Supervisor xpedx, A Div of International Paper March 2000  –  August 2003  (3 years 6 months) Inside Sales Rep xpedx, A Div of International Paper January 1999  –  March 2000  (1 year 3 months) Sales Assistant Norman Wright Mechanical 1996  –  1999  (3 years) Sales Support Prime Air, Inc 1993  –  1996  (3 years) Network Engineering & Ops Program Manager - Google Fiber Google January 2015  – Present (8 months) Mountain View, CA Network Engineering & Ops Program Manager - Google Fiber Google January 2015  – Present (8 months) Mountain View, CA Implementation Project Manager Internap Network Services February 2008  –  December 2014  (6 years 11 months) Santa Clara, CA Implementation Project Manager Internap Network Services February 2008  –  December 2014  (6 years 11 months) Santa Clara, CA Manager, Service Provisioning Internap Network Services February 2008  –  December 2014  (6 years 11 months) Santa Clara, CA Manager, Service Provisioning Internap Network Services February 2008  –  December 2014  (6 years 11 months) Santa Clara, CA Product Manager/Packaging Acct Specialist xpedx February 2006  –  February 2008  (2 years 1 month) Product Manager/Packaging Acct Specialist xpedx February 2006  –  February 2008  (2 years 1 month) Sales/Marketing Analyst xpedx, A Div of International Paper August 2003  –  February 2006  (2 years 7 months) Sales/Marketing Analyst xpedx, A Div of International Paper August 2003  –  February 2006  (2 years 7 months) Inside Sales Supervisor xpedx, A Div of International Paper March 2000  –  August 2003  (3 years 6 months) Inside Sales Supervisor xpedx, A Div of International Paper March 2000  –  August 2003  (3 years 6 months) Inside Sales Rep xpedx, A Div of International Paper January 1999  –  March 2000  (1 year 3 months) Inside Sales Rep xpedx, A Div of International Paper January 1999  –  March 2000  (1 year 3 months) Sales Assistant Norman Wright Mechanical 1996  –  1999  (3 years) Sales Assistant Norman Wright Mechanical 1996  –  1999  (3 years) Sales Support Prime Air, Inc 1993  –  1996  (3 years) Sales Support Prime Air, Inc 1993  –  1996  (3 years) Skills Salesforce.com Co-location Service Implementation Project Management Account Management Managed Hosting Sales Operations SaaS Consulting Negotiation Disaster Recovery Managed Services Vendor Management VoIP Direct Sales Data Center Management Leadership Strategy Sales Product Development Enterprise Software CRM Professional Services Telecommunications Cross-functional Team... Product Management IP Training Analysis Microsoft Project See 16+     See less Skills  Salesforce.com Co-location Service Implementation Project Management Account Management Managed Hosting Sales Operations SaaS Consulting Negotiation Disaster Recovery Managed Services Vendor Management VoIP Direct Sales Data Center Management Leadership Strategy Sales Product Development Enterprise Software CRM Professional Services Telecommunications Cross-functional Team... Product Management IP Training Analysis Microsoft Project See 16+     See less Salesforce.com Co-location Service Implementation Project Management Account Management Managed Hosting Sales Operations SaaS Consulting Negotiation Disaster Recovery Managed Services Vendor Management VoIP Direct Sales Data Center Management Leadership Strategy Sales Product Development Enterprise Software CRM Professional Services Telecommunications Cross-functional Team... Product Management IP Training Analysis Microsoft Project See 16+     See less Salesforce.com Co-location Service Implementation Project Management Account Management Managed Hosting Sales Operations SaaS Consulting Negotiation Disaster Recovery Managed Services Vendor Management VoIP Direct Sales Data Center Management Leadership Strategy Sales Product Development Enterprise Software CRM Professional Services Telecommunications Cross-functional Team... Product Management IP Training Analysis Microsoft Project See 16+     See less Education Villanova University Certificate 2006  – 2007 California State University-East Bay Masters 2003  – 2005 University of Phoenix Bachelor of Science 1997  – 2001 Villanova University Certificate 2006  – 2007 Villanova University Certificate 2006  – 2007 Villanova University Certificate 2006  – 2007 California State University-East Bay Masters 2003  – 2005 California State University-East Bay Masters 2003  – 2005 California State University-East Bay Masters 2003  – 2005 University of Phoenix Bachelor of Science 1997  – 2001 University of Phoenix Bachelor of Science 1997  – 2001 University of Phoenix Bachelor of Science 1997  – 2001 ", "Summary \tDynamic and results oriented professional with a successful track-record with retail, call center, and corporate sales efforts \n\tDedicated individual with reputation for consistently going above what is required. \n\tProven record of reliability and responsibility. \n\tExtensive knowledge of the Cable and Telecommunications industries. \n\tDemonstrated aptitude for developing and applying new skills. \n\tResourceful in completing projects. \n\tAbility to effectively multi-task.  \n\tEasily develop rapport with customers and staff. \n\tSkilled in building long-term relationships with customers and staff \n\tStrong analytical skills, easily assess conditions, and implements appropriate response. Summary \tDynamic and results oriented professional with a successful track-record with retail, call center, and corporate sales efforts \n\tDedicated individual with reputation for consistently going above what is required. \n\tProven record of reliability and responsibility. \n\tExtensive knowledge of the Cable and Telecommunications industries. \n\tDemonstrated aptitude for developing and applying new skills. \n\tResourceful in completing projects. \n\tAbility to effectively multi-task.  \n\tEasily develop rapport with customers and staff. \n\tSkilled in building long-term relationships with customers and staff \n\tStrong analytical skills, easily assess conditions, and implements appropriate response. \tDynamic and results oriented professional with a successful track-record with retail, call center, and corporate sales efforts \n\tDedicated individual with reputation for consistently going above what is required. \n\tProven record of reliability and responsibility. \n\tExtensive knowledge of the Cable and Telecommunications industries. \n\tDemonstrated aptitude for developing and applying new skills. \n\tResourceful in completing projects. \n\tAbility to effectively multi-task.  \n\tEasily develop rapport with customers and staff. \n\tSkilled in building long-term relationships with customers and staff \n\tStrong analytical skills, easily assess conditions, and implements appropriate response. \tDynamic and results oriented professional with a successful track-record with retail, call center, and corporate sales efforts \n\tDedicated individual with reputation for consistently going above what is required. \n\tProven record of reliability and responsibility. \n\tExtensive knowledge of the Cable and Telecommunications industries. \n\tDemonstrated aptitude for developing and applying new skills. \n\tResourceful in completing projects. \n\tAbility to effectively multi-task.  \n\tEasily develop rapport with customers and staff. \n\tSkilled in building long-term relationships with customers and staff \n\tStrong analytical skills, easily assess conditions, and implements appropriate response. Experience Program Manager Google Fiber February 2015  – Present (7 months) Google Fiber Operations Account Manager - MDU Google May 2013  – Present (2 years 4 months) Kansas City, Missouri Area MDU Account Manager/Executive Cox Communications July 2012  –  May 2013  (11 months) Greater Kansas Market • Implements and maximizes revenue/subscriber results of MDU communities. Establishes relationships with industry partners (property managers, onsite leasing staff , etc.) to drive property/subscriber loyalty, and overall community performance. Ensures terms of MDU agreements are exceeded to promote resident satisfaction and company's interests.  \n• Partners directly with MDU property manager/leasing staff to drive product penetration and revenue growth. Manages MDU accounts once agreement has been signed; focuses on implementation of the agreement to ensure its success. Ensures all sales quotas are achieved while maintaining quality customer service.  \n• Held accountable for successfully managing a portfolio of properties in assigned territory. Constantly assesses portfolio's overall revenue and product performance and shifts approach, tactics and methods accordingly to ensure ongoing maximum results.  \n• Increases subscriber growth by designing and launching sales and marketing strategies at contracted communities or neighborhood within assigned territory. \n• Partners with property management to launch properties, train of staff on CCI products and services, and coordinate on-site marketing and promotion efforts. Looks for opportunities to increase Cox Communications' presence onsite.  \n• Evaluates and drives the performance of current portfolio of properties on an ongoing basis (revenue, sales volume, etc.). Identifies under performing properties and develops approaches to increase sales. Understands market demographics and tailors strategies appropriately based on data.  \n• Proactively identifies strategies and plans to address competitor activity in a very fluid, competitive market. Remains current on competitor activities, pricing, and product offerings to highlight CCI's competitive advantages.  \n• Ensures compliance to any and all relevant residential agreements/contracts. Ensures terms of MDU agreements are met to promote the company's interests. MDU Account Executive Knology March 2011  –  July 2012  (1 year 5 months) Responsible for building and maintaining new and current relationships with builders, owners, and management staff to ensure high rapport for Knology products and services \nNegotiate new and renewal agreements \nOversee over 16,000 Knology MDU units in the Lawrence, KS area \nPlans, organized, and implemented a program within the assigned market to gain and maintain the right to serve end users in these MDUs \nGathers and organizes data pertaining to all types of MDU accounts in assigned areas served by Knology Customer Advocate Supervisor Knology May 2006  –  March 2011  (4 years 11 months) Assisted the Customer Care Manager in the daily operations of the Customer Care Department  \nProvided guidance and support to a team of Customer Care Representatives to ensure quality customer care  \nRecruited, hired, and trained new and current employees  \nManaged the day to day operations of the front counter, including staffing, cash drawers, retail and rental equipment  \nServed on Social Media Team, directing Sunflower Broadband's presence on such platforms as Facebook and Twitter \nFollowed direction of company's Sales Initiative and set departmental goals Business Installation Coordinator Sunflower Broadband October 2003  –  May 2006  (2 years 8 months) Responsible for support of the Business Services Manager to maintain business accounts  \nCoordinated with account managers to schedule and arrange materials for all business installations \nAssisted business customers with billing and technical inquiries and trouble resolution  \nWorked with account managers, Geeks on Wheels technicians, and accounting department to coordinate and bill for phone systems and special wiring projects Telephony Provisioning Specialist/Technical Coordinator Sunflower Broadband December 2001  –  October 2003  (1 year 11 months) Assisted the Director of Telephony Services in completion of reports, data compilation, and analysis \nProvisioned new service requests for installation of residential and business telephone customers  \nAssisted the Network Operations Center and Customer Care Representatives in customer escalations, inquiries and trouble resolution \nDeveloped training processes for the telephony billing systems Program Manager Google Fiber February 2015  – Present (7 months) Program Manager Google Fiber February 2015  – Present (7 months) Google Fiber Operations Account Manager - MDU Google May 2013  – Present (2 years 4 months) Kansas City, Missouri Area Google Fiber Operations Account Manager - MDU Google May 2013  – Present (2 years 4 months) Kansas City, Missouri Area MDU Account Manager/Executive Cox Communications July 2012  –  May 2013  (11 months) Greater Kansas Market • Implements and maximizes revenue/subscriber results of MDU communities. Establishes relationships with industry partners (property managers, onsite leasing staff , etc.) to drive property/subscriber loyalty, and overall community performance. Ensures terms of MDU agreements are exceeded to promote resident satisfaction and company's interests.  \n• Partners directly with MDU property manager/leasing staff to drive product penetration and revenue growth. Manages MDU accounts once agreement has been signed; focuses on implementation of the agreement to ensure its success. Ensures all sales quotas are achieved while maintaining quality customer service.  \n• Held accountable for successfully managing a portfolio of properties in assigned territory. Constantly assesses portfolio's overall revenue and product performance and shifts approach, tactics and methods accordingly to ensure ongoing maximum results.  \n• Increases subscriber growth by designing and launching sales and marketing strategies at contracted communities or neighborhood within assigned territory. \n• Partners with property management to launch properties, train of staff on CCI products and services, and coordinate on-site marketing and promotion efforts. Looks for opportunities to increase Cox Communications' presence onsite.  \n• Evaluates and drives the performance of current portfolio of properties on an ongoing basis (revenue, sales volume, etc.). Identifies under performing properties and develops approaches to increase sales. Understands market demographics and tailors strategies appropriately based on data.  \n• Proactively identifies strategies and plans to address competitor activity in a very fluid, competitive market. Remains current on competitor activities, pricing, and product offerings to highlight CCI's competitive advantages.  \n• Ensures compliance to any and all relevant residential agreements/contracts. Ensures terms of MDU agreements are met to promote the company's interests. MDU Account Manager/Executive Cox Communications July 2012  –  May 2013  (11 months) Greater Kansas Market • Implements and maximizes revenue/subscriber results of MDU communities. Establishes relationships with industry partners (property managers, onsite leasing staff , etc.) to drive property/subscriber loyalty, and overall community performance. Ensures terms of MDU agreements are exceeded to promote resident satisfaction and company's interests.  \n• Partners directly with MDU property manager/leasing staff to drive product penetration and revenue growth. Manages MDU accounts once agreement has been signed; focuses on implementation of the agreement to ensure its success. Ensures all sales quotas are achieved while maintaining quality customer service.  \n• Held accountable for successfully managing a portfolio of properties in assigned territory. Constantly assesses portfolio's overall revenue and product performance and shifts approach, tactics and methods accordingly to ensure ongoing maximum results.  \n• Increases subscriber growth by designing and launching sales and marketing strategies at contracted communities or neighborhood within assigned territory. \n• Partners with property management to launch properties, train of staff on CCI products and services, and coordinate on-site marketing and promotion efforts. Looks for opportunities to increase Cox Communications' presence onsite.  \n• Evaluates and drives the performance of current portfolio of properties on an ongoing basis (revenue, sales volume, etc.). Identifies under performing properties and develops approaches to increase sales. Understands market demographics and tailors strategies appropriately based on data.  \n• Proactively identifies strategies and plans to address competitor activity in a very fluid, competitive market. Remains current on competitor activities, pricing, and product offerings to highlight CCI's competitive advantages.  \n• Ensures compliance to any and all relevant residential agreements/contracts. Ensures terms of MDU agreements are met to promote the company's interests. MDU Account Executive Knology March 2011  –  July 2012  (1 year 5 months) Responsible for building and maintaining new and current relationships with builders, owners, and management staff to ensure high rapport for Knology products and services \nNegotiate new and renewal agreements \nOversee over 16,000 Knology MDU units in the Lawrence, KS area \nPlans, organized, and implemented a program within the assigned market to gain and maintain the right to serve end users in these MDUs \nGathers and organizes data pertaining to all types of MDU accounts in assigned areas served by Knology MDU Account Executive Knology March 2011  –  July 2012  (1 year 5 months) Responsible for building and maintaining new and current relationships with builders, owners, and management staff to ensure high rapport for Knology products and services \nNegotiate new and renewal agreements \nOversee over 16,000 Knology MDU units in the Lawrence, KS area \nPlans, organized, and implemented a program within the assigned market to gain and maintain the right to serve end users in these MDUs \nGathers and organizes data pertaining to all types of MDU accounts in assigned areas served by Knology Customer Advocate Supervisor Knology May 2006  –  March 2011  (4 years 11 months) Assisted the Customer Care Manager in the daily operations of the Customer Care Department  \nProvided guidance and support to a team of Customer Care Representatives to ensure quality customer care  \nRecruited, hired, and trained new and current employees  \nManaged the day to day operations of the front counter, including staffing, cash drawers, retail and rental equipment  \nServed on Social Media Team, directing Sunflower Broadband's presence on such platforms as Facebook and Twitter \nFollowed direction of company's Sales Initiative and set departmental goals Customer Advocate Supervisor Knology May 2006  –  March 2011  (4 years 11 months) Assisted the Customer Care Manager in the daily operations of the Customer Care Department  \nProvided guidance and support to a team of Customer Care Representatives to ensure quality customer care  \nRecruited, hired, and trained new and current employees  \nManaged the day to day operations of the front counter, including staffing, cash drawers, retail and rental equipment  \nServed on Social Media Team, directing Sunflower Broadband's presence on such platforms as Facebook and Twitter \nFollowed direction of company's Sales Initiative and set departmental goals Business Installation Coordinator Sunflower Broadband October 2003  –  May 2006  (2 years 8 months) Responsible for support of the Business Services Manager to maintain business accounts  \nCoordinated with account managers to schedule and arrange materials for all business installations \nAssisted business customers with billing and technical inquiries and trouble resolution  \nWorked with account managers, Geeks on Wheels technicians, and accounting department to coordinate and bill for phone systems and special wiring projects Business Installation Coordinator Sunflower Broadband October 2003  –  May 2006  (2 years 8 months) Responsible for support of the Business Services Manager to maintain business accounts  \nCoordinated with account managers to schedule and arrange materials for all business installations \nAssisted business customers with billing and technical inquiries and trouble resolution  \nWorked with account managers, Geeks on Wheels technicians, and accounting department to coordinate and bill for phone systems and special wiring projects Telephony Provisioning Specialist/Technical Coordinator Sunflower Broadband December 2001  –  October 2003  (1 year 11 months) Assisted the Director of Telephony Services in completion of reports, data compilation, and analysis \nProvisioned new service requests for installation of residential and business telephone customers  \nAssisted the Network Operations Center and Customer Care Representatives in customer escalations, inquiries and trouble resolution \nDeveloped training processes for the telephony billing systems Telephony Provisioning Specialist/Technical Coordinator Sunflower Broadband December 2001  –  October 2003  (1 year 11 months) Assisted the Director of Telephony Services in completion of reports, data compilation, and analysis \nProvisioned new service requests for installation of residential and business telephone customers  \nAssisted the Network Operations Center and Customer Care Representatives in customer escalations, inquiries and trouble resolution \nDeveloped training processes for the telephony billing systems Languages English English English Skills Customer Service Telecommunications Call Center Retail Billing Contract Negotiations Customer Satisfaction Competitive Analysis Team Building Team Leadership Customer Relations Problem Solving Business Strategy Budgeting Sales Management Strategic Planning Team Management Scheduling Social Media Troubleshooting Contract Management Process Improvement Contract Negotiation Negotiation Management Budgets Sales Leadership Account Management Training Customer Retention Operations Management Project Management Broadband Call Centers Marketing Analysis Direct Sales Telephony Vendor Management Salesforce.com Product Management CRM Project Planning Optical Fiber Fiber Optics Sales Process Computer Network... Cabling Employee Relations See 35+     See less Skills  Customer Service Telecommunications Call Center Retail Billing Contract Negotiations Customer Satisfaction Competitive Analysis Team Building Team Leadership Customer Relations Problem Solving Business Strategy Budgeting Sales Management Strategic Planning Team Management Scheduling Social Media Troubleshooting Contract Management Process Improvement Contract Negotiation Negotiation Management Budgets Sales Leadership Account Management Training Customer Retention Operations Management Project Management Broadband Call Centers Marketing Analysis Direct Sales Telephony Vendor Management Salesforce.com Product Management CRM Project Planning Optical Fiber Fiber Optics Sales Process Computer Network... Cabling Employee Relations See 35+     See less Customer Service Telecommunications Call Center Retail Billing Contract Negotiations Customer Satisfaction Competitive Analysis Team Building Team Leadership Customer Relations Problem Solving Business Strategy Budgeting Sales Management Strategic Planning Team Management Scheduling Social Media Troubleshooting Contract Management Process Improvement Contract Negotiation Negotiation Management Budgets Sales Leadership Account Management Training Customer Retention Operations Management Project Management Broadband Call Centers Marketing Analysis Direct Sales Telephony Vendor Management Salesforce.com Product Management CRM Project Planning Optical Fiber Fiber Optics Sales Process Computer Network... Cabling Employee Relations See 35+     See less Customer Service Telecommunications Call Center Retail Billing Contract Negotiations Customer Satisfaction Competitive Analysis Team Building Team Leadership Customer Relations Problem Solving Business Strategy Budgeting Sales Management Strategic Planning Team Management Scheduling Social Media Troubleshooting Contract Management Process Improvement Contract Negotiation Negotiation Management Budgets Sales Leadership Account Management Training Customer Retention Operations Management Project Management Broadband Call Centers Marketing Analysis Direct Sales Telephony Vendor Management Salesforce.com Product Management CRM Project Planning Optical Fiber Fiber Optics Sales Process Computer Network... Cabling Employee Relations See 35+     See less Education Baker University of Study - BS,  Business Administration Baker University of Study - BS,  Business Administration Baker University of Study - BS,  Business Administration Baker University of Study - BS,  Business Administration ", "Languages English Full professional proficiency Spanish Limited working proficiency French Elementary proficiency Italian Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Spanish Limited working proficiency French Elementary proficiency Italian Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Spanish Limited working proficiency French Elementary proficiency Italian Native or bilingual proficiency German Elementary proficiency Full professional proficiency Limited working proficiency Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Telecommunications Integration Project Management Management Agile Methodologies Product Development Team Leadership Software Development Project Portfolio... Scrum Project Planning Product Management Software Project... Pre-sales Wireless SaaS Program Management Change Management Solution Architecture Cross-functional Team... Leadership Business Strategy System Architecture Testing Mobile Devices Project management Project planning Program management See 13+     See less Skills  Telecommunications Integration Project Management Management Agile Methodologies Product Development Team Leadership Software Development Project Portfolio... Scrum Project Planning Product Management Software Project... Pre-sales Wireless SaaS Program Management Change Management Solution Architecture Cross-functional Team... Leadership Business Strategy System Architecture Testing Mobile Devices Project management Project planning Program management See 13+     See less Telecommunications Integration Project Management Management Agile Methodologies Product Development Team Leadership Software Development Project Portfolio... Scrum Project Planning Product Management Software Project... Pre-sales Wireless SaaS Program Management Change Management Solution Architecture Cross-functional Team... Leadership Business Strategy System Architecture Testing Mobile Devices Project management Project planning Program management See 13+     See less Telecommunications Integration Project Management Management Agile Methodologies Product Development Team Leadership Software Development Project Portfolio... Scrum Project Planning Product Management Software Project... Pre-sales Wireless SaaS Program Management Change Management Solution Architecture Cross-functional Team... Leadership Business Strategy System Architecture Testing Mobile Devices Project management Project planning Program management See 13+     See less ", "Languages French English Spanish German French English Spanish German French English Spanish German Skills Sales Operations Sales Management Outsourcing Account Management Online Advertising Management Strategy Sales Marketing Direct Sales Leadership Recruiting Project Management Advertising Training Google Adwords Coaching Business Development Product Management Search Advertising E-commerce Online Marketing Google Analytics SEM Social Networking PPC Team Leadership SEO Social Media Marketing Digital Marketing New Business Development Salesforce.com Mobile Marketing Display Advertising Team Management Enterprise Software Lead Generation Mobile Devices See 23+     See less Skills  Sales Operations Sales Management Outsourcing Account Management Online Advertising Management Strategy Sales Marketing Direct Sales Leadership Recruiting Project Management Advertising Training Google Adwords Coaching Business Development Product Management Search Advertising E-commerce Online Marketing Google Analytics SEM Social Networking PPC Team Leadership SEO Social Media Marketing Digital Marketing New Business Development Salesforce.com Mobile Marketing Display Advertising Team Management Enterprise Software Lead Generation Mobile Devices See 23+     See less Sales Operations Sales Management Outsourcing Account Management Online Advertising Management Strategy Sales Marketing Direct Sales Leadership Recruiting Project Management Advertising Training Google Adwords Coaching Business Development Product Management Search Advertising E-commerce Online Marketing Google Analytics SEM Social Networking PPC Team Leadership SEO Social Media Marketing Digital Marketing New Business Development Salesforce.com Mobile Marketing Display Advertising Team Management Enterprise Software Lead Generation Mobile Devices See 23+     See less Sales Operations Sales Management Outsourcing Account Management Online Advertising Management Strategy Sales Marketing Direct Sales Leadership Recruiting Project Management Advertising Training Google Adwords Coaching Business Development Product Management Search Advertising E-commerce Online Marketing Google Analytics SEM Social Networking PPC Team Leadership SEO Social Media Marketing Digital Marketing New Business Development Salesforce.com Mobile Marketing Display Advertising Team Management Enterprise Software Lead Generation Mobile Devices See 23+     See less Honors & Awards ", "Experience Program Manager, Google Fiber Google July 2015  – Present (2 months) Mountain View, California People Programs Specialist Google Inc. February 2008  –  June 2015  (7 years 5 months) Mountain View, CA Job Board Specialist WorkforceLogic Onsite at Google Inc. February 2007  –  February 2008  (1 year 1 month) Mountain View, CA Accounts Payable Assistant Otak July 2006  –  December 2006  (6 months) Lake Oswego, OR Program Manager, Google Fiber Google July 2015  – Present (2 months) Mountain View, California Program Manager, Google Fiber Google July 2015  – Present (2 months) Mountain View, California People Programs Specialist Google Inc. February 2008  –  June 2015  (7 years 5 months) Mountain View, CA People Programs Specialist Google Inc. February 2008  –  June 2015  (7 years 5 months) Mountain View, CA Job Board Specialist WorkforceLogic Onsite at Google Inc. February 2007  –  February 2008  (1 year 1 month) Mountain View, CA Job Board Specialist WorkforceLogic Onsite at Google Inc. February 2007  –  February 2008  (1 year 1 month) Mountain View, CA Accounts Payable Assistant Otak July 2006  –  December 2006  (6 months) Lake Oswego, OR Accounts Payable Assistant Otak July 2006  –  December 2006  (6 months) Lake Oswego, OR Languages English English English Skills CSS HTML Website Development Python Google Apps Google Analytics Google Webmaster Tools Google Sites Google Site Search Google Custom Search... Interviews Leadership Online Advertising Microsoft Excel Skills  CSS HTML Website Development Python Google Apps Google Analytics Google Webmaster Tools Google Sites Google Site Search Google Custom Search... Interviews Leadership Online Advertising Microsoft Excel CSS HTML Website Development Python Google Apps Google Analytics Google Webmaster Tools Google Sites Google Site Search Google Custom Search... Interviews Leadership Online Advertising Microsoft Excel CSS HTML Website Development Python Google Apps Google Analytics Google Webmaster Tools Google Sites Google Site Search Google Custom Search... Interviews Leadership Online Advertising Microsoft Excel Education Whitman College Bachelor of Arts,  Physics 2002  – 2006 Activities and Societies:  Chorale ,  Chamber Singers ,  Barbershop Quartet ,  Baseball ,  Intermural Football ,  Radio Show Franklin High School 1998  – 2002 Whitman College Bachelor of Arts,  Physics 2002  – 2006 Activities and Societies:  Chorale ,  Chamber Singers ,  Barbershop Quartet ,  Baseball ,  Intermural Football ,  Radio Show Whitman College Bachelor of Arts,  Physics 2002  – 2006 Activities and Societies:  Chorale ,  Chamber Singers ,  Barbershop Quartet ,  Baseball ,  Intermural Football ,  Radio Show Whitman College Bachelor of Arts,  Physics 2002  – 2006 Activities and Societies:  Chorale ,  Chamber Singers ,  Barbershop Quartet ,  Baseball ,  Intermural Football ,  Radio Show Franklin High School 1998  – 2002 Franklin High School 1998  – 2002 Franklin High School 1998  – 2002 ", "Experience Sr. Program Manager, Google Fiber Account Management Google July 2014  – Present (1 year 2 months) Mountain View, CA • Manage team of Account Managers responsible for managing MDU (multi-dwelling unit) projects from sales through completion of construction \n• Provide city level weekly metrics and updates to management  \n• Own and manage projects with multiple stakeholders  \n• Provide technical solutions and manage relationships with Google Fiber's product team \n• Represent the Google Fiber Account Management program to users and external partners, providing outstanding support and relationship building in all interactions \n \n YouTube Partner Manager Google November 2011  –  July 2014  (2 years 9 months) San Bruno, CA • Manage 60 YouTube partner channels and formulate audience development and programming strategies to increase viewership and engagement on the platform; Increased watch time by 17% in Q1 2014. \n• Partner with YouTube Sales, Marketing, and PR teams to identify additional revenue opportunities for partners including promotion, media buyouts, branded content and press opportunities \n• Conceptualize and launch multiple programs from infrastructure projects to partner growth programs \n• Develop training materials and deliver webinars on optimization strategies to groups ranging from 5 to over 150 partners HR Business Partner Google January 2010  –  November 2011  (1 year 11 months) Mountain View, CA • Served as the HR point of contact for employee and manager inquiries regarding company benefits, policies, and HR programs \n• Support lead HRBPs in planning and delivery of HR programs and initiatives including compensation planning, performance management, recognition programs, career development and training \n• Aggregated data across various sources and prepared dashboards and executive summaries in support of reorganizations, talent reviews, headcount planning, compensation planning and performance management Adwords Account Manager Google January 2008  –  December 2009  (2 years) Mountain View, CA • Managed 50 Retail and Entertainment AdWords advertisers and served as the main point of contact for account issues \n• Created account reports to investigate areas for development and provide recommendations \n• Consistently met or exceeded personal revenue quotas of $8MM and achieved quality ratings above expectations Sr. Program Manager, Google Fiber Account Management Google July 2014  – Present (1 year 2 months) Mountain View, CA • Manage team of Account Managers responsible for managing MDU (multi-dwelling unit) projects from sales through completion of construction \n• Provide city level weekly metrics and updates to management  \n• Own and manage projects with multiple stakeholders  \n• Provide technical solutions and manage relationships with Google Fiber's product team \n• Represent the Google Fiber Account Management program to users and external partners, providing outstanding support and relationship building in all interactions \n \n Sr. Program Manager, Google Fiber Account Management Google July 2014  – Present (1 year 2 months) Mountain View, CA • Manage team of Account Managers responsible for managing MDU (multi-dwelling unit) projects from sales through completion of construction \n• Provide city level weekly metrics and updates to management  \n• Own and manage projects with multiple stakeholders  \n• Provide technical solutions and manage relationships with Google Fiber's product team \n• Represent the Google Fiber Account Management program to users and external partners, providing outstanding support and relationship building in all interactions \n \n YouTube Partner Manager Google November 2011  –  July 2014  (2 years 9 months) San Bruno, CA • Manage 60 YouTube partner channels and formulate audience development and programming strategies to increase viewership and engagement on the platform; Increased watch time by 17% in Q1 2014. \n• Partner with YouTube Sales, Marketing, and PR teams to identify additional revenue opportunities for partners including promotion, media buyouts, branded content and press opportunities \n• Conceptualize and launch multiple programs from infrastructure projects to partner growth programs \n• Develop training materials and deliver webinars on optimization strategies to groups ranging from 5 to over 150 partners YouTube Partner Manager Google November 2011  –  July 2014  (2 years 9 months) San Bruno, CA • Manage 60 YouTube partner channels and formulate audience development and programming strategies to increase viewership and engagement on the platform; Increased watch time by 17% in Q1 2014. \n• Partner with YouTube Sales, Marketing, and PR teams to identify additional revenue opportunities for partners including promotion, media buyouts, branded content and press opportunities \n• Conceptualize and launch multiple programs from infrastructure projects to partner growth programs \n• Develop training materials and deliver webinars on optimization strategies to groups ranging from 5 to over 150 partners HR Business Partner Google January 2010  –  November 2011  (1 year 11 months) Mountain View, CA • Served as the HR point of contact for employee and manager inquiries regarding company benefits, policies, and HR programs \n• Support lead HRBPs in planning and delivery of HR programs and initiatives including compensation planning, performance management, recognition programs, career development and training \n• Aggregated data across various sources and prepared dashboards and executive summaries in support of reorganizations, talent reviews, headcount planning, compensation planning and performance management HR Business Partner Google January 2010  –  November 2011  (1 year 11 months) Mountain View, CA • Served as the HR point of contact for employee and manager inquiries regarding company benefits, policies, and HR programs \n• Support lead HRBPs in planning and delivery of HR programs and initiatives including compensation planning, performance management, recognition programs, career development and training \n• Aggregated data across various sources and prepared dashboards and executive summaries in support of reorganizations, talent reviews, headcount planning, compensation planning and performance management Adwords Account Manager Google January 2008  –  December 2009  (2 years) Mountain View, CA • Managed 50 Retail and Entertainment AdWords advertisers and served as the main point of contact for account issues \n• Created account reports to investigate areas for development and provide recommendations \n• Consistently met or exceeded personal revenue quotas of $8MM and achieved quality ratings above expectations Adwords Account Manager Google January 2008  –  December 2009  (2 years) Mountain View, CA • Managed 50 Retail and Entertainment AdWords advertisers and served as the main point of contact for account issues \n• Created account reports to investigate areas for development and provide recommendations \n• Consistently met or exceeded personal revenue quotas of $8MM and achieved quality ratings above expectations Languages Taiwanese Limited working proficiency English Native or bilingual proficiency Taiwanese Limited working proficiency English Native or bilingual proficiency Taiwanese Limited working proficiency English Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Online Advertising Web Analytics Account Management Analytics Digital Marketing Digital Media Social Media Social Media Marketing Strategy Strategic Partnerships Program Management Project Management YouTube Audience Development HR Project Management Employee Relations Event Planning See 2+     See less Skills  Online Advertising Web Analytics Account Management Analytics Digital Marketing Digital Media Social Media Social Media Marketing Strategy Strategic Partnerships Program Management Project Management YouTube Audience Development HR Project Management Employee Relations Event Planning See 2+     See less Online Advertising Web Analytics Account Management Analytics Digital Marketing Digital Media Social Media Social Media Marketing Strategy Strategic Partnerships Program Management Project Management YouTube Audience Development HR Project Management Employee Relations Event Planning See 2+     See less Online Advertising Web Analytics Account Management Analytics Digital Marketing Digital Media Social Media Social Media Marketing Strategy Strategic Partnerships Program Management Project Management YouTube Audience Development HR Project Management Employee Relations Event Planning See 2+     See less Education Claremont McKenna College BA,  Psychology and Government with a Leadership Sequence , Cum Laude 2003  – 2007 Activities and Societies:  Student Senate ,  Berger Hall Dorm VP ,  Freshmen/Transfer Student Orientation Leader ,  5-C Taiwanese Student Association ,  Kravis Leadership Internship Grant ,  McKenna International Internship Grant Foothill High School (Tustin, CA) International Baccalaureate Diploma Programme 1999  – 2003 Activities and Societies:  International Baccalaureate ,  California Scholarship Federation ,  Key Club ,  Hewes Middle School Tutor ,  El Modena Library Volunteer Claremont McKenna College BA,  Psychology and Government with a Leadership Sequence , Cum Laude 2003  – 2007 Activities and Societies:  Student Senate ,  Berger Hall Dorm VP ,  Freshmen/Transfer Student Orientation Leader ,  5-C Taiwanese Student Association ,  Kravis Leadership Internship Grant ,  McKenna International Internship Grant Claremont McKenna College BA,  Psychology and Government with a Leadership Sequence , Cum Laude 2003  – 2007 Activities and Societies:  Student Senate ,  Berger Hall Dorm VP ,  Freshmen/Transfer Student Orientation Leader ,  5-C Taiwanese Student Association ,  Kravis Leadership Internship Grant ,  McKenna International Internship Grant Claremont McKenna College BA,  Psychology and Government with a Leadership Sequence , Cum Laude 2003  – 2007 Activities and Societies:  Student Senate ,  Berger Hall Dorm VP ,  Freshmen/Transfer Student Orientation Leader ,  5-C Taiwanese Student Association ,  Kravis Leadership Internship Grant ,  McKenna International Internship Grant Foothill High School (Tustin, CA) International Baccalaureate Diploma Programme 1999  – 2003 Activities and Societies:  International Baccalaureate ,  California Scholarship Federation ,  Key Club ,  Hewes Middle School Tutor ,  El Modena Library Volunteer Foothill High School (Tustin, CA) International Baccalaureate Diploma Programme 1999  – 2003 Activities and Societies:  International Baccalaureate ,  California Scholarship Federation ,  Key Club ,  Hewes Middle School Tutor ,  El Modena Library Volunteer Foothill High School (Tustin, CA) International Baccalaureate Diploma Programme 1999  – 2003 Activities and Societies:  International Baccalaureate ,  California Scholarship Federation ,  Key Club ,  Hewes Middle School Tutor ,  El Modena Library Volunteer Honors & Awards Psi Chi National Honor Society in Psychology International Honor Society in Psychology May 2007 YouTube Gold Award YouTube October 2013 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for launch and execution of a YouTube flagship creator program. YouTube Gold Award YouTube August 2012 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for innovation in YouTube creator education and outreach. \n People Operations (HR) Spot Bonus Award Google December 2010 Spot Bonus Awards are awarded by managers to individuals who go above and beyond the highest expectations. Awarded for devising a streamlined HR process to increase efficiency.  Psi Chi National Honor Society in Psychology International Honor Society in Psychology May 2007 Psi Chi National Honor Society in Psychology International Honor Society in Psychology May 2007 Psi Chi National Honor Society in Psychology International Honor Society in Psychology May 2007 YouTube Gold Award YouTube October 2013 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for launch and execution of a YouTube flagship creator program. YouTube Gold Award YouTube October 2013 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for launch and execution of a YouTube flagship creator program. YouTube Gold Award YouTube October 2013 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for launch and execution of a YouTube flagship creator program. YouTube Gold Award YouTube August 2012 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for innovation in YouTube creator education and outreach. \n YouTube Gold Award YouTube August 2012 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for innovation in YouTube creator education and outreach. \n YouTube Gold Award YouTube August 2012 The YouTube Gold Award recognizes individuals who go above and beyond or establish a significant impact on the broader team and overall business. Awarded for innovation in YouTube creator education and outreach. \n People Operations (HR) Spot Bonus Award Google December 2010 Spot Bonus Awards are awarded by managers to individuals who go above and beyond the highest expectations. Awarded for devising a streamlined HR process to increase efficiency.  People Operations (HR) Spot Bonus Award Google December 2010 Spot Bonus Awards are awarded by managers to individuals who go above and beyond the highest expectations. Awarded for devising a streamlined HR process to increase efficiency.  People Operations (HR) Spot Bonus Award Google December 2010 Spot Bonus Awards are awarded by managers to individuals who go above and beyond the highest expectations. Awarded for devising a streamlined HR process to increase efficiency.  ", "Experience Program Manager, Google Fiber Google April 2015  – Present (5 months) Associate Strategist, SMB Services Google October 2012  –  April 2015  (2 years 7 months) As small/medium business experts, we help get local entrepreneurs on the map, and deliver a beautifully simple, intuitive experience that enables customers to grow their businesses with us through Google AdWords and other relevant Google properties such as Shopping, Places, Merchant Center, and Google Grants. By spotting and analyzing customer needs and trends, our innovative team of account strategists work on scalable solutions for small/medium-sized businesses to help drive greater business ROI and brand awareness. Women Techmakers - Community & Developer Marketing Google March 2014  –  March 2015  (1 year 1 month) Women Techmakers: Inspiration, community, and collaboration for women making an impact through technology. Rotational Customer Marketing Associate Google July 2014  –  September 2014  (3 months) • Design and execute multi-channel marketing campaigns to drive business acquisition and engagement with global cross-functional teams. \n• Develop compelling positioning, messaging, and value proposition for SMB advertisers and work closely with direct sales and support teams around acquisition and re-engagement strategies and messaging. \n• Create greater value for our advertisers by developing marketing messaging, materials, and programs to help businesses improve performance on AdWords. \n• Lead global launches to drive successful adoption of new and existing product features for more optimal account performance. \n• Evangelize our best practices for our customers via Google Hangouts on Air and other external communication channels including direct mail. Google Creative Sandbox - Social Media Manager Google March 2013  –  May 2014  (1 year 3 months) Understanding the full value and power of the digital media space, Google's Creative Sandbox is a unique platform that showcases the creative marketing campaigns of influential thought leaders, brands and creative agencies worldwide. Integrating the latest technological advances with compelling storytelling, these marketing campaigns highlight exemplary works that leverage digital innovation in modern-day advertising and marketing. Google+ Brand Partnerships Google July 2013  –  December 2013  (6 months) Collaborating with large consumer brands like Cadbury and H&M, the Google+ Brand Partnerships team works to bring businesses on to the social media platform, helping them to execute marketing campaigns that leverage the technology that Google+ provides (e.g. Hangouts, Google+ sign-in capabilities, etc.). These projects entail the whole process of creating and implementing a marketing campaign -- from brainstorming ideations based on creative briefs to developing pitch materials, to constructing detailed project plans and analyzing campaign activities and successes via case studies. Social Media & Marketing Programs Manager Mashery June 2011  –  September 2012  (1 year 4 months) San Francisco •Built up the corporate social media and community engagement strategy, and managed the execution of key initiatives. \n•Conducted market analysis to capture market research data for Marketing programs and Strategic Services’ projects. \n•Aggregated application programming interface (API) news, emerging technologies and social trends to provide time-sensitive content for company collateral (e.g. customer case studies) and Sales tools (e.g. messaging guidelines). \n•Managed composition and editorial aspects of the corporate blog, and conducted social media outreach. \n•Built and nurtured relations with social media community influencers, prospective clients, and existing Mashery customers. \n•Managed and organized initiatives related to event logistics, sponsorships, lead generation, and third-party relations with relevant stakeholders (Marketing, Sales, Developer Relations, Strategic Services). \n•Evangelized APIs and cross-platforms at conferences, tradeshows and hackathons (e.g. SXSW, TechCrunch Disrupt NYC). Bankruptcy Court Legal Intern U.S. Bankrupty Court of Rhode Island January 2011  –  April 2011  (4 months) •Prepared credit abuse prevention presentations for local high school classrooms.  \n•Performed data quality analysis on Loss Mitigation reports through the federal ECF system. \n•Managed the office’s annual federal surplus property disposal in adherence to federal policies. Marketing & Advertising Intern AlphaBird July 2010  –  September 2010  (3 months) • Drove over 100k viewers for clients by creating link share arrangements. \n• Authored Shimmervine web publication and blogs. \n• Conducted market research to generate greater awareness for clients’ long-form branded ads. \n• Managed over 4,500 accounts for agencies & ad networking publishers including brands like Tide. Immigrants' Rights Project Intern American Civil Liberties Union June 2010  –  August 2010  (3 months) •Tracked news reports and performed media research for the Arizona anti-illegal immigration case. \n•Led IRP’s reproduction of the 2010 National Immigrant Services Directory. \n•Acted as liaison between ACLU and aid-seeking immigrants by drafting communications material. Legal Intern San Francisco District Attorney June 2009  –  August 2009  (3 months) •Drafted legal motions filed with Court after review of defendants’ subpoenas and discovery matters. \n•Prepared attorneys’ case dispositions, three-strikes and cold case hearings efficiently. \n•Summarized cases and managed large, varying volumes of legal matters under short deadlines. Program Manager, Google Fiber Google April 2015  – Present (5 months) Program Manager, Google Fiber Google April 2015  – Present (5 months) Associate Strategist, SMB Services Google October 2012  –  April 2015  (2 years 7 months) As small/medium business experts, we help get local entrepreneurs on the map, and deliver a beautifully simple, intuitive experience that enables customers to grow their businesses with us through Google AdWords and other relevant Google properties such as Shopping, Places, Merchant Center, and Google Grants. By spotting and analyzing customer needs and trends, our innovative team of account strategists work on scalable solutions for small/medium-sized businesses to help drive greater business ROI and brand awareness. Associate Strategist, SMB Services Google October 2012  –  April 2015  (2 years 7 months) As small/medium business experts, we help get local entrepreneurs on the map, and deliver a beautifully simple, intuitive experience that enables customers to grow their businesses with us through Google AdWords and other relevant Google properties such as Shopping, Places, Merchant Center, and Google Grants. By spotting and analyzing customer needs and trends, our innovative team of account strategists work on scalable solutions for small/medium-sized businesses to help drive greater business ROI and brand awareness. Women Techmakers - Community & Developer Marketing Google March 2014  –  March 2015  (1 year 1 month) Women Techmakers: Inspiration, community, and collaboration for women making an impact through technology. Women Techmakers - Community & Developer Marketing Google March 2014  –  March 2015  (1 year 1 month) Women Techmakers: Inspiration, community, and collaboration for women making an impact through technology. Rotational Customer Marketing Associate Google July 2014  –  September 2014  (3 months) • Design and execute multi-channel marketing campaigns to drive business acquisition and engagement with global cross-functional teams. \n• Develop compelling positioning, messaging, and value proposition for SMB advertisers and work closely with direct sales and support teams around acquisition and re-engagement strategies and messaging. \n• Create greater value for our advertisers by developing marketing messaging, materials, and programs to help businesses improve performance on AdWords. \n• Lead global launches to drive successful adoption of new and existing product features for more optimal account performance. \n• Evangelize our best practices for our customers via Google Hangouts on Air and other external communication channels including direct mail. Rotational Customer Marketing Associate Google July 2014  –  September 2014  (3 months) • Design and execute multi-channel marketing campaigns to drive business acquisition and engagement with global cross-functional teams. \n• Develop compelling positioning, messaging, and value proposition for SMB advertisers and work closely with direct sales and support teams around acquisition and re-engagement strategies and messaging. \n• Create greater value for our advertisers by developing marketing messaging, materials, and programs to help businesses improve performance on AdWords. \n• Lead global launches to drive successful adoption of new and existing product features for more optimal account performance. \n• Evangelize our best practices for our customers via Google Hangouts on Air and other external communication channels including direct mail. Google Creative Sandbox - Social Media Manager Google March 2013  –  May 2014  (1 year 3 months) Understanding the full value and power of the digital media space, Google's Creative Sandbox is a unique platform that showcases the creative marketing campaigns of influential thought leaders, brands and creative agencies worldwide. Integrating the latest technological advances with compelling storytelling, these marketing campaigns highlight exemplary works that leverage digital innovation in modern-day advertising and marketing. Google Creative Sandbox - Social Media Manager Google March 2013  –  May 2014  (1 year 3 months) Understanding the full value and power of the digital media space, Google's Creative Sandbox is a unique platform that showcases the creative marketing campaigns of influential thought leaders, brands and creative agencies worldwide. Integrating the latest technological advances with compelling storytelling, these marketing campaigns highlight exemplary works that leverage digital innovation in modern-day advertising and marketing. Google+ Brand Partnerships Google July 2013  –  December 2013  (6 months) Collaborating with large consumer brands like Cadbury and H&M, the Google+ Brand Partnerships team works to bring businesses on to the social media platform, helping them to execute marketing campaigns that leverage the technology that Google+ provides (e.g. Hangouts, Google+ sign-in capabilities, etc.). These projects entail the whole process of creating and implementing a marketing campaign -- from brainstorming ideations based on creative briefs to developing pitch materials, to constructing detailed project plans and analyzing campaign activities and successes via case studies. Google+ Brand Partnerships Google July 2013  –  December 2013  (6 months) Collaborating with large consumer brands like Cadbury and H&M, the Google+ Brand Partnerships team works to bring businesses on to the social media platform, helping them to execute marketing campaigns that leverage the technology that Google+ provides (e.g. Hangouts, Google+ sign-in capabilities, etc.). These projects entail the whole process of creating and implementing a marketing campaign -- from brainstorming ideations based on creative briefs to developing pitch materials, to constructing detailed project plans and analyzing campaign activities and successes via case studies. Social Media & Marketing Programs Manager Mashery June 2011  –  September 2012  (1 year 4 months) San Francisco •Built up the corporate social media and community engagement strategy, and managed the execution of key initiatives. \n•Conducted market analysis to capture market research data for Marketing programs and Strategic Services’ projects. \n•Aggregated application programming interface (API) news, emerging technologies and social trends to provide time-sensitive content for company collateral (e.g. customer case studies) and Sales tools (e.g. messaging guidelines). \n•Managed composition and editorial aspects of the corporate blog, and conducted social media outreach. \n•Built and nurtured relations with social media community influencers, prospective clients, and existing Mashery customers. \n•Managed and organized initiatives related to event logistics, sponsorships, lead generation, and third-party relations with relevant stakeholders (Marketing, Sales, Developer Relations, Strategic Services). \n•Evangelized APIs and cross-platforms at conferences, tradeshows and hackathons (e.g. SXSW, TechCrunch Disrupt NYC). Social Media & Marketing Programs Manager Mashery June 2011  –  September 2012  (1 year 4 months) San Francisco •Built up the corporate social media and community engagement strategy, and managed the execution of key initiatives. \n•Conducted market analysis to capture market research data for Marketing programs and Strategic Services’ projects. \n•Aggregated application programming interface (API) news, emerging technologies and social trends to provide time-sensitive content for company collateral (e.g. customer case studies) and Sales tools (e.g. messaging guidelines). \n•Managed composition and editorial aspects of the corporate blog, and conducted social media outreach. \n•Built and nurtured relations with social media community influencers, prospective clients, and existing Mashery customers. \n•Managed and organized initiatives related to event logistics, sponsorships, lead generation, and third-party relations with relevant stakeholders (Marketing, Sales, Developer Relations, Strategic Services). \n•Evangelized APIs and cross-platforms at conferences, tradeshows and hackathons (e.g. SXSW, TechCrunch Disrupt NYC). Bankruptcy Court Legal Intern U.S. Bankrupty Court of Rhode Island January 2011  –  April 2011  (4 months) •Prepared credit abuse prevention presentations for local high school classrooms.  \n•Performed data quality analysis on Loss Mitigation reports through the federal ECF system. \n•Managed the office’s annual federal surplus property disposal in adherence to federal policies. Bankruptcy Court Legal Intern U.S. Bankrupty Court of Rhode Island January 2011  –  April 2011  (4 months) •Prepared credit abuse prevention presentations for local high school classrooms.  \n•Performed data quality analysis on Loss Mitigation reports through the federal ECF system. \n•Managed the office’s annual federal surplus property disposal in adherence to federal policies. Marketing & Advertising Intern AlphaBird July 2010  –  September 2010  (3 months) • Drove over 100k viewers for clients by creating link share arrangements. \n• Authored Shimmervine web publication and blogs. \n• Conducted market research to generate greater awareness for clients’ long-form branded ads. \n• Managed over 4,500 accounts for agencies & ad networking publishers including brands like Tide. Marketing & Advertising Intern AlphaBird July 2010  –  September 2010  (3 months) • Drove over 100k viewers for clients by creating link share arrangements. \n• Authored Shimmervine web publication and blogs. \n• Conducted market research to generate greater awareness for clients’ long-form branded ads. \n• Managed over 4,500 accounts for agencies & ad networking publishers including brands like Tide. Immigrants' Rights Project Intern American Civil Liberties Union June 2010  –  August 2010  (3 months) •Tracked news reports and performed media research for the Arizona anti-illegal immigration case. \n•Led IRP’s reproduction of the 2010 National Immigrant Services Directory. \n•Acted as liaison between ACLU and aid-seeking immigrants by drafting communications material. Immigrants' Rights Project Intern American Civil Liberties Union June 2010  –  August 2010  (3 months) •Tracked news reports and performed media research for the Arizona anti-illegal immigration case. \n•Led IRP’s reproduction of the 2010 National Immigrant Services Directory. \n•Acted as liaison between ACLU and aid-seeking immigrants by drafting communications material. Legal Intern San Francisco District Attorney June 2009  –  August 2009  (3 months) •Drafted legal motions filed with Court after review of defendants’ subpoenas and discovery matters. \n•Prepared attorneys’ case dispositions, three-strikes and cold case hearings efficiently. \n•Summarized cases and managed large, varying volumes of legal matters under short deadlines. Legal Intern San Francisco District Attorney June 2009  –  August 2009  (3 months) •Drafted legal motions filed with Court after review of defendants’ subpoenas and discovery matters. \n•Prepared attorneys’ case dispositions, three-strikes and cold case hearings efficiently. \n•Summarized cases and managed large, varying volumes of legal matters under short deadlines. Languages   Skills Marketing Operations Blogging Event Management Market Research Salesforce.com Social Media Marketing Google Adwords Project Planning Google Analytics Copy Editing Project Management SEO Lead Generation Social Media CRM Digital Media See 1+     See less Skills  Marketing Operations Blogging Event Management Market Research Salesforce.com Social Media Marketing Google Adwords Project Planning Google Analytics Copy Editing Project Management SEO Lead Generation Social Media CRM Digital Media See 1+     See less Marketing Operations Blogging Event Management Market Research Salesforce.com Social Media Marketing Google Adwords Project Planning Google Analytics Copy Editing Project Management SEO Lead Generation Social Media CRM Digital Media See 1+     See less Marketing Operations Blogging Event Management Market Research Salesforce.com Social Media Marketing Google Adwords Project Planning Google Analytics Copy Editing Project Management SEO Lead Generation Social Media CRM Digital Media See 1+     See less Education Brown University Bachelor of Arts,  Political Science 2007  – 2011 Activities and Societies:  Unite For Sight ,  Adopt-A-Grandparent ,  Chinese Student Association ,  Rebuilding Together ,  China Care ,  Genesis ESOL Center ,  Project Eye-To-Eye. UC Berkeley 2012 UC Berkeley Extension courses: \n* Introduction to Marketing \n* Introduction to High-Tech Product Management and Marketing General Assembly Front-End Web Development 2013 HTML5, Advanced CSS3, Implementation of SEO/page layout strategies, mobile web development design, JavaScript, jQuery Brown University Bachelor of Arts,  Political Science 2007  – 2011 Activities and Societies:  Unite For Sight ,  Adopt-A-Grandparent ,  Chinese Student Association ,  Rebuilding Together ,  China Care ,  Genesis ESOL Center ,  Project Eye-To-Eye. Brown University Bachelor of Arts,  Political Science 2007  – 2011 Activities and Societies:  Unite For Sight ,  Adopt-A-Grandparent ,  Chinese Student Association ,  Rebuilding Together ,  China Care ,  Genesis ESOL Center ,  Project Eye-To-Eye. Brown University Bachelor of Arts,  Political Science 2007  – 2011 Activities and Societies:  Unite For Sight ,  Adopt-A-Grandparent ,  Chinese Student Association ,  Rebuilding Together ,  China Care ,  Genesis ESOL Center ,  Project Eye-To-Eye. UC Berkeley 2012 UC Berkeley Extension courses: \n* Introduction to Marketing \n* Introduction to High-Tech Product Management and Marketing UC Berkeley 2012 UC Berkeley Extension courses: \n* Introduction to Marketing \n* Introduction to High-Tech Product Management and Marketing UC Berkeley 2012 UC Berkeley Extension courses: \n* Introduction to Marketing \n* Introduction to High-Tech Product Management and Marketing General Assembly Front-End Web Development 2013 HTML5, Advanced CSS3, Implementation of SEO/page layout strategies, mobile web development design, JavaScript, jQuery General Assembly Front-End Web Development 2013 HTML5, Advanced CSS3, Implementation of SEO/page layout strategies, mobile web development design, JavaScript, jQuery General Assembly Front-End Web Development 2013 HTML5, Advanced CSS3, Implementation of SEO/page layout strategies, mobile web development design, JavaScript, jQuery Honors & Awards San Mateo County Hall of Fame, Young Woman of Excellence May 2007 Daly City's Young Woman of Promise May 2007 San Mateo County Hall of Fame, Young Woman of Excellence May 2007 San Mateo County Hall of Fame, Young Woman of Excellence May 2007 San Mateo County Hall of Fame, Young Woman of Excellence May 2007 Daly City's Young Woman of Promise May 2007 Daly City's Young Woman of Promise May 2007 Daly City's Young Woman of Promise May 2007 ", "Skills Private Equity Due Diligence Valuation Financial Modeling Investment Banking Corporate Finance Capital Markets Mergers Asset Managment Corporate Development Financial Analysis Business Valuation Hedge Funds Investments Alternative Investments Mergers & Acquisitions Asset Management See 2+     See less Skills  Private Equity Due Diligence Valuation Financial Modeling Investment Banking Corporate Finance Capital Markets Mergers Asset Managment Corporate Development Financial Analysis Business Valuation Hedge Funds Investments Alternative Investments Mergers & Acquisitions Asset Management See 2+     See less Private Equity Due Diligence Valuation Financial Modeling Investment Banking Corporate Finance Capital Markets Mergers Asset Managment Corporate Development Financial Analysis Business Valuation Hedge Funds Investments Alternative Investments Mergers & Acquisitions Asset Management See 2+     See less Private Equity Due Diligence Valuation Financial Modeling Investment Banking Corporate Finance Capital Markets Mergers Asset Managment Corporate Development Financial Analysis Business Valuation Hedge Funds Investments Alternative Investments Mergers & Acquisitions Asset Management See 2+     See less ", "Experience ISP Delivery Manager, Core Systems, Google Fiber Google July 2015  – Present (2 months) Mountain View, California SCO Solutions Program Manager - Google Fiber Google July 2014  –  July 2015  (1 year 1 month) Mountain View, CA IT Solutions Program Manager, Logistics - Google Inc. January 2011  –  July 2014  (3 years 7 months) Program Manager Google January 2007  –  January 2011  (4 years 1 month) Mountain View, CA Global Logistics Manager Samsung Semiconductor January 2006  –  December 2006  (1 year) Senior Program Manager, – Transition Team Hitachi GST/ SCM January 2003  –  January 2006  (3 years 1 month) Senior Manager, Business Operations Hitachi America / Business Ops July 2000  –  December 2002  (2 years 6 months) Program / Project Manager, OEM Imaging Sales Fujitsu Computer Products of America / Sales November 1999  –  June 2000  (8 months) Product Operations & Customer Support Manager (Imaging Group) Fujitsu Computer Products of America / Sales Ops November 1998  –  December 1999  (1 year 2 months) Material Planner to Senior Material Planner to Operations Manager Hitachi America / Business Ops July 1995  –  November 1998  (3 years 5 months) ISP Delivery Manager, Core Systems, Google Fiber Google July 2015  – Present (2 months) Mountain View, California ISP Delivery Manager, Core Systems, Google Fiber Google July 2015  – Present (2 months) Mountain View, California SCO Solutions Program Manager - Google Fiber Google July 2014  –  July 2015  (1 year 1 month) Mountain View, CA SCO Solutions Program Manager - Google Fiber Google July 2014  –  July 2015  (1 year 1 month) Mountain View, CA IT Solutions Program Manager, Logistics - Google Inc. January 2011  –  July 2014  (3 years 7 months) IT Solutions Program Manager, Logistics - Google Inc. January 2011  –  July 2014  (3 years 7 months) Program Manager Google January 2007  –  January 2011  (4 years 1 month) Mountain View, CA Program Manager Google January 2007  –  January 2011  (4 years 1 month) Mountain View, CA Global Logistics Manager Samsung Semiconductor January 2006  –  December 2006  (1 year) Global Logistics Manager Samsung Semiconductor January 2006  –  December 2006  (1 year) Senior Program Manager, – Transition Team Hitachi GST/ SCM January 2003  –  January 2006  (3 years 1 month) Senior Program Manager, – Transition Team Hitachi GST/ SCM January 2003  –  January 2006  (3 years 1 month) Senior Manager, Business Operations Hitachi America / Business Ops July 2000  –  December 2002  (2 years 6 months) Senior Manager, Business Operations Hitachi America / Business Ops July 2000  –  December 2002  (2 years 6 months) Program / Project Manager, OEM Imaging Sales Fujitsu Computer Products of America / Sales November 1999  –  June 2000  (8 months) Program / Project Manager, OEM Imaging Sales Fujitsu Computer Products of America / Sales November 1999  –  June 2000  (8 months) Product Operations & Customer Support Manager (Imaging Group) Fujitsu Computer Products of America / Sales Ops November 1998  –  December 1999  (1 year 2 months) Product Operations & Customer Support Manager (Imaging Group) Fujitsu Computer Products of America / Sales Ops November 1998  –  December 1999  (1 year 2 months) Material Planner to Senior Material Planner to Operations Manager Hitachi America / Business Ops July 1995  –  November 1998  (3 years 5 months) Material Planner to Senior Material Planner to Operations Manager Hitachi America / Business Ops July 1995  –  November 1998  (3 years 5 months) Skills Program Management Supply Chain Logistics Process Improvement Supply Chain Management IT Solutions IT strategy IT PROJECT... ORACLE APPLICATIONS CONTENT MANAGEMENT IT Strategy Project Management IT Project... SAP Content Management Management Leadership Operations Management Negotiation Oracle Applications Business Development Contract Negotiation Sales Operations Cross-functional Team... Product Management Vendor Management See 11+     See less Skills  Program Management Supply Chain Logistics Process Improvement Supply Chain Management IT Solutions IT strategy IT PROJECT... ORACLE APPLICATIONS CONTENT MANAGEMENT IT Strategy Project Management IT Project... SAP Content Management Management Leadership Operations Management Negotiation Oracle Applications Business Development Contract Negotiation Sales Operations Cross-functional Team... Product Management Vendor Management See 11+     See less Program Management Supply Chain Logistics Process Improvement Supply Chain Management IT Solutions IT strategy IT PROJECT... ORACLE APPLICATIONS CONTENT MANAGEMENT IT Strategy Project Management IT Project... SAP Content Management Management Leadership Operations Management Negotiation Oracle Applications Business Development Contract Negotiation Sales Operations Cross-functional Team... Product Management Vendor Management See 11+     See less Program Management Supply Chain Logistics Process Improvement Supply Chain Management IT Solutions IT strategy IT PROJECT... ORACLE APPLICATIONS CONTENT MANAGEMENT IT Strategy Project Management IT Project... SAP Content Management Management Leadership Operations Management Negotiation Oracle Applications Business Development Contract Negotiation Sales Operations Cross-functional Team... Product Management Vendor Management See 11+     See less Education Stanford University Certified Advanced Project Management,  Program Management 2011  – 2012 The Stanford Advanced Project Management Certificate program provides participants the advanced skills needed to execute business strategies effectively. They receive Stanford theory, combined with practical instruction on the processes, organizational structures and tools to ensure their project work yields the desired business results. Notre Dame de Namur University MBA,  Marketing September 1997  – December 2000 Activities and Societies:  GPA 3.87 University of California at Davis BS,  Managerial Economics September 1987  – December 1991 Activities and Societies:  Sigma Chi Fraternity Stanford University Certified Advanced Project Management,  Program Management 2011  – 2012 The Stanford Advanced Project Management Certificate program provides participants the advanced skills needed to execute business strategies effectively. They receive Stanford theory, combined with practical instruction on the processes, organizational structures and tools to ensure their project work yields the desired business results. Stanford University Certified Advanced Project Management,  Program Management 2011  – 2012 The Stanford Advanced Project Management Certificate program provides participants the advanced skills needed to execute business strategies effectively. They receive Stanford theory, combined with practical instruction on the processes, organizational structures and tools to ensure their project work yields the desired business results. Stanford University Certified Advanced Project Management,  Program Management 2011  – 2012 The Stanford Advanced Project Management Certificate program provides participants the advanced skills needed to execute business strategies effectively. They receive Stanford theory, combined with practical instruction on the processes, organizational structures and tools to ensure their project work yields the desired business results. Notre Dame de Namur University MBA,  Marketing September 1997  – December 2000 Activities and Societies:  GPA 3.87 Notre Dame de Namur University MBA,  Marketing September 1997  – December 2000 Activities and Societies:  GPA 3.87 Notre Dame de Namur University MBA,  Marketing September 1997  – December 2000 Activities and Societies:  GPA 3.87 University of California at Davis BS,  Managerial Economics September 1987  – December 1991 Activities and Societies:  Sigma Chi Fraternity University of California at Davis BS,  Managerial Economics September 1987  – December 1991 Activities and Societies:  Sigma Chi Fraternity University of California at Davis BS,  Managerial Economics September 1987  – December 1991 Activities and Societies:  Sigma Chi Fraternity ", "Skills Alcatel-Lucent 3RP Prince2 Foundation Cisco CCNA Juniper JNCIA Networking Servers Troubleshooting Requirements Analysis Integration Twitter ATM networks CCNA QoS PRINCE2 IP MPLS Juniper WAN Telecommunications BGP Ethernet Network Security Network Design Routing VoIP VPLS TCP/IP Cisco Technologies OSPF Network Architecture ISDN DWDM Carrier Ethernet Frame Relay SIP DSL RIP SNMP Metro Ethernet NMS Computer Network... ATM Networks See 27+     See less Skills  Alcatel-Lucent 3RP Prince2 Foundation Cisco CCNA Juniper JNCIA Networking Servers Troubleshooting Requirements Analysis Integration Twitter ATM networks CCNA QoS PRINCE2 IP MPLS Juniper WAN Telecommunications BGP Ethernet Network Security Network Design Routing VoIP VPLS TCP/IP Cisco Technologies OSPF Network Architecture ISDN DWDM Carrier Ethernet Frame Relay SIP DSL RIP SNMP Metro Ethernet NMS Computer Network... ATM Networks See 27+     See less Alcatel-Lucent 3RP Prince2 Foundation Cisco CCNA Juniper JNCIA Networking Servers Troubleshooting Requirements Analysis Integration Twitter ATM networks CCNA QoS PRINCE2 IP MPLS Juniper WAN Telecommunications BGP Ethernet Network Security Network Design Routing VoIP VPLS TCP/IP Cisco Technologies OSPF Network Architecture ISDN DWDM Carrier Ethernet Frame Relay SIP DSL RIP SNMP Metro Ethernet NMS Computer Network... ATM Networks See 27+     See less Alcatel-Lucent 3RP Prince2 Foundation Cisco CCNA Juniper JNCIA Networking Servers Troubleshooting Requirements Analysis Integration Twitter ATM networks CCNA QoS PRINCE2 IP MPLS Juniper WAN Telecommunications BGP Ethernet Network Security Network Design Routing VoIP VPLS TCP/IP Cisco Technologies OSPF Network Architecture ISDN DWDM Carrier Ethernet Frame Relay SIP DSL RIP SNMP Metro Ethernet NMS Computer Network... ATM Networks See 27+     See less ", "Summary Motivated, self-sufficient individual with solid international experience in business operations, financial analysis, budgeting and strategic planning.  \n \nInterests: operational consulting, change management, process re-engineering. Summary Motivated, self-sufficient individual with solid international experience in business operations, financial analysis, budgeting and strategic planning.  \n \nInterests: operational consulting, change management, process re-engineering. Motivated, self-sufficient individual with solid international experience in business operations, financial analysis, budgeting and strategic planning.  \n \nInterests: operational consulting, change management, process re-engineering. Motivated, self-sufficient individual with solid international experience in business operations, financial analysis, budgeting and strategic planning.  \n \nInterests: operational consulting, change management, process re-engineering. Experience Program Manager, Google Fiber Google January 2014  – Present (1 year 8 months) Mountain View Senior Analyst, Corporate Finance Google July 2012  –  January 2014  (1 year 7 months) United States Manage the enhancement of end-to-end global finance reporting and processes \nWork with cross functional participants in setting financial systems project priorities \nPerform process re-engineering by challenging the status quo of current financial systems, processes EMEA Marketing Finance Analyst Google October 2010  –  July 2012  (1 year 10 months) London, United Kindom Support of Marketing Leads with development of marketing and resource plans across Europe, the Middle East and Africa \nDevelopment of processes, tools and reports to improve budget management of more than 20 teams across the region \nLeading of the monthly close and forecasting processes to minimize and control variances \nCollaboration with Global Team to manage global processes and develop global processes and tools Senior Financial Analyst SEEMEA HQ Procter & Gamble July 2009  –  October 2010  (1 year 4 months) Geneva Area, Switzerland Financial support of regional product launches in CEEMEA markets \nRegional financial analysis of the marketing and trade spending ROI \nRegional Competitive benchmark analysis \nStrategic short and long-term business planning \nSupport of full P/L management across CEEMEA markets Financial Analyst \"Fabric and Home care\" products Procter & Gamble July 2007  –  July 2009  (2 years 1 month) Moscow, Russian Federation Financial support of local product launches in Russia, Ukraine and Belarus \nLocal financial analysis of the marketing and trade spending ROI \nBenchmark analysis of local competitors \nStrategic short and medium-term business planning \nFull P/L management of \"Fabric and Home care\" products in Russia, Ukraine and Belarus Program Manager, Google Fiber Google January 2014  – Present (1 year 8 months) Mountain View Program Manager, Google Fiber Google January 2014  – Present (1 year 8 months) Mountain View Senior Analyst, Corporate Finance Google July 2012  –  January 2014  (1 year 7 months) United States Manage the enhancement of end-to-end global finance reporting and processes \nWork with cross functional participants in setting financial systems project priorities \nPerform process re-engineering by challenging the status quo of current financial systems, processes Senior Analyst, Corporate Finance Google July 2012  –  January 2014  (1 year 7 months) United States Manage the enhancement of end-to-end global finance reporting and processes \nWork with cross functional participants in setting financial systems project priorities \nPerform process re-engineering by challenging the status quo of current financial systems, processes EMEA Marketing Finance Analyst Google October 2010  –  July 2012  (1 year 10 months) London, United Kindom Support of Marketing Leads with development of marketing and resource plans across Europe, the Middle East and Africa \nDevelopment of processes, tools and reports to improve budget management of more than 20 teams across the region \nLeading of the monthly close and forecasting processes to minimize and control variances \nCollaboration with Global Team to manage global processes and develop global processes and tools EMEA Marketing Finance Analyst Google October 2010  –  July 2012  (1 year 10 months) London, United Kindom Support of Marketing Leads with development of marketing and resource plans across Europe, the Middle East and Africa \nDevelopment of processes, tools and reports to improve budget management of more than 20 teams across the region \nLeading of the monthly close and forecasting processes to minimize and control variances \nCollaboration with Global Team to manage global processes and develop global processes and tools Senior Financial Analyst SEEMEA HQ Procter & Gamble July 2009  –  October 2010  (1 year 4 months) Geneva Area, Switzerland Financial support of regional product launches in CEEMEA markets \nRegional financial analysis of the marketing and trade spending ROI \nRegional Competitive benchmark analysis \nStrategic short and long-term business planning \nSupport of full P/L management across CEEMEA markets Senior Financial Analyst SEEMEA HQ Procter & Gamble July 2009  –  October 2010  (1 year 4 months) Geneva Area, Switzerland Financial support of regional product launches in CEEMEA markets \nRegional financial analysis of the marketing and trade spending ROI \nRegional Competitive benchmark analysis \nStrategic short and long-term business planning \nSupport of full P/L management across CEEMEA markets Financial Analyst \"Fabric and Home care\" products Procter & Gamble July 2007  –  July 2009  (2 years 1 month) Moscow, Russian Federation Financial support of local product launches in Russia, Ukraine and Belarus \nLocal financial analysis of the marketing and trade spending ROI \nBenchmark analysis of local competitors \nStrategic short and medium-term business planning \nFull P/L management of \"Fabric and Home care\" products in Russia, Ukraine and Belarus Financial Analyst \"Fabric and Home care\" products Procter & Gamble July 2007  –  July 2009  (2 years 1 month) Moscow, Russian Federation Financial support of local product launches in Russia, Ukraine and Belarus \nLocal financial analysis of the marketing and trade spending ROI \nBenchmark analysis of local competitors \nStrategic short and medium-term business planning \nFull P/L management of \"Fabric and Home care\" products in Russia, Ukraine and Belarus Languages English Russian English Russian English Russian Skills Business Strategy P&L Management Financial Planning Business Operations Business Process... Change Management Cross-functional Team... Business Process... Process Automation Project Management Business Planning Process Optimization Strategic Planning Competitive Analysis Financial Analysis Corporate Finance Marketing Strategy See 2+     See less Skills  Business Strategy P&L Management Financial Planning Business Operations Business Process... Change Management Cross-functional Team... Business Process... Process Automation Project Management Business Planning Process Optimization Strategic Planning Competitive Analysis Financial Analysis Corporate Finance Marketing Strategy See 2+     See less Business Strategy P&L Management Financial Planning Business Operations Business Process... Change Management Cross-functional Team... Business Process... Process Automation Project Management Business Planning Process Optimization Strategic Planning Competitive Analysis Financial Analysis Corporate Finance Marketing Strategy See 2+     See less Business Strategy P&L Management Financial Planning Business Operations Business Process... Change Management Cross-functional Team... Business Process... Process Automation Project Management Business Planning Process Optimization Strategic Planning Competitive Analysis Financial Analysis Corporate Finance Marketing Strategy See 2+     See less Education State University of Management (Moscow) 5 (with honors),  Financial Management 2003  – 2008 The winner of the University’s Olympiads by the statistics, mathematics, macroeconomics.  \nThe candidate of the name stipendiary (the award for the excellent studying). State University of Management (Moscow) 5 (with honors),  Financial Management 2003  – 2008 The winner of the University’s Olympiads by the statistics, mathematics, macroeconomics.  \nThe candidate of the name stipendiary (the award for the excellent studying). State University of Management (Moscow) 5 (with honors),  Financial Management 2003  – 2008 The winner of the University’s Olympiads by the statistics, mathematics, macroeconomics.  \nThe candidate of the name stipendiary (the award for the excellent studying). State University of Management (Moscow) 5 (with honors),  Financial Management 2003  – 2008 The winner of the University’s Olympiads by the statistics, mathematics, macroeconomics.  \nThe candidate of the name stipendiary (the award for the excellent studying). Honors & Awards Additional Honors & Awards Certified Management Accountant (CMA) Additional Honors & Awards Certified Management Accountant (CMA) Additional Honors & Awards Certified Management Accountant (CMA) Additional Honors & Awards Certified Management Accountant (CMA) ", "Skills YouTube DoubleClick Adsense Team Leadership PPC Ad Networks Ad Serving Display Advertising Mobile Marketing Management Program Management Servers Team Management Mobile Advertising Web Analytics Google Adwords Operations Management Google Analytics SEM See 4+     See less Skills  YouTube DoubleClick Adsense Team Leadership PPC Ad Networks Ad Serving Display Advertising Mobile Marketing Management Program Management Servers Team Management Mobile Advertising Web Analytics Google Adwords Operations Management Google Analytics SEM See 4+     See less YouTube DoubleClick Adsense Team Leadership PPC Ad Networks Ad Serving Display Advertising Mobile Marketing Management Program Management Servers Team Management Mobile Advertising Web Analytics Google Adwords Operations Management Google Analytics SEM See 4+     See less YouTube DoubleClick Adsense Team Leadership PPC Ad Networks Ad Serving Display Advertising Mobile Marketing Management Program Management Servers Team Management Mobile Advertising Web Analytics Google Adwords Operations Management Google Analytics SEM See 4+     See less ", "Experience Senior Program Manager, Google Fiber Google May 2015  – Present (4 months) Portland, Oregon Executive Director West Coast Infrastructure Exchange April 2013  –  May 2015  (2 years 2 months) Portland, Oregon Area California, Oregon, Washington and British Columbia have combined to form the West Coast Infrastructure Exchange (WCX). The partnership is being launched to create a smarter way to finance and facilitate development of the infrastructure needed to improve the region’s economic competitiveness, support jobs and families, and enhance our shared quality of life. \nThe exchange is a leadership initiative linking governors, treasurers and key infrastructure development agencies in the Pacific region. All West Coast states and the province of British Columbia need to expand and upgrade energy facilities, update wastewater treatment plants, improve airports and dams, build transportation facilities and other critical community facilities. At the same time, state and local governments face limits on available financing through traditional sources. The West Coast Infrastructure Exchange is designed to tap the expertise of development and finance leaders throughout the West Coast to find innovative financing methods. Learn more at www.westcoastx.com Chief Development Officer Element Power January 2009  –  April 2013  (4 years 4 months) Director of Development Horizon Wind Energy January 2002  –  October 2008  (6 years 10 months) Manager, Solid Waste and Recycling Program Oregon Department of Environmental Quality August 1999  –  December 2001  (2 years 5 months) Environmental Advocate OSPIRG 1994  –  1997  (3 years) Portland, Oregon Area Volunteer Peace Corps 1991  –  1994  (3 years) Cote D'Ivoire (Ivory Coast) Urban Environmental Management program.  \nLed UNHCR-funded sanitation project for Liberian refugees. Senior Program Manager, Google Fiber Google May 2015  – Present (4 months) Portland, Oregon Senior Program Manager, Google Fiber Google May 2015  – Present (4 months) Portland, Oregon Executive Director West Coast Infrastructure Exchange April 2013  –  May 2015  (2 years 2 months) Portland, Oregon Area California, Oregon, Washington and British Columbia have combined to form the West Coast Infrastructure Exchange (WCX). The partnership is being launched to create a smarter way to finance and facilitate development of the infrastructure needed to improve the region’s economic competitiveness, support jobs and families, and enhance our shared quality of life. \nThe exchange is a leadership initiative linking governors, treasurers and key infrastructure development agencies in the Pacific region. All West Coast states and the province of British Columbia need to expand and upgrade energy facilities, update wastewater treatment plants, improve airports and dams, build transportation facilities and other critical community facilities. At the same time, state and local governments face limits on available financing through traditional sources. The West Coast Infrastructure Exchange is designed to tap the expertise of development and finance leaders throughout the West Coast to find innovative financing methods. Learn more at www.westcoastx.com Executive Director West Coast Infrastructure Exchange April 2013  –  May 2015  (2 years 2 months) Portland, Oregon Area California, Oregon, Washington and British Columbia have combined to form the West Coast Infrastructure Exchange (WCX). The partnership is being launched to create a smarter way to finance and facilitate development of the infrastructure needed to improve the region’s economic competitiveness, support jobs and families, and enhance our shared quality of life. \nThe exchange is a leadership initiative linking governors, treasurers and key infrastructure development agencies in the Pacific region. All West Coast states and the province of British Columbia need to expand and upgrade energy facilities, update wastewater treatment plants, improve airports and dams, build transportation facilities and other critical community facilities. At the same time, state and local governments face limits on available financing through traditional sources. The West Coast Infrastructure Exchange is designed to tap the expertise of development and finance leaders throughout the West Coast to find innovative financing methods. Learn more at www.westcoastx.com Chief Development Officer Element Power January 2009  –  April 2013  (4 years 4 months) Chief Development Officer Element Power January 2009  –  April 2013  (4 years 4 months) Director of Development Horizon Wind Energy January 2002  –  October 2008  (6 years 10 months) Director of Development Horizon Wind Energy January 2002  –  October 2008  (6 years 10 months) Manager, Solid Waste and Recycling Program Oregon Department of Environmental Quality August 1999  –  December 2001  (2 years 5 months) Manager, Solid Waste and Recycling Program Oregon Department of Environmental Quality August 1999  –  December 2001  (2 years 5 months) Environmental Advocate OSPIRG 1994  –  1997  (3 years) Portland, Oregon Area Environmental Advocate OSPIRG 1994  –  1997  (3 years) Portland, Oregon Area Volunteer Peace Corps 1991  –  1994  (3 years) Cote D'Ivoire (Ivory Coast) Urban Environmental Management program.  \nLed UNHCR-funded sanitation project for Liberian refugees. Volunteer Peace Corps 1991  –  1994  (3 years) Cote D'Ivoire (Ivory Coast) Urban Environmental Management program.  \nLed UNHCR-funded sanitation project for Liberian refugees. Languages French French French Skills Renewable Energy Wind Solar Energy Sustainability Energy Policy Due Diligence Project Management Mergers Photovoltaics Business Development Strategy Contract Negotiation Wind Turbines Mergers & Acquisitions Environmental Policy Sustainable Development Sustainable Energy Power Generation Engineering Leadership See 5+     See less Skills  Renewable Energy Wind Solar Energy Sustainability Energy Policy Due Diligence Project Management Mergers Photovoltaics Business Development Strategy Contract Negotiation Wind Turbines Mergers & Acquisitions Environmental Policy Sustainable Development Sustainable Energy Power Generation Engineering Leadership See 5+     See less Renewable Energy Wind Solar Energy Sustainability Energy Policy Due Diligence Project Management Mergers Photovoltaics Business Development Strategy Contract Negotiation Wind Turbines Mergers & Acquisitions Environmental Policy Sustainable Development Sustainable Energy Power Generation Engineering Leadership See 5+     See less Renewable Energy Wind Solar Energy Sustainability Energy Policy Due Diligence Project Management Mergers Photovoltaics Business Development Strategy Contract Negotiation Wind Turbines Mergers & Acquisitions Environmental Policy Sustainable Development Sustainable Energy Power Generation Engineering Leadership See 5+     See less Education Princeton University MPA,  Economics and Public Policy 1997  – 1999 Activities and Societies:  Stokes Prize winner Amherst College BA, magna cum laude,  Politics and Economics 1987  – 1991 Activities and Societies:  Phi Beta Kappa Wilson High School, Portland, OR 1983  – 1987 Princeton University MPA,  Economics and Public Policy 1997  – 1999 Activities and Societies:  Stokes Prize winner Princeton University MPA,  Economics and Public Policy 1997  – 1999 Activities and Societies:  Stokes Prize winner Princeton University MPA,  Economics and Public Policy 1997  – 1999 Activities and Societies:  Stokes Prize winner Amherst College BA, magna cum laude,  Politics and Economics 1987  – 1991 Activities and Societies:  Phi Beta Kappa Amherst College BA, magna cum laude,  Politics and Economics 1987  – 1991 Activities and Societies:  Phi Beta Kappa Amherst College BA, magna cum laude,  Politics and Economics 1987  – 1991 Activities and Societies:  Phi Beta Kappa Wilson High School, Portland, OR 1983  – 1987 Wilson High School, Portland, OR 1983  – 1987 Wilson High School, Portland, OR 1983  – 1987 Honors & Awards Achievement Award in Advocacy American Wind Energy Association Harry S. Truman Scholar Truman Foundation 1989 Marshall Memorial Fellow German Marshall Fund of the United States 2000 Young leaders travel fellowship to five European countries Achievement Award in Advocacy American Wind Energy Association Achievement Award in Advocacy American Wind Energy Association Achievement Award in Advocacy American Wind Energy Association Harry S. Truman Scholar Truman Foundation 1989 Harry S. Truman Scholar Truman Foundation 1989 Harry S. Truman Scholar Truman Foundation 1989 Marshall Memorial Fellow German Marshall Fund of the United States 2000 Young leaders travel fellowship to five European countries Marshall Memorial Fellow German Marshall Fund of the United States 2000 Young leaders travel fellowship to five European countries Marshall Memorial Fellow German Marshall Fund of the United States 2000 Young leaders travel fellowship to five European countries ", "Experience Program Manager, Google Fiber Google April 2015  – Present (5 months) - Managing Platforms Software programs \n- FE Engineer for B/OSS application  Program Manager, Google Apps for Work Google August 2014  – Present (1 year 1 month) Mountain View, CA - Successfully managed programs from ideation through execution and evaluation \n- Designing and developing internal solutions with AngularJS \n- Deploying NodeJS/Python applications on Google App Engine with Managed VMs (Docker) Senior Engineering Manager Netpulse January 2014  –  August 2014  (8 months) San Francisco Bay Area - Managing 10 Software Engineers building the server, web and mobile application \n- Architecting the next generation app infrastructure and prototyping innovative ideas \n- Led technical discussions with key stakeholders and external partners \n- Senior Front-end Engineer designing and building the UI, core functionality and complex integrations Senior Javascript Engineer Netpulse March 2013  –  December 2013  (10 months) San Francisco Bay Area - UX Engineering at one.netpulse.com - AngularJS \n- Developing UI solutions for Linux and Windows based embedded devices \n- Writing Object-Oriented Javascript for client and server interactions Web App Developer (Contract) Cozy February 2013  –  February 2013  (1 month) San Francisco - Working across the stack with CSS3, HTML5, Javascript, Ruby and Underscore.js \n- Turning Photoshop designs into pixel-perfect, cross-browser compatible HTML5 and CSS3 Technical Program/Campaign Manager MoveOn.org October 2011  –  December 2012  (1 year 3 months) * Product Manager for MoveOn's 'Organize' platform (www.moveon.org/organize); led 2 designers, 4 field staff and 3 developers; responsible for product vision and requirements in collaboration with Field Staff and members; hundreds of daily users and thousands of lines of code; created wireframes and prototypes for new features; built site with HTML, CSS and Javascript and integrated with existing Perl/ Mason framework; increased time spent on site by over 30%; decreased bounce rate by almost 20% \n* Designed and wrote SQL for ad-hoc reporting, mass mail custom targeting, and websites \n* Responsible for managing product roadmap of internal tools and applications supporting over 50 staff \n* Created and executed training program for over 20 staff on web technologies Technology Consultant (SCU MSIS Capstone Project) Intuit September 2011  –  January 2012  (5 months) Mountain View, CA * Led a team of 4 to advise the Intuit Engineering Management team on the best approach to transition to a SaaS model for hosting services \n* Coordinated and conducted end-to-end assessment of the processes within Operations Engineering Infrastructure (OEI) group to deliver hosting services \n* Delivered a 25 page solution providing policy and process changes to improve hosting services Web Developer/ IT Lead Islamic Relief USA October 2007  –  September 2011  (4 years) * Initiated and managed redevelopment of www.irusa.org; 13 month project, 8 team members, $90k cost; increased site visitors by 10% between 2010 and 2011; 100k visitors per month, Google Analytics tracking and reporting; primary front-end developer \n* Campaign Manager in online campaign raising over $25 million in donations \nInitiated and managed deployment of Google Apps for Business; 120 staff, 6 offices nationwide, MS Exchange migration; decreased IT cost by 30% between 2010 and 2011 \n* Managed 2 Systems Engineers and 1 Project Manager to plan and execute all IT programs and projects \n* Responsible for IT budget ($1 million in 2011) and contracts; forecasted hardware and systems growth; Managed external IT contractors and services \n* Reported to CIO and CEO weekly on IT systems health and status of IT programs; responsible for writing and maintaining IT Strategic Plan, presented to Board of Directors \n* Initiated, created and implemented training program for 100+ staff on technology systems; built custom training tracker with Google Apps Scripts Accounting Associate Islamic Relief USA September 2006  –  October 2007  (1 year 2 months) Buena Park, CA * Initiated and implemented electronic donation tracking system, reduced donation processing time by 50% Program Manager, Google Fiber Google April 2015  – Present (5 months) - Managing Platforms Software programs \n- FE Engineer for B/OSS application  Program Manager, Google Fiber Google April 2015  – Present (5 months) - Managing Platforms Software programs \n- FE Engineer for B/OSS application  Program Manager, Google Apps for Work Google August 2014  – Present (1 year 1 month) Mountain View, CA - Successfully managed programs from ideation through execution and evaluation \n- Designing and developing internal solutions with AngularJS \n- Deploying NodeJS/Python applications on Google App Engine with Managed VMs (Docker) Program Manager, Google Apps for Work Google August 2014  – Present (1 year 1 month) Mountain View, CA - Successfully managed programs from ideation through execution and evaluation \n- Designing and developing internal solutions with AngularJS \n- Deploying NodeJS/Python applications on Google App Engine with Managed VMs (Docker) Senior Engineering Manager Netpulse January 2014  –  August 2014  (8 months) San Francisco Bay Area - Managing 10 Software Engineers building the server, web and mobile application \n- Architecting the next generation app infrastructure and prototyping innovative ideas \n- Led technical discussions with key stakeholders and external partners \n- Senior Front-end Engineer designing and building the UI, core functionality and complex integrations Senior Engineering Manager Netpulse January 2014  –  August 2014  (8 months) San Francisco Bay Area - Managing 10 Software Engineers building the server, web and mobile application \n- Architecting the next generation app infrastructure and prototyping innovative ideas \n- Led technical discussions with key stakeholders and external partners \n- Senior Front-end Engineer designing and building the UI, core functionality and complex integrations Senior Javascript Engineer Netpulse March 2013  –  December 2013  (10 months) San Francisco Bay Area - UX Engineering at one.netpulse.com - AngularJS \n- Developing UI solutions for Linux and Windows based embedded devices \n- Writing Object-Oriented Javascript for client and server interactions Senior Javascript Engineer Netpulse March 2013  –  December 2013  (10 months) San Francisco Bay Area - UX Engineering at one.netpulse.com - AngularJS \n- Developing UI solutions for Linux and Windows based embedded devices \n- Writing Object-Oriented Javascript for client and server interactions Web App Developer (Contract) Cozy February 2013  –  February 2013  (1 month) San Francisco - Working across the stack with CSS3, HTML5, Javascript, Ruby and Underscore.js \n- Turning Photoshop designs into pixel-perfect, cross-browser compatible HTML5 and CSS3 Web App Developer (Contract) Cozy February 2013  –  February 2013  (1 month) San Francisco - Working across the stack with CSS3, HTML5, Javascript, Ruby and Underscore.js \n- Turning Photoshop designs into pixel-perfect, cross-browser compatible HTML5 and CSS3 Technical Program/Campaign Manager MoveOn.org October 2011  –  December 2012  (1 year 3 months) * Product Manager for MoveOn's 'Organize' platform (www.moveon.org/organize); led 2 designers, 4 field staff and 3 developers; responsible for product vision and requirements in collaboration with Field Staff and members; hundreds of daily users and thousands of lines of code; created wireframes and prototypes for new features; built site with HTML, CSS and Javascript and integrated with existing Perl/ Mason framework; increased time spent on site by over 30%; decreased bounce rate by almost 20% \n* Designed and wrote SQL for ad-hoc reporting, mass mail custom targeting, and websites \n* Responsible for managing product roadmap of internal tools and applications supporting over 50 staff \n* Created and executed training program for over 20 staff on web technologies Technical Program/Campaign Manager MoveOn.org October 2011  –  December 2012  (1 year 3 months) * Product Manager for MoveOn's 'Organize' platform (www.moveon.org/organize); led 2 designers, 4 field staff and 3 developers; responsible for product vision and requirements in collaboration with Field Staff and members; hundreds of daily users and thousands of lines of code; created wireframes and prototypes for new features; built site with HTML, CSS and Javascript and integrated with existing Perl/ Mason framework; increased time spent on site by over 30%; decreased bounce rate by almost 20% \n* Designed and wrote SQL for ad-hoc reporting, mass mail custom targeting, and websites \n* Responsible for managing product roadmap of internal tools and applications supporting over 50 staff \n* Created and executed training program for over 20 staff on web technologies Technology Consultant (SCU MSIS Capstone Project) Intuit September 2011  –  January 2012  (5 months) Mountain View, CA * Led a team of 4 to advise the Intuit Engineering Management team on the best approach to transition to a SaaS model for hosting services \n* Coordinated and conducted end-to-end assessment of the processes within Operations Engineering Infrastructure (OEI) group to deliver hosting services \n* Delivered a 25 page solution providing policy and process changes to improve hosting services Technology Consultant (SCU MSIS Capstone Project) Intuit September 2011  –  January 2012  (5 months) Mountain View, CA * Led a team of 4 to advise the Intuit Engineering Management team on the best approach to transition to a SaaS model for hosting services \n* Coordinated and conducted end-to-end assessment of the processes within Operations Engineering Infrastructure (OEI) group to deliver hosting services \n* Delivered a 25 page solution providing policy and process changes to improve hosting services Web Developer/ IT Lead Islamic Relief USA October 2007  –  September 2011  (4 years) * Initiated and managed redevelopment of www.irusa.org; 13 month project, 8 team members, $90k cost; increased site visitors by 10% between 2010 and 2011; 100k visitors per month, Google Analytics tracking and reporting; primary front-end developer \n* Campaign Manager in online campaign raising over $25 million in donations \nInitiated and managed deployment of Google Apps for Business; 120 staff, 6 offices nationwide, MS Exchange migration; decreased IT cost by 30% between 2010 and 2011 \n* Managed 2 Systems Engineers and 1 Project Manager to plan and execute all IT programs and projects \n* Responsible for IT budget ($1 million in 2011) and contracts; forecasted hardware and systems growth; Managed external IT contractors and services \n* Reported to CIO and CEO weekly on IT systems health and status of IT programs; responsible for writing and maintaining IT Strategic Plan, presented to Board of Directors \n* Initiated, created and implemented training program for 100+ staff on technology systems; built custom training tracker with Google Apps Scripts Web Developer/ IT Lead Islamic Relief USA October 2007  –  September 2011  (4 years) * Initiated and managed redevelopment of www.irusa.org; 13 month project, 8 team members, $90k cost; increased site visitors by 10% between 2010 and 2011; 100k visitors per month, Google Analytics tracking and reporting; primary front-end developer \n* Campaign Manager in online campaign raising over $25 million in donations \nInitiated and managed deployment of Google Apps for Business; 120 staff, 6 offices nationwide, MS Exchange migration; decreased IT cost by 30% between 2010 and 2011 \n* Managed 2 Systems Engineers and 1 Project Manager to plan and execute all IT programs and projects \n* Responsible for IT budget ($1 million in 2011) and contracts; forecasted hardware and systems growth; Managed external IT contractors and services \n* Reported to CIO and CEO weekly on IT systems health and status of IT programs; responsible for writing and maintaining IT Strategic Plan, presented to Board of Directors \n* Initiated, created and implemented training program for 100+ staff on technology systems; built custom training tracker with Google Apps Scripts Accounting Associate Islamic Relief USA September 2006  –  October 2007  (1 year 2 months) Buena Park, CA * Initiated and implemented electronic donation tracking system, reduced donation processing time by 50% Accounting Associate Islamic Relief USA September 2006  –  October 2007  (1 year 2 months) Buena Park, CA * Initiated and implemented electronic donation tracking system, reduced donation processing time by 50% Languages   Skills JavaScript AngularJS Software Project... Technical Product... Rapid Prototyping Google Analytics HTML Strategy Technical Program... Cloud Computing Skills  JavaScript AngularJS Software Project... Technical Product... Rapid Prototyping Google Analytics HTML Strategy Technical Program... Cloud Computing JavaScript AngularJS Software Project... Technical Product... Rapid Prototyping Google Analytics HTML Strategy Technical Program... Cloud Computing JavaScript AngularJS Software Project... Technical Product... Rapid Prototyping Google Analytics HTML Strategy Technical Program... Cloud Computing Education Santa Clara University - Leavey School of Business Master of Science 2009  – 2013 University of California, Los Angeles 2002  – 2006 Santa Clara University - Leavey School of Business Master of Science 2009  – 2013 Santa Clara University - Leavey School of Business Master of Science 2009  – 2013 Santa Clara University - Leavey School of Business Master of Science 2009  – 2013 University of California, Los Angeles 2002  – 2006 University of California, Los Angeles 2002  – 2006 University of California, Los Angeles 2002  – 2006 Honors & Awards ", "Experience Program Manager - Google Fiber Google October 2014  – Present (11 months) Raleigh-Durham, North Carolina Area Operations : Google [X] Google January 2013  – Present (2 years 8 months) Mountain View, California Co-Founder CML Development, LLC. October 2012  – Present (2 years 11 months) Raleigh-Durham, North Carolina Area CML Development designs, manufactures and markets consumer goods ranging from high-end athletic wear to mobile applications. G-Feet, Field Marketing Lead Adecco @ Google March 2012  –  January 2013  (11 months) Raleigh-Durham, North Carolina Area I lead Google's local field marketing team in the Triangle region. Our mission is to empower local organizations and businesses by engaging, interacting and educating groups and organizations about Google products. I have worked with numerous organizations including universities, corporations, sport teams, entrepreneurs and non profits; helping them create amazing stories online through Google Energy Asset Manager Strata Solar, LLC March 2011  –  March 2012  (1 year 1 month) Chapel Hill, NC -Design, commission and troubleshoot residential, commercial and utility scale PV and PV monitoring systems valued between $30,000 and $22 million  \n-Assist with engineering industry leading wireless monitoring solution, developed in house, for PV systems \n-Rebuild company’s IT infrastructure, including new servers, network attach storage drives, a virtual private \nnetwork, remote desktop access to computers and phone system \n-Represent company on Wake Tech’s Advisory Board for Green Technologies \n-Evaluate performance models for potential and existing PV systems \n-Write instructional manuals for PV systems \n-Direct IT purchasing including computers, cellular wireless hotspots and software Showroom Manager/ Executive Assistant Strata Solar, LLC July 2010  –  March 2011  (9 months) Chapel Hill, North Carolina -Advised customers about solar technologies and available financial incentives \n-Expert on State and Federal incentives for renewable energy projects \n-Restructured company website  \n-Assisted with company’s financial record keeping and budgeting process \n-Directed weekly residential project meetings between sales and operations \n-Designed company pitch for Fortune 500 companies, including Starbucks, Guthy-Renker and USC \n-Developed direct marketing campaign for residential systems Family Room Specialist Apple Retail June 2010  –  December 2010  (7 months) Durham, North Carolina -Provided technical support for customers, and diagnosed and repaired computer and mobile devices \n-Assisted in personal setup and provided ongoing educational training to customers \n-Provided technology solutions for customers, helping them match their budgets and specification requirements with appropriate equipment Specialist Apple Retail February 2008  –  July 2010  (2 years 6 months) Durham, North Carolina - Provided technology solutions for customers, helping them match their budget \nand specification requirements with appropriate equipment \n- Provided customer technology support for hardware and software applications \n- Supported Inventory Control specialists in maintaining proper inventory levels \n- Served as point specialist on the sales floor Volunteer OurEarth.org May 2009  –  July 2009  (3 months) Spent time as a researcher, examining environmental services with in communities and colleges. The information that was gathered was then organized and inputed into an online database. I also participated in a series of online seminars, serving as a moderator for a few. Counselor Lutheridge Lutherock Ministries, Inc. June 2008  –  June 2008  (1 month) Newland, NC - Supervised, taught and lead 8-18 year-old youth through high adventure \nwilderness programs \n- Provided counseling and guidance to weekly groups of 20+ campers \n- Taught cooperation and teamwork life skills and outdoor proficiency skills Counselor Lutheridge Lutherock Ministries, Inc. May 2007  –  August 2007  (4 months) Newland, NC - Supervised, taught and lead 8-18 year-old youth through high adventure \nwilderness programs \n- Provided counseling and guidance to weekly groups of 20+ campers \n- Taught cooperation and teamwork life skills and outdoor proficiency skills Program Manager - Google Fiber Google October 2014  – Present (11 months) Raleigh-Durham, North Carolina Area Program Manager - Google Fiber Google October 2014  – Present (11 months) Raleigh-Durham, North Carolina Area Operations : Google [X] Google January 2013  – Present (2 years 8 months) Mountain View, California Operations : Google [X] Google January 2013  – Present (2 years 8 months) Mountain View, California Co-Founder CML Development, LLC. October 2012  – Present (2 years 11 months) Raleigh-Durham, North Carolina Area CML Development designs, manufactures and markets consumer goods ranging from high-end athletic wear to mobile applications. Co-Founder CML Development, LLC. October 2012  – Present (2 years 11 months) Raleigh-Durham, North Carolina Area CML Development designs, manufactures and markets consumer goods ranging from high-end athletic wear to mobile applications. G-Feet, Field Marketing Lead Adecco @ Google March 2012  –  January 2013  (11 months) Raleigh-Durham, North Carolina Area I lead Google's local field marketing team in the Triangle region. Our mission is to empower local organizations and businesses by engaging, interacting and educating groups and organizations about Google products. I have worked with numerous organizations including universities, corporations, sport teams, entrepreneurs and non profits; helping them create amazing stories online through Google G-Feet, Field Marketing Lead Adecco @ Google March 2012  –  January 2013  (11 months) Raleigh-Durham, North Carolina Area I lead Google's local field marketing team in the Triangle region. Our mission is to empower local organizations and businesses by engaging, interacting and educating groups and organizations about Google products. I have worked with numerous organizations including universities, corporations, sport teams, entrepreneurs and non profits; helping them create amazing stories online through Google Energy Asset Manager Strata Solar, LLC March 2011  –  March 2012  (1 year 1 month) Chapel Hill, NC -Design, commission and troubleshoot residential, commercial and utility scale PV and PV monitoring systems valued between $30,000 and $22 million  \n-Assist with engineering industry leading wireless monitoring solution, developed in house, for PV systems \n-Rebuild company’s IT infrastructure, including new servers, network attach storage drives, a virtual private \nnetwork, remote desktop access to computers and phone system \n-Represent company on Wake Tech’s Advisory Board for Green Technologies \n-Evaluate performance models for potential and existing PV systems \n-Write instructional manuals for PV systems \n-Direct IT purchasing including computers, cellular wireless hotspots and software Energy Asset Manager Strata Solar, LLC March 2011  –  March 2012  (1 year 1 month) Chapel Hill, NC -Design, commission and troubleshoot residential, commercial and utility scale PV and PV monitoring systems valued between $30,000 and $22 million  \n-Assist with engineering industry leading wireless monitoring solution, developed in house, for PV systems \n-Rebuild company’s IT infrastructure, including new servers, network attach storage drives, a virtual private \nnetwork, remote desktop access to computers and phone system \n-Represent company on Wake Tech’s Advisory Board for Green Technologies \n-Evaluate performance models for potential and existing PV systems \n-Write instructional manuals for PV systems \n-Direct IT purchasing including computers, cellular wireless hotspots and software Showroom Manager/ Executive Assistant Strata Solar, LLC July 2010  –  March 2011  (9 months) Chapel Hill, North Carolina -Advised customers about solar technologies and available financial incentives \n-Expert on State and Federal incentives for renewable energy projects \n-Restructured company website  \n-Assisted with company’s financial record keeping and budgeting process \n-Directed weekly residential project meetings between sales and operations \n-Designed company pitch for Fortune 500 companies, including Starbucks, Guthy-Renker and USC \n-Developed direct marketing campaign for residential systems Showroom Manager/ Executive Assistant Strata Solar, LLC July 2010  –  March 2011  (9 months) Chapel Hill, North Carolina -Advised customers about solar technologies and available financial incentives \n-Expert on State and Federal incentives for renewable energy projects \n-Restructured company website  \n-Assisted with company’s financial record keeping and budgeting process \n-Directed weekly residential project meetings between sales and operations \n-Designed company pitch for Fortune 500 companies, including Starbucks, Guthy-Renker and USC \n-Developed direct marketing campaign for residential systems Family Room Specialist Apple Retail June 2010  –  December 2010  (7 months) Durham, North Carolina -Provided technical support for customers, and diagnosed and repaired computer and mobile devices \n-Assisted in personal setup and provided ongoing educational training to customers \n-Provided technology solutions for customers, helping them match their budgets and specification requirements with appropriate equipment Family Room Specialist Apple Retail June 2010  –  December 2010  (7 months) Durham, North Carolina -Provided technical support for customers, and diagnosed and repaired computer and mobile devices \n-Assisted in personal setup and provided ongoing educational training to customers \n-Provided technology solutions for customers, helping them match their budgets and specification requirements with appropriate equipment Specialist Apple Retail February 2008  –  July 2010  (2 years 6 months) Durham, North Carolina - Provided technology solutions for customers, helping them match their budget \nand specification requirements with appropriate equipment \n- Provided customer technology support for hardware and software applications \n- Supported Inventory Control specialists in maintaining proper inventory levels \n- Served as point specialist on the sales floor Specialist Apple Retail February 2008  –  July 2010  (2 years 6 months) Durham, North Carolina - Provided technology solutions for customers, helping them match their budget \nand specification requirements with appropriate equipment \n- Provided customer technology support for hardware and software applications \n- Supported Inventory Control specialists in maintaining proper inventory levels \n- Served as point specialist on the sales floor Volunteer OurEarth.org May 2009  –  July 2009  (3 months) Spent time as a researcher, examining environmental services with in communities and colleges. The information that was gathered was then organized and inputed into an online database. I also participated in a series of online seminars, serving as a moderator for a few. Volunteer OurEarth.org May 2009  –  July 2009  (3 months) Spent time as a researcher, examining environmental services with in communities and colleges. The information that was gathered was then organized and inputed into an online database. I also participated in a series of online seminars, serving as a moderator for a few. Counselor Lutheridge Lutherock Ministries, Inc. June 2008  –  June 2008  (1 month) Newland, NC - Supervised, taught and lead 8-18 year-old youth through high adventure \nwilderness programs \n- Provided counseling and guidance to weekly groups of 20+ campers \n- Taught cooperation and teamwork life skills and outdoor proficiency skills Counselor Lutheridge Lutherock Ministries, Inc. June 2008  –  June 2008  (1 month) Newland, NC - Supervised, taught and lead 8-18 year-old youth through high adventure \nwilderness programs \n- Provided counseling and guidance to weekly groups of 20+ campers \n- Taught cooperation and teamwork life skills and outdoor proficiency skills Counselor Lutheridge Lutherock Ministries, Inc. May 2007  –  August 2007  (4 months) Newland, NC - Supervised, taught and lead 8-18 year-old youth through high adventure \nwilderness programs \n- Provided counseling and guidance to weekly groups of 20+ campers \n- Taught cooperation and teamwork life skills and outdoor proficiency skills Counselor Lutheridge Lutherock Ministries, Inc. May 2007  –  August 2007  (4 months) Newland, NC - Supervised, taught and lead 8-18 year-old youth through high adventure \nwilderness programs \n- Provided counseling and guidance to weekly groups of 20+ campers \n- Taught cooperation and teamwork life skills and outdoor proficiency skills Languages English Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency German Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Scuba Diving AutoCAD LT Google Sketchup Microsoft Office Sales Project Management Marketing PowerPoint Sustainability Microsoft Excel Microsoft Word Renewable Energy Customer Service Public Speaking Social Media Social Networking Photoshop Mac OS X OS X Online Marketing SketchUp Energy Spanish Mac Blogging Entrepreneurship Nonprofits See 12+     See less Skills  Scuba Diving AutoCAD LT Google Sketchup Microsoft Office Sales Project Management Marketing PowerPoint Sustainability Microsoft Excel Microsoft Word Renewable Energy Customer Service Public Speaking Social Media Social Networking Photoshop Mac OS X OS X Online Marketing SketchUp Energy Spanish Mac Blogging Entrepreneurship Nonprofits See 12+     See less Scuba Diving AutoCAD LT Google Sketchup Microsoft Office Sales Project Management Marketing PowerPoint Sustainability Microsoft Excel Microsoft Word Renewable Energy Customer Service Public Speaking Social Media Social Networking Photoshop Mac OS X OS X Online Marketing SketchUp Energy Spanish Mac Blogging Entrepreneurship Nonprofits See 12+     See less Scuba Diving AutoCAD LT Google Sketchup Microsoft Office Sales Project Management Marketing PowerPoint Sustainability Microsoft Excel Microsoft Word Renewable Energy Customer Service Public Speaking Social Media Social Networking Photoshop Mac OS X OS X Online Marketing SketchUp Energy Spanish Mac Blogging Entrepreneurship Nonprofits See 12+     See less Education University of North Carolina at Chapel Hill B.S.,  Environmental Science 2006  – 2010 Activities and Societies:  Engineers without Borders ,  Dean's List ,  LCM University of North Carolina at Chapel Hill B.S.,  Environmental Science 2006  – 2010 Activities and Societies:  Engineers without Borders ,  Dean's List ,  LCM University of North Carolina at Chapel Hill B.S.,  Environmental Science 2006  – 2010 Activities and Societies:  Engineers without Borders ,  Dean's List ,  LCM University of North Carolina at Chapel Hill B.S.,  Environmental Science 2006  – 2010 Activities and Societies:  Engineers without Borders ,  Dean's List ,  LCM Honors & Awards Additional Honors & Awards Eagle Scout, Awarded in 2006 Additional Honors & Awards Eagle Scout, Awarded in 2006 Additional Honors & Awards Eagle Scout, Awarded in 2006 Additional Honors & Awards Eagle Scout, Awarded in 2006 ", "Summary Program Manager with MBA, engineering background and demonstrated leadership, communications, analytics, and project management abilities. Summary Program Manager with MBA, engineering background and demonstrated leadership, communications, analytics, and project management abilities. Program Manager with MBA, engineering background and demonstrated leadership, communications, analytics, and project management abilities. Program Manager with MBA, engineering background and demonstrated leadership, communications, analytics, and project management abilities. Experience Build Team Metro Program Manager Google Fiber February 2015  – Present (7 months) Greater Nashville Area #FiberIsComing Supplier Sourcing Manager Google January 2014  –  February 2015  (1 year 2 months) Mountain View, CA Support Motorola and Google Fiber in finding great suppliers Sourcing Manager A.T. Kearney July 2013  –  December 2013  (6 months) Greater Chicago Area Consult with companies to drive increased efficiency and reduced costs through excellence in procurement \n \nMulti-industry experience in strategic sourcing of indirects including IT, Travel, Legal, Packaging and Facilities Management Sourcing Associate A.T. Kearney July 2011  –  July 2013  (2 years 1 month) Greater Chicago Area Consult with companies to drive increased efficiency and reduced costs through excellence in procurement \n \nMulti-industry experience in strategic sourcing of indirects including IT, Travel, Legal, Packaging and Facilities Management Managing Director Fisher Professional Services April 2010  –  June 2011  (1 year 3 months) Columbus, Ohio Area Managing Director of MBA-led consultancy housed within the Fisher College of Business, with membership of 100+ graduate students and 10+ undergraduate students working on paid consulting projects.  \n \nResponsibilities included leading the business development team, overseeing marketing efforts, overseeing technology implementations and systems, and providing oversight to project managers and consultants on project work. Project Manager, MAST Industries (Far East) Limited - Limited Brands Global Summer Fellowship April 2010  –  September 2010  (6 months) Hong Kong Researched and prepared recommendations for top-line growth strategy in sourcing industry, including collection of global market research, primary research utilizing a web-survey, competitor and industry analysis, and development of framework to guide growth strategy \n \nActively recruited four consultants, scoped and managed 20 week consulting engagement \n \nTraveled twice to Hong Kong offices (April 2010 & July-September 2010) for project work Design Engineer Steinbicker and Associates May 2007  –  August 2009  (2 years 4 months) Dayton, Ohio Area Designed and implemented Excel design tools utilizing Visual Basic for Applications for office-wide use by engineering staff which reduced design and calculation time by up to 50% per design item and 2% per project \n \nImplemented new AutoCAD software features for office-wide use by drafting staff which reduced required data entry by 30% on average per job while also increasing accuracy of design documents \n \nDesigned and implemented JavaScript/PHP/MySQL estimating tool for public use on company website which increased average daily hits by 93% compared to the previous 6 month average \n \nCollaborated with both internal (Dayton and Florida offices) and external team members such as drafters, architects, contractors, suppliers, and engineers on analysis and design of tilt-up concrete, masonry, and steel structures Student Circulation Assistant Purdue University Libraries September 2004  –  May 2007  (2 years 9 months) West Lafayette, IN Assisted up to 50 patrons per shift find information by referring them to the proper librarian, searching the computer database of library materials, and/or retrieving print materials. Field Inspector VS Engineering May 2006  –  January 2007  (9 months) Indianapolis, Indiana Area Performed daily inspection and measurement of work performed by contractors on $6 million highway and bridge rehabilitation project; served as the primary inspector of bridge work \n \nImplemented AutoCAD software as a project specific solution for recording size and location of bridge repairs to improve efficiency and clarity compared to previously used hand-drawn documentation Field Technician HC Nutting 2004  –  2005  (1 year) Cincinnati, Ohio Area Build Team Metro Program Manager Google Fiber February 2015  – Present (7 months) Greater Nashville Area #FiberIsComing Build Team Metro Program Manager Google Fiber February 2015  – Present (7 months) Greater Nashville Area #FiberIsComing Supplier Sourcing Manager Google January 2014  –  February 2015  (1 year 2 months) Mountain View, CA Support Motorola and Google Fiber in finding great suppliers Supplier Sourcing Manager Google January 2014  –  February 2015  (1 year 2 months) Mountain View, CA Support Motorola and Google Fiber in finding great suppliers Sourcing Manager A.T. Kearney July 2013  –  December 2013  (6 months) Greater Chicago Area Consult with companies to drive increased efficiency and reduced costs through excellence in procurement \n \nMulti-industry experience in strategic sourcing of indirects including IT, Travel, Legal, Packaging and Facilities Management Sourcing Manager A.T. Kearney July 2013  –  December 2013  (6 months) Greater Chicago Area Consult with companies to drive increased efficiency and reduced costs through excellence in procurement \n \nMulti-industry experience in strategic sourcing of indirects including IT, Travel, Legal, Packaging and Facilities Management Sourcing Associate A.T. Kearney July 2011  –  July 2013  (2 years 1 month) Greater Chicago Area Consult with companies to drive increased efficiency and reduced costs through excellence in procurement \n \nMulti-industry experience in strategic sourcing of indirects including IT, Travel, Legal, Packaging and Facilities Management Sourcing Associate A.T. Kearney July 2011  –  July 2013  (2 years 1 month) Greater Chicago Area Consult with companies to drive increased efficiency and reduced costs through excellence in procurement \n \nMulti-industry experience in strategic sourcing of indirects including IT, Travel, Legal, Packaging and Facilities Management Managing Director Fisher Professional Services April 2010  –  June 2011  (1 year 3 months) Columbus, Ohio Area Managing Director of MBA-led consultancy housed within the Fisher College of Business, with membership of 100+ graduate students and 10+ undergraduate students working on paid consulting projects.  \n \nResponsibilities included leading the business development team, overseeing marketing efforts, overseeing technology implementations and systems, and providing oversight to project managers and consultants on project work. Managing Director Fisher Professional Services April 2010  –  June 2011  (1 year 3 months) Columbus, Ohio Area Managing Director of MBA-led consultancy housed within the Fisher College of Business, with membership of 100+ graduate students and 10+ undergraduate students working on paid consulting projects.  \n \nResponsibilities included leading the business development team, overseeing marketing efforts, overseeing technology implementations and systems, and providing oversight to project managers and consultants on project work. Project Manager, MAST Industries (Far East) Limited - Limited Brands Global Summer Fellowship April 2010  –  September 2010  (6 months) Hong Kong Researched and prepared recommendations for top-line growth strategy in sourcing industry, including collection of global market research, primary research utilizing a web-survey, competitor and industry analysis, and development of framework to guide growth strategy \n \nActively recruited four consultants, scoped and managed 20 week consulting engagement \n \nTraveled twice to Hong Kong offices (April 2010 & July-September 2010) for project work Project Manager, MAST Industries (Far East) Limited - Limited Brands Global Summer Fellowship April 2010  –  September 2010  (6 months) Hong Kong Researched and prepared recommendations for top-line growth strategy in sourcing industry, including collection of global market research, primary research utilizing a web-survey, competitor and industry analysis, and development of framework to guide growth strategy \n \nActively recruited four consultants, scoped and managed 20 week consulting engagement \n \nTraveled twice to Hong Kong offices (April 2010 & July-September 2010) for project work Design Engineer Steinbicker and Associates May 2007  –  August 2009  (2 years 4 months) Dayton, Ohio Area Designed and implemented Excel design tools utilizing Visual Basic for Applications for office-wide use by engineering staff which reduced design and calculation time by up to 50% per design item and 2% per project \n \nImplemented new AutoCAD software features for office-wide use by drafting staff which reduced required data entry by 30% on average per job while also increasing accuracy of design documents \n \nDesigned and implemented JavaScript/PHP/MySQL estimating tool for public use on company website which increased average daily hits by 93% compared to the previous 6 month average \n \nCollaborated with both internal (Dayton and Florida offices) and external team members such as drafters, architects, contractors, suppliers, and engineers on analysis and design of tilt-up concrete, masonry, and steel structures Design Engineer Steinbicker and Associates May 2007  –  August 2009  (2 years 4 months) Dayton, Ohio Area Designed and implemented Excel design tools utilizing Visual Basic for Applications for office-wide use by engineering staff which reduced design and calculation time by up to 50% per design item and 2% per project \n \nImplemented new AutoCAD software features for office-wide use by drafting staff which reduced required data entry by 30% on average per job while also increasing accuracy of design documents \n \nDesigned and implemented JavaScript/PHP/MySQL estimating tool for public use on company website which increased average daily hits by 93% compared to the previous 6 month average \n \nCollaborated with both internal (Dayton and Florida offices) and external team members such as drafters, architects, contractors, suppliers, and engineers on analysis and design of tilt-up concrete, masonry, and steel structures Student Circulation Assistant Purdue University Libraries September 2004  –  May 2007  (2 years 9 months) West Lafayette, IN Assisted up to 50 patrons per shift find information by referring them to the proper librarian, searching the computer database of library materials, and/or retrieving print materials. Student Circulation Assistant Purdue University Libraries September 2004  –  May 2007  (2 years 9 months) West Lafayette, IN Assisted up to 50 patrons per shift find information by referring them to the proper librarian, searching the computer database of library materials, and/or retrieving print materials. Field Inspector VS Engineering May 2006  –  January 2007  (9 months) Indianapolis, Indiana Area Performed daily inspection and measurement of work performed by contractors on $6 million highway and bridge rehabilitation project; served as the primary inspector of bridge work \n \nImplemented AutoCAD software as a project specific solution for recording size and location of bridge repairs to improve efficiency and clarity compared to previously used hand-drawn documentation Field Inspector VS Engineering May 2006  –  January 2007  (9 months) Indianapolis, Indiana Area Performed daily inspection and measurement of work performed by contractors on $6 million highway and bridge rehabilitation project; served as the primary inspector of bridge work \n \nImplemented AutoCAD software as a project specific solution for recording size and location of bridge repairs to improve efficiency and clarity compared to previously used hand-drawn documentation Field Technician HC Nutting 2004  –  2005  (1 year) Cincinnati, Ohio Area Field Technician HC Nutting 2004  –  2005  (1 year) Cincinnati, Ohio Area Skills Project Management MySQL JavaScript PHP Cross-functional Team... VBA Quantitative Analytics Software Documentation Database Administration Web Site Production Data Analysis Analysis Microsoft Excel Strategic Planning Business Strategy Management Consulting Microsoft Office Management Leadership Competitive Analysis International Project... Market Research Strategy Consulting See 9+     See less Skills  Project Management MySQL JavaScript PHP Cross-functional Team... VBA Quantitative Analytics Software Documentation Database Administration Web Site Production Data Analysis Analysis Microsoft Excel Strategic Planning Business Strategy Management Consulting Microsoft Office Management Leadership Competitive Analysis International Project... Market Research Strategy Consulting See 9+     See less Project Management MySQL JavaScript PHP Cross-functional Team... VBA Quantitative Analytics Software Documentation Database Administration Web Site Production Data Analysis Analysis Microsoft Excel Strategic Planning Business Strategy Management Consulting Microsoft Office Management Leadership Competitive Analysis International Project... Market Research Strategy Consulting See 9+     See less Project Management MySQL JavaScript PHP Cross-functional Team... VBA Quantitative Analytics Software Documentation Database Administration Web Site Production Data Analysis Analysis Microsoft Excel Strategic Planning Business Strategy Management Consulting Microsoft Office Management Leadership Competitive Analysis International Project... Market Research Strategy Consulting See 9+     See less Education The Ohio State University - The Max M. Fisher College of Business MBA,  Business Administration and Management , General 2009  – 2011 Fisher Scholar - top 20% of the MBA class \nPace Setter Award - Annual award given to the college’s top students, who are selected on the basis of academic performance and demonstrated leadership ability. Nominated and voted on by faculty, staff, and peers. \n \nUniversity Fellowship recipient \n \nTravel including Hanoi & Ho Chi Minh City, Vietnam; Hong Kong SAR, PRC; Shenzhen, Dongguan & Shanghai, PRC Activities and Societies:  Managing Director & Project Manager - Fisher Professional Services ,  Vice President - Fisher Graduate Student Association ,  International Business Club ,  My Fisher Grad Life blogger ,  Mentor - International Connections Program Purdue University BSCE with Highest Distinction,  Structural Engineering 2003  – 2007 Rosemary K. Burke Outstanding Student Award Recipient – awarded to graduating civil engineering student with the highest graduation GPA \n \nRecipient of National Science Foundation’s CSEMS (Computer Science, Engineering & Engineering Technology & Mathematics Scholarship) Scholarship, H.K. Tony Clark Alumni Scholarship, Purdue Incentive Grant, Subaru-Isuzu Auto. Scholarship, Albert James Horth Memorial Scholarship, and Tony Clark Award Activities and Societies:  Civil Engineering Ambassador – selected to assist in welcoming prospective students and families to Purdue Civil Engineering by giving tours to groups of 2-8 people and providing information during campus visits St. Xavier High School 1999  – 2003 The Ohio State University - The Max M. Fisher College of Business MBA,  Business Administration and Management , General 2009  – 2011 Fisher Scholar - top 20% of the MBA class \nPace Setter Award - Annual award given to the college’s top students, who are selected on the basis of academic performance and demonstrated leadership ability. Nominated and voted on by faculty, staff, and peers. \n \nUniversity Fellowship recipient \n \nTravel including Hanoi & Ho Chi Minh City, Vietnam; Hong Kong SAR, PRC; Shenzhen, Dongguan & Shanghai, PRC Activities and Societies:  Managing Director & Project Manager - Fisher Professional Services ,  Vice President - Fisher Graduate Student Association ,  International Business Club ,  My Fisher Grad Life blogger ,  Mentor - International Connections Program The Ohio State University - The Max M. Fisher College of Business MBA,  Business Administration and Management , General 2009  – 2011 Fisher Scholar - top 20% of the MBA class \nPace Setter Award - Annual award given to the college’s top students, who are selected on the basis of academic performance and demonstrated leadership ability. Nominated and voted on by faculty, staff, and peers. \n \nUniversity Fellowship recipient \n \nTravel including Hanoi & Ho Chi Minh City, Vietnam; Hong Kong SAR, PRC; Shenzhen, Dongguan & Shanghai, PRC Activities and Societies:  Managing Director & Project Manager - Fisher Professional Services ,  Vice President - Fisher Graduate Student Association ,  International Business Club ,  My Fisher Grad Life blogger ,  Mentor - International Connections Program The Ohio State University - The Max M. Fisher College of Business MBA,  Business Administration and Management , General 2009  – 2011 Fisher Scholar - top 20% of the MBA class \nPace Setter Award - Annual award given to the college’s top students, who are selected on the basis of academic performance and demonstrated leadership ability. Nominated and voted on by faculty, staff, and peers. \n \nUniversity Fellowship recipient \n \nTravel including Hanoi & Ho Chi Minh City, Vietnam; Hong Kong SAR, PRC; Shenzhen, Dongguan & Shanghai, PRC Activities and Societies:  Managing Director & Project Manager - Fisher Professional Services ,  Vice President - Fisher Graduate Student Association ,  International Business Club ,  My Fisher Grad Life blogger ,  Mentor - International Connections Program Purdue University BSCE with Highest Distinction,  Structural Engineering 2003  – 2007 Rosemary K. Burke Outstanding Student Award Recipient – awarded to graduating civil engineering student with the highest graduation GPA \n \nRecipient of National Science Foundation’s CSEMS (Computer Science, Engineering & Engineering Technology & Mathematics Scholarship) Scholarship, H.K. Tony Clark Alumni Scholarship, Purdue Incentive Grant, Subaru-Isuzu Auto. Scholarship, Albert James Horth Memorial Scholarship, and Tony Clark Award Activities and Societies:  Civil Engineering Ambassador – selected to assist in welcoming prospective students and families to Purdue Civil Engineering by giving tours to groups of 2-8 people and providing information during campus visits Purdue University BSCE with Highest Distinction,  Structural Engineering 2003  – 2007 Rosemary K. Burke Outstanding Student Award Recipient – awarded to graduating civil engineering student with the highest graduation GPA \n \nRecipient of National Science Foundation’s CSEMS (Computer Science, Engineering & Engineering Technology & Mathematics Scholarship) Scholarship, H.K. Tony Clark Alumni Scholarship, Purdue Incentive Grant, Subaru-Isuzu Auto. Scholarship, Albert James Horth Memorial Scholarship, and Tony Clark Award Activities and Societies:  Civil Engineering Ambassador – selected to assist in welcoming prospective students and families to Purdue Civil Engineering by giving tours to groups of 2-8 people and providing information during campus visits Purdue University BSCE with Highest Distinction,  Structural Engineering 2003  – 2007 Rosemary K. Burke Outstanding Student Award Recipient – awarded to graduating civil engineering student with the highest graduation GPA \n \nRecipient of National Science Foundation’s CSEMS (Computer Science, Engineering & Engineering Technology & Mathematics Scholarship) Scholarship, H.K. Tony Clark Alumni Scholarship, Purdue Incentive Grant, Subaru-Isuzu Auto. Scholarship, Albert James Horth Memorial Scholarship, and Tony Clark Award Activities and Societies:  Civil Engineering Ambassador – selected to assist in welcoming prospective students and families to Purdue Civil Engineering by giving tours to groups of 2-8 people and providing information during campus visits St. Xavier High School 1999  – 2003 St. Xavier High School 1999  – 2003 St. Xavier High School 1999  – 2003 ", "Summary I am creative, energetic, influential technology professional with extensive leadership experience in engineering and marketing who enjoys communicating ideas via public speaking and writing. \n \nI have contributed to, and led, large and small teams building virtually every product within the computer and communications industries: routers/switches/bridges, NICs/semiconductor chipsets, driver and application software, and network and system security. I always try to surround myself with people that I can learn from, but I do all my own stunts. \n \nFinally, I have extensive experience in intellectual property (software patents from an inventor's perspective). \n \nIf you're not living on the edge, you're taking up too much space! :-) \n \nI have been on LinkedIn since February, 2004. Specialties:TCP/IP, unicast routing, multicast routing, IEEE 802.11, IPv4, IPv6, testing, networking Summary I am creative, energetic, influential technology professional with extensive leadership experience in engineering and marketing who enjoys communicating ideas via public speaking and writing. \n \nI have contributed to, and led, large and small teams building virtually every product within the computer and communications industries: routers/switches/bridges, NICs/semiconductor chipsets, driver and application software, and network and system security. I always try to surround myself with people that I can learn from, but I do all my own stunts. \n \nFinally, I have extensive experience in intellectual property (software patents from an inventor's perspective). \n \nIf you're not living on the edge, you're taking up too much space! :-) \n \nI have been on LinkedIn since February, 2004. Specialties:TCP/IP, unicast routing, multicast routing, IEEE 802.11, IPv4, IPv6, testing, networking I am creative, energetic, influential technology professional with extensive leadership experience in engineering and marketing who enjoys communicating ideas via public speaking and writing. \n \nI have contributed to, and led, large and small teams building virtually every product within the computer and communications industries: routers/switches/bridges, NICs/semiconductor chipsets, driver and application software, and network and system security. I always try to surround myself with people that I can learn from, but I do all my own stunts. \n \nFinally, I have extensive experience in intellectual property (software patents from an inventor's perspective). \n \nIf you're not living on the edge, you're taking up too much space! :-) \n \nI have been on LinkedIn since February, 2004. Specialties:TCP/IP, unicast routing, multicast routing, IEEE 802.11, IPv4, IPv6, testing, networking I am creative, energetic, influential technology professional with extensive leadership experience in engineering and marketing who enjoys communicating ideas via public speaking and writing. \n \nI have contributed to, and led, large and small teams building virtually every product within the computer and communications industries: routers/switches/bridges, NICs/semiconductor chipsets, driver and application software, and network and system security. I always try to surround myself with people that I can learn from, but I do all my own stunts. \n \nFinally, I have extensive experience in intellectual property (software patents from an inventor's perspective). \n \nIf you're not living on the edge, you're taking up too much space! :-) \n \nI have been on LinkedIn since February, 2004. Specialties:TCP/IP, unicast routing, multicast routing, IEEE 802.11, IPv4, IPv6, testing, networking Experience Video Engineer, Google Fiber, an Alphabet Company Alphabet, Inc. May 2015  – Present (4 months) Mountain View, CA My team makes pretty pictures appear on subscribers' TVs and second-screen devices. I work behind the scenes to make sure that happens, from design to implementation and operations. Proprietor Whisky2.0 August 2008  – Present (7 years 1 month) Developing whisk(e)y information and tools aimed at consumers. Technical Program Manager, Google Fiber Google January 2012  –  May 2015  (3 years 5 months) Mountain View, CA Google Fiber is building a gigabit-class consumer broadband network, starting in Kansas City, Provo, UT and Austin, TX. If you want to learn more, your best bet is to visit Google's search engine and type in \"Google Fiber\" and you'll see whatever we can say publicly. Director of Federal Solutions Mu Dynamics, Inc. November 2011  –  January 2012  (3 months) Creating and delivering messaging into Federal operations at Mu to support related sales activities. Besides writing, I also speak at various events and work on direct sales calls with our prospects and customers in this space. My background in networking, security, wireless technology and cyber security is a perfect match for the needs of this market. Industry Advisory Board Member; Center for Advanced Computing and Digital Forensics (NUCAC-DF) Norwich University 2009  –  January 2012  (3 years) Norwich University, Norwich, VT Contributed equipment and training to support the center and contribute to the university's mission of delivering a compelling experience to its students. Director of Technical Marketing Mu Dynamics February 2006  –  October 2011  (5 years 9 months) Establish, sustain, and deepen relationships with various external test labs. I create collateral to help sell our test solutions, as well as to facilitate communications with press, reviewers, customers, and the public. Develop training materials and presentation materials; deliver educational seminars. Actively participate in standards bodies relevant to Mu's business operations, e.g., ISA. Subject-matter expert on networking technology, including industrial control systems. \n \nhttp://www.mudynamics.com/ Networking Software Architect NVIDIA Corporation August 2001  –  February 2006  (4 years 7 months) Santa Clara, CA Defined system-level hardware and software requirements and interface design requirements for networking aspects of platform processor chipsets, optimizing performance and cost. Developed test plans for QA. Developed white papers and performed market analysis in support of technical marketing efforts, including ongoing competitive analysis. Team leader responsible for interfacing with patent lawyers and building NVIDIA's intellectual property in the networking area. \n \nI am extremely well-versed in networking technology, including wireless LANs and security (everything from firewalls to IPsec). NVIDIA supported my active contributions to IEEE 802.11i meetings. \n \nWhile at NVIDIA, I wrote one of my three books, which was briefly in the amazon.com top-1000 titles after getting a good review on slashdot. \n \nOver 30 patent applications have been filed for which I was inventor or co-inventor while employed by NVIDIA. Twenty-one (21) of these applications have now been awarded. Product Marketing Engineer; Researcher; Senior Software Engineer 3Com Corporation February 1995  –  July 2001  (6 years 6 months) Guided technical evolution of the NETBuilder router platform. \n \nDesigned and developed advanced features for the Dynamic Access software product family, such as IPsec encryption, IEEE 802.1p class-of-service, IEEE 802.1Q VLAN tagging, etc. \n \nDirected a project in the CTO's office on self-configuring LAN devices (e.g., LAN switches). Coordinated 3Com's involvement with Internet2. \n \nRecruited back to the Ethernet adapter division to define requirements for storage networking products (an early iSCSI storage NIC design), but upper management cancelled the project before it could really get off the ground. \n \nSpent 4 years on the InteropNet Network Operations Center (NOC) team, setting up networks in Tokyo, Las Vegas, Atlanta, and London. \n \nWhile at 3Com I wrote two of my three books. \n \n6 patents have been granted for ideas that I either invented or co-invented while employed by 3Com. Senior Systems Analyst NASA Goddard Space Flight Center September 1991  –  January 1995  (3 years 5 months) Created and managed the metropolitan area network which connects nearby contractors to the NASA/GSFC center network environment. Managed the routers that established the MAN. Served as AppleTalk Protocol Manager and upgraded a 5,000+ device AppleTalk network from Phase I to Phase II, while implementing a consistent zone naming scheme. Served on the Change Control Board for the MAN and WAN firewall routers. \n \nIn this job, I started in PC desktop support, and worked my way onto the team that defined the center network architecture, conceived a radical redesign of the center network that is still in use today. I attained deep familiarity with LAN, MAN, and WAN technologies, plus the following protocols: AppleTalk Phase I and II, Novell IPX, XNS, DECnet Phase IV, LAT, IPv4, plus various network operating systems (3+Share, 3+Open, Microsoft LAN Manager, Novell NetWare, etc.). \n \nResponsible for turning off the last XNS router at NASA/GSFC. Research Assistant, etc. Hill Associates February 1989  –  April 1991  (2 years 3 months) I started as a technical illustrator, while working my way through graduate school, but gradually worked myself into more value-added roles, in that I was generating course material and researching topics for advanced training courses being developed by the company. Graduate Teaching Assistant University of Vermont August 1988  –  June 1989  (11 months) I taught one electrical engineering lab for undergraduates each semester of my first year of graduate school. I was full-time at Hill Associates during the second semester while also working as a GTA. Engineer NASA Goddard Space Flight Center June 1982  –  December 1987  (5 years 7 months) Worked at NASA/GSFC from the Summer after my Junior year of High School, then in every Summer thereafter, and formally as a co-op student when I was at Virginia Tech. The first two Summers I worked on the SARSAT/COSPAS program, writing software and helping out around the lab. I won the American University's H. D. Ussery Scholarship as outstanding summer research student after my first summer at NASA/GSFC. When I was a co-op, I mostly worked on electro-optics research (that was the final 5 -- of 6 total -- quarters). Video Engineer, Google Fiber, an Alphabet Company Alphabet, Inc. May 2015  – Present (4 months) Mountain View, CA My team makes pretty pictures appear on subscribers' TVs and second-screen devices. I work behind the scenes to make sure that happens, from design to implementation and operations. Video Engineer, Google Fiber, an Alphabet Company Alphabet, Inc. May 2015  – Present (4 months) Mountain View, CA My team makes pretty pictures appear on subscribers' TVs and second-screen devices. I work behind the scenes to make sure that happens, from design to implementation and operations. Proprietor Whisky2.0 August 2008  – Present (7 years 1 month) Developing whisk(e)y information and tools aimed at consumers. Proprietor Whisky2.0 August 2008  – Present (7 years 1 month) Developing whisk(e)y information and tools aimed at consumers. Technical Program Manager, Google Fiber Google January 2012  –  May 2015  (3 years 5 months) Mountain View, CA Google Fiber is building a gigabit-class consumer broadband network, starting in Kansas City, Provo, UT and Austin, TX. If you want to learn more, your best bet is to visit Google's search engine and type in \"Google Fiber\" and you'll see whatever we can say publicly. Technical Program Manager, Google Fiber Google January 2012  –  May 2015  (3 years 5 months) Mountain View, CA Google Fiber is building a gigabit-class consumer broadband network, starting in Kansas City, Provo, UT and Austin, TX. If you want to learn more, your best bet is to visit Google's search engine and type in \"Google Fiber\" and you'll see whatever we can say publicly. Director of Federal Solutions Mu Dynamics, Inc. November 2011  –  January 2012  (3 months) Creating and delivering messaging into Federal operations at Mu to support related sales activities. Besides writing, I also speak at various events and work on direct sales calls with our prospects and customers in this space. My background in networking, security, wireless technology and cyber security is a perfect match for the needs of this market. Director of Federal Solutions Mu Dynamics, Inc. November 2011  –  January 2012  (3 months) Creating and delivering messaging into Federal operations at Mu to support related sales activities. Besides writing, I also speak at various events and work on direct sales calls with our prospects and customers in this space. My background in networking, security, wireless technology and cyber security is a perfect match for the needs of this market. Industry Advisory Board Member; Center for Advanced Computing and Digital Forensics (NUCAC-DF) Norwich University 2009  –  January 2012  (3 years) Norwich University, Norwich, VT Contributed equipment and training to support the center and contribute to the university's mission of delivering a compelling experience to its students. Industry Advisory Board Member; Center for Advanced Computing and Digital Forensics (NUCAC-DF) Norwich University 2009  –  January 2012  (3 years) Norwich University, Norwich, VT Contributed equipment and training to support the center and contribute to the university's mission of delivering a compelling experience to its students. Director of Technical Marketing Mu Dynamics February 2006  –  October 2011  (5 years 9 months) Establish, sustain, and deepen relationships with various external test labs. I create collateral to help sell our test solutions, as well as to facilitate communications with press, reviewers, customers, and the public. Develop training materials and presentation materials; deliver educational seminars. Actively participate in standards bodies relevant to Mu's business operations, e.g., ISA. Subject-matter expert on networking technology, including industrial control systems. \n \nhttp://www.mudynamics.com/ Director of Technical Marketing Mu Dynamics February 2006  –  October 2011  (5 years 9 months) Establish, sustain, and deepen relationships with various external test labs. I create collateral to help sell our test solutions, as well as to facilitate communications with press, reviewers, customers, and the public. Develop training materials and presentation materials; deliver educational seminars. Actively participate in standards bodies relevant to Mu's business operations, e.g., ISA. Subject-matter expert on networking technology, including industrial control systems. \n \nhttp://www.mudynamics.com/ Networking Software Architect NVIDIA Corporation August 2001  –  February 2006  (4 years 7 months) Santa Clara, CA Defined system-level hardware and software requirements and interface design requirements for networking aspects of platform processor chipsets, optimizing performance and cost. Developed test plans for QA. Developed white papers and performed market analysis in support of technical marketing efforts, including ongoing competitive analysis. Team leader responsible for interfacing with patent lawyers and building NVIDIA's intellectual property in the networking area. \n \nI am extremely well-versed in networking technology, including wireless LANs and security (everything from firewalls to IPsec). NVIDIA supported my active contributions to IEEE 802.11i meetings. \n \nWhile at NVIDIA, I wrote one of my three books, which was briefly in the amazon.com top-1000 titles after getting a good review on slashdot. \n \nOver 30 patent applications have been filed for which I was inventor or co-inventor while employed by NVIDIA. Twenty-one (21) of these applications have now been awarded. Networking Software Architect NVIDIA Corporation August 2001  –  February 2006  (4 years 7 months) Santa Clara, CA Defined system-level hardware and software requirements and interface design requirements for networking aspects of platform processor chipsets, optimizing performance and cost. Developed test plans for QA. Developed white papers and performed market analysis in support of technical marketing efforts, including ongoing competitive analysis. Team leader responsible for interfacing with patent lawyers and building NVIDIA's intellectual property in the networking area. \n \nI am extremely well-versed in networking technology, including wireless LANs and security (everything from firewalls to IPsec). NVIDIA supported my active contributions to IEEE 802.11i meetings. \n \nWhile at NVIDIA, I wrote one of my three books, which was briefly in the amazon.com top-1000 titles after getting a good review on slashdot. \n \nOver 30 patent applications have been filed for which I was inventor or co-inventor while employed by NVIDIA. Twenty-one (21) of these applications have now been awarded. Product Marketing Engineer; Researcher; Senior Software Engineer 3Com Corporation February 1995  –  July 2001  (6 years 6 months) Guided technical evolution of the NETBuilder router platform. \n \nDesigned and developed advanced features for the Dynamic Access software product family, such as IPsec encryption, IEEE 802.1p class-of-service, IEEE 802.1Q VLAN tagging, etc. \n \nDirected a project in the CTO's office on self-configuring LAN devices (e.g., LAN switches). Coordinated 3Com's involvement with Internet2. \n \nRecruited back to the Ethernet adapter division to define requirements for storage networking products (an early iSCSI storage NIC design), but upper management cancelled the project before it could really get off the ground. \n \nSpent 4 years on the InteropNet Network Operations Center (NOC) team, setting up networks in Tokyo, Las Vegas, Atlanta, and London. \n \nWhile at 3Com I wrote two of my three books. \n \n6 patents have been granted for ideas that I either invented or co-invented while employed by 3Com. Product Marketing Engineer; Researcher; Senior Software Engineer 3Com Corporation February 1995  –  July 2001  (6 years 6 months) Guided technical evolution of the NETBuilder router platform. \n \nDesigned and developed advanced features for the Dynamic Access software product family, such as IPsec encryption, IEEE 802.1p class-of-service, IEEE 802.1Q VLAN tagging, etc. \n \nDirected a project in the CTO's office on self-configuring LAN devices (e.g., LAN switches). Coordinated 3Com's involvement with Internet2. \n \nRecruited back to the Ethernet adapter division to define requirements for storage networking products (an early iSCSI storage NIC design), but upper management cancelled the project before it could really get off the ground. \n \nSpent 4 years on the InteropNet Network Operations Center (NOC) team, setting up networks in Tokyo, Las Vegas, Atlanta, and London. \n \nWhile at 3Com I wrote two of my three books. \n \n6 patents have been granted for ideas that I either invented or co-invented while employed by 3Com. Senior Systems Analyst NASA Goddard Space Flight Center September 1991  –  January 1995  (3 years 5 months) Created and managed the metropolitan area network which connects nearby contractors to the NASA/GSFC center network environment. Managed the routers that established the MAN. Served as AppleTalk Protocol Manager and upgraded a 5,000+ device AppleTalk network from Phase I to Phase II, while implementing a consistent zone naming scheme. Served on the Change Control Board for the MAN and WAN firewall routers. \n \nIn this job, I started in PC desktop support, and worked my way onto the team that defined the center network architecture, conceived a radical redesign of the center network that is still in use today. I attained deep familiarity with LAN, MAN, and WAN technologies, plus the following protocols: AppleTalk Phase I and II, Novell IPX, XNS, DECnet Phase IV, LAT, IPv4, plus various network operating systems (3+Share, 3+Open, Microsoft LAN Manager, Novell NetWare, etc.). \n \nResponsible for turning off the last XNS router at NASA/GSFC. Senior Systems Analyst NASA Goddard Space Flight Center September 1991  –  January 1995  (3 years 5 months) Created and managed the metropolitan area network which connects nearby contractors to the NASA/GSFC center network environment. Managed the routers that established the MAN. Served as AppleTalk Protocol Manager and upgraded a 5,000+ device AppleTalk network from Phase I to Phase II, while implementing a consistent zone naming scheme. Served on the Change Control Board for the MAN and WAN firewall routers. \n \nIn this job, I started in PC desktop support, and worked my way onto the team that defined the center network architecture, conceived a radical redesign of the center network that is still in use today. I attained deep familiarity with LAN, MAN, and WAN technologies, plus the following protocols: AppleTalk Phase I and II, Novell IPX, XNS, DECnet Phase IV, LAT, IPv4, plus various network operating systems (3+Share, 3+Open, Microsoft LAN Manager, Novell NetWare, etc.). \n \nResponsible for turning off the last XNS router at NASA/GSFC. Research Assistant, etc. Hill Associates February 1989  –  April 1991  (2 years 3 months) I started as a technical illustrator, while working my way through graduate school, but gradually worked myself into more value-added roles, in that I was generating course material and researching topics for advanced training courses being developed by the company. Research Assistant, etc. Hill Associates February 1989  –  April 1991  (2 years 3 months) I started as a technical illustrator, while working my way through graduate school, but gradually worked myself into more value-added roles, in that I was generating course material and researching topics for advanced training courses being developed by the company. Graduate Teaching Assistant University of Vermont August 1988  –  June 1989  (11 months) I taught one electrical engineering lab for undergraduates each semester of my first year of graduate school. I was full-time at Hill Associates during the second semester while also working as a GTA. Graduate Teaching Assistant University of Vermont August 1988  –  June 1989  (11 months) I taught one electrical engineering lab for undergraduates each semester of my first year of graduate school. I was full-time at Hill Associates during the second semester while also working as a GTA. Engineer NASA Goddard Space Flight Center June 1982  –  December 1987  (5 years 7 months) Worked at NASA/GSFC from the Summer after my Junior year of High School, then in every Summer thereafter, and formally as a co-op student when I was at Virginia Tech. The first two Summers I worked on the SARSAT/COSPAS program, writing software and helping out around the lab. I won the American University's H. D. Ussery Scholarship as outstanding summer research student after my first summer at NASA/GSFC. When I was a co-op, I mostly worked on electro-optics research (that was the final 5 -- of 6 total -- quarters). Engineer NASA Goddard Space Flight Center June 1982  –  December 1987  (5 years 7 months) Worked at NASA/GSFC from the Summer after my Junior year of High School, then in every Summer thereafter, and formally as a co-op student when I was at Virginia Tech. The first two Summers I worked on the SARSAT/COSPAS program, writing software and helping out around the lab. I won the American University's H. D. Ussery Scholarship as outstanding summer research student after my first summer at NASA/GSFC. When I was a co-op, I mostly worked on electro-optics research (that was the final 5 -- of 6 total -- quarters). Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Teaching Writing Public Speaking Network Security Wireless Networking Wireless Security Twitter Google Analytics Google Docs Technical Writing Writing For The Web Writing For Publication Standards Development Open Standards IETF Inventor Test Automation Test Management Coaching Mentoring Industrial Controls IPv6 Routing Protocols IP Multicast IPv4 Partner Management Partner Marketing LAN Switching WAN Switching Ethernet SCADA ISA Secure EDSA ISCI IEEE 802.11 (Wi-Fi) IEEE 802.15 (Bluetooth  ZigBee  etc.) IEEE 801.16 (WiMAX) Firewalls IPsec Wireless Switches Security Computer Security TCP/IP Networking WiFi Testing IP See 35+     See less Skills  Teaching Writing Public Speaking Network Security Wireless Networking Wireless Security Twitter Google Analytics Google Docs Technical Writing Writing For The Web Writing For Publication Standards Development Open Standards IETF Inventor Test Automation Test Management Coaching Mentoring Industrial Controls IPv6 Routing Protocols IP Multicast IPv4 Partner Management Partner Marketing LAN Switching WAN Switching Ethernet SCADA ISA Secure EDSA ISCI IEEE 802.11 (Wi-Fi) IEEE 802.15 (Bluetooth  ZigBee  etc.) IEEE 801.16 (WiMAX) Firewalls IPsec Wireless Switches Security Computer Security TCP/IP Networking WiFi Testing IP See 35+     See less Teaching Writing Public Speaking Network Security Wireless Networking Wireless Security Twitter Google Analytics Google Docs Technical Writing Writing For The Web Writing For Publication Standards Development Open Standards IETF Inventor Test Automation Test Management Coaching Mentoring Industrial Controls IPv6 Routing Protocols IP Multicast IPv4 Partner Management Partner Marketing LAN Switching WAN Switching Ethernet SCADA ISA Secure EDSA ISCI IEEE 802.11 (Wi-Fi) IEEE 802.15 (Bluetooth  ZigBee  etc.) IEEE 801.16 (WiMAX) Firewalls IPsec Wireless Switches Security Computer Security TCP/IP Networking WiFi Testing IP See 35+     See less Teaching Writing Public Speaking Network Security Wireless Networking Wireless Security Twitter Google Analytics Google Docs Technical Writing Writing For The Web Writing For Publication Standards Development Open Standards IETF Inventor Test Automation Test Management Coaching Mentoring Industrial Controls IPv6 Routing Protocols IP Multicast IPv4 Partner Management Partner Marketing LAN Switching WAN Switching Ethernet SCADA ISA Secure EDSA ISCI IEEE 802.11 (Wi-Fi) IEEE 802.15 (Bluetooth  ZigBee  etc.) IEEE 801.16 (WiMAX) Firewalls IPsec Wireless Switches Security Computer Security TCP/IP Networking WiFi Testing IP See 35+     See less Education University of Vermont MSEE,  Electrical Engineering August 1988  – March 1991 Worked for Hill Associates while getting my Master's degree. Also, worked as a graduate teaching assistant, and taught an undergraduate electrical engineering lab. Virginia Polytechnic Institute and State University BS,  Physics ,  Mathematics September 1983  – June 1988 I took advantage of the co-operative education program at NASA/GSFC to earn valuable experience (and money) while in college. The side effect of this was that I took 5 years to get my undergraduate degree instead of 4, and I used the extra time to take a lot of extra Math classes. Activities and Societies:  Phi Beta Kappa ,  Pi Mu Epsilon ,  Sigma Pi Sigma ,  staff photographer for school daily paper (2 years) and yearbook (3 years) University of Vermont MSEE,  Electrical Engineering August 1988  – March 1991 Worked for Hill Associates while getting my Master's degree. Also, worked as a graduate teaching assistant, and taught an undergraduate electrical engineering lab. University of Vermont MSEE,  Electrical Engineering August 1988  – March 1991 Worked for Hill Associates while getting my Master's degree. Also, worked as a graduate teaching assistant, and taught an undergraduate electrical engineering lab. University of Vermont MSEE,  Electrical Engineering August 1988  – March 1991 Worked for Hill Associates while getting my Master's degree. Also, worked as a graduate teaching assistant, and taught an undergraduate electrical engineering lab. Virginia Polytechnic Institute and State University BS,  Physics ,  Mathematics September 1983  – June 1988 I took advantage of the co-operative education program at NASA/GSFC to earn valuable experience (and money) while in college. The side effect of this was that I took 5 years to get my undergraduate degree instead of 4, and I used the extra time to take a lot of extra Math classes. Activities and Societies:  Phi Beta Kappa ,  Pi Mu Epsilon ,  Sigma Pi Sigma ,  staff photographer for school daily paper (2 years) and yearbook (3 years) Virginia Polytechnic Institute and State University BS,  Physics ,  Mathematics September 1983  – June 1988 I took advantage of the co-operative education program at NASA/GSFC to earn valuable experience (and money) while in college. The side effect of this was that I took 5 years to get my undergraduate degree instead of 4, and I used the extra time to take a lot of extra Math classes. Activities and Societies:  Phi Beta Kappa ,  Pi Mu Epsilon ,  Sigma Pi Sigma ,  staff photographer for school daily paper (2 years) and yearbook (3 years) Virginia Polytechnic Institute and State University BS,  Physics ,  Mathematics September 1983  – June 1988 I took advantage of the co-operative education program at NASA/GSFC to earn valuable experience (and money) while in college. The side effect of this was that I took 5 years to get my undergraduate degree instead of 4, and I used the extra time to take a lot of extra Math classes. Activities and Societies:  Phi Beta Kappa ,  Pi Mu Epsilon ,  Sigma Pi Sigma ,  staff photographer for school daily paper (2 years) and yearbook (3 years) Honors & Awards Additional Honors & Awards U.S. Patents - 43 (see http://1.usa.gov/sqezCM for details...) Additional Honors & Awards U.S. Patents - 43 (see http://1.usa.gov/sqezCM for details...) Additional Honors & Awards U.S. Patents - 43 (see http://1.usa.gov/sqezCM for details...) Additional Honors & Awards U.S. Patents - 43 (see http://1.usa.gov/sqezCM for details...) ", "Experience Business Program Manager, Google Fiber Google August 2014  – Present (1 year 1 month) San Francisco Bay Area DFP Consultant, DoubleClick Google December 2012  –  August 2014  (1 year 9 months) Greater New York City Area Technical Account Manager, DoubleClick Google January 2009  –  November 2012  (3 years 11 months) Account Strategist Google AdWords 2006  –  2009  (3 years) San Francisco Intern WIC 2003  –  2003  (less than a year) Business Program Manager, Google Fiber Google August 2014  – Present (1 year 1 month) San Francisco Bay Area Business Program Manager, Google Fiber Google August 2014  – Present (1 year 1 month) San Francisco Bay Area DFP Consultant, DoubleClick Google December 2012  –  August 2014  (1 year 9 months) Greater New York City Area DFP Consultant, DoubleClick Google December 2012  –  August 2014  (1 year 9 months) Greater New York City Area Technical Account Manager, DoubleClick Google January 2009  –  November 2012  (3 years 11 months) Technical Account Manager, DoubleClick Google January 2009  –  November 2012  (3 years 11 months) Account Strategist Google AdWords 2006  –  2009  (3 years) San Francisco Account Strategist Google AdWords 2006  –  2009  (3 years) San Francisco Intern WIC 2003  –  2003  (less than a year) Intern WIC 2003  –  2003  (less than a year) Skills Skills     Education University of California, Berkeley BA 2002  – 2006 University of California, Berkeley BA 2002  – 2006 University of California, Berkeley BA 2002  – 2006 University of California, Berkeley BA 2002  – 2006 "]}