{"position": "Sales Strategy Senior Associate", "company": "Google", "profiles": ["Skills Digital Marketing Online Advertising SEM Analytics Google Adwords Digital Strategy Web Analytics Google Analytics Digital Media Mobile Marketing PPC E-commerce Online Marketing Social Media Marketing Mobile Advertising Skills  Digital Marketing Online Advertising SEM Analytics Google Adwords Digital Strategy Web Analytics Google Analytics Digital Media Mobile Marketing PPC E-commerce Online Marketing Social Media Marketing Mobile Advertising Digital Marketing Online Advertising SEM Analytics Google Adwords Digital Strategy Web Analytics Google Analytics Digital Media Mobile Marketing PPC E-commerce Online Marketing Social Media Marketing Mobile Advertising Digital Marketing Online Advertising SEM Analytics Google Adwords Digital Strategy Web Analytics Google Analytics Digital Media Mobile Marketing PPC E-commerce Online Marketing Social Media Marketing Mobile Advertising ", "Skills Online Advertising Digital Marketing PPC SEM Google Adwords Digital Strategy Web Analytics E-commerce Digital Media Google Analytics Project Management Search Advertising Sales Support Client Services Competitive Analysis Email Marketing SEO Account Management Business Development Start-ups Market Research Marketing Strategy See 7+     See less Skills  Online Advertising Digital Marketing PPC SEM Google Adwords Digital Strategy Web Analytics E-commerce Digital Media Google Analytics Project Management Search Advertising Sales Support Client Services Competitive Analysis Email Marketing SEO Account Management Business Development Start-ups Market Research Marketing Strategy See 7+     See less Online Advertising Digital Marketing PPC SEM Google Adwords Digital Strategy Web Analytics E-commerce Digital Media Google Analytics Project Management Search Advertising Sales Support Client Services Competitive Analysis Email Marketing SEO Account Management Business Development Start-ups Market Research Marketing Strategy See 7+     See less Online Advertising Digital Marketing PPC SEM Google Adwords Digital Strategy Web Analytics E-commerce Digital Media Google Analytics Project Management Search Advertising Sales Support Client Services Competitive Analysis Email Marketing SEO Account Management Business Development Start-ups Market Research Marketing Strategy See 7+     See less ", "Summary Melissa joined Google in 2003 and is currently leading teams focused on growing SMBs across North America. Fueled by her passion for uncovering business challenges and driving toward solutions, Melissa is a proven leader who is known for moving quickly from inception to execution.  \n \nIn her time at Google, Melissa has partnered with hundreds of clients to understand their business goals and share ideas on how to be successful in today’s online marketplace. Additionally, she works cross-functionally with learning & development, central sales planning and product teams to increase sales efficiency while maximizing the customer experience across North America. Melissa has also served as a manager for mid-market clients where she shaped and delivered marketing solutions for high growth advertisers in the Technology (B2B) and Retail space. Summary Melissa joined Google in 2003 and is currently leading teams focused on growing SMBs across North America. Fueled by her passion for uncovering business challenges and driving toward solutions, Melissa is a proven leader who is known for moving quickly from inception to execution.  \n \nIn her time at Google, Melissa has partnered with hundreds of clients to understand their business goals and share ideas on how to be successful in today’s online marketplace. Additionally, she works cross-functionally with learning & development, central sales planning and product teams to increase sales efficiency while maximizing the customer experience across North America. Melissa has also served as a manager for mid-market clients where she shaped and delivered marketing solutions for high growth advertisers in the Technology (B2B) and Retail space. Melissa joined Google in 2003 and is currently leading teams focused on growing SMBs across North America. Fueled by her passion for uncovering business challenges and driving toward solutions, Melissa is a proven leader who is known for moving quickly from inception to execution.  \n \nIn her time at Google, Melissa has partnered with hundreds of clients to understand their business goals and share ideas on how to be successful in today’s online marketplace. Additionally, she works cross-functionally with learning & development, central sales planning and product teams to increase sales efficiency while maximizing the customer experience across North America. Melissa has also served as a manager for mid-market clients where she shaped and delivered marketing solutions for high growth advertisers in the Technology (B2B) and Retail space. Melissa joined Google in 2003 and is currently leading teams focused on growing SMBs across North America. Fueled by her passion for uncovering business challenges and driving toward solutions, Melissa is a proven leader who is known for moving quickly from inception to execution.  \n \nIn her time at Google, Melissa has partnered with hundreds of clients to understand their business goals and share ideas on how to be successful in today’s online marketplace. Additionally, she works cross-functionally with learning & development, central sales planning and product teams to increase sales efficiency while maximizing the customer experience across North America. Melissa has also served as a manager for mid-market clients where she shaped and delivered marketing solutions for high growth advertisers in the Technology (B2B) and Retail space. Experience Senior Manager, SMB Sales Google November 2014  – Present (10 months) Manager, SMB Sales Google January 2013  –  July 2013  (7 months) Manager, Mid-Market Sales Google January 2012  –  December 2012  (1 year) Manager, Online Sales, Retail Industry Google July 2011  –  December 2011  (6 months) Manager, Online Sales, Technology Industry Google, Inc January 2010  –  July 2011  (1 year 7 months) Team Lead, Online Sales, Technology Industry Google 2007  –  2009  (2 years) Program Lead, Account Development Google January 2007  –  June 2007  (6 months) Sales Development Specialist, L&D (Special Assignment) Google October 2006  –  March 2007  (6 months) Account Manager Google April 2004  –  September 2006  (2 years 6 months) Account Representative Google November 2003  –  April 2004  (6 months) Project Manager Service Objects 2001  –  2003  (2 years) • Collaborated with software engineering team to develop and maintain e-commerce websites \n• Scoped and secured new projects, negotiated timelines, managed budgets \n• Prioritized and delegated tasks to ensure on-time delivery to clients and maximum ROI for company Senior Manager, SMB Sales Google November 2014  – Present (10 months) Senior Manager, SMB Sales Google November 2014  – Present (10 months) Manager, SMB Sales Google January 2013  –  July 2013  (7 months) Manager, SMB Sales Google January 2013  –  July 2013  (7 months) Manager, Mid-Market Sales Google January 2012  –  December 2012  (1 year) Manager, Mid-Market Sales Google January 2012  –  December 2012  (1 year) Manager, Online Sales, Retail Industry Google July 2011  –  December 2011  (6 months) Manager, Online Sales, Retail Industry Google July 2011  –  December 2011  (6 months) Manager, Online Sales, Technology Industry Google, Inc January 2010  –  July 2011  (1 year 7 months) Manager, Online Sales, Technology Industry Google, Inc January 2010  –  July 2011  (1 year 7 months) Team Lead, Online Sales, Technology Industry Google 2007  –  2009  (2 years) Team Lead, Online Sales, Technology Industry Google 2007  –  2009  (2 years) Program Lead, Account Development Google January 2007  –  June 2007  (6 months) Program Lead, Account Development Google January 2007  –  June 2007  (6 months) Sales Development Specialist, L&D (Special Assignment) Google October 2006  –  March 2007  (6 months) Sales Development Specialist, L&D (Special Assignment) Google October 2006  –  March 2007  (6 months) Account Manager Google April 2004  –  September 2006  (2 years 6 months) Account Manager Google April 2004  –  September 2006  (2 years 6 months) Account Representative Google November 2003  –  April 2004  (6 months) Account Representative Google November 2003  –  April 2004  (6 months) Project Manager Service Objects 2001  –  2003  (2 years) • Collaborated with software engineering team to develop and maintain e-commerce websites \n• Scoped and secured new projects, negotiated timelines, managed budgets \n• Prioritized and delegated tasks to ensure on-time delivery to clients and maximum ROI for company Project Manager Service Objects 2001  –  2003  (2 years) • Collaborated with software engineering team to develop and maintain e-commerce websites \n• Scoped and secured new projects, negotiated timelines, managed budgets \n• Prioritized and delegated tasks to ensure on-time delivery to clients and maximum ROI for company Skills CRM E-commerce Marketing Strategy Sales Online Advertising Google Adwords Display Advertising PPC Google Analytics Digital Marketing Analytics Online Marketing Mobile Advertising SaaS Digital Strategy Digital Media Mobile Marketing See 2+     See less Skills  CRM E-commerce Marketing Strategy Sales Online Advertising Google Adwords Display Advertising PPC Google Analytics Digital Marketing Analytics Online Marketing Mobile Advertising SaaS Digital Strategy Digital Media Mobile Marketing See 2+     See less CRM E-commerce Marketing Strategy Sales Online Advertising Google Adwords Display Advertising PPC Google Analytics Digital Marketing Analytics Online Marketing Mobile Advertising SaaS Digital Strategy Digital Media Mobile Marketing See 2+     See less CRM E-commerce Marketing Strategy Sales Online Advertising Google Adwords Display Advertising PPC Google Analytics Digital Marketing Analytics Online Marketing Mobile Advertising SaaS Digital Strategy Digital Media Mobile Marketing See 2+     See less Education University of California, Santa Barbara BA,  Communication , General 1997  – 2001 University of California, Santa Barbara BA,  Communication , General 1997  – 2001 University of California, Santa Barbara BA,  Communication , General 1997  – 2001 University of California, Santa Barbara BA,  Communication , General 1997  – 2001 Honors & Awards VP Award, SMB Revenue December 2012 For playing a key role in establishing a culture of consultative sales in a previously operations focused department, globally. Highest honor awarded by Global SMB Revenue. Platinum Award, Online Sales & Operations 2007 For designing and launching AdWords account development program within Online Sales & Operations, North America. Program successfully replicated globally. VP Award, SMB Revenue December 2012 For playing a key role in establishing a culture of consultative sales in a previously operations focused department, globally. Highest honor awarded by Global SMB Revenue. VP Award, SMB Revenue December 2012 For playing a key role in establishing a culture of consultative sales in a previously operations focused department, globally. Highest honor awarded by Global SMB Revenue. VP Award, SMB Revenue December 2012 For playing a key role in establishing a culture of consultative sales in a previously operations focused department, globally. Highest honor awarded by Global SMB Revenue. Platinum Award, Online Sales & Operations 2007 For designing and launching AdWords account development program within Online Sales & Operations, North America. Program successfully replicated globally. Platinum Award, Online Sales & Operations 2007 For designing and launching AdWords account development program within Online Sales & Operations, North America. Program successfully replicated globally. Platinum Award, Online Sales & Operations 2007 For designing and launching AdWords account development program within Online Sales & Operations, North America. Program successfully replicated globally. ", "Experience APAC SMB Regional Analytical Lead Google June 2015  – Present (3 months) Singapore Global SMB Senior Sales Insights Analyst Google July 2014  – Present (1 year 2 months) Singapore Google Fiber Senior Business Analyst Google May 2013  –  July 2014  (1 year 3 months) San Francisco Bay Area Business Planning and Operation Management \n \n• Prepare analyses and insights and cooperate with marketing and sales to formulate a set of decision rules to identify expansion opportunities in the areas of process, workflow, innovation, communication, and strategic planning. \n• Develop a nationwide performance reporting framework and measurement system to monitor health of business for senior management and customer service and operation teams to drive operational excellence. \n \nEmerging Product Rollout \n \n• Partner with cross-functional stakeholders in constructions, marketing, sales, customer services, and procurement to streamline business operations and improve business performance, including increasing the overall customer base, improving fiber construction efficiency, increasing marketing and sales penetration, and improving customer satisfaction towards new Google Fiber products. \n• Build modularized business performance analysis infrastructure to monitor and evaluate new business performance and support Google Fiber nationwide expansions \n• Team up with Finance to build customer lifetime value (CLTV) model to develop customer support strategies and allocate resources to enhance user experience and improve business profitability. Global Sales Operations and Strategy Associate Lead Google March 2012  –  April 2013  (1 year 2 months) San Francisco Bay Area Analyses and Insights \n \n• Worked with different stakeholders in different business areas and multiple analyst teams (Global Sales Finance, Global Business Intelligence and Global/Regional Ops) on the cross functional reports which analyzes business performance through geographic location, product, customer engagement level and business group and bring actionable insights to executive management to drive strategic initiatives. \n \n• Designed sales activity tracking system for sales team and agency team to provide key business metrics to sales team and provided online reporting and insights at scale. \n \nProject Management \n \n• Led the agency initiative by working with agency ops team and agency sales team to collect agency team’s business needs and developed agency reporting databases to track and analyze agency business performance. \n• Cooperated with external contractors to develop online reporting platform based on AppEngine and managed work in progress to operationalize business needs and delivered the project on time. \n \nCross-functional Support \n \n• Worked with Global Sales Finance team on Beacon reporting platform to incorporate product sales statistics into revenue performance tracking to help global product sales teams evaluate business performance by product and formulate product strategies. \n• Cooperated with GRM engineers in designing solid and scalable pipeline tracking system to provide actionable business analysis globally. Sales Operations Analyst Google April 2010  –  March 2012  (2 years) Singapore Operation Management and Analysis \n \n• Managed APAC sales operations in setting up portfolio for different sales channels to serve customers in proper level and implementing global initiatives, such as Campaign Selling, to help sales team engage customers and improve Google’s product adoption rate and revenue performance from core search products to high potential mobile and display products. \n \n• Led and designed operation analysis for APAC business with 20+ % YoY growth rate to provide insights on sales activities to assist senior management in driving business across the region. Reached out to regional sales heads to help each country track their business performance and provide recommendations to help sales team achieve targeted customer engagement level. Finance Manager Johnson & Johnson June 2009  –  March 2010  (10 months) Shanghai Suburb, China • Performed a wide range of financial analysis, including financial projections, beauty industry benchmarking, scenario modeling, and returns analysis. Incorporated 5-year strategy into high-level financial models built from scratch.  \n \n• Synthesized data from sales and marketing to identify opportunities and drivers in different locations and formulated accelerate plan for Neutrogena to leverage annual fixed investment. Sales Finance Summer Intern Google May 2008  –  August 2008  (4 months) Beijing City, China Senior Associate PwC August 2005  –  May 2007  (1 year 10 months) Beijing City, China • Research & Analysis: Prepared business performance analysis in Management Discussion & Analysis Report for a multi-listed client company in global stock exchange. \n \n• Financial Modeling: Developed a financial model using key performance indicators to monitor  \nand analyze the operating results of different business segments for a major telecom company in China which has $10 billion business with more than 30 branches. Associate PwC August 2003  –  July 2005  (2 years) Beijing City, China APAC SMB Regional Analytical Lead Google June 2015  – Present (3 months) Singapore APAC SMB Regional Analytical Lead Google June 2015  – Present (3 months) Singapore Global SMB Senior Sales Insights Analyst Google July 2014  – Present (1 year 2 months) Singapore Global SMB Senior Sales Insights Analyst Google July 2014  – Present (1 year 2 months) Singapore Google Fiber Senior Business Analyst Google May 2013  –  July 2014  (1 year 3 months) San Francisco Bay Area Business Planning and Operation Management \n \n• Prepare analyses and insights and cooperate with marketing and sales to formulate a set of decision rules to identify expansion opportunities in the areas of process, workflow, innovation, communication, and strategic planning. \n• Develop a nationwide performance reporting framework and measurement system to monitor health of business for senior management and customer service and operation teams to drive operational excellence. \n \nEmerging Product Rollout \n \n• Partner with cross-functional stakeholders in constructions, marketing, sales, customer services, and procurement to streamline business operations and improve business performance, including increasing the overall customer base, improving fiber construction efficiency, increasing marketing and sales penetration, and improving customer satisfaction towards new Google Fiber products. \n• Build modularized business performance analysis infrastructure to monitor and evaluate new business performance and support Google Fiber nationwide expansions \n• Team up with Finance to build customer lifetime value (CLTV) model to develop customer support strategies and allocate resources to enhance user experience and improve business profitability. Google Fiber Senior Business Analyst Google May 2013  –  July 2014  (1 year 3 months) San Francisco Bay Area Business Planning and Operation Management \n \n• Prepare analyses and insights and cooperate with marketing and sales to formulate a set of decision rules to identify expansion opportunities in the areas of process, workflow, innovation, communication, and strategic planning. \n• Develop a nationwide performance reporting framework and measurement system to monitor health of business for senior management and customer service and operation teams to drive operational excellence. \n \nEmerging Product Rollout \n \n• Partner with cross-functional stakeholders in constructions, marketing, sales, customer services, and procurement to streamline business operations and improve business performance, including increasing the overall customer base, improving fiber construction efficiency, increasing marketing and sales penetration, and improving customer satisfaction towards new Google Fiber products. \n• Build modularized business performance analysis infrastructure to monitor and evaluate new business performance and support Google Fiber nationwide expansions \n• Team up with Finance to build customer lifetime value (CLTV) model to develop customer support strategies and allocate resources to enhance user experience and improve business profitability. Global Sales Operations and Strategy Associate Lead Google March 2012  –  April 2013  (1 year 2 months) San Francisco Bay Area Analyses and Insights \n \n• Worked with different stakeholders in different business areas and multiple analyst teams (Global Sales Finance, Global Business Intelligence and Global/Regional Ops) on the cross functional reports which analyzes business performance through geographic location, product, customer engagement level and business group and bring actionable insights to executive management to drive strategic initiatives. \n \n• Designed sales activity tracking system for sales team and agency team to provide key business metrics to sales team and provided online reporting and insights at scale. \n \nProject Management \n \n• Led the agency initiative by working with agency ops team and agency sales team to collect agency team’s business needs and developed agency reporting databases to track and analyze agency business performance. \n• Cooperated with external contractors to develop online reporting platform based on AppEngine and managed work in progress to operationalize business needs and delivered the project on time. \n \nCross-functional Support \n \n• Worked with Global Sales Finance team on Beacon reporting platform to incorporate product sales statistics into revenue performance tracking to help global product sales teams evaluate business performance by product and formulate product strategies. \n• Cooperated with GRM engineers in designing solid and scalable pipeline tracking system to provide actionable business analysis globally. Global Sales Operations and Strategy Associate Lead Google March 2012  –  April 2013  (1 year 2 months) San Francisco Bay Area Analyses and Insights \n \n• Worked with different stakeholders in different business areas and multiple analyst teams (Global Sales Finance, Global Business Intelligence and Global/Regional Ops) on the cross functional reports which analyzes business performance through geographic location, product, customer engagement level and business group and bring actionable insights to executive management to drive strategic initiatives. \n \n• Designed sales activity tracking system for sales team and agency team to provide key business metrics to sales team and provided online reporting and insights at scale. \n \nProject Management \n \n• Led the agency initiative by working with agency ops team and agency sales team to collect agency team’s business needs and developed agency reporting databases to track and analyze agency business performance. \n• Cooperated with external contractors to develop online reporting platform based on AppEngine and managed work in progress to operationalize business needs and delivered the project on time. \n \nCross-functional Support \n \n• Worked with Global Sales Finance team on Beacon reporting platform to incorporate product sales statistics into revenue performance tracking to help global product sales teams evaluate business performance by product and formulate product strategies. \n• Cooperated with GRM engineers in designing solid and scalable pipeline tracking system to provide actionable business analysis globally. Sales Operations Analyst Google April 2010  –  March 2012  (2 years) Singapore Operation Management and Analysis \n \n• Managed APAC sales operations in setting up portfolio for different sales channels to serve customers in proper level and implementing global initiatives, such as Campaign Selling, to help sales team engage customers and improve Google’s product adoption rate and revenue performance from core search products to high potential mobile and display products. \n \n• Led and designed operation analysis for APAC business with 20+ % YoY growth rate to provide insights on sales activities to assist senior management in driving business across the region. Reached out to regional sales heads to help each country track their business performance and provide recommendations to help sales team achieve targeted customer engagement level. Sales Operations Analyst Google April 2010  –  March 2012  (2 years) Singapore Operation Management and Analysis \n \n• Managed APAC sales operations in setting up portfolio for different sales channels to serve customers in proper level and implementing global initiatives, such as Campaign Selling, to help sales team engage customers and improve Google’s product adoption rate and revenue performance from core search products to high potential mobile and display products. \n \n• Led and designed operation analysis for APAC business with 20+ % YoY growth rate to provide insights on sales activities to assist senior management in driving business across the region. Reached out to regional sales heads to help each country track their business performance and provide recommendations to help sales team achieve targeted customer engagement level. Finance Manager Johnson & Johnson June 2009  –  March 2010  (10 months) Shanghai Suburb, China • Performed a wide range of financial analysis, including financial projections, beauty industry benchmarking, scenario modeling, and returns analysis. Incorporated 5-year strategy into high-level financial models built from scratch.  \n \n• Synthesized data from sales and marketing to identify opportunities and drivers in different locations and formulated accelerate plan for Neutrogena to leverage annual fixed investment. Finance Manager Johnson & Johnson June 2009  –  March 2010  (10 months) Shanghai Suburb, China • Performed a wide range of financial analysis, including financial projections, beauty industry benchmarking, scenario modeling, and returns analysis. Incorporated 5-year strategy into high-level financial models built from scratch.  \n \n• Synthesized data from sales and marketing to identify opportunities and drivers in different locations and formulated accelerate plan for Neutrogena to leverage annual fixed investment. Sales Finance Summer Intern Google May 2008  –  August 2008  (4 months) Beijing City, China Sales Finance Summer Intern Google May 2008  –  August 2008  (4 months) Beijing City, China Senior Associate PwC August 2005  –  May 2007  (1 year 10 months) Beijing City, China • Research & Analysis: Prepared business performance analysis in Management Discussion & Analysis Report for a multi-listed client company in global stock exchange. \n \n• Financial Modeling: Developed a financial model using key performance indicators to monitor  \nand analyze the operating results of different business segments for a major telecom company in China which has $10 billion business with more than 30 branches. Senior Associate PwC August 2005  –  May 2007  (1 year 10 months) Beijing City, China • Research & Analysis: Prepared business performance analysis in Management Discussion & Analysis Report for a multi-listed client company in global stock exchange. \n \n• Financial Modeling: Developed a financial model using key performance indicators to monitor  \nand analyze the operating results of different business segments for a major telecom company in China which has $10 billion business with more than 30 branches. Associate PwC August 2003  –  July 2005  (2 years) Beijing City, China Associate PwC August 2003  –  July 2005  (2 years) Beijing City, China Skills Sales Strategy Sales Operations Financial Modeling Financial Analysis Business Strategy Analytics Business Analysis Market Research Finance Start-ups Strategic Planning Microsoft Excel Business Development Project Management Microsoft Office New Business Development SQL Business Intelligence Business Planning Business Process... See 6+     See less Skills  Sales Strategy Sales Operations Financial Modeling Financial Analysis Business Strategy Analytics Business Analysis Market Research Finance Start-ups Strategic Planning Microsoft Excel Business Development Project Management Microsoft Office New Business Development SQL Business Intelligence Business Planning Business Process... See 6+     See less Sales Strategy Sales Operations Financial Modeling Financial Analysis Business Strategy Analytics Business Analysis Market Research Finance Start-ups Strategic Planning Microsoft Excel Business Development Project Management Microsoft Office New Business Development SQL Business Intelligence Business Planning Business Process... See 6+     See less Sales Strategy Sales Operations Financial Modeling Financial Analysis Business Strategy Analytics Business Analysis Market Research Finance Start-ups Strategic Planning Microsoft Excel Business Development Project Management Microsoft Office New Business Development SQL Business Intelligence Business Planning Business Process... See 6+     See less Education Carlson School of Management Master of Business Administration (MBA),  Finance , General 2007  – 2009 Renmin University of China Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General 1999  – 2003 Carlson School of Management Master of Business Administration (MBA),  Finance , General 2007  – 2009 Carlson School of Management Master of Business Administration (MBA),  Finance , General 2007  – 2009 Carlson School of Management Master of Business Administration (MBA),  Finance , General 2007  – 2009 Renmin University of China Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General 1999  – 2003 Renmin University of China Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General 1999  – 2003 Renmin University of China Bachelor of Business Administration (B.B.A.),  Business Administration and Management , General 1999  – 2003 ", "Summary I’m a highly motivated sales and business leader with 15 years experience working in traditional and online advertising with both performance and brand advertisers. I’m passionate about learning new things, I love building teams, managing people and relish a challenge. Summary I’m a highly motivated sales and business leader with 15 years experience working in traditional and online advertising with both performance and brand advertisers. I’m passionate about learning new things, I love building teams, managing people and relish a challenge. I’m a highly motivated sales and business leader with 15 years experience working in traditional and online advertising with both performance and brand advertisers. I’m passionate about learning new things, I love building teams, managing people and relish a challenge. I’m a highly motivated sales and business leader with 15 years experience working in traditional and online advertising with both performance and brand advertisers. I’m passionate about learning new things, I love building teams, managing people and relish a challenge. Experience Head of Premium Content Sales - Europe, Middle East & Africa Google April 2015  – Present (5 months) London, United Kingdom Responsible for strategy, development and sales activation of YouTube content solutions across EMEA including media packaging, sponsorships & brand content \nRunning a team of 5 Content Solutions Leads across 4 EMEA offices \nSuccessfully launched ‘Google Preferred’ (premium reserve ad format) across UK, DE, FR and MENA. \nSponsorships - driving leads, pitch pipeline and supporting sales team pitches \nBrand content - delivering workshops for brands as creators, consultation to priority customers across EMEA \nDeveloped strategy and process for YouTube creator collaborations for brands. Built strong relationships with MCNs and production partners to deliver best in class content and media solutions for our customers \n Head of Premium Content Sales, North & Central Europe Google - YouTube December 2014  – Present (9 months) London, United Kingdom Head of YouTube Music Propositions, North & Central Europe Google January 2014  –  December 2014  (1 year) London, United Kingdom Responsible for Developing media packaging and sponsorship solutions around music on YouTube \nDesigned new music narrative and sales strategy \nActivated incremental sales of c. $2m within first 3 months \nManaged team of 3 responsible for all content solution verticals across Europe \nRepresented YouTube music at numerous sales related events regularly taking part in panel discussions, keynote speeches to raise YouTube’s music profile \n YouTube Head - Retail, Media & Tech Google September 2012  –  December 2013  (1 year 4 months) London, United Kingdom Part of the UK’s largest sector’s management team, responsible for driving YouTube sales across Retail, Media and Tech customer portfolio \nBuilt a small specialist YouTube sales team, created clear business plan, customer segmentation \nImplemented strict pipeline management to drive the right sales behaviours \nRan video workshops, ‘brand labs’, big pitches and events for customers \nBuilt strong xfn working groups in order to deliver best customer solutions \n Senior Industry Manager Google May 2012  –  December 2012  (8 months) London, United Kingdom Responsible for all Google product revenue across my customer portfolios \nLead industry outreach in the property sub vertical including conference key notes, awards judging & writing articles for trade press \nStrong senior level relationships with my customers CMO upwards \n Industry Manager Google October 2010  –  May 2012  (1 year 8 months) Account Manager Google UK 2007  –  October 2010  (3 years) Took one estate agent chain from zero spend on search to $300k per month \nOrganised and spoke at a number of client specific events for house building clients: \nWorked with Nielsen to prove the value of search in the property purchasing process. Wrote and published the research in trade press and used effectively to drive incremental display revenue \nWon a European Best Practice award for my work with our largest customer - helping them understand the value of search to their business, resulting in a 25% spend increase ($1M p.a. impact) \n Strategic Account Manager, Radio Emap Advertising 2006  –  2007  (1 year) Working with strategic planning teams on radio’s highest billing portfolio of agencies to maximise airtime and S&P revenue. The role involved: \nBuilding strong relationships with key agency personnel \nSelling across Emap’s 48 radio stations and affiliated websites \nWorking with programming to develop S&P ideas \nRunning sales floor initiatives \n Senior Sales Exec, Magazines Emap Advertising 2003  –  2006  (3 years) Selling display advertising space in Emap’s entertainment magazines (Empire, Q, Kerrang, Mojo & Mixmag).  \nEmap Advance management fast track programme. From 50 applicants I was 1 of 12 people to win a place. All applicants had to develop a ‘quantum’ idea to improve the business, which we then presented to board members. \n Head of Premium Content Sales - Europe, Middle East & Africa Google April 2015  – Present (5 months) London, United Kingdom Responsible for strategy, development and sales activation of YouTube content solutions across EMEA including media packaging, sponsorships & brand content \nRunning a team of 5 Content Solutions Leads across 4 EMEA offices \nSuccessfully launched ‘Google Preferred’ (premium reserve ad format) across UK, DE, FR and MENA. \nSponsorships - driving leads, pitch pipeline and supporting sales team pitches \nBrand content - delivering workshops for brands as creators, consultation to priority customers across EMEA \nDeveloped strategy and process for YouTube creator collaborations for brands. Built strong relationships with MCNs and production partners to deliver best in class content and media solutions for our customers \n Head of Premium Content Sales - Europe, Middle East & Africa Google April 2015  – Present (5 months) London, United Kingdom Responsible for strategy, development and sales activation of YouTube content solutions across EMEA including media packaging, sponsorships & brand content \nRunning a team of 5 Content Solutions Leads across 4 EMEA offices \nSuccessfully launched ‘Google Preferred’ (premium reserve ad format) across UK, DE, FR and MENA. \nSponsorships - driving leads, pitch pipeline and supporting sales team pitches \nBrand content - delivering workshops for brands as creators, consultation to priority customers across EMEA \nDeveloped strategy and process for YouTube creator collaborations for brands. Built strong relationships with MCNs and production partners to deliver best in class content and media solutions for our customers \n Head of Premium Content Sales, North & Central Europe Google - YouTube December 2014  – Present (9 months) London, United Kingdom Head of Premium Content Sales, North & Central Europe Google - YouTube December 2014  – Present (9 months) London, United Kingdom Head of YouTube Music Propositions, North & Central Europe Google January 2014  –  December 2014  (1 year) London, United Kingdom Responsible for Developing media packaging and sponsorship solutions around music on YouTube \nDesigned new music narrative and sales strategy \nActivated incremental sales of c. $2m within first 3 months \nManaged team of 3 responsible for all content solution verticals across Europe \nRepresented YouTube music at numerous sales related events regularly taking part in panel discussions, keynote speeches to raise YouTube’s music profile \n Head of YouTube Music Propositions, North & Central Europe Google January 2014  –  December 2014  (1 year) London, United Kingdom Responsible for Developing media packaging and sponsorship solutions around music on YouTube \nDesigned new music narrative and sales strategy \nActivated incremental sales of c. $2m within first 3 months \nManaged team of 3 responsible for all content solution verticals across Europe \nRepresented YouTube music at numerous sales related events regularly taking part in panel discussions, keynote speeches to raise YouTube’s music profile \n YouTube Head - Retail, Media & Tech Google September 2012  –  December 2013  (1 year 4 months) London, United Kingdom Part of the UK’s largest sector’s management team, responsible for driving YouTube sales across Retail, Media and Tech customer portfolio \nBuilt a small specialist YouTube sales team, created clear business plan, customer segmentation \nImplemented strict pipeline management to drive the right sales behaviours \nRan video workshops, ‘brand labs’, big pitches and events for customers \nBuilt strong xfn working groups in order to deliver best customer solutions \n YouTube Head - Retail, Media & Tech Google September 2012  –  December 2013  (1 year 4 months) London, United Kingdom Part of the UK’s largest sector’s management team, responsible for driving YouTube sales across Retail, Media and Tech customer portfolio \nBuilt a small specialist YouTube sales team, created clear business plan, customer segmentation \nImplemented strict pipeline management to drive the right sales behaviours \nRan video workshops, ‘brand labs’, big pitches and events for customers \nBuilt strong xfn working groups in order to deliver best customer solutions \n Senior Industry Manager Google May 2012  –  December 2012  (8 months) London, United Kingdom Responsible for all Google product revenue across my customer portfolios \nLead industry outreach in the property sub vertical including conference key notes, awards judging & writing articles for trade press \nStrong senior level relationships with my customers CMO upwards \n Senior Industry Manager Google May 2012  –  December 2012  (8 months) London, United Kingdom Responsible for all Google product revenue across my customer portfolios \nLead industry outreach in the property sub vertical including conference key notes, awards judging & writing articles for trade press \nStrong senior level relationships with my customers CMO upwards \n Industry Manager Google October 2010  –  May 2012  (1 year 8 months) Industry Manager Google October 2010  –  May 2012  (1 year 8 months) Account Manager Google UK 2007  –  October 2010  (3 years) Took one estate agent chain from zero spend on search to $300k per month \nOrganised and spoke at a number of client specific events for house building clients: \nWorked with Nielsen to prove the value of search in the property purchasing process. Wrote and published the research in trade press and used effectively to drive incremental display revenue \nWon a European Best Practice award for my work with our largest customer - helping them understand the value of search to their business, resulting in a 25% spend increase ($1M p.a. impact) \n Account Manager Google UK 2007  –  October 2010  (3 years) Took one estate agent chain from zero spend on search to $300k per month \nOrganised and spoke at a number of client specific events for house building clients: \nWorked with Nielsen to prove the value of search in the property purchasing process. Wrote and published the research in trade press and used effectively to drive incremental display revenue \nWon a European Best Practice award for my work with our largest customer - helping them understand the value of search to their business, resulting in a 25% spend increase ($1M p.a. impact) \n Strategic Account Manager, Radio Emap Advertising 2006  –  2007  (1 year) Working with strategic planning teams on radio’s highest billing portfolio of agencies to maximise airtime and S&P revenue. The role involved: \nBuilding strong relationships with key agency personnel \nSelling across Emap’s 48 radio stations and affiliated websites \nWorking with programming to develop S&P ideas \nRunning sales floor initiatives \n Strategic Account Manager, Radio Emap Advertising 2006  –  2007  (1 year) Working with strategic planning teams on radio’s highest billing portfolio of agencies to maximise airtime and S&P revenue. The role involved: \nBuilding strong relationships with key agency personnel \nSelling across Emap’s 48 radio stations and affiliated websites \nWorking with programming to develop S&P ideas \nRunning sales floor initiatives \n Senior Sales Exec, Magazines Emap Advertising 2003  –  2006  (3 years) Selling display advertising space in Emap’s entertainment magazines (Empire, Q, Kerrang, Mojo & Mixmag).  \nEmap Advance management fast track programme. From 50 applicants I was 1 of 12 people to win a place. All applicants had to develop a ‘quantum’ idea to improve the business, which we then presented to board members. \n Senior Sales Exec, Magazines Emap Advertising 2003  –  2006  (3 years) Selling display advertising space in Emap’s entertainment magazines (Empire, Q, Kerrang, Mojo & Mixmag).  \nEmap Advance management fast track programme. From 50 applicants I was 1 of 12 people to win a place. All applicants had to develop a ‘quantum’ idea to improve the business, which we then presented to board members. \n Skills Strategic Partnerships Google Adwords Online Advertising New Media Digital Marketing Mobile Advertising PPC Digital Strategy Skills  Strategic Partnerships Google Adwords Online Advertising New Media Digital Marketing Mobile Advertising PPC Digital Strategy Strategic Partnerships Google Adwords Online Advertising New Media Digital Marketing Mobile Advertising PPC Digital Strategy Strategic Partnerships Google Adwords Online Advertising New Media Digital Marketing Mobile Advertising PPC Digital Strategy Education Birmingham City University 2:1,  Marketing 1999  – 2001 Dean Close School Birmingham City University 2:1,  Marketing 1999  – 2001 Birmingham City University 2:1,  Marketing 1999  – 2001 Birmingham City University 2:1,  Marketing 1999  – 2001 Dean Close School Dean Close School Dean Close School ", "Experience Head of Performance Marketing, Northeast Google January 2014  – Present (1 year 8 months) Greater Boston Area Head of Industry, Telecom - Advertising Sales Google May 2012  – Present (3 years 4 months) Board of Directors Member MITX June 2013  – Present (2 years 3 months) Greater Boston Area Head of Performance Marketing, Northeast Google January 2014  – Present (1 year 8 months) Greater Boston Area Head of Performance Marketing, Northeast Google January 2014  – Present (1 year 8 months) Greater Boston Area Head of Industry, Telecom - Advertising Sales Google May 2012  – Present (3 years 4 months) Head of Industry, Telecom - Advertising Sales Google May 2012  – Present (3 years 4 months) Board of Directors Member MITX June 2013  – Present (2 years 3 months) Greater Boston Area Board of Directors Member MITX June 2013  – Present (2 years 3 months) Greater Boston Area Languages Spanish Spanish Spanish Skills Advertising Sales Advertising Customer Relations Retail Google Adwords SEM Web Analytics Digital Marketing Google Analytics Online Marketing Online Advertising Mobile Sales Operations Account Management E-commerce Search Advertising Consultative Selling Product Marketing PPC Online Sales Mobile Marketing Marketing Strategy New Business Development Customer Acquisition Search Business Development Start-ups Digital Strategy Strategy Digital Media Mobile Advertising Sales See 17+     See less Skills  Advertising Sales Advertising Customer Relations Retail Google Adwords SEM Web Analytics Digital Marketing Google Analytics Online Marketing Online Advertising Mobile Sales Operations Account Management E-commerce Search Advertising Consultative Selling Product Marketing PPC Online Sales Mobile Marketing Marketing Strategy New Business Development Customer Acquisition Search Business Development Start-ups Digital Strategy Strategy Digital Media Mobile Advertising Sales See 17+     See less Advertising Sales Advertising Customer Relations Retail Google Adwords SEM Web Analytics Digital Marketing Google Analytics Online Marketing Online Advertising Mobile Sales Operations Account Management E-commerce Search Advertising Consultative Selling Product Marketing PPC Online Sales Mobile Marketing Marketing Strategy New Business Development Customer Acquisition Search Business Development Start-ups Digital Strategy Strategy Digital Media Mobile Advertising Sales See 17+     See less Advertising Sales Advertising Customer Relations Retail Google Adwords SEM Web Analytics Digital Marketing Google Analytics Online Marketing Online Advertising Mobile Sales Operations Account Management E-commerce Search Advertising Consultative Selling Product Marketing PPC Online Sales Mobile Marketing Marketing Strategy New Business Development Customer Acquisition Search Business Development Start-ups Digital Strategy Strategy Digital Media Mobile Advertising Sales See 17+     See less Education Boston University Questrom School of Business MBA,  Marketing 2002  – 2004 Activities and Societies:  Sports Marketing Club Boston University Questrom School of Business MIS,  Information Systems 2002  – 2004 Activities and Societies:  Technology Club Brown University BA,  International Relations 1992  – 1996 Activities and Societies:  Div. I Men's Soccer Boston University Questrom School of Business MBA,  Marketing 2002  – 2004 Activities and Societies:  Sports Marketing Club Boston University Questrom School of Business MBA,  Marketing 2002  – 2004 Activities and Societies:  Sports Marketing Club Boston University Questrom School of Business MBA,  Marketing 2002  – 2004 Activities and Societies:  Sports Marketing Club Boston University Questrom School of Business MIS,  Information Systems 2002  – 2004 Activities and Societies:  Technology Club Boston University Questrom School of Business MIS,  Information Systems 2002  – 2004 Activities and Societies:  Technology Club Boston University Questrom School of Business MIS,  Information Systems 2002  – 2004 Activities and Societies:  Technology Club Brown University BA,  International Relations 1992  – 1996 Activities and Societies:  Div. I Men's Soccer Brown University BA,  International Relations 1992  – 1996 Activities and Societies:  Div. I Men's Soccer Brown University BA,  International Relations 1992  – 1996 Activities and Societies:  Div. I Men's Soccer ", "Experience Sales Development Manager, Partner Business Solutions, APAC Google Asia Pacific January 2014  – Present (1 year 8 months) Singapore Sr. AdWords Account Manager, Large Customer Sales, SEA Google Asia Pacific March 2011  – Present (4 years 6 months) Singapore AdWords Account Manager, Online Sales & Operations, France Google Ireland March 2007  –  March 2011  (4 years 1 month) Dublin, Ireland New Business Account Manager, Online Sales & Operations, France Google Ireland March 2007  –  October 2007  (8 months) Dublin, Ireland Account Executive InterPublic Group - Mullen Advertising (Winston-Salem, NC, USA) August 2006  –  February 2007  (7 months) Winston-Salem, NC, USA Advertising, Promotion and Sales Animation Associate ExxonMobil / Esso S.A.F. July 2004  –  July 2005  (1 year 1 month) Paris, France Sales Intern IKEA June 2003  –  August 2003  (3 months) Bordeaux, France Sales Development Manager, Partner Business Solutions, APAC Google Asia Pacific January 2014  – Present (1 year 8 months) Singapore Sales Development Manager, Partner Business Solutions, APAC Google Asia Pacific January 2014  – Present (1 year 8 months) Singapore Sr. AdWords Account Manager, Large Customer Sales, SEA Google Asia Pacific March 2011  – Present (4 years 6 months) Singapore Sr. AdWords Account Manager, Large Customer Sales, SEA Google Asia Pacific March 2011  – Present (4 years 6 months) Singapore AdWords Account Manager, Online Sales & Operations, France Google Ireland March 2007  –  March 2011  (4 years 1 month) Dublin, Ireland AdWords Account Manager, Online Sales & Operations, France Google Ireland March 2007  –  March 2011  (4 years 1 month) Dublin, Ireland New Business Account Manager, Online Sales & Operations, France Google Ireland March 2007  –  October 2007  (8 months) Dublin, Ireland New Business Account Manager, Online Sales & Operations, France Google Ireland March 2007  –  October 2007  (8 months) Dublin, Ireland Account Executive InterPublic Group - Mullen Advertising (Winston-Salem, NC, USA) August 2006  –  February 2007  (7 months) Winston-Salem, NC, USA Account Executive InterPublic Group - Mullen Advertising (Winston-Salem, NC, USA) August 2006  –  February 2007  (7 months) Winston-Salem, NC, USA Advertising, Promotion and Sales Animation Associate ExxonMobil / Esso S.A.F. July 2004  –  July 2005  (1 year 1 month) Paris, France Advertising, Promotion and Sales Animation Associate ExxonMobil / Esso S.A.F. July 2004  –  July 2005  (1 year 1 month) Paris, France Sales Intern IKEA June 2003  –  August 2003  (3 months) Bordeaux, France Sales Intern IKEA June 2003  –  August 2003  (3 months) Bordeaux, France Languages   Skills Digital Marketing Online Advertising Google Adwords Display Advertising Digital Strategy Online Marketing SEM B2B Direct Marketing Entrepreneurship Mobile Marketing Marketing E-commerce Product Marketing Web Analytics Search Advertising Marketing Research Marketing Strategy Sales Salesforce.com See 5+     See less Skills  Digital Marketing Online Advertising Google Adwords Display Advertising Digital Strategy Online Marketing SEM B2B Direct Marketing Entrepreneurship Mobile Marketing Marketing E-commerce Product Marketing Web Analytics Search Advertising Marketing Research Marketing Strategy Sales Salesforce.com See 5+     See less Digital Marketing Online Advertising Google Adwords Display Advertising Digital Strategy Online Marketing SEM B2B Direct Marketing Entrepreneurship Mobile Marketing Marketing E-commerce Product Marketing Web Analytics Search Advertising Marketing Research Marketing Strategy Sales Salesforce.com See 5+     See less Digital Marketing Online Advertising Google Adwords Display Advertising Digital Strategy Online Marketing SEM B2B Direct Marketing Entrepreneurship Mobile Marketing Marketing E-commerce Product Marketing Web Analytics Search Advertising Marketing Research Marketing Strategy Sales Salesforce.com See 5+     See less Education University of Pennsylvania - The Wharton School Certificate of Marketing, Executive Education program 2013  – 2013 Wake Forest University School of Business Master of Business Administration (M.B.A.) 2005  – 2006 KEDGE Business School Master’s Degree 2002  – 2004 University of Pennsylvania - The Wharton School Certificate of Marketing, Executive Education program 2013  – 2013 University of Pennsylvania - The Wharton School Certificate of Marketing, Executive Education program 2013  – 2013 University of Pennsylvania - The Wharton School Certificate of Marketing, Executive Education program 2013  – 2013 Wake Forest University School of Business Master of Business Administration (M.B.A.) 2005  – 2006 Wake Forest University School of Business Master of Business Administration (M.B.A.) 2005  – 2006 Wake Forest University School of Business Master of Business Administration (M.B.A.) 2005  – 2006 KEDGE Business School Master’s Degree 2002  – 2004 KEDGE Business School Master’s Degree 2002  – 2004 KEDGE Business School Master’s Degree 2002  – 2004 ", "Languages Greek Spanish Greek Spanish Greek Spanish Skills Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less Skills  Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less ", "Summary I am committed to achieve great results in business and life.  \n \nHigh achiever, international, business developer and partner. I am engaged to drive fantastic ideas to execution. I have a solid track record of this including several projects I have led in all the companies I have been working in. \n \nToday on one side I am concentrating on closing the digital knowledge gap of companies operating and launching from small markets, and hence empowering them to gain competitive edge through e-commerce. On the other side I work on leading the scaling of the digital strategies of companies working with Google towards their sales & marketing success. \n \nEnjoying high speeds and nature, my main hobbies are sailing with small catamarans and going off-piste with a good team of friends on the most beautiful mountains of the world. \n \nI always try to be surrounded by people who are better than I am, in all areas of life and business, because this is the only way for continuous personal growth. \n \nSpecialties:  \n \n- Leadership, Team management and coaching \n- Large Customer Sales & exciting customers \n- Project Management \n- Financial and Competitive analysis \n- Monetization of services products \n- Online marketing management \n- Management control and finance \n- Seeking high winds and Pitchpoling at high speeds with catamarans Summary I am committed to achieve great results in business and life.  \n \nHigh achiever, international, business developer and partner. I am engaged to drive fantastic ideas to execution. I have a solid track record of this including several projects I have led in all the companies I have been working in. \n \nToday on one side I am concentrating on closing the digital knowledge gap of companies operating and launching from small markets, and hence empowering them to gain competitive edge through e-commerce. On the other side I work on leading the scaling of the digital strategies of companies working with Google towards their sales & marketing success. \n \nEnjoying high speeds and nature, my main hobbies are sailing with small catamarans and going off-piste with a good team of friends on the most beautiful mountains of the world. \n \nI always try to be surrounded by people who are better than I am, in all areas of life and business, because this is the only way for continuous personal growth. \n \nSpecialties:  \n \n- Leadership, Team management and coaching \n- Large Customer Sales & exciting customers \n- Project Management \n- Financial and Competitive analysis \n- Monetization of services products \n- Online marketing management \n- Management control and finance \n- Seeking high winds and Pitchpoling at high speeds with catamarans I am committed to achieve great results in business and life.  \n \nHigh achiever, international, business developer and partner. I am engaged to drive fantastic ideas to execution. I have a solid track record of this including several projects I have led in all the companies I have been working in. \n \nToday on one side I am concentrating on closing the digital knowledge gap of companies operating and launching from small markets, and hence empowering them to gain competitive edge through e-commerce. On the other side I work on leading the scaling of the digital strategies of companies working with Google towards their sales & marketing success. \n \nEnjoying high speeds and nature, my main hobbies are sailing with small catamarans and going off-piste with a good team of friends on the most beautiful mountains of the world. \n \nI always try to be surrounded by people who are better than I am, in all areas of life and business, because this is the only way for continuous personal growth. \n \nSpecialties:  \n \n- Leadership, Team management and coaching \n- Large Customer Sales & exciting customers \n- Project Management \n- Financial and Competitive analysis \n- Monetization of services products \n- Online marketing management \n- Management control and finance \n- Seeking high winds and Pitchpoling at high speeds with catamarans I am committed to achieve great results in business and life.  \n \nHigh achiever, international, business developer and partner. I am engaged to drive fantastic ideas to execution. I have a solid track record of this including several projects I have led in all the companies I have been working in. \n \nToday on one side I am concentrating on closing the digital knowledge gap of companies operating and launching from small markets, and hence empowering them to gain competitive edge through e-commerce. On the other side I work on leading the scaling of the digital strategies of companies working with Google towards their sales & marketing success. \n \nEnjoying high speeds and nature, my main hobbies are sailing with small catamarans and going off-piste with a good team of friends on the most beautiful mountains of the world. \n \nI always try to be surrounded by people who are better than I am, in all areas of life and business, because this is the only way for continuous personal growth. \n \nSpecialties:  \n \n- Leadership, Team management and coaching \n- Large Customer Sales & exciting customers \n- Project Management \n- Financial and Competitive analysis \n- Monetization of services products \n- Online marketing management \n- Management control and finance \n- Seeking high winds and Pitchpoling at high speeds with catamarans Experience Industry Manager Google August 2015  – Present (1 month) Singapore Manager, Large Customer Sales, Benelux Google July 2013  – Present (2 years 2 months) Dublin, Ireland Heading the account management team of Large Customer Sales (LCS) Belgium, to ensure that quarterly sales targets are met. Member of Benelux LCS management team. \n \nOther roles include working on specific customer projects and driving various initiatives across the Benelux team. \n \nBased in Google's EU Headquarters in Dublin, Ireland. Sales Mentoring Programme Manager - Business side Lead Google December 2013  –  2015  (2 years) Dublin -Leading the Dublin Google Sales Mentoring Programme - ensuring all LCS Sales Nooglers (New Googlers) get a unified and equal sales learning experience during their first months at Google. \n \n-Heading the Dublin Google Sales Mentoring Organization (60 ppl organization) \n \n-Managing the development of the programme through a 12 people leadership team Team Lead, Large Customer Sales, Finland Google August 2012  –  July 2013  (1 year) Dublin, Ireland -Manager of a team of 5 Account Managers covering the large customers of Finland \n \n-Member of the Nordic/Benelux Management team \n \n-Senior Account Manager responsibilities for the main Finnish clients in the finance sector \n \n-Co-founder, Project manager & main adviser for the Google Digital Excellence Program  \n \n-Winner of the Google EMEA HQ X-market collaboration award of 2012 Senior Account Manager Google December 2010  –  August 2012  (1 year 9 months) Dublin, Ireland I [am]: \n \n- Developing Financial Services and Branding clients for Finland.  \n \n- Part of the Extended Management Team for the Nordics \n \n- Winner of the Google 2011 best innovation in Sales Award (Benelux, DACH, UK&I and the Nordics) \n \n- Building relationships with C-level persons from client organizations, evangelizing the power of digital in making their organizations even more successful \n \n- Develop sales and marketing strategies for clients, drive client growth either directly or in relationship with local media agencies \n \n- Consult and drive client growth locally and internationally with the means of Internet and Google - finding and allocating the right resources (tools and people) for clients to be able to launch internationally quickly and efficiently around the globe \n \n-Managing the Google Digital Excellence program aiming at helping clients to become market leaders in digital knowledge and usage  \n \n-Coaching team members to achieve even better sales results on a weekly basis Client manager & Account Analyst American Express June 2006  –  November 2010  (4 years 6 months) Helsinki, Finland -Leadership responsibility for core merchant relationship project (recruiting, planning, setting targets, supervising). Managing 2 (external) team members over a period of 18 months.  \n \n-Responsible for strategic national accounts.  \n \n-Excellent results on client re-negotiations (100%), rate retention (170% vs. target), non-traditional revenue capture \n \n-Developing partnerships through marketing and other joint activities.  \n \n-Responsible for small merchant base clients’ mass management process \n \n-Cost analysis, forecasts, client’s card member segmentation, revenue and, mkt. performance analysis & reporting \n \n-Piloting new monetized business insights products for small merchant base, creating new sales channels  \n \n-Directing a Master’s Thesis on the impact of the Payment Services Directive to the Finnish market. Pricing Manager - Secondment American Express March 2010  –  September 2010  (7 months) London, United Kingdom -EMEA Revenue Management Team  \n \n-In charge of France (all industries) and Travel Europe Revenue Management & Pricing \n \n-Cooperation with EMEA Client Managers and French Senior Management, Acquisition and Client Management \n \n-Supervision of the client management team (+10 ppl) from the revenue point of view  \n \n-Develop, test, & implement new pricing structures which grow merchant revenues, whilst supporting satisfaction Project Planner Arsnet May 2006  –  June 2006  (2 months) Turku, Finland -Project Planner for a non-profit web gallery / arts-portal (6 weeks) \n-In charge of building a business plan – cost studies, pricing Product Manager intern and Controlling intern Henkel Norden May 2005  –  November 2005  (7 months) Stockholm, Sweden Henkel Norden AB, STOCKHOLM - Sweden:  \n \n-Product Manager Intern (50%) In charge of a product-line re-launch for Schwarzkopf  \n-Controller Intern (50%) Budgeting, sales estimations, P&L-scenarios, reporting  \n-Intensive Cooperation with Germany (headquarters) and Slovenia (manufacturing) Thesis worker Henkel Norden June 2004  –  September 2004  (4 months) Helsinki, Finland Henkel Norden Oy, HELSINKI – Finland:  \n \n-Marketing, in charge of conducting a market opportunity study for a consumer product  \n-Data-analysis from ACNielsen databases \n-Cooperation with several countries: France, Great Britain, Denmark, Germany Intern Henkel Iberica June 2003  –  August 2003  (3 months) Barcelona, Spain Henkel Iberica SA, BARCELONA – Spain: \n \n-I worked as an intern and was in charge of a product re-launch and helped in daily tasks \n-Cooperation with manufacturing, financial services and other Henkel offices Intern Saint-Gobain June 2002  –  July 2002  (2 months) Izmir, Turkey Saint-Gobain Weber-Markem, IZMIR – Turkey:  \n \n-Design of a product cost follow up system with which the company could follow its cost structure for each product in each region in Turkey and abroad. \n-Cooperation with marketing, logistics, production and R&D Industry Manager Google August 2015  – Present (1 month) Singapore Industry Manager Google August 2015  – Present (1 month) Singapore Manager, Large Customer Sales, Benelux Google July 2013  – Present (2 years 2 months) Dublin, Ireland Heading the account management team of Large Customer Sales (LCS) Belgium, to ensure that quarterly sales targets are met. Member of Benelux LCS management team. \n \nOther roles include working on specific customer projects and driving various initiatives across the Benelux team. \n \nBased in Google's EU Headquarters in Dublin, Ireland. Manager, Large Customer Sales, Benelux Google July 2013  – Present (2 years 2 months) Dublin, Ireland Heading the account management team of Large Customer Sales (LCS) Belgium, to ensure that quarterly sales targets are met. Member of Benelux LCS management team. \n \nOther roles include working on specific customer projects and driving various initiatives across the Benelux team. \n \nBased in Google's EU Headquarters in Dublin, Ireland. Sales Mentoring Programme Manager - Business side Lead Google December 2013  –  2015  (2 years) Dublin -Leading the Dublin Google Sales Mentoring Programme - ensuring all LCS Sales Nooglers (New Googlers) get a unified and equal sales learning experience during their first months at Google. \n \n-Heading the Dublin Google Sales Mentoring Organization (60 ppl organization) \n \n-Managing the development of the programme through a 12 people leadership team Sales Mentoring Programme Manager - Business side Lead Google December 2013  –  2015  (2 years) Dublin -Leading the Dublin Google Sales Mentoring Programme - ensuring all LCS Sales Nooglers (New Googlers) get a unified and equal sales learning experience during their first months at Google. \n \n-Heading the Dublin Google Sales Mentoring Organization (60 ppl organization) \n \n-Managing the development of the programme through a 12 people leadership team Team Lead, Large Customer Sales, Finland Google August 2012  –  July 2013  (1 year) Dublin, Ireland -Manager of a team of 5 Account Managers covering the large customers of Finland \n \n-Member of the Nordic/Benelux Management team \n \n-Senior Account Manager responsibilities for the main Finnish clients in the finance sector \n \n-Co-founder, Project manager & main adviser for the Google Digital Excellence Program  \n \n-Winner of the Google EMEA HQ X-market collaboration award of 2012 Team Lead, Large Customer Sales, Finland Google August 2012  –  July 2013  (1 year) Dublin, Ireland -Manager of a team of 5 Account Managers covering the large customers of Finland \n \n-Member of the Nordic/Benelux Management team \n \n-Senior Account Manager responsibilities for the main Finnish clients in the finance sector \n \n-Co-founder, Project manager & main adviser for the Google Digital Excellence Program  \n \n-Winner of the Google EMEA HQ X-market collaboration award of 2012 Senior Account Manager Google December 2010  –  August 2012  (1 year 9 months) Dublin, Ireland I [am]: \n \n- Developing Financial Services and Branding clients for Finland.  \n \n- Part of the Extended Management Team for the Nordics \n \n- Winner of the Google 2011 best innovation in Sales Award (Benelux, DACH, UK&I and the Nordics) \n \n- Building relationships with C-level persons from client organizations, evangelizing the power of digital in making their organizations even more successful \n \n- Develop sales and marketing strategies for clients, drive client growth either directly or in relationship with local media agencies \n \n- Consult and drive client growth locally and internationally with the means of Internet and Google - finding and allocating the right resources (tools and people) for clients to be able to launch internationally quickly and efficiently around the globe \n \n-Managing the Google Digital Excellence program aiming at helping clients to become market leaders in digital knowledge and usage  \n \n-Coaching team members to achieve even better sales results on a weekly basis Senior Account Manager Google December 2010  –  August 2012  (1 year 9 months) Dublin, Ireland I [am]: \n \n- Developing Financial Services and Branding clients for Finland.  \n \n- Part of the Extended Management Team for the Nordics \n \n- Winner of the Google 2011 best innovation in Sales Award (Benelux, DACH, UK&I and the Nordics) \n \n- Building relationships with C-level persons from client organizations, evangelizing the power of digital in making their organizations even more successful \n \n- Develop sales and marketing strategies for clients, drive client growth either directly or in relationship with local media agencies \n \n- Consult and drive client growth locally and internationally with the means of Internet and Google - finding and allocating the right resources (tools and people) for clients to be able to launch internationally quickly and efficiently around the globe \n \n-Managing the Google Digital Excellence program aiming at helping clients to become market leaders in digital knowledge and usage  \n \n-Coaching team members to achieve even better sales results on a weekly basis Client manager & Account Analyst American Express June 2006  –  November 2010  (4 years 6 months) Helsinki, Finland -Leadership responsibility for core merchant relationship project (recruiting, planning, setting targets, supervising). Managing 2 (external) team members over a period of 18 months.  \n \n-Responsible for strategic national accounts.  \n \n-Excellent results on client re-negotiations (100%), rate retention (170% vs. target), non-traditional revenue capture \n \n-Developing partnerships through marketing and other joint activities.  \n \n-Responsible for small merchant base clients’ mass management process \n \n-Cost analysis, forecasts, client’s card member segmentation, revenue and, mkt. performance analysis & reporting \n \n-Piloting new monetized business insights products for small merchant base, creating new sales channels  \n \n-Directing a Master’s Thesis on the impact of the Payment Services Directive to the Finnish market. Client manager & Account Analyst American Express June 2006  –  November 2010  (4 years 6 months) Helsinki, Finland -Leadership responsibility for core merchant relationship project (recruiting, planning, setting targets, supervising). Managing 2 (external) team members over a period of 18 months.  \n \n-Responsible for strategic national accounts.  \n \n-Excellent results on client re-negotiations (100%), rate retention (170% vs. target), non-traditional revenue capture \n \n-Developing partnerships through marketing and other joint activities.  \n \n-Responsible for small merchant base clients’ mass management process \n \n-Cost analysis, forecasts, client’s card member segmentation, revenue and, mkt. performance analysis & reporting \n \n-Piloting new monetized business insights products for small merchant base, creating new sales channels  \n \n-Directing a Master’s Thesis on the impact of the Payment Services Directive to the Finnish market. Pricing Manager - Secondment American Express March 2010  –  September 2010  (7 months) London, United Kingdom -EMEA Revenue Management Team  \n \n-In charge of France (all industries) and Travel Europe Revenue Management & Pricing \n \n-Cooperation with EMEA Client Managers and French Senior Management, Acquisition and Client Management \n \n-Supervision of the client management team (+10 ppl) from the revenue point of view  \n \n-Develop, test, & implement new pricing structures which grow merchant revenues, whilst supporting satisfaction Pricing Manager - Secondment American Express March 2010  –  September 2010  (7 months) London, United Kingdom -EMEA Revenue Management Team  \n \n-In charge of France (all industries) and Travel Europe Revenue Management & Pricing \n \n-Cooperation with EMEA Client Managers and French Senior Management, Acquisition and Client Management \n \n-Supervision of the client management team (+10 ppl) from the revenue point of view  \n \n-Develop, test, & implement new pricing structures which grow merchant revenues, whilst supporting satisfaction Project Planner Arsnet May 2006  –  June 2006  (2 months) Turku, Finland -Project Planner for a non-profit web gallery / arts-portal (6 weeks) \n-In charge of building a business plan – cost studies, pricing Project Planner Arsnet May 2006  –  June 2006  (2 months) Turku, Finland -Project Planner for a non-profit web gallery / arts-portal (6 weeks) \n-In charge of building a business plan – cost studies, pricing Product Manager intern and Controlling intern Henkel Norden May 2005  –  November 2005  (7 months) Stockholm, Sweden Henkel Norden AB, STOCKHOLM - Sweden:  \n \n-Product Manager Intern (50%) In charge of a product-line re-launch for Schwarzkopf  \n-Controller Intern (50%) Budgeting, sales estimations, P&L-scenarios, reporting  \n-Intensive Cooperation with Germany (headquarters) and Slovenia (manufacturing) Product Manager intern and Controlling intern Henkel Norden May 2005  –  November 2005  (7 months) Stockholm, Sweden Henkel Norden AB, STOCKHOLM - Sweden:  \n \n-Product Manager Intern (50%) In charge of a product-line re-launch for Schwarzkopf  \n-Controller Intern (50%) Budgeting, sales estimations, P&L-scenarios, reporting  \n-Intensive Cooperation with Germany (headquarters) and Slovenia (manufacturing) Thesis worker Henkel Norden June 2004  –  September 2004  (4 months) Helsinki, Finland Henkel Norden Oy, HELSINKI – Finland:  \n \n-Marketing, in charge of conducting a market opportunity study for a consumer product  \n-Data-analysis from ACNielsen databases \n-Cooperation with several countries: France, Great Britain, Denmark, Germany Thesis worker Henkel Norden June 2004  –  September 2004  (4 months) Helsinki, Finland Henkel Norden Oy, HELSINKI – Finland:  \n \n-Marketing, in charge of conducting a market opportunity study for a consumer product  \n-Data-analysis from ACNielsen databases \n-Cooperation with several countries: France, Great Britain, Denmark, Germany Intern Henkel Iberica June 2003  –  August 2003  (3 months) Barcelona, Spain Henkel Iberica SA, BARCELONA – Spain: \n \n-I worked as an intern and was in charge of a product re-launch and helped in daily tasks \n-Cooperation with manufacturing, financial services and other Henkel offices Intern Henkel Iberica June 2003  –  August 2003  (3 months) Barcelona, Spain Henkel Iberica SA, BARCELONA – Spain: \n \n-I worked as an intern and was in charge of a product re-launch and helped in daily tasks \n-Cooperation with manufacturing, financial services and other Henkel offices Intern Saint-Gobain June 2002  –  July 2002  (2 months) Izmir, Turkey Saint-Gobain Weber-Markem, IZMIR – Turkey:  \n \n-Design of a product cost follow up system with which the company could follow its cost structure for each product in each region in Turkey and abroad. \n-Cooperation with marketing, logistics, production and R&D Intern Saint-Gobain June 2002  –  July 2002  (2 months) Izmir, Turkey Saint-Gobain Weber-Markem, IZMIR – Turkey:  \n \n-Design of a product cost follow up system with which the company could follow its cost structure for each product in each region in Turkey and abroad. \n-Cooperation with marketing, logistics, production and R&D Languages English Native or bilingual proficiency Finnish Native or bilingual proficiency French Native or bilingual proficiency Spanish Professional working proficiency Swedish Professional working proficiency English Native or bilingual proficiency Finnish Native or bilingual proficiency French Native or bilingual proficiency Spanish Professional working proficiency Swedish Professional working proficiency English Native or bilingual proficiency Finnish Native or bilingual proficiency French Native or bilingual proficiency Spanish Professional working proficiency Swedish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Online Advertising Management Sales Management Team Management Online Marketing Account Management Marketing Strategy Mobile Marketing Marketing Business Strategy Digital Marketing Market Research Leadership Advertising SEM French Customer Relations Customer Engagement Google Adwords International Business Pricing Strategy Customer Service Sales Presentations Direct Sales Value Propositions Advertising Sales Market Planning English Virtual Teams Increasing Sales VBA Spanish Value Selling Value Proposition Mobile Internet Client Development Client Engagement Mentoring Excel Revenue Management Revenue Forecasting Increasing Revenues Swedish Finnish University Teaching Sailing Skiing Financial Control Cost Analysis Internet See 35+     See less Skills  Online Advertising Management Sales Management Team Management Online Marketing Account Management Marketing Strategy Mobile Marketing Marketing Business Strategy Digital Marketing Market Research Leadership Advertising SEM French Customer Relations Customer Engagement Google Adwords International Business Pricing Strategy Customer Service Sales Presentations Direct Sales Value Propositions Advertising Sales Market Planning English Virtual Teams Increasing Sales VBA Spanish Value Selling Value Proposition Mobile Internet Client Development Client Engagement Mentoring Excel Revenue Management Revenue Forecasting Increasing Revenues Swedish Finnish University Teaching Sailing Skiing Financial Control Cost Analysis Internet See 35+     See less Online Advertising Management Sales Management Team Management Online Marketing Account Management Marketing Strategy Mobile Marketing Marketing Business Strategy Digital Marketing Market Research Leadership Advertising SEM French Customer Relations Customer Engagement Google Adwords International Business Pricing Strategy Customer Service Sales Presentations Direct Sales Value Propositions Advertising Sales Market Planning English Virtual Teams Increasing Sales VBA Spanish Value Selling Value Proposition Mobile Internet Client Development Client Engagement Mentoring Excel Revenue Management Revenue Forecasting Increasing Revenues Swedish Finnish University Teaching Sailing Skiing Financial Control Cost Analysis Internet See 35+     See less Online Advertising Management Sales Management Team Management Online Marketing Account Management Marketing Strategy Mobile Marketing Marketing Business Strategy Digital Marketing Market Research Leadership Advertising SEM French Customer Relations Customer Engagement Google Adwords International Business Pricing Strategy Customer Service Sales Presentations Direct Sales Value Propositions Advertising Sales Market Planning English Virtual Teams Increasing Sales VBA Spanish Value Selling Value Proposition Mobile Internet Client Development Client Engagement Mentoring Excel Revenue Management Revenue Forecasting Increasing Revenues Swedish Finnish University Teaching Sailing Skiing Financial Control Cost Analysis Internet See 35+     See less Education Duke Corporate Education - Google Business Academy Business Administration and Management , General 2014  – 2015 Invitation only Google training program. \n \nThe Google Business Academy is a global, 9 month programme consisting of 4 modules in the U.S. and Europe. It consists of a combination of Duke CE faculty delivered lectures, simulations, case studies, workshops, pitch practices and group work touching all fields of management. \n \nDuke CE ranked #1 in the world in Custom Executive Education by Financial Times and BusinessWeek for eleven years, 2003 – 2014 EDHEC Business School Specialized Master,  Accounting and Finance 2004  – 2005 - Specialized Master’s Degree in Management control \n- Management control, Consolidation, Audit, Investments, International Finance \n- Thesis written at the Stockholm School of Economics, STOCKHOLM - Sweden Turku School of Economics Master of Science,  International business ,  Accounting ,  Economics 2000  – 2004 Turku School of Economics, TURKU - Finland \n- Master of Science degree (M.Sc) in International Business \n- Major in marketing & strategy – thesis awarded with honors (Eximia) \n- Minors: Accounting and Economics Universidad Carlos III de Madrid Exchange Student,  Economics ,  Marketing 2002  – 2003 Economics and Marketing Duke Corporate Education - Google Business Academy Business Administration and Management , General 2014  – 2015 Invitation only Google training program. \n \nThe Google Business Academy is a global, 9 month programme consisting of 4 modules in the U.S. and Europe. It consists of a combination of Duke CE faculty delivered lectures, simulations, case studies, workshops, pitch practices and group work touching all fields of management. \n \nDuke CE ranked #1 in the world in Custom Executive Education by Financial Times and BusinessWeek for eleven years, 2003 – 2014 Duke Corporate Education - Google Business Academy Business Administration and Management , General 2014  – 2015 Invitation only Google training program. \n \nThe Google Business Academy is a global, 9 month programme consisting of 4 modules in the U.S. and Europe. It consists of a combination of Duke CE faculty delivered lectures, simulations, case studies, workshops, pitch practices and group work touching all fields of management. \n \nDuke CE ranked #1 in the world in Custom Executive Education by Financial Times and BusinessWeek for eleven years, 2003 – 2014 Duke Corporate Education - Google Business Academy Business Administration and Management , General 2014  – 2015 Invitation only Google training program. \n \nThe Google Business Academy is a global, 9 month programme consisting of 4 modules in the U.S. and Europe. It consists of a combination of Duke CE faculty delivered lectures, simulations, case studies, workshops, pitch practices and group work touching all fields of management. \n \nDuke CE ranked #1 in the world in Custom Executive Education by Financial Times and BusinessWeek for eleven years, 2003 – 2014 EDHEC Business School Specialized Master,  Accounting and Finance 2004  – 2005 - Specialized Master’s Degree in Management control \n- Management control, Consolidation, Audit, Investments, International Finance \n- Thesis written at the Stockholm School of Economics, STOCKHOLM - Sweden EDHEC Business School Specialized Master,  Accounting and Finance 2004  – 2005 - Specialized Master’s Degree in Management control \n- Management control, Consolidation, Audit, Investments, International Finance \n- Thesis written at the Stockholm School of Economics, STOCKHOLM - Sweden EDHEC Business School Specialized Master,  Accounting and Finance 2004  – 2005 - Specialized Master’s Degree in Management control \n- Management control, Consolidation, Audit, Investments, International Finance \n- Thesis written at the Stockholm School of Economics, STOCKHOLM - Sweden Turku School of Economics Master of Science,  International business ,  Accounting ,  Economics 2000  – 2004 Turku School of Economics, TURKU - Finland \n- Master of Science degree (M.Sc) in International Business \n- Major in marketing & strategy – thesis awarded with honors (Eximia) \n- Minors: Accounting and Economics Turku School of Economics Master of Science,  International business ,  Accounting ,  Economics 2000  – 2004 Turku School of Economics, TURKU - Finland \n- Master of Science degree (M.Sc) in International Business \n- Major in marketing & strategy – thesis awarded with honors (Eximia) \n- Minors: Accounting and Economics Turku School of Economics Master of Science,  International business ,  Accounting ,  Economics 2000  – 2004 Turku School of Economics, TURKU - Finland \n- Master of Science degree (M.Sc) in International Business \n- Major in marketing & strategy – thesis awarded with honors (Eximia) \n- Minors: Accounting and Economics Universidad Carlos III de Madrid Exchange Student,  Economics ,  Marketing 2002  – 2003 Economics and Marketing Universidad Carlos III de Madrid Exchange Student,  Economics ,  Marketing 2002  – 2003 Economics and Marketing Universidad Carlos III de Madrid Exchange Student,  Economics ,  Marketing 2002  – 2003 Economics and Marketing Honors & Awards Additional Honors & Awards Winner of the Google 2012 best cross collaboration in Sales award with the Digital Excellence Program (Benelux, DACH, UK&I, France and the Nordics) \n \nWinner of the Google 2011 best innovation in Sales Award with the project Smartbid (Benelux, DACH, UK&I and the Nordics) \n \nNordics best practice award 2012 for the Finnish Acceleration Program Additional Honors & Awards Winner of the Google 2012 best cross collaboration in Sales award with the Digital Excellence Program (Benelux, DACH, UK&I, France and the Nordics) \n \nWinner of the Google 2011 best innovation in Sales Award with the project Smartbid (Benelux, DACH, UK&I and the Nordics) \n \nNordics best practice award 2012 for the Finnish Acceleration Program Additional Honors & Awards Winner of the Google 2012 best cross collaboration in Sales award with the Digital Excellence Program (Benelux, DACH, UK&I, France and the Nordics) \n \nWinner of the Google 2011 best innovation in Sales Award with the project Smartbid (Benelux, DACH, UK&I and the Nordics) \n \nNordics best practice award 2012 for the Finnish Acceleration Program Additional Honors & Awards Winner of the Google 2012 best cross collaboration in Sales award with the Digital Excellence Program (Benelux, DACH, UK&I, France and the Nordics) \n \nWinner of the Google 2011 best innovation in Sales Award with the project Smartbid (Benelux, DACH, UK&I and the Nordics) \n \nNordics best practice award 2012 for the Finnish Acceleration Program ", "Languages French French French Skills Strategic Partnerships Business Strategy New Business Development Strategy Development Marketing Strategy Sales Management Organizational Design Driving Revenue Partnership Development Partnership Management Strategy Digital Media Cross-functional Team... Budgets Enterprise Software Team Management Partnerships Negotiation Business Alliances Sales Operations Contract Negotiation Partner Management Product Marketing Team Leadership Product Launch Management Strategic Planning Online Advertising Go-to-market Strategy E-commerce Mobile Devices Channel Partners Business Development Digital Marketing Product Development Advertising Sales Leadership Selling Cloud Computing Building Relationships Mobile Applications Monetization Executive Management Product Management Lead Generation See 31+     See less Skills  Strategic Partnerships Business Strategy New Business Development Strategy Development Marketing Strategy Sales Management Organizational Design Driving Revenue Partnership Development Partnership Management Strategy Digital Media Cross-functional Team... Budgets Enterprise Software Team Management Partnerships Negotiation Business Alliances Sales Operations Contract Negotiation Partner Management Product Marketing Team Leadership Product Launch Management Strategic Planning Online Advertising Go-to-market Strategy E-commerce Mobile Devices Channel Partners Business Development Digital Marketing Product Development Advertising Sales Leadership Selling Cloud Computing Building Relationships Mobile Applications Monetization Executive Management Product Management Lead Generation See 31+     See less Strategic Partnerships Business Strategy New Business Development Strategy Development Marketing Strategy Sales Management Organizational Design Driving Revenue Partnership Development Partnership Management Strategy Digital Media Cross-functional Team... Budgets Enterprise Software Team Management Partnerships Negotiation Business Alliances Sales Operations Contract Negotiation Partner Management Product Marketing Team Leadership Product Launch Management Strategic Planning Online Advertising Go-to-market Strategy E-commerce Mobile Devices Channel Partners Business Development Digital Marketing Product Development Advertising Sales Leadership Selling Cloud Computing Building Relationships Mobile Applications Monetization Executive Management Product Management Lead Generation See 31+     See less Strategic Partnerships Business Strategy New Business Development Strategy Development Marketing Strategy Sales Management Organizational Design Driving Revenue Partnership Development Partnership Management Strategy Digital Media Cross-functional Team... Budgets Enterprise Software Team Management Partnerships Negotiation Business Alliances Sales Operations Contract Negotiation Partner Management Product Marketing Team Leadership Product Launch Management Strategic Planning Online Advertising Go-to-market Strategy E-commerce Mobile Devices Channel Partners Business Development Digital Marketing Product Development Advertising Sales Leadership Selling Cloud Computing Building Relationships Mobile Applications Monetization Executive Management Product Management Lead Generation See 31+     See less ", "Experience Manager- Large Customer Sales- Italy (LeadGen & FinTec) Google 2015  – Present (less than a year) Dublin Manager- Large Customer Sales- Italy (LeadGen & Finance) Google 2014  – Present (1 year) Dublin Manager-Sales Support, BIM, Social & Info, Performance Google 2014  –  2014  (less than a year) Hyderabad Manager-Sales Support, Business & Industrial Markets Google 2012  –  2014  (2 years) Manager-Sales Support, BIM, Social & Info Google 2012  –  2014  (2 years) Manager-Online Sales, Financial Services Google 2010  –  2011  (1 year) Intern American Express May 2010  –  August 2010  (4 months) Graduate Student National University of Singapore 2009  –  2010  (1 year) Full time MBA Head-Business and Relationship Development Alcyon Engg. Pvt. Ltd. 2004  –  2009  (5 years) Research Assistant The University of Texas at Austin 2001  –  2002  (1 year) Manager- Large Customer Sales- Italy (LeadGen & FinTec) Google 2015  – Present (less than a year) Dublin Manager- Large Customer Sales- Italy (LeadGen & FinTec) Google 2015  – Present (less than a year) Dublin Manager- Large Customer Sales- Italy (LeadGen & Finance) Google 2014  – Present (1 year) Dublin Manager- Large Customer Sales- Italy (LeadGen & Finance) Google 2014  – Present (1 year) Dublin Manager-Sales Support, BIM, Social & Info, Performance Google 2014  –  2014  (less than a year) Hyderabad Manager-Sales Support, BIM, Social & Info, Performance Google 2014  –  2014  (less than a year) Hyderabad Manager-Sales Support, Business & Industrial Markets Google 2012  –  2014  (2 years) Manager-Sales Support, Business & Industrial Markets Google 2012  –  2014  (2 years) Manager-Sales Support, BIM, Social & Info Google 2012  –  2014  (2 years) Manager-Sales Support, BIM, Social & Info Google 2012  –  2014  (2 years) Manager-Online Sales, Financial Services Google 2010  –  2011  (1 year) Manager-Online Sales, Financial Services Google 2010  –  2011  (1 year) Intern American Express May 2010  –  August 2010  (4 months) Intern American Express May 2010  –  August 2010  (4 months) Graduate Student National University of Singapore 2009  –  2010  (1 year) Full time MBA Graduate Student National University of Singapore 2009  –  2010  (1 year) Full time MBA Head-Business and Relationship Development Alcyon Engg. Pvt. Ltd. 2004  –  2009  (5 years) Head-Business and Relationship Development Alcyon Engg. Pvt. Ltd. 2004  –  2009  (5 years) Research Assistant The University of Texas at Austin 2001  –  2002  (1 year) Research Assistant The University of Texas at Austin 2001  –  2002  (1 year) Skills Business Strategy Project Management Market Research Data Analysis Business Development Strategy Competitive Analysis Management Consulting Product Development Business Analysis Program Management Entrepreneurship Business Analytics Market Analysis Consulting Strategic Planning Thought Leadership Programming Enterprise Software Software Design Product Management UGS NX5 Product Design AutoCAD Innovation Management Strategic Thinking Process Engineering Direct Marketing Systems Thinking Creative Direction CAE CAD Marketing Communications Parametric Design Ideas NX Analytics Predictive Analytics Direct Sales Design Thinking Corporate Finance Marketing Research Thinking Outside The Box Solid Edge Requirements Analysis Distributed Systems Visionary Thinking Communications Audits Economics Statistics Data Mining See 35+     See less Skills  Business Strategy Project Management Market Research Data Analysis Business Development Strategy Competitive Analysis Management Consulting Product Development Business Analysis Program Management Entrepreneurship Business Analytics Market Analysis Consulting Strategic Planning Thought Leadership Programming Enterprise Software Software Design Product Management UGS NX5 Product Design AutoCAD Innovation Management Strategic Thinking Process Engineering Direct Marketing Systems Thinking Creative Direction CAE CAD Marketing Communications Parametric Design Ideas NX Analytics Predictive Analytics Direct Sales Design Thinking Corporate Finance Marketing Research Thinking Outside The Box Solid Edge Requirements Analysis Distributed Systems Visionary Thinking Communications Audits Economics Statistics Data Mining See 35+     See less Business Strategy Project Management Market Research Data Analysis Business Development Strategy Competitive Analysis Management Consulting Product Development Business Analysis Program Management Entrepreneurship Business Analytics Market Analysis Consulting Strategic Planning Thought Leadership Programming Enterprise Software Software Design Product Management UGS NX5 Product Design AutoCAD Innovation Management Strategic Thinking Process Engineering Direct Marketing Systems Thinking Creative Direction CAE CAD Marketing Communications Parametric Design Ideas NX Analytics Predictive Analytics Direct Sales Design Thinking Corporate Finance Marketing Research Thinking Outside The Box Solid Edge Requirements Analysis Distributed Systems Visionary Thinking Communications Audits Economics Statistics Data Mining See 35+     See less Business Strategy Project Management Market Research Data Analysis Business Development Strategy Competitive Analysis Management Consulting Product Development Business Analysis Program Management Entrepreneurship Business Analytics Market Analysis Consulting Strategic Planning Thought Leadership Programming Enterprise Software Software Design Product Management UGS NX5 Product Design AutoCAD Innovation Management Strategic Thinking Process Engineering Direct Marketing Systems Thinking Creative Direction CAE CAD Marketing Communications Parametric Design Ideas NX Analytics Predictive Analytics Direct Sales Design Thinking Corporate Finance Marketing Research Thinking Outside The Box Solid Edge Requirements Analysis Distributed Systems Visionary Thinking Communications Audits Economics Statistics Data Mining See 35+     See less Education National University of Singapore MBA 2009  – 2010 The University of Texas at Austin MS,  Mechanical Engineering 2000  – 2002 Indian Institute of Technology, Bombay B. Tech.,  Mechanical Engineering 1996  – 2000 National University of Singapore MBA 2009  – 2010 National University of Singapore MBA 2009  – 2010 National University of Singapore MBA 2009  – 2010 The University of Texas at Austin MS,  Mechanical Engineering 2000  – 2002 The University of Texas at Austin MS,  Mechanical Engineering 2000  – 2002 The University of Texas at Austin MS,  Mechanical Engineering 2000  – 2002 Indian Institute of Technology, Bombay B. Tech.,  Mechanical Engineering 1996  – 2000 Indian Institute of Technology, Bombay B. Tech.,  Mechanical Engineering 1996  – 2000 Indian Institute of Technology, Bombay B. Tech.,  Mechanical Engineering 1996  – 2000 ", "Summary I am currently leading a large team of SMB Sales representatives and sales specialists, selling Google advertising products to the French Small Medium Business Channel. I have been involved in the development and execution of Google's outsourcing strategy both in the UK and in China. I have worked directly in Inside Sales across many sectors and I specialize in Internet advertising, sales and recruitment. I have managed small/large sales teams and support teams to large revenue targets. \n \nI currently have an EMEA wide responsibility to drive sales culture across SMB sales. \n \nSpecialties: Sales Excellence, Sales Management, Sales Culture, Advertising, Entrepreneurship, Change Management. Summary I am currently leading a large team of SMB Sales representatives and sales specialists, selling Google advertising products to the French Small Medium Business Channel. I have been involved in the development and execution of Google's outsourcing strategy both in the UK and in China. I have worked directly in Inside Sales across many sectors and I specialize in Internet advertising, sales and recruitment. I have managed small/large sales teams and support teams to large revenue targets. \n \nI currently have an EMEA wide responsibility to drive sales culture across SMB sales. \n \nSpecialties: Sales Excellence, Sales Management, Sales Culture, Advertising, Entrepreneurship, Change Management. I am currently leading a large team of SMB Sales representatives and sales specialists, selling Google advertising products to the French Small Medium Business Channel. I have been involved in the development and execution of Google's outsourcing strategy both in the UK and in China. I have worked directly in Inside Sales across many sectors and I specialize in Internet advertising, sales and recruitment. I have managed small/large sales teams and support teams to large revenue targets. \n \nI currently have an EMEA wide responsibility to drive sales culture across SMB sales. \n \nSpecialties: Sales Excellence, Sales Management, Sales Culture, Advertising, Entrepreneurship, Change Management. I am currently leading a large team of SMB Sales representatives and sales specialists, selling Google advertising products to the French Small Medium Business Channel. I have been involved in the development and execution of Google's outsourcing strategy both in the UK and in China. I have worked directly in Inside Sales across many sectors and I specialize in Internet advertising, sales and recruitment. I have managed small/large sales teams and support teams to large revenue targets. \n \nI currently have an EMEA wide responsibility to drive sales culture across SMB sales. \n \nSpecialties: Sales Excellence, Sales Management, Sales Culture, Advertising, Entrepreneurship, Change Management. Experience Sales Manager For France SMB Google January 2012  – Present (3 years 8 months) Managing and leading the French SMB team at Google. Creating quarterly sales strategies, exceeding all productivity and revenue sales targets. Re-shaping the global Google sales culture through innovative sales initiatives. Sales Manager For France SMB Google January 2012  – Present (3 years 8 months) Managing and leading the French SMB team at Google. Creating quarterly sales strategies, exceeding all productivity and revenue sales targets. Re-shaping the global Google sales culture through innovative sales initiatives. Sales Manager For France SMB Google January 2012  – Present (3 years 8 months) Managing and leading the French SMB team at Google. Creating quarterly sales strategies, exceeding all productivity and revenue sales targets. Re-shaping the global Google sales culture through innovative sales initiatives. Languages French Limited working proficiency German Limited working proficiency French Limited working proficiency German Limited working proficiency French Limited working proficiency German Limited working proficiency Limited working proficiency Limited working proficiency Skills Sales Management Sales Google Adwords PPC Online Advertising Advertising Digital Marketing Entrepreneurship SEM E-commerce Selling Marketing Strategy Lead Generation Search Advertising Account Management Team Management Management Online Marketing See 3+     See less Skills  Sales Management Sales Google Adwords PPC Online Advertising Advertising Digital Marketing Entrepreneurship SEM E-commerce Selling Marketing Strategy Lead Generation Search Advertising Account Management Team Management Management Online Marketing See 3+     See less Sales Management Sales Google Adwords PPC Online Advertising Advertising Digital Marketing Entrepreneurship SEM E-commerce Selling Marketing Strategy Lead Generation Search Advertising Account Management Team Management Management Online Marketing See 3+     See less Sales Management Sales Google Adwords PPC Online Advertising Advertising Digital Marketing Entrepreneurship SEM E-commerce Selling Marketing Strategy Lead Generation Search Advertising Account Management Team Management Management Online Marketing See 3+     See less Education Dublin City University B.Sc Management,  M.Sc in E- Commerce 2004  – 2005 Cholaiste Eoin Stillorgan Road Dublin Bachelor's degree,  Marketing/Marketing Management , General 1995  – 1999 Dublin City University B.Sc Management,  M.Sc in E- Commerce 2004  – 2005 Dublin City University B.Sc Management,  M.Sc in E- Commerce 2004  – 2005 Dublin City University B.Sc Management,  M.Sc in E- Commerce 2004  – 2005 Cholaiste Eoin Stillorgan Road Dublin Bachelor's degree,  Marketing/Marketing Management , General 1995  – 1999 Cholaiste Eoin Stillorgan Road Dublin Bachelor's degree,  Marketing/Marketing Management , General 1995  – 1999 Cholaiste Eoin Stillorgan Road Dublin Bachelor's degree,  Marketing/Marketing Management , General 1995  – 1999 Honors & Awards Global SMB VP Award Senior VP @ Google January 2013 Global recognition by a senior Vice President @ Google (Francoise Brougher) for successfully developing and driving the sales culture across the entire SMB organization. Q1 2013 Global Platinum Award January 2013 Received an honorary Platinum award for playing an instrumental role in driving global sales innovation across one of our sales programs globally. Sales Person of The Quarter January 2008 Was the first person to be awarded the Sales Person of the Quarter Award from a sales team of 80. Sales Person of The Quarter December 1999 Was awarded sales person of the quarter for selling in excess of $1,000,000 worth of PC Hardware to the UK consumer market in Q4 1999. Global SMB VP Award January 2015 Global recognition by our VP for continuously driving a culture of coaching and sales excellence across an organization of over 1,000+ sales reps and managers. Global SMB VP Award Senior VP @ Google January 2013 Global recognition by a senior Vice President @ Google (Francoise Brougher) for successfully developing and driving the sales culture across the entire SMB organization. Global SMB VP Award Senior VP @ Google January 2013 Global recognition by a senior Vice President @ Google (Francoise Brougher) for successfully developing and driving the sales culture across the entire SMB organization. Global SMB VP Award Senior VP @ Google January 2013 Global recognition by a senior Vice President @ Google (Francoise Brougher) for successfully developing and driving the sales culture across the entire SMB organization. Q1 2013 Global Platinum Award January 2013 Received an honorary Platinum award for playing an instrumental role in driving global sales innovation across one of our sales programs globally. Q1 2013 Global Platinum Award January 2013 Received an honorary Platinum award for playing an instrumental role in driving global sales innovation across one of our sales programs globally. Q1 2013 Global Platinum Award January 2013 Received an honorary Platinum award for playing an instrumental role in driving global sales innovation across one of our sales programs globally. Sales Person of The Quarter January 2008 Was the first person to be awarded the Sales Person of the Quarter Award from a sales team of 80. Sales Person of The Quarter January 2008 Was the first person to be awarded the Sales Person of the Quarter Award from a sales team of 80. Sales Person of The Quarter January 2008 Was the first person to be awarded the Sales Person of the Quarter Award from a sales team of 80. Sales Person of The Quarter December 1999 Was awarded sales person of the quarter for selling in excess of $1,000,000 worth of PC Hardware to the UK consumer market in Q4 1999. Sales Person of The Quarter December 1999 Was awarded sales person of the quarter for selling in excess of $1,000,000 worth of PC Hardware to the UK consumer market in Q4 1999. Sales Person of The Quarter December 1999 Was awarded sales person of the quarter for selling in excess of $1,000,000 worth of PC Hardware to the UK consumer market in Q4 1999. Global SMB VP Award January 2015 Global recognition by our VP for continuously driving a culture of coaching and sales excellence across an organization of over 1,000+ sales reps and managers. Global SMB VP Award January 2015 Global recognition by our VP for continuously driving a culture of coaching and sales excellence across an organization of over 1,000+ sales reps and managers. Global SMB VP Award January 2015 Global recognition by our VP for continuously driving a culture of coaching and sales excellence across an organization of over 1,000+ sales reps and managers. ", "Summary Direct and Channel Sales Management experience at start ups and F1000 companies including HP, Intershop (IPO) and Postini (acquired by Google) that includes hiring both sales and pre-sales teams selling business to business solutions to large enterprises. Launched and grew HP's indirect channel business from zero to over $100M/yr. As the VP of Sales at Intershop Communications, Inc., an enterprise E-Commerce software company located in SF, CA I was instrumental in hiring and building a sales organization that exceeded revenue goals and culminated in a very successful IPO. \n \nSpecialties: B2B Sales & Sales Management - Cloud Computing - Go-To-Market Strategy - Solution Selling, Strategic Alliances & Partnerships - Salesforce.com - Start-ups - Professional Services – Fundraising - Demand & Lead Generation - Sales Enablement - Recruiting– New Product Introduction - Closing Complex Sales Using Consultative Selling Skills - Repeatable, Predictable Sales Processes Summary Direct and Channel Sales Management experience at start ups and F1000 companies including HP, Intershop (IPO) and Postini (acquired by Google) that includes hiring both sales and pre-sales teams selling business to business solutions to large enterprises. Launched and grew HP's indirect channel business from zero to over $100M/yr. As the VP of Sales at Intershop Communications, Inc., an enterprise E-Commerce software company located in SF, CA I was instrumental in hiring and building a sales organization that exceeded revenue goals and culminated in a very successful IPO. \n \nSpecialties: B2B Sales & Sales Management - Cloud Computing - Go-To-Market Strategy - Solution Selling, Strategic Alliances & Partnerships - Salesforce.com - Start-ups - Professional Services – Fundraising - Demand & Lead Generation - Sales Enablement - Recruiting– New Product Introduction - Closing Complex Sales Using Consultative Selling Skills - Repeatable, Predictable Sales Processes Direct and Channel Sales Management experience at start ups and F1000 companies including HP, Intershop (IPO) and Postini (acquired by Google) that includes hiring both sales and pre-sales teams selling business to business solutions to large enterprises. Launched and grew HP's indirect channel business from zero to over $100M/yr. As the VP of Sales at Intershop Communications, Inc., an enterprise E-Commerce software company located in SF, CA I was instrumental in hiring and building a sales organization that exceeded revenue goals and culminated in a very successful IPO. \n \nSpecialties: B2B Sales & Sales Management - Cloud Computing - Go-To-Market Strategy - Solution Selling, Strategic Alliances & Partnerships - Salesforce.com - Start-ups - Professional Services – Fundraising - Demand & Lead Generation - Sales Enablement - Recruiting– New Product Introduction - Closing Complex Sales Using Consultative Selling Skills - Repeatable, Predictable Sales Processes Direct and Channel Sales Management experience at start ups and F1000 companies including HP, Intershop (IPO) and Postini (acquired by Google) that includes hiring both sales and pre-sales teams selling business to business solutions to large enterprises. Launched and grew HP's indirect channel business from zero to over $100M/yr. As the VP of Sales at Intershop Communications, Inc., an enterprise E-Commerce software company located in SF, CA I was instrumental in hiring and building a sales organization that exceeded revenue goals and culminated in a very successful IPO. \n \nSpecialties: B2B Sales & Sales Management - Cloud Computing - Go-To-Market Strategy - Solution Selling, Strategic Alliances & Partnerships - Salesforce.com - Start-ups - Professional Services – Fundraising - Demand & Lead Generation - Sales Enablement - Recruiting– New Product Introduction - Closing Complex Sales Using Consultative Selling Skills - Repeatable, Predictable Sales Processes Experience Vice President Worldwide Sales Serus Corporation (Acquired By E2open) November 2012  – Present (2 years 10 months) Sunnyvale, CA Serus Corporation is a global provider of SaaS-based supply chain visibility solutions to the semiconductor, high technology, and other manufacturing industries. The Serus SaaS-based solution helps global manufacturers imrpove their visibility to their Work in Process, optimize their inventories, and reduce their inventory carrying costs. Existing customers include HP, Cisco, Flextronics, Qualcomm, AMD, Cypress, IDT, PMC, NVIDIA, Intel, and Juniper Networks. Vice President Worldwide Sales Serus Corporation (Acquired By E2open) November 2012  – Present (2 years 10 months) Sunnyvale, CA Serus Corporation is a global provider of SaaS-based supply chain visibility solutions to the semiconductor, high technology, and other manufacturing industries. The Serus SaaS-based solution helps global manufacturers imrpove their visibility to their Work in Process, optimize their inventories, and reduce their inventory carrying costs. Existing customers include HP, Cisco, Flextronics, Qualcomm, AMD, Cypress, IDT, PMC, NVIDIA, Intel, and Juniper Networks. Vice President Worldwide Sales Serus Corporation (Acquired By E2open) November 2012  – Present (2 years 10 months) Sunnyvale, CA Serus Corporation is a global provider of SaaS-based supply chain visibility solutions to the semiconductor, high technology, and other manufacturing industries. The Serus SaaS-based solution helps global manufacturers imrpove their visibility to their Work in Process, optimize their inventories, and reduce their inventory carrying costs. Existing customers include HP, Cisco, Flextronics, Qualcomm, AMD, Cypress, IDT, PMC, NVIDIA, Intel, and Juniper Networks. Skills Channel Management Sales Management HP SaaS Enterprise Software Cloud Computing Go-to-market Strategy Solution Selling Business Alliances Salesforce.com Strategic Partnerships Start-ups Professional Services Product Management Product Marketing Sales Process Strategic Alliances Demand Generation Lead Generation Direct Sales Sales Enablement Hiring Personnel Fundraising Introducing New Products Channel Partners CRM Sales Operations Program Management Selling Management Strategy Executive Management New Business Development E-commerce B2B Pre-sales Leadership Entrepreneurship Business Planning Product Launch Product Development Sales Partner Management Marketing Strategy Marketing Channel Sales International Sales Software Industry Security See 34+     See less Skills  Channel Management Sales Management HP SaaS Enterprise Software Cloud Computing Go-to-market Strategy Solution Selling Business Alliances Salesforce.com Strategic Partnerships Start-ups Professional Services Product Management Product Marketing Sales Process Strategic Alliances Demand Generation Lead Generation Direct Sales Sales Enablement Hiring Personnel Fundraising Introducing New Products Channel Partners CRM Sales Operations Program Management Selling Management Strategy Executive Management New Business Development E-commerce B2B Pre-sales Leadership Entrepreneurship Business Planning Product Launch Product Development Sales Partner Management Marketing Strategy Marketing Channel Sales International Sales Software Industry Security See 34+     See less Channel Management Sales Management HP SaaS Enterprise Software Cloud Computing Go-to-market Strategy Solution Selling Business Alliances Salesforce.com Strategic Partnerships Start-ups Professional Services Product Management Product Marketing Sales Process Strategic Alliances Demand Generation Lead Generation Direct Sales Sales Enablement Hiring Personnel Fundraising Introducing New Products Channel Partners CRM Sales Operations Program Management Selling Management Strategy Executive Management New Business Development E-commerce B2B Pre-sales Leadership Entrepreneurship Business Planning Product Launch Product Development Sales Partner Management Marketing Strategy Marketing Channel Sales International Sales Software Industry Security See 34+     See less Channel Management Sales Management HP SaaS Enterprise Software Cloud Computing Go-to-market Strategy Solution Selling Business Alliances Salesforce.com Strategic Partnerships Start-ups Professional Services Product Management Product Marketing Sales Process Strategic Alliances Demand Generation Lead Generation Direct Sales Sales Enablement Hiring Personnel Fundraising Introducing New Products Channel Partners CRM Sales Operations Program Management Selling Management Strategy Executive Management New Business Development E-commerce B2B Pre-sales Leadership Entrepreneurship Business Planning Product Launch Product Development Sales Partner Management Marketing Strategy Marketing Channel Sales International Sales Software Industry Security See 34+     See less ", "Summary I'm passionate about developing people and organizations. I currently put that passion to work for Google as a People Development Business Partner supporting an emerging and strategic part of Google's business organization. \n \nMy current role includes consulting with senior stakeholders, working with HRBP's to build and execute people plans and developing large-scale change efforts to drive sales, build great managers, leaders and teams and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. \n \nOutside of my core job, I support Googlers as an internal coach (we call them Career Gurus). I provide guidance on a variety of work-related topics including exploring new career opportunities, navigating company culture, developing new skills, sustaining high-performance, improving communication and having more productive interactions with coworkers. Search for more info: career guru google. \n Summary I'm passionate about developing people and organizations. I currently put that passion to work for Google as a People Development Business Partner supporting an emerging and strategic part of Google's business organization. \n \nMy current role includes consulting with senior stakeholders, working with HRBP's to build and execute people plans and developing large-scale change efforts to drive sales, build great managers, leaders and teams and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. \n \nOutside of my core job, I support Googlers as an internal coach (we call them Career Gurus). I provide guidance on a variety of work-related topics including exploring new career opportunities, navigating company culture, developing new skills, sustaining high-performance, improving communication and having more productive interactions with coworkers. Search for more info: career guru google. \n I'm passionate about developing people and organizations. I currently put that passion to work for Google as a People Development Business Partner supporting an emerging and strategic part of Google's business organization. \n \nMy current role includes consulting with senior stakeholders, working with HRBP's to build and execute people plans and developing large-scale change efforts to drive sales, build great managers, leaders and teams and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. \n \nOutside of my core job, I support Googlers as an internal coach (we call them Career Gurus). I provide guidance on a variety of work-related topics including exploring new career opportunities, navigating company culture, developing new skills, sustaining high-performance, improving communication and having more productive interactions with coworkers. Search for more info: career guru google. \n I'm passionate about developing people and organizations. I currently put that passion to work for Google as a People Development Business Partner supporting an emerging and strategic part of Google's business organization. \n \nMy current role includes consulting with senior stakeholders, working with HRBP's to build and execute people plans and developing large-scale change efforts to drive sales, build great managers, leaders and teams and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. \n \nOutside of my core job, I support Googlers as an internal coach (we call them Career Gurus). I provide guidance on a variety of work-related topics including exploring new career opportunities, navigating company culture, developing new skills, sustaining high-performance, improving communication and having more productive interactions with coworkers. Search for more info: career guru google. \n Experience People Development Consultant, Global Sales Operations and Strategy, Global Solutions Leads Google September 2014  – Present (1 year) San Francisco Bay Area - Consultant and partner to two global organizations driving revenue, operational excellence, strategic vision and product development at Google.  \n- Build organizational talent in aspects such as presence, execution, thought leadership.  \n- Keep Googlers engaged, inspired and productive through continuous growth and development opportunities ranging from classroom learning, rotation programs, 20% projects, leadership development, well-being resources, educational reimbursement programs, mindfulness and coaching. People Development Consultant, Google for Work Google October 2012  –  September 2014  (2 years) Mountain View, CA People Development Business Partner supporting important strategic organization for Google. Role includes consulting with senior stakeholders, working closely with HRBP's to build people plans and developing large-scale change efforts to drive sales, build great leaders and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. Initiatives include: \n- Designing and implementing an organization-wide program to transform the way the organization sells its products \n- Working with business leaders to support efforts to keep high-potential talent including building opportunities for new grads to get key business acumen skills to enable them to influence through use of data, stories and relationships \n- Working with cross-functional team to design leadership experiences that increase team effectiveness through experiential, 'transformational' learning which includes both technical and adaptive learning Manager, Learning & Development - Asia Pacific Google, Inc. September 2011  –  October 2012  (1 year 2 months) Sydney, Australia People Development Business Partner with experience consulting senior Google Business Organization stakeholders to drive business success through people development efforts including analysis, design, development, implementation and evaluation of leadership, management, sales skills, business acumen and coaching interventions. Additional experience: \n \n- Managing a cross-cultural, regionally dispersed team \n- Program managing global initiatives with regional tailoring \n- Managing large training budgets  \n- Designing and implementing large-scale change management efforts for sales organizations  \n- Partnering with HRBP's and senior stakeholders to support goals of the organization Learning & Development Program Manager, Advertising Sales Google September 2010  –  September 2011  (1 year 1 month) Sydney Area, Australia Supported Australia and New Zealand's advertising sales team, which included designing an important change management effort in support of a new sales strategy. Met with initial resistance, the organization was transformed through this effort, leading to execution on an important strategy and increased revenue for the region. AdWords Search Programs Team Lead Google, Inc. April 2009  –  November 2009  (8 months) San Francisco Bay Area Developed a scaling effort to teach sales team to sell search advertising using complex data & analysis tools. West Coast Manager, Search & Analytics Google August 2008  –  April 2009  (9 months) San Francisco Bay Area Developed & managed a new team of metrics analysts to analyze clients’ advertising campaigns in order to optimize and upsell. Google Analytics Partnerships Team Lead Google June 2008  –  October 2008  (5 months) San Francisco Bay Area Led Google Analytics Jumpstart program efforts, installing the product and undertaking data analysis for large advertisers. Senior Strategic Partner Manager, Commerce & Analytics Google October 2006  –  July 2008  (1 year 10 months) San Francisco Bay Area Managed eCommerce partnerships with large multi-channel merchants for a new Google product, Google Checkout. Advertising Account Manager, Large Customer Sales Google July 2005  –  October 2006  (1 year 4 months) Mountain View, CA Managed client advertising relationships for Google's Direct Sales organization in the most productive vertical (revenue /head). Advertising Account Coordinator, Large Customer Sales Google March 2004  –  July 2005  (1 year 5 months) Mountain View, CA Assisted Google sales teams in managing, optimizing and selling large advertiser campaigns. Sponsorship Development, Sales Mowalla 2001  –  2003  (2 years) Greater Chicago Area Developed sponsorship programs for large brand marketers. Assistant Manager, Development University of Chicago January 2001  –  February 2002  (1 year 2 months) Greater Chicago Area Fundraising for University Development and Pritzker School of Medicine. Sales, Project Management Commonwealth Promotions 1999  –  2001  (2 years) Greater Boston Area Produced events, developed event websites, created & executed marketing plans and planned sponsorship development opportunities for a variety of brands and events including Hyundai, Turner Classic Movies and the Boston International Festival of Women's Cinema. People Development Consultant, Global Sales Operations and Strategy, Global Solutions Leads Google September 2014  – Present (1 year) San Francisco Bay Area - Consultant and partner to two global organizations driving revenue, operational excellence, strategic vision and product development at Google.  \n- Build organizational talent in aspects such as presence, execution, thought leadership.  \n- Keep Googlers engaged, inspired and productive through continuous growth and development opportunities ranging from classroom learning, rotation programs, 20% projects, leadership development, well-being resources, educational reimbursement programs, mindfulness and coaching. People Development Consultant, Global Sales Operations and Strategy, Global Solutions Leads Google September 2014  – Present (1 year) San Francisco Bay Area - Consultant and partner to two global organizations driving revenue, operational excellence, strategic vision and product development at Google.  \n- Build organizational talent in aspects such as presence, execution, thought leadership.  \n- Keep Googlers engaged, inspired and productive through continuous growth and development opportunities ranging from classroom learning, rotation programs, 20% projects, leadership development, well-being resources, educational reimbursement programs, mindfulness and coaching. People Development Consultant, Google for Work Google October 2012  –  September 2014  (2 years) Mountain View, CA People Development Business Partner supporting important strategic organization for Google. Role includes consulting with senior stakeholders, working closely with HRBP's to build people plans and developing large-scale change efforts to drive sales, build great leaders and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. Initiatives include: \n- Designing and implementing an organization-wide program to transform the way the organization sells its products \n- Working with business leaders to support efforts to keep high-potential talent including building opportunities for new grads to get key business acumen skills to enable them to influence through use of data, stories and relationships \n- Working with cross-functional team to design leadership experiences that increase team effectiveness through experiential, 'transformational' learning which includes both technical and adaptive learning People Development Consultant, Google for Work Google October 2012  –  September 2014  (2 years) Mountain View, CA People Development Business Partner supporting important strategic organization for Google. Role includes consulting with senior stakeholders, working closely with HRBP's to build people plans and developing large-scale change efforts to drive sales, build great leaders and motivate employees to meet the challenges of working in a dynamic, competitive high-tech environment. Initiatives include: \n- Designing and implementing an organization-wide program to transform the way the organization sells its products \n- Working with business leaders to support efforts to keep high-potential talent including building opportunities for new grads to get key business acumen skills to enable them to influence through use of data, stories and relationships \n- Working with cross-functional team to design leadership experiences that increase team effectiveness through experiential, 'transformational' learning which includes both technical and adaptive learning Manager, Learning & Development - Asia Pacific Google, Inc. September 2011  –  October 2012  (1 year 2 months) Sydney, Australia People Development Business Partner with experience consulting senior Google Business Organization stakeholders to drive business success through people development efforts including analysis, design, development, implementation and evaluation of leadership, management, sales skills, business acumen and coaching interventions. Additional experience: \n \n- Managing a cross-cultural, regionally dispersed team \n- Program managing global initiatives with regional tailoring \n- Managing large training budgets  \n- Designing and implementing large-scale change management efforts for sales organizations  \n- Partnering with HRBP's and senior stakeholders to support goals of the organization Manager, Learning & Development - Asia Pacific Google, Inc. September 2011  –  October 2012  (1 year 2 months) Sydney, Australia People Development Business Partner with experience consulting senior Google Business Organization stakeholders to drive business success through people development efforts including analysis, design, development, implementation and evaluation of leadership, management, sales skills, business acumen and coaching interventions. Additional experience: \n \n- Managing a cross-cultural, regionally dispersed team \n- Program managing global initiatives with regional tailoring \n- Managing large training budgets  \n- Designing and implementing large-scale change management efforts for sales organizations  \n- Partnering with HRBP's and senior stakeholders to support goals of the organization Learning & Development Program Manager, Advertising Sales Google September 2010  –  September 2011  (1 year 1 month) Sydney Area, Australia Supported Australia and New Zealand's advertising sales team, which included designing an important change management effort in support of a new sales strategy. Met with initial resistance, the organization was transformed through this effort, leading to execution on an important strategy and increased revenue for the region. Learning & Development Program Manager, Advertising Sales Google September 2010  –  September 2011  (1 year 1 month) Sydney Area, Australia Supported Australia and New Zealand's advertising sales team, which included designing an important change management effort in support of a new sales strategy. Met with initial resistance, the organization was transformed through this effort, leading to execution on an important strategy and increased revenue for the region. AdWords Search Programs Team Lead Google, Inc. April 2009  –  November 2009  (8 months) San Francisco Bay Area Developed a scaling effort to teach sales team to sell search advertising using complex data & analysis tools. AdWords Search Programs Team Lead Google, Inc. April 2009  –  November 2009  (8 months) San Francisco Bay Area Developed a scaling effort to teach sales team to sell search advertising using complex data & analysis tools. West Coast Manager, Search & Analytics Google August 2008  –  April 2009  (9 months) San Francisco Bay Area Developed & managed a new team of metrics analysts to analyze clients’ advertising campaigns in order to optimize and upsell. West Coast Manager, Search & Analytics Google August 2008  –  April 2009  (9 months) San Francisco Bay Area Developed & managed a new team of metrics analysts to analyze clients’ advertising campaigns in order to optimize and upsell. Google Analytics Partnerships Team Lead Google June 2008  –  October 2008  (5 months) San Francisco Bay Area Led Google Analytics Jumpstart program efforts, installing the product and undertaking data analysis for large advertisers. Google Analytics Partnerships Team Lead Google June 2008  –  October 2008  (5 months) San Francisco Bay Area Led Google Analytics Jumpstart program efforts, installing the product and undertaking data analysis for large advertisers. Senior Strategic Partner Manager, Commerce & Analytics Google October 2006  –  July 2008  (1 year 10 months) San Francisco Bay Area Managed eCommerce partnerships with large multi-channel merchants for a new Google product, Google Checkout. Senior Strategic Partner Manager, Commerce & Analytics Google October 2006  –  July 2008  (1 year 10 months) San Francisco Bay Area Managed eCommerce partnerships with large multi-channel merchants for a new Google product, Google Checkout. Advertising Account Manager, Large Customer Sales Google July 2005  –  October 2006  (1 year 4 months) Mountain View, CA Managed client advertising relationships for Google's Direct Sales organization in the most productive vertical (revenue /head). Advertising Account Manager, Large Customer Sales Google July 2005  –  October 2006  (1 year 4 months) Mountain View, CA Managed client advertising relationships for Google's Direct Sales organization in the most productive vertical (revenue /head). Advertising Account Coordinator, Large Customer Sales Google March 2004  –  July 2005  (1 year 5 months) Mountain View, CA Assisted Google sales teams in managing, optimizing and selling large advertiser campaigns. Advertising Account Coordinator, Large Customer Sales Google March 2004  –  July 2005  (1 year 5 months) Mountain View, CA Assisted Google sales teams in managing, optimizing and selling large advertiser campaigns. Sponsorship Development, Sales Mowalla 2001  –  2003  (2 years) Greater Chicago Area Developed sponsorship programs for large brand marketers. Sponsorship Development, Sales Mowalla 2001  –  2003  (2 years) Greater Chicago Area Developed sponsorship programs for large brand marketers. Assistant Manager, Development University of Chicago January 2001  –  February 2002  (1 year 2 months) Greater Chicago Area Fundraising for University Development and Pritzker School of Medicine. Assistant Manager, Development University of Chicago January 2001  –  February 2002  (1 year 2 months) Greater Chicago Area Fundraising for University Development and Pritzker School of Medicine. Sales, Project Management Commonwealth Promotions 1999  –  2001  (2 years) Greater Boston Area Produced events, developed event websites, created & executed marketing plans and planned sponsorship development opportunities for a variety of brands and events including Hyundai, Turner Classic Movies and the Boston International Festival of Women's Cinema. Sales, Project Management Commonwealth Promotions 1999  –  2001  (2 years) Greater Boston Area Produced events, developed event websites, created & executed marketing plans and planned sponsorship development opportunities for a variety of brands and events including Hyundai, Turner Classic Movies and the Boston International Festival of Women's Cinema. Languages English English English Skills Management Curriculum Design Organizational Learning Stakeholder Engagement Training Facilitation Change Management Stakeholder Management Performance Consulting People Development Human Capital Training Learning & Development... E-Learning Program Management Budgets E-commerce Strategy Budgetary Management People Management Learning Design Analytics Marketing Strategic Planning Advertising Sales Analysis Fundraising Data Analysis Google Analytics Direct Sales Selling Social Media HR Consulting Google Adwords Google Apps Google Maps Google Docs Executive Development Onboarding Executive Coaching Coaching Training Delivery online advertising Leadership Leadership Development Cross-functional Team... Consulting Career Development Organizational... Online Advertising See 35+     See less Skills  Management Curriculum Design Organizational Learning Stakeholder Engagement Training Facilitation Change Management Stakeholder Management Performance Consulting People Development Human Capital Training Learning & Development... E-Learning Program Management Budgets E-commerce Strategy Budgetary Management People Management Learning Design Analytics Marketing Strategic Planning Advertising Sales Analysis Fundraising Data Analysis Google Analytics Direct Sales Selling Social Media HR Consulting Google Adwords Google Apps Google Maps Google Docs Executive Development Onboarding Executive Coaching Coaching Training Delivery online advertising Leadership Leadership Development Cross-functional Team... Consulting Career Development Organizational... Online Advertising See 35+     See less Management Curriculum Design Organizational Learning Stakeholder Engagement Training Facilitation Change Management Stakeholder Management Performance Consulting People Development Human Capital Training Learning & Development... E-Learning Program Management Budgets E-commerce Strategy Budgetary Management People Management Learning Design Analytics Marketing Strategic Planning Advertising Sales Analysis Fundraising Data Analysis Google Analytics Direct Sales Selling Social Media HR Consulting Google Adwords Google Apps Google Maps Google Docs Executive Development Onboarding Executive Coaching Coaching Training Delivery online advertising Leadership Leadership Development Cross-functional Team... Consulting Career Development Organizational... Online Advertising See 35+     See less Management Curriculum Design Organizational Learning Stakeholder Engagement Training Facilitation Change Management Stakeholder Management Performance Consulting People Development Human Capital Training Learning & Development... E-Learning Program Management Budgets E-commerce Strategy Budgetary Management People Management Learning Design Analytics Marketing Strategic Planning Advertising Sales Analysis Fundraising Data Analysis Google Analytics Direct Sales Selling Social Media HR Consulting Google Adwords Google Apps Google Maps Google Docs Executive Development Onboarding Executive Coaching Coaching Training Delivery online advertising Leadership Leadership Development Cross-functional Team... Consulting Career Development Organizational... Online Advertising See 35+     See less Education Northwestern University Master's degree,  Learning & Organizational Change, School of Education and Social P 2015  – 2018 Northwestern University Organizational and Leadership Coaching Graduate Certificate,  Executive Coaching 2014  – 2015 University of North Carolina at Chapel Hill BA, Speech Communications,  Speech & Hearing Sciences , Psychology 1993  – 1997 Activities and Societies:  UNC Women's Crew ,  Best Buddies ,  Alpha Chi Omega Communications Chair Northwestern University Master's degree,  Learning & Organizational Change, School of Education and Social P 2015  – 2018 Northwestern University Master's degree,  Learning & Organizational Change, School of Education and Social P 2015  – 2018 Northwestern University Master's degree,  Learning & Organizational Change, School of Education and Social P 2015  – 2018 Northwestern University Organizational and Leadership Coaching Graduate Certificate,  Executive Coaching 2014  – 2015 Northwestern University Organizational and Leadership Coaching Graduate Certificate,  Executive Coaching 2014  – 2015 Northwestern University Organizational and Leadership Coaching Graduate Certificate,  Executive Coaching 2014  – 2015 University of North Carolina at Chapel Hill BA, Speech Communications,  Speech & Hearing Sciences , Psychology 1993  – 1997 Activities and Societies:  UNC Women's Crew ,  Best Buddies ,  Alpha Chi Omega Communications Chair University of North Carolina at Chapel Hill BA, Speech Communications,  Speech & Hearing Sciences , Psychology 1993  – 1997 Activities and Societies:  UNC Women's Crew ,  Best Buddies ,  Alpha Chi Omega Communications Chair University of North Carolina at Chapel Hill BA, Speech Communications,  Speech & Hearing Sciences , Psychology 1993  – 1997 Activities and Societies:  UNC Women's Crew ,  Best Buddies ,  Alpha Chi Omega Communications Chair Honors & Awards Additional Honors & Awards Honored with a Google Founders' Award as a contributing member of a customer service initiative for Google's AdWords clients. Additional Honors & Awards Honored with a Google Founders' Award as a contributing member of a customer service initiative for Google's AdWords clients. Additional Honors & Awards Honored with a Google Founders' Award as a contributing member of a customer service initiative for Google's AdWords clients. Additional Honors & Awards Honored with a Google Founders' Award as a contributing member of a customer service initiative for Google's AdWords clients. ", "Summary Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Summary Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Joined Google in 2006 coming from a Document Management Start-up where an individual had to wear multiple hats. Being a long time Googler, I had the privilege to see and participate actively in its fast growth. My initial focus was to scale our consumer support, process improvements, productivity measurement tools and business development activities. Back then, I was involved with consumer Gmail and Google Accounts as a product specialist (Usability, tech support, communications, reporting etc). Later on, I joined the Google Enterprise team (in its early days) as a Sales Engineer and managed the Sales Engineering team in EMEA. Currently I head up the Google For Work Post Sales Teams in NACE. \n \nSpecialities:  \n• Scale Pre-Sales and Post-Sales models. Strong Sales focus \n• People development, motivation and leadership.  \n• Solution Selling.  \n• Cloud computing and SaaS. \n• Business growth through Technology, #Innovation, #Transformation, #Mobility \n• Internet and online marketing strategies. \n• User experience, product usability. \n• User/customer support. Experience Head of NACE Field & Partner Operations – Google Google January 2015  – Present (8 months) London, United Kingdom • Head up the Northern, Central and Eastern European Google For Work Post Sales teams: Field & Partner Operations, Deployment, Transformation and Customer Success Services. Responsible for all market segments \n• \"Go to market\" strategy for Strategic Alliances  \n• Ensure successful deployments, high renewal rates and position to existing customers new Solutions  \n• Scale Post-Sales activities through partners and define strategy for top tier partners. \n• Engagement with Strategic Alliance Partners in EMEA \n• Interact with customers: C-Level & Executive briefings to ensure the success of the projects and the roadmap for #Transformation, #Innovation and #Mobility \n• Key note speaker at Google, Partner and Industry events  \n• Hiring Manager for Post-Sales teams and part of the EMEA Google For Work hiring panel \n• Mentor Startups @ www.campuslondon.com \n• Mentor junior Googlers and university students as part of several mentorship programs Head of EMEA Channel Sales Engineering Google February 2012  – Present (3 years 7 months) London, UK • Focused on Google Apps for Business, Google Vault, Cloud & Chrome OS for the Large Client Sales organisation \n• Support all the technical aspects of these products throughout the sales cycle \n• Manage a talented team of Sales Engineers spread across the EMEA region \n• Set the vision and objectives for the team and review key results \n• Drive and support evangelisation initiatives at EMEA level to ensure the growth of Google Enterprise business and our Google Apps Partners  \n• Develop and deliver training sessions to our Google Premium Partners and act as a close advisor on their opportunities \n• Speak at industry conferences about Cloud computing & Google Apps including demo our products to small or large audiences \n• Executive briefings with major customers and prospects \n• Mentor Startups @ www.campuslondon.com EMEA Mid-Market Sales Engineering Manager Google March 2011  –  February 2012  (1 year) • Google Enterprise Sales EMEA Engineering Manager responsible for the mid-market organisation (Inside and direct sales) at Google \n• Managing a talented team of Sales Engineers across the EMEA region \n• Specialist in Google Apps for Business, Enterprise Search, and Google Platform Offerings, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive and support initiatives in the region to ensure growth of the Google Enterprise business \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set objectives for the team and review key results \n• Supporting pre and post sales activities for customers and partners Enterprise Sales Engineering Technical Lead Google July 2009  –  March 2011  (1 year 9 months) • Google Enterprise technical lead for the mid-market (North and Central Europe) at Google \n• Specialist for the the mid-market in the regions above, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive specific, and focused technical initiatives in the region to ensure growth of the Google Enterprise business \n• Project planner, including change management, for pilots and deployments  \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set technical objectives for the team and review key results \n• Technical mentoring for the rest of the team and new members as they join \n• Interview candidates for many positions at Google Gmail & Google Accounts EMEA & LATAM Product Specialist (Strategist) Google July 2006  –  July 2009  (3 years 1 month) • Operations lead (coordination, training and specific product workflow management) for Gmail and Google Accounts EMEA/LATAM \n• Consumer Operations internal communications point person for several products in EMEA/LATAM (contacts with Engineering, Communications, Product, Marketing etc) \n• Full member of the Consumer Operations Marketing Intelligence team \n• Product Strategy: Focus on user adoption, user retention and ROI \n• Consolidation of product roadmaps, tailored to EMEA & LATAM \n• Coordinates several product reports and analysis that include stability, bugs, user suggestions and trends (shared with Engineering, Product, Marketing, Usability and Senior Management) \n• Part of the hiring committee and interviewed several candidates for many positions at Google \n• Product support specialist for several Google Products  \n• Received a Google Gold Award for productivity and process improvements (reached 120% increase by developing a new tool and streamlining several processes and 1 to many initiatives) IT Consultant – Pre-Sales Engineer and Product Developer IDW February 2005  –  July 2006  (1 year 6 months) • ICR - OCR, Business Process Automation, Document Automation \n• Pre-Sales Engineer.  \n• Post sales consultant and Add-On solutions developer Head of NACE Field & Partner Operations – Google Google January 2015  – Present (8 months) London, United Kingdom • Head up the Northern, Central and Eastern European Google For Work Post Sales teams: Field & Partner Operations, Deployment, Transformation and Customer Success Services. Responsible for all market segments \n• \"Go to market\" strategy for Strategic Alliances  \n• Ensure successful deployments, high renewal rates and position to existing customers new Solutions  \n• Scale Post-Sales activities through partners and define strategy for top tier partners. \n• Engagement with Strategic Alliance Partners in EMEA \n• Interact with customers: C-Level & Executive briefings to ensure the success of the projects and the roadmap for #Transformation, #Innovation and #Mobility \n• Key note speaker at Google, Partner and Industry events  \n• Hiring Manager for Post-Sales teams and part of the EMEA Google For Work hiring panel \n• Mentor Startups @ www.campuslondon.com \n• Mentor junior Googlers and university students as part of several mentorship programs Head of NACE Field & Partner Operations – Google Google January 2015  – Present (8 months) London, United Kingdom • Head up the Northern, Central and Eastern European Google For Work Post Sales teams: Field & Partner Operations, Deployment, Transformation and Customer Success Services. Responsible for all market segments \n• \"Go to market\" strategy for Strategic Alliances  \n• Ensure successful deployments, high renewal rates and position to existing customers new Solutions  \n• Scale Post-Sales activities through partners and define strategy for top tier partners. \n• Engagement with Strategic Alliance Partners in EMEA \n• Interact with customers: C-Level & Executive briefings to ensure the success of the projects and the roadmap for #Transformation, #Innovation and #Mobility \n• Key note speaker at Google, Partner and Industry events  \n• Hiring Manager for Post-Sales teams and part of the EMEA Google For Work hiring panel \n• Mentor Startups @ www.campuslondon.com \n• Mentor junior Googlers and university students as part of several mentorship programs Head of EMEA Channel Sales Engineering Google February 2012  – Present (3 years 7 months) London, UK • Focused on Google Apps for Business, Google Vault, Cloud & Chrome OS for the Large Client Sales organisation \n• Support all the technical aspects of these products throughout the sales cycle \n• Manage a talented team of Sales Engineers spread across the EMEA region \n• Set the vision and objectives for the team and review key results \n• Drive and support evangelisation initiatives at EMEA level to ensure the growth of Google Enterprise business and our Google Apps Partners  \n• Develop and deliver training sessions to our Google Premium Partners and act as a close advisor on their opportunities \n• Speak at industry conferences about Cloud computing & Google Apps including demo our products to small or large audiences \n• Executive briefings with major customers and prospects \n• Mentor Startups @ www.campuslondon.com Head of EMEA Channel Sales Engineering Google February 2012  – Present (3 years 7 months) London, UK • Focused on Google Apps for Business, Google Vault, Cloud & Chrome OS for the Large Client Sales organisation \n• Support all the technical aspects of these products throughout the sales cycle \n• Manage a talented team of Sales Engineers spread across the EMEA region \n• Set the vision and objectives for the team and review key results \n• Drive and support evangelisation initiatives at EMEA level to ensure the growth of Google Enterprise business and our Google Apps Partners  \n• Develop and deliver training sessions to our Google Premium Partners and act as a close advisor on their opportunities \n• Speak at industry conferences about Cloud computing & Google Apps including demo our products to small or large audiences \n• Executive briefings with major customers and prospects \n• Mentor Startups @ www.campuslondon.com EMEA Mid-Market Sales Engineering Manager Google March 2011  –  February 2012  (1 year) • Google Enterprise Sales EMEA Engineering Manager responsible for the mid-market organisation (Inside and direct sales) at Google \n• Managing a talented team of Sales Engineers across the EMEA region \n• Specialist in Google Apps for Business, Enterprise Search, and Google Platform Offerings, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive and support initiatives in the region to ensure growth of the Google Enterprise business \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set objectives for the team and review key results \n• Supporting pre and post sales activities for customers and partners EMEA Mid-Market Sales Engineering Manager Google March 2011  –  February 2012  (1 year) • Google Enterprise Sales EMEA Engineering Manager responsible for the mid-market organisation (Inside and direct sales) at Google \n• Managing a talented team of Sales Engineers across the EMEA region \n• Specialist in Google Apps for Business, Enterprise Search, and Google Platform Offerings, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive and support initiatives in the region to ensure growth of the Google Enterprise business \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set objectives for the team and review key results \n• Supporting pre and post sales activities for customers and partners Enterprise Sales Engineering Technical Lead Google July 2009  –  March 2011  (1 year 9 months) • Google Enterprise technical lead for the mid-market (North and Central Europe) at Google \n• Specialist for the the mid-market in the regions above, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive specific, and focused technical initiatives in the region to ensure growth of the Google Enterprise business \n• Project planner, including change management, for pilots and deployments  \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set technical objectives for the team and review key results \n• Technical mentoring for the rest of the team and new members as they join \n• Interview candidates for many positions at Google Enterprise Sales Engineering Technical Lead Google July 2009  –  March 2011  (1 year 9 months) • Google Enterprise technical lead for the mid-market (North and Central Europe) at Google \n• Specialist for the the mid-market in the regions above, supporting all the technical aspects of Google Enterprise products throughout the sales cycle \n• Drive specific, and focused technical initiatives in the region to ensure growth of the Google Enterprise business \n• Project planner, including change management, for pilots and deployments  \n• Business model orientation and technical guidance for Google Enterprise partners in the mid-market for the regions mentioned \n• Set technical objectives for the team and review key results \n• Technical mentoring for the rest of the team and new members as they join \n• Interview candidates for many positions at Google Gmail & Google Accounts EMEA & LATAM Product Specialist (Strategist) Google July 2006  –  July 2009  (3 years 1 month) • Operations lead (coordination, training and specific product workflow management) for Gmail and Google Accounts EMEA/LATAM \n• Consumer Operations internal communications point person for several products in EMEA/LATAM (contacts with Engineering, Communications, Product, Marketing etc) \n• Full member of the Consumer Operations Marketing Intelligence team \n• Product Strategy: Focus on user adoption, user retention and ROI \n• Consolidation of product roadmaps, tailored to EMEA & LATAM \n• Coordinates several product reports and analysis that include stability, bugs, user suggestions and trends (shared with Engineering, Product, Marketing, Usability and Senior Management) \n• Part of the hiring committee and interviewed several candidates for many positions at Google \n• Product support specialist for several Google Products  \n• Received a Google Gold Award for productivity and process improvements (reached 120% increase by developing a new tool and streamlining several processes and 1 to many initiatives) Gmail & Google Accounts EMEA & LATAM Product Specialist (Strategist) Google July 2006  –  July 2009  (3 years 1 month) • Operations lead (coordination, training and specific product workflow management) for Gmail and Google Accounts EMEA/LATAM \n• Consumer Operations internal communications point person for several products in EMEA/LATAM (contacts with Engineering, Communications, Product, Marketing etc) \n• Full member of the Consumer Operations Marketing Intelligence team \n• Product Strategy: Focus on user adoption, user retention and ROI \n• Consolidation of product roadmaps, tailored to EMEA & LATAM \n• Coordinates several product reports and analysis that include stability, bugs, user suggestions and trends (shared with Engineering, Product, Marketing, Usability and Senior Management) \n• Part of the hiring committee and interviewed several candidates for many positions at Google \n• Product support specialist for several Google Products  \n• Received a Google Gold Award for productivity and process improvements (reached 120% increase by developing a new tool and streamlining several processes and 1 to many initiatives) IT Consultant – Pre-Sales Engineer and Product Developer IDW February 2005  –  July 2006  (1 year 6 months) • ICR - OCR, Business Process Automation, Document Automation \n• Pre-Sales Engineer.  \n• Post sales consultant and Add-On solutions developer IT Consultant – Pre-Sales Engineer and Product Developer IDW February 2005  –  July 2006  (1 year 6 months) • ICR - OCR, Business Process Automation, Document Automation \n• Pre-Sales Engineer.  \n• Post sales consultant and Add-On solutions developer Languages English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Russian Elementary proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Russian Elementary proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency French Elementary proficiency Russian Elementary proficiency Full professional proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Elementary proficiency Skills User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less Skills  User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less User Experience Usability Testing Cloud Computing IT Strategy Process Improvement Online Marketing Messaging Coaching Security Information Architecture SEO Change Management SaaS Social Media Performance Management Team Building IT Management User Interface Online Advertising Pre-sales Leadership Team Management Strategic Partnerships Sales Engineering Business Development Google Apps SEM Google Adwords Product Management Start-ups Management E-commerce Marketing Strategy Enterprise Software Product Marketing Direct Sales Sales Web Analytics Google Analytics CRM Mobile Applications Analytics Mobile Marketing Digital Strategy PPC Web 2.0 Digital Marketing Salesforce.com Mobile Devices Enterprise Search See 35+     See less Education Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Dublin Business School Diploma,  Project Management 2007  – 2007 University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Applied Chemistry to Genetics 1999  – 2001 I completed the 2 first years before changing to Computer Science Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Universidade Nova de Lisboa Masters,  Computer Science and Eng. 2001  – 2006 Activities and Societies:  Head of Computer Eng. Students. Dublin Business School Diploma,  Project Management 2007  – 2007 Dublin Business School Diploma,  Project Management 2007  – 2007 Dublin Business School Diploma,  Project Management 2007  – 2007 University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China University of Oxford Diploma,  New Economic Powers 2009  – 2009 This was done remotely and the objective was to learn more about the macro economy of Brazil, Russia, India and China Honors & Awards Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 Additional Honors & Awards Enterprise Impact - Individual (Global award) 2013 - TOP3 \nGlobal Leadership Team Award 2011 \nEMEA R2 Google Sales Engineer of the year 2010 \nGoogle Certificate of Excellence for outstanding work 2009 \nGoogle Gold Award 2008 \nMerit award from Dublin Business School 2007 ", "Summary >>> SENIOR-LEVEL EXECUTIVE IN SALES, MARKETING AND BUSINESS DEVELOPMENT <<< \n \n............................................................................................................................... \n \nQUALIFICATIONS SUMMARY \n \nI’m a forward-thinking senior executive with more than 27 years experience in leading sales, business development, marketing priorities and strategic objectives in telecommunications, wireless and IT services industries.  \n \nMy highly-creative, process-oriented style allows me to identify business problems, formulate tactical plans, initiate change and implement effective solutions that deliver substantial profit and revenue increases, efficiencies and cost reductions. I penetrate competitive markets and maximize profits and market share by using a unique sales style, studying competition, analyzing market trends and building sales momentum. The accomplishments listed under each position below are a testament of my exceptional communication, negotiation and leadership abilities. Building dynamic teams that drive growth and productivity comes naturally to me. \n \nI have extensive experience in sales / business development, marketing, product development and project management of wired and wireless products and managed telecom services, including voice and data over IP, Wi-Fi, Wi-Max, ATM, Frame Relay, Private Lines, OCX, Metro Ethernet, Data Center, Co-location, Cloud Services, Dark Fiber, IRU and other Mobility / Telecom products & services. Summary >>> SENIOR-LEVEL EXECUTIVE IN SALES, MARKETING AND BUSINESS DEVELOPMENT <<< \n \n............................................................................................................................... \n \nQUALIFICATIONS SUMMARY \n \nI’m a forward-thinking senior executive with more than 27 years experience in leading sales, business development, marketing priorities and strategic objectives in telecommunications, wireless and IT services industries.  \n \nMy highly-creative, process-oriented style allows me to identify business problems, formulate tactical plans, initiate change and implement effective solutions that deliver substantial profit and revenue increases, efficiencies and cost reductions. I penetrate competitive markets and maximize profits and market share by using a unique sales style, studying competition, analyzing market trends and building sales momentum. The accomplishments listed under each position below are a testament of my exceptional communication, negotiation and leadership abilities. Building dynamic teams that drive growth and productivity comes naturally to me. \n \nI have extensive experience in sales / business development, marketing, product development and project management of wired and wireless products and managed telecom services, including voice and data over IP, Wi-Fi, Wi-Max, ATM, Frame Relay, Private Lines, OCX, Metro Ethernet, Data Center, Co-location, Cloud Services, Dark Fiber, IRU and other Mobility / Telecom products & services. >>> SENIOR-LEVEL EXECUTIVE IN SALES, MARKETING AND BUSINESS DEVELOPMENT <<< \n \n............................................................................................................................... \n \nQUALIFICATIONS SUMMARY \n \nI’m a forward-thinking senior executive with more than 27 years experience in leading sales, business development, marketing priorities and strategic objectives in telecommunications, wireless and IT services industries.  \n \nMy highly-creative, process-oriented style allows me to identify business problems, formulate tactical plans, initiate change and implement effective solutions that deliver substantial profit and revenue increases, efficiencies and cost reductions. I penetrate competitive markets and maximize profits and market share by using a unique sales style, studying competition, analyzing market trends and building sales momentum. The accomplishments listed under each position below are a testament of my exceptional communication, negotiation and leadership abilities. Building dynamic teams that drive growth and productivity comes naturally to me. \n \nI have extensive experience in sales / business development, marketing, product development and project management of wired and wireless products and managed telecom services, including voice and data over IP, Wi-Fi, Wi-Max, ATM, Frame Relay, Private Lines, OCX, Metro Ethernet, Data Center, Co-location, Cloud Services, Dark Fiber, IRU and other Mobility / Telecom products & services. >>> SENIOR-LEVEL EXECUTIVE IN SALES, MARKETING AND BUSINESS DEVELOPMENT <<< \n \n............................................................................................................................... \n \nQUALIFICATIONS SUMMARY \n \nI’m a forward-thinking senior executive with more than 27 years experience in leading sales, business development, marketing priorities and strategic objectives in telecommunications, wireless and IT services industries.  \n \nMy highly-creative, process-oriented style allows me to identify business problems, formulate tactical plans, initiate change and implement effective solutions that deliver substantial profit and revenue increases, efficiencies and cost reductions. I penetrate competitive markets and maximize profits and market share by using a unique sales style, studying competition, analyzing market trends and building sales momentum. The accomplishments listed under each position below are a testament of my exceptional communication, negotiation and leadership abilities. Building dynamic teams that drive growth and productivity comes naturally to me. \n \nI have extensive experience in sales / business development, marketing, product development and project management of wired and wireless products and managed telecom services, including voice and data over IP, Wi-Fi, Wi-Max, ATM, Frame Relay, Private Lines, OCX, Metro Ethernet, Data Center, Co-location, Cloud Services, Dark Fiber, IRU and other Mobility / Telecom products & services. Experience VP, SALES AND BUSINESS DEVELOPMENT - WIRELESS SERVICES ViaSat Inc. April 2013  – Present (2 years 5 months) Greater Dallas Area ViaSat's Wireless Services division (formerly NetNearU) -- has been an expert in public Wi-Fi network management for 17 years, and is one of the largest service providers of Wi-Fi in the world. Our seasoned team has developed deep industry knowledge and a best practice approach that ensures our customers’ long-term success.  \n \nViaSat currently serves more than 100,000+ in-building, outdoor and in-flight Wi-Fi networks, totaling more than 10 million APs, including military bases, office buildings, stadiums, hotels, hospitals, retail chains, restaurants, city-wide deployments, and everything in between. We are also an underlying service provider for telecom, mobile operator and cable service providers, commercial airlines, and other partners worldwide, including Comcast, Time Warner, Sprint, Cablevision, CableLabs, Level 3, American Tower, U.S Navy, Marines, Army, Air Force, Virgin America, Jet Blue, United Airlines and others. \n \nWe provide flexible, comprehensive solutions for these customers so they can deliver their own unique branded experience any mobile device. Each unique and diverse experience has prepared our company to transform any complex Wi-Fi challenge into a simple and strategic solution. Our TRACKOS™ cloud-based management platform allows partners to easily customize portal pages, AAA, roaming, advertising, analytics and more. \n \nAs a member of the leadership team, I help define our business units mission and direction. I also provide general oversight of our commercial revenue development, sales pipeline, product management and marketing activities. In addition, I serve as ViaSat's main executive representative to the Wireless Broadband Alliance (WBA), and am the Founder/Group Manager for the Wireless Internet Industry Executives (WIIE) group on LinkedIn. \n \n- - - - - - - - - - - \n \n~ tags \n \n#wifi #wi-fi #hotspots #hotzones #muniwifi #netnearu #nnu #managedservices #wlan #nexcom #aafes #mccs #publicwifi #smbwifi #viasat #exede #vsat #wireless STRATEGIC BUSINESS DEVELOPMENT Google Fiber May 2012  –  April 2013  (1 year) San Francisco Bay Area Collaborated on indoor /outdoor Wi-Fi strategy for Google Fiber team. Drove Wi-Fi business development efforts, including leading the RFP and project teams for providing Wi-Fi at Starbucks stores across the U.S. Worked closely with engineering and operations teams to implement and deliver Google wireless solutions in the marketplace. Created and executed partner strategies that both anticipated trends in an endlessly changing marketplace and directly resulted in revenue acceleration and long term competitive advantage for Google. Initiated efforts across the industry and with partners to further develop applications, use cases and devices; including collaboration with other Google organizations with similar objectives. PRESIDENT / MANAGEMENT CONSULTANT BCG November 2010  –  May 2012  (1 year 7 months) Austin, Texas Area Served as management consultant assisting major carriers and service providers including Google Fiber, Time Warner Cable (TWC), Cox Cable, Mobilitie, Tengo Internet, and Pronto Networks with their mobile internet, Wi-Fi and micro-network product strategies, product development, market sizing, and business development. Identified and clarified customer requirements for development of new service offerings, and assessment of the market opportunity. Researched and validated large scale trends impacting demand. Performed financial modeling to determine high level summary of costs, revenues, IRR and lessons learned. Initiated RFP/RFIs, negotiations and contract administration with vendors. Worked with account teams to identify sales opportunities and account plans. Engaged with customer executives to position the product/service and commercial models. Led strategic sales opportunities on behalf of the broader solutions teams. \n \nAccomplishments: \n \n• Assisted TWC on their go-to-market strategy for Wi-Fi hotzones and SMB monetization strategies. \n• Facilitated Wi-Fi product RFP and product development for Cox Cable San Diego. \n• Developed new market segment for Tengo Internet to sell managed services to carriers. \n• Established key partnerships at Mobilitie for cellular-to-Wi-Fi offloading with major mobile operators. VP, GLOBAL SALES & MARKETING HarborLink November 2010  –  October 2011  (1 year) Greater San Diego Area 1-year retainer management consultant position with full P&L responsibility for day-to-day sales and marketing operations. Provided leadership for all functions to meet key performance indicators, ensuring business interests were met and in compliance with all requirements. Secured partnerships for the deployment of HarborLink's managed Wi-Fi services into several key verticals, as well as establishing roaming and advertising partnerships. Facilitated team member commitment to new products for significant increase in profits. Drafted and negotiated Master Service Agreements, marketing plans and press releases with telecom carriers, independent contractors and other vendors. \n \nAccomplishments: \n \n• Drove significant increase in sales as both an individual contributor and management of sales teams. \n• Nurtured dozens of new partnerships with carriers, aggregators and advertisers. \n• Increased brand awareness globally by successfully managing a creative marketing team.  \n• Lead web/print development, advertising, marketing collateral and PR initiatives. DIRECTOR, STRATEGIC BUSINESS DEVELOPMENT AT&T WiFi Services (formerly Wayport) November 2004  –  October 2010  (6 years) Austin, Texas Area Executed strategic planning and supported cross-functional teams in charge of new, large-scale managed services deployments for public/private Wi-Fi networks, transport and data applications at major hotels, airports, hospitals, restaurants and retail venues, including McDonald’s, Starbucks, Marriott, Hilton, Sam’s Club and others. Led business development for roaming agreements with multi-national carriers and consumer device partners including Verizon, Sprint, T-Mobile, MetroPCS, Leap/Cricket, BT, Deutsche Telekom, China Telecom, Telmex, Nintendo, Sony, Amazon, Barnes & Noble, Nikon, Boingo, iPass, ComFone, Eye-Fi, and many others. \n \nAccomplishments: \n \n• Drove new managed service sales through effective leadership of cross-functional teams. \n• Closed largest device WiFi roaming deals in the industry (worth $8MM) with Microsoft and Nintendo. \n• Instrumental in developing product & go-to-market strategy for self-install, cloud-based managed WiFi.  \n• Led creation of new sales team for healthcare; now one of most lucrative channels for AT&T Wi-Fi. SENIOR DIRECTOR, CARRIER SALES Level 3 Communications August 1996  –  November 2004  (8 years 4 months) Austin, Texas Area Worked for various companies which are now part of Level 3 Communications \n \n• Global Crossing (4/2003-11/2004) \n• Dynegy Connect (1/2002-4/2003) \n• IXC Communications/ Broadwing, Inc. (8/1996-1/2002) \n \nAs both a sales leader managing direct reports and as an individual contributor for larger strategic deals, developed and implemented the largest and most strategic initiatives and equity deals with executive staff, including multi-million dollar domestic and trans-oceanic leased capacity and dark fiber projects. Led teams ranging from 8-15 sales executives responsible for driving more than $100M annualized revenue. Drove customized network solutions for global strategic accounts, including competitive local exchange carriers (CLECs), Internet Service Providers (ISPs), cable operators, content distribution companies, resellers and brokers such as Verizon Business (formerly MCI Worldcom), Bell Canada, AT&T (formerly Ameritech), Cable & Wireless, Colt, Belgacom SA, Orange Business Services, BT Group, Telefonica, Deutsche Telekom, Universal Access, Looking Glass (now part of Level 3), FiberNet, OnFiber (now part of Level 3), Progress Telecom (now part of Level 3), C3 Communications and many others. \n \nAccomplishments: \n \n• Facilitated 5-year $264M contract with UUNET for multiple 10GbE/OC-192s circuits.  \n• Assisted in negotiations of $200M buy/sell agreement with Bell Canada/Teleglobe.  \n• Closed largest transport opportunity with Bell Canada valued at $5M \n• Signed largest data center co-location opportunity with OnFiber valued at $2.5M \n• Top Ranked status at 180% of plan in 2003 & 2004 NATIONAL SALES MANAGER Telecom Client Services, inc. October 1994  –  August 1996  (1 year 11 months) Austin, Texas Area SENIOR SALES EXECUTIVE - KEY ACCOUNTS Dell June 1993  –  October 1994  (1 year 5 months) Austin, Texas Area MARKETING MANAGER Dell January 1992  –  June 1993  (1 year 6 months) Austin, Texas Area PRESIDENT / FOUNDER Instant Insight February 1989  –  January 1992  (3 years) VP, SALES AND BUSINESS DEVELOPMENT - WIRELESS SERVICES ViaSat Inc. April 2013  – Present (2 years 5 months) Greater Dallas Area ViaSat's Wireless Services division (formerly NetNearU) -- has been an expert in public Wi-Fi network management for 17 years, and is one of the largest service providers of Wi-Fi in the world. Our seasoned team has developed deep industry knowledge and a best practice approach that ensures our customers’ long-term success.  \n \nViaSat currently serves more than 100,000+ in-building, outdoor and in-flight Wi-Fi networks, totaling more than 10 million APs, including military bases, office buildings, stadiums, hotels, hospitals, retail chains, restaurants, city-wide deployments, and everything in between. We are also an underlying service provider for telecom, mobile operator and cable service providers, commercial airlines, and other partners worldwide, including Comcast, Time Warner, Sprint, Cablevision, CableLabs, Level 3, American Tower, U.S Navy, Marines, Army, Air Force, Virgin America, Jet Blue, United Airlines and others. \n \nWe provide flexible, comprehensive solutions for these customers so they can deliver their own unique branded experience any mobile device. Each unique and diverse experience has prepared our company to transform any complex Wi-Fi challenge into a simple and strategic solution. Our TRACKOS™ cloud-based management platform allows partners to easily customize portal pages, AAA, roaming, advertising, analytics and more. \n \nAs a member of the leadership team, I help define our business units mission and direction. I also provide general oversight of our commercial revenue development, sales pipeline, product management and marketing activities. In addition, I serve as ViaSat's main executive representative to the Wireless Broadband Alliance (WBA), and am the Founder/Group Manager for the Wireless Internet Industry Executives (WIIE) group on LinkedIn. \n \n- - - - - - - - - - - \n \n~ tags \n \n#wifi #wi-fi #hotspots #hotzones #muniwifi #netnearu #nnu #managedservices #wlan #nexcom #aafes #mccs #publicwifi #smbwifi #viasat #exede #vsat #wireless VP, SALES AND BUSINESS DEVELOPMENT - WIRELESS SERVICES ViaSat Inc. April 2013  – Present (2 years 5 months) Greater Dallas Area ViaSat's Wireless Services division (formerly NetNearU) -- has been an expert in public Wi-Fi network management for 17 years, and is one of the largest service providers of Wi-Fi in the world. Our seasoned team has developed deep industry knowledge and a best practice approach that ensures our customers’ long-term success.  \n \nViaSat currently serves more than 100,000+ in-building, outdoor and in-flight Wi-Fi networks, totaling more than 10 million APs, including military bases, office buildings, stadiums, hotels, hospitals, retail chains, restaurants, city-wide deployments, and everything in between. We are also an underlying service provider for telecom, mobile operator and cable service providers, commercial airlines, and other partners worldwide, including Comcast, Time Warner, Sprint, Cablevision, CableLabs, Level 3, American Tower, U.S Navy, Marines, Army, Air Force, Virgin America, Jet Blue, United Airlines and others. \n \nWe provide flexible, comprehensive solutions for these customers so they can deliver their own unique branded experience any mobile device. Each unique and diverse experience has prepared our company to transform any complex Wi-Fi challenge into a simple and strategic solution. Our TRACKOS™ cloud-based management platform allows partners to easily customize portal pages, AAA, roaming, advertising, analytics and more. \n \nAs a member of the leadership team, I help define our business units mission and direction. I also provide general oversight of our commercial revenue development, sales pipeline, product management and marketing activities. In addition, I serve as ViaSat's main executive representative to the Wireless Broadband Alliance (WBA), and am the Founder/Group Manager for the Wireless Internet Industry Executives (WIIE) group on LinkedIn. \n \n- - - - - - - - - - - \n \n~ tags \n \n#wifi #wi-fi #hotspots #hotzones #muniwifi #netnearu #nnu #managedservices #wlan #nexcom #aafes #mccs #publicwifi #smbwifi #viasat #exede #vsat #wireless STRATEGIC BUSINESS DEVELOPMENT Google Fiber May 2012  –  April 2013  (1 year) San Francisco Bay Area Collaborated on indoor /outdoor Wi-Fi strategy for Google Fiber team. Drove Wi-Fi business development efforts, including leading the RFP and project teams for providing Wi-Fi at Starbucks stores across the U.S. Worked closely with engineering and operations teams to implement and deliver Google wireless solutions in the marketplace. Created and executed partner strategies that both anticipated trends in an endlessly changing marketplace and directly resulted in revenue acceleration and long term competitive advantage for Google. Initiated efforts across the industry and with partners to further develop applications, use cases and devices; including collaboration with other Google organizations with similar objectives. STRATEGIC BUSINESS DEVELOPMENT Google Fiber May 2012  –  April 2013  (1 year) San Francisco Bay Area Collaborated on indoor /outdoor Wi-Fi strategy for Google Fiber team. Drove Wi-Fi business development efforts, including leading the RFP and project teams for providing Wi-Fi at Starbucks stores across the U.S. Worked closely with engineering and operations teams to implement and deliver Google wireless solutions in the marketplace. Created and executed partner strategies that both anticipated trends in an endlessly changing marketplace and directly resulted in revenue acceleration and long term competitive advantage for Google. Initiated efforts across the industry and with partners to further develop applications, use cases and devices; including collaboration with other Google organizations with similar objectives. PRESIDENT / MANAGEMENT CONSULTANT BCG November 2010  –  May 2012  (1 year 7 months) Austin, Texas Area Served as management consultant assisting major carriers and service providers including Google Fiber, Time Warner Cable (TWC), Cox Cable, Mobilitie, Tengo Internet, and Pronto Networks with their mobile internet, Wi-Fi and micro-network product strategies, product development, market sizing, and business development. Identified and clarified customer requirements for development of new service offerings, and assessment of the market opportunity. Researched and validated large scale trends impacting demand. Performed financial modeling to determine high level summary of costs, revenues, IRR and lessons learned. Initiated RFP/RFIs, negotiations and contract administration with vendors. Worked with account teams to identify sales opportunities and account plans. Engaged with customer executives to position the product/service and commercial models. Led strategic sales opportunities on behalf of the broader solutions teams. \n \nAccomplishments: \n \n• Assisted TWC on their go-to-market strategy for Wi-Fi hotzones and SMB monetization strategies. \n• Facilitated Wi-Fi product RFP and product development for Cox Cable San Diego. \n• Developed new market segment for Tengo Internet to sell managed services to carriers. \n• Established key partnerships at Mobilitie for cellular-to-Wi-Fi offloading with major mobile operators. PRESIDENT / MANAGEMENT CONSULTANT BCG November 2010  –  May 2012  (1 year 7 months) Austin, Texas Area Served as management consultant assisting major carriers and service providers including Google Fiber, Time Warner Cable (TWC), Cox Cable, Mobilitie, Tengo Internet, and Pronto Networks with their mobile internet, Wi-Fi and micro-network product strategies, product development, market sizing, and business development. Identified and clarified customer requirements for development of new service offerings, and assessment of the market opportunity. Researched and validated large scale trends impacting demand. Performed financial modeling to determine high level summary of costs, revenues, IRR and lessons learned. Initiated RFP/RFIs, negotiations and contract administration with vendors. Worked with account teams to identify sales opportunities and account plans. Engaged with customer executives to position the product/service and commercial models. Led strategic sales opportunities on behalf of the broader solutions teams. \n \nAccomplishments: \n \n• Assisted TWC on their go-to-market strategy for Wi-Fi hotzones and SMB monetization strategies. \n• Facilitated Wi-Fi product RFP and product development for Cox Cable San Diego. \n• Developed new market segment for Tengo Internet to sell managed services to carriers. \n• Established key partnerships at Mobilitie for cellular-to-Wi-Fi offloading with major mobile operators. VP, GLOBAL SALES & MARKETING HarborLink November 2010  –  October 2011  (1 year) Greater San Diego Area 1-year retainer management consultant position with full P&L responsibility for day-to-day sales and marketing operations. Provided leadership for all functions to meet key performance indicators, ensuring business interests were met and in compliance with all requirements. Secured partnerships for the deployment of HarborLink's managed Wi-Fi services into several key verticals, as well as establishing roaming and advertising partnerships. Facilitated team member commitment to new products for significant increase in profits. Drafted and negotiated Master Service Agreements, marketing plans and press releases with telecom carriers, independent contractors and other vendors. \n \nAccomplishments: \n \n• Drove significant increase in sales as both an individual contributor and management of sales teams. \n• Nurtured dozens of new partnerships with carriers, aggregators and advertisers. \n• Increased brand awareness globally by successfully managing a creative marketing team.  \n• Lead web/print development, advertising, marketing collateral and PR initiatives. VP, GLOBAL SALES & MARKETING HarborLink November 2010  –  October 2011  (1 year) Greater San Diego Area 1-year retainer management consultant position with full P&L responsibility for day-to-day sales and marketing operations. Provided leadership for all functions to meet key performance indicators, ensuring business interests were met and in compliance with all requirements. Secured partnerships for the deployment of HarborLink's managed Wi-Fi services into several key verticals, as well as establishing roaming and advertising partnerships. Facilitated team member commitment to new products for significant increase in profits. Drafted and negotiated Master Service Agreements, marketing plans and press releases with telecom carriers, independent contractors and other vendors. \n \nAccomplishments: \n \n• Drove significant increase in sales as both an individual contributor and management of sales teams. \n• Nurtured dozens of new partnerships with carriers, aggregators and advertisers. \n• Increased brand awareness globally by successfully managing a creative marketing team.  \n• Lead web/print development, advertising, marketing collateral and PR initiatives. DIRECTOR, STRATEGIC BUSINESS DEVELOPMENT AT&T WiFi Services (formerly Wayport) November 2004  –  October 2010  (6 years) Austin, Texas Area Executed strategic planning and supported cross-functional teams in charge of new, large-scale managed services deployments for public/private Wi-Fi networks, transport and data applications at major hotels, airports, hospitals, restaurants and retail venues, including McDonald’s, Starbucks, Marriott, Hilton, Sam’s Club and others. Led business development for roaming agreements with multi-national carriers and consumer device partners including Verizon, Sprint, T-Mobile, MetroPCS, Leap/Cricket, BT, Deutsche Telekom, China Telecom, Telmex, Nintendo, Sony, Amazon, Barnes & Noble, Nikon, Boingo, iPass, ComFone, Eye-Fi, and many others. \n \nAccomplishments: \n \n• Drove new managed service sales through effective leadership of cross-functional teams. \n• Closed largest device WiFi roaming deals in the industry (worth $8MM) with Microsoft and Nintendo. \n• Instrumental in developing product & go-to-market strategy for self-install, cloud-based managed WiFi.  \n• Led creation of new sales team for healthcare; now one of most lucrative channels for AT&T Wi-Fi. DIRECTOR, STRATEGIC BUSINESS DEVELOPMENT AT&T WiFi Services (formerly Wayport) November 2004  –  October 2010  (6 years) Austin, Texas Area Executed strategic planning and supported cross-functional teams in charge of new, large-scale managed services deployments for public/private Wi-Fi networks, transport and data applications at major hotels, airports, hospitals, restaurants and retail venues, including McDonald’s, Starbucks, Marriott, Hilton, Sam’s Club and others. Led business development for roaming agreements with multi-national carriers and consumer device partners including Verizon, Sprint, T-Mobile, MetroPCS, Leap/Cricket, BT, Deutsche Telekom, China Telecom, Telmex, Nintendo, Sony, Amazon, Barnes & Noble, Nikon, Boingo, iPass, ComFone, Eye-Fi, and many others. \n \nAccomplishments: \n \n• Drove new managed service sales through effective leadership of cross-functional teams. \n• Closed largest device WiFi roaming deals in the industry (worth $8MM) with Microsoft and Nintendo. \n• Instrumental in developing product & go-to-market strategy for self-install, cloud-based managed WiFi.  \n• Led creation of new sales team for healthcare; now one of most lucrative channels for AT&T Wi-Fi. SENIOR DIRECTOR, CARRIER SALES Level 3 Communications August 1996  –  November 2004  (8 years 4 months) Austin, Texas Area Worked for various companies which are now part of Level 3 Communications \n \n• Global Crossing (4/2003-11/2004) \n• Dynegy Connect (1/2002-4/2003) \n• IXC Communications/ Broadwing, Inc. (8/1996-1/2002) \n \nAs both a sales leader managing direct reports and as an individual contributor for larger strategic deals, developed and implemented the largest and most strategic initiatives and equity deals with executive staff, including multi-million dollar domestic and trans-oceanic leased capacity and dark fiber projects. Led teams ranging from 8-15 sales executives responsible for driving more than $100M annualized revenue. Drove customized network solutions for global strategic accounts, including competitive local exchange carriers (CLECs), Internet Service Providers (ISPs), cable operators, content distribution companies, resellers and brokers such as Verizon Business (formerly MCI Worldcom), Bell Canada, AT&T (formerly Ameritech), Cable & Wireless, Colt, Belgacom SA, Orange Business Services, BT Group, Telefonica, Deutsche Telekom, Universal Access, Looking Glass (now part of Level 3), FiberNet, OnFiber (now part of Level 3), Progress Telecom (now part of Level 3), C3 Communications and many others. \n \nAccomplishments: \n \n• Facilitated 5-year $264M contract with UUNET for multiple 10GbE/OC-192s circuits.  \n• Assisted in negotiations of $200M buy/sell agreement with Bell Canada/Teleglobe.  \n• Closed largest transport opportunity with Bell Canada valued at $5M \n• Signed largest data center co-location opportunity with OnFiber valued at $2.5M \n• Top Ranked status at 180% of plan in 2003 & 2004 SENIOR DIRECTOR, CARRIER SALES Level 3 Communications August 1996  –  November 2004  (8 years 4 months) Austin, Texas Area Worked for various companies which are now part of Level 3 Communications \n \n• Global Crossing (4/2003-11/2004) \n• Dynegy Connect (1/2002-4/2003) \n• IXC Communications/ Broadwing, Inc. (8/1996-1/2002) \n \nAs both a sales leader managing direct reports and as an individual contributor for larger strategic deals, developed and implemented the largest and most strategic initiatives and equity deals with executive staff, including multi-million dollar domestic and trans-oceanic leased capacity and dark fiber projects. Led teams ranging from 8-15 sales executives responsible for driving more than $100M annualized revenue. Drove customized network solutions for global strategic accounts, including competitive local exchange carriers (CLECs), Internet Service Providers (ISPs), cable operators, content distribution companies, resellers and brokers such as Verizon Business (formerly MCI Worldcom), Bell Canada, AT&T (formerly Ameritech), Cable & Wireless, Colt, Belgacom SA, Orange Business Services, BT Group, Telefonica, Deutsche Telekom, Universal Access, Looking Glass (now part of Level 3), FiberNet, OnFiber (now part of Level 3), Progress Telecom (now part of Level 3), C3 Communications and many others. \n \nAccomplishments: \n \n• Facilitated 5-year $264M contract with UUNET for multiple 10GbE/OC-192s circuits.  \n• Assisted in negotiations of $200M buy/sell agreement with Bell Canada/Teleglobe.  \n• Closed largest transport opportunity with Bell Canada valued at $5M \n• Signed largest data center co-location opportunity with OnFiber valued at $2.5M \n• Top Ranked status at 180% of plan in 2003 & 2004 NATIONAL SALES MANAGER Telecom Client Services, inc. October 1994  –  August 1996  (1 year 11 months) Austin, Texas Area NATIONAL SALES MANAGER Telecom Client Services, inc. October 1994  –  August 1996  (1 year 11 months) Austin, Texas Area SENIOR SALES EXECUTIVE - KEY ACCOUNTS Dell June 1993  –  October 1994  (1 year 5 months) Austin, Texas Area SENIOR SALES EXECUTIVE - KEY ACCOUNTS Dell June 1993  –  October 1994  (1 year 5 months) Austin, Texas Area MARKETING MANAGER Dell January 1992  –  June 1993  (1 year 6 months) Austin, Texas Area MARKETING MANAGER Dell January 1992  –  June 1993  (1 year 6 months) Austin, Texas Area PRESIDENT / FOUNDER Instant Insight February 1989  –  January 1992  (3 years) PRESIDENT / FOUNDER Instant Insight February 1989  –  January 1992  (3 years) Languages English English English Skills Strategic Partnerships Wireless Mobile Devices Telecommunications WiFi Executive Management New Business Development Mobile Marketing Mobile Technology Sales Management Mobile Communications Broadband Global Business... Direct Sales Mobile Internet Wireless Networking Professional Services Sales Operations Sales Process Mobile Applications Salesforce.com Wireless Broadband Fiber Optics Advertising Sales LinkedIn Telecommunication... Telecommunications... Broadband Access Dark Fiber Inside Sales Mobile Broadband Individual Contributor IEEE 802.11 Broadband Networks Mobile Mobile... Network Operations Professional Networking Sales Support Small Business... Telecommunication... Telecom Infrastructure Telecom Technologies Wireless Solutions Wireless Services Wireless Network Design Cellular Strategic Negotiations Management Cross Functional Team... See 35+     See less Skills  Strategic Partnerships Wireless Mobile Devices Telecommunications WiFi Executive Management New Business Development Mobile Marketing Mobile Technology Sales Management Mobile Communications Broadband Global Business... Direct Sales Mobile Internet Wireless Networking Professional Services Sales Operations Sales Process Mobile Applications Salesforce.com Wireless Broadband Fiber Optics Advertising Sales LinkedIn Telecommunication... Telecommunications... Broadband Access Dark Fiber Inside Sales Mobile Broadband Individual Contributor IEEE 802.11 Broadband Networks Mobile Mobile... Network Operations Professional Networking Sales Support Small Business... Telecommunication... Telecom Infrastructure Telecom Technologies Wireless Solutions Wireless Services Wireless Network Design Cellular Strategic Negotiations Management Cross Functional Team... See 35+     See less Strategic Partnerships Wireless Mobile Devices Telecommunications WiFi Executive Management New Business Development Mobile Marketing Mobile Technology Sales Management Mobile Communications Broadband Global Business... Direct Sales Mobile Internet Wireless Networking Professional Services Sales Operations Sales Process Mobile Applications Salesforce.com Wireless Broadband Fiber Optics Advertising Sales LinkedIn Telecommunication... Telecommunications... Broadband Access Dark Fiber Inside Sales Mobile Broadband Individual Contributor IEEE 802.11 Broadband Networks Mobile Mobile... Network Operations Professional Networking Sales Support Small Business... Telecommunication... Telecom Infrastructure Telecom Technologies Wireless Solutions Wireless Services Wireless Network Design Cellular Strategic Negotiations Management Cross Functional Team... See 35+     See less Strategic Partnerships Wireless Mobile Devices Telecommunications WiFi Executive Management New Business Development Mobile Marketing Mobile Technology Sales Management Mobile Communications Broadband Global Business... Direct Sales Mobile Internet Wireless Networking Professional Services Sales Operations Sales Process Mobile Applications Salesforce.com Wireless Broadband Fiber Optics Advertising Sales LinkedIn Telecommunication... Telecommunications... Broadband Access Dark Fiber Inside Sales Mobile Broadband Individual Contributor IEEE 802.11 Broadband Networks Mobile Mobile... Network Operations Professional Networking Sales Support Small Business... Telecommunication... Telecom Infrastructure Telecom Technologies Wireless Solutions Wireless Services Wireless Network Design Cellular Strategic Negotiations Management Cross Functional Team... See 35+     See less Education Boston University School of Law Executive LL.M. (Masters) in International Business Law,  International Law and Legal Studies 2012  – 2014 Colorado Tech MBA,  Concentration in Marketing & Technology Management 2008  – 2010 The University of Texas at Austin Bachelor of Science,  Concentration in Mass Communications/Radio-TV-Film 1990  – 1996 Crockett High School (Austin, Texas) 1988  – 1988 Round Rock High School (Round Rock, Texas) 1984  – 1987 Boston University School of Law Executive LL.M. (Masters) in International Business Law,  International Law and Legal Studies 2012  – 2014 Boston University School of Law Executive LL.M. (Masters) in International Business Law,  International Law and Legal Studies 2012  – 2014 Boston University School of Law Executive LL.M. (Masters) in International Business Law,  International Law and Legal Studies 2012  – 2014 Colorado Tech MBA,  Concentration in Marketing & Technology Management 2008  – 2010 Colorado Tech MBA,  Concentration in Marketing & Technology Management 2008  – 2010 Colorado Tech MBA,  Concentration in Marketing & Technology Management 2008  – 2010 The University of Texas at Austin Bachelor of Science,  Concentration in Mass Communications/Radio-TV-Film 1990  – 1996 The University of Texas at Austin Bachelor of Science,  Concentration in Mass Communications/Radio-TV-Film 1990  – 1996 The University of Texas at Austin Bachelor of Science,  Concentration in Mass Communications/Radio-TV-Film 1990  – 1996 Crockett High School (Austin, Texas) 1988  – 1988 Crockett High School (Austin, Texas) 1988  – 1988 Crockett High School (Austin, Texas) 1988  – 1988 Round Rock High School (Round Rock, Texas) 1984  – 1987 Round Rock High School (Round Rock, Texas) 1984  – 1987 Round Rock High School (Round Rock, Texas) 1984  – 1987 Honors & Awards ", "Summary Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Summary Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Extensive experience in the online advertising business, creation/management of scalable processes, strategies for operational excellence on large teams and large portfolios, business planning, project management and deployment, and revenue/cost projections. Experience Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (3 months) São Paulo Area, Brazil Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (3 months) São Paulo Area, Brazil Brazil Country Sales Strategy & Operations Manager Google June 2015  – Present (3 months) São Paulo Area, Brazil Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Manager, Sales Operations - Strategy Lead, Latin America Google October 2012  –  May 2015  (2 years 8 months) Brazil Responsible for long term sales strategy and planning for large customers in Latin America, including competition analysis, product & industry prioritization, business/resource planning, cross-function connection and coordination. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Head of Industry - Education Google January 2012  –  October 2012  (10 months) São Paulo Area, Brazil Responsible for a high performance sales team focused on the development of the Brazilian Education Industry, offering customized solutions for lead generation, direct response strategies and brand awareness, while doing market outreach and industry development. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. Team Lead, Online Sales Google April 2011  –  January 2012  (10 months) Manager for the BIM/B2B/Scalable business, new accounts and Industry Analyst teams at Google BR Online Sales.  \nResponsible for a team of XX people, with a portfolio of XXX accounts and $XXXM quota. Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. Sales Strategy Lead, LatAm Online Sales Google May 2010  –  April 2011  (1 year) Responsible for the overall sales and business strategy for the Latam Online Sales team, including business plan development, forecasting, revenue tracking, sales activities reporting and headcount analysis. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Special Project Analyst, Latam Online Sales Google 2008  –  May 2010  (2 years) Creation, development and launch of business projects related to operational efficiency, customer development and revenue tracking for the Latam Online Sales team. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Strategist, AdWords Google 2008  –  2008  (less than a year) São Paulo Area, Brazil Responsible for the launch, education and development of newly acquired high value AdWords customers (independent of industry). Main activities included creation of customer education materials, development of frameworks to maximize account creation process efficiency and pipeline management. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. Account Associate Google 2007  –  2008  (1 year) São Paulo Responsible for the organization and development of the Brazilian Account Strategist team (focused on SMBs). Main attributions included delineating customer strategies, organizing the sharing of best practices among the team, defining main success metrics and team/individual objectives/OKRs and creation of metrics dashboards. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. AdWords Representative Google 2006  –  2007  (1 year) Main tasks included online ad approvals, account troubleshooting, development of internal webpages/tools, training of new team members, and Google Analytics specialist. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Consulting Intern Accenture 2003  –  2004  (1 year) Helped model, develop and test a complex pricing application with several automated features for a major wholesaler chain in Brazil. Skills Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Skills  Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Business Development Marketing Strategy Business Strategy Sales Sales Operations Online Advertising Web Analytics CRM Lead Generation Project Management Business Analysis Marketing Business Planning Management Google Adwords Advertising Digital Marketing Strategy Google Analytics Leadership Team Leadership Competitive Analysis Analytics Training E-commerce Analysis Start-ups Forecasting See 13+     See less Education Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Universidade de São Paulo Electric Engineering Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Duke University GBA - Google Business Academy,  Business Administration and Management , General 2011  – 2012 Cohort program created by Duke University and Google. Universidade de São Paulo Electric Engineering Universidade de São Paulo Electric Engineering Universidade de São Paulo Electric Engineering ", "Experience Operational Efficiency Manager, Americas Sales Operations Google October 2013  – Present (1 year 11 months) North America Lead, Display Ads Sales & Strategy Google September 2012  – Present (3 years) San Francisco Bay Area Media Solutions Lead, New Products & Solutions Google January 2012  –  September 2012  (9 months) Industry Focus: Business & Industrial Markets Display Account Executive, Online Media Sales: Finance Google November 2011  –  December 2011  (2 months) San Francisco Bay Area Display Specialist, Online Media Sales Google July 2010  –  October 2011  (1 year 4 months) From July 2010: Business & Industrial Markets \nFrom April 2011: Financial Services, Business & Industrial Markets Account Manager, Online Sales: Healthcare Google July 2007  –  July 2010  (3 years 1 month) Account Associate Google June 2006  –  June 2007  (1 year 1 month) San Francisco Bay Area Operational Efficiency Manager, Americas Sales Operations Google October 2013  – Present (1 year 11 months) Operational Efficiency Manager, Americas Sales Operations Google October 2013  – Present (1 year 11 months) North America Lead, Display Ads Sales & Strategy Google September 2012  – Present (3 years) San Francisco Bay Area North America Lead, Display Ads Sales & Strategy Google September 2012  – Present (3 years) San Francisco Bay Area Media Solutions Lead, New Products & Solutions Google January 2012  –  September 2012  (9 months) Industry Focus: Business & Industrial Markets Media Solutions Lead, New Products & Solutions Google January 2012  –  September 2012  (9 months) Industry Focus: Business & Industrial Markets Display Account Executive, Online Media Sales: Finance Google November 2011  –  December 2011  (2 months) San Francisco Bay Area Display Account Executive, Online Media Sales: Finance Google November 2011  –  December 2011  (2 months) San Francisco Bay Area Display Specialist, Online Media Sales Google July 2010  –  October 2011  (1 year 4 months) From July 2010: Business & Industrial Markets \nFrom April 2011: Financial Services, Business & Industrial Markets Display Specialist, Online Media Sales Google July 2010  –  October 2011  (1 year 4 months) From July 2010: Business & Industrial Markets \nFrom April 2011: Financial Services, Business & Industrial Markets Account Manager, Online Sales: Healthcare Google July 2007  –  July 2010  (3 years 1 month) Account Manager, Online Sales: Healthcare Google July 2007  –  July 2010  (3 years 1 month) Account Associate Google June 2006  –  June 2007  (1 year 1 month) San Francisco Bay Area Account Associate Google June 2006  –  June 2007  (1 year 1 month) San Francisco Bay Area Skills Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Skills  Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Google Adwords SEM Online Advertising Brand Architecture Brand Awareness Strategy PPC Online Marketing Google Analytics Digital Marketing Display Advertising Search Advertising YouTube Education University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 University of Pennsylvania BA,  Health & Societies , Public Health Concentration 2002  – 2006 ", "Skills Cloud Computing CRM Sales Security SaaS Mobile Advertising PaaS Enterprise Software Go-to-market Strategy Strategic Partnerships Salesforce.com Partner Management Demand Generation Sales Enablement Complex Sales Solution Selling Mobile Devices Business Alliances Lead Generation Customer Acquisition See 5+     See less Skills  Cloud Computing CRM Sales Security SaaS Mobile Advertising PaaS Enterprise Software Go-to-market Strategy Strategic Partnerships Salesforce.com Partner Management Demand Generation Sales Enablement Complex Sales Solution Selling Mobile Devices Business Alliances Lead Generation Customer Acquisition See 5+     See less Cloud Computing CRM Sales Security SaaS Mobile Advertising PaaS Enterprise Software Go-to-market Strategy Strategic Partnerships Salesforce.com Partner Management Demand Generation Sales Enablement Complex Sales Solution Selling Mobile Devices Business Alliances Lead Generation Customer Acquisition See 5+     See less Cloud Computing CRM Sales Security SaaS Mobile Advertising PaaS Enterprise Software Go-to-market Strategy Strategic Partnerships Salesforce.com Partner Management Demand Generation Sales Enablement Complex Sales Solution Selling Mobile Devices Business Alliances Lead Generation Customer Acquisition See 5+     See less "]}